{"result_id": "167020", "URL": "https://infiniteunknown.net/2021/07/22/jab-remorse-so-now-you-are-vaccinated-against-covid-19-40-trillion-packages-of-rna-have-been-injected-that-induce-irreversible-changes-in-your-blood-vessels-now-what/", "timestamp": "2023-04-25 15:37:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://infiniteunknown.net/2021/07/22/jab-remorse-so-now-you-are-vaccinated-against-covid-19-40-trillion-packages-of-rna-have-been-injected-that-induce-irreversible-changes-in-your-blood-vessels-now-what/", "encoding": "UTF-8"}, "image": null, "domain": "infiniteunknown.net", "title": "Jab Remorse: So, Now You Are Vaccinated Against COVID-19. 40 Trillion Packages Of RNA Have Been Injected That Induce Irreversible Changes In Your Blood Vessels. Now What? – Infinite Unknown", "cleaned_text": "So, Now You Are Vaccinated Against COVID-19.\n\n40 Trillion Packages Of RNA Have Been Injected That Induce Irreversible Changes\n\n In Your Blood Vessels.\n\nDepending upon which source of information you believe, your life is in the balance if you make the wrong decision about COVID-19 vaccination.\n\nA problem with what I write today is that the information below, which is essential to know to maintain health following COVID-19 vaccination, may induce more fear and anxiety, which is what is driving the pandemic and the misdirected decisions over COVID-19 vaccination. I’ll explain more about this below.\n\nAccording to Our World Data as of July 20, 2021, 161 million Americans are fully vaccinated out of a population of ~328 million (49.1%).\n\nIt is difficult to understand why anyone would immunize, not with a vaccine, but a 5-times gain-of-function bioweapon, which is what the COVID-19 RNA/DNA vaccines are. But the news media is running a fright campaign that causes people to make health decisions out of fear.\n\nImmediately following vaccination trillions of gene packages will be released from the deltoid muscle where the vaccine needle entered your arm, and will end up wreaking havoc in your blood vessels.\n\nCanadian cardiologist Dr. Charles Hoffe explains the blood clotting threat these vaccines pose: “The blood clots we hear about which the media claim are very rare are the big blood clots which are the ones that cause strokes and show up on CT scans, MRI, etc. The clots I’m talking about are microscopic and too small to find on any scan. They can thus only be detected using the D-dimer test.”\n\nThese spiky proteins stick out, white blood cells (lymphocytes) and antibodies arrive which then attracts blood platelets to form a clot around them.\n\nThese spike proteins can be revealed by a D—dimer test which will reveal these micro-clots. The D-dimer test only reveals recently-formed micro-clots.\n\nCritics say clots are rare among post-vaccine patients, but those are the large clots that result in strokes and heart attacks. According to Dr. Hoffe, a D-dimer test within 4-7 days of vaccination shows 62% of RNA-vaccine immunized patients have an abnormal D-dimer test. These patients become breathless easily.\n\nYour heart now pumps harder to push blood through these blocked capillaries, says Dr. Hoffe. This induces right-sided heart failure within 3 years.\n\nThis is of terrifying concern. The worst is yet to come says Dr. Hoffe. The damage will be cumulative with each shot. Revaccination becomes potentially life threatening.\n\nMicrobiologist Dr. Sucharit Bhakdi displays what is happening in a visual online graphic. The RNA injected into your body are going to enter the cells that line blood vessels. He points to spiny spike protein that these cells will generate and protrude outwards to attract blood platelets and form micro-clots. Days after vaccination, white blood cells known as lymphocytes as well as antibodies will begin to mount an attack against these cells. If you dare to repeat this (get the second jab), “God help you” warns Dr. Bhakdi.\n\nDr. Bhakdi points to lymphocytes (L) and antibodies (AB) that begin to mount an attack against your own blood vessels following RNA/DNA COVID-19 vaccination.\n\nDramatic evidence is presented to show how spike protein induces micro-clots as made visible by fluorescent dye (below).\n\nVarious online sources condemn Dr. Bhakdi’s presentation as misinformation. But it is incontrovertible that the micro-blood clot threat exists. An autopsy study of 20 COVID-19 patients found micro-clots in six of their brains.\n\nAnother authoritative report published in the PLoS One journal states (paraphrased): “Out of 676 COVID-19 patients (140 non-survivors and 536 survivors), the D-Dimer test (degraded fibrin test) was abnormally high (83.2% of non-survivors) versus 44.9% of survivors) and they had an elevated C-reactive protein (CRP) test which measures inflammation (50.4% of non-survivors versus 6.0% of survivors).\n\nD-dimer keeps rising in non-survivors which predicts mortality. D-dimer increases in all age groups with COVID-19. Preventive anti-coagulants (blood thinners) are suggested for these patients.\n\nAre we looking at symptoms of a viral infection or a vitamin deficiency?\n\nCOVID-19 patients exhibit manifestations of cardiovascular disease as evidenced by raised troponin levels (31.6% of severe COVID-19 patients) and a drop in ejection fraction (less blood being pumped by the heart).\n\nA thiamine-B1 deficiency can result in elevated troponin levels (troponins are proteins in heart muscle that regular muscle contraction) and a decline in ejection fraction.\n\nIn response to the need for wound healing the body makes Vascular Endothelial Growth Factor (VEGF), which is a hallmark sign of COVID-19 severity, and is considered a more important indicator of COVID-19 severity than D-dimer. VEGF promotes blood coagulation (clots).\n\nYet beriberi, the disease that emanates from a deficiency of vitamin B1, also can elevate VEGF levels, misleading doctors to think they are staring at a cardiovascular disease emanating from a virus.\n\nThese symptoms arise 3-25 days following initial vaccination. Another reports states: “The most striking initial test finding are highly elevated D-dimer levels.”\n\nThe chart below reveals the survival problem as D-dimer levels rise.\n\nThe zinger: Is it really a virus that is causing your symptoms?\n\nAlmost a third of recovered COVID-19 patients return to the hospital within five months and 1 in 8 die. Inexplicably prolonged symptoms, largely affecting the nervous system, persist among many thousands of patients. This has been called long-haul COVID, “our next national health disaster.”\n\nSymptoms include but are not limited to fatigue, shortness of breath, cough, loss of sense of smell or taste (and hunger), muscle pain (calf muscle), vomiting, crying, fever, constipation, numbness in extremities, burning feet (at night), fast heart rate (tachycardia), loss of reflexes, sweating, foot drop, seizures, coma, and mental confabulations and impairment.\n\nThese symptoms of Long-COVID are the very same symptoms of vitamin B1 (thiamine) deficiency.\n\nSince thiamine levels are very low in the blood and urine levels are not reliable, thiamine deficiency should be confirmed by an enzyme (transketolase) activity.\n\nUnlike all other corona cold viruses, or any viruses, COVID-19 is claimed to produce the very same symptoms as beriberi, a frank vitamin B1 deficiency. Inexplicably, COVID-19 poses a threat to the entire nervous system. B1 deficiency can produce venous thrombosis, blood clots in veins.\n\nThe provision of 200 milligrams of intravenous vitamin B1 (thiamine) in the ICU daily has achieved a 75% reduction in absolute risk for mortality among hospitalized patients. B1 therapy reduced risk for thrombosis (blood clots) by 81%!\n\nRecurrence of COVID-19 following vaccination is explained by thiamine B1 deficiency.\n\nDoctors see COVID-19 through the lens of profit-making\n\nDoctors see COVID-19 through a lens of which insurance billing codes can they employ. Prescription drugs are preferred over natural remedies. Expensive treatments that generate greater profits for doctors are preferred.\n\nAn example of how medical doctors plunder desperate patients to profiteer off of long-haul COVID cases was recently aired on YouTube. One doctor hails another doctor, saying he deserves a Nobel Prize, over taking vitamin B1 deficient patients and running a business of over-testing and selling a $1650 drug instead. This is just another of the many profit-making schemes doctors come up with.\n\nIn a report published in Frontiers in Immunology, the doctor claims a protein marker on the surface of white blood cells, CCR5, dictates the severity and lethality of COVID-19, a problem that is resolved by a $1600 drug. Patients are falling for this doctor’s medicine because they are not savvy enough to understand there are safer and less expensive alternatives, as described herein.\n\nAll of the symptoms the doctor cites as commonly reported among long-duration COVID-19 patients are the same symptoms caused by a vitamin B1 deficiency.\n\nThis author has assembled unequivocal evidence that associates the symptoms attributed to COVID-19 with a vitamin B1 deficiency brought on by changes in the diet during the restrictive lock-down, namely a 500% increase in drinking alcohol at home accompanies by increased consumption of sugary foods and due to sleeplessness, caffeinated beverages (coffee, tea), all food and beverage factors that block vitamin B1 absorption or utilization.\n\n“The greater the severity of a pandemic the greater amount of alcohol consumed by a population.”\n\nOf interest, a patient who lived on frozen blended coffee lattes (molecules in coffee block utilization of vitamin B1) developed the same symptoms seen among long-haul COVID-19 patients.\n\nIn other words, the lock-down and associated fear and anxiety have resulted in a worse epidemic, far more mortal than COVID-19.\n\nThe Great Masquerader: Produces Symptoms Of Every Other Disease\n\nA severe vitamin B1 deficiency is known as beriberi and produces an array of symptoms that masquerade as a broad number of diseases. Combined with an unreliable antibody test for COVID-19 that produces many false-positive tests, gives many individuals the false impression they have a viral infection rather than a dietary deficiency.\n\nVitamin B1 controls the autonomic nervous system, body functions that operate automatically such as breathing, heartbeat, digestion/elimination and immunity. A deficiency of B1 can induce via the hypothalamus in the brain, a fever, vomiting, diarrhea and breathlessness, symptoms commonly associated with the flu or a viral infection.\n\nThe fact that COVID-19 cases unusually don’t produce a cytokine storm in the lungs like pneumonia and tuberculosis do, suggests this is not a viral epidemic. Doctors are perplexed by these recurrent symptoms but cannot fathom it is a dietary deficiency disease induced by fear, anxiety and the lockdown.\n\nGenerally, upper and lower respiratory tract viral infections induce specific antibodies after 7-10 days and the infection subsides.\n\nA vitamin B1 deficiency that comes and goes would explain the unusual symptomatic relapses COVID-19 patients report. One study of COVID-19 patients with severe symptoms found 15.6% were vitamin B1 deficient (26.3% among diabetics with COVID-19), sufficient enough to start a pandemic.\n\nThiamine deficiency disease is associated with an almost 50% increase in mortality. Vitamin B1 should be routinely administered to critically ill patients.\n\nTo relieve your fears, you may not have COVID at all. A positive PCR test for COVID-19 is fraught with problems. Halt all the alcohol, coffee, tea, and take vitamin B1 supplements, preferably in fat-soluble form (benfotiamine, allithiamine), as directed on the bottle. Don’t be fooled by thiamine-B1 deficiency like doctors are.\n\nWhat are the lessons from this information?\n• Avoid the 2nd shot if you have not already done so.\n• I don’t recommend a D-dimer test within 4-7 days of vaccination because it is just going to increase anxiety. The best thing to do is take preventive action. Recognize the healthcare system does not have enough problematic blood thinning drugs or the capacity to deal with 161 million vaccinated Americans who have been vaccinated the RNA/DNA vaccines.\n\nHealthy individuals have D-dimer levels less than 0.5 micrograms/ milliliter of blood. COVID-19 is resistant to normal breakdown of fibrin that combined with blood platelets, plugs bleeding wounds.\n• Take action on your own to prevent micro-clots from forming in the blood vessels throughout your body, as follows:\n\nA diet comprised of garlic, onion, tomato, shiitake, rice bran, kale, blueberry, pineapples, and/or turmeric powder, has been shown to reduce D-dimer levels. Fish oil and garlic inhibit the clumping of blood platelets, but not necessarily reduce D-dimer.\n\nIt comes as no surprise to learn that the red wine molecule resveratrol, which was identified as a key component of in the French Paradox (the fact the French ate fattier foods and had higher blood cholesterol levels but far lower rates of mortality from heart disease) was attributed to its ability to inhibit blood clots in coronary arteries. Resveratrol is identified as a primary preventive agent, particularly in regard to elevated D-dimer levels. Resveratrol also reduces VEGF levels. Resveratrol remarkably blocks all known pathways to COVID-19 morbidity and mortality.\n\nA most remarkable way to reduce micro-clots is to break them up enzymatically. If you are in an ambulance with a potentially mortal blockage of a coronary artery that supplies your heart with oxygen, a paramedic may inject an enzyme/drug, streptokinase, to break up that potentially life-threatening clot.\n\nAn off-the-shelf enzyme that breaks up blood clots is nattokinase and is as effective and safe as streptokinase.\n\nNattokinase is derived from fermented soybean natto cheese, popular in Japan. Nattokinase is available as a natural remedy in health shops. A single dose (2000 fibrinolytic units or FU) works for up to 8-12 hours following oral ingestion and is superior in some ways to anti-clotting drugs. In milligrams, a 200-400 mg dose is sufficient and directly breaks up fibrin clots which comprise what is measured in the D-Dimer test.\n\nIdeally nattokinase should be taken on an empty stomach without other accompanying medicines or dietary supplements. Of interest, D-dimer levels may artificially rise when taking nattokinase because of its enzymatic action to break up blood clots. Inform your doctor of this if he/she orders blood tests.\n\nIn 1990 Nobel Prize laureate Linus Pauling and Matthias Rath (still living) published a report about a discovery that humans, who do not internally produce vitamin C like most other animals do, fail to properly repair the endothelial cells that line blood vessels and that a circulating fatty protein called lipoprotein(a), a type of low-density (LDL) cholesterol particle, acts as a surrogate for vitamin C within the arterial wall. The problem is, Liprotein(a) is a “sticky bandage.” It attracts blood platelets to form blood clots. Dr. Rath even published a book showing animals that internally make vitamin C don’t develop blood-clot heart attacks like humans do.\n\nThe need to employ vitamin C to prevent blood clots within arteries intensifies among RNA/DNA vaccinated subjects.\n\nA person doesn’t attempt to lower their Lp(a) levels, they just maintain high blood levels of vitamin C so the Lp(a) doesn’t stick into arterial walls. Animals convert their blood sugar (glucose made in the liver) to vitamin C enzymatically in the liver, but a key enzyme is missing in humans (gulonolactone oxidase). So, humans must totally rely on their diet for vitamin C.\n\nOnly vitamin C supplement users have high enough vitamin C blood levels to approximate what humans once produced internally before a gene mutation nixed this process.\n\nAmong people that are healthy (take no vitamin C-depleting drugs like aspirin or steroids) and have no viral or bacterial infections that increase demand for vitamin C), 500 milligrams of supplemental vitamin taken in divided doses every 4 hours would maintain healthy levels of vitamin C. More is needed when ill or fighting a chronic problem like vaccine-induced spike proteins.\n\nA recent advancement developed by this author is a nutraceutical that doubles internal levels of vitamin C, theoretically correcting the inherited gene mutation, without having to take vitamin C itself. Urine and blood tests conducted by independent researcher Dr. Tom Levy, the reigning authority on vitamin C, proved vitamin C levels are elevated with a product called FORMULA-216. Dr. Levy describes spike protein as being akin to porcupine quills.\n\nGiven that humans can’t take vitamin C supplements during sleep, this would be a godsend for vaccinated individuals who want to avoid blood clots forming during sleep. A bedtime dose is suggested.\n\nDon’t wait on doctors to save your life. If you are vaccinated with RNA/DNA COVID-19 vaccines, you need take preventive steps to maintain your health, for the remainder of your life.\n\nPayPal: Donate in USD\n\n PayPal: Donate in EUR \n\n PayPal: Donate in GBP", "opengraph": {}, "tags": ["Climate Change", "Fed", "Muslims", "Global Warming", "Terrorism", "Nuclear reactors", "China", "Society", "U.S.", "Japan", "EU", "Global News", "Donald Trump", "Nuclear", "Obama administration", "Economy", "Technology", "Military", "U.K.", "Science", "Germany", "Sex", "New World Order", "Islam", "Syria", "Russia", "Banking", "Middle East", "Radiation", "Israel", "Health", "Europe", "Global Cooling", "Environment", "Crime", "Debt", "Collapse", "Migrant Crisis", "Federal Reserve", "Politics", "Fukushima", "Government", "Trump administration", "Barack Obama", "Food"], "tweets": [], "movies": [], "links": ["https://www.lewrockwell.com/2021/07/no_author/jab-remorse/", "https://www.google.com/search?q=how+many+americans+vaccinated+covid-19&oq=how+many+americans+vaccinated+covid-19&aqs=chrome..69i57.13136j0j1&sourceid=chrome&ie=UTF-8", "https://www.youtube.com/watch?v=YeW5sI-R1Qg", "https://www.bitchute.com/embed/ChQwQBggc8TL", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3226127/", "https://www.baptisthealth.com/services/heart-care/conditions/right-sided-heart-failure", "https://factcheckvaccine.com/2021/07/an-urgent-message-from-professor-dr-sucharit-bhakdi-july-9-2021/", "https://infiniteunknown.net/wp-content/uploads/2021/07/Picture12-620x315-1.png", "https://factcheckvaccine.com/2021/07/an-urgent-message-from-professor-dr-sucharit-bhakdi-july-9-2021", "https://www.researchgate.net/figure/Representative-fluorescence-micrographs-of-purified-fluorescent-Alexa-Fluor488_fig2_349910452", "https://infiniteunknown.net/wp-content/uploads/2021/07/Screenshot-2021-07-20-224446-620x335-1.jpg", "https://www.researchgate.net/publication/341582169_Pathophysiology_of_SARS-CoV-2_targeting_of_endothelial_cells_renders_a_complex_disease_with_thrombotic_microangiopathy_and_aberrant_immune_response_The_Mount_Sinai_COVID-19_autopsy_experience", "https://journals.plos.org/plosone/article/figure?id=10.1371/journal.pone.0242045.g001", "https://pubmed.ncbi.nlm.nih.gov/32997543/", "https://pubmed.ncbi.nlm.nih.gov/34276884/", "https://pubmed.ncbi.nlm.nih.gov/33836911/", "https://labtestsonline.org/tests/troponin#:~:text=Troponins%20are%20a%20group%20of,troponin%20T%2C%20and%20troponin%20I.", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6543258/", "https://ccforum.biomedcentral.com/articles/10.1186/s13054-020-03079-y", "https://pubmed.ncbi.nlm.nih.gov/22504253/", "https://infiniteunknown.net/wp-content/uploads/2021/07/Picture2.png", "https://pubmed.ncbi.nlm.nih.gov/34138513/", "https://infiniteunknown.net/wp-content/uploads/2021/07/Screenshot-2021-07-20-224627-620x443-1.jpg", "https://ncrc.jhsph.edu/research/epidemiology-of-post-covid-syndrome-following-hospitalisation-with-coronavirus-a-retrospective-cohort-study/", "https://www.cidrap.umn.edu/news-perspective/2021/07/studies-elucidate-poorly-understood-long-covid", "https://www.nejm.org/doi/full/10.1056/NEJMp2109285", "https://bjgp.org/content/bjgp/early/2021/06/28/BJGP.2021.0301.full.pdf", "https://medlineplus.gov/genetics/condition/thiamine-responsive-megaloblastic-anemia-syndrome/", "https://journals.sagepub.com/doi/pdf/10.1177/1533210110392941", "https://pubmed.ncbi.nlm.nih.gov/32506549/", "https://ccforum.biomedcentral.com/articles/10.1186/s13054-021-03648-9", "https://pubmed.ncbi.nlm.nih.gov/33113040/", "https://www.youtube.com/watch?v=JwjJs5ZHKJI", "https://www.frontiersin.org/articles/10.3389/fimmu.2021.700782/full", "https://en.wikipedia.org/wiki/CCR5#:~:text=C%2DC%20chemokine%20receptor%20type%205,position%2021%20on%20chromosome%203.", "https://www.goodrx.com/maraviroc", "https://www.frontiersin.org/files/Articles/700782/fimmu-12-700782-HTML-r1/image_m/fimmu-12-700782-g001.jpg", "https://infiniteunknown.net/wp-content/uploads/2021/07/Picture31-620x346-1.png", "https://www.lewrockwell.com/2020/11/bill-sardi/if-covid-19-isnt-killing-americans-what-is/", "https://www.frontiersin.org/articles/10.3389/fpsyt.2020.581113/full", "https://pubmed.ncbi.nlm.nih.gov/33836911/", "https://www.cnn.com/2020/05/26/health/antibody-tests-cdc-coronavirus-wrong/index.html", "https://medicine.wustl.edu/news/study-respiratory-failure-in-covid-19-patients-usually-not-driven-by-cytokine-storm/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7326402/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7608766/", "https://pubmed.ncbi.nlm.nih.gov/33448683/", "https://pubmed.ncbi.nlm.nih.gov/33448683/", "https://infiniteunknown.net/wp-content/uploads/2021/07/Picture41-620x366-1.png", "https://www.hytest.fi/resources/technotes/d-dimer-and-high-molecular-weight-fibrin-degradation-products-technotes?gclid=EAIaIQobChMI_7SFyJ_y8QIVb_zjBx0lKgE2EAMYASAAEgIyvfD_BwE", "https://pubmed.ncbi.nlm.nih.gov/26333154/", "ttps://pubmed.ncbi.nlm.nih.gov/1351198/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7915700/", "https://pubmed.ncbi.nlm.nih.gov/30525561/", "https://www.resveratrolnews.com/resveratrol-and-covid-19-coronavirus/1983/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4479826/", "https://www.clinicaleducation.org/resources/reviews/potent-natural-fibrinolytic-enzymes-safely-reduce-clotting-risk/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6043915/", "https://pubmed.ncbi.nlm.nih.gov/24862625/", "https://pubmed.ncbi.nlm.nih.gov/2143582/", "https://pubmed.ncbi.nlm.nih.gov/2147514/", "https://www.amazon.com/Animals-Attacks-People-Fourth-Revised/dp/0967954681/ref=sr_1_1?dchild=1&keywords=matthias+rath+animals+heart+attacks&qid=1626802148&s=books&sr=1-1", "https://www.peakenergy.com/articles/omns20210621/Resolving-Long-Haul-COVID-and-Vaccine-Toxicity:-Neutralizing-the-Spike-Protein", "https://www.abebooks.com/Curing-Incurable-Vitamin-Infectious-Diseases-Toxins/30947067594/bd?cm_mmc=ggl-_-US_Shopp_Textbook-_-product_id=COM9780977952021USED-_-keyword=&gclid=EAIaIQobChMIxJfPrZjy8QIVRP7jBx0Y2wRAEAQYAyABEgIP8_D_BwE", "https://formula216.com/", "http://www.doctoryourself.com/omns/v17n15.shtml", "https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=infiniteunknown23@googlemail.com&item_name=Thanks%20for%20supporting%20Infinite%20Unknown&no_shipping=1&no_note=1&tax=0&currency_code=USD&lc=GB&bn=PP-DonationsBF&charset=UTF-8", "https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=infiniteunknown23@googlemail.com&item_name=Thanks%20for%20supporting%20Infinite%20Unknown&no_shipping=1&no_note=1&tax=0&currency_code=EUR&lc=GB&bn=PP-DonationsBF&charset=UTF-8", "https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=infiniteunknown23@googlemail.com&item_name=Thanks%20for%20supporting%20Infinite%20Unknown&no_shipping=1&no_note=1&tax=0&currency_code=GBP&lc=GB&bn=PP-DonationsBF&charset=UTF-8"], "authors": ["Infinite"], "publish_date": "2021-07-22T14:54:49-08:00"}