{"result_id": "167033", "URL": "https://infiniteunknown.net/2021/09/", "timestamp": "2023-04-25 15:38:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://infiniteunknown.net/2021/09/", "encoding": "UTF-8"}, "image": null, "domain": "infiniteunknown.net", "title": "September 2021 – Infinite Unknown", "cleaned_text": "YouTube is taking down several video channels associated with high-profile anti-vaccine activists including Joseph Mercola and Robert F. Kennedy Jr., who experts say are partially responsible for helping seed the skepticism that’s contributed to slowing vaccination rates across the country.\n\nAs part of a new set of policies aimed at cutting down on anti-vaccine content on the Google-owned site, YouTube will ban any videos that claim that commonly used vaccines approved by health authorities are ineffective or dangerous. The company previously blocked videos that made those claims about coronavirus vaccines, but not ones for other vaccines like those for measles or chickenpox.\n\nMisinformation researchers have for years said the popularity of anti-vaccine content on YouTube was contributing to growing skepticism of lifesaving vaccines in the United States and around the world. Vaccination rates have slowed and about 56 percent of the U.S. population has had two shots, compared with 71 percent in Canada and 67 percent in the United Kingdom. In July, President Biden said social media companies were partially responsible for spreading misinformation about the vaccines, and need to do more to address the issue.\n\nThe change marks a shift for the social media giant, which streams more than 1 billion hours’ worth of content every day. Like its peers Facebook and Twitter, the company has long resisted policing content too heavily, arguing maintaining an open platform is critical to free speech. But as the companies increasingly come under fire from regulators, lawmakers and regular users for contributing to social ills — including vaccine skepticism — YouTube is again changing policies that it has held onto for months.\n\nYouTube didn’t act sooner because it was focusing on misinformation specifically about coronavirus vaccines, said Matt Halprin, YouTube’s vice president of global trust and safety. When it noticed that incorrect claims about other vaccines were contributing to fears about the coronavirus vaccines, it expanded the ban.\n\n“Developing robust policies takes time,” Halprin said. “We wanted to launch a policy that is comprehensive, enforceable with consistency and adequately addresses the challenge.”\n\nMercola, an alternative medicine entrepreneur, and Kennedy, a lawyer and the son of Sen. Robert F. Kennedy who has been a face of the anti-vaccine movement for years, have both said in the past that they are not automatically against all vaccines, but believe information about the risks of vaccines is being suppressed.\n\nPayPal: Donate in USD\n\n PayPal: Donate in EUR \n\n PayPal: Donate in GBP", "opengraph": {}, "tags": ["Climate Change", "Fed", "Muslims", "Global Warming", "Terrorism", "Nuclear reactors", "China", "Society", "U.S.", "Japan", "EU", "Global News", "Donald Trump", "Nuclear", "Obama administration", "Economy", "Technology", "Military", "U.K.", "Science", "Germany", "Sex", "New World Order", "Islam", "Syria", "Russia", "Banking", "Middle East", "Radiation", "Israel", "Health", "Europe", "Global Cooling", "Environment", "Crime", "Debt", "Collapse", "Migrant Crisis", "Federal Reserve", "Politics", "Fukushima", "Government", "Trump administration", "Barack Obama", "Food"], "tweets": [], "movies": [], "links": ["https://infiniteunknown.net/wp-content/uploads/2021/09/three-monkeys.jpg", "https://www.technocracy.news/kaboom-youtube-bans-all-anti-vaccine-content/", "https://www.washingtonpost.com/politics/2021/07/19/biden-facebook-misinformation/", "https://www.msn.com/en-us/news/us/youtube-is-banning-prominent-anti-vaccine-activists-and-blocking-all-anti-vaccine-content/ar-AAOXmdF", "https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=infiniteunknown23@googlemail.com&item_name=Thanks%20for%20supporting%20Infinite%20Unknown&no_shipping=1&no_note=1&tax=0&currency_code=USD&lc=GB&bn=PP-DonationsBF&charset=UTF-8", "https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=infiniteunknown23@googlemail.com&item_name=Thanks%20for%20supporting%20Infinite%20Unknown&no_shipping=1&no_note=1&tax=0&currency_code=EUR&lc=GB&bn=PP-DonationsBF&charset=UTF-8", "https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=infiniteunknown23@googlemail.com&item_name=Thanks%20for%20supporting%20Infinite%20Unknown&no_shipping=1&no_note=1&tax=0&currency_code=GBP&lc=GB&bn=PP-DonationsBF&charset=UTF-8"], "authors": ["Infinite"], "publish_date": "2021-09-30T14:19:45-08:00"}