{"result_id": "167042", "URL": "https://infiniteunknown.net/tag/science/", "timestamp": "2023-04-25 15:38:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://infiniteunknown.net/tag/science/", "encoding": "UTF-8"}, "image": null, "domain": "infiniteunknown.net", "title": "Science – Infinite Unknown", "cleaned_text": "A large, planet-sized mass inhabits our solar system, and its large elliptical orbit around the sun brings it across Earth’s orbital plane every 3,600 years or so, wreaking havoc on our planet due to strong gravity effects. The U.S. government has been aware of the approach of “Planet X” for over forty years, warns John Moore “The Liberty Man,” in a jaw-dropping new interview on Brighteon Conversations. (See below.)\n\nWhile Planet X won’t strike the Earth, it’s nearby approach will unleash cataclysmic consequences across our planet that may bring an end to human civilization as we know it, Moore explains in the interview. Those effects may include a global “pole shift,” which means the Earth’s crust slips to a new orientation, unleashing extreme winds, volcanoes, earthquakes, flooding, tidal waves and more.\n\n“Every structure on the surface of the Earth would be destroyed,” explains Moore, who reveals the governments of the world are frantically constructing more underground bunkers in anticipation of catastrophic events.\n\nJohn Moore is a former U.S. Army intelligence analyst and took part in 57 air combat missions over Vietnam and Cambodia. He later become a homicide detective for the state of Missouri. As a long-time radio host, Moore has developed a long list of sources inside government and the U.S. military. He hosts a radio show each weekday from 8 – 10 am central time, via Republic Broadcasting. Learn all the details at TheLibertyMan.com\n\nAs Moore explains in the video below, the pole shift would place North America closer to the equator than its current position, and the “bulge” of ocean water at the equator (due to centrifugal forces of the rotating planet) would raise the level of the ocean by hundreds of feet compared to the continental United States. John Moore’s website — TheLibertyMan.com — hosts this map of anticipated changes. Note that Florida and much of the Eastern seaboard are under water in this depiction:\n\nIn the video below, John Moore explains how people living in other areas of the world can easily determine whether their current locations will be inundated with higher relative ocean levels.\n\nRead morePlanet X warning for Earth: An interview with John Moore, The Liberty Man (Video)", "opengraph": {}, "tags": ["Climate Change", "Brain", "Leonardo Da Vinci", "Coronavirus", "Malaria", "Nazi Germany", "Global Warming", "Depopulation", "Genocide", "Cervarix", "Society", "Art", "Andreas Kalcker", "U.S.", "Gluten", "Vaccine", "MMS", "Robert Sepehr", "Wormwood", "parasites", "EU", "Global News", "Robert F. Kennedy Jr.", "5G", "Economy", "Technology", "Autism", "Andrew Saul", "Children", "Henry Kissinger", "Raymond Obomsawin", "Roundup Ready", "Science", "David Icke", "Germany", "Vril Society", "Warren Buffett", "Monsanto", "Nemesis", "Tyche", "Kerri Rivera", "Barrie Trower", "Chlorine Dioxide", "cds", "Rockefeller", "Grand Solar Minimum", "Health", "James Corbett", "Brian Rose", "Neuroscience", "Wi-Fi", "Europe", "Roundup", "Environment", "Global Cooling", "EMF", "Gardasil", "Vaccination", "Hercolubus", "Glyphosate", "Lyme Disease", "Electrosmog", "Nibiru", "Collapse", "Politics", "Catherine Austin Fitts", "Government", "Bill Gates", "Planet X", "HPV", "Food"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2020-08-12-john-moore-planet-x-pole-shift-asteroid-impacts.html", "http://thelibertyman.com", "http://TheLibertyMan.com", "https://infiniteunknown.net/wp-content/uploads/2020/08/us-navy-flood-map.jpg", "https://infiniteunknown.net/2020/08/13/planet-x-warning-for-earth-an-interview-with-john-moore-the-liberty-man-video/#more-216340"], "authors": ["Infinite"], "publish_date": "2021-03-13T13:58:05-08:00"}