{"result_id": "167023", "URL": "https://infiniteunknown.net/2013/05/21/vaccine-injured-children-in-small-african-village-used-like-lab-rats-and-left-to-die/", "timestamp": "2023-04-25 15:37:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://infiniteunknown.net/2013/05/21/vaccine-injured-children-in-small-african-village-used-like-lab-rats-and-left-to-die/", "encoding": "UTF-8"}, "image": null, "domain": "infiniteunknown.net", "title": "Vaccine Injured Children In Small African Village Used Like Lab Rats And Left To Die – Infinite Unknown", "cleaned_text": "Children vaccinated in Africa were severely harmed by vaccines.\n\n– Revealed Government Documents Show Vaccine Injured Children in Small African Village Used Like Lab Rats (Vactruth, May 19, 2013):\n\nIn December 2012, vaccine tragedy hit the small village of Gouro, Chad, Africa, situated on the edge of the Sahara Desert. Five hundred children were locked into their school, threatened that if they did not agree to being force-vaccinated with a meningitis A vaccine, they would receive no further education. These children were vaccinated without their parents’ knowledge. This vaccine was an unlicensed product still going through the third and fourth phases of testing.\n\nWithin hours, one hundred six children began to suffer from headaches, vomiting, severe uncontrollable convulsions and paralysis. The children’s wait for a doctor began. They had to wait one full week for a doctor to arrive while the team of vaccinators just carried on vaccinating others from the village. More children became sick.\n\nWhen the doctor finally came, he could do nothing for the children. The team of vaccinators, upon seeing what had happened, fled the village in fear.\n\nFifty children were finally transferred to a hospital in Faya and later taken by plane to two hospitals in N’Djamena, the capital city of Chad. After being shuttled around like cattle, these sick, weak children were dumped back in their village without a diagnosis and each family was given an unconfirmed sum of £1000 by the government. No forms were signed and no documentation was seen. They were informed that their children had not suffered a vaccine injury. However, if this were true, why would their government award each family £1000 in what has been described as hush money?\n\nInterestingly, during the time the children spent in the hospital, two more children joined them from another village.\n\nTo read the full stories of this tragedy, please see references at the end of this article from previous Vactruth world-exclusive reports. [1,2,3,4]\n\nSince this time, Vactruth has been passed a series of secret documents, which fill in some missing gaps in this story and expose just how corrupt the organizations behind this tragedy really are.\n\nOn January 14, 2013, arrangements were made for seven female patients between the ages of 8-18 to be evacuated from the Hospital of Mother and Child (HME) and the General Hospital of National Referrals (HGRN) in N’Djamena and transferred by air to a clinic in Tunisia. This was scheduled to take place between January 16 and 22.\n\nThe documents in our possession state that the Chadian government arranged for the patients to be accompanied by Dr. Joseph Mad-Toingue, Chief Service of Infectious Diseases of the National General Referral Hospital; Dr. Moumar Mbaileyo, anesthesiologist employee of the National General Referral Hospital; and Mr. Dihoulne Kakiang, state-certified nurse, employee of the National General Referral Hospital.\n\nOn January 29, 2013, a letter passed between The Chief Service of Infectious Diseases of HGRN-N’Djaména and Mr. Director General of the National General Referral Hospital, stating:\n\nHerewith I have the honor of putting into your hands the report of the mission completed in Tunisia between 15 and 22 of January 2013 regarding the medical evacuation of 7 patients.\n\nVactruth now has this report.\n\nThe report states that seven female patients between the ages of 8 and 18 had suffered adverse reactions after receiving the meningitis A vaccination during a national campaign, which took place on December 11, 2012, for the prevention of this illness. These patients had originally been taken to the Regional Hospital of Faya, before being transferred on December 26, 2012, to the Hospital of Mother and Child (HME) and the General Hospital of National Referrals (HGRN) in N’Djamena.\n\nArrangements were later made for a medical evacuation to transfer these patients to Tunisia for further tests and treatment.\n\nAccording to the report, the departure took place in N’Djaména on January 15, 2013, at 10:50 pm after a long wait at the Hassan airport in N’Djamena because of the late arrival of the plane.\n\nThe journey took place on board a Tunisian plane chartered by the International Medical Society (SMEDI). The party consisted of seven patients, three members of the medical team and seven parents (two men and five women) who accompanied the sick children.\n\nInterestingly, the document states that the party did not fly alone.\n\nThe government report states that twenty other passengers traveling to Tunisia for the same reason (medical evacuation) also joined the party. Sadly, there were no further details on these patients in the report.\n\nWere these patients also vaccine-damaged by the meningitis A vaccination, and where did these twenty other sick patients come from?\n\nJust before the plane took off, an 18 year-old patient had what the report describes as a ‘shaking episode,’ and was given a 10 mg vial of diazepam before boarding the plane. Other than this incident, the flight went well.\n\nThe group arrived in Tunisia on January 16, 2013, and was received by SMEDI agents who took care of the police formalities (entry visa) before dividing the group into three parties. The patients were transported by ambulance to the clinic, the medical staff was taken to a hotel, and the patients’ parents were taken to a center.\n\nOn the afternoon of January 16, the three medical staff were introduced to SMEDI’s Director General, M. Ghazi Mejbri, to get acquainted. This was followed by a work session with the medical coordinator, Dr. Folla Amara. In the course of this meeting, the condition of the patients was discussed and plans were arranged for their care.\n\nThe patients were taken to the neurological department of SMEDI’s La Sourka clinic. The clinic had received the children’s medical records in advance and was reported to have conducted their own clinical and biological tests on the patients before meeting with the medical team that had accompanied them.\n\nOn January 17, a meeting took place with Professor Rachid Namai (“chef de clinique”), Dr. Kefi and Dr. Mabet. It was concluded that the children’s ‘shaking attacks’ or convulsions were of no consequence. On the paraclinical level, the report stated that the liquor tests of five patients did not reveal any anomalies, nor did the EEG of six patients.\n\nThe EEG of the seventh patient showed minor anomalies in the immediate post-critical phase, but was reported to have stabilized. An MRI (magnetic resonance imaging) was to take place of all seven patients. After the meeting, the team visited the patients who were all reported to be well, except for one child who had developed tonsillitis and had to receive appropriate treatment.\n\nOn January 19, a second meeting took place at the La Soukra Clinic during which they examined the patients’ medical records that gave the results of all the medical tests that had taken place. Among the biological perturbations there was reported to be one case of persistent thrombopenia (a lower than normal number of blood cell fragments called platelets), two cases of of elevated immunoglobulines E (Ig E) and five cases of gram negative bacteria directly upon examination — culturing has not been contributory.\n\nThe report stated that, generally speaking, the patients showed a raised tendency for hypoalbuminemia (swelling), hypo creatininemia (renal dysfunction), and hyper glucorrhagia (no definition found).\n\nThe MRI results showed no anomalies, and the HIV and hepatitis serologies were negative. The medical team found the children’s health to be satisfactory. The report states that the children had no infectious cause for their illness and the hypothesis of an immuno-allergic reaction was deemed to be more probable.\n\nAt this point, it was decided to close the investigation due to the advice from specialists and followed up with epidemiological and pharmacodynamical studies.\n\nOn January 21, the mission members visited the clinic at La Soukra for a last time. They found all patients waiting for their stay to end. The report states that a short meeting took place with the chief of service who promised to give his medical report shortly. The mission ended with a visit to the Dr. Naoui Mohamed Néjib’s laboratory where the biological tests of all the patients had been performed.\n\nThe mission members left Tunisia on January 22, 2013, around 2:00 pm and arrived in N’Djaména at 4:00 pm.\n\nThey concluded that the medical evacuation to Tunisia had given them the opportunity to investigate more thoroughly seven patients who had developed post-vaccination reactions during the national vaccination campaign against meningitis.\n\nIt was stated that, generally speaking, the clinical state of the patients did not give any reasons for concern and that the paraclinical balance of the majority did not show major perturbations.\n\nThe report was signed by Dr. Joseph Mad-Toïngé in N’Djaména on January 28, 2013.\n\nThe parents tell a very, very different story. According to parents and relatives, these children were locked into their school, threatened with no education and forcibly vaccinated without their parents’ knowledge.\n\nThey state that the children are still desperately ill and that they have no way of getting any medical care. After the mission, they were left in Faya and had to make their own way back to the village.\n\nThe children are still suffering severe convulsions. One relative told me:\n\n“The children drop suddenly to the ground and shake violently before going paralyzed. We do not know what is wrong and we want answers. No one will help us. Our children were well and fit, we have never had meningitis in our area, so why did they vaccinate our children with this vaccination?\n\nOur children have since become aggressive in their behavior and have a rash all over their bodies. They are having terrible frightening convulsions. Why won’t anyone help us?”\n\nI have been informed that the parents have formed an activist group to put out their plea to the world.\n\nWere the vaccines used on our children out-of-date?\n\nHad some of the batches used been spoiled in the heat?\n\nDid the vaccinators vaccinate our children inadvertently with an unsafe product?\n\nWas the maximum duration of four days without refrigeration respected and adhered to?\n\n“All this disturbs us and makes us fear the worst effects for the future. We do not know what is going on behind the scenes and what the Minister of Health, the organizations involved with the tragedy (Bill and Melinda Gates Foundation, PATH WHO, MVP and UNICEF) are saying or are going to do. As parents, our priority is to get back the health our children. We feel that it is very sad that [our] entire city is paralyzed and is suffering from epilepsy. We were hoping that our government would make a stand and save our children but it has so far failed to do so. Therefore we call assistance for everyone in the world to intervene.\n\nOur needs as listed below:\n• A health specialist, an organization or an individual to assist the sick children, who are innocent victims and help them to get their health back.\n• Human rights organization or an individual lawyer who could help the parents‘ association with legal issues and get justice for the children against the Chad government, WHO, MVP, PATH, Bill and Melinda Gates Foundation and the Indian company Serum Institute of India Ltd.\n• Parents need independent and freelance journalists to help them to get media coverage and tell the world what has happened to the children of Gouro, Chad.”\n\nThe parents’ requests are simple and the same as any other parent left in this impossible situation. They feel deserted and betrayed by the Chadian government, who have left their children to die, while at the same time announcing the vaccination program to be a success. All the parents are very angry and are pleading with the world to help. They state they need lawyers, doctors, medication and above all, support.\n\nThis whole debacle has been a coverup from the very beginning. One of the children’s relatives has told me that there has never been a case of meningitis in this part of Africa. So, why vaccinate children needlessly for a disease that does not exist in this area? Worse still, according to my source, this particular part of Chad is not even on the meningitis belt, and yet this vaccine was given to these children. He could be right, as according to a map attributed to the Gates Foundation, it is not. [5]\n\nThe abnormal tests demonstrate that the vaccines caused these problems (especially the abnormal immunoglobin levels). Had the doctors done more specific tests proving vaccine damage (especially anti-myelin antibodies), they would have found abnormal levels, which indicate vaccine injury. Did they avoid doing these tests on purpose?\n\nIt seems very likely that these children, who are now sick and vulnerable, were used as lab rats and have since been left to die by some of the biggest organizations known to mankind. Five months have passed and a lot of covering up the truth has gone on and still, the world waits for answers. The children of Gouro and their parents want the following organizations – PATH, WHO, UNICEF, and the Gates Foundation — to make a public apology and to own up to what has happened. They want and need accountability.\n\nThis is a violation of the Nuremberg code and these government “officials” are guilty of crimes against humanity.", "opengraph": {}, "tags": ["Crime", "Global News", "UNICEF", "Chad", "Africa", "Education", "Gates Foundation", "Gouro", "Politics", "Bill Gates", "Government", "Health", "Children", "Meningitis", "Vaccine", "WHO", "Science", "Vaccination"], "tweets": [], "movies": [], "links": ["http://vactruth.com/2013/01/06/paralyzed-after-meningitis-vaccine/", "http://vactruth.com/2013/01/13/children-paralyzed-by-vaccine/", "http://vactruth.com/2013/01/25/paralyzed-symptoms-in-head/", "http://vactruth.com/2013/02/12/vaccine-cover-up/", "http://www.flickr.com/photos/gatesfoundation/5837851502/"], "authors": ["Infinite"], "publish_date": "2013-05-21T13:27:49-08:00"}