{"result_id": "168005", "URL": "http://www.informationclearinghouse.info/56144.htm", "timestamp": "2023-04-25 15:38:40 CEST+0200", "meta": {"description": "Terrible social inequality is the result of the relative political weakness of the working class.", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56144.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion:", "cleaned_text": "January 07, 2021 \" \" - Large parts of the world—outside of China and a few other countries—face a runaway virus, which has not been stopped because of criminal incompetence by governments. That these governments in wealthy countries cynically set aside the basic scientific protocols released by the World Health Organization and by scientific organizations reveals their malicious practice. Anything less than focused attention to managing the virus by testing, contact tracing, and isolation—and if this does not suffice, then imposing a temporary lockdown—is foolhardy. It is equally distressing that these richer countries have pursued a policy of “vaccine nationalism” by stockpiling vaccine candidates rather than a policy for the creation of a “people’s vaccine.” For the sake of humanity, it would be prudent to suspend intellectual property rules and develop a procedure to create universal vaccines for all people.\n\nAlthough the pandemic is the principal issue on all of our minds, other major issues threaten the longevity of our species and of our planet. These include:\n\nIn January 2020, the Bulletin of the Atomic Scientists set the Doomsday Clock to 100 seconds to midnight, too close for comfort. The clock, created two years after the first atomic weapons were developed in 1945, is evaluated annually by the Bulletin’s Science and Security Board, who decide whether to move the minute hand or keep it in place. By the time they set the clock again, it may well be closer to annihilation. Already limited arms control treaties are being shredded as the major powers sit on close to 13,500 nuclear weapons (more than 90 percent of which are held by Russia and the United States alone). The yield of these weapons could easily make this planet even more uninhabitable. The United States Navy has already deployed low-yield tactical W76-2 nuclear warheads. Immediate moves toward nuclear disarmament must be forced onto the world’s agenda. Hiroshima Day, commemorated each year on August 6, must become a more robust day of contemplation and protest.\n\nA scientific paper published in 2018 came with a startling headline: “Most atolls will be uninhabitable by the mid-21st century because of sea-level rise exacerbating wave-driven flooding.” The authors found that atolls from the Seychelles to the Marshall Islands are liable to vanish. A 2019 United Nations (UN) report estimated that 1 million animal and plant species are threatened with extinction. Add to this the catastrophic wildfires and the severe bleaching of the coral reefs and it is clear that we no longer need to linger over clichés about one thing or another being a canary in the coal mine of climate catastrophe; the danger is not in the future, but in the present. It is essential for major powers—who utterly fail to shift from fossil fuels—to commit to the “common but differentiated responsibilities” approach established at the 1992 UN Conference on Environment and Development in Rio de Janeiro. It is telling that countries such as Jamaica and Mongolia updated their climate plans to the UN before the end of 2020—as mandated by the Paris Agreement—even though these countries produce a tiny fraction of global carbon emissions. The funds that were committed to developing countries for their participation in the process have virtually dried up while external debt has ballooned. This shows a lack of basic seriousness from the “international community.”\n\nCountries in North America and Europe have eviscerated their public function as the state has been turned over to the profiteers and civil society has been commodified by private foundations. This means that the avenues for social transformation in these parts of the world have been grotesquely hampered. Terrible social inequality is the result of the relative political weakness of the working class. It is this weakness that enables the billionaires to set policies that cause hunger rates to rise. Countries should not be judged by the words written in their constitutions but by their annual budgets; the U.S., for example, spends almost $1 trillion (if you add the estimated intelligence budget) on its war machine, while it spends a fraction of this on the public good (such as on health care, something evident during the pandemic). The foreign policies of Western countries seem to be well lubricated by arms deals: the United Arab Emirates and Morocco agreed to recognize Israel on the condition that they could purchase $23 billion and $1 billion worth of U.S.-made weapons, respectively. The rights of the Palestinians, the Sahrawi, and the Yemeni people did not factor into these deals. The use of illegal sanctions by the United States against 30 countries including Cuba, Iran, and Venezuela has become a normal part of life, even during the COVID-19 public health crisis. It is a failure of the political system when the populations in the capitalist bloc are unable to force their governments—which are in many ways democratic in name only—to take a global perspective regarding this emergency. Rising rates of hunger reveal that the struggle for survival is the horizon for billions of people on the planet (all this while China is able to eradicate absolute poverty and largely eliminate hunger).\n\nNuclear annihilation and extinction by climate catastrophe are twin threats to the planet. Meanwhile, for victims of the neoliberal assault that has plagued the past generation, the short-term problems of sustaining their mere existence displace fundamental questions about the fate of our children and grandchildren.\n\nGlobal problems of this scale require global cooperation. Pressured by the Third World states in the 1960s, the major powers agreed to the Treaty on the Non-Proliferation of Nuclear Weapons of 1968, although they rejected the deeply important Declaration on the Establishment of a New International Economic Order of 1974. The balance of forces available to drive such a class agenda on the international stage is no longer there; political dynamics in the countries of the West, in particular, but also in the larger states of the developing world (such as Brazil, India, Indonesia, and South Africa) are necessary to change the character of the governments. A robust internationalism is necessary to pay adequate and immediate attention to the perils of extinction: extinction by nuclear war, by climate catastrophe, and by social collapse. The tasks ahead are daunting, and they cannot be deferred.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/", "https://www.who.int/news-room/feature-stories/detail/a-guide-to-who-s-guidance", "https://www.sciencemag.org/news/2020/07/vaccine-nationalism-threatens-global-plan-distribute-covid-19-shots-fairly", "https://www.unaids.org/en/resources/presscentre/featurestories/2020/december/20201209_we-must-have-a-peoples-vaccine", "https://thebulletin.org/doomsday-clock/current-time/", "https://www.armscontrol.org/factsheets/Nuclearweaponswhohaswhat", "https://fas.org/blogs/security/2020/01/w76-2deployed/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://advances.sciencemag.org/content/4/4/eaap9741", "https://www.un.org/sustainabledevelopment/blog/2019/05/nature-decline-unprecedented-report/#:~:text=The%20Report%20finds%20that%20around,20%25%2C%20mostly%20since%201900.", "https://peoplesdispatch.org/2021/01/01/you-dont-want-to-imagine-an-ocean-without-coral-reefs-but-you-might-have-to/", "https://mronline.org/wp-content/uploads/2021/01/A_CONF.151_26_Vol.I_Declaration-1.pdf", "https://tinyurl.com/ybuj7xd8", "https://www.thetricontinental.org/dossier-35-twilight/", "https://peoplesdispatch.org/2020/12/18/donald-trumps-final-act-snuffing-out-the-promise-of-democracy-in-the-middle-east/", "https://tinyurl.com/y2ffk8v9", "https://tinyurl.com/y2hvrrp3", "https://www.un.org/disarmament/wmd/nuclear/npt/", "https://digitallibrary.un.org/record/218450?ln=en", "https://independentmediainstitute.org/globetrotter/", "https://tinyurl.com/y976jlvu", "https://smile.amazon.com/Darker-Nations-Peoples-History-Third/dp/1595583424/?tag=alternorg08-20", "https://smile.amazon.com/Poorer-Nations-Possible-History-Global/dp/1781681589/?tag=alternorg08-20", "https://smile.amazon.com/Death-Nation-Future-Arab-Revolution/dp/0520293266/?tag=alternorg08-20", "https://smile.amazon.com/Red-Star-Over-Third-World-ebook/dp/B0799NP7DD/?tag=alternorg08-20"], "authors": [], "publish_date": null}