{"result_id": "168018", "URL": "http://www.informationclearinghouse.info/56420.htm", "timestamp": "2023-04-25 15:38:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56420.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion:", "cleaned_text": "Purpose and Intent of this website: Will vaccination be a pre-requisite for engaging in activities like going to the cinema, having a meal out, exercising in the gym, or staying at a hotel. March 07, 2021 \" \" - There is an entirely predictable but ugly political atmosphere developing in the two states where vaccination is most advanced: Israel and the UK. I currently live in one, Israel, and was born and spent the majority of my life in the other. As each country moves closer to vaccinating a majority of its population, national conversations are quickly turning to concern about what needs to be done about those who have not yet been vaccinated, or refuse to be vaccinated. Israel has already rushed through a so-called “Green Passport” – its version of the “immunity passport”. In part, it is a cynical move by prime minister Benjamin Netanyahu to improve his prospects in this month’s general election by finding a pretext to quickly reopen the economy and give the Israeli public a sense that things are “returning to normal”. Israel is preparing to make vaccination a pre-requisite for engaging in activities like going to the cinema, having a meal out, exercising in the gym, or staying at a hotel. The debate is also rapidly expanding to whether some jobs should be made dependent on having a jab. None of this is surprising. Israel is a largely conformist society, where a tribal sense of solidarity can invariably be relied on against supposed enemies – whether they be the traditional, generic one of “Arabs” or a more recent interloper like a threatening virus. It is in those parts of Israeli society where trust in state authorities is lowest that the vaccination campaign is struggling to make inroads: among Israel’s large minority of Palestinian citizens (Palestinians under occupation, by contrast, have no say in the matter as they are being denied vaccination by Israel), and Israel’s religious ultra-Orthodox community who look to God for direction, not secular officials. Perhaps a little more surprisingly, the UK government is considering following Israel’s lead, despite the Conservative party’s long-professed commitment to an “Englishman’s freedoms” and its traditional resistance to an interfering “nanny state”. (That resistance, of course, applies only when demands on the state relate to helping the poor and marginalised rather than big business.) Boris Johnson, ever the populist, wants to keep a British public onside that is keen to get back to the pub, while the Tory party more generally needs the economy recovering and its corporate donors placated if its claims to being the party of private enterprise and economic growth continue to sound plausible. The ethics of immunity passports is also being hotly debated – if only in slightly more serious terms – in the pages of my old newspaper, the liberal Guardian. No Advertising - No Government Grants - This Is Independent Media Don't let an Algorithm choose what you read! Nick Cohen, a columnist whom in normal circumstances I would scrupulously avoid citing, writes of imminent “vaccine apartheid” and notes – in vaguely approving terms – that “It is only a matter of time before we turn on the unvaccinated”. What will be needed, he argues, is yet more crackdowns on free speech, on “fake news”, to bolster the public’s trust in government and increase vaccine take-up. Cohen’s only reticence is that black and Asian populations, because they are least likely to trust the British state and get vaccinated, will be the main victims of any popular backlash against the unvaccinated. That, he fears, will test the consciences of identity-focused liberals like himself. Another Guardian opinion writer presumptuously cites the philosopher John Stuart Mill in arguing that stripping the unvaccinated of basic rights – vaccine apartheid again – can be made more palatable if it is presented positively as “incentivisation” rather than negatively as punishment. Helpfully, we are told: “The aim might be the same, but the moral reasoning behind it is crucially different.” What a relief! Again, only the danger that black and Asian communities may end up as the collateral damage of these coercive or exclusionary measures pricks the writer’s conscience. All this circumspection is being fleshed out below the line by Guardian readers, who are offering their own potted versions of “common sense”. Popular punishments include sacking the unvaccinated from their jobs to protect others and denying them medical treatment in an over-stretched NHS (apparently even if they have spent a lifetime paying their taxes). The future, at least the one envisioned by these liberals, echoes Dr Seuss’ story of the disdain faced by the Plain-Belly Sneetches at the hands of the snooty Star-Belly Sneetches: When the Star-Belly Sneetches had frankfurter roasts \n\n Or picnics or parties or marshmallow toasts, \n\n They never invited the Plain-Belly Sneetches. \n\n They left them out cold, in the dark of the beaches. \n\n They kept them away. Never let them come near. \n\n And that’s how they treated them year after year. Let us pause for a brief intermission. This is not a post for or against vaccination. I will leave that to others, not least because the polarised nature of that discussion entirely distracts and detracts from what I think are deeper matters relating to trust in the Covid vaccines that reflect wider problems of trust in our state institutions and the values they uphold. I want, as I have done before, to use this space to switch our attention, even if briefly, from the debate everyone is having to a debate almost no one is having. In fact, I want to deconstruct the debate entirely and reframe it. If you are heavily invested in the arguments of the pro- and anti-vaccination camps – or the more often overlooked concerns of the vaccine hesitant – this article may not be what you were hoping for. Instead, this is a call to draw ourselves back from the drama of the pandemic to consider the bigger picture of a virus that – if we would listen – offers us a warning of where we might be going wrong. The problem with the debate about whether we should be able to bully people into getting a Covid vaccine is that it isn’t really a debate at all. It’s a faux debate, because a real debate needs two sides. What we are getting, as so often with these corporate media-framed moral “dilemmas”, is one side of the debate masquerading as both sides. The ethics of immunity passports, or vaccine apartheid, depends on a wider debate about what our societies mean – and what they obscure – when they discuss issues of trust, the public good and social solidarity. A real discussion of these matters, not the phoney one presented by politicians and Guardian writers, should be at the heart of how we address concerns about privacy, personal choice, social pressure and mob tyranny. When columnists, politicians and liberal newspaper readers argue that we should all abide by the communal good in taking the vaccine, they are suddenly imposing an ethical yardstick they rarely use in weighing other issues. The sudden concern for the entire public’s welfare sounds hollow and self-serving when it is uttered by those who normally express only the most perfunctory interest in the common good and social solidarity. The reality is that we live in societies that for at least four decades have been run exclusively in the interests of a tiny corporate elite. This corporate class – which own and run all our major media outlets and provide a revolving door for our captured politicians – are not just concerned with making money. Corporations are commercial enterprises driven by a psychopathic obsession with maximising profits and externalising costs – that is, passing off the toxic legacy of their business models on to those out of sight: the domestic poor, the foreign poor, and future generations. Jonathan Cook won the Martha Gellhorn Special Prize for Journalism. His books include “Israel and the Clash of Civilisations: Iraq, Iran and the Plan to Remake the Middle East” (Pluto Press) and “Disappearing Palestine: Israel’s Experiments in Human Despair” (Zed Books). His website is . If you appreciate his articles, Registration is necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others. EU to propose ‘digital green pass’ as proof a person has been vaccinated", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/intent.htm", "http://www.informationclearinghouse.info/", "https://www.bbc.co.uk/news/uk-56169616", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://www.theguardian.com/commentisfree/2021/feb/27/it-is-only-a-matter-of-time-before-we-turn-on-the-unvaccinated", "https://www.theguardian.com/commentisfree/2021/feb/27/vaccine-passports-alternatives-mills-harm-principle-discrimination", "https://middle-east-online.com/en/www.jonathan-cook.net", "https://www.jonathan-cook.net/supporting-jonathan/", "https://globalnews.ca/news/7669180/covid-vaccine-passport-european-union"], "authors": [], "publish_date": null}