{"result_id": "168040", "URL": "http://www.informationclearinghouse.info/56691.htm", "timestamp": "2023-04-25 15:38:53 CEST+0200", "meta": {"description": "This is the slippery slope upon which we are embarking", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56691.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion: - A New State of Segregation: Vaccine Cards Are Just the Beginning", "cleaned_text": "August 06, 2021\" \" -Imagine it: a national classification system that not only categorizes you according to your health status but also allows the government to sort you in a hundred other ways: by gender, orientation, wealth, medical condition, religious beliefs, political viewpoint, legal status, etc.\n\nThis is the slippery slope upon which we are embarking, one that begins with vaccine passports and ends with a national system of segregation.\n\nIt has already begun.\n\nWith every passing day, more and more private businesses and government agencies on both the state and federal level are requiring proof of a COVID-19 vaccination in order for individuals to work, travel, shop, attend school, and generally participate in the life of the country.\n\nNo matter what one’s views may be regarding the government’s handling of the COVID-19 pandemic, this is an unnerving proposition for a country that claims to prize the rights of the individual and whose Bill of Rights was written in such a way as to favor the rights of the minority.\n\nBy allowing government agents to establish a litmus test for individuals to be able to engage in commerce, movement and any other right that corresponds to life in a supposedly free society, it lays the groundwork for a “show me your papers” society in which you are required to identify yourself at time to government worker who demands it for reason.\n\nSuch tactics can quickly escalate into a power-grab that empowers government agents to force anyone and everyone to prove they are in compliance with every statute and regulation on the books. Mind you, there are thousands of statutes and regulations on the books. Indeed, in this era of overcriminalization, it is estimated that the average American unknowingly breaks at least three laws a day.\n\nNo Advertising - No Government Grants - This Is Independent Media\n\nThis is also how the right to move about freely has been undermined, overtaken and rewritten into a privilege granted by the government to those citizens who are prepared to toe the line.\n\nIt used to be that “we the people” had the right to come and go as we please without the fear of being stopped, questioned by police or forced to identify ourselves. In other words, unless police had a reasonable suspicion that a person was guilty of wrongdoing, they had no legal authority to stop the person and require identification.\n\nUnfortunately, in this age of COVID-19, that unrestricted right to move about freely is being pitted against the government’s power to lock down communities at a moment’s notice. And in this tug-of-war between individual freedoms and government power, “we the people” have been on the losing end of the deal.\n\nNow vaccine passports, vaccine admission requirements, and travel restrictions may seem like small, steps in winning the war against the COVID-19 virus, but that’s just so much propaganda. They’re only necessary to the police state in its efforts to further brainwash the populace into believing that the government legitimately has the power to enforce such blatant acts of authoritarianism.\n\nThis is how you imprison a populace and lock down a nation.\n\nIt makes no difference if such police state tactics are carried out in the name of national security or protecting America’s borders or making America healthy again: the philosophy remains the same, and it is a mindset that is not friendly to freedom.\n\nYou can’t have it both ways.\n\nYou can’t live in a constitutional republic if you allow the government to act like a police state.\n\nYou can’t claim to value freedom if you allow the government to operate like a dictatorship.\n\nYou can’t expect to have your rights respected if you allow the government to treat whomever it pleases with disrespect and an utter disregard for the rule of law.\n\nIf you’re tempted to justify these draconian measures for whatever reason—for the sake of health concerns, the economy, or national security—beware: .\n\nWhatever dangerous practices you allow the government to carry out now, rest assured, these same practices can and will be used against you when the government decides to set its sights on you.\n\nThe war on drugs turned out to be a war on the American people, waged with SWAT teams and militarized police. The war on terror turned out to be a war on the American people, waged with warrantless surveillance and indefinite detention for those who dare to disagree.\n\nThe war on immigration turned out to be a war on the American people, waged with roving government agents demanding “papers, please.”\n\nThis war on COVID-19 is turning out to be yet another war on the American people, waged with all of the surveillance weaponry and tracking mechanisms at the government’s disposal. You see, when you talk about empowering government agents to screen the populace in order to control and prevent spread of this virus, what you’re really talking about is creating a society in which ID cards, round ups, checkpoints and detention centers become routine weapons used by the government to control and suppress the populace,\n\nNo one is safe.\n\nNo one is immune.\n\nAnd as I illustrate in my new novel, , no one gets spared the anguish, fear and heartache of living in a police state.\n\nThat’s the message being broadcast 24/7 with every new piece of government propaganda, every new law that criminalizes otherwise lawful activity, every new policeman on the beat, every new surveillance camera casting a watchful eye, every sensationalist news story that titillates and distracts, every new prison or detention center built to house troublemakers and other undesirables, every new court ruling that gives government agents a green light to strip and steal and rape and ravage the citizenry, every school that opts to indoctrinate rather than educate, and every new justification for why Americans should comply with the government’s attempts to trample the Constitution underfoot.\n\nYes, COVID-19 has taken a significant toll on the nation emotionally, physically, and economically, but there are still greater dangers on the horizon.\n\nAs long as “we the people” continue to allow the government to trample our rights in the so-called name of national security, things will get worse, not better.\n\nWe’ve been having this same debate about the perils of government overreach for the past 50-plus years, and still we don’t seem to learn, or if we learn, we learn too late.\n\nCuriously enough, these COVID-19 mandates, restrictions and vaccine card requirements dovetail conveniently with a national timeline for states to comply with the Real ID Act, which imposes federal standards on identity documents such as state drivers’ licenses, a prelude to a national identification system.\n\nTalk about a perfect storm for bringing about a national ID card, the ultimate human tracking device.\n\nIn the absence of a national ID card, which would make the police state’s task of monitoring, tracking and singling out individual suspects far simpler, “we the people” are already being tracked in a myriad of ways: through our state driver’s licenses, Social Security numbers, bank accounts, purchases and electronic transactions; biometrics; by way of our correspondence and communication devices (email, phone calls and mobile phones); through chips implanted in our vehicles, identification documents, even our clothing.\n\nAdd to this the fact that businesses, schools and other facilities are relying more and more on fingerprints and facial recognition to identify us. All the while, data companies such as Acxiom are capturing vast caches of personal information to help airports, retailers, police and other government authorities instantly determine whether someone is the person he or she claims to be.\n\nThis informational glut—used to great advantage by both the government and corporate sectors—has converged into a mandate for “an internal passport,” a.k.a., a national ID card that would store information as basic as a person’s name, birth date and place of birth, as well as private information, including a Social Security number, fingerprint, retinal scan and personal, criminal and financial records.\n\nA federalized, computerized, cross-referenced, databased system of identification policed by government agents would be the final nail in the coffin for privacy (not to mention a logistical security nightmare that would leave Americans even more vulnerable to every hacker in the cybersphere).\n\nAmericans have always resisted adopting a national ID card for good reason: National ID card systems have been used before, by other oppressive governments, in the name of national security, invariably with horrifying results. After all, such a system gives the government and its agents the ultimate power to target, track and terrorize the populace according to the government’s own nefarious purposes.\n\nFor instance, in Germany, the Nazis required all Jews to carry special stamped ID cards for travel within the country. A prelude to the yellow Star of David badges, these stamped cards were instrumental in identifying Jews for deportation to death camps in Poland.\n\nAuthor Raul Hilberg summarizes the impact that such a system had on the Jews:\n\nIn South Africa during apartheid, pass books were used to regulate the movement of black citizens and segregate the population. The Pass Laws Act of 1952 stipulated where, when and for how long a black African could remain in certain areas. Any government employee could strike out entries, which cancelled the permission to remain in an area. A pass book that did not have a valid entry resulted in the arrest and imprisonment of the bearer.\n\nIdentity cards played a crucial role in the genocide of the Tutsis in the central African country of Rwanda. The assault, carried out by extremist Hutu militia groups, lasted around 100 days and resulted in close to a million deaths. While the ID cards were not a precondition to the genocide, they were a facilitating factor. Once the genocide began, the production of an identity card with the designation “Tutsi” spelled a death sentence at any roadblock.\n\nIdentity cards have also helped oppressive regimes carry out eliminationist policies such as mass expulsion, forced relocation and group denationalization. Through the use of identity cards, Ethiopian authorities were able to identify people with Eritrean affiliation during the mass expulsion of 1998. The Vietnamese government was able to locate ethnic Chinese more easily during their 1978-79 expulsion. The USSR used identity cards to force the relocation of ethnic Koreans (1937), Volga Germans (1941), Kamyks and Karachai (1943), Crimean Tartars, Meshkhetian Turks, Chechens, Ingush and Balkars (1944) and ethnic Greeks (1949). And ethnic Vietnamese were identified for group denationalization through identity cards in Cambodia in 1993, as were the Kurds in Syria in 1962.\n\nAnd in the United States, post-9/11, more than 750 Muslim men were rounded up on the basis of their religion and ethnicity and detained for up to eight months. Their experiences echo those of 120,000 Japanese-Americans who were similarly detained 75 years ago following the attack on Pearl Harbor.\n\nDespite a belated apology and monetary issuance by the U.S. government, the U.S. Supreme Court has yet to declare such a practice illegal. Moreover, laws such as the National Defense Authorization Act (NDAA) empower the government to arrest and detain indefinitely anyone they “suspect” of being an enemy of the state.\n\nSo you see, you may be innocent of wrongdoing now, but when the standard for innocence is set by the government, no one is safe.\n\nAnd anyone can be a criminal when it’s the government determining what is a crime.\n\nRemember, the police state does not discriminate.\n\nAt some point, it will not matter whether your skin is black or yellow or brown or white. It will not matter whether you’re an immigrant or a citizen. It will not matter whether you’re rich or poor. It won’t even matter whether you’ve been properly medicated, vaccinated or indoctrinated.\n\nGovernment jails will hold you just as easily whether you’ve obeyed every law or broken a dozen. Government bullets will kill you just as easily whether you’re complying with a police officer’s order or questioning his tactics. And whether or not you’ve done anything wrong, government agents will treat you like a suspect simply because they have been trained to view and treat everyone like potential criminals.\n\nEventually, as I make clear in my book Battlefield America: The War on the American People , when the police state has turned that final screw and slammed that final door, all that will matter is whether some government agent chooses to single you out for special treatment.\n\nConstitutional attorney and author John W. Whitehead is founder and president . His books Battlefield America: The War on the American People and are available at . He can be contacted at johnw@rutherford.org. Nisha Whitehead is the Executive Director of The Rutherford Institute. Information about The Rutherford Institute is available at www.rutherford.org.\n\nRegistration is necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/intent.htm", "https://www.salon.com/2018/01/22/a-border-patrol-inspection-of-a-greyhound-bus-is-raising-questions-about-being-stopped/", "http://www.informationclearinghouse.info/", "https://www.theatlantic.com/politics/archive/2017/02/papers-please/517887/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://scholar.google.com/scholar_case?case=11713857759343795310", "https://www.amazon.com/Erik-Blair-Diaries-Battlefield-Dead/dp/1954968027/", "https://www.nytimes.com/2018/01/18/travel/is-your-id-approved-for-travel-these-are-the-latest-rules.html", "http://www.aclu.org/FilesPDFs/surveillance_report.pdf", "https://www.forbes.com/sites/tarunwadhwa/2013/02/06/the-washington-post-got-it-wrong-we-dont-need-a-national-id-card/#2022e473a768", "http://www.nizkor.org/hweb/people/e/eichmann-adolf/transcripts/Sessions/Session-036-01.html", "https://goo.gl/YH1ut2", "http://overcomingapartheid.msu.edu/multimedia.php?id=65-259-3", "http://www.hrw.org/reports/1999/rwanda", "http://unictr.unmict.org/sites/unictr.org/files/case-documents/ictr-96-4/trial-judgements/en/980902.pdf", "http://www.preventgenocide.org/prevent/removing-facilitating-factors/IDcards/", "http://www.aljazeera.com/news/2017/01/supreme-court-hears-case-muslims-detained-911-170119050505116.html", "http://www.pbs.org/wnet/supremecourt/personality/landmark_korematsu.html", "http://www.amazon.com/Battlefield-America-War-American-People/dp/1590793099/", "https://www.rutherford.org/", "https://www.amazon.com/Battlefield-America-War-American-People/dp/1590793099/ref=asap_bc?ie=UTF8", "https://www.amazon.com/Government-Wolves-Emerging-American-Police/dp/1590799755/ref=asap_bc?ie=UTF8", "https://www.amazon.com/", "mailto:johnw@rutherford.org", "https://www.rutherford.org/"], "authors": [], "publish_date": null}