{"result_id": "168020", "URL": "http://www.informationclearinghouse.info/56293.htm", "timestamp": "2023-04-25 15:38:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56293.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion: - 'The EU is an unreliable partner' Russian Foreign Minister Lavrov:", "cleaned_text": "'The EU is an unreliable partner' Russian Foreign Minister Lavrov:\n\nBashing Russia When One Needs It Doesn't Work Well\n\nFebruary 07, 2021 \" \" - Russia had recently said that it would take a more assertive stand against the sanctions and Navalny nonsense the 'west' is throwing at it.\n\nToday the EU's foreign policy chief Josep Borrell visited Moscow. He had a talk with Russia's Foreign Minister Sergey Lavrov.\n\nBorrell said he had conveyed the EU’s unhappiness about the jailing of Navalny. “I have conveyed to Minister Lavrov our deep concern and reiterated our appeal for his release and the launch of an impartial investigation of his poisoning,” he said. But his remarks were overshadowed by Lavrov’s forceful rebuke, in which he repeated his doubts about the West’s conclusion that Navalny was poisoned with a military-grade nerve agent — a conclusion that German Chancellor Angela Merkel personally announced in Berlin, where Navalny was treated. Laboratories in France and Sweden, as well as the Organization for the Prohibition of Chemical Weapons, confirmed the German findings. Overall, it was a disastrous performance by Borrell, who acknowledged that the EU had not taken any step toward imposing new sanctions on Russia over the Navalny case. Borrell, a former foreign minister of Spain, then stood by silently and semi-smiling as Lavrov took the last word to slam the EU as “unreliable” and to say he hoped EU heads of state and government use a planned discussion about Russia at their March European Council summit to adopt a new path. “We are getting used to the fact that the European Union are trying to impose unilateral restrictions, illegitimate restrictions and we proceed from the assumption at this stage that the European Union is an unreliable partner,” Lavrov said. “I hope that the strategic review that will take place soon will focus on the key interests of the European Union and that these talks will help to make our contacts more constructive.” Adding an exclamation point to Borrell’s troubled visit, Russia expelled three EU diplomats — from Germany, Poland and Sweden — for attending demonstrations in support of Navalny, an EU diplomat said.\n\nThe Politico writer above has missed the point of today's visit.\n\nBorrell could say little to defend his position as it is Europe that needs Russia. The EU, under the ever incompetent leadership of Ursula von der Leyen, has screwed up the common purchase of vaccines against Covid-19. Van der Leyen has bought too little too late. Called out for that she reacted with panic and nearly started a trade war over the issue:\n\nThe EU's bulk purchase of vaccines had been agreed by member states in June last year, but press coverage in Germany had been turning hostile since late December. The knives were out for Commission President Ursula von der Leyen. The commission went into fight mode, wading into a highly public row with AstraZeneca, which lasted throughout last week. However, by Friday the vaccine issue took an explosive turn, when the commission triggered Article 16 of the Northern Ireland Protocol. In the space of a few hours, the commission was on a collision course with the Irish Government. Unionists, who had already called for Article 16 to be invoked, were outraged. Brexiteers gloated that the true nature of the EU had been laid bare, and even die hard supporters of the European project were left scratching their heads. Since Friday, the commission has been trying to explain what happened. However, it appears a sizeable amount of goodwill has been burned at a time when Ms von der Leyen has been desperate to steer the EU’s vaccine policy on to an even keel. And within the commission a blame game is under way.\n\nVon der Leyen has personally screwed up the vaccine purchase. She needs to get hundreds of millions of vaccine doses and she needs them fast. Otherwise she has little chance to stay in her job.\n\nRussia's Sputnik V vaccine is still not approved for use within the EU but that will soon happen. It could be produced relatively fast if Russia would give licenses to EU companies. Van der Leyen sent Borrell to Moscow to ask for that and to thereby save her ass.\n\nLavrov of course took the chance to give the EU a well deserved dressing-down.\n\nBorrell could say little to counter him. He later released a rather lame statement that condemned the expulsion of the diplomats but announced no counter move.\n\nThe U.S. should expect a likewise assertive treatment from Russia.\n\nYesterday President Joe Biden gave an aggressive (and stupid) pep talk at the State Department in which he also bashed Russia:\n\nTrump did not 'roll over' with regards to Russia but constantly took very aggressive actions against it. Russia did not interfere in U.S. elections, it did not launch cyber attacks and it did not poison its citizens. Making such false claims will not help to gain Russia's help when it is needed.\n\nIt will be impossible for Biden to solve issues in Afghanistan, Iran, Yemen, Syria and elsewhere without Russia's cooperation. It will take more than saying 'pretty please' to get that.\n\nNavalny is in jail because he has constantly violated, since April 2020, the conditions of his probation. The case goes back to a lawsuit a private company, the exclusive distributor for Yves Rocher in Russia, had brought against him ten years ago. Back than Navalny and his brother ran a transport business that bilked the company out of several hundred thousand dollar. In another case Navalny defrauded a state owned timber company he worked for by channeling it's purchases through a company he owned. Several regular courts have found him and his brother guilty. The dude is a fraudster who should serve his time.\n\nAs for 'Russia's' handling of 'peaceful protests' take a look here.\n\nRussia's Foreign Ministry first reaction to Biden's talk shows that it knows what the 'west' is really attempting.\n\nRussia will take care that these plans will end in failure.\n\nBiden should stop bashing Russia and President Putin. He can only lose by competing with him. Biden's approval rating is only at 61%. Putin latest approval rating is 64%. Time to declare a winner?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/intent.htm", "http://www.informationclearinghouse.info/", "https://www.rt.com/russia/504675-lavrov-europe-sanctions-officials/", "https://www.kommersant.ru/doc/4530997", "https://www.politico.eu/article/borrell-stands-by-as-lavrov-calls-eu-unreliable-partner/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://www.rte.ie/news/analysis-and-comment/2021/0202/1194551-article-16-vaccines-brexit/", "https://www.politico.eu/article/blame-ursula-von-der-leyen-eu-vaccine-debacle/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)00234-8/fulltext", "https://eeas.europa.eu/headquarters/headquarters-homepage/92678/russia-statement-high-representativevice-president-josep-borrell-expulsion-european-diplomats_en", "https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/02/04/remarks-by-president-biden-on-americas-place-in-the-world/", "https://www.moonofalabama.org/2021/01/how-trump-appeased-russia.html", "https://www.moonofalabama.org/2021/01/more-cyber-crimes-attributed-to-russia-are-shown-to-have-come-from-elsewhere.html", "https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/02/04/remarks-by-president-biden-on-americas-place-in-the-world/", "https://www.rferl.org/a/russia-navalny-brothers-conviction-upheld-supreme-court-yves-rocher/29191551.html", "https://www.moonofalabama.org/2021/01/navalny-scam-sells-empty-concrete-shell-as-putins-luxurious-palace.html", "https://twitter.com/mfa_russia/status/1356674233464729609", "https://twitter.com/EmbassyofRussia/status/1357625701910925316", "https://apnews.com/article/ap-norc-poll-biden-approval-rating-8b5b95c85f7bff1cf71e21e4b71a2a88", "https://www.rt.com/russia/514629-popularity-poll-putin-navalny/", "https://www.moonofalabama.org/2021/02/bashing-russia-when-one-needs-it-doesnt-work-well.html"], "authors": [], "publish_date": null}