{"result_id": "168017", "URL": "http://www.informationclearinghouse.info/56894.htm", "timestamp": "2023-04-25 15:38:44 CEST+0200", "meta": {"description": "Robert F Kennedy Jr’s new book should be front-page news in all the news media in the US. Instead, it has been met with the proverbial thundering silence.", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56894.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Fauci as Darth Vader of the Covid Wars - Opinion", "cleaned_text": "Robert F Kennedy Jr’s The Real Anthony Fauci: Bill Gates, Big Pharma and the Global War on Democracy and Public Health should be front-page news in all the news media in the US. Instead, it has been met with the proverbial thundering silence.\n\nCritics seeking to have Kennedy dismissed as a kook trading on a famous name had scored a hit in February, when Instagram permanently deleted his account, allegedly for making false claims about coronavirus and vaccines. Nevertheless, the book, published only a few days ago, is already a certified pop hit on Amazon.\n\nRFK Jr., chairman of the board of and chief legal counsel for Children’s Health Defense, sets out to deconstruct a New Normal, encroaching upon all of us since early 2020. In my early 2021 book Raging Twenties I have termed this force techno-feudalism.\n\nKennedy describes it as “rising totalitarianism,” complete with “mass propaganda and censorship, the orchestrated promotion of terror, the manipulation of science, the suppression of debate, the vilification of dissent and use of force to prevent protest.”\n\nFocusing on Dr Anthony Fauci as the fulcrum of the biggest story of the 21st century allows RFK Jr to paint a complex canvas of planned militarization and, especially, monetization of medicine, a toxic process managed by Big Pharma, Big Tech and the military/intel complex – and dutifully promoted by mainstream media.\n\nBy now everyone knows that the big winners have been Big Finance, Big Pharma, Big Tech and Big Data, with a special niche for Silicon Valley behemoths.\n\nWhy Fauci? RFK Jr. argues that for five decades, he has been essentially a Big Pharma agent, nurturing “a complex web of financial entanglements among pharmaceutical companies and the National Institute of Allergy and Infectious Diseases (NIAID) and its employees that has transformed NIAID into a seamless subsidiary of the pharmaceutical industry. Fauci unabashedly promotes his sweetheart relationship with Pharma as a ‘public-private partnership.’”\n\nArguably the full contours of this very convoluted story have never before been examined along these lines, extensively documented and with a wealth of links. Fauci may not be a household name outside of the US and especially across the Global South. And yet it’s this global audience that should be particularly interested in his story.\n\nRFK Jr accuses Fauci of having pursued nefarious strategies since the onset of Covid-19 – from falsifying science to suppressing and sabotaging competitive products that bring lower profit margins.\n\nKennedy’s verdict is stark: “Tony Fauci does not do public health; he is a businessman, who has used his office to enrich his pharmaceutical partners and expand the reach of influence that has made him the most powerful – and despotic – doctor in human history.”\n\nThis is a very serious accusation. It’s up to readers to examine the facts of the case and decide whether Fauci is some kind of medical Dr Strangelove.\n\nPride of place goes to the Fauci-privileged modeling that overestimated Covid deaths by 525%, cooked up by fabricator Neil Ferguson of the Imperial College in London, duly funded by the Bill and Melinda Gates Foundation. This is the model, later debunked, that justified lockdown hysteria all across the planet.\n\nKennedy attributes to Canadian vaccine researcher Dr Jessica Rose the charge that Fauci was at the frontline of erasing the notion of natural immunity even as throughout 2020 the CDC and the World Health Organization (WHO) admitted that people with healthy immune systems bear minimal risk of dying from Covid.\n\nDr Pierre Kory, president of Front Line Covid-19 Critical Care Alliance, was among those who denounced Fauci’s modus operandi of privileging the development of tech vaccines while allowing no space for repurposed medications effective against Covid: “It is absolutely shocking that he recommended no outpatient care, not even Vitamin D.”\n\nClinical cardiologist Peter McCullough and his team of frontline doctors tested prophylactic protocols using, for instance, ivermectin – “we had terrific data from medical teams in Bangladesh” – and added other medications such as azithromycin, zinc, Vitamin D and IV Vitamin C. And all this while across Asia there was widespread use of saline nasal lavages.\n\nBy July 1, 2020, McCullough and his team submitted their first, ground-breaking protocol to the American Journal of Medicine. It became the most-downloaded paper in the world helping doctors to treat Covid-19.\n\nMcCullough complained last year that Fauci has never, to date, published anything on how to treat a Covid patient.” He additionally alleged: “Anyone who tries to publish a new treatment protocol will find themselves airtight blocked by the journals that are all under Fauci’s control.”\n\nIt got much worse. McCullough: “The whole medical establishment was trying to shut down early treatment and silence all the doctors who talked about success. A whole generation of doctors just stopped practicing medicine.” (A contrarian view would argue that McCullough got carried away: A million US doctors – the approximate number practicing at any given time – could not all have been in on it.)\n\nThe book argues that the reasons there was a lack of original research on how to fight Covid were the dependence of much-vaunted American academics on the billions of dollars granted by the National Institute of Health (NIH) and the fact they were terrified of contradicting Fauci.\n\nFrontline Covid specialists Kory and McCullough are quoted as charging that Fauci’s suppression of early treatment and off-patent medication was responsible for up to 80% of deaths attributed to Covid in the US.\n\nHow to kill the competition\n\nThe book offers a detailed outline of an alleged offensive by Big Pharma to kill hydroxychloroquine (HCQ) – with research mercenaries funded by the Gates-Fauci axis allegedly misinterpreting and misreporting negative results by employing faulty protocols.\n\nKennedy says that Bill Gates by 2020 virtually controlled the whole WHO apparatus, as the largest funder after the US government (before Trump pulled the US out of the WHO) and used the agency to fully discredit HCQ.\n\nThe book also addresses Lancetgate – when the world’s top two scientific journals, The Lancet and the New England Journal of Medicine published fraudulent studies from a nonexistent database owned by a previously unknown company.\n\nOnly a few weeks later both journals – deeply embarrassed and with their hard-earned credibility challenged – withdrew the studies. There was never any explanation as to why they got involved in what could be interpreted as one of the most serious frauds in the history of scientific publishing.\n\nBut it all served a purpose. For Big Pharma, says Kennedy, killing HCQ and, later, Ivermectin (IVM) were top priorities. Ivermectin happens to be a low-profit competitor to a Merck product, molnupiravir, which is essentially a copycat but capable of retailing at a profitable $700 per course.\n\nFauci was quite excited by a promising study of Gilead’s remdesivir – which not only is not effective against Covid but is a de facto deadly poison, at $3,000 for each treatment.\n\nThe book suggests that Fauci might have wanted to kill HCQ and IVM because under federal US rules, the FDA’s recognition of both HCQ and IVM would automatically kill remdesivir. The Bill and Melinda Gates Foundation happens to have a large equity stake in Gilead.\n\nA key point for Kennedy is that vaccines were Big Pharma’s Holy Grail.\n\nHe details how what could be construed as a Fauci-Gates alliance put “billions of taxpayer and tax-deducted dollars into developing” an mRNA “platform for vaccines that, in theory, would allow them to quickly produce new ‘boosters’ to combat each ‘escape variant.'”\n\nVaccines, he writes, “are one of the rare commercial products that multiply profits by failing.… The good news for Pharma was that all of humanity would be permanently dependent on biannual or even triannual booster shots.”\n\nAny similarities with our current “booster” reality are not mere coincidence.\n\nThe final summary of Pfizer’s clinical trial data will raise countless eyebrows. The whole process lasted a mere six months. This is the document that Pfizer submitted to the FDA to win approval for its vaccine. It beggars belief that Pfizer won the FDA’s emergency approval despite showing that the vaccine might prevent one (italics mine) Covid death in every 22,000 vaccine recipients.\n\nPeter McCullough: “Because the clinical trial showed that vaccines reduce absolute risk less than 1 percent, those vaccines can’t possibly influence epidemic curves. It’s mathematically impossible.”\n\nBill Gates – Teflon-protected by virtually all Western mainstream media – describes the operational philosophy of his foundation as “philantrocapitalism.” It’s more like strategic self-philantropy, as both the foundation’s capital and his net worth have been ballooning in style ($23 billion just during the 2020 lockdowns).\n\nThe Bill and Melinda Gates Foundation – “a nonprofit fighting poverty, disease and inequity around the world” – invests in multinational pharma, food, agriculture, energy, telecom and global tech companies. It exercises considerable de facto control over international health and agricultural agencies as well as mainstream media – as the Columbia Journalism Review showed in August 2020.\n\nGates, without a graduate degree, not to mention medical school degree (like author Kennedy, it must be noted, whose training was as a lawyer), dispenses wisdom around the world as a health expert. The foundation holds corporate stocks and bonds in Pfizer, Merck, GSK, Novartis and Sanofi, among other giants, and substantial positions in Gilead, AstraZeneca and Moderna.\n\nThe book delves in minute detail into how Gates controls the WHO (the largest direct donor: $604.2 million in 2018-2019, the latest available numbers). Already in 2011 Gates ordered: “All 183 member states, you must make vaccines a central focus of your health systems.” The next year, the World Health Assembly, which sets the WHO agenda, adopted a Global Vaccine Plan designed by – who else? – the Bill and Melinda Gates Foundation.\n\nThe Foundation also controls the Strategic Advisory Group of Experts (SAGE), the top advisory group to the WHO on vaccines, as well as the crucial GAVI Alliance (formerly the Global Alliance for Vaccines and Immunization), which is the second-largest donor to the WHO.\n\nGAVI is a Gates “public-private partnership” that essentially corrals bulk sales of vaccines from Big Pharma to poor nations. British Prime Minister Boris Johnson, only three month ago, proclaimed that “GAVI is the new NATO”. GAVI’s global HQ is in Geneva. Switzerland has given Gates full diplomatic immunity.\n\nFew in East and West know that it was Gates who in 2017 handpicked the WHO’s director general Tedros Adhanom Ghebreyesus – who brought no medical degree and a quite dodgy background.\n\nDr Vandana Shiva, India’s leading human rights activist (routinely accused of being merely anti-vax), sums up: “Gates has hijacked the WHO and transformed it into an instrument of personal power that he wields for the cynical purpose of increasing pharmaceutical profits. He has single-handedly destroyed the infrastructure of public health globally. He has privatized our health systems and our food systems to serve his own purposes.”\n\nThe book’s Chapter 12, Germ Games, may be arguably its most explosive, as it focuses on the US bioweapons and biosecurity apparatus, with a special mention to Robert Kadlec, who might claim leadership of the – contagious – logic according to which infectious disease poses a national security threat to the US, thus requiring a militarized response.\n\nThe book argues that Kadlec, closely linked to spy agencies, Big Pharma, the Pentagon and assorted military contractors, is also linked to Fauci investments in “gain of function” experiments capable of engineering pandemic superbugs.\n\nFauci strongly denies he’s promoted such experiments. Already in 1998 Kadlec had written an internal strategy paper for the Pentagon – though not for Fauci – promoting the role of pandemic pathogens as stealth weapons leaving no fingerprints.\n\nSince 2005 DARPA, which invented the internet by building the ARPANET in 1969, has funded biological weapons research. DARPA – call it the Pentagon’s angel investor – also developed the GPS, stealth bombers, weather satellites, pilotless drones, and that prodigy of combat, the M16 rifle.\n\nIt’s important to remember that in 2017 DARPA funneled $6.5 million through Peter Daszak’s EcoHealth Alliance to fund “gain of function” work at the Wuhan lab, on top of gain of function experiments at Fort Detrick. EcoHealth Alliance was the organization through which Kadlec, Fauci and DARPA financed these gain of function experiments.\n\nDARPA also developed the GPS, stealth bombers, weather satellites, pilotless drones, and that prodigy of combat, the M16 rifle. In 2017 DARPA funneled $6.5 million through Peter Daszak’s EcoHealth Alliance to fund “gain of function” work at the Wuhan lab, on top of gain of function experiments at Fort Detrick. EcoHealth Alliance was the organization through which Kadlec, Fauci and DARPA financed these gain of function experiments,\n\nFew people know that DARPA also financed the key tech for the Moderna vaccine, starting way back in 2013.\n\nRFK Jr dutifully connects the Germ Games progress, starting with Dark Winter in 2001, which emphasized the Pentagon’s drive towards bioweapon vaccines (the code name was coined by Kadlec); the anthrax attack three weeks after 9/11; Atlantic Storm in 2003 and 2005, focused on the response to a terrorist attack unleashing smallpox; Global Mercury 2003; and Lockstep in 2010, which developed a scenario funded by the Rockefeller Foundation where we find this pearl:\n\nDuring the pandemic, national leaders around the world flexed their authority and imposed airtight rules and restrictions, from the mandatory wearing of face masks to body-temperature checks at the entries to communal spaces like train stations and supermarkets. Even after the pandemic faded, this more authoritarian control and oversight of citizens and their activities stuck and even intensified. In order to protect themselves from the spread of increasingly global problems – from pandemics and transnational terrorism to environmental crises and rising poverty – leaders around the world took a firmer grip on power.\n\nRFK Jr paints a picture in which, by mid-2017, the Rockefeller Foundation and US intel agencies had all but crowned Bill Gates as the top financier for the intel/military pandemic simulation business.\n\nEnter the MARS (Mountain Associated Respiratory Virus) simulation during the G20 in Germany in 2017. MARS was about a novel respiratory virus that spread out of busy markets in a mountainous border of an unnamed nation that looked very much like China.\n\nIt gets curiouser and curiouser when one learns that MARS’s two moderators were very close to the Bill and Melinda Gates Foundation, and one of them, David Heymann, sat with the Moderna CEO on the Merieux Foundation USA Board. BioMerieux happens to be the French company that built the Wuhan lab.\n\nAfterward came SPARS 2017 at the Johns Hopkins Center for Health Security. The Bill and Melinda Gates Foundation happen to be major funders of the Johns Hopkins Bloomberg School of Public Health. SPARS 2017 gamed a coronavirus pandemic running from 2025 to 2028. As RFK Jr. notes, “the exercise turned out to be an eerily precise predictor of the Covid-19 pandemic.”\n\nBy 2018 bioweapons expert Peter Daszak was enthroned as the key connector through whom Fauci, Kadlec, DARPA and USAID – which used to be a CIA cover and now reports to the National Security Council – moved grants to fund gain-of-function research, including at the Wuhan Institute of Virology Biosafety Lab.\n\nCrimson Contagion, overseen by Kadlec after eight months of planning, came in August 2019. Fauci was on board the self-described “functional exercise,” representing the NIH, alongside the CDC’s Robert Redfield and several members of the National Security Council. The war game was held in secret, nationwide. The After-Action Crimson Contagion Report only came out via a FOIA request.\n\nThe star of the Gates pandemic show was undoubtedly Event 201 in October 2019, held only 3 weeks before US intel may – or may not – have suspected that Covid-19 was circulating in Wuhan. Event 201 was about a global coronavirus pandemic. RFK Jr. persuasively argues that Event 201 was as close as possible to a “real-time” simulation.\n\nThe book’s Germ Games chapter leads the reader to acknowledge what mainstream media have simply refused to report: how the pervasive involvement of US (and UK) intel has a secretive – yet dominating – presence in the whole response to Covid-19.\n\nA very good example is the Wellcome Trust – the UK version of the Bill and Melinda Gates Foundation – which is a spin-off of Big Pharma’s GlaxoSmith Kline. This epitomizes the marriage between Big Pharma and Western intel.\n\nThe Wellcome Trust chair, from 2015 to 2020, used to be a former director general of MI5, Dame Eliza Manningham-Buller. She was also chair of the Imperial College since 2001. The “English Dr. Fauci,” Neil Ferguson, of the infamous, deadly wrong models that led to all lockdowns, was an epidemiologist working for the Wellcome Trust.\n\nThese are only a few of the insights and connections woven through RFK Jr’s book. As a matter of public service, the whole lot should be available for popular scrutiny worldwide. These matters concern the whole planet, especially the Global South.\n\nNobel laureate Luc Montaigner has noted how, “tragically for humanity, there are many, many untruths emanating from Fauci and his minions.” Even more tragic is what emanates from his masters.\n\nAsia Times. His latest book is 2030. Follow him on Facebook.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/", "https://www.unz.com/pescobar/fauci-as-darth-vader-of-the-covid-wars/", "https://staronos.com/the-real-anthony-fauci.html", "https://www.bbc.com/news/world-us-canada-56021904", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804/", "https://www.amazon.com/Raging-Twenties-Politics-Techno-Feudalism-COVID-19-ebook/dp/B08WHKK3XN/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://blog.nomorefakenews.com/2020/08/06/covid-how-self-entitled-frauds-at-imperial-college-changed-the-world/", "https://www.amjmed.com/article/S0002-9343(20)30673-2/fulltext", "https://www.medrxiv.org/content/10.1101/2020.10.15.20209817v1", "https://www.gatesfoundation.org/", "https://www.cjr.org/criticism/gates-foundation-journalism-funding.php", "https://www.gavi.org/", "https://projects.propublica.org/trump-town/staffers/robert-p-kadlec", "https://www.thelastamericanvagabond.com/head-hydra-rise-robert-kadlec/", "https://www.nommeraadio.ee/meedia/pdf/RRS/Rockefeller%20Foundation.pdf", "https://governmentattic.org/38docs/HHSaarCrimsonContAAR_2020.pdf", "https://cse.google.com/cse?cx=010732926337524982427%3Ava4-o-6opiq&ie=UTF-8&siteurl=www.google.com%2Fcse%2Fhome%3Fcx%3D010732926337524982427%3Ava4-o-6opiq&q=Pepe+Escobar&sa=Search&siteurl=%2FE%3A%2FICH%2520Website%2Findex.html&ref=&ss=#gsc.tab=0&gsc.q=Pepe%20Escobar&gsc.page=1", "http://www.atimes.com/", "https://www.amazon.com/2030-Letter-Grandson-Pepe-Escobar-ebook/dp/B0186FC99U/ref=sr_1_1?ie=UTF8&qid=1535385000&sr=8-1&keywords=2030+Pepe+Escobar", "https://www.facebook.com/pepe.escobar.77377"], "authors": [], "publish_date": null}