{"result_id": "168013", "URL": "http://www.informationclearinghouse.info/56454.htm", "timestamp": "2023-04-25 15:38:43 CEST+0200", "meta": {"description": "Virologist: ‘We Are Going to Pay Huge Price’ for COVID Mass Vaccination Campaign", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56454.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion: -Mass Vaccination in a Pandemic - Benefits versus Risks:", "cleaned_text": "Purpose and Intent of this website: Because of my lack of qualifications and knowledge regarding Covid-19, I have provided very few articles on this topic. To offer information that others may base life changing decisions on is a responsibility I do not wish to carry. This video and transcript with Mr.Vanden Bossche is worth your time in my opinion. I have also provide a link to a rebuttal to this article, read this piece by Rosemary Frei. Rosemary has an MSc in molecular biology from the Faculty of Medicine at the University of Calgary. Virologist: ‘We Are Going to Pay Huge Price’ for COVID Mass Vaccination Campaign Dr. Geert Vanden Bossche [PhD, says that by vaccinating everyone with a vaccine that doesn’t prevent transmission, we are destroying people’s immune systems, and setting the stage for a global health disaster. Geert Vanden Bossche, is an internationally recognised vaccine developer having worked as the head of the Vaccine Development Office at the German Centre for Infection Research. No Advertising - No Government Grants - This Is Independent Media Don't let an Algorithm choose what you read! : I think the first thing that we have to clarify is that we have to explain you are someone who is in the vaccine development business, so to speak. What has that background been like? : Well, I have a background essentially in, as far as vaccines are concerned, in industry as well as in the non-for-profit sector. So I have been working with Bill & Melinda Gates Foundation GAVI [The Vaccine Alliance] especially concentrating on vaccines for global health. And I’ve also been working with several different companies, vaccine companies developing of course essentially prophylactic vaccines and my main focus of interest has always been, in fact, the design of vaccines. So the concept, how can we educate the immune system in ways that are to some extent more efficient than we do right now with our conventional vaccines. : Right. And so any effect, this is the area of work you’ve been in. You develop vaccines, you are as well working with the Ebola vaccine as well. One of the really, really dangerous viruses we have out there in the world. How does that work? Is it, is that easy to do? : Well, I was not, let me be very clear. I was a coordinator of the Ebola program at GAVI. So we were interacting with several different vaccine companies that were developing Ebola vaccines, because it was important for GAVI to make the right choice, the right vaccine in order for this vaccine to be rolled out in the Western African countries that had this severe Ebola crisis back a number of years ago. So that was not a, let’s say operational practical work. This was more a role of coordination, but of course was also a role of assessing what would be the impact of using some of these vaccines in larger populations and in an area where an epidemic really is going on because that’s a very particular and peculiar situation. : Yes. And so in effect, we’ve had so much success over the past hundred years with some very big breakthroughs with vaccines, smallpox, you know, measles, mumps, rubella, polio. But we have struggled with other vaccines. Without going into the details, because this is very difficult to get across, but is there a difference with how viruses operate that make some easier to get a vaccine for? : Well, I think we have a, Philip. Essentially, we need to distinguish, of course, between what we call acute self-limiting diseases. These are diseases that naturally come to an end in a sense that ultimately the individual will eliminate the pathogen. Of course, some people may die. Of course, let’s be very clear. Those who survive will ultimately eliminate the pathogen. That is the vast majority of the vaccines we have been developing so far. The, you know, I don’t need to tell you that with other viruses where we clearly see that they spread in a completely different way. They spread, for example, from cell to cell, they tend to be more intracellular. They tend to develop chronic infections where it’s not self-limiting, it’s not acute self-limiting, it’s chronic. It is much more difficult. And the reason primarily is that most of the vaccines we are developing are still antibody-based vaccines. So we need these antibodies in the blood, or we need these antibodies to translate to the mucosa, for example, in order to capture the pathogen and to neutralize it. So some of the other work, I mean, they have a very insidious strategy in the sense that they hide in cells, that they can already at the mucosal barrier penetrate, you know, immediately into cells. And then the cells may migrate, for example, to the lymph nodes. So they are shielded from the antibodies and that makes it very, very difficult because we know that we can catch them to some extent in the blood, but what they do all the time is that they insert mutation and they escape, they fully escape to our antibody responses. So that makes it way more difficult. It’s also the reason why also against cancer, et cetera, we have not been extremely successful with vaccines as I would say, stand alone therapy. : Yeah, absolutely. Yes. So it, it brings us into where we are with regards to COVID-19 . Now, if we have 20/20 vision at the moment, when we look back at the pandemic and where we started from, and I’ve always said that at the time, when the pandemic started, when it got from China and Italy into Europe, into the UK. I thought that the only way that we could manage this is to lock down and to prevent the spread of this apparently, this very dangerous virus. We do have to stand back and to see whether or not those decisions were correct. But as we said, that hindsight is 20/20. What would you say now, as we look back at the decisions we made then, were we about on the right track? Did we make any mistakes? : Well, frankly speaking, from the very beginning, and I mean, there are many people who can witness this or testify this. I always said that it was a bad idea to do lockdowns that would also affect the younger people. That we would prevent younger people from having contact, from being exposed. Because remember, the big difference back then was, of course, that we had a viral strain, COVID strain, that was circulating, dominant strain, and that was not as highly infectious as those that we are seeing right now. Of course, when a new virus gets into a population, it immediately gets to the folks that have, you know, weak immunity. And we know, we know these people, this is to a large majority, of course, elderly people, people that have underlying diseases or are otherwise immune suppressed, et cetera. And of course, I mean, it was certainly the right thing to do, to protect these people, and for them also to isolate, but we have to distinguish, frankly speaking, and that is what we have not been doing, between those people that have strong innate immunity. I mean, it’s not a, you cannot see when you see a person, you don’t know this, but we know that young people have quite decent innate immune response and therefore they are naturally protected and even more, I mean, if they get in contact with coronavirus, it will boost their natural immunity So therefore from the very beginning, I disapproved, you know, the fact that schools got to close and universities and that youngsters were prevented even from having contact with each other. That situation is of course completely different. If you look at vulnerable people, the virus, this comes to the population, there is no, you know, humoral immunity. There is no immunity at all. In fact, so nobody has been in contact. So the youngsters, they can rely on good innate immunity. Elderly people, I mean, the innate immunity is waning. It gets increasingly replaced by antigen-specific, by specific immunity as people get older. So these people very, very clearly needed to be protected, but it has taken a lot of time before we understood, in fact, how exactly the immune response and the virus were interacting. So there’s been a lot of confusion. A lot of mistakes made. Mistakes, I mean, retrospectively. And that has also led to, you know, bad control right from the beginning. I would say. : With that in mind and where we are now, as countries across the world have been drifting towards the Christmas period, there’s still a rise in cases. Countries had to try and lock down, mask mandates and so on, but we all had the hope that vaccines would come and break the cycle. This is where clearly now from your expertise, you seem to have a different thought about how we should have been thinking about vaccines then, and even now, what is your perspective? : Well, my perspective was, and still is, that if you go to war, you better make sure that you have the right weapon and the weapon in itself can be an excellent weapon. And that is what I’m saying really about the current vaccines. I mean, just brilliant people who have been making these vaccines in no time and with regulatory approval and everything. So the weapon in itself is excellent. Question is, is this the right weapon for the kind of war that is going on right now? And there my answer is definitely no, because these are prophylactic vaccines and prophylactic vaccines should typically not be administered to people who are exposed to high infectious pressure. So don’t forget we are administering these vaccines in the heat of a pandemic. So in other words while we are preparing our weapon, we are fully attacked by the virus. The virus is everywhere. So that is a very different scenario from using such vaccines in a setting where the vaccine is barely or not exposed to the virus. And I’m saying this, because if you have a high infectious pressure, it’s so easy for the virus to jump from one person to the other. So if your immune response, however, is just mounting, as we see right now with the number of people who get their first dose, they get the first dose, the antibodies are not fully mature, the titers are maybe not very high. So their immune response is suboptimal, but they are in the midst of this war while they are mounting an immune response, they’re fully attacked by the virus and every single time. I mean, this is textbook knowledge. Every single time you have an immune response that is suboptimal in the presence of an infection, in the presence of a virus, that infected person, you are at risk for immune escape. So that means that the virus can escape the immune response. And that is why I’m saying that these vaccines, I mean, in their own right, are, of course, excellent. But to use them in the midst of a pandemic and do mass vaccination, because then you provide within a very short period of time, the population with high antibody titers – so the virus comes under enormous pressure. I mean, that wouldn’t matter if you can eradicate a virus, if you can prevent infection, but these vaccines don’t prevent infection They protect against disease because we are just, unfortunately, we look no further than the end of our nose in the sense that hospitalization, that’s all what counts, you know, getting people away from the hospital. But in the meantime, we are not realizing that we give all the time during this pandemic, by our interventions , the opportunity to escape to the immune, to the immune system. And that is of course, a very, very, very dangerous thing. Especially, if we realize that these guys, they only need 10 hours to replicate. So if you think that by making new vaccines, a new vaccine against the new infectious strains, we going to catch up, it’s impossible to catch up. I mean, virus is not going to wait until we have those vaccines ready. I mean, this thing continues. And as I was saying, the thing is, I mean, if you do this in the midst of a pandemic, that is an enormous problem. These vaccines are excellent, but they are not made for administration to millions of people in the midst, in the heat of a pandemic. So that is my thoughts. : Is this equivalent then, because you’ve mentioned this in your paper, is this equivalent to using either a partial dose of antibiotics in anti-microbial or in a bacterial infection where you then produce super bugs. Is this the kind of example that you’re alluding to? : Well, that is a very good parallel. It’s also the parallel I’m using actually in the paper. We just post it on LinkedIn [bad choice, LinkedIn has been deplatforming and censoring scientists and doctors more than any other platform] which, you know, should be so open for everybody [wrong, they outsource to low paid “fact checkers” who aggressively censor according to left media news narratives]. I mean, it’s pure science because as you were pointing out, the thing is the rule is it’s very simple. I mean, same with antibiotics. Either the antibiotics do not match very well with the bug. That’s not good. That’s why we are making antibiograms, you know, to first identify which is the germ. And then we choose the antibiotics. We need to have a very good match. Otherwise there could be resistance. So when I compare this to the current situation, do we have a good match with our antibodies? No, at this point in time, we don’t have a good match anymore because we have this kind of like almost heterologous variants. So that differs from the original strain. So the match isn’t very good anymore. And hence we see people are still protected, but they are already shedding the virus. So that is one thing. The other thing is the quantity, of course. You tell people, you know, you take your antibiotics according to the prescription, please don’t as soon as you feel well, that doesn’t mean that you can stop the antibiotics. Same here. And I get just one example. If you give people just like one dose, I mean, they are in the process of mounting their antibodies. The antibodies still need to fully mature, et cetera. So this is a suboptimal situation. We are putting them in a suboptimal situation with regard to their immune protection. And on the other end, they are in the midst of the war. They are fully attacked by all, you know, by all these kinds of a highly infectious variants. So, I mean, it’s very clear that this is driving immune escape and will ultimately drive resistance to the vaccines. So my point is, yes, Philip, it’s very similar. There is one difference. The virus needs living cells. I mean, if you’re driving immune escape, but the guy has no chance to jump on somebody else, who cares? This situation is now different because we are in the midst of a war, there is a high infectious pressure. So the likelihood that an immune escape immediately finds another living cell, that means another host is very, very high. It’s per definition. It’s the definition almost of a pandemic. : So it raises a simple question that somebody has put in front of us here, which is, it’s perfectly common sense. What do we do? : That question is very easy. I mean, we need to do a better job when we are confronted with situations that seem very dramatic. Like, you know, an epidemic. Our generation has not, you know, been living in times where there are epidemics or pandemics. And so we immediately take action and jump on the beast with the tools we have instead of analyzing what is really going on. And one thing that I thought was extremely interesting was, and it’s something that was not really understood. We know that the number of people or asymptomatically infected, so they are infected, but they don’t develop severe symptoms. Of course they can have some mild symptoms of respiratory disease, whatever. So the question is what exactly happens with those folks that they can eliminate the virus, they eliminate the virus, they don’t transmit it. They will shed it for like a week or so. And then they eliminate this, or you could say, yeah, of course we know that antibodies eliminate … Oh, wait a minute. The antibodies come later, you have first the search of, you know, shedding of the virus. And it’s only afterwards that you see, you know, a moderate and short-lived raise of antibodies. So the antibodies can not be responsible for elimination of the virus. So what is responsible for elimination of the virus? Luckily enough, we have a number of brilliant scientists, independent, brilliant scientists that have now increasingly been showing. And there is increasing evidence that what in fact is happening is that NK cells are taking care of virus. So NK cells that the virus gets into, into these epithelial cells and starts to replicate, but NK cells get activated and they will kill, they will kill the cell, you know, in which the virus tries to replicate. So I was saying that the virus needs to rely on a living cell. So you kill that cell. It’s gone, it’s all over. So we have the solution in the pathogenesis because some people eliminate it. : Absolutely. I just wanted to clarify, because when you said NK cells, somebody may not quite know what you mean. So you mean non killer cells. So it’s a specific group of … : Sorry. It’s natural killer cells, a special group of white blood cells that go and take out the viral infected cell. So, yes, you’re right. Because I have seen from a clinical perspective, very old patients who you would expect to be overwhelmed by the virus and they have a few symptoms and then they’re okay. So they, the body does manage to get rid of it in some cases. And so it raises the point that I’ve always been saying is that we haven’t spent enough time understanding how the virus impacts the body and understanding how the pandemic then will impact the world. We’ve spent all of our time just going for solutions. Has that been a mistake? : Of course, this has been the, you know, the most important mistake, I think. I’m not sure many people and I, I was part of them. So in all modesty, I was part of them. Not sure whether many people understand how a natural pandemic develops and why we have this first wave. We have the second wave. And we have this third wave. And, I mean, these waves of disease and mortality and morbidity, they shift from one population to another. So I’m saying, for example, the second wave, this was typically also the case with influenza, World War I, when basically more soldiers, young people died in the trenches of influenza than from from injuries or whatever. So firstly, elderly, I mean, weak immune system, et cetera. Then it gets to the wave of morbidity and mortality to the younger people. And then it gets back to people who have antibodies. So we have to understand this first, Oh, how does this come? Why all of a sudden does this wave of morbidity and mortality shift, for example, why are the three waves? How do we explain this? And also, how does it come that some people are naturally protected and others are not? What are these mechanisms, what are these molecular mechanisms? Because if you make vaccines and all these things, at the end of the day, this is going to interact at the molecular level. And we have not been understanding this. I would just explain it. We don’t understand our weapon because we don’t understand that prophylactic vaccines should not be used in the midst of an epidemic. And we don’t understand exactly what the virus is, do we. So we go to a war and we don’t know our enemy. We don’t understand the strategy of our enemy. And we don’t know how our weapon works. I mean, how is that going to go? We have a fundamental problem to begin with. : I understand, and I completely accept that, but at the same time, I am still thinking that if the governments don’t respond in some way, because they have to be seen to be doing something . They seem to be in a lose-lose situation. If they don’t do anything, they’re going to be criticized. And if they do do something, they’re going to be criticized. Is that a fair statement to make? : I don’t think so. What was this, oath of, what’s the name of the guy? Hippocrates. You know the rule? : The first. Do no harm. : Okay. Well, I mean, it wouldn’t matter if you start vaccinating people and even if it doesn’t work. Problem is that we induce a long lived antibody response. And as a matter of fact, we know, I mean, that is not my knowledge. It’s all published. No Advertising - No Government Grants - This Is Independent Media Don't let an Algorithm choose what you read! Problem is that we fail to put the pieces of the puzzle together. Fact is that these long lived antibodies, which have high specificity, of course, for the virus. They out-compete our natural antibodies because they’re natural antibodies, they have a very broad spectrum, but they have low affinity. Right? And so by doing this, even if your antibodies don’t work anymore, because there is resistance or, you know, that the strains are too different from the original strain, we still, these antibodies, specific antibodies will still continue to out-compete your natural antibodies. And that is a huge problem because I was saying just a few minutes ago, these natural antibodies, they provide you with broad protection. This protection is, yes, it is variant nonspecific. Doesn’t matter what variant you get. It doesn’t even matter what type of coronavirus is coming in. They will protect you. Unless, of course, you suppress this level of innate immunity , or it is, for example, out-competed by long lived specific antibodies. And so it’s not like, okay, you know, you missed it. Okay, let’s try again. No, you did some harm. I mean, this is different from drugs. Immunizing somebody is installing a new software on your computer. Don’t forget. I mean, these antibodies, they will be recalled every single time you’re encountering a coronavirus, right? I mean, you cannot just erase this. So this is very serious. This is very serious. : So this is an important point because when I was looking at some of the research around the challenges that they faced with the initial SARS, called the first epidemic, and they tried to develop the vaccines. One of the things they found, certainly when they tested it on the ferrets, was that when they expose them to a coronavirus again, they got a very severe response to it . Is this what you’re saying? That we’re putting ourselves in a position where we can then have much more severe disease even to viruses that should normally be quite benign? : Well, you know, you see all my passion and my conviction, but I mean, I’ve been the last to criticize the vaccines in terms of, would they, in some regard, could they, in some regard be unsafe because, you know, you would have even this exacerbation of disease due to antibodies that doesn’t match very well with the coronavirus they’re exposed to et cetera. I know there is reports on this, and there is a lot of serious thoughts about this. But I think what we are talking about right now, the epidemic or the pandemic problem of having a population that is at no point during the pandemic and to large extent, due to our intervention, has not a strong immune response. I mean, this is already serious enough. This is more concerning than one or the other adverse events that could maybe elicited, I’m not downplaying it, but that could maybe be elicited because people have antibodies that do no longer match very well with the strain they were or with the strain they are exposed to. And therefore, you know, they build a complex, they don’t neutralize the virus, they build a complex and this complex could maybe even enhance viral entry into susceptible cells and hence lead to exacerbation of disease. I mean, this may be possible, but the problem I’m talking about is a global problem. It’s not an individual getting an adverse event. It’s a global problem of, you know, making this virus increasingly infectious because we live it all the time, a chance and opportunity to escape an immune system and to drive this. So to wake this up, you know, up to a level where the virus is so infectious, that we can even no longer control it, because I mean, these highly infectious strains, some people think, Oh, the virus is going to calm down and it will insert a number of mutations, you know, just to be gentle and kind with us. That’s not going to happen. I mean, this highly infectious range remains. It is not going to be spontaneous mutations that all of a sudden would become, would make this virus again harmless because such a virus would have a competitive disadvantage, could not be dominant anymore, so that’s not going to happen. So we’re talking about a very, very, very serious problem here. : So I’ve seen the question many times and quite frankly, I get asked the questions. We’re coming to a point where people are going to have to take these vaccines . That looks as though it’s the reality. Either in the context of work or in the context of travel. Based on what you’re saying, they’re in a lose-lose situation. What does this mean? : Well, what does this mean? It’s very clear. It’s very clear what this is going to mean. So let’s consider the consequences of this both at a population level and at an individual level, because I would well understand if for the population is maybe not the best thing to do, but you know, on an individual level, it’s still okay. Yeah. Then it’s not an easy, that’s not an easy question. But as a matter of fact, it’s exactly the opposite. Well, it’s not the opposite. It is detrimental both on a population level, as on an individual level. And I’m telling you why. I think the population level I explained to you, we are increasingly facing highly infectious strains that already right now, we cannot control because basically what we are doing is that we are turning — when we vaccinate somebody, we are turning this person in a potential asymptomatic carrier that is shedding the virus. But at an individual level, I just told you that if you have these antibodies and at some point, and I’m sure this, people can challenge me on this, but, you know, reality will prove it. : I think we are very close to vaccine resistance right now. And it’s not for nothing that already people start developing, you know, new vaccines against the strains, et cetera. But what I was saying is that, okay, if you miss the shoot, okay, you could say nothing has happened. No. You are at the same time losing the most precious part of your immune system that you could ever imagine. And that is your innate immune system , because the innate antibodies, the natural antibodies, the secretary IGMs will be out-competed by these antigen-specific antibodies for binding to the virus. And that will be long lived. That is a long lived suppression. And you lose every protection against any viral variant or coronavirus variant, et cetera. So this means that you are left just with no single immune response with your, you know, it’s none, your immunity has become nil. It’s all gone. The antibodies don’t work anymore. And your your innate immunity has been completely bypassed and this while highly infectious strains are circulating. So, I mean, if that isn’t clear enough, I really don’t get it. And people please do read my, you know, what I posted because it’s science, it’s pure science, pure science. And as everybody knows, I’m a highly passionate vaccine guy, right? And I’ve no criticism on the vaccines, but please use the right vaccine at the right place. And don’t use it in the heat of a pandemic on millions of millions of people. We are going to pay a huge price for this. And I’m becoming emotional because I’m thinking of my children, of the younger generation. I mean, it’s just impossible what we are doing. We don’t understand the pandemic. We have been turning it into an artificial pandemic. Who can explain where all of a sudden, all these highly infectious strains come from? Nobody can explain this. I can explain it. But we have not been seeing this during previous pandemics, during natural pandemics. We have not been seeing it. Because at every single time, the immunity was low enough so that the virus didn’t need to escape. So back at the end of the pandemic, when things calmed down and it was herd immunity, it was still the same virus circulating. What we are now doing is that we are really chasing this virus and it becomes all, you know, increasingly infectious. And I mean, this is just a situation that is completely, completely completely out of control. So it’s also, we are now getting plenty of asymptomatic shedders. People who shed the virus because if they are vaccinated or they have even antibodies from previous disease, they can no longer control these highly infectious variants. So how does that come? Does anybody still understand the curves? I see all these top scientists looking at this curve, at its waves. Like somebody else is looking at the currency rates at the stock market. All they can say is, Oh, it goes up, it’s stabilizing. It may go down, may go up, et cetera. I mean, that is not science. They don’t have any clue. They don’t even know whether the curve is gonna go up exponentially or whether it’s gonna go down or whatever. They’re completely lost. And that is extremely scary. That has been the point where I said, okay, guy, you have to analyze. You have to, but you know, these people are not listening. That is the problem. : So you are, in effect, putting your reputation on the line because you feel so passionately about this because I guarantee you that no government, no health system is going to want to hear what you are saying. You are, in effect, almost giving fuel to the fire for an anti-vaxxer who doesn’t want the vaccine. : No, no, well, no. Because I’ve clearly also addressed some emails from anti-vaxxers . I mean, I’m not interested, but I’m clearly telling them that at this point, it’s so irrelevant, you know, whether you’re a pro vaxxer or an anti-vaxxer, et cetera, it is about the science. It’s about humanity, right? I mean, let’s not lose our time now with criticizing people or, I mean, anti-vaxxer, okay. If you’re not an anti-vaxxer, you could be a stalker. You could be, you know, we like to stigmatize because if you stigmatize people, you don’t need to bother about them anymore. Oh, this guy’s an anti-vaxxer. Okay. I mean, he’s out of the scope. Oh, he’s a stalker. He’s out of the scope. I mean, that is a discussion that is completely irrelevant at this point. It is about humanity. And of course I’m passionate. Of course, I mean, it’s about your children. It’s your family. It’s my family. It’s everyone. Right. And it’s simply for me, I put everything at stake because I’ve done my homework. And this is simply a moral obligation. A moral obligation. : Wow. Wow. I mean, there’s very little one can say, as I said, when you position that you are in the business of developing vaccines and helping societies protect against infections through the use of vaccines, and in this circumstance, you are saying, hold it, we’re doing the wrong thing here. It’s very difficult to not listen to that. That’s the truth. : Well, the answer is very easy. I mean, this is human behavior. If you’re, you know, having panic, we do something and we try to make ourselves believe that it is the right thing to do, until there is complete chaos and there is a complete disaster. And then people say, well, you know, I mean, politicians will probably say, you know, we have been advised by the scientists and scientists, you know, will maybe point to somebody else, but this is now a situation. I’m asking every single scientist to scrutinize, to look what I’m writing, to do the science and to study exactly the, I call these the immune pathogenesis of the disease. And because I like people to do their homework. And if the science is wrong, you know, if I’m proven wrong, I will admit it, but I can tell you, I’m not putting my career, my reputation at stake. I would not do this when I would not be 200% convinced. And it’s not about me, not about me at all. It’s about humanity. People don’t understand what is currently going on. And we have an obligation to explain this. And I posted my paper on LinkedIn and I invite all independent scientists please to look at it because this can be easily understood by microbiologists, immunologists, geneticists, you know, plenty of biochemists, etc., etc., all the biologists, all these people who have elementary knowledge, it’s not rocket science, elementary knowledge of biology should be able to understand this. And I mean, I can only appeal to these people, you know, to stand up as independent scientists and to voice their opinion. : Yes, yes, yes. I mean, that was a long point that somebody put on about the innate immune response, the false overreacting of the innate immune response, leading to detrimental effects in other coronaviruses. So I think you’ve expressed this so well, Geert. I think that just hearing your explanation, the passion, the focus on the science, I think that that’s as much as you can do. I think that I don’t even want to say any more because I don’t want to lose that passion that you have just expressed. How much you are doing in terms of trying to see if you can make a difference with regards to the impact that we are having in this pandemic. You know, we really, really appreciate that, Geert. We really, really appreciate that. I hope enough people share this, and listen to it, certainly because I’m connected with a lot of scientists. Please connect to Geert, take a look at his paper and see what you think. And as you said, let’s make decisions based on science. That’s the best that we can do at this point. Wonderful. Just stay on the line there. We’re just going to close off now, Geert. So thank you again very, very much, Geert. And I hope maybe we can speak again in the near future to expand a little bit further on what you have said. : Thanks, Philip, for having me on. Registration is necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others. The science behind the catastrophic consequences of thoughtless human interventonin the Covid-19 pandemic – Geert Vanden Bossche (DVM, PhD, March 13 2021)", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ZJZxiNxYLpc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>&#13;", "src": "https://www.youtube.com/embed/ZJZxiNxYLpc"}], "links": ["http://www.informationclearinghouse.info/intent.htm", "https://childrenshealthdefense.org/defender/rebuttal-rosemary-frei-bossche-vaccination-concern/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://childrenshealthdefense.org/news/vaccines/gates-pushes-gene-altering-technology-on-seven-billion-humans/", "https://www.gavi.org/", "https://childrenshealthdefense.org/defender_category/covid", "https://dryburgh.com/sunetra-gupta-lockdowns/", "https://dryburgh.com/raj-bhopal-coronavirus-immunity/", "https://dryburgh.com/peter-doshi-is-corona-virus-vaccine-safe-bmj/", "https://dryburgh.com/john-loannidis-coronavirus-health-policies-lacked-evidence/", "https://dryburgh.com/fake-pandemic-2020-2021/", "https://dryburgh.com/gordan-lauc-covid19-coronavirus-risk/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://dryburgh.com/byram-bridle-coronavirus-vaccine-concerns/", "https://dryburgh.com/wp-content/uploads/2020/12/pathogenic_priming.pdf", "https://dryburgh.com/barbara-loe-fisher-coronavirus-vaccination-required-to-participate-in-society/", "https://dryburgh.com/byram-bridle-coronavirus-vaccine-concerns/", "https://www.youtube.com/watch?v=ZJZxiNxYLpc&t=2128s", "https://childrenshealthdefense.org/news/once-burned-twice-shy-why-anti-vaxxers-are-really-ex-vaxxers/", "https://childrenshealthdefense.org/defender/virologist-huge-price-covid-mass-vaccination/", "https://mcusercontent.com/92561d6dedb66a43fe9a6548f/files/0121a525-0daf-4792-9b08-ac750577b3d4/Scientific_Evidence_final.pdf", "https://be.linkedin.com/in/geertvandenbossche"], "authors": [], "publish_date": null}