{"result_id": "168022", "URL": "http://www.informationclearinghouse.info/56661.htm", "timestamp": "2023-04-25 15:38:46 CEST+0200", "meta": {"description": "The Biden administration is telling Facebook which posts it regards as \"problematic\" so that Facebook can remove them.", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56661.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion: - The US Government Threatens Tech Companies To Push Censorship Agendas", "cleaned_text": "July I8, 2021 \" \" - The elephant in the room with the ongoing controversy about the Biden administration's push for more internet censorship is the fact that both the US government and the Silicon Valley tech companies who are being pushed to censor are acutely aware that those companies can be brought to their knees by antitrust cases and other regulation if they don't censor people's voices in accordance with the government's wishes.\n\nAfter Press Secretary Jen Psaki admitted on Thursday that the administration has given Facebook a list of accounts to ban for spreading \"misinformation\" about the Covid vaccine, she has now doubled down saying that people who circulate such materials online should be banned from not just one but social media platforms.\n\n\"You shouldn’t be banned from one platform and not others for providing misinformation out there,\" Psaki told the press on Friday.\n\nWhen asked by the press for his thoughts on companies like Facebook, President Biden said the failure of those platforms to adequately censor posts about the vaccine makes them guilty of \"killing people\".\n\nWhen confronted about the extremely serious implications of a US presidential administration telling social media platforms who to censor, Psaki said the administration wasn't censoring people but merely raising the issue with the tech companies.\n\n\"We don’t take anything down,\" said Psaki. \"We don’t block anything. Facebook and any private-sector company makes decisions about what information should be on their platform. Our point is that there is information that is leading to people not taking the vaccine, and people are dying as a result. And we have a responsibility, as a public health matter, to raise that issue.\"\n\nPsaki is not technically lying, but she isn't telling the truth either. While it's true that the Biden administration is not directly blocking or taking down social media posts, it is also making social media companies a Godfather-style offer they can't refuse.\n\no Advertising - No Government Grants - This Is Independent Media\n\nFor years the US government has been making it abundantly clear to the giants of Silicon Valley that if they do not greatly escalate censorship of undesirable content per Washington's instructions, there will be consequences.\n\nIn 2017 Senator Dianne Feinstein threatened social media platforms that, because of alleged Russian interference in the 2016 election, they need to start utilizing more censorship or else face consequences, saying, “You created these platforms, and they are being misused. And you have to be the ones to do something about it—or we will.”\n\nIn 2019 Louisiana Representative Cedric Richmond issued a similar threat, saying social media platforms had \"better\" start regulating what he considers harmful content on their own, or the government will take matters into its own hands.\n\n“They better go do it because what they don't want is for us to do it, because we're not going to get it right,” Richmond said. “We're going to make it swift, we're going to make it strong and we're going to hold them very accountable.”\n\n“We have the First Amendment, and we’re very reluctant to pass speech laws,\" House Judiciary Committee chairman Jerrold Nadler told The Washington Post in 2019. \"But there’s a problem, and we have to deal with it.”\n\n“Let's see what happens by just pressuring them first,” Nadler added. “I'm reluctant to have regulation of speech. It usually goes too far. I don't know we have to get there yet.”\n\nAs Glenn Greenwald noted on Twitter following the latest admissions from the Biden administration, executives from these tech companies are being regularly hauled before congress and \"threatened with legislative and regulatory retaliation\" if they don't conduct censorship in alignment with the will of the US government. We saw this in 2017 when representatives from top internet platforms were brought before congress and told they needed to adopt a “mission statement” expressing their commitment “to prevent the fomenting of discord,” and we continue to see it through 2021.\n\nThe reasons change, but the agenda remains the same. Sometimes it's foreign election meddling, sometimes it's the Capitol riot, sometimes it's domestic extremism and white supremacy, sometimes it's misinformation about a virus and vaccines, but for every reason given the instruction is the same: censor online communications in accordance with the wishes of the US government. Or else.\n\nThese threats have been explicitly made, but really they did not need to be. Everyone involved in this dance is acutely aware that the US government has the ability to make things much harder and far less lucrative for these Silicon Valley tech companies. This could mean actions ranging from fines and minor regulations all the way up to the revocation of Section 230 protections or full-scale antitrust cases which can go as far as breaking up online platforms in the same way the government broke up AT&T and Standard Oil.\n\nThe stage is already set for massive antitrust measures to be implemented, with the House Judiciary Subcommittee on Antitrust finding last year that corporations like Facebook and Google are guilty of monopolistic practices, and some less severe antitrust cases are already underway.\n\nSo now we've got worldwide online speech being herded onto a few monopolistic platforms, and the government forcing those platforms with increasing brazenness to censor that speech in alignment with its dictates under threat of total destruction. The effect being, of course, US government control of a vast swathe of public speech, not just within the US but around the world. Which means an ungodly amount of narrative control, the ultimate prize for anyone who understands real power.\n\nThe primary factor in determining what will happen in our world is not control of capital, nor control of government, nor control of resources, nor control of weapons, but control of narrative. All the others follow from narrative control. Control the narrative and you control where the weapons will go, where the capital will go, where the resources will go, what the government will do. Real power begins with narrative control. Understand this and you'll understand why governments, plutocrats and media behave the way they do.\n\nSo while antitrust laws ostensibly exist to protect the citizenry from corporate power, here they are being leveraged to ensure the union of corporate power and state power. The carrot is billions of dollars, and the stick is the threat of painful government intervention.\n\nObviously the US government would prefer to simply have monopolistic corporations voluntarily censoring content in accordance with government interests, but for them the only thing worse than having no monopolistic companies serving the empire would be having monopolistic companies which refuse to serve the empire. So the threat being issued here is, \"Censor the way we tell you to censor, or your company will be broken down and replaced with one that will.\"\n\nAnd that's exactly what could easily happen. Facebook, Google/Youtube or Twitter could easily be regulated into dysfunction or broken up into smaller companies, and then some other more government-aligned corporation could be allowed to take their place. Silicon Valley billionaires are hardly known for being the most principled people in existence to begin with, so that threat is all it would take to ensure they conduct themselves in alignment with the will of the empire.\n\nThis is just one of the many, many types of glue that keeps power structures aligned with one another's interests within the US-centralized empire. If you want to be a billionaire and control massive amounts of wealth, you have to collaborate with existing power structures. Otherwise you won't be allowed in, and if you are in you'll be kicked right out.\n\nIt's always easier to move with power than against it. That's why ambitious journalists promote the imperial narrative, it's why new money plutocrats always wind up aligning with establishment interests, and it's why so many other nations align with the US.\n\nIn theory, markets and government checks and balances are supposed to keep the big players competing against each other to our benefit. In practice, the big players always wind up collaborating against us for their own benefit.\n\nCaitlin's articles are entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking her on , following her antics on , throwing some money into her hat on ,\n\nRegistration is necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others.", "opengraph": {}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Jen Psaki just suggested that people spreading misinformation be banned from other/all platforms if they're banned from one. <a href=\"https://t.co/SlNXJTXi0I\">pic.twitter.com/SlNXJTXi0I</a></p>— jordan (@JordanUhl) <a href=\"https://twitter.com/JordanUhl/status/1416101387881046020?ref_src=twsrc%5Etfw\">July 16, 2021</a></blockquote> ", "<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Biden administration is telling Facebook which posts it regards as \"problematic\" so that Facebook can remove them.<br/><br/>This is the union of corporate and state power -- one of the classic hallmarks of fascism -- that the people who spent 5 years babbling about fascism support. <a href=\"https://t.co/U2Ee3DgXJe\">https://t.co/U2Ee3DgXJe</a></p>— Glenn Greenwald (@ggreenwald) <a href=\"https://twitter.com/ggreenwald/status/1415725320381079569?ref_src=twsrc%5Etfw\">July 15, 2021</a></blockquote> "], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/JS6Aw-hM190\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/JS6Aw-hM190"}], "links": ["http://www.informationclearinghouse.info/", "https://caitlinjohnstone.com/2021/07/16/biden-administration-completely-kills-the-its-a-private-company-so-its-not-censorship-argument/", "https://twitter.com/JordanUhl/status/1416101387881046020", "https://www.thedailybeast.com/white-house-says-social-media-users-booted-from-one-platform-for-covid-disinfo-should-be-blacklisted-on-all", "https://www.youtube.com/watch?v=JS6Aw-hM190", "https://t.co/SlNXJTXi0I", "https://twitter.com/JordanUhl/status/1416101387881046020?ref_src=twsrc%5Etfw", "https://www.whitehouse.gov/briefing-room/press-briefings/2021/07/16/press-briefing-by-press-secretary-jen-psaki-july-16-2021/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://www.vanityfair.com/news/2017/11/feinstein-lights-into-big-tech-over-russian-meddling", "https://archive.is/YwCJd#selection-755.311-755.547", "https://archive.is/UrC3i#selection-1697.0-1697.139", "https://archive.is/YwCJd#selection-513.0-513.193", "https://t.co/U2Ee3DgXJe", "https://twitter.com/ggreenwald/status/1415725320381079569?ref_src=twsrc%5Etfw", "https://twitter.com/ggreenwald/status/1416018339227394048", "https://www.wsws.org/en/articles/2017/11/01/goog-n01.html", "https://greenwald.substack.com/p/congress-escalates-pressure-on-tech", "https://en.wikipedia.org/wiki/Section_230", "https://www.hg.org/legal-articles/infamous-antitrust-cases-6025", "https://arstechnica.com/tech-policy/2020/10/house-amazon-facebook-apple-google-have-monopoly-power-should-be-split/", "https://archive.is/AbpDy", "https://caitlinjohnstone.substack.com/p/society-is-made-of-narrative-realizing", "https://www.facebook.com/CaitlinAJohnstone/", "https://twitter.com/caitoz", "https://soundcloud.com/going_rogue", "https://www.patreon.com/user?u=4445783", "http://paypal.me/caitlinjohnstone", "https://www.amazon.com/Woke-Field-Guide-Utopia-Preppers/dp/064823455X/ref=cm_cr_arp_d_product_top?ie=UTF8", "https://caitlinjohnstone.com"], "authors": [], "publish_date": null}