{"result_id": "168034", "URL": "http://www.informationclearinghouse.info/56687.htm", "timestamp": "2023-04-25 15:38:51 CEST+0200", "meta": {"description": "China had very quickly and effectively stamped out the disease with minimal fatalities using an unprecedented series of local and national lockdowns,", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56687.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion: - Are the Opponents of the Covid Injections \"Anti-Vaxx Crackpots\"?", "cleaned_text": "Purpose and Intent of this website: Are the Opponents of the Covid Injections \"Anti-Vaxx Crackpots\"? August 02, 2021\" \" - Question 1– Your views on the Coronavirus and Covid vaccine are very different than those of Unz Review writers, like Paul Craig Roberts, CJ Hopkins, Israel Shamir and myself. In your estimation, what are the main areas of disagreement and why do you think your analysis is more probable than theirs? Ron Unz– I’d also put Gilad Atzmon in your group, as well as a few additional contributors. I think the biggest area of early disagreement was regarding whether the Covid virus was about as dangerous as the mainstream media was making it out to be. I thought it probably was, while an overwhelming majority of the anti-establishment writers and commenters on this webzine and elsewhere disagreed, in some cases possibly fueled by the early public statements of President Trump and people taking that same position. Although I can’t be sure, here’s my suspicion about why some of this misinformation took such strong hold. Soon after the Covid outbreak in Wuhan was first revealed to the world, various anti-China groups and websites began producing and promoting propaganda-videos claiming that Chinese society was collapsing from this deadly disease. Some of these hugely popular videos showed Chinese people supposedly dropping dead while walking in the streets, and sometimes suggested that Covid was a deadly Chinese bioweapon that had somehow escaped from one of their weapons labs and would wipe out much of China’s population. Also Covid was closely related to SARS, which had had a 10% to 15% fatality rate. So early on I think there were reasonably widespread rumors going around on social media that Covid had a very high fatality rate, perhaps in the 5% or 10% range, and that it might devastate the human race, naturally leading to a great deal of fear-mongering and panic. Obviously, those numbers turned out to be completely wrong, and as a consequence many of the people who had been bombarded with such extreme nonsense reacted against it, arguing that Covid wasn’t really so very dangerous at all, which is entirely true, at least relative to those early, inflated figures. But perhaps understandably, they then went overboard in the other direction, starting to argue that the disease wasn’t dangerous at all, possibly as a form of wishful thinking. I don’t much use social media and had ignored all those anti-China propaganda videos, instead getting my information from the , the , and other mainstream news outlets. And most of these had always suggested that Covid seemed to have a fatality rate somewhere in the range of 0.5% to 1%, but containing an extremely sharp age-skew, with people over 60 being more than 100x as vulnerable as those under 40. And these numbers seem to have held up reasonably well over time. Obviously, a disease that usually has a survival rate better than 99% doesn’t mean the end of the world, and lots of commenters have correctly pointed this out. But it’s still a very serious illness, and if it had completely swept through America’s population of 330 million would have produced at least a couple of million deaths, and probably more than that if the critical cases overwhelmed the hospitals and caused a breakdown in the entire health care system as nearly happened in New York City very early in the epidemic. For the first month or two, our American government had almost totally ignored the Covid problem, apparently just hoping that the virus wouldn’t spread here, but when it did, they didn’t really know what to do. The reports out of Northern Italy were horrifying and showed the huge number of deaths that could be produced by a major outbreak. Since Covid was extremely contagious and there seemed to be no effective treatments, traditional public health measures were useless. China had very quickly and effectively stamped out the disease with minimal fatalities using an unprecedented series of local and national lockdowns, so America and most Western governments decided to try the same thing, but they did so in a very haphazard and disorganized way, that wasn’t very effective. Meanwhile, the lockdowns, mandatory masking, and social distancing were tremendously disruptive and unpopular, especially among libertarians and right-wingers, leading to a huge political backlash. Public health became a bitter ideological issue, which didn’t help with its implementation. Once people stop believing the media, they turn to their own favored sources, which can become echo-chambers based upon wishful thinking. People started claiming that Covid wasn’t really dangerous at all and that very few people were dying from it, which is entirely incorrect but became widely popular in certain circles. There’s a certain amount of ambiguity in classifying cause of death, leading people to argue that the Covid fatality figures were vastly inflated, and they sometimes misunderstood government statistics. I’ll quote a sobering comment I’ve repeated on a number of occasions: But here’s a listing of TOTAL American deaths from all causes over the last few years, taken directly from the CDC website: You’ll notice that the numbers are fairly steady until 2020 when they suddenly jumped by well over 500,000. If I didn’t know any better, I’d almost think that America had been struck by a dangerous disease epidemic that year. It’s obviously just a matter of personal opinion whether an extra half-million deaths in 2020 is a big number or a small number… So America had more than 500,000 “excess deaths” during 2020, and additional tens or hundreds of thousands so far during 2021. Our official Covid death toll is now well over 600,000 but the experts in public health statistics at the University of Washington argue that nearly a million Americans have already died of Covid. Those are enormous numbers, much larger than the combined death toll of all our foreign wars, and they came despite the unprecedented public health measures the government (poorly) implemented over the last year to try to control the spread of the disease. It’s easy to imagine that millions of Americans might have died if the disease had spread in completely unchecked fashion. No Advertising - No Government Grants - This Is Independent Media Don't let an Algorithm choose what you read! As far as I can tell, nearly all Western countries did a very poor job of controlling the Covid outbreak, while East Asian nations like China, Taiwan, Japan, and Singapore, as well as Australia and New Zealand, did a much better job. I come from a scientific background and I prefer to believe in reality. A disease that has already killed so many hundreds of thousands of Americans seems like a very serious problem to me. Question 2– You say: “I come from a scientific background and I prefer to believe in reality.” That’s fine, but where exactly is the scientific evidence that supports lockdowns as a way to contain a highly-contagious virus like Covid-19? I would argue that there isn’t any. Lockdown restrictions were unprecedented, capricious, desperate and thoroughly unscientific. Where are the studies, the experiments, and the clinical trials that proved that they would work? Why were people instructed to stand 6 feet apart rather than 4 feet or 10 feet? It’s ridiculous, and it’s always been ridiculous. What public health goal was achieved by closing restaurants, churches, schools and businesses when grocery stores, hardware stores and big box stores stayed open? What was gained by forcing people to stay at home when–at best– the spread of the virus was only temporarily delayed? And what about masks? How different was the outcome in places like Sweden (which never required masks) compared to the hardliner countries in Europe that strictly enforced mask mandates? Please, explain to me how the “science” supports the restrictions that were put in place in the last year (if that is your view) and, also, address the issue of whether the Governors usurped powers that are not provided under their state constitutions? Ron Unz— I’d already said that the public health control measures in America and most Western countries were implemented “in a very haphazard and disorganized way, that wasn’t very effective.” That certainly included the lockdowns, which massively disrupted our economy and society, but didn’t really have a huge impact on the ultimate spread of the disease. For example, I’d initially been impressed by the evidence that the early and strong lockdowns in my own state of California had resulted in a per capita death rate just a fraction of that in states like Florida and Texas, that didn’t follow such a policy. But as the months went by and people began to ignore what had originally been promised as being very short-term restrictions, California gradually caught up with those other states, so that the ultimate results didn’t really seem all that different. On a more rigorous level in March 2021, Philippe Lemoine published an extremely detailed 25,000 word quantitative study, showing that lockdowns hadn’t really made much difference either in Europe or America, which he summarized in a WSJ column. I found his analysis very persuasive, said so at the time, and quickly highlighted it on our website. I was very glad to reconsider my position once solid research came out showing that it was mistaken. But on the other hand, I still think that the evidence from China clearly proves that lockdowns can work, if implemented properly. China used extremely severe lockdowns with almost no exceptions, that supposedly confined around 700 million people to their homes. But since the lockdowns were so severe, they managed to almost completely stamp out the virus, and after a few weeks, Chinese life went back to being almost normal, with requirements even for masking and social distancing being soon eliminated in most of the country. So they struck very hard for a few weeks, solved the problem, and then removed almost all the restrictions. By contrast, America adopted half-hearted lockdowns, and since they weren’t really effective at stamping out the virus, the government decided they had to be kept in place for many months and even a year or more despite the early promises that they’d be lifted after a few weeks. Obviously, it’s much easier to get people to follow stringent public health policies for a very short period of time than try to make these almost semi-permanent. So as a result, our economy and society has been enormously disrupted compared to that of China and we also suffered something like 500x or more the per capita death rate. Most of the evidence suggests that America’s overall Covid fatality rate has been somewhere in the range of 0.5% to 1%, and by various estimates we’ve had between 600,000 and a million Covid deaths. So combining these two figures, we’ve probably had between 60 million and 200 million infections, probably towards the upper end of that range. This implies that that perhaps half or more of all Americans have been infected, suggesting how poorly our public health measures actually worked. But on the other hand, those infections were at least spread out over most of a year, preventing the sudden collapse of local health care systems, which might have substantially increased the total death rate. So they probably did do some good, though much less than had originally been promised when they were implemented. However, I do think it’s unfair to be too harsh on the specific details of some of the public health measures adopted such as social distancing or masking. Remember, our government health authorities were suddenly faced with an entirely new and dangerous disease, having completely unknown properties. The exact effectiveness of masking and the right separations for social distancing couldn’t be known at the time, and I think even more than a year later are still hotly disputed in some of the articles I’ve read. Because of the earlier SARS epidemic, East Asian countries had gotten used to masking, and since they seemed to be doing such an effective job of controlling the Covid epidemic, we decided to do the same thing, which may or may not have helped all that much. I think the biggest problem was that the federal government under Trump initially ignored the entire epidemic, or handled it in a totally incompetent manner. For example, instead of using the Covid-detection kit that had been very quickly developed by Germany, we decided to produce our own, and the CDC completely botched the job, so that the initial kits were defective and weeks went by before we could even tell if or where Covid was spreading around the country. Also, Trump and his supporters on completely downplayed the virus and said it wouldn’t spread here or might even just “magically” disappear by itself. So the government lost a month or two in taking early measures, which might really have made a major difference. Since the federal government was completely ignoring the problem, this forced some of the individual states or localities to take action, which I think was entirely necessary and justified, even if very poorly implemented in many respects. And although many critics of our policies pointed to Sweden as a shining example, the damage to its economy was pretty comparable to that of neighboring countries while its death rate was much higher, so it’s not at all clear to me that the Swedish model was successful. Question 3– I don’t find the Chinese example (of severe lockdowns) persuasive at all. After a year and a half, China still reports just 4,636 fatalities. Do you find that credible? I don’t. Either China is fiddling the data, the majority of the population is already immune due to prior infection from perhaps SARS (which is supposedly 85% similar to Covid-19) or something else is going on that we don’t know about. In any event, I think it is premature to draw conclusions about the efficacy of lockdowns based on information from China. As for Sweden, in the “deaths per million” category, Sweden finished 34th out of 155 countries listed at Statistica. This is neither good nor bad, just middle-of-the-pack. Naturally, if we knew what we knew now regarding early treatment, medications, anti-inflammatories and therapies, the death toll would have been considerably lower. But that is true everywhere. The idea of judging political leaders based on the number of people who die during a pandemic is ludicrous. Should we also judge them based on how many people are obese or have comorbidities, after all, those are the people who were most likely to die? How is the government responsible for that? Sweden’s real triumph cannot be measured strictly in terms of the number of fatalities that appear in the data, but in its resolve to preserve the fundamental freedoms of its people in the face of relentless media criticism and while authoritarian leaders everywhere imposed harsh restrictions on their people without ever consulting their respective legislatures, congresses or parliaments. Sweden avoided that, and should be applauded for doing so. I also disagree that “the federal government under Trump initially ignored the entire epidemic, or handled it in a totally incompetent manner.” It wasn’t Trump who shunted infected patients into elderly care facilities where they wound up killing thousands of older and infirm men and women. That was the handiwork of the mainly Democrat autocrats like Cuomo and Whitmer. Besides, the expectations of Trump were low to begin with based on the fact that he was only elected as an alternative to the widely-reviled establishment candidate, Hillary Clinton. Whatever mistakes Trump may have made during the pandemic, it is clear by the historic number of votes he got in the 2020 presidential election, that a clear majority of Americans still believe he is preferable to our current “imposter” president who cheated his way into the Oval Office. So I will ask you again: Do you think the Governors usurped powers that are not provided to them under their state constitutions? Ron Unz– Regarding China, I strongly disagree. China used extremely stringent public health measures to totally eradicate the virus within just a few weeks, and once the virus was gone, no one could pass it on to anyone else. Despite a great deal of smoke by anti-China propagandists, there’s really not the slightest evidence that the Chinese statistics are seriously wrong. After all, within a couple of months the Chinese reopened their economy, all their factories were going again, masking requirements were lifted, and they haven’t bothered rushing ahead with mass vaccinations since the virus is no longer a local threat. Every now and then, there have been sudden tiny outbreaks, caused by infected visitors or other factors, and the Chinese government has quickly stamped them out just as effectively as they did the original outbreak. All the circumstantial evidence supports the Chinese government claims. Officially, China only had 4,600 deaths and 93,000 infections, roughly 1/500th the per capita rate in America. Even if we suppose that the government is just lying and the true total was 5x greater, but that still means the rate was 1/100th what we had in the US, which doesn’t really change the argument. America probably had 100-150 million Covid infections, and it’s simply impossible that China had even a few million or their factories, businesses, and daily lives wouldn’t have been back to normal for well over a year now, with people not even bothering to wear masks. So America probably had 500x the per capita deaths while the disruption to the daily lives of ordinary Americans was probably 10x or 20x greater, giving us the worst of both possible worlds. And China’s results aren’t so totally extraordinary, since most of the other East Asian countries also did extremely well, including Taiwan, Singapore, Japan, and South Korea, as well as Australia and New Zealand. I doubt all those different governments are lying. All these figures are easily available on the Internet: The Swedish case has been greatly disputed, but according to the WorldMeters website its per capita Covid death rate is only slightly below that of the US, Britain, France, Spain, and Italy, which really isn’t very good. Meanwhile, other neighboring Scandinavian countries like Finland, Norway, and Denmark did 3x to 10x better, while China did 400x to 500x better. As I recall, after a few months the Swedish official who had been promoting their unorthodox approach, admitted it didn’t work very well, and switched over to a softer version of the same methods followed in most Western countries (which obviously also didn’t work very well). Sweden’s economy was hurt about as much as the countries that pursued full lockdowns, so it’s not clear how much they really gained. However, I’ll have to admit I haven’t closely followed Sweden, and am just relying upon these official summary statistics. The bottom line is that China seems to have done more than 400x better than Sweden in per capita deaths and unlike Sweden the lives of the Chinese people returned to normal very quickly, so I think by any standards China did much, much better. As for the US, I’d agree that lots of local governments did a bad job, including Cuomo in New York. Also, I think some of the mayors like De Blasio in NYC early on denounced restrictions on public celebrations and other gatherings and therefore greatly helped to spread the virus. But Trump was the president, and I think he deserves the most blame, especially for publicly underplaying the early threat of the virus. His CDC botched the production of a testing kit, he made no effort to determine whether the virus was invisibly spreading, and at one point he publicly declared that it would probably disappear by itself like magic. Only the devastating outbreak in his own NYC finally convinced him to take it seriously, and by then it was almost too late. Also, his ridiculous behavior had led most of his allies on to take a very similar position for many weeks, claiming the Covid wasn’t any sort of national threat, with some of them even arguing that it wasn’t any more dangerous than the regular flu. This nonsense got into the heads of many of his ignorant and gullible supporters, certainly playing a major role in the many hundreds of thousands of American deaths that resulted. Regarding the 2020 election, Biden was a terrible candidate and many of the policies he and his supporters advocated were dreadful, thereby almost allowing Trump to win reelection. My feeling is that there was an absolutely massive anti-Democrat/anti-Biden vote and also an absolutely massive anti-Trump vote, but relatively few people were strong supporters of either candidate. That’s pretty similar to what had happened in 2016 when Trump beat Hillary Clinton. Question 4– Let’s move on to vaccines, although I should note that you did not answer my question. I didn’t ask whether you think Cuomo and the rest did a ‘good or bad job’, but whether you thought the “Governors usurped powers that are not provided to them under their state constitutions?” For many of us, this is a critical issue as it directly impacts the personal freedom of every American. For example, we do not confer on our elected representatives the authority to close churches. We don’t give them that power. That may seem like a radical idea in relation to a public health emergency, but now that those powers have been so criminally abused (by Cuomo and the rest) we can see the wisdom of the founders in explicitly stating that the government may NOT “prohibit the free exercise” of religion or other constitutionally protected activities. Simply put, I wanted you to state for the record whether you think a public health crisis allows t within a couple of months the Chinese reopened their economy, all their factories were going again, Ron Unz– Sorry for the omission. I’m not a constitutional lawyer and I really hadn’t been closely following the details of the particular state actions that Cuomo and some other governors had taken to combat the spread of Covid during the early months of 2020. It’s perfectly possible that the emergency actions they took exceeded what their state constitutions allowed—I really don’t know. But as I recall, deaths had reached 1,000 per day in NY, with reasonable fears that they would continue to grow exponentially and the entire health care system would collapse, with gigantic loss of life. If that isn’t a legitimate “emergency” I don’t know what is. By contrast, half the times that presidents or governors proclaim “emergencies” and issue executive orders of dubious legality it’s because some committee of the legislature is refusing to pass their annual budget on time or something. So my own view is that it’s much more reasonable to blame Cuomo for the incompetent actions he allegedly took that may have cost many thousands of lives rather than to blame him for taking emergency actions during a time of huge crisis. Similarly, Trump can be blamed for his lackadaisical and incompetent early response to the Covid epidemic rather than for later setting aside various regulations to allow the rapid procurement of necessary medical supplies and the “warp speed” development of vaccines. I tend not to be overly focused on constitutional or ideological questions. One way of looking at it is that America has certainly suffered far more Covid deaths during a twelve-month period than American servicemen died during the four years of World War II, perhaps even more than twice as many, and virtually none of those latter casualties were on the civilian home front. During time of war, it’s pretty typical for the government to suspend various freedoms, and if we consider the Covid epidemic in that light, the behavior of the government starts to seem less unreasonable. The main problem that arises is if the governmental leaders seem to be dishonest or incompetent rather than sincerely and effectively working for the national good, and there are certainly plausible grounds for that suspicion in our own situation. But temporarily shutting down all large public events that could so easily spread the virus seems a very reasonable decision to me, including church services and sporting events. It’s a case-by-case issue in my mind. As for the vaccines, one major problem that’s now been discovered is that they don’t seem very effective in preventing vaccinated people from infecting others, so there doesn’t seem much reason for the government to forcibly require vaccinations. Relative to vaccinated people, the unvaccinated don’t harm others as much as themselves. Also, the vaccines don’t appear to be as effective as had originally been hoped, and although they seem to greatly reduce the severity of a Covid infection, vaccinated people are still getting sick and sometimes even dying from the illness. Since Trump used emergency orders to suspend all the normal regulations regarding development and testing and had the vaccines produced at “warp speed,” I tend to agree with the anti-vaxxers that the vaccines are probably far, far more dangerous than the usual ones we get every year. For example, I’ve seen claims floating around that more than 6,000 Americans have probably already died from negative vaccine reactions, which is gigantic compared to normal vaccines. But over 160 million Americans have already been fully vaccinated, so that’s a possible death rate of 6,000/160 million or less than 0.004%. By comparison, Covid itself has a death rate of over 0.5%, so taking the vaccine is more than 100x safer than getting Covid, and is almost certainly the smart thing to do, at least for people over 40 or with health problems. I don’t claim to know anything about vaccines, any more than I know anything about car engines, so I tend to leave those specialized topics to the experts who do. For vaccines, I’m sure medical doctors know the relative risks far better than other people. The AMA has 240,000 members and is America’s main professional association for doctors, and after surveying a sample, they claimed that 96% of physicians had already been fully vaccinated by early June, suggesting that the total is probably now more like 98% or 99%. If almost all the doctors in America have decided to get vaccinated, that’s good enough for me. Consider the situation in India as an alternative. Last year, India’s incompetent leader had boastfully declared that his country had beaten Covid and began holding huge political rallies while not making any serious efforts to vaccinate his population, so that as of a couple of months ago only about 3% of Indians had been vaccinated. India’s population is much younger and thinner than America’s, and hence much less vulnerable to Covid, but the difference wasn’t enough, and they’ve begun suffering the world’s worst outbreak. The government has been concealing the true figures, but highly-reputable outside analysts had used several different methods to estimate the Covid casualties, and these probably already total around 4 million deaths, plus or minus a million. Since the vaccines are certainly dangerous, if India had vaccinated most of its population I’m sure that many tens of thousands would have died from vaccine side-effects, but tens of thousands of deaths is much better than millions. I don’t know the details of India’s constitutional system and whether or not its prime minister has been exceeding his legal authority on various grounds. But it does seem like his decisions have already caused the deaths of around 4 million Indians, which seems like a bigger issue to me. If Trump had used emergency decrees to violate various laws but by doing so had reduced our Covid death total by 90%, he would have done the right thing in my mind. Question 5– Let’s stick with your answer to the previous question for a minute. I didn’t ask whether you thought Cuomo and the rest did a ‘good or bad job’, but whether you thought “Governors usurped powers that are not provided to them under their state constitutions?” You don’t need to be a “constitutional lawyer” to know that your personal freedom is being trampled-on wholesale by power-mad oligarchs. All you have to do is watch what they do. When is it ever acceptable for a governor– acting without the explicit support of his state legislature– to unilaterally close down privately-owned businesses, schools, restaurants and churches? Never, it’s never acceptable, which is why at least 15 states have moved to curtail the emergency powers of the governors despite the fact that the media has chosen to entirely ignore the story. In one case, (Tom Wolf of Pennsylvania) defiantly maintained that he has the right to ignore the new restrictions and continue to do whatever the hell he wants. A similar situation arose in Michigan when a 76-year-old Emergency Powers Act was repealed in reaction to Gov. Gretchen Whitmer’s impulsive and tyrannical edicts. After the Republican-led legislature had decided they’d “had enough” and short-circuited Whitmer’s power-grab, defenders of Whitmer released a brazen statement saying the new restrictions were “designed to hamper the abilities of those in government to act quickly and decisively during public health emergencies… House Republicans voted to eradicate an important tool for elected leaders trying to save lives and stop the spread of deadly, infectious diseases like COVID-19.” In short, Whitmer is fighting to preserve the autocratic powers she seized at the height of the pandemic. That, of course, is how “power corrupts.” Can you see what a dangerous precedent we have set by allowing these madmen to act unilaterally and outside the law? You say: “If Trump had used emergency decrees to violate various laws but by doing so had reduced our Covid death total by 90%, he would have done the right thing in my mind.” From a common sense point of view, that seems like a reasonable trade-off, but I think we are seeing in real-time what a terrible mistake it is. What you are saying is: ‘if breaking the law produces a positive outcome, then– by all means– break the law.’ Okay, but how is that working out so far? People have been ordered to close their businesses, stay at home and wear masks in public. But that’s just Phase 1, isn’t it; because in France and Israel people are now required to produce a vaccine passport to get into restaurants, bars, sporting venues or grocery stores. In Australia, police are going from home to home to make sure people aren’t visiting their neighbors or leaving the premises. And in the Philippines, the president has just announced that unvaccinated people who go into public places will be swiftly escorted back to their homes by the police. My point is that the restrictions are expanding and intensifying, the attack on our Constitutional form of government is clearly visible, and the threat to freedom is real. Do you see the monster we have created by allowing our leaders to act unilaterally and outside the law or do you think I am just overreacting to the unavoidable excesses of an unprecedented crisis? Ron Unz– Actually, I think this question gets to the heart of many other Covid controversies. According to the public health experts at the time it was reasonably believed that if the government hadn’t taken those sorts of legal measures to temporarily close down restaurants, sporting events, churches, and most other public gatherings and impose a general lockdown, the virus would have rapidly spread and infected most of the population and within a few months probably killed roughly a couple of million Americans. Moreover, the much larger of victims requiring hospitalization would have probably caused the total collapse of local health care systems, probably multiplying the fatalities by another factor of two or three. So they were looking at something like five million or more dead. Those were the widespread estimates by health experts at the time, and I’ve never seen any reason to doubt that their projections were reasonable and probably were at least approximately correct. Obviously, the entire population had its personal and professional lives severely disrupted by those widespread lockdowns, and so many of them reacted psychologically by convincing themselves the measures weren’t necessary. Charlatans were naturally very eager to take advantage of the situation on the Internet, as well as tiny minorities of experts who promoted those same ideas. Some of these people claimed that the virus didn’t exist or wasn’t any worse than the regular flu, and the whole thing was merely a government hoax. Others claimed that various unorthodox medical treatments so enormously reduced the danger of Covid infection as to render it almost harmless. Still others claimed that a large fraction of the American population had already been infected and was therefore immune. I’m not a medical expert and I never had all that much interest in these issues, but as far as I could tell, the government officials and the mainstream media were largely correct from day one and all these “alternative voices” were almost entirely incorrect. For example, early on critics seized on the statements of John Ioannidis, a prominent Stanford epidemiologist, who claimed that the lockdowns were totally unnecessary and predicted that the national death toll wouldn’t go above 10,000. Several other Stanford professors, apparently associated with a business lobbying group, made similar sorts of claims, arguing that a huge fraction of Californians had already been infected so that the business lockdowns were totally unnecessary. In April 2020, federal government officials warned that if lockdowns and other strong measures weren’t undertaken, America might eventually see as many as 100,000 to 250,000 deaths, and those predictions were widely denounced and ridiculed by many commenters on my website, who claimed they were ridiculously exaggerated scaremongering. At the time, I said I expected the death toll to actually be much, much higher than 250,000, so they called me totally insane. When I later said we might easily see 500,000 Covid deaths by the end of 2020, once again I was denounced and ridiculed, but that’s exactly what happened. And the experts at the University of Washington have concluded that our total death toll is now around a million. One of our bloggers, Anatoly Karlin, very early on predicted that “millions would die” worldwide, and he was also denounced and ridiculed, but that’s exactly what happened. Just a few days ago, did a very detailed analysis of “excess mortality” around the world, and estimated that probably something like 14 million people have already died. One way of facing an extremely serious problem is just pretending that it doesn’t exist. Obviously, if the government were just lying and Covid was merely a hoax or “just the flu” or could very easily be treated with drugs, everyone could get back to their normal lives without many millions of Americans dying. But wishing doesn’t make it so. Since President Trump and his administration had almost entirely ignored the problem for a month or two, and his CDC had botched the production of a testing kit, his diehard supporters naturally wished to minimize the national disaster he’d caused, so many of them convinced themselves or pretended that Covid epidemic wasn’t serious. Other individuals have excused this total governmental incompetence by claiming it was part of a deliberate plot by the secret elites at the World Economic Forum or somewhere to destroy our economy and society, but I’m very skeptical of that also. We have all sorts of laws and regulations in place that make our lives much less convenient but probably prevent only a few thousand needless deaths each year. Under that standard, taking far stronger actions to prevent many, many millions of American deaths seems reasonably warranted. Getting back to a point I made earlier, the Chinese government took very strong and decisive action early on, shut down their entire economy, confined 700 million Chinese to their homes, and totally stamped out the virus. So within a few months, life in China went back to being almost entirely normal for nearly the whole population, without lockdowns or other serious restrictions. They didn’t even need to rush as much with vaccinations since the virus itself had been almost totally eliminated. Meanwhile, the American government ignored the problem, implemented haphazard lockdowns that weren’t effective, and generally did a poor job. So as many as a million Americans died, while our society is still extremely disrupted sixteen or seventeen months later. With the Delta virus, we might even have to soon return to lockdowns. In some ways, I can’t entirely blame the various “Covid skeptics” or anti-vaxxers. After all, my entire American Pravda series documents in tremendous detail how our government, mainstream media, and academic worlds have been so extremely dishonest about so many important things for so many years. This is also obviously true about very many major racial and political issues. Therefore, lots of people naturally come to believe that if our ruling elites and our media are so totally dishonest about so many other things, they’re probably lying about Covid and vaccines as well. That’s possible, but I’ve looked at the data, and I just don’t see it. As far as I can tell, the media has been pretty much correct about Covid and the vaccines from day one, while it’s been the agitated critics and skeptics who are seriously mistaken. I’m not a public health expert, but just for the sake of argument, let’s suppose I’m correct in going along with those mainstream experts on Covid. They argued that if we hadn’t taken those strong public health measures to which you so strongly object, whatever their supposedly questionable legality, our health care system might have collapsed and maybe something like 5 million Americans would have died. It seems to me that 5 million extra American deaths over a few months would have been a pretty big deal, and the government was probably right in trying to avoid that, even if they did so in a rather incompetent manner. Such numbers aren’t so totally ridiculous. For example, Indians are much younger and thinner than Americans and therefore much, much less vulnerable to Covid. But their government pretty much ignored the problem and current estimates are that around 4 million Indians have recently died from the virus, with the eventual death toll sure to be far higher. Since critics don’t like the lockdowns, masking, or social distancing, they make legal/constitutional arguments against them. But most people would find those legalistic issues ridiculous if the alternative was so many millions of American deaths. So I think this forces these critics to convince themselves that the virus really isn’t as dangerous as it really seems to be. Pretending a serious problem doesn’t exist isn’t a very good idea in the modern world, and America has been doing exactly that about many, many different types of problems over the last couple of decades. One thing I’ve noticed is that there doesn’t seem to be almost any of this “Covid skepticism” in lots of other countries that have done a much better job. The European governments reacted to Covid just as badly as America did, and there seem to be plenty of protests there against vaccines and lockdowns. But the governments of China, Japan, Taiwan, South Korea, Singapore, and other East Asian countries did an excellent job, and I never hear any complaints. I think that’s because the people there mostly trust their governments as being competent and honest, at least compared with America’s government. So overall, I think the situation is a lot like the old story about “crying wolf.” Our government and media have been lying about so many important things for so many years that you and many other people don’t even believe them even when they seem to be telling the truth. That’s one of the reasons our society is in such bad shape these days. Last Question– You’ve made it quite plain that you think my views on the covid situation are largely “anti-vaxxer crackpottery”, so perhaps you would like state yours for the record? I combed through the comments section of the recent article by Paul Craig Roberts titled “How the Covid “Pandemic” Was Orchestrated” and saw that you’d offered your opinion a number of times. Unfortunately, I was unable to figure out your basic case against the people like myself who believe the vaccine is a sinister and lethal attack on humanity. By the way, I do not back away from that claim at all, in fact, every day I become more convinced that my original assessment was correct. Part of your argument seems to rest on simple math. In an earlier question you say: “I tend to agree with the anti-vaxxers that the vaccines are probably far, far more dangerous than the usual ones we get every year. For example, I’ve seen claims floating around that more than 6,000 Americans have probably already died from negative vaccine reactions, which is gigantic compared to normal vaccines. But over 160 million Americans have already been fully vaccinated, so that’s a possible death rate of 6,000/160 million or less than 0.004%. By comparison, Covid itself has a death rate of over 0.5%, so taking the vaccine is more than 100x safer than getting Covid, and is almost certainly the smart thing to do, at least for people over 40 or with health problems.” This is what people usually refer to as a “straw man”. The “anti-vaxxers” –as you call us– do not claim that people will drop dead after getting vaccinated. That is a misrepresentation of our position. What we are saying is that the vaccine is dangerous because it was rushed into use before critical animal trials were conducted, before Phase 3 clinical trials were concluded, and before biodistribution research was conducted. When there is no long-term data on a vaccine or any other drug for that matter, it is, by definition, dangerous. And that is our main objection to these experimental vaccines; they are dangerous. As you know, a significant number of scientists, epidemiologists, virologists, and even the inventor of the mRNA vaccine itself, have been sharply critical of the Covid gene-therapy concoction (aka–‘The Vaccine’) and have stated in clear, unambiguous terms that the vaccination campaign should be terminated immediately, which has been my position from the very beginning. Oddly, when I read your recent posts, there appears to be more agreement on the basic issues than I had originally thought. For example, you say: “As for the vaccines, one major problem that’s now been discovered is that they don’t seem very effective in preventing vaccinated people from infecting others (and) Also, the vaccines don’t appear to be as effective as had originally been hoped, and although they seem to greatly reduce the severity of a Covid infection, vaccinated people are still getting sick and sometimes even dying from the illness.” Again, this has been our position from the onset when the drug companies first released their trial data. As a reminder, that data did NOT support the claim that the vaccines prevented Covid or stopped its transmission. Nor did the trials prove conclusively that the vaccines lesson the severity of symptoms or help to prevent hospitalization. That is another Fauci fabrication woven from whole cloth. If that’s true, then let’s see the evidence of which there is none. What we know for certain, however, is that the vaccines –do not stay in the deltoid muscle in the shoulder like the drug companies said — but enter the bloodstream where the substance circulates throughout the body (and brain), penetrating the cells in the fabric on the inside of the blood vessels forcing the cells to produce the cytotoxin spike protein that triggers microscopic blood clots in 62% of people who were tested. (Note– The spike proteins do in fact accumulate in the ovaries suggesting that the vaccine will impact fertility.) Allowing oneself to be vaccinated with this undertested and grossly over-hyped injection is an invitation to an uncertain future in which blood clots, bleeding and Antibody Dependent Enhancement (ADE) will likely negatively impact one’s health and sharply reduce one’s lifespan. One last thing: By now you have probably read the blockbuster story in Thursday’s Washington Post titled “The War has Changed’ Internal CDC document urges new messaging, warns delta infections likely more severe” The author reluctantly confirms much of what we “anti-vaxxers” have been saying for months, that the vaccines are not nearly as effective as advertised. (By the way, I’m not anti-vaccine, but if my opponents think that gives them an edge in the debate, then it’s ‘their call’.) Naturally, the Post tries to blame the Delta variant for the fact that the vaccines don’t perform as predicted but, remember, the Delta variant is a subset of Covid, but it’s still Covid. So there’s no reason why the vaccines shouldn’t work. Instead, they claim to be 85 or 95% effective which is pure hogwash. If you bought a contraceptive that only worked part of the time, you wouldn’t say it was ‘mainly effective.’ No. You would say it was a bust just as the vaccines are a bust because they do not do what they are supposed to do. The whole Delta meme is a red herring, a cynical diversion from the glaring shortcomings of the vaccine. The vaccines do not prevent Covid. At best, they provide some temporary immunity that wears off a few months later. Even worse, they do not stop transmission, in fact, they may accelerate the rate of transmission just as “leaky vaccines” may contribute to the spread of variants. Here’s a clip from the article: “The document is an internal Centers for Disease Control and Prevention slide presentation, shared within the CDC (that shows) new research suggests vaccinated people can spread the virus…. It cites a combination of recently obtained, still-unpublished data from outbreak investigations and outside studies showing that vaccinated individuals infected with delta may be able to transmit the virus as easily as those who are unvaccinated. Vaccinated people infected with delta have measurable viral loads similar to those who are unvaccinated and infected with the variant… CDC scientists were so alarmed by the new research that the agency earlier this week significantly changed guidance for vaccinated people even before making new data public. The data and studies cited in the document played a key role in revamped recommendations that call for everyone — vaccinated or not — to wear masks indoors in public settings in certain circumstances, a federal health official said.” (Washington Post) Think about that for a minute. The CDC finally figures out that cases, hospitalizations and deaths are rising just months after the massive vaccination rollout… just as they have risen in every other country that launched a mass vaccination campaign. And their remedy for this debacle is ‘what’? “To make the people wear masks”. Does that make sense to you? In Singapore, 85% of the people currently in hospital have been vaccinated. Would it have made a difference had they worn masks before? Of course not. The uptick in cases is linked to the vaccine just as it has been linked to the vaccine in every other country that launched a campaign. It has nothing to do with masks. Here’s more from the Post: “One of the slides states that there is a higher risk among older age groups for hospitalization and death relative to younger people, regardless of vaccination status.” Okay, so we just injected millions of America’s oldest and most vulnerable people with a substance that generates the same lethal pathogen (spike protein) that is the killing agent in Covid-19. What did the geniuses at the CDC think would happen? If I injected you with arsenic or strychnine, would you expect to be immune from future disease or would you expect to get sick? That’s a no-brainer, right? The Salk Institute designated the spike protein as a pathogen. (From the report: “Exposure to this pseudovirus resulted in damage to the lungs and arteries of an animal model—proving that the spike protein alone was enough to cause disease.”) Vaccinologist Dr Byram Bridle said “the spike protein is a pathogenic protein, a toxin” that is responsible for “bleeding, heart problems and clotting”…”The spike protein on its own is almost entirely responsible for the damage to the cardiovascular system.” Bottom line: The Covid vaccine is not medicine. It is politics dolled-up to look like medicine. And what are the politics driving the criminal CoVaxx agenda? Good question, but we don’t know yet. But the extraordinary coordination of policy around the world suggests that powerful players are influencing outcomes everywhere. You bet it is, and you’d have to be blind not to see that there’s more going on here than meets the eye. So, tell me, Ron Unz, what is your view of the Covid vaccine and what part of my theory do you dismiss as “anti-vaxx crackpottery”? Ron Unz— Actually, there are all sorts of different anti-vaxxers, including on the comment threads of this website. Some of them take your position, others claim that everyone who’s been vaccinated is doomed, and will be dead in six months or a year or whatever. Let me reemphasize, I don’t know or care anything about vaccines, certainly including the Covid vaccines. I have absolutely no interest in trying to research the subject, any more than I bother researching the details of an automobile engine if I just want to drive a car somewhere. There are probably tens of thousands of scientific vaccine experts all around the world, and as far as I can tell maybe three or four of them seem to have very serious doubts about whether to vaccinate people against Covid, which suggests that 99.9+% of them support the vaccination effort. According to the AMA, almost all the doctors in America have had themselves vaccinated. Since I don’t know anything about vaccines, that seems good enough for me. Pretty much all the world’s political leaders have been vaccinated. If you look at the public surveys, vaccination rates in America are highest for the wealthiest and best-educated portion of the population, which includes all our political, economic, media, and intellectual elites, while vaccination rates are lowest for the poorest and the least educated. I’ll bet virtually every member of the World Economic Forum has been vaccinated. Early on, some of the more “conspiratorial” commenters claimed vaccination was a diabolical plot by the Jews to finally exterminate all the “goyim” but they became mystified when they learned that Israel had one of the world’s highest vaccination rates. Maybe all these scientific experts, medical professionals, and world leaders are entirely wrong, and getting vaccinated is a dangerous and stupid thing to do. Maybe, but since I have to bet, I’d bet the other way. The problem is that anyone can say anything, no matter how ridiculous, and put it up on the Internet or make a video, which other “excited” people will then quote to each other, especially at a time of great national stress or crisis. For example, there’s all this ranting about “spike proteins” and other things about which I know nothing. Without mentioning any names, someone recently claimed in a very popular column that between 300,000 and 600,000 people in the UK and the US had already died from vaccinations. That probably means an extra 50,000 to 100,000 American deaths per month, an astonishing increase of something like 20% to 40% over normal death rates. Yet none of those deaths have shown up any government statistics, and it’s hard to imagine that physicians or mortuaries wouldn’t have noticed such a huge spike. People will believe anything, no matter how ridiculous. Like I’ve said, I haven’t paid any attention to the vaccine issue, but one reason I don’t pay attention to any of the anti-vaxxers is that they seem to heavily overlap with the people who’d previously been Flu Hoaxers, claiming that the virus wasn’t that dangerous and the government was wrong to desperately try to control its spread. As I discussed in my previous response, I was paying close attention to that issue and they were proven 100% wrong about that. In the case of vaccines, they tend to quote one or two or three supposed “experts” who say the vaccines are a disaster, and back then they had also located and endlessly cited a tiny number of “experts” who claimed that only a sliver of Americans would die. It’s easy for non-scientists or non-medical experts to be overly impressed by some scientific jargon that wouldn’t persuade anyone knowledgeable. Anyway, the whole vaccination debate seems pretty meaningless to me. The evidence quoted in the newspapers seems to show that although vaccination doesn’t completely prevent the disease, it reduces the risk of a serious or fatal case by something like 90%, and therefore is obviously beneficial. On the other hand, vaccinated people can still apparently spread the disease to others, greatly reducing the public benefit in getting vaccination rates to very high levels. So although the government and companies should certainly encourage more people to get vaccinated, there’s probably no real reason to force the more fanatic anti-vaxxers to do so since they’re really only endangering their own lives. Maybe when the inevitable happens, the remainder will change their minds, like that rightwing radio host who’d been denouncing vaccines but is now in the hospital with Covid fighting for his life. But if the anti-vaxxers are correct, well over half the adult American population has already been fully vaccinated, so there’s absolutely nothing that can be done to save them. Similarly, two billion people around the world have been vaccinated, so it’s too late to save them as well. However, if the vaccines were really that dangerous and two billion people had already been vaccinated, wouldn’t we already be hearing about millions or tens of millions of people falling seriously ill or dying? As of a month or two ago, one of the countries in the world with the absolute lowest vaccination rates was India, with only 3% of the population vaccinated. And that also happens to be the country where millions have recently died. If the vaccines were relatively dangerous and Covid relatively harmless, wouldn’t you expect it to be the other way round? Virtually every world leader supports Covid vaccination. Maybe that’s because there’s a secret, diabolical conspiracy, or maybe that’s because all the medical experts everywhere support vaccination. After all, all those same world leaders also believe that rocks fall downward. Mike lives in Washington state. He can be reached at Registration is necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/intent.htm", "http://www.informationclearinghouse.info/", "https://www.unz.com/mwhitney/are-the-opponents-of-the-covid-injections-anti-vaxx-crackpots/", "http://www.healthdata.org/news-release/covid-19-has-caused-69-million-deaths-globally-more-double-what-official-reports-show", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://cspicenter.org/blog/waronscience/the-case-against-lockdowns/", "https://www.wsj.com/articles/the-lockdowns-werent-worth-it-11615485413", "https://www.statista.com/statistics/1113834/cumulative-coronavirus-deaths-in-the-nordics/", "https://www.statista.com/statistics/1104709/coronavirus-deaths-worldwide-per-million-inhabitants/", "https://www.worldometers.info/coronavirus/#countries", "https://www.worldometers.info/coronavirus/#countries", "https://www.ama-assn.org/press-center/press-releases/ama-survey-shows-over-96-doctors-fully-vaccinated-against-covid-19", "https://apnews.com/article/business-science-health-india-pandemics-334c326d86efa73a0631bf7cb6e3f92e", "https://www.economist.com/leaders/2021/07/31/unrest-and-economic-underperformance-stalk-the-emerging-world", "https://www.unz.com/page/american-pravda-series/", "https://www.unz.com/proberts/how-the-covid-pandemic-was-orchestrated/", "https://www.washingtonpost.com/health/2021/07/29/cdc-mask-guidance/", "https://www.washingtonpost.com/health/2021/07/29/cdc-mask-guidance/", "https://www.unz.com/mwhitney/are-the-opponents-of-the-covid-injections-anti-vaxx-crackpots/#p_1_114", "https://www.nytimes.com/2021/07/24/world/phil-valentine-hospitalized-coronavirus.html", "mailto:fergiewhitney@msn.com"], "authors": [], "publish_date": null}