{"result_id": "168008", "URL": "http://www.informationclearinghouse.info/55302.htm", "timestamp": "2023-04-25 15:38:41 CEST+0200", "meta": {"description": "“Jesus is My Vaccine.”", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/55302.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion - “Give me Liberty or Give me Covid-19”", "cleaned_text": "“Give me Liberty or Give me Covid-19” July 02, 2020 \" \" - If I told you that Covid-19 was sparking recently reported episodes of madness here in the U.S., what do you imagine would be the reason? Maybe it would be the consequences of isolation. If you are alone and have few resources, lockdown might send you over the edge. Maybe it would be the pandemic’s impact on those with chronic hypochondria. This is obviously not an easy time to be stuck with an irrational fear of disease. Or maybe it is coming from the fundamentalist crowd (both Christian and Jewish) who believe that Covid-19 is the wrath of God yet can’t figure out why it is being visited upon their congregations. If you guessed any of these possible etiologies, you would missing the main cause. So what is mainly causing the present outbursts of madness? It turns out to be a perverted concept of freedom. It is an insistence that, in the midst of a pandemic, temporarily closing down businesses, mandating the wearing of masks, and maintaining social distancing is an intolerable infringement on individual rights. If you would like a visual snapshot of the emotion behind this belief, just take a look at the gun-toting, maskless protesters at the Michigan state legislative building in early May. They are shouting irately about state tyranny, into the faces of masked guards. Other anti-mask protesters around the country revealed a similar off-the-wall attitude, with signs and banners ranging from the nonsensical to the scary: “Give me Liberty or Give me Covid-19,” and in contradiction, “Covid-19 is a Lie,” “Sacrifice the Weak—Reopen,” and “Jesus is My Vaccine.” There is one other rightwing anti-Covid protest sign that must be noted. This one showed up both at the Michigan rally and one in Chicago: ‘Arbeit Macht Frei,” or “Work will make you free.” It is the slogan that stood at the entrance to the Nazi concentration camp at Auschwitz. No Advertising - No Government Grants - This Is Independent Media This perverse notion of freedom is wholly individualistic. That is, it makes no reference to community rights or needs. This point of view is not restricted to armed anarchists or disgruntled religious fundamentalists. Some quite prominent and successful proponents of this view go so far as to deny the reality of society, per se. Such a denial makes government, particularly in the form of the welfare state, a freedom-denying effort at social control. Also, if society is an illusion, then an institution that taxes the individual for its upkeep is little more than a con artist. The British Prime Minister Margaret Thatcher was an advocate of this outlook. Here is how she put it: “I think we have gone through a period when too many people … understand that if they have a problem, it is the government’s job to cope with it!… ‘If I am homeless, the government must house me!’ and so they are casting their problems on society and who is society? There is no such thing! There are individual men and women and there are families and no government can do anything except through people and people look to themselves first. …There is no such thing as society.” This is faulty logic. Some problems, like poverty and homelessness, can only be understood and dealt with within a societal context. Thatcher would have none of that. Since society does not really exist, problems with societal roots can’t be real either. If Thatcher were alive today, she would probably admit that the Covid-19 pandemic was very real, but otherwise would be reluctant to deal with it in any collective manner—just as are our perverse defenders of “freedom.” The madness of these rightwing provocateurs is largely ideological in the Thatcher sense. It is also underlaid with a strong selfishness that really has nothing to do with economic hardships of lockdown. What they are saying is that “I don’t care about other people. I don’t want to wear a mask and social distance, and you can’t make me.” It is the ideology of selfish children and this attitude can drive people to act out in the same way it drives five-year-olds to have temper tantrums. Unfortunately, these protesters are not just children and their acting out goes beyond sloganeering. Since April 2020, numerous public health workers, particularly those with policy-making input, have faced threats and intimidation. Sometimes this is through e-mail or Facebook or over the phone. Sometimes it is having to face an armed mob at your front door. Here are a few recent examples: —Lauri Jones, director of public health in a county in western Washington state, followed up on someone breaking a Covid-19 quarantine. Immediately she faced a barrage of threatening calls and e-mails from not just her home area but from around the country. Her address was posted on Facebook. She called the police and had to set up surveillance cameras at her home. —Amy Acton, Ohio’s public health director “endured months of anger against the state’s preventive measures, including armed protests at her home.” One Republican legislator called her a Nazi (Acton is Jewish) and another labeled her a dictator. She has since quit her job and now consults for the state’s health department. —Georgia’s public health director has been assigned an armed guard. —Pennsylvania’s secretary of health, who is transgender, has been publicly harassed for her role in fighting the pandemic. One Republican county official said that he was “tired of listening to a guy dressed up as a woman.” —Then there is the emotion expressed following a recent Palm Beach county commissioners meeting. The commissioners had voted unanimously to make masks mandatory in the county. Those in the audience denounced the commissioners and threatened them with “citizen’s arrest.” They made the following accusations: “masks are killing people,” masks “toss God’s wonderful breathing system out the window,” and to mandate masks is to follow the “devil’s laws.” Perhaps the best summing up of this “demoralizing” nationwide situation comes from Theresa Anselmo, executive director of the Colorado Association of Local Public Health Officials—eighty percent of whose members have been threatened with dismissal or were outright fired from their jobs. “We’ve seen from the top down that the federal government is pitting public health against freedom, and to set up that false dichotomy is really a disservice to the men and women who have dedicated their lives . . . to helping people.” Ideally, we are supposed to teach our kids that freedom comes with responsibility. Take away a sense of responsibility to others and what you are left with the perverted freedom to be selfish. And, often that selfishness is blind to its own lethal consequences. There is a precedent for this sort of selfishness tied to a perverse claim of freedom—it is the American insistence that gun ownership is a right and a primary symbol of freedom. Here in the U.S., an average of 109 people a day are killed with guns, sometimes in quite spectacular fashion, as in the case of mass shootings. We endure it, or perhaps more accurately we choose to ignore it, because an influential, militant and bullying minority has stymied the political will to reign it in. This is a situation that is suggestive of willful madness. The same appears to be happening in the case of Covid-19. In the last six months over 2 million Americans have fallen ill with Covid-19 and the death toll stands at around 130,000. The present infection and fatality rates are climbing. It seems that after several months of lockdown, which had hurt the economy and increased unemployment while simultaneously bringing the pandemic under control, the will to continue restrictions has largely broken down. Both politicians and the populace appeared to have given up and, as one of those sloganeering signs put it, silently agreed to “sacrifice the weak and reopen.” And almost everywhere they did reopen, the Covid-19 virus returned with a vengeance. It was when a moderate state counter-response, mandating masks and social distancing in public and business environments, was attempted that the militant bullying by Republican politicians, armed “patriots,” and disgruntled religious fundamentalists picked up steam. What now is likely to follow? Future prospects are described by Dr. Megan Ranney, an emergency physician and Brown University professor who promotes gun violence prevention. She explains that the “dynamics of the lockdown protesters” are similar to those of the gun rights advocates. Both groups of militants “moved the … debate” from a conversation about, first an epidemic of gun injuries, and now the wisdom of health and science in the face of a pandemic, to “a conversation about liberty.” Thus we are no longer talking about “weighing risks and benefits” and are instead involved in “a politicized narrative” about alleged individual rights. This is also a zero-sum narrative because this claim of prioritized rights is, for its advocates, not negotiable. So there we have it. It is a fight between a perverse notion of freedom and a collective sense of social responsibility. The interests of society—which are real despite the rhetoric of the late Margret Thatcher—already lost out once in the struggle with “gun rights” advocates. Will it lose out again to mad opponents of masking and social distancing? The chances are good that it will. Sickness and death may well be our fate until science, in the form of an adequate vaccine, saves us from ourselves. Lawrence Davidson is a retired professor of history from West Chester University in West Chester, Pennsylvania. He is the author of Islamic Fundamentalism, Cultural Genocide and has focused his academic research on American foreign relations with the Middle East. The views expressed in this article are solely those of the author and do not necessarily reflect the opinions of Information Clearing House. Official U.S. coronavirus death toll is ‘a substantial undercount’ of actual tally, Yale study finds Pandemic caused 18 pc rise in deaths in US: study Chomsky: We Must Not Let Masters of Capital Define the Post-COVID World", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/", "https://www.bbc.com/news/world-us-canada-52496514", "https://www.lrb.co.uk/the-paper/v42/n11/eliot-weinberger/the-american-virus", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://www.startribune.com/public-health-officials-facing-threats-and-political-pushback-are-leaving-their-posts-nationwide/571430012/", "https://www.cnn.com/videos/health/2020/06/23/coronavirus-symptoms-long-haulers-newday-vpx.cnn/video/playlists/coronavirus/", "https://www.startribune.com/public-health-officials-facing-threats-and-political-pushback-are-leaving-their-posts-nationwide/571430012/", "https://en.wikipedia.org/wiki/Gun_violence_in_the_United_States", "https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html", "https://www.nytimes.com/2020/05/05/opinion/coronavirus-deaths.html", "https://tothepointanalyses.com/covid-madness/", "https://www.cnbc.com/2020/07/01/official-us-coronavirus-death-toll-is-a-substantial-undercount-of-actual-tally-new-yale-study-finds.html", "https://www.france24.com/en/20200701-pandemic-caused-18-pc-rise-in-deaths-in-us-study", "https://truthout.org/articles/chomsky-we-must-not-let-masters-of-capital-define-the-post-covid-world/?eType=EmailBlastContent&eId=b9966d26-1224-4672-a3ed-8c1a928202d7"], "authors": [], "publish_date": null}