{"result_id": "168030", "URL": "http://www.informationclearinghouse.info/56187.htm", "timestamp": "2023-04-25 15:38:49 CEST+0200", "meta": {"description": "The Commons Project’s technology, created in partnership with the Rockefeller Foundation,", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56187.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion: - Tech coalition working to create digital COVID-19 vaccination passport", "cleaned_text": "January 15, 2021 \" \" - A coalition of health and technology organizations are working to develop a digital COVID-19 vaccination passport to allow businesses, airlines and countries to check if people have received the vaccine.\n\nThe Vaccination Credential Initiative, announced on Thursday, is formulating technology to confirm vaccinations in the likelihood that some governments will mandate people provide proof of their shots in order to enter the nation.\n\nThe organization hopes the technology will allow people to \"demonstrate their health status to safely return to travel, work, school and life while protecting their data privacy.\"\n\nThe initiative, which includes members like Microsoft, Oracle and U.S. nonprofit Mayo Clinic, is using the work from member Commons Project’s international digital document that verifies a person has tested negative for COVID-19, the Financial Times reported.\n\nThe Commons Project’s technology, created in partnership with the Rockefeller Foundation, is being utilized by three major airline alliances.\n\nThe coalition is reportedly in discussions with several governments to create a program requiring either negative tests or proof of vaccination to enter, Paul Meyer, the chief executive of The Commons Project, told the Times.\n\n“The goal of the Vaccination Credential Initiative is to empower individuals with digital access to their vaccination records so they can use tools like CommonPass to safely return to travel, work, school, and life, while protecting their data privacy,” Meyer said in a release.\n\nThe people who have vaccinated are currently receiving a piece of paper confirming their vaccination he said, but the coalition could develop a digital certificate using electronic medical records.\n\nThe technology will need to allow patients to keep their data secure while being available in a digital wallet or a physical QR code for them to regulate who sees the information.\n\nThe Vaccination Credential Initiative expects certain businesses such as event planners and universities will require their consumers, students and workers to provide proof of vaccination, according to the Times.\n\nA coalition of health and technology organizations are working to develop a digital COVID-19 vaccination passport to allow businesses, airlines and countries to check if people have received the vaccine. The Vaccination Credential Initiative, announced on Thursday, is formulating technology to confirm vaccinations in the likelihood that some governments will mandate people provide proof of their shots in order to enter the nation. The organization hopes the technology will allow people to \"demonstrate their health status to safely return to travel, work, school and life while protecting their data privacy.\" The initiative, which includes members like Microsoft, Oracle and U.S. nonprofit Mayo Clinic, is using the work from member Commons Project’s international digital document that verifies a person has tested negative for COVID-19, the Financial Times reported. The Commons Project’s technology, created in partnership with the Rockefeller Foundation, is being utilized by three major airline alliances. The coalition is reportedly in discussions with several governments to create a program requiring either negative tests or proof of vaccination to enter, Paul Meyer, the chief executive of The Commons Project, told the Times. “The goal of the Vaccination Credential Initiative is to empower individuals with digital access to their vaccination records so they can use tools like CommonPass to safely return to travel, work, school, and life, while protecting their data privacy,” Meyer said in a release. The people who have vaccinated are currently receiving a piece of paper confirming their vaccination he said, but the coalition could develop a digital certificate using electronic medical records. The technology will need to allow patients to keep their data secure while being available in a digital wallet or a physical QR code for them to regulate who sees the information. The Vaccination Credential Initiative expects certain businesses such as event planners and universities will require their consumers, students and workers to provide proof of vaccination, according to the Times.\n• Hospital offering employees money in exchange for getting COVID-19... Mike Sicilia, the executive vice president of Oracle's Global Business Units, said in a statement said the passport \"needs to be as easy as online banking.\" \"We are committed to working collectively with the technology and medical communities, as well as global governments, to ensure people will have secure access to this information where and when they need it,\" he added. The project is also developing as new strains of COVID-19 are popping up worldwide, including the spread of the variant believed to be more contagious that was discovered in the United Kingdom.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/", "https://www.ft.com/content/cf971639-3836-4c2b-93f6-622d4e0846ad", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://www.businesswire.com/news/home/20210114005294/en/Broad-Coalition-of-Health-and-Technology-Industry-Leaders-Announce-Vaccination-Credential-Initiative-to-Accelerate-Digital-Access-to-COVID-19-Vaccination-Records", "https://www.ft.com/content/cf971639-3836-4c2b-93f6-622d4e0846ad", "https://www.businesswire.com/news/home/20210114005294/en/Broad-Coalition-of-Health-and-Technology-Industry-Leaders-Announce-Vaccination-Credential-Initiative-to-Accelerate-Digital-Access-to-COVID-19-Vaccination-Records", "https://thehill.com/policy/healthcare/534253-hospital-offering-employees-money-in-exchange-for-getting-covid-19-vaccine?utm_source=thehill&utm_medium=widgets&utm_campaign=es_recommended_content", "https://thehill.com/policy/finance/534203-markets-rise-ahead-of-biden-proposal-despite-jobless-spike?utm_source=thehill&utm_medium=widgets&utm_campaign=es_recommended_content", "https://thehill.com/policy/technology/534228-tech-coalition-working-to-create-digital-covid-19-vaccination-passport"], "authors": [], "publish_date": null}