{"result_id": "168012", "URL": "http://www.informationclearinghouse.info/57350.htm", "timestamp": "2023-04-25 15:38:42 CEST+0200", "meta": {"description": "Don’t blame the virus. Blame capitalism and its political minions who willingly sacrifice their people on the altar of private profit.", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/57350.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "U.S. Versus China Covid Deaths – A Symptom of Diseased Capitalism", "cleaned_text": "Purpose and Intent of this website: The death toll from the Covid-19 pandemic in the United States is now well over 1.1 million. New mass infections and the proliferation of immune-resistant virus variants indicate the death toll will continue to rise as the third winter of the pandemic hits. Europe faces a similarly bleak outlook of mounting sickness and deaths from the novel coronavirus known as SARS-Cov-2, which has undergone numerous mutations since the world pandemic was declared in early 2020. This is while Western governments pretend that the pandemic is over and adopt a policy of their populations “living with Covid”. Let’s put these figures in perspective. The worldwide total deaths from the disease are estimated at 6.6 million, according to the authoritative Johns Hopkins University. The U.S. death toll of 1.1 million (and counting) represents over 16 percent of the world’s total even though its national population is only about 4.2 percent of the globe. China’s deaths from Covid-19 are around 5,200, according to the same database. That is an astounding three orders of magnitude smaller. Even though China has a population nearly four times that of the United States, its mortality figure is less than 0.5 percent of the U.S. China’s population of 1.4 billion people is about 18.5 percent of the globe. That means its death toll from Covid-19 is approximately 0.00006 percent of the global deaths from the disease. Again, the U.S. Covid death toll is nearly 16 percent of the world. Surely, any rational-thinking person would want to explore the reasons for such a vast disparity. But not, it seems, in the West where the corporate media’s function is to stifle critical thinking. The stark and shocking contrast in these U.S. and China figures is down to the difference between capitalism and socialism. The United States as with its capitalist European allies has prioritized the imperative of private profit over public health – by a long shot. Western governments have rushed to contrive a return to “normal” business as usual. They have relied on a vaccine-only solution which is shown to be futile as the pandemic rebounds across their populations. An aggravating factor in the West has been the denialism about the realities of the Covid-19 disease. Many Americans in the ilk of former President Donald Trump disparage the virus as a hoax and view the wearing of face masks and getting vaccinated as an infringement on their “rights to individual freedom”. The headlong rush to restore capitalist profits as well as divisive politics in the West have conspired to militate against implementing a coherent and effective public health management strategy to eradicate the coronavirus. By contrast, China has consistently implemented a zero-Covid policy. China’s socialist government has allocated financial and human resources to pursue a comprehensive strategy for eradicating the disease. This has involved engaging in lockdowns of cities where outbreaks occur, mass tracking and tracing using hi-tech telecommunications and widely available public testing for the disease. Chinese people have also shown commendable rational and ethical thinking about protecting others and working collectively for the common good to defeat a lethal disease. Quarantine practices in China certainly can be inconvenient for normal daily life and travel. (I spent 10 days in quarantine during a recent trip to China.) But the upshot is that it works to contain and mitigate the disease. The minor death toll from the pandemic relative to the United States and Europe demonstrates the success of China’s protection of public health. Chinese President Xi Jinping has said that the cornerstone of his country’s zero-Covid policy is the protection of public health. Short-term commercial considerations are secondary. On a social and long-term economic timeline, the Chinese policy is more viable as well as ethical. As the Western ongoing death and suffering from the pandemic illustrate, the priority of capitalist profit-making is self-defeating at the social level. There are sound scientific reasons why capitalism is failing over the pandemic. The so-called “living with Covid” attitude of Western governments is allowing the virus to persist and thereby mutate into more lethal variants. What is even more disturbing, the newer sub-variants such as Omicron BA.5 are showing a high level of immune-resistance. After spending billions of dollars and euros to benefit private pharmaceutical companies to develop Covid vaccines these vaccines may well become redundant. New research published earlier this month also shows that reinfection with Covid-19 is leading to greater long-term illness and mortality from other diseases of the heart, lungs, and other organs. Reinfections appear to be increasing across the United States and Europe as the pandemic persists. A Reuters report on the study said: “Reinfected patients had a more than doubled risk of death and a more than tripled risk of hospitalization compared with those who were infected with Covid just once. They also had elevated risks for problems with lungs, heart, blood, kidneys, diabetes, mental health, bones and muscles, and neurological disorders, according to a report published in Nature Medicine.” China has succeeded spectacularly in controlling Covid-19 and protecting its population precisely because its government has adhered to socialist policies. It is rather absurd, if not obscene, that Western media have tended to deprecate China over its “zero-Covid policy” because purportedly this is not emulating Western capitalism. The horrendous, unnecessary death toll in the United States and Europe has been caused not so much by a virus but by an underlying disease of capitalist psychopathy. The callous, deliberate killing of people from dereliction of duty to conduct a humane and ethical health policy is the despicable, criminal result. Don’t blame the virus. Blame capitalism and its political minions who willingly sacrifice their people on the altar of private profit. The system is anti-human and irrational from any basic moral point of view. It is a failure as a social organizing principle more than ever at this moment in history. This diseased political system is also why the United States and its European “partners” would rather fund a bloody war in Ukraine against Russia or over Taiwan against China – rather than actually feed, house and care for their own increasingly desperate people. has written extensively on international affairs, with articles published in several languages. He is a Master’s graduate in Agricultural Chemistry and worked as a scientific editor for the Royal Society of Chemistry, Cambridge, England, before pursuing a career in newspaper journalism. He is also a musician and songwriter. For nearly 20 years, he worked as an editor and writer in major news media organisations, including The Mirror, Irish Times and Independent. Views expressed in this article are solely those of the author and do not necessarily reflect the opinions of Information Clearing House. in this article are solely those of the author and do not necessarily reflect the opinions of Information Clearing House. Advertising - No Government Grants - - This Is Independent Registration is not necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/intent.htm", "http://www.informationclearinghouse.info/", "https://strategic-culture.org/news/2022/11/19/us-versus-china-covid-deaths-symptom-diseased-capitalism/", "https://coronavirus.jhu.edu/map.html", "https://news.yahoo.com/repeat-covid-riskier-first-infection-160323961.html", "https://fair.org/home/us-media-searched-for-crisis-at-china-party-congress/", "https://cse.google.com/cse?cx=010732926337524982427%3Ava4-o-6opiq&ie=UTF-8&siteurl=www.google.com%2Fcse%2Fhome%3Fcx%3D010732926337524982427%3Ava4-o-6opiq&q=Finian+Cunningham&sa=Search&siteurl=%2FE%3A%2FICH%2520Website%2Findex.html&ref=&ss=#gsc.tab=0&gsc.q=Finian%20Cunningham&gsc.page=1", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267"], "authors": [], "publish_date": null}