{"result_id": "168033", "URL": "http://www.informationclearinghouse.info/57299.htm", "timestamp": "2023-04-25 15:38:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/57299.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Cuba in the Eye of Washington’s Hurricane", "cleaned_text": "Hurricane Ian lashed at western Cuba on September 27, 2022. I waited desperately for a phone call from my friends in Puerto Esperanza, a small fishing village on the northern coast of Pinar del Río. Over a crackling phone line, my friends told me that the hurricane had ripped off the roofs of their houses and had cut their electricity supply. But they were safe. What comes next for them and their recovery from the loss and devastation caused by the hurricane is uncertain under the weight of a U.S. blockade that is now being overseen by U.S. President Joe Biden.\n\nSince the Cuban Revolution triumphed in 1959, the United States has been at odds with the island’s independent path. This led to the start of a blockade on all trading activities between Cuba and the United States in February 1962, and the continued imposition of the blockade has put maximum pressure on the 11 million people who live on the island. Cubans have been resilient while dealing with these sanctions, which is “the longest embargo in modern history.” However, over the past five years, the United States has tightened its blockade by putting in place 243 new sanctions, reversing the process of normalization that began under former U.S. President Barack Obama in 2014 (and culminated in Obama’s visit to Cuba in 2016). Despite Biden’s campaign promise to ensure a more balanced foreign policy toward Cuba, compared to the approach followed by former President Donald Trump, Biden has increased pressure on the country.\n\nWhen the COVID-19 pandemic struck, Cuba was fortunate to have a robust public health care system and an innovative biotechnological industry. However, under Trump—and later Biden—sanctions put enormous pressure on Cuba’s ability to respond to the pandemic. As the number of Delta variant cases grew in Cuba, its only oxygen plant was rendered nonoperational due to the inability of the plant’s technicians to import spare parts because of the U.S. blockade. As thousands of Cuban patients gasped for air, oxygen had to be rationed. Washington refused to make an exception. Cuban scientists created five vaccine candidates; only after most Cubans were vaccinated with these vaccines did Washington make an offer of donating U.S.-made vaccines to Cuba.\n\nBack in 2017, the United States said that the Cuban government had used sonic weapons to attack its embassy—a phenomenon called “Havana syndrome”—which was shown to be untrue. Nonetheless, it served as a pretext for the United States to freeze relations with Cuba. For example, tourism began to collapse, and the island lost revenue as more than 600,000 people from the United States stopped traveling to Cuba annually. The U.S. government’s sanctions under Trump led to Western Union’s seizing operations on the island in 2020, cutting off the ability of families to send and receive remittances. Visa services were suspended by the U.S. Embassy in Havana, and the largest wave of irregular migration since 1980 began as Cubans were forced to trek through Central America or across the Florida Straits to arrive in the United States.\n\nCubans suffered through this tightened blockade with the U.S. offering no respite. The gross domestic product of the country began to shrink as the government and other entities could no longer purchase food, medicine, and oil because banks refused to handle these basic commercial transactions.\n\nUsing Pain to Put More Pressure\n\nOn July 11, 2021, people across Cuba took to the streets to protest the difficult living conditions due to the scarcity brewed by the sanctions imposed by Washington. The U.S. government, from Biden to the lowest employee at the U.S. Embassy in Havana, did not waste any time before making a statement about the need to change the government in Cuba in response to the protests. They tried to spin the Cuban people’s protests over sanctions-related deprivation into an uprising for regime change, a core demand of a Miami mafia of Cuban exiles. The Cuban government was able to withstand that attempt by being as forthright as possible with the people about the range of problems that they face.\n\nThe year 2022 has not been any easier for the Cuban people. In August, the national energy grid began to suffer major signs of decay after years without repairs or renovations. Power cuts, a stark reminder of the “special period” during the 1990s when Cuba faced a similar power situation, have become ever-present from one end of the island to the other. Some provinces go without electricity for eight to ten hours. Then came the explosion of the Matanzas oil storage facility that left Cuba without urgently needed fuel and resulted in dozens dying while fighting the fire that raged on for five days. While Mexico and Venezuela immediately sent firefighters and equipment, the United States could only contribute with technical advice over the phone despite the call by U.S. activists, clergy, and intellectuals to provide more sizable aid.\n\nHurricane Ian’s assault on the island on September 27, 2022, has left behind devastation, with more than 50,000 homes damaged, Cuba’s tobacco crop deeply impacted, and its electricity grid damaged (although it is functional again for now).\n\nAll eyes turned to Washington—not only to see whether it would send aid, which would be welcome, but also if it would remove Cuba from the state sponsors of terrorism list and end the sanctions. Cuba’s inclusion on the list had been a last-minute decision made by Trump as he was leaving the White House (despite Cuba’s recognized role in the Colombian peace process). These measures mean that banks in the United States and elsewhere are reluctant to process any financial transactions, including humanitarian donations, for the island. The United States has a mixed record regarding humanitarian aid to Cuba.\n\nRather than lift the sanctions even for a limited period, the U.S. government sat back and watched as mysterious forces from Miami unleashed a torrent of Facebook and WhatsApp messages to drive desperate Cubans onto the street. In Havana, a few hundred people spread across the city banged pots and pans and demanded water, electricity, and food. Foreign journalists eagerly expected scenes of heavy repression and mass arrests, but this time Cuba’s response was one closest to its political tradition. Leaders of the Communist Party began to arrive at protests to speak to the people. Angel Arzuaga Reyes, responsible for the party’s international relations department, while speaking of his experience in the Diez de Octubre neighborhood, said that in those tense moments, promises or immediate solutions couldn’t be made, but explanations and information could be given to all those protesting.\n\nThe Cuban people are not the kind to give up easily and have a history of resilience. Many Cubans are facing the crisis by laughing and fighting through it. Walking in Havana only a few days after the hurricane, the signs of recovery were clear. Brigades of electricians working nonstop reestablished power back in record time and volunteers have cleaned most of the city leaving very little trace of Hurricane Ian’s destruction. After his fourth visit to Pinar del Río since September 27, Cuban President Miguel Díaz-Canel, surrounded by an anxious crowd, said, “what we can’t do is surrender or remain with our arms crossed.” There is yet much to do, but Cubans are determined to overcome all obstacles that come their way.\n\nManolo De Los Santos is the co-executive director of the People’s Forum and is a researcher at Tricontinental: Institute for Social Research. He co-edited, most recently, Viviremos: Venezuela vs. Hybrid War (LeftWord Books/1804 Books, 2020) and Comrade of the Revolution: Selected Speeches of Fidel Castro (LeftWord Books/1804 Books, 2021). He is a co-coordinator of the People’s Summit for Democracy.\n\nViews expressed in this article are solely those of the author and do not necessarily reflect the opinions of Information Clearing House. in this article are solely those of the author and do not necessarily reflect the opinions of Information Clearing House. Advertising - No Government Grants - - This Is Independent", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/", "https://go.ind.media/e/546932/-devastation-of-hurricane-ian-/rmzbs2/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-devastation-of-hurricane-ian-/rmzbs2/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/022-06-02-cubas-non-alignment-/rmzbs5/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-us-trade-sanctions-turn-sixty/rmzbs8/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-for-Cubans-20220907-0003-html/rmzbsc/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-for-Cubans-20220907-0003-html/rmzbsc/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/at-cubas-matanzas-oil-storage-/rmzbsg/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/issues-foreign-policy-cuba/rmzbsk/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/5-89c3-a647fcce95e0-story-html/rmzbsn/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-of-trump-s-sanctions-strategy/rmzbsr/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/government-biden-pressure-html/rmzbsv/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/k-vaccines-healthy-2021-08-17-/rmzbsy/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/covid-19-crisis-say-un-experts/rmzbt2/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-but-5-covid-vaccines-its-cuba/rmzbt5/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-sea-cuba-official-2021-07-15-/rmzbt8/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/e-us-fantasy-of-sonic-attacks-/rmzbtc/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/s-overall-drop-tourism-n868856/rmzbtg/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/5-cuba-ferry-service-26943447-/rmzbtk/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/ransfers-to-cuba-idUSKBN27U083/rmzbtn/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/ld-americas-cuba-us-visas-html/rmzbtr/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/n-migration-united-states-html/rmzbtv/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/ft-coup-attempts-idUSL1N2IY01N/rmzbty/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/ion-protest-july-united-states/rmzbv2/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-biden-jr-on-protests-in-cuba-/rmzbv5/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/the-blockade-and-the-pandemic-/rmzbv8/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/e-recent-protests-differently-/rmzbvc/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/ens-maximum-pressure-campaign-/rmzbvg/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/y-grid-need-overhaul-rcna46403/rmzbvk/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/rn-to-90s-austerity-amid-cuts-/rmzbvn/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/at-cubas-matanzas-oil-storage-/rmzbvr/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/clare-sanctions-fuel-the-fire-/rmzbvv/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-devastation-of-hurricane-ian-/rmzbs2/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/rgent-appeal-let-cuba-rebuild-/rmzbvy/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/-devastation-of-hurricane-ian-/rmzbs2/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/f-state-sponsors-of-terrorism-/rmzbw2/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/orism-sanctions-in-waning-days/rmzbw5/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/mbia-farc-peace-deal-87432410-/rmzbw8/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/watch-v-IrjugdWE--w/rmzbwc/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/do-a-nadie-07-10-2022-23-10-39/rmzbwg/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/2022-10-16/rmzbwk/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/2022-10-16/rmzbwn/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/catalog-product-view-id-22050/rmzbwr/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/iremos-venezuela-vs-hybrid-war/rmzbwv/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/catalog-product-view-id-22524/rmzbwy/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/ected-speeches-of-fidel-castro/rmzbx2/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://go.ind.media/e/546932/2022-10-16/rmzbx5/1167755185?h=LStDxcvfBSR1ILKK_izjg4QrO_YdfX2Fda6we8624LI", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267"], "authors": [], "publish_date": null}