{"result_id": "168025", "URL": "http://www.informationclearinghouse.info/56841.htm", "timestamp": "2023-04-25 15:38:47 CEST+0200", "meta": {"description": "Andrews has spent the last two years turning Victoria into a police state", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56841.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "An Australian horror story : Opinion:", "cleaned_text": "Purpose and Intent of this website: The Premier of the Australian state of Victoria, Daniel Andrews, has just tabled legislation in parliament which is possibly the most monstrous ever introduced into a country calling itself democratic. Basically it gives Andrews the power to do whatever he wants and whenever he wants it. He has been turning Victoria into a police state for the past year and a half but behind the bland face and earnest manner, the legislation openly stamps him as a totalitarian psychopath. Here are some of the salient points of the Public Health and Wellbeing Amendment (Pandemic Management) Bill 2021. Read on and be amazed that this can actually be happening in Australia, the laidback happy country of beaches, sunshine, beer and prawns on the barby. . The legislation allows Andrews to declare a pandemic even if there is not one. He only has to think there could be one. This antipodean combination of commissar and gauleiter is taking complete personal control of the state and its people. He can close down parts of the state or the whole state and prevent people from entering or leaving in whole or part. He can extend closures without limit. Enforcement will rest in the hands of police and ‘authorised officers.’ For those who don’t do what they are told there will be heavy fines, up to $90,000 for individuals and $450,000 for businesses. People can be detained for two years and will have to pay the cost of their own detention in the massive internment camp that has been built at Mickleham, on the outskirts of Melbourne. The legislation authorizes police to use ‘reasonable force’ to help an ‘authorised officer’ when he/she detains them. The Mickleham camp is capable of taking in thousands of people. The likely victims in this Australian gulag will be the minority who have refused vaccination either on the basis of their human right to reject medical intervention they don’t want or because of the known dangers to health of the vaccines on offer, known to them but suppressed from public knowledge by the media. Abused by the politicians and media commentators, shut out of many normal activities of daily life, they have already been turned into social pariahs whom those who obey orders without asking questions will no doubt think will deserve to be locked away in this Australian gulag. The legislation includes a points system as punishment for bad behavior. Individuals and business owners who don’t obey an authorized officer will lose points and more points if the offence is regarded as aggravated. What Andrews has done here is slip into the legislation the beginning of a social credit system of full state control of the individual’s life. No Advertising - No Government Grants - This Is Independent Media People can be detained on the basis of their ‘characteristics, attributes and circumstances’ as assessed by an authorised officer. This extraordinary clause surely has no parentage in any legislatiuon passed in any country regarding itself as democratic. It would seem to allow the detention of anyone for any reason. Detained individuals can be required to submit to medical testing and their detention can be extended if they refuse to accept it. If they cannot pay the cost of their detention, however long it might be, they will be fined. All orders can be extended or varied without limit by Andrews or his health minister. Police can enter premises without a warrant. Information can be extracted from people who have been detained, not just names and addresses but 'any other information' an authorised officer might want. How this might be done if the detaained person does not want to give this information is not explained. Public and private meetings can be banned and businesses closed. Daniel Andrews has spent the last two years turning Victoria into a police state, The damage he has done has been colossal at the economic, social level and even medical level. Thousands of businesses have been ruined and the state has been plunged into debt (from $29 billion in 2019 to an estimated $155 billion in 2023/24). Mental health problems have soared because of close to two years of lockdowns and many have been blocked from receiving the medical treatment they need because of the focus on the virus. In 2020 more than 650 people died in aged care homes. Official inquiries have pointed the finger of blame at the federal and sate governments and ther management of the homes for neglect and/or maladministration. Of the 915 people who died from./with the virus from January 2020 to July 2021, 820 were in Victoria. The record is shocking yet thanks largely to the complicity of the media and the ignorance of indifference of a panicked/terrorised population Andrews has never been held to account, The national broadcaster, the ABC (Australian Broadcasting Commission) and the Melhourne newspaper the ‘Age’ are especially culpable, They have run Andrews’ propaganda campaign for him, suppressing all information that gets in the way of ‘vaccine hesitancy,’ from deficiencies in the PCR test to the tens of thousands of post-vaccination deaths in Europe, the UK and the US. Hundreds have died already in Australia but this is not up for discussion. Neither is the limited efficacy of the vaccines. In the past year the editor of the ‘Age’, Gay Alcorn, has gone to far as to suppress 12 cartoons drawn by Michael Leunig, officially designated as a ‘living national treasure’ for his artistry and drawing for the ‘Age’ for half a century. She followed her suppression of his cartoons by removing him completely from the news pages. Leunig has been a lone dissenting voice amidst a torrent of government propaganda yet even he had to be silenced, One of his most striking suppressed cartoons is a play on the lone protestor facing the tank in Tiananmen square. Leunig turns the gun barrel into a syringe aimed at one of his typically bewildered characters. ‘Age’ readers were incensed and supported the censorship but this legislation shows that Leunig’s instincts were100 per cent spot on. This permanent pandemic legislation now shreds what is left of human rights in Victoria. The head of the Victorian Bar Council has compared it to the laws enforced by the state security service (STASI) in former east Germany. He said it allowed virtually unlimited interference in the civil liberties of the Victorian people, with little in the way even of consultation. A human rights council will be set up, but clearly for cosmetic purposes as it has no power to restrain Andrews, There has been no public debate, because nothing was known about the legislation outside the government until the day before this 121 page document was introduced in parliament. The law is now effectjvely what Andrews says it is. The barriers to stopping him are very thin. He has a majority in parliament, and a weak opposition, Even the Greens and the Animal Welfare Party have supported this legislation, no doubt having struck some kind of deal with Andrews. The federal government could possibly override the legislation on any number of grounds but its silence indicates not just that it will not intervene but that Victoria is perhaps being set up as a template for what is to come across the country and elsewhere to bring about the dystopian ‘great reset.’ Thanks to Scott Morrison, the Prime Minister, Australia has been closed off to the world for close on two years. Its citizens have been unable to return and they have to apply for an exemption to leave. Few exemptions are being granted. Their rights under international law have been completely violated. The tens of thousands of Australian nationals stranded in other countries have no access to government services and state and federal governmentrs and the media are indiffgerent to their plight. State borders remain closed. with thousands of elderly Victorians who had travelled north to escape winter stranded in NSW for three months because Andrews closed the border in July before they could reach it. How they survived in their caravans or hotels was their problem. Andrews didn’t care and neither did the media. MPs who have refused vaccination cannot enter the Victorian parliament building, allowing Andrews to narrowlyndefeat an attempt to set up an inquiry into his mishandling of the pandemic. On the national front. the deputy president of the Fair Work Comnmission has been suspended from the bench after issuing a dissenting opinion in which she described mandatory vaccination as a violation of medical ethics and international law. She has been ordered to undergo ‘professional training’, re-education in other words, so she does not repeat her mistake, She is completely correct in her reading of the law. Mandatory/coerced vaccination also violates the ethics of the AMA (Australian Medical Association) but it has refused to take a public stand. This is Australia 2021, not Germany 1935/36. Those who sneer at the comparison are deceiving themselves as the essentials are the same, Just like middle class Germans, the majority of Victorians will be able to enjoy the same comfortable life as before as long as they do what they are told, believe what they are told and look the other way as the police break into homes and the internment camp fills up. It must be hoped the day will come when Andrews, the cabal around him and all those in public life who have deceived and betrayed the Victorian people, beginning with Daniel Andrews, will be held accountable, preferably in a court of criminal law. Registration is necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/intent.htm", "http://www.informationclearinghouse.info/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267"], "authors": [], "publish_date": null}