{"result_id": "168037", "URL": "http://www.informationclearinghouse.info/56333.htm", "timestamp": "2023-04-25 15:38:52 CEST+0200", "meta": {"description": "But it is a call to show a lot more humility and caution as we ponder our place in the natural world – as well as our constant urge to “fix” what the rest of the planet does not regard as broken.", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56333.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion: -Why politicians and doctors keep ignoring the medical research on Vitamin D and Covid", "cleaned_text": "February 18, 2021 \" \" - It is probably not a good idea to write while in the grip of anger. But I am struggling to suppress my emotions about a wasted year, during which politicians and many doctors have ignored a growing body of evidence suggesting that Vitamin D can play a critically important role in the prevention and treatment of Covid-19.\n\nIt is time to speak out forcefully now that a new, large-scale Spanish study demonstrates not a just a correlation but a causal relationship between high-dose Vitamin D treatment of hospitalised Covid patients and significantly improved outcomes for their health.\n\nThe pre-print paper in the Lancet shows there was an 80 per cent reduction in admission to intensive care units among hospitalised patients who were treated with large doses of Vitamin D, and a 64 per cent reduction in death. The possibility of these being chance findings are infinitesimally small, note the researchers. And to boot, the study found no side-effects even when these mega-doses were given short term to the hospitalised patients.\n\nThose are astounding figures that deserve to be on front pages, especially at a time when politicians and doctors are uncertain whether they can ever find a single magic-bullet vaccine against Covid as new variants pop up like spring daffodils.\n\nIf Vitamin D can approximate a cure for many of those hospitalised with Covid, one can infer that it should prove even more effective when used as a prophylactic. Most people in northern latitudes ought to be taking Vitamin D through much of the year in significant doses – well above the current, outdated 400IU recommended by governments like the UK’s.\n\nThis new study ought to finally silence the naysayers, though doubtless it won’t. So far it has attracted little media attention. What has been most troubling over the past year is that every time I and others have gently drawn attention to each new study that demonstrated the dramatic benefits of Vitamin D, we were greeted with knee-jerk dismissals that the studies showed only a correlation, not a causal link.\n\nThat was a deeply irresponsible response, especially in the midst of a global pandemic for which effective treatments are urgently needed. The never-satisfied have engaged in the worst kind of blame-shifting, implicitly maligning medical researchers for the fact that they could only organise small-scale, improvised studies because governments were not supporting and funding the larger-scale research needed to prove conclusively whether Vitamin D was effective.\n\nFurther, the naysayers wilfully ignored the fact that all the separate studies showed very similar correlations, as well as the fact that hospitalised patients were invariably deficient, or very deficient, in Vitamin D. The cumulative effect of those studies should have been persuasive in themselves. And more to the point, they should have led to a concerted campaign pressuring governments to fund the necessary research. Instead much of the medical community has wasted valuable time either ignoring the research or nitpicking it into oblivion.\n\nThere should have come a point – especially when a treatment like Vitamin D is very cheap and almost entirely safe – at which the precautionary principle kicked in. It was not only foolhardy but criminally negligent to be demanding 100 per cent proof before approving the use of Vitamin D on seriously ill patients. There was no risk in treating them with Vitamin D, unlike most other proposed drugs, and potentially much to gain.\n\nAlready the usual voices have dismissed the new Barcelona study, saying it has yet to be peer-reviewed. That ignores the fact that it is an expansion on, and confirmation of, an earlier, much smaller study in Cordoba that has been peer-reviewed and that similarly showed dramatic, beneficial outcomes for patients.\n\nIn addition to the earlier studies and the new one showing a causal link, there is plenty of circumstantial evidence to bolster the case for using Vitamin D against Covid.\n\nFor many years, limited studies – ones that Big Pharma showed no interest in expanding – had indicated that Vitamin D was useful both in warding off respiratory infections and in treating a wide variety of chronic auto-immune diseases such as diabetes and multiple sclerosis by damping down inflammatory responses of the kind that often overwhelm hospitalised Covid patients.\n\nBut many doctors and politicians were stuck in an old paradigm – one rooted in the 1950s that viewed Vitamin D exclusively in terms of bone health.\n\nThe role of Vitamin D – produced in the skin by sunlight – should have been at the forefront of medical research for Covid anyway, given that the prevalence of the disease, as with other respiratory infections, appears to slump through the sunny, summer months, and spikes in the winter.\n\nAnd while the media preferred to focus exclusively on poverty and racism as “correlative” explanations for the disproportionate number of deaths among BAME doctors and members of the public, Vitamin D seemed an equally, if not more plausible, candidate. Dark skins in cloud-covered northern latitudes make production of Vitamin D harder and deficiency more likely.\n\nWe should not be surprised that Big Pharma had no interest in promoting a vitamin freely available through much of the year and one they cannot license. They would, of course, rather patent an expensive magic bullet that offers the hope of enriching company directors and shareholders.\n\nBut that is why we have governments, isn’t it? They could have stepped in to pick up the bill for the research after profit-motivated firms had refused to do so – if not to safeguard the health of their populations, at least to keep their health budgets under control. Most developed countries, even those with lots of sunshine, have large sections of their population that are Vitamin D deficient, especially among the elderly and housebound, the very groups most affected by Covid.\n\nBut governments shirked their responsibility too. Most have not offered supplements beyond measly and largely useless 400IU tablets to the elderly, and they have failed to fortify foods. Those taking small doses are unlikely to significantly and quickly address any deficiency they have or maximise their resistance to Covid.\n\nTo give a sense of what was potentially at stake, consider the findings of one of last year’s correlative studies, done by a team in Heidelberg. Their work implied that, had the UK ensured its population was not widely Vitamin D deficient, many tens of thousands of lives might have been saved.\n\nThere are lessons – ones we seem very reluctant to learn – from the catastrophic failures of the past year. And they aren’t just lessons for the politicians.\n\nIf doctors and medical organisations had really been “following the science”, they would have led the clamour both for properly funded Vitamin D research and for its early use, if only on the precautionary principle. The reality is that very few did. In the UK it was left to MP David Davis, who trained as a molecular scientist, to take up the cause of Vitamin D and badger a government that has shown no inclination to listen.\n\nInstead, “follow the science” became a simple-minded mantra that allowed scientists to ignore the medical science when it did not lead them in the direction they had been trained to expect. “The science” told us to stay indoors, to minimise our contact with daylight, to limit our exposure to fresh air and exercise. We were required to abandon all traditional wisdom about our health.\n\nIf one wants to understand at least some of the resistance to lockdowns, it might be worth examining that instinct and how deeply – and rightly – ingrained it is in us.\n\nIf we learn anything from the past year it should be that the current, dominant, mechanistic view of medical science – one that too often disregards the natural world or even holds it in contempt – is deeply corrupting and dangerous.\n\nThis is not intended as a rant against science. After all, the mass production of Vitamin D – in the absence of useful sunshine in northern latitudes for much of the year – depends on scientific procedures.\n\nRather it is a rant against a blinkered science that has come to dominate western societies. Put simply, most experts – scientists and doctors – have not taken Vitamin D seriously, despite the growing evidence, because it is made in the mystical touch of sun on skin rather than by white-coated technicians in a laboratory.\n\nJust as most army generals are invested in war more than in peace because they would be out of job if we all chose to love one another, most scientists have been successfully trained to see the natural world as something to be interfered with, to be tamed, to be dissected, to be reassembled, to be improved. Like the rest of us, they have a need – a very unscientific one – to feel special, to believe that they are indispensable. But that arrogance comes at a cost.\n\nThe default assumption of many medical scientists was that any claim for Vitamin D – sunlight – having curative or protective properties against Covid-19 needed not urgent, further investigation but dismissal as quackery, as snake oil. How could nature possibly offer a Covid solution that scientists could not improve on?\n\nUnpopular as it may be to say it, that arrogance continues with the exclusive focus on vaccines. They will prove part of the way we emerge from the Covid winter. But we will be foolish indeed if we rely on them alone. We need to think about the way our societies are structured and the resulting unhealthy habits cultivated in us: the sedentary lifestyles many of us lead, the lack of exposure to nature and to sunshine, the gratuitous consumption on which our economies depend, and the advertiser-driven urge for instant gratification that has led to a plague of obesity.\n\nThere is no vaccine for any of that yet.\n\nAlready we are being forced into what are deeply troubling political debates – not scientific ones – around vaccines. Should vaccinations be made compulsory, or the vaccination-hesitant shamed into compliance? Should those who have received the vaccine be given special privileges through an immunity passport?\n\nThe reality is that whenever we try to “defeat” nature, as if our scientists were military generals waging war on the natural world, we are forced on to new and difficult ethical terrain. As we seek to “improve on” the natural world, we must also remake our social worlds in ways that invariably move us further from lifestyles that we have evolved to need, both physically and emotionally.\n\nThis is not a call to ignore science or reject Covid emergency measures. But it is a call to show a lot more humility and caution as we ponder our place in the natural world – as well as our constant urge to “fix” what the rest of the planet does not regard as broken. A year of Covid has shown how disruptive our meddling can be and how fragile the systems of progress we think we have permanently created really are.\n\nWhen our politicians and regulators agitate for tough new restrictions on the public’s right to free speech, claiming fake news and misinformation about Covid, maybe they should remember that trust has to be earnt, not mandated through laws. A world in which profit and power rule is also one in which the likely response from those who are ruled is doubt, scepticism or cynicism.\n\nMaybe I should not have written this while I was so angry. Or maybe others ought to be angry too – angry about the fact that many, many lives were almost certainly lost unnecessarily, and may continue to be lost, because those who profit from disease have no incentive to protect health.\n\nWe ought to be angry too about how in a better-ordered, more caring society, we might have found ways to avoid the worst excesses of lockdowns that have deprived our children of an education, of friendships, of play, of life in all its variety and excitement, and of sunshine. They lost all that while our politicians and their scientist enablers poured huge sums into labs, into test-tubes and into man-made magic bullets while contemptuously ignoring sunlight because it is free and everywhere and because it is a different kind of magic – the magic of the stars.\n\nThere has been the expected social media backlash from some quarters against this post. I even appear to have angered the odd white-coated lab technician! Some doubtless did not actually read beyond the soundbite I offered on social media. But sadly, others seem to be highly invested in deflecting from the central argument I am making. So here it is in a nutshell:\n\nThe only sane response to the Vitamin D medical studies showing dramatic benefits for those hospitalised with Covid is to demand urgent government funding of further research to test those findings and to use Vitamin D in hospitals in the meantime on the precautionary principle, given that it is very cheap and has proven to be completely safe.\n\nIf you are trying to obscure that point, you should do so only if you are absolutely certain that these medical studies are wrong. Otherwise your behaviour is, on the best interpretation, shamefully irresponsible.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "520", "height": "300", "embed_code": "<iframe allowfullscreen=\"allowfullscreen\" width=\"520\" height=\"300\" frameborder=\"0\" src=\"https://www.youtube.com/embed/oYK9-zvJF_k\" name=\"I1\">&lt;span&#13;data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; &#13;overflow: hidden; line-height: 0;\" &#13;class=\"mce_SELRES_start\"&gt;﻿&lt;/span&gt;</iframe>", "src": "https://www.youtube.com/embed/oYK9-zvJF_k"}], "links": ["http://www.informationclearinghouse.info/", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3771318#", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267"], "authors": [], "publish_date": null}