{"result_id": "168007", "URL": "http://www.informationclearinghouse.info/56926.htm", "timestamp": "2023-04-25 15:38:41 CEST+0200", "meta": {"description": "we should all call on Congress to stop the madness of ever-mushrooming war budgets", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/56926.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "It’s Time to Make Deep Cuts at the Pentagon - Opinion:", "cleaned_text": "Where are you going to get the money? That question haunts congressional proposals to help the poor, the unhoused, and those struggling to pay the mortgage or rent or medical bills, among so many other critical domestic matters. And yet — big surprise! — there’s always plenty of money for the Pentagon. In fiscal year 2022, in fact, Congress is being especially generous with $778 billion in funding, roughly $25 billion more than the Biden administration initially asked for. Even that staggering sum seriously undercounts government funding for America’s vast national security state, which, since it gobbles up more than half of federal discretionary spending, is truly this country’s primary, if unofficial, fourth branch of government.\n\nFinal approval of the latest military budget, formally known as the 2022 National Defense Authorization Act, or NDAA, may slip into January as Congress wrangles over various side issues. Unlike so much crucial funding for the direct care of Americans, however, don’t for a second imagine it won’t pass with supermajorities. (Yes, the government could indeed be shut down one of these days, but not — never! — the U.S. military.)\n\nSome favorites of mine among “defense” budget side issues now being wrangled over include whether military members should be able to refuse Covid-19 vaccines without being punished, whether young women should be required to register for the selective service system when they turn 18 (even though this country hasn’t had a draft in almost half a century and isn’t likely to have one in the foreseeable future), or whether the Iraq War AUMF (Authorization for Use of Military Force), passed by Congress to disastrous effect in 2002, should be repealed after nearly two decades of calamity and futility.\n\nAs debates over these and similar issues, predictably partisan, grab headlines, the biggest issue of all eludes serious coverage: Why, despite decades of disastrous wars, do Pentagon budgets continue to grow, year after year, like ever-expanding nuclear mushroom clouds? In other words, as voices are raised and arms waved in Congress about vaccine tyranny or a hypothetical future draft of your 18-year-old daughter, truly critical issues involving your money (hundreds of billions, if not trillions, of taxpayer dollars) go largely uncovered.\n\nWhat are some of those issues that we should be, but aren’t, looking at? I’m so glad you asked!\n\nBack in my Air Force days, while working in Cheyenne Mountain (the ultimate bomb shelter of the Cold War era), we talked about nuclear missiles in terms of their “throw-weight.” The bigger their throw-weight, the bigger the warhead. In that spirit, I’d like to lob seven throw-weighty questions — some with multiple “warheads” — in the general direction of the Pentagon budget. It’s an exercise worth doing largely because, despite its sheer size, that budget generally seems impervious to serious oversight, no less real questions of any sort.\n\nSo, here goes and hold on tight (or, in the nuclear spirit, duck and cover!):\n\n1. Why, with the end of the Afghan War, is the Pentagon budget still mushrooming upward? Even as the U.S. war effort there festered and then collapsed in defeat, the Pentagon, by its own calculation, was burning through almost $4 billion a month or $45 billon a year in that conflict and, according to the Costs of War Project, $2.313 trillion since it began. Now that the madness and the lying are finally over (at least theoretically speaking), after two decades of fraud, waste, and abuses of every sort, shouldn’t the Pentagon budget for 2022 decrease by at least $45 billion? Again, America lost, but shouldn’t we taxpayers now be saving a minimum of $4 billion a month?\n\n2. After a disastrous war on terror costing upward of $8 trillion, isn’t it finally time to begin to downsize America’s global imperial presence? Honestly, for its “defense,” does the U.S. military need 750 overseas bases in 80 countries on every continent but Antarctica, maintained at a cost somewhere north of $100 billion annually? Why, for example, is that military expanding its bases on the Pacific island of Guam at the expense of the environment and despite the protests of many of the indigenous people there? One word: China! Isn’t it amazing how the ever-inflating threat of China empowers a Pentagon whose insatiable budgetary demands might be in some trouble without a self-defined “near-peer” adversary? It’s almost as if, in some twisted sense, the Pentagon budget itself were now being “Made in China.”\n\n3. Speaking of China and its alleged pursuit of more nuclear weaponry, why is the U.S. military still angling for $1.7 trillion over the next 30 years for its own set of “modernized” nuclear weapons? After all, the Navy’s current strategic force, as represented above all by -class submarines with Trident missiles, is (and will for the foreseeable future be) capable of destroying the world as we know it. A “general” nuclear exchange would end the lives of most of humanity, given the dire impact the ensuing nuclear winter would have on food production. What’s the point of Joe Biden’s “Build Back Better” bill, if America’s leaders are preparing to destroy it all with a new generation of holocaust-producing nuclear bombs and missiles?\n\n4. Why is America’s military, allegedly funded for “defense,” configured instead for force projection and global strikes of every sort? Think of the Navy, built around aircraft carrier strike groups, now taking the fight to the “enemy” in the South China Sea. Think of Air Force B-52 strategic bombers, still flying provocatively near the borders of Russia, as if the movie had been released not in 1964 but yesterday. Why, in sum, does the U.S. military refuse to stay home and protect Fortress America? An old sports cliché, “the best defense is a good offense,” seems to capture the bankruptcy of what passes, even after decades of lost wars in distant lands, for American strategic thinking. It may make sense on a football field, but, judging by those wars, it’s been a staggering loss leader for our military, not to mention the foreign peoples on the receiving end of lethal weapons very much “Made in the USA.”\n\nInstead of reveling in shock and awe, this country should find the wars of choice it’s fought since 1945 genuinely shocking and awful — and act to end them for good and defund any future versions of them.\n\n5. Speaking of global strikes with awful repercussions, why is the Pentagon working so hard to encircle China, while ratcheting up tensions that can only contribute to nuclear brinksmanship and even possibly a new world war as early as 2027? Related question: Why does the Pentagon continue to claim that, in its “wargames” with China over a prospective future battle for the island of Taiwan, it always loses? Is it because “losing” is really winning, since that very possibility can then be cited to justify yet more requests for funds from Congress so that this country can “catch up” to the latest Red Menace?\n\n6. Speaking of global aggression, why does this country maintain a vast, costly military within the military that’s run by Special Operations Command and operationally geared to facilitating interventions anywhere and everywhere? (Note that this country’s special ops forces are bigger than the full-scale militaries of many countries on this planet!) When you look back over the last several decades, Special Operations forces haven’t proven to be all that special, have they? And it doesn’t matter whether you’re citing the wars in Vietnam, Iraq, or Afghanistan. Put differently, for every SEAL Team 6 mission that kills a big bad guy, there are a surprising number of small-scale catastrophes that only alienate other peoples, thereby generating blowback (and so, of course, further funding of the military).\n\n7. Finally, why, oh why, after decades of military losses, does Congress still defer so spinelessly to the “experience” of our generals and admirals? Why issue so many essentially blank checks to the gang that simply can’t shoot straight, whether in battle or when they testify before Congressional committees, as well as to the giant companies (and congressional lobbying monsters) that make the very weaponry that can’t shoot straight?\n\nIt’s a compliment in the military to be called a straight shooter. I suggest President Biden start firing a host of generals until he finds a few who are willing to do exactly that and tell him and the rest of us some hard truths, especially about malfunctioning weapons and lost wars.\n\nForty years ago, after Ronald Reagan became president, I started writing in earnest against the bloating of the Pentagon budget. At that time, though, I never would have imagined that the budgets of those years would look modest today, especially after the big enemy of that era, the Soviet Union, imploded in 1991.\n\nWhy, then, does each year’s NDAA rise ever higher into the troposphere, drifting on the wind and poisoning our culture with militarism? Because, to state the obvious, Congress would rather engage in pork-barrel spending than exercise the slightest real oversight when it comes to the national security state. It has, of course, been essentially captured by the military-industrial complex, a dire fate President Dwight D. Eisenhower warned us about 60 years ago in his farewell address. Instead of being a guard dog for America’s money (not to mention for our rapidly disappearing democracy), Congress has become a genuine lapdog of the military brass and their well-heeled weapons makers.\n\nSo, even as Congress puts on a show of debating the NDAA, it’s really nothing but, at best, a political Kabuki dance (a metaphor, by the way, that’s quite common in the military, which tells you something about the well-traveled sense of humor of its members). Sure, our congressional representatives act as if they’re exercising oversight, even as they do as they’re told, while the deep-pocketed contractors make major contributions to the campaign “war chests” of the very same politicians. It’s a win for them, of course, but a major loss for this country — and indeed for the world.\n\nDoing More With Less\n\nWhat would real oversight look like when it comes to the defense budget? Again, glad you asked!\n\nIt would focus on actual on preventing wars, and above all, on scaling down our gigantic military. It would involve cutting that budget roughly in half over the next few years and so forcing our generals and admirals to engage in that rarest of acts for them: making some tough choices. Maybe then they’d see the folly of spending $1.7 trillion on the next generation of world-ending weaponry, or maintaining all those military bases globally, or maybe even the blazing stupidity of backing China into a corner in the name of “deterrence.”\n\nHere’s a radical thought for Congress: Americans, especially the working class, are constantly being advised to do more with less. Come on, you workers out there, pull yourself up by your bootstraps and put your noses to those grindstones!\n\nTo so many of our elected representatives (often sheltered in grotesquely gerrymandered districts), less money and fewer benefits for workers are seldom seen as problems, just challenges. Quit your whining, apply some elbow grease, and “git-r-done!”\n\nThe U.S. military, still proud of its “can-do” spirit in a warfighting age of can’t-do-ism, should have plenty of smarts to draw on. Just consider all those Washington “think tanks” it can call on! Isn’t it high time, then, for Congress to challenge the military-industrial complex to focus on how to do so much less (as in less warfighting) with so much less (as in lower budgets for prodigal weaponry and calamitous wars)?\n\nFor this and future Pentagon budgets, Congress should send the strongest of messages by cutting at least $50 billion a year for the next seven years. Force the guys (and few gals) wearing the stars to set priorities and emphasize the actual defense of this country and its Constitution, which, believe me, would be a unique experience for us all.\n\nEvery year or so, I listen again to Eisenhower’s military-industrial complex speech. In those final moments of his presidency, Ike warned Americans of the “grave implications” of the rise of an “immense military establishment” and “a permanent armaments industry of vast proportions,” the combination of which would constitute a “disastrous rise of misplaced power.” This country is today suffering from just such a rise to levels that have warped the very structure of our society. Ike also spoke then of pursuing disarmament as a continuous imperative and of the vital importance of seeking peace through diplomacy.\n\nIn his spirit, we should all call on Congress to stop the madness of ever-mushrooming war budgets and substitute for them the pursuit of peace through wisdom and restraint. This time, we truly can’t allow America’s numerous smoking guns to turn into so many mushroom clouds above our beleaguered planet.\n\nWilliam Astore, a retired lieutenant colonel (USAF) and professor of history, is a TomDispatch regular and a senior fellow at the Eisenhower Media Network (EMN), an organization of critical veteran military and national security professionals. His personal blog is Bracing Views.\n\nRegistration is necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/intent.htm", "http://www.informationclearinghouse.info/", "https://scheerpost.com/2021/12/13/its-time-to-make-deep-cuts-at-the-pentagon/", "https://www.newsweek.com/pinching-pennies-people-endless-cash-war-opinion-1648178", "https://insidedefense.com/insider/house-passes-defense-authorization-bill-0", "https://tomdispatch.com/what-price-defense/", "https://tomdispatch.com/engelhardt-who-rules-washington/", "https://www.defenseone.com/policy/2021/11/ndaa-likely-wont-become-law-until-2022-s-not-end-world/187174/", "https://www.washingtonpost.com/us-policy/2021/12/02/government-funding-shutdown-vaccine/", "https://www.stripes.com/covid/2021-11-04/coronavirus-vaccine-mandate-ndaa-amendment-honorable-discharges-military-3495332.html", "https://www.defenseone.com/policy/2021/11/plan-draft-women-uniting-unlikely-political-allies/186667/", "https://thehill.com/homenews/senate/581815-schumer-time-is-now-repeal-iraq-war-resolution", "https://www.thenation.com/article/archive/leaving-cheyenne-mountain/", "https://www.nytimes.com/1991/07/15/world/what-is-throw-weight.html", "https://www.pbs.org/newshour/politics/pentagon-says-afghan-war-costs-taxpayers-45-billion-per-year", "https://watson.brown.edu/costsofwar/figures/2021/human-and-budgetary-costs-date-us-war-afghanistan-2001-2022", "https://www.washingtonpost.com/graphics/2019/investigations/afghanistan-papers/afghanistan-war-confidential-documents/", "https://www.brown.edu/news/2021-09-01/costsofwar", "https://tomdispatch.com/the-all-american-base-world/", "https://www.thenation.com/article/world/guam-resistance-empire/", "https://tomdispatch.com/countdown-to-world-war-iii/", "https://www.armscontrol.org/act/2021-09/news/new-chinese-missile-silo-fields-discovered", "https://www.businessinsider.com/nuclear-modernization-plans-are-unnecessarily-costly-and-risky-2021-7", "https://eos.org/articles/nuclear-winter-may-bring-a-decade-of-destruction", "https://www.dailyposter.com/build-back-betters-gift-to-the-gas-industry/", "https://www.dailymail.co.uk/news/article-9648203/B-52-bombers-fly-30-NATO-states-strength-ahead-Biden-Putin-summit.html", "https://en.wikipedia.org/wiki/Dr._Strangelove", "https://asiatimes.com/2021/09/us-encircling-china-on-multiple-new-cold-war-fronts/", "https://tomdispatch.com/countdown-to-world-war-iii/", "https://www.defenseone.com/policy/2021/07/it-failed-miserably-after-wargaming-loss-joint-chiefs-are-overhauling-how-us-military-will-fight/184050/", "https://contraryperspective.com/2014/01/15/why-america-is-losing-its-wars/", "https://bracingviews.com/2017/02/28/lessons-and-propaganda-from-the-botched-raid-on-yemen-2/", "https://www.opensecrets.org/news/reports/capitalizing-on-conflict", "https://tomdispatch.com/rewarding-failure/", "https://tomdispatch.com/rewarding-failure/", "https://tomdispatch.com/answering-the-armies-of-the-cheated/", "https://www.sciencetimes.com/articles/32463/20210726/nuclear-explosion-what-makes-a-mushroom-cloud-when-an-atomic-bomb-blows-up.htm", "https://tomdispatch.com/william-astore-drowning-in-militarism/", "https://www.youtube.com/watch?v=OyBNmecVtdU&t=5s", "https://en.wikipedia.org/wiki/Kabuki_dance", "https://www.youtube.com/watch?v=4TU-li1BqZ4", "https://www.npr.org/2011/01/17/132942244/ikes-warning-of-military-expansion-50-years-later", "https://tomdispatch.com/the-pentagon-as-pentagod/", "https://bracingviews.com/"], "authors": [], "publish_date": null}