{"result_id": "168006", "URL": "http://www.informationclearinghouse.info/65758.htm", "timestamp": "2023-04-25 15:38:40 CEST+0200", "meta": {"description": "What prospects are there for any kind of community? The sad, if not disastrous answer, is nearly none.", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/65758.htm", "encoding": null}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion: - So Long to a Sense of Community", "cleaned_text": "Purpose and Intent of this website: So Long to a Sense of Community anti-maskers in Los Angeles attacking a breast cancer patient seeking care in a medical facility, and then reading about Boston College’s policy of not requiring masks in classrooms this fall with expected faculty pushback, I wondered where the hell all of this led? As the echoes of 1960s’ solidarity lose even their place in the rearview mirror of life, and slogans from political campaigns that purport to hold community in awe (“ Not me. Us. The left, or at least those who could fit into a defunct phone booth of old, is now siloed into identity movements of either one kind or another. What prospects are there for any kind of community? The sad, if not disastrous answer, is nearly none. No Advertising - No Government Grants - This Is Independent Media Nothing approaches a sense of community in the US, and in much, if not all, of the world outside the US. This, the lack of community, may be a reason for fueling the ultranationalist and populist movements of the far right. People need something to believe in and when the longing and reality of community and solidarity fade into oblivion, then the vacuum will inevitably fill with slogans and bizarre actions. These realities on the ground give grist to the political right. People need a sense of community and when that need is not filled, they will seek community in all kinds of places, even when those places lead to destructive or lethal cul-de-sacs. Organized religion, which provided a sense of community and solace to some in a hostile world, has long been on a steep decline in the US. Political movements, besides those on the right, draw fewer and fewer people except for identity movements that are siloed against one another, or have nothing to do with one another. Where was the uproar before Texas enacted a draconian abortion law and the US Supreme Court let that law stand through its lethal inaction and reaction? The lack of community has driven many to seek solace in that old time religion, a trend that Chris Hedges documents in American Fascists (2007). Every single major religion, and some minor ones, has at its base right-wing behavior and tenets. Talk about the repression of women! Some maniacal right-wing fascists, who would make a religious figure like Christ weep relentlessly, draw the alienated with magical promises of a better heavenly world. That’s just how significant community is in a world devoid of it! from the New York Times about vaccine refusal that has taken hold over a large part of the US. Here are people dying and questioning the efficacy of the proven effectiveness of vaccines against Covid-19. It’s the idea of rugged individualism, the frontier ethos, and sometimes, the belief that it’s God’s plan (facing the pandemic without vaccination) that runs counter to the rational arguments of the need for protecting oneself and one’s community from the ravages of this pandemic. Hard to believe, but not in this supercharged reactionary environment that we now all occupy. Following the solidarity of the movements against war, for women’s rights, environmental action, civil rights and gay rights, masses of so-called 60s’ people sought solace in some nonsensical movements of personal enhancement and faux enlightenment in the late 1970s and beyond. Some of those movements turned into bizarre cults. Careerism attended those movements of self-absorption. Many of the accomplishments of the 60s and early 70s were almost forgotten, if not entirely jettisoned. Unionism was one mechanism that brought people together in a common bond from work and improved people’s lives in demonstrable ways. Unionism, under attack from the beginning of Reaganism, also fell prey to globalization, where capital sought the cheapest sources of labor and materials. Communities decayed as a result and the sense of community was lost. Many of the centers of manufacturing have long since disappeared and often left hope in a trash heap, sometimes accompanied by highly addictive drugs. Maybe there is even a camaraderie long-missing from US society that drug addiction fills, to some extent? Social creatures, we will seek community where we can find it, and when it’s missing from vast swaths of the landscape, the search for community will take on bizarre forms. What else can explain the violence on the right who combine against immigrants, Black and Brown people, and positive social change? Some of those “very fine people ” are searching in all the wrong places and with all the wrong politics that move others toward a search for community. is a freelance writer. He is the author of Against the Wall: Memoir of a Vietnam-Era War Resister (2017). Registration is necessary to post comments. We ask only that you do not use obscene or offensive language. Please be respectful of others.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/intent.htm", "http://www.informationclearinghouse.info/", "https://www.vice.com/en/article/pkbxmg/breast-cancer-patient-attacked-anti-mask-protestWhy?fbclid=IwAR2lZsJw1WTz-yrl70bleuRKoNmMndNEf77t5Qh57_qHerXbhJ_fZYQPAkI", "https://www.vice.com/en/article/pkbxmg/breast-cancer-patient-attacked-anti-mask-protestWhy?fbclid=IwAR2lZsJw1WTz-yrl70bleuRKoNmMndNEf77t5Qh57_qHerXbhJ_fZYQPAkI", "https://berniesanders.com/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://en.wikipedia.org/wiki/American_Fascists", "https://www.youtube.com/watch?v=pd8P12BXebo"], "authors": [], "publish_date": null}