{"result_id": "168035", "URL": "http://www.informationclearinghouse.info/55388.htm", "timestamp": "2023-04-25 15:38:51 CEST+0200", "meta": {"description": "The lower reaches of the financial food chain are already dying, and every entity that depended on that layer is doomed.", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/55388.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion - This Is a Financial Extinction Event", "cleaned_text": "This Is a Financial Extinction Event July 24, 2020 \" \" - The lower reaches of the financial food chain are already dying, and every entity that depended on that layer is doomed. Though under pressure from climate change, the dinosaurs were still dominant 65 million year ago--until the meteor struck, creating a global \"nuclear winter\" that darkened the atmosphere for months, killing off most of the food chain that the dinosaurs depended on. (See chart below.) The ancestors of modern birds were one of the few dinosaur species to survive the extinction event, which took months to play out. It wasn't the impact and shock wave that killed off dinosaurs globally--it was the \"nuclear winter\" that doomed them to extinction. As plants withered, the plant-eating dinosaurs expired, depriving the predator dinosaurs of their food supply. This is a precise analogy for the global economy, which is entering a financial \"nuclear winter\" extinction event. As I've been discussing for the past few months, costs are sticky but revenues and profits are on a slippery slope. No Advertising - No Government Grants - This Is Independent Media Businesses still have all the high fixed costs of 2019 but their revenues are sliding as the \"nuclear winter\" weakens consumer spending, investment in new capacity, etc. Despite all the hoopla about a potential vaccine, no vaccine can change four realities: one, consumer sentiment has shifted from confidence to caution and from spending freely to saving. This is the financial equivalent of \"nuclear winter\": there is no way to return to the pre-impact environment. Two, uncertainty cannot be dissipated, either. There are no guarantees a vaccine will be 99% effective, that it will last more than a few months, that it won't have side-effects, etc. There are also no guarantees that consumers will resume their care-free spending ways as credit tightens, incomes decline, risks emerge and the need for savings becomes more compelling. Three, consumer behavior and uncertainty have already changed, and so businesses that cannot survive on much lower revenues won't last long enough to emerge from the \"nuclear winter\" of uncertainty and a shift in sentiment. Four, assets based on 2019 revenues, profits and demand are now horrendously overvalued, and the repricing of all assets will bring down the predators, i.e. the banks. As I've noted here before, the top 10% of households account for almost 50% of consumer spending. These households are older, and own the majority of assets --between 80% and 90% of stocks, bonds, business equity, rental real estate, etc. This is the demographic with the most to lose in returning to care-free air travel, jamming into crowded venues and cafes, etc. This demographic has \"been there, done that\" and foregoing fine dining, sports events, concerts, cruises, etc. is not much a burden and may actually be a relief. Meanwhile, the entire food chain of landlords, banks, local government, employees, etc. depends on enterprises returning to 100% of 2019 revenues. As tenants stop paying rent, landlords default on mortgages, sending banks into insolvency, leaving local government with less tax revenues and employees with fewer job prospects. To a degree few appreciate, the \"recovery\" since 2009 has been dependent on over-spending, over-borrowing and over-speculating: as spending, borrowing and speculation all pull back to what would have been \"normal\" levels two generations ago, the economy collapses because it's become completely dependent on over-spending, over-borrowing and over-speculating. As consumers and businesses retrench, borrowing declines while defaults and bankruptcies eviscerate bank profits and balance sheets. As spending declines, businesses with high fixed costs and pre-pandemic business models (crowding people together in close quarters, etc.) cannot generate enough revenues to survive. As the collateral of commercial real estate and profit streams collapse, assets are repriced all down the food chain, reversing the wealth effect: as people feel poorer, they borrow and spend less, creating a feedback loop of lower valuations, lower spending, lower profits, lower borrowing all of which feed back into each other, pushing everything lower. The lower reaches of the financial food chain are already dying, and every entity that depended on that layer is doomed: the small business die-off will bring down distributors, banks, landlords, and employment, and as the this layer collapses then the top predators will starve to death as well: Big Tech, healthcare, higher education, tourism, local tax revenues, etc. The clouds are spreading and thickening, and the dawn sky is tinted an ominous red. This is a financial extinction event, and the Fed's pathetic shamans can't reverse history. Charles Hugh Smith is a contributing editor to PeakProsperity.com and the proprietor of the popular blog OfTwoMinds.com. He is the author of numerous books, including Why Everything Is Falling Apart: An Unconventional Guide To Investing In Troubled Times.- - The views expressed in this article are solely those of the author and do not necessarily reflect the opinions of Information Clearing House.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationclearinghouse.info/", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://www.oftwominds.com/blogjuly20/financial-extinction7-20.html"], "authors": [], "publish_date": null}