{"result_id": "168024", "URL": "http://www.informationclearinghouse.info/55991.htm", "timestamp": "2023-04-25 15:38:47 CEST+0200", "meta": {"description": "We are moving into the “posthuman era,” one in which humans will become a new type of being. “Technological devices,”", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/55991.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion - COVID-19 Vaccines Pave the Way for a New Frontier in Surveillance", "cleaned_text": "December 05, 2020 \" \" - \"Like it or not, the COVID-19 pandemic with its veiled threat of forced vaccinations, contact tracing, and genetically encoded vaccines is propelling humanity at warp speed into a whole new frontier—a surveillance matrix—the likes of which we’ve only previously encountered in science fiction.\n\nThose who eye these developments with lingering mistrust have good reason to be leery: the government has long had a tendency to unleash untold horrors upon the world in the name of global conquest, the acquisition of greater wealth, scientific experimentation, and technological advances, all packaged in the guise of the greater good.\n\nIndeed, “we the people” have been treated like lab rats by government agencies for decades now: caged, branded, experimented upon without our knowledge or consent, and then conveniently discarded and left to suffer from the after-effects.\n\nYou don’t have to dig very deep or go very back in the nation’s history to uncover numerous cases in which the government deliberately conducted secret experiments on an unsuspecting populace, making healthy people sick by spraying them with chemicals, injecting them with infectious diseases and exposing them to airborne toxins.\n\nNow this same government—which has taken every bit of technology sold to us as being in our best interests (GPS devices, surveillance, nonlethal weapons, etc.) and used it against us, to track, control and trap us—wants us to fall in line as it prepares to roll out COVID-19 vaccines that owe a great debt to the Pentagon’s Defense Advanced Research Projects Agency for its past work on how to weaponize and defend against infectious diseases.\n\nThe Trump Administration by way of the National Institute of Health awarded $22.8 million to seven corporations to develop artificial intelligence (AI), machine learning, etc., with smart phone apps, wearable devices and software “that can identify and trace contacts of infected individuals, keep track of verified COVID-19 test results, and monitor the health status of infected and potentially infected individuals.”\n\nThis is all part of Operation Warp Speed, which President Trump has likened to the Manhattan Project, a covert government effort spearheaded by the military to engineer and build the world’s first atomic bomb.\n\nThere is every reason to tread cautiously.\n\nThere is a sinister world beyond that which we perceive, one in which power players jockey for control over the one commodity that is a necessary ingredient for total domination: you.\n\nBy you, I mean you the individual in all your singular humanness.\n\nRemaining singularly human and retaining your individuality and dominion over yourself—mind, body and soul—in the face of corporate and government technologies that aim to invade, intrude, monitor, manipulate and control us may be one of the greatest challenges before us.\n\nThese COVID-19 vaccines, which rely on messenger RNA technology that influences everything from viruses to memory, are merely the tipping point.\n\nThe groundwork being laid with these vaccines is a prologue to what will become the police state’s conquest of a new, relatively uncharted, frontier: inner space, specifically, the inner workings (genetic, biological, biometric, mental, emotional) of the human race.\n\nIf you were unnerved by the rapid deterioration of privacy under the Surveillance State, prepare to be terrified by the surveillance matrix that will be ushered in on the heels of the government’s rollout of this COVID-19 vaccine.\n\nThe term “matrix” was introduced into our cultural lexicon by the 1999 film The Matrix in which Neo, a computer programmer/hacker, awakens to the reality that humans have been enslaved by artificial intelligence and are being harvested for their bio-electrical energy.\n\nHardwired to a neuro-interactive simulation of reality called the “Matrix,” humans are kept inactive and docile while robotic androids gather the electricity their bodies generate. In order for the machines who run the Matrix to maintain control, they impose what appears to be a perfect world for humans to keep them distracted, content, and submissive.\n\nHere’s the thing: Neo’s Matrix is not so far removed from our own technologically-hardwired worlds in which we’re increasingly beholden to corporate giants such as Google for powering so much of our lives. As journalist Ben Thompson explains:\n\nEverything we do is increasingly dependent on and, ultimately, controlled by our internet-connected, electronic devices. For example, in 2007, there were an estimated 10 million sensor devices connecting human utilized electronic devices (cell phones, laptops, etc.) to the Internet. By 2013, it had increased to 3.5 billion. By 2030, it is estimated to reach 100 trillion.\n\nMuch, if not all, of our electronic devices will be connected to Google, a neural network that approximates a massive global brain.\n\nGoogle’s resources, beyond anything the world has ever seen, includes the huge data sets that result from one billion people using Google every single day and the Google knowledge graph “which consists of 800 million concepts and billions of relationships between them.”\n\nThe end goal? The creation of a new “human” species, so to speak, and the NSA, the Pentagon and the “Matrix” of surveillance agencies are part of the plan. As William Binney, one of the highest-level whistleblowers to ever emerge from the NSA, said, “The ultimate goal of the NSA is total population control.”\n\nMind you, this isn’t population control in the classic sense. It’s more about controlling the population through singularity, a marriage of sorts between machine and human beings in which artificial intelligence and the human brain will merge to form a superhuman mind.\n\n“Google will know the answer to your question before you have asked it,” predicts transhumanist scientist Ray Kurzweil. “It will have read every email you’ve ever written, every document, every idle thought you’ve ever tapped into a search-engine box. It will know you better than your intimate partner does. Better, perhaps, than even yourself.”\n\nThe term “singularity”—that is, computers simulating human life itself—was coined years ago by mathematical geniuses Stanislaw Ulam and John von Neumann. “The ever accelerating progress of technology,” warned von Neumann, “gives the appearance of approaching some essential singularity in the history of the race beyond which human affairs, as we know them, could not continue.”\n\nThe plan is to develop a computer network that will exhibit intelligent behavior equivalent to or indistinguishable from that of human beings by 2029. And this goal is to have computers that will be “a billion times more powerful than all of the human brains on earth.”\n\nNeuralink, a brain-computer chip interface (BCI), paves the way for AI control of the human brain, at which point the disconnect between humans and AI-controlled computers will become blurred and human minds and computers will essentially become one and the same. “In the most severe scenario, hacking a Neuralink-like device could turn ‘hosts’ into programmable drone armies capable of doing anything their ‘master’ wanted,” writes Jason Lau for Forbes.\n\nAdvances in neuroscience indicate that future behavior can be predicted based upon activity in certain portions of the brain, potentially creating a nightmare scenario in which government officials select certain segments of the population for more invasive surveillance or quarantine based solely upon their brain chemistry.\n\nCase in point: researchers at the Mind Research Center scanned the brains of thousands of prison inmates in order to track their brain chemistry and their behavior after release. In one experiment, researchers determined that inmates with lower levels of activity in the area of the brain associated with error processing allegedly had a higher likelihood of committing a crime within four years of being released from prison. While researchers have cautioned against using the results of their research as a method of predicting future crime, it will undoubtedly become a focus of study for government officials.\n\nThere’s no limit to what can be accomplished—for good or ill—using brain-computer interfaces.\n\nResearchers at Duke University Medical Center have created a brain-to-brain interface between lab rats, which allows them to transfer information directly between brains. In one particular experiment, researchers trained a rat to perform a task where it would hit a lever when lit. The trained rat then had its brain connected to an untrained rat’s brain via electrodes. The untrained rat was then able to learn the trained rat’s behavior via electrical stimulation. This even worked over great distances using the Internet, with a lab rat in North Carolina guiding the actions of a lab rat in Brazil.\n\nClearly, we are rapidly moving into the “posthuman era,” one in which humans will become a new type of being. “Technological devices,” writes journalist Marcelo Gleiser, “will be implanted in our heads and bodies, or used peripherally, like Google Glass, extending our senses and cognitive abilities.”\n\nTranshumanism—the fusing of machines and people—is here to stay and will continue to grow.\n\nIn fact, as science and technology continue to advance, the ability to control humans will only increase. In 2014, for example, it was revealed that scientists have discovered how to deactivate that part of our brains that controls whether we are conscious or not. When researchers at George Washington University sent high frequency electrical signals to the claustrum—that thin sheet of neurons running between the left and right sides of the brain—their patients lost consciousness. Indeed, one patient started speaking more slowly until she became silent and still. When she regained consciousness, she had no memory of the event.\n\nAdd to this the fact that increasingly humans will be implanted with microchips for such benign purposes as tracking children or as medical devices to assist with our health. Such devices “point to an uber-surveillance society that is Big Brother on the inside looking out,” warns Dr. Katina Michael. “Governments or large corporations would have the ability to track people’s actions and movements, categorize them into different socio-economic, political, racial, or consumer groups and ultimately even control them.”\n\nAs I make clear in my book Battlefield America: The War on the American People, control is the issue.\n\nIn fact, Facebook and the Department of Defense are working to manipulate our behavior. In a 2012 study, Facebook tracked the emotional states of over 600,000 of its users. The goal of the study was to see if the emotions of users could be manipulated based upon whether they were fed positive or negative information in their news feeds. The conclusion of the study was that “emotional states can be transferred to others via emotional contagion, leading people to experience the same emotions without their awareness.”\n\nAll of this indicates a new path forward for large corporations and government entities that want to achieve absolute social control. Instead of relying solely on marauding SWAT teams and full-fledged surveillance apparatuses, they will work to manipulate our emotions to keep us in lock step with the American police state.\n\nNow add this warp speed-deployed vaccine to that mix, with all of the associated unknown and fearsome possibilities for altering or controlling human epigenetics, and you start to see the perils inherent in blindly adopting emerging technologies without any restrictions in place to guard against technological tyranny and abuse.\n\nIt’s one thing for the starship Enterprise to boldly go where no man has gone before, but even Mr. Spock recognized the dangers of a world dominated by AI. “Computers make excellent and efficient servants,” he observed in “The Ultimate Computer” episode of Star Trek, “but I have no wish to serve under them.”\n\nConstitutional attorney and author John W. Whitehead is founder and president of . His new book Battlefield America: The War on the American People is available at . Whitehead can be contacted at johnw@rutherford.org.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://evolutionnews.org/2020/08/why-c-s-lewis-wrote-the-abolition-of-man/", "http://www.informationclearinghouse.info/", "https://thebulletin.org/2009/06/outlaw-nonconsensual-human-experiments-now/", "http://www.nbcnews.com/id/41811750/ns/health-health_care/t/ugly-past-us-human-experiments-uncovered/#.VzCAwBUrKRs", "https://www.rutherford.org/publications_resources/john_whiteheads_commentary/human_lab_rats_the_u.s._governments_secret_history_of_grisly_experiments", "https://www.thedrive.com/the-war-zone/24078/darpas-virus-carrying-bugs-arent-officially-weapons-but-it-sure-sounds-like-they-could-be", "../../../Users/nishawhitehead10/Desktop/TRI/JW%20Columns/NIH%20awards%20contracts%20to%20develop%20innovative%20digital%20health%20technologies%20for%20COVID-19", "https://apnews.com/article/donald-trump-politics-coronavirus-pandemic-4f0591ffa6ec392e884652f5fda75194", "https://visitor.r20.constantcontact.com/d.jsp?llr=iqnuv6bab&p=oi&m=1101581137416&sit=mr9dynfcb&f=efc6d103-17c3-4940-b941-50c610e89267", "https://www.sciencemag.org/news/2019/07/hidden-layer-gene-control-influences-everything-cancer-memory", "https://www.technocracy.news/operation-warp-speed-your-one-way-ticket-to-total-surveillance/", "http://www.theguardian.com/technology/blog/2013/jun/04/google-plus-the-matrix", "http://ieet.org/index.php/IEET/more/danaher20140609", "http://www.theguardian.com/technology/2014/feb/22/robots-google-ray-kurzweil-terminator-singularity-artificial-intelligence", "https://www.theguardian.com/commentisfree/2014/jul/11/the-ultimate-goal-of-the-nsa-is-total-population-control", "http://rt.com/news/google-kurzweil-robots-transhumanism-312/", "http://www.slate.com/articles/technology/bitwise/2014/07/roko_s_basilisk_the_most_terrifying_thought_experiment_of_all_time.html", "http://www.theguardian.com/technology/2014/feb/22/robots-google-ray-kurzweil-terminator-singularity-artificial-intelligence", "http://www.theguardian.com/technology/2014/feb/22/robots-google-ray-kurzweil-terminator-singularity-artificial-intelligence", "https://www.forbes.com/sites/forbestechcouncil/2020/11/18/hacking-humans-how-neuralink-may-give-ai-the-keys-to-our-brains/", "http://www.latimes.com/news/nationworld/nation/la-na-prisoner-brains-20130715,0,5130358.story", "http://www.theguardian.com/science/neurophilosophy/2013/feb/28/brain-to-brain-interface", "http://www.npr.org/blogs/13.7/2014/06/11/320961912/the-transhuman-future-be-more-than-you-can-be", "http://gizmodo.com/scientists-find-the-brains-on-off-switch-that-controls-1600783245", "http://www.smh.com.au/digital-life/digital-life-news/human-microchipping-ive-got-you-under-my-skin-20140416-zqvho.html", "https://www.amazon.com/Battlefield-America-War-American-People/dp/1590793099", "https://boingboing.net/2014/07/03/facebook-manipulation-experime.html", "http://www.theatlantic.com/technology/archive/2014/06/everything-we-know-about-facebooks-secret-mood-manipulation-experiment/373648/", "https://www.inc.com/kevin-daum/50-star-trek-inspiring-you-to-boldly-go-into-your-future.html", "https://www.rutherford.org/", "https://www.amazon.com/Battlefield-America-War-American-People/dp/1590793099/ref=asap_bc?ie=UTF8", "https://www.amazon.com/", "mailto:johnw@rutherford.org"], "authors": [], "publish_date": null}