{"result_id": "168031", "URL": "http://www.informationclearinghouse.info/55324.htm", "timestamp": "2023-04-25 15:38:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.informationclearinghouse.info/favicon.ico", "canonical": "http://www.informationclearinghouse.info/55324.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.informationclearinghouse.info", "title": "Opinion - Why the Bill Gates global health empire promises more empire and less public health", "cleaned_text": "The Bill & Melinda Gates Foundation is the largest private foundation on Earth, reporting over $51 billion in assets at the end of 2019. Bill Gates says his Foundation spends a majority of its resources “reducing deaths from infectious diseases,” and through this philanthropy, he seems to have bought a name for himself as an infectious disease expert .\n\n“Because of the Gates Foundation, I have watched government after government fall in its sovereignty,” Dr. Vandana Shiva, a scholar and founder of the India-based Research Foundation for Science, Technology and Ecology, told The Grayzone.\n\nThe Gates Foundation has already effectively privatized the international body charged with creating health policy, transforming it into a vehicle for corporate dominance. It has facilitated the dumping of toxic products onto the people of the Global South, and even used the world’s poor as guinea pigs for drug experiments. The foundation’s influence over public health policy is practically contingent on ensuring that safety regulations and other government functions are weak enough to be circumvented. It therefore operates against the independence of nation states and as a vehicle for Western capital.\n\nBut beyond the public relations bonanza about Gates lies a disturbing history that should raise concerns about whether his foundation’s plans for resolving the pandemic will benefit the global public as much as it expands and entrenches its power over international institutions.\n\nThe tidal wave of mainstream media praise for Gates during the COVID-19 era has meant that scrutiny of the billionaire and his machinations is increasingly isolated on the far right of the political spectrum , where it can be dismissed by progressives as the conspiratorial ravings of Trumpists and Q-Anon quacks.\n\nBill Gates has achieved a hero-like status during the pandemic. The Washington Post has called him a “champion of science-backed solutions,” while the New York Times recently hailed him as “the most interesting man in the world.” Gates is also the star of a hit Netflix docu-series, “ Pandemic: How to Prevent an Outbreak ,” which was released just weeks before Covid hit the US, and produced by a New York Times correspondent, Sheri Fink, who previously worked at three Gates-funded organizations ( Pro Publica , the New America Foundation and the International Medical Corps ).\n\nThe US abandonment of the WHO means that the organization’s second largest financial contributor, the Bill & Melinda Gates Foundation, is soon to become its top donor, giving the non-governmental international empire unparalleled influence over one the world’s most important multilateral organizations.\n\nJuly 09, 2020 \" Information Clearing House \" - President Donald Trump’s announcement this July of a US withdrawal from the World Health Organization (WHO) set into motion a process that will have a dramatic impact on the future of global public health policy – and on the fortunes of one of the world’s richest people.\n\nBehind a veil of corporate media PR, the Gates Foundation has served as a vehicle for Western capital while exploiting the Global South as a human laboratory. The pandemic is likely to intensify this disturbing agenda.\n\nCorporate media rolled out the red carpet for Gates as he advised the world on how to handle the COVID outbreak. During just the month of April, while the virus was severely impacting the U.S., he was hosted by CNN , CNBC , Fox , PBS , BBC , CBS , MSNBC, The Daily Show and The Ellen Show . On the BBC , Gates described himself as a “health expert,” despite his lack of a college degree in medicine or any other field.\n\nConsider the revolving door between the Gates Foundation and Big Pharma. Former Director of Vaccine Development at the Foundation and current CEO of the Bill & Melinda Gates Medical Research Institute Penny Heaton hails from drug kingpins Merck and Novartis. The Foundation’s President of Global Health, Trevor Mundel , served in leadership positions at both Novartis and Pfizer. His predecessor, Tachi Yamada , was previously a top executive at GlaxoSmithKline (GSK). Kate James, worked at GSK for almost 10 years, then became the Foundation’s Chief Communications Officer. The examples are almost endless.\n\nAt the same time, strong evidence suggests that the Gates Foundation functions as a trojan horse for Western corporations which, of course, have no goal greater than an increased bottom line.\n\nAs the second richest person on Earth, Bill Gates has no reason to crave money. This is a common response to claims that Gates’ philanthropy isn’t motivated solely by the kindness of his heart. But despite these frequent characterizations of Gates “giving away” his fortune, his net worth has actually doubled in the last two decades.\n\nEven so, there might be cause for skepticism when examining the reality of a Gates-led global vaccination effort.\n\nThe Gates Foundation, the “biggest funder of vaccines in the world,” has already directly donated more than $300 million towards the global response to COVID. This includes backing vaccine trials by companies like Inovio Pharmaceuticals, AstraZeneca and Moderna Inc., all of which are being described as frontrunners in the race to develop a COVID vaccine. The Foundation also co-founded and funds the Coalition for Epidemic Preparedness (CEPI) , which is investing up to $480 million in “a wide range of vaccine candidates and platform technologies.”\n\nBringing a life-saving vaccine to vulnerable black populations in Africa and the U.S., and then to everyone around the world seems noble, and Bill Gates is certainly putting his money where his mouth is. In March , he stepped down from his position on the board of directors at Microsoft and is apparently “now spending the predominant amount of his time on the pandemic.”\n\nRecently, on CNN , the wife of Bill Gates the co-director of his foundation, Melinda Gates, lamented that she was “kept up at night” worrying about vulnerable populations in Africa and how unprepared they were for this virus. More recently, she told TIME Magazine that in the US, black people should get the vaccine first\n\nAccording to Bill Gates, creating and distributing a COVID vaccine to everyone on Earth is “the ultimate solution” to the outbreak. Gates Foundation CEO Mark Suzman echoed these sentiments, proclaiming that “a successful vaccine has to be made available for 7 billion people.”\n\nThe billionaire’s media appearances are shot through with a single , undeniable theme: If global leaders listened to Gates , the world would be better equipped to fight the pandemic. As the fashion magazine Vogue asked, “Why Isn’t Bill Gates Running the Coronavirus Task Force?”\n\nSeven years later, the organization’s then–Director General Margaret Chan noted that because the WHO’s budget is highly earmarked, it is “driven by what [she calls] donor interests.”\n\nIn 2007, Chief of the WHO Malaria Program Dr. Arata Kochi warned of the Gates Foundation’s financial dominance, arguing that its money could have “far reaching, largely unintended consequences.”\n\nIn an interview with Global Health Watch, one senior health policy officer from a large NGO put it this way: “The people at WHO seem to have gone crazy. It’s ‘yes sir’, ‘yes sir’, to Gates on everything.”\n\nAccording to Foreign Affairs , “few policy initiatives or normative standards set by the WHO are announced before they have been casually, unofficially vetted by Gates Foundation staff.” Or, as other sources told Politico in 2017, “Gates’ priorities have become the WHO’s.”\n\nAccording to Dr. David Legge, Scholar Emeritus at the School of Public Health at La Trobe University in Melbourne, Gates’ financial “donations” are actually a mechanism for agenda setting. Legge told The Grayzone that “his massive contributions totally distort the kind of budget priorities that the World Health Assembly would wish to see.”\n\nAdditionally, the sheer magnitude of the Foundation’s financial contributions have made Bill Gates an unofficial – albeit unelected – leader at the organization. That’s why the World Health Assembly that sets the WHO agenda adopted a “Global Vaccine Plan” in 2012 that was co-authored by none other than the Gates Foundation.\n\nBecause most of both the Foundation’s contributions to the WHO are earmarked, the WHO doesn’t decide how these funds are spent – the Foundation does. For example, the WHO program that receives the most money is its polio eradication program, because the Gates Foundation earmarks most of its contributions for polio.\n\nTo be sure, the WHO’s close financial relationship with a private organization is only a problem to the extent that it relies on quid pro quo donations. And that seems to be exactly what is taking place.\n\nTo sociologist Allison Katz, who worked for 18 years in the WHO headquarters, the WHO “has become a victim of neoliberal globalization.” Katz wrote an open letter to then WHO Director General Margaret Chan in 2007, criticizing public bodies that “go begging to the private sector [and] to the foundations of celebrity ‘philanthropists’ with diverse agendas, from industry.”\n\nIf the Foundation’s and GAVI’s contributions are combined, they outweigh the U.S. government’s contributions, making the Gates Foundation the unofficial top sponsor of the WHO, even before the Trump Administration’s recent move to withdraw from the organization.\n\nCiting GAVI as an example, Global Health Watch explained that “other global health actors are accountable to the Gates Foundation, but not the other way round.”\n\nDuring the late 1990’s, Bill Gates sponsored the meetings that led to the creation of GAVI, establishing it up with $750 million in seed money. To date, the Foundation has given GAVI over $4.1 billion, accounting for close to 20 percent of GAVI funds. It also occupies a permanent seat on the GAVI board . GAVI itself discloses that the Gates Foundation “plays both a technical and financial role in [its] efforts to shape vaccine markets.”\n\nThe foundation also funds the WHO indirectly through Global Alliance for Vaccines and Immunizations (GAVI), a “public private partnership” that facilitates bulk sales of vaccines to poor countries. GAVI is the second largest non-state funder of the WHO (after the Gates Foundation), and gave $158.5 million to the WHO in 2018 .\n\nIn 2018 alone, the foundation gave $237.8 million to the WHO, making it the second largest contributor after the U.S.\n\nThrough these voluntary contributions, the WHO took in over $70 million from the pharmaceutical industry in 2018 (the last year for which complete data is available). Meanwhile, the Gates Foundation has provided Big Pharma with the perfect vehicle for influencing the WHO.\n\nAs Dr. David Legge, Public Health Scholar Emeritus at the School of Public Health at La Trobe University in Melbourne, told The Grayzone, “Obligatory contributions by nation states really only covers the cost of administration. It doesn’t cover any of the project costs, which means that all project funding is dependent on donors. [And] virtually all donor money is totally earmarked to highly specific projects that the donors want to fund.”\n\nThe WHO relies on two streams of revenue. One comes in the form of Assessed Contributions, or obligatory funding from UN member states which is assessed through population and income. The second is Voluntary Contributions, which can be earmarked for specific causes. Voluntary earmarked contributions account for more than 80 percent of the current WHO budget. In other words, most of the WHO’s money comes with strings attached.\n\nMoreover, the Gates Foundation invests in these corporations directly. Since shortly after its founding, it has owned stakes in several drug companies. A recent investigation by The Nation revealed that the Foundation currently holds corporate stocks and bonds in drug companies like Merck, GSK, Eli Lilly, Pfizer, Novartis, and Sanofi. The Foundation’s website even candidly declares a mission to pursue “mutually beneficial opportunities” with vaccine manufacturers.\n\nWhen Tedros Adhanom Ghebreyesus became WHO Director General in 2017, Gates’s influence came under fire again, as Tedros was previously on the board of two organizations Gates founded, provided seed money for, and continues to fund to this day: GAVI and The Global Fund , where Tedros was Board Chair.\n\nToday, Tedros, the first WHO Director General who is not a medical doctor, can be found tweeting praise for Bill Gates’ op-eds.\n\nAnother mechanism the Gates Foundation employs to influence the WHO is the Strategic Advisory Group of Experts (SAGE), the principal advisory group to the WHO for vaccines. SAGE is a board of fifteen people, legally required to disclose any possible conflicts of interest.\n\nDuring a recent virtual meeting, half of the board’s members who did so listed Gates Foundation connections as possible conflicts of interests.\n\nThe Foundation’s influence in the international health arena goes well beyond the WHO. A 2017 analysis of 23 global health partnerships revealed that seven relied entirely on Gates Foundation funding and another nine listed the Foundation as its top donor.\n\nAs the UK-based NGO Global Justice Now noted, “the Foundation’s influence is so pervasive that many actors in international development which would otherwise critique the policy and practice of the Foundation are unable to speak out independently as a result of its funding and patronage.”\n\n“The World Bank and the IMF look like midgets in front of the Gates Foundation, in terms of power and influence,” Dr. Vandana Shiva remarked to The Grayzone.\n\nThe Foundation has also directed its wealth towards influencing news coverage of global health policy – and to perhaps suppress criticism of its more unsavory activities as well. It has donated millions to major media outlets, including NPR, PBS, ABC, BBC, Al Jazeera, The Daily Telegraph, The Financial Times, Univision, and The Guardian. In fact, the Guardian’s entire ‘Global Development’ section was made possible through a partnership with the Gates Foundation.\n\nThe Gates Foundation has also invested millions in journalism training and in researching effective ways of crafting media narratives. According to The Seattle Times, “experts coached in Gates-funded programs write columns that appear in media outlets from The New York Times to The Huffington Post, while digital portals blur the line between journalism and spin.”\n\nIn 2008, the Communications Chief for PBS NewsHour Rob Flynn explained, “there are not a heck of a lot of things you could touch in global health these days that would not have some kind of Gates tentacle.” This was around the time when the Foundation gave the NewsHour $3.5 million to establish a dedicated production unit to report on important global health issues.\n\nMickey Huff, the president of the Media Freedom Foundation, told The Grayzone that the Gates Foundation exerts influence in a way that is typical for foundations working through PR firms, grants, and endowments of professors. “In short,” Huff said, “Edward Bernays would be proud of the achievements of this type of propaganda.”\n\nIt is no wonder glowing coverage of the foundation is so common in mainstream media, or that its more unsavory activities in the Global South get so little attention.\n\nThe Gates Foundation has helped engineer global health policy for poor countries for over twenty years, working mainly in Africa and South Asia. Its close relationship with the drug industry seems to have colored that work.\n\nWhile the Foundation’s mission statement reads, “we see equal value in all lives,” an exploration of this recent history proves otherwise. The Foundation appears to see the global south as both a dumping ground for drugs deemed too unsafe for the developed world, and a testing ground for drugs not yet determined to be safe enough for the developed world.\n\nThe so-called “flagship of Bill Gates’ / WHO African vaccine program” is the diphtheria tetanus pertussis (DTP) vaccine. It’s a bundle of three immunization shots given to virtually every child on the African continent, but not currently administered in the U.S. nor in most other developed nations.\n\nAs far back as 1977, a study published by British medical professionals in The Lancet established that the risks of the whole-cell pertussis jab (used in the DTP vaccine) are greater than the risks associated with contracting wild pertussis. After mounting evidence linking the drug to brain damage, seizures and even death, the US and other Western countries phased it out in the 1990s and replaced it with a safer version (called DTaP) that did not contain the whole pertussis cell.\n\nHowever, African nations are still being financially incentivized to continue using the out-of-date, deeply dangerous DTP vaccine, with GAVI making DTP a priority for African children.\n\nShockingly, a 2017 study funded by the Danish government concluded that more African children were dying at the hands of the deadly DTP vaccine than by the diseases it prevented. The researchers examined data from Guinea Bissau and concluded that boys were dying at almost quadruple (3.93) the rate of those who had not received the shot, while girls suffered almost 10 times (9.98) the death rate.\n\nYet these staggering numbers have not stopped the Gates Foundation from spending millions annually to push the DTP vaccine onto African healthcare systems.\n\nThere is perhaps no more famous element of the Gates Foundation’s work than its polio eradication effort. Yet once again, the polio drugs the Western world uses and the drugs given to the Global South are dramatically different.\n\nThe Foundation has spent over $1 billion distributing an oral polio vaccine (OPV) that contains a live polio virus to African and Asian countries. This live virus can replicate inside a child’s intestine and spread in places with poor sanitation and plumbing. That means people can contract the virus from the vaccine.\n\nAccording to a 2017 study by University of California San Francisco and Tel Aviv University, the polio virus used in the OPV has done just that in at least two dozen cases the researchers examined – it rapidly regained its strength and started spreading on its own.\n\nIn recent years, more children have been paralyzed by the vaccine strain of the virus in OPV than by wild polio. In an interview with NPR, Professor of Microbiology Raul Andino said, “It’s actually an interesting conundrum. The very tool you are using for polio eradication is causing the problem.”\n\nBack in 2000, the U.S. halted its use of the OPV. But in the developing world, the Gates Foundation uses its instruments of influence to ensure governments continue administering it.\n\nPolio outbreaks in both the Philippines and the Congo are the result of the OPV. In 2005, Oxford’s Clinical Infectious Diseases Periodical contended that polio outbreaks in China, Egypt, Haiti and Madagascar were also caused by the OPV, declaring that “the time is coming when the only cause of polio is likely to be the vaccine used to prevent it.”\n\nA few years later, the same periodical, while arguing that developing countries should shift to the Inactive Polio Vaccine (IPV) the U.S. uses, wrote that the OPV is not only giving kids polio, but also “seems to be ineffective in stopping polio transmission” to begin with.\n\nAs the British Medical Journal reported in 2012, “the most recent mass polio vaccination programs [in India], fueled by the Bill and Melinda Gates Foundation, resulted in increased cases [of polio].”\n\nAccording to doctors in India, the OPV is also causing outbreaks of another disease called non-polio acute flaccid paralysis (NPAFP). After an epidemic of NPAFP paralyzed 490,000 children between 2000 and 2017, the doctors published a report suggesting that “the increase in NPAFP and the later decrease in such cases was indeed an adverse effect of the [WHO’s] polio immunization program.”\n\nNPAFP is “clinically indistinguishable from polio but twice as deadly.” Keith Van Haren, Child Neurologist at the Stanford School of Medicine explains that, “it actually looks just like polio, but that term really freaks out the public-health people.”\n\nIn 2012, the British Medical Journal wryly noted that polio eradication in India “has been achieved by renaming the disease.”\n\nThat same year, the Indian Journal of Medical Ethics observed both vaccine-derived polio outbreaks and the massive increase in NPAFP. It likened eradication efforts in India to the occupation of Iraq, stating:\n\n“When the U.S. was badly mired in Iraq in 2005, Joe Galloway suggested that the U.S. must simply declare victory, and then exit. Perhaps the time is right for such an honourable strategy with regard to polio eradication.”\n\nHowever, the Gates Foundation and the WHO have stayed the course, distributing the OPV in countries including Nigeria, Pakistan, and Afghanistan, where the Foundation says the WHO is now providing “unprecedented levels of technical assistance” for polio vaccination campaigns.\n\nIn Syria, the Gates-backed GAVI pledged $25 million for polio immunization in 2016. A year later, the WHO reported that 58 children in Syria had been paralyzed by the vaccine-derived form of the virus.\n\nDespite the scientific consensus against the OPV, and the opposition to such programs in the target countries, OPV remains administered in Africa, the Middle East and South Asia as part of “aid” programs, creating windfall profits for pharmaceutical giants who may not have been able to sell their products elsewhere.\n\nWith drugs discarded by the West, an illusion of choice for African women\n\nThe Foundation’s practice of pushing dangerous drugs onto health systems of the global south is not limited to vaccines. It also helps distribute long acting, reversible contraceptives (LARCs).\n\nMelinda Gates often refers to LARCs as a way to empower women of impoverished countries and give them more control over their lives. However, some of these LARCs have had adverse effects, and the distribution of the products without informed consent offers women little self determination.\n\nOne example is Norplant, a contraceptive implant manufactured by Schering (now Bayer) that can prevent pregnancy for up to five years. It was yanked from the U.S. market in 2002 after more than 50,000 women filed lawsuits against the company and the doctors who prescribed it. 70 of those class action suits related to side effects like depression, extreme nausea, scalp-hair loss, ovarian cysts, migraines, and excessive bleeding.\n\nSlightly modified and rebranded as Jadelle, the dangerous drug was promoted in Africa by the Gates Foundation in conjunction with USAID and EngenderHealth. Formerly named The Sterilization League for Human Betterment, EngenderHealth’s original mission, inspired by the racist pseudoscience of eugenics, was to “improve the biological stock of the human race.” Jadelle is not approved by the FDA for use in the U.S.\n\nThen there’s Pfizer’s Depo-Provera, an injectable contraceptive used in several African and Asian countries. The Gates Foundation and USAID have collaborated again to fund this drug’s distribution and introduce it into the healthcare systems of countries including Uganda, Burkina Faso, Nigeria, Niger, Senegal, Bangladesh, and India.\n\nIn 2012, Melinda Gates promised to supply contraceptives like Depo-Provera, which cost between $120 – $300 a year, to at least 120 million women by 2020. In 2017, Melinda Gates authored an article on Medium reporting that she and her partners were on track to keeping that promise, and pledging $375 million in additional funds to do so. That meant that Pfizer made between $15 and $36 billion through this program.\n\nDisturbingly, Depo Provera’s active ingredient – depot medroxyprogesterone acetate (DMPA) – has been associated with side effects like life threatening blood clots in the lungs, blindness, and breast cancer.\n\nPfizer’s one-time use version of the drug, called Sayana Press, is intended to be administered by “community health workers.” In Senegal, however, almost half of these workers had no more than a sixth grade education.\n\nSenegal’s Health Ministry was forced to change its laws so the health workers could legally distribute the drug; according to The Population Research Institute, USAID funded NGOs “strong armed the government” into this decision.\n\nAdditionally, training materials for Sayana Press did not provide information on all the side effects of DMPA, violating principles of informed consent. According to WHO guidelines, DMPA shouldn’t be used by women with rheumatic disorders. But USAID funded patient screening checklists for Uganda did not instruct health workers to ask women about a history of such disorders.\n\nGuidelines for trainers of providers of Sayana Press also don’t mention that the drug has been strongly associated with bone density loss and an increased risk of bone fractures. As The Population Research Institute put it, “The FDA requires that U.S. women be informed of this fact, but African women are kept in the dark.”\n\nIn 2015, seventy Indian feminist groups and scholars signed a statement protesting the regulatory approval of Depo-Provera, citing side effects like excessive bone density loss, weight gain, excessive bleeding, and depression. Their statement argued that womens’ organizations have consistently opposed the introduction of dangerous contraceptives like these, and that “there are risks that the women are not given enough information to make an informed choice of contraceptive method.”\n\nDespite widespread domestic opposition and the mounting evidence of negative side effects, the Foundation continues working with USAID to distribute drugs like Depo-Provera.\n\nGates’ channels of influence have also been instrumental in testing drugs on people in poor countries.\n\nBefore a drug can be sold to the public, the FDA and similar agencies in Europe mandate that a company test the drug on human subjects. The third and final phase of these tests before the drug can go to market are Phase III clinical trials, during which companies are required to give the drug to large numbers of people in controlled studies.\n\nIt’s estimated that about 90 percent of drug development costs are incurred in Phase III trials. But these companies can avoid costs by conducting the trials in so-called developing nations.\n\nThis cost-cutting strategy has been outlined by the U.S. consulting firm McKinsey, which suggested including “emerging markets” in drug trials to reduce “the loss of significant revenues.”\n\nSo it comes as no surprise that the Gates Foundation, a McKinsey client, outwardly stated its “goal” was to help drug companies side-step safety trials and accelerate the drug approval process for pharmaceutical companies. Or, as they put it, to “refine potential interventions such as vaccine candidates before they enter costly and time consuming late-stage clinical trials.”\n\nWhile conducting clinical trials on the poor is financially advantageous, it can also be dangerous. Citing numerous examples of the danger, a South African newspaper once declared, “We are the guinea pigs for the drug makers.”\n\nFrom 2009 to 2011 Phase III clinical trials of the first malaria vaccine – funded by the Gates Foundation and manufactured by GSK – took place in seven African countries (Ghana, Kenya, Malawi, Mozambique, Burkina Faso, Gabon, and Tanzania).\n\nIn 2011, GSK’s own data showed female children were dying (from any cause) at more than twice the rate of those in the control group. Children who received the vaccine also had a risk of meningitis that was 10 times higher than those who didn’t. Yet the WHO still coordinates the administration of the drug to over seven hundred thousand children in Ghana, Kenya, and Malawi – as part of an unofficial clinical trial it calls a “pilot implementation.” (It was the Gates-aligned SAGE that recommended the pilot implementation.)\n\nSince this product is administered to children as part of the countries’ vaccination schedule, the WHO claims consent is implied. But parents aren’t always given information regarding safety risks, again rendering them unable to give informed consent for their children. As the Associate Editor of the British Medical Journal put it, “an implied consent process means that recipients of the malaria vaccine are not being informed that they are in a study.”\n\nThe Gates Foundation also funded clinical trials of Human Papillomavirus (HPV) vaccines made by GSK and Merck. These drugs were given to 23,000 young girls in remote Indian provinces as part of an initiative by the Gates-backed Program for Appropriate Health and Technology (PATH).\n\nAgain, study participants were robbed of the ability to give informed consent, as the “pros and cons of vaccination [were not] properly communicated to the parents/guardians.”\n\nAccording to Professor Linsey McGoey from the University of Essex:\n\n“Most of the vaccines were given to girls at ashram pathshalas (boarding schools for tribal children), side-stepping the need to seek parental consent for the shots.”\n\nPATH also failed to implement a system for recording major adverse reactions to the vaccines, which is legally mandated for large-scale clinical trials. The Indian Committee on Health and Family Welfare brought PATH to court for this alleged transgression, accusing it of human rights violations and of child abuse. In 2013, the court’s two judge panel observed that while foreign companies “are treating India as a heaven for clinical trials, and it is proving hell for India.”\n\nIndia’s parliamentary committee charged that the “sole aim” of the Gates-funded project was to promote “commercial interests of the HPV vaccine manufacturers, who would have reaped windfall profits if PATH had been successful in getting the HPV vaccine included in the universal immunization program of the Country.”\n\nEditor Emeritus of the National Medical Journal of India concurred with the panel’s report, writing that this was an “obvious case where Indians were being used as guinea pigs.”\n\nIn addition to pushing dangerous products onto poorer countries, the Foundation actually stunts improvements to public health systems and access to health care. Thus, changes in social and economic determinants of health take a backseat to more profitable, technology centric solutions like vaccines.\n\nThis phenomenon is reflected in the WHO budget. As stated, the Foundation is the largest contributor to the WHO’s polio eradication program, but the largest funder of WHO’s “health systems” program is the government of Japan.\n\nAccording to Global Justice Now, “the [Foundation’s] heavy focus on developing new vaccines… detracts from other, more vital health priorities such as building resilient health systems.”\n\nAs Dr. David Legge explains, “[Gates] has got a mechanistic view of global health, in terms of looking for silver bullets. All of the things he supports are largely framed as silver bullets … That means that major issues that have been identified in the World Health Assembly are not being addressed, including in particular the social determinants of health, and the development of health systems.”\n\nIn 2011, Gates spoke at the WHO, saying: “All 193 member states, you must make vaccines a central focus of your health systems.”\n\nUniversity of Toronto public health professor Anne Emanuelle Birn wrote in 2005 that the Foundation had a “narrowly conceived understanding of health as the product of technical interventions divorced from economic, social, and political contexts.”\n\n“The Gates Foundation has long championed private sector involvement in, and private sector profit-making from global health,” Birn told The Grayzone.\n\nOne of GAVI’s senior representatives even reported that Bill Gates often told him in private conversations “that he is vehemently ‘against’ health systems” because it is a “complete waste of money.”\n\nThis phenomenon is also reflected in how the policy agenda is set at GAVI. GAVI, too, focuses on vertical health interventions like vaccines, instead of horizontal approaches, like building and strengthening health systems in poor countries.\n\nA report by Global Public Health outlines the “Gates approach” to health systems, analyzing how disease-specific projects like vaccines have eclipsed efforts to work on publicly funded health systems. The article’s author, Katerini Storeng, pointed to GAVI as an example of how “global health initiatives have come to capture the global health debate about health systems strengthening in favor of their disease specific approach and ethos.”\n\nAccording to a former GAVI staffer who spoke with Storeng, even former GAVI CEO Julian Lob-Levitt was aware of the “absurdity of vaccine campaigns that consume four weeks to plan, implement and clean up and that, when repeated eight times a year, totally paralyze the health system.”\n\nAt one point, Lob-Levitt commissioned a series of evaluations of GAVI, which identified weaknesses in health systems and the need to strengthen them. The push to do so, however, was “strongly resisted by many powerful actors [on GAVI’s board]” including USAID and the Gates Foundation, according to Storeng’s interviews.\n\nStoreng writes that a GAVI staffer told her that the Foundation was a “very loud, vocal voice, saying that we do not believe in the strengthening of health systems.”\n\nGates’ reputation for being ‘not very good at listening’ has encouraged a non-confrontational approach within the global health arena … a former GAVI employee and HSS [health systems strengthening] proponent recounted how he and his colleagues used to ‘roll down the HSS posters’ when Bill Gates came to visit the GAVI headquarters in Geneva because he is known to ‘hate this part’ of GAVI’s work.\n\nThe Foundation’s preference for weak public health systems, and for techno-centric solutions to public health problems is not limited to its work with the drug industry. It also shapes policy in the crucial sector of food.\n\nEarly this year, Gates set up a new non-profit institute based in St. Louis, Missouri, home of Monsanto. The Foundation said the new organization, dubbed Gates Ag One, will “enable the advancement of resilient, yield enhancing seeds” and introduce them into “crops essential to smallholder farmers, particularly in sub-Saharan Africa and South Asia.”\n\nYet while helping small farmers sounds like a noble endeavor, the Foundation has worked to ensure that the Global South is dependent on Western industry, whether through drugs or high-tech seeds and agrochemicals.\n\nMuch of this activity began in 2006 when the Gates Foundation partnered with the Rockefeller Foundation to give birth to the Alliance for A Green Revolution in Africa (AGRA). Gates committed $100 million, while the Rockefeller Foundation ponied up with $50 million.\n\nThe approach of AGRA, which opened up African markets to U.S. agribusiness, is based on the belief that hunger is due to a lack of Western tech, instead of the result of inequality or exploitation.\n\nAccording to a report by the African Center for Biosafety:\n\n“It is striking that none of those in the forefront of the revolution is African. No different from the colonial project in Africa, this new revolution is created and most ardently advocated by white men claiming to fight for the emancipation of Africans from the clutches of hunger and poverty.”\n\nThrough AGRA, the Foundation pushes for the introduction of patented, genetically modified (GM) seeds and fertilizers. While these technologies help seed and chemical giants like Monsanto, they often undermine food security.\n\nDr. Vandana Shiva maintains that the idea that GM crops increase yields is a “scientific falsehood.” For another, the Foundation again ensures that valuable resources are diverted away from systemic solutions to hunger and poverty.\n\nAs the Ecologist asserted, Gates and Monsanto partner in the “inappropriate and fraudulent GMO project which promotes a technical quick fix ahead of tackling the structural issues that create hunger, poverty and food insecurity.”\n\nWhat’s more, the Gates Foundation actually influences African governments to change laws to accommodate the agriculture industry\n\n“In Ghana … AGRA helped the government review its seed policies with the goal of identifying barriers to the private sector getting more involved. With technical and financial support from AGRA, the country’s seed legislation was revised and a new pro-business seed law was passed in mid-2010. Among other things it established a register of varieties that can be marketed. In Tanzania, discussions between AGRA and government representatives facilitated a major policy change to privatise seed production. In Malawi, AGRA supported the government in revising its maize pricing and trade policies.”\n\nCommenting on the role of Gates in reshaping agriculture markets, Shiva told The Grayzone, “You create a new field, you invest in it. You force governments to invest in it, you destroy the regulation. You destroy the alternatives, you attack the scientists. And you create a whole machinery for your monopoly.”\n\nAs in the case of Gates and Big Pharma, these moves can be explained by the Gates Foundation’s apparent conflicts of interest. And as before, the examples go on and on.\n\nFormer Deputy Director of the Foundation’s agriculture program, Robert Horsch, was previously a high ranking executive at Monsanto, where he worked for 25 years. Horsch led the team that manages agricultural grants, and according to Global Policy Forum, “he was asked to join the Gates Foundation particularly for the purpose of continuing his Monsanto research.”\n\nSam Dryden, the former director of the Gates Foundation’s agriculture program, previously led two of the largest genetically modified seed companies, Emergent Genetics and Agragentics Corporation. In 2005, Emergent was bought by Monsanto, where Dryen stayed for six months. While he was at the Gates Foundation, The Guardian called him “the most powerful figure in the global south’s agriculture.”\n\nThe former program officer for Gates’ agriculture program, Don Doering, was previously a founding member of Monsanto’s Biotechnology Advisory Council. Doering led an Agricultural Development team that directed money into “help[ing] poor farmers in Sub-Saharan Africa and Asia.”\n\nThen there’s Florence Wambugu, who authored the book “Modifying Africa” and has been called “an apostle of Monsanto in Africa.” After receiving a scholarship from USAID, Wambugu became a researcher at Monsanto. She was then appointed to the Gates Foundation’s Global Development board.\n\nAs with several of its pharmaceutical endeavors, the Gates Foundation works with USAID in the agriculture sector. Pamela K. Anderson, the current director of agriculture development at the Gates Foundation, is currently on the board of USAID.\n\n22 thousand children die each day due to poverty. Yet socio-economic causes of health problems can be neglected when industry aligned interests call the shots. Such is the case with the Gates Foundation’s primacy in the global health arena.\n\nIn short, the Foundation’s leadership in previous global health efforts displays an allegiance not to public health, but to the imperatives of Western capital. It prefers not to strengthen health systems, but to ensure nations remain dependent on Big Pharma and/or Big Agriculture for as long as possible. It is in this light the Gates’ leadership in the global fight against COVID-19 can be understood.\n\nIn March, the U.S. passed federal regulations granting liability immunity to corporations producing COVID 19 drugs, including vaccines. It also provided liability immunity to any entity distributing the drugs.\n\nWith over one hundred COVID vaccines currently in development, this means products will be indemnified against lawsuits, even if they produce harmful effects.\n\nIf vaccine makers are indeed exempted by governments around the globe from legal penalties, these companies have little incentive to protect people from harmful side effects. As in the past, it seems that citizens of the world’s poorest countries are set to become “guinea pigs for the drug makers.”\n\nBill Gates’ advocacy for legal immunity for drug manufacturers dates back to at least 2015, when he lamented during the Ebola outbreak that there was no clear process for “providing indemnity against legal liability.” He suggested that during a “global epidemic,” drug companies should be indemnified to “avert long delays.” Now, his proposal is coming to fruition.\n\nGates justified his position on the grounds that companies will need to produce drugs as fast as possible to save lives, and these new drugs may not always be safe. “Understanding safety… is very, very hard,” he said to CBS. “There will be some risk and indemnification needed before [getting a vaccine out] can be decided on.”\n\nNormally, a drug goes through a phase of animal testing before it gets tested on small (Phase I), medium (Phase II) and large numbers of people (Phase III). But with COVID, Gates wants to “save time” by conducting tests on humans and animals at the same time.\n\nToday, the US is “compressing what is typically ten years of vaccine development,” according to the head of the U.S. National Institute of Health (NIH).\n\nThis may produce some troubling effects. For one, a successful coronavirus vaccine has yet to be produced, and a new one could trigger lethal reactions. Tropical disease specialist Dr. Peter Hotez, who worked on a failed vaccine for another coronavirus (SARS), said that during experimental tests of the drug, animals fell victim to what he calls “immune enhancement.” The animals that were given the shot developed more severe (and often fatal) versions of the virus when compared with unvaccinated animals.\n\nHotez told Reuters, “The way you reduce that risk [for humans] is first you show it does not occur in laboratory animals.” The medical expert stated that while “[he understands] the importance of accelerating timelines for vaccines in general, but … this is not the vaccine to be doing it with.”\n\nWithout performing the initial phase of animal testing normally required to bring a vaccine to market, a biotech company named Moderna is now conducting human trials for its COVID vaccine. Moderna’s vaccine is an mRNA type which has never been approved by the FDA for use on humans.\n\nThis technology, which contains genetically engineered cells that can permanently alter human DNA, was developed with grants from both the Gates Foundation and the Pentagon’s Defense Advanced Research Projects Agency (DARPA). Moderna says it has a “strategic alliance” with DARPA, which gave the company $25 million in total.\n\nModerna’s mRNA technology has been singled out by Bill Gates as “one of the most promising options for COVID.” Gates even has a “global health project framework agreement” with Moderna to give it up to $100 million for the development of its mRNA technology, in exchange for receiving “certain non-exclusive licenses.”\n\nModerna’s co-founder Robert Langer has partnered with Gates in the past on projects such as the contraceptive microchip implant that can be activated wirelessly.\n\nWhen Moderna announced the completion of its Phase 1 safety trial May 18, corporate news outlets parroted Moderna’s “good news.” But the fine print in the release revealed that three of the 15 participants injected with the highest dose of the vaccine developed grade three systemic symptoms, which the FDA defines as “severe,” “disabling,” requiring “hospitalization,” but “not immediately life-threatening.”\n\nOn May 15, President Trump appointed Moncef Slaoui – a board member of Moderna who until May 19 held more than $10.3 million in Moderna stock – as Chief Scientist of the nation’s effort to find a COVID 19 vaccine.\n\nSlaoui, who calls himself a “venture capitalist,” is also on the board of directors at The International AIDS Vaccine Initiative (IAVI), a “public-private” partnership organization that’s received more than $359 million from the Gates Foundation.\n\nSloaui also held leadership positions at GSK. While heading the company’s Research and Development, GSK pleaded guilty and paid $3 billion in what the U.S. Justice Department referred to as the “largest healthcare fraud settlement in U.S. history.” The fraud included the coverup of the link between the drug Paxil and suicidal and depressive side effects (predominantly in children), the coverup of the link between the drug Avandia and heart attacks, which the FDA estimated lead to 83,000 excess heart attacks, as well several bribery and illegal kickback schemes.\n\nWhile he was GSK’s Chairman of Vaccines, Slaoui oversaw the development of the swine flu vaccine named Pandemrix, which was rushed to market without proper testing during the swine flu outbreak. The result was an unsafe shot that left at least eight hundred people with brain damage, 80 percent of them children. Since GSK only agreed to give governments the vaccine on the condition that it be indemnified from liability, U.K. taxpayer money was used to pay millions of pounds in compensation to the victims.\n\nSlauoi was hired to be the Trump Administration’s “vaccine czar” as a private contractor, not a government employee. This means, as Public Citizen explained, that Slaoui can “maintain an extensive web of conflicting financial interests without the need to divest of, recuse from, or disclose those conflicting interests.”\n\nThe corporate media likes to paint the COVID response as a tug of war between the blowhards like Donald Trump and “champions of science” like Bill Gates. However, Slaoui’s appointment to co-direct “Operation Warp Speed” indicates that here, the Trump Administration and the Gates Foundation are on the same team.\n\nAfter entering his new Trump Administration role, Slaoui declared that Moderna’s clinical trial data made him confident “we will be able to deliver a few hundred million doses of vaccine by the end of 2020.”\n\nAlthough the U.S. government has picked Moderna as one of its five COVID vaccine “finalists,” financial moves by some company executives suggest Moderna’s best days might be behind them.\n\nAccording to SEC filings, the company’s Chief Financial Officer Lorence Kim sold 214,000 Moderna shares on the day of the press release, immediately profiting more than $16 million.\n\nThomas Lys, a professor of accounting at Northwestern University, was quoted by Stat News saying this could simply be a financial decision by Moderna to get some liquidity, but that “there’s always that other possibility – that these guys really know the whole thing is bogus and they’re selling while the selling is good.”\n\nChief medical officer Tal Zaks, who held close to 100,000 shares of Moderna stock at the beginning of the year, started dumping shares a few days before Moderna announced its vaccine was ready for human testing, has profited more than $18 million in 2020, and now owns zero shares.\n\n“If he even thought there was a chance this vaccine would be good, he’d hold on to a few hundred shares,” said Del Bigtree, host of the medical talk show The Highwire. “I think we may have a whistleblower right here, that is saying to the world, yes, I have zero. I am the Chief Medical Officer and I’m telling you, this ship is sinking.”\n\nA centralized stockpile to “make WHO dependent on the goodwill of Big Pharma”\n\nIn October 2019, the Johns Hopkins Center for Health Security hosted something called Event 201 in partnership with the World Economic Forum and the Gates Foundation.\n\nEvent 201 was an exercise simulating the outbreak of a novel coronavirus. It included representatives from the U.S. National Security Council, as well as corporate leadership from drugmakers like Johnson & Johnson. While similarities between the mock outbreak and the real outbreak have prompted unsubstantiated theories about Bill Gates “predicting” COVID 19, it is undeniable that the policy proposals that emerged out of the exercise are being implemented today.\n\nFollowing the simulation (complete with chillingly realistic mock press conferences and newscasts by an imitation network called GNN), the three organizations issued recommendations for dealing with a “severe pandemic.” One recommendation was to have a “robust international stockpile” of medical countermeasures like vaccines.\n\nDuring the simulation, the Foundation’s Global Health President, Chris Elias, urged such a stockpile. He explained that “a global stockpile would certainly help ensure a rational and strategic allocation,” but that a collaboration between the WHO and the private sector is necessary to make one effective.\n\nFrom an objective standpoint, a centralized stockpile of medical countermeasures can be of value during a health crisis. But the question of who controls and distributes it raises troubling issues.\n\nDr. David Legge told The Grayzone that Elias’s suggestion would further increase the influence of Big Pharma, because “undoubtedly, a public private partnership with a procurement focus and distribution focus would involve Big Pharma and make WHO dependent on the goodwill of Big Pharma.”\n\nGates might argue that the control and distribution of such stockpiles should also be influenced by Western institutions like NATO. In 2015, he wrote that during a “severe epidemic,” “some global institution could be empowered and funded to coordinate the [epidemic response] system,” that there should be discussion about splitting authority between the WHO and “others (including the World Bank and the G7 countries),” and that “the conversation should include military alliances such as NATO.”\n\nGates has also argued that “low-income countries should be some of the first to receive [the COVID 19 vaccine].” If NATO is playing a role in controlling and distributing vaccines, such aid could be used to further a Western military agenda, as Western “aid” has been during past humanitarian interventions.\n\nGates has nearly monopolized the realm of public health policy, both nationally and internationally. “Fauci and I are in constant contact,” he has proclaimed, referring to the face of the U.S. COVID response, National Institute of Allergy and Infectious Diseases Director Anthony Fauci. At the same time, the mega-billionaire is apparently talking to both CEOs of pharmaceutical companies and heads of government “every day.”\n\nWhile maintaining relationships with government organizations and the profit-driven private sector, the Gates Foundation has become perhaps the most influential player in the global COVID 19 response. So if the Foundation’s work has favored Western multinationals at the expense of public health in the past, why should anyone expect a different result this time?\n\nEarly July the Associated Press reported that South Africans had gathered in Johannesburg to protest the presence of the phase III AstraZeneca clinical trial in Africa. The Gates Foundation had poured $750 million into this vaccine effort in the last month, and protestors were photographed holding banners that read, “we not guinea pigs” and, “no to Gates poison.”\n\nDemonstration organizer Phapano Phasha told AP that vulnerable groups were being manipulated into participating in the trial without being able to make an informed choice. “I believe in science,” Phasha said. “I’m not against vaccinations, I’m against profiteering.”\n\nReports say both Moderna’s and AstraZeneca’s vaccine could be available for public distribution by the end of the year.\n\nThe Grayzone contacted the Bill & Melinda Gates Foundation, the Global Alliance for Vaccines and Immunization (GAVI), and the Program for Appropriate Technologies in Health (PATH) for comment on this article and has yet to receive a response.\n\nJeremy Loffredo is a journalist based in Washington D.C. He has worked on various independent documentaries in New York and helped produce several international news programs. He is currently putting together a documentary on the Green New Deal which you can support at https://www.gofundme.com/f/the-green-new-deal-explained-for-real\n\nThe views expressed in this article are solely those of the author and do not necessarily reflect the opinions of Information Clearing House.", "opengraph": {}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Great op-ed by <a href=\"https://twitter.com/BillGates?ref_src=twsrc%5Etfw\">@BillGates</a> about the <a href=\"https://twitter.com/hashtag/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\">#COVID19</a> response. I thank him for his support of <a href=\"https://twitter.com/WHO?ref_src=twsrc%5Etfw\">@WHO</a>’s call for global solidarity, investing in new tools now before it’s too late and ensuring equitable access. <a href=\"https://t.co/UyDhCUkEzN\">https://t.co/UyDhCUkEzN</a></p>— Tedros Adhanom Ghebreyesus (@DrTedros) <a href=\"https://twitter.com/DrTedros/status/1249285184958103552?ref_src=twsrc%5Etfw\">April 12, 2020</a></blockquote> &#13;\n\t\t\t\t\t\t"], "movies": [], "links": ["https://twitter.com/BillGates?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/COVID19?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/WHO?ref_src=twsrc%5Etfw", "https://t.co/UyDhCUkEzN", "https://twitter.com/DrTedros/status/1249285184958103552?ref_src=twsrc%5Etfw", "https://www.who.int/immunization/policy/sage/en/", "https://www.who.int/immunization/sage/DOI_March_2020_pre_meeting.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/17055633", "https://www.globaljustice.org.uk/sites/default/files/gated_development_final_version.pdf", "https://www.gatesfoundation.org/search#q/k=Inform%20and%20Engage%20Communities", "https://www.theguardian.com/global-development/2020/feb/25/the-sel-injectable-contraceptive-helping-refugees-in-uganda-plan-their-families-south-sudan", "https://www.theguardian.com/gnm-press-office/guardian-launches-global-development-site", "https://www.seattletimes.com/seattle-news/does-gates-funding-of-media-taint-objectivity/", "http://blogs.reuters.com/mediafile/2008/12/01/newshour-gets-35-million-from-gates-foundation/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(77)91028-5/fulltext", "https://download.nap.edu/cart/download.cgi?record_id=12085", "https://www.ncbi.nlm.nih.gov/pubmed/1415136", "https://www.ncbi.nlm.nih.gov/pubmed/6792699", "https://www.nap.edu/login.php?record_id=12085&page=https%3A%2F%2Fwww.nap.edu%2Fdownload%2F12085", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4975064/", "https://www.cdc.gov/pertussis/about/faqs.html", "https://www.gavi.org/sites/default/files/document/performance-based-funding-information-sheetpdf.pdf", "https://www.gavi.org/sites/default/files/publications/progress-reports/Gavi-Progress-Report-2018.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5360569/", "https://www.gavi.org/sites/default/files/publications/2021-2025%20Gavi%20Investment%20Opportunity.pdf", "https://www.gatesfoundation.org/what-we-do/global-development/polio", "https://philanthropynewsdigest.org/news/gates-others-pledge-1.2-billion-to-eradicate-polio", "https://www.ucsf.edu/news/2017/03/406281/new-polio-virus-evolution-insights-could-lead-improved-vaccine", "https://www.npr.org/sections/goatsandsoda/2017/06/28/534403083/mutant-strains-of-polio-vaccine-now-cause-more-paralysis-than-wild-polio", "https://www.npr.org/sections/goatsandsoda/2017/06/28/534403083/mutant-strains-of-polio-vaccine-now-cause-more-paralysis-than-wild-polio", "https://www.gatesfoundation.org/Where-We-Work/China-Office/Case-Highlights/Meeting-Global-Demand-for-Oral-Polio-Vaccine", "https://www.who.int/csr/don/24-september-2019-polio-outbreak-the-philippines/en/", "https://www.sciencemag.org/news/2018/07/polio-outbreaks-congo-threaten-global-eradication", "https://academic.oup.com/jid/article/192/12/2033/838973", "https://academic.oup.com/cid/article/49/8/1287/429938", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6121585/pdf/ijerph-15-01755.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6121585/pdf/ijerph-15-01755.pdf", "https://ijme.in/articles/polio-programme-let-us-declare-victory-and-move-on/?galley=html", "https://ijme.in/articles/polio-programme-let-us-declare-victory-and-move-on/?galley=html", "https://www.bmj.com/content/344/bmj.e2398/rapid-responses", "https://ijme.in/articles/polio-programme-let-us-declare-victory-and-move-on/?galley=html", "https://www.who.int/csr/don/13-June-2017-polio-syrian-arab-republic/en/", "https://www.gatesfoundation.org/What-We-Do/Global-Development/Family-Planning", "https://www.ted.com/talks/melinda_gates_let_s_put_birth_control_back_on_the_agenda?language=en", "https://web.archive.org/web/20030418181912/http://www.cbc.ca/consumers/market/files/health/medical_devices/lawsuits.html", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2018/12/OPP1200867", "https://degrees.fhi360.org/2013/02/the-evolution-of-implants/", "https://pdf.usaid.gov/pdf_docs/PA00K414.pdf", "https://web.archive.org/web/20111005105328/http://discover.lib.umn.edu/cgi/f/findaid/findaid-idx?c=umfa;cc=umfa;q1=Association%20for%20Voluntary%20Sterilization%20Records;rgn=main;view=text;didno=SW0015", "https://partnerships.usaid.gov/partnership/global-introduction-sayana-press", "https://medium.com/bill-melinda-gates-foundation/keeping-our-promise-to-120-million-women-and-girls-62fc3d28234a", "https://www.marketwatch.com/story/gatess-4-billion-foray-in-global-family-planning-2012-05-15", "https://www.ncbi.nlm.nih.gov/pubmed/22872710", "https://sljog.sljol.info/articles/abstract/10.4038/sljog.v33i4.4808/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3328650/", "https://www.fhi360.org/sites/default/files/media/documents/community-health-workers-intramuscular-depo-senegal.pdf", "https://www.pop.org/usaid-needs-to-warn-women-of-the-dangers-of-depo-provera/#_edn4", "https://www.advancingpartners.org/sayana®-press-guide-trainers-providers", "https://www.fhi360.org/sites/default/files/media/documents/checklist-dmpa-uganda.pdf", "https://path.azureedge.net/media/documents/RH_sp_training_guide.pdf", "https://www.nichd.nih.gov/newsroom/releases/bone_loss", "https://www.nichd.nih.gov/newsroom/releases/bone_loss", "https://www.pop.org/usaid-needs-to-warn-women-of-the-dangers-of-depo-provera/#_edn4", "https://kafila.online/2015/09/24/a-statement-protesting-approval-to-introduce-injectable-contraceptives-in-the-national-family-planning-programme/", "https://www.fda.gov/media/110437/download", "https://www.manhattan-institute.org/html/stifling-new-cures-true-cost-lengthy-clinical-drug-trials-6013.html", "https://www.mckinsey.com/industries/pharmaceuticals-and-medical-products/our-insights/a-wake-up-call-for-big-pharma", "https://www.gatesfoundation.org/What-We-Do/Global-Health/Discovery-and-Translational-Sciences", "https://digitalcommons.law.ggu.edu/cgi/viewcontent.cgi?article=1205&context=annlsurvey", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2008/03/Pivotal-Phase-III-Malaria-Vaccine-Trial-Begins", "https://www.nejm.org/doi/full/10.1056/nejmoa1102287", "https://www.bmj.com/company/newsroom/whos-malaria-vaccine-study-represents-a-serious-breach-of-international-ethical-standards/", "https://www.path.org/media-center/kenya-joins-malawi-and-ghana-to-roll-out-the-worlds-first-malaria-vaccine/", "https://www.afro.who.int/news/malaria-vaccine-pilot-launched-ghana", "https://www.afro.who.int/news/malaria-vaccine-launched-kenya-kenya-joins-ghana-and-malawi-roll-out-landmark-vaccine-pilot", "https://www.who.int/news-room/detail/23-04-2019-malaria-vaccine-pilot-launched-in-malawi", "https://www.reuters.com/article/us-health-malaria-vaccine/ghana-kenya-and-malawi-to-pilot-gsk-malaria-vaccine-from-2018-idUSKBN17Q0O4", "https://www.who.int/news-room/detail/23-10-2015-pilot-implementation-of-first-malaria-vaccine-recommended-by-who-advisory-groups", "https://www.malariavaccine.org/resources/fact-sheets/rtss-malaria-vaccine", "https://www.bmj.com/company/newsroom/whos-malaria-vaccine-study-represents-a-serious-breach-of-international-ethical-standards/", "http://164.100.47.5/newcommittee/reports/EnglishCommittees/Committee%20on%20Health%20and%20Family%20Welfare/72.pdf", "https://www.gatesfoundation.org/how-we-work/quick-links/grants-database#q/k=path", "http://164.100.47.5/newcommittee/reports/EnglishCommittees/Committee%20on%20Health%20and%20Family%20Welfare/72.pdf", "https://www.sciencemag.org/news/2013/09/indian-parliament-comes-down-hard-cervical-cancer-trial", "http://164.100.47.5/newcommittee/reports/EnglishCommittees/Committee%20on%20Health%20and%20Family%20Welfare/72.pdf", "https://www.sciencemag.org/news/2013/09/indian-parliament-comes-down-hard-cervical-cancer-trial", "https://www.hhrjournal.org/2014/11/health-rights-litigation-pushes-for-accountability-in-clinical-trials-in-india/", "https://www.sciencemag.org/news/2013/09/indian-parliament-comes-down-hard-cervical-cancer-trial", "http://home.cc.umanitoba.ca/~chaser/readings/global%20health%20challenges/Gates_Global_health_Birn_2005.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4166931/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4166931/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4166931/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4166931/", "https://docs.gatesfoundation.org/Documents/GatesAgOne_OverviewandFAQ.pdf", "https://www.twn.my/title2/books/pdf/green.revolution.in.africa.pdf", "https://theecologist.org/2016/jan/21/gates-foundation-spearheading-neoliberal-plunder-african-agriculture", "https://2019.gapsummit.com/speaker/robert-horsch/", "https://www.nationalmedals.org/laureates/robert-horsch", "https://www.globalpolicy.org/images/pdfs/GPFEurope/Philanthropic_Power_online.pdf", "http://www.isaaa.org/kc/cropbiotechupdate/article/default.asp?ID=4998", "https://www.hpj.com/archives/monsanto-creates-biotech-advisory-council/article_909033d7-d675-5ac9-a2c8-e734bf6388b4.html", "https://jrsbiodiversity.org/about-jrs/people/", "https://books.google.com/books?id=PwkOVO9BbnkC&pg=PT307&lpg=PT307&dq=apostle+africa+monsanto+wambugu&source=bl&ots=keB2evoI0g&sig=ACfU3U3ivCwdKaKdx6ZIkuQfKYRKg9MVSw&hl=en&sa=X&ved=2ahUKEwjxl6Lblt_pAhWulHIEHSM_Dd4Q6AEwBXoECAoQAQ#v=onepage&q=apostle%20africa%20monsanto%20wambugu&f=false", "https://books.google.com/books?id=PwkOVO9BbnkC&pg=PT307&lpg=PT307&dq=apostle+africa+monsanto+wambugu&source=bl&ots=keB2evoI0g&sig=ACfU3U3ivCwdKaKdx6ZIkuQfKYRKg9MVSw&hl=en&sa=X&ved=2ahUKEwjxl6Lblt_pAhWulHIEHSM_Dd4Q6AEwBXoECAoQAQ#v=onepage&q=apostle%20africa%20monsanto%20wambugu&f=false", "https://childrenincorporated.org/understanding-child-poverty-facts-and-statistics/", "https://www.hhs.gov/about/news/2020/05/15/trump-administration-announces-framework-and-leadership-for-operation-warp-speed.html", "https://www.whitehouse.gov/briefings-statements/remarks-president-trump-vaccine-development/", "https://www.gatesnotes.com/Health/What-you-need-to-know-about-the-COVID-19-vaccine", "https://www.federalregister.gov/documents/2020/03/17/2020-05484/declaration-under-the-public-readiness-and-emergency-preparedness-act-for-medical-countermeasures", "https://www.who.int/who-documents-detail/draft-landscape-of-covid-19-candidate-vaccines", "https://www.nejm.org/doi/pdf/10.1056/NEJMp1502918", "https://www.cbsnews.com/video/extended-interview-bill-gates-on-coronavirus-pandemic/", "https://www.gatesnotes.com/Health/Pandemic-Innovation", "https://www.reuters.com/article/health-coronavirus-usa-vaccine-exclusive-idINKBN22Z07F?taid=5ec8be39fb44e00001b15b1a&utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=twitter", "https://science.house.gov/imo/media/doc/Hotez%20Testimony.pdf", "https://www.reuters.com/article/us-health-coronavirus-vaccines-insight/as-pressure-for-coronavirus-vaccine-mounts-scientists-debate-risks-of-accelerated-testing-idUSKBN20Y1GZ", "https://www.livescience.com/coronavirus-vaccine-trial-no-animal-testing.html", "https://www.sec.gov/Archives/edgar/data/1682852/000119312520144533/d918307dex991.htm", "https://investors.modernatx.com/news-releases/news-release-details/moderna-ships-mrna-vaccine-against-novel-coronavirus-mrna-1273", "https://investors.modernatx.com/news-releases/news-release-details/darpa-awards-moderna-therapeutics-grant-25-million-develop", "https://www.gatesnotes.com/Health/Pandemic-Innovation", "https://www.modernatx.com/ecosystem/strategic-collaborators/foundations-advancing-mrna-science-and-research", "https://www.washingtonpost.com/news/innovations/wp/2014/07/17/this-amazing-remote-controlled-contraceptive-microchip-you-implant-under-your-skin-is-the-future-of-medicine/", "https://www.technologyreview.com/2014/07/04/74389/a-contraceptive-implant-with-remote-control/", "https://investors.modernatx.com/news-releases/news-release-details/moderna-announces-positive-interim-phase-1-data-its-mrna-vaccine?fbclid=IwAR2fkNqGpvmTUgsd98Rj8uYllVgbgBG4QoYf4xEj3Y4PC9EmjNDy-L8uC_Q", "https://www.nytimes.com/2020/05/18/health/coronavirus-vaccine-moderna.html", "https://www.cnn.com/2020/05/18/health/coronavirus-vaccine-moderna-early-results/index.html", "https://www.sec.gov/Archives/edgar/data/1682852/000119312520144533/d918307dex991.htm", "https://www.fda.gov/media/84954/download", "https://www.linkedin.com/in/moncef-slaoui-740077ba", "https://www.sec.gov/ix?doc=/Archives/edgar/data/1682852/000119312520143814/d924269d8k.htm", "https://www.sec.gov/Archives/edgar/data/1712369/000112760220014877/0001127602-20-014877-index.htm", "https://www.politico.com/news/2020/05/13/slaoui-vaccine-therapeutics-czar-coronavirus-255668", "https://www.wsj.com/market-data/quotes/MRNA/company-people/executive-profile/149612", "https://www.justice.gov/opa/pr/glaxosmithkline-plead-guilty-and-pay-3-billion-resolve-fraud-allegations-and-failure-report", "https://www.finance.senate.gov/imo/media/doc/prb111507a.pdf", "https://www.ibtimes.co.uk/brain-damaged-uk-victims-swine-flu-vaccine-get-60-million-compensation-1438572", "https://hansard.parliament.uk/Commons/2016-01-12/debates/16011278000004/SwineFluVaccinationCompensation", "https://www.thetimes.co.uk/article/victims-of-swine-flu-jab-to-get-pound60m-payout-02ptvlnlzqk", "https://www.citizen.org/article/covid-19-vaccine-czar-moncef-slaoui-should-be-classified-as-a-special-government-employee/", "https://www.whitehouse.gov/briefings-statements/remarks-president-trump-vaccine-development/", "https://www.usatoday.com/story/news/health/2020/05/18/coronavirus-vaccine-who-get-first-cdc-panel-usually-decides/5202932002/", "https://www.nytimes.com/2020/06/03/us/politics/coronavirus-vaccine-trump-moderna.html", "https://investors.modernatx.com/financial-information/sec-filings?field_nir_sec_date_filed_value=2020#views-exposed-form-widget-sec-filings-table", "https://www.statnews.com/2020/05/27/moderna-executives-cashed-out-shares-stock-price-soared/", "https://www.instagram.com/highwiretalk/", "https://www.centerforhealthsecurity.org/event201/", "https://www.adn.com/nation-world/2020/05/05/before-the-pandemic-trumps-stockpile-chief-put-the-focus-on-biodefense-an-old-client-benefited/", "https://s21.q4cdn.com/488056881/files/doc_financials/2019/q4/2019-Form-10-K-Final.pdf", "https://s21.q4cdn.com/488056881/files/doc_financials/2019/q4/2019-Form-10-K-Final.pdf", "https://www.businessinsider.com/coronavirus-conspiracy-bill-gates-infowars-2020-4", "https://www.youtube.com/watch?v=Vm1-DnxRiPM&list=PL9-oVXQX88esnrdhaiuRdXGG7XOVYB9Xm&index=2", "https://www.centerforhealthsecurity.org/event201/recommendations.html", "https://www.gatesfoundation.org/who-we-are/general-information/leadership/executive-leadership-team/christopher-elias", "https://www.centerforhealthsecurity.org/event201/videos.html", "https://www.nejm.org/doi/10.1056/NEJMp1502918", "https://www.gatesnotes.com/Health/What-you-need-to-know-about-the-COVID-19-vaccine", "https://www.gatesnotes.com/Health/Pandemic-Innovation", "https://apnews.com/2e4da5fca36da1b1defbd96120db247e", "https://www.wsj.com/articles/astrazeneca-signs-more-coronavirus-vaccine-supplydeals-11591304979", "https://thenextweb.com/hardfork/2020/06/05/bill-gates-covid-coronavirus-vaccine-750-million-oxford-azd1222/", "https://www.cnbc.com/2020/07/02/moderna-stock-falls-8percent-after-report-says-late-stage-coronavirus-vaccine-trial-delayed.html", "https://www.tribuneindia.com/news/nation/oxford-vaccine-by-yr-end-partner-firm-107843", "https://www.gofundme.com/f/the-green-new-deal-explained-for-real", "https://thegrayzone.com/2020/07/08/bill-gates-global-health-policy/"], "authors": [], "publish_date": null}