{"result_id": "170004", "URL": "https://ingredients.news/2023-04-06-jnj-settles-lawsuits-baby-powder-causes-cancer.html", "timestamp": "2023-04-25 15:39:31 CEST+0200", "meta": {"description": "Johnson & Johnson offered almost $9 billion – more than four times what it previously offered – to settle lawsuits alleging its talc-based baby powder causes cancer. The $8.9 billion settlement proposed by the Big Pharma firm was aimed at around 100,000 claimants seeking damages. As of writing, 60,000 claimants have accepted the offer. Alongside this, […]", "lang": "en", "keywords": "asbestos,baby powder,badcancer,badhealth,Big Pharma,cancer causes,cancer criminals,carcinogen,deception,Johnson & Johnson,lawsuit,products,settlement,talc,talcum powder,toxic ingredients,traitors", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2023-04-06-jnj-settles-lawsuits-baby-powder-causes-cancer.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "J&J offers almost $9B to settle lawsuits alleging its talc-based baby powder caused cancer", "cleaned_text": "J&J offers almost $9B to settle lawsuits alleging its talc-based baby powder caused cancer\n\nJohnson & Johnson offered almost $9 billion – more than four times what it previously offered – to settle lawsuits alleging its talc-based baby powder causes cancer.\n\nThe $8.9 billion settlement proposed by the Big Pharma firm was aimed at around 100,000 claimants seeking damages. As of writing, 60,000 claimants have accepted the offer. Alongside this, J&J did not admit any wrongdoing on its part and insisted that its talc-based baby powder is safe to use.\n\nPrior to the settlement, J&J initially offered $2 billion to settle all cases. It also filed for Chapter 11 bankruptcy protection via its subsidiary LTL Management LLC, which was established in 2021, in response to the growing lawsuits. However, the courts rejected the bid and declared that neither J&J nor its subsidiary was in a financial situation that would make bankruptcy protection necessary. (Related: J&J trying to weasel its way out of paying $3.5 billion to victims of its cancer-causing baby talc by forming a new corporation and immediately declaring bankruptcy.)\n\nJ&J Worldwide Vice President of Litigation Erik Haas said the company decided to pay out settlements as fighting the lawsuits in court would require a lot of time and money. He elaborated that the settlements allow claimants “to be compensated in a timely manner and enables the company to remain focused on our commitment to profoundly and positively impact health for humanity.”\n\nAccording to several claimants, they have suffered from either ovarian cancer or mesothelioma – a cancerous tumor that can form on the outside of a person’s lungs, heart and other organs – as a result of using the product. Mesthelioma is often associated with the carcinogenic asbestos, which is incidentally found in the same mines where talc for baby powder is obtained. According to studies, inhaling or exposing skin to asbestos can cause a variety of issues for a person.\n\nBack in October 2019, the Food and Drug Administration found trace amounts of asbestos in a bottle of J&J baby powder. Given that it is near impossible to separate trace amounts of asbestos from talc, the product was recalled from store shelves in the U.S. and Canada.\n\nHowever, a Reuters investigation the year prior claimed that J&J had been aware of the presence of asbestos in its talc products for decades. Internal company records, witness testimony and other evidence showed that from at least 1971 to the early 2000s, the firm’s raw talc and finished powders sometimes tested positive for small amounts of the fibrous silicate mineral.\n\nIn August 2022, J&J announced it would cease selling talc-based baby powder worldwide by the next year. It also responded to claims that its product causes cancer by replacing talc with cornstarch.\n\n“As part of a worldwide portfolio assessment, we have made the commercial decision to transition to an all cornstarch-based baby powder portfolio,” it said in a statement, adding that cornstarch-based baby powder is already sold in countries around the world.\n\nHowever, the shift to cornstarch-based baby powder was merely a sales-saving measure. A company spokeswoman blamed dwindling demand for the talc-free product on “misleading talc litigation advertising that caused global confusion and unfounded concern.” Alongside the $8.9 billion settlement, J&J is doubling down on its insistence that talc-based baby powder “is safe and does not cause cancer.”\n\nVisit BigPharmaNews.com for more stories about J&J.\n\nWatch this video about the bombshell report disclosing the contamination of J&J baby powder with the cancer-causing asbestos.\n\nThis video is from the Natural News channel on Brighteon.com.\n\nBombshell report shows Johnson & Johnson talc baby powder products are contaminated with cancer-causing asbestos – and the company has known for nearly 50 years.", "opengraph": {"title": "J&J offers almost $9B to settle lawsuits alleging its talc-based baby powder caused cancer", "type": "article", "url": "https://www.ingredients.news/2023-04-06-jnj-settles-lawsuits-baby-powder-causes-cancer.html", "site_name": "Ingredients News", "description": "Johnson & Johnson offered almost $9 billion – more than four times what it previously offered – to settle lawsuits alleging its talc-based baby powder causes cancer. The $8.9 billion settlement proposed by the Big Pharma firm was aimed at around 100,000 claimants seeking damages. As of writing, 60,000 claimants have accepted the offer. Alongside this, […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2023/04/BabyPowder.jpg"}, "tags": ["lawsuit", "settlement", "Big Pharma", "products", "cancer criminals", "baby powder", "deception", "talc", "Johnson & Johnson", "toxic ingredients", "talcum powder", "traitors", "asbestos", "carcinogen"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-11939257/J-J-unit-files-second-bankruptcy-pursue-8-9-billion-talc-settlement.html", "https://www.jnj.com/ltl-update", "https://naturalnews.com/2022-02-09-jj-avoid-paying-cancer-victims-baby-talc.html", "http://cancer.news", "https://www.jnj.com/johnson-johnson-consumer-health-to-transition-global-baby-powder-portfolio-to-cornstarch", "https://bigpharmanews.com/", "https://www.brighteon.com/00000000-0000-0000-0006-009034430001", "https://www.brighteon.com/channels/naturalnews", "https://naturalnews.com/2021-06-07-supreme-court-rejects-talc-verdict-appeal.html", "https://products.news/2019-03-17-woman-awarded-29-million-in-johnson-johnson-cancer-case.html", "https://cancer.news/2019-08-12-johnson-johnson-to-face-criminal-investigation-over-asbestos-talc-scandal.html", "https://corruption.news/2019-01-13-johnson-johnson-talc-baby-powder-products-contaminated-with-cancer-causing-asbestos.html", "https://www.dailymail.co.uk/health/article-11939257/J-J-unit-files-second-bankruptcy-pursue-8-9-billion-talc-settlement.html", "https://www.jnj.com/ltl-update", "https://www.jnj.com/johnson-johnson-consumer-health-to-transition-global-baby-powder-portfolio-to-cornstarch", "https://www.brighteon.com/00000000-0000-0000-0006-009034430001", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2023-04-06-jnj-settles-lawsuits-baby-powder-causes-cancer.html&linkname=J%26J%20offers%20almost%20%249B%20to%20settle%20lawsuits%20alleging%20its%20talc-based%20baby%20powder%20caused%20cancer", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}