{"result_id": "170028", "URL": "https://ingredients.news/2022-11-08-scientists-find-graphene-oxide-nanotechnology-covid-injections.html", "timestamp": "2023-04-25 15:39:46 CEST+0200", "meta": {"description": "Scientists in Spain have found graphene oxide and nanotechnology in Wuhan coronavirus (COVID-19) injections. According to scientists, graphene oxide can be detected in the immune system as if it were a pathogen. Once injected, it has an affinity for the central nervous system, which can potentially cause paralysis, stroke and alteration of the nervous system. They explained that graphene […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Pharma,biological weapon,biotech,COVID,Dangerous Medicine,discoveries,gene therapy,graphene oxide,nanoparticles,nanotechnology,pharmaceutical fraud,Plandemic,research,toxic ingredients,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2022-11-08-scientists-find-graphene-oxide-nanotechnology-covid-injections.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "Spanish scientists find graphene oxide, nanotechnology in COVID-19 injections", "cleaned_text": "Scientists in Spain have found graphene oxide and nanotechnology in Wuhan coronavirus (COVID-19) injections.\n\nAccording to scientists, graphene oxide can be detected in the immune system as if it were a pathogen. Once injected, it has an affinity for the central nervous system, which can potentially cause paralysis, stroke and alteration of the nervous system. They explained that graphene oxide also has the potential to cause blood clots, which explains why COVID-19 injections increase the risk of people suffering from thrombosis with thrombocytopenia.\n\nNanotechnology, on the other hand, can help control the atoms in the body.\n\nNumerous other experts around the world also published their own findings where they allegedly discovered both graphene oxide and nanotechnology in the COVID-19 injections.\n\nStrangely, the components of the Pfizer and Moderna COVID-19 injections exhibit no evidence of biological material, including mRNA or DNA. This is according to Dr. Daniel Nagase, a Canadian emergency room physician who examined electron microscope photos of the materials included in the Pfizer and Moderna injections.\n\nThese samples were examined by Dr. Nagase’s research team under a standard microscope. Members of Nagase’s team saw a number of highly intriguing visuals, although they were unsure of what they were seeing exactly.\n\nThey later utilized an electron microscope to identify the components of the “vaccines” and found a “ball with the legs growing out of it” in a Moderna sample.\n\n“This shape, this ball with the legs growing out of it, for some reason has aluminum in it,” Nagase said. “And I can say with certainty that this isn’t a mold spore or some other type of biological contamination, because the only thing in it is carbon, oxygen, and no signs of nitrogen, no signs of phosphorus, which would indicate something biological of origin. So, this thing that’s growing is non-biological.”\n\nIn the United Kingdom, scientists found that graphene nanomaterials were capable of penetrating the body’s natural barriers, including the blood-brain barrier, which can damage the central nervous system and internal organs. It can also destroy blood health, trigger cancer and even cause permanent changes to gene function.\n\nMartin Monteverde, an Argentine doctor, presented analyses from the Corona2Inspect researchers on the microtechnology that was found in vaccines manufactured by Cansino, Pfizer, AstraZeneca, Sinopharm, and Sputnik.\n\nPatricia Aprea, director of evaluation and control at the National Administration of Drugs, Foods and Medical Devices (ANMAT), also accidentally admitted that AstraZeneca vaccines contain graphene during a legal case about post-COVID injection death.\n\nANMAT later retracted its admission, stating that the report has a typographical error. It claimed that when the report said “graphene is found within its components,” it was meant to say that it was not found within its components. But ANMAT failed to explain why it followed up the statement with graphene needing to be noted as a component of the vaccine on labels and leaflets accompanying the injections.\n\nScientists in New Zealand also confirmed that nanotechnology has been found in Pfizer’s Comirnaty vaccines.\n\nDr. Matt Shelton from New Zealand Doctors Speaking Out With Science (NZDSOS) came forward to disclose his discovery of the formations of nanoparticles found by scientists using specialized microscopic techniques. None of the experts that have been consulted before had ever seen anything like this, and none of these contaminants have been listed as approved vaccines.\n\nFinally, in a set of slides of blood samples taken from both vaccinated and unvaccinated individuals, Dr. Philippe van Welbergen, Medical Director of Biomedical Clinics, demonstrated that the graphene being injected into people is organizing and growing into larger fibers and structures, and are gaining magnetic properties or an electrical charge. The fibers are showing indications of complex structures with striations.\n\nHe also demonstrated that the shards of graphene are being transmitted from the vaccinated to the unvaccinated, and have destroyed their red blood cells – causing blood clots in the unvaccinated as well.\n\nMore related news about COVID-19 vaccines can be found at Vaccines.news.\n\nWatch the video below to know more about graphene oxide in COVID-19 vaccines.\n\nThis video is from The Prisoner channel on Brighteon.com.", "opengraph": {"title": "Spanish scientists find graphene oxide, nanotechnology in COVID-19 injections", "type": "article", "url": "https://www.ingredients.news/2022-11-08-scientists-find-graphene-oxide-nanotechnology-covid-injections.html", "site_name": "Ingredients News", "description": "Scientists in Spain have found graphene oxide and nanotechnology in Wuhan coronavirus (COVID-19) injections. According to scientists, graphene oxide can be detected in the immune system as if it were a pathogen. Once injected, it has an affinity for the central nervous system, which can potentially cause paralysis, stroke and alteration of the nervous system. They explained that graphene […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2022/11/Biohazard-Needle-Syringe-Vaccine-Poison.jpg"}, "tags": ["Plandemic", "Big Pharma", "gene therapy", "research", "COVID", "nanotechnology", "vaccine injury", "nanoparticles", "toxic ingredients", "vaccines", "graphene oxide", "biotech", "vaccine damage", "discoveries", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/11/02/scientists-covid-vaccines-nanotechnology-graphene/https://expose-news.com/2022/11/02/scientists-covid-vaccines-nanotechnology-graphene/", "http://pharmaceuticalfraud.com", "https://naturalnews.com/2022-02-16-covid-vaccine-vials-definitely-contain-graphene-oxide.html#", "http://Vaccines.news", "https://www.brighteon.com/ce8cb0e3-84b4-4305-9d08-b088811dab09", "https://www.brighteon.com/channels/theprisoner", "https://naturalnews.com/2022-10-28-millions-citizens-illegal-targeted-covid-decree-violation.html", "https://naturalnews.com/2022-10-28-pfizer-admits-covid-vaccine-efficacy-still-unknown.html", "https://naturalnews.com/2022-10-28-expert-vaccinated-responsible-end-western-civilization.html", "https://expose-news.com/2022/11/02/scientists-covid-vaccines-nanotechnology-graphene/", "https://naturalnews.com/2022-02-16-covid-vaccine-vials-definitely-contain-graphene-oxide.html#", "https://www.brighteon.com/ce8cb0e3-84b4-4305-9d08-b088811dab09", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2022-11-08-scientists-find-graphene-oxide-nanotechnology-covid-injections.html&linkname=Spanish%20scientists%20find%20graphene%20oxide%2C%20nanotechnology%20in%20COVID-19%20injections", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}