{"result_id": "170032", "URL": "https://ingredients.news/2023-03-21-top-12-most-inflammatory-foods-medicines-ingredients.html", "timestamp": "2023-04-25 15:39:49 CEST+0200", "meta": {"description": "Inflammation is the root cause of nearly every disease and disorder we know today. Most of these chronic issues are preventable, treatable, and curable with natural remedies, but most Americans have NO CLUE, thanks to the modern medical industrial complex, Big Pharma, Big Media, Google, social media, and mass censorship of this valuable information. Chronic […]", "lang": "en", "keywords": "badfood,badhealth,badmedicine,Dangerous,Dangerous Medicine,Flu shots,Fluoride,food science,food supply,frankenfood,gluten,GMO corn,GMO soy,grocery,health science,inflammation,junk food,oils,stop eating poison,toxic ingredients,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2023-03-21-top-12-most-inflammatory-foods-medicines-ingredients.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "Top 12 most inflammatory foods, medicines and ingredients you should AVOID at all costs", "cleaned_text": "Top 12 most inflammatory foods, medicines and ingredients you should AVOID at all costs\n\nInflammation is the root cause of nearly every disease and disorder we know today. Most of these chronic issues are preventable, treatable, and curable with natural remedies, but most Americans have NO CLUE, thanks to the modern medical industrial complex, Big Pharma, Big Media, Google, social media, and mass censorship of this valuable information.\n\nChronic inflammation is slow, long-term inflammation that lasts for months or years. The effects vary and can cause permanent injury plus affect the body’s ability to repair itself. Rheumatoid arthritis is a perfect example of chronic inflammation. It’s an autoimmune disorder that attacks the joints, causing pain and damage.\n\nObvious symptoms of chronic inflammation include redness, swelling, heat, pain, and loss of function. Long term effects can also include DNA damage and cancer. Most folks who are considered obese suffer from chronic inflammation (CI) daily. Other diseases associated with CI include cardiovascular disease, inflammatory bowel disease, asthma, and mental illnesses (depression).\n\nOver 50% of all deaths worldwide are attributed to chronic inflammatory diseases\n\nGot cancer, cardiovascular disease, dementia, diabetes, or likelihood of a stroke? Odds are you’re suffering from chronic inflammation, which can be reduced in a number of ways that don’t even cost much money. Are you a big “drinker” (alcohol) who also consumes lots of sweets? Maybe you eat lots of bread, drink from the tap, and take prescription medications daily, having no idea these are some of the biggest contributors to CI on the menu.\n\nProblems sleeping? That’s also attributable to CI. Do your ears ring constantly, like you just got back from front row seats at a rock concert? Are you always tired? Got acid reflux? What about your moods – do they jump around, up and down, with depression and anxiety mixed in? It’s probably a byproduct of CI. What to do about it?\n\nMost inflammatory foods, medicines, and ingredients you should avoid at all costs:\n\n#12. Homogenized milk fats — hormones increase cancer risk, bacteria weakens the immune system, missing enzymes cause digestion challenges, antibiotics create pathogen development and cause allergies in sensitive consumers, often contain additives and preservatives that drive inflammation, conventional cows eat GMO feed, and there is heavy use of pesticides on factory farms.\n\nConsider vitamins and supplements that help reduce CI and reduce daily inflammation in general. Consider taking vitamin C, D, and zinc. Omega 3 fatty acids are important too, from fish oil, hemp oil, or MCT oil. Turmeric and garlic also have phenomenal anti-inflammatory effects. Also, be sure to exercise daily, if even for just 15 minutes. Get that heart rate up and burn those calories.\n\nEliminating inflammation is a daily battle, but it’s not that hard to win, once you know the main culprits and what to eliminate from your daily intake. Also remember that your skin and lungs are organs, so watch out for chemicals in personal care products, household cleaning products, cosmetics, candles, and air fresheners. This can also be major contributors to CI, especially if used regularly.\n\nTune your food news frequency to FoodSupply.news and get updates on more toxic foods that cause chronic inflammation and drive nearly all diseases and disorders that you can prevent by avoiding them with clean food and filtered water.", "opengraph": {"title": "Top 12 most inflammatory foods, medicines and ingredients you should AVOID at all costs", "type": "article", "url": "https://www.ingredients.news/2023-03-21-top-12-most-inflammatory-foods-medicines-ingredients.html", "site_name": "Ingredients News", "description": "Inflammation is the root cause of nearly every disease and disorder we know today. Most of these chronic issues are preventable, treatable, and curable with natural remedies, but most Americans have NO CLUE, thanks to the modern medical industrial complex, Big Pharma, Big Media, Google, social media, and mass censorship of this valuable information. Chronic […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2023/03/Gluten-No-Coeliac-Breakfast-Intolerance-Summer-Thanks.jpg"}, "tags": ["food science", "GMO soy", "frankenfood", "grocery", "health science", "Dangerous", "gluten", "inflammation", "oils", "toxic ingredients", "vaccines", "GMO corn", "food supply", "Fluoride", "Flu shots", "stop eating poison"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/suppressed-government-report-finds-fluoride-can-reduce-iq_5129218.html", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://www.healthline.com/health/ways-to-avoid-hydrogenated-oil", "https://naturalnews.com/035130_raw_milk_infographic_pasteurized.html", "http://supplementsreport.com", "http://www.foodsupply.news/2022-07-14-farmers-threatened-by-deep-state-governments-corporations.html", "https://naturalnews.com/035130_raw_milk_infographic_pasteurized.html", "https://www.theepochtimes.com/health/suppressed-government-report-finds-fluoride-can-reduce-iq_5129218.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2023-03-21-top-12-most-inflammatory-foods-medicines-ingredients.html&linkname=Top%2012%20most%20inflammatory%20foods%2C%20medicines%20and%20ingredients%20you%20should%20AVOID%20at%20all%20costs", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}