{"result_id": "170014", "URL": "https://ingredients.news/2023-03-15-warren-buffett-bill-gates-billions-childhood-obesity.html", "timestamp": "2023-04-25 15:39:37 CEST+0200", "meta": {"description": "In 2015, New York Magazine ran a piece entitled, “Is the World’s Richest Man Made Primarily Out of Corn Syrup?” That piece was of course talking about dinosaur billionaire Warren Buffett, who has amassed his billions on the backs of children who are sick and dying from high-fructose corn syrup (HFCS) poisoning. It was a […]", "lang": "en", "keywords": "bill gates,billionaires,childhood obesity,corruption,greed,HFCS,high-fructose corn syrup,investors,money supply,risk,vertically integrated,Wall Street,Warren Buffett", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2023-03-15-warren-buffett-bill-gates-billions-childhood-obesity.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "Warren Buffett and Bill Gates profit billions off childhood obesity epidemic", "cleaned_text": "In 2015, New York Magazine ran a piece entitled, “Is the World’s Richest Man Made Primarily Out of Corn Syrup?” That piece was of course talking about dinosaur billionaire Warren Buffett, who has amassed his billions on the backs of children who are sick and dying from high-fructose corn syrup (HFCS) poisoning.\n\nIt was a lighthearted piece that made light of Buffett’s love for Coca-Cola, potato chips, and other American foods that today are loaded with HFCS. When Buffett enjoyed these foods as a kid in the early 1900s, they were made from healthier ingredients free from GMOs (genetically modified organisms) and HFCS.\n\nTechnically the fifth-richest person in the world as of this writing, Buffett’s wealth comes from his investments in Berkshire Hathaway, the publicly traded multinational conglomerate company at which he has been CEO and chairman since 1970.\n\nBerkshire Hathaway’s entire investment strategy is to identify valuable companies and acquire ever-increasing portions of them. It does so in a vertically integrated way, meaning it acquires large stakes in every stage of production in the HFCS industry, from the farm where GMO corn is grown all the way to the companies that process it into “food.”\n\n“This vertical integration investment strategy means that a substantial portion of Berkshire Hathaway’s profits is linked to the proliferation of corn syrup in the food system,” writes Brenda Baletti, PhD, for The Defender.\n\n“Buffett and his family own farmland where they grow corn. Berkshire Hathaway has a major stake in fossil fuel companies like Occidental Petroleum and Chevron that power industrial agriculture and make chemical inputs for farming.”\n\n“It owns a company that makes grain storage silos for selling corn. It owns the largest railroad in the U.S., which moves grain and processed foods across the country. It also owns a commercial trailer rental company – the other major means of transportation for grains and processed foods.\n\nBillionaires do not become billionaires through honesty and integrity, but through crony capitalism\n\nBuffett has also extracted wealth from genetically engineered (GE) seed and pesticide giant Monsanto, as well as Archer Daniels Midland, which performs the chemical processing that turns corn into HFCS. Then there are major food corporations Coca-Cola and Kraft Heinz that use HFCS in many of their products – Buffett is invested in these companies as well.\n\nArtificial food inflation fueled by the financial corruption of the billionaire class to which Buffett belongs is also doing the guy a whole lot of favors. Kraft Heinz’s quarterly sales rose 10 percent to $7.38 billion in the last quarter of 2022, beating Wall Street’s expectations.\n\nBuffett further maintains close relationships with the organizations that review food safety, which ensures that the “science” is always in favor of his investments. Coca-Cola, for example, is closely tied to the American Academy of Pediatrics (AAP), the Academy of Nutrition and Dietetics (AND), The Obesity Society (TOS), and the American Academy of Family Physicians (AAFP).”\n\nBillionaire eugenicist Bill Gates is another Warren Buffett-type investor who has amassed billions in ill-gotten gain by poisoning children with chemical toxins like HFCS. Gates is actually richer than Buffett, holding a net worth of $133 billion in his Bill & Melinda Gates Foundation. It turns out that Berkshire Hathaway is the Gates Foundation’s largest holding – imagine that.\n\nThe Defender‘s Baletti did an excellent job of further unpacking Buffett and Gates’s vertically integrated ties to the HFCS industry, so be sure to check out her full coverage of the matter to learn more.\n\nThe latest news about the corrupt billionaire class of criminals can be found at Corruption.news.", "opengraph": {"title": "Warren Buffett and Bill Gates profit billions off childhood obesity epidemic", "type": "article", "url": "https://www.ingredients.news/2023-03-15-warren-buffett-bill-gates-billions-childhood-obesity.html", "site_name": "Ingredients News", "description": "In 2015, New York Magazine ran a piece entitled, “Is the World’s Richest Man Made Primarily Out of Corn Syrup?” That piece was of course talking about dinosaur billionaire Warren Buffett, who has amassed his billions on the backs of children who are sick and dying from high-fructose corn syrup (HFCS) poisoning. It was a […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2023/03/Editorial-Use-Warren-Buffet.jpg"}, "tags": ["high-fructose corn syrup", "billionaires", "Warren Buffett", "investors", "childhood obesity", "risk", "vertically integrated", "bill gates", "greed", "Wall Street", "HFCS", "corruption", "money supply"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/bill_gates_warren_buffett_obesity_corn_syrup/", "https://naturalnews.com/051548_Warren_Buffett_obesity_junk_food.html", "https://childrenshealthdefense.org/defender/bill_gates_warren_buffett_obesity_corn_syrup/", "http://corruption.news", "https://childrenshealthdefense.org/defender/bill_gates_warren_buffett_obesity_corn_syrup/", "https://naturalnews.com/051548_Warren_Buffett_obesity_junk_food.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2023-03-15-warren-buffett-bill-gates-billions-childhood-obesity.html&linkname=Warren%20Buffett%20and%20Bill%20Gates%20profit%20billions%20off%20childhood%20obesity%20epidemic", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}