{"result_id": "170006", "URL": "https://ingredients.news/2022-02-01-chemistry-professors-biontech-covid-vaccines-grey-shade.html", "timestamp": "2023-04-25 15:39:32 CEST+0200", "meta": {"description": "A group of four professors out of Europe is petitioning BioNTech for answers as to why the company’s mRNA “vaccines” for the Wuhan coronavirus (Covid-19) contain strange “grey shade” contents inside the vials. Jörg Matysik, Professor of Analytical Chemistry at the University of Leipzig; Gerald Dyker, Professor of Organic Chemistry at the Ruhr University Bochum; […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Pharma,BioNTech,COVID,Dangerous Medicine,Graphene,pandemic,pharmaceutical fraud,real investigations,science deception,science fraud,toxic chemicals,toxic ingredients,Vaccine dangers,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2022-02-01-chemistry-professors-biontech-covid-vaccines-grey-shade.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "Four chemistry professors ask BioNTech why covid “vaccine” vial contents have a “grey shade”", "cleaned_text": "Four chemistry professors ask BioNTech why covid “vaccine” vial contents have a “grey shade”\n\nA group of four professors out of Europe is petitioning BioNTech for answers as to why the company’s mRNA “vaccines” for the Wuhan coronavirus (Covid-19) contain strange “grey shade” contents inside the vials.\n\nJörg Matysik, Professor of Analytical Chemistry at the University of Leipzig; Gerald Dyker, Professor of Organic Chemistry at the Ruhr University Bochum; Andreas Schnepf, Professor of Inorganic Chemistry at the University of Tübingen; and Martin Winkler, Professor Materials and Process Engineering at the Zurich University of Applied Sciences, all want to know why the injection contains a “white to grey-white dispersion” unlike any other vaccine.\n\n“How does this significant colour difference come about; virtually all the substances used are colourless, so white would be expected. Where does the shade of grey come from? Are these impurities?” the professors asked.\n\nSchnepf stated about the “diluted black” color is “hardly created in a process that would be expected.”\n\n“We need to know if it is an impurity,” he added. “If a pill is not white, there is a suspicion that something has gone wrong. We need clarification from BioNTech on this.”\n\nIn their joint letter, Schnepf and his colleagues probed BioNTech even more about how uniform product is ensured, “or rather how can you ensure that the mRNA to be packaged is present in the lipid nanoparticles and to what extent?”\n\n“How do you continue to control the concentration of mRNA active ingredient in each batch, and how do you control the concentration of active ingredient in the lipid nanoparticles relative to that outside the particles?” the letter further reads.\n\nCertain chemical components used in the vaccines “are not approved for human medicine,” reveals package insert\n\nAnother thing the professors are demanding answers about is the label on BioNTech’s injection, which states that the vials contain “components used in the vaccine that are not approved for human medicine.”\n\nJust what, exactly, are these mystery components? They are called ALC-0159 and ALC-0315, and BioNTech says they are “used to form the lipid nanoparticles.”\n\nThe safety data sheet for ALC-0315 clearly reveals that it “irritates both eyes and skin or mucous membranes,” which Schnepf says is a serious problem because what is to say that this chemical will not do the same thing to tissues throughout the body?\n\n“Here we need clarity,” Schnepf said. “Are there any further planned or ongoing studies to determine the toxicological effects of the substances or their biological degradation?”\n\nAnother major concern is, of course, side effects. Some lots of the vaccine appear to be much deadlier than other lots. How and why is this the case?\n\nThese side effects, the professors added to their letter, “are correlated with a small number of batch numbers.”\n\n“How can this circumstance be explained and what distinguishes these batches from the others, and are efforts underway to investigate this important aspect in more detail, especially with regard to quality assurance? Are there or are clinical studies planned to investigate the side effects and their causes as well as to increase the safety of the new Covid vaccines?”\n\nChances are that BioNTech will provide bogus answers to all of these questions, assuming the company responds at all. Big Pharma is notorious for lying and getting away with murder – literally.\n\nLast summer, strange grey matter appeared in vials of covid vaccine from Moderna, prompting the government of Japan to halt all further administration of the drug.\n\nThe grey vials were magnetic, a Japanese ministry official announced, suggesting that “it could be metal.” To this day, it is still unknown the true contents of these injections.\n\nMore related news about Wuhan coronavirus (Covid-19) injections can be found at ChemicalViolence.com.", "opengraph": {"title": "Four chemistry professors ask BioNTech why covid “vaccine” vial contents have a “grey shade”", "type": "article", "url": "https://www.ingredients.news/2022-02-01-chemistry-professors-biontech-covid-vaccines-grey-shade.html", "site_name": "Ingredients News", "description": "A group of four professors out of Europe is petitioning BioNTech for answers as to why the company’s mRNA “vaccines” for the Wuhan coronavirus (Covid-19) contain strange “grey shade” contents inside the vials. Jörg Matysik, Professor of Analytical Chemistry at the University of Leipzig; Gerald Dyker, Professor of Organic Chemistry at the Ruhr University Bochum; […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2022/02/Coronavirus-Covid-19-Vaccine-Vials-Close-Up.jpg"}, "tags": ["pandemic", "BioNTech", "Big Pharma", "real investigations", "science deception", "COVID", "science fraud", "toxic ingredients", "vaccines", "toxic chemicals", "Vaccine dangers", "Graphene", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://freewestmedia.com/2022/01/27/four-chemistry-professors-question-the-grey-shade-in-vaccines/", "https://www.uni-leipzig.de/en", "https://www.ruhr-uni-bochum.de/en", "https://uni-tuebingen.de/en/", "https://www.zhaw.ch/en/university/", "https://naturalnews.com/2021-12-04-foia-documents-fda-pfizer-covid-vaccines-deaths.html", "https://naturalnews.com/2021-08-29-graphene-oxide-japanese-suspend-moderna-covid-vaccines.html", "http://chemicalviolence.com", "https://freewestmedia.com/2022/01/27/four-chemistry-professors-question-the-grey-shade-in-vaccines/", "https://naturalnews.com/2021-12-04-foia-documents-fda-pfizer-covid-vaccines-deaths.html", "https://naturalnews.com/2021-08-29-graphene-oxide-japanese-suspend-moderna-covid-vaccines.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2022-02-01-chemistry-professors-biontech-covid-vaccines-grey-shade.html&linkname=Four%20chemistry%20professors%20ask%20BioNTech%20why%20covid%20%E2%80%9Cvaccine%E2%80%9D%20vial%20contents%20have%20a%20%E2%80%9Cgrey%20shade%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}