{"result_id": "170027", "URL": "https://www.ingredients.news/2023-03-17-research-dry-cleaning-chemical-linked-parkinsons-disease.html", "timestamp": "2023-04-25 15:39:46 CEST+0200", "meta": {"description": "A study has revealed that a common chemical used to dry clean clothes may be linked to increasing cases of Parkinson’s disease, the world’s fastest-growing brain disorder. The study was published in the Journal of Parkinson’s Disease and was conducted by a group of scientists from Alabama, California, New York and the Netherlands. The research builds upon decades of research that linked long-term exposure […]", "lang": "en", "keywords": "badhealth,badpollution,badscience,big government,brain damaged,brain function,brain health,dementia,discoveries,dry cleaning,ecology,environment,industrial solvents,military bases,national security,Parkinson's Disease,poison,research,solvents,toxic chemicals,toxic ingredients,toxins,trichloroethylene", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.ingredients.news/2023-03-17-research-dry-cleaning-chemical-linked-parkinsons-disease.html", "encoding": "UTF-8"}, "image": null, "domain": "www.ingredients.news", "title": "Research suggests common dry cleaning chemical is linked to Parkinson’s disease", "cleaned_text": "A study has revealed that a common chemical used to dry clean clothes may be linked to increasing cases of Parkinson’s disease, the world’s fastest-growing brain disorder.\n\nThe study was published in the Journal of Parkinson’s Disease and was conducted by a group of scientists from Alabama, California, New York and the Netherlands.\n\nThe research builds upon decades of research that linked long-term exposure to TCE to Parkinson’s, a progressive disease that causes nerve cells or neurons in the basal ganglia to become damaged or die. This then reduces levels of dopamine, a brain chemical that has a crucial role in controlling body movement.\n\nTrichloroethylene (TCE) is a “volatile, colorless liquid organic chemical.” It doesn’t occur naturally and is created by chemical synthesis.\n\nFor the past 100 years, trichloroethylene (TCE) has been used to degrease metal. TCE is also used to dry clean clothes.\n\nDespite being banned by the food and pharmaceutical industries since the 1970s, TCE is still being used in many states in household products. Some products that contain the chemical include:\n\nYou may be exposed to TCE by inhaling it in the air, drinking contaminated water, or eating foods that have been in contact with contaminated water.\n\nThe chemical was used extensively by the U.S. military to degrease equipment. Data has shown that contaminated soil and groundwater can be found near many current and former military bases in the country.\n\nUpon examining existing research, researchers who conducted the study reported that TCE may be linked to Parkinson’s.\n\nTCE is a threat to workers and the public, warns experts\n\nDr. Ray Dorsey, the study’s lead author from the University of Rochester in New York, warned that TCE has threatened workers, polluted the air and contaminated drinking water for over a century.\n\nHe added that global use is “waxing, not waning.”\n\nAccording to a 2013 global study, TCE increased the risk of Parkinson’s sixfold.\n\nThe research team warned that the toxic chemical may be fueling increasing numbers of cases of Parkinson’s disease worldwide.\n\nAccording to data, at least one million people in the U.S. currently have Parkinson’s. Doctors diagnose 60,000 Americans with the condition annually.\n\nCelebrities like Brian Grant, who played for 12 years in the NBA, developed Parkinson’s when he was 36.\n\nExperts think Grant was likely exposed to TCE when he was three since his father, who was a Marine at the time, was stationed at Camp Lejeune. TCE contaminates the U.S. military base.\n\nAmy Lindberg was also exposed there while serving as a young Navy captain. She was diagnosed with Parkinson’s 30 years later.\n\nThe study also discussed other people whose exposure was due to living close to a contaminated site or working with TCE.\n\nThe list included Johnny Isakson, the late U.S. senator who stepped down from office after his Parkinson’s diagnosis in 2015. Fifty years earlier, Isakson served in the Georgia Air National Guard, which is known to use TCE to degrease airplanes.\n\nThe U.S. alone is home to thousands of TCE-contaminated sites. Cleaning and containment must be accelerated, warned the scientists.\n\nThe research team also called for more research to learn more about how TCE contributes to Parkinson’s and other diseases. (Related: Study: Consuming apples, oranges and strawberries can help people with Parkinson’s disease live longer.)\n\nThey added that TCE levels in groundwater, drinking water, soil and outdoor and indoor air must be monitored closely and that this information must be shared with those who live and work near polluted sites. The researchers also lobbied for finally ending the use of these chemicals.\n\nMinnesota and New York are the only two states that have banned TCE. However, despite 2022 findings by the Environment Protection Agency (EPA) that the chemical is “an unreasonable risk to human health,” the federal government has yet to ban its use.\n\nData from earlier studies suggest a lag time of up to 40 years between TCE exposure and the onset of Parkinson’s. Experts say this provides a “critical window of opportunity.”\n\nAcross the globe, at least six million people have Parkinson’s, including 145,000 in the United Kingdom. Other celebrities with the health condition include Sir Billy Connolly, Neil Diamond and Michael J. Fox.\n\nParkinson’s is the fastest-growing neurological disease in the world. Rates of deaths and disabilities due to the disease outpaces other conditions.\n\nPeople with Parkinson’s often experience rigid muscles that cause them to freeze. The condition also causes side effects like balance problems, tremors and slowed movements.\n\nThe exact causes of Parkinson’s disease are unknown, and there is no known cure for this progressive disease.\n\nFortunately, there are ways to help prevent its onset and slow the progression of the disease.\n\nThe prevalence of Parkinson’s disease is about 0.3 percent of the population over 40. The disease affects 94 out of every 100,000 people.\n\nSeveral factors also raise the risk of developing Parkinson’s:\n\nOlder age is a major risk factor for Parkinson’s. The disease is very rare for those younger than 50, but the chances of developing the condition get progressively higher if you’re 60 or much older.\n\nAccording to data, men are 1.4 times more likely to have the condition than women.\n\nThe exact reason is still being researched, but some experts think that estrogen, the female sex hormone, may be a protective factor.\n\nConstant exposure to certain environmental contaminants like TCE and various substances may put you at a higher risk of developing the disease.\n\nA history of certain medical conditions earlier in life has also been associated with the development of Parkinson’s disease.\n\nThere is also a significant genetic component to Parkinson’s. Some types of Parkinson’s are directly inherited and can be passed from a parent to their offspring.\n\nParkinson’s disease is hard to treat and there is no cure for the condition once you have been diagnosed.\n\nTimely diagnosis is crucial for managing Parkinson’s, and several tests can help with this. If you think you or someone you know may have Parkinson’s try neurological tests or genetic tests to identify the condition.\n\nYou can also slow its progression by making positive lifestyle and dietary changes. Exercise regularly, especially if you are middle-aged or elderly.\n\nFollow a balanced diet and try a healthy eating plan like the Mediterranean diet to boost your brain health and overall well-being.\n\nWatch the video below to find out how seaweed can help prevent Parkinson’s disease.\n\nThis video is from the Natural News channel on Brighteon.com.", "opengraph": {"title": "Research suggests common dry cleaning chemical is linked to Parkinson’s disease", "type": "article", "url": "https://www.ingredients.news/2023-03-17-research-dry-cleaning-chemical-linked-parkinsons-disease.html", "site_name": "Ingredients News", "description": "A study has revealed that a common chemical used to dry clean clothes may be linked to increasing cases of Parkinson’s disease, the world’s fastest-growing brain disorder. The study was published in the Journal of Parkinson’s Disease and was conducted by a group of scientists from Alabama, California, New York and the Netherlands. The research builds upon decades of research that linked long-term exposure […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2023/03/Brain-Puzzle-Mind.jpg"}, "tags": ["big government", "industrial solvents", "national security", "trichloroethylene", "toxins", "Parkinson's Disease", "dementia", "poison", "brain function", "solvents", "brain health", "environment", "toxic chemicals", "discoveries", "toxic ingredients", "dry cleaning", "research", "brain damaged", "military bases", "ecology"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-11858023/Common-dry-cleaning-chemical-fueling-rise-PARKINSONS-disease-cases-study-warns.html", "https://www.cancer.gov/about-cancer/causes-prevention/risk/substances/trichloroethylene", "http://pollution.news", "https://www.rochester.edu/", "https://www.naturalpedia.com/water-sources-health-risks.html", "https://naturalnews.com/2022-07-06-apples-oranges-strawberries-parkinsons-patients-live-longer.html", "http://chemicals.news", "https://www.naturalpedia.com/parkinsons-disease-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.health.com/parkinsons-disease-prevention-7151694", "https://www.naturalpedia.com/pesticides-toxicity-side-effects-diseases-and-environmental-impacts.html", "https://www.naturalpedia.com/diabetes-mellitus-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.naturalpedia.com/cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://brain.news/", "https://www.brighteon.com/00000000-0000-0000-0005-817279166001", "https://www.brighteon.com/channels/naturalnews", "https://naturalnews.com/2022-02-02-oral-antibiotics-increase-parkinsons-disease-risk.html", "https://naturalnews.com/2022-03-10-lawsuits-linking-syngenta-weed-killer-to-parkinsons-proceed.html", "https://naturalnews.com/2021-11-29-chinese-herbal-formula-protects-against-parkinsons-disease.html", "https://www.dailymail.co.uk/health/article-11858023/Common-dry-cleaning-chemical-fueling-rise-PARKINSONS-disease-cases-study-warns.html", "https://www.cancer.gov/about-cancer/causes-prevention/risk/substances/trichloroethylene", "https://www.health.com/parkinsons-disease-prevention-7151694", "https://www.brighteon.com/00000000-0000-0000-0005-817279166001", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2023-03-17-research-dry-cleaning-chemical-linked-parkinsons-disease.html&linkname=Research%20suggests%20common%20dry%20cleaning%20chemical%20is%20linked%20to%20Parkinson%E2%80%99s%20disease", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}