{"result_id": "170013", "URL": "https://ingredients.news/2021-07-20-la-quinta-columna-vaccination-vial-graphene-oxide.html", "timestamp": "2023-04-25 15:39:36 CEST+0200", "meta": {"description": "El Gato al Agua, the Spanish national political and current affairs talk show hosted by José Javier Esparza, has given space in its program to the biostatistician and founder of La Quinta Columna to comment on the official interim report of the analysis of the first vaccination vial obtained. According to Delgado, La Quinta Columna has obtained a dozen more […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,COVID-19 vaccine,discoveries,graphene oxide,harmful medicine,immunization,La Quinta Columna,magnetism,pandemic,pharmaceutical fraud,toxic ingredients,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2021-07-20-la-quinta-columna-vaccination-vial-graphene-oxide.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "La Quinta Columna: ‘98% to 99% of the vaccination vial is graphene oxide’", "cleaned_text": "El Gato al Agua, the Spanish national political and current affairs talk show hosted by José Javier Esparza, has given space in its program to the biostatistician and founder of La Quinta Columna to comment on the official interim report of the analysis of the first vaccination vial obtained. According to Delgado, La Quinta Columna has obtained a dozen more from different laboratories and will continue to analyze them together with the University of Almeria without rest.\n\nThroughout the program it has blown everyone’s mind that between 98% and 99% of the content of the vaccination vials corresponds to graphene oxide. As they have been saying, this is not a vaccine but a dose of pure graphene oxide into the vein.\n\nOrwell City has summarized, transcribed, translated, edited and subtitled the video in English for its readers.\n\nJosé Javier Esparza: Ricardo Delgado, good evening. Good evening. A pleasure to have you here in El Gato al Agua, although you know that we are both going to be in trouble later. But anyway, it’s a pleasure.\n\nRicardo Delgado: The pleasure is mine. First of all, I’d like to thank this television station and the program for the opportunity to present the preliminary results of the study.\n\nI think it’s vital due to the situation we are in, where practically everybody questions, as I say, the vaccination vials’ background. Today, it’s difficult to even think about the possibility that the official media is telling the truth. So, first of all, as I say, thank you.\n\nWhat we’ve done is the research that anyone should do. Somehow I always give the same example, but if we ask what ingredients or about them, we always ask what ingredients can be in a hamburger. Then, how can we not know for sure what’s the real composition of the vaccine when its content goes directly into the vein, right? And also, several times, several doses, probably up to a third and a fourth a year.\n\nAll this began… As Dr. José Luis Sevillano said back then: “When they start vaccinating, we’re really going to know what they might be injecting.” Then, as I say, all this began when we saw the phenomenon of the magnetic anomaly, a phenomenon that for a long time was denied, but today has been already proved. There are millions of videos of people going around the world.\n\nA phenomenon that for a long time was denied, but today has been already proved. There are millions of videos of people going around the world. Videos about this phenomenon of, let’s call it ‘pseudo-magnetism acquired after inoculation’, but it can also be acquired through other ways. So, once we conducted that basic epidemiological study, we started to wonder what materials or nanomaterials can cause magnetism in the body. And not only magnetism, but that could act as energy capacitors, because I have also measured in a multimeter an important charge…\n\nJosé Javier Esparza: A moment, Ricardo. Excuse me for a moment. If anyone has remained on the sidelines because they have been on Mars during these last months, we are talking about that phenomenon that has filled the Internet, of people who get vaccinated and who don’t get vaccinated who take little magnet they have in the refrigerator and it sticks to them. And there are people who even get spoons stuck to them. When, as Kalcker explained, spoons shouldn’t get stuck because we’re talking about stainless steel and it does not have magnetism. But it is true that they do stick and we have all seen it. So then, people has been inoculated with something we don’t know what it is, and asking about it it’s forbidden.\n\nRicardo Delgado: Indeed, and not only metal objects. This is a phenomenon of electromagnetic induction in the metal that adheres near the inoculation area. In addition, we have found that the magnetism then moves towards the head. And this is very important. Surely for the purpose they may seek. In addition, a potential difference is measured with a multimeter: the person becomes a superconductor. That is, it emits and receives signals. And when we found the materials that can cause this type of alterations in the body, we began to talk about graphene. We suspected it was graphene oxide since it had all the characteristics that magnetized people expressed after inoculation.\n\nJosé Javier Esparza: Why is graphene bad? Because every day we eat, drink…, in short, or inject (those who inject), we introduce into our bodies a lot of things that nothing but crap. Why particularly graphene could be alarming?\n\nRicardo Delgado: Graphene is toxic, it is a chemical, a toxic chemical agent. Introduced in the organism in large quantities, it causes thrombi. It causes blood clots. We have all the scientific articles to back it up. It causes post inflammatory syndrome, it causes alteration of the immune system. And when the redox balance is broken, in the sense that there is less of the body’s own reserve glutathione than an introduced toxicant such as graphene oxide, it generates a collapse of the immune system and a cytokine storm. In other words, something very similar to the fashionable disease, isn’t it?\n\nJosé Javier Esparza: The entire COVID disease. And then you, who already suspected what all this was about, got a vial of vaccination and took it to the Public University of Almeria.\n\nRicardo Delgado: Indeed, all possible through Rafa Navarro (cop225), the policeman managed to obtain a vial. We met at the time, and we had it delivered. I requested a service provision that you have here. The invoice to the University of Almeria is to analyze the content.\n\nJosé Javier Esparza: I think we have the image of the one we have also received. The letterhead of the Public University of Almeria. It’s in the report, in fact. And I would like to emphasize that this is an objective scientific report from the Public University of Almeria. That is to say, we are not talking here about something minor, we are talking about a real clinical analysis. Excuse me, Ricardo. Proceed.\n\nRicardo Delgado: Indeed. A university professor, with a PhD in Chemical Sciences and a degree in Biology, took charge of the research. Today there are already more people collaborating with him, and he published a preliminary report with quite strong conclusions since there was solid evidence of the presence of graphene derivatives in the sample.\n\nToday we even know more and soon we will publish complementary studies that will make this preliminary report more solid. But it’s very important: from this point on we must not to stop, because remember that the marketing of face masks was stopped precisely because they carried graphene particles, both a run of 500 thousand in Madrid, in La Rioja, in Castilla-La Mancha, etc., in a large part of the world and in Canada. You all know that masks with nanotechnology, such as those of Decathlon, and with the graphene symbol, are still being marketed. So, what we have to ask ourselves is: if the masks were removed because they caused or could cause pulmonary affections by introducing the graphene toxicant, how is it possible for it to be introduced into the vial? Moreover, in a considerable amount.\n\nWhat we have found there, according to what the university that has done this study says, is that the main component is precisely graphene oxide and in a very small amount of something else, but above all it is graphene oxide. And given that all the people who are inoculated with the Pfizer vaccine, which was the one we sent for analysis, as well as Moderna, AstraZeneca, Johnson&Johnson, Janssen, Sinovac, and all types of vaccines acquire magnetic properties, we suspect with many indications that they all contain more or less doses of graphene, of graphene oxide.\n\nJosé Javier Esparza: Ricardo, Pedro Ferré Barbadillo and Carlos Esteban ask you something. Pedro.\n\nPedro Ferré: Good evening. I wanted to ask you about this phenomenon of the magnets, of magnetism, does it pass with time or do the people who detect it, who feel it, continue to maintain it even though months have passed?\n\nRicardo Delgado: It seems that the body has a certain capacity to naturally eliminate graphene oxide through certain immunological mechanisms. Once inside the body it acts as if it were a biological agent as such, as if it were precisely SARS-CoV-2. precursor of glutathione. So that is why, we probably suspect, they are trying to introduce a second and a third dose. Now intranasally. They are already talking about new intranasal vaccines with graphene oxide nanoparticles. Both for influenza and COVID-19, because in aerosols it is much more potent. We’ve also seen scientific studies from February to September 2020 of a treatment for COVID-19 with N-Acetylcysteine, which is a precursor of glutathione. And on the one hand we know that precisely N-acetylcysteine or glutathione itself degrades graphene oxide. That is why we think that we probably hit directly on the causative or etiological agent of the disease.\n\nCarlos Esteban: Hello, good evening. I am going to play devil’s advocate.\n\nCarlos Esteban: The University of Almeria examines this and determines that graphene is present in the vial that you have sent. And this vial, how do we know that it is indeed that of the vaccine? How has the process of how it has been extracted been recorded? Or do we simply have to believe it?\n\nRicardo Delgado: If they play devil’s advocate, they will probably to try to appeal to is what is called ‘traceability’ and ‘custody’. The custody of the vial was done by a policeman, Rafa Navarro, and I simply sent it to the university. Then, the person who has made this study collects it. The university says: “Traceability origin: Unknown”; “State of conservation: refrigerated”; “Maintenance during the study: refrigerated”; and “Coding of the sample problem RD1” (Ricardo Delgado 1), which is me, of course.\n\nIt’s convenient to note that the vial was sealed, okay? Sealed vial with rubber and intact aluminum cap of 2ml capacity containing a cloudy aqueous suspension of 0.45ml. “RNA extraction and quantification is performed, and the presence of uncharacterized nanometric microbiological visible even under the optical microscope.” Those are the first conclusions. Here and in this sense, as you ask me, well, obviously I am not going to put anything in the sample. What we are doing today is getting more samples. In fact, we have obtained a dozen more and they are going to be added to make the sample more representative.\n\nJosé Javier Esparza: OK. Got it. José Antonio Fuster?\n\nJosé Antonio Fuster: My question is, how does it make you feel when you see all these verifiers out there? Infernal on the Internet, Newtral and all the others? Well, they say that this is a hoax. Just like that. False. Absolutely false. Everywhere it has come out: “This is a hoax.”\n\nRicardo Delgado: Well, it affected me directly. Those verification agencies that many of us already know the content they have and the final purpose they have, because I experienced it in very direct family members. In my mother and my father. In fact, that’s how I realized that they had really been vaccinated. They had deceived me for some time and finally admitted it. And we’re not just talking about spoons and metal objects or neodymium or ferrite magnets. We are talking about measurements with electromagnetic field measuring devices, magnetometers, teslasmeters, EMF pencils, etc. In other words, we cannot use the excuse of grease, as has been said, nor that of sweat or any other nonsense, because there is no other word for it.\n\nJosé Antonio Fuster: Got it. One more question. Ricardo, what else is in the vaccine?\n\nRicardo Delgado: There is a small trace of RNA that does not correspond to, let’s say, the main component. 98% to 99% of the vial is precisely graphene oxide, that is, the main component of the vaccine is graphene oxide . So this is what is worrying, because we even suspect that AstraZenca probably carried more doses than those that have been administered lately and that is why it generated more thrombi initially.\n\nWe have to remember that graphene oxide, like any material has what is called an electronic absorption band. This is a specific frequency above which it is excited and oxidizes very quickly. In other words, with a radio frequency telephone signal, it can oscillate very quickly and cause havoc in just four or five hours, as happened in March and April 2020.\n\nJosé Javier Esparza: We certainly remember it. Well, Ricardo, thank you very much. Well, Ricardo, thank you very much. I hope it solved the Internet problem you had with all the companies, which is mind-boggling. Anyway, we’re wordless. and also with Dr. Sevillano, right? We have not been able to talk to him today to continue talking about this, because we simply have to talk about it. That is to say, one can obviously discuss, debate, disagree on the conclusions that can be drawn, on the extrapolations, but what are concrete facts are objective facts that have to be put on the table.\n\nRicardo Delgado: Yes, of course. And to say goodbye, I would like to appeal, first of all, to the health authorities who have not yet responded to the magnetic phenomenon. We have been demanding an explanation for 45 days. We don’t need it from Risto Mejide or the fact checkers. They should be given directly by the health authorities. And that people go to their doctor to denounce the phenomenon: that it be registered in their medical record. Of course we are going to sue in court just with the preliminary report so that, at the very least, applying the precautionary principle, the inoculation campaign is stopped immediately and urgently.\n\nJosé Javier Esparza: Ricardo Delgado, thank you very much for being here tonight on El Gato al Agua.\n\nRicardo Delgado: Thanks to you. Best regards.", "opengraph": {"title": "La Quinta Columna: ‘98% to 99% of the vaccination vial is graphene oxide’", "type": "article", "url": "https://www.ingredients.news/2021-07-20-la-quinta-columna-vaccination-vial-graphene-oxide.html", "site_name": "Ingredients News", "description": "El Gato al Agua, the Spanish national political and current affairs talk show hosted by José Javier Esparza, has given space in its program to the biostatistician and founder of La Quinta Columna to comment on the official interim report of the analysis of the first vaccination vial obtained. According to Delgado, La Quinta Columna has obtained a dozen more […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2021/07/Covid-19-Vaccine-Vial-Close-Up.jpg"}, "tags": ["pandemic", "immunization", "Big Pharma", "COVID-19 vaccine", "La Quinta Columna", "harmful medicine", "vaccine", "magnetism", "toxic ingredients", "graphene oxide", "discoveries", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["http://t.me/cop225", "https://es.linkedin.com/in/prof-dr-pablo-campra-madrid-9350b458", "https://www.orwell.city/2021/06/la-quinta-columna-graphene-5G.html"], "authors": [], "publish_date": null}