{"result_id": "170035", "URL": "https://ingredients.news/2023-03-10-covid-vaccinated-shedding-transmitting-graphene-to-unvaccinated.html", "timestamp": "2023-04-25 15:39:52 CEST+0200", "meta": {"description": "Even the unvaccinated are not safe from the dangers of the Wuhan coronavirus (COVID-19) vaccines. According to a doctor, COVID-19-vaccinated people are shedding graphene and transmitting it to the unvaccinated. He warned that this is a cause for concern because graphene has been linked to blood clots. Biomedical Clinics Medical Director Dr. Philippe van Welbergen was […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Pharma,biological weapon,covid-19,Dangerous Medicine,discoveries,graphene fibers,pandemic,pharmaceutical fraud,real investigations,spike protein,toxic ingredients,vaccine damage,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2023-03-10-covid-vaccinated-shedding-transmitting-graphene-to-unvaccinated.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "People injected with COVID-19 vaccines are shedding and transmitting GRAPHENE to the unvaccinated, warns doctor", "cleaned_text": "People injected with COVID-19 vaccines are shedding and transmitting GRAPHENE to the unvaccinated, warns doctor\n\nEven the unvaccinated are not safe from the dangers of the Wuhan coronavirus (COVID-19) vaccines.\n\nAccording to a doctor, COVID-19-vaccinated people are shedding graphene and transmitting it to the unvaccinated. He warned that this is a cause for concern because graphene has been linked to blood clots.\n\nBiomedical Clinics Medical Director Dr. Philippe van Welbergen was one of the first to warn people about the damage COVID-19 vaccines are causing to people’s blood. In 2022, he released images of blood samples under the microscope.\n\nIn a July 2021 interview on Loving Life TV, a South African community channel, van Welbergen shared that he took blood samples from his patients when they started complaining about alarming symptoms such as chronic fatigue, dizziness, memory issues and sometimes paralysis and late onset of heavy menstruation among women 60 and older.\n\nTesting revealed that the blood from van Welbergen’s patients had unusual tube-like structures and some particles which lit up. Their blood also had many damaged cells, with only a few healthy cells visible.\n\nData has confirmed that the tube-like structures are graphene, which can cause unique interactions with blood proteins and biological membranes and can lead to severe effects like thrombogenicity and immune cell activation.\n\nFollowing his shocking discovery, van Welbergen became a regular guest on Loving Life TV. In his appearances, the doctor revealed details about the experimental COVID-19 vaccine rollout. He also gave updates on how the vaccines damaged the blood of the vaccinated over time. The doctor also talked about the pandemic situation in both the U.K. and South Africa.\n\nOn Feb. 12, 2022, van Welbergen returned as a guest on Loving Life TV and he released images of his latest slides of blood samples. The live stream was lengthy and the channel released it in two parts. (Related: Researcher sounds alarm after finding PARASITES, nanobots and graphene in COVID-19 vaccines.)\n\nIn the first part, van Welbergen answered questions from the audience. In the second part, he presented and explained the images of the latest blood slides.\n\nThe slides revealed that the unvaccinated patients have been “infected with vaccine toxins through shedding.”\n\nIn one image, van Welbergen showed typical healthy red blood cells as seen with a microscope. The image showed what blood should look like, with no coagulation or foreign objects in it.\n\nThe next image was from someone injected with the experimental COVID-19 vaccine. The blood was coagulated and the misshapen red blood cells were clumped together.\n\nIn one slide, van Welbergen encircled a healthy red blood cell sitting alongside the graphene fibers. One slide also showed the size of the graphene fibers in relation to the size of a red blood cell. Some fibers were large enough to block capillaries.\n\nOther slides also showed that the graphene fibers are hollow and contain red blood cells.\n\nSeveral weeks before the channel released the video, van Welbergen started noticing a magnetic or electrical polarity effect on different sides of the graphene fibers.\n\nThe doctor explained that this behavior hasn’t been observed before, but is now being seen in almost every sample following the COVID-19 vaccine rollout. He warned that this unusual behavior suggests how “these things have changed, their reaction with surrounding blood cells has changed.”\n\nVan Welbergen also talked about an image of a blood sample from an unvaccinated three-year-old child. He highlighted pieces or “shards” of graphene that formed due to “shedding,” meaning the graphene has been transmitted from vaccinated parents to their unvaccinated child.\n\nAnother image showed a blood sample from an eight-year-old unvaccinated child whose blood has been contaminated and destroyed by the transmission of graphene from vaccinated people around them. The doctor also presented an image of the child’s paralyzed right arm and upper right leg.\n\nVan Welbergen’s presentation underscores the need to stop injecting people with COVID-19 vaccines.\n\nVisit Vaccines.news to learn more about COVID-19 vaccines and their many side effects.\n\nWatch the video below to know more about graphene in COVID-19 vaccines.\n\nThis video is from The TIME WE HAVE LEFT channel on Brighteon.com.", "opengraph": {"title": "People injected with COVID-19 vaccines are shedding and transmitting GRAPHENE to the unvaccinated, warns doctor", "type": "article", "url": "https://www.ingredients.news/2023-03-10-covid-vaccinated-shedding-transmitting-graphene-to-unvaccinated.html", "site_name": "Ingredients News", "description": "Even the unvaccinated are not safe from the dangers of the Wuhan coronavirus (COVID-19) vaccines. According to a doctor, COVID-19-vaccinated people are shedding graphene and transmitting it to the unvaccinated. He warned that this is a cause for concern because graphene has been linked to blood clots. Biomedical Clinics Medical Director Dr. Philippe van Welbergen was […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2023/03/Covid-19-Vaccine-Vial-Close-Up.jpg"}, "tags": ["pandemic", "covid-19", "vaccine wars", "Big Pharma", "real investigations", "vaccine injury", "toxic ingredients", "vaccines", "graphene fibers", "spike protein", "vaccine damage", "discoveries", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/03/08/doctors-find-graphene-is-shedding-from-the-covid-vaccinated-to-the-unvaccinated-forming-blood-clots-decimating-blood-cells/", "http://vaccinedamage.news", "https://expose-news.com/2021/08/31/german-doctors-and-lawyers-assess-blood-smears-from-people-who-have-had-covid-injections-for-me-this-is-euthanasia-for-me-this-is-mass-murder-a-crime-on-a-grand-scale/", "https://naturalnews.com/2022-02-22-researcher-finds-parasites-nanobots-graphene-covid-vaccines.html", "https://lovinglifetv.com/dr-philippe-part-two-the-blood-slides-12-february-2022/", "https://vaccines.news/", "https://www.brighteon.com/568232c2-a281-4147-8021-ae9f5cb2db2e", "https://www.brighteon.com/channels/motherlode11", "https://naturalnews.com/2022-11-08-scientists-find-graphene-oxide-nanotechnology-covid-injections.html", "https://naturalnews.com/2022-02-16-covid-vaccine-vials-definitely-contain-graphene-oxide.html", "https://naturalnews.com/2022-11-11-physician-analyzes-covid-jabs-graphene-oxide-nanocircuits.html", "https://expose-news.com/2023/03/08/doctors-find-graphene-is-shedding-from-the-covid-vaccinated-to-the-unvaccinated-forming-blood-clots-decimating-blood-cells/", "https://expose-news.com/2021/08/31/german-doctors-and-lawyers-assess-blood-smears-from-people-who-have-had-covid-injections-for-me-this-is-euthanasia-for-me-this-is-mass-murder-a-crime-on-a-grand-scale/", "https://lovinglifetv.com/dr-philippe-part-two-the-blood-slides-12-february-2022/", "https://www.brighteon.com/568232c2-a281-4147-8021-ae9f5cb2db2e", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2023-03-10-covid-vaccinated-shedding-transmitting-graphene-to-unvaccinated.html&linkname=People%20injected%20with%20COVID-19%20vaccines%20are%20shedding%20and%20transmitting%20GRAPHENE%20to%20the%20unvaccinated%2C%20warns%20doctor", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}