{"result_id": "170015", "URL": "https://ingredients.news/2021-10-20-dr-chris-knobbe-verifies-processed-oils-at-core-of-nearly-all-disease.html", "timestamp": "2023-04-25 15:39:38 CEST+0200", "meta": {"description": "Have you heard of food oil poisoning? It can wreck entire body systems and exacerbate any and all health issues you already have. It’s not like food poisoning where you get violently sick within 24 hours and vomit repeatedly. It’s a long term health catastrophe, and it’s embedded in the food supply, and that’s why […]", "lang": "en", "keywords": "badhealth,cancer,canola oil,degenerative disease,diabetes,dietary oils,food oil,food science,ingredients,obesity,oils,omega-6 fatty acids,processed oils,Rapeseed oil,seed oil,seed oils,vegetable oil", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2021-10-20-dr-chris-knobbe-verifies-processed-oils-at-core-of-nearly-all-disease.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "GOT FOOD OIL POISONING? Physician, author and researcher Dr. Chris A. Knobbe verifies processed oils are at the core of nearly all disease", "cleaned_text": "GOT FOOD OIL POISONING? Physician, author and researcher Dr. Chris A. Knobbe verifies processed oils are at the core of nearly all disease\n\nHave you heard of food oil poisoning? It can wreck entire body systems and exacerbate any and all health issues you already have. It’s not like food poisoning where you get violently sick within 24 hours and vomit repeatedly. It’s a long term health catastrophe, and it’s embedded in the food supply, and that’s why about 200 million Americans are suffering from chronic disease right now. Which oils and what are the signs? Let the food oil scholar explain it in great detail, then you can remedy your own situation, or pass this valuable knowledge along to your family, friends, relatives, neighbors and coworkers. Dr. Chris Knobbe presented these shocking revelations at the 2021 Ancestral Health Symposium, entitled the “Omega-6 Apocalypse.”\n\nNearly all “Westernized” diseases come down to vegetable oils\n\nYou may have thought gluten, animal fat, and sugar were the human body’s worst enemies when it comes to food that causes long-term health decimation, but vegetable seed oils take the cake. Food oils may be the main culprit, in other words, for obesity, cancers, metabolic syndrome, malnutrition, diabetes, heart disease, strokes and dementia.\n\nDr. Knobbe walks us through 200 years of medical history with his in-depth research, and what we see is that the USA leads the way in weight gain, more than 25 percent above the global average. We continue to replace animal fats with vegetable oils, so it’s not really about the whole “cut your carbs” (carbohydrates) movement that was so popular for so long.\n\nThe entire diabetes epidemic (it should be termed) has been created in this country, mainly, over the past 85 years. Obesity was only a one percent factor a century ago; now every third American is overweight, and half of them are obese (about 30 or more pounds overweight).\n\nIn 1960 obesity affected only 13 percent of the American populace, now it’s 40 percent, and that’s four out of every ten people you see in the stores and restaurants are obese, buying and consuming processed food oils nearly every meal, every day. They’re toxic food addicts, and their health problems only get worse for them every year.\n\nShocker: Processed vegetable oils account for a sickening third of all food consumed by Americans\n\n“Plant oils” have been a marketing scam, the doctor says, to make the oils sound healthy for you, but the health trade off for any nutrition is a whole rack of chronic problems, as he points out. Canola isn’t even a plant, but comes from a toxic, non-edible insecticide known as rapeseed oil. Over 90 percent of processed oils contain GMOs, furthering the health detriment of consumers who now also have pesticides destroying their good gut flora.\n\nThe worst of the vast array of toxic oils are the PUFA (polyunsaturated fatty acid oils), including canola (rapeseed diluted), corn, cottonseed, rice bran, sunflower, safflower, grapeseed, and of course, soybean. As of late, there has been a massive increase of seed oil consumption in the USA.\n\nBottom line: Eliminate the seed oils from your diet and you eliminate multiple health issues you have now, are developing, or would otherwise develop in the not-so-distant future. Currently, 86 percent of added fats in foods are vegetable oils. Let that sink in for a minute (pardon the pun).\n\nPhysician, author and researcher Dr. Chris A. Knobbe explains his evidence-based research right here:\n\n\n\nRemember, canola oil makes you fat and dumb, even if it’s organic. Tune your internet frequency to FoodScience.news and find out more about maintaining your own ideal health, starting in the gut!", "opengraph": {"title": "GOT FOOD OIL POISONING? Physician, author and researcher Dr. Chris A. Knobbe verifies processed oils are at the core of nearly all disease", "type": "article", "url": "https://www.ingredients.news/2021-10-20-dr-chris-knobbe-verifies-processed-oils-at-core-of-nearly-all-disease.html", "site_name": "Ingredients News", "description": "Have you heard of food oil poisoning? It can wreck entire body systems and exacerbate any and all health issues you already have. It’s not like food poisoning where you get violently sick within 24 hours and vomit repeatedly. It’s a long term health catastrophe, and it’s embedded in the food supply, and that’s why […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2021/10/Food-Over-Junk-Gluttony-Fat-Trans-Cholesterol.jpg"}, "tags": ["food science", "canola oil", "diabetes", "cancer", "Rapeseed oil", "omega-6 fatty acids", "dietary oils", "food oil", "degenerative disease", "obesity", "oils", "seed oils", "ingredients", "seed oil", "processed oils", "vegetable oil"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2021-10-15-canola-oil-makes-you-fat-and-dumb.html", "https://www.foodscience.news/2021-10-14-personalized-nutrition-connection-between-genetic-variation-gut-bacteria.html", "https://www.foodscience.news/2021-10-14-personalized-nutrition-connection-between-genetic-variation-gut-bacteria.html", "https://www.naturalnews.com/2021-10-15-canola-oil-makes-you-fat-and-dumb.html", "https://www.brighteon.com/03e98099-e8eb-4c9a-b4de-54b8685d0a6e"], "authors": [], "publish_date": null}