{"result_id": "170002", "URL": "https://www.ingredients.news/2022-02-27-edible-oil-food-prices-post-record-highs.html", "timestamp": "2023-04-25 15:39:29 CEST+0200", "meta": {"description": "The price of soybeans has reached its highest level since 2008, which is the last time a major market crash happened. Record-high food prices could be imminent, experts are now warning after soybean oil futures also topped the charts, along with palm oil, a commodity used in thousands of food products that reached a new […]", "lang": "en", "keywords": "Big Pharma,canola,China Virus,edible oil,food costs,food inflation,food prices,groceries,hyperinflation,Inflation,ingredients,palm oil,Plandemic,record,soybean oil,starvation,supply chain,Ukrainian invasion,vegetable oil", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.ingredients.news/2022-02-27-edible-oil-food-prices-post-record-highs.html", "encoding": "UTF-8"}, "image": null, "domain": "www.ingredients.news", "title": "Edible oil prices soar as global food prices approach record highs", "cleaned_text": "The price of soybeans has reached its highest level since 2008, which is the last time a major market crash happened.\n\nRecord-high food prices could be imminent, experts are now warning after soybean oil futures also topped the charts, along with palm oil, a commodity used in thousands of food products that reached a new record high.\n\n“Soybean prices increased 1.4$ to 71 cents per pound, the highest level since 2008,” reported Zero Hedge. “U.S. canola futures are also on the verge of an all-time high, and palm oil in Malaysia hit a new record high of $1,434 per ton.”\n\nAccording to Bloomberg, the cause of this is “drought,” but that is only part of the story. Somehow these fake news media outlets never want to talk about the elephant in the room which is the Federal Reserve and its more than 100-year reign over the American money supply.\n\nWhile it is true that weather conditions have not necessarily been favorable for large yields in certain commodities, the real problem right now is runaway inflation caused by many decades of fiat money printing. This has created a massive debt bubble that is about to pop.\n\nGlobal banking cartels engineered the current and ongoing destruction of the global economy\n\nThe Wuhan coronavirus (COVID-19) plandemic was also thrown into the mix as a scapegoat. All of the supply chain issues that are preventing items from getting from their origins to their destinations are another convenient cover for why things are falling apart.\n\nThis writer’s perspective is that things were already going to fall apart and someone needed a distraction. In comes the China virus, fresh out of the labs, to create chaos, send a few more billion Big Pharma’s way via the “vaccines,” and now the final dominoes are falling with the lingering supply chain problems.\n\n“We are out of everything, I don’t care if it’s oil, gas, coal, copper, aluminum: you name it and we’re out of it,” said Goldman Sachs’ Jeff Currie earlier in the month, explaining that the markets are “incredibly tight from a physical perspective.”\n\nFrom a paper perspective, the traders keep on trading. But from a physical perspective, well, the emperor has no clothes and it is becoming painfully obvious like perhaps never before in the nation’s history.\n\nAbdul Hameed, director of sales at Manzoor Trading in Lahore, Pakistan, said the edible oils situation is now in “uncharted territory,” and that prices could continue to climb higher and higher with no end in sight.\n\n“The global supply and demand situation is a very, very big concern,” he added.\n\nScarily, Tesco Plc chairman John Allan announced that the “worst has yet to come” as far as food shortages and coupled inflation. Lower-income households throughout the West will be especially impacted by this, though truth be told, everyone will due to the sheer magnitude of what is still to come.\n\n“What are you complaining about? You can still get a safe and effective vaccine for free,” joked one reader at Zero Hedge morbidly. “Things have never been better!!!”\n\n“COVID is over now; this is the new thing,” suggested another about the Ukrainian invasion and how it is shifting the narrative to the next phase.\n\n“How can I worry about food prices and availability when I am trying to figure out if I am a boy or a girl or something else???” joked another about how the current delusional stock of American “woke” mobsters have a very rude awakening in store for them on the horizon. “Priorities folks!!!”\n\nThe latest news about the global economic collapse can be found at Collapse.news.", "opengraph": {"title": "Edible oil prices soar as global food prices approach record highs", "type": "article", "url": "https://www.ingredients.news/2022-02-27-edible-oil-food-prices-post-record-highs.html", "site_name": "Ingredients News", "description": "The price of soybeans has reached its highest level since 2008, which is the last time a major market crash happened. Record-high food prices could be imminent, experts are now warning after soybean oil futures also topped the charts, along with palm oil, a commodity used in thousands of food products that reached a new […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2022/05/Oil-Olive-Golden-Canola-Vegetable.jpg"}, "tags": ["Big Pharma", "starvation", "soybean oil", "vegetable oil", "Ukrainian invasion", "record", "groceries", "Inflation", "palm oil", "edible oil", "China Virus", "food costs", "supply chain", "canola", "food inflation", "ingredients", "hyperinflation", "food prices", "Plandemic"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/commodities/record-high-global-food-prices-could-be-imminent-edible-oil-soars", "https://www.naturalnews.com/2022-02-24-biden-blames-russia-inflation-deflects-fed-corruption.html", "http://collapse.news", "https://www.zerohedge.com/commodities/record-high-global-food-prices-could-be-imminent-edible-oil-soars", "https://www.naturalnews.com/2022-02-24-biden-blames-russia-inflation-deflects-fed-corruption.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2022-02-27-edible-oil-food-prices-post-record-highs.html&linkname=Edible%20oil%20prices%20soar%20as%20global%20food%20prices%20approach%20record%20highs", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}