{"result_id": "170001", "URL": "https://ingredients.news/2021-12-18-good-bad-and-ugly-about-eggs-and-egg-whites.html", "timestamp": "2023-04-25 15:39:28 CEST+0200", "meta": {"description": "Every day Americans eat a combined 200 million eggs, but most consumers would be shocked to find out what the corporate egg industry is hiding. Did you know that hens are genetically manipulated to lay far more eggs each year than they normally might? Instead of laying a dozen (naturally in the wild), they’re laying […]", "lang": "en", "keywords": "Animal abuse,animal cruelty,chicken farms,chickens,egg allergies,egg benefits,egg downsides,egg protein,egg whites,eggs,Factory farms,grocery,ingredients,inhumane", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2021-12-18-good-bad-and-ugly-about-eggs-and-egg-whites.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "The good, the bad and the ugly about factory farm eggs, including egg whites", "cleaned_text": "The good, the bad and the ugly about factory farm eggs, including egg whites\n\nEvery day Americans eat a combined 200 million eggs, but most consumers would be shocked to find out what the corporate egg industry is hiding. Did you know that hens are genetically manipulated to lay far more eggs each year than they normally might? Instead of laying a dozen (naturally in the wild), they’re laying 250 to 300 eggs per year at the abuse-and-slaughter chicken-coop factories.\n\nSo, is the trade off worth it for that protein, fat and 16 calories? What kind of infections, allergies and nutritional deficiencies do these kinds of eggs lead to in the humans who eat them regularly? Let’s take a close look at the good, the bad and the ugly that you might not know about eggs and the animals that lay them.\n\nMany consumers eat just the egg whites to avoid the health downsides of the yolk, including that sticky cholesterol. Now if they’re from chickens/hens that are fed properly, kept humanely, and are allowed to produce eggs at a natural pace, that’s a different story. On the flip side, factory farm egg whites can easily be contaminated with Salmonella, a deadly bacteria that breeds in the intestines of the chickens, especially unhealthy chickens that have horrible digestive issues because they are fed genetically modified, processed feed “meal” they would never eat in the wild.\n\nThe media, for decades, has promoted eggs as nothing but healthy, especially egg whites, but too many egg whites can deplete your water-soluble vitamin B (Biotin), leading to muscle cramps, lack of muscle tone, dermatitis and even hair loss.\n\n“Cage free” and “free range” may not mean what you think\n\nNifty little slogans for selling eggs are used to lure health-minded consumers into a trap. Egg-laying hens mostly live in prison-like conditions, where they’re trapped in coops, cages and factory sheds and barns that are overcrowded, with feces under their feet all day. They may see the sunlight or roam outside for a few minutes, then it’s back to jail, to over-produce eggs in disgusting environments.\n\nThe physiological stress these hens must endure is far from humane, and the egg laying process itself can take more than 24 hours. Talk about stress. These poor animals often suffer from beak and bone deformity, osteoporosis, nutrient deficiencies, fatty liver disease and of course, ovarian cancer. They also suffer from syndromes and conditions like “cage layer fatigue” (where they are too weak to even stand up) as shown in the embedded video.\n\nOnce a hen’s egg production slows considerably, after about one year of this abuse, it’s standard industry practice to “force molt” or shock them into producing more eggs. After six months of that, they’re slaughtered (where naturally they would live the lifespan of a cat or dog, about 10 years).\n\nEggs are in thousands of products you may not even notice\n\nMaybe it’s time to cut back or totally cut out factory farm eggs from your intake, at least for a while to see how much better you feel. Have you checked your pasta, ice cream or children’s candy for eggs? Eggs are used as a binding agent in many beauty products. That must be where the saying “you’ve got egg on your face” came from.\n\nA star actor from Game of Thrones, Jerome Flynn, spoke out about how most chickens at the corporate “farms” are crowded in coops so tight that they can’t nest or even stretch out their wings. Most male chicks are ground up alive or gassed to death.\n\nYou may be surprised to find eggs in your egg substitutes, fancy foamy coffee drinks like cappuccino, candies like lollipops, marshmallows, meatloaf, tartar sauce, hollandaise sauce, soups and even in certain wine (used during processing). Watch this short documentary and learn a lot you may not know about the egg industry. Sometimes the truth hurts.\n\n“What’s Wrong With Eggs? The Truth About The Egg Industry” …\n\nTune your health news dial to FoodScience.news for updates on keeping your body in top working condition with the right nutrients, superfoods and supplements.", "opengraph": {"title": "The good, the bad and the ugly about factory farm eggs, including egg whites", "type": "article", "url": "https://www.ingredients.news/2021-12-18-good-bad-and-ugly-about-eggs-and-egg-whites.html", "site_name": "Ingredients News", "description": "Every day Americans eat a combined 200 million eggs, but most consumers would be shocked to find out what the corporate egg industry is hiding. Did you know that hens are genetically manipulated to lay far more eggs each year than they normally might? Instead of laying a dozen (naturally in the wild), they’re laying […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2021/12/Chickens-Poultry-Farm.jpg"}, "tags": ["egg allergies", "inhumane", "animal cruelty", "Animal abuse", "Factory farms", "grocery", "egg downsides", "egg benefits", "chicken farms", "egg protein", "ingredients", "eggs", "egg whites", "chickens"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/utPkDP3T7R4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/utPkDP3T7R4?feature=oembed"}], "links": ["https://www.onlymyhealth.com/four-side-effects-of-eating-egg-whites-1430913053", "https://www.naturalnews.com/055621_commercial_eggs_factory_farms_industry_practices.html", "https://www.foodscience.news/2021-10-05-vitamin-d-deficiency-linked-to-covid.html", "https://www.onlymyhealth.com/four-side-effects-of-eating-egg-whites-1430913053", "https://www.naturalnews.com/055621_commercial_eggs_factory_farms_industry_practices.html"], "authors": [], "publish_date": null}