{"result_id": "170033", "URL": "https://ingredients.news/2022-10-20-covid-vaccines-crazy-cocktails-contain-toxic-metals.html", "timestamp": "2023-04-25 15:39:51 CEST+0200", "meta": {"description": "Even before the Wuhan coronavirus (COVID-19) pandemic, Big Pharma and the mainstream media have been claiming that vaccines are safe to use and not linked to any negative side effects. But data shows this claim isn’t true, with many reports confirming adverse effects and deaths linked to COVID-19 vaccines. Dr. Mark Trozzi, a practitioner of emergency medicine, […]", "lang": "en", "keywords": "Aluminum,badhealth,badmedicine,badscience,Big Pharma,Censored Science,chemical violence,cobalt,covid-19,Dangerous Medicine,Heavy metals,Mark Trozzi,pharmaceutical fraud,Plandemic,poison,real investigations,research,spike proteins,toxic ingredients,toxins,unexplained,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2022-10-20-covid-vaccines-crazy-cocktails-contain-toxic-metals.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "COVID-19 vaccines are “crazy cocktails” that contain TOXIC METALS, warns Dr. Trozzi", "cleaned_text": "COVID-19 vaccines are “crazy cocktails” that contain TOXIC METALS, warns Dr. Trozzi\n\nEven before the Wuhan coronavirus (COVID-19) pandemic, Big Pharma and the mainstream media have been claiming that vaccines are safe to use and not linked to any negative side effects. But data shows this claim isn’t true, with many reports confirming adverse effects and deaths linked to COVID-19 vaccines.\n\nDr. Mark Trozzi, a practitioner of emergency medicine, revealed in a recent interview that coronavirus vaccines contain traces of toxic metals.\n\nTrozzi discussed the findings of an extensive laboratory analysis done by the international group of scientists of the German Working Group for COVID Vaccine Analysis.\n\nTalking about the undisclosed content of different coronavirus vaccines from different brands, Trozzi said the pandemic and the reaction to it has been unusual because the “crazy cocktails” have never been used on such a large scale.\n\nThe German Working Group for COVID Vaccine Analysis is an international network of over 60 experts, including medical doctors, scientists, mathematicians, lawyers and others who analyze coronavirus vaccines and report their findings to the public.\n\nMembers of the group conducted their research in several laboratories and countries and they studied COVID-19 vaccines from AstraZeneca, Johnson & Johnson, Pfizer and Moderna. The experts also studied the blood of people who have received the vaccines.\n\nThe team of researchers used the following tools:\n\nThe researchers also used artificial intelligence to analyze images.\n\nThe results revealed that vials of Johnson & Johnson, Pfizer and Moderna contained numerous unclaimed elements, including several that do not belong in the human body. (Related: Within mere months, Moderna’s covid “vaccine” efficacy turns into AUTOIMMUNE DISEASE.)\n\nNone of these harmful elements were declared by the manufacturers.\n\nThe scientists also studied blood samples from vaccinated and unvaccinated people. Data showed that those who were vaccinated had 100 percent consistently altered blood with damaged red blood cells that often stuck to each other, even to the extreme of “rouleaux formation.”\n\nThis suggests that there is a greater risk of blood clotting in vaccinated people.\n\nTrozzi also talked about the critical risk of reverse transcription of viral mRNA from the shots into human DNA. This means that human cells can become factories for the spike protein or “for as long as the patient survives.”\n\nHe warned vaccinated people not to take any additional doses of COVID-19 vaccines and to detoxify their bodies from the spike protein.\n\nFollow the tips below to clear viral and vaccine-induced spike proteins from your body:\n• Change your diet to reduce the consumption of pro-inflammatory food items. Consider a low histamine diet and avoid processed foods and GMOs.\n• Try intermittent fasting or implementing meal timing schedules that switch back and forth between periods of voluntary fasting and non-fasting. People who practice intermittent fasting often consume all of their daily calories within six to eight hours each day. This method of dieting can help induce autophagy or a “recycling process” that takes place in human cells, where cells degrade and recycle components. Autophagy is used by your body to eliminate damaged cell proteins and it can destroy harmful viruses and bacteria post-infection.\n• Take multivitamins daily to provide your body with a basic supply of vitamins A, C, D3 and E, iodine, selenium and trace elements.\n• Try heat therapy, which is a good way of detoxing spike protein.\n\nThink twice about getting COVID-19 vaccines, especially if you don’t want to get exposed to toxic metals like aluminum and cobalt.\n\nVisit Chemicalviolence.com to learn more about the adverse effects of COVID-19 vaccines.\n\nWatch the video below for more information on how to prevent spike proteins.\n\nThis video is from The Mercury Channel on Brighteon.com.\n\nScientists discover that all covid vaccines “without exception” contain mysterious metallic toxins.", "opengraph": {"title": "COVID-19 vaccines are “crazy cocktails” that contain TOXIC METALS, warns Dr. Trozzi", "type": "article", "url": "https://www.ingredients.news/2022-10-20-covid-vaccines-crazy-cocktails-contain-toxic-metals.html", "site_name": "Ingredients News", "description": "Even before the Wuhan coronavirus (COVID-19) pandemic, Big Pharma and the mainstream media have been claiming that vaccines are safe to use and not linked to any negative side effects. But data shows this claim isn’t true, with many reports confirming adverse effects and deaths linked to COVID-19 vaccines. Dr. Mark Trozzi, a practitioner of emergency medicine, […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2022/10/Vaccines-Poison.jpg"}, "tags": ["Aluminum", "Mark Trozzi", "cobalt", "covid-19", "Plandemic", "Big Pharma", "poison", "real investigations", "research", "spike proteins", "unexplained", "toxic ingredients", "vaccines", "toxins", "chemical violence", "Censored Science", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://thenewamerican.com/dr-mark-trozzi-toxic-metals-in-covid-shots/", "https://drtrozzi.org/2022/09/23/whats-really-in-the-covid-vaccines/", "https://naturalnews.com/2022-10-13-moderna-covid-vaccine-autoimmune-disease.html", "https://www.naturalpedia.com/aluminum-sources-health-risks.html", "https://www.naturalpedia.com/cobalt-60-toxicity-side-effects-diseases-and-environmental-impacts.html", "https://www.naturalpedia.com/sulphur-toxicity-side-effects-diseases-and-environmental-impacts.html", "http://vaccineinjurynews.com", "https://worldcouncilforhealth.org/resources/spike-protein-detox-guide/", "https://www.naturalpedia.com/fasting-sources-health-benefits-at-naturalpedia-com.html", "https://www.naturalpedia.com/vitamin-a-sources-health-benefits-and-uses.html", "https://chemicalviolence.com/", "https://www.brighteon.com/8c3422ce-3796-4ced-854f-172184a640c2", "https://www.brighteon.com/channels/drbillmcgraw", "https://naturalnews.com/2022-08-25-covid-vaccines-without-exception-mysterious-metallic-toxins.html", "https://naturalnews.com/2022-01-21-covid-vaccine-causes-miscarriages-stillbirths.html", "https://naturalnews.com/2022-09-16-walensky-cdc-spread-misinformation-covid-vaccine-safety.html", "https://thenewamerican.com/dr-mark-trozzi-toxic-metals-in-covid-shots/", "https://drtrozzi.org/2022/09/23/whats-really-in-the-covid-vaccines/", "https://worldcouncilforhealth.org/resources/spike-protein-detox-guide/", "https://www.brighteon.com/8c3422ce-3796-4ced-854f-172184a640c2", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2022-10-20-covid-vaccines-crazy-cocktails-contain-toxic-metals.html&linkname=COVID-19%20vaccines%20are%20%E2%80%9Ccrazy%20cocktails%E2%80%9D%20that%20contain%20TOXIC%20METALS%2C%20warns%20Dr.%20Trozzi", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}