{"result_id": "170017", "URL": "https://ingredients.news/2023-03-01-humans-fed-cultured-cells-used-in-vaccines.html", "timestamp": "2023-04-25 15:39:39 CEST+0200", "meta": {"description": "Over the past few decades, Big Pharma companies have cultured large volumes of cells to produce vaccines and other biotherapeutics. Now, food companies want humans to eat these cells, too. Leading fake meat industry startups Believer Meats, Eat Just Inc. and Upside Foods Inc. have raised more than $1.2 billion in combined venture funding to […]", "lang": "en", "keywords": "badcancer,badfood,badscience,Believer Meats,biotech,cancer causes,cancer criminals,clean food watch,cultured meat,Eat Just Inc.,fake meat,FBS,fetal bovine serum,food science,food supply,frankenfood,grocery,immortalized cells,junk food,precancerous,products,stop eating poison,toxic ingredients,Upside Foods Inc.", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2023-03-01-humans-fed-cultured-cells-used-in-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "Humans are now being pushed to consume fake meat products made from the same cultured cells used in vaccines", "cleaned_text": "Humans are now being pushed to consume fake meat products made from the same cultured cells used in vaccines\n\nOver the past few decades, Big Pharma companies have cultured large volumes of cells to produce vaccines and other biotherapeutics.\n\nNow, food companies want humans to eat these cells, too.\n\nLeading fake meat industry startups Believer Meats, Eat Just Inc. and Upside Foods Inc. have raised more than $1.2 billion in combined venture funding to bring products to grocery shelves.\n\nTheir research facilities and pilot plants have produced small amounts of chicken that didn’t come from a slaughterhouse. Late last year, Upside became the first to get a greenlight from the Food and Drug Administration to bring its products to market. All three companies have also announced partnerships with restaurants.\n\nThese companies are making an effort to promote their products as “real” meat.\n\n“This is meat,” Upside Foods Inc. Chief Executive Officer Uma Valeti said at an industry conference a little more than a year ago. “Calling it anything else, I think, is going to be misleading.”\n\nThat may be true on a cellular level. But there lies a larger issue.\n\nFake meat products are supposedly free of animal cruelty. However, laboratory-grown meat actually uses a byproduct of cow slaughter. (Related: Globalist-backed lab-grown meat uses byproduct of cow slaughter.)\n\nA June 24 op-ed published in LifeSiteNews mentioned that cultured meat is grown using fetal bovine serum (FBS), which is made from the blood of cow fetuses. It explained that FBS is used because any cell can grow in it. FBS also contains growth factors that prevent cell death.\n\nA 2017 article by Slate magazine, meanwhile, elaborated on the gruesome process of FBS collection.\n\n“If a cow coming for slaughter happens to be pregnant, the cow is slaughtered and bled. The fetus is [then] removed from its mother and brought into a blood collection room,” the magazine article stated.\n\n“The [cow] fetus, which remains alive during the following process to ensure blood quality, has a needle inserted into its heart. Its blood is then drained until the fetus dies, a death that usually takes about five minutes. This blood is then refined, and the resulting extract is FBS.”\n\nThus, according to LifeSiteNews, fake meat “does not meet vegetarian requirements” and could “raise religious objections.” The site said consuming fake meat is tantamount to “eating food made from an animal that was sacrificed before it was even born.”\n\nImmortalized cells in fake meat can cause cancer\n\nThere’s also the issue of its safety.\n\nWhile many scientists insist that cultured meat products won’t give you cancer, the industry doesn’t have the decades of data to prove it.\n\nNormal meat cells don’t just keep dividing forever. To get the cell cultures to grow at rates big enough to power a business, several companies are quietly using what are called immortalized cells.\n\nImmortalized cells are a staple of medical research, but they are precancerous and can be fully cancerous at times.\n\nEat Just Inc. declined to comment about it. Believer Meats Chief Scientific Officer Yaakov Nahmias said his company uses immortalized cells in its cultured chicken, and that his team has somehow created immortalized cells that don’t share any genetic signatures with cancer cells. Eric Schulze, Upside Foods vice president for global scientific and regulatory affairs, said his company stands by its FDA nod and its safety protocols.\n\nNone of them can categorically deny that their products have something that can cause cancer.\n\nVisit FakeMeat.news for more stories about fake meat.\n\nWatch this video that talks about how a lab-grown meat can cause cancer in humans.\n\nThis video is from The Prisoner channel on Brighteon.com.\n\nU.S. beef industry makes strategic move to counter lab-grown meat with legal definition of “meat.”\n\nLab-grown meat will never feed the world or be commercially viable.\n\nReal meat for me, but not for thee: Globalists pushing lab-grown meat for the masses.", "opengraph": {"title": "Humans are now being pushed to consume fake meat products made from the same cultured cells used in vaccines", "type": "article", "url": "https://www.ingredients.news/2023-03-01-humans-fed-cultured-cells-used-in-vaccines.html", "site_name": "Ingredients News", "description": "Over the past few decades, Big Pharma companies have cultured large volumes of cells to produce vaccines and other biotherapeutics. Now, food companies want humans to eat these cells, too. Leading fake meat industry startups Believer Meats, Eat Just Inc. and Upside Foods Inc. have raised more than $1.2 billion in combined venture funding to […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2023/03/Human-Cells.jpg"}, "tags": ["precancerous", "immortalized cells", "cultured meat", "Eat Just Inc.", "fetal bovine serum", "FBS", "cancer criminals", "products", "biotech", "clean food watch", "frankenfood", "grocery", "Upside Foods Inc.", "toxic ingredients", "Believer Meats", "fake meat", "food science", "food supply", "stop eating poison"], "tweets": [], "movies": [], "links": ["https://www.bloomberg.com/news/features/2023-02-07/lab-grown-meat-has-bigger-challenges-than-the-fda?sref=jB82HHlm#xj4y7vzkg", "https://www.lifesitenews.com/opinion/globalists-want-you-to-eat-climate-friendly-meat-yet-hide-unpleasant-truths-about-the-product/", "https://naturalnews.com/2022-06-28-lab-grown-meat-uses-cow-slaughter-byproduct.html", "https://fakemeat.news/", "https://www.brighteon.com/0e20ba0d-c9ec-4eae-b39c-b5767d343320", "https://www.brighteon.com/channels/theprisoner", "https://naturalnews.com/2018-03-08-us-beef-industry-to-counter-lab-grown-meat-with-definition.html", "https://naturalnews.com/053396_artificial_meat_world_food_supply_commercial_viability.html", "https://naturalnews.com/2022-06-30-investors-love-it-but-scientists-question-safety.html", "https://naturalnews.com/2022-04-04-globalists-pushing-people-consume-lab-grown-meat.html", "https://www.bloomberg.com/news/features/2023-02-07/lab-grown-meat-has-bigger-challenges-than-the-fda?sref=jB82HHlm#xj4y7vzkg", "https://www.lifesitenews.com/opinion/globalists-want-you-to-eat-climate-friendly-meat-yet-hide-unpleasant-truths-about-the-product/", "https://www.brighteon.com/0e20ba0d-c9ec-4eae-b39c-b5767d343320", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2023-03-01-humans-fed-cultured-cells-used-in-vaccines.html&linkname=Humans%20are%20now%20being%20pushed%20to%20consume%20fake%20meat%20products%20made%20from%20the%20same%20cultured%20cells%20used%20in%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}