{"result_id": "170020", "URL": "https://ingredients.news/2023-03-17-new-monster-energy-drink-features-demonic-symbols-cans.html", "timestamp": "2023-04-25 15:39:41 CEST+0200", "meta": {"description": "The California-based Monster Beverage Corporation (MBC), maker of the eponymous energy drink, released a new beverage featuring demonic symbols on its cans. According to SGT Report, MBC released last month its new The Beast Unleashed hard seltzer containing six percent alcohol. The product, which had four variants, was sold in 16-ounce (oz) large cans and […]", "lang": "en", "keywords": "666,badfood,badhealth,beverages,caffeine,demonic symbols,energy drink,evil,frankenfood,grocery,hard seltzer,junk food,Monster Beverage Corporation,Monster Energy Drink,obesity,products,Satanic,satanism,stop eating poison,sugar,sweeteners,The Beast Unleashed,toxic ingredients,twisted", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2023-03-17-new-monster-energy-drink-features-demonic-symbols-cans.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "New Monster Energy drink features DEMONIC symbols on its cans", "cleaned_text": "New Monster Energy drink features DEMONIC symbols on its cans\n\nThe California-based Monster Beverage Corporation (MBC), maker of the eponymous energy drink, released a new beverage featuring demonic symbols on its cans.\n\nAccording to SGT Report, MBC released last month its new The Beast Unleashed hard seltzer containing six percent alcohol. The product, which had four variants, was sold in 16-ounce (oz) large cans and 12 oz. slim cans. Can designs for all four variants were consistent, however, with only minor changes in the colorway.\n\nMost prominent in the can’s design was the eye of the “beast,” which mirrors the Eye of Horus symbol used by the Illuminati secret society. The middle of the eye contained the Monster logo, which is initially designed to look like the claw marks of an animal – purportedly the “monster” or “beast” referenced in the product’s name.\n\n“The Monster logo … is actually three instances of the number 6 in Hebrew,” said Geoffrey Grider, editor-in-chief of Now The End Begins. The individual claw marks appear to look similar to the Hebrew letter “vav,” corresponding to the number six. Thus, the three “vav” letters arranged to look like an animal’s claw marks correspond to 666 – the number of the beast mentioned in the book of Revelation.\n\nThe 666 claw logo is also shown on the lower part of the can, with the word “hard” and the drink’s alcohol content of six percent in between it.\n\n“What does that give you? It gives you an alcoholic drink called ‘The Beast Unleashed’ with 666 on every can three times, with the all-seeing eye in the background watching you while you drink it.” (Related: Monster Energy drink delivers cryptic SATANIC messages nobody even noticed for the last decade (op-ed).)\n\nGrider pointed out that the release of Monster’s new beverage riddled with satanic symbols “didn’t even cause a minor stir … because this world is preparing itself to receive [the] antichrist.”\n\nWith a six percent alcohol content, MBC’s new The Beast Unleashed hard seltzer definitely falls under the category of “the devil’s nectar.” Seltzer Nation pointed out that three of the product’s flavors will mirror those of the company’s flagship energy drink.\n\nOutside of the demonic symbolism adorning its cans, Monster Energy Drink can also be considered “the devil’s nectar” because of its excessive sugar and caffeine content that lets drinkers “unleash the beast.” An October 2016 article by the Australian Rethink Sugary Drink (RSD) initiative expounded on this concern.\n\nCraig Sinclair, the former public health committee chairman of Cancer Council Australia, pointed out that “some large energy drinks contain up to 21 teaspoons of sugar and as much caffeine as two and a half shots of espresso – making them a risky drink choice for anyone.”\n\nTrue enough, RSD’s analysis of different energy drink brands put Monster among the worst offenders. It found that a 500 milliliter can of Monster contained 160 milligrams of caffeine. Moreover, the same can of Monster contains 57 grams of sugar – equivalent to 14 tablespoons.\n\n“The high levels of caffeine and sugar in energy drinks cause energy and blood sugar levels to spike – but after about an hour, the caffeine and sugar in your body start to wear off and you’ll feel tired and lethargic,” Sinclair said.\n\n“If consumed regularly, the high sugar content in energy drinks can lead to weight gain and obesity – increasing your risk of heart and kidney disease, Type 2 diabetes, stroke and some cancers.”\n\nSinclair pointed out that energy drinks “are heavily marketed as the ideal drink of choice for young Australians.” He also mentioned that companies behind these energy drinks are “adept at targeting advertising … to develop brand images that are extremely enticing to young people.”\n\nHead over to Demonic.news for more stories like this.\n\nWatch this viral video of a woman explaining the demonic symbols on the Monster Energy Drink can.\n\nThis video is from The Willow channel on Brighteon.com.\n\nEnergy drinks found to be shockingly toxic to the human heart.\n\nClay Clark: Luciferians pushing 666 in their quest to enslave humanity – Brighteon.TV.\n\nTop 12 CONVERSIONS the Demon-Democrats in DC want every American to complete.\n\nMoral decline: Satanic symbols now appearing at government buildings all across America.\n\nTHE SUMMONING: 72 nations PUBLICLY worship satanic idols in televised luciferian ritual while celebrity chef Gordon Ramsay creepily stalks frightened lambs.", "opengraph": {"title": "New Monster Energy drink features DEMONIC symbols on its cans", "type": "article", "url": "https://www.ingredients.news/2023-03-17-new-monster-energy-drink-features-demonic-symbols-cans.html", "site_name": "Ingredients News", "description": "The California-based Monster Beverage Corporation (MBC), maker of the eponymous energy drink, released a new beverage featuring demonic symbols on its cans. According to SGT Report, MBC released last month its new The Beast Unleashed hard seltzer containing six percent alcohol. The product, which had four variants, was sold in 16-ounce (oz) large cans and […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2023/03/monster-drink-666.png"}, "tags": ["energy drink", "sugar", "demonic symbols", "666", "satanism", "beverages", "Monster Energy Drink", "products", "sweeteners", "frankenfood", "grocery", "toxic ingredients", "Monster Beverage Corporation", "twisted", "evil", "hard seltzer", "The Beast Unleashed", "caffeine", "obesity", "Satanic", "stop eating poison"], "tweets": [], "movies": [], "links": ["https://www.sgtreport.com/2023/03/monster-energy-drink-company-launches-the-beast-unleashed-hard-seltzer-alcoholic-beverage-complete-with-666-and-the-all-seeing-eye-on-every-can/", "https://www.seltzernation.com/update-on-monster-energy-the-beast-unleashed/", "https://www.nowtheendbegins.com/monster-energy-drink-company-launches-beast-unleashed-666-satanism-antichrist/", "https://beginningandend.com/monster-energy-drink-secretly-promoting-666-mark-beast/", "https://www.naturalnews.com/2022-01-09-monster-energy-drink-delivers-cryptic-satanic-messages.html", "http://products.news", "https://www.rethinksugarydrink.org.au/media/energy-drinks-hide-up-to-21-teaspoons-sugar.html", "http://demonic.news/", "https://www.brighteon.com/6e2210b2-dff8-4aeb-8775-07ea338fab32", "https://www.brighteon.com/channels/thewillow", "https://heart.news/2017-05-01-energy-drinks-found-to-be-shockingly-toxic-to-the-human-heart.html", "https://evil.news/2022-05-20-clay-clark-luciferians-pushing-666-enslave-humanity.html", "https://brainwashed.news/2023-02-13-12-conversions-dc-democrats-want-americans-to-complete.html", "https://twisted.news/2019-04-02-moral-decline-satanic-symbols-appearing-at-government-buildings-across-america.html", "https://satanism.news/2022-08-03-world-governments-publicly-worship-satanic-idols-ritual-gordon-ramsay-stalks-frightened-lambs.html", "https://www.sgtreport.com/2023/03/monster-energy-drink-company-launches-the-beast-unleashed-hard-seltzer-alcoholic-beverage-complete-with-666-and-the-all-seeing-eye-on-every-can/", "https://www.seltzernation.com/update-on-monster-energy-the-beast-unleashed/", "https://www.nowtheendbegins.com/monster-energy-drink-company-launches-beast-unleashed-666-satanism-antichrist/", "https://beginningandend.com/monster-energy-drink-secretly-promoting-666-mark-beast/", "https://www.rethinksugarydrink.org.au/media/energy-drinks-hide-up-to-21-teaspoons-sugar.html", "https://www.brighteon.com/6e2210b2-dff8-4aeb-8775-07ea338fab32", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2023-03-17-new-monster-energy-drink-features-demonic-symbols-cans.html&linkname=New%20Monster%20Energy%20drink%20features%20DEMONIC%20symbols%20on%20its%20cans", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}