{"result_id": "170022", "URL": "https://ingredients.news/2023-01-18-pfizer-settled-chantix-claims-back-in-2013.html", "timestamp": "2023-04-25 15:39:42 CEST+0200", "meta": {"description": "Back in 2013, Pfizer paid out $273 million to settle lawsuits linked to its anti-smoking drug Chantix. The amount set aside by the drug firm was meant for about 2,700 state and federal complaints – four-fifths of the total number. A March 2013 report by Fierce Pharma elaborated on the settlement, citing a securities filing […]", "lang": "en", "keywords": "anti-smoking drug,badcancer,badhealth,badmedicine,Big Pharma,carcinogens,chantix,depression,drugs,Food and Drug Administration,mental health,mental issues,nitrosamines,Pfizer,quit smoking,settlement,smoking cessation,stop smoking,varenicline,voluntary recall", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ingredients.news/2023-01-18-pfizer-settled-chantix-claims-back-in-2013.html", "encoding": "UTF-8"}, "image": null, "domain": "ingredients.news", "title": "REPEAT OFFENDER: Pfizer shelled out $273M in 2013 to settle claims linked to its anti-smoking drug Chantix", "cleaned_text": "REPEAT OFFENDER: Pfizer shelled out $273M in 2013 to settle claims linked to its anti-smoking drug Chantix\n\nBack in 2013, Pfizer paid out $273 million to settle lawsuits linked to its anti-smoking drug Chantix. The amount set aside by the drug firm was meant for about 2,700 state and federal complaints – four-fifths of the total number.\n\nA March 2013 report by Fierce Pharma elaborated on the settlement, citing a securities filing from the New York-based drug giant. Aside from the $273 million, Pfizer had also set aside a separate $15 million for the remaining claims.\n\nThe settlements followed earlier agreements Pfizer entered to drop two cases connected to Chantix. Senior U.S. District Judge Inge Johnson of the District Court for the Northern District of Alabama presided over the two cases. The terms of both settlements were not disclosed.\n\nThe company settled with Judy Ann Whitely, the wife of Mark Whitely, in October 2012. Mark, who was from Minnesota, committed suicide while on the drug. Later in January 2013, it settled with Billy Bedsole who claimed the smoking cessation drug caused him to have suicidal thoughts and other psychiatric issues.\n\nThe medication gained infamy following reports of suicide, suicide attempts and other psychiatric disturbances – forcing the Food and Drug Administration (FDA) to require a “black box” warning on boxes of Chantix, in order to alert both patients and doctors of the risk of psychiatric side effects.\n\nCritics, meanwhile, blasted Pfizer for improperly excluding patients with a history of mental issues in its trials for the drug. In response, the company sponsored a trial in patients with depression or who had a history of it. According to the company, Chantix beat placebo in helping patients quit their smoking habits. (Related: NEVER FORGET: Pfizer manipulated studies to convince doctors to prescribe seizure drug Neurontin for off-label use.)\n\nThe FDA later determined that Chantix is “probably” associated with a higher risk of heart attack.\n\nChantix later pulled out from the market\n\nProduction of Chantix continued after the settlements, but abruptly stopped in June 2021 due to the presence of nitrosamines in the drug. The cancer-causing chemical was discovered in batches of the smoking cessation drug during regular safety monitoring. Upon further scrutiny, the levels of nitrosamines in the batches of Chantix far exceeded levels deemed safe by the FDA.\n\nThe halt in production was followed by a voluntary recall of the product, with Pfizer eventually stopping manufacturing Chantix. Other drug manufacturers stepped in to create generic versions of the anti-smoking drug under the generic name varenicline. The FDA approved the first generic varenicline in August 2021, two months after Pfizer temporarily halted the manufacture of the drug.\n\nAccording to an Oct. 27, 2022 piece published by healthcare company GoodRx, nitrosamines when consumed in excess may increase the risk of certain cancers.\n\n“Animal studies suggest nitrosamines are carcinogenic. There are reports that when nitrosamine is given to rats, it can cause tumors to grow in multiple organs – including the liver, kidneys and lungs.”\n\nHowever, the piece clarified that the nitrosamine in Chantix is called N-nitroso-varenicline. This nitrosamine is different from the N-nitrosodimethylamine (NDMA) found in other medications. It added that the presence of NDMA caused the recall of various drugs such as the anti-heartburn drug ranitidine, the anti-diabetes drug metformin and anti-hypertension drug losartan.\n\nDangerousMedicine.com has more stories about Pfizer.\n\nWatch this video that talks about Pfizer’s recall of Chantix over high levels of nitrosamines.\n\nThis video is from the True Thoughts channel on Brighteon.com.\n\nNEVER FORGET: In 1994, Pfizer paid $20 million after LYING about defective heart valve that killed hundreds.\n\nCOVID-19 vaccine maker Pfizer was involved in the largest healthcare fraud settlement in history in 2009.\n\nCRIME CARTEL: Pfizer paid out $2.3 billion in a settlement to Washington for illegally promoting its drugs.\n\nRemember when Pfizer paid out $2.3 billion to settle the largest healthcare fraud case in history?\n\nPHARMA FLASHBACK: Pfizer shelled out $2.3B to settle civil and criminal charges in 2009.", "opengraph": {"title": "REPEAT OFFENDER: Pfizer shelled out $273M in 2013 to settle claims linked to its anti-smoking drug Chantix", "type": "article", "url": "https://www.ingredients.news/2023-01-18-pfizer-settled-chantix-claims-back-in-2013.html", "site_name": "Ingredients News", "description": "Back in 2013, Pfizer paid out $273 million to settle lawsuits linked to its anti-smoking drug Chantix. The amount set aside by the drug firm was meant for about 2,700 state and federal complaints – four-fifths of the total number. A March 2013 report by Fierce Pharma elaborated on the settlement, citing a securities filing […]", "image": "https://www.ingredients.news/wp-content/uploads/sites/102/2023/01/Smoke-Hand-Cigarette-Woman-Hand.jpg"}, "tags": ["mental health", "nitrosamines", "smoking cessation", "mental issues", "Big Pharma", "settlement", "anti-smoking drug", "stop smoking", "varenicline", "chantix", "quit smoking", "depression", "Pfizer", "drugs", "carcinogens", "voluntary recall", "Food and Drug Administration"], "tweets": [], "movies": [], "links": ["https://www.fiercepharma.com/sales-and-marketing/pfizer-settles-2-000-plus-chantix-suits-takes-273m-charge", "http://badmedicine.news", "https://www.naturalnews.com/2023-01-10-pfizer-manipulated-studies-neurontin-off-label-use.html", "https://www.goodrx.com/chantix/chantix-production-halted", "https://dangerousmedicine.com/", "https://www.brighteon.com/a14867de-e4a7-4dc5-b47e-4113ae409263", "https://www.brighteon.com/channels/truethoughts", "https://newstarget.com/2023-01-09-pfizer-paid-millions-defective-heart-valve-deaths.html", "https://bigpharmanews.com/2021-02-09-pfizer-involved-in-largest-healthcare-fraud-settlement.html", "https://newstarget.com/2023-01-17-pfizer-paid-settlement-for-illegally-promoting-drugs.html", "https://bigpharmanews.com/2021-01-05-pfizer-settle-largest-healthcare-fraud-case-history.html", "https://newstarget.com/2023-01-12-pfizer-shelled-out-billions-civil-criminal-charges.html", "https://www.fiercepharma.com/sales-and-marketing/pfizer-settles-2-000-plus-chantix-suits-takes-273m-charge", "https://www.goodrx.com/chantix/chantix-production-halted", "https://www.brighteon.com/a14867de-e4a7-4dc5-b47e-4113ae409263", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fingredientsnews%2F2023-01-18-pfizer-settled-chantix-claims-back-in-2013.html&linkname=REPEAT%20OFFENDER%3A%20Pfizer%20shelled%20out%20%24273M%20in%202013%20to%20settle%20claims%20linked%20to%20its%20anti-smoking%20drug%20Chantix", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}