{"result_id": "171032", "URL": "https://www.icr.org/article/voyage-beagle-creators-service", "timestamp": "2023-04-25 15:40:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/voyage-beagle-creators-service", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "The Voyage Of The Beagle - In The Creator's Service | The Institute for Creation Research", "cleaned_text": "The Voyage Of The Beagle - In The Creator's Service\n\nDownload The Voyage Of The Beagle - In The Creator's Service PDF\n\nThe famous 1831-36 voyage of His Majesty's Ship (HMS) Beagle, with Charles Darwin on board as naturalist, was a voyage in service of the Creator. Its primary purpose was to survey the coast of lower South America. In helping secure the safety of British shipping, the survey fulfilled the Cultural Mandate of Genesis 1:28 to subdue and rule the earth. Even Darwin's observations added to man's knowledge of the natural resources in those lands.\n\nAnother goal of the Captain, Robert Fitzroy, was to return three natives to Tierra del Fuego at the tip of South America. Darwin wrote, \"To settle these natives in their own country, was one chief inducement to Captain Fitzroy to undertake our present voyage\" (1: 222). With the natives was the Rev. Richard Matthews of the Anglican Church Mission Society. Matthews hoped to establish a mission to the Fuegians in obedience to the Great Commission of Matthew 28:19-20. While this initial effort was rebuffed, it inspired later, fruitful outreach to the Fuegians.\n\nThe Beagle successfully completed its detailed survey of the coastal lands and waters. The work was carried on through difficult weather, sickness, and even death. Once the Beagle was beached for hull repairs. Another time the crew, including Darwin, took up arms to help the local police preserve order in Montevideo. Usually while the crew was surveying, Darwin was on shore recording observations and collecting specimens which he preserved and sent to England.\n\nAfter three and a half years of surveying, ending in the Galapagos Islands, the Beagle proceeded around the world. Ports of call included Tahiti, New Zealand, Australia, and South Africa. On arriving in England, Fitzroy was honored with a gold medal by the Royal Geographical Society and officially thanked by Parliament. Popular accounts of the voyage were written by both Fitzroy and Darwin and published as sister volumes in 1839. Neither mentioned evolution, though there were hints of the controversy to come.\n\nIn an effort to recover a stolen boat on his prior voyage, Fitzroy took several hostages. Four were taken to England. Fitzroy explained,\n\nThe sailors renamed them Boat Memory, York Minster, Fuegia Basket, and Jemmy Button. Though all were vaccinated, Boat Memory died of small pox. Fitzroy arranged for the other three to live at a school in Walthamstow, near London, under Rev. William Wilson and his wife. They were taught English, Christianity, and agriculture. They appeared before the King and Queen, who gave Fuegia one of her bonnets, a ring from her finger, and gifts for a dowry.\n\nThe Admiralty allowed Fitzroy to return the Fuegians and a missionary to Tierra del Fuego. The Walthamstow church gave supplies and the Beagle's coxswain, James Bennett, would oversee the Fuegians as he had done before. The young catechist, Richard Matthews, would teach the Fuegians and study their language during the year voyage.\n\nOn the Beagle, Darwin had his first contact with the Fuegians. Jemmy Button was his favorite. \"[Jemmy] was merry and often laughed, and was remarkably sympathetic with any one in pain: when the water was rough, I was often a little sea-sick, and he used to come to me and say in a plaintive voice, `Poor, poor fellow!'\" Darwin noted the Fuegians aptitude for foreign languages and their excellent eyesight. \"Both York and Jemmy were much superior to any sailor on board: several times they have declared what some distant object has been, and though doubted by everyone, they have proved right, when it has been examined through a telescope\" (1: 222-3).\n\nAfter a terrible storm the ship reached Jemmy's tribal area in January 1833. The scenery was breath taking, but Darwin was also awed by the condition of the local Fuegians:\n\nThe first site of their unclothed kinsmen also shocked the three Fuegians onboard. However, Lt. Hamond lamented: \"What a pity such fine fellows should be left in such a barbarous state!\" (2: 92). Another officer concerned for the Fuegians was Lt. B. J. Sulivan, known for reading a Psalm each day. Sulivan, who later became admiral of the Navy, remained a faithful supporter of the Fuegian mission efforts.\n\nA good site for a mission station was found at Woollya, a protected bay with surrounding land suitable for gardens and pasture. The crew labored building three log huts, unloading the supplies from Walthamstow, and planting two gardens. Constant vigilance was needed to prevent theft. When everything appeared in order, the Beagle left for ten days of surveying.\n\nOn the return to Woollya, the Beagle passed natives wearing pieces of linen and tartan cloth. They found Matthews alive but distraught. In the words of Darwin,\n\nMatthews agreed he should leave, but Jemmy, York, and Fuegia wanted to stay. After eight days away, Fitzroy returned to check on them. The garden, though trampled, was beginning to grow. Jemmy told of more stealing, but otherwise they were unharmed. Fitzroy wrote,\n\nAbout a year later, on March 5, 1834, the Beagle returned one last time to Woollya. The place was deserted. A canoe approached and one of the men was seen washing paint off his face. Darwin wrote,\n\nDarwin goes on to describe this last contact with Jemmy,\n\nThere would be more failures and martyrdom before a mission station was established in Jemmy's land about thirty years later. However, Fitzroy and Darwin, saw the fruit of missionary work in Tahiti and New Zealand. Darwin wrote his sister, Caroline, that thanks to the missionaries, they could \"`walk with as much safety as in England,' surrounded by tribes who `were the most ferocious savages probably on the face of the earth'\" (3: 176). In his book, Darwin wrote,\n\nWhile in South Africa, Fitzroy and Darwin collaborated on an article defending missionary work among native peoples. However, three years after the voyage, different worldviews were evident in their accounts of the voyage. Fitzroy, perhaps anticipating where Darwin was headed, ended his account by urging belief in the literal truth of the Bible. He stressed that all men were related, originating from Asia Minor. He defended six-day creation and the worldwide Flood as consistent with geology (2: 176-9). Darwin's account included several favorable references to Charles Lyell's book, Principles of Geology: Being an Attempt to Explain the Former Changes of the Earth's Surface by Reference to Causes Now in Operation (1: 95, 132, 188, 346, 363, 494). On the voyage Darwin read this lengthy book opposed to recent creation and a worldwide Flood.\n\nAbout the Galapagos finches, Darwin wrote, \"Seeing this gradation and diversity of structure in one small, intimately related group of birds, one might really fancy that from an original paucity of birds in this archipelago, one species had been taken and modified for different ends\" (1: 402). But the birds remained birds. Darwin did not propose a theory of evolution, but concluded,\n\nBy 1859 Darwin set aside such precautions. He began The Origin of Species:\n\nIt was ironic that the voyage of the Beagle was used for the theory of evolution. The Beagle's crew, like many in nineteenth century England, held the Biblical worldview. On the voyage they conducted worship each Lord's Day, and God gave them success. Through difficulties they completed the coastal survey, while Darwin observed the plants and animals. They assisted the first missionary effort in Tierra del Fuego and made famous the voyage of the Beagle.\n\nSources: The references, such as (1: 222), indicate the source, 1 (below), and the page, 222.\n• None Charles Darwin, The Voyage of the Beagle, Harvard Classics 29, New York: \n\n P. F. Collier & Son, 1909 [1839].\n• None Charles Darwin, On the Origin of Species by Means of Natural Selection, Great Books of the Western World, 49, Chicago: Encyclopedia Britannica, 1952 [1859].\n\n*Mr. Louis Lavallee (M.S., M.Div.) is an environmental engineer in Mississippi.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "The Voyage Of The Beagle - In The Creator's Service | The Institute for Creation Research", "url": "https://www.icr.org/article/voyage-beagle-creators-service", "type": "website", "description": "The famous 1831-36 voyage of His Majesty's Ship (HMS) Beagle, with Charles Darwin on board as naturalist, was a voyage in service of the Creator. Its primary purpose was to survey the coast of lower South America. In helping secure the safety of British shipping, the survey fulfilled the Cultural Mandate of Genesis 1:28 to subdue and rule the earth. Even Darwin's observations added to man's knowledge of the natural resources in those lands. \r\nAnother goal of the Captain, Robert Fitzroy, was to r"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}