{"result_id": "171027", "URL": "https://www.icr.org/article/bill-nye-evolution-guy", "timestamp": "2023-04-25 15:40:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/bill-nye-evolution-guy", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Bill Nye the Evolution Guy | The Institute for Creation Research", "cleaned_text": "\"The main idea in all of biology is evolution,\" Bill Nye recently told Popular Mechanics.1 He was responding to the results of a Penn State survey of U.S. high school biology teachers, only 28 percent of whom advocated teaching evolution.\n\n\"Science is the key to our future, and if you don't believe in science, then you're holding everybody back,\" the former host of the children's show Bill Nye the Science Guy said. \"And it's fine if you as an adult want to run around pretending or claiming that you don't believe in evolution, but if we educate a generation of people who don't believe in science, that's a recipe for disaster.\"1\n\nNye holds a B.S. degree in mechanical engineering from Cornell University―where one of his professors was Carl Sagan―as well as three honorary doctorates.2\n\n\"People make flu vaccinations that stop people from getting sick. Farmers raise crops with science; they hybridize them and make them better with every generation. That's all evolution. Evolution is a theory, and it's a theory that you can test. We've tested evolution in many ways. You can't present good evidence that says evolution is not a fact,\" he said.1\n\nBut not all scientists agree with him.\n\n\"Bill Nye makes two fundamental errors in his lament: Confusing 'evolution' with 'science,' and confusing small observable changes in a kind or species with unobservable changes of one kind of creature into another,\" commented Nathaniel Jeanson, who obtained his Ph.D. in cell and developmental biology from Harvard University. \"Both errors hide essentially the same fact: Evolution in the molecules-to-man science is not and cannot be observed; therefore, it is not science and is not validated by observing small changes within a kind of creature or species.\"\n\nWhen asked whether teachers should be \"mandated\" to teach evolution as fact, Nye said, \"What other fundamental theory in all of biology is there? Intelligent design, as the judge in Dover, Penn., said, is 'breathtaking inanity.' It was so stupid it took his breath away. I agree with him. It's great to teach in history class...but we don't learn about those ideas in science class.\"1\n\nNeither should students learn about the theory of evolution in science education, Jeanson said.\n\n\"Science is fundamentally about observation; science class should be filled with observations. Speculations about the unobservable past do not belong in the science class; therefore, 'evolution' in the big change sense does not belong in the science class, either.\"\n\nWhen it comes to teaching biology, evolution doesn't fit the bill.\n• Fecht, S. Science Guy Bill Nye Explains Why Evolution Belongs in Science Education. Popular Mechanics. Posted on popularmechanics.com February 4, 2011, accessed March 8, 2011.\n\n* Ms. Dao is Assistant Editor at the Institute for Creation Research.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Bill Nye the Evolution Guy | The Institute for Creation Research", "url": "https://www.icr.org/article/bill-nye-evolution-guy", "type": "website", "description": "\"The main idea in all of biology is evolution,\" Bill Nye recently told Popular Mechanics.1 He was responding to the results of a Penn State survey of U.S. high school biology teachers, only 28 percent of whom advocated teaching evolution.\r\n\"Science is the key to our future, and if you don't believe in science, then you're holding everybody back,\" the former host of the children's show Bill Nye the Science Guy said. \"And it's fine if you as an adult want to run around pretending or claiming that "}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.popularmechanics.com/science/environment/evolution-classroom-bill-nye-science-education", "http://www.billnye.com/about-bill-nye/curriculum-vitae/"], "authors": [], "publish_date": null}