{"result_id": "171016", "URL": "https://www.icr.org/article/avian-ventilation-and-ventilators", "timestamp": "2023-04-25 15:40:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/avian-ventilation-and-ventilators", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Avian Ventilation and Ventilators | The Institute for Creation Research", "cleaned_text": "Within this vast system of connecting passageways, there are no valves to suggest what the pattern of airflow might be. This has led to much speculation about the roles played by the different parts of the respiratory system.4\n\nDuring this time of the devastating COVID-19 pandemic, medical science is seeking a vaccine as well as drugs that will treat the symptoms. In the meantime, much has been reported on the ventilator, a lifesaving device that is used on the most serious cases. According to Wikipedia, “a ventilator is a machine that provides mechanical ventilation by moving breathable air into and out of the lungs, to deliver breaths to a patient who is physically unable to breathe, or breathing insufficiently.”Ventilators have been used in American hospitals for 60 years.\"The ventilator is the difference between life or death for people with severe COVID-19,\" says Brian Oliver, a respiratory disease researcher at University of Technology Sydney in Australia.General Motors and MIT, as well as other companies, are working to produce a family of newly-designed ventilators, but such design and planning takes time.Vertebrates (animals with a backbone) also depend on a specially designed system to enable their breathing. Thanks to bones and muscles, rhythmic breathing movements bring life-giving air across the respiratory surfaces in their lung(s). This is called ventilation.One of the most complex and frequently researched areas of ornithology is the respiratory system of the bird and how it achieves this ventilation. There’s nothing simple about the multiple air sacs, pneumatic bones, parabronchi, lung, and trachea (including the amazing syrinx) of the bird. The remarkable design of this sophisticated avian ventilation far exceeds the life-saving 21st-century ventilator.The gross mechanics of ventilation in the bird is fairly straightforward. The ribs are hinged at the sternum, the “breastbone” found at the mid-ventral line of the thorax, and to each other. When the sternum is lowered, the rib cage expands and inhalation occurs. When the sternum is elevated, the air sacs are compressed and air is expelled. The small air sacs of the bird are thin-walled expanded bronchi in the thorax and abdomen. They are connected to the lung by very small tubes and also enter the pneumatic bones and form air spaces. In the lung, air flows through the tiny pores (parabronchi) in a one-way direction. This is unlike airflow in people, where the inhaled air terminates in grape-like clusters called alveoli. People and mammals are designed with a characteristic tidal rhythm of ventilation that is not found in birds.The airflow through the bird’s respiratory system is anything but simple.We thank God for the technology that gave medical science these ventilators. Nothing was left to chance as the life-saving ventilation units were designed and constructed. How much more so as we view the vastly superior and created ventilation of the bird!", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Avian Ventilation and Ventilators | The Institute for Creation Research", "url": "https://www.icr.org/article/avian-ventilation-and-ventilators", "type": "website", "description": "During this time of the devastating COVID-19 pandemic, medical science is seeking a vaccine as well as drugs that will treat the symptoms. In the meantime, much has been reported on the ventilator, a lifesaving device that is used on the most serious cases. According to Wikipedia, “a ventilator is a machine that provides mechanical ventilation by moving breathable air into and out of the lungs, to deliver breaths to a patient who is physically unable to breathe, or breathing insufficiently.”"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Ventilator", "https://www.cnet.com/features/coronavirus-ventilators-why-one-machine-is-pivotal-in-the-battle-against-covid-19/"], "authors": [], "publish_date": null}