{"result_id": "171022", "URL": "https://www.icr.org/article/science-man-god-louis-pasteur", "timestamp": "2023-04-25 15:40:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/science-man-god-louis-pasteur", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Man of Science, Man of God: Louis Pasteur | The Institute for Creation Research", "cleaned_text": "Who: Louis Jean Pasteur\n\n What: Father of Modern Microbiology\n\n When: December 27, 1822 - September 28, 1895\n\n Where: Arbois, France\n\nLittle was known about preventative medicine and the causes of disease in the days of Louis Pasteur. Today, we owe all the discoveries in the fields of microbiology and immunology to his work.\n\nPasteur came from a long line of peasants. Biographers Albert Keim and Louis Lumet wrote that Pasteur was a \"rather slow\" student and \"gave no indication of brilliant qualities. He studied diligently, but without enthusiasm.\"1 His father, however, wanted him to become a professor, so the young Pasteur applied himself to his studies and eventually gained admittance to the prestigious École Normale Supérieure, to which he returned in 1856 as director of scientific studies.\n\nPasteur was a devout Catholic and was \"regarded as conforming with the biblical account of the creation.\"2 At the time, the concept of spontaneous generation was widely accepted, which maintained that life was generated by non-life (i.e., maggots appeared to arise out of exposed animal carcasses). Darwin used this theory, also known as abiogenesis, to propose that the first life forms miraculously grew out of a \"warm little pond, with all sorts of ammonia and phosphoric salts, lights, heat, electricity, etc.\"3\n\nPasteur conducted experiments comparing organic material that was exposed to air with organic material that was not. Nothing grew in the sealed or filtered vessels. This empirically demonstrated that the fermentation in the open containers was caused by the growth of microorganisms from the air, not spontaneous generation, thus proving biogenesis (life begets life). His studies led to the practices of sterilization and \"pasteur\"ization, particularly in the fields of medicine and food preparation. He wasn't the first to propose the theory that germs cause disease, but his experiments supported it and he shares the title of \"the father of germ theory and bacteriology\" with German physician Robert Koch.\n\nPasteur received criticism for his work and detail-oriented methods. He wouldn't make any claim until he had re-tested several times and was sure of the results. His vigorous approach to his work eventually led to perhaps his most significant contributions: the anthrax and rabies vaccines. Anthrax was responsible for destroying whole flocks of sheep in France, and Pasteur successfully demonstrated the survival of inoculated sheep from the vaccines he developed.\n\nIn 1880, Pasteur and his pupils began research into hydrophobia, or rabies. At the time, treatments included cauterization with hot irons, stifling sufferers between two mattresses, and other useless \"remedies.\" Pasteur isolated the rabies virus and developed both a non-virulent and a virulent vaccine.† The non-virulent version was given to a nine-year-old boy bitten by a mad dog in 1885. The vaccine succeeded, as it did in subsequent cases. On October 26, 1885, Pasteur officially presented his research on hydrophobia, preventative vaccines, and vaccination treatment applied after infection, and this work was highly praised.\n\nOn June 4, 1887, the Pasteur Institute was established in Paris so Pasteur and his researchers could expand their work on infectious diseases.4 A university was also named for him, and he received high honors and acclaim from his peers, years after he had endured their criticism. Later in life, he suffered from a series of strokes and died from complications in 1895 near Paris.\n\nPasteur's work set the foundation for some of the most important advances in our modern world. He was an experimentalist of the highest order, and his science was undoubtedly fueled by his faith:\n• Keim, A. and L. Lumet. Translated by Cooper, F. T. 1914. Louis Pasteur. New York, NY: Frederick A. Stokes Company, 5-6.\n• Darwin, C. Written in 1871, published in 1887. The Life and Letters of Charles Darwin, including an autobiographical chapter, vol. 3. London: John Murray, 18.\n• The history of the Pasteur Institute. Posted online at www.pasteur.fr/english.html, accessed September 22, 2008.\n\n† While Pasteur never was able to \"isolate\" the microscopic components of the rabies virus, he nonetheless was able to separate the virus to the extent that he could create various strengths of the vaccine for experimentation.\n\nCite this article: Dao, C. 2008. Man of Science, Man of God: Louis Pasteur. Acts & Facts. 37 (11): 8.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Man of Science, Man of God: Louis Pasteur | The Institute for Creation Research", "url": "https://www.icr.org/article/science-man-god-louis-pasteur", "type": "website", "description": "\r\n\tWho: Louis Jean Pasteur\r\n\tWhat: Father of Modern Microbiology\r\n\tWhen: December 27, 1822 - September 28, 1895\r\n\tWhere: Arbois, France\r\n\r\n\tLittle was known about preventative medicine and the causes of disease in the days of Louis Pasteur. Today, we owe all the discoveries in the fields of microbiology and immunology to his work.\r\n\r\n\tPasteur came from a long line of peasants. Biographers Albert Keim and Louis Lumet wrote that Pasteur was a \"rather slow\" student and \"gave no indication of brilli"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.pasteur.fr/english.html", "http://www.icr.org/bible/galatians/3/28"], "authors": [], "publish_date": null}