{"result_id": "171031", "URL": "https://www.icr.org/article/2944/", "timestamp": "2023-04-25 15:40:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/2944/", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Creation and the Bird Flu | The Institute for Creation Research", "cleaned_text": "We are all familiar with the unpleasant viral condition called influenza, or the flu. Adam and Eve were not created with viral diseases. Such pathogens were the result of the Fall (Genesis 3). Since then, history has shown tragic influenza outbreaks worldwide, including the epidemic of 1918 where 650,000 to 700,000 Americans perished. The number of people killed worldwide ranges from 20 to 100 million – with the most common estimates at 40 to 50 million.\n\nWhat made the 1918 strain so deadly has been a longstanding medical mystery. Many flu subtypes in the past possibly appeared in China. Their heritage finds significant domestic exposure to animals such as pigs and ducks. Random mixing of livestock seed in a confined area has no doubt led to devastating pandemic strains, the result of something called antigenic shift (part of antigenic variation). Briefly described, this occurs by a recombination or reassortment of the genes encoding the major surface antigen of the virus. Such antigen-shifting involves swine (swine flu virus), people (human influenza virus), and birds (avian flu virus), that produce a hypervirulent flu strain. But is this real vertical evolution as claimed by some? No. The virus remains a flu virus variant that has corrupted and recombined genes, nothing more.\n\nPresently, health authorities are concerned about a strain of avian flu approaching North America. At least 150 million domesticated birds have either died of the virus or been killed as a control measure to stem the spread. The first human case of this current strain of bird flu, H5N1, occurred in Hong Kong in 1997 with the death of six people. As of June 6, this virus has infected at least 225 people in ten countries. All cases were transmitted via contact with an infected animal (e.g., bird). Researchers fear the virus will now transmit between people as a full-blown epidemic.\n\nOne cannot help but read the apocalyptic tone of news stories as they address a possible bird flu epidemic in America. Could it happen again? Creation scientist Alan Gillen says that in a sense it already has, though not in quite a devastating form. The \"Asian flu\" of 1957-1958 killed 70,000 Americans. The 1968-1969 \"Hong Kong flu\" killed 34,000. The new subtype that appeared that year, called Influenza A (H3N2), was milder, perhaps because only the hemagglutinin protein (H3—the viral surface) changed and the neuraminidase (N2—a critical enzyme) stayed the same, therefore people may have had some residual resistance to it. Still, Influenza A (H3N2) has caused 400,000 deaths in the US since its emergence in 1968, ninety percent of them people older than 65.\n\nLet's remember that medical technology has progressed significantly in the past half-century. According to Gillen, we have a flu reporting system; we know how to make vaccines against the flu; we have antibiotics to treat the bacterial infections that killed so many in the pandemic of 1918; we even have several antiviral medicines that are helpful. In the meantime, creation scientists should conduct more investigation into the origin of infectious diseases and the genesis of germs. Whether the bird flu will be as bad as some say or just a \"normal\" cyclic sweep, let's be anxious for nothing (Philippians 4:6). God has everything under control (I Peter 5:7)\n\n* Frank Sherwin is a zoologist and seminar speaker for ICR.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Creation and the Bird Flu | The Institute for Creation Research", "url": "https://www.icr.org/article/2944/", "type": "website", "description": "\r\n\tWe are all familiar with the unpleasant viral condition called influenza, or the flu. Adam and Eve were not created with viral diseases. Such pathogens were the result of the Fall (Genesis 3). Since then, history has shown tragic influenza outbreaks worldwide, including the epidemic of 1918 where 650,000 to 700,000 Americans perished. The number of people killed worldwide ranges from 20 to 100 million – with the most common estimates at 40 to 50 million.\r\n\r\n\tWhat made the 1918 strain so dea"}, "tags": [], "tweets": [], "movies": [], "links": ["/bible/Genesis/3", "/bible/Philippians/4/6", "/bible/1Peter/5/7"], "authors": [], "publish_date": null}