{"result_id": "171013", "URL": "https://www.icr.org/article/sweden-herd-immunity", "timestamp": "2023-04-25 15:40:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/sweden-herd-immunity", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Sweden’s Herd Immunity | The Institute for Creation Research", "cleaned_text": "References \n\n 1. Hirneisen, M. \n\n 2. Psalm 56:3.\n\n \n\n *Mr. Sherwin is Research Associate is at ICR. He earned his master’s in zoology from the University of Northern Colorado. 1. Hirneisen, M. Top Swedish official: Virus rates easing up despite loose rules . Posted on washingtontimes.com April 15, 2020, accessed April 17.2. Psalm 56:3.*Mr. Sherwin is Research Associate is at ICR. He earned his master’s in zoology from the University of Northern Colorado.\n\nDespite criticism from the world medical community, Sweden has taken a more relaxed approach to the COVID-19 threat. It has not initiated a nationwide lockdown and, as of April 15, scientists are starting to see a welcome plateau in coronavirus cases.This is a significant development. It is not according to the apocalyptic predictions made by most in the medical community.What happened? Why hasn’t there been a staggering rise in COVID-19 cases in Sweden? This is not to say that Swedes have ignored warnings of this pandemic. Many have been practicing social distancing and voluntarily undergone quarantine. Sadly, to date, more than half of all coronavirus deaths in Sweden occur in nursing homes.Why are there fewer deaths than expected? Dr. Anders Tegnell, Sweden’s state epidemiologist has reported that Sweden is approaching something the medical community calls herd immunity (or community immunity).This is a condition where so many in Sweden have built up resistance to COVID-19 that the threat is reduced. Herd immunity applies to diseases that are contagious (such as COVID-19). Scientists are discovering—via finding antibodies to COVID-19—that a portion of the population may have already been exposed to this deadly virus. These individuals may have exhibited only mild or no conditions and have become immune, although the duration of this immunity is unknown.This pandemic is fluid and researchers are only beginning to understand the insidious nature of this killer. There is no cure yet, and a vaccine is at least 18 months away. However, we can be thankful that the best and brightest of the medical community are working nonstop to check the spread and cure this viral disease. We ultimately look to God during these challenging times. He is in control.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Sweden’s Herd Immunity | The Institute for Creation Research", "url": "https://www.icr.org/article/sweden-herd-immunity", "type": "website", "description": "Despite criticism from the world medical community, Sweden has taken a more relaxed approach to the COVID-19 threat. It has not initiated a nationwide lockdown and, as of April 15, scientists are starting to see a welcome plateau in coronavirus cases.1 This is a significant development. It is not according to the apocalyptic predictions made by most in the medical community.\r\n\r\nWhat happened? Why hasn’t there been a staggering rise in COVID-19 cases in Sweden? This is not to say that Swedes ha"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.washingtontimes.com/news/2020/apr/15/sweden-coronavirus-rates-easing-despite-loose-rule/"], "authors": [], "publish_date": null}