{"result_id": "171021", "URL": "https://www.icr.org/article/the-low-tech-life-of-green-bank-west-virginia", "timestamp": "2023-04-25 15:40:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/the-low-tech-life-of-green-bank-west-virginia", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "The Low-Tech Life of Green Bank, West Virginia | The Institute for Creation Research", "cleaned_text": "Imagine making plans with your friends—by walking to their house to talk in person. That’s the norm at Green Bank, West Virginia, where its 143 residents can’t rely on their cellphones or tablets to connect with friends and loved ones because all wireless devices are forbidden. …\n\n \n\n In Green Bank, residents rely on landlines to call each other. They can still surf the Web, but must use dial-up or Ethernet cable connections to do so. While many may see the town as a throwback to days of yore, residents point out you can’t miss what you never had.4\n\nLocated within a 13,000-square mile area known as the National Radio Quiet Zone, Green Bank houses the National Radio Astronomy Observatory, which operates the world’s largest radio telescope. “It's the study of the natural radio emissions that are coming from bodies in space,” explained Michael Holstine, the observatory’s business manager.4\n\nStanding 485-feet tall and weighing nearly 17-million pounds, the telescope is so large that a college football stadium could fit inside the dish. It's also incredibly sensitive to electronic interference and, Holstine said, so powerful that it could pick up “the energy given off by a single snowflake hitting the ground.”4\n\nProhibitions on the use of digital cameras, cellphones, fitness tracking devices or any device using blue-tooth technology are still in effect, according to the statement. The observatory asks visitors to leave those devices in their cars or at home.3\n\nThe telescope could pick up such signals “from 13 billion light years away,” he said. But to do so, radio, television and cellphone towers are not allowed. That means no cellphones, iPads, cordless phones, wireless headphones, Bluetooth devices, microwave ovens, remote control toys and even garage door openers, which all send out signals that interfere with the telescope’s work. “In the vicinity of that telescope, they would all completely wipe out the astronomical signal,” Holstine said.4\n\nMany aspects of American life have been stopped, suspended, or at least slowed down in recent times.Yet for Green Bank, West Virginia, a village of less than 150 residents, the townsfolk were already living a low-tech lifestyle. Today journalist Eun Kyung Kim reports:These folks aren’t Amish. The reason they live without technology is because they live by one of the most high-tech operations in America: the National Radio Astronomy Observatory, which operates “the world’s largest radio telescope.”This high-tech enterprise uses a radio telescope that is massive, weighing about 8,500 tons!Yet the national reaction to coronavirus is curtailing (and sometimes canceling) their normal activities—at least through May of this year. The Observatory has canceled several public programs and events, and reduced on-site visitors. However, the telescopic observations continue as usual.But, of course, restrictions against radio-interfering technology devises continues.For the Green Bank radio telescope to do the phenomenal things that it does, better than any other radio telescope in the world, some essential conditions must be satisfied. And that is why cell phones and high-speed cable Internet cannot be part of daily living habits in Green Bank, West Virginia.Surely the proponents of the U.S. Constitution’s Fourth Amendment, who cared to secure American citizens’ privacy rights, would shudder at the intrusive levels of warrantless surveillance that are accumulating in the USA today.However, even in Green Bank, West Virginia, regulatory monitoring has been “normal” for years, apart from the imposition of any ankle bracelets or digital vaccine compliance microchips. In particular, the town’s regulators have “a surveillance truck that acts as a ‘radio police’ to monitor radio frequencies.”But self-guided observatory visits are still permitted. Meanwhile, don’t expect the gift shop, café, or educational programs to be conducting business as usual.All of which reminds us that “business as usual” can change, so we must prioritize honoring the Lord with our daily lives, as we trust Him for the outcomes.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "The Low-Tech Life of Green Bank, West Virginia | The Institute for Creation Research", "url": "https://www.icr.org/article/the-low-tech-life-of-green-bank-west-virginia", "type": "website", "description": "Many aspects of American life have been stopped, suspended, or at least slowed down in recent times.1-3\r\n\r\nYet for Green Bank, West Virginia, a village of less than 150 residents, the townsfolk were already living a low-tech lifestyle. Today journalist Eun Kyung Kim reports:\r\n\r\n\r\n\tImagine making plans with your friends—by walking to their house to talk in person. That’s the norm at Green Bank, West Virginia, where its 143 residents can’t rely on their cellphones or tablets to connect with "}, "tags": [], "tweets": [], "movies": [], "links": ["/bible/1Peter/4/19", "https://www.icr.org/article/balancing-high-risks-learning-from-mountain-goats", "https://www.nytimes.com/2020/03/23/us/politics/trump-coronavirus-restrictions.html", "https://www.wboy.com/news/education/green-bank-observatory-postponing-public-programs-over-health-concerns-related-to-coronavirus/", "https://www.today.com/health/town-lives-without-cell-phones-wi-fi-meet-green-bank-t69911", "https://www.youtube.com/watch?v=TjCZ6k7EzjE", "https://www.icr.org/article/norway-invade-privacy-continuous-tracking", "/bible/Genesis/50/20", "/bible/Revelation/4/11", "https://www.icr.org/article/interrupting-business-as-usual/"], "authors": [], "publish_date": null}