{"result_id": "171019", "URL": "https://www.icr.org/articles/type/9/", "timestamp": "2023-04-25 15:40:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/articles/type/9/", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "The Institute for Creation Research", "cleaned_text": "Despite the moon’s apparently simple shape, uniformitarian scientists have long had great difficulty explaining how it could form by natural processes apart from a supernatural Creator. One Harvard astrophysicist once quipped that the best explanation for the moon’s existence was observational error—the moon doesn’t really exist!1\n\nYet, the moon does exist, and its existence demands an explanation. According to Scripture, God made the moon quickly, perhaps in just seconds or minutes, but certainly in no more than 24 hours (Genesis 1:16-19). Interestingly, in newly published research, conventional scientists are also claiming that the moon formed quickly.\n\nVarious scientific theories about the formation of Earth’s moon have been developed and evaluated over time. Most scientists favor the giant impact theory,2 which postulates that a Mars-size body named Theia impacted a larger “proto” Earth, causing pieces of the Earth’s crust to disperse into space.3 The forces of gravity acting on the dispersed pieces of crust formed a moon around Earth’s elliptical plane.3\n\nThe co-formation theory posits that the Earth and moon were drawn together by gravity when the solar system was first formed.3 The capture theory, however, suggests that the moon was a free body snared by the Earth’s gravity as it passed by.3 By contrast, the condensation theory hypothesizes that the moon formed from gravity acting on dust particles that subsequently condensed into a spherical mass.4 Lastly, per the fission theory, Earth could have formed the moon by spinning the latter off from its surface.4\n\nEven though a spectrum of theories exist, astronomical researchers have identified problems with each based on dynamics (angular momentum), chemical composition, or extremely low probability.5 The giant impact theory predicts that 60% of the moon should consist of material from Theia, but rock samples from the Apollo missions indicate otherwise.3 The co-formation theory is improbable because the moon is much less dense than Earth rather than having the same core elements.3\n\nThe evidence thus does not suggest the moon and Earth were formed in the same way. Further, if the capture theory were true, the moon would probably be irregular in shape rather than a near-perfect round.3 It would likely be akin to a miniature Earth if it had been formed according to the condensation theory.4 The problem again, as with the co-formation theory, is that the moon is much less dense.4\n\nThe fission theory is not likely because Earth could not have spun fast enough to spin off a moon-size fragment.4 In addition, Earth and moon rocks do not contain elements in similar amounts.4 Another issue with the fission theory is that contrary to expectations, the moon does not orbit around Earth’s equator.4 Lastly, the idea of the current angular momentum of Earth with respect to the moon is not supported by theories that involve impact, condensation, or fission.4\n\nWhile hindered by the above issues, moon formation inquiry was recently reinvigorated by research that puts a new “spin” on the collision theory, claiming that the moon may have formed immediately, in a matter of hours, when material from the “proto” Earth and the Mars-size body was launched directly into orbit after the impact.6,7\n\nAlthough this latest version may potentially resolve problems with the traditional collision theory, it is much too early for scientists to claim that they can now explain the moon’s origin. Additionally, it is very likely that additional research will reveal problems with this latest theory that are not now apparent.\n\nBy concluding that the moon was formed quickly, albeit naturalistically, conventional scientists have perhaps unwittingly moved ever so slightly toward the correct answer. Of course, the formation of our moon is no mystery to those who believe the Bible. According to Genesis, the moon was specially created by God in less than 24 hours on Day 4 of the creation week.\n\nThus, the moon’s formation was indeed quick, although it was supernatural—not natural. Supernatural creation is still by far the most reasonable explanation for the moon’s origin.\n• Lissauer, J. J. 1997. It’s not easy to make the Moon. Nature. 389 (6649): 327-328.\n• See Thomas, B. Impact Theory of Moon’s Origin Fails. Creation Science Update. Posted on ICR.org October 28, 2013.\n• Tillman, N. T. and S. Dutfield. How was the moon formed? Space.com. Posted on space.com January 21, 2022,\n• Staham, D. 2018. The Mystery of the Moon. Creation. 40 (4): 53-55.\n• DeYoung, D. B. 1990. The Earth-Moon System. Proceedings of the International Conference on Creationism. 2: 79.\n• Kegerreis, J. A. et al. 2022. Immediate Origin of the Moon as a Post-Impact Satellite. The Astrophysical Journal Letters. 937: L40.\n• Tavares, F. Collision May Have Formed the Moon in Mere Hours, Simulations Reveal. NASA Ames. Posted on nasa.gov October 4, 2022, accessed March 1, 2023.\n\n* Dr. Corrado earned a Ph.D. in Systems Engineering from Colorado State University and a Th.M. from Liberty University. He is a freelance contributor to ICR’s Creation Science Update, works in the nuclear industry, and is a senior officer in the U.S. Naval Reserve.", "opengraph": {"title": "The Institute for Creation Research", "url": "https://www.icr.org/articles/type/9/", "image": "https://www.icr.org/i/ICR-228height.png", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["/bible/Genesis/1/16-19"], "authors": [], "publish_date": null}