{"result_id": "171035", "URL": "https://www.icr.org/article/3947/369", "timestamp": "2023-04-25 15:40:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/3947/369", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Silent Mutations Cripple Viruses | The Institute for Creation Research", "cleaned_text": "New vaccines are being developed that promise to be safer than traditional vaccines, which work by exposing patients to less virulent versions of viruses.1 The new vaccines use a similar process, but are made from broken-down viruses. Just how do researchers “break down” or weaken a virus? They add mutations.\n\nMutations are those rare errors that accumulate as DNA is copied. “Silent” mutations have no major visible effect because they do not result in a change in protein sequence. A sample of normal DNA and another sample of the same DNA with silent mutations will both produce the same protein. However, organisms and viruses have a bias for the normal DNA and against DNA that has certain silent mutations. Therefore, if enough silent mutations accumulate in DNA, the virus’ bias slows protein production, thereby weakening the virus.\n\nIn recent studies, researchers have engineered hundreds of silent mutations into a poliovirus that will be strong enough to train our immune systems, but weak enough to avoid causing disease. In order to get approval to use such altered-virus vaccines, “…researchers will have to show that the wimpy strains can't mutate and cause disease—the big worry with any live-attenuated vaccine. But the fact that so many mutations are involved should minimize chances of this happening, says Mueller,” lead author of a paper on the subject.2\n\nNotice that “many mutations” lead to weaker, less-fit viruses. However, these mutations are not in critical positions, but rather are benign enough to be called “silent.” So if silent mutations can cripple a virus (as these researchers have demonstrated), what could they do to organisms like humans?\n\nIn his book Genetic Entropy and the Mystery of the Genome,3 Dr. John Sanford has calculated the likelihood of nature spontaneously selecting beneficial mutations over non-beneficial (the majority of which are silent). The non-beneficial mutations always far outpace the beneficial, adding up relentlessly generation after generation and eventually leading to a catastrophic population collapse.\n\nResearch indicates clearly that mutations do not lead to evolutionary progress, new functions, or even new information.4 They just lead to weakness, defects, and death. What an encouragement to know that the God of the Bible has revealed that we can be reconciled to Him through Christ.5 For those who believe in Him, death—whether by mutation or any other cause—will not have the final victory.6\n• Coleman, J.R. et al. 2008. Virus Attenuation by Genome-Scale Changes in Codon Pair Bias. Science. 320 (5884): 1784.\n• Enserink, M., ‘Biased’ Viruses Suggest New Vaccine Strategy for Polio and Other Diseases, ibid, 1709.\n• Sanford, J. S. 2005. Genetic Entropy and the Mystery of the Genome. Lima, NY: Ivan Press, 32.\n• “New information” here does not refer to newly-mutated genetic information that leads to decreased fitness when competing with non-mutated organisms, but to the creation of novel genes with specified complexity previously found nowhere in the cell.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Silent Mutations Cripple Viruses | The Institute for Creation Research", "url": "https://www.icr.org/article/3947/369", "type": "website", "description": "New vaccines are being developed that promise to be safer than traditional vaccines, which work by exposing patients to less virulent versions of viruses.1 The new vaccines use a similar process, but are made from broken-down viruses. Just how do researchers “break down” or weaken a virus? They add mutations.\r\nMutations are those rare errors that accumulate as DNA is copied. “Silent” mutations have no major visible effect because they do not result in a change in protein sequence. A samp"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.icr.org/bible/romans/5/10", "http://www.icr.org/bible/revelation/21/4"], "authors": [], "publish_date": null}