{"result_id": "171030", "URL": "https://www.icr.org/article/fish-farming-feeds-scots-but-not-getting-easier", "timestamp": "2023-04-25 15:40:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/fish-farming-feeds-scots-but-not-getting-easier", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Fish Farming Feeds Scots, But It’s Not Getting Easier | The Institute for Creation Research", "cleaned_text": "Fish Farming Feeds Scots, But It’s Not Getting Easier\n\nAll of you [in the aquaculture industry] have played a part: from the fish farmers to the hauliers, from the vets to the processors and from the divers to the wellboat operators and entire supply chain – everybody involved in Scottish aquaculture has shown how important they are, continuing to deliver more than one million healthy meals to people throughout Scotland and the UK, every single day.3\n\nBeyond finance, we are working with key aquaculture representatives to ensure the entire sector remains viable and that there will continue to be highly skilled and well paid jobs once this pandemic ends. …\n\n \n\n I hope this reassures that I and the Scottish Government recognises that you are doing an extremely important job and we will do what we can to support you to continue playing your key role in the supply of food in the weeks and months ahead. …\n\n \n\n [Meanwhile] all businesses and employers [must] change their practices where needed to adhere to the social distancing guidance to keep everyone working in aquaculture safe, to help protect lives, protect the NHS [National Health Service] and stop the spread of the [new] virus.3\n\nWhen was the last time you thanked a fish farmer for tending to coast water net-pens, braving unpleasant weather and workplace hazards, to “farm” aquatic “livestock” such as salmon, trout, or shellfish for your dinner?Fergus Ewing is a Member of the Scottish Parliament, serving as Cabinet Secretary for the Rural Economy and Tourism. Days ago, he publicly thanked the Scottish aquaculture (“fish farming”) industry for their helpful efforts to keep people eating nutritious fare from the sea.The Scottish official’s letter recognized the value of the seafood industry’s aquaculture sector, recognizing its many moving parts and vital logistics:Then the cautionary exhortation followed, reminding the aquaculture workers that great care will be needed in the future, as we all adjust to new realities and new requirements.It’s nice to see an official giving credit where credit is due to those who work in jobs that are often unnoticed and unthanked. But sometimes the compliment is mixed with an admonition to maintain heroic diligence, avoid getting careless, and the need for extraordinary prudence in the future.Like farming on land, fish-farming is no easy business—and it doesn’t look like it will get any easier in the weeks and months to come.Come to think of it, neither is it easy being “fishers of men.”", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Fish Farming Feeds Scots, But It’s Not Getting Easier | The Institute for Creation Research", "url": "https://www.icr.org/article/fish-farming-feeds-scots-but-not-getting-easier", "type": "website", "description": "When was the last time you thanked a fish farmer for tending to coast water net-pens, braving unpleasant weather and workplace hazards, to “farm” aquatic “livestock” such as salmon, trout, or shellfish for your dinner?1\r\n\r\nFergus Ewing is a Member of the Scottish Parliament, serving as Cabinet Secretary for the Rural Economy and Tourism. Days ago, he publicly thanked the Scottish aquaculture (“fish farming”) industry for their helpful efforts to keep people eating nutritious fare fro"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.icr.org/article/fulfilling-genesis-mandate-while-helping", "https://thefishsite.com/articles/tribute-paid-to-scotlands-million-meal-aquaculture-sector", "https://blogs.gov.scot/marine-scotland/2020/04/08/covid-19-letter-of-support-for-the-aquaculture-industry/", "https://www.icr.org/article/moon-rules", "https://vigilantcitizen.com/latestnews/bill-gates-calls-for-a-digital-certificate-to-identify-who-is-vaccinated/"], "authors": [], "publish_date": null}