{"result_id": "171001", "URL": "https://www.icr.org/article/inspired-guesses-creative-imagination-science", "timestamp": "2023-04-25 15:39:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/inspired-guesses-creative-imagination-science", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Inspired Guesses, Creative Imagination, and Science | The Institute for Creation Research", "cleaned_text": "Although the evolutionary community would have the public believe the above statement, there is \"a great gulf fixed\" between evolution and the facts of science. How could such a wide chasm be spanned? Only by using one's imagination. More and more, macroevolution is seen as Dryden pens in the Dedication of King Arthur, \"that fairy kind of writing which depends only upon the force of imagination.\"\n\nReal science \" ... is an interconnected series of concepts and conceptual schemes that have developed as a result of experimentation and observations\" (Dr. James B. Conant, former president of Harvard). The Harper Encyclopedia of Science describes the scientific method as \" ... techniques of controlled observation employed in the search for knowledge.\" In other words, science is knowledge obtained primarily through observation, not speculation or imagination.\n\nWith this in mind, consider the following quotes from various evolutionary publications. Regarding the origin of life, the late Isaac Asimov stated:\n\n\"Inspired guesses\" are not science; rather they are the use of one's imagination. Moving up the theoretical evolutionary ladder, imagination greets us at each rung.\n\nWebster's New World Dictionary defines \"imagination\" as \"the act or power of forming mental images of what is not present\" [my emphasis]. Indeed, the process of evolution itself is grounded in that which is not present.\n\nThink of what the evolutionary community would say if creationists ever appealed to \"creative imagination\" in their literature! To those who erroneously see mutations (genetic mistakes) as an explanatory cause of evolution, the late Dr. Pierre Grassé, France's leading zoologist, cautioned in his book, \"There is no law against day-dreaming, but science must not indulge in it\" (Evolution of Living Organisms, 1977, p. 103).\n\nPaleontologists have long been troubled with the abrupt appearance of fish in the fossil record. In explaining how one group of fish begot another, evolutionist Barbara J. Stahl mentions how two evolutionists deal with the absence of physical evidence.\n\nEvolutionary publications are full of similar exercises in imagination. Another example would be the mammal-like reptile \"progression.\" Author Philip Johnson says, \"An artificial line of descent can be constructed, but only by arbitrarily mixing specimens from different subgroups, and by arranging them out of their actual chronological sequence\" (Darwin on Trial, 1993, p. 79). Such scenarios must be presented for the simple reason that the fossil record stubbornly fails to cooperate in producing tangible evidence for evolutionary suppositions.\n\nBecause whales, dolphins, and porpoises are mammals, evolutionists are forced to speculate that they evolved from even-toed land mammals such as cattle, pigs, or buffalo many millions of years ago. Hence, V.B. Scheffer, writing in National Geographic (vol. 50), relates the following imaginative tale:\n\nSome researchers claim that links have been found between marine mammals and land mammals (i.e., Basilosaurus), but these, like the previous quote, are highly speculative.\n\nAnother field requiring considerable imagination is human evolution, spanning, as evolutionist Ian Tattersall says, five million poorly known years or more (The Fossil Trail, 1995, p. 246).\n\nIn Ayala and Valentine's text, Evolving (1979), figure 12.7 states: \"Many elements of the phylogeny [of the hominoids] are conjectural owing to the paucity of the fossil remains.\" Conjecture means guesswork or even fantasy. Things haven't changed much since the publication of this book. Sylvia S. Mader states in her Biology text (1998), \" ... it is believed that the last common ancestor of the African apes and hominids (family Hominidae) lived during the Pliocene epoch. Unfortunately, this common ancestor has not yet been found\" (p.353).\n\nPaleoanthropologist Robert Blumenschine of Rutgers University said in a U.S. News and World Report cover story (1989): \"The real question is whether we have enough imagination to reconstruct their lives\" (the lives of early humans). Michael Lemonick of Time concurs, saying in his article, \"How Man Began\" (1994): \"The only certainty in this data-poor, imagination-rich, endlessly fascinating field is that there are plenty of surprises left to come.\"\n\nIn a letter published by USA Today, David A. Frenz says in regards to human evolution: \"This strange fiction issuing from the sands of Africa makes one thankful that these scientists avoided other careers of consequence. That they did not apply their energies to creating vaccines or structural members for high-rise buildings is a lucky stroke for society. Imagination in these cases is never an acceptable substitute for empirical results.\" But today, human evolution is still in the grips of imagination. On page 353 of Biology (1998), Mader states:\n\nWell, yes, one can imagine, but is this science? Indeed, one can only agree with John Horgan who said in his 1996 book, The End of Science, \"No matter how far empirical science goes, our imaginations can always go further\" (p. 30). People eventually arising from flatworms is an example of such a Herculean stretch of the imagination, but it totally lacks in scientific verification.\n\nIn Romans 1:21-28, Paul describes the terrible condition of the ancient world as they rejected their former knowledge of the one true God: \"Because that, when they knew God, they glorified Him not as God, neither were thankful; but became vain in their imaginations, and their foolish heart was darkened\" (v.21).\n\nThis description fits today as well, exemplified by arrogant evolutionists, assuming reconstructions of animals and hominids springing from lower forms of life; which in turn are shown coming from primal, inanimate elements in a most unscientific and imaginative manner.\n\nWhat is a responsible, fact-finding reader to do? Christians should first be alert to ambiguous language and artful renditions as we read secular literature, view cable channels, or browse natural history museums. Decide what is presented as scientific (observed) evidence and what is mere speculation.\n\nBe critical of alleged \"missing links\" and \"transitional forms.\" Ask, What is this evidence actually based on? Where does science stop and imagination begin?\n\nDraw conclusions from that which is observed rather than treating \"day-dreaming,\" \"inspired guesses,\" and \"creative imagination\" as scientific fact.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Inspired Guesses, Creative Imagination, and Science | The Institute for Creation Research", "url": "https://www.icr.org/article/inspired-guesses-creative-imagination-science", "type": "website", "description": "The first point to make about Darwin's theory is that it is no longer a theory, but a fact\" (Julian Huxley, Issues in Evolution, p. 41). \r\nAlthough the evolutionary community would have the public believe the above statement, there is \"a great gulf fixed\" between evolution and the facts of science. How could such a wide chasm be spanned? Only by using one's imagination. More and more, macroevolution is seen as Dryden pens in the Dedication of King Arthur, \"that fairy kind of writing which depend"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}