{"result_id": "171028", "URL": "https://www.icr.org/mutation-buildup", "timestamp": "2023-04-25 15:40:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/mutation-buildup", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Mutational Buildup Indicates Living Populations Are Young | The Institute for Creation Research", "cleaned_text": "Mutations are copy errors that degrade the information contained in DNA, which carries vital instructions for the maintenance and reproduction of cellular life. All creatures experience mutations. Very rarely, a mutational error can help some individuals in a population survive in an unusual environment. A mutation can cause disease or death, but the vast majority of mutations have no effect on the organism. Since they are too subtle to cause a difference in any trait, no process can detect them. Even \"natural selection\" is incapable of detecting them. Therefore, these nearly neutral mutations build up relentlessly.\n\nEventually, the accumulating mutations will damage vital systems and cause \"mutational meltdown,\" which leads to extinction. The buildup of mutations is accelerated by small population sizes, making recovery difficult or impossible. For example, conservationists must carefully breed pandas, giant salamanders, Tasmanian devils, Bengal tigers, and many more endangered creatures with others of their kinds that have the fewest mutations. But this only delays the inevitable.\n\nIt has been calculated that with 100 mutations per 20-year generation, the human genome would not last much longer than 500 generations. Because mutational buildup acts as a clock ticking down toward extinction, and because so many animals have yet to reach that point, this is strong evidence that life on earth is only thousands, not millions, of years old.", "opengraph": {"title": "Mutational Buildup Indicates Living Populations Are Young | The Institute for Creation Research", "url": "https://www.icr.org/mutation-buildup", "image": "https://www.icr.org/i/ICR-228height.png", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}