{"result_id": "171011", "URL": "https://www.icr.org/article/the-good-in-a-season-of-waiting", "timestamp": "2023-04-25 15:40:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/the-good-in-a-season-of-waiting", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "The Good in a Season of Waiting | The Institute for Creation Research", "cleaned_text": "The Good in a Season of Waiting\n\nWe’re halfway through the year, and in some ways it feels like we’ve been stuck for months. We’ve all spent a lot of time waiting. Waiting for COVID-19 to pass, for isolation to end. Waiting for treatments that work, a vaccine, or even a cure. Waiting for the economy to open back up and for a sense of normalcy to return.\n\nWaiting isn’t always a bad thing. Many of us had opportunities to build relationships, fix things around the house, and even catch up on sleep. We revisited old hobbies, learned some new skills (Zoom, anyone?), did some research, and brushed away the cobwebs that had dulled our creativity through years of following predictable routines. Inspired by the unique challenges, we even became more efficient in our daily jobs. Is it possible that a season of waiting can offer a subtle form of progress?\n\nDuring this time-out from life as we knew it, the ICR staff continued to do our work, many of us doing the writing, research, and interviews while working remotely from home. We were even able to develop innovative ways to continue getting the creation message to you. As this month’s article “ICR Events: Same Message, New Methods” notes, “When coronavirus shutdowns caused the cancellation of ICR’s scheduled events, our ministry had to rapidly change strategies for getting the biblical creation message to people without anyone leaving their homes….Our events, communications, and science teams were able to join forces to meet this challenge, and we’re all giving thanks to the Lord for making it a great success.” Read the rest of the article to discover how this unique time of waiting surprisingly led to some significant progress in our ministry.\n\nIn this issue of Acts & Facts, you’ll see that our scientists have continued to make progress as they research the latest developments in science and creation discoveries, and we share their findings with you in these pages. Over the past months we’ve also provided many of their findings through our news articles posted several times each day on ICR.org.\n\nDuring the wait, we’ve also had time to reflect. What lessons did we learn that we can take with us as we move forward? I personally want to avoid jumping right back into the hurried schedule I used to keep. Even when I once again have the freedom to come and go as I please, I want to take time to rest and meditate on the things of the Lord. While we were socially distant from others, we had an invitation to draw close to God. And I want that closeness to remain.\n\nSometimes the good that can come from a season of waiting is not always so clear. Instead of seeing progress in your home, work, ministry, or relationships in this difficult time, you may have experienced loss of a business, a job, or a loved one. You are still waiting for the clouds to part and the sun to shine again. It may have stirred an even greater longing in your heart as you wait for the return of the Lord, who will one day make all things new. In your time of waiting, God offers help, hope, and strength (Psalm 33:20; 39:7; 27:14).\n\nPerhaps the greatest lesson to be learned is that waiting doesn’t have to mean that nothing is happening. God is always at work, even when it seems our world has come to a standstill. So, the next time we encounter the need to wait (and it’s only a matter of time), we can remember that what feels like being stuck can actually position us to move forward with greater purpose and progress.\n\n* Jayme Durant is Director of Communications at the Institute for Creation Research.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "The Good in a Season of Waiting | The Institute for Creation Research", "url": "https://www.icr.org/article/the-good-in-a-season-of-waiting", "type": "website", "description": "\r\n\tWe’re halfway through the year, and in some ways it feels like we’ve been stuck for months. We’ve all spent a lot of time waiting. Waiting for COVID-19 to pass, for isolation to end. Waiting for treatments that work, a vaccine, or even a cure. Waiting for the economy to open back up and for a sense of normalcy to return.\r\n\r\n\tWaiting isn’t always a bad thing. Many of us had opportunities to build relationships, fix things around the house, and even catch up on sleep. We revisited old h"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.icr.org/article/12211", "https://www.icr.org/i/pdf/af/af2007.pdf", "https://www.icr.org/articles/search/?f_typeID=9", "/bible/Psalm/33/20"], "authors": [], "publish_date": null}