{"result_id": "171004", "URL": "https://www.icr.org/article/4590/", "timestamp": "2023-04-25 15:40:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.icr.org/sites/all/themes/ICR_Newsroom/favicon.ico", "canonical": "https://www.icr.org/article/4590/", "encoding": "utf-8"}, "image": null, "domain": "www.icr.org", "title": "Consensus Science: The Rise of a Scientific Elite | The Institute for Creation Research", "cleaned_text": "In battle, one clever military tactic is to focus enemy troops' attention on a spectacular frontal assault so they will overlook a deadly side attack. This approach works in other arenas, as well.\n\nOn March 9, President Barack Obama ordered that federal tax money be used to promote medical research through harvesting the stem cells of, and thus destroying, human embryos. There has been much discussion about the medical ethics of this order and the government's increased power to destroy human life for \"scientific\" progress,1 but in reality these debates, while important, drew attention away from a serious analysis of the words of the president's speech.2 His order was actually a directive for \"restoring scientific integrity,\" and stem cells served as the needed pretext.\n\nThe full speech provides evidence that Mr. Obama's words were carefully selected to exploit the accelerating drift of the scientific community's upper echelons from determining \"scientific validity\" based on rigorous observation and experiment, to basing it on consensus authority. Thus, preserving \"scientific integrity\" would not mean keeping the scientific process from going awry, but keeping scientific outcomes in line with policy.\n\nHow? By empowering an atheist scientific elite who will decree--without debate and by consensus opinion only--the scientific validity of all bioethical issues, not just the killing of embryos for research. In doing this, Mr. Obama has capitalized on two trends in the scientific community: the rise of \"consensus science,\" and the dominance of atheism among the scientific elite.\n\nThe collective opinion of scientists in a particular field on topics where there is general agreement is called the \"consensus\" of those scientists. A consensus can range from scientific areas that are well supported by experiments, all the way down to areas where nothing has been established. Rarely are appeals to scientific consensus used in areas where experimental evidence is strong, but they are often favored on subjects where the science is weak to nonexistent (such as the reality of extraterrestrials or parallel universes) and, especially, on divisive social issues that need scientific input. Scientifically speaking, a serious problem arises when advocates wield \"scientific consensus\" as if it were a valid scientific argument that carries the same weight as experimentally-derived evidence--a practice derisively called \"science by consensus\" or \"consensus science.\"\n\nA recent Acts & Facts article discussed an early example of consensus science in which a powerful consensus used several methods to secure international acceptance of a horrific notion with virtually no scientific support--eugenics.3 These methods are still effective in establishing a scientific consensus:\n• New scientific journals are created and major peer-reviewed science journals serve as forums for an incestuous style of peer review and intellectual discussion.4\n• Faculty members of prominent universities are raised to celebrity status and their opinions promoted as those of science’s most progressive thinkers.\n• International conferences are held with speakers and select attendees chosen to present a unified body of scientific thought.\n• Supporters are given high academic honors while dissenters are marginalized.\n\nThese actions can bestow overwhelming scientific respectability on even scientifically empty concepts. In addition, rank-and-file scientists may find themselves under such tremendous pressure to conform that many of them yield despite their better judgment. University of Alabama Professor John Christy stated regarding climate change debates:\n\nThe acceptance of views with little supporting data is bad, but the pressure to not be thought of as a scientific outsider can push scientists to be overconfident in the published findings of others. In his report on why scientists commit fraud and why other scientists are fooled by it, science writer William Allman said: \n\n\n\nNicolas Wade, a researcher on scientific fraud, adds, \"Scientists are trained to believe that research is an entirely objective process....That makes them all the more vulnerable to people who deceive, because they don't have their guard up.\"7 Ideally, scientific results should be experimentally verified, but as a practical matter this rarely happens, as Sharon Begley observed: \"Unfortunately, although the ability to replicate results is one of science's strongest defenses against fraud, few experiments are repeated exactly....As a result, fudged data that conform to prevailing scientific wisdom...can easily slip into print.\"8\n\nScientists' limited expertise to raise valid questions outside their specialty, dependence on collaboration, naïve trust, and limited resources to reproduce experiments are all longstanding problems in the day-to-day operation of science. Advocates of consensus science capitalize on exploiting these problems, not working to fix them.\n\nSome scientists, of course, do question the prevailing wisdom of \"anointed authorities\" and are usually met head-on by the consensus authority--but not in a laboratory. For example, in 1993 early critics of the man-made global warming consensus were called before congressional subcommittees, \"setup\" to look foolish, \"flayed,\" \"hammered,\" and then either got the consensus authorities' message to shut up or \"got the ax\" (i.e., were fired) for being \"philosophically out of tune.\"9 The proper forums for scientific debate are science labs and the literature. The real purpose of such intimidating treatment is always to end debate.\n\nIllustrating classic consensus authoritarianism, in 1993 Mr. Al Gore said of global warming that there is \"no longer any doubt worthy of recognition\" and \"only a few odd scientists\" doubt the consensus.9 When asked again in 2009 about the scientific validity of his opinion, he said, \"The scientific community has gone through this chapter and verse....It's not a matter of theory or conjecture.\" He added that it's \"kind of silly\" to keep debating the science and that \"the debate is over.\"10 Using the power of consensus science and a relentless media campaign, any hypothesis can be established as fact and few scientists will dare criticize the actual scientific underpinnings--thus, the debate is over.\n\nThe Dominance of Atheism among the Scientific Elite\n\nWhen debate ends, the bias and prejudice of only one side will prevail even in the ranks of \"objective\" scientists. Candidly describing fellow scientists, the late Stephen Jay Gould of Harvard said, \"Our [scientists'] ways of learning about the world are strongly influenced by the social preconceptions and biased modes of thinking that each scientist must apply to any problem. The stereotype of a fully rational and objective 'scientific method,' with individual scientists as logical and interchangeable robots, is self-serving mythology.\"11\n\nDoes Mr. Obama think that the experts he wants Americans to \"listen to\" will rise above their own prejudices where other mortal scientists have failed? Can they really be neutral toward God? Scientific studies suggest they cannot. The percentage of atheists is highest among members of the National Academy of Sciences and other elite scientific policy-making groups, with only 7 percent believing in God.12 University faculty are self-identified as atheist over five times more (even higher among scientists) than the general public; believe religion is less important and attend religious services less; and have positive feelings toward atheists, but have negative feeling for only one religious group--evangelical Christians.13\n\nElite scientists promote their indomitable belief that science offers the greatest and only hope for mankind. It is disingenuous for the president to claim that he would \"appoint scientific advisors based on their credentials and experience, not their politics or ideology\" when he clearly knows that his emphasis on \"scientific integrity\" will be governed by atheists. When he now says scientists will make policy \"free from manipulation or coercion,\" he knows this will lead to a total break from Christian moral restraints.\n\nWhat \"Listen to the Experts\" Really Means\n\nBased on this policy, the president made plain the actions he expects people to take: \"letting scientists like those here today do their jobs, free from manipulation or coercion, and listening to what they tell us, even when it's inconvenient.\"2 In context, \"listening to what they tell us\" means more than paying attention or seeking to understand--it means obeying what is said. It is much clearer now that what Mr. Obama meant when he said he would \"restore science to its rightful place\" in his inaugural speech was really unchallengeable dominance of an amoral scientific elite over the public and any dissenting scientific views.\n\nThis is in keeping with what many elite scientists deeply believe, as reflected in the Scientific American article \"Scientists Know Better Than You--Even When They're Wrong.\"14 In it, science sociologist Harry Collins illustrated the \"hubris\" of ordinary people questioning scientists: \"Parents believe that even though doctors assure them that vaccines are safe, those doctors may be wrong. Therefore, the parents think they are entitled to throw their own judgment into the mix.\" Will parents remain entitled to their own judgment once science is fully restored to its \"rightful\" place?\n\nThis tyranny of the experts is not just a future possibility. In January, the Texas State Board of Education debated whether the teaching of evolution's weaknesses should be retained in Texas public schools' science curriculum. Board members who sided against teaching weaknesses \"cited the need to respect the work of the experts, according to the [Dallas] Morning News, with Mary Helen Berlanga commenting, 'We need to stay with our experts and respect what they have requested us to do'….Similarly, Rick Agosto was quoted in the San Antonio Express-News (January 23, 2009) as saying, 'I have to consider the experts.' \"15 Even public officials who lack the proper credentials must submit to the judgment of elite scientists and show proper deference to their greater knowledge.\n\nHow can someone combat a scientific system that favors the few, the powerful, the elite? First, when confronted with policies based on the \"scientific consensus,\" point out that \"consensus\" is not a valid scientific argument. It reintroduces bias into science and has always been used when the underlying evidence is weak. Urge a return to science based on experiments and observations.\n\nSecond, remember the atheistic bias of elite scientists and maintain a healthy skepticism of their opinions--particularly on broad social policies and medical ethics. In some instances the same people who decide what is data are the ones who gather the data, analyze the data, and then interpret the results into policy. For this reason, people need a healthy distrust of the experts. Back in 1982, even Gould warned:\n\nThird, support those groups that maintain independent oversight and review. The Institute for Creation Research is one such group. It receives no governmental, educational, or industrial funding--but ICR continues to expose the scientific weaknesses of naturalistic science.\n\nWhy did Mr. Obama choose the language he did in making his embryonic stem cell decision? Clearly, not so much for the research value of embryonic stem cells. The real goal is in due course to empower a \"credentialed and experienced\" scientific elite \"restored to their rightful place\" that come to a \"consensus\" of what is scientifically acceptable and make citizens \"listen to what they tell us.\" With that kind of power, death to embryos is just the first step. Who knows where it will end?\n• Mitchell, T. The Debate Over Stem Cells. Posted on answersingenesis.org on March 11, 2009; and Human Stem Cell Research and Use. Christian Medical and Dental Associations. Posted on cmda.org.\n• The entirety of President Obama's speech on March 9, 2009, may be read on the White House website at whitehouse.gov.\n• An incestuous style of peer review means that journals select authors and referees who are not blind to one another to review each other's work. The referees deliberately reject journal-worthy dissenting manuscripts, and like-minded consultants are named as the journal's peer-reviewers. See Garfield, E. 1988. Religion, Rebel Scientists, and Peer Review: Three Hot Topics. The Scientist. 2 (24): 10; Higgs, R. Peer Review, Publication in Top Journals, Scientific Consensus, and So Forth. Liberty & Power: Group Blog. George Mason University's History News Network, May 7, 2007; Begley, S. Whitewashing Toxic Chemicals. Newsweek, May 12, 2008.\n• Christy, J. No consensus on IPCC's level of ignorance. BBC News. Posted on news.bbc.co.uk November 13, 2007.\n• Allman, W. Cooking the Paleontological Books? U.S. News & World Report, May 8, 1989, 61.\n• Broad, W. and N. Wade. 1983. Betrayers of the Truth. New York: Touchstone Books, as quoted in Allman, Cooking the Paleontological Books?\n• Gould, S. J. 1994. In the Mind of the Beholder. Natural History. 103 (2): 15.\n• Tobin, G. A. and A. K. Weinberg. 2007. Profiles of the American University, Volume II: Religious Beliefs and Behavior of College Faculty. San Francisco, CA: Institute for Jewish & Community Research. See also Klein, D. B. and C. Stern. 2005. Professors and Their Politics: The Policy Views of Social Scientists. Critical Review. 17 (3-4): 257; Cardiff, C. F. and D. B. Klein. 2005. Faculty Partisan Affi liations in All Disciplines: A Voter Registration Study. Critical Review. 17 (3-4): 237; Rothman, S., S. R. Lichter and N. Nevitte. 2005. Politics and Professional Advancement among College Faculty. The Forum. 3 (1): article 2.\n• Minkel, J. R. Scientists Know Better Than You--Even When They're Wrong: Why fallible expertise trumps armchair science--a Q&A with sociologist of science Harry Collins. Scientific American, May 9, 2008.\n• Victory over \"weaknesses\" in Texas. National Center for Science Education news release, January 26, 2009.\n• Gould, S. J. How Science Changes with the Political Climate. U.S. News & World Report, March 1, 1982, 62\n\nCite this article: Guliuzza, R. 2009. Consensus Science: The Rise of a Scientific Elite. Acts & Facts. 38 (5): 4.", "opengraph": {"image": "https://www.icr.org/i/ICR-228height.png", "title": "Consensus Science: The Rise of a Scientific Elite | The Institute for Creation Research", "url": "https://www.icr.org/article/4590/", "type": "website", "description": "In battle, one clever military tactic is to focus enemy troops' attention on a spectacular frontal assault so they will overlook a deadly side attack. This approach works in other arenas, as well.\r\nOn March 9, President Barack Obama ordered that federal tax money be used to promote medical research through harvesting the stem cells of, and thus destroying, human embryos. There has been much discussion about the medical ethics of this order and the government's increased power to destroy human li"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.answersingenesis.org/articles/2009/03/11/debate-over-stem-cells", "http://www.cmda.org/AM/Template.cfm?Section=Stem_Cell_Research&TEMPLATE=/CM/ContentDisplay.cfm&CONTENTID=3909", "http://www.whitehouse.gov/the_press_office/Remarks-of-the-President-As-Prepared-for-Delivery-Signing-of-Stem-Cell-Executive-Order-and-Scientific-Integrity-Presidential-Memorandum/", "http://www.icr.org/article/darwinian-medicine-prescription-for-failure/", "http://hnn.us/blogs/entries/38532.html", "http://news.bbc.co.uk/2/hi/science/nature/7081331.stm", "http://blogs.wsj.com/environmentalcapital/2009/03/05/a-heated-exchange-al-gore-confronts-his-critics/", "http://www.sciam.com/article.cfm?id=scientists-know-better-than-you", "http://ncseweb.org/news/2009/01/victory-over-weaknesses-texas-004236"], "authors": [], "publish_date": null}