{"result_id": "172005", "URL": "https://responsibletechnology.org/jeffreys-take-was-covid-19-genetically-engineered/", "timestamp": "2023-04-25 15:40:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://responsibletechnology.org/wp-content/uploads/2022/10/cropped-IRT-Favicon-512-32x32.jpg", "canonical": "https://responsibletechnology.org/jeffreys-take-was-covid-19-genetically-engineered/", "encoding": "UTF-8"}, "image": null, "domain": "responsibletechnology.org", "title": "Jeffrey's Take: Was COVID-19 Genetically Engineered?", "cleaned_text": "Was the Covid-19 pandemic from a genetically engineered virus or a natural one? I have amassed a bunch of information from various sources to report on what we know and it’s pretty damning.\n\nI’m going to present evidence suggesting that the SARS CoV-2 was specifically genetically engineered according to some sources. Even the strains of natural viruses that were used as the basis, according to this hypothesis. We’re going to talk about the lab that is likely to have done the genetic engineering and a person who may have committed fraud to cover up the lab based origins of the virus. We’ll also talk about the current state of safety of genetically engineered viruses and those that are not genetically engineered, but currently being experimented with in laboratories around the world and how this presents us with the possibility of future pandemics, possibly with greater damage than this one, unless we make a change. We’re going to spend a lot of time on this and it’s actually quite an interesting story.\n\nThe first concept we’ve heard is that there was a wet market selling bats and other animals and that that’s the source of the virus that jumped from the animals to the humans. However, the Washington Post points out that this story is kind of shaky. In fact, the first known patient to get the virus never visited the market and about one third of the first cluster also had no connection to it. The national security officials have long suspected that either the Wuhan Institute of Virology or the Wuhan Center for Disease Control and Prevention was the source of the outbreak according to the Washington Post. They said that US officials who visited the Wuhan Institute of Virology dispatched two diplomatic cables that warned about the safety and management weaknesses at the lab and warned that the labs work on bat Coronaviruses and their potential human transmission represented a risk of a new SARS like pandemic. They were actually warning us about this possibility before it happened.\n\nThe US Defense Intelligence Agency updated its assessment about the origin of the novel coronavirus in a report dated on the 27th of March. It suggested that the Coronavirus might have been released from an infectious disease lab. There are wet markets all over China and all over Asia. Isn’t it remarkable that this virus happened to leap from animal to human at a wet market that was next to two labs? Jonathan Latham speaks to Ian Masters in this interview and he says, “It’s an amazing coincidence”. There’s another thing you didn’t know, which is that there’s another virology lab, which is just 300 meters from the wet market and they supposedly have done Coronavirus research.\n\nYou’ve got two labs in Wuhan, and one is the BS2 or the Biosafety Level Two, which is actually 280 meters from the wet market and another one that’s 10 kilometers, which has been at Level Four and the Level Four lab has the world’s biggest collection of bat Coronaviruses, including the one that’s most closely related to the outbreak. Is it possible it’s a coincidence? Well, you can decide. Let’s give some more information.\n\nIt’s interesting that those research projects were partially funded by the US National Institute for Allergy and Infectious Disease and the National Institutes of Health. 3.7 million dollars over six years for research that included Gain of Function, which seeks to make deadly pathogens deadlier, including making pathogens airborne that were previously not and altering them to be better adapted to new hosts. That’s an interesting Gain of Function, which we’ll come back to. Another 3.7 million for a five year project, totaling 7.4 million, some of which ended in 2019 because of the outcry. It’s interesting that one of those institutes is led by Dr. Anthony Fauci who you’ve seen in the news talking about Coronavirus strategy.\n\nDr. Toby Roberts at the Children’s Health Defense Team points out that there’s a history of dangerous studies from the Wuhan Institute of Virology. In 2007, they combined SARs like virus from bats with Human Immunodeficiency Virus (HIV) and created a virus capable of infecting human cells. In 2015, they took a bat virus similar to SARS, constructed a virus that could infect mice, discovered that the virus could also affect human airway cells and they found that existing treatments for SARS were ineffective in preventing or killing this new virus. This is beginning to sound familiar. The research they were doing was not necessarily for bio-weapons development, it was supposedly to help develop vaccines and therapeutics. I’m not going to take a position on that, but many scientists have been fiercely critical of the need to develop vaccines and therapeutics in such a dangerous and high risk manner, because many argue that you don’t actually get substantial help in developing the vaccines, you end up threatening the entire planet with an accidental release.\n\nThere was an article on March 17th in Nature Medicine arguing that the virus could not have been genetically engineered. Many scientists have come out against this article. Let me explain their logic.\n\nThere were two arguments in the Nature Medicine article:\n\nOne was that the way the virus was genetically engineered to bind to the human cell (the ACE-2 receptor), did not match the ideal manner that had been predicted in the computer that was being referred to by the authors of this study. They said because they did identify (according to the computer) an ideal amino acid sequence or protein for the ACE-2 receptor and since the SARS CoV-2 virus was not the same one that their computer model said would have been ideal, that it couldn’t have been genetically engineered. Geneticist Dr. Michael Antonio said that first of all, computers are not the be all and end all, they don’t take into account the complexity of real world experimental systems. It’s not a definitive model if you use just the computer and that there could be ways to expose the virus to living organisms to see what actually works in reality. The concept that “it simply didn’t match the person’s predicted ideal scenario by computer modeling” was not a sufficient argument to completely dismiss the possibility that the virus was genetically engineered. It was a weak argument.\n\nThere’s a second concept that was also weak. The Nature Medicine article assumes that the only way to genetically engineer a virus is to take an already known virus and engineer it. They looked for evidence of an already known virus and they said, “Genetic data irrefutably showed that SARS CoV-2 is not derived from any previously used virus backbone.” However, as Dr. Antonio and others pointed out, you don’t need to use a previously used virus backbone. There’re many ways to create a virus. For example, something’s called Directed Evolutionary Selection Process. Basically you just engineer a number of different randomly mutated versions, put it next to the receptor binding domain of a human, let them fight it out, see which one comes out best and that one can show the high infectivity of human cells. Was this an obscure concept? No, actually the inventors of these processes were awarded the Nobel Prize in chemistry in 2018, so it is very unlikely that the authors of this study were unaware of it.\n\nIt’s also true that a Swiss team was able to create a synthetic clone of SARS CoV-2 in less than a month. So the concept that Nature Medicine has conclusively determined that it’s not genetically engineered is more than suspect. Many scientists have come out against that strong and sweeping conclusion.\n\nThere are other ways to create something like a SARS CoV-2 in a laboratory without using genetic engineering. Although genetic engineering speeds it up, so the motivation for doing it a natural way wouldn’t be as strong.\n\nWhy would Nature Medicine allow this faulty argument to go forward? I’ve seen many faulty arguments go forward in favor of genetic engineering that completely overlooked peer reviewed, published studies, even well-known effects claiming that it’s safe. There were often financial incentives to paint the picture of safety. One of the authors of the Nature Medicine piece, Robert Gary, lists his competing interests as being co-founder of Zalgen Labs. That’s a company that develops counter-measures for emerging viruses. So, if there was a backlash on genetic engineering, laboratory viruses as a result of discovering that the pandemic came from a GMO, it might be counter to the interests of Robert Gary and Zalgen Labs. It’s an example of how the author might have a conflict of interest and certainly the journal may have a conflict of interest as well.\n\nClaire Robinson reports in a beautiful article in GM watch, summarizing a blog at Nerd has Power. She describes how an anonymous scientist published an incredibly detailed argument that the SARS CoV-2 was genetically engineered and it goes into great detail and I’m going to share some of that now.\n\nHe argues that a particular bat Coronavirus (SARS CoV-2) is claimed to have naturally emerged from, what is called RATGI3. We’re going to call that Rat Bat. “R-A-T” is the first three letters and it’s supposed to come from a bat, so we’ll call it Rat Bat. He’s saying that’s a total fabrication and it was placed into the literature to get those responsible off the hook. Who? He specifically names the director of the Wuhan Institute of Virology in China, Shi Zhengli. Shi, jokingly referred to by the media as “the batwoman,” because she collects bat viruses from the wild and then applies her Gain of Function research, making it more effective and more dangerous.\n\nThe anonymous author (there’s a lot of reasons why someone trying to pose the theory that this was genetically engineered in great detail would want to be anonymous) let the science speak for itself. He said that the natural origin story of the SARS CoV-2 relies on the single piece of evidence of the Rat Bat; that the Rat Bat looks like a close cousin of SARS CoV-2; they’re 96% identical when you look at the whole sequence; and if Rat Bat was a natural virus, then the SARS CoV-2 is very likely to come from nature because it shares a common ancestor and it’s been argued that the virus arose by a mutation of Rat Bat. There’s one major problem according to this anonymous source: Rat Bat virus isn’t real. It doesn’t exist as a live sample, only as a sequence of letters in a computer, which was uploaded in a public database in January of this year, after the Covid19 outbreak. And the major suspect in the fabrication is “Batwoman,” which is Shi Zhengli.\n\nHere’s the argument as to why this is not not true. (This is going to get a little technical, but I’m going to make it simple). Evolution occurs in viruses through mutations. Oftentimes there’s a single change along the DNA or RNA, just a single substitution. And as you may know, DNA or RNA ultimately produce amino acids, which can form proteins. Sometimes the changes in the single nucleotide or the single code of the DNA or RNA will change the code. But the resulting amino acid will be absolutely the same. It won’t have an effect. That’s called a synonymous mutation, meaning the mutation has occurred, but there is no change in the outcome because the amino acid is the same.\n\nSometimes there’s a change in the sequence and you end up with a non-synonymous mutation, so the amino acid is different. When there’s a natural evolution (for reasons I’m not going to describe here), there’s a ratio between the number of synonymous mutations and non-synonymous mutations and that is 5:1. In other words, under normal circumstances, there should be five times the number of mutations that don’t change the amino acids compared to the one that does.\n\nIf we look at two native bat Coronaviruses which Shi has identified, they’re called ZC45 and ZX321. We’ll call them the twins. Everything goes as predicted. They’re related and the ratio between the number of synonymous mutations and non-anatomies mutations is 5\n\nSo one could have been derived from another and it followed the rules. However, a comparison between SARS CoV-2 and the Rat Bat virus shows a pattern that’s completely inconsistent in a section of the virus. The mutation ratio is not 5:1, but it’s 44:1. This is very suspect and it’s suspect along a very specific part of the genome. It shows that if they were related (SARS CoV-2, which was responsible for the pandemic and the Rat Bat sequence), that somehow the laws of nature were violated to get from Rat Bat to SARS CoV-2. Completely out of line.\n\nSo according to this article, the safe conclusion is that between the SARS CoV-2 and the Rat Bat, at least one is not natural. And if one is natural, then the other must not be. It’s also possible that neither came from nature.\n\nWe talked about Gain of Function, how we increase the ability of the virus to be airborne or to attach to human cells. The part of the virus that determines how good it is at infecting human cells is called the Receptor Binding Domain (RBD), and it’s located in a particular region of the protein on the surface of the virus. It can grab onto the catcher’s mitt at the end of the cell and that catcher’s mitt is called ACE-2.\n\nWhat’s interesting is that if Rat Bat doesn’t actually exist, if it’s just a fabrication, what could be the real source of the SARS CoV-2? It turns out it’s the same twins- the ZC45 and the ZXC2. Aren’t those names perfect and intuitive. We’ll just call them the twins.\n\nThe majority of the virus there has 95% similarity. However, there’s one crucial region where they are dissimilar with only 69% identity, and that’s the RBD. In other words, if you were to genetically engineer a part of the virus that was the natural part of the twins, to make it more infective, you would go after the RBD. And that’s exactly where the similarity is quite different. However, given that the rest of the virus strain is pretty darn close to SARS CoV-2, the twins and CoV-2 are very similar. According to the scientist, it’s extremely improbable that such a huge difference occurs in this RBD version naturally.\n\nAs an example, one of the readers of his blog pointed out that another thing that’s highly suspicious is that the original structure of the Coronavirus (before it mutated) had another protein that was identical to the twins, 100% identical. But almost immediately it started to mutate and change. Which again suggests that a natural mutation – if it had occurred quite a bit before – would never have come out of the gate as being 100% identical.\n\nSo you have pieces of the virus that are not acting according to the normal mutations. Some are acting according to it, some look to be very different and others are identical. When you look at it from the scientific standpoint, it’s very suspect that the twins are in fact the source of the SARS CoV-2 virus, that the region that was allowing it to infect the ACE-2, (we called the RBD) that was genetically engineered. And that other aspects were identical because they just started with the same twins.\n\nSo if the intention of these genetic manipulations were to gain infectivity into human cells, that explains what we just saw. In other words, if the Wuhan Institute of Virology’s purpose was to gain a function from the twins, this is the kind of thing it would do. So it makes sense that it was genetically engineered according to the research that was going on at the WIV.\n\nLet’s come back to “the Batwoman.” The Batwoman woman has been publishing sequences of Coronaviruses from bats for years, and she’s been looking for ones that might have infectivity to humans, and if Rat Bat were a bonafide natural bat Coronavirus discovered in the wild in 2013 by Shi (Batwoman), given its star quality and that it has an unbelievably high capacity potential to infect humans, why didn’t Batwoman rush to publish the sequence? She had already published the sequence of the twins years ago, why did she wait until January, 2020 after Covid19 was already out there? Maybe she scrambled to come up with some sort of “evidence” to pretend that the virus had a natural origin. If she discovered this Rat Bat virus back in 2013, why would she not have gone to publication? According to the GM watch commentators, it turns out that it would have been universally acclaimed as an immense public health import and potentially worth the Nobel Prize.\n\nIf so, it doesn’t make any sense that they discovered it in 2013, seven years ago, and are only announcing it now, when there’s a whole slew of other ones that have been discovered that are less likely to transfer to humans that were published. GM Watch gives two possible reasons.\n\nOne is if it were introduced as 2013 and let’s say it was a fraud and they put it there as 2013, then it can help explain why there’s no live samples to confirm, because they said, “Oh, it was just found in bat poop and there were no live samples”. So having its origin back in 2013 gives them an excuse to say there’s no live virus right now. And it also gives an excuse scientifically to describe how it could have plausibly naturally mutated to the current pandemic source over that time.\n\nSo if you were to purposely fabricate the Rat Bat virus, you’d want it to go back in time to say, “This is why we don’t have a live sample and this is why it was given time to mutate to become the deadly one, which we’re facing.”\n\nGM watch points out that Batwoman is at fault, whether or not Rat Bat is real or fake. They say if it’s real, her failure to immediately report it to the world is an act of extreme negligence that recklessly endangers public health. If it had been published, it would have put the health authorities on alert as the possibility of the virus acquiring relatively few mutations so that it can infect humans. If it was fabricated, then she’d be guilty of scientific fraud to cover up an act of negligence in the form of her lab’s construction and release of SARS CoV-2. So whether it was fake or real, according to GM watch, they put her at fault.\n\nYou may know of the biosafety levels (BSL) one, two, three and four. The WIV (the Wuhan Institute of Virology) is a fourth level, the highest level of security for biosafety. The Center for Disease Control and Prevention, which is only 280 meters away from the so-called wet market. They actually are a biosafety level two, but they’ve also been dealing with bat Coronaviruses. But in either case, there has been a long history of mistakes. I’m going to read you some. USA Today had a reporter, Alison Young, that did a lot of work in this area. In 2014, she had an article, Hundreds of Bioterror Labs Mishaps Cloaked in Secrecy. Hundreds of vials of bioterror bacteria have gone missing; lab mice infected with deadly viruses have escaped; wild rodents have been found making nests with research waste; cattle infected in a university’s vaccine experiments who had been infected with vaccine experiments were sent to slaughter and their meat sold for human consumption; gear meant to protect lab workers from lethal viruses such as Ebola and Bird Flu have failed repeatedly. Hundreds of lab mistakes. Even when the research facilities commit the worst safety breaches as more than 100 labs have, regulators keep their names secret. The Center for Disease Control and Prevention admitted in 2016 that they identified 34 incident reports involving bioterror pathogens mishandled by the CDC and inadvertently not disclosed to a congressional investigation in 2014. The Government Accountability Office had something to say on this in 2016. They said: “Government regulators have no idea how often laboratories working with some of the world’s most dangerous viruses and bacteria are failing to fully kill vials of specimens before sending them to other researchers who lack critical gear to protect them against infection.”\n\nLet’s not just demonize China because there hasn’t been a lot of scrutiny on the bio-weapons and Viral Gain of Function work by the US and allies. The Federal Select Agent Program in the United States found they received eight reports of loss and 193 reports of release of biological select agent or toxin. And in a 2014 paper by Martin Furmanski, he talks about how this whole state of working on chemical and biological weapons can create potentially pandemic pathogens. He documented smallpox, accidental releases in Britain in the seventies, which eventually led to the head of the lab committing suicide; a Venezuelan equine encephalitis in 1995; foot-and-mouth disease in Britain in 2007, which happened to begin four kilometers from a biosafety level four laboratory.\n\nEven though SARS has not naturally recurred, there’ve been six separate escapes from virology labs that have been studying it in Singapore, Taiwan and Beijing. The US Army Laboratory inadvertently shipped live anthrax samples to nearly 200 labs around the world. The Lancet later recalled, “The news that dozens of workers at Centers for Disease Control and Prevention might’ve been exposed to anthrax. That vials of smallpox virus had been left lying around in an NIH storeroom and that the CDC had unwittingly sent samples of an ordinary influenza virus contaminated with H1N1, shook faith in the country’s biosafety procedures”. I think we should certainly shake our faith in the world’s biosafety procedures.\n\nToby Ord, a senior research fellow at Oxford, has been writing about this at the Future of Humanity Institute. He just published a book called The Precipice. He warns the global pandemics triggered by research on viruses pose one of the two biggest existential threats that face humanity. He thinks that humanity faces a one-in-six chance of an existential catastrophe before the end of the century making our chances equivalent to Russian Roulette. Stephen Hawking also said that engineering of viruses could lead to making the planet completely uninhabitable for humans.\n\nNow we have the broad distribution of relatively low cost gene editing techniques like CRISPR CAS9. You can buy your own CRISPR do-it-yourself kit on Amazon for $169 and be cutting up bacteria, which by the way is not safe. Bacteria have a lot of problems just like viruses as you could imagine.\n\nWhat’s been the response by the regulatory agencies? It depends who has been caught in the lobbying campaigns of the biotech industry. So Australia, for example, passed regulation that a certain gene editing technique, CRISPR being one of them, can be used without any government oversight to genetically engineered plants, animals or microbes, including viruses or bacteria. Zero regulatory oversight.\n\nSo we can’t ask Australia for help. We can’t ask the US, because they’re going along the same track or Japan, probably not China, Argentina or Brazil. There’s a lot of countries that are accepting the theory that anything that’s gene edited must be safe. And there’s many military establishments that are going along, continuing to genetically engineer microbes. And governments lie. The Chinese government appears to be censoring research on the origins of the Covid19 epidemic. According to some writers, US experts with samples of the earliest cases of the Coronavirus and the Shanghai Lab that published the sequence on the 11th of January was quickly shut down for rectification and several doctors and journalists to report on the spread early have disappeared.\n\nOne of the players that has been funding the research in Wuhan is EcoHealth, which are partnered with the World Health Organization and the Center for Disease Control and the Gates Foundation. They’re on the board of advisors. So, it’s hard to know where to get our information and it’s certainly difficult to just leave the decisions about policy and safety in the hands of self-interested governments and scientific organizations. Every time you genetically engineer a microorganism, you increase the likelihood of a problem. Genetic engineering’s most common result is surprise side effects. There are potential dangers for human health, animal health, plant health, soil health and environmental health. Everytime we genetically engineer, there’s the possibility of a release and the release could spell catastrophe.\n\nThere are other genetically modified microorganisms that are already being released because they’re not considered to be dangerous, even though they haven’t been tested sufficiently and they may end up biting us in a way it becomes impossible to clean up or stop. So, it’s true that whether the Covid19 comes from a genetically engineered virus or not (and the information in this podcast is not conclusive by any means) but the lesson remains that when you genetically engineer you increase the risk. The lesson remains that even if it wasn’t genetically engineered, we may want to go ahead and stop the genetic engineering of pathogens, period, end of story.\n\nWe may want to stop the release of genetically engineered microorganisms that can mutate and change, be uncontrollable, spread around the world and be a catastrophe of some level. I’m talking about not just viruses, but also bacteria, algae, fungus and yeasts. There’s plenty of evidence that this is a complicated issue. It’s not rocket science, it’s much more complicated because it’s living organisms.\n\nSo there you have it. The current state of affairs of whether this was genetically engineered from what I’ve read, there’s obviously more out there. I’m not an expert on genetic engineering of viruses. I’ve been studying the genetic engineering of food and I can tell you in that area, there has been more disinformation circulated, more corporate driven lies than truths that have been driving policy. As I peer into this area of microorganisms, I see similar patterns,", "opengraph": {"locale": "en_US", "type": "article", "title": "Jeffrey's Take: Was COVID-19 Genetically Engineered? - Institute for Responsible Technology", "description": "Transcription: Was COVID-19 Genetically Engineered? Was the Covid-19 pandemic from a genetically engineered virus or a natural one? I have amassed a bunch of information from various sources to report on what we know and it’s pretty damning. I’m going to present evidence suggesting that the SARS CoV-2 was specifically genetically engineered according to some […]", "url": "https://responsibletechnology.org/jeffreys-take-was-covid-19-genetically-engineered/", "site_name": "Institute for Responsible Technology", "article:published_time": "2021-09-07T23:41:49+00:00", "article:modified_time": "2022-12-02T00:51:54+00:00", "image": "https://responsibletechnology.org/wp-content/uploads/2022/12/Was-COVID-19-Genetically-Engineered.jpg", "image:width": "640", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:;", "javascript:;", "javascript:;", "javascript:;", "javascript:;", "javascript:;", "javascript:;", "javascript:;", "javascript:;", "javascript:;", "javascript:;", "javascript:;", "http://get.adobe.com/flashplayer/", "https://nerdhaspower.weebly.com/ratg13-is-fake.html", "https://www.washingtonpost.com/", "https://www.newsweek.com/controversial-wuhan-lab-experiments-that-may-have-started-coronavirus-pandemic-1500503", "https://podcasts.apple.com/au/podcast/april-29-2020-john-latham-john-grant-ken-deklava/id886953283?i=1000473088668", "https://www.gmwatch.org/en/news/latest-news/19391-sars-cov-2-could-have-escaped-from-a-lab-and-the-us-is-in-the-frame", "https://www.nature.com/articles/s41591-020-0820-9", "https://www.swissinfo.ch/eng/swiss-research_a-swiss-lab-made-the-first-synthetic-clone-of-covid-19/45593190", "https://www.gmwatch.org/en/news/latest-news/19396-evidence-that-the-sars-cov-2-virus-is-genetically-engineered", "https://nerdhaspower.weebly.com/blog/scientific-evidence-and-logic-behind-the-claim-that-the-wuhan-coronavirus-is-man-made", "https://www.gmwatch.org/en/news/latest-news/19395-media-ignores-history-of-accidental-lab-releases-of-biohazards-in-covid-19-coverage", "https://thebulletin.org/2014/03/threatened-pandemics-and-laboratory-escapes-self-fulfilling-prophecies/", "http://news.agropages.com/News/NewsDetail---32915.htm", "https://www.gmwatch.org/en/news/latest-news/19392-expert-attacks-ecohealth-alliance-s-involvement-in-really-risky-bat-coronavirus-research-in-wuhan-labs"], "authors": ["IRT News Team"], "publish_date": "2021-09-07T23:41:49+00:00"}