{"result_id": "172003", "URL": "https://responsibletechnology.org/article-summary-by-founder-executive-director-jeffrey-smith-of-risky-research-eroding-norms-on-release-of-gm-self-spreading-viruses/", "timestamp": "2023-04-25 15:40:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://responsibletechnology.org/wp-content/uploads/2022/10/cropped-IRT-Favicon-512-32x32.jpg", "canonical": "https://responsibletechnology.org/article-summary-by-founder-executive-director-jeffrey-smith-of-risky-research-eroding-norms-on-release-of-gm-self-spreading-viruses/", "encoding": "UTF-8"}, "image": null, "domain": "responsibletechnology.org", "title": "Article Summary by Founder & Executive Director Jeffrey Smith of Risky Research Eroding Norms on Release of GM Self-spreading Viruses", "cleaned_text": "Protect Nature Now is IRT’s global campaign to block outdoor release of genetically engineered microbes, and to stop “gain-of-function” enhancements of potentially pandemic pathogens. A recent article in Science points to a subset of this threat, “self-spreading viruses.” Please read Jeffrey’s summary below, and then watch and share our film, Don’t Let the Gene Out of the Bottle. A coordinated global effort is urgently needed. Please join us.\n\nVaccine makers traditionally use viruses which can’t spread on their own through the population and environment. In fact, the scientific community has operated under a de facto policy preventing the creation and release of self-spreading viruses.\n\nScience considers these self-spreading viruses too genetically unstable to use safely and predictably outside secure facilities. The current coronavirus spread provides at least one glaring example of why. Viruses mutate and alter their infectibility and impact. This can occur when a virus repeatedly passes from host-to-host (passaging). Thus, a self-spreading virus released for one purpose can change its biological properties after being released.\n\nDespite the unpredictable danger, since 2016, a number of labs propose or study a range of applications in violation of the de facto prohibition. With funders including the European Union, US National Institutes of Health, and the US Defense Advanced Research Projects Agency (DARPA), proposals on the table range from self-spreading viral insecticides, viruses to genetically modify crops already in the field, and even self-spreading viruses as human vaccines. Another recent discussion suggests using an ineffective vaccine to counter the current coronavirus.\n\nTo counter the obvious concerns about genetic instability, modern proposals assert that their approaches suppress the evolution and mutation of the viruses, and even create vaccines that “have predetermined lifetimes.” None of these claims experimentally verify the reliability to work as claimed.\n\nCreating self-spreading viruses in secure locations as part of the research, however, carries enormous risks associated with accidental release. In 1995, for example, Australian researchers were field-testing their Rabbit haemorrhagic disease on an Island three miles off the South Australian coast. The deadly disease escaped and spread through the country, reducing rabbit populations. It then spread through New Zealand, when a group of farmers struggling with rabbits decided to illegally release the disease.\n\nAfter the Australian research had ceased in 2007, a statement in a special issue of Wildlife Research, drew a cautionary lesson from the Aussie experience:\n\nUnfortunately, self-spreading vaccine research continues to proceed today, even though there are no new scientific or regulatory advances effectively countering the risk. Furthermore, the technology is readily available to produce self-spreading viral vaccines. Both enthusiastic well-wishers, or malevolent adversaries can use this technology.\n\nWithout appropriate precautionary measures from the scientific and international communities, self-spreading viruses for environmental release could arguably be developed very quickly, with limited funding or expertise and with potentially irreversible consequences for the planet’s biodiversity, ecosystems, and environments. . . Only a concerted, global governance effort with coherent regional, national, and local implementation can tackle the challenges of self-spreading viruses that have the potential to radically transform both wildlife and human communities.\n\nWe could not agree more.", "opengraph": {"locale": "en_US", "type": "article", "title": "Article Summary by Founder & Executive Director Jeffrey Smith of Risky Research Eroding Norms on Release of GM Self-spreading Viruses - Institute for Responsible Technology", "description": "Protect Nature Now is IRT’s global campaign to block outdoor release of genetically engineered microbes, and to stop “gain-of-function” enhancements of potentially pandemic pathogens. A recent article in Science points to a subset of this threat, “self-spreading viruses.” Please read Jeffrey’s summary below, and then watch and share our film, Don’t Let the Gene Out […]", "url": "https://responsibletechnology.org/article-summary-by-founder-executive-director-jeffrey-smith-of-risky-research-eroding-norms-on-release-of-gm-self-spreading-viruses/", "site_name": "Institute for Responsible Technology", "article:published_time": "2020-09-23T16:36:26+00:00", "article:modified_time": "2022-11-11T17:57:15+00:00", "image": "https://responsibletechnology.org/wp-content/uploads/2022/11/Risky-Research-Eroding-Norms-on-Release-of-GM-Self-spreading-Viruses.jpg", "image:width": "640", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://biosafety-info.net/articles/biosafety-science/science-policy/risky-research-eroding-norms-on-release-of-gm-self-spreading-viruses/", "https://protectnaturenow.com/"], "authors": ["IRT News Team"], "publish_date": "2020-09-23T16:36:26+00:00"}