{"result_id": "172011", "URL": "https://responsibletechnology.org/research-shows-new-dangers-of-genetically-modified-food/", "timestamp": "2023-04-25 15:41:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://responsibletechnology.org/wp-content/uploads/2022/10/cropped-IRT-Favicon-512-32x32.jpg", "canonical": "https://responsibletechnology.org/research-shows-new-dangers-of-genetically-modified-food/", "encoding": "UTF-8"}, "image": null, "domain": "responsibletechnology.org", "title": "Research Shows New Dangers of Genetically Modified Food", "cleaned_text": "For Immediate Release Kuala Lumpur, Malaysia, 24 February, 2004\n\n Data from three groups of studies currently being conducted by the Norwegian Institute for Gene Ecology, in Tromsö, Norway, reveal potentially serious health dangers of genetically modified (GM) foods and vaccines.\n\nJeffrey M. Smith, Director of the Institute for Responsible Technology, presented a summary of the findings and their implications for human health to delegates at the UN Cartagena Protocol for Biosafety meeting. Smith also presented additional evidence of health dangers from his recently published book, Seeds of Deception, including new information that incriminates the genetic engineering of the food supplement L-tryptophan as the cause of an epidemic in the U.S. in the 1980s, which took the lives of about 100 Americans and caused 5-10,000 to fall sick or become disabled.\n\nThe Norwegian findings are summarized below and are elaborated in accompanying documents. Bt-maize (Dekalb 818 YG), during pollination, may have triggered disease in people living near the maize field in the Philippines.\n\nThe cauliflower mosaic virus (CaMV) promoter, used in most GM foods, was found intact in rat tissues two hours, six hours, and three days after it was mixed into a single meal, and was also confirmed to be active in human cells.\n\nGenetically engineered pox viruses in cell cultures recombined with natural viruses to create new hybrid viruses with unpredictable and potentially dangerous characteristics.\n\nTerje Traavik, PhD, Director of the Norwegian Institute for Gene Ecology, announced the findings at a meeting held on February 22 in Kuala Lumpur, sponsored by the Third World Network. The studies are ongoing and not yet published, but Traavik says, “Publication of results typically requires a waiting period of up to one year or more. With such evidence of possible human health impacts of foods already on the market, we believed that waiting to report our findings through publication would not be in the public’s interest.” Traavik acknowledged that unpublished results are considered preliminary, but the findings, he said, are considered reliable and warrant immediate investigation.\n\nTraavik presented the data the day before the UN conference on biosafety began so that the results could be taken into consideration when drafting regulatory guidelines.\n\nSmith put the Norwegian findings into context by presenting related findings. He said, “The fact that the CaMV promoter can transfer to mammalian cells might explain the excessive cell growth found in the stomach and intestines of animals from other GM feeding trials, and raises additional concerns that GM foods might encourage genetic instability and mutation, accidental expression of allergens or toxins from non-target genes, and even activation of dormant viruses.” Smith said that the link between Bt-maize pollen and disease in the Philippino villagers is supported by other studies on Bt-toxin and the crops genetically engineered to express it. Smith said, “Because Bt-toxin appears to increase the sensitivity of mammals to other allergens or immunogens, we must investigate whether Bt-crops contribute to the unexplained rise of allergies.”\n\nSmith also provided evidence that the L-tryptophan epidemic had started four years earlier than is generally cited, and was linked to a series of genetically modified bacterial strains used by a Japanese manufacturer between 1984 and 1989. This information undermines the alternative explanation that the epidemic was created as a result of a change in the manufacturing methods introduced in 1989.\n\nNew research on survival of CaMV promoter in rat tissues\n\n Terje Traavik Ph.D\n\n Summary\n\nThe cauliflower mosaic virus (CaMV) promoter was found intact in rat tissues after a single meal, and was also confirmed to be active in human cells.\n\nThe full 1100 base pairs of the CaMV promoter was found: *In stomach cells and in intestinal (mesenteric) lymph nodes two hours after eating; *In mesenteric lymph nodes, kidney, and liver cells six hours after eating; and *In mesenteric lymph nodes, spleen, and liver cells three full days after eating.\n\nFuture tests will determine if the CaMV is active.\n\nSeven groups of six rats each were intragastrically intubated (fed through a tube to the stomach) with a balanced diet. Added to the a small portion of the diet was a single dose of a genetic construct similar to those used to create genetically engineered crops. This construct included a gene that codes for a green fluorescent protein. The negative control group had no promoter attached to the green fluorescent protein gene at all; the positive control used human cytomegalovirus promoter known to be active in all mammalian cells. The test group had the CaMV 35S promoter coupled to the gene. The design tested the DNA construct in both circular and linear form. A final control was not fed any DNA at all. About half of the CaMV fed rats in each of the circular and linear DNA groups were found to contain intact CaMV.\n\nTissue samples remaining to be tested will soon determine if the CaMV is active, causing the expression of the green fluorescent protein. In a separate but related study, the same three constructs described above were added directly to human intestinal epithelial cells (both small and large intestines), rat cells, and fish cells, in vitro. The fluorescent gene was expressed in all the cells tested.\n\nThe CaMV promoter is attached to inserted foreign genes in nearly all genetically engineered foods. It overpowers the cellsí own self-regulatory mechanisms so as to permanently turn on the foreign inserted gene and produce large amounts of the transgene proteins. Without the promoter, the gene would likely be dormant in the DNA, unexpressed. Scientists use the CaMV because it is aggressive and because it works in the DNA of all types of plants.\n\nThe assumptions used by biotech advocates as the basis of safety claims were that the CaMV:\n• Will only turn on the gene to which it was attached\n• Is plant specific and will not function in mammals, including humans, and\n• Will not transfer from food to gut bacteria or internal organs;\n\nEach of these assumptions have been contradicted.\n• Studies also show that the promoter creates a ‘hotspot’ in the DNA. This means that the whole chromosome can become unstable. This may cause breaks in the strand or exchanges of genes with other chromosomes. Research reported in June 2003 confirmed that genetically engineered crops exhibited broken DNA sections at the CaMV.\n• The CaMV promoter may turn on native genes over long distances up and down the strand of DNA. It can even turn genes on in a different chromosome. This can create a flood of proteins that may create toxins, allergens, carcinogens, or nutritional changes.\n\nSome scientists believe that the CaMV promoter, in conjunction with other genetic material, might also create a growth factor that could result in excessive cell growth – a potentially pre-cancerous condition. A study by Ewen and Pusztai demonstrated significant cell growth in the stomach and intestines of rats fed a genetically engineered potato. An Egyptian study also showed evidence of cell growth in rats fed a Bt potato, and a feeding study on genetically modified peas showed greater weights of rat intestines, supporting the possibility of extra cell growth.\n\nWhile scientists believed that the aggressive nature of the CaMV promoter might have been responsible for these results, it was not confirmed whether the CaMV promoter was able to transfer intact to organs and whether it would be active in human cells.\n\nThe new evidence confirms the transfer and potential activity. The new evidence does not, however, show any specific links to cell growth, nor does it confirm that unstable hotspots or the turning on of dangerous genes will occur in mammalian DNA.\n\nEmbedded into the DNA of many organisms, including humans, are ancient viruses that have worked their way in, perhaps in previous species. While most of this viral material has eroded, some may be complete but simply not turned on. In theory, the fact that the promoter can turn on genes up and down the DNA, combined with the fact that it can transfer to human or animal organs, means that it may be possible for it to turn on a previously dormant virus.", "opengraph": {"locale": "en_US", "type": "article", "title": "Research Shows New Dangers of Genetically Modified Food - Institute for Responsible Technology", "description": "For Immediate Release Kuala Lumpur, Malaysia, 24 February, 2004 Data from three groups of studies currently being conducted by the Norwegian Institute for Gene Ecology, in Tromsö, Norway, reveal potentially serious health dangers of genetically modified (GM) foods and vaccines. Jeffrey M. Smith, Director of the Institute for Responsible Technology, presented a summary of the […]", "url": "https://responsibletechnology.org/research-shows-new-dangers-of-genetically-modified-food/", "site_name": "Institute for Responsible Technology", "article:published_time": "2020-06-13T23:32:24+00:00", "article:modified_time": "2022-12-02T00:37:50+00:00", "image": "https://responsibletechnology.org/wp-content/uploads/2020/06/Research-Shows-New-Dangers-of-Genetically-Modified-Food.jpg", "image:width": "640", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["IRT News Team"], "publish_date": "2020-06-13T23:32:24+00:00"}