{"result_id": "172012", "URL": "https://responsibletechnology.org/shop-healthy/", "timestamp": "2023-04-25 15:41:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://responsibletechnology.org/wp-content/uploads/2022/10/cropped-IRT-Favicon-512-32x32.jpg", "canonical": "https://responsibletechnology.org/shop-healthy/", "encoding": "UTF-8"}, "image": null, "domain": "responsibletechnology.org", "title": "Shop Healthy", "cleaned_text": "In order to shop healthy we recommend buying organic. Here’s one major reason why: Monsanto promotes Roundup as a desiccant – that is something to spray on crops three to five days before it’s harvested. It’s sprayed on wheat, barley, oats, rice, grains, beans and on vineyards, between the row. So, the Roundup – or it’s active ingredient glyphosate- ends up throughout our food supply-in both GMO and non-GMO food products.\n\nTo avoid both GMOs and Roundup, eat organic which doesn’t allow either. The use of Roundup is not allowed in products with the USDA Organic Certification. Now, where does that leave the Non-GMO Project? That’s the little butterfly label. First of all, if something says Non-GMO Project Verified, then they actually test to see if there are any GMOs to make sure that if there’s contamination, it’s low. They have a .9% action threshold. Organic doesn’t require testing to see if GMO contamination occurs. Therefore if you have an option to get both organic and the Non-GMO Project Verification on the same package, that’s the best because this way you avoid the Roundup and you also know that there’s been a test to verify that the contamination levels are low if there’s any potentially at risk GMOs in the formula.\n\nHowever, if you have to choose between organic and Non-GMO Project, eat organic. You might have a Non-GMO Project Verified loaf of bread, but the wheat may be sprayed with Roundup just before harvest. Therefore, it may contain high levels of glyphosate, the chief poison in Roundup.\n\nYou can take a look on our Shopping Guide page to see what’s been verified as non-GMO but also – if you find something that’s Non-GMO Verified then you may also want to look at our guide that identifies which foods have high levels of glyphosate residues, because you want to try and combine the two. For example, if you’re looking at navy beans, oats or hummus, these can have high levels of Roundup even though they’re non-GMO. You want to try and avoid both and eating organic is the simplest way to do this.\n\nIf a product doesn’t have an organic label or a Non-GMO Project label, then realize that the major GMOs are found in most processed foods in the United States, Canada, and in several other countries. Soy and corn for example, are practically omnipresent in packaged foods. Most cotton, canola, soy, and corn are genetically engineered. Most sugar in the United States comes from sugar beets that are all GMO.\n\nAnother thing to consider is the animal feed that’s fed to the animals, which include all those mentioned above, plus alfalfa. If you have animal products that are not organic – sometimes there’s a 100% grass-fed animal, but it may be supplemented with GMOs. If they’re not 100% grass-fed, they may have been grain-finished with GMOs.\n\nIn addition to the GMOs, you want to avoid Aspartame or the Impossible Burger. Both are a derivative of genetically engineered bacteria. We say, “Friends don’t let friends eat Aspartame and friends don’t let friends eat the Impossible Burger.” The Impossible Burger is not only genetically engineered soy, but it also has this bleeding red juice in it that comes from heme from a genetically engineered yeast that produces this protein which has never been part of the human food supply. Plus, the process created all these other by-products – 46 proteins, plus metabolites – thrown into the burger. People are reporting getting sick. We don’t know if it’s from the burger, but we think it is.\n\nThere are also some dairy products from animals that have been injected with Bovine Growth Hormone. It used to be owned by Monsanto, but they sold it to Eli Lilly. A former Monsanto scientist said that himself and three of his colleagues who were testing the milk from the cows injected with the company’s Bovine Growth Hormone found so much cancer-promoting hormone in that milk that the three Monsanto scientists refused to drink milk thereafter unless it was organic. One even bought his own cow.\n\nLet’s do our best to share the information and work to change the policy of the food companies and the government.", "opengraph": {"locale": "en_US", "type": "article", "title": "Shop Healthy - Institute for Responsible Technology", "url": "https://responsibletechnology.org/shop-healthy/", "site_name": "Institute for Responsible Technology", "article:modified_time": "2022-12-06T22:49:24+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://nongmoshoppingguide.com/", "http://irt-glyphosatepage.flywheelsites.com/"], "authors": ["IRT News Team"], "publish_date": null}