{"result_id": "172008", "URL": "https://responsibletechnology.org/scientists-tricked-mosquitoes-into-delivering-vaccines-to-humans/", "timestamp": "2023-04-25 15:40:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://responsibletechnology.org/wp-content/uploads/2022/10/cropped-IRT-Favicon-512-32x32.jpg", "canonical": "https://responsibletechnology.org/scientists-tricked-mosquitoes-into-delivering-vaccines-to-humans/", "encoding": "UTF-8"}, "image": null, "domain": "responsibletechnology.org", "title": "Scientists Tricked Mosquitoes into Delivering Vaccines to Humans", "cleaned_text": "Scientists have managed to turn one of the deadliest insects into a vaccine delivery system. According to new reports from NPR, a clinical trial for a system meant to use mosquitoes to deliver vaccines has been underway in the United Kingdom. The findings of the trial have been published in Science Translational Medicine.\n\nAccording to the paper, scientists were able to genetically modify parasites to deliver malaria vaccines through mosquito bites. It’s an intriguing proposition to use mosquitos to deliver vaccines. It sounds horrific on paper and even more horrific when you see the photos featured in a report on the trial from NPR.\n\nThose photos can be seen in the original report and show the results of trial participants being bitten hundreds of times. To get the desired effect of the mosquitos delivering the vaccine, scientists loaded them with genetically modified parasites known as Plasmodium falciparum. In the past, scientists have tried to do something similar. However, this is the first time CRISPR has been used to accomplish it.\n\nThe result is basically 1,000 small flying syringes, a researcher told NPR. And based on the photos featured in that same report, it does look like that, as one image shows a participant’s arm wholly covered in welts from the mosquito bites they suffered. The biggest problem with using mosquitos to deliver vaccines for malaria, though, is the effectiveness.\n\nAccording to the study’s results, 14 of 26 participants who were exposed to malaria contracted the illness. That means the mosquito vaccine delivery system is only around 50 percent effective. But, that doesn’t mean this was a failure — it just means that some improvements need to be made. It’s also important to realize that the scientists don’t intend to release swarms of genetically modified mosquitos, either.\n\nInstead, they want to use the mosquitos to deliver vaccines in a more controlled fashion. The researchers told NPR that releasing a massive number of these mosquitos is an intriguing proposition. But, doing so would raise very deep questions about medical consent and bioethics as they couldn’t control who was inoculated and exposed.", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientists Tricked Mosquitoes into Delivering Vaccines to Humans - Institute for Responsible Technology", "description": "Originally posted by MSN on October 2nd, 2022 Scientists have managed to turn one of the deadliest insects into a vaccine delivery system. According to new reports from NPR, a clinical trial for a system meant to use mosquitoes to deliver vaccines has been underway in the United Kingdom. The findings of the trial have […]", "url": "https://responsibletechnology.org/scientists-tricked-mosquitoes-into-delivering-vaccines-to-humans/", "site_name": "Institute for Responsible Technology", "article:published_time": "2022-10-02T21:09:00+00:00", "article:modified_time": "2022-10-28T21:37:36+00:00", "image": "https://responsibletechnology.org/wp-content/uploads/2022/10/Scientists-Tricked-Mosquitoes-into-Delivering-Vaccines-to-Humans.jpg", "image:width": "640", "image:height": "360", "image:type": "image/jpeg"}, "tags": ["CRISPR"], "tweets": [], "movies": [], "links": ["https://www.msn.com/en-us/health/other/scientists-tricked-mosquitoes-into-delivering-vaccines-to-humans/ar-AA12vbwu?cvid=7052f16e59c54483dd8621cfa00d628e&fbclid=IwAR1eSWaa5nJsDF-sxhKm_fkrM2SDGs-8dJYI_RN7I9zAQJRQ7AVYUeDe2YU", "https://www.science.org/doi/10.1126/scitranslmed.abn9709", "https://www.npr.org/sections/goatsandsoda/2022/09/21/1112727841/a-box-of-200-mosquitoes-did-the-vaccinating-in-this-malaria-trial-thats-not-a-jo", "https://bgr.com/tag/crispr/", "https://bgr.com/science/2-billion-genetically-modified-mosquitos-are-about-to-be-released-in-the-us/"], "authors": ["IRT News Team"], "publish_date": "2022-10-02T21:09:00+00:00"}