{"result_id": "172004", "URL": "https://responsibletechnology.org/monsantos-army-of-online-bullies/", "timestamp": "2023-04-25 15:40:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://responsibletechnology.org/wp-content/uploads/2022/10/cropped-IRT-Favicon-512-32x32.jpg", "canonical": "https://responsibletechnology.org/monsantos-army-of-online-bullies/", "encoding": "UTF-8"}, "image": null, "domain": "responsibletechnology.org", "title": "Monsanto’s Army of Online Bullies", "cleaned_text": "There are hundreds, possibly thousands of them—paid to bully, shame, and endlessly argue with anyone posting a comment deriding GMOs or pesticides. And when a high-profile person stands up to Monsanto’s technology, watch out. The trolls swarm in and gang up.\n\nTake Marion Nestle, for example. When a GMO propaganda film called Food Evolution purposely quoted her out of context, she demanded that her 10-second clip be removed. Nestle’s blog was then ambushed with 870 comments by Monsanto’s minions, forcing her to block all comments from her site, Food Politics.\n\nThe presence of a troll army was revealed during the on-going lawsuit against Monsanto over the cancer-causing properties of their herbicide Roundup. The lawyers wrote:\n\nThe legal brief also points out that, “Monsanto quietly funnels money to ‘think tanks’ such as the ‘Genetic Literacy Project’ and the ‘American Council on Science and Health,’ organizations intended to shame scientists . . .”\n\nAs a frequent target of these groups, I know well their unethical bullying tactics. And so too do the scientists who discover evidence that GMOs are harmful.\n\nWorld renowned biologist Arpad Pusztai, for example, was pummeled by the biotech machinery when he accidentally discovered that GMOs caused massive damage to rats in just 10 days. In the late 1990s he led a team that was designing test protocols to be used by European authorities to evaluate GMO safety. His research, however, revealed that the generic process of creating a GMO caused dangerous and unpredictable side-effects that might already be eroding the health of consumers. Because his shocking discovery could have destroyed the entire GMO industry, they came after Pusztai with far more than just a shaming campaign. Within days, his employer of 35 years terminated his contract. Pusztai’s 20-member team was dismantled. He was silenced with threats of a lawsuit. And the biotech industry and pro-GMO UK government unleashed a campaign to destroy his reputation.\n\nAlthough Pusztai was the first scientist to undergo this type of industry battering, many others have since been targeted. One told me that these types of attacks have deterred hundreds of other scientists from doing research on GMOs.\n\nThe online bullies have a similar intimidating effect. Their well-chosen words are sharp and condescending, designed to scare away others from making comments—lest they become the next target.\n\nThe folks at the International Fitness Professionals Association learned this the hard way. After posting what they considered to be a balanced article on GMOs, a troll got wind of it, posted a negative comment on the Pro-GMO FB site “We Love GMOs and Vaccines,” and asked his comrades to also make comments. The trolls swarmed.\n\nThey not only challenged the GMO article, they attacked the integrity and reputation of the organization. And of course, the trolls avoided commenting on details about GMOs, since they would quickly lose that argument with anyone familiar with the science. Facts are not their strong point. They prey on emotions.\n\nStanding up to the Bully\n\nBullying and shaming can traumatize. In schools, online, at work, they have damaged and destroyed lives. It works. That’s why the biotech industry uses them.\n\nBefore discussing what to do, the first step is how to feel. The answer: INVINCIBLE!\n\nAfter reporting for years about Monsanto’s strong-arm tactics, I finally became their target about eight years ago. Rather than feeling hurt or depressed, I felt uplifted. I viewed their baseless attacks as a badge of honor. I was now such a threat to their business dealings around the world, they invested a significant amount of money trying to distort my work and discredit me.\n\nI considered whether I should spend time countering their spin to set the record straight, but soon realized that it was a black hole that would suck up my life. After all, why would I want to write posts to correct the views of the handful of people who wander onto their site, when I could reach millions of others with real information.\n\nAnd so I smile, shake my head, and don’t even bother to read their posts about me. We’re winning the battle against GMOs and soon these bounty hunters will be hired by the next toxic industry.\n\nThat’s right, I said we are TOTALLY WINNING. Mainstream food companies in the US are falling over themselves to remove genetically engineered ingredients in order to boast a Non-GMO label. With 57% of surveyed Americans saying that they are concerned about the health impacts of GMOs, we are now the majority. We have the average American on the right side of this issue.\n\nAnd that’s why Monsanto has unleashed its online army. It’s a last-ditch attempt to turn the tide.\n\nSo, if you get a troll on your case or see one doing their dark dance on someone else’s post, feel GREAT! Let it remind you that our collective work sharing the truth about GMO dangers has been so successful, we are seeing the dying embers of a desperate and failing industry.\n\nAnd have absolutely no anxiety or concern about any details of their accusations. They will portray themselves as mainstream, pretending to have logic and science on their side. They will appear absolutely sure of themselves. And their colleagues will give them support.\n\nIt’s their game. It’s just a game. It means nothing. And by the way, we have become the mainstream in this argument (finally).\n\nSo What Do We Do? Strike Back!\n\nArguing with a professional GMO huckster is hopeless. Forget about it. (Or as my NY colleagues say: fugedabowdit.)\n\nIf you are in charge of the website or account, just delete their comments. Don’t waste the time or damage the emotions of your readers. Replace their mindless ramble with a statement like:\n\nWe just found a Monsanto troll! That’s right. Monsanto hired and trained an online army to attack anyone who dares to reveal the dangers of GMOs and pesticides like Roundup. Their campaign is called “Let Nothing Go.” So we deleted a post that had all the markings of a troll: It was emotionally bullying or shaming. It used talking points made popular by Monsanto’s PR companies, including myths like GMOs feed the world, increase yield, reduce pesticide use, or are proven safe. And it was clearly uninformed. So it was either posted by a paid troll, or worse yet, some poor person who actually believes and emulates them.\n\nIf you can’t delete the offending post, here’s a similar type of statement you can post in response:\n\nLooks like we’ve found a Monsanto troll! If you haven’t heard, Monsanto hired and trained an online army to attack anyone who dares to reveal the problems with GMOs and pesticides like Roundup. Their campaign is called “Let Nothing Go.” You can decide for yourself if this is one of Monsanto’s minions. The tone of the trolls are typically emotionally bullying or shaming. They claim the high ground, pretending that science is on their side. They often roll out one of the many talking point myths made popular by Monsanto’s PR companies, pretending that GMOs feed the world, increase yield, reduce pesticide use, and are proven safe, etc. And they are clearly uninformed. So either this is a troll, or worse yet, some poor person who actually believes and emulates them.\n\nIf they engage you in an online argument (and if they’re a troll, they or their friends will) you can ignore the baseless claims and just use the opportunity to post links to one of the many informative articles that shreds Monsanto’s myths. Find lots of stuff to post at www.ResponsibleTechnology.org or on our Facebook page. Please subscribe to our newsletter and like our page so we can get you more ammunition—and stories of success.\n\nThis is a time to celebrate our victories, but we can’t let up. Let’s nail the coffin shut on this dangerous and irresponsible use of genetic engineering and protect future generations. With life itself at stake, we can withstand the buzzing of a few online gnats.", "opengraph": {"locale": "en_US", "type": "article", "title": "Monsanto’s Army of Online Bullies - Institute for Responsible Technology", "description": "By Jeffrey Smith There are hundreds, possibly thousands of them—paid to bully, shame, and endlessly argue with anyone posting a comment deriding GMOs or pesticides.  And when a high-profile person stands up to Monsanto’s technology, watch out.  The trolls swarm in and gang up. Take Marion Nestle, for example.  When a GMO propaganda film called […]", "url": "https://responsibletechnology.org/monsantos-army-of-online-bullies/", "site_name": "Institute for Responsible Technology", "article:published_time": "2018-07-02T17:49:14+00:00", "article:modified_time": "2023-01-02T19:02:47+00:00", "image": "https://responsibletechnology.org/wp-content/uploads/2023/01/Monsantos-Army-of-Online-Bullies.jpg", "image:width": "640", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.baumhedlundlaw.com/toxic-tort-law/monsanto-roundup-lawsuit/", "https://usrtk.org/wp-content/uploads/2017/04/MDLLetNothingGomotion.pdf", "https://www.facebook.com/ifpa.fitness/", "https://www.facebook.com/welovegv/", "http://responsibletechnology.org", "https://www.facebook.com/responsibletechnology/"], "authors": ["IRT News Team"], "publish_date": "2018-07-02T17:49:14+00:00"}