{"result_id": "172002", "URL": "https://responsibletechnology.org/jeffreys-take-brand-new-evidence-of-roundup-harm-new-existential-danger-from-gmos-2-0/?utm_source=rss&utm_medium=rss&utm_campaign=jeffreys-take-brand-new-evidence-of-roundup-harm-new-existential-danger-from-gmos-2-0", "timestamp": "2023-04-25 15:40:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://responsibletechnology.org/wp-content/uploads/2022/10/cropped-IRT-Favicon-512-32x32.jpg", "canonical": "https://responsibletechnology.org/jeffreys-take-brand-new-evidence-of-roundup-harm-new-existential-danger-from-gmos-2-0/", "encoding": "UTF-8"}, "image": null, "domain": "responsibletechnology.org", "title": "Jeffrey's Take: Brand New Evidence of Roundup Harm; New Existential Danger from GMOs 2.0", "cleaned_text": "The following are important links Jeffrey talks about in the video above:\n• New glyphosate papers point to “urgency” for more research on chemical impact to human health\n\nTranscription: Jeffrey’s Take:Brand New Evidence of Roundup Harm; New Existential Danger from GMOs 2.0\n\nThis transcript has been edited slightly for clarity\n\nHello, it’s Jeffrey Smith and I’ve got some new information for you. We have yet more ways that Roundup can kill you and cause disease and distress. And we have more ways that GMOs can do even worse. And we’ve got some solutions along the way. So don’t leave in the middle or you’ll be very depressed. First of all, Roundup – Monsanto bragged for years that Roundup or its chief poison glyphosate, blocked a certain pathway in plants, a certain metabolic function that killed the plants. It was called the shikimate pathway, but they said humans don’t have that same function – that same shikimate pathway, so Roundup is safe for humans. They used to say, you can drink it. Well, don’t. Now we know that Roundup does a lot of things. It’s a probable human carcinogen, it damages the microbiome, it can cause leaky gut and all these things.\n\nBut we also know that the shikimate pathway is near and dear to us inside of us because the microorganisms living inside of us use this little function, this little pathway, to produce really important substances, amino acids, that are needed for their maintenance and their survival. If you deprive those organisms, of the ability to create these amino acids, you can kill them. So it turns out that glyphosate, which is patented as an antibiotic, that’s right, glyphosate, which is sprayed on food is patented as an antibiotic. It kills the beneficial bacteria often by blocking the shikimate pathway, but not the nasty pathogens, which tend to not have the same type of mechanism. Finally, 10 days ago on November 14th, a Finnish University of Turkey in Finland researchers there created a program, an analysis where they looked at, which type of shikimate pathway – it’s actually the enzyme produced by the pathway – which of the microbiome organisms use the ones that glyphosate can block and which ones use ones that don’t.\n\nAnd they found that as a conservative estimate, that 54% of the core organisms that make up our microbiome should be, according to their analysis, sensitive, meaning vulnerable, meaning killable by glyphosate in our bodies. So they predicted that if we have glyphosate in our food and in our system, it will reduce the diversity of the microbiome. And it will cause a concentration, a build up over time of those organisms that are more resistant and can survive glyphosate, which are the pathogens – the nasty ones. Now this is their prediction based on their model, but we have more information. If you’ve been paying attention for a while, you know I’ve interviewed Kiran Krishnan, an expert of the microbiome who used what’s called the Shime Model, which is a fake human gut. First, they took the microbiome of a three-year-old living in Sweden, who I’ve never been exposed to antibiotics, vaccines or anything. And they inoculated the system. They fed this system for three weeks and then they put Roundup in for a couple of weeks and they compare the human microbiome in this fake human gut before and after they put it in the Roundup. And the prediction that was done by this Finnish Group and published on November 14, turns out to be true.\n\nThe diversity of the microbiome shrunk and the predominance of the nasties increased. Now, Kiran Krishnan has told me that about 80% of all human diseases are created or promoted by imbalanced microbiome. And so I said, okay, I’m going to read you 28 different conditions that people reported getting better from when they switched to non-GMO and largely organic foods. Can you tell me if the changes you saw in the microbiome from Roundups addition into this system, if they could exacerbate or create any of these conditions? A hundred percent of all 28 conditions reported by 3,256 people in a survey by the Institute for Responsible Technology, has conditions they got better from digestive problems, fatigue, obesity, overweight, brain fog, anxiety, depression, food, sensitivities, allergies, chronic pain, and right down to Parkinson’s, but there was also autism and cancer and high blood pressure and ADHD. Basically practically every chronic disease that’s being struggled with in Western society.\n\nAll linked to the changes in the microbiome caused by glyphosate, predicted by the model that was just published in the Journal of Hazardous Materials – I love that name, but already verified by Kiran Krishnan in a human gut microbiome model. Now the sensitivity of who we are, what our microbiome is and how it relates to the toxins around us was also made clear this month, when a study showed for children that the toxins (chemicals) in their home dictated which type of microbiome. So when there were a lot of particular toxins in their home (the products there), it reduced the diversity of their microbiome. And there are some fire retardants that are broken down by certain bacteria, certain microorganisms. They had fire retardants in their system and their microbiome had some of the bacteria to break down the fire retardants, which is not normally found in the human gut.\n\nSo one of the ways that the environment can either support us or cause us to have disease or kill us is how it interacts with the microorganisms inside of us. Now, even by interviews for Healing From GMOs and Roundup, I spoke to some doctors and researchers who were in awe of the microbiome. There was a whole new microbiome that comes into a woman’s breast if she has breast cancer. If they thought, “Oh, this is causing the tumor”, and they kill that bacteria, that the tumor actually spreads. The bacteria comes into help. There’s a fungus that comes into the brain for Alzheimer’s. And some people would interpret it as being the cause. But Dr. Zach Bush and others talk about how it’s actually a protective mechanism. In fact, Dietrich Klinghardt talks about there’s a microbiome of the human brain, not shared by other organisms.\n\nAnd if you reduce microbiome, the person’s intelligence actually goes there. So he talked about how herbs, he used the example of St. John’s Wort, that sometimes the studies show that it works and sometimes it doesn’t. But if you look at how they prepare the St. John’s Wort, where if they prepared it in such a way, that it would kill the microbiome and it was less effective or not effective. So his proposal is, it’s possible that the microbiome is drawn to certain herbs and that when we adjust the herbs, a major mode of action comes from that microbiome.\n\nI described it in this interview series the microbiome as the micro jedi army, that’s here to support us and life. So now I’m going to introduce another topic, which is far worse in its potential damaging impact than glyphosate in the food supply. You can reduce the glyphosate dramatically in your food supply by going organic. Organic does not allow the use of Roundup. It does not allow the use of GMOs. So eating organic is essential. Eat products that are grown according to the organic certification standards, whether they’re officially certified or not. You can grow your own products without certifying them. And of course, they’re not sprayed with Roundup and you’re not going to grow GMOs. So there are ways to minimize our exposure. But what happens if our gut microbiome is genetically engineered? Here’s the issue. We’re in a pandemic. We see how a virus has spread all over the world. Quickly, wreaking havoc, whether genetically engineered or not. If bacteria is genetically engineered and released anywhere it could spread around the world. In fact, there’s a research study that’s been hidden from view, but reported on by whistleblowers at the EPA that verified that bacteria genetically engineered and released spreads all around the world.\n\nWhat happens if they start to genetically engineer microbes, bacteria, viruses, yeast, algae, fungus, and release it and replace the normal microbiome? It can get inside our guts, inside our brains, inside the breast tissue. It can interfere with the normal functioning of this micro jedi army, which works in the soil and in the oceans. In fact, it even works in the atmosphere, condensing moisture into raindrops, frost and snow. There’s a film we’re going to release at the beginning of 2021. A short film, less than 15 minutes, which has some amazing near misses, examples of genetically engineered bacteria that could have caused not just a catastrophe, but a cataclysm.\n\nAn Existential threat. We just talk about two or three of these organisms. And now we know that you can genetically modify bacteria in the comfort of your own home, with a do-it-yourself kit on Amazon for $169. The power of that kit’s going to grow. The cost is going to go down and we will have a generation of people that can genetically engineer microbes and release them into the environment. For $2,000, build a lab that you can have all sorts of genetically modified microbes to release, or like Monsanto/Bayer is most certainly doing is filling up facilities with dozens of robots driven by artificial intelligence to mass produce various types of genetically modified genes that could end up being released and could change your microbiome or our world forever. This is an existential crisis that doesn’t require a lot of science to understand it’s arithmetic. What if you release 100,000 or 500,000 or a million new forms of genetically modified microbes over the next 5, 10, 20 years that you can’t recall?\n\nCertain strains are critical for life, critical for growth, critical for our evolution and our species. Scientists are just now confirming with a good sense of awe, how important our gut microbiome is. You may have heard of fecal transplants where they take a stool sample of one person, do some purification and put it inside another person. And then diseases are altered. I remember hearing from my friend, Dr. David Perlmutter, a family he knew had an autistic son and he had a fecal transplant. He was 12 and could hardly speak, two weeks later he was speaking in full sentences. They did experiences with rats. The fecal matter from thin rats created thin rats and the ones from fat rats created fat rats. Diseases were transferred or cured just by changing the microbiome. But the microbiome is not just inside us, it’s not just in our bodies.\n\nIt’s not just in our skin or in our brains – it’s all around the planet. And just as scientists now are becoming in awe of the power of the microbiome for us, some are realizing that the microbiome is critical for the growth of plants. It’s critical for the qualities of herbs, etc, and it’s open season on microbiomes. There are no checks and balances, no regulations, no requirements by this government or most governments that would prevent someone from altering the microbiome of the entire planet, of releasing bacteria or viruses or whatever in one place, knowing that once it’s released outdoors, it is uncontrollable.\n\nSo go to the link, www.protectnaturenow.com and please watch the two minute trailer and then sign up for updates. And we will let you know when the full 15 minute film or up to 15 minutes is released. And when we release it, we’re going to have some very specific measures you can take to help Protect Nature Now. Go to www.protectnaturenow.com and you will learn how to Protect Nature Now because right now, we have arrived at an inevitable time in human history when we can easily and inexpensively reorder the code of life and redirect the streams of evolution for all time. We are in a situation on a precipice of a generation that will decide whether future generations will inherit the products of the billions of years of evolution or not. Whether they inherit a Monsanto future, where instead of inheriting nature, they’re inheriting a replaced nature, replaced with a corrupted gene pool, the laboratory creations from around the planet, using a technology whose number one most covered result is surprise side effects.\n\nSo that’s the news, sobering, but let’s say that it’s inspiring us to step up to our responsibility. As humans, we have ventured into technologies that could devastate all living beings and all future generations. Let’s step into the dignified and honorable position of being a protector of all living beings and all future generations. Klous you say in the comments, maybe humans are doomed, I don’t think humans are doomed. In fact, I think that this challenge is very similar to the kind of catalytic trauma or requirements that occur in individuals’ lives, where they are forced to step up. They can’t ignore it or distract themselves any longer. Perhaps it is a health issue that someone uses to propel themselves forward. This is a survival issue, and I don’t think humans are doomed, I think humans are being tapped to step into the highest version of themselves. And I invite you to participate in that Magnificent New Normal, which is what I called the interview series recently where people can step up into the highest version of themselves.\n\nAll right, everyone again, www.protectnaturenow.com. Please, if you haven’t already, sign-up for updates, we’ll let you know when the film is being made available. And what you can do right now to support us immediately, is to donate. We’re a nonprofit 501C3, and we’re running on your generosity and on your behalf. Thank you, everyone. Safe Eating.", "opengraph": {"locale": "en_US", "type": "article", "title": "Jeffrey's Take: Brand New Evidence of Roundup Harm; New Existential Danger from GMOs 2.0 - Institute for Responsible Technology", "description": "The following are important links Jeffrey talks about in the video above: New glyphosate papers point to “urgency” for more research on chemical impact to human health The New Existential threat Transcription: Jeffrey’s Take:Brand New Evidence of Roundup Harm; New Existential Danger from GMOs 2.0 This transcript has been edited slightly for clarity (00:07): Hello, […]", "url": "https://responsibletechnology.org/jeffreys-take-brand-new-evidence-of-roundup-harm-new-existential-danger-from-gmos-2-0/", "site_name": "Institute for Responsible Technology", "article:published_time": "2022-07-29T22:58:42+00:00", "article:modified_time": "2022-11-30T00:16:48+00:00", "image": "https://responsibletechnology.org/wp-content/uploads/2022/11/Brand-New-Evidence-of-Roundup-Harm.jpg", "image:width": "640", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://usrtk.org/pesticides/new-glyphosate-papers-point-to-urgency-for-more-research-on-chemical-impact-to-human-health/", "https://protectnaturenow.com/", "https://usrtk.org/pesticides/new-glyphosate-papers-point-to-urgency-for-more-research-on-chemical-impact-to-human-health/", "https://www.responsibletechnology.org/exciting-news-additional-resources/", "https://www.sciencedaily.com/releases/2020/11/201112080906.htm", "https://in188.isrefer.com/go/hgmos/IRT/", "http://www.protectnaturenow.com", "http://www.protectnaturenow.com", "https://magnificentnewnormal.com/?idev_id=5007", "http://www.protectnaturenow.com", "https://protectnaturenow.com/subscribe/", "https://responsibletechnology.salsalabs.org/pnnmaindonatepage/index.html"], "authors": ["IRT News Team"], "publish_date": "2022-07-29T22:58:42+00:00"}