{"result_id": "174030", "URL": "https://www.investmentwatchblog.com/confronting-evil-heres-my-simple-challenge-to-dr-fauci-the-cdc-fda-big-pharma-democrats/", "timestamp": "2023-04-25 15:41:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.investmentwatchblog.com/wp-content/uploads/2023/02/logo81-150x130.jpg", "canonical": "https://www.investmentwatchblog.com/confronting-evil-heres-my-simple-challenge-to-dr-fauci-the-cdc-fda-big-pharma-democrats/", "encoding": "UTF-8"}, "image": null, "domain": "www.investmentwatchblog.com", "title": "Confronting Evil: Here’s My Simple Challenge to Dr. Fauci, the CDC, FDA, Big Pharma &#038; Democrats", "cleaned_text": "There is nothing left to debate. Anyone who is not brainwashed, or brain dead, can see that the Covid vaccine was the worst mistake in America’s history…world history…healthcare history…and the history of medicine.\n\nThe data is in from all over the world. You haven’t seen it? That’s because the media is guilty of covering up mass death on a scale no one can even imagine. But it’s only getting started. Wait for 2023.\n\nBut I have all the important data. Write me. I’m glad to send it. For free: WayneRoot@gmail.com.\n\nNo, I’m not a doctor, or a scientist. Yes, I’m a conservative TV and radio talk show host. But I’m not brainwashed, gaslighted, delusional, or easily scammed. I only search for raw truth- wherever it leads.\n\nI have seen the data (ie factual evidence) from all over the world that the Covid vaccine is the most dangerous and deadly vaccine in history- .\n\nI have seen the data that shows mortality rates are up by the most in history, far more than World War 2- and these deaths are up only since the Covid vaccines were introduced.\n\nI have seen the data that shows mortality rates are through the roof- but only among the vaccinated, and among the unvaccinated.\n\nI have seen the data that shows the more Covid boosters you take, the higher the death rate goes.\n\nI have seen the data that shows the highest death rate is among Millennials aged 25 to 54 (working age young adults forced by OSHA mandates to take the Covid vaccine).\n\nIf you’re not blind, you’ve noticed the media headlines of “sudden death.” The numbers are shocking. Every day more famous people are “dying suddenly and unexpectedly.” That’s the tip of the iceberg. They represent thousands per day dying suddenly. A phenomenon never seen in history until the vaccines.\n\nBut it’s not just death. It’s a pandemic of disability. It’s heart attacks, myocarditis, strokes, blood clots and an explosion of Stage 4 cancer. Millions of Americans will never work again. Who will pay for all this?\n\nThis is a tsunami of death and disability- all because these innocent Americans trusted government, Dr. Fauci, the CDC, FDA, Big Pharma and Democrat politicians who mandated the vaccines.\n\nBig mistake. As Ronald Reagan once said, “The 9 most terrifying words in the English language: I’m from the government and I’m here to help.”\n\nSo, here’s my challenge to all the liars, frauds, peddlers of propaganda, merchants of death, and kings and queens of cover-up and denial. It’s simple…\n\nI believe the Covid vaccine is deadly. This is now a crime scene. This is mass death on a grand scale. This vaccine death spiral is accelerating at warp speed. I believe we are about to experience the biggest mass die-off in world history in 2023.\n\nSo, prove me wrong. Make me eat crow. Make me look crazy. All you have to do is take a simple lie detector test.\n\nI ask the following suspects to take the test…Dr Fauci, CDC officials, FDA officials, Big Pharma CEOs and top Biden administration officials. Please answer these few simple questions and show us the results…Just answer YES or NO.\n• Did you personally take the Covid vaccine?\n• Did your spouse take it?\n• Did your children take it?\n• Does it protect against Covid?\n• Did you see the pre-trial vaccine results with large numbers of deaths, miscarriages, heart attacks and strokes?\n• Are you aware that the vaccine manufacturers wanted the pre-trial results sealed for 75 years?\n• In 1976 the entire swine flu vaccine program was suspended because 32 Americans died. Are you aware the VAERS list shows tens of thousands are dead from the Covid vaccine, more than all other vaccines in modern history COMBINED?\n• Were you aware that hundreds of studies show Hydroxychloroquine (HCQ) and Ivermectin work very effectively versus Covid and other viruses?\n• Are you aware millions of lives could have been saved with HCQ, Ivermectin and Vitamin D3, however if Big Pharma admitted any of them were effective versus Covid, they could not get emergency authorization to make billions of dollars with their experimental Covid vaccines?\n• Have you or your family ever used Ivermectin?\n\nWe can clear this right up with Dr. Fauci, top medical authorities, Big Pharma and Democrat politicians answering these questions on a lie detector test. If they pass, I’m a fool, I’m wrong and you’ll shut me up forever. You win, I lose. You’re heroes.\n\nSo, if you have nothing to hide, take the test.\n\nIf I’m right, and the needle shows they fail every question, this makes them all complicit in fraud and mass murder. They all knew from the start. They all certainly know the truth now. Yet they’re still pushing the vaccine.\n\nYou can take the lie detector test and prove me a fool. I dare you. I double dare you.\n\nBut no one will ever take me up on my challenge.\n\nThat’s because the debate is over. The jig is up. They can’t hide it anymore. The “sudden deaths” are piling up. Now it’s all about denial and cover-up.\n\nP.S. My favorite pronouns are “Crimes/Against/Humanity” “Mass/Murder” and “Prosecute/Fauci/And Everyone Involved”\n\nWayne Allyn Root is known as “the Conservative Warrior.” Wayne’s new #1 bestselling book is out, “The Great Patriot Protest & Boycott Book.” Wayne is now the host of two new TV shows on Real America’s Voice TV and Mike Lindell TV. He is also host of the nationally-syndicated “Wayne Allyn Root: Raw & Unfiltered” on USA Radio Network, daily from 6 PM to 9 PM EST. Visit ROOTforAmerica.com for more information.", "opengraph": {"type": "article", "title": "Confronting Evil: Here’s My Simple Challenge to Dr. Fauci, the CDC, FDA, Big Pharma &#038; Democrats"}, "tags": ["simple", "confronting", "fauci", "pharma", "democrats", "challenge"], "tweets": [], "movies": [], "links": ["https://telegram.me/share/url?url=https%3A%2F%2Fwww.investmentwatchblog.com%2Fconfronting-evil-heres-my-simple-challenge-to-dr-fauci-the-cdc-fda-big-pharma-democrats%2F&text=Confronting%20Evil%3A%20Here%E2%80%99s%20My%20Simple%20Challenge%20to%20Dr.%20Fauci%2C%20the%20CDC%2C%20FDA%2C%20Big%20Pharma%20%26%20Democrats", "https://gab.com/compose?url=https%3A%2F%2Fwww.investmentwatchblog.com%2Fconfronting-evil-heres-my-simple-challenge-to-dr-fauci-the-cdc-fda-big-pharma-democrats%2F&text=Confronting%20Evil%3A%20Here%E2%80%99s%20My%20Simple%20Challenge%20to%20Dr.%20Fauci%2C%20the%20CDC%2C%20FDA%2C%20Big%20Pharma%20%26%20Democrats", "https://www.investmentwatchblog.com/confronting-evil-heres-my-simple-challenge-to-dr-fauci-the-cdc-fda-big-pharma-democrats/", "https://gettr.com/share?text=Confronting%20Evil%3A%20Here%E2%80%99s%20My%20Simple%20Challenge%20to%20Dr.%20Fauci%2C%20the%20CDC%2C%20FDA%2C%20Big%20Pharma%20%26%20Democrats&url=https%3A%2F%2Fwww.investmentwatchblog.com%2Fconfronting-evil-heres-my-simple-challenge-to-dr-fauci-the-cdc-fda-big-pharma-democrats%2F", "https://www.investmentwatchblog.com/confronting-evil-heres-my-simple-challenge-to-dr-fauci-the-cdc-fda-big-pharma-democrats/", "https://rootforamerica.com/confronting-evil/", "mailto:WayneRoot@gmail.com", "https://www.investmentwatchblog.com/food-supply-three-states-to-recall-61k-pounds-of-ready-to-eat-sausage-poultry-company-recalls-over-11k-pounds-of-frozen-turkey-patties/", "https://www.investmentwatchblog.com/costco-reports-50-price-hikes-on-thousands-of-different-items-as-ceo-warns-of-difficult-times/", "https://www.investmentwatchblog.com/why-did-fox-news-fire-tucker-carlson/", "https://www.investmentwatchblog.com/big-corporations-out-of-nowhere-kroger-owned-frys-food-stores-kay-jewelers-hallmark-and-now-door-dash-have-all-sent-opt-out-of-mothers-day/", "https://www.investmentwatchblog.com/meet-the-team-that-killed-bud-light/", "https://www.investmentwatchblog.com/ray-epps-daughter-confirms-he-is-a-pedophile/", "https://www.investmentwatchblog.com/world-bank-whistleblower-karen-hudes-lost-her-life-soon-after-a-series-of-interviews-like-this-can-you-guess-why/", "https://www.investmentwatchblog.com/fda-vaccines-do-not-require-demonstration-of-the-prevention-of-infection-or-transmission/", "https://www.investmentwatchblog.com/bed-bath-beyond-files-for-bankruptcy-reddit-leftists-freaking-out-after-buying-stock-in-get-rich-quick-scheme-feel-sick/", "https://www.investmentwatchblog.com/the-dragon-is-on-fire/"], "authors": ["IWB"], "publish_date": "2022-12-18T08:25:40-05:00"}