{"result_id": "174032", "URL": "https://www.investmentwatchblog.com/the-worlds-first-vaccine-for-honeybees/", "timestamp": "2023-04-25 15:41:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.investmentwatchblog.com/wp-content/uploads/2023/02/logo81-150x130.jpg", "canonical": "https://www.investmentwatchblog.com/the-worlds-first-vaccine-for-honeybees/", "encoding": "UTF-8"}, "image": null, "domain": "www.investmentwatchblog.com", "title": "The world&#8217;s first vaccine for honeybees&#8230;", "cleaned_text": "The U.S. Department of Agriculture has approved a conditional license for a vaccine that protects honeybees against American Foulbrood disease, Dalan Animal Health, the biotech company behind the drug, announced Wednesday.\n\nThe disease, which is caused by Paenibacillus larvae, infects the bee’s larvae. Traditionally, when bees get sick with American Foulbrood disease, their hives, as well as any equipment in contact with the infected hives, must be incinerated, the statement said. This in turn, reduces the honeybee population, and in turn, affects the world’s food supply.\n\nThis new vaccine is the first of its kind to prevent this from happening, the biotech company said.\n\nThe vaccine, which contains a dead cell of the virus, is administered to the bees through the queen feed that worker bees consume. The worker bees then transfer the vaccine into the royal jelly and feed it to the queen. As a result, the vaccine gets deposited into her ovaries, giving larvae immunity when they hatch.\n\nThe drug is non-GMO, Dalan Animal Health said, and can be utilized in organic farming.", "opengraph": {"type": "article", "title": "The world&#8217;s first vaccine for honeybees&#8230;"}, "tags": ["vaccine", "honeybees", "world", "first"], "tweets": [], "movies": [], "links": ["https://www.businesswire.com/news/home/20230104005262/en/First-in-Class-Honeybee-Vaccine-Receives-Conditional-License-from-the-USDA-Center-for-Veterinary-Biologics"], "authors": ["IWB"], "publish_date": "2023-03-11T11:04:19-05:00"}