{"result_id": "174021", "URL": "https://www.investmentwatchblog.com/us-pharma-giant-merck-says-covid-vaccines-dont-work/", "timestamp": "2023-04-25 15:41:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.investmentwatchblog.com/wp-content/uploads/2023/02/logo81-150x130.jpg", "canonical": "https://www.investmentwatchblog.com/us-pharma-giant-merck-says-covid-vaccines-dont-work/", "encoding": "UTF-8"}, "image": null, "domain": "www.investmentwatchblog.com", "title": "US Pharma Giant Merck Says Covid Vaccines Don’t Work", "cleaned_text": "There’s no money to be made with being honest.\n\nWe’ve all heard of pasteurization. The milk is pasteurized to destroy germs. The juices are pasteurized for the same reason. Food is pasteurized for the same purpose. Pasteurization comes from the name of a famous 19th century French biologist, microbiologist and chemist named Louis Pasteur. You’ve probably heard of his name, at least in passing.\n\nBut it’s just as likely that you haven’t heard of another name, Antoine Bechamp. Bechamp was a prestigious French scientist who lived in the same period as Pasteur and was a colleague of his.\n\nAnd between the two there was an academic rivalry, but with repercussions on a practical level, in the daily life of every man who lives today.\n\nPasteur “created” the theory of germs, or microbes. Although it was not a new idea at the time, he put his name on it. According to this theory. the disease is caused by microbes that come from outside. Therefore, bacteria, viruses, fungi are to blame for the disease and therefore the efforts of doctors must be directed towards killing these enemies.\n\nBechamp, following his laborious research, came up with a completely opposite theory, namely that the disease is due to the human body, the “ground”, which because of food, thoughts and emotions, lifestyle etc. ends up coming off balance and in this state, it becomes vulnerable to external threats (microbes), which have an opportunistic character, and are pathogenic.\n\nTherefore, the cause of the disease is not external (microbes), but internal, due to the body, or the ground, that becomes “weak” and thus invites the manifestation of microbes.\n\nThese two theories gave rise to two methods, or ways, of healing. Pasteur’s theory makes you focus on microbes in order to kill them, while Bechamp’s theory leads you to restore the body’s balance so that it is no longer a favorable ground for microbes.\n\nPasteur’s theory was embraced by science and the pharmaceutical industry, and Bechamp’s theory was forgotten. That is why we are in this situation today.\n\nMankind is largely based today on Pasteur’s theory and the consequences are obvious: a sick world, a world ruled by fear of microbes, a world in which the illusory concept of “disease” rules.\n\nOn his deathbed, Pasteur admitted that his theory was wrong, saying, “Microbes are nothing, terrain is everything.” But this recognition no longer mattered.\n\nThe pharmaceutical industry has become a trillion-dollar industry, and there are no money to be made from people living healthy lifestyles.\n\nIf we would have followed Bechamp’s theory, the pharmaceutical industry, with its synthetic drugs and vaccines, would not have existed.\n\nAnd speaking of the “new plague” with a survival rate of 99,98%, France has reached one million people vaccinated against covid, after government authorities increased the rate of vaccination recently, given that in the first week of the campaign only 500 people had managed to get “immunized” . The French government aims to vaccinate 70 million people by August.\n\nHowever, in the same time, a British scientist says that people can remain contagious even after vaccination against Rona. No vaccine has ever been 100% effective, so there is NO GUARANTEED protection, according to “British” scientist Jonathan Van-Tam.\n\nSpeaking of clown-world, this is it folks.\n\nMeanwhile, in a parallel universe, US pharma giant Merck has just abandoned its experimental covid-19 vaccine projects, after it discovered little if any immune response in patients.\n\nIf you ask me, Merck is likely the first vaccine company to be honest about their results.\n\nSo basically they are admitting that the covid vaccine is the same as the flu shot, that is an ever changing moving target with minimal real life benefit…therefore covid is the flu…therefore the biggest and most costly lie ever perpetrated on the planet.\n\nBy the way, based on the numbers so far on the CDC website, you are 4 times more likely to suffer a “Health Impact Event” from the vaccine as you are to die of covid sans “vaccine” (even with all the inflated figures).\n\nRemember that Pfizer’s CEO is on record saying he’s not sure if their vaccine will prevent you from catching or transmitting the virus. But they are still pushing it because it’s a win-win situation for them, i.e.big bucks and zero liability.\n\nThere will never be a vaccine for the coronavirus. They have tried for decades and failed miserably. If they could make a vaccine for this thing, we would not have the common cold virus around (which is also a coronavirus).\n\nMerck sees the writing on the wall: massive deaths and serious side effects that will kill them from a PR standpoint.\n\nBelow is a site edited by MD’s and PhD’s on the merits of vitamin C and how it cures in large doses.\n\nVitamin C is cheap and easily made and it cures 100% of the time.", "opengraph": {"type": "article", "title": "US Pharma Giant Merck Says Covid Vaccines Don’t Work", "image": "https://www.investmentwatchblog.com/wp-content/uploads/2021/01/Screen-Shot-2021-01-24-at-6.58.49-AM.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://telegram.me/share/url?url=https%3A%2F%2Fwww.investmentwatchblog.com%2Fus-pharma-giant-merck-says-covid-vaccines-dont-work%2F&text=US%20Pharma%20Giant%20Merck%20Says%20Covid%20Vaccines%20Don%E2%80%99t%20Work", "https://gab.com/compose?url=https%3A%2F%2Fwww.investmentwatchblog.com%2Fus-pharma-giant-merck-says-covid-vaccines-dont-work%2F&text=US%20Pharma%20Giant%20Merck%20Says%20Covid%20Vaccines%20Don%E2%80%99t%20Work", "https://www.investmentwatchblog.com/us-pharma-giant-merck-says-covid-vaccines-dont-work/", "https://gettr.com/share?text=US%20Pharma%20Giant%20Merck%20Says%20Covid%20Vaccines%20Don%E2%80%99t%20Work&url=https%3A%2F%2Fwww.investmentwatchblog.com%2Fus-pharma-giant-merck-says-covid-vaccines-dont-work%2F", "https://www.investmentwatchblog.com/us-pharma-giant-merck-says-covid-vaccines-dont-work/", "http://www.orthomolecular.org/resources/omns/index.shtml", "https://www.investmentwatchblog.com/food-supply-three-states-to-recall-61k-pounds-of-ready-to-eat-sausage-poultry-company-recalls-over-11k-pounds-of-frozen-turkey-patties/", "https://www.investmentwatchblog.com/costco-reports-50-price-hikes-on-thousands-of-different-items-as-ceo-warns-of-difficult-times/", "https://www.investmentwatchblog.com/why-did-fox-news-fire-tucker-carlson/", "https://www.investmentwatchblog.com/big-corporations-out-of-nowhere-kroger-owned-frys-food-stores-kay-jewelers-hallmark-and-now-door-dash-have-all-sent-opt-out-of-mothers-day/", "https://www.investmentwatchblog.com/meet-the-team-that-killed-bud-light/", "https://www.investmentwatchblog.com/ray-epps-daughter-confirms-he-is-a-pedophile/", "https://www.investmentwatchblog.com/world-bank-whistleblower-karen-hudes-lost-her-life-soon-after-a-series-of-interviews-like-this-can-you-guess-why/", "https://www.investmentwatchblog.com/fda-vaccines-do-not-require-demonstration-of-the-prevention-of-infection-or-transmission/", "https://www.investmentwatchblog.com/bed-bath-beyond-files-for-bankruptcy-reddit-leftists-freaking-out-after-buying-stock-in-get-rich-quick-scheme-feel-sick/", "https://www.investmentwatchblog.com/the-dragon-is-on-fire/"], "authors": ["IWB"], "publish_date": "2021-01-25T12:14:14-05:00"}