{"result_id": "174015", "URL": "https://www.investmentwatchblog.com/according-to-mit-study-covid-19-skeptics-are-highly-informed-on-the-data/", "timestamp": "2023-04-25 15:41:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.investmentwatchblog.com/wp-content/uploads/2023/02/logo81-150x130.jpg", "canonical": "https://www.investmentwatchblog.com/according-to-mit-study-covid-19-skeptics-are-highly-informed-on-the-data/", "encoding": "UTF-8"}, "image": null, "domain": "www.investmentwatchblog.com", "title": "According to MIT Study, Covid-19 Skeptics are Highly Informed on the Data", "cleaned_text": "If you’re still wasting your time with the legacy media, you’re aware of the fact that people who doubt the official coronavirus narrative are portrayed as utter morons, crazy conspiracy theorists, antivaxxers, anti-science, etc.\n\nHowever, according to an MIT study conducted last March, which obviously went under the radar because it doesn’t support the narrative, the majority of the people in the “skeptic movement” are highly informed individuals, who are actually using official data to make their arguments.\n\nIt’s quite amazing that the establishment is actually admitting this, as the mainstream media is still framing skeptics as “right wing” retards who are victims of disinformation.\n\nThe current propaganda that’s being rolled out 24/7 is that you’re either in full agreement with the legacy media/the government (same thing), or you’re a retard who believes crazy conspiracy theories that make no sense.\n\nHence, the MIT study was ignored and buried. However, the study concluded that that people will believe the official narrative more the less information they have.\n\nA study from MIT shows how coronavirus skeptics have marshalled data visualizations online to argue against public health orthodoxy about the benefits of mask mandates. Such “counter-visualizations” are often quite sophisticated, using datasets from official sources and state-of-the-art visualization methods.\n\nThe researchers combed through hundreds of thousands of social media posts and found that coronavirus skeptics often deploy counter-visualizations alongside the same “follow-the-data” rhetoric as public health experts, yet the skeptics argue for radically different policies. The researchers conclude that data visualizations aren’t sufficient to convey the urgency of the Covid-19 pandemic, because even the clearest graphs can be interpreted through a variety of belief systems.\n\n“A lot of people think of metrics like infection rates as objective,” says Crystal Lee. “But they’re clearly not, based on how much debate there is on how to think about the pandemic. That’s why we say data visualizations have become a battleground.”\n\nAnd those visualizations weren’t sloppy. “They are virtually indistinguishable from those shared by mainstream sources,” says Satyanarayan. “They are often just as polished as graphs you would expect to encounter in data journalism or public health dashboards.”\n\n“It’s a very striking finding,” says Lee. “It shows that characterizing antimask groups as data-illiterate or not engaging with the data, is empirically false.”\n\nIf you read carefully the whole article, it appears like the MIT guys are actually demanding for the peasants to be given less information, because they are getting uppity☺.\n\nAnd I’ve noticed that trend lately, i.e. the current administration is very aggressive in calling for a total shutdown on any information that runs counter to the official vaxx narrative.\n\nObviously, if the mainstream narrative would be correct, there would be no need for censoring the people who don’t believe the threat of the supposed deadly virus. Also, if the deadly virus would be a real threat, there would be no need for 24/7 pro-vaxx propaganda.\n\nThe government and their mainstream media lackeys are saying that people who disagree with them are utter morons who need to have their thoughts controlled by the government, but the reality is that most people who are standing against the deadly vaxx are well informed on the data.\n\nI’ve been telling you for a while now that this whole pandemic hoax is based on deeply flawed PCR testing, as in everyone that tested positive or is suspected of having covid is recorded as a coronavirus death, regardless of the actual cause of death.\n\nThe tests are so bogus that an infection from almost anything will cause a positive result. Influenza, hepatitis, herpes, and any number of bugs that cause the common cold cause non-specific interference with a PCR test. That means that the presence of any of those will taint the test and cause a false positive, as the background genetic material will match certain portions of what the test is looking for to match with SARS-CoV-2.\n\nHere’s how it works. Let’s say you have a string from a DNA molecule that supposedly is a marker for SARS-CoV-2:\n\nIf this is in the sample, the test is positive.\n\nBut in the same sample you have:\n\nWhen you amplify those two sequences a few billion times, they will completely light up the supposed sequence for SARS-CoV-2, even though there is no real match.\n\nThat is how you get a false positive.\n\nWHICH IS WHY THE MANUFACTURERS OF EVERY SINGLE TEST STATE THAT THEY ARE TO BE USED FOR RESEARCH PURPOSES ONLY, AND CAN NOT BE USED TO DIAGNOSE AN ILLNESS!!!!\n\nLet’s now say that Delta has a mutation:\n\nIf you take the sample from the person and rerun it for the Delta variant, IT IS STILL POSITIVE FOR DELTA EVEN THOUGH IT ISN’T THERE.\n\nThere is only an outbreak of a variant because they are now looking for that variant. The labs follow the protocols they are told to follow and those protocols come from the people who have been manipulating this BS pandemic from the start.\n\nWe also know that only a tiny amount of covid vaccine related deaths are tracked/monitored via the ridiculous self-reporting system of the VAERS database, and it’s kind of shocking that these people pushing experimental gene therapy on millions of Americans, including kids, do not care about short term/medium/long term side effects, as they have no comprehensive monitoring system in place.\n\nMoreover, these liars claim that the vaccine works but it’s the unvaccinated spreading the virus among those vaccinated.\n\nNothing makes sense, and it’s not backed by any data.\n\nActually, according to official data, the vaccination campaign is a complete failure, with most of the deaths attributed to the virus now coming from those who got the vaccine.\n\nThe depopulation plot is the vaccine for the nothingburger Covid disease.\n\nThe real vaccine related death count from an audit of the VAERS reporting system is 45k in the US alone with 29% of those happening over the last two weeks.\n\nThe CDC clarified that 96% of reported Covid deaths died with other illnesses that would have also killed them, therefore Covid was not the primary cause of death.\n\nThe CDC also said that the remaining 4% may have also had comorbidities that were not specified. If you do take the 4% number as really dying of Covid, you get 24k dead after a year and a half of the outbreak, meaning the vaccines have killed twice as many people as the suppose disease in less than six months, while also killing people who would not have died had they been exposed to Covid.\n\nThe jabs already have a higher incidence of death and permanent disability over the supposed disease it is supposed to prevent.", "opengraph": {"type": "article", "title": "According to MIT Study, Covid-19 Skeptics are Highly Informed on the Data", "image": "https://www.investmentwatchblog.com/wp-content/uploads/2021/07/2021-07-20_08-11-14.png"}, "tags": ["covid", "study", "according", "highly", "skeptics", "informed"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Seriously, who the fuck is the White House to be dictating who should and should not be banned from social media platforms, to keep lists of who they think are the spreaders of \"misinformation,\" and then pressure companies they regulate to obey? This is pernicious shit: <a href=\"https://t.co/WlZlbCjlqT\">t.co/WlZlbCjlqT</a></p>\n<p>— Glenn Greenwald (@ggreenwald) <a href=\"https://twitter.com/ggreenwald/status/1416104577364017153?ref_src=twsrc%5Etfw\">July 16, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Peter Doocy just destroyed the White House's calls for censorship of \"disinformation\" on live TV.</p>\n<p>Psaki did not see this one coming.</p>\n<p>Watch the entire video. <a href=\"https://t.co/ITPrMfdPFW\">pic.twitter.com/ITPrMfdPFW</a></p>\n<p>— Benny (@bennyjohnson) <a href=\"https://twitter.com/bennyjohnson/status/1416095333877260292?ref_src=twsrc%5Etfw\">July 16, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">White House Reporter: \"On Covid misinformation, what's your message to platforms like Facebook?\"</p>\n<p>President Biden: \"They're killing people. The only pandemic we have is among the unvaccinated-and they're killing people.\" </p>\n<p>Thank you, <a href=\"https://twitter.com/POTUS?ref_src=twsrc%5Etfw\">@POTUS</a>. <a href=\"https://t.co/nxfi05uxjZ\">pic.twitter.com/nxfi05uxjZ</a></p>\n<p>— Amee Vanderpool (@girlsreallyrule) <a href=\"https://twitter.com/girlsreallyrule/status/1416369386819145731?ref_src=twsrc%5Etfw\">July 17, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">CNN's Dana Bash: Do you think Fox News is killing people with its anti-vax rhetoric?</p>\n<p>Surgeon General Vivek Murthy: \"My worry is that all of this is misinformation that’s floating around, it’s having a real cost that can be measured in lives lost and that is just tragic.\" <a href=\"https://t.co/0NFurVIB4s\">pic.twitter.com/0NFurVIB4s</a></p>\n<p>— Justin Baragona (@justinbaragona) <a href=\"https://twitter.com/justinbaragona/status/1416749870346612736?ref_src=twsrc%5Etfw\">July 18, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The newest Israeli data indicate ~complete vaccine failure on every level. Remember: Israel used only the <a href=\"https://twitter.com/pfizer?ref_src=twsrc%5Etfw\">@pfizer</a> mRNA shot and followed Pfizer dosing schedule. This data, from the <a href=\"https://twitter.com/IsraelMOH?ref_src=twsrc%5Etfw\">@IsraelMOH</a> telegram account, show nearly all serious cases and deaths are now among the vaccinated. <a href=\"https://t.co/ITqCE3bUrx\">pic.twitter.com/ITqCE3bUrx</a></p>\n<p>— Alex Berenson (@AlexBerenson) <a href=\"https://twitter.com/AlexBerenson/status/1416880859462971395?ref_src=twsrc%5Etfw\">July 18, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Israel?src=hash&amp;ref_src=twsrc%5Etfw\">#Israel</a> bans entry to <a href=\"https://twitter.com/hashtag/vaccinated?src=hash&amp;ref_src=twsrc%5Etfw\">#vaccinated</a> tourists in attempt to control spiking <a href=\"https://twitter.com/hashtag/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\">#COVID19</a> numbers.</p>\n<p>Report by <a href=\"https://twitter.com/RossTercatin?ref_src=twsrc%5Etfw\">@RossTercatin</a> <a href=\"https://t.co/hwNHiu0Lp1\">t.co/hwNHiu0Lp1</a></p>\n<p>— The Jerusalem Post (@Jerusalem_Post) <a href=\"https://twitter.com/Jerusalem_Post/status/1416946407441932290?ref_src=twsrc%5Etfw\">July 19, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://telegram.me/share/url?url=https%3A%2F%2Fwww.investmentwatchblog.com%2Faccording-to-mit-study-covid-19-skeptics-are-highly-informed-on-the-data%2F&text=According%20to%20MIT%20Study%2C%20Covid-19%20Skeptics%20are%20Highly%20Informed%20on%20the%20Data", "https://gab.com/compose?url=https%3A%2F%2Fwww.investmentwatchblog.com%2Faccording-to-mit-study-covid-19-skeptics-are-highly-informed-on-the-data%2F&text=According%20to%20MIT%20Study%2C%20Covid-19%20Skeptics%20are%20Highly%20Informed%20on%20the%20Data", "https://www.investmentwatchblog.com/according-to-mit-study-covid-19-skeptics-are-highly-informed-on-the-data/", "https://gettr.com/share?text=According%20to%20MIT%20Study%2C%20Covid-19%20Skeptics%20are%20Highly%20Informed%20on%20the%20Data&url=https%3A%2F%2Fwww.investmentwatchblog.com%2Faccording-to-mit-study-covid-19-skeptics-are-highly-informed-on-the-data%2F", "https://www.investmentwatchblog.com/according-to-mit-study-covid-19-skeptics-are-highly-informed-on-the-data/", "https://news.mit.edu/2021/when-more-covid-data-doesnt-equal-more-understanding-0304", "https://t.co/WlZlbCjlqT", "https://twitter.com/ggreenwald/status/1416104577364017153?ref_src=twsrc%5Etfw", "https://t.co/ITPrMfdPFW", "https://twitter.com/bennyjohnson/status/1416095333877260292?ref_src=twsrc%5Etfw", "https://twitter.com/POTUS?ref_src=twsrc%5Etfw", "https://t.co/nxfi05uxjZ", "https://twitter.com/girlsreallyrule/status/1416369386819145731?ref_src=twsrc%5Etfw", "https://t.co/0NFurVIB4s", "https://twitter.com/justinbaragona/status/1416749870346612736?ref_src=twsrc%5Etfw", "https://twitter.com/pfizer?ref_src=twsrc%5Etfw", "https://twitter.com/IsraelMOH?ref_src=twsrc%5Etfw", "https://t.co/ITqCE3bUrx", "https://twitter.com/AlexBerenson/status/1416880859462971395?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Israel?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/vaccinated?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/COVID19?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/RossTercatin?ref_src=twsrc%5Etfw", "https://t.co/hwNHiu0Lp1", "https://twitter.com/Jerusalem_Post/status/1416946407441932290?ref_src=twsrc%5Etfw", "https://www.investmentwatchblog.com/food-supply-three-states-to-recall-61k-pounds-of-ready-to-eat-sausage-poultry-company-recalls-over-11k-pounds-of-frozen-turkey-patties/", "https://www.investmentwatchblog.com/costco-reports-50-price-hikes-on-thousands-of-different-items-as-ceo-warns-of-difficult-times/", "https://www.investmentwatchblog.com/why-did-fox-news-fire-tucker-carlson/", "https://www.investmentwatchblog.com/big-corporations-out-of-nowhere-kroger-owned-frys-food-stores-kay-jewelers-hallmark-and-now-door-dash-have-all-sent-opt-out-of-mothers-day/", "https://www.investmentwatchblog.com/meet-the-team-that-killed-bud-light/", "https://www.investmentwatchblog.com/ray-epps-daughter-confirms-he-is-a-pedophile/", "https://www.investmentwatchblog.com/world-bank-whistleblower-karen-hudes-lost-her-life-soon-after-a-series-of-interviews-like-this-can-you-guess-why/", "https://www.investmentwatchblog.com/fda-vaccines-do-not-require-demonstration-of-the-prevention-of-infection-or-transmission/", "https://www.investmentwatchblog.com/bed-bath-beyond-files-for-bankruptcy-reddit-leftists-freaking-out-after-buying-stock-in-get-rich-quick-scheme-feel-sick/", "https://www.investmentwatchblog.com/the-dragon-is-on-fire/"], "authors": ["IWB"], "publish_date": "2021-07-20T08:12:49-04:00"}