{"result_id": "175018", "URL": "https://iowaclimate.org/2022/05/06/pfizergate-new-documents-confirm-vaccine-goes-to-liver-spleen-and-ovaries-in-animal-studies/", "timestamp": "2023-04-25 15:42:17 CEST+0200", "meta": {"description": "JudicialWatch has obtained 466 pages of information through FOIA, which should have been available to everyone all along  — what is  “Informed Consent”? Not only does the vaccine take much longer to be degraded and removed from our bodies but it spreads far from the injection site and concentrates in the liver, spleen, adrenal glands…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2022/05/06/pfizergate-new-documents-confirm-vaccine-goes-to-liver-spleen-and-ovaries-in-animal-studies/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "PfizerGate: new documents confirm vaccine goes to liver, spleen and ovaries in animal studies", "cleaned_text": "JudicialWatch has obtained 466 pages of information through FOIA, which should have been available to everyone all along — what is “Informed Consent”?\n\nNot only does the vaccine take much longer to be degraded and removed from our bodies but it spreads far from the injection site and concentrates in the liver, spleen, adrenal glands and ovaries. And Pfizer knew this, but hid it, and all the agencies that were supposed to protect us didn’t demand the data, or didn’t report it.\n\nDon’t underestimate the effect it will have on parents who find out that the vaccines deliver the bioweapon spikes directly to their daughters ovaries with unknown consequences. This is a message we can share that will create waves. We can’t take back an injection, but we can stop future ones. It’s a Redpill Moment. People need to understand that the institutions we once trusted — like the CDC, FDA, TGA, Medical unions, media groups, and University academics are failing dismally to protect us and deserve to razed.\n\nThey either didn’t know where the vaccine particles went in the human body, and failed to ask, or worse, they did know:\n\n(Washington, DC) – Judicial Watch announced today that it received 466 pages of records from the Department of Health and Human Services (HHS) regarding biodistribution studies and related data for the COVID-19 vaccines that show a key component of the vaccines developed by Pfizer/BioNTech, lipid nanoparticles (LNPs), were found outside the injection site, mainly the liver, adrenal glands, spleen and ovaries of test animals, eight to 48 hours after injection.\n\nPfizer/BioNTech’s mRNA-based COVID vaccine relies on LNPs as a delivery system. Pfizer said in a January 10, 2022 press release that Acuitas Therapeutics LNP technology is used in COMIRNATY, the Pfizer/BioNTech COVID-19 vaccine.\n\nJudicial Watch also received 663 pages of records from HHS regarding biodistribution studies and related data for COVID-19 vaccines, which show that Johnson & Johnson relied on studies showing that vaccine DNA particles and injected virus particles were still present in test animals months after injection.\n\nBiodistribution is the key word that describes where the vaccines end up — which tissues and organs are those spikes delivered to?\n\nJohnson and Johnson are also implicated. They did not include studies in their application to the FDA. In February last year Pfizer did not even do the studies.\n\nThe Pfizer records include a report, which was approved in February 2021, on the animal trials on the distribution of the Pfizer COVID vaccine in rat subjects, in a section titled “Safety Pharmacology,” the report notes, “No safety pharmacology studies were conducted with BNT162b2 [the BioNTech vaccine] as they are not considered necessary…”\n\nPfizer knew that the various Lipid Nano Particles (LNP’s) — which are the delivery vehicle for the spike RNA — end up in liver, adrenal glands, spleen and ovaries within 48 hours of injection. The most common spot was the liver. (Up to 18% of the particles end up there.)\n\nThe same Pfizer study admitted that there were no genotoxic studies, or carcinogenicity studies because problems were “not expected”.\n\nAcuitas Therapeutics paid for a study, in November 2020 of the effect of the LNP’s in rats that showed these particles were going to the liver and other tissues. Though Johnson and Johnson records show there was a study as long ago as 2007 that showed the adenovirus vaccines in rabbits ended up in the spleen and iliac lymph node. So it’s not just the mRNA vaccines that spread further than they are supposed to. Adenovirus vector vaccines include AstraZenica, Johnson and Johnson, Sputnik (Russian) and Convidecia (a Chinese vaccine).\n\nThe latest tranche of secret Pfizer docs is also out.", "opengraph": {"type": "article", "title": "PfizerGate: new documents confirm vaccine goes to liver, spleen and ovaries in animal studies", "url": "https://iowaclimate.org/2022/05/06/pfizergate-new-documents-confirm-vaccine-goes-to-liver-spleen-and-ovaries-in-animal-studies/", "description": "JudicialWatch has obtained 466 pages of information through FOIA, which should have been available to everyone all along  — what is  “Informed Consent”? Not only does th…", "article:published_time": "2022-05-06T07:33:20+00:00", "article:modified_time": "2022-05-06T07:33:20+00:00", "site_name": "Iowa Climate Science Education", "image": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.judicialwatch.org/documents/jw-v-hhs-fda-pfizer-biontech-vaccine-prod-3-02418/", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-enters-agreement-acuitas-therapeutics-lipid", "https://www.judicialwatch.org/documents/jw-v-hhs-fda-johnson-johnson-vaccines-prod-1-02418/", "https://www.judicialwatch.org/documents/jw-v-hhs-fda-pfizer-biontech-vaccine-prod-3-02418-pgs-3-36/", "https://www.judicialwatch.org/documents/jw-v-hhs-fda-pfizer-biontech-vaccine-prod-3-02418-pgs-63-139/", "https://en.wikipedia.org/wiki/Viral_vector_vaccine", "https://phmpt.org/pfizers-documents/"], "authors": [], "publish_date": "2022-05-06T07:33:20+00:00"}