{"result_id": "175024", "URL": "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/", "timestamp": "2023-04-25 15:42:21 CEST+0200", "meta": {"description": "All of the arguments telling you to wear masks, that lockdowns are necessary, that social distancing should be required, and that you should get vaccinated are “absolutely nonsense,” says renowned medical scientist and immunologist Dr. Sucharit Bhakdi. ___________ Award-winning virologist Dr. Sucharit Bhakdi elucidates why the rushed #Covid19 vaccine trials represent the world’s largest medical…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Covid-19 vaccine “downright dangerous,” says renowned immunoligist – Videos", "cleaned_text": "All of the arguments telling you to wear masks, that lockdowns are necessary, that social distancing should be required, and that you should get vaccinated are “absolutely nonsense,” says renowned medical scientist and immunologist Dr. Sucharit Bhakdi.\n\n ___________\n\nAward-winning virologist Dr. Sucharit Bhakdi elucidates why the rushed #Covid19 vaccine trials represent the world’s largest medical experiment perpetrated on the globe in human history.\n\nHe thinks that although the masks, lockdowns and social distancing requirements have been highly injurious to the public and not suited to the science, that the vaccination requirements are even worse. All of these so-called pandemic reducers are based on “zero science,” Dr. Bhakdi maintains.\n\nDr. Bhakdi, retired microbiologist and immunologist, is co-author of the book Corona – False Alarm?\n\nAll of the arguments telling you to wear masks, that lockdowns are necessary, that social distancing should be required, and that you should get vaccinated are “absolutely nonsense,” says Professor Bhakdi.\n\nWhen Laura Ingraham brings up Dr Anthony Fauci’s statement that 75 percent of Americans are going to have to get vaccinated in order to reach herd immunity, Dr Bhakdi responds “What utter nonsense.”\n\n“I know that Dr. Fauci is a renowned medical scientist and immunologist, but what he says has to be wrong,” says Bhakdi. “Someone who says this has not the slightest inkling of the basics of immunology, and this is very very surprising for someone of Dr Fauci’s standing.”\n\nIf you read my book, asserts Dr Bhakdi, “in two hours you will know more than Fauci.”\n\nSo you think the Covid-19 vaccine is not necessary? asks Laura.\n\n“I think it is downright dangerous,” responds Dr Bahkdi. “And I warn you, if you go along these lines, you are going to go to your doom.”\n\nIn a different video (link below), Dr. Bhakdi details why the public should not only doubt the vaccine’s efficacy, but also why we should be wary of unstudied dangers.\n\nWhen asked if he is anti vaccine, Dr Bahakdi responds, “Of course not. I am pro-vaccine. I’ve been teaching this for 30 years. One of the first things I tell my students is that the vaccines that work; against tetanus, against dyptheria, against polio, have been a Godsend…. But if a toxin is doomed to fail, and doomed to claim lives… you have to do everything to stop it. And this is the case with this damned Covid-19 vaccine.”\n\nWhy take it if you are under 70? he wonders. The death rate for those under 7o who get Covid is less than 0.1 percent, says Dr Bhakdi. If you catch it and you have no serious pre-existing illness, “you are virtually unable to die.”\n\nAre these vaccines any better than nature? Even without vaccines, we’re already looking at a 99.97 percent survival rate. (That’s not the survival rate for people in general, that’s the survival rate for those who actually catch it.)\n\nThe trials have not proven that the vaccines are efficacious, says Dr Bhakdi. “We don’t even know if these vaccines will save lives.”\n\n“The permission to use this vaccine is criminal,” insists Dr Bhakdi. And he uses the word “criminal” more than once. “I will say this before any audience in the world, and before any court in the world.”\n\nHydroxychloroquine and ivermectin are so safe, and so easy to use, and so efficaceous, says Dr Bhakdi, why use this more expensive and untested method?\n\n“The world is being turned into an animal experiment. And you, and our children, are the animals being tested. This is so scandalous. And so horrifying.”\n\nBeginning at about halfway through the video, Dr Bhakdi gives a wonderful and very simple description of how the body’s natural defense forces send an army of killer lypmphocytes to destroy any cells that contain the virus.\n\n“And you can bet your life,” says Dr Bhakdi, “that you already have these killer lymphocytes in your body…. and that is why we believe it is so damned difficult to die of this virus.”\n\nI think you will really want to watch this video:\n\n https://thehighwire.com/videos/the-biggest-experiment-ever-done/\n\nThanks to Zara for this video\n\nNote: When the book Corona – False Alarm? first came out in Germany, it became an instant best seller.\n\nThe post Covid-19 vaccine “downright dangerous,” says renowned immunoligist – Videos appeared first on Ice Age Now.", "opengraph": {"type": "article", "title": "Covid-19 vaccine “downright dangerous,” says renowned immunoligist – Videos", "url": "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/", "description": "All of the arguments telling you to wear masks, that lockdowns are necessary, that social distancing should be required, and that you should get vaccinated are “absolutely nonsense,” says renowned …", "article:published_time": "2021-03-19T18:36:27+00:00", "article:modified_time": "2021-03-19T18:36:27+00:00", "site_name": "Iowa Climate Science Education", "image": "http://img.youtube.com/vi/RZDr3CsfolA/0.jpg", "image:secure_url": "https://img.youtube.com/vi/RZDr3CsfolA/0.jpg", "image:width": "222", "image:height": "315", "locale": "en_US", "video:type": "text/html", "video": "http://www.youtube.com/embed/RZDr3CsfolA", "video:secure_url": "https://www.youtube.com/embed/RZDr3CsfolA", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "845", "height": "476", "embed_code": "<iframe class=\"youtube-player\" width=\"845\" height=\"476\" src=\"https://www.youtube.com/embed/RZDr3CsfolA?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/RZDr3CsfolA?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en&autohide=2&wmode=transparent"}], "links": ["https://thehighwire.com/videos/the-biggest-experiment-ever-done/", "https://www.iceagenow.info/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/", "https://www.iceagenow.info", "https://ift.tt/3r1mDEL", "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/#print", "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/?share=facebook", "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/?share=twitter", "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/?share=reddit", "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Covid-19%20vaccine%20%E2%80%9Cdownright%20dangerous%2C%E2%80%9D%20says%20renowned%20immunoligist%20%E2%80%93%20Videos&body=https%3A%2F%2Fiowaclimate.org%2F2021%2F03%2F19%2Fcovid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos%2F&share=email", "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/?share=pinterest", "https://iowaclimate.org/2021/03/19/covid-19-vaccine-downright-dangerous-says-renowned-immunoligist-videos/?share=tumblr"], "authors": [], "publish_date": "2021-03-19T18:36:27+00:00"}