{"result_id": "175030", "URL": "https://iowaclimate.org/2021/12/09/feeling-confident-pfizer-vax-data-is-so-good-fda-wants-to-hide-it-til-2096/", "timestamp": "2023-04-25 15:42:24 CEST+0200", "meta": {"description": "In October the FDA asked the judge to let them have 55 years to release all the data, but now Aaron Siri, a lawyer connected to the FOIA, reports they want to hide some of the data for 75 years. Mere mortals could lose their jobs and their houses immediately if they won’t take the…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/12/09/feeling-confident-pfizer-vax-data-is-so-good-fda-wants-to-hide-it-til-2096/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Feeling confident? Pfizer vax data is so good, FDA wants to hide it til 2096!", "cleaned_text": "In October the FDA asked the judge to let them have 55 years to release all the data, but now Aaron Siri, a lawyer connected to the FOIA, reports they want to hide some of the data for 75 years.\n\nMere mortals could lose their jobs and their houses immediately if they won’t take the vax, but something must be pretty bad about the vaccine trial results that both the FDA and Pfizer now want to keep the data hidden until 2096.\n\nApparently, the FDA have 451,000 pages of information related to their decision to license the Pfizer vaccine. The FDA reviewed all this in just 108 days — which works out to the committee going through 4,176 pages a day. More, if they took weekends off.\n\nNothing says “Trust us” like hiding the data til 2096.\n\nTry to imagine what circumstances would limit the FDA to 500 pages a month:\n• They are still using dial up.\n• They still need to read the pages.\n• They are afraid of being put in jail.\n\nApparently, the FDA or US Food and Drug Administration is not just covering up for Pfizer, but covering it for itself. The FDA is a government agency that asked for $6.5b from the American taxpayer this year. More than the money, it asked 300 million Americans to inject a experimental drug that the FDA said was safe and effective.\n\nThe fed gov’t gives Pfizer billions in taxpayer money + makes Americans take its product + won’t let Americans sue for harm + shields disclosure of its licensure documents = 1984\n\nA prior post explained that the FDA has asked a federal judge to make the public wait until the year 2076 to disclose all of the data and information it relied upon to license Pfizer’s COVID-19 vaccine. Literally, a 55-year delay. My firm, on behalf of PHMPT, asked that this information be disclosed in 108 days – the same amount of time it took for the FDA to review and license Pfizer’s vaccine.\n\nThe Court ordered the parties to submit briefs in support of their respective positions by December 6, 2021. The FDA’s brief, incredibly, doubles down. It now effectively asks to have until at least 2096 to produce the Pfizer documents. Not a typo. A total of at least 75 years.\n\nThe whole point of FOIA is transparency:\n\nThe Executive Branch gave Pfizer $1.95 billion in taxpayer funds to promote development of its vaccine through an advance-purchase agreement. (App000340 ¶ 11.) It then paid Pfizer more than $15.7 billion collected from the American people to purchase that product. (App000340-App000341 ¶¶ 12-16.) Thereafter, it spent $18.75 billion more of the American people’s money promoting that product. (App000341 ¶¶ 17-19.) Yet, when it comes to being transparent with those same American people, the FDA claims it cannot muster the resources to timely produce the same documents it reviewed for licensure in 108 days. Just as the government found the resources for Operation Warp Speed, it must now do the same to produce these critical documents with the same warp speed.\n\nIt would be fair for anyone mandated to receive the vaccine to agree, as soon as all the FDA documents are released. It’s just informed consent…", "opengraph": {"type": "article", "title": "Feeling confident? Pfizer vax data is so good, FDA wants to hide it til 2096!", "url": "https://iowaclimate.org/2021/12/09/feeling-confident-pfizer-vax-data-is-so-good-fda-wants-to-hide-it-til-2096/", "description": "In October the FDA asked the judge to let them have 55 years to release all the data, but now Aaron Siri, a lawyer connected to the FOIA, reports they want to hide some of the data for 75 years. Me…", "article:published_time": "2021-12-09T18:33:38+00:00", "article:modified_time": "2021-12-09T18:33:38+00:00", "site_name": "Iowa Climate Science Education", "image": "https://joannenova.com.au/wp-content/fda-logo.width-960-300x155-1.png", "image:alt": "FDA Logo US Food and Drug Administration", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://joannenova.com.au/2021/11/nothing-says-trust-us-like-we-need-to-hide-the-data-til-2076-the-fda-buries-pfizer-results/?utm_source=rss&utm_medium=rss&utm_campaign=nothing-says-trust-us-like-we-need-to-hide-the-data-til-2076-the-fda-buries-pfizer-results", "https://substack.com/profile/32334676-aaron-siri", "https://www.fda.gov/", "https://www.fda.gov/news-events/congressional-testimony/presidents-fy2022-budget-request-fda-06102021", "https://substack.com/profile/32334676-aaron-siri", "https://www.sirillp.com/wp-content/uploads/2021/11/020-Second-Joint-Status-Report-8989f1fed17e2d919391d8df1978006e.pdf"], "authors": [], "publish_date": "2021-12-09T18:33:38+00:00"}