{"result_id": "175015", "URL": "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/", "timestamp": "2023-04-25 15:42:15 CEST+0200", "meta": {"description": "“it is the vaccination that is creating the variants” (Montagnier 2021) Virologist Luc Montagnier, the Nobel Prize Winner in Medicine, 2008 Leo Goldstein, preprint,  v. 2021-06-30 Summary SARS-COV-2 has surprised experts by its fast evolution and ability to evade vaccine-induced immunity while simultaneously increasing its infectivity. The explanation might lie in the extremely unlucky selection…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Guided Evolution of the Coronavirus", "cleaned_text": "“it is the vaccination that is creating the variants” (Montagnier 2021)\n\n Virologist Luc Montagnier, the Nobel Prize Winner in Medicine, 2008\n\nSARS-COV-2 has surprised experts by its fast evolution and ability to evade vaccine-induced immunity while simultaneously increasing its infectivity. The explanation might lie in the extremely unlucky selection of S-protein (the spike) as the vaccine antigen. S-protein has a ridiculously small (~200 amino-acids) immunodominant region RBD, with epitopes mostly attracted to two sites of it. Further, the epitopes of the monomer S-protein from vaccines and trimer S-protein in the real coronavirus slightly differ.\n\nThe huge number of infected people and failure to treat patients with effective antivirals are also responsible for the fast the viral evolution. Vaccination with very narrow acting vaccines allows the coronavirus variants to escape vaccine elicited immunity. The use of vaccines and protocols that do not prevent infection and virus shedding contribute to the coronavirus escape from vaccine-elicited immunity. This process is self-accelerating – partially resistant variants infect vaccinated people in larger titers and shed for longer time, with a strong selection toward mutations toward escape from vaccine immunity.\n\nSARS-COV-2 is escaping vaccine-elicited immunity (Wang et al. 2021) (Eguia et al. 2021) (Jia and Gong 2021). Here, the word ‘vaccine’ means any of the vaccines against COVID-19, developed and emergency authorized in the US, Canada, and Western Europe, all of which target the spike protein.\n\nWhen expressed in March 2021 (covexit 2021) (Bossche 2021), this idea was controversial. Dr. Mike Yeadon (MANY ed. Dryburgh 2021), a critic of mass vaccination, pointed out the conventional knowledge that different hosts generate different antibodies and T-cells, targeting different epitopes of the virus. Thus, conventional wisdom suggested, even if a variant with a set of mutations evading antibodies develops in one person, it would have no advantage in others, who have different antibodies. Influenza viruses escape immunity by swapping segments, which coronaviruses do not have, so their example is not relevant.\n\nMost importantly, the spike protein of SARS-COV-2, selected by the vaccine developers in an emergency, was a bad choice, in hindsight. It has one immunodominant area – receptor binding domain (RBD) – targeted by most of the neutralizing antibodies (Premkumar et al. 2020) (Li et al. 2020). RBD has only about ~200 amino acids. Moreover, the epitopes are not distributed equally, but mostly clustered around cites, 456 and 484, for most people (Greaney et al. 2021). Although the naturally developed neutralizing antibodies also target a few other epitope-sized “hot areas” on the spike (Li et al. 2020), mRNA vaccine-elicited antibodies focus almost exclusively on the RBD (Greaney et al. 2021). Additionally, RBD is one of the most frequently mutating parts of the coronavirus.\n\nThis is why a single point mutation E484K was so damaging to the immune response. Coronavirus variant B.1.351 (“South African”), containing this mutation, decreased Moderna’s vaccine efficacy so much that it had to develop and ship a special version mRNA-1273.351 to South Africa.\n\nThe natural spike protein is trimer. The vaccines cause generation of spike protein monomer. There are two types of epitopes: linear epitopes, which are consecutive sequences of amino-acids and do not depend on the 3D form of the protein (except when disrupted), and conformational epitopes, which are entirely dependent on the 3D form of the protein. The conformational epitopes in the trimer are different than in the monomer or have lower binding energy. A recent study (Li et al. 2021) found only conformational epitopes in the RBD and no linear ones. It is good luck that the antibodies elicited against the monomer spike protein work against the trimer spike, but they might be suboptimal.\n\nThere are other factors that facilitate the accelerated evolution of the coronavirus toward vaccine immunity escape.\n\nFirst, there is a huge number of people in the world, representing a huge Petri dish for the coronavirus evolution.\n\nSecond, vaccination and infection are happening simultaneously, which allows the coronavirus to practice survival of the fittest against vaccine-elicited immunity. It is aggravated by the vaccination protocol. The vaccines require two doses to achieve maximum efficacy. The first dose weakens the innate immunity and other antiviral mechanisms (Stewart et al. 2021) for about a week. After this, and until a couple of weeks after the second dose, the person is half vaccinated, essentially acting as the training ground for the selection of the fittest variants, which can better resist the vaccine produced immunity and to infect others.\n\nThird, the hosts who are vaccinated but become infected and develop symptomatic illness are ideal for coronavirus variant selection toward escape. If the immunity is strong enough to prevent symptomatic disease, the virus shedding is insignificant, and the virus amount and time of infection are too small for selection. If the host is not vaccinated, no selection toward escape happens.\n\nThe SARS-COV-2 evolution was initially slow, as expected, then accelerated when mass vaccination started (Anastassopoulou et al. 2021). Vaccine escape could have started only in 2021. The AstraZeneca vaccine, which was administered with a big delay between the first and second doses, might have been a large factor. It supplied the coronavirus with a huge population pool of the ideally half-vaccinated hosts.\n\nTwo doses of Pfizer and Moderna mRNA vaccines had 95% efficacy against 2020 variants. They have much lower effectiveness against currently prevalent variants, as even acknowledged by the CDC (Oliver 2021), p.23 .\n\nVaccine protection decreases after a certain time following the vaccination. Thus, some fully vaccinated individuals are likely to become a training ground for the evolution of new vaccine-resistant variants. The better a variant is at evading vaccine-elicited immunity, the more likely it is to infect and cause symptomatic disease in a vaccinated person, and thus, evolve toward vaccine escape faster. Therefore, coronavirus evolution in the vaccinated population will be self-accelerating.\n\nUnusually, new variants, evolving under the pressure of vaccine-elicited immunity, contain mutations that make them not only more evasive, but also more infective (Prévost and Finzi 2021). It is expressed in higher binding free energy between the RBD of each variant and the ACE2 (Wang et al. 2021). This might be due to the abundance of mutations that significantly increase variant survival against vaccine immunity, which compete against each other in each host and in the whole population.\n\nWhen antibody immunity fails, T-cells become the first line of immune defense. They will face variants that have at least partially escaped antibody immunity. T-cell generation by the spike protein vaccines was also reported as disappointing (Hellerstein 2020). T-cell immunity can also be evaded by SARS-COV-2 (Agerer et al. 2021), sometimes by the same mutation that evades antibody immunity and even increases infectivity (Motozono et al. 2021). But other studies show that the T-cell response is robust (Tarke et al. 2021).\n\nNatural immunity, which comprises dozens of antibodies and T-cells in each person, differs among persons, and targets multiple structural and non-structural proteins of the coronavirus, is like a wall, efficiently stopping the coronavirus. The current global vaccination campaign is like a series of stairs for the coronavirus – each stair slows down its march, but together they form a staircase, helping the virus evolve to higher and more dangerous levels. How high remains a question here.\n\nCOVID-19, in some of the people who were vaccinated before achieving natural immunity, is likely to be exacerbated by antibody-dependent enhancement (Goldstein 2021).\n\nHindsight is twenty-twenty, as far as the design of the vaccines. However, the application of the vaccines is happening right now and can be corrected. In four words: Treat more, vaccinate less, do not vaccinate healthy young people.\n\nIncluding into vaccination protocols an antiviral prophylaxis, starting a week before the first jab and ending a week after the last one, would minimize the risk of infection during the time in between vaccinations. This would of course require first acknowledging that effective prophylaxis exists.\n\nIn the short term, public health authorities should not overreact to the growth in positive PCR tests (mislabeled as cases), among the population that became immune by exposure or vaccination. Mass vaccination started in January 2021 (counting by the second dose), and vaccine-elicited immunity is still OK, even against most variants. Even when infected, healthy persons are unlikely to develop severe COVID-19 disease or to shed significant amounts of the virus. This might change if more resistant and/or infective variants spread wider.\n\nUnfortunately, NIH Director Dr. Francis Collins used (Greaney et al. 2021) to insinuate that vaccine elicited immunity is broader than natural one (Collins 2021). This statement is almost exactly the opposite to the study’s findings.\n\nAnother factor is the Inactivated virus vaccines, apparently preferred in China, but also developed by Russia and India. They have been widely exported and used. They are less efficacious, but the immunity elicited by them is more robust against the variants resistant to the spike protein mRNA vaccines. These inactivated virus vaccines elicit antibodies against N protein (and, probably the M protein). Will the new coronavirus variants be able to evolve past them, and to threaten naturally acquired immunity?\n\nAnother open question is how the artificial origin of SARS-COV-2 impacts its evolution.\n\nFor SARS-COV-2, higher infectivity also means higher virulence. If it continues evolving toward higher infectivity, it will become quite deadly.\n\nThe highest body count is likely to be in Africa, as Bill Gates thought. Many people away from the big cities have never encountered the coronavirus and have no immunity to it. The new variants of concern, more transmissible and virulent, might devastate African villages like bushfires.\n\nAnastassopoulou C, Manoussopoulos Y, Lampropoulou V, Tsakris A. Glimpses into evolutionary trajectories of SARS-CoV-2: emerging variants and potential immune evasion routes. Future Microbiology. 2021 May 1. https://www.futuremedicine.com/doi/full/10.2217/fmb-2020-0300\n\nBossche GV. The science behind the catastrophic consequences of thoughtless human interventon in the Covid-19 pandemic. 2021; https://dryburgh.com/wp-content/uploads/2021/03/Geert_Vanden_Bossche_Scientific_Evidence_Final_March_13_2021.pdf\n\nCollins F. How Immunity Generated from COVID-19 Vaccines Differs from an Infection. NIH Director’s Blog. 2021. https://directorsblog.nih.gov/2021/06/22/how-immunity-generated-from-covid-19-vaccines-differs-from-an-infection/\n\nCovexit.com. Expert Sounds the Alarm about Risks of Mass Vaccination. 2021. https://covexit.com/expert-sounds-the-alarm-about-risks-of-mass-vaccination/\n\nGreaney AJ, Loes AN, Gentles LE, Crawford KHD, Starr TN, Malone KD, et al. Antibodies elicited by mRNA-1273 vaccination bind more broadly to the receptor binding domain than do those from SARS-CoV-2 infection. Science Translational Medicine. 2021 Jun 8. https://stm.sciencemag.org/content/early/2021/06/08/scitranslmed.abi9915.1\n\nHellerstein M. What are the roles of antibodies versus a durable, high quality T-cell response in protective immunity against SARS-CoV-2? Vaccine: X. 2020 Dec 11. https://www.sciencedirect.com/science/article/pii/S2590136220300231\n\nJia Z, Gong W. Will Mutations in the Spike Protein of SARS-CoV-2 Lead to the Failure of COVID-19 Vaccines? J Korean Med Sci. 2021 Apr 21. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8111046/\n\nLi Y, Lai D, Zhang H, Jiang H, Tian X, Ma M, et al. Linear epitopes of SARS-CoV-2 spike protein elicit neutralizing antibodies in COVID-19 patients. Cell Mol Immunol. 2020 Oct. https://www.nature.com/articles/s41423-020-00523-5\n\nLi Y, Ma M, Lei Q, Wang F, Hong W, Lai D, et al. Linear epitope landscape of the SARS-CoV-2 Spike protein constructed from 1,051 COVID-19 patients. Cell Reports. 2021 Mar 30. https://www.sciencedirect.com/science/article/pii/S2211124721002291\n\nMANY ed. Dryburgh. Mass Vaccination Will Breed Dangerous Variants – Fact or Fiction? Dryburgh.com. 2021. https://dryburgh.com/vanden-bossche-theory-fact-or-fiction/\n\nMotozono C, Toyoda M, Zahradnik J, Ikeda T, Saito A, Tan TS, et al. An emerging SARS-CoV-2 mutant evading cellular immunity and increasing viral infectivity. 2021 Apr 5. https://www.biorxiv.org/content/10.1101/2021.04.02.438288v1\n\nOliver S. Overview of data to inform recommendations for booster doses of COVID-19 vaccines. 2021. https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-06/06-COVID-Oliver-508.pdf\n\nPremkumar L, Segovia-Chumbez B, Jadi R, Martinez DR, Raut R, Markmann AJ, et al. The receptor-binding domain of the viral spike protein is an immunodominant and highly specific target of antibodies in SARS-CoV-2 patients. Science Immunology. 2020 Jun 11. https://immunology.sciencemag.org/content/5/48/eabc8413\n\nTarke A, Sidney J, Kidd CK, Dan JM, Ramirez SI, Yu ED, et al. Comprehensive analysis of T cell immunodominance and immunoprevalence of SARS-CoV-2 epitopes in COVID-19 cases. CR Med. 2021 Feb 16. https://www.cell.com/cell-reports-medicine/abstract/S2666-3791(21)00015-X\n\nWang R, Chen J, Gao K, Wei G-W. Vaccine-escape and fast-growing mutations in the United Kingdom, the United States, Singapore, Spain, India, and other COVID-19-devastated countries. Genomics. 2021 Jul 1. https://www.sciencedirect.com/science/article/pii/S0888754321001798", "opengraph": {"type": "article", "title": "Guided Evolution of the Coronavirus", "url": "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/", "description": "“it is the vaccination that is creating the variants” (Montagnier 2021) Virologist Luc Montagnier, the Nobel Prize Winner in Medicine, 2008 Leo Goldstein, preprint,  v. 2021-06-30 Summary SARS-COV-…", "article:published_time": "2021-07-13T20:36:07+00:00", "article:modified_time": "2021-07-13T20:36:07+00:00", "site_name": "Iowa Climate Science Education", "image": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://immunology.sciencemag.org/content/6/57/eabg6461", "https://www.futuremedicine.com/doi/full/10.2217/fmb-2020-0300", "https://dryburgh.com/wp-content/uploads/2021/03/Geert_Vanden_Bossche_Scientific_Evidence_Final_March_13_2021.pdf", "https://directorsblog.nih.gov/2021/06/22/how-immunity-generated-from-covid-19-vaccines-differs-from-an-infection/", "https://covexit.com/expert-sounds-the-alarm-about-risks-of-mass-vaccination/", "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1009453", "https://defyccc.com/vaed/", "https://stm.sciencemag.org/content/early/2021/06/08/scitranslmed.abi9915.1", "https://www.sciencedirect.com/science/article/pii/S2590136220300231", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8111046/", "https://www.nature.com/articles/s41423-020-00523-5", "https://www.sciencedirect.com/science/article/pii/S2211124721002291", "https://dryburgh.com/vanden-bossche-theory-fact-or-fiction/", "https://rairfoundation.com/bombshell-nobel-prize-winner-reveals-covid-vaccine-is-creating-variants/", "https://www.biorxiv.org/content/10.1101/2021.04.02.438288v1", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-06/06-COVID-Oliver-508.pdf", "https://immunology.sciencemag.org/content/5/48/eabc8413", "https://www.sciencedirect.com/science/article/pii/S1931312821000895", "https://www.biorxiv.org/content/10.1101/2021.01.06.425396v1", "https://www.cell.com/cell-reports-medicine/abstract/S2666-3791(21)00015-X", "https://www.sciencedirect.com/science/article/pii/S0888754321001798", "https://ift.tt/3hZZH6o", "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/#print", "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/?share=facebook", "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/?share=twitter", "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/?share=reddit", "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Guided%20Evolution%20of%20the%20Coronavirus&body=https%3A%2F%2Fiowaclimate.org%2F2021%2F07%2F13%2Fguided-evolution-of-the-coronavirus%2F&share=email", "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/?share=pinterest", "https://iowaclimate.org/2021/07/13/guided-evolution-of-the-coronavirus/?share=tumblr"], "authors": [], "publish_date": "2021-07-13T20:36:07+00:00"}