{"result_id": "175025", "URL": "https://iowaclimate.org/2021/09/10/your-body-my-choice-says-biden/", "timestamp": "2023-04-25 15:42:21 CEST+0200", "meta": {"description": "Babylon Bee Biden announced that all companies with 100 employees must enforce mandatory vaccination. People will have the freedom to quit their job or get tested every week, and be treated like a leper… It’s not about health, as there is no allowance for people who have already caught Covid and survived, who likely have…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/09/10/your-body-my-choice-says-biden/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Your Body, My Choice, says Biden", "cleaned_text": "Biden announced that all companies with 100 employees must enforce mandatory vaccination. People will have the freedom to quit their job or get tested every week, and be treated like a leper…\n\nIt’s not about health, as there is no allowance for people who have already caught Covid and survived, who likely have much better protection. Israeli research suggests people who have caught covid are 13 times less likely to get reinfected than the double vaxxed are to catch covid six months after vaccination. If the unvaxxed have to get tested, why don’t the vaxxed need to?\n\nSomething in this message does not add up. What could it be?\n\nThe virus is deadly, and the vaccine works, but you are too stupid to decide for yourself. Trust us, we care and respect you!\n\nMy headline above was shamelessly stolen from The Babylon Bee:\n\nWASHINGTON, D.C.—In a speech today, Joe Biden unveiled a brand new program to force the rest of the country to get vaccinated, entitled “Your Body, My Choice.”\n\nCompanies will be forced to comply with the mandate until the Supreme Court strikes it down in a few hours.\n\nIs this the moment the non-Left discover their Mojo?\n\nThere comes a point when every totalitarian movement goes too far. Even people who are pro-vaccine are anti-mandatory vaccination. The RNC “Intends to Sue Biden Administration on Unconstitutional Mandate”, and Governors are too:\n\nThe pushback from governors comes after the administration said on Thursday that The Department of Labor’s Occupational Safety and Health Administration (OSHA) will force all employers with 100 or more employees “to ensure their workforce is fully vaccinated or require any workers who remain unvaccinated to produce a negative test result on at least a weekly basis before coming to work.”\n\nGovernors vowing to stop this include the Governor of Florida, Texas, Mississipi, Georgia, South Dakota, South Carolina, Arizona, Askansaw, Iowa, Montana, Oklahoma, Missouri, and the list grows… Wyoming, Tenessee, Alaska,…\n\nThere are some good comments under The Daily Wire.\n\nThe vaccines reduce hospitalization and deaths significantly in high risk groups, but only reduce transmission by half or less. And the long term risks aren’t known. Where is the informed consent? If companies force employees to be vaccinated and there are adverse effects, can employees sue the companies?\n\nIf governments cared about our health they would combine vaccines with cheap antivirals to reduce the risks and the rate of spread. They’d let us choose the therapy we want with our doctors help.\n\nIf governments want us to trust them, they have to act trustworthy.\n\nIn Australia the TGA has just forbid doctors from prescribing ivermectin. We have to wonder why we train them for six years, if they are just robots for government bureaus?\n\nSTOP trashing our fundamental human right of #InformedConsent", "opengraph": {"type": "article", "title": "Your Body, My Choice, says Biden", "url": "https://iowaclimate.org/2021/09/10/your-body-my-choice-says-biden/", "description": "Babylon Bee Biden announced that all companies with 100 employees must enforce mandatory vaccination. People will have the freedom to quit their job or get tested every week, and be treated like a …", "article:published_time": "2021-09-10T22:33:41+00:00", "article:modified_time": "2021-09-10T22:33:41+00:00", "site_name": "Iowa Climate Science Education", "image": "https://joannenova.com.au/wp-content/your-body-my-choice.jpg", "image:alt": "Your body, My Choice. Joe Biden. Babylon Bee. ", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://babylonbee.com/news/biden-unveils-your-body-my-choice-vaccination-program", "https://www.whitehouse.gov/covidplan/", "http://zerohedge.com/political/not-now-not-ever-rnc-sue-biden-over-vaccine-mandate-gop-governors-go-ballistic?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+zerohedge%2Ffeed+%28zero+hedge+-+on+a+long+enough+timeline%2C+the+surviva", "https://www.dailywire.com/news/governors-immediately-push-back-on-unconstitutional-biden-plan-will-fight-them-to-the-gates-of-hell?itm_source=parsely-api?utm_source=cnemail&utm_medium=email&utm_content=091021-news&utm_campaign=position1", "https://twitter.com/CraigKellyMP/status/1435437046651232259", "https://twitter.com/hashtag/InformedConsent?src=hashtag_click", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://ift.tt/3z2POeK"], "authors": [], "publish_date": "2021-09-10T22:33:41+00:00"}