{"result_id": "175007", "URL": "https://iowaclimate.org/2021/11/26/vaccine-risk-blood-markers-suggest-an-increased-risk-of-heart-attacks/", "timestamp": "2023-04-25 15:42:10 CEST+0200", "meta": {"description": "Dr Aseem Malhotra is a consultant cardiologist and he’s calling for an end to mandatory vaccination while we investigate new results suggesting inflammatory blood markers are raised by the mRNA vaccines. “We know now that heart attacks are an inflammatory condition.” These same markers are used to estimate what the risk of a heart attack…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/11/26/vaccine-risk-blood-markers-suggest-an-increased-risk-of-heart-attacks/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Vaccine risk? Blood markers suggest an increased risk of heart attacks", "cleaned_text": "Dr Aseem Malhotra is a consultant cardiologist and he’s calling for an end to mandatory vaccination while we investigate new results suggesting inflammatory blood markers are raised by the mRNA vaccines.\n\n“We know now that heart attacks are an inflammatory condition.”\n\nThese same markers are used to estimate what the risk of a heart attack is. And the new higher markers hint that in this group of 500 patients, the 5 year risk of a heart attack has doubled, from 11% to 25%. They only followed these patients for 2.5 months, so the increased risk may well be temporary (apart from all the boosters, eh?).\n\nWe’ll just have to wait for the five year results from Pfizer, sometime in 2082 or so.\n\nEven so, Dr Malhotra points out that in the UK there have been 10,000 excess non-Covid deaths — many of which were due to heart attack and stroke. If the mRNA vaccines were increasing the risk of heart attacks, even temporarily, this would explain some of the excess deaths. Inflammation might be temporary, but death usually isn’t.\n\nA few days after these ominous results came out, a whistleblower and researcher from a different group contacted Dr Aseem Malhotra to say that in imaging studies they have found inflammation in the coronary arteries after vaccination. But they decided not to publish this yet because they are afraid of losing future grant money from the drug industry. The whistleblower was quite upset about this. Understandably.\n\nHow many other researchers and doctors are sitting on results too unpleasant to publish?\n\nMalhotra also mentions that he’s heard from other medical workers that there has been an increase in heart attacks in the UK, and in younger people. Of course, it all needs a proper study, not just anecdotes and retrospective observations, or preprint abstracts. The increase in heart attacks could be lifestyle factors, it could be infections, or it could be due to people staying home and watching the telly during lockdowns.\n\nDr Malhotra mentions results from the “Steven Gundry paper”. Gundry’s group has used a standard test to predict the risk of heart attacks in their patients for the last eight years. But they noticed that some of the blood markers they were looking for in the test were significantly higher after the second mRNA vaccination dose.\n\nWe conclude that the mRNA vacs dramatically increase inflammation on the endothelium and T cell infiltration of cardiac muscle and may account for the observations of increased thrombosis, cardiomyopathy, and other vascular events following vaccination.\n\nThe blood markers they use in the PLUS Cardiac Test (GD Biosciences) include inflammatory molecules like Interleukin-16 (IL-16), as well as other like soluble Fas, and Hepatocyte Growth Factor (HGF). People at risk of cardiac arrest would typically get measured every 3 – 6 months.\n\nGundry’s group followed 566 people both before and after their second vaccination to see how the PULS score changed. Strikingly many of the markers doubled. Frustratingly, the paper is a preprint and only available as an abstract (it seems). They don’t have a control group (as far as I can tell). The journal has added an “expression of concern”. Ain’t that the way. But it would be a shame to sit on results like these. Which is exactly what the other group Dr Malhotra talks about is doing, even though they have similar results.\n\nCaveat Emptor: Covid itself increases inflammatory markers, and probably a lot more than the vaccines, most of the time. But we also have other options, treatments, antivirals and weapons against Covid. And those other treatments don’t raise the risks of heart attacks in most people. Let’s just do informed consent, eh?\n\nRight now, we don’t know if the PULS heart attack score is accurate in vaccinated people. Vaccination may push up some of those markers temporarily. Theoretically it may also pump up the markers without necessarily affecting the underlying risk as much as whatever normal processes that push up those markers does. But the opposite is also true. PULS may underestimate the risk of heart attacks in vaccinated people.\n\nAnd there are plenty of reasons to think that markers like IL-16 are not just a proxy for heart risk, but actively involved in it.\n\nNo wonder Dr Malhotra calls for an end to mandatory vaccination.\n\nGundry, Steven (2021) Mrna COVID Vaccines Dramatically Increase Endothelial Inflammatory Markers and ACS Risk as Measured by the PULS Cardiac Test: a Warning. 8 Nov 2021 Circulation. 2021;144:A1071. ONLY a Preprint ABSTRACT.", "opengraph": {"type": "article", "title": "Vaccine risk? Blood markers suggest an increased risk of heart attacks", "url": "https://iowaclimate.org/2021/11/26/vaccine-risk-blood-markers-suggest-an-increased-risk-of-heart-attacks/", "description": "Dr Aseem Malhotra is a consultant cardiologist and he’s calling for an end to mandatory vaccination while we investigate new results suggesting inflammatory blood markers are raised by the mR…", "article:published_time": "2021-11-26T18:33:37+00:00", "article:modified_time": "2021-11-26T18:33:37+00:00", "site_name": "Iowa Climate Science Education", "image": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://pubmed.ncbi.nlm.nih.gov/?term=IL-16+cardiac+", "https://www.ahajournals.org/doi/10.1161/circ.144.suppl_1.10712?fbclid=IwAR0G4Yt9HYE0oQ99SRbXTfuORsi75rmP0cSJL0Y68poe1PCsECIAgGxxJ-k"], "authors": [], "publish_date": "2021-11-26T18:33:37+00:00"}