{"result_id": "175034", "URL": "https://iowaclimate.org/2022/07/22/natural-immunity-may-last-three-times-as-long-as-vaccine-immunity-and-omicron-infections-give-about-75-protection-against-omicron/", "timestamp": "2023-04-25 15:42:27 CEST+0200", "meta": {"description": "Natural immunity against Omicron from a previous Omicron infection is better than advertised (75%+) so far Two new interesting studies out of Qatar in the last month show that natural immunity against Covid is better than recent headlines suggest, and also that (as expected) immunity created from a real infection lasts about three years whereas…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2022/07/22/natural-immunity-may-last-three-times-as-long-as-vaccine-immunity-and-omicron-infections-give-about-75-protection-against-omicron/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Natural immunity may last three times as long as vaccine immunity (and Omicron infections give about 75% protection against Omicron).", "cleaned_text": "Natural immunity against Omicron from a previous Omicron infection is better than advertised (75%+) so far\n\nTwo new interesting studies out of Qatar in the last month show that natural immunity against Covid is better than recent headlines suggest, and also that (as expected) immunity created from a real infection lasts about three years whereas vaccine immunity may “last only one” (at best, and if that).*\n\nAlthough people who caught early variants (up to Delta) are only 28% protected against catching the latest Omicron BA5, people who have caught some form of Omicron itself already may have 75 – 80% protection, and everyone who has caught any form of Covid has “robust” protection against severe disease.\n\n\n\nQatar is an interesting population to study — it has a youngish demographic and they can literally include everyone which removes a lot of selection biases. It’s a very diverse conglomerate: Nearly 90% of Qatar’s population are expatriates from over 150 countries, coming …because of employment.\n\nThe first study is one of the longest term research projects on Covid to date. Chemaitelly et al followed people who got Covid in Qatar from nearly the beginning of the whole pandemic. They estimate protection against reinfection starts off at 90% and gradually declines over the next couple of years, until it reaches nothing, they figure (with Gompertz curves), by about 32 months. The good news is that protection against severe infection appears to be robust, even when people do get infected again.\n\nNow that doesn’t mean there isn’t some cumulative damage from reinfection (and other studies suggest there might be, which I’ll discuss soon), but at least the second infection itself probably won’t put people in hospital or a morgue. As far as decisions for boosters go, surely the risk of severe infections is what matters? Will doctors tell their patients about this data?\n\nOnly Omicron really protects against Omicron\n\nThe second study (Altarawneh et al) from a similar group of researchers, looked at the most recent data when the superinfectious BA5 variant was spreading rapidly in May and June this year. They estimate that immunity against old Covid infections (Delta and earlier) are not that useful in stopping these later two Omicron variants. People who caught Covid in 2020 and 2021 appear to have about a 28% protection against reinfection. But people who caught an early variant of Omicron are much better protected — with 75% – 80% protection against reinfection. Part of the weaker protection from catching an early variant of Covid is because the virus has changed shape so dramatically, and part of it is due to the waning of immunity. Obviously people who caught the original Wu-Flu are a long way past the infection.\n\nThis graph below is the past year of Covid variants globally. Obviously Omicron BA.5 is taking over. It was virtually unknown at the start of May but now is about 63% of global infections. Depending on which country you live in, you can check the Nextstrain database to see which strain was dominant at various times (like say, when you may have caught Covid, so you can figure out what the variant may have been). (Mouseover their graphs).\n\nNatural immunity induced by infection with SARS-CoV-2 provides a strong shield against reinfection by a pre-Omicron variant for 16 months or longer, according to a study (Chemaitelly). This protection against catching the virus dwindles over time, but immunity triggered by previous infection also thwarts the development of severe COVID-19 symptoms — and this safeguard shows no signs of waning.\n\nThe study, which analyses cases in the entire population of Qatar, suggests that although the world will continue to be hit by waves of SARS-CoV-2 infection, future surges will not leave hospitals overcrowded with people with COVID-19.\n\nNow they tell us…\n\nRegardless of the extrapolations, the data indicate that naturally acquired immunity is hardy — something that is not always championed.\n\n“In the US, we were underselling the immune protection provided by previous infection,” says Jeffrey Morris, a biomedical data scientist at the University of Pennsylvania in Philadelphia. He adds that the Qatar team’s study affirms the substantial evidence for natural immunity’s capabilities.\n\nThe second paper looked specifically at Omicron protection against Omicron:\n\nTo see how much protection previous infection offers against the two Omicron subvariants, Abu-Raddad and colleagues analysed COVID-19 cases recorded in Qatar between 7 May this year — when BA.4 and BA.5 first entered the country — and 4 July. They looked at the number of people known to have been infected previously who tested positive or negative for COVID-19, and identified which infections were caused by BA.4 or BA.5 by examining positive test samples to see whether they contained a protein that these subvariants lack.\n\nThe researchers found that infection with a pre-Omicron variant prevented reinfection with BA.4 or BA.5 with an effectiveness of 28.3%, and prevented symptomatic reinfection with either subvariant with an effectiveness of 15.1%. Prior infection with Omicron granted stronger protection: it was 79.7% effective at preventing BA.4 and BA.5 reinfection and 76.1% effective at preventing symptomatic reinfection.\n\nEffectiveness of a previous pre-Omicron infection against symptomatic BA.4/BA.5 reinfection was 15.1% (95% CI: -47.1-50.9%), and against any BA.4/BA.5 reinfection irrespective of symptoms was 28.3% (95% CI: 11.4-41.9%). Effectiveness of a previous Omicron infection against symptomatic BA.4/BA.5 reinfection was 76.1% (95% CI: 54.9-87.3%), and against any BA.4/BA.5 reinfection was 79.7% (95% CI: 74.3-83.9%).\n\nThe study was implemented on Qatar’s total population, perhaps thus minimizing the likelihood of bias.\n\n*Natural immunity may last three times (or even five times) as long as vaccine induced immunity\n\n“Three times longer” is probably an underestimate. Other studies suggest vaccine immunity doesn’t last for “a year”. One Swedish study of 840,000 people showed vaccine efficacy at 7 months was zero.\n\nProtection of natural infection waned with time after primary infection, prior to Omicron emergence, and reached ∼70% by the 16th month. This waning likely reflects genuine waning in biological immunity rather than viral immune evasion, as pre-Omicron variants demonstrated much less immune evasion than Omicron.14–16 This waning in natural immunity mirrors that of vaccine immunity,4, 6, 30 but at a slower rate. Vaccine immunity may last for only a year,4, 6, 30 but natural immunity, assuming Gompertz decay, may last for 3 years, as also suggested by long- term follow-up of SARS-CoV-1-associated antibodies,36 and incidentally not dissimilar to pandemic-influenza-associated antibodies.37\n\nImmune evasion of Omicron subvariants reduced overall protection of pre-Omicron natural immunity and accelerated its waning (Figure 3), mirroring the effect of Omicron on vaccine immunity, but at a slower rate. Vaccine immunity against Omicron subvariants lasts for <6 months,5, 7, 8 but pre-Omicron natural immunity, assuming Gompertz decay, may last for just over a year.\n\nDespite waning protection against reinfection, strikingly, there was no evidence for waning of protection against severe COVID-19 at reinfection. This remained ∼100%, even 14 months after the primary infection, with no appreciable effect for Omicron immune evasion in reducing it. — Chaimaitelly\n\nInformed consent means knowing more about natural immunity as well as vaccines and the risks associated with them. Given the risks of vaccination, once people have had any variant of Covid, are there any benefits for “boosting”? These are questions doctors or bosses need to answer.\n\nAltarawneh et al (2022) Protection of SARS-CoV-2 natural infection against reinfection with the Omicron BA.4 or BA.5 subvariants, doi: https://ift.tt/HkipKI0\n\nChemaitelly et al (2022) Duration of immune protection of SARS-CoV-2 natural infection against reinfection in Qatar, medRxiv 2022.07.06.22277306, DOI: https://doi.org/10.1101/2022.07.06.22277306, https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1\n\nMichlmayr et al (2022) Observed protection against SARS-CoV-2 reinfection following a primary infection: A Danish cohort study among unvaccinated using two years of nationwide PCR-test data, DOI:https://doi.org/10.1016/j.lanepe.2022.100452", "opengraph": {"type": "article", "title": "Natural immunity may last three times as long as vaccine immunity (and Omicron infections give about 75% protection against Omicron).", "url": "https://iowaclimate.org/2022/07/22/natural-immunity-may-last-three-times-as-long-as-vaccine-immunity-and-omicron-infections-give-about-75-protection-against-omicron/", "description": "Natural immunity against Omicron from a previous Omicron infection is better than advertised (75%+) so far Two new interesting studies out of Qatar in the last month show that natural immunity agai…", "article:published_time": "2022-07-22T20:33:18+00:00", "article:modified_time": "2022-07-22T20:33:18+00:00", "site_name": "Iowa Climate Science Education", "image": "https://joannenova.com.au/wp-content/immunity-omicron-1024x542.jpg", "image:alt": "Immunity against Omicron with a pre omicron infection.", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://covariants.org/per-country", "https://www.nature.com/articles/d41586-022-01950-2#author-0", "https://joannenova.com.au/2021/11/swedish-study-of-840000-shows-vaccine-efficacy-at-7-months-at-wow-zero/", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-14", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-16", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-4", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-6", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-30", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-4", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-6", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-30", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-36", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-37", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#F3", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-5", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-7", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text#ref-8", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1.full-text", "https://ift.tt/HkipKI0", "https://doi.org/10.1101/2022.07.06.22277306", "https://www.medrxiv.org/content/10.1101/2022.07.06.22277306v1", "https://doi.org/10.1016/j.lanepe.2022.100452"], "authors": [], "publish_date": "2022-07-22T20:33:18+00:00"}