{"result_id": "175017", "URL": "https://iowaclimate.org/2021/05/18/did-they-forget-to-tell-us-leaky-vaccines-may-trigger-an-arms-race-that-makes-covid-more-dangerous/", "timestamp": "2023-04-25 15:42:16 CEST+0200", "meta": {"description": "Imperfect storm on the way? Adam Gaertner has posted a zinger of a provocative article, to say the least. Thanks to David Archibald author of The Anticancer Garden in Australia for pointing me at it. What if mass vaccination with imperfect vaccines could promote the survival of nastier strains of Covid? What if the leaky vaccines act…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/05/18/did-they-forget-to-tell-us-leaky-vaccines-may-trigger-an-arms-race-that-makes-covid-more-dangerous/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Did they forget to tell us? Leaky vaccines may trigger an arms race that makes Covid more dangerous", "cleaned_text": "Imperfect storm on the way?\n\nAdam Gaertner has posted a zinger of a provocative article, to say the least. Thanks to David Archibald author of The Anticancer Garden in Australia for pointing me at it.\n\nWhat if mass vaccination with imperfect vaccines could promote the survival of nastier strains of Covid? What if the leaky vaccines act like a filter for more dangerous versions of SARS2?\n\nThis doesn’t happen with most vaccines, only “leaky” ones. But it has happened in chickens with a virus called Marek’s disease.\n\nLeaky vaccines generate a half-baked immune response — one that stops illness, but allows transmission, so a vaccinated person can theoretically infect others. This is bad but not awful — as long as the virus gets eliminated in a timely fashion. But if the virus can cloak itself from the immune system, and hide in protected cells, then it can keep replicating for a long time, and eventually, randomly, it will escape the imperfect immune response. Those mutants will be resistant to the antibodies or t-cell tricks. Thus newer strains of Covid may arise that are already pre-loaded with goodies to get around our immune system.\n\nThis is not how pandemics normally work\n\nIn most pandemics, after a few years, the nicer strains out-compete the nastier ones. Natural selection favours viruses that don’t kill or disable their human shedders. A sick body on the move is a more efficient spreader than someone flat out on their back in bed. It takes two things to break that pattern. One is a leaky or imperfect vaccine. The other thing is that this virus appears to have the ability (like Marek’s disease) to cloak itself from our immune system and hide in protected cells. This combination could make for a perfect storm, where vaccinated people feel OK, but viruses hidden away within keep sending out copies that test the half-baked immune response in a holding pattern until one lucky mutant virus escapes the net. The new variant is nastier and trickier than the last one and we need to redesign a new vaccine. Repeat, rinse, recycle a few times and we might be breeding a virus that is more easily spread and has a higher mortality rate — especially in unvaccinated people.\n\nThis process is called immune escape, and once you know where to look, it seems virologists have been warning of it (and here, and here). But not necessarily expanding on just how bad it could be. They only mention that we might have to produce a new vaccine. (Gosh, darn, won’t Big Pharma be disappointed?)\n\nLook at what happened to chickens and Marek disease\n\nWho knew? In the last six years it’s been confirmed and accepted that vaccines played a role in creating a much nastier and deadlier form of Marek disease in chickens (MDV). Over the last 50 years, we’ve made vaccines that stop the chickens getting cancer and dying, but don’t stop them shedding virus and infecting other chickens. Unlike most viruses MDV can sit latent “for life” and slowly churn out copies while also suppressing the immune system. So each chicken becomes a kind of slow slot machine in a game of viral poker. The chickens immune system holds it at bay, but sooner or later, the virus finds an escape route around the immune system, becoming more infectious, more virulent, and effectively bypassing the current vaccine. This process started in 1970 with the first vaccine which at the time stopped 99% of Marek’s disease. The disease originally had a low mortality but after 50 years, the MDV virus has become a kind of monster, and is considered to be 100% fatal to unvaccinated chickens. For a chicken, the odds are worse than Ebola. What have we done?\n\nHow imperfect vaccines created the conditions to select for a nastier disease\n\nMDV became increasingly virulent over the second half of the 20th century [19,21–24]. Until the 1950s, strains of MDV circulating on poultry farms caused a mildly paralytic disease, with lesions largely restricted to peripheral nervous tissue. Death was relatively rare. Today, hyperpathogenic strains are present worldwide. These strains induce lymphomas in a wide range of organs and mortality rates of up to 100% in unvaccinated birds. So far as we are aware, no one has been able to isolate non-lethal MDV strains from today’s commercial (vaccinated) poultry operations [19,23]. Quite what promoted this viral evolution is unclear.\n\nThe imperfect-vaccine hypothesis was suggested as an evolutionary mechanism by which immunization might drive MDV virulence evolution [2], but there has been no experimental confirmation. Our data provide that: by enhancing host survival but not preventing viral shedding, MDV vaccination of hens or offspring greatly prolongs the infectious periods of hyperpathogenic strains, and hence the amount of virus they shed into the environment.\n\nAndrew Read proposed this imperfect-vaccine idea in 2001, but it was purely theoretical until he was able to test and confirm it in 2015. His work was described by Ed Yong, National Geographic:\n\nThe duo infected vaccinated and unvaccinated chicks with five different strains of Marek’s virus, of varying virulence. They found that when unvaccinated birds are infected with mild strains, they shed plenty of viruses into their surroundings. If they contract the most lethal strains, they die before this can happen, and their infections stop with them. In the vaccinated chicks, this pattern flips. The milder strains are suppressed but the lethal ones, which the birds can now withstand, flood into the environment at a thousand times their usual numbers.\n\nSo don’t mix vaccinated and unvaccinated chickens, right? I can’t see this working in humans…\n\nRead and Nair also found that the “lethal” strains could spread from one vaccinated individual to another, and that unvaccinated chickens were at greatest risk of disease and death if they were housed with vaccinated ones.\n\nThe chicken industry has learned to live with Mareks disease. Unvaccinated chickens though, have not. And the industry loses $2b a year as well. Chicks are reared separately from mum and dad apparently, so they can survive long enough to get the vaccine and get protection before they risk catching the disease. Some people keep unvaccinated backyard flocks, but those chickens don’t go on holidays, or to weddings or funerals and rarely meet other chickens. None of this translates too well to homo sapiens. Dystopia 2025?\n\nLook at the mutations in just one patient alone:\n\nTo get an idea of how big a problem this could be, consider that one particular transplant patient who had Covid and was on immunosuppressants, was infected for 170 days last year before finally clearing the infection. Weigang et al 2021, followed him closely. They identified the different mutants as they arose, and also testing them to see if they could infect live cells in a lab.\n\nThe patient developed mildly symptomatic COVID-19, and tested positive for 145 days. The daily swabs showed the virus was developing an array of substitutions and deletions of amino acids in the spike protein, which were partly resistant to neutralizing antibodies.\n\nDid remdesivir save the day? Using antivirals to stop extended infections makes sense, given the risks. (But why wait til Day 140 when we could start on Day 1?)\n\nThe aim was to allow the body to mount a more effective antiviral response. On day 140 the patient remained RT PCR positive, and was put on remdesivir for 10 days. From day 149 to 189, all subsequent tests were negative, and the pathogen could no longer be isolated, indicating viral clearance.\n\nDo the math: There are 1-2 new mutations per month, per infected person?\n\nThe typical rate of mutations is about 1-2 mutations a month, and this was confirmed in the present patient, with the relative stability of the viral genome over the early period of the infection.\n\nFrom day 42, mutations began to accumulate, including the D614G substitution that is now globally dominant.\n\nThe researchers tested the various versions of SARS2 in mice and found that the mutations made the virus less deadly between days 35 and 105. But the virus was also picking up mutations that meant antibodies were not binding as well to it.\n\nThe study thus supports the emergence of new variants that evade immunity in chronically immunosuppressed patients, as also reported with patients treated repeatedly with antibody cocktails and convalescent plasma. The variants in this study resemble the current UK, South African and Brazil variants, with escape mutations in the same spike region. (Weigang et al 2021).\n\nThose were some pretty serious mutations in just one guy?\n\nThis doesn’t happen with all leaky vaccines. For example, Poliovirus vaccine allows some leakage but after fifty years of use, the virulence hasn’t increased. However shedding of poliovirus only lasts for two weeks, not months, not long enough to generate mutations perhaps?\n\nWhere to next?\n\nIf vaccinated people are or start to produce more deadly variants, there will be even more calls (if that’s possible) to vaccinate everyone on Earth plus their cats. People may use the term “herd immunity” but it doesn’t apply. Herd immunity means immunized people protect the vulnerable by not transmitting the virus. And even if we could and did vaccinate everyone (ignoring all the risks and ethical questions for the moment) that isn’t a solution. It’s just a temporary stop-gap until the next and nastier round in the arms race. Obviously we are not going to live like chickens with a highly fatal disease knocking off the unvaccinated. (Surely?!)\n\nThings we can do:\n• Use antivirals to finish the job and kill off the dangerous mutations in vivo before they get out. We already have Ivermectin, Hydroxychloroquine, Budesonide, Bromhexine, Zinc, and others. Did I say Ivermectin?\n• Develop perfect vaccines (figure out how to get our immune systems to avoid infection, and eliminate the virus). The good new is that five years after the idea of leaky vaccines was confirmed, there is a new Marek’s Disease vaccine that has stopped chickens shedding the virus. So it can be done.\n• Develop new techniques like CRISPR or Reverse-sense RNA to edit those viral genes right out of our cells.\n• In the meantime, hard borders will slow this down (for nations like Australia and New Zealand). Incoming travellers may need to be monitored to make sure the virus is not hiding and being reactivated\n\nIn a bioweapons arms race (with a virus, if not a nation) all the West should be setting up bigger and better biotech labs. A bonanza of discoveries will come out of these medical advances, but every month matters. We may be on the cusp of the new glorious antivirals era, much like the transformation we saw after World War II with antibiotics. Why waste a dollar on green energy if we can be biotech leaders instead?\n\nIt’s possible that our immune system may have some extra tricks we don’t know about. And it’s possible that in order to hide long term in our cells, or fool our immune system, that it may also give up some virulence or transmissibility. The whole topic of how this virus cloaks itself, reduces interferon signalling, and avoids CD8 cells is too big for today. We know the vaccines are leaky. We don’t know how often people will become long term shedders.\n\nPS: To commenters — thanks and apologies to those who mentioned some version of this kind of threat before. I needed to read the detailed list of journals with medical jargon to appreciate it.\n\nIn comments please write carefully and accurately, especially if you are not familiar with virology. Both the virus and our immune system are a lot more complicated than most people realize. And many national commentators, like CEOs of airlines, seem to think vaccines are a binary yes-no treatment.\n\nRead AF, Baigent SJ, Powers C, Kgosana LB, Blackwell L, Smith LP, Kennedy DA, Walkden-Brown SW, Nair VK (July 2015). “Imperfect Vaccination Can Enhance the Transmission of Highly Virulent Pathogens”. PLOS Biology. 13 (7): e1002198.\n\nWeigang, S. et al. (2021). Within-host evolution of SARS-CoV-2 in an immunosuppressed COVID-19 patient: a source of immune escape variants. medRxiv preprint. https://doi.org/10.1101/2021.04.30.21256244, https://www.medrxiv.org/content/10.1101/2021.04.30.21256244v1", "opengraph": {"type": "article", "title": "Did they forget to tell us? Leaky vaccines may trigger an arms race that makes Covid more dangerous", "url": "https://iowaclimate.org/2021/05/18/did-they-forget-to-tell-us-leaky-vaccines-may-trigger-an-arms-race-that-makes-covid-more-dangerous/", "description": "Imperfect storm on the way? Adam Gaertner has posted a zinger of a provocative article, to say the least. Thanks to David Archibald author of The Anticancer Garden in Australia for pointi…", "article:published_time": "2021-05-18T19:36:22+00:00", "article:modified_time": "2021-05-18T19:36:22+00:00", "site_name": "Iowa Climate Science Education", "image": "https://joannenova.com.au/wp-content/coronavirus-vaccine-m.-201x300.gif", "image:alt": "Coronavirus-vaccine. Photo", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": ["antivirals"], "tweets": [], "movies": [], "links": ["https://joannenova.com.au/wp-content/coronavirus-vaccine-m..gif", "https://www.boffinsbooks.com.au/books/9780648824701/anticancer-garden-in-australia", "https://www.wpxi.com/news/top-stories/new-study-shows-covid-19-could-hide-your-brain-reactivate-down-road/IVXL7FVCPBHKXE25TY3YILBAGM/", "https://www.wionews.com/science/the-virus-wont-stop-evolving-when-the-vaccine-arrives-346066", "https://www.nature.com/articles/d41586-021-00367-7", "https://science.sciencemag.org/content/371/6527/329.full", "https://joannenova.com.au/wp-content/chicken-william-moreland.m.gif", "https://veterinaryresearch.biomedcentral.com/articles/10.1186/s13567-016-0404-3", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4516275/#pbio.1002198.ref019", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4516275/#pbio.1002198.ref021", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4516275/#pbio.1002198.ref024", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4516275/#pbio.1002198.ref019", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4516275/#pbio.1002198.ref023", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4516275/#pbio.1002198.ref002", "https://dpipwe.tas.gov.au/biosecurity-tasmania/animal-biosecurity/animal-health/poultry-and-pigeons/mareks-disease", "https://www.thehappychickencoop.com/mareks-disease/", "https://www.news-medical.net/news/20210507/Immunosuppression-in-COVID-19-promotes-emergence-of-multiple-immune-escape-mutants.aspx", "https://www.news-medical.net/health/What-are-Neutralizing-Antibodies.aspx", "https://www.news-medical.net/health/What-is-Convalescent-Plasma.aspx", "https://joannenova.com.au/tag/antiviral/", "https://joannenova.com.au/2021/02/in-peru-ivermectin-cut-covid-deaths-by-75-in-6-weeks-cheap-safe-and-quite-ignored/", "https://joannenova.com.au/2021/02/asthma-drug-budesonide-reduces-covid-hospitalization-rate-dramatically/", "https://joannenova.com.au/2020/09/even-cough-syrup-might-actually-work-against-coronavirus/", "https://pubmed.ncbi.nlm.nih.gov/32093754/", "https://www.newsweek.com/coronavirus-disguises-itself-hide-inside-our-cells-replicate-1520210", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4516275", "https://doi.org/10.1101/2021.04.30.21256244", "https://www.medrxiv.org/content/10.1101/2021.04.30.21256244v1", "https://unsplash.com/@relentlessjpg?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://unsplash.com/?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://unsplash.com/@hakannural?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://unsplash.com/s/photos/injection?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText"], "authors": [], "publish_date": "2021-05-18T19:36:22+00:00"}