{"result_id": "175005", "URL": "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/", "timestamp": "2023-04-25 15:42:08 CEST+0200", "meta": {"description": "Abstract The politicization and censorship of any negative information or research about the COVID-19 vaccines justifies a review by a lay person. The official narrative is quite far from the reality. Excluding China, the top vaccines for COVID-19 only target the spike protein of the coronavirus SARS-COV-2. They work by injecting into the human body…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Anti-Spike Vaccines", "cleaned_text": "The politicization and censorship of any negative information or research about the COVID-19 vaccines justifies a review by a lay person. The official narrative is quite far from the reality.\n\nExcluding China, the top vaccines for COVID-19 only target the spike protein of the coronavirus SARS-COV-2. They work by injecting into the human body RNA or DNA, coding for the coronavirus spike protein, slightly modified. This leads to the development of antibodies and memory cell immunity, targeting this protein. Unfortunately,\n• Immune response to the spike protein represents only a small part of the natural immune response to the coronavirus.\n• The spike protein is responsible for most of the damage caused by the coronavirus (at least when a cytokine storm does not happen).\n• The vaccines create too much spike protein, probably to compensate for the lack of other antigens.\n• The spike protein is the most frequently mutating part of the coronavirus. Some coronavirus strains make vaccination less efficient. Strains escaping vaccine-induced immunity will probably appear within months, if not weeks.\n\nThe strains with immunity evading spikes are likely to spread within the vaccinated populations, with unpredictable consequences.\n\nExcluding China, the top COVID-19 vaccines are novel mRNA or viral vector[1]. This article refers to the four most utilized vaccines: Pfizer-BioNTech’s BNT162b2 (mRNA vaccine), Moderna’s mRNA-1273 (mRNA vaccine), Oxford-AstraZeneca’s AZD1322 (viral vector vaccine), Janssen’s JNJ-78436735 (viral vector vaccine). The US gave emergency use authorization to Pfizer, Moderna, and Janssen, although mostly used are Pfizer and Moderna. The UK and India are mostly using AstraZeneca’s vaccine, manufactured in India as Covishield. Russian Sputnik V is another viral vector vaccine, like AstraZeneca and Janssen, but it is not covered here. All three viral vector vaccines use a type of adenovirus, as the vector.\n\nAll these vaccines target the spike protein (S-protein) of the coronavirus. The effect is that the immune response (antibodies and T and B cells memory) is developed only against sites on the spike protein. This is enough to create sufficient immunity to SARS-COV-2 strains that have the spike protein similar to the one created by the vaccine. But the anti-spike immunity is only a small part of the natural immune response to the coronavirus. Most of the body’s natural immunity is directed against coronavirus’ N protein (nucleocapsid) and M protein (membrane)[2] [3]. Thus, the discussed vaccines sacrifice the breadth of the protection. Apparently, they try to compensate for this with an extremely high amount of S-protein.\n\nNumber of infectious units and viral particles in the vaccines\n\nBoth AstraZeneca and Janssen contain recombinant reproduction-incompetent adenovirus, having coronavirus spikes[4] [5]. Additional spike protein is then produced when these corona-adenoviruses. Note that in the absence of a cytokine storm and ARDS, COVID-19 inflicts most of its damage to the body through the spike protein[6] (explained [7]).\n\nThe amount of spike protein, delivered and produced by AstraZeneca[8] and Janssen[9] vaccines is huge. AstraZeneca requires two doses and delivers at least 2.5*108 infectious units in each dose. For comparison, the peak number of infectious units of SARS-COV-2 in a mild/moderate patient is estimated 105 to 107 (Sender et al. 2021)[10] – much less than in the vaccine!\n\nBoth AstraZeneca and Janssen contain 5*1010 viral particles per dose. The peak number of the viral particles of SARS-COV-2 in a mild-moderate adult SARS-COV-2 patient is 109 to 1011, approximately as in the viral vector vaccines.\n\nI have no expertise to compare the amounts and the potential damage caused by non-neutralized spike protein delivered and/or produced by a vaccine vs. those naturally produced in COVID-19 patients. With this caveat, it seems that current viral vector vaccines deliver more non-neutralized spike protein than mild/moderate COVID-19 does and are at least as likely to cause the same lasting damage as the disease.\n\n(Sender et al. 2021) is a pre-print, but the numbers are based on peer reviewed studies of coronavirus amounts per ml in tissues of rhesus macaques[11] [12].\n\nThus, it seems that young people may sustain more damage from these vaccines than from having a mild/moderate COVID-19 infection, which most of them are very unlikely to experience even without vaccination.\n\nThe Sputnik V vaccine has 1011 viral particles per dose[13], two times higher than AstraZeneca or Janssen. I could not find indicators of the spike protein production caused by the mRNA vaccines, but it is likely comparable with that of the viral vector ones, because they appear to produce the same level of immunity, through a similar mechanism.\n\nOnly targeting the S-protein has many drawbacks.\n• The coronavirus can escape immune response by changing only a few sites in its spike protein. The S-protein encoding sequence is small and the most actively mutating part of the coronavirus’ RNA. Also, antibody targeted sites of the S-protein are noticed to mutate more frequently[14]. There are already mutations against which the current vaccines provide only partial immunity.\n• Because the vaccines only target the S-protein, rather than the whole virus, to trigger an effective immune response, the vaccines must produce or deliver much higher amounts of S-protein than would be produced by a natural infection. This is especially true in young people. As mentioned above, S-protein is the most damaging part of the coronavirus.\n• It will likely be difficult for vaccinated individuals, who have not developed immunity before the vaccination, to develop a full spectrum immunity (including ability to target N-protein) in the future. After being vaccinated, any exposure to SARS-COV-2 coronavirus would elicit a response of antibodies to its spike protein, and thus quickly eliminate the coronavirus with minimum exposure to its N-protein. This means that when a SARS-COV-2 strain with an immunity-resistant spike protein is encountered, the body will be defenseless, and the consequences are unpredictable.\n• Just like the spike protein of SARS-COV[15], the spike protein of SARS-COV-2[16] downregulates tetherin, a human protein restricting replication of some viruses, including coronaviruses. A reduction in tetherin would therefore increase the replication of coronavirus Evolutionary biology suggests that there may be additional indirect mechanisms by which the spike protein helps coronaviruses to multiply. Thus, if a person is infected with SARS-COV-2 a couple of days before or after receiving their first vaccine dose, the coronavirus would likely replicate faster and stronger than in someone who has not received the vaccine. The vaccine would then elicit a faster and stronger immune response. The net result is that the person would be very infectious within 5-7 days from receiving their first vaccine dose but show little or no symptoms. Further, the symptoms might be confused with the side effects of the jab. This is likely to increase the danger of unknowingly spreading the infection.\n\nThere are several examples of new COVID-19 waves, coinciding with the beginning of mass vaccinations. There may be other factors to consider here as well. Mass vaccination can lead to a feeling of relaxation (“the solution exists, hallelujah”) and thus an unjustified abandoning of other protective measures.\n\nPolicies against anti-viral treatment for COVID-19[17] have created huge amount of the coronavirus in the human population and provide ideal conditions for mutation. Symptomatic patients should receive HCQ or IVM based antiviral treatments as early as possible.\n\nContrary to popular myths, asymptomatic people infected with the coronavirus develop robust immune response without vaccines[18]: “asymptomatic SARS-CoV-2–infected individuals are not characterized by weak antiviral immunity; on the contrary, they mount a highly functional virus-specific cellular immune response.”\n\nNevertheless, all the discussed vaccines are effective in preventing COVID-19 (and highly effective in preventing severe cases of COVID-19) for most of the currently circulating strains of SARS-COV-2. Therefore, I would still recommend these vaccines for people over 70 and for some people over 50 who have comorbidities. Severe COVID-19 outcomes by age correlate with life expectancy by country. These age brackets apply in the US and other Western countries. Countries with lower life expectancies might want to vaccinate people starting at younger age.\n\nThere are many other concerns, raised by doctors and scientists in the relevant fields across the globe. That includes the group Doctors for Covid Ethics[19], stating that COVID-19 vaccines are unnecessary, unsafe, and “lack a viable mechanism of action against SARS-CoV-2 infection of the airways”[20]. The group also published an open letter to the EMA[21], and a rebuttal to the response from the EMA[22].\n• Janssen has “knocked out” the infamous furin cleavage in the spike protein produced by its corona-adenovirus. This sounds good, but the real effect is unclear. The goal was to increase stability of the spike protein, rather than safety.\n• Not surprisingly, some post-vaccinations are like post-covid (or long covid) symptoms[23]. However, the damage from a natural infection can be avoided by early anti-viral treatment.\n• At least one N protein targeting vaccine is in development[24]", "opengraph": {"type": "article", "title": "Anti-Spike Vaccines", "url": "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/", "description": "Abstract The politicization and censorship of any negative information or research about the COVID-19 vaccines justifies a review by a lay person. The official narrative is quite far from the reali…", "article:published_time": "2021-05-14T00:36:50+00:00", "article:modified_time": "2021-05-14T00:36:50+00:00", "site_name": "Iowa Climate Science Education", "image": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://defyccc.com/anti-spike-vaccines/#_ftn1", "https://defyccc.com/anti-spike-vaccines/#_ftn2", "https://defyccc.com/anti-spike-vaccines/#_ftn3", "https://defyccc.com/anti-spike-vaccines/#_ftn4", "https://defyccc.com/anti-spike-vaccines/#_ftn5", "https://defyccc.com/anti-spike-vaccines/#_ftn6", "https://defyccc.com/anti-spike-vaccines/#_ftn7", "https://defyccc.com/anti-spike-vaccines/#_ftn8", "https://defyccc.com/anti-spike-vaccines/#_ftn9", "https://defyccc.com/anti-spike-vaccines/#_ftn10", "https://defyccc.com/anti-spike-vaccines/#_ftn11", "https://defyccc.com/anti-spike-vaccines/#_ftn12", "https://defyccc.com/anti-spike-vaccines/#_ftn13", "https://defyccc.com/anti-spike-vaccines/#_ftn14", "https://defyccc.com/anti-spike-vaccines/#_ftn15", "https://defyccc.com/anti-spike-vaccines/#_ftn16", "https://defyccc.com/anti-spike-vaccines/#_ftn17", "https://defyccc.com/anti-spike-vaccines/#_ftn18", "https://defyccc.com/anti-spike-vaccines/#_ftn19", "https://defyccc.com/anti-spike-vaccines/#_ftn20", "https://defyccc.com/anti-spike-vaccines/#_ftn21", "https://defyccc.com/anti-spike-vaccines/#_ftn22", "https://defyccc.com/anti-spike-vaccines/#_ftn23", "https://defyccc.com/anti-spike-vaccines/#_ftn24", "https://defyccc.com/anti-spike-vaccines/#_ftnref1", "https://www.bbc.com/news/world-asia-india-55748124", "https://defyccc.com/anti-spike-vaccines/#_ftnref2", "https://www.nature.com/articles/s41590-020-0773-7", "https://defyccc.com/anti-spike-vaccines/#_ftnref3", "https://medicalxpress.com/news/2020-12-covid-vaccines-focus-spike-protein.html", "https://defyccc.com/anti-spike-vaccines/#_ftnref4", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-01/02-COVID-Villafana.pdf", "https://defyccc.com/anti-spike-vaccines/#_ftnref5", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-02/28-03-01/02-COVID-Douoguih.pdf", "https://defyccc.com/anti-spike-vaccines/#_ftnref6", "https://www.ahajournals.org/doi/10.1161/CIRCRESAHA.121.318902", "https://defyccc.com/anti-spike-vaccines/#_ftnref7", "https://scitechdaily.com/covid-19-is-a-vascular-disease-coronavirus-spike-protein-attacks-vascular-system-on-a-cellular-level/", "https://defyccc.com/anti-spike-vaccines/#_ftnref8", "https://www.ema.europa.eu/en/documents/product-information/covid-19-vaccine-astrazeneca-product-information-approved-chmp-29-january-2021-pending-endorsement_en.pdf", "https://defyccc.com/anti-spike-vaccines/#_ftnref9", "https://www.fda.gov/media/146217/download", "https://defyccc.com/anti-spike-vaccines/#_ftnref10", "https://www.medrxiv.org/content/10.1101/2020.11.16.20232009v2", "https://defyccc.com/anti-spike-vaccines/#_ftnref11", "https://www.nature.com/articles/s41586-020-2324-7", "https://defyccc.com/anti-spike-vaccines/#_ftnref12", "https://www.nature.com/articles/s41422-020-0364-z", "https://defyccc.com/anti-spike-vaccines/#_ftnref13", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)00234-8/fulltext", "https://defyccc.com/anti-spike-vaccines/#_ftnref14", "https://science.sciencemag.org/content/371/6534/1139", "https://defyccc.com/anti-spike-vaccines/#_ftnref15", "https://onlinelibrary.wiley.com/doi/full/10.1002/jmv.25518", "https://defyccc.com/anti-spike-vaccines/#_ftnref16", "https://pubmed.ncbi.nlm.nih.gov/33442692/", "https://defyccc.com/anti-spike-vaccines/#_ftnref17", "https://defyccc.com/covid-19-no-treatment-panel/", "https://defyccc.com/anti-spike-vaccines/#_ftnref18", "https://rupress.org/jem/article/218/5/e20202617/211835/Highly-functional-virus-specific-cellular-immune", "https://defyccc.com/anti-spike-vaccines/#_ftnref19", "https://doctors4covidethics.medium.com", "https://defyccc.com/anti-spike-vaccines/#_ftnref20", "https://doctors4covidethics.medium.com/covid-vaccines-necessity-efficacy-and-safety-b1d8bfbc9d2", "https://archive.is/EHrFH", "https://defyccc.com/anti-spike-vaccines/#_ftnref21", "https://doctors4covidethics.medium.com/urgent-open-letter-from-doctors-and-scientists-to-the-european-medicines-agency-regarding-covid-19-f6e17c311595", "https://defyccc.com/anti-spike-vaccines/#_ftnref22", "https://doctors4covidethics.medium.com/rebuttal-letter-to-european-medicines-agency-from-doctors-for-covid-ethics-april-1-2021-7d867f0121e", "https://defyccc.com/anti-spike-vaccines/#_ftnref23", "https://www.mayoclinic.org/diseases-conditions/coronavirus/in-depth/coronavirus-long-term-effects/art-20490351", "https://defyccc.com/anti-spike-vaccines/#_ftnref24", "https://www.news-medical.net/news/20210503/Vaccine-candidate-targeting-SARS-CoV-2-nucleocapsid-protein-elicits-protective-immune-response-in-animal-model.aspx", "https://ift.tt/33FIYyi", "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/#print", "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/?share=facebook", "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/?share=twitter", "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/?share=reddit", "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Anti-Spike%20Vaccines&body=https%3A%2F%2Fiowaclimate.org%2F2021%2F05%2F13%2Fanti-spike-vaccines%2F&share=email", "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/?share=pinterest", "https://iowaclimate.org/2021/05/13/anti-spike-vaccines/?share=tumblr"], "authors": [], "publish_date": "2021-05-14T00:36:50+00:00"}