{"result_id": "175014", "URL": "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/", "timestamp": "2023-04-25 15:42:15 CEST+0200", "meta": {"description": "A shocking new study from Israel compares the protection offered by vaccine-induced immunity versus natural immunity from a previous COVID-19 infection and finds the latter offers far more robust protection from infection, symptomatic disease, and hospitalization. Natural immunity confers  much longer lasting protection Directly comparing 16,215 previously COVID-19 infected individuals to 16,215 fully vaccinated individuals,…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Vaccinated 27x More Likely To Be Symptomatically Infected Than Unvaccinated Who’ve Had COVID", "cleaned_text": "A shocking new study from Israel compares the protection offered by vaccine-induced immunity versus natural immunity from a previous COVID-19 infection and finds the latter offers far more robust protection from infection, symptomatic disease, and hospitalization.\n\nDirectly comparing 16,215 previously COVID-19 infected individuals to 16,215 fully vaccinated individuals, 10 physicians (Gazit et al., 2021) preliminarily report (pre-print) fully vaccinated people are (a) 13 times more likely to be infected with COVID-19, (b) 27 times more likely to be symptomatically infected, and (c) 8 times more likely to be hospitalized than unvaccinated people with a prior COVID infection (natural immunity).\n\n“This study demonstrated that natural immunity confers longer lasting and stronger protection against infection, symptomatic disease and hospitalization caused by the Delta variant of SARS-CoV-2, compared to the BNT162b2 two-dose vaccine-induced immunity.”\n\nOther studies (Dan et al., 2021, Turner et al., 2021) have also indicated natural immunity obtained from a prior infection affords long-lasting, even “lifetime” anti-body protection from re-infection.\n\nA new study published in The Lancet reports an initial surge of antibody protection for those who have received the second dose of the Pfizer vaccine.\n\nUnfortunately, within weeks after the last shot, vaccine effectiveness begins to dramatically decline. In just 2½ months, already the vaccine has lost 56% of its antibody levels.\n\nAn “exponential decrease” in vaccine effectiveness of up to 40% per month after last shot\n\nAnother new study highlights the precipitous drop in antibody protection almost immediately following getting jabbed for the second time.\n\nWhile those with natural immunity from a prior COVID-19 infection (convalescents) lose <5% antibody protection per month after a COVID-19 infection, vaccinated-only individuals lose up to 40% of their immunity protection every month after their last shot.\n\nAt this pace, the artificial immunity afforded by vaccines wears off within a few months.\n\nIf strong and lasting protection from symptomatic disease, hospitalization, and death favors natural infection with COVID-19 over vaccination, then an understandable, “Catch-22” objection would be that it is still worse to be infected with COVID-19 than injected with the various immunizing vaccines available.\n\nSo here is the larger context worth considering.\n\nUnderestimating the prevalence of COVID-19 infections vastly overestimates the fatality rate\n\nThroughout 2020 several studies emerged assessing the actual prevalence COVID-19 infections in communities from antibody tests rather than just relying upon the number of confirmed cases. Because up to 96% of individuals contracting COVID-19 may have no symptoms, it is quite common for those infected with COVID-19 to not even know it. Therefore the prevalence – or number of individuals who have actually had COVID – has been assessed to be substantially higher in communities than when only using the number of confirmed cases suggests.\n\nIn Santa Clara, California, for example, the prevalence of COVID was assessed to be ~53,000 cases when extrapolating the assessed number of people with COVID-19 antibodies (seroprevalence). Instead of ~53,000, the number of confirmed cases in Santa Clara at the time of the study was 948, which is “56-fold lower than the number of infections predicted by this study” (Bendavid et al., 2021).\n\nAnother study (Doi et al., 2021) suggested the prevalence was “396 to 858-fold more than confirmed cases with PCR testing.”\n\nWith a much higher prevalence comes a much lower number of deaths per infection, or infection fatality rate (IFR).\n\n“In conclusion, our findings imply that ≈518,000 persons in Guilan Province may have been infected with SARS-COV-2 as of April 19, 2020, which is substantially higher than the 1,600 cumulative confirmed cases recorded. As of May 3, if we assume a 3-week lag from time of infection to death, 625 persons had died of confirmed COVID-19 in Guilan Province. This number would correspond to an infection-fatality rate of 0.12%” [ ].\n\nThe global infection fatality rate for COVID-19 is 0.23%\n\nAccording to a highly-cited synthesis of 61 studies from 51 locations across the globe using antibody (seroprevalence) data (Ioannidis, 2021), the median infection fatality rate (IFR) for COVID-19 (without vaccine intervention) has been determined to be 0.23% for all ages, and 0.05% (1 in 2000) for individuals under 70 years old.\n\nThe IFR for seasonal to pandemic flu, 0.1% to 0.67%, is similar to COVID-19 IFR\n\nCOVID-19’s 0.23% infection fatality rate is in the middle of the range of IFR estimates for seasonal (~0.1%) to “pandemic” influenza (i.e., 0.67% for the 1957-’58 “Asian flu” pandemic).\n\nDr. Anthony Fauci and Dr. Robert Redfield, CDC Director (US), published a NEJM paper in late February correctly predicting “the overall clinical consequences of Covid-19 may ultimately be more akin to those of a severe seasonal influenza (which has a case fatality rate of approximately 0.1%) or a pandemic influenza (similar to those in 1957 and 1968)”.\n\nStudies: vaccines may actually be enhancing, not neutralizing, COVID variants and spread\n\nDisturbing trends from across the globe, especially in highly-vaccinated countries like Israel, Iceland, and the UK, suggest new cases, hospitalizations, and deaths among the fully vaccinated have been rising dramatically since about mid-July. The “pandemic of the vaccinated” phenomenon has just recently (August) begun making its way into the United States.\n\nWithin the last week, two more studies (Liu et al., 2021, Yahi et al., 2021) suggest the more recent variants (Delta) are resisting vaccine neutralization. Worse, current vaccines may not reduce, but they may even enhance COVID’s Delta variant’s infectivity by spawning more resistant mutations.\n\n“[T]he emergence of SARS-CoV-2 variants may tip the scales in favor of infection enhancement. Our structural and modeling data suggest that it might be indeed the case for Delta variants” [ ].\n\nFurthermore, “boosters,” or third shots, may actually “boost enhancing anti-bodies” more than neutralizing antibodies (Liu et al., 2021).\n\nIn other words, vaccines may be worsening the current COVID surge.\n\n“85-90% of the hospitalizations are in fully vaccinated people”\n\nIn late July Israeli Minister of Health data suggested the vaccines’ effectiveness has fallen from the advertised >90% to 39%. It may be even lower now.\n\nHere are some recent headlines from across the globe documenting the burgeoning pandemic of the fully vaccinated.\n\nThe pandemic of the fully vaccinated has just recently begun permeating the United States. The percentage of new COVID cases and deaths represented by the fully vaccinated used to be in the low single digits in June and into July. In the last few weeks, however, in the USA’s most vaccinated states (Oregon, Vermont, Massachusetts), 20-40% of new cases and deaths are fully vaccinated individuals.", "opengraph": {"type": "article", "title": "Vaccinated 27x More Likely To Be Symptomatically Infected Than Unvaccinated Who’ve Had COVID", "url": "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/", "description": "A shocking new study from Israel compares the protection offered by vaccine-induced immunity versus natural immunity from a previous COVID-19 infection and finds the latter offers far more robust p…", "article:published_time": "2021-08-26T16:33:43+00:00", "article:modified_time": "2021-08-26T16:33:43+00:00", "site_name": "Iowa Climate Science Education", "image": "https://notrickszone.com/wp-content/uploads/2021/08/Vaccinated-27x-more-likely-to-be-infected-with-COVID-symptoms-than-unvaccintated-and-previously-infected-Gazit-2021-.jpg", "image:width": "642", "image:height": "527", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://science.sciencemag.org/content/371/6529/eabf4063", "https://www.nature.com/articles/s41586-021-03647-4", "https://www.nature.com/articles/s41586-021-03647-4", "https://medicine.wustl.edu/news/good-news-mild-covid-19-induces-lasting-antibody-protection/", "https://www.nature.com/articles/s41586-021-03647-4", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)01642-1/fulltext", "https://www.technologynetworks.com/biopharma/news/vaccine-antibody-levels-start-to-decline-after-23-months-351329", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)01642-1/fulltext", "https://www.medrxiv.org/content/10.1101/2021.08.19.21262111v1", "https://www.medrxiv.org/content/10.1101/2021.08.19.21262111v1", "https://www.reuters.com/article/us-health-coronavirus-prisons-testing-in/in-four-u-s-state-prisons-nearly-3300-inmates-test-positive-for-coronavirus-96-without-symptoms-idUSKCN2270RX", "https://academic.oup.com/ije/article/50/2/410/6146069", "https://pubmed.ncbi.nlm.nih.gov/33898863/", "https://wwwnc.cdc.gov/eid/article/27/2/20-1960_article", "https://pubmed.ncbi.nlm.nih.gov/33716331/", "https://pubmed.ncbi.nlm.nih.gov/33716331/", "https://www.nejm.org/doi/full/10.1056/nejme2002387", "https://www.nejm.org/doi/full/10.1056/nejme2002387", "https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-019-3750-8", "https://www.biorxiv.org/content/10.1101/2021.08.22.457114v1.full.pdf", "https://www.journalofinfection.com/action/showPdf?pii=S0163-4453%2821%2900392-3", "https://www.journalofinfection.com/action/showPdf?pii=S0163-4453%2821%2900392-3", "https://www.biorxiv.org/content/10.1101/2021.08.22.457114v1.full.pdf", "https://www.biorxiv.org/content/10.1101/2021.08.22.457114v1.full.pdf", "https://www.visiontimes.com/2021/08/08/israel-hospital-vaccinated.html", "https://www.bostonglobe.com/2021/07/23/nation/singapore-75-percent-covid-infections-are-among-vaccinated-people-report-says/", "https://www.bostonglobe.com/2021/08/01/nation/israel-sees-waning-coronavirus-vaccine-effectiveness/", "https://www.reuters.com/article/factcheck-iceland-vaccines/fact-check-covid-19-cases-in-iceland-are-not-proof-that-vaccines-are-ineffective-idUSL1N2P918F", "https://www.sciencemag.org/news/2021/08/grim-warning-israel-vaccination-blunts-does-not-defeat-delta", "https://www.opb.org/article/2021/08/07/covid-19-oregon-cases-delta-variant-vaccine-health-authority/", "https://www.worldometers.info/coronavirus/usa/oregon/", "https://vtdigger.org/2021/08/20/vermont-is-the-most-vaccinated-state-in-america-is-that-enough/", "https://www.nbcboston.com/news/local/nearly-10000-breakthrough-covid-cases-reported-in-mass-over-100-have-now-died/2464309/", "https://ift.tt/3ji8Qcg", "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/#print", "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/?share=facebook", "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/?share=twitter", "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/?share=reddit", "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Vaccinated%2027x%20More%20Likely%20To%20Be%20Symptomatically%20Infected%20Than%20Unvaccinated%20Who%E2%80%99ve%20Had%20COVID&body=https%3A%2F%2Fiowaclimate.org%2F2021%2F08%2F26%2Fvaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid%2F&share=email", "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/?share=pinterest", "https://iowaclimate.org/2021/08/26/vaccinated-27x-more-likely-to-be-symptomatically-infected-than-unvaccinated-whove-had-covid/?share=tumblr"], "authors": [], "publish_date": "2021-08-26T16:33:43+00:00"}