{"result_id": "175032", "URL": "https://iowaclimate.org/2021/12/30/pandemic-of-the-vaccinated-3/", "timestamp": "2023-04-25 15:42:25 CEST+0200", "meta": {"description": "Data from several countries now shows that, per capita, after a short honeymoon, the vaccinated are more likely to catch Omicron than the unvaccinated. No one can pretend any more that we need to get vaccinated to protect our friends. As if to confirm the bad news, Twitter suspended an inventor of the mRNA vaccine,…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/12/30/pandemic-of-the-vaccinated-3/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Pandemic of the vaccinated", "cleaned_text": "Data from several countries now shows that, per capita, after a short honeymoon, the vaccinated are more likely to catch Omicron than the unvaccinated. No one can pretend any more that we need to get vaccinated to protect our friends.\n\nAs if to confirm the bad news, Twitter suspended an inventor of the mRNA vaccine, Dr Robert Malone. They’re trying to cut him off from his half a million followers so it’s my duty and yours to sign up to his site instead. Who needs Twitter? In other omens, last week, Joe Biden even started to give Donald Trump credit for vaccines. We can see where that might lead…\n\nIceland is one of the most boosted nations on Earth\n\nIceland is 80% triple boosted yet cases are going through the roof.\n\nAnd the fastest growing group of infections is in the fully vaccinated (dark blue).\n\nImagine a mass vaccination program against the wrong molecular shape. Imagine a government insisted that every single health-worker took the same vaccine and sacked those who didn’t.\n\nTime to give them their jobs back.\n\nIn Denmark, against Omicron, both Pfizer and Moderna only protect a third to a half of the vacinees for a month. After 3 months the “efficacy” against infection is negative. 90 days after vaccination with Pfizer, vaccinees are 76% more likely to catch Covid (Omicron) than if they were not vaccinated. (Hansen et al)\n\nOr to graph that another way — noting that zero is what we get with no vaccine:\n\nBoostees would need to take vaccines every two months to stay in the honeymoon zone. It may save lives from Covid but cost lives from other conditions. What if inflammatory markers were raised for months after vaccination as some Cardiologists think. That would put people at a higher risk of heart attacks? Covid vaccines may not improve our chances of staying alive at all even in a pandemic. (Click that link to read the extraordinary UK study showing how many deaths of newly vaccinated people were classified as “unvaccinated”).\n\nBear in mind, this is just about cases, not about hospitalization or ICU. But even if vaccines reduce hospitalization, so does Ivermectin and it can stop the spread of Covid as well. Just ask Uttar Pradesh, or Indonesia, or Japan.\n\nLikewise in Ontario the per capita rate of infections in the fully vaccinated has risen much faster than the rate in the unvaccinated.\n\nThe Ontario data can be split into different age groups (by clicking the screen buttons on their site) but strangely, there is no age group where the vaccinated are higher per capita, yet they are supposed to be higher on average across all ages, so something doesn’t add up.\n\nThe same site in Ontario show that there are twice as many unvaccinated cases (70) in the ICU as there are vaccinated (35). That may mean the vaccinated have lower odds of ending up in the ICU. Though it’s not clear whether these patients have Delta or Omicron.\n\nThe early UK data shows the people with the most vaccinations are the most likely to get Omicron up to December 12th.\n\nHansen et al (2021) Vaccine effectiveness against SARS-CoV-2 infection with the Omicron or Delta variants following a two-dose or booster BNT162b2 or mRNA-1273 vaccination series: A Danish cohort study, doi: https://ift.tt/3epv4FW", "opengraph": {"type": "article", "title": "Pandemic of the vaccinated", "url": "https://iowaclimate.org/2021/12/30/pandemic-of-the-vaccinated-3/", "description": "Data from several countries now shows that, per capita, after a short honeymoon, the vaccinated are more likely to catch Omicron than the unvaccinated. No one can pretend any more that we need to g…", "article:published_time": "2021-12-30T20:33:33+00:00", "article:modified_time": "2021-12-30T20:33:33+00:00", "site_name": "Iowa Climate Science Education", "image": "https://joannenova.com.au/wp-content/denmark-table-vax-effectiveness.png", "image:alt": "Denmark, Table. Vaccine effectiveness against Omicron. ", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://rwmalonemd.substack.com/p/permanently-suspended-on-twitter", "https://rwmalonemd.substack.com/", "https://edition.cnn.com/2021/12/21/politics/biden-trump-covid-vaccine-booster/index.html", "https://joannenova.com.au/2021/11/vaccine-risk-blood-markers-suggest-an-increase-risk-of-heart-attacks/?utm_source=rss&utm_medium=rss&utm_campaign=vaccine-risk-blood-markers-suggest-an-increase-risk-of-heart-attacks", "https://joannenova.com.au/2021/12/blockbuster-paper-covid-vaccines-may-not-improve-your-chances-of-staying-alive-at-all-even-in-a-pandemic/", "https://joannenova.com.au/2021/09/uttar-pradesh-india-wipes-out-covid-with-ivermectin/", "https://joannenova.com.au/2021/10/indonesia-cut-covid-by-98-with-ivermectin-while-australia-grew-cases-500-with-lock-n-vax/", "https://joannenova.com.au/2021/12/oh-the-mystery-of-how-coronavirus-doesnt-infect-and-kill-people-in-japan-anymore/", "https://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/adhocs/14107coronaviruscovid19infectionsurveyukcharacteristicsrelatedtohavinganomicroncompatibleresultinthosewhotestpositiveforcovid19", "https://ift.tt/32KLq9w", "https://ift.tt/3HkHNq6", "https://ift.tt/3sIKM7q", "http://www.rwmalonemd.com", "https://www.medrxiv.org/content/10.1101/2021.12.20.21267966v2.full", "https://ift.tt/3epv4FW"], "authors": [], "publish_date": "2021-12-30T20:33:33+00:00"}