{"result_id": "175028", "URL": "https://iowaclimate.org/2022/10/06/the-new-pause-lengthens-to-8-years/", "timestamp": "2023-04-25 15:42:23 CEST+0200", "meta": {"description": "By Christopher Monckton of Brenchley The New Pause, having paused a month ago, has now lengthened again: this time to exactly eight years. As always, the Pause is calculated as the longest period for which the least-squares linear-regression trend up to the most recent month for which the UAH global mean surface temperature anomaly is…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2022/10/06/the-new-pause-lengthens-to-8-years/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "The New Pause Lengthens to 8 Years", "cleaned_text": "The New Pause, having paused a month ago, has now lengthened again: this time to exactly eight years. As always, the Pause is calculated as the longest period for which the least-squares linear-regression trend up to the most recent month for which the UAH global mean surface temperature anomaly is available is zero.\n\nThe trend on the entire dataset during the 526 months from December 1978 to September 2022 is 0.95 C°, equivalent to only 1.34 C°/century. So slow a rate of warming is well within the natural variability of the climate, and is proving net-beneficial.\n\nThe New Pause has grown to fully eight years in length at a most embarrassing point for true-believers: for the cost to the West of the economically suicidal policies that they have long advocated is now becoming all too painfully apparent, just as it is also ever more evident that the warming since 1990 is well below half the midrange prediction made by IPCC that year.", "opengraph": {"type": "article", "title": "The New Pause Lengthens to 8 Years", "url": "https://iowaclimate.org/2022/10/06/the-new-pause-lengthens-to-8-years/", "description": "By Christopher Monckton of Brenchley The New Pause, having paused a month ago, has now lengthened again: this time to exactly eight years. As always, the Pause is calculated as the longest period f…", "article:published_time": "2022-10-06T06:33:06+00:00", "article:modified_time": "2022-10-06T06:33:06+00:00", "site_name": "Iowa Climate Science Education", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2022/10/pause.webp?resize=839%2C420&ssl=1", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-10-06T06:33:06+00:00"}