{"result_id": "175035", "URL": "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/", "timestamp": "2023-04-25 15:42:27 CEST+0200", "meta": {"description": "(Yahi et al., 2021) Infection-enhancing anti-SARS-CoV-2 antibodies recognize both the original Wuhan/D614G strain and Delta variants. A potential risk for mass vaccination? Yes, it is! “Antibody dependent enhancement (ADE) of infection is a safety concern for vaccine strategies.”  “Using molecular modeling approaches, we show that enhancing antibodies have a higher affinity for Delta variants than…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Some papers about enhancing antibodies", "cleaned_text": "(Yahi et al., 2021) Infection-enhancing anti-SARS-CoV-2 antibodies recognize both the original Wuhan/D614G strain and Delta variants. A potential risk for mass vaccination?\n\nYes, it is!\n\n“Antibody dependent enhancement (ADE) of infection is a safety concern for vaccine strategies.”\n\n“Using molecular modeling approaches, we show that enhancing antibodies have a higher affinity for Delta variants than for Wuhan/D614G NTDs. We show that enhancing antibodies reinforce the binding of the spike trimer to the host cell membrane by clamping the NTD to lipid raft microdomains. This stabilizing mechanism may facilitate the conformational change that induces the demasking of the receptor binding domain. As the NTD is also targeted by neutralizing antibodies, our data suggest that the balance between neutralizing and facilitating antibodies in vaccinated individuals is in favor of neutralization for the original Wuhan/D614G strain. However, in the case of the Delta variant, neutralizing antibodies have a decreased affinity for the spike protein, whereas facilitating antibodies display a strikingly increased affinity. Thus, ADE may be a concern for people receiving vaccines based on the original Wuhan strain spike sequence (either mRNA or viral vectors).”\n\n(Liu et al., 2021a) The SARS-CoV-2 Delta variant is poised to acquire complete resistance to wild-type spike vaccines\n\n“A third round of booster immunization with the SARS-CoV-2 vaccine is currently under consideration. Our data suggest that repeated immunization with the wild-type spike may not be effective in controlling the newly emerging Delta variants.\n\nHowever, epitopes of the enhancing antibodies, not neutralizing antibodies, are well conserved in most SARS-CoV-2 variants, including the Delta variant. Therefore, additional immunization of the spike protein derived from SARS-CoV-2 variants may boost enhancing antibodies more than the neutralizing antibodies in individuals who were previously infected with wild-type SARS-CoV-2 or immunized with vaccines composed of wild-type spike protein.”\n\n“Here, we found that the Delta variant completely escaped from anti-N-terminal domain (NTD) neutralizing antibodies, while increasing responsiveness to anti-NTD infectivity-enhancing antibodies. Although Pfizer-BioNTech BNT162b2-immune sera neutralized the Delta variant, when four common mutations were introduced into the receptor binding domain (RBD) of the Delta variant (Delta 4+), some BNT162b2-immune sera lost neutralizing activity and enhanced the infectivity. Unique mutations in the Delta NTD were involved in the enhanced infectivity by the BNT162b2-immune sera. Sera of mice immunized by Delta spike, but not wild-type spike, consistently neutralized the Delta 4+ variant without enhancing infectivity.”\n\nThis study has found that none of the known neutralizing antibodies, targeting spike NTD, recognize it. On the other hand, there are enhancing antibodies associated with NTD, which do increase infectivity “by inducing the open form of the RBD” – another new enhancement mechanism. It listed spike NTD mutations T19R, G142D, E156G, del157-158. G142D is apparently out.\n\n(Liu et al., 2021b) An infectivity-enhancing site on the SARS-CoV-2 spike protein targeted by antibodies\n\n“These findings demonstrate that not only neutralizing antibodies but also enhancing antibodies are produced during SARS-CoV-2 infection.”\n\nLiu, Y., Arase, N., Kishikawa, J., Hirose, M., Li, S., Tada, A., Matsuoka, S., Arakawa, A., Akamatsu, K., Ono, C., Jin, H., Kishida, K., Nakai, W., Kohyama, M., Nakagawa, A., Yamagishi, Y., Nakagami, H., Kumanogoh, A., Matsuura, Y., Standley, D.M., Kato, T., Okada, M., Fujimoto, M., Arase, H., 2021a. The SARS-CoV-2 Delta variant is poised to acquire complete resistance to wild-type spike vaccines. https://doi.org/10.1101/2021.08.22.457114\n\nLiu, Y., Soh, W.T., Kishikawa, J.-I., Hirose, M., Nakayama, E.E., Li, S., Sasai, M., Suzuki, T., Tada, A., Arakawa, A., Matsuoka, S., Akamatsu, K., Matsuda, M., Ono, C., Torii, S., Kishida, K., Jin, H., Nakai, W., Arase, N., Nakagawa, A., Matsumoto, M., Nakazaki, Y., Shindo, Y., Kohyama, M., Tomii, K., Ohmura, K., Ohshima, S., Okamoto, T., Yamamoto, M., Nakagami, H., Matsuura, Y., Nakagawa, A., Kato, T., Okada, M., Standley, D.M., Shioda, T., Arase, H., 2021b. An infectivity-enhancing site on the SARS-CoV-2 spike protein targeted by antibodies. Cell 184, 3452-3466.e18. https://doi.org/10.1016/j.cell.2021.05.032\n\nYahi, N., Chahinian, H., Fantini, J., 2021. Infection-enhancing anti-SARS-CoV-2 antibodies recognize both the original Wuhan/D614G strain and Delta variants. A potential risk for mass vaccination. J Infect. https://doi.org/10.1016/j.jinf.2021.08.010", "opengraph": {"type": "article", "title": "Some papers about enhancing antibodies", "url": "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/", "description": "(Yahi et al., 2021) Infection-enhancing anti-SARS-CoV-2 antibodies recognize both the original Wuhan/D614G strain and Delta variants. A potential risk for mass vaccination? Yes, it is! “Antibody de…", "article:published_time": "2021-09-12T10:33:22+00:00", "article:modified_time": "2021-09-12T10:33:22+00:00", "site_name": "Iowa Climate Science Education", "image": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://doi.org/10.1101/2021.08.22.457114", "https://doi.org/10.1016/j.cell.2021.05.032", "https://doi.org/10.1016/j.jinf.2021.08.010", "https://ift.tt/2VyiXAE", "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/#print", "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/?share=facebook", "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/?share=twitter", "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/?share=reddit", "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Some%20papers%20about%20enhancing%20antibodies&body=https%3A%2F%2Fiowaclimate.org%2F2021%2F09%2F12%2Fsome-papers-about-enhancing-antibodies%2F&share=email", "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/?share=pinterest", "https://iowaclimate.org/2021/09/12/some-papers-about-enhancing-antibodies/?share=tumblr"], "authors": [], "publish_date": "2021-09-12T10:33:22+00:00"}