{"result_id": "175001", "URL": "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/", "timestamp": "2023-04-25 15:42:06 CEST+0200", "meta": {"description": "German public health expert, physician, warns those who have already been vaccinated: “Don’t get another shot under any circumstances!“ German physician and public health expert Wolfgang Wodarg is a leading critic of COVID-19 panic and the high pressure vaccine campaign against the COVID-19 virus. In an interview with Elsa Mittmannsgruber, he tells the public: “With…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "German Physician Warns Already Vaxxed: “Don’t Get Another Shot Under Any Circumstances!“", "cleaned_text": "German public health expert, physician, warns those who have already been vaccinated: “Don’t get another shot under any circumstances!“\n\nGerman physician and public health expert Wolfgang Wodarg is a leading critic of COVID-19 panic and the high pressure vaccine campaign against the COVID-19 virus. In an interview with Elsa Mittmannsgruber, he tells the public: “With every booster shot, the chance that something bad happens increases exponentially.” …”The risk with every shot becomes ever higher.”\n\nOn the approval of new vaccines: “We’re flying in the dark.”\n\nOne problem Dr. Wodarg says is how the injection is administered. The needle should pernitrate into the muscle and not into a blood vessel. However medical authorities in Germany are advising that it’s not important to avoid injection into a blood vessel. “In my view it’s irresponsible to inject the contents, for example mRNA nanoparticles, into a blood vessel.” This, Wodarg explains, can lead to serious heart conditions, including death. The risk is especially high for young males because they have greater upper arm muscle development, and so the chance the injection finds its way into a blood vessel is higher. “It could end up being lethal. It’s a dangerous thing.”\n\nWodarg explains that even if the injection does not reach into a vein, the content will eventually find its way to the lymph nodes and later into the organs such as the liver, spleen or reproductive organs.\n\nThe virus itself normally enters the body through the mouth, nose and air passages and the immune system responds accordingly. Only in a tiny fraction of the COVID infection cases do the virus and it’s spike protein reach the blood vessels. With the injection, however, the spike proteins get distributed though the entire body and can wreak havoc.\n\n“The spikes are dangerous – very dangerous. They damage everything wherever they show up: in the brain, in the spleen, in the intestines – and I can’t understand that we are allowing these spikes to be produced inside ourselves. That is the biggest risk.”\n\nOne indication that the vaccine is wreaking havoc is the hospital admission statistics from the Robert Koch Institute. The number of patients being admitted due to respiratory illness has remained stable, yet patients being admitted due to cardiac circulatory system problems has risen in parallel with the number vaccinated, thus pointing vaccine spike protein injury. Also patients with neurological disorders have increased since vaccination began.\n\nWodarg says that it can be easily determined whether or not blood microclotting has occurred by testing d-dimers, Micro-clotting rarely occurs among COVID patients. “But when suddenly lots of people have these symptoms after having been vaccinated, then it’s pretty clear it’s related to the vaccine and that it has nothing to do with an infection.”\n\nWodarg also warms of a real possibility of ADE for vaccinated individuals\n\nThe retired physician says doctors are playing along for two reasons: fear and money. But he doubts that doctors will be able to continue to remain silent as more and more people are injured by the vaccine. “They are going to have to answer.”\n\n“Currently there are more victims after a vaccination then ever before. Never have there been so many adverse effects from vaccination,” says Wodarg. “What has happened as a consequence of the vaccine is gigantic.” …”Not only the is media sick, but so is policymaking.”\n\n“The bodily changes that people undergo through these shots, they are in part irreversible,” Wodarg warns.", "opengraph": {"type": "article", "title": "German Physician Warns Already Vaxxed: “Don’t Get Another Shot Under Any Circumstances!“", "url": "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/", "description": "German public health expert, physician, warns those who have already been vaccinated: “Don’t get another shot under any circumstances!“ German physician and public health expert Wolfgang Wodarg is …", "article:published_time": "2021-11-21T18:33:53+00:00", "article:modified_time": "2021-11-21T18:33:53+00:00", "site_name": "Iowa Climate Science Education", "image": "https://notrickszone.com/wp-content/uploads/2021/11/Wodarg_AUF1.png", "image:width": "323", "image:height": "376", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2021/11/Wodarg_AUF1.png", "https://auf1.tv/aufrecht-auf1/dr-wodargs-appell-an-geimpfte-nehmen-sie-auf-keinen-fall-noch-eine-spritze", "https://www.chop.edu/centers-programs/vaccine-education-center/vaccine-safety/antibody-dependent-enhancement-and-vaccines", "https://ift.tt/3nDTvoF", "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/#print", "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/?share=facebook", "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/?share=twitter", "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/?share=reddit", "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20German%20Physician%20Warns%20Already%20Vaxxed%3A%20%E2%80%9CDon%E2%80%99t%20Get%20Another%20Shot%20Under%20Any%20Circumstances%21%E2%80%9C&body=https%3A%2F%2Fiowaclimate.org%2F2021%2F11%2F21%2Fgerman-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances%2F&share=email", "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/?share=pinterest", "https://iowaclimate.org/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/?share=tumblr"], "authors": [], "publish_date": "2021-11-21T18:33:53+00:00"}