{"result_id": "175031", "URL": "https://iowaclimate.org/2021/08/04/when-medical-personnel-have-dreadful-vaccine-experiences/", "timestamp": "2023-04-25 15:42:25 CEST+0200", "meta": {"description": "Doctors and nurses are among the thousands of individuals coping with severe COVID-19 vaccine reactions. partial comment of a Medscape forum participant; click image for complete remarks Since early this year, medical professionals have discussed COVID-19 vaccines on an online forum hosted by Medscape – see my previous report here. As time has passed, a…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/08/04/when-medical-personnel-have-dreadful-vaccine-experiences/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "When Medical Personnel Have Dreadful Vaccine Experiences", "cleaned_text": "Doctors and nurses are among the thousands of individuals coping with severe COVID-19 vaccine reactions.\n\n\n\nSince early this year, medical professionals have discussed COVID-19 vaccines on an online forum hosted by Medscape – see my previous report here. As time has passed, a growing number have described adverse reactions they, themselves, experienced after receiving these vaccines. (All bolding of text below by me, some quotes contain misspellings and grammatical errors.)\n\nIn late February, Dr Danice Hertz wrote about getting her first Pfizer shot. Thirty minutes afterward, she developed\n\nsevere burning in my face, dizziness and a very high spike in blood pressure. For the past nine weeks, I have had severe paresthesias [burning, tingling] in my face, tongue, chest wall and limbs as well as dizziness, headaches, tremor and weakness. I am incapacitated and fear that I will not recover. I have been unable to find physicians in the community who know anything about this or how to treat me. I have reached out to the top people at the FDA, CDC and NIH. They admit that they are fully aware of these neurological reactions and are looking into them. Why are they not being publicized? It makes it very difficult for people like me to get medical care.\n\nIn April, Dr Elizabeth Bollenbacher reported blood in her urine, a broken blood vessel in her eye, and deafness in one ear following a Pfizer vaccine. “I am worried about what comes next,” she wrote.\n\nCritical care nurse Kim Bertholf received her first Pfizer shot in December, and her second in January. “I have tried to be positive and not discourage others from getting the vaccine,” she wrote in early May,\n\nJason F, a critical care paramedic, sought medical care for abdominal pain and blood in his urine five days after receiving his first Moderna shot. After a CT scan identified two small kidney stones, he felt certain his symptoms were unrelated to the vaccine. But six days after his second shot, he was “doubled over in abdominal pain again.” Subsequent scans revealed two large kidney stones, two new stones, and an enlarged spleen of unknown cause. He reports:\n\nDr Cassandra Balomiri is a 29-year-old medical resident in Germany. In June, more than three months after receiving an AstraZeneca COVID vaccine (she chose Pfizer for her second shot in May), she described a constellation of ongoing symptoms on the Medscape forum, including visual problems, dizziness, and tingling/numbness/spasms in her extremities. Explaining that numerous medical tests had failed to identify any cause, she described this as “the most horrible experience of my life.”\n\nIn another post a few days later, she observed that those suffering from vaccine side effects “are just ignored!…no one in the medical system really supports you” in Germany, she said, for fear of appearing to be an anti-vaxxer. “I am not against vaccine and have many friends/family who had no problems after Covid Vaccine,” she wrote, “but this does not mean that the rest of us, even if we’re not that many, should be ignored.”\n\nSimilarly, a Swiss biologist reported suffering muscle and joint pain for a month, beginning the day after receiving her first Pfizer shot:\n\nIn June, six months after a Canadian registered nurse and hospital administrator received her first Moderna shot, she described muscle pain, spasms, headaches, and fatigue:\n\nA 28-year-old “exceptionally health athlete outside of work,” Erin Helgason says “I got my vaccines as soon as I could while health care professionals were being prioritized in my province.” During the 10 weeks since then, Helgason has experienced episodic leg, chest, and neck pain, as well as high blood pressure. But numerous x-rays, scans, and blood tests have failed to identity any cause. “Im terrified that I’m never going to feel normal again.”\n\nEchoing Jason F’s account regarding additional kidney stones, Mike D reported that his advanced lung cancer, which had been stable for six years, appears to have gotten worse following his two doses of the Moderna vaccine. Dr Erich Glenn Acebedo then chimed in: “I have two patients with stage 1 cancer. Now have progression of their disease after 2 doses of the vaccines.” Elaborating elsewhere, Acebedo claims tumour growth was evident “within days” of the second dose, and that a possible link between these events should be investigated.\n\nAmong many other disturbing tales to be found on this forum is that of Shaun Barc, a 52-year-old male research nurse practitioner who described himself as healthy prior to vaccination, taking no medications and with no chronic illnesses. “As a nurse I am extremely pro-vaccine,” he wrote, “but I am stunned at the lack of a mechanism to address and help the small percentage that have encountered severe, persisting side effects.”\n\nDuring the six months since his second vaccine dose, Barc has experienced muscle spams, severe headaches, eye problems, abdominal pain, insomnia, a racing heart, and high blood pressure. “As a researcher who worked on the vaccine trials, I told the ER doc that I was pretty certain I was having a reaction to the vaccine. He was too quick to dismiss this.”\n\nBarc has also been plagued by a “frightening and debilitating” ringing in his right ear. His hearing tests have all been normal, however, and three specialists have told him he’ll “have to learn to live with it.” Despite working in the medical field, and despite his “relentless” search for answers, he says “it is a struggle to find anyone who knows anything about vaccine reactions.”\n\nThis blog isn’t cluttered with intrusive ads –\n\n which means no income is earned in that manner.\n\n If what you’ve just read is useful or helpful,\n\n please consider making a donation 🙂", "opengraph": {"type": "article", "title": "When Medical Personnel Have Dreadful Vaccine Experiences", "url": "https://iowaclimate.org/2021/08/04/when-medical-personnel-have-dreadful-vaccine-experiences/", "description": "Doctors and nurses are among the thousands of individuals coping with severe COVID-19 vaccine reactions. partial comment of a Medscape forum participant; click image for complete remarks Since earl…", "article:published_time": "2021-08-04T11:33:54+00:00", "article:modified_time": "2021-08-04T11:33:54+00:00", "site_name": "Iowa Climate Science Education", "image": "https://i1.wp.com/nofrakkingconsensus.com/wp-content/uploads/2021/08/athlete_normal_again.jpg?resize=547%2C71&ssl=1", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i2.wp.com/nofrakkingconsensus.com/wp-content/uploads/2021/08/terrified_athlete_vaccine_reaction.jpg?ssl=1", "https://www.medscape.com/", "https://nofrakkingconsensus.com/2021/08/02/covid-vaccines-what-medical-people-say-amongst-themselves/", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/dr_danice_hertz_Medscape_forum_25Feb2021.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/dr_Ellizabeth_Bollenbacher_Medscape_forum_20Apr2021.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/critical_care_nurse_Medscape_forum_2May2021.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/paramedic_possible_vaccine_link_not_taken_seriously.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/Cassandra_Balomiri_29yrs.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/Cassandra_Balomiri_AZ_and_Pfizer.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/cassandra_balomiri_worst_experience.jpg", "https://www.medscape.com/sites/public/covid-19/vaccine-insights/how-concerned-are-you-about-vaccine-related-adverse-events", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/Cassandra_Balomiri_29yrs.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/swiss_biologist_covid_vaccine_reaction.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/Canadian_hospital_administrator_vaccine_reaction.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/terrified_athlete_vaccine_reaction.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/lung_cancer_worse_post_vaccines.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/lung_cancer_worse_post_vaccines.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/cancer_worse_after_COVID_vaccines.jpg", "https://nofrakkingconsensus.com/wp-content/uploads/2021/08/male_nurse_covid_vaccine_reaction.jpg", "https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=FCFERJBSSPE6Y"], "authors": [], "publish_date": "2021-08-04T11:33:54+00:00"}