{"result_id": "175033", "URL": "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/", "timestamp": "2023-04-25 15:42:26 CEST+0200", "meta": {"description": "PDF Version with line numbers Excerpts from references for a review Preprint V.1.0.  June 8, 2021 Dangers of COVID-19 Vaccine Associated Enhanced Disease Leo Goldstein [1] COVID-19 vaccines, used in the US and most of EU, provide acceptable immunity against currently prevalent variants of SARS-COV-2 for up to six months. Evidence suggests that many vaccinated…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Dangers of COVID-19 Vaccine Associated Enhanced Disease", "cleaned_text": "PDF Version with line numbers\n\n Excerpts from references for a review\n\n Preprint V.1.0. June 8, 2021\n• COVID-19 vaccines, used in the US and most of EU, provide acceptable immunity against currently prevalent variants of SARS-COV-2 for up to six months. Evidence suggests that many vaccinated persons younger than 50 are likely to experience vaccine associated enhanced disease (VAED), when they encounter SARS-COV-2 later, in the fall or winter this year.\n• The causes are waning antibody immunity and future spread of variants of concern (VoC), resistant to or even escaping vaccine-induced immunity.\n• These two problems are likely to create a “perfect storm” in the fall of 2020. The time to start preparing for it is now.\n• Children and adolescents are negatively affected by COVID-19 vaccines more than adults, because of stronger effect of the COVID-19 vaccines in them, in cross-reaction with the common cold coronaviruses. Additionally, healthy children and adolescents do not need vaccination against COVID-19.\n• Mass vaccination of children and adolescents must stop.\n• The fight against COVID-19 should shift from mass vaccination with the current anti-spike vaccines, which are already obsolete because of the coronavirus evolution, to proven early antiviral treatments and possibly prophylaxis.\n\nVaccine Associated Enhanced Disease (VAED) is a special case of antibody-dependent enhancement (ADE) of infectious diseases, caused by vaccination. Disease enhancement is detrimental to the patient.\n\nADE takes place when neutralizing antibodies do not completely neutralize the pathogen. This might happen when the titer levels are too low or when the antibodies are for another pathogen serotype or variant. Many (but not all) past attempts to develop vaccines against SARS, MERS, and other coronaviruses failed because they led to ADE.\n\nThis problem is even worse in the current COVID-19 vaccines because they only target the spike protein of SARS-COV-2, which presents unusually few targets for natural antibodies and quickly mutates. Further, failure to treat infected patients and have created huge amounts of SARS-COV-2 and the ideal conditions for its evolution. The coronavirus has already used these opportunities to increase its transmissibility and to avoid some antibodies. It will continue to mutate toward resistance to the vaccine-induced immunity.\n\nADE was the main concern in the development and emergency authorizations of the COVID-19 vaccines. The vaccine trials and early administration to adults have not shown immediate ADE. Given the remarkably high antibody titers elicited by the vaccines, immediate ADE was unlikely. However, this provides no assurance for the future when the antibodies immunity wanes and distant variants or even serotypes of SARS-COV-2 appear. Multiple lines of evidence, reviewed below, point to a high likelihood of future VAED in vaccinated individuals.\n\nFDA, Emergency Use Authorization (EUA) for an Unapproved Product Memo (FDA re-Pfizer 2020)\n\nAntibody-dependent enhancement (ADE) is an immune system phenomenon, when neutralizing antibodies bind to a virus, but instead of or in addition to neutralizing it, help it to enter cells. The term is also used when these antibodies, not finding targets on the virus, damage the healthy cells (Hellerstein 2020). ADE might happen when the quantity (titer) or quality (matching epitopes presented by the virus) is low. ADE caused by vaccines is called VAED. In the respiratory diseases, it is sometimes called VAERD (vaccine associated enhancement of respiratory disease).\n\n(Lee et al. 2020) reviews ADE as relevant to SARS-COV-2 vaccines and antibody treatments.\n\nThere are many ADE mechanisms, but they can be classified in two types:\n• sub- or non-neutralizing antibodies help the virus to enter cells (enhanced infectivity, likely to increase virulence)\n• sub- or non-neutralizing antibodies attack healthy cells instead of the virus (enhanced virulence, might increase infectivity indirectly)\n\nBoth used to happen in the past attempts to develop vaccines against coronaviruses.\n\nAOS (original antigenic sin) is a propensity of the immune system to react to a second pathogen similar to the one it has already encountered in the same way. Immunization against one strain of a pathogen might generate ineffective immune response to another, and to trigger ADE (Vatti et al. 2017), (Fierz and Walz 2020). (Lyons-Weiler 2020) describes one virulence enhancement mechanism.\n\nThis is a theoretical paper with a short review of the relevant literature.\n\nThe current COVID-19 vaccines, used in the US and most Western countries, are mRNA and viral vector vaccines, targeting only the spike protein of SARS-COV-2. For the purposes of this paper, “COVID-19 vaccines” only refer to these mRNA & viral vector vaccines, unless otherwise specified. Anti-spike coronavirus vaccines are known to be especially prone to cause ADE. For SARS-COV-2, the selection of the spike (S-protein) as the only antigen was an especially bad choice (Hellerstein 2020). T-cells, rather than antibodies, provide long term immunity and do not cause ADE, but only about a quarter of T-cells associated with SARS-COV-2 target its spike, compared with half to two thirds in previous coronaviruses.\n\nMany (although not all) attempts at vaccines against other coronaviruses have failed because they caused ADE in animal models. This was the case with the experimental vaccines against SARS and MERS. The same thing happened during the attempt to develop a vaccine against FIPV, a coronavirus disease in cats (Agrawal et al. 2016), (Gao et al. 2003), (Dandekar and Perlman 2005). On a remarkable side note, Remdesivir was tried for FIPV in cats and failed. It was then tried on humans for COVID-19 and also failed (Goldstein 2020), but still received a EUA.\n\nThe current appearance that the COVID-19 vaccines do not cause ADE is insufficient because of the short time between vaccination and exposure to SARS-COV-2. Remarkably high antibody titer, elicited by these vaccines, neutralizes SARS-COV-2. However, vaccine induced antibody titer significantly drops after 6-9 months following the full vaccination (Dispinseri et al. 2021). This is when the vaccine recipients may become susceptible to ADE, upon exposure to SARS-COV-2. Another contributing is the coronavirus’ divergence from the original genome, targeted by the existing COVID-19 vaccines. Currently dominant variants are partially resistant to the natural and vaccine induced immunity. Future variants will be even more resistant or will completely escape it. These two factors have dangerous synergy.\n\nHuge amounts of the coronavirus are in circulation because so many people get infected worldwide. Lockdowns (Wittkowski 2021) and “do not treat” policies have created ideal conditions for the coronavirus’ evolution toward increased infectivity and immunity evasion. The two-shot vaccination protocol also accelerates the vaccine escape (Di Caro et al. 2021), (Weisblum et al. 2020), (Wang et al. 2014).\n\nAccurately predicting ADE is hard, but there are many variants of concern and thousands of subvariants. They continue to evolve. At least some of them will cause infection enhancement, thus gaining an evolutionary advantage, and will become prevalent. Thus, the current strategy of excessive vaccination and lack of early antiviral treatment is all but guaranteed to bring about ADE.\n\nThe speed of SARS-COV-2’s evolution toward immunity evasion was not expected when the vaccines were developed (Chen et al. 2021), (Wang et al. 2021). Inactivated whole virus vaccines, like the first three vaccines authorized in China (Baraniuk 2021), also present theoretical danger of ADE, and have less efficacy than mRNA vaccines.\n\nNormally, evolutionary pressure on pathogens is toward lower virulence (milder disease). More virulent pathogens reveal their presence faster, which leads to treatment and/or isolation of the human hosts. The public response of isolating healthy people eliminates this pressure. An evolutionary pressure toward increased virulence of the pathogen always exists – sicker hosts shed more virus. In the midst of lockdowns, a sicker person is also likely to break the lockdown in order to seek help. Thus, the lockdown policies contribute to spread of more virulent variants of the coronavirus.\n\nUnlike narrow immunity from an anti-spike vaccine, an individual who obtained immunity by infection or exposure, develops a broad and long-term immunity, with T-cells, B-cells, and antibodies against all antigens presented by the coronavirus in all replication phases. The quick emergence of a variant evading natural immunity is unlikely. Normal antigenic drift of coronaviruses is slow and allows the natural immunity to catch up. Some research shows that this happens with the common cold coronavirus E229 (Eguia et al. 2021).\n\nIndividuals injected with COVID-19 vaccines might also have difficulty developing normal, broad immunity, even after multiple encounters with SARS-COV-2. As predicted by the original antigenic sin effect, their immune reaction to the virus will be directed against its spike. They might remain in jeopardy even after overcoming moderate COVID-19, and might get it multiple times per season, with or without ADE.\n\nThe detrimental vaccine effects described above apply to people naïve to SARS-COV-2. Individuals who acquired natural immunity by infection or exposure to SARS-COV-2, prior to vaccination, may do better. Of course, those individuals had already developed broad and robust immunity to SARS-COV-2 and did not need the vaccination.\n\nIt is considered impossible to distinguish ADE from ordinary severe COVID-19 (Arvin et al. 2020), especially because neutralizing and enhancing antibody activities compensate for each other (Wang and et al. 2016).\n\nA new COVID-19 wave, in the Northern Hemisphere, will likely start in the fall this year. This is when the antibody immunity of the first vaccinated persons will wane. Additionally, coronavirus season (cold and flu season) kicks in. The emergence of more dangerous SARS-COV-2 variants can bring the new wave even sooner.\n\nChildren 12-15 are expected to be impacted especially hard by the COVID-19 vaccines, due to higher reactivity of their immune systems. A Pfizer study has shown 1.76 higher antibody titers in this age group compared with 16–25 year-olds (FDA re-Amendment 2021) (Table 9). Some research suggests that the COVID-19 vaccines could possibly interfere with the development of immunity to common cold coronaviruses. This risk is totally unjustified. Very few persons <18 develop severe COVID-19, and 84% of them have obesity or other known chronic conditions (Preston et al. 2021).\n\nSuspected ADE from COVID-19 vaccines, especially spike protein-based ones, was explicitly linked to the Multisystem Inflammatory Syndrome in Children (MIS-C) (Rothan and Byrareddy 2021), (Ricke 2021), (Lawrensia et al. 2020).\n\nA recent study suggests interference of the COVID-19 vaccines with the immune reaction to common cold coronaviruses (Amanat et al. 2021). Some 12-year-olds, who have not developed natural immunity to all four common cold coronaviruses, might be unable to develop it because of the original antigenic sin with the anti-spike vaccine.\n\nConcerns about ADE/VAED potential of COVID-19 vaccines have been expressed by scientists prior to the emergency use authorization (Hellerstein 2020), (Garber 2020), (FDA re-Guidance 2020), in time of the vaccines review, and are included in the EUA documents in the US and EU. The EMA (EU counterpart of the FDA) took note of serious concerns about decreasing neutralization by antibodies, leading to ADE/VAED in both Pfizer (EMA re-Pfizer 2021) and Moderna (EMA re-Moderna 2021) vaccines. The regulators acknowledged that they could not resolve those concerns. This was recognized as the top risk in the FDA’s EUA for an Unapproved Product (FDA re-Pfizer 2020) :\n\n“risk of vaccine-enhanced disease over time, potentially associated with waning immunity, remains unknown and needs to be evaluated further in ongoing clinical trials and in observational studies that could be conducted following authorization and/or licensure”\n\nThis language was repeated in the May 10, 2021, in expansion of this EUA for an Unapproved Product for the ages 12-15 (FDA re-Amendment 2021), without referencing any clinical trials or observational studies that could ameliorate this risk. As of June 4, 2021, no such trials or studies could be found in the literature.\n\nThe showing that ADE does not happen within two months from the vaccination is insufficient. Remarkably high antibody titer, elicited by the vaccine, neutralizes SARS-COV-2. But even then, reduced efficacy against new variants was observed. The real question is what happens when antibody immunity wanes (in 6-9 months) and the individual is exposed to SARS-COV-2.\n\nIt seems such studies were not performed, despite the EUA’s instructions to do so, or yielded results that the interested parties did not want to make public. There is a considerable political pressure to vaccinate as many people as possible, which makes it hard to report any adverse results about the COVID-19 vaccines.\n\nOn June 4, 2021, PubMed returned 0 results for the search (COVID + VAED) (query https://pubmed.ncbi.nlm.nih.gov/?term=COVID+VAED&sort=date). PubMed returned only five results for the search (“vaccine enhanced disease” + COVID), only one of which was relevant. It stated that “no evidence of vaccine-enhanced disease have been reported” without citing any clinical trials or observations (Lombardi et al. 2021). It also repeated talking points of the vaccine manufacturers, like efficacy in the first 100 days after vaccination. Searches for (COVID + vaccine + ADE) and (COVID + vaccine + “antibody dependent”) yielded many results, none of which were relevant to vaccinated individuals’ chances of developing ADE six months after vaccination.\n\nPfizer and Moderna conducted large scale vaccine trials in the summer 2020. They could or should have followed up with the vaccinated volunteers to see how they did in the January-February wave of COVID-19. They have incentives to show the world that their vaccines protect for more than six months and do not cause ADE. Such papers could not be found. In this case, no good news is bad news.\n\nThe issue of ADE/VAED was raised in multiple letters from scientists, such as Wodarg – Yeadon Petition to EMA (Wodarg and Yeadon 2020), without a satisfactory resolution.\n\nPfizer CEO Albert Bourla acknowledged the likely need for a third booster shot within 12 months (CNBC 2021), followed by annual booster shots (NBC News 2021) for the recipients of the Pfizer vaccine. It also sounds as acknowledgement of ADE/VAED. There is no evidence that such booster shots will work as intended, and there is not enough time to trial them.\n\nExplicit disclosure of the risk of ADE to COVID-19 vaccine recipients before obtaining informed consent (Cardozo and Veazey 2020) was recommended. Despite this recommendation, ADE risks are not disclosed in the FDA-approved vaccine Fact Sheets (FDA re Fact Sheet 2021). The absence of benefits for adolescents and the many existing treatment alternatives are also not disclosed.\n\nThere are other issues, such as damage with the spike protein, generated by the body in response to the vaccine (Alexander 2021), which are out of the scope of this paper.\n\nAll the above-described risks and potential long-term effects inform the public to stop vaccinating children and teenagers (<18) and to fully disclose all vaccine risks and existing alternatives to all recipients. The required disclosures should include the fact that the current COVID-19 vaccines target the original Wuhan coronavirus and that the currently circulating variants are much different and partially vaccine resistant.\n\nRecommended action is to treat symptomatic patients early (McCullough and et al. 2020) with antivirals (like Ivermectin + Hydroxychloroquine + Azithromycin/Doxycycline + Zinc) and treatment adjuvants (vitamin C, possibly melatonin etc.). Early antiviral treatment (McCullough 2021) will also slow down the evolution of the coronavirus. SARS-COV-2 is unlikely to develop resistance to a triple or quadruple cocktail.\n\nLive unattenuated virus vaccine (LUV) may be a better option (Chen 2021) against SARS-COV-2. An individually selected dose of the coronavirus might be administered intranasally, followed by antiviral treatment against COVID-19. It would contain a single variant, selected to be up to date and to have a low virulence. Of course, such treatment must be carefully designed and clinically tested.\n\nThe author declares no competing interest. No funding was provided for this work.\n\nThanks to AO for the contribution to this paper.\n\nAgrawal AS, Tao X, Algaissi A, Garron T, Narayanan K, Peng B-H, et al. Immunization with inactivated Middle East Respiratory Syndrome coronavirus vaccine leads to lung immunopathology on challenge with live virus. Human Vaccines & Immunotherapeutics. 2016 Sep 1; 12(9):2351–6. https://doi.org/10.1080/21645515.2016.1177688\n\nAmanat F, Thapa M, Lei T, Ahmed SMS, Adelsberg DC, Carreno JM, et al. The plasmablast response to SARS-CoV-2 mRNA vaccination is dominated by non-neutralizing antibodies and targets both the NTD and the RBD. medRxiv. 2021 May 1; 2021.03.07.21253098. https://www.medrxiv.org/content/10.1101/2021.03.07.21253098v2\n\nArvin AM, Fink K, Schmid MA, Cathcart A, Spreafico R, Havenar-Daughton C, et al. A perspective on potential antibody-dependent enhancement of SARS-CoV-2. Nature. 2020 Aug; 584(7821):353–63. https://www.nature.com/articles/s41586-020-2538-8\n\nCardozo T, Veazey R. Informed consent disclosure to vaccine trial subjects of risk of COVID-19 vaccines worsening clinical disease. International Journal of Clinical Practice. 2020; 75(3):e13795. https://onlinelibrary.wiley.com/doi/abs/10.1111/ijcp.13795\n\nChen J, Gao K, Wang R, Wei G-W. Prediction and mitigation of mutation threats to COVID-19 vaccines and antibody therapies. Chem Sci. 2021 May 26; 12(20):6929–48. https://pubs.rsc.org/en/content/articlelanding/2021/sc/d1sc01203g\n\nCNBC. Pfizer CEO says third Covid vaccine dose likely needed within 12 months. CNBC. 2021. https://www.cnbc.com/2021/04/15/pfizer-ceo-says-third-covid-vaccine-dose-likely-needed-within-12-months.html\n\nDi Caro A, Cunha F, Petrosillo N, Beeching NJ, Ergonul O, Petersen E, et al. Severe acute respiratory syndrome coronavirus 2 escape mutants and protective immunity from natural infections or immunizations. Clinical Microbiology and Infection. 2021 Jun 1; 27(6):823–6. https://www.sciencedirect.com/science/article/pii/S1198743X21001464\n\nDispinseri S, Secchi M, Pirillo MF, Tolazzi M, Borghi M, Brigatti C, et al. Neutralizing antibody responses to SARS-CoV-2 in symptomatic COVID-19 is persistent and critical for survival. Nat Commun. 2021 May 11; 12(1):2670. https://www.nature.com/articles/s41467-021-22958-8\n\nFDA re Fact Sheet. FACT SHEET FOR RECIPIENTS AND CAREGIVERS EMERGENCY USE AUTHORIZATION (EUA) OF THE PFIZER-BIONTECH COVID-19 VACCINE TO PREVENT CORONAVIRUS DISEASE 2019 (COVID-19) IN INDIVIDUALS 12 YEARS OF AGE AND OLDER. 2021. https://www.fda.gov/media/144414/download\n\nFDA re-Guidance. Development and Licensure of Vaccines to Prevent COVID-19; Guidance for Industry. https://www.fda.gov/media/139638/download\n\nFDA re-Pfizer. Emergency Use Authorization for an Unapproved Product Review Memorandum. 2020. https://www.fda.gov/media/144416/download\n\nFierz W, Walz B. Antibody Dependent Enhancement Due to Original Antigenic Sin and the Development of SARS. Front Immunol. 2020;11. https://www.frontiersin.org/articles/10.3389/fimmu.2020.01120/full\n\nGao W, Tamin A, Soloff A, D’Aiuto L, Nwanegbo E, Robbins PD, et al. Effects of a SARS-associated coronavirus vaccine in monkeys. The Lancet. 2003 Dec 6; 362(9399):1895–6. https://www.sciencedirect.com/science/article/pii/S0140673603149628\n\nGoldstein L. “Remdesivir for COVID-19” Study accidentally proved effectiveness of Hydroxychloroquine. Watts Up With That? 2020. https://wattsupwiththat.com/2020/10/26/remdesivir-for-covid-19-study-accidentally-proved-effectiveness-of-hydroxychloroquine/\n\nHellerstein M. What are the roles of antibodies versus a durable, high quality T-cell response in protective immunity against SARS-CoV-2? Vaccine: X. 2020 Dec 11; 6:100076. https://www.sciencedirect.com/science/article/pii/S2590136220300231\n\nLawrensia S, Henrina J, Wijaya E, Suciadi LP, Saboe A, Cool CJ. Pediatric Inflammatory Multisystem Syndrome Temporally Associated with SARS-CoV-2: a New Challenge amid the Pandemic. SN Compr Clin Med. 2020 Nov 1; 2(11):2077–85. https://doi.org/10.1007/s42399-020-00602-8\n\nLyons-Weiler J. Pathogenic priming likely contributes to serious and critical illness and mortality in COVID-19 via autoimmunity. Journal of Translational Autoimmunity. 2020 Jan 1; 3:100051. https://www.sciencedirect.com/science/article/pii/S2589909020300186\n\nMcCullough PA, et al. Multifaceted highly targeted sequential multidrug treatment of early ambulatory high-risk SARS-CoV-2 infection (COVID-19). Reviews in Cardiovascular Medicine. 2020 Dec 30; 21(4):517–30. https://rcm.imrpress.com/EN/abstract/abstract5065.shtml\n\nNBC News. A third Pfizer dose? The Covid-19 vaccine maker is studying booster shots. NBC News. 2021. https://www.nbcnews.com/health/health-news/third-pfizer-dose-covid-19-vaccine-maker-studying-booster-shots-n1258775\n\nRicke DO. Two Different Antibody-Dependent Enhancement (ADE) Risks for SARS-CoV-2 Antibodies. Front Immunol. 2021;12. https://www.frontiersin.org/articles/10.3389/fimmu.2021.640093/full\n\nRothan HA, Byrareddy SN. The potential threat of multisystem inflammatory syndrome in children during the COVID-19 pandemic. Pediatric Allergy and Immunology. 2021; 32(1):17–22. https://onlinelibrary.wiley.com/doi/abs/10.1111/pai.13361\n\nVatti A, Monsalve DM, Pacheco Y, Chang C, Anaya J-M, Gershwin ME. Original antigenic sin: A comprehensive review. Journal of Autoimmunity. 2017 Sep 1; 83:12–21. https://www.sciencedirect.com/science/article/pii/S0896841117302226\n\nWan Y, et al. Molecular Mechanism for Antibody-Dependent Enhancement of Coronavirus Entry. Journal of Virology. 2020. https://journals.asm.org/doi/abs/10.1128/JVI.02015-19\n\nWang Q, et al. Immunodominant SARS Coronavirus Epitopes in Humans Elicited both Enhancing and Neutralizing Effects on Infection in Non-human Primates | ACS Infectious Diseases. 2016. https://pubs.acs.org/doi/full/10.1021/acsinfecdis.6b00006\n\nWang R, Chen J, Gao K, Wei G-W. Vaccine-escape and fast-growing mutations in the United Kingdom, the United States, Singapore, Spain, India, and other COVID-19-devastated countries. Genomics. 2021 Jul 1; 113(4):2158–70. https://www.sciencedirect.com/science/article/pii/S0888754321001798\n\nWang S-F, Tseng S-P, Yen C-H, Yang J-Y, Tsao C-H, Shen C-W, et al. Antibody-dependent SARS coronavirus infection is mediated by antibodies against spike proteins. Biochemical and Biophysical Research Communications. 2014 Aug 22; 451(2):208–14. https://www.sciencedirect.com/science/article/pii/S0006291X14013321\n\nWeisblum Y, Schmidt F, Zhang F, DaSilva J, Poston D, Lorenzi JC, et al. Escape from neutralizing antibodies by SARS-CoV-2 spike protein variants. Marsh M, van der Meer JW, Montefiore D, editors. eLife. 2020 Oct 28; 9:e61312. https://doi.org/10.7554/eLife.61312", "opengraph": {"type": "article", "title": "Dangers of COVID-19 Vaccine Associated Enhanced Disease", "url": "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/", "description": "PDF Version with line numbers Excerpts from references for a review Preprint V.1.0.  June 8, 2021 Dangers of COVID-19 Vaccine Associated Enhanced Disease Leo Goldstein [1] COVID-19 vaccines, used i…", "article:published_time": "2021-06-08T20:39:22+00:00", "article:modified_time": "2021-06-08T20:39:22+00:00", "site_name": "Iowa Climate Science Education", "image": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://defyccc.com/data/vaed.pdf", "https://defyccc.com/data/c19-ade-excerpts.pdf", "https://defyccc.com/vaed/#_ftn1", "https://pubmed.ncbi.nlm.nih.gov/?term=COVID+VAED&sort=date", "https://doi.org/10.1080/21645515.2016.1177688", "https://www.medrxiv.org/content/10.1101/2021.03.07.21253098v2", "https://www.nature.com/articles/s41586-020-2538-8", "https://onlinelibrary.wiley.com/doi/abs/10.1111/ijcp.13795", "https://pubs.rsc.org/en/content/articlelanding/2021/sc/d1sc01203g", "https://www.cnbc.com/2021/04/15/pfizer-ceo-says-third-covid-vaccine-dose-likely-needed-within-12-months.html", "https://www.nature.com/articles/nri1732", "https://www.sciencedirect.com/science/article/pii/S1198743X21001464", "https://www.nature.com/articles/s41467-021-22958-8", "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1009453", "https://www.ema.europa.eu/en/documents/assessment-report/covid-19-vaccine-moderna-epar-public-assessment-report_en.pdf", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://www.ema.europa.eu/en/documents/assessment-report/covid-19-vaccine-moderna-epar-public-assessment-report_en.pdf", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://www.fda.gov/media/144414/download", "https://www.fda.gov/media/148542/download", "https://www.fda.gov/media/139638/download", "https://www.fda.gov/media/144416/download", "https://www.frontiersin.org/articles/10.3389/fimmu.2020.01120/full", "https://www.sciencedirect.com/science/article/pii/S0140673603149628", "https://www.nature.com/articles/d41587-020-00016-w", "https://wattsupwiththat.com/2020/10/26/remdesivir-for-covid-19-study-accidentally-proved-effectiveness-of-hydroxychloroquine/", "https://www.sciencedirect.com/science/article/pii/S2590136220300231", "https://doi.org/10.1007/s42399-020-00602-8", "https://www.nature.com/articles/s41564-020-00789-5", "https://www.sciencedirect.com/science/article/pii/S2589909020300186", "https://rcm.imrpress.com/EN/abstract/abstract5065.shtml", "https://dryburgh.com/peter-mccullough-covid19-home-treatment/", "https://www.nbcnews.com/health/health-news/third-pfizer-dose-covid-19-vaccine-maker-studying-booster-shots-n1258775", "https://www.frontiersin.org/articles/10.3389/fimmu.2021.640093/full", "https://onlinelibrary.wiley.com/doi/abs/10.1111/pai.13361", "https://www.sciencedirect.com/science/article/pii/S0896841117302226", "https://journals.asm.org/doi/abs/10.1128/JVI.02015-19", "https://pubs.acs.org/doi/full/10.1021/acsinfecdis.6b00006", "https://www.sciencedirect.com/science/article/pii/S0888754321001798", "https://www.sciencedirect.com/science/article/pii/S0006291X14013321", "https://doi.org/10.7554/eLife.61312", "https://dryburgh.com/knut-wittkowski-lockdowns-are-creating-a-new-virus/", "https://dryburgh.com/wp-content/uploads/2020/12/Wodarg_Yeadon_EMA_Petition_Pfizer_Trial_FINAL_01DEC2020_signed_with_Exhibits_geschwarzt.pdf", "https://defyccc.com/vaed/#_ftnref1", "https://defyccc.com", "https://ift.tt/3w4ODKV", "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/#print", "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/?share=facebook", "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/?share=twitter", "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/?share=reddit", "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Dangers%20of%20COVID-19%20Vaccine%20Associated%20Enhanced%20Disease&body=https%3A%2F%2Fiowaclimate.org%2F2021%2F06%2F08%2Fdangers-of-covid-19-vaccine-associated-enhanced-disease%2F&share=email", "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/?share=pinterest", "https://iowaclimate.org/2021/06/08/dangers-of-covid-19-vaccine-associated-enhanced-disease/?share=tumblr"], "authors": [], "publish_date": "2021-06-08T20:39:22+00:00"}