{"result_id": "175004", "URL": "https://iowaclimate.org/2021/12/01/covid-vaccines-heart-attacks-pharma-funding/", "timestamp": "2023-04-25 15:42:08 CEST+0200", "meta": {"description": "Are COVID-19 vaccines damaging hearts? Cardiologist says some researchers are keeping quiet for fear of jeopardizing their pharma funding. Last Friday, a cardiologist said something explosive on a UK television news show. But I bet you didn’t hear about it. At the start of the 3-minute video clip above, Aseem Malhotra discusses an abstract published…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/12/01/covid-vaccines-heart-attacks-pharma-funding/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "COVID Vaccines, Heart Attacks & Pharma Funding", "cleaned_text": "Are COVID-19 vaccines damaging hearts? Cardiologist says some researchers are keeping quiet for fear of jeopardizing their pharma funding.\n\n\n\nLast Friday, a cardiologist said something explosive on a UK television news show. But I bet you didn’t hear about it.\n\nAt the start of the 3-minute video clip above, Aseem Malhotra discusses an abstract published in early November in Circulation, the world’s premier cardiology journal. The abstract is connected to a poster presentation at the American Heart Association’s annual conference two weeks ago.\n\nSteven Gundry, a former heart surgeon, reported that he regularly monitors 566 people for heart attack risk via a blood test known as the PULS Cardiac Test. It assesses protein biomarkers linked to inflammation, blood clots, and heart cell demise, then produces a score predicting a patient’s likelihood of suffering a serious heart event during the next five years. The abstract explains:\n\nThe score has been measured every 3-6 months in our patient population for 8 years. Recently, with the advent of the mRNA COVID 19 vaccines (vac) by Moderna and Pfizer, dramatic changes in the PULS score became apparent in most patients…These changes resulted in an increase of the PULS score from 11%…to 25% 5yr [acute coronary syndrome] risk…We conclude that the mRNA vacs dramatically increase inflammation on the endothelium and T cell infiltration of cardiac muscle and may account for the observations of increased thrombosis, cardiomyopathy, and other vascular events following vaccination. [bold added]\n\nMalhotra explains that a doubling of heart attack risk over five years from 11% to 25% represents a “huge increase. If this is true,” he tells the news show, “then that’s very concerning, indeed. But in medicine, in good science, we never rely on one study. We need to replicate these findings.”\n\nThen he talks about a whistleblower:\n\nA few days ago, after this was published, somebody from a very prestigious British institution, a cardiology department researcher, a whistleblower if you like, contacted me to say that researchers in this department had found something similar within the coronary arteries, linked to the vaccine – inflammation from imaging studies around the coronary arteries – and they had a meeting and these researchers at the moment have decided they’re not going to publish their findings because they are concerned about losing research money from the drug industry. Now this person was very upset about it… [bold added]\n\nMalhotra says he hopes the researchers involved change their mind, since their first duty is to patients. Moreover, he says, governments around the world need to end vaccine mandates now. In his words: “If this signal is strong, and if it’s correct, then history will not be on their side and the public will not forgive them for it.”\n\nIn the event that the above video disappears from YouTube, it may be seen on Odyssey here. It’s worth noticing that the banner along the bottom, added by GBNews, is hyperbolic and premature. A population-wide increase in heart attacks post-COVID vaccines has not yet been established. The research being discussed here has merely observed an increase in heart inflammation. This is a bad sign, but it doesn’t demonstrate “Increase in heart attack following mRna COVID vaccine.”\n\nIn the 24-minute video below, John Campbell assesses the pros and the cons of the abstract published in Circulation. The concerns it raises are sufficiently serious, he says, that both the Centers for Disease Control and the UK’s vaccine evaluation machinery should investigate and publicly respond.\n\nIn his words: “that increase – from 11% to 25% – is, of course, totally massive. Absolutely massive. If this were to be applicable to the entire population, this would basically mean we’re going to get an unimaginable amount of extra heart attacks.” (15:01 minutes)\n\nThis blog isn’t cluttered with intrusive ads –\n\n which means no income is earned in that manner.\n\n If what you’ve just read is useful or helpful,\n\n please consider making a donation", "opengraph": {"type": "article", "title": "COVID Vaccines, Heart Attacks & Pharma Funding", "url": "https://iowaclimate.org/2021/12/01/covid-vaccines-heart-attacks-pharma-funding/", "description": "Are COVID-19 vaccines damaging hearts? Cardiologist says some researchers are keeping quiet for fear of jeopardizing their pharma funding. Last Friday, a cardiologist said something explosive on a …", "article:published_time": "2021-12-01T12:33:29+00:00", "article:modified_time": "2021-12-01T12:33:29+00:00", "site_name": "Iowa Climate Science Education", "image": "http://img.youtube.com/vi/9nj8gGhlR2s/0.jpg", "image:secure_url": "https://img.youtube.com/vi/9nj8gGhlR2s/0.jpg", "image:alt": "please support this blog", "locale": "en_US", "video:type": "text/html", "video": "http://www.youtube.com/embed/9nj8gGhlR2s", "video:secure_url": "https://www.youtube.com/embed/9nj8gGhlR2s", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "845", "height": "476", "embed_code": "<iframe class=\"youtube-player\" width=\"845\" height=\"476\" src=\"https://www.youtube.com/embed/9nj8gGhlR2s?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/9nj8gGhlR2s?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "845", "height": "476", "embed_code": "<iframe class=\"youtube-player\" width=\"845\" height=\"476\" src=\"https://www.youtube.com/embed/LEBGl8MVE-c?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/LEBGl8MVE-c?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en&autohide=2&wmode=transparent"}], "links": ["https://doctoraseem.com/biography/", "https://web.archive.org/web/20211129090651/https://www.ahajournals.org/doi/abs/10.1161/circ.144.suppl_1.10712", "https://web.archive.org/web/20211118162735/https://professional.heart.org/en/meetings/scientific-sessions/programming", "https://drgundry.com/about/", "https://web.archive.org/web/20211129090651/https://www.ahajournals.org/doi/abs/10.1161/circ.144.suppl_1.10712", "https://pulstest.com/physicians", "https://odysee.com/@HacKerSonS:2/Heart-Attack-Data-Withheld:b", "https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&hosted_button_id=FCFERJBSSPE6Y"], "authors": [], "publish_date": "2021-12-01T12:33:29+00:00"}