{"result_id": "175036", "URL": "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/", "timestamp": "2023-04-25 15:42:28 CEST+0200", "meta": {"description": "A earlier post suspected that the extreme push for 100% vaccination is motivated by a need to deprive analysts of enough unvaccinated persons to serve as a control population for comparison.  We can see that import in a UK report assessing the efficacy of being vaccinated or not.  Andy Zhao writes at American Thinker The…", "lang": "en", "keywords": "", "favicon": "https://iowaclimate.files.wordpress.com/2017/07/cropped-icse-logo-2-e1484690439888.jpg?w=32", "canonical": "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/", "encoding": "UTF-8"}, "image": null, "domain": "iowaclimate.org", "title": "Covid19–You’re Safer than You Think, Part 2", "cleaned_text": "A earlier post suspected that the extreme push for 100% vaccination is motivated by a need to deprive analysts of enough unvaccinated persons to serve as a control population for comparison. We can see that import in a UK report assessing the efficacy of being vaccinated or not. Andy Zhao writes at American Thinker The real efficacy rates of the COVID vaccines. Excerpts in italics with my bolds.\n\nThe Biden administration and the mainstream media have been pushing a mandate of the experimental COVID vaccines for the American people. Their talking point is that “COVID vaccines are effective and work against the pandemic.” That’s not true. I have been following the “U.K. vaccine surveillance report” since last September and have seen enough evidence about the real efficacy of the COVID vaccines to show that they’re not as good as advertised.\n\nOn the surface, it appears that using that unadjusted rate per 100,000 people seems fair because it compares vaccinated and unvaccinated from the same base number. But that’s a deception. Each individual, either vaccinated or unvaccinated, are in different health conditions and live in different environments. An individual may not be infected with COVID in one area, but he could be in the other. That’s why “real efficacy rate” should be used, especially for the comparisons of hospitalizations and deaths. The real efficacy rate is calculated based on the number of actual infected people, both vaccinated and unvaccinated. This can measure how many people would be preserved from hospitalization or even death after they were infected by the virus if they had been vaccinated.\n\nNext, let’s take a look at the summary I created based on the U.K. vaccine surveillance report series. I added two highlighted columns to show what the real efficacy rate of the COVID vaccines are, along with the rates for the unvaccinated. Actually, they look great at first glance!\n\nThe real efficacy rate for hospitalization by vaccination status is calculated by the hospital admission number divided by the infection case number. For the Week 51 report, that’s 1 – (4,027/268,654) = 0.98501, or 98.501%. That means that the COVID vaccines prevented more than 98 people being hospitalized out of 100 who were infected. The same can be said for the death rate, where only 1 person dies out of 100 people who were infected.\n\nFrom the chart, we can also see that the unvaccinated were doing better, 99.152% and 99.796%, respectively, for Week 51, when omicron started to be dominant in the U.K. The same is true for Week 47 and Week 45, when the delta variant was dominant.\n\nBut I and most people are more concerned about the real effectiveness of those COVID vaccines in combatting the COVID pandemic, not artificial rates created for propaganda. By the way, many research reports have pointed out that the efficacy rate of the COVID vaccines is quickly reduced after being administered, even dropping to negative numbers in three months after getting the third shot!\n\nAdd to that this report from Bloomberg (H/T Tyler Durden) T Cells Come to the Rescue as Studies Show They Buck Omicron. Excerpts in italics with my bolds\n\nUnlike antibodies, the cells hold up against variant in tests \n\n Findings may explain disconnect between case load and severity\n\nThe Dutch researchers looked at 60 vaccinated health-care workers and found that while their antibody responses to omicron were lower or nonexistent compared with the beta and delta variants, T cell responses were largely unaltered, “potentially balancing the lack of neutralizing antibodies in preventing or limiting severe Covid-19.”\n\nT cells are white blood cells that can remember past diseases, kill virus-infected cells and rouse antibodies to marshal defenses. People infected with another coronavirus that was responsible for the SARS outbreak in 2003, for example, were found to still have a T-cell response to the disease 17 years later.\n\nThe study from the University of Cape Town’s Institute of Infectious Disease and Molecular Medicine looked at patients who had recovered from Covid or been vaccinated with shots from Pfizer Inc. and partner BioNTech SE or Johnson & Johnson. They found that 70% to 80% of the T cell responses they assessed held up against omicron.\n\nRecent weeks have brought evidence that the new strain can erode vaccine protection, prompting governments to push for booster shots to raise the level of antibodies that can fight off the variant.\n\nBut immune protection has several layers. While antibodies block infection, T cells kill infected cells, preventing the virus from spreading and causing worse disease, Wendy Burgens, one of the University of Cape Town study authors, wrote on her Twitter account Virus Monologues. “They can’t prevent you from getting infected, but they can minimize the damage that comes afterwards,” she said.\n\nCovid19–You’re Safer than You Think, Part 1\n\nThe political and media messaging about the coronavirus prevents the citizenry from connecting the dots and realizing how fear is exaggerated in order to impose social controls. Let’s put the pieces together.\n\n1. Natural Immunity is as Good or Better Than Vaccine Immunity\n\nMichael Nadler explains at American Thinker Director of the National Institutes of Health grossly misstates the science on vaccination vs. natural immunity. Excerpts in italics with my bolds.\n\nOn the August 12, 2021 Special Report, Bret Baier asked NIH director Francis Collins: “Can you definitely say to somebody that the vaccine provides better protection than the antibodies you get from actually having had COVID-19?”\n\nDr. Collins replied to Bret and the almost 2 million viewers of Special Report:\n\n“Yes, Bret, I can say that. There was a study published by CDC just ten days ago in Kentucky, and they looked specifically at people who had had natural infection and people who had been vaccinated and then ended up getting infection again. So what was the protection level? It was more than two-fold better for the people who had had the vaccine in terms of protection than people who had had natural infection. That’s very clear in that Kentucky study. You know that surprises people. Kind of surprised me that the vaccine would actually be better than natural infection. But if you think about it, it kinda makes sense[.] … That’s a settled issue.”\n\nI was one of those who did find this quite surprising, given my familiarity with studies such as this one from the Cleveland Clinic and my basic understanding of how immunity is conferred by mRNA vaccines versus the natural immunity arising from prior infection.\n\nHowever, based on the unequivocal statement on national TV by Dr. Collins, a highly respected scientist leading one of our nation’s pre-eminent public health agencies, that the issue is settled, I adjusted my thinking about vaccine immunity versus natural immunity from prior infection.\n\nFast-forward to the following night’s Special Report to watch and listen to Admiral Brett Giroir, former assistant secretary for health during the Trump administration while concurrently serving in several other public health positions. Dr. Giroir responded to a question about the confusion that arose from Dr. Collins’s conversation on Special Report the night before. He pointed out that Dr. Collins’s statement the previous night about the superiority of vaccine immunity over natural immunity and his citation of the Kentucky/CDC study as evidence were “factually incorrect.”\n\nIt is worth watching the whole conversation, but key points made by Dr. Giroir include the following:\n\nIt has not been shown that natural immunity, the immunity you have after infection, is any inferior to the immunity you have after vaccination. And, in fact, there is growing evidence that natural immunity lasts a long time and is highly protective against infection and hospitalization[.] … The study that Dr. Collins quoted did not have anything to do with people who had been vaccinated or who had natural immunity. What it proved [is] that if you were previously infected, your chance of getting COVID in the middle of Delta in Kentucky was about 1 in a thousand to get COVID again. If you got vaccinated that dropped it to 1 in 2500 so that’s a reduction but still your risks were very, very low[.] … This does not deal with people who were naturally immune vs. vaccinated. That’s a whole different question and it begs the question about whether you have antibodies, is that as good as being vaccinated? And the data right now pretty much say it is.\n\nTo clarify, the CDC published a report on a Kentucky study of people who had previously been infected with COVID-19. The study addressed the question of whether being vaccinated after already being infected provides additional protection; and the findings suggest that vaccination does provide additional protection when added to immunity provided by previous natural infection. But Dr. Collins relied on this study to make a definitive statement in response to an entirely different question: whether vaccination of people who were not previously infected provides better protection than does immunity obtained from previous infection. This study sheds absolutely no light on that question.\n\nGiven the factually incorrect statements made by the head of the NIH on national TV, we are left to wonder how much we can trust about what our highest-level public health officials tell us. And when they do mislead us, is it intentional, is it carelessness in communications, or is it because they are mistaken in their understanding of the science? In the case of Dr. Collins’s statement on Special Report, all but the most cynical have to conclude it is the third.\n\nThis then raises the question as to how such an eminent scientist can get it so wrong. This is a much tougher question to answer without discussing the issue directly with Dr. Collins. I would speculate that we have a case of confirmation bias, the tendency to interpret new evidence as confirmation of one’s existing beliefs or theories. What might the source of this bias be?\n\nThe Biden administration has made vaccination numbers a key measure of its progress in leading the fight against COVID-19, as it should. However, in order to keep the public focused on vaccination as a universal necessity, and in its apparent approval of vaccine mandates, the public health bureaucracy has been quite conspicuous in minimizing any mention of the role, effectiveness, and extent of natural immunity arising from previous infection.\n\nAccording to a number of outside experts such as Marty Makary, “[r]equiring the vaccine in people who are already immune with natural immunity has no scientific support.” So as part of the public health bureaucracy which is invested in President Biden’s objective of universal vaccination, Dr. Collins might easily have misread the Kentucky/CDC study as strong evidence that natural immunity is not nearly as effective as vaccination.\n\nIn this regard, I don’t hold the CDC blameless. For example, I’m not sure if the CDC has even acknowledged studies like the one at the Cleveland Clinic showing strong protection due to natural immunity arising from previous infection. And particularly after Dr. Collins’s misreading, it would behoove the CDC to add a statement in the Summary or Discussion sections of its report on the Kentucky study making it clear that it does not address the question of the relative effectiveness of vaccination vs. natural immunity.\n\n2. One of Three Americans Have Natural Immunity\n\nColumbia Public Health published this report One in Three Americans Already Had COVID-19 by the End of 2020. Excerpts in italics with my bolds.\n\nUndocumented Infections Accounted for Estimated Three-Quarters of Infection Last Year\n\nA new study published in the journal Nature estimates that 103 million Americans, or 31 percent of the U.S. population, had been infected with SARS-CoV-2 by the end of 2020. Columbia University Mailman School of Public Health researchers modeled the spread of the coronavirus, finding that fewer than one-quarter of infections (22%) were accounted for in cases confirmed through public health reports based on testing.\n\nThe study is the first to comprehensively quantify the overall burden and characteristics of COVID-19 in the U.S. during 2020. The researchers simulated the transmission of SARS-CoV-2 within and between all 3,142 U.S. counties using population, mobility, and confirmed case data.\n\nThe portion of confirmed cases reflected in the study’s estimates, i.e. the ascertainment rate, rose from 11 percent in March to 25 percent in December, reflecting improved testing capacity, a relaxation of initial restrictions on test usage, and increasing recognition, concern, and care-seeking among the public. However, the ascertainment rate remained well below 100 percent, as individuals with mild or asymptomatic infections, who could still spread the virus, were less likely to be tested.\n\n“The vast majority of infections were not accounted for by the number of confirmed cases,” says Jeffrey Shaman, PhD, professor of environmental health sciences at Columbia University Mailman School of Public Health. “It is these undocumented cases, which are often mild or asymptomatic infections, that allow the virus to spread quickly through the broader population.”\n\nA person infected but without enough viral load to be sick is not likely to be contagious. The exception is the first few days for someone who goes on to be severely ill afterward. All of these people (infected but not “cases”) had immune systems that stopped the virus from replicating in their bodies. Ironically, had they been subjected to PCR tests, they would have shown as positives, and then mislabeled as “cases” despite their wellness.\n\nBecause of the political drive to vaccinate everyone, the powers-that-be deny that nearly a third of the population is already blessed with immunity without being vaccinated. And this goes without considering the evidence that youngsters’ immune systems are superior to adults when it comes to coronaviruses (SARS-CV2 being the fifth one in circulation). Superior here means preventing illness severe enough to be life-threatening, or to require hospital or extended care. Neither vaccines nor natural immunities prevent infections, only limit the effects to runny noses and/or coughs.\n\nFor a discussion of natural immunity mechanisms see SARS Cross-Immunity from T-cells\n\nEvidence is building that immunity after infection is superior to vaccine-induced immunity. This Israeli study is a recent example: Comparing SARS-CoV-2 natural immunity to vaccine-induced immunity: reinfections versus breakthrough infections. Excerpts below with my bolds.\n\nBackground Reports of waning vaccine-induced immunity against COVID-19 have begun to surface. With that, the comparable long-term protection conferred by previous infection with SARS-CoV-2 remains unclear.\n\nMethods We conducted a retrospective observational study comparing three groups: (1)SARS-CoV-2-naïve individuals who received a two-dose regimen of the BioNTech/Pfizer mRNA BNT162b2 vaccine, (2) previously infected individuals who have not been vaccinated, and (3) previously infected and single dose vaccinated individuals. Three multivariate logistic regression models were applied. In all models we evaluated four outcomes: SARS-CoV-2 infection, symptomatic disease, COVID-19-related hospitalization and death. The follow-up period of June 1 to August 14, 2021, when the Delta variant was dominant in Israel.\n\nResults SARS-CoV-2-naïve vaccinees had a 13.06-fold (95% CI, 8.08 to 21.11) increased risk for breakthrough infection with the Delta variant compared to those previously infected, when the first event (infection or vaccination) occurred during January and February of 2021. The increased risk was significant (P<0.001) for symptomatic disease as well. When allowing the infection to occur at any time before vaccination (from March 2020 to February 2021), evidence of waning natural immunity was demonstrated, though SARS-CoV-2 naïve vaccinees had a 5.96-fold (95% CI, 4.85 to 7.33) increased risk for breakthrough infection and a 7.13-fold (95% CI, 5.51 to 9.21) increased risk for symptomatic disease. SARS-CoV-2-naïve vaccinees were also at a greater risk for COVID-19-related-hospitalizations compared to those that were previously infected.\n\nConclusions This study demonstrated that natural immunity confers longer lasting and stronger protection against infection, symptomatic disease and hospitalization caused by the Delta variant of SARS-CoV-2, compared to the BNT162b2 two-dose vaccine-induced immunity. Individuals who were both previously infected with SARS-CoV-2 and given a single dose of the vaccine gained additional protection against the Delta variant.\n\n“In Israel, vaccinated individuals had 27 times higher risk of symptomatic COVID infection compared to those with natural immunity from prior COVID disease [95%CI:13-57, adjusted for time of vaccine/disease]. No COVID deaths in either group.”\n\nJon Miltimore draws the implications: Harvard Epidemiologist Says the Case for COVID Vaccine Passports Was Just Demolished. Excerpts in italics with my bolds.\n\nThe findings come as many governments around the world are demanding citizens acquire “vaccine passports” to travel. New York City, France, and the Canadian provinces of Quebec and British Columbia are among those who have recently embraced vaccine passports.\n\nMeanwhile, Australia has floated the idea of making higher vaccination rates a condition of lifting its lockdown in jurisdictions, while President Joe Biden is considering making interstate travel unlawful for people who have not been vaccinated for COVID-19.\n\nVaccine passports are morally dubious for many reasons, not the least of which is that freedom of movement is a basic human right. However, vaccine passports become even more senseless in light of the new findings out of Israel and revelations from the CDC, some say.\n\nHarvard Medical School professor Martin Kulldorff said research showing that natural immunity offers exponentially more protection than vaccines means vaccine passports are both unscientific and discriminatory, since they disproportionately affect working class individuals.\n\n“Prior COVID disease (many working class) provides better immunity than vaccines (many professionals), so vaccine mandates are not only scientific nonsense, they are also discriminatory and unethical,” Kulldorff, a biostatistician and epidemiologist, observed on Twitter.\n\nNor is the study out of Israel a one-off. Media reports show that no fewer than 15 academic studies have found that natural immunity offers immense protection from COVID-19.\n\nVaccine passports would be immoral and a massive government overreach even in the absence of these findings. There is simply no historical parallel for governments attempting to restrict the movements of healthy people over a respiratory virus in this manner.\n\nYet the justification for vaccine passports becomes not just wrong but absurd in light of these new revelations.\n\nPeople who have had COVID already have significantly more protection from the virus than people who’ve been vaccinated. Meanwhile, people who’ve not had COVID and choose to not get vaccinated may or may not be making an unwise decision. But if they are, they are principally putting only themselves at risk.", "opengraph": {"type": "article", "title": "Covid19–You’re Safer than You Think, Part 2", "url": "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/", "description": "A earlier post suspected that the extreme push for 100% vaccination is motivated by a need to deprive analysts of enough unvaccinated persons to serve as a control population for comparison.  We ca…", "article:published_time": "2021-12-30T21:33:38+00:00", "article:modified_time": "2021-12-30T21:33:38+00:00", "site_name": "Iowa Climate Science Education", "image": "https://archive.is/kD5bm/316ea6bd94788dac24824bf4b501d014e8bb677d.jpg", "image:width": "1260", "image:height": "940", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.americanthinker.com/blog/2021/12/the_real_efficacy_rates_of_the_covid_vaccines.html", "https://www.bloomberg.com/news/articles/2021-12-30/t-cells-come-to-the-rescue-as-studies-show-they-fight-omicron?srnd=premium&sref=i4qXzk6d", "https://www.americanthinker.com/blog/2021/08/director_of_the_national_institutes_of_health_grossly_misstates_the_science_on_vaccination_vs_natural_immunity.html", "https://www.medrxiv.org/content/10.1101/2021.06.01.21258176v3", "https://www.yahoo.com/entertainment/admiral-brett-giroir-explains-natural-012523053.html", "https://rclutz.com/2020/07/29/sars-cross-immunity-from-t-cells/", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://fee.org/articles/harvard-epidemiologist-says-the-case-for-covid-vaccine-passports-was-just-demolished/?__cf_chl_jschl_tk__=pmd_TBKsWo0aGHLdgjXbY_u8O8tJg.PX3NDoryrZ2MBi6bI-1630516240-0-gqNtZGzNAtCjcnBszQg9", "https://ift.tt/3Jxf5En", "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/#print", "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/?share=facebook", "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/?share=twitter", "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/?share=reddit", "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Covid19%E2%80%93You%E2%80%99re%20Safer%20than%20You%20Think%2C%20Part%202&body=https%3A%2F%2Fiowaclimate.org%2F2021%2F12%2F30%2Fcovid19-youre-safer-than-you-think-part-2%2F&share=email", "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/?share=pinterest", "https://iowaclimate.org/2021/12/30/covid19-youre-safer-than-you-think-part-2/?share=tumblr"], "authors": [], "publish_date": "2021-12-30T21:33:38+00:00"}