{"result_id": "176021", "URL": "https://theirishsentinel.com/2021/03/05/uk-35-people-deaf-and-25-blind-after-taking-mrna-vaccine-shots/", "timestamp": "2023-04-25 15:42:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/03/05/uk-35-people-deaf-and-25-blind-after-taking-mrna-vaccine-shots/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "UK: 35 people deaf and 25 blind after taking mRNA vaccine shots | The Irish Sentinel", "cleaned_text": "The Yellow Card scheme tracking potential vaccine injuries has flagged a combined 191,832 individual adverse events, or side effects, related to COVID vaccines.\n\nAmong people in the U.K., 35 cases of deafness and 25 cases of blindness have been reported by people who have taken the experimental mRNA COVID-19 vaccines. The numbers are derived from the U.K. Yellow Card vaccine reporting scheme, which is the British equivalent to the American Centers for Disease Control and Prevention’s (CDC) Vaccine Adverse Event Reporting System (VAERS).\n\nBoth the Pfizer/BioNTech and Oxford/AstraZeneca mRNA COVID vaccines were given temporary authorization in the U.K. by the Medicines and Healthcare products Regulatory Agency (MHRA), the former in mid-December 2020, and the latter at the beginning of January 2021. Since then, the Yellow Card scheme has flagged a combined 191,832 individual adverse events, or side effects, of varying degrees of injury. Of the injuries recorded, AstraZeneca’s vaccine consistently performed the worst, accounting for 60% of all adverse events, and 58% of deaf and blind reports. Additionally, of the 402 fatalities, 197 were reported following use of the Pfizer formula, and 205 after taking AstraZeneca’s vaccine.\n\nThe latest data, which runs up to February 19 and was published on February 22, reveals a plethora of debilitating side-effects, but this has not alarmed officials at the MHRA who maintain that “no other new safety concerns have been identified from reports received to date.” They conclude from this that the “overall safety experience with both vaccines is so far as expected from the clinical trials.”\n\nThe regulator doubled down on supporting the jabs, stating that the “expected benefits of the vaccines in preventing COVID-19 and serious complications associated with COVID-19 far outweigh any currently known side effects,” including deafness, blindness, and death.\n\nThe MHRA justified this position by citing the passively analytical nature of recordings on the Yellow Card scheme: It is a self-reporting system. This means that none of the serious injuries, or even the deaths, are confirmed by a licensed doctor, giving the MHRA some leeway to declare that “the available evidence does not currently suggest that the vaccine caused the event.” Rather, the MHRA favors use of the term “temporally-related” to describe the succession of adverse events from injection with the vaccine, which they describe as “events occurring following vaccination but may or may not be caused by the vaccine.”\n\nJohn Stone of Children’s Health Defense noted that, despite the passive reporting system used by the MHRA, “[n]evertheless, the very distinct event profiles of two products [COVID-19 vaccines] filtered through the same system after 15 million vaccine administrations [in the U.K.] would suggest that there is something to be investigated and explained.”\n\nA pattern of adverse results has been established regarding use of the Pfizer vaccine, which can be seen by examining its use in the U.S., following the award of “Emergency Use Authorization” by the Food and Drug Administration (FDA) in December. In both the U.K. and the U.S., use of the Pfizer vaccine has brought about similar results, accounting for the majority of post-vaccination injuries in America. VAERS has recorded 19,907 cases of adverse events arising after taking a COVID-19 vaccine, 64% of which are linked to Pfizer’s mRNA vaccine, and 36% attributable to Moderna’s equivalent jab.\n\nIn the U.S., VAERS reported 23 cases of complete deafness and 27 of unilateral deafness, with Pfizer’s jab making up 76% of complaints. Additionally there have been 29 cases of partial or complete blindness, over half of which followed the Pfizer vaccine.\n\nExperimental mRNA vaccination programs in Israel, too, are returning grim results, with a new analysis of vaccine-related deaths demonstrating a dramatic rise in both young and elderly people dying after taking the Pfizer COVID-19 vaccine over those who have died after encountering the pathogen naturally.\n\nUpon investigating the Israeli Health Ministry’s own data on the nation’s vaccine rollout, Dr. Hervé Seligmann, a member of the faculty of Medicine at Aix-Marseille University, and engineer Haim Yativ revealed that Pfizer’s mRNA experimental vaccine killed “about 40 times more [elderly] people than the disease itself would have killed” during a recent five-week vaccination period.\n\nAmong the younger class, the researchers discovered that these numbers are compounded to death rates at 260 times what the COVID-19 virus would have claimed in the given time frame.", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/frontline-doctors-experimental-vaccines-not-safer-than-covid-19", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://www.lifesitenews.com/news/uk-data-show-402-reports-of-deaths-following-covid-vaccines", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/964207/COVID-19_mRNA_Pfizer-_BioNTech_Vaccine_Analysis_Print__1_.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/964208/COVID-19_AstraZeneca_Vaccine_Analysis_Print__2_.pdf", "https://www.lifesitenews.com/news/uk-data-show-402-reports-of-deaths-following-covid-vaccines", "https://medalerts.org/vaersdb/findfield.php", "https://medalerts.org/vaersdb/findfield.php", "https://medalerts.org/vaersdb/findfield.php", "https://www.lifesitenews.com/news/experimental-vaccine-death-rate-for-israels-elderly-40-times-higher-than-covid-19-deaths-researchers", "https://www.lifesitenews.com/news/uk-35-people-deaf-and-25-blind-after-taking-mrna-vaccine-shots"], "authors": [], "publish_date": null}