{"result_id": "176032", "URL": "https://theirishsentinel.com/2022/06/22/video-reiner-fuellmich-and-50-lawyers-different-batches-and-lethal-doses-the-vaccines-are-designed-to-kill/", "timestamp": "2023-04-25 15:43:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2022/06/22/video-reiner-fuellmich-and-50-lawyers-different-batches-and-lethal-doses-the-vaccines-are-designed-to-kill/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Video: Reiner Füellmich and 50 Lawyers: “Different Batches” and “Lethal Doses”, ”The Vaccines Are Designed to Kill” | The Irish Sentinel", "cleaned_text": "After hearing the witness statements to the German Corona Investigative Committee by former vice president of Pfizer Dr Mike Yeadon who has been a scientist for 36 years, lawyers with Reiner Füllmich draw the same conclusion: The injections normally called Corona vaccines are designed to experiment on the human race and to find out what dosage of a yet unknown toxin is needed in order to kill people.\n\nThe mortality rate linked to the vaccines, according to Yeadon, is traceable in terms of lot numbers of the different batches, as some batches appear to be more lethal than others. When taking a look at the evidence available, the main goal with the injections all over the world is global depopulation, according to the lawyers involved. Dr Füllmich told Perspektiv that the lawyers preparing an international law suit were no longer in doubt: Poisoning and mass murder through so called Corona vaccines is intentionally being perpetrated on the peoples of the world.\n\nCitizen Journalist Ulf Bittner from EU/EES Healthcare blog and Sverige Granskas stated in the interview that the situation with traceable lot numbers and injuries and death related to lot numbers is similar in the different health care regions of Sweden. Bittner is in contact with a vaccine coordinator who has provided documents to keep track of how many people have been injured and lost their lives related to the different batches of the so-called vaccines.\n\n01:00 Different numbers on the barcodes on the bottom of the vaccine doses are placebo which has been given to politicians according to a Slovenian chief nurse. Is it the same in other countries?\n\n1:54 Mike Yeadon and the LOT numbers of some shots of the brands Moderna, Johnson& Johnson and Pfizer/Biontech are related to much higher mortality than for the other manufacturers.\n\n3:52 The producers of the so-called vaccines are experimenting with the correct dosages to kill people according to Dr Füllmich. This according to the Corona Investigative Committee, constitute compelling evidence for punitive damages and attempted mass murder. They are intentionally killing people.\n\n08:30 Lawyers from India have filed complaints for premeditative murder.\n\n09:55 Mike Yeadon as a witness for the coming legal action against the perpetrators.\n\n10:44 Everyone who critizises the wrongdoings of the governments of the world is being called a ‘right wing extremist’. This has also happened to the internationally renowned scientist Mike Yeadon.\n\n13:05 CDC withdrew the recommendation for the PCR-tests diagnosing SARS-CoV-2 from 31/12-2021. PCR- tests are the foundation of the pandemic. Why is Anthony Fauci now doing a 180-degree turn?\n\n17:25 At least a million dollars per person will be claimed in punitive damages if the lawsuit is successful.\n\n18:33 Previously only ten percent of all adverse effects were reported. In the situation the world is right now, the team estimated that in fact only one percent of all adverse effects were being reported.\n\n19:25 CEO of Life insurance company from Indiana USA with 100 billions of dollars in assets said: ”Over the span of this past year there has been an excess mortality of 40 percent”. This is believed to be due to the injections.\n\n21:05 What substance in the vials makes them so lethal? Is it Graphene Oxide/graphene hydroxide?\n\n22:37 Any vaccine is a poison, it is the dosage which makes the difference. This is not a vaccine, as a vaccine provides immunity, while these products demand incessant injections. Either a vaccine works or it does not.\n\n24:40 This is not gene therapy either, since a gene therapy means exchanging a broken gene with a fixed one. This is more like experimenting on people, and trying to kill us.\n\n25.15 The doses are not tested by governments, while governments will be keeping the contracts hidden from the public for at least 55 years. How is this affecting the possibility of getting people punished? Dr Füllmich goes through all the lies paving the way for the tyrannical situation the world is now in.\n\n28:25 The vaccines are neither safe nor effective. The producers are experimenting on lethal doses of poison. Everyone now taking part in intentional malicious infliction of harm will be punished.\n\n30:05 How sure are legal experts about the conclusion that Mike Yeadon has drawn from this, that it is all about depopulation and intentionally killing people through injections? If close to 50 lawyers are of the same opinion, it is regarded as “irrefutable proof”.\n\n32:08 Batches of injections in Sweden can be traced by an application.\n\n32:45 Füllmich is in cooperation with people working within the secret service of Germany who do not wish to take the injections.\n\n34:15 Dr Lee Merritt on combat pilots in the USA refusing to get the shots. According to Dr Füllmich, Dr Merrit explained: ”They understood that if they were forced to [get vaccinated] they were going to get killed.”\n\n35:15 Information is being collected on batches in Sweden from every region, the Swedish health authorities (Folkhälsomyndigheten) and medical board (Läkemedelsverket). Every batch is traceable through an application. There is economic reward for the Swedish regions which manage to get more people injected. One of the expert lawyers involved in the upcoming court hearings is a specialist on Nuremberg Trials.\n\n38:45 How will the trials be performed, and through what legal structure? A common design, the same structure as for the Nuremberg trials.\n\n39:40 Free choice should reign for members of the European Union. Consumers of health care have consumer rights. Fraud means misleading the people and consumers of health care.\n\n42:00 The so called vaccines are an adulterated product put on to the market. According to Mike Yeadon there is a law in the US that will make everyone liable for the harms created by the adulterated product. Toxins are being put into the vials other than the known lipids etc, which the people who took the vaccines never consented to.\n\n43:40 The importance of decentralization of power and national independence rather than global organizations such as the European Union telling the people what to do. Disconnecting from the banking system, NGO:s and creating independent and strong agricultural supply chains, energy supply chains etc.\n\n46:15 When are the trials going to take place? How will the indictments happen and how will the trials be held? One of the goals is to inform people and expose the wrongdoings by involving the alternative media so that the mainstream media won’t be able to ignore the trials. The crew is working on a new system of law in the USA, Africa and Germany.\n\n50:48 Dr Füllmich believes the world is close to a tipping point and the whole narrative will fall apart very very soon, maybe in a couple of weeks or months.\n\n54:13 Robert Malone, Robert F Kennedy and Mike Yeadon and others involved in exposing the agenda are in contact with each other, and a tour is planned with these whistleblowers in the USA in March", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/video-reiner-fuellmich-50-lawyers-vaccines-designed-kill-depopulate-the-planet/5767034"], "authors": [], "publish_date": null}