{"result_id": "176006", "URL": "https://theirishsentinel.com/2022/10/22/roy-butler-inquest-delayed/", "timestamp": "2023-04-25 15:42:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2022/10/22/roy-butler-inquest-delayed/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Roy Butler inquest delayed | The Irish Sentinel", "cleaned_text": "The inquest into the death of a young footballer is on hold due to lack of engagement from a pharmaceutical company.\n\nRoy Butler (23) from Waterford died five days post Janssen vaccine. The Janssen vaccine is the ‘one shot’ Covid 19 vaccine manufactured by Johnson and Johnson.\n\nThe process of preparing an inquest into his death requires specific information from Janssen but this has not been forthcoming.\n\nRoy Butler felt unwell immediately after receiving the injection at a vaccination centre on August 12 2021.\n\nHe complained of headaches, fever, grogginess and pain in his jaw in the days following the procedure.\n\nHe was assured that these were ‘normal’ reactions to the shot and he tried to continue his regular activities despite not feeling well.\n\nOn Sunday August 15, Roy went to work a night shift at the contact lens manufacturing plant Bausch and Lomb. After he finished work, he drove home and slept before going to the gym but was unable to carry out any physical activities and returned home early.\n\nAt home, he complained of feeling extremes of hot and cold and went upstairs to his bedroom where his condition deteriorated rapidly.\n\nThe talented young footballer, who had plans to travel to Dubai, began to suffer seizures, vomiting and convulsions.\n\nParamedics arrived at the family home and Roy was transferred to Waterford General Hospital. He was placed in an induced coma and transferred to Cork University Hospital, where he was pronounced dead the following day, August 17 2021.\n\nHe had suffered a catastrophic bleed to the brain.\n\nA post mortem was conducted at CUH. The autopsy report, along with GP reports and the report requested from the pharmaceutical company, will form part of the information to be considered by the coroner before the inquest takes place.\n\nStaff at Cork City Coroner’s office have sought specific information from Janssen, relating to vaccine safety. The company has not been forthcoming with the information required and as such is causing a delay to the inquest proceedings. It is unlikely the inquest will be held, before Coroner Phillip Comyn, until 2023 at the earliest.\n\nA media officer at Janssen has been notified of the issue and invited to respond.\n\nThe Health Service Executive lists a number of side effects for the Janssen Covid 19 vaccine on its website.\n\nThe list includes ‘very unusual blood clots’ as a rare but possibly deadly side effect.\n\n‘Very rare side effects’ include ‘very unusual blood clots with low platelets’ and Guillain-Barré syndrome (GBS) that may affect up to 1 in 10,000 people, according to the HSE.\n\n‘Rare’ side effects of the Janssen injection affecting one in 1,000 people include ‘blood clots in the deep veins – such as deep vein thrombosis and pulmonary embolisms,’ according to the HSE.\n\n“Very rarely, one in 300,000 people may develop very unusual blood clots with low platelets. One in 10 of these people may die. This risk of this very rare condition is higher in young people,” the HSE states on its website.\n\nThe HSE warns that ‘uncommon side effects’ may affect up to 1 in 100 people.\n\nThese include feeling weak or generally unwell, back pain, dizziness, muscle weakness, pain in the limbs, pain in the throat, rash, sneezing, excessive sweating, a tremor, diarrhoea and an unusual feeling in the skin, such as tingling or a crawling feeling (paraesthesia).\n\n*Update: Within 24 hours of notification of this issue, Janssen issued a reply to me via email, which I am publishing in full here:\n\n“We confirm we have received a notification from the Coroner’s office seeking information. We will cooperate fully with the Coroner’s office and are currently working through the request. We will respond to the Coroner as soon as possible.” “There is no greater priority than the safety and well-being of the people we serve, and we carefully review reports of adverse events in individuals receiving our medicines or vaccines. Any report about an individual receiving our COVID-19 vaccine and our assessment of that report is shared with the European Medicines Agency (EMA), the U.S. Food and Drug Administration (FDA) and other appropriate health authorities. This is part of the established process to inform health authorities’ comprehensive surveillance programmes that monitor the overall safety of medicines, as well as the vaccines authorised for use against this pandemic.”", "opengraph": {}, "tags": ["Latest", "Irish News"], "tweets": [], "movies": [], "links": ["https://louiseroseingrave.substack.com/p/roy-butler-inquest-delayed?utm_medium=ios"], "authors": [], "publish_date": null}