{"result_id": "176030", "URL": "https://theirishsentinel.com/2021/10/12/video-catholic-nun-says-covid-19-vaccines-are-globalist-plot-for-population-control-pope-francis-their-spiritual-leader/", "timestamp": "2023-04-25 15:43:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/10/12/video-catholic-nun-says-covid-19-vaccines-are-globalist-plot-for-population-control-pope-francis-their-spiritual-leader/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "VIDEO: Catholic Nun Says COVID-19 Vaccines Are Globalist Plot For Population Control, Pope Francis Their ‘Spiritual Leader’ | The Irish Sentinel", "cleaned_text": "“And so I say to you beloved, that evil is coming upon us”\n\nA video surfaced online of a Benedictine Nun named Mother Miriam issuing a warning of what she describes as a globalist depopulation agenda involving COVID-19 vaccines, at one point referring to Pope Francis as the “spiritual leader” of globalist elites.\n\nA video going viral shows a nun named Mother Miriam discussing the COVID-19 vaccine as part of a depopulation agenda by globalist elites like Bill Gates and George Soros. In the video, she explains how the globalists are working to kill a large swath of the global population through mass vaccination in order to usher in a “one world order.”\n\nThe video clip came from her show, Mother Miriam Live, formerly Heart to Heart with Mother Miriam, a Catholic radio show and podcast affiliated with Life Site News and the Station of the Cross Catholic Radio Network.\n\n“The group of globalists – everyone involved in this new reset, global economy, one-world order – all of that, enforcing the jab, the COVID vaccine, which is a pathological weapon to destroy our body, that’s what it is. And if you haven’t felt it, if you’ve taken the COVID vaccine and you feel just fine, that is working in your body to destroy it,” said Mother Miriam.\n\n“What I’ve gathered from all the reports is that the George Soros’ of the world, Bill Gates, everybody involved in this reset, so to speak, and the Holy Father [Pope Francis] is their spiritual leader. I don’t hesitate to say it because I’m not revealing anything that hasn’t been all over the news, the Vatican, and every place else.” (READ MORE: Abortion Loving Nancy Pelosi, Paul Pelosi Sr. Visit Pope Francis At The Vatican)\n\nMother Miriamcontinued, saying that “they want to control the world population, completely have us under their control. The world population is too big, and so this COVID vaccine has been invented to eliminate us, to kill off a great percentage of the population so that what’s left, they have a reasonable hope[…]of killing and controlling the rest of us.”\n\n“I don’t think such a horror novel has ever been written, but it’s true, and I believe it one hundred percent, and I think our time is limited. Very limited now, for this reign of evil, of persecution, of death, to truly take hold of us because as we’ve heard from many, the forces of evil as announced by President Biden concerning his own thoughts, are growing impatient,” she explained.", "opengraph": {}, "tags": ["Latest", "Other News"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">1/2<br/>Nun gives a grave warning regarding the depopulation agenda, and calls out the Pope as the spiritual leader of the evil globalists behind it all. <a rel=\"nofollow\" href=\"https://t.co/Qtdrf5Onu8\">pic.twitter.com/Qtdrf5Onu8</a></p>— TJ (@TJ0056) <a rel=\"nofollow\" href=\"https://twitter.com/TJ0056/status/1447696979954446339?ref_src=twsrc%5Etfw\">October 11, 2021</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">1/2<br/>Nun gives a grave warning regarding the depopulation agenda, and calls out the Pope as the spiritual leader of the evil globalists behind it all. <a rel=\"nofollow\" href=\"https://t.co/Qtdrf5Onu8\">pic.twitter.com/Qtdrf5Onu8</a></p>— TJ (@TJ0056) <a rel=\"nofollow\" href=\"https://twitter.com/TJ0056/status/1447696979954446339?ref_src=twsrc%5Etfw\">October 11, 2021</a></blockquote> \n"], "movies": [], "links": ["https://www.masslive.com/news/2015/04/foundress_rosalind_moss_defender_of_religious_habit_speaker_at_cathedral_event.html", "https://www.facebook.com/mothermiriamlive/videos/865479024329102", "https://t.co/Qtdrf5Onu8", "https://twitter.com/TJ0056/status/1447696979954446339?ref_src=twsrc%5Etfw", "https://nationalfile.com/nancy-pelosi-paul-pelosi-sr-visit-pope-francis-at-the-vatican/", "https://t.co/Qtdrf5Onu8", "https://twitter.com/TJ0056/status/1447696979954446339?ref_src=twsrc%5Etfw", "https://nationalfile.com/video-catholic-nun-says-covid-19-vaccines-are-globalist-plot-for-population-control-pope-francis-their-spiritual-leader/"], "authors": [], "publish_date": null}