{"result_id": "176049", "URL": "https://theirishsentinel.com/2021/04/16/pfizer-ceo-says-third-covid-vaccine-dose-likely-needed-within-12-months/", "timestamp": "2023-04-25 15:43:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/04/16/pfizer-ceo-says-third-covid-vaccine-dose-likely-needed-within-12-months/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "PFIZER CEO SAYS THIRD COVID VACCINE DOSE LIKELY NEEDED WITHIN 12 MONTHS | The Irish Sentinel", "cleaned_text": "Mmm hmm. Tell me another one.\n\nNever forget: Justice Department Announces Largest Health Care Fraud Settlement in Its History:\n\nAmerican pharmaceutical giant Pfizer Inc. and its subsidiary Pharmacia & Upjohn Company Inc. (hereinafter together “Pfizer”) have agreed to pay $2.3 billion, the largest health care fraud settlement in the history of the Department of Justice, to resolve criminal and civil liability arising from the illegal promotion of certain pharmaceutical products, the Justice Department announced today.\n\nPfizer CEO Albert Bourla said people will “likely” need a booster dose of a Covid-19 vaccine within 12 months of getting fully vaccinated. His comments were made public Thursday but were taped April 1.\n\nBourla said it’s possible people will need to get vaccinated against the coronavirus annually.\n\n“A likely scenario is that there will be likely a need for a third dose, somewhere between six and 12 months and then from there, there will be an annual revaccination, but all of that needs to be confirmed. And again, the variants will play a key role,” he told CNBC’s Bertha Coombs during an event with CVS Health.\n\n“It is extremely important to suppress the pool of people that can be susceptible to the virus,” Bourla said.\n\nThe comment comes after Johnson & Johnson CEO Alex Gorsky told CNBC in February that people may need to get vaccinated against Covid-19 annually, just like seasonal flu shots.", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history", "https://www.cnbc.com/2021/04/15/pfizer-ceo-says-third-covid-vaccine-dose-likely-needed-within-12-months.html", "https://www.cryptogon.com/?p=61122"], "authors": [], "publish_date": null}