{"result_id": "176018", "URL": "https://theirishsentinel.com/2021/12/23/lancet-science-paper-destroys-false-narrative-of-covid-vaccines-reveals-vaccinated-are-perpetuating-the-pandemic/", "timestamp": "2023-04-25 15:42:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/12/23/lancet-science-paper-destroys-false-narrative-of-covid-vaccines-reveals-vaccinated-are-perpetuating-the-pandemic/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Lancet science paper DESTROYS false narrative of covid vaccines, reveals vaccinated are PERPETUATING the pandemic | The Irish Sentinel", "cleaned_text": "Since the beginning of the plandemic, the world was told that getting “vaccinated” with an Operation Warp Speed injection would “cure” the Wuhan coronavirus (Covid-19). Nearly two years have passed, however, and the exact opposite is proving to be true.\n\nA new letter from researcher Günter Kampf that was published in The Lancet blows some major holes in the mainstream injection narrative, one of the biggest being that Fauci Flu shots are not stopping the spread as claimed.\n\nIn fact, there appears to be greater spread of illness and death among those who took the shots in obedience to government guidelines compared to those who left their immune systems alone to fight disease naturally.\n\nAccording to Kampf, the epidemiological relevance of the fully vaccinated “is increasing,” based on the latest data. At best, the jabs are providing no protection whatsoever. At worst, they are making the people who take them more prone to a negative health outcome.\n\n“In the UK, it was described that secondary attack rates among household contacts exposed to fully vaccinated index cases was similar to household contacts exposed to unvaccinated index cases (25% for vaccinated vs 23% for unvaccinated),” Kampf writes.\n\n“[Twelve] of 31 infections in fully vaccinated household contacts (39%) arose from fully vaccinated epidemiologically linked index cases. Peak viral load did not differ by vaccination status or variant type.”\n\nIn Germany, he adds, the rate of symptomatic covid among the vaccinated is increasing. Back in July, it was around 16.9 percent among patients 60 years of age and older. As of October 27, that figure skyrocketed to 58.9 percent, “providing clear evidence of the increasing relevance of the fully vaccinated as a possible source of transmission.”\n\nCDC: Most highly vaccinated counties are also the most diseased counties\n\nA similar phenomenon is occurring in the United Kingdom as well. Symptomatic covid cases among the fully vaccinated are rising just as they are in Israel and elsewhere where Fauci Flu shots are being widely administered.\n\nThe U.S. Centers for Disease Control and Prevention (CDC) recently announced that four of the top five counties with the highest percentage of fully vaccinated population (84.3-99.9 percent) are “high” transmission counties.\n\nAll of this would suggest that getting jabbed likely means getting sick or spreading sickness to others. And yet the official story is that the fully vaccinated are not to even be counted as a potential source of transmission.\n\n“It appears to be grossly negligent to ignore the vaccinated population as a possible and relevant source of transmission when deciding about public health control measures,” Kampf says.\n\nTo continue calling the current situation a “pandemic of the unvaccinated” is simply false, Kampf warns. In reality, this is a pandemic of the vaccinated, as the plandemic would already be over had everyone chosen to remain unvaccinated.\n\n“I don’t bend over for bullies trying to ‘stigmatize’ me,” wrote a Natural News reader about this unfair mischaracterization of the unvaccinated. “And being stigmatized in a sick society is a badge of honor while being well adjusted is the opposite.”\n\n“The ‘vaccinated’ are the ones to avoid,” wrote another. “They are the sick. They are the disease spreaders. They have compromised immune systems. They have 251x the viral load in their nasal passages and throat. Stop cowering and go on the offense.”\n\nThis writer would further add that, yes, it is time for the unvaccinated to stand boldly and unashamed, and to equip themselves with this kind of knowledge in order to counter the constant falsehoods coming from the media and the government.", "opengraph": {}, "tags": ["Latest", "Featured"], "tweets": [], "movies": [], "links": ["https://vaccinewars.com/author/ethanh", "https://www.thelancet.com/journals/lanepe/article/PIIS2666-7762(21)00258-1/fulltext", "https://naturalnews.com/2021-12-18-lancet-letter-stigmatizing-unvaccinated-society-not-justified.html", "https://www.thelancet.com/journals/lanepe/article/PIIS2666-7762(21)00258-1/fulltext"], "authors": [], "publish_date": null}