{"result_id": "176008", "URL": "https://theirishsentinel.com/2021/04/12/video-darpa-is-working-on-covid-vaccine-implantable-microchip-to-detect-virus/", "timestamp": "2023-04-25 15:42:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/04/12/video-darpa-is-working-on-covid-vaccine-implantable-microchip-to-detect-virus/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "VIDEO: DARPA IS WORKING ON COVID VACCINE, IMPLANTABLE MICROCHIP TO DETECT VIRUS | The Irish Sentinel", "cleaned_text": "The Pentagon’s Defense Advanced Research Projects Agency (DARPA) is working on a COVID vaccine that will work on all variants and has developed an implantable microchip that it says will continuously monitor the human body for signs of the virus.\n\nRetired Colonel Matt Hepburn, an army infectious disease physician heading up DARPA’s response to the pandemic, appeared on 60 Minutes to demonstrate the technology.\n\nHolding up a vial of green tissue-like gel, which contains the chip, Hepburn proclaimed “You put it underneath your skin and what that tells you is that there are chemical reactions going on inside the body, and that signal means you are going to have symptoms tomorrow.”\n\n“It’s like a ‘check engine’ light,” Hepburn added, noting that those with the chip “would get the signal, then self-administer a blood draw and test themselves on site.”\n\n“We can have that information in three to five minutes,” Hepburn continued, adding “As you truncate that time, as you diagnose and treat, what you do is you stop the infection in its tracks.”\n\nHepburn also declared that DARPA has developed a filter to remove the virus from the blood via a dialysis machine, and that the FDA has approved it, and it has already been used on 300 patients.\n\nThe 60 Minitues report also highlights how the pentagon has hundreds of tissue samples from soldiers and sailors infected with pathogens all over the world, including the 1918 Spanish Flu which killed millions globally.\n\nPentagon scientist Dr Kayvon Modjarrad also highlighted that the military is developing a one size fits all vaccine for COVID, commenting “This is not science fiction, this is science fact.”\n\n“We have the tools, we have the technology, to do this all right now,” he said explaining that the goal is to inoculate people against potentially deadly viruses that have not even appeared yet.\n\n“Killer viruses that we haven’t seen or even imagined, we’ll be protected against,” Modjarrad declared.\n\nIt was recently revealed that a third of active duty service members opted out of taking the COVID vaccine, with sources claiming the actual figure is probably closer to half.\n\nThe finding prompted the likes of TIME to declare that ‘vaccine hesitancy’ is threatening national security, and that while “These troops may not be co-opted by domestic terrorists, but they are clearly influenced by conspiracy theorists online and they just don’t trust basic science.”\n\nThe DARPA announcement of implantable microchip technology tied to the virus and a vaccine will likely only serve to enforce concerns the media continually describes as ‘conspiracy theories.’", "opengraph": {}, "tags": ["Technetronic Era", "Latest", "Videos"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe title=\"A sensor that can tell you if you're sick\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/No5Bz2eHNtA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/No5Bz2eHNtA?feature=oembed"}], "links": ["https://www.cbsnews.com/news/last-pandemic-science-military-60-minutes-2021-04-11/?ftag=CNM-00-10aag7e", "https://edition.cnn.com/2021/03/19/politics/us-military-vaccinations/index.html", "https://time.com/5952558/military-covid-19-vaccine-misinformation/", "https://www.navytimes.com/news/your-navy/2021/03/15/vaccine-fears-why-inoculating-the-force-will-be-difficult/?utm_source=Sailthru&utm_medium=email&utm_campaign=EBB%2003.16.21&utm_term=Editorial%20-%20Early%20Bird%20Brief", "https://www.blacklistednews.com/article/79691/video-darpa-is-working-on-covid-vaccine-implantable-microchip-to-detect.html"], "authors": [], "publish_date": null}