{"result_id": "176001", "URL": "https://theirishsentinel.com/2021/11/20/only-purebloods-will-survive-the-vaccine-radiation-holocaust-being-unleashed-against-humanity-the-spike-protein-in-vaccines-causes-genetic-disintegration/", "timestamp": "2023-04-25 15:42:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/11/20/only-purebloods-will-survive-the-vaccine-radiation-holocaust-being-unleashed-against-humanity-the-spike-protein-in-vaccines-causes-genetic-disintegration/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Only PUREBLOODS will survive the vaccine / radiation holocaust being unleashed against humanity… the spike protein in vaccines causes genetic DISINTEGRATION | The Irish Sentinel", "cleaned_text": "The vaccine, by suppressing the natural DNA repair mechanism in the body — known as NHEJ, or Non-Homologous End Joining — makes people highly susceptible to devastating, cancerous mutations even when exposed to very low levels of ionizing radiation such as sunlight exposure or mammography. With NHEJ suppressed by the spike protein, the body can no longer repair its damaged DNA, and cells mutate out of control, devastating the entire body and bringing about genetic disintegration of the organism.\n\nThe study documenting all this was published in the MDPI journal “Viruses” and was carried out by scientists at Stockholm University, Sweden:\n\nThe study shows that NHEJ efficiency collapses in the presence of the mRNA covid vaccine spike protein:\n\nNo living organism on the planet can survive without genetic integrity. NHEJ is part of every cell in every living plant, animal and human being on the planet.\n\nThe spike protein vaccine is an attack on the genetic integrity of humans, and those who take the vaccine will be largely unable to reproduce because their babies will self-abort due to genetic mutations. This is why 82% of pregnant women who take covid vaccines during their first trimester of pregnancy end up losing their babies to spontaneous abortions.\n\nHow depopulation globalists can accelerate the mutations among the vaccinated\n\nImportantly, once the beings on a planet are widely injected with the covid vaccine, globalists can unleash a nuclear accident (or nuclear terrorism) to distribute radiation across the planet. Even a low level of cesium-137 exposure (or strontium-91, iodine-131, etc.) will unleash a wave of deadly cancers among those who have been vaccinated. While normal, healthy people can repair the DNA damage caused by low levels of ionizing radiation exposure, vaccinated people can barely conduct the repairs (they have roughly a 90% suppression of DNA repair).\n\nThus, cancer rates will skyrocket among the vaccinated, and when they die, the deaths can be blamed on cancer rather than the vaccines. So this binary weapon arrangement also allows vaccine-pimping globalists to escape blame for the vaccines. It covers up vaccine deaths by categorizing them as cancer deaths.\n\nAll they need is another Chernobyl, Fukushima or nuclear explosion somewhere in the Northern hemisphere — almost anywhere — and the winds will spread the radioisotopes across half the planet, achieving the low levels of ionizing radiation necessary to turn vaccinated people into cancer-ridden mutants with accelerated deaths.\n\nThose vaccinated individuals who aren’t killed by the cancers are very unlikely to be able to produce viable offspring due to DNA damage of sperm and egg cells.\n\nInterestingly, once it becomes obvious that vaccinated individuals cannot tolerate sunlight without suffering genetic mutations, they will shun daylight and become creatures of the night.\n\nIn cultural mythos, vampires are creatures of the night who suffer instantaneous disintegration when sunlight touches their skin. In reality, the disintegration will take much more time, but it’s a similar idea:\n\nOnly purebloods will be able to reproduce, so the future of humankind belongs to those who reject mRNA vaccines\n\nThose who reject covid vaccines are known as “purebloods.” They are the only ones who will be able to maintain genetic integrity for generations to come, which means the future of the human race belongs to those who reject covid vaccines. (People who take spike protein / mRNA covid shots are winning the Darwin Award…)\n\nAccording to God, via the Old Testament, the blood is where the life exists. Your body manufactures two million red blood cells each minute, and these are manufactured in your bones. This is why Genesis says Eve was made from the rib of Adam. The bones are where the DNA exists to manufacture blood, the essence of life, and to find the genetic pattern that describes the biology of a new being.\n\nA person who suffers genetic mutations in the blood is diagnosed with leukemia, essentially blood cancer. This is a disintegration of the genetic integrity of their blood manufacturing templates, put simply, and no mammal is viable in the long run when the genetic integrity of their blood is destroyed.\n\nYet this is exactly what the vaccines will accomplish when accompanied by low-level ionizing radiation exposure. Stated again:\n\nThose who took the spike protein injections are already experiencing accelerated growth of cancer tumors. This is being widely reported among naturopathic doctors and analysts. While it is possible that DNA mutations might be halted through an aggressive nutritional detox program and a lifetime of anti-cancer lifestyle habits, most people are in fact leading pro-cancer lifestyles via their toxic foods, toxic personal care products and toxic indoor living environments. Most people are vitamin D deficient on top of that, meaning they are essentially “cancer factories” even before spike protein injections came along.\n\nThus, we are about to see an explosion in worldwide cancer due to covid vaccines. This will really accelerate in 2022, and we will easily see over one million cancer deaths in the USA during 2022 (although the data won’t be available until 2024, most likely). Over the next decade (2022 – 2032) we will likely see tens of millions of cancer deaths in the United States.\n\nAny radiation release by globalists will only accelerate these numbers and cost more lives. (That’s the goal of the globalists.)\n\nMeanwhile, those who took the mRNA spike protein injections will be giving birth to mutated babies who lack genetic viability, even if they survive their own mutations. Currently about half the human population has taken covid jabs of one kind or another, which means the depopulation globalists may have already achieved their goal of destroying fertility / genetic viability for a significant portion of the human race.\n\nThe die-off has now begun. This winter, cancer deaths will explode across America, and they will skyrocket for the next decade in those who were gullible enough to be injected with deadly spike protein bioweapons. Get ready to see a tidal wave of cancers in America, Europe, Australia, Canada and every other nation where gullible people have committed vaccine suicide.", "opengraph": {}, "tags": ["Technetronic Era", "Latest"], "tweets": [], "movies": [], "links": ["https://medicine.news/2021-11-02-science-horror-vaccine-spike-protein-enters-cell-nuclei-suppresses-dna-repair-engine-of-the-human-body-cancer-aging.html", "https://spikeprotein.news/", "https://www.mdpi.com/1999-4915/13/10/2056/htm", "https://doi.org/10.3390/v13102056", "https://vaccines.news/2021-07-06-82-percent-pregnant-women-vaccinated-covid-miscarriage.html", "https://www.newstarget.com/2021-11-19-only-purebloods-will-survive-the-vaccine-radiation-holocaust.html"], "authors": [], "publish_date": null}