{"result_id": "176016", "URL": "https://theirishsentinel.com/2021/05/13/the-dark-fascist-connections-of-the-uks-vaccine-minister-nadhim-zahawi/", "timestamp": "2023-04-25 15:42:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/05/13/the-dark-fascist-connections-of-the-uks-vaccine-minister-nadhim-zahawi/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "The Dark, Fascist Connections Of The UK’s Vaccine Minister, Nadhim Zahawi | The Irish Sentinel", "cleaned_text": "Judge Him By The Company He Keeps\n\nRain is wet, the Pope is Catholic and politicians lie. Not exactly breaking news.\n\nIt’s how it is and has been since time immemorial. Boris Johnson seems to have been on a mission to prove the latter over the past 12 to 14 months as he has shown himself up to be a record-breaking, pathological fibber time after time. Lying is almost like an impulsive reaction to him – similar to a sneeze or a nervous twitch. He just can’t help himself. Every time he opens his mouth, it spews deception.\n\nSo it was no surprise when his newly recruited Vaccine Minister Nadhim Zahawi followed in his footsteps, blatantly lying to all and sundry, when he advised the public that the introduction of vaccine passports or immunity certificates would not be imposed upon the British public. He categorically stated, at the beginning of the year, that these were not on the agenda and that;\n\nHe even referred to the use of such passports as ‘discriminatory’ and said it was ‘not how we do things in the UK.’\n\nFast forward a mere four or five months later, and the ‘discriminatory’ passports are perfectly acceptable and exactly ‘how we do things in the UK’, it would seem. Appearing on BBC Breakfast, Zahawi declared that COVID-19 passports would be issued for those who wanted to travel overseas and that they would be ‘operationally possible’ by May 17.\n\nSo now that it is clear, if we needed any assurances, that the UK Vaccine Minister, Nadhim Zahawi is a liar, what else do we know about him?\n\nYou would expect, wouldn’t you, a man who is in charge of an operation to inject every man, woman and child in the country with a vaccine to be an upstanding, honourable, ethical individual who places the safety and health of the public before any other interest? You would expect Boris to appoint a person who conducts his affairs with good intentions – the wellness of society being at the forefront of his mind. Only someone with a background of decorum, responsibility and integrity would be fit for this role, right?\n\nWell, this is certainly not the character of Nadhim Zahawi. Instead, we have a man who is wholly entrenched in the affairs of the political ruling class of the world and one who has connections to a secretive, invitation-only organisation that has been involved in everything from mysterious Masonic Lodges, terrorist attacks, accusations of sadistic child abuse, election meddling, sexual blackmail, entrapment, assassinations and, above all else, Fascism.\n\nThe organisation, in which he has played a leading role, has a dark and murky history and was at one time, even instrumental in helping to oppress the black population of South Africa – garnering itself a reputation for pushing racism and discrimination. This group, the old boys’ club of Nadhim Zahawi, directly supported and actively promoted the pro-apartheid movements in South Africa in the 1980s. We should therefore not be surprised that he is now championing a new form of apartheid, one which will see widespread intolerance of the unvaccinated community in the United Kingdom.\n\nEstablished by Freemason, Opus Dei member and Nazi collaborator, Jean Violet, along with former Prime Minister of France and Bilderberg Group Founding Member, Antoine Pinay and the last emperor of Austria, Otto von Habsburg in the 1950s, Le Cercle (sometimes referred to as Cercle Pinay) is a privately funded group that, for decades, has been shrouded in secrecy as it connects some of the world’s most powerful and influential political and financial elites, as well as the most distinguished intelligence veterans. This exclusive political club initially began as a Catholic, pro-European Union alliance between French, German and Vatican representatives, but from the 1970s onwards opened its doors to British powerbrokers. This led to the integration in later years of propagandist, Brian Crozier, British MP, Alan Clark and controversial former Cabinet Minister, Jonathan Aitken, to name but a few of its Anglo members.\n\nThis covert inner circle was chaired from the years 2015 to 2017, by the same man who heads up the United Kingdom’s vaccine rollout. Zahawi’s silence on Le Cercle has raised eyebrows and he has come under scrutiny due to his failure to disclose the connections between himself and the group.\n\nThe more we learn about them, the more we understand why he stay quiet about such an affiliation.\n\nAs Le Cercle grew over the years it attracted some very familiar names in the world of politics to their meetings, including Henry Kissinger, Margaret Thatcher and David Rockefeller. The group is believed to have exerted a great influence on the early days of the formation of the European Union. Much of their funding initially came from an Italian by the name of Carlo Pesenti, who was an heir to the fortune of Italy’s wealthiest family. Fiercely anti-communist, like all of Le Cercle members – Pesenti directed funds to the Italian Fascist terrorist movement, the National Vanguard. His money was used by Le Cercle to pay for terrorist attacks, the most infamous of which was the bombing of the Banca Nazionale dell’ Agricoltura in Milan, in which 17 people were killed. The National Vanguard is also known for having assassinated Italian magistrate, Vittorio Occorsio, as well as assisting with the murder of Basque separatist, Jose Miguel Benaran Ordenana. Pesenti died amid an investigation into his role in the collapse of an Italian bank, Banco Ambrosiano, in 1982. In his lifetime, he had eagerly funded some of Le Cercle’s main objectives, pushing for the reinstatement of Fascism in all European countries and the destabilisation of nations, resulting in order out of chaos – more commonly known back then as Strategy of Tension.\n\nAnother hugely influential member of Le Cercle was Giulio Andreotti, a multiple time former Italian Prime Minister. The Chairman of Banco Ambrosiano, Roberto Calvi, outed Andreotti as head of the Propaganda Due (P2) Masonic Lodge which acted as the shadow government of Italy in the late 1970s. The Lodge, dating back to the late 1800s, also boasted future Prime Minister Silvio Berlusconi as a member, as well as the heads of all of the Italian intelligence services and prominent leaders of the Italian mafia. Andreotti’s typically right-wing Le Cercle policy was discovered to be operating under the influence of the CIA, with the planned control and subversion of the nation’s democratic institutions to be put in place in an effort to facilitate Fascist totalitarianism. The Lodge’s Worshipful Master, Licio Gelli was a former Blackshirt under the Mussolini regime and he served at that time as a liaison between Il Duce and Adolf Hitler. Through Andreotti’s Le Cercle contacts in the United States, which included Richard Nixon and, fellow Freemason, Frank Gigliotti, Gelli used the Lodge as a base to initiate pro-Fascist ideologues that would happily engage in propaganda, violence, subversion and terrorism to achieve the goals of the CIA and their Le Cercle associates. Andreotti himself was later sentenced to 24 years in prison after been named as a suspect in the death of a journalist, Carmine Pecorelli, who had also been tied to the P2 lodge. This verdict was overturned in 2003. On top of this accusation, Andreotti, Gelli and other P2 Lodge members are believed to have ordered the murder of Roberto Calvi, whose body was found hanging from a scaffold under a bridge in London, where he had fled to. According to the indictment of the suspects, he was murdered to prevent him;\n\nIf there was ever a case to be put forward for the manipulation of the political landscape and, thus society, at the hands of a Deep State Masonic brethren, the facts surrounding the P2 Lodge and their Le Cercle counterparts are it, particularly when one delves into its involvement in the clandestine, ‘stay behind’ terrorist operations run by NATO and the CIA, known as Gladio.\n\nBut Le Cercle’s stealth activity was not limited to Italy. In the mid-1970s, they were linked to the Fascist dictator of Spain, General Franco. At the time, the treatment of non-Catholic people in the nation was abysmal and they were looked upon with disdain and contempt. There was common ground between Franco and Le Cercle, as he, like Habsburg, was a member of the Knights of Malta and was a keen follower of the Opus Dei network. A prominent member of Le Cercle, Frederick Silva Munoz, would therefore naturally influence the nation’s policy when he became the Minister of the Interior in the late 1960s and used his power in parliament to block a bill that would have recognised non-Catholic Spanish people in Spain as legitimate members of the community – something they had been denied for years. Even after Franco’s death, and with Spain entering a more democratic time in their history, Munoz continued his fanaticism and rejected the Spanish constitution, instead favouring ultra-fascism and allying himself with an organisation known as Fuerza Nueva, whose members saluted their far-right leader, Blas Pinar, and chanted for a dominant, rights-eroding Opus Dei-led technocracy.\n\nVatican-linked aristocracy was the preferred company of Le Cerle in the nation of Belgium as well, as they embraced the son of yet another Bilderberg founder by the name of Baron Benoit de Bonvoisin, better known as the Black Baron. Political advisor to the two-time Belgian Prime Minister, Paul Vanden Boeynants, Bonvoisin is remembered, among many things, for hosting a gathering of some of Europe’s most renowned underground Fascists at his castle in Maizeret village in 1975, including the heads of Ordine Nuovo – an Italian terrorist organisation responsible for the August 4th 1974 train bombing in the city of Bologna, which killed 12 people and injured 48, and the May 1974 murder of eight political protestors in Lombardy. His father, Pierre, was acquainted with Antoine Pinay through their mutual Bilderberg memberships, and therefore, it was inevitable that the Black Baron would be involved in Le Cercle. Along with Jean Violet and Prime Minister Boeynants, he helped to create Belgium’s Cercle des Nations and immediately began to destabilise the democratic process of the nation, through an affiliation with the CIA and the establishment of a P2-esque Masonic Lodge, known as P7.\n\nMore troubling than any of this is the connection between Le Cercle’s Bonvoisin and Boeynants and the well known Marc Dutroux child abduction and murders that rocked the nation of Belgium in the mid-1990s. Soon after Dutroux’s arrest and with the eyes of the public planted firmly on the case, many witnesses began to come forward to speak of abuse at the hands of a paedophile ring, which they had attempted to report in the past, only to be ignored and rejected. It became very apparent that the lowly Dutroux was part of a much wider network of child abusers in the country. Dutroux himself has on many occasions stated that he was involved in the kidnapping of children as a means to earn money via trafficking and that he would subsequently supply powerful and wealthy individuals with the abducted kids. Several victims would begin to give testimony and named some of Belgium’s most powerful men, such as police commissioners, judges, bankers and politicians, as some of those who had perpetrated unspeakable crimes against them. This would lead to the opening of the Dutroux X Dossiers. A far cry from the dubious and baseless baby-eating, adrenochrome-drinking drivel of the QAnon mob today, the witness testimony that came forth from the victims of the Belgian paedophile cult was solid and immensely credible. Some who were interviewed had indeed known each other as part of the networks that they were dragged into as children, but at the time of testimony, none of them had been in contact with each other for years and were unaware of the other’s accusations.\n\nDuring their interviews, five of the witnesses named Le Cercle members, Baron de Bonvoisin and Paul Vanden Boeynants as their abusers and described an entrapment and blackmail operation in which high-target individuals were raping underage girls. Worse still, they described violent, sadistic child abuse, as well as the shooting dead of children as part of a ‘hunting’ exercise on the grounds of a large mansion. Opus Dei was also mentioned in the dossier and it was claimed by several witnesses that members of the Catholic institution had partaken in Satanic rituals and committed infanticide. For Boeynants, this was not the first time he had been named as an abuser of children. In 1979, he had been accused, alongside Albert II of Belgium, of attending private parties in which children were raped.\n\nIndeed, on a side note, this raises further questions about Nadhim Zahawi’s involvement with another group (this one made up primarily of wealthy businessmen), in the form of a so-called charitable trust in the UK, known as the President’s Club. Zahawi attended a men’s-only dinner organised by the (now defunct) charity in 2018 in which female staff reported been subjected to sexual harassment and touched inappropriately, as well as having one of the guests expose their penis to them. What’s more, is that this Club was also visited in 2008 by serial paedophile Jimmy Saville, and in 2010 by Italian businessman and former Jeffrey Epstein associate, Flavio Briatore.\n\nBut getting back to Le Cercle, Britain was not left out when it came to the intervention of the shadowy faction in the politics of European nations. A private and powerful alliance of MI6 officers and Tory politicians worked together with Le Cercle members, via Brian Crozier’s Institute for the Study of Conflict (ISC), in a psychological operation against the Labour Party that would even result in the deployment of troops and tanks to Heathrow Airport when propaganda emanating from Le Cercle led to hysteria surrounding supposed Communist cells in the nation. Subsequently, the nation’s power struggle would swing to the right and finally result in the election of Margaret Thatcher to Prime Minister’s office. Similar propaganda was used in France in 1974 when Jean Violet oversaw an extensive propaganda campaign that included the publication of over 9 million brochures aimed at attacking the Socialist government and smearing their leader, Francois Mitterand. This lead to the ascent to power of Valery Giscard d’Estaing. In Portugal, Le Cercle would get behind the aspirations of their member, General Antonio de Spinola and were fervent supporters of his coup attempts, as well as the underground armies he led, such as paramilitary terrorists, the ELP and their affiliates the Aginter Presse mercenaries.\n\nBy far the most egregious of the propaganda wars waged by Le Cercle was that of their pro-apartheid campaigns in South Africa. Generally described as being the largest of its type since World War 2, the media crusade embarked on by the group was done in partnership with South Africa’s Department of Information (DOI) and would eventually culminate in a scandal that led to the resignation of the South African Prime Minister, B.J Vorster. After a private meeting between Antoine Pinay and Vorster in August 1973, Le Cercle closely collaborated with the DOI and the South African intelligence service, Bureau of State Security (BOSS), to co-opt and bribe French and Belgian media. This was an effort to develop a more favourable view among European decision-makers towards the concept of apartheid in the nations and to disseminate the false rhetoric that cessation of the discriminatory system would result in, not only widespread terrorism in the nation, but also a dire threat to the vital African trade routes for oil supply to Europe and beyond. Brian Crozier’s ISC propaganda outlet would also become involved and there were attempts made to buy out newspapers, including the Washington Star and the Rand Daily Mail by the group. It is estimated that a total of US$73 million was spent and 160 separate projects launched by Le Cercle, the DOI and the BOSS in an effort to propagate on behalf of the pro-apartheid profiteers. One of the sympathisers to their cause was Vietnam War veteran, John McCain who even invited the Chief of South Africa’s Defence Staff, Admiral Hugo Biermann for a week-long private visit to the US.\n\nAt every stage of Le Cercle’s existence, there is to be found major controversy, criminality and corruption. Their membership list, past and present, reads like a who’s who of the one percent and transcends nationality, political allegiance and religious beliefs. It includes American Neo-Cons like Paul Bremer, Richard Perle and Zbigniew Brzezinski, British ex-MI6 officers like Anthony and Andrew Cavendish, former CIA directors like William Casey and William Colby, Russian politicians like Yegor Gaidar and Arkady Shevchenko, Israeli Zionists like Benjamin Netanyahu, Shimon Peres and Dan Meridor and Arab Royalty like Sultan Qaboos bin Said and Prince Turki Bin Faisal Al Saud.\n\nShadow governments, such as the one recently led by Britain’s Vaccine Minister, I believe are best summed up by a man called Gene Wheaton – a former security contractor who later became an insider and began speaking out about what he witnessed while working with Le Cercle Member, Ted Shackley. As the head of the group’s US affairs through his Atlantic Cercle corporation in Miami, Florida, Shackley a former CIA officer, represented the mentality of the participants of such shady groups. As Wheaton said;\n\nIn my book, The COVID-19 Illusion; A Cacophony of Lies, I explain that these same networks are still running the world and are now involved in the plan to vaccinate all of us. I also show how their gofers – trusted so much and by so many worldwide – such as Bill Gates, Dr Anthony Fauci and Dr Tedros Adhanom Ghebreyesus, are deeply sinister, compromised, dangerous psychopaths who have horrendously suspicious backgrounds and disturbing connections.\n\nOn delving into Nadhim Zahawi’s affiliations with Le Cercle, you can sure as hell say the same about him.", "opengraph": {}, "tags": ["Latest", "Featured"], "tweets": [], "movies": [], "links": ["https://www.mirror.co.uk/news/politics/60-lies-boris-johnson-tory-21065956", "https://www.independent.co.uk/news/uk/politics/vaccine-passports-zahawi-trials-report-b1786375.html", "https://www.independent.co.uk/news/uk/politics/covid-vaccine-passport-nadhim-zahawi-b1798785.html", "https://www.rt.com/uk/522552-vaccine-passport-travel-abroad/", "https://www.rt.com/uk/522552-vaccine-passport-travel-abroad/", "https://www.rt.com/uk/522552-vaccine-passport-travel-abroad/", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F179066a0-5704-4fef-8223-11e36129346e_474x315.jpeg", "https://www.goodreads.com/book/show/93339.Their_Kingdom_Come", "https://www.politicshome.com/news/article/excl-top-tories-face-questions-over-links-to-secretive-foreign-affairs-group", "https://in-this-together.com/the-new-world-order-and-the-european-union/", "https://isgp-studies.com/le-cercle-pinay#cercle-leadership", "https://visupview.blogspot.com/2016/05/le-cercle-fratelli-neri.html", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F23d1d9ae-a9b0-494c-8d76-882e87a0bb57_199x304.jpeg", "https://isgp-studies.com/le-cercle-pinay#italy-p2-lodge-licio-gelli-giulio-andreotti-giancarlo-valori", "https://isgp-studies.com/le-cercle-pinay#general-vernon-walters", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F065a8248-a437-4d56-956c-412fc83e905d_329x185.jpeg", "https://isgp-studies.com/le-cercle-pinay#spain-franco", "https://www.goodreads.com/book/show/26086265-rogue-agents", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1cfc8c04-4959-4757-8770-841dcaf389fb_474x306.jpeg", "https://isgp-studies.com/belgian-x-dossiers-of-the-dutroux-affair", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd598a41b-1eb8-4e23-88e4-45d74627597e_474x266.jpeg", "https://isgp-studies.com/le-cercle-pinay#216", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6cbb72de-58b1-41ee-99ee-2827dcc7a54d_474x316.jpeg", "https://www.standard.co.uk/news/uk/presidents-club-government-minister-nadhim-zahawi-given-dressing-down-after-attending-maleonly-dinner-where-hostesses-were-groped-a3749006.html", "https://www.ft.com/content/075d679e-0033-11e8-9650-9c0ad2d7c5b5", "https://www.theguardian.com/society/2018/jan/24/great-ormond-street-return-presidents-club-donations-harassment-claims", "https://nexusnewsfeed.com/article/geopolitics/meet-le-cercle-making-bilderberg-look-like-amateurs/", "https://www.bibliotecapleyades.net/sociopolitica/sociopol_lecercle06.htm", "https://www.dailymaverick.co.za/article/2017-10-24-declassified-apartheid-profits-le-cercle-the-phantom-profiteers/", "https://www.hurstpublishers.com/book/apartheid-guns-and-money/", "https://www.goodreads.com/book/show/28565464-the-press-and-apartheid", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F9574167f-2622-4ae2-ac55-585c0c7a3d0b_140x198.jpeg", "https://isgp-studies.com/le-cercle-membership-list", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fa3ddca25-4a07-4dd8-af9c-1636f7ac76d4_474x474.jpeg", "https://isgp-studies.com/le-cercle-pinay#cia-shadow-government", "https://www.amazon.co.uk/dp/B08MCCDHMF"], "authors": [], "publish_date": null}