{"result_id": "176011", "URL": "https://theirishsentinel.com/2021/03/21/irish-council-for-civil-liberties-warns-against-vaccine-certificates/", "timestamp": "2023-04-25 15:42:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/03/21/irish-council-for-civil-liberties-warns-against-vaccine-certificates/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Irish Council for Civil Liberties warns against vaccine certificates | The Irish Sentinel", "cleaned_text": "The Irish Council for Civil Liberties (ICCL) has told Minister Simon Coveney that vaccine passports and immunity certificates “may present unjustified interference with the right to non-discrimination, right to freedom of movement, right to privacy, right to equality and right to bodily integrity.”\n\nThe ICCL has published a letter the organization wrote to Minister for Foreign Affairs Simon Coveney this week, outlining their concerns about the proposal to create digital travel certificates for those who wish to travel during the Covid-19 pandemic.\n\nThe group claim the EU Commission’s proposal to create such a system could have “negative implications for the rights of Irish citizens and others wishing to travel into and/or between EU member States.”\n\n“The impact of an immunity or vaccine passport system may affect (a) the rights of those who are required to, or feel compelled to, participate in such a scheme; and (b) those who would not or could not qualify for the vaccine or the passport scheme and whose rights may be restricted as a consequence,” the ICCL wrote.\n\nExplaining in detail each of the human rights that are threatened by the proposal, the ICCL also warned against using such a system “within Ireland”, as countries such as Israel make vaccination a prerequisite for accessing bars and restaurants.\n\n“For all of these reasons, ICCL strongly opposes any use of vaccine passports in the area of goods and services. We would also call on the Irish Government to commit to not using such a system in respect of accessing goods and services within Ireland.\n\n“In relation to international travel, we identify serious human rights challenges with any system of Covid vaccine certificates or passports, particularly in the context of the present shortage of supply of Covid-19 vaccines.\n\nAsking for more information on the Irish government’s position in relation to EU proposals for vaccine certificates, the group proposed that the Department of Foreign Affairs “conduct a comprehensive human rights impact assessment of any proposals for vaccine or immunity passports of certificates.”\n\nThe EU Commission last week indicated that a system of digital travel certificates would likely be created before the summer, which, if passed by the EU parliament, would detail whether the traveller has had a negative PCR test result, immunity following recovery from the virus, or been vaccinated against Covid-19.\n\nAn EU Commission official said the system would cease to operate after the WHO confirm an end to the pandemic.", "opengraph": {}, "tags": ["Latest", "Irish News"], "tweets": [], "movies": [], "links": ["https://gript.ie/irish-council-vaccine-certificates/"], "authors": [], "publish_date": null}