{"result_id": "176044", "URL": "https://theirishsentinel.com/2023/01/01/unprecedented-vaccine-disaster-an-interview-with-professor-masanori-fukushima/", "timestamp": "2023-04-25 15:43:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2023/01/01/unprecedented-vaccine-disaster-an-interview-with-professor-masanori-fukushima/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "“Unprecedented Vaccine Disaster”: An Interview with Professor Masanori Fukushima | The Irish Sentinel", "cleaned_text": "On November 25th there occurred a singularly rare event in the ongoing COVID-19 saga – truth was spoken to power. A distinguished medical doctor and infectious disease expert was given free rein to interrogate a government official, unmediated and without apparent time restraint.\n\nThe doctor in question was the distinguished oncologist, professor emeritus at Kyoto university and Director and Chairman of the Translational research Information Centre (Tri) Masanori Fukushima. His rigorous and passionate berating of an official from the Ministry of Health, Labour and Welfare (MHLW) on COVID-19 vaccine safety and government transparency made for gripping viewing. A recording swiftly went viral, elevating Doctor Fukushima to a new status as leading critic of the COVID-19 vaccines in Japan.\n\nI interviewed Professor Fukushima via Zoom on December 28th. He began by giving me some background to his career and explaining why he had become involved in the COVID-19 vaccine issue before moving on to the specific harms, his views of the Japanese Government’s response and the way ahead.\n\nPhilip Patrick: Professor Fukushima, thank you for allowing me to speak to you. Could I start by asking you to give me some background to the event on November 25th and how you came to be involved in the COVID-19 vaccine safety issue?\n\nMasanori Fukushima: I majored [in] biochemistry at Kyoto University post graduate school and actually I am the eldest medical oncologist in our country. I opened in the academic sector the first out-patient clinic for cancer patients in 2003 when I was Professor at Kyoto University. I [became involved in] pharmaco-epidemiology in 2000. This is the study of stop[ping] drug disaster[s]. That’s the mission, the raison d’etre. That’s why I’m involved with the COVID-19 vaccine problem. Because no scientists and only a few physicians have spoken out about the problem of vaccines.\n\nSo, when I heard that Government and EU and USA started the messenger RNA program my first impression was this is so stupid. Because messenger RNA is evolutionary, and the cell system is degraded always in a very short time. Messenger RNA is fragile and should be degraded promptly in the body. But this vaccine is modified and manipulated to be stable and to be incorporated in nanoparticles. Nanoparticles are the second problem as it is always incorporating in any type of cells, particularly stem cells. Stem cells are very important for repairing any types of cells. And the third problem is that there is no specificity of delivery. It (messenger RNA) is injected into the body and goes all around the body expressing spike proteins. This is a major problem. The spike protein is very dangerous.\n\nSo, when I first heard that the Government was using this vaccine and the PMDA [the Japanese regulatory agency, equivalent to the FDA] had approved it I was very, very concerned, But it has became a kind of religion. Still, they believe in the effectiveness of the vaccine – it’s like a Messiah.\n\nPP: Why is the spike protein dangerous?\n\nMF: The spike protein binds to receptor proteins which [are] expressed [in] most cells. So it [the spike protein] attacks all types of cells particularly endothelial cells in the vascular system, which can lead to coagulation. If the endothelial cells bind to the spike protein coagulation is triggered.\n\nMF: Yes, if the major artery is affected it can lead to major impacts, such as heart attacks or strokes. And the FDA has detected the signal of the frequency of pulmonary thrombosis.\n\nPP: And you have written in your reports [published in a Japanese journal] that there have been 2,000 deaths reported to the Government [MHLW] as very likely to have been the result of the vaccine. But in one of your reports, you described it as “the tip of the iceberg”. How much bigger could it be?\n\nFM: One estimation is five-fold. The reports are mainly from doctors who cared for the patients, but most vaccination is not done in clinics but in vaccination centres run by the prefectures with the injection done by the nurse [so in most cases doctors are not directly involved in the chain of event and unlikely to report vaccine problems].\n\nThe cases are accumulating but the Government has denied causality even for the autopsied cases, in which the pathologist has pointed out the causality. There is clear evidence of a significant increase in heart problems and vascular problems such as strokes and pneumonia-like symptoms and others.\n\nPP: But the argument that people who believe in these vaccines always put forward is that despite a few problems the vaccines are saving far more people than they are damaging. What is your response to that?\n\nFM: I asked the government to disclose the COVID-19 mortality in vaccinated and non-vaccinated people. This statistic is critical. If there is no difference, then the vaccine induced deaths do not justify the use of the vaccines. I officially requested this information with my attorney on August 1st. And the first answer was “wait two months”. And then the final answer was “no, we do not disclose”. So, the next step is to sue the Government.\n\nPP: You are planning to sue the Government?\n\nFM: Yes, based on the Information Disclosure Act.\n\nPP: So, they are refusing to disclose vital information which the public need to know and which could save lives?\n\nFM: Yes, that’s right. It’s like a joke. Because the Government disclosed such information last year. And there is evidence that for under 65 year-olds the mortality rate for unvaccinated people is lower than the vaccinated people. It is funny – no, not funny because there are many deaths, so we don’t laugh; but the behaviour of the ministry is very stupid.\n\nPP: So, they previously disclosed and then stopped disclosing, presumably because it is embarrassing. So, it is impossible to find the information that we need to find out if the vaccines are working or not? At one point in the video you said “it looks like you are hiding data”.\n\nFM: Yes, and I think they were upset. There are so many deaths. It is an unprecedented vaccine disaster. I can’t imagine how many people have really died. 2,000 is the minimum, the tip of the iceberg.\n\nPP: And it is all ages, isn’t it? One of your reports had a 28 year-old man who died after the second vaccine with no health problems?\n\nMF: That’s right, no health problems. Five days after the second vaccine. It’s very tragic.\n\nPP: Do you think the scale of this is so enormous and the scandal is so big that the government simply cannot accept it? They would prefer to go on and pretend the vaccines work than admit the scale of the disaster? Is that their position?\n\nMF: So… it’s not an appropriate analogy but you say if you kill one person, [it] is legally murder, but kill so many people and it’s like war and you don’t go to jail.\n\nPP: Someone once said that the bigger the lie the easier it is to get away with. Why are the Japanese still getting vaccinated?\n\nMF: But I think the rate is going down. Many people are stopping. And apparently mass media do not encourage vaccination as much as previously.\n\nPP: So, in the media there is less encouragement, there is nothing on vaccine injuries, but less encouragement to get vaccinated? The message has subtly changed.\n\nMF: Yes, that’s the Japanese way. But this problem is growing bigger and bigger. One very popular magazine is publishing a series on the vaccine problems. Their influence is very big, so next year a change will occur.\n\nPP: And three other doctors have come forward (Kojima , Sano and Nagao). What is the feeling among doctors generally?\n\nMF: Yes, Dr. Nagao has got in touch with me and wants a dialogue. And Professor Sano was with me at the meeting on November 25th. He was on the same table. And there is also Professor Kojima from Nagoya University. Professor Kojima is a very significant person who identified the vaccine problems using very important analysis.\n\nPP: So, the group is getting bigger?\n\nMF: Bigger, but I am not [organising it]. I am involved because I was asked to write papers about COVID-19, and one was on how to avoid COVID-19 and deal with COVID-19. I advised appropriate use of steroid therapy without delay. When COVID-19 arrived in Japan for the first time in February 2020 I gathered information from China and concluded that the critical point was to stop the development of interstitial pneumonitis. The answer is to detect the drop in oxygen level in the blood. If it is below 95% then check the CT and if there is an infiltration sign, start the treatment.\n\nPP: So existing treatments were enough?\n\nMF: Principally yes, and if you attack the virus with an anti-viral drug it [just] evolves. Alpha, Beta, Gamma, Delta, etc. All viruses evolve through communication with the host. This is a biological principle.\n\nPP: So, the vaccines are useless?\n\nPP: One theory is that interventions such as lockdowns, separating people, closing schools, etc., have influenced the development of the virus, interrupted its natural evolution, possibly causing it to become more transmissible. Would it have been better simply to behave normally, allow the virus to spread, and just treat the sick promptly, as you have described?\n\nMF: This is quite difficult to give a clear-cut answer [to]. The virus evolution is based on communication with host so we can’t [exactly] predict the evolution of the virus but in general viruses develop to become more symbiotic with the host. At first, I thought COVID-19 would be similar. The mortality rate has decreased and plateaued, and I cannot totally disprove that vaccines have been effective but really, we have to think that doctors have improved their techniques and that the virus has become less toxic.\n\nPP: So, it’s not justifiable to link reduced mortality to the virus. It’s post hoc ergo proctor hoc reasoning.\n\nMF: Yes, and one more point – the clinical guidelines for treating COVID-19 is now in its 8th edition. It’s very meticulous and helpful. If the practitioner adheres to it the patient will be more likely to recover.\n\nPP: A few more medical points. In the recording you said that the Japanese were relatively lightly hit because they had prior immunity perhaps because of previous exposure to coronaviruses?\n\nMF: Yes, and this finding is very important. There is evidence from doctors at Kanagawa Dental University and they found that non-vaccinated non-infected care givers had high percentage of cross reactive IgA to SARS-Cov2 virus in their saliva. This is very important because if we make a vaccine for such a respiratory disease, we have to make a mucosal or nasal vaccine, not [an] injection, because injections make only IgG, not secretory IgA anti-bodies. Injection type vaccines only produce serum level IgG just blocking the virus in the body. We need to make an oral or nasal vaccine, but it is still difficult.\n\nPP: Finally, in your reports you said, perhaps particularly the booster shots, are damaging people’s immune systems, opening them up to all kinds of problems?", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://rumble.com/v1zahpo-you-are-ignoring-science-its-a-disaster-dr-masanori-fukushima-of-kyoto-univ.html", "https://dailysceptic.org/2023/01/01/unprecedented-vaccine-disaster-an-interview-with-professor-masanori-fukushima/"], "authors": [], "publish_date": null}