{"result_id": "176043", "URL": "https://theirishsentinel.com/2023/01/06/top-cancer-expert-aggressive-cancers-appearing-after-vaccine-boosters-not-a-coincidence/", "timestamp": "2023-04-25 15:43:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2023/01/06/top-cancer-expert-aggressive-cancers-appearing-after-vaccine-boosters-not-a-coincidence/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Top Cancer Expert: Aggressive Cancers Appearing After Vaccine Boosters “Not a Coincidence” | The Irish Sentinel", "cleaned_text": "There follows the transcript of a new video put out by top cancer specialist Dr. Angus Dalgleish, who is very concerned that the Covid boosters appear to be causing cancers, an adverse effect which he says “does not look like a coincidence”.\n\nI’m Angus Dalgleish. I’m a Professor of Oncology at St. George’s, a Consultant Medical Oncologist, and I have started to notice that several of my patients have melanoma who’ve been stable with stage 4 disease, they’ve had very good immunotherapy or other treatment and I’ve been reviewing them from five to 20 years. I’ve noticed that I have now over six, possibly seven, even an eighth yesterday, who’ve clearly relapsed following the booster vaccine.\n\nAt first we didn’t put the two together, but when a patient said, “I felt awful since the vaccine, I’ve just been drained”, they’ve described symptoms like a Long Covid, and the next thing we know, two, three weeks, couple of months later they’ve got clear evidence of relapse. And these relapses are quite aggressive. They’re not a gentle relapse. They’re relapses that are requiring systemic therapy as opposed to a little nodule that requires surgical incision.\n\nBut it’s not just this. I’m now very much aware in my own circle of many people, they haven’t got a melanoma – they’ve never had anything before – but they’ve got lumps and bumps and they’re not felling well. And two people I’ve interviewed at great length, they all put it down to feeling awful after their booster. They were fine with the first two vaccines, they just had shivers, flu etc. But they’ve described being very tired, very fatigued, wanting to stay in bed, and this has dragged on to the point were they’ve gone to the doctor and they’ve had blood counts and investigations and I now know seven of them, two of them have leukemias, and others have lymphomas, and one of them has a very bad melanoma, which he is absolutely sure was instigated by the booster as he developed dreadful symptoms.\n\nSo really I want to bring to everybody’s attention that I think that this does not look like a coincidence to me and we need to join forces and see if this is a real effect and if it is we must stop all the boosters immediately. Thank you.", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">London Professor of Oncology calls for urgent stop to C19 boosters:<br/><br/>\"As an Oncologist I Am Seeing People With Stable Cancer Rapidly Relapse After a C19 Booster\"<br/><br/>Angus Dalgleish, Professor of Oncology at St. Georges Hospital Medical School London. <a rel=\"nofollow\" href=\"https://t.co/taBZpU9neL\">pic.twitter.com/taBZpU9neL</a></p>— Robin Monotti (@robinmonotti) <a rel=\"nofollow\" href=\"https://twitter.com/robinmonotti/status/1610199630545039363?ref_src=twsrc%5Etfw\">January 3, 2023</a></blockquote> \n"], "movies": [], "links": ["https://twitter.com/robinmonotti/status/1610199630545039363", "https://t.co/taBZpU9neL", "https://twitter.com/robinmonotti/status/1610199630545039363?ref_src=twsrc%5Etfw", "https://dailysceptic.org/2023/01/06/top-cancer-expert-aggressive-cancers-appearing-after-vaccine-boosters-not-a-coincidence/"], "authors": [], "publish_date": null}