{"result_id": "176037", "URL": "https://theirishsentinel.com/2021/06/02/dr-zelenko-covid-vaccine-mandates-for-children-are-coercive-human-experimentation-crimes-against-humanity/", "timestamp": "2023-04-25 15:43:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/06/02/dr-zelenko-covid-vaccine-mandates-for-children-are-coercive-human-experimentation-crimes-against-humanity/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Dr. Zelenko: Covid vaccine mandates for children are “coercive human experimentation, crimes against humanity” | The Irish Sentinel", "cleaned_text": "Administering Wuhan coronavirus (Covid-19) “vaccines” to children under duress is a form of “coercive human experimentation,” and those pushing for such are guilty of “crimes against humanity,” says Dr. Vladimir Zev Zelenko, M.D., the discoverer of the famous Zelenko protocol.\n\nSpeaking to America’s Frontline Doctors (AFLDS), Dr. Zelenko revealed that there is absolutely no reason to inject children with experimental mRNA (messenger RNA) or viral vector Chinese Virus jabs because this age group has an almost zero risk of testing “positive” for the virus in the first place.\n\n“According to the CDC, healthy kids 18 or younger have a 99.998 percent rate of recovery from Covid-19 without any treatment,” he is quoted as saying.\n\n“There is no medical necessity for any vaccines – especially an experimental and unapproved mRNA injection that has been shown to have many dangerous side effects.”\n\nAny government, business, or school district that attempts to mandate Wuhan Flu shots on children is acting in direct violation of the Geneva Convention’s prohibition against coercive human experimentation, he further warned.\n\n“These are criminals of the highest order and must be brought to justice for crimes against humanity.”\n\nThe government of Israel, for example, is acting in such a manner by using “coercion against its own citizens to force them into human experimentation,” Dr. Zelenko says.\n\n“The Israeli government uses coercion against its own citizens to force them into human experimentation,” he further contends. “Green passports are a tool of discrimination and exert an unconscionable amount of psychological pressure on innocent people.”\n\nWhy did we allow covid to destroy informed consent?\n\nOne of the Covidists’ biggest victories throughout this saga was abolishing informed consent, which is the right to accept or reject – your choice – a medical procedure based on your own decision, and not that of Anthony Fauci, Bill Gates or Donald Trump.\n\nTo demand that all Americans get injected with experimental DNA-modifying chemicals that will forever destroy the immune system amounts to crimes against humanity as Dr. Zelenko has indicated.\n\n“Informed consent has been disregarded and medical necessity is not considered,” Dr. Zelenko further told AFLDS. “Therefore, young and healthy people and those who already have antibodies are still being forced into an experimental medical intervention that they do not need.”\n\nLikening Israel’s forced vaccination program to the Israeli – Palestinian conflict, Dr. Zelenko went on to tell that country as well to stop forcibly injecting people, and especially children, with experimental gene therapy cocktails.\n\n“Israeli government: Stop shooting microscopic missiles into the bodies of your innocent and non-consenting citizens,” he stated. “Proceed with caution, stop human experimentation, and gather more safety and efficacy data before using new and unapproved technology.”\n\nDr. Zelenko is among a group of doctors who have been nominated for the Nobel Peace Prize for their role in addressing the Wuhan coronavirus (Covid-19) plandemic.\n\nHe achieved worldwide prominence for successfully treating Chinese Virus patients with hydroxychloroquine (HCQ) and zinc, which Trump also promoted early on in 2020 before switching to promoting the “Trump vaccine,” as he calls it.\n\nAccording to Dr. Zelenko, early treatment with HCQ and zinc resulted in an eight-fold decrease in mortality among patients. Getting HCQ and zinc into patients within the first five days after they test “positive” also helps to decrease the death rate by 85 percent, he says.\n\nDr. Simone Gold, meanwhile, who heads up AFLDS, has been tweeting as of late about Big Tech’s continued censorship of these and other viable remedies for the Wuhan Flu.\n\n“It’s not ‘research’ if they’re censoring opposing information,” she tweeted on May 28. “It’s not ‘science’ if you’re not allowed to question it.”", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://www.americasfrontlinedoctors.org/frontline-news/dr-zelenko-calls-child-vaccine-mandate-coercive-human-experimentation-crimes-against-humanity", "https://www.naturalnews.com/2020-08-14-green-tea-zinc-and-hydroxychloroquine-coronavirus-cure.html", "https://vaccinewars.com/2021-06-01-zelenko-covid-vaccine-mandates-children-human-experimentation.html"], "authors": [], "publish_date": null}