{"result_id": "176038", "URL": "https://theirishsentinel.com/2021/03/30/urgent-open-letter-from-doctors-and-scientists-to-the-european-medicines-agency-regarding-covid-19-vaccine-safety-concerns-2/", "timestamp": "2023-04-25 15:43:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/03/30/urgent-open-letter-from-doctors-and-scientists-to-the-european-medicines-agency-regarding-covid-19-vaccine-safety-concerns-2/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Urgent Open Letter from Doctors and Scientists to the European Medicines Agency regarding COVID-19 Vaccine Safety Concerns | The Irish Sentinel", "cleaned_text": "FOR THE URGENT PERSONAL ATTENTION OF: EMER COOKE, EXECUTIVE DIRECTOR OF THE EUROPEAN MEDICINES AGENCY\n\nAs physicians and scientists, we are supportive in principle of the use of new medical interventions which are appropriately developed and deployed, having obtained informed consent from the patient. This stance encompasses vaccines in the same way as therapeutics.\n\nWe note that a wide range of side effects is being reported following vaccination of previously healthy younger individuals with the gene-based COVID-19 vaccines. Moreover, there have been numerous media reports from around the world of care homes being struck by COVID-19 within days of vaccination of residents. While we recognise that these occurrences might, every one of them, have been unfortunate coincidences, we are concerned that there has been and there continues to be inadequate scrutiny of the possible causes of illness or death under these circumstances, and especially so in the absence of post-mortems examinations.\n\nIn particular, we question whether cardinal issues regarding the safety of the vaccines were adequately addressed prior to their approval by the European Medicines Agency (EMA).\n\nAs a matter of great urgency, we herewith request that the EMA provide us with responses to the following issues:\n\n1. Following intramuscular injection, it must be expected that the gene-based vaccines will reach the bloodstream and disseminate throughout the body [1]. We request evidence that this possibility was excluded in pre-clinical animal models with all three vaccines prior to their approval for use in humans by the EMA.\n\n2. If such evidence is not available, it must be expected that the vaccines will remain entrapped in the circulation and be taken up by endothelial cells. There is reason to assume that this will happen particularly at sites of slow blood flow, i.e. in small vessels and capillaries [2]. We request evidence that this probability was excluded in pre-clinical animal models with all three vaccines prior to their approval for use in humans by the EMA.\n\n3. If such evidence is not available, it must be expected that during expression of the vaccines’ nucleic acids, peptides derived from the spike protein will be presented via the MHC I — pathway at the luminal surface of the cells. Many healthy individuals have CD8-lymphocytes that recognize such peptides, which may be due to prior COVID infection, but also to cross-reactions with other types of Coronavirus [3; 4] [5]. We must assume that these lymphocytes will mount an attack on the respective cells. We request evidence that this probability was excluded in pre-clinical animal models with all three vaccines prior to their approval for use in humans by the EMA.\n\n4. If such evidence is not available, it must be expected that endothelial damage with subsequent triggering of blood coagulation via platelet activation will ensue at countless sites throughout the body. We request evidence that this probability was excluded in pre-clinical animal models with all three vaccines prior to their approval for use in humans by the EMA.\n\n5. If such evidence is not available, it must be expected that this will lead to a drop in platelet counts, appearance of D-dimers in the blood, and to myriad ischaemic lesions throughout the body including in the brain, spinal cord and heart. Bleeding disorders might occur in the wake of this novel type of DIC-syndrome including, amongst other possibilities, profuse bleedings and haemorrhagic stroke. We request evidence that all these possibilities were excluded in pre-clinical animal models with all three vaccines prior to their approval for use in humans by the EMA.\n\n6. The SARS-CoV-2 spike protein binds to the ACE2 receptor on platelets, which results in their activation [6]. Thrombocytopenia has been reported in severe cases of SARS-CoV-2 infection [7]. Thrombocytopenia has also been reported in vaccinated individuals [8]. We request evidence that the potential danger of platelet activation that would also lead to disseminated intravascular coagulation (DIC) was excluded with all three vaccines prior to their approval for use in humans by the EMA.\n\n7. The sweeping across the globe of SARS-CoV-2 created a pandemic of illness associated with many deaths. However, by the time of consideration for approval of the vaccines, the health systems of most countries were no longer under imminent threat of being overwhelmed because a growing proportion of the world had already been infected and the worst of the pandemic had already abated. Consequently, we demand conclusive evidence that an actual emergency existed at the time of the EMA granting Conditional Marketing Authorisation to the manufacturers of all three vaccines, to justify their approval for use in humans by the EMA, purportedly because of such an emergency.\n\nShould all such evidence not be available, we demand that approval for use of the gene-based vaccines be withdrawn until all the above issues have been properly addressed by the exercise of due diligence by the EMA.\n\nThere are serious concerns, including but not confined to those outlined above, that the approval of the COVID-19 vaccines by the EMA was premature and reckless, and that the administration of the vaccines constituted and still does constitute “human experimentation”, which was and still is in violation of the Nuremberg Code.\n\nIn view of the urgency of the situation, we request that you reply to this email within seven days and address all our concerns substantively. Should you choose not to comply with this reasonable request, we will make this letter public.\n\nThis email is copied to:\n\nCharles Michel, President of the Council of Europe", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://doctors4covidethics.medium.com/urgent-open-letter-from-doctors-and-scientists-to-the-european-medicines-agency-regarding-covid-19-f6e17c311595"], "authors": [], "publish_date": null}