{"result_id": "176019", "URL": "https://theirishsentinel.com/2021/10/18/the-unvaccinated-are-looking-smarter-every-week/", "timestamp": "2023-04-25 15:42:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2021/10/18/the-unvaccinated-are-looking-smarter-every-week/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "The Unvaccinated Are Looking Smarter Every Week | The Irish Sentinel", "cleaned_text": "There is a massive propaganda push against those choosing not to vaccinate against COVID-19 with the experimental mRNA vaccines. Mainstream media, the big tech corporations, and our government have combined efforts to reward compliance and to shame and marginalize non-compliance.\n\nTheir mantra says that this is a pandemic of the unvaccinated. Persons who choose not to vaccinate are characterized as unintelligent, selfish, paranoid people who don’t read much and live in a trailer park in Florida (or Alabama, or Texas, or name your state). Never has there been such an effort to cajole, manipulate through fear, and penalize people to take an experimental medical treatment.\n\nHowever, as time has passed with this pandemic and more data accumulates about the virus and the vaccine, the unvaccinated are looking smarter and smarter with each passing week. It has been shown now that the vaccinated equally catch and spread the virus. Vaccine side effect data continues to accumulate that make the risk of taking the vaccine prohibitive as the pandemic wanes. Oral and IV medications (flccc.net) that work early in the treatment of COVID-19 are much more attractive to take now as the vaccine risks are becoming known, especially because the vaccinated will need endless boosters every six months.\n\nFirst, let’s address the intelligence of the unvaccinated. Vaccine hesitancy is multi-factorial and has little to do with level of education or intelligence. Carnegie Mellon University did a study assessing vaccine hesitancy across educational levels. According to the study, what’s the educational level with the most vaccine hesitancy? Ph.D. level! Those can’t all have been awarded to liberal arts majors. Clearly, scientists who can read the data and assess risk are among the least likely to take the mRNA vaccines.\n\nThe claim that there’s a pandemic of the unvaccinated is, therefore, patently untrue. As a retired nurse from California recently asked, “Why do the protected need to be protected from the unprotected by forcing the unprotected to use the protection that did not protect the protected in the first place?” If the vaccine works to prevent infection, then the vaccinated have nothing to worry about. If the vaccine does not prevent infection, then the vaccinated remain at some risk, and the unvaccinated would be less likely to choose a vaccine that does not work well.\n\nThe mRNA vaccine efficacy is very narrow and focused on the original alpha strain of COVID-19. By targeting one antigen group on the spike protein, it does help for the original alpha strain, but it is clear now it does not protect against Delta strain and is likely not protective against any future strains that might circulate. It also appears that the efficacy wanes in 4-6 months, leading to discussions about boosters.\n\nSeveral authors have pointed out that vaccinating with a “leaky” vaccine during a pandemic is driving the virus to escape by creating variants. If the booster is just another iteration of the same vaccine, it likely won’t help against the new strain but will, instead, produce evolutionary pressure on the virus to produce even more variants and expose us to more side effects. Why, then, is this booster strategy for everyone being pursued?\n\nThis vast Phase 3 clinical trial of mRNA vaccines in which Americans are participating mostly out of fear is not going well. It is abundantly clear for anyone advocating for public health that the vaccination program should be stopped. Iceland has just stopped giving the Moderna vaccine to anyone which is a good step in the right direction. Sweden, Denmark, and Finland have banned the Moderna vaccine for anyone under the age of 30.\n\nVAERS, our vaccine adverse effect reporting system, showed at the beginning of this week 16,000 deaths, 23,000 disabilities, 10,000 MI/myocarditis, 87,000 urgent care visits, 75,000 hospital stays, and 775,000 total adverse events. The VAERS system is widely known to under-report events, with an estimated 90 to 99% of events going unreported there.\n\nEudravigilance, the European reporting system now associates 26,000 deaths in close proximity to administration of the vaccine. Whistleblower data from the CMS system (Medicare charts) showed close to 50,000 deaths in the Medicare group shortly after the vaccine.\n\nAn AI-powered tracking program called Project Salus also follows the Medicare population and shows vaccinated Medicare recipients are having worse outcomes week by week of the type consistent with Antibody Dependent Enhancement. This occurs when the vaccine antibodies actually accelerate the infection leading to worsening COVID-19 infection outcomes. Antibody Dependent Enhancement has occurred previously with trials of other coronavirus vaccines in animals. The CDC and the FDA are suppressing this data and no one who receives the vaccine has true informed consent.\n\nThe Rome declaration has 6,700 medical signatories attesting that the handling of the pandemic amounts to crimes against humanity for denying the best medical treatment and continuing to advocate for harmful vaccines. The evidence is right in front of Americans to end the propaganda and mass mask psychosis.\n\nThe media narrative of perpetual fear is falling apart. Norway, Sweden, and Denmark have ended all COVID restrictions and are doing much better than the US, UK, and Israel, three countries that continue to vaccinate into the pandemic. Mexico, Guatemala, Indonesia, almost all of Africa, and parts of India have low vaccination rates and are doing much better than the US, something attributed to their managing the pandemic by using Ivermectin.\n\nOver 500,000 people attended the Sturgis motorcycle rally in August and there was no super spread of COVID-19. Football season started in August and stadiums around the country are packed with 80,000 fans yelling and screaming with no masks. There have been no superspreader events, yet the students are forced to go back to masking in class. This makes no sense.\n\nIf the vaccine is so important why do our government leaders and illegal aliens not have to take it? Currently, 13 states that are Democratic with high vaccination rates have the highest “case” rates (using a faulty PCR test), while Republican states are all doing better. How does this happen?\n\nIt should be clear that the government has manipulated COVID to create perpetual fear, so we’ll hand it our liberty. In this giant battle between our government and the unvaccinated, I hope enough people will refuse to comply so that we can unite to stop this madness.\n\nI know this decision is very difficult for many people when it comes to losing their job. To the vaccinated, please don’t take any boosters for you’ll just be perpetuating the risk of side effects and new variants.\n\nIf we allow the government to decide this medical decision for us, it is a short step for the government to say it can decide other medical decisions for you, e.g., all persons over 75 never be resuscitated; people may have only three children (or two or one) with mandatory sterilization for women; or refusing the government’s demands will see you denied health care.\n\nIs this the totalitarian state you want to live in? If you are proudly vaccinated now and on the government side, what about the next government mandate, when you’re on the other side, coerced into a decision you don’t want, how will you feel then?", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://trialsitenews.com/vaccinated-vs-unvaccinated-study-shows-viral-load-the-same-in-covid-19-delta-variant-infections/", "https://nationalfile.com/cdc-director-rochelle-walensky-admitted-covid-19-vaccines-cannot-prevent-transmission/", "https://us.newschant.com/health/study-fully-vaccinated-people-with-breakthrough-covid-delta-infections-carry-as-much-virus-as-the-unvaccinated/", "https://www.medrxiv.org/content/10.1101/2021.07.20.21260795v1.full.pdf", "https://citizenfreepress.com/breaking/vermont-76-of-september-covid-deaths-were-fully-vaccinated/", "https://thetruthiswhere.wordpress.com/2021/10/10/why-do-the-protected-need-to-be-protected-from-the-unprotected-by-forcing-the-unprotected-to-use-the-protection-that-didnt-protect-the-protected-in-the-first-place/", "https://noqreport.com/2021/10/07/definitive-study-concludes-vaccines-do-not-prevent-covid-19-and-may-even-enhance-spread/", "https://alexberenson.substack.com/p/all-you-need-to-know-about-vaccine/comments", "https://noqreport.com/2021/09/30/heres-why-the-vaccines-arent-working/", "https://www.republicworld.com/world-news/europe/iceland-halts-use-of-modernas-covid-vaccine-amid-concerns-over-heart-inflammation-risk.html", "https://www.wibw.com/2021/10/07/some-european-countries-suspend-moderna-shots-those-30-under/", "https://vaers.hhs.gov/", "https://int.artloft.co/covid-vaccines-more-than-26000-deaths-and-almost-2-5-million-injuries/", "https://www.lifesitenews.com/news/bombshell-lawsuit-govt-whistleblower-says-coronavirus-vaccine-deaths-at-least-45000/", "https://www.afinalwarning.com/559002.html", "https://www.pbs.org/newshour/science/tthis-chicken-vaccine-makes-virus-dangerous", "https://doctorsandscientistsdeclaration.org/", "https://www.nutritruth.org/single-post/thousands-of-physicians-and-medical-scientists-sign-rome-declaration-in-protest-launch-new-inform", "https://issuesinsights.com/2021/10/08/anyone-notice-where-covid-rates-are-climbing-these-days-hint-not-in-texas-or-florida/", "https://www.britannica.com/topic/one-child-policy", "https://twitter.com/Dontbsquirl/status/1446570450054639616", "https://www.lifezette.com/2021/10/young-man-tells-brutal-truth-on-why-majority-of-black-community-is-hesitant-on-getting-the-jab/", "https://www.americanthinker.com/articles/2021/10/the_unvaccinated_are_looking_smarter_every_week.html"], "authors": [], "publish_date": null}