{"result_id": "176020", "URL": "https://theirishsentinel.com/2022/05/08/study-shows-mrna-in-covid-19-vaccines-enter-liver-cells-and-alter-human-dna/", "timestamp": "2023-04-25 15:42:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2022/05/08/study-shows-mrna-in-covid-19-vaccines-enter-liver-cells-and-alter-human-dna/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Study shows mRNA in COVID-19 vaccines enter liver cells and alter human DNA | The Irish Sentinel", "cleaned_text": "A new study out of Sweden confirms that the mRNA found in the Pfizer COVID-19 vaccine can infiltrate human cells and transcribe its message onto human DNA in under six hours.\n\nThis adds to a growing body of evidence that the vaccine could indeed be altering people’s DNA. For example, a different study from Sweden that was published in October 2021 found that spike protein makes its way into the nuclei of cells and impairs the mechanism they have to repair damaged DNA.\n\nThe cell’s nucleus is its main control center, and it is imperative for it to remain intact. When the vaccines first hit the market, pharmaceutical companies repeatedly insisted that mRNA vaccines did not enter the nucleus or alter DNA.\n\nIn the October study, the researchers concluded: “Our findings reveal a potential molecular mechanism by which the spike protein might impede adaptive immunity and underscore the potential side effects of full-length spike-based vaccines.”\n\nBlocking the action that repairs DNA on a constant basis can cause cell death and the formation of cancer.\n\nFindings like these inspired scientists from Lund University to investigate the effects of the Pfizer jab on human liver cells and determine whether its encoded spike protein RNA can be reverse transcribed onto DNA.\n\nThey found that not only is it possible, but it happens within just six hours. They wrote: “Our study shows that BNT162b2 [Pfizer’s mRNA injection] can be reverse transcribed to DNA in liver cell line Huh7, and this may give rise to the concern if BNT162b2[injection]-derived DNA may be integrated into the host genome and affect the integrity of genomic DNA, which may potentially mediate genotoxic side effects.”\n\nThe study marks the first time researchers have demonstrated in a petri dish how mRNA vaccines are converted into DNA in a human liver cell line – something fact checkers have long claimed could simply not occur.\n\nThe researchers did caution, however, that the findings were observed in petri dishes, and they cannot say for certain if the converted DNA is integrated into cellular DNA in the genomes or what the consequences of that could be.\n\nMore studies are needed to better understand potential effects\n\nOne of the study’s authors, Professor Magnus Rasmussen, said that the attention the study is getting is not surprising, but he believes we need more studies like this.\n\n“We understood that the study would attract attention, but we think it is self-evident that this type of research should be pursued. We have a new vaccine, and it needs to be tested in cell and animal models and also in humans, in various ways. The result might be surprising, but it is also a bit surprising that such studies do not seem to have been carried out before,” he said.\n\nRenowned cardiologist Dr. Peter McCullough said the paper suggests the CDC’s insistence that vaccines do not change the human genome could be “gravely wrong” and believes there should have been monthly safety reports on the vaccines.\n\nHe said: “This is getting into human chromosomes, at least this segment is. If it turns out that the entire code goes into human chromosomes, and if it expresses spike protein within cells—spike protein is an abnormal protein, it is not a human protein— if this protein is expressed within human cells on a regular basis or on demand, and it’s passed from parent cells to daughter cells, and it’s passed to the developing embryo, we’re in trouble.”\n\nWhile we still don’t know if what happened in the study will occur in living organisms or if the DNA converted from the mRNA in the vaccine will integrate with the cell’s genomes, it is certainly something that needs to be explored. The authors said that investigations in whole living organisms, like animals, are needed to better understand the effects of these vaccines.", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://dailyexpose.uk/2022/05/03/study-pfizer-covid-vaccine-alters-dna/", "https://www.lunduniversity.lu.se/home", "https://www.theepochtimes.com/mkt_app/pfizers-covid-19-vaccine-goes-into-liver-cells-and-is-converted-to-dna-study_4307594.html", "https://www.lunduniversity.lu.se/article/qa-covid-19-vaccine-study-gains-attention", "https://vaccines.news/", "https://www.dcclothesline.com/2022/05/07/study-shows-mrna-in-covid-19-vaccines-enter-liver-cells-and-alter-human-dna/"], "authors": [], "publish_date": null}