{"result_id": "176035", "URL": "https://theirishsentinel.com/2022/05/24/mass-die-off-close-to-180000-died-within-60-days-of-covid-19-vaccination-england-statistics-office-makes-stunning-admission/", "timestamp": "2023-04-25 15:43:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2022/05/24/mass-die-off-close-to-180000-died-within-60-days-of-covid-19-vaccination-england-statistics-office-makes-stunning-admission/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Mass die-off: Close to 180,000 died within 60 days of COVID-19 vaccination ­– England statistics office makes stunning admission | The Irish Sentinel", "cleaned_text": "The Office for National Statistics (ONS) in England revealed that a total of 69,466 people died within 28 days and 178,874 people died within 60 days of getting injected with the Wuhan coronavirus (COVID-19) vaccine between January 2021 and March 2022.\n\nONS published the data on deaths by vaccination status on May 16. The report included a chart titled “Number of Deaths within 28 Days of COVID-19 Vaccination in England.”\n\nThe total fatalities were broken down to 7,953 people who died positive for the virus and 61,513 people who expired due to other causes within 28 days of vaccination. During the same timeframe, a total of 14,049 people died from coronavirus and a total of 164,825 people died from other causes within 60 days of vaccination.\n\nThe data was released following dozens of Freedom of Information inquiries made to various government institutions requesting to know the number of people who died after receiving the jabs. (Related: CDC hides COVID data from the public in order to whitewash dishonest COVID narrative.)\n\nMoreover, the U.K. Health Security Agency‘s vaccine surveillance report indicated that 92 percent of all the pandemic-related deaths in England in March were among the vaccinated population.\n\nDr. Norman Fenton, Risk Information Management professor at Queen Mary University of London, criticized the governments around the world for manipulating the COVID-19 pandemic data when he guested on “The Defender Podcast.”\n\n“It was clear from the start that most of the data that governments put out ­– not just the UK government, but most governments around the world ­– were kind of misleading because it was based on very easily manipulated statistics,” Fenton told the host Robert F. Kennedy, Jr.\n\nThroughout the pandemic, Fenton closely examined and criticized how officials used data to make decisions about lockdowns, testing and vaccines.\n\nHe pointed out that there was an immediate rush to draw conclusions, which were sort of based on over-simplistic data on case numbers and deaths. The problem was that data were very easily used by influencers and decision-makers to fit particular narratives that exaggerated the scale of the crisis.\n\nFenton’s team published some of the first research providing more accurate estimates about the infection rate versus the fatality rate compared with official estimates that he said were based on faulty data. The research showed the virus was more widespread than people assumed, but nowhere near as dangerous as was being claimed.\n\nFurther in the show, he also addressed some concerns on the faulty polymerase chain reaction (PCR) tests.\n\n“We were initially led to believe that the PCR test was an accurate diagnostic test. But later, of course, we discovered that wasn’t true. And the impact of that has been catastrophic,” he said.\n\nThe use of PCR tests was also misguided since the tests are inherently fraudulent, and were never intended or designed to function as a diagnostic tool for the disease.\n\nKennedy agreed, saying the the magnitude of the pandemic was enormously and deceptively amplified by the misuse of the PCR test. He added that the information concerning deaths following vaccination also was manipulated as part of the official claim that the vaccine was the only way to keep people from becoming seriously ill and dying.\n\nData adjusted to take into account misclassification shows a peak in mortality shortly after vaccination. “Now, of course, it could well be that these are people who are indeed immunosuppressed seriously. Also, the vaccination might just be bringing forward the death, which would’ve occurred shortly afterward anyway,” Kennedy said.\n\nStill, the fact remains that hundreds of thousands if not millions have died shortly after getting injected with the COVID-19 vaccine.", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/05/19/70k-dead-28-days-covid-vaccination/", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsinvolvingcovid19byvaccinationstatusengland/deathsoccurringbetween1january2021and31march2022", "https://naturalnews.com/2022-02-24-cdc-hides-covid-data-pushes-own-narrative.html", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1066759/Vaccine-surveillance-report-week-13.pdf", "https://www.qmul.ac.uk/", "https://childrenshealthdefense.org/defender/officials-manipulated-covid-data-mathematician-tells-rfk-jr/", "https://twitter.com/LFCNewsMedia/status/1476236664741769218", "https://vaccinedeaths.com/2022-05-22-70k-died-within-28-days-of-covid-vaccination.html"], "authors": [], "publish_date": null}