{"result_id": "176039", "URL": "https://theirishsentinel.com/2022/01/06/ny-times-admits-covid-booster-shots-damage-immunity-leave-body-defenseless-against-virus/", "timestamp": "2023-04-25 15:43:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2022/01/06/ny-times-admits-covid-booster-shots-damage-immunity-leave-body-defenseless-against-virus/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "NY Times admits covid “booster” shots damage immunity, leave body defenseless against virus | The Irish Sentinel", "cleaned_text": "Getting injected with too many “vaccines” from Operation Warp Speed could destroy your immune system, leaving it defenseless against the Wuhan coronavirus (Covid-19).\n\nThe New York Times actually warned about this in a new report concerning Israel’s introduction of a fourth Fauci Flu vaccine. People who roll up their sleeves for yet another “booster” could suffer a form of “immune system fatigue” that makes them more prone to infection.\n\n“Israel is considering whether to approve a fourth Covid-19 vaccine dose for vulnerable people to contain the fast-spreading Omicron variant, despite debate among scientists and a lack of evidence either for or against another booster,” the Times reported.\n\n“The panel of experts advising the Israeli government on the pandemic recognized that uncertainty, but on Tuesday it recommended giving a fourth dose, concluding that the potential benefits outweighed the risks. It pointed to signs of waning immunity a few months after the third shot, and said that any delay in additional doses might prove too late to protect those most at risk.”\n\nToo many shots, though, could compromise the body’s ability to fight off any form of coronavirus, including the new Omicron (Moronic) variant, also known as a common seasonal cold.\n\nOnly a handful of government officials are even talking about this. And when they do, the conversation usually centers around the elderly – meaning young people might still be encouraged to take a fourth (and later a fifth) injection of Donald “father of the vaccine” Trump’s miracle serums.\n\nIsraeli Prime Minister Naftali Bennett is fully on board with the fourth shot plan, even though it will likely lead to yet another “wave” of illnesses and deaths among the fully vaccinated.\n\n“The price will be higher if we don’t vaccinate,” added Dr. Boaz Lev, a member of Bennett’s government advisory panel. “We don’t have a lot of time to make decisions.”\n\nThe plan is one of do the injecting now, and quickly, and ask questions later. As Lev says, there is no time to waste so get those jabs into your arms at warp speed already.\n\nThe U.S. Centers for Disease Control and Prevention (CDC), meanwhile, is quietly warning that the bulk of Moronic variant cases are now occurring in “fully vaccinated” people. The unvaccinated are mostly protected.\n\nThis runs contrary to claims recently made by Trump to Candace Owens about how his Trump Vaccines are perfectly safe and effective always.\n\n“The ones who get very sick and go to the hospital are the ones that don’t take the vaccine,” Trump told Owens after she mentioned how hospitals are now being overloaded with fully vaccinated sick patients.\n\n“And if you take the vaccine,” Trump added, “you’re protected. Look, the results of the vaccine are very good, and if you do get it, it’s a very minor form. People aren’t dying when they take the vaccine.”\n\nIf only Trump could tell that to the hundreds of thousands of people in America who have already died from his injections. Even if he took the time to give his spiel to their gravesites, they still would not be able to hear him – though millions of his still-alive former supporters are hearing him loudly and clearly.\n\n“Trump was playing us and pretending to be against the booster and saying ‘kids shouldn’t take it’ and all that,” pointed out one commenter at National File.\n\n“It wasn’t the first betrayal, not the first time he strung along his base with lip service (lies) and then tried to screw US in order to service other constituencies or short-term interests rather than do the right thing.”\n\nThe latest news about Fauci Flu death injections can be found at Genocide.news.", "opengraph": {}, "tags": ["Culture & Social Engineering", "Latest"], "tweets": [], "movies": [], "links": ["https://nationalfile.com//new-york-times-covid-boosters-may-cause-immune-system-fatigue-compromise-ability-fight-virus/", "https://www.naturalnews.com/2021-12-28-trump-deadly-vax-millions-operation-warp-speed.html", "http://genocide.news/", "https://vaccinewars.com/2022-01-05-ny-times-admits-covid-booster-shots-damage-immunity-leave-body-defenseless-against-virus.html"], "authors": [], "publish_date": null}