{"result_id": "176033", "URL": "https://theirishsentinel.com/2022/08/26/covid-injection-aftermath-study-finds-94-of-vaccine-recipients-have-pre-blood-clot-formations-and-foreign-particles/", "timestamp": "2023-04-25 15:43:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2022/08/26/covid-injection-aftermath-study-finds-94-of-vaccine-recipients-have-pre-blood-clot-formations-and-foreign-particles/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Covid Injection Aftermath: Study finds 94% of “Vaccine” Recipients have Pre-Blood Clot Formations and Foreign Particles | The Irish Sentinel", "cleaned_text": "An Italian study published two weeks ago in the International Journal of Vaccine Theory, Practice, and Research (“IJVTPR”) revealed almost everyone who had been injected had abnormalities after “Covid vaccination.” In 94% of vaccinees’ blood, there was an aggregation of red blood cells and the presence of particles of various shapes and sizes.\n\nThe study began in March 2021. Using dark-field microscopy, the researchers analysed blood samples from 1,006 referred to the Giovannini Biodiagnostic Centre for various disorders after being injected with Pfizer/BioNTech or Moderna mRNA “vaccines.”\n\nThe study authors noted that the “vaccines” are purported to contain at least the spike protein from SARS-CoV-2, but are known also to contain foreign particles that the many promoters of the experimental injections claimed were not in them at all. “Among those foreign components are metallic objects as demonstrated previously in this journal by Lee et al. (2022) which are confirmed in our results.”\n\nOf the 1,006 cases analysed, only 58 – equal to 5.77% of the total – presented a completely normal haematological picture upon microscopic analysis after the last mRNA injection with either the Moderna or Pfizer concoction. The blood of 948 – 94% of the study’s participants – showed aggregation of red blood cells and the presence of particles of various shapes and sizes of unclear origin one month after the mRNA injection.\n\nIn 12 subjects, blood was examined with the same method before vaccination, showing a perfectly normal haematological distribution. The alterations found after the inoculation of the mRNA injections further reinforce the suspicion that the modifications were due to the so-called “vaccines” themselves. We report 4 clinical cases, chosen as representative of the entire case series. Further studies are needed to define the exact nature of the particles found in the blood and to identify possible solutions to the problems they are evidently causing. Benzi Cipelli, R., Giovannini, F., & Pisano, G. (2022). Dark-Field Microscopic Analysis on the Blood of 1,006 Symptomatic Persons After Anti-COVID mRNA Injections from Pfizer/BioNTech or Moderna. International Journal of Vaccine Theory, Practice, and Research, 2(2), 385–444. https://doi.org/10.56098/ijvtpr.v2i2.47\n\nBelow we include some highlights, although the paper contains so many important points it is difficult to select which are the highlights. The paper is written in such a way that those without formal science training can easily understand and it is well worth taking the time to read it in its entirety. For those who wish to delve a little deeper, the reference section at the end of their paper provides further resources.\n\nThe study authors included photographs of the 4 clinical cases which “reveal strange phenomena in their blood and illustrate the range and types of the anomalies found in the microscopic examination of the blood of 94.23% of the 1,006 cases … [these 4 cases are] representative of all 948 cases with peripheral blood alterations.”\n\nWe have included some of these photographs below, the accompanying descriptions are self-explanatory.\n\nDark-Field Microscopic Analysis on the Blood of 1,006 Symptomatic Persons After Anti-COVID mRNA Injections from Pfizer/BioNTech or Moderna, 12 August 2022\n\nDark-Field Microscopic Analysis on the Blood of 1,006 Symptomatic Persons After Anti-COVID mRNA Injections from Pfizer/BioNTech or Moderna, 12 August 2022\n\nDark-Field Microscopic Analysis on the Blood of 1,006 Symptomatic Persons After Anti-COVID mRNA Injections from Pfizer/BioNTech or Moderna, 12 August 2022\n\nDark-Field Microscopic Analysis on the Blood of 1,006 Symptomatic Persons After Anti-COVID mRNA Injections from Pfizer/BioNTech or Moderna, 12 August 2022\n\nDark-Field Microscopic Analysis on the Blood of 1,006 Symptomatic Persons After Anti-COVID mRNA Injections from Pfizer/BioNTech or Moderna, 12 August 2022\n\nIn their discussion and conclusion section, the authors wrote:\n\nAggregation of erythrocytes were highlighted and exogenous point-like and self-luminescent particles in the dark-field were detected. The luminescence of those particles was markedly higher than that of oxygenated red blood cell walls. The 948 cases, showed tubular/fibrous formations and frequently also crystalline and lamellar formations with extremely complex but consistently similar morphologies across all of the patients with abnormal blood samples. Our results are so similar to those of Lee et al. (2022) that it could be claimed that, except for our innovative application of dark-field microscopy to mark the foreign metal-like objects in the blood of mRNA injections from Pfizer or Moderna, we have replicated the blood work of the Korean doctors with a much larger sample. What seems plain enough is that metallic particles resembling graphene oxide and possibly other metallic compounds, like those discovered by Gatti and Montanari (Montanari & Gatti, 2016; Gatti & Montanari, 2012, 2017, 2018), have been included in the cocktail of whatever the manufacturers have seen fit to put in the so-called mRNA “vaccines.” In our experience as clinicians, these mRNA injections are very unlike traditional “vaccines” and their manufacturers need, in our opinions, to come clean about what is in the injections and why it is there. In conclusion, such abrupt changes as we have documented in the peripheral blood profile of 948 patients have never been observed after inoculation by any vaccines in the past according to our clinical experience. The sudden transition, usually at the time of a second mRNA injection, from a state of perfect normalcy to a pathological one, with accompanying haemolysis, visible packing and stacking of red blood cells in conjunction with the formation of gigantic conglomerate foreign structures, some of them appearing as graphene-family super-structures, is unprecedented. In our collective experience, and in our shared professional opinion, the large quantity of particles in the blood of mRNA injection recipients is incompatible with normal blood flow, especially at the level of the capillaries. Benzi Cipelli, R., Giovannini, F., & Pisano, G. (2022). Dark-Field Microscopic Analysis on the Blood of 1,006 Symptomatic Persons After Anti-COVID mRNA Injections from Pfizer/BioNTech or Moderna. International Journal of Vaccine Theory, Practice, and Research, 2(2), 385–444. https://doi.org/10.56098/ijvtpr.v2i2.47", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://ijvtpr.com/index.php/IJVTPR/article/view/47/80", "http://www.biodiagnosticagiovannini.com/", "https://doi.org/10.56098/ijvtpr.v2i2.47", "https://ijvtpr.com/index.php/IJVTPR/article/view/47/80", "https://ijvtpr.com/index.php/IJVTPR/article/view/47/80", "https://ijvtpr.com/index.php/IJVTPR/article/view/47/80", "https://ijvtpr.com/index.php/IJVTPR/article/view/47/80", "https://ijvtpr.com/index.php/IJVTPR/article/view/47/80", "https://ijvtpr.com/index.php/IJVTPR/article/view/37", "https://doi.org/10.1007/978-94-007-2488-4_4", "https://doi.org/10.15406/ijvv.2017.04.00072", "https://doi.org/10.1007/978-3-319-94174-5_13", "https://doi.org/10.56098/ijvtpr.v2i2.47", "https://expose-news.com/2022/08/24/study-reveals-vaccinated-have-blood-abonormalities/"], "authors": [], "publish_date": null}