{"result_id": "176046", "URL": "https://theirishsentinel.com/2022/08/07/wayne-roots-story-is-nearly-impossible-to-explain-if-the-vaccines-are-safe/", "timestamp": "2023-04-25 15:43:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2022/08/07/wayne-roots-story-is-nearly-impossible-to-explain-if-the-vaccines-are-safe/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Wayne Root’s story is nearly IMPOSSIBLE to explain if the vaccines are safe | The Irish Sentinel", "cleaned_text": "Government figures are hard to verify. But personal anecdotes that you hear over and over are hard to ignore. One of the most stunning anecdotes I’ve heard recently is from talk show host Wayne Root.\n\nBut individual anecdotes can be easily verified and can be hard to dispute, especially if there are thousands of reports that are all Black Swans.\n\nEven a single event with just 200 people, where everything is verifiable, is enough to sink the “safe and effective” narrative.\n\nWayne’s anecdote is nearly impossible for a vaccine which the manufacturer has claimed to have fewer serious adverse events than taking a placebo (see the information that Pfizer gave to the FDA shown on page 22).\n\nTo further validate what he observed, I’m launching a survey where you can report your own anecdotes.\n\nThe beauty of my survey is there is no judgment required at all as to the cause of the injury or death! You simply report the number of vaxxed vs. unvaxxed in ANY group you know the stats on (your household, your family, your friends, or some organization you belong to) and the number of injuries/deaths in the two sub-groups. That’s it. Easy peasy.\n\nPlease report your stats here for your household (or family or extended family)\n\nWayne Root reported that 33/200 guests at his wedding who are now sick or dead were all vaccinated. The punchline: at least half his guests were unvaccinated. So that’s unexplainable. He wrote: “It’s important to note, I’m a conservative talk show host who has warned LOUDLY of the dangers of the vaccine since day one. So, my friends are overwhelmingly conservative and unvaccinated too. Yet the few friends I know who did choose to vaccinate are almost all dead or ill.” And he said, “Among my friends and family who are unvaccinated, not one of them has died or been sick since my wedding eight months ago.”\n\nHis article also has a list of 8 injury/death headlines on TMZ and then he points out: “These were all headlines in one day this week!” In other words, it’s not just Wayne seeing this.\n\nHis numbers are from his passive observations in the last 8 months. He never did any outreach or methodical surveys. So there may be some additional deaths and injuries he didn’t report. He isn’t going to proactively research this.\n\nWayne estimates 70% of his 200 guests were unvaccinated, but that’s just a guess.\n\nI think he’s overestimating that. Around 25% of America is unvaxxed. All my liberal friends are vaxxed. So the vax rate for conservatives should be around 50% so I’m going to go with that; it’s probably close enough. It’s conservative. It gives the vaccine the best stats.\n\nSo we have:\n\nHe checked on them 8 months AFTER the wedding and found:\n\nSo what are the chances of that happening by chance if the vaccines are as safe as Pfizer claimed in the clinical trials (they told the FDA it was perfectly safe and that there were fewer serious adverse events than placebo: See page 22)?\n\nIf we go with the populations being the same in terms of health, using a Poisson distribution we find that the injuries (26 vs 0) are a 6 sigma event (you’ll only hear a story like this twice in the entire history of human beings) and the deaths (7 vs 0) are a 2.6 sigma event (less than 1% of the stories).\n\nIn short, Wayne’s anecdote was very unlikely to be just bad luck.\n\nSo if you trust the source of the anecdote (which I do after talking at length with Wayne), it’s virtually certain the vaccines are very unsafe using just this one anecdote alone.\n\nThat is how powerful anecdotes are.\n\nA single verifiable anecdote, without any confounders or biases that could otherwise explain the result, can be extremely powerful.\n\nOf course there are always biases and confounders which is why scientists like randomized controlled trials, but these have their own sets of problems because they can be gamed like the Pfizer and Moderna trials. Pfizer even admitted they defrauded the government in Federal court! So we can’t rely on the Phase 3 trial data.\n\nThere are two major problems with Wayne’s anecdote\n\nWayne’s data has two very serious problems:\n• We can’t verify it without violating people’s privacy. We’d have to contact all 200 people who went to the wedding (who are still alive).\n• Wayne collected the data passively. Because he didn’t do a systematic outreach, he may be missing deaths and injuries (both from vaxxed and unvaxxed)\n\nIf we could remedy the two defects listed above for Wayne’s data, that would be extremely powerful. I’ve talked to Wayne and that’s not going to happen.\n\nOn the other hand, six sigma proof that vaccines are causing harm that anyone could fully verify would be dismissed by the medical community as not being a randomized trial (in which the confidence level is basically 2 sigma). This is nuts, but that’s how they’ve been trained to think.\n\nIf you have a sufficiently large number of verifiable anecdotes such as this one, science says that the hypothesis that the vaccines are a disaster is much more likely than the alternative hypothesis that the vaccines are perfectly safe.\n\nLet’s look at another anecdote.\n• Out of 37 jabbed: 9 were diagnosed with sudden/rapid cancers\n• Out of 25 unjabbed: 0 were diagnosed with sudden/rapid cancers\n\nAgain, a very troubling anecdote, directionally consistent with the first one.\n\nLet’s say this cardiologist is an outlier and the rate is 1 per month on average. That would be 10,000 kids per month injured. Even if we are off by a factor of 100x too high, this should be a stopping condition for the vaccine.\n\nCardiologists aren’t speaking out about this because they don’t want to lose their license. They aren’t even telling other cardiologists.\n\nI hear very disturbing anecdotes all the time. One very disturbing anecdote (3 relatives who died a week after the vaccine), followed a week later with a second unlikely anecdote (heart attack 2 minutes after the vaccine and in pain since then) was enough to red-pill me and start me down the path of looking a larger datasets in detail (like VAERS) which further confirmed my suspicions.\n\nBut to make this really compelling, we need to create a list of these. We may find a single compelling anecdote that can be verified. Or we may find lots of 3 to 6 sigma anecdotes.", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2022/07/wayne-root-33-dead-sick-friends-since-wedding-8-months-ago-33-vaxxed-vaccine-death-disease-cluster/", "https://www.fda.gov/media/151733/download", "https://airtable.com/shreRbKPx1DmwEVQr", "https://airtable.com/shreRbKPx1DmwEVQr", "https://www.thegatewaypundit.com/2022/07/wayne-root-33-dead-sick-friends-since-wedding-8-months-ago-33-vaxxed-vaccine-death-disease-cluster/", "https://www.fda.gov/media/151733/download", "https://stevekirsch.substack.com/p/pfizer-phase-3-clinical-trial-fraud", "https://stevekirsch.substack.com/p/pfizer-admits-to-fraud-in-court", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F72204064-dee4-4398-8833-f4c7571d9113_1376x635.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff3c9b231-4de7-477d-9eed-78d67441a475_1326x959.png", "https://stevekirsch.substack.com/p/wayne-roots-story-is-nearly-impossible"], "authors": [], "publish_date": null}