{"result_id": "176034", "URL": "https://theirishsentinel.com/2022/02/20/study-finds-heart-inflammation-risk-133x-greater-for-teenage-boys-after-pfizers-covid-shot/", "timestamp": "2023-04-25 15:43:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://theirishsentinel.com/wp-content/uploads/2022/03/cropped-man-sentinel-32x32.jpg", "canonical": "https://theirishsentinel.com/2022/02/20/study-finds-heart-inflammation-risk-133x-greater-for-teenage-boys-after-pfizers-covid-shot/", "encoding": "UTF-8"}, "image": null, "domain": "theirishsentinel.com", "title": "Study finds heart inflammation risk 133x greater for teenage boys after Pfizer’s COVID shot | The Irish Sentinel", "cleaned_text": "A CDC study found that myocarditis skyrocketed in men 12-24 years old after mRNA COVID vaccination.\n\nPfizer’s COVID-19 shot is associated with a 133-times greater risk of heart inflammation for teenage boys, according to a new study in the Journal of the American Medical Association (JAMA).\n\nThe study, published last month by researchers with the U.S. Centers for Disease Control and Prevention (CDC), found that myocarditis skyrocketed in men between 12 to 24 years old after both Pfizer’s and Moderna’s mRNA COVID jabs, Israel National News reported.\n\nMyocarditis is a type of heart inflammation that has repeatedly been linked to COVID vaccines. The study authors noted that the condition can be serious and can lead to heart failure and death.\n\nThe researchers said that “the risk of myocarditis after receiving mRNA-based COVID-19 vaccines was increased across multiple age and sex strata,” but that the disease particularly impacts young men. Eighty-two percent of myocarditis cases examined in the study were in males, and the median age of patients was 21. The vast majority of cases – 82 percent – followed a second shot.\n\nThe risk was highest after Pfizer vaccination. Boys between 12 and 15 years old had a myocarditis rate of 70.7 cases of per million Pfizer doses – 133 times higher than the background rate of .53 per million, according to the study. For young men ages 16 to 17, the rate was 106 cases per million doses, a 79-times increase from the baseline risk of 1.34 cases per million doses.\n\nThe myocarditis rate in men between 18 and 24 years old was 52.4 cases per million Pfizer shots and 56.3 per million Moderna doses. The background rate was just 1.76 per million doses.\n\nThe study analyzed data from the Vaccine Adverse Event Reporting System (VAERS), a vaccine injury tracking system managed by the CDC and U.S. Food and Drug Administration (FDA), from December 2020 to August 2021. Out of 1,991 VAERS reports of myocarditis after COVID-19 vaccination, 1,626 met the CDC’s case definition, according to the researchers.\n\nThe most common symptoms included abnormal ECG or cardiac MRI results (72 percent) and chest pain or discomfort (89 percent). Around 30 percent of patients also reported shortness of breath, and 9 percent had heart palpitations. Symptoms typically developed within two days of inoculation, the authors said.\n\nNinety-six percent of patients were hospitalized, and 13 percent continued to have symptoms after being discharged from the hospital.\n\nThe myocarditis cases are most likely underestimated, the CDC study emphasized. VAERS is a passive surveillance system, and research shows that it significantly undercounts vaccine injuries.\n\nOther recent studies have found even greater COVID vaccine-related heart inflammation risks for young men. A November article from Hong Kong estimated that one in 2,680 boys between 12-17 years old will develop the condition within two weeks of a second Pfizer dose.", "opengraph": {}, "tags": ["Latest", "Health and Welfare"], "tweets": [], "movies": [], "links": ["https://jamanetwork.com/journals/jama/fullarticle/2788346", "https://www.israelnationalnews.com/news/321238", "https://www.lifesitenews.com/news/belgium-halts-moderna-vaccine-for-young-people-over-heart-inflammation-risks/?utm_source=top_news&utm_campaign=usa", "https://www.lifesitenews.com/news/experts-warn-of-covid-vaccine-risks-at-fda-hearing-the-vaccines-kill-more-than-they-save/", "https://academic.oup.com/cid/advance-article-abstract/doi/10.1093/cid/ciab989/6445179?redirectedFrom=fulltext", "https://www.lifesitenews.com/news/study-finds-133x-risk-of-heart-inflammation-after-pfizer-covid-19-shot-in-teenage-boys/"], "authors": [], "publish_date": null}