{"result_id": "177016", "URL": "https://www.israel365news.com/200037/israeli-study-pfizer-vaccine-wears-off-after-six-months/", "timestamp": "2023-04-25 15:43:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/348891/israeli-study-pfizer-vaccine-wears-off-after-six-months/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israeli study: Pfizer vaccine wears off after six months", "cleaned_text": "The Pfizer-BioNTech COVID-19 vaccine loses considerable effectiveness six months after the second dose, according to new Israeli research published in the New England Journal of Medicine.\n\nThe study echoes findings published by Pfizer and Kaiser Permanente in Lancet earlier in the week, showing the vaccine’s effectiveness drops from 88 to 47 percent after six months. This study also proved the vaccine 90 percent effective for at least six months at preventing hospitalization of infected people.\n\nThe Israeli study involved more than 4,800 fully vaccinated healthcare workers. From Dec, 19, 2020, to July 9, 2021, their antibody response was tested monthly. The researchers found a significant waning of immune responses—especially among men, people over 65 and immunosuppressed people.\n\n“The decrease in neutralizing antibody titers was brisk initially, in the period of up to 70 to 80 days, but slowed thereafter,” according to the study.\n\nThe researchers noted a “striking difference” between vaccinated people and recovered COVID-19 patients: “Overall, the accumulating evidence from our study and others show that long-term humoral [immune] response and vaccine effectiveness in previously infected persons is superior to that in recipients of two doses of vaccine.”\n\nThis may explain the substantially lower incidence of breakthrough infection among previously infected persons than among vaccinated persons.\n\nThe study’s lead author, Dr. Gili Regev Yochay, chief of infectious disease epidemiology at Sheba Medical Center, said the new study was one of three that contributed to the Israeli government’s world-first decision to administer a third (booster) shot to citizens that had been fully vaccinated at least five months before.\n\n“We have shown in our previous work in the New England Journal of Medicine that there is a correlation between neutralizing antibodies and breakthrough infection,” she said.\n\nThe third study that influenced the decision to administer boosters relied on Israeli Health Ministry data indicating a decrease in vaccine effectiveness over six months.\n\nThe researchers also created a predictive model to assess the likelihood of different morbidity levels in various subpopulations. This could help health practitioners make decisions about specific patients.\n\nNow, said Regev Yochay, Israeli and international scientists are working to quantify the threshold of antibodies required to protect from SARS-CoV-2 infection, from severe COVID-19, and from death due to the disease.\n\n“After we learn the threshold of antibodies, the large table of probabilities we are publishing will help predict what is the right preventive measure for the different subpopulations,” she concluded in a statement to the press.", "opengraph": {"locale": "en_US", "type": "article", "title": "Israeli study: Pfizer vaccine wears off after six months", "description": "Published in the “New England Journal of Medicine,” the researchers found a significant waning of immune responses—especially among men, people over 65 and immunosuppressed people.", "url": "https://www.israel365news.com/348891/israeli-study-pfizer-vaccine-wears-off-after-six-months/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-10-08T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/F210214DC78-2-880x495-1.jpg", "image:width": "880", "image:height": "495", "image:type": "image/jpeg"}, "tags": ["Coronavirus"], "tweets": [], "movies": [], "links": ["https://www.israel21c.org/israel-first-to-offer-covid-vaccine-booster-to-ages-50/", "https://www.israel21c.org/israeli-study-suggests-booster-vaccine-highly-effective/"], "authors": ["JNS"], "publish_date": "2021-10-08T00:00:00+00:00"}