{"result_id": "177030", "URL": "https://www.israel365news.com/355045/israel-to-get-new-covid-vaccines-designed-to-prevent-variants/", "timestamp": "2023-04-25 15:44:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/355045/israel-to-get-new-covid-vaccines-designed-to-prevent-variants/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israel to get new Covid vaccines designed to prevent variants", "cleaned_text": "Israel has ordered 2nd-generation covid vaccines. The shots have been updated to better prevent new variants. They are scheduled to be available in clinics by the end of September, TOI reports.\n\nIsrael’s Covid czar Salman Zarka said on Wednesday that a consignment of the new vaccines arrived the previous day. However, he did not specify how many of the new shots were received from Pfizer.\n\nZarka estimates the shots will be available in clinics by the end of the month.\n\nHe did not say if everyone will be provided access to the new shots simultaneously or if priority groups, such as geriatrics will be given priority.\n\n“The vaccines have already landed in Israel, and in the coming days they will be delivered to healthcare providers, and we’ll be able to get started and administer them,” Zarka said.\n\nHe added that they are “very very much recommended” for anyone at-risk as well as for medical professionals. They will also be availaled to the general public.\n\nThe new shots, tailored to Omicron but also designed to protect against other variants.\n\nHead of Bar Ilan University’s immunology lab Cyrille Cohen told The TOI: ”We are receiving the first update to vaccines after two years, which is exciting, but we are still missing data regarding the real-life effectiveness of the new shots.”\n\nCohen, emphasized that the effectiveness of the innoculations shouldn’t be judged based on infection levels. Rather, they should be judged on cases of serious illness. According to the extremely limited research that currently exists, which mainly relies on mouse model studies as well as in-vitro observation. Although he doesn’t anticipate reduced infection rates, he believes that they “may well help to enhance protection against severe disease.”\n\n“For this reason, they are most important for vulnerable and old populations, people with co-morbidities, or for the immunosuppressed,” Cohen said.\n\nHe said that the rational in promoting the new vaccines is that data has demonstrated that boosters provide added protection.\n\nThe latest vaccine rollout comes on the heels of a Tel Aviv conference involving 53 member states in the World Health Organization (WHO) European Region, which will convene for the 72nd session of the WHO’s Regional Committee for Europe.\n\nThis year’s session will be the first in-person conference since the novel coronavirus outbreak. The convention will focus on priority health areas that the WHO’s European offices will spotlight, including empowerment through digital health, health promotion through behavioral and cultural insights, addressing health worker shortages, and access to affordable medicines.", "opengraph": {"locale": "en_US", "type": "article", "title": "Israel to get new Covid vaccines designed to prevent variants", "description": "He did not say if everyone will be provided access to the new shots simultaneously or if priority groups, such as geriatrics will be given priority.", "url": "https://www.israel365news.com/355045/israel-to-get-new-covid-vaccines-designed-to-prevent-variants/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2022-09-15T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/vaccinated-israel.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Medical/Science", "noads"], "tweets": [], "movies": [], "links": ["https://www.timesofisrael.com/israelis-to-start-getting-new-variant-tailored-shots-by-end-of-month-covid-czar/", "https://www.www.israel365news.com/274782/idf-officer-killed-in-ongoing-violence/", "https://www.who.int/europe/news-room/events/item/2022/09/14/default-calendar/who-europe-press-briefing-from-tel-aviv--israel"], "authors": ["David Sidman"], "publish_date": "2022-09-15T00:00:00+00:00"}