{"result_id": "177036", "URL": "https://www.israel365news.com/160800/netanyahu-removes-bureaucratic-hurdles-to-bring-covid-vaccine-to-israel/", "timestamp": "2023-04-25 15:44:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/341824/netanyahu-removes-bureaucratic-hurdles-to-bring-covid-vaccine-to-israel/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Netanyahu removes 'Bureaucratic Hurdles' to bring Covid Vaccine to Israel", "cleaned_text": "“Significant progress” was made late Wednesday night in removing bureaucratic impediments to signing a deal with pharmaceutical giant Pfizer to enable the import of the coronavirus vaccine to Israel, the Prime Minister’s Office stated on Thursday.\n\nIsraeli Prime Minister Benjamin Netanyahu spoke on the phone with Pfizer Chairman and CEO Albert Bourla at 2 a.m. to iron out details of an agreement. To this end, he included Deputy Attorney General Roi Sheindorf and Pfizer’s legal adviser in the call.\n\nThe upshot of the conference call, the PMO said, is that a deal between the State of Israel and Pfizer will be signed in the coming days.\n\nThe news comes on the heels of Pfizer’s announcement on Monday that its COVID-19 vaccine has a 90 percent efficacy rate—which Netanyahu referred to as “an important day in the global struggle against coronavirus.”\n\nSeveral other companies were making progress toward a vaccine, he said, including Israel, but still required more time.\n\nNevertheless, he added, “0ne thing is clear. Not long from today—it will not be years but months—there will be vaccines that will be available for the population of the world. My goal at the moment is to do one thing—bring vaccines to you, citizens of Israel, and we will do so. This means that the end is in view. I said a few days ago that I see light at the end of the tunnel. I think that train is already exiting the tunnel.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Netanyahu removes 'Bureaucratic Hurdles' to bring Covid Vaccine to Israel", "description": "Prime Minister Benjamin Netanyahu says he’s removed bureaucratic impediments to inking a deal with pharmaceutical giant Pfizer.", "url": "https://www.israel365news.com/341824/netanyahu-removes-bureaucratic-hurdles-to-bring-covid-vaccine-to-israel/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2020-11-12T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/F200402YS31-1-880x495-1.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Coronavirus"], "tweets": [], "movies": [], "links": [], "authors": ["JNS"], "publish_date": "2020-11-12T00:00:00+00:00"}