{"result_id": "177029", "URL": "https://www.israel365news.com/188137/pfizer-and-fake-news-opinion/", "timestamp": "2023-04-25 15:44:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/344389/pfizer-and-fake-news-opinion/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Pfizer and Fake News", "cleaned_text": "Pfizer CEO Albert Bourla was scheduled to arrive in Israel on Monday to meet with Prime Minister Benjamin Netanyahu and other officials. One ostensible purpose of the visit—slated to coincide with the completion of the delivery of 10 million doses of BioNTech—was to examine the possibility of Pfizer building a vaccine-production plant and R&D center in Israel.\n\nOn Thursday, however, Pfizer announced that it was postponing the trip. According to the pharmaceutical giant, Bourla and the members of his team who were part of his entourage are not yet fully vaccinated.\n\nCertain Hebrew news sites pounced on this detail for the click-bait effect. Take Ynet, for instance. Rather than opt for the “cobbler’s kids wear no shoes” angle, the online version of the widely popular daily, Yediot Achronot, highlighted misleading keywords to suggest that the folks at Pfizer weren’t taking any chances with their health by subjecting themselves to their own concoction—the one that they’ve been pushing on the rest of the world.\n\nThe ploy initially worked. The item in question, shared on social media by people who clearly hadn’t read past the headline, began to circulate. Anti-coronavirus-vaxxers couldn’t have been happier or felt more vindicated.\n\nOne Facebook user recounted overhearing two women in line at an ATM in Jerusalem talking about the “two Bs, Bourla and Bibi” exploiting the naivete of the Israeli public to “conduct experiments on us.” To add weight to their belief that the vaccine is unsafe at best and a global conspiracy at worst, the interlocutors pointed to Bourla’s “refusal” to be inoculated.\n\nIn keeping with the wise saying that “a little knowledge is a dangerous thing,” these ladies, like fellow skeptics, didn’t bother to widen their horizons beyond rumor. Had they even done a perfunctory Google search, they would have realized that in December, soon after the first shipment of vaccines landed at Tel Aviv’s Ben-Gurion International Airport, Bourla explained that he and other Pfizer executives were not going to “cut in line” to receive the shots.\n\nAt the age of 59 and in good physical condition, he said, he planned to wait his turn based on the criteria determined by the state of his residence.\n\nIn other words, he decided not to use his clout as the head of the company to be given special treatment. As a result, he got his jab less than three weeks ago and is waiting for his second. For his admirable stance to be used against him is both shameful and par for the course where the press—particularly that which would like to see an end to the Netanyahu era—is concerned.\n\nThis brings us to the next bit of hype surrounding Pfizer’s cancelation. Having milked disingenuousness for all it was worth, local media outlets have begun to focus on the other “juicy” aspect of the story: that Bourla was warned that “aiding and abetting” Netanyahu’s election campaign could get him in hot water.\n\nThe move to keep Bourla from coming began in mid-February, when a couple of “anybody but Bibi” academics directly urged the CEO not only to postpone his trip until after the election, but to refrain even from making “statements about new Pfizer initiatives in Israel.”\n\nYou know, otherwise, Netanyahu might take deserved credit for purchasing the vaccines early, above cost, and conducting the world’s most successful inoculation drive. Heaven forbid he reminds voters of that accomplishment.\n\n“[O]ur coming election is so incredibly critical that I find myself gasping for breath, day and night,” Weizmann Institute computer scientist and Israel Prize laureate David Harel wrote to Bourla.\n\nSuch a visit, he argued, could “turn out to be a disastrous contribution to the destruction of Israel as a democracy, and indeed as the startup nation, with great contributions to science, medicine and technology.”\n\nNo wonder Haaretz gleefully served as a mouthpiece for the missive.\n\nThen there’s the anti-Netanyahu Achrayut Leumit (“national responsibility”) movement, which launched a full-frontal assault on Bourla’s visit. The insignificant group’s so-called important contribution to the cancelation was the basis for two differing reports on the issue.\n\nAccording to one, Achrayut Leumit CEO Oshi Elmaliach sent a letter last Wednesday to Bourla, Netanyahu and State Comptroller Matanyahu Englman, in which he stated that a photo-op with the prime minister at this time constitutes “election propaganda” and is therefore a criminal offense.\n\nThe other report claimed that Elmaliach appealed to Attorney General Avichai Mandelblit to intervene—and that the latter conveyed his concerns about “prohibited election propaganda” to Netanyahu and Health Minister Yuli Edelstein.\n\nThankfully, Bourla isn’t playing along with the Israeli media’s message, which is that Netanyahu has made cynical use of a vaccine whose effects aren’t fully known in order to curry favor with the electorate. He has faith in the product, which—as he told CNBC in December—“was developed without cutting corners from a company with 171 years of credentials … a vaccine developed in the spotlight, in the daylight, with all the data being put in a server.”\n\nNor is he revealing the real reason for his postponement, which might actually boil down to genuine inconvenience. Fake news aside, Pfizer told Business Insider on Saturday: “We remain interested in meeting the scientific leaders and other important stakeholders who were vital to the successful COVID-19 vaccination program in Israel. Any company visit will likely occur once travel conditions improve and COVID-19-related restrictions are eased.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer and Fake News", "description": "Thankfully, the pharmaceutical giant’s CEO, Albert Bourla, isn’t playing along with the media’s message about Israeli Prime Minister Benjamin Netanyahu.", "url": "https://www.israel365news.com/344389/pfizer-and-fake-news-opinion/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-03-11T00:00:00+00:00", "article:modified_time": "2022-11-02T12:53:09+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_1852262386.png", "image:width": "660", "image:height": "330", "image:type": "image/png"}, "tags": ["Opinion", "Covid-19", "Israel", "Benjamin Netanyahu", "Pfizer"], "tweets": [], "movies": [], "links": ["https://www.jns.org/first-shipment-of-pfizer-covid-19-vaccine-lands-at-ben-gurion-international-airport/", "https://www.breakingisraelnews.com/sign-up-here/#fI26J4dDCSKsIZ6i.97", "https://www.jns.org/israel-to-pay-more-than-237-5-million-for-potential-pfizer-covid-vaccine/", "https://www.jns.org/opinion/why-israel-leads-the-world-in-vaccinating-its-population/", "https://www.jns.org/opinion/pfizer-and-fake-news/"], "authors": ["RUTHIE BLUM"], "publish_date": "2021-03-11T00:00:00+00:00"}