{"result_id": "177025", "URL": "https://www.israel365news.com/164020/israel-explores-plan-to-provide-free-vaccines-to-holocaust-survivors-worldwide/", "timestamp": "2023-04-25 15:43:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/343241/israel-explores-plan-to-provide-free-vaccines-to-holocaust-survivors-worldwide/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israel explores plan to provide free vaccines to Holocaust survivors worldwide", "cleaned_text": "Israeli Diaspora Affairs Minister Omer Yankelevich announced on Tuesday the launch of an extensive operation to vaccinate Holocaust survivors around the world against COVID-19.\n\nThe Israeli Cabinet minister directed Shalom Corps, the international youth service non-profit, to convene and coordinate partners around this effort. This project will ensure that all Holocaust survivors around the world are vaccinated and provided proper guidance and support.\n\nThe initial plan is to establish inoculation centers in designated countries, according to a statement from the ministry. Medical personnel and volunteers will travel directly to the residence of recipients to perform the vaccination. There will be no charge to any survivor for this service.\n\n“During this global crisis, we have an opportunity to support Holocaust survivors whose resilience continues to guide and inspire humanity today,” said Yankelevich. “It is our collective obligation to safeguard this treasured yet vulnerable population in the spirit of mutual responsibility.”\n\nIsraeli Diaspora Affairs Minister Omer Yankelevich, Aug. 5, 2019. Photo by Yonatan Sindel/Flash90.\n\n Yankelevich, an attorney, educator, social activist and politician for the Blue and White Party, has been a member of the Knesset since 2019. She made history as the first Haredi woman to serve as a Cabinet minister. This past November, she visited Los Angeles for a 72-hour trip for meetings on college campuses, including the University of Southern California, and with officials from the Simon Wiesenthal Center and the Anti-Defamation League.\n\nShe told Jewish Insider following the trip that she wanted to create a “global Jewish education hub” for Jews around the world who have been impacted by COVID-19.\n\nAs of now, there is no definite plan to finance and manage the vaccination project, including the involvement of Jewish philanthropic networks. Solutions for other expected hurdles, such as obtaining permits from foreign governments and the purchase of vaccines by the ministry, are also being examined. The statement also notes that vaccines for this initiative will be acquired separately and in addition to Israel’s current supply.\n\nThere are approximately 190,000 Holocaust survivors in Israel and 130,000 more around the world. The Israeli Health Ministry told Reuters on Jan. 10 that 19.5 percent of the Israeli population has been vaccinated, “including more than 72 percent of the over-60s.”\n\nThe Holocaust Survivors Vaccination Operation will be administered through Shalom Corps and will operate globally. Shalom Corps is active in several fields including education, agriculture, teen leadership development, health and female empowerment. Founded as a joint initiative of the Diaspora Affairs Ministry, the Jewish Agency and private donors, Shalom Corps reaches thousands of Jewish volunteers worldwide.\n\nWhile Yankelevich hasn’t been able to meet with the Jewish diaspora due to the pandemic, she is hoping she can partner with Jewish institutions from every city internationally to provide aid to Holocaust survivors in each community.\n\n“Now is the time for all of us, Jewish institutions and leaders from across the world, to come together in this operation,” she said. “Together, we can ensure that Holocaust survivors are efficiently vaccinated, wherever they live.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Israel explores plan to provide free vaccines to Holocaust survivors worldwide", "description": "“It is our collective obligation to safeguard this treasured yet vulnerable population in the spirit of mutual responsibility,” says Israeli Diaspora Affairs Minister Omer Yankelevich.", "url": "https://www.israel365news.com/343241/israel-explores-plan-to-provide-free-vaccines-to-holocaust-survivors-worldwide/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-01-13T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/mira-1.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Holocaust", "noads"], "tweets": [], "movies": [], "links": [], "authors": ["JNS"], "publish_date": "2021-01-13T00:00:00+00:00"}