{"result_id": "177018", "URL": "https://www.israel365news.com/344620/pfizer-vaccine-moderately-less-effective-against-much-less-common-south-african-variant-but-powerfully-protestive-against-original-covid-19-strain-and-british-variant-according-to-beersheba-researche/", "timestamp": "2023-04-25 15:43:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/344620/pfizer-vaccine-moderately-less-effective-against-much-less-common-south-african-variant-but-powerfully-protestive-against-original-covid-19-strain-and-british-variant-according-to-beersheba-researche/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Pfizer Vaccine Moderately Less Effective Against Much-Less-Common South African Variant but Powerfully Protective Against Original COVID-19 Strain and British Variant, According to Beersheba Researchers", "cleaned_text": "The Pfizer vaccine that has been given to over five million Israelis so far neutralizes the common British variant of the disease and the original SARS-CoV-2 strain very well, according to a new vaccine study conducted by scientists at Ben-Gurion University (BGU) of the Negev in Beersheba. Vaccination provides higher protection against SARS-CoV-2 infection compared to protection observed in recovered Covid-19 patients.\n\nHowever, the Pfizer vaccine is “moderately less effective” against the much-less common South African variant. Fortunately, there is no evidence that the South Africa variant causes more serious illness for the vast majority of people who become infected and it has infected only a very small minority of people in Israel and in most other countries.\n\nTheir findings were published this week in the prestigious journal Cell Host & Microbe under the title “SARS CoV-2 spike variants exhibit differential infectivity and neutralization resistance to convalescent or post-vaccination sera.”\n\nThe scientists looked at the effectiveness of the vaccine against the original viral strain, as well as the British and the South African variants, plus strains that harbor combined changes in the viral spike. They are continuing to test other circulating variants as they constantly emerge with the hope to identify potentially risky mutations that can compromise the vaccine.\n\nTheir findings indicate that the Pfizer vaccine is effective against the original SARS-CoV-2 strain and the British variant, but provides weakened protection against the South African variant and the combined British-South African variants. “Our findings show that future variants could necessitate a modified vaccine as the virus mutates to increase its infectivity,” said principal investigator Prof. Ran Taube of BGU’s department of microbiology, immunology and genetics in the Faculty of Health Sciences.\n\nTaube and his team also compared neutralizing antibody levels following the administration of one and two doses of the vaccine, compared to levels in patients who have recovered from Covid-19. They found that vaccination provided optimal levels of protection, when compared to the lower levels of protection that were observed in recovered patients.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer Vaccine Moderately Less Effective Against Much-Less-Common South African Variant but Powerfully Protective Against Original COVID-19 Strain and British Variant, According to Beersheba Researchers", "description": "Their findings were published this week in the prestigious journal Cell Host & Microbe under the title “SARS CoV-2 spike variants exhibit differential infectivity and neutralization resistance to convalescent or post-vaccination sera.” ", "url": "https://www.israel365news.com/344620/pfizer-vaccine-moderately-less-effective-against-much-less-common-south-african-variant-but-powerfully-protestive-against-original-covid-19-strain-and-british-variant-according-to-beersheba-researche/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-03-22T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_1852262386.png", "image:width": "660", "image:height": "330", "image:type": "image/png"}, "tags": ["Medical/Science"], "tweets": [], "movies": [], "links": [], "authors": ["Judy Siegel-Itzkovich"], "publish_date": "2021-03-22T00:00:00+00:00"}