{"result_id": "177005", "URL": "https://www.israel365news.com/347766/bennett-stirs-controversy-after-calling-on-israel-to-violate-sabbath-for-covid-vaccine/", "timestamp": "2023-04-25 15:43:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/347766/bennett-stirs-controversy-after-calling-on-israel-to-violate-sabbath-for-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Bennett stirs controversy after calling on Israel to violate Sabbath for Covid vaccine", "cleaned_text": "On Friday afternoon, Israeli Prime Minister Naftali Bennett instructed health officials to intensify their efforts to provide a third dose of the Pfizer vaccine to the elderly even if it meant operating 24 hours a day, seven days a week, and even in violation of Shabbat. Bennett communicated this statement to CEOs of Clalit Health Services (Eli Cohen), Leumit Health Care Services (Haim Fernandes), Meuhedet Health Services (Sigal Regev Rosenberg), and Maccabi Healthcare Services (Sigal Dadon).\n\nGiving an injection on Shabbat is prohibited. That’s because even an intermuscular injection may cause bleeding which is one of the 39 acts forbidden on the Sabbath. In addition, many of the surrounding actions necessary, such as operating a computer or writing, are also forbidden for Jews to perform. Squeezing liquid from a cloth, which is part of the process of disinfecting before and after the injection, is also forbidden. In addition, it is assumed that the patients and the health workers will need to travel to the vaccination station which is also a forbidden act.\n\nAs head of the Machon Mada’i Technology Al Pi Halacha (the Institute for Science and Technology According to Jewish Law), Rabbi Moshe Avraham Halperin is called upon to make rulings based on Torah law concerning medical ethics and procedures. Rabbi Halperin emphasized that it is permissible, actually required to profane the Sabbath, setting aside all of the restrictions, in order to save a life. This falls under the principle of pikuach nefesh (saving a soul) which states that that the preservation of human life overrides virtually any other religious rule. When a person’s life is in danger, almost any negative commandment of the Torah becomes null and void. This precept is based on a verse in Leviticus:\n\n“Earlier in the pandemic, the institute carried out an intensive study on this issue and ruled that it is forbidden to be vaccinated on Shabbat except in the most extreme cases,” Rabbi Halperin said. “For example, if a health worker’s services are desperately needed he may get vaccinated on Shabbat.”’\n\n“This is not pikuach nefesh which is only allowed when there is a clear and present danger to life. In the case of COVID, the danger is only a possibility. If there was a reason to believe the danger was more than just a possibility of random infection, the person should be isolated or taken directly to the hospital. Even the government and the health authorities do not operate on the principle that the vaccines are pikuach nefesh as they schedule appointments to get vaccinated. If they were that convinces it was life-threatening, every vaccine would be given immediately.”\n\n“In order to make a statement like this which has dire religious consequences, Bennett must have a reliable rabbinic authority to rely upon,” Rabbi Halperin said. “Unfortunately, we have already seen that Bennett has mixed political issues and Torah to the detriment of the Torah.”\n\n“Torah law deals with real-world matters and the Torah is a living Torah. Torah law deals extensively with medical ethics and the rabbinic authorities have yet to endanger anyone’s life.”\n\nEarlier this month, Bennett stated publicly that not getting vaccinated was like randomly firing an automatic weapon in the street.\n\n“When you don’t get vaccinated, you’re endangering yourself, you’re endangering those around you, and it’s life-threatening,” he said. “It’s as if you’re walking around with a machine gun firing Delta variants at people.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Bennett stirs controversy after calling on Israel to violate Sabbath for Covid vaccine", "description": "Israeli Prime Minister Naftali Bennett instructed health officials to intensify their efforts to provide a third dose of the Pfizer vaccine to the elderly even if it meant operating 24 hours a day, seven days a week, and even in violation of Shabbat", "url": "https://www.israel365news.com/347766/bennett-stirs-controversy-after-calling-on-israel-to-violate-sabbath-for-covid-vaccine/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:author": "https://www.facebook.com/adameliyahu", "article:published_time": "2021-08-15T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/bennett-mask-1.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Biblical News"], "tweets": [], "movies": [], "links": ["https://www.www.israel365news.com/83976/genetic-engineering-recreating-sin-noahs-generation/", "https://theisraelbible.com/bible/leviticus-18/"], "authors": ["Adam Eliyahu Berkowitz"], "publish_date": "2021-08-15T00:00:00+00:00"}