{"result_id": "177014", "URL": "https://www.israel365news.com/350885/tech-leader-pope-francis-a-jewish-agent-sent-to-instill-global-dictatorship-via-covid-vaccines/", "timestamp": "2023-04-25 15:43:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/350885/tech-leader-pope-francis-a-jewish-agent-sent-to-instill-global-dictatorship-via-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Tech leader: Pope Francis a \"Jewish agent\" sent to instill global dictatorship via Covid vaccines", "cleaned_text": "The pope’s pro-vaccine policy has led to some bizarre theories concerning his motives.\n\nDave Bateman, co-founder of property management software brand Entrata and major GOP donor launched in 2003, sent out a mass e-mail on Tuesday stating his belief that Pope Francis was secretly a Jewish agent installed to help distribute the COVID-19 vaccine around the world in an effort to create “totalitarian rule.”\n\n“I write this email knowing that many of you will think I’m crazy after reading it,” Bateman began. “I believe there is a sadistic effort underway to euthanize the American people. It’s obvious now. It’s undeniable, yet no one is doing anything. Everyone is discounting their own judgment and dismissing their intuition. I believe the Jews are behind this.”\n\n“For 300 years the Jews have been trying to infiltrate the Catholic Church and place a Jew covertly at the top,” Bateman wrote. “It happened in 2013 with Pope Francis. I believe the pandemic and systematic extermination of billions of people will lead to an effort to consolidate all the countries in the world under a single flag with totalitarian rule.”\n\nBateman also stated his belief that PCR diagnostic tests are carcinogenic and urged recipients to not get vaccinated.\n\n“I know, it sounds bonkers. No one is reporting on it, but the Hasidic Jews in the US instituted a law for their people that they are not to be vaccinated for any reason.”\n\nCurrent Entrata CEO Adam Edmunds posted a response to Bateman’s email on his Twitter account Tuesday afternoon.\n\n“Earlier today Dave Bateman, one of our founders, made several highly offensive statements in an email to recipients outside the company,” Edmunds wrote. “The opinions expressed by Dave were his alone, and do not reflect the views or values of Entrata, the executive team, board of directors, or investors. To be absolutely clear, we at Entrata firmly condemn antisemitism in any and all forms.\n\n“For those who have seen and been offended or disturbed by the content of Dave’s email, we understand and share your disappointment. At Entrata, we respect and support all religions, genders, sexual orientations, races, and beliefs. Diversity and inclusivity are critical to the success and future of Entrata.”\n\nIn a later tweet, Edmunds wrote that the company’s board had requested, and received, Bateman’s resignation. Bateman stepped down from the CEO position in December 2020 and has reportedly been living in Puerto Rico for at least the past year.\n\nMany left-wing critics tried to connect Bateman to the Republican party as he was a donor to Utah’s Republican Party. Tuesday evening, the Utah Republican Party posted a response to Bateman’s email on its Facebook page:\n\n“In response to the comments made by a former member of the UTGOP:\n\nAntisemitism has no place in this party or in our country. It should never be tolerated and is condemned in the strongest way possible.\n\nThis person does not speak for or in behalf of the UTGOP in any way.\n\nThis person does not fundraise in behalf of the UTGOP.\n\nThis person is not a member of the UTGOP, as they do not reside in the State of Utah.”\n\nWhat the Pope said\n\nIn a speech at the Vatican on Monday, Pope Francis stated that it was a “moral obligation” to get vaccinated against COVID-19. The Pope also denounced what he called “baseless information” regarding the vaccine.\n\nPope Francis has avoided addressing the vaccine issue, choosing to refer to it as “an act of love” while suggesting that refusing to get inoculated was “suicidal.” But in his annual speech given this week to Vatican ambassadors, the pontiff called on people to resort to “reality therapy.”\n\n“Frequently people let themselves be influenced by the ideology of the moment, often bolstered by baseless information or poorly documented facts,” he told members of the Vatican’s diplomatic corps. “The pandemic, on the other hand, urges us to adopt a sort of ‘reality therapy’ that makes us confront the problem head-on and adopt suitable remedies to resolve it,” the pope said.\n\nPope Francis stated that in the case of a pandemic, personal healthcare “translates into respect for the health of those around us. Health care is a moral obligation,” he asserted.\n\n“Vaccines are not a magical means of healing, yet surely they represent, in addition to other treatments that need to be developed, the most reasonable solution for the prevention of the disease,” he added.\n\nPope Francis described online education as a possible, albeit deeply flawed solution.\n\n“In making this point, I in no way intend to deny the usefulness of technology and its products, which make it possible for us to connect with one another easily and quickly,” the pope said. “But I do appeal urgently that we be watchful lest these instruments substitute for true human relationships.”\n\nHe admitted that universal access to the vaccine was “an illusion”.\n\n“It is appropriate that institutions such as the World Trade Organization and the World Intellectual Property Organization adapt their legal instruments lest monopolistic rules constitute further obstacles to production and to an organized and consistent access to health care on a global level,” he said.", "opengraph": {"locale": "en_US", "type": "article", "title": "Tech leader: Pope Francis a \"Jewish agent\" sent to instill global dictatorship via Covid vaccines", "description": "Dave Bateman, co-founder of property management software brand Entrata and major GOP donor launched in 2003, sent out a mass e-mail on Tuesday stating his belief that Pope Francis was secretly a Jewish agent installed to help distribute the COVID-19 vaccine around the world in an effort to create \"totalitarian rule.\"", "url": "https://www.israel365news.com/350885/tech-leader-pope-francis-a-jewish-agent-sent-to-instill-global-dictatorship-via-covid-vaccines/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:author": "https://www.facebook.com/adameliyahu", "article:published_time": "2022-01-11T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon.png", "image:width": "311", "image:height": "311", "image:type": "image/png"}, "tags": ["Christian Zionism", "noads"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "800", "height": "450", "embed_code": "<iframe title=\"Utah tech exec resigns after anti-semitic email rant\" width=\"800\" height=\"450\" src=\"https://www.youtube.com/embed/4sAB6HLTtkw?start=63&amp;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/4sAB6HLTtkw?start=63&feature=oembed"}], "links": ["https://www.newsweek.com/gop-donor-claims-pope-francis-jewish-agent-installed-distribute-vaccine-1665640", "https://www.deseret.com/utah/2022/1/4/22867216/tech-entrepreneur-dave-bateman-claims-covid-19-vacccines-plot-by-jews-to-exterminate-people-entrata", "https://twitter.com/adamedmunds/status/1478508486606475264?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1478508486606475264%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.deseret.com%2Futah%2F2022%2F1%2F4%2F22867216%2Ftech-entrepreneur-dave-bateman-claims-covid-19-vacccines-plot-by-jews-to-exterminate-people-entrata", "https://www.facebook.com/UTGOP/posts/282877183872625", "https://www.vatican.va/content/francesco/en/speeches/2022/january/documents/20220110-corpo-diplomatico.html"], "authors": ["Adam Eliyahu Berkowitz"], "publish_date": "2022-01-11T00:00:00+00:00"}