{"result_id": "177038", "URL": "https://www.israel365news.com/347682/bennetts-rosh-hashanah-threat-if-people-dont-get-vaccinated-they-wont-hear-the-shofar/", "timestamp": "2023-04-25 15:44:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/347682/bennetts-rosh-hashanah-threat-if-people-dont-get-vaccinated-they-wont-hear-the-shofar/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Bennett's Rosh Hashanah threat: If people don't get vaccinated, they won't hear the shofar", "cleaned_text": "Did Naftali Bennett just threaten to cancel the Messiah?\n\nIsrael’s Prime Minister called for all Israelis to get vaccinated but implicit in his words was a message that non-vaccination would postpone the Messiah.\n\nAt Sunday’s cabinet meeting Naftali Bennett discussed the current spike in the pandemic. He threatened a new shutdown, saying, “If we get vaccinated in Elul, we can hear the shofar in Tishrei.”\n\nThe Hebrew month of Elul began this week, marking a period of intensified repentance in preparation for the Jewish high holiday period in the month of Tishrei when the shofar (ram’s horn) is blown on Rosh Hashanna.\n\nBennett’s intention was clearly a warning that if there was not an increase in vaccinations, there would be a shutdown during the upcoming Jewish holidays. This threat is proving contentious as political and social pressure led the government to issue an exemption to synagogues under the newly instated Green Pass restrictions. The new restrictions that kicked in on Sunday limited gatherings of any size, indoors and out, to those who have been vaccinated, recovered from the virus, or who present a negative COVID test. While the plan originally included synagogues and other houses of worship, these were eventually exempted in prayer services with fewer than 50 participants. Many politicians were angered by the exemption.\n\nThough Bennett probably did not make his statement with prophetic implications in mind, coming together to hear the shofar is not only the symbol of the Jewish New Year. The shofar also is an essential element of the final redemption of Israel, as stated explicitly by Isaiah as signaling the pre-Messiah ingathering of the exiles:\n\nThis is one of the bases for blowing the shofar on Rosh Hashanah as it symbolizes the coronation of God as king. Biblical kings were coronated to the sound of shofar blasts and the final shofar of redemption will be the ultimate coronation of God as King when He will be one and His name will be one.\n\nIn the context of Isaiah’s prophecy, Bennett’s threat takes on dire implications, suggesting that the key to the arrival of the Messiah is acquiescing to the government’s vaccination program. Few (if any) Israelis believe that being declared prime minister bestows upon Bennett the power to permit or forbid the arrival of the Messiah.\n\nAnd as the prophetically minded surely know, the arrival of the Messiah will cure all disease, making vaccines irrelevant. And the Messiah will also make Bennett’s function at the head of the government irrelevant, or at least ancillary.\n\nBennett’s declaration also encountered more mundane objections. Several stern objections were raised during the cabinet discussion regarding a fourth lockdown that would continue through the holidays. While some objections were raised based on religious considerations, others were raised based on economic hardship.\n\nFinance Minister Avigdor Liberman (Yisrael Beytenu) said, “There are branches [of the economy] that are already suffering now due to the situation being created – including the entire tourism industry and the aviation industry. We have to find the correct solution.”\n\nTourism Minister Yoel Razvozov (Yisrael Beytenu) added, “Just by uttering the word ‘lockdown’ we cause a huge number of cancellations. If I would be allowed to do so, I would be working on an outline for providing compensation.”\n\nIntelligence Minister Elazar Stern (Yesh Atid) also expressed opposition to a lockdown, saying, “We need to strike out this word ‘lockdown’ from our dictionary. We are forcing people to live under threat.”\n\nEducation Minister Yifat Shasha-Biton (New Hope), said, “Aside from the fact that we need to remove the issue of a lockdown from the agenda, the very fact that we are even talking about it creates facts on the ground. There are already cancellations and people are living in existential fear of their livelihoods being destroyed. We’ve seen the graphs: It doesn’t make any difference if countries impose a full lockdown, a partial lockdown, or no lockdown at all – the contagion rate is unaffected.”\n\nIsrael has run an aggressive program of vaccinations. Five and a half million Israelis representing 60% of the population have already been vaccinated, leaving about one million who remain unvaccinated. The government recently began a program of giving a third dose to the elderly.", "opengraph": {"locale": "en_US", "type": "article", "title": "Bennett's Rosh Hashanah threat: If people don't get vaccinated, they won't hear the shofar", "description": "He threatened a new shutdown, saying, “If we get vaccinated in Elul, we can hear the shofar in Tishrei.”", "url": "https://www.israel365news.com/347682/bennetts-rosh-hashanah-threat-if-people-dont-get-vaccinated-they-wont-hear-the-shofar/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:author": "https://www.facebook.com/adameliyahu", "article:published_time": "2021-08-10T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/bennett-mask.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["noads", "Naftali Bennett", "Biblical News"], "tweets": [], "movies": [], "links": ["https://theisraelbible.com/bible/isaiah-27/"], "authors": ["Adam Eliyahu Berkowitz"], "publish_date": "2021-08-10T00:00:00+00:00"}