{"result_id": "177022", "URL": "https://www.israel365news.com/343793/fear-of-the-covid-vaccine-could-keep-muslims-off-temple-mount/", "timestamp": "2023-04-25 15:43:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/343793/fear-of-the-covid-vaccine-could-keep-muslims-off-temple-mount/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Fear of the Covid Vaccine could Keep Muslims off Temple Mount", "cleaned_text": "Channel 11 Kahn News reported on Monday that Jerusalem Mayor Moshe Lion warned that he would order the Aqsa Mosque on the Temple Mount to be closed unless the Muslim residents of East Jerusalem agreed to be vaccinated in more significant numbers.\n\n“Remember what I am telling you,” Lion said in a meeting with health officials and Arab leaders of the communities in East Jerusalem. “Whoever does not get vaccinated will not return to the routine. [Those who get vaccinated] are doing themselves a favor. They are not doing me a favor. If they don’t want to be vaccinated, then let them not be vaccinated.”\n\n“But they won’t be allowed into hotels. They won’t be allowed into mosques. They won’t be allowed into schools. But by then, they will be asking why we didn’t warn them.”\n\n“If we don’t call people, force them to go out from their houses, they won’t get vaccinated. They are apathetic. They will feel the pressure soon when everyone begins to return to work. Then they will say,’Wait! You didn’t get vaccinated. Now you have to stay home.’”\n\nA local restauranteur who took part in the meeting reacted strongly.\n\n“I need to return to my restaurant,” he said to the mayor. “My workers, my waiters, also need to return to work. This is a snowball that is rolling and will hit everyone.”\n\nLion agreed, noting that the general effect to the public was precisely the point of the vaccinations.\n\nKhan News reported that the participants at the meeting seemed please at the decision to take a stronger stance for vaccination. The move comes two months before the month-long Ramadan fast-feast when many Muslims come to pray en masse on the Temple Mount.\n\nThe head of the Arab communities of east Jerusalem announced, “In two months will be Ramadan. If you don’t get vaccinated, you will not be permitted to enter the mosque. You will not be permitted to return to work. If you don’t get vaccinated, you will not be allowed on the train. You will not be permitted into doctors’ offices. That is the way it must be.”\n\nKhan reported that the number of vaccinations being carried out in the Arab communities is unsatisfactory, with only 13% of the Arab residents of east Jerusalem having received the first shot.\n\nAssaf Fried, the spokesman for the Temple Organizations, noted that the mayor of Jerusalem does not have the authority to close the Temple Mount as this remains in the purview of the Minister of Internal Security Amoir Ohana in conjunction with the prime minister.\n\n“Even when the mayor does have the authority, for example, illegal construction the Waqf carries out on the Temple Mount, the mayor does not act,” Fried added. “The Temple Mount is open. Though very few Arabs go to the site during the week, on Friday it is full and no social distancing is observed and very few masks are seen.”\n\nIn comparison, Fried said the Western Wall plaza is divided into capsules with barriers separating worshippers into groups of ten. He added that policemen patrol the site and are zealous is giving fines to people who do not wear masks.\n\nOne example of pro-active measures is the city of Carmiel.\n\nThere, the mayor has opened businesses to those who have a certificate of vaccination.\n\nMuslims prayer on the Temple Mount has been held despite the flagrant violations of social distancing and lack of masking. Approximately 20,000 Muslim worshippers congregate on the mount every Friday. Despite nationwide lockdowns, Israeli officials are reluctant to enforce closures on the Temple Mount in fear of a violent Arab reaction.\n\n“Until one week ago, there was a lockdown”\n\n“Jews who did not live in the near vicinity were restricted from the Temple Mount, which was not the case with the Arabs,” Fried noted. “Now, Jews are permitted on the Temple Mount. We are limited to groups of ten, as has always been the case, and masking is strictly enforced. Regarding the Arabs, the police do not enforce any health regulations.”\n\nIn September, Israel’s coronavirus czar Ronni Gamzu has designated the entire Old City of Jerusalem — including the Western Wall plaza, the holiest place where Jews may pray, and the Church of the Holy Sepulchre, which is sacred to most Christians — as highly restricted “red” zones facing a virus lockdown.\n\nThe Temple Mount compound was closed for weeks in the first round of the virus wave in mid-March, before reopening in late May, though there were videos of many Arabs being permitted to enter nonetheless.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fear of the Covid Vaccine could Keep Muslims off Temple Mount", "description": "\"If they don’t want to be vaccinated, then let them not be vaccinated...But they won’t be allowed into hotels. They won’t be allowed into mosques.\"", "url": "https://www.israel365news.com/343793/fear-of-the-covid-vaccine-could-keep-muslims-off-temple-mount/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:author": "https://www.facebook.com/adameliyahu", "article:published_time": "2021-02-09T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/templeMountEmpty-1.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Jerusalem", "noads"], "tweets": [], "movies": [], "links": ["https://twitter.com/kann_news/status/1358865447366582274", "https://www.www.israel365news.com/102325/jews-learn-torah-temple-mount-memory-terror-victim/"], "authors": ["Adam Eliyahu Berkowitz"], "publish_date": "2021-02-09T00:00:00+00:00"}