{"result_id": "177034", "URL": "https://www.israel365news.com/348838/after-second-shot-wanes-a-third-booster-provides-more-antibodies-israeli-study-finds/", "timestamp": "2023-04-25 15:44:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/348838/after-second-shot-wanes-a-third-booster-provides-more-antibodies-israeli-study-finds/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Definitive study of twice-vaccinated staffers at Israel’s largest hospital shows in which populations the antibodies decline and how fast", "cleaned_text": "A unique and definitive study of anti-COVID-19 antibodies found in 5,000 staffers who were immunized twice with the Pfizer vaccine at Israel’s largest medical center has showed a significant decline in protection over six months.\n\nThe new study at Sheba Medical Center at Tel Hashomer (near Tel Aviv) – just published in the prestigious New England Journal of Medicine (NEJM) under the title “Waning Immune Humoral Response to BNT162b2 Covid-19 Vaccine over 6 Months” provided the basis for the Israel government’s decision – the first in the world – to offer the booster shot to all Israelis from the age of 12.\n\nSheba Medical Center has 1,600 beds and 14,739 health care workers, including employees, students, volunteers and retired personnel. Fully 18% are physicians, 27% are nurses or nurse aids, 21% are paramedical personnel and 34% are administrative or logistic employees of all ages and medical conditions.\n\nThe participants in the study underwent serological (blood) tests every week during the firs three months and then once a month to determine the amount of immunological protection provided by the vaccine over time. The team was headed by Prof. Gili Regev-Yochay, who is director of Sheba’s infectious disease epidemiology unit, and included hospital director Prof. Yitzhak Kreiss.\n\nIn the article and in a press conference before its publication, the team said their research clearly demonstrated the attenuation of the immune response from the vaccination and hence, the need for a third dose. The findings showed that within six months of administering the second dose of the vaccine, there was a significant sustained decrease in both IgG antibody and neutralizing antibody levels, which are likely to be more significant in disease prevention. It was also found that the levels of the neutralizing antibodies first dropped sharply, and from the third month after the administration of the second dose more moderately.\n\n“We were able to build a model that shows the likelihood of different populations having different antibody levels – for example, men, the elderly, and people with a weakened immune system, who had low antibody levels. According to the model we have developed, we will in the future try and assess the chances of severe or mild illness among different populations and then determine the nature of the treatment that will be required,” said Regev-Yochai.\n\nIn the second Sheba study, it was apparent that female had a higher starting point, with more antibodies, at the onset, but then as time passed, their protection dropped as with males.\n\nShe added that “identifying population groups under different thresholds, as carried out in our study, will make it possible in the future to assess the level of risk for each such group and thus determine the need for booster shots on the one hand and non-pharmacological means such as isolation or testing on the other.”\n\nLast month, the same team published – together with Israel’s Health Ministry and the Gertner Research Institute in NEJM their earlier study that indicated a link between antibody levels and the risk of disease. They found that Sheba staffers who had been vaccinated six months were at a higher risk of Corona complications after the six-month period. It was on the basis of the Sheba studies that the Israel government decided on the booster, said Regev-Yohai.\n\n“The findings of the study are particularly significant for countries around the world that have not yet started administering the booster dose or for countries where about six months have passed since the second dose of the vaccine was given. These data are expected to play a significant part in determining the continuation of the immunization policy in the future.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Definitive study of twice-vaccinated staffers at Israel’s largest hospital shows in which populations the antibodies decline and how fast", "description": "In the second Sheba study, it was apparent that female had a higher starting point, with more antibodies, at the onset, but then as time passed, their protection dropped as with males. ", "url": "https://www.israel365news.com/348838/after-second-shot-wanes-a-third-booster-provides-more-antibodies-israeli-study-finds/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-10-06T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/GiliRegev1-1.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Medical/Science", "Covid-19"], "tweets": [], "movies": [], "links": [], "authors": ["Judy Siegel-Itzkovich"], "publish_date": "2021-10-06T00:00:00+00:00"}