{"result_id": "177008", "URL": "https://www.israel365news.com/187445/jewish-groups-outraged-by-snl-joke-about-israel-only-vaccinating-jews/?fb_comment_id=3736960319673610_3737536976282611", "timestamp": "2023-04-25 15:43:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/344057/jewish-groups-outraged-by-snl-joke-about-israel-only-vaccinating-jews/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Jewish groups outraged by SNL ‘joke’ about Israel only vaccinating Jews", "cleaned_text": "Jewish groups and Israeli officials on Sunday accused NBC‘s iconic American late-night variety show “Saturday Night Live” (SNL) of spreading anti-Semitism after one of its skits joked that Israel has been vaccinating only its Jewish citizens.\n\n“Israel is reporting that they’ve vaccinated half of their population, and I’m going to guess it’s the Jewish half,” Michael Che, the co-host of SNL’s news parody, “Weekend Update,” said on the most recent broadcast.\n\nThe joke did not go over well.\n\nIsraeli Ambassador to the U.S. Gilad Erdan tweeted, “I’m a big fan of humor but perpetuating anti-Semitism is just not funny. Your ‘joke’ is ignorant. The fact is that the success of our vaccination drive is exactly because every citizen of Israel—Jewish, Muslim, Christian—is entitled [to] it. Apologize!”\n\nIsrael Nitzan, who serves as the country’s consul general in New York, slammed SNL for “Spreading anti-Semitic lies and misinformation. Fanning the flames just to get a laugh is not only wrong; it’s irresponsible. Israel has made the vaccine available for its entire population equitably, regardless of gender, race or religion.”\n\nA furious American Jewish Committee began circulating a petition on Sunday demanding that SNL apologize for the joke.\n\n“Saturday Night Live’s joke isn’t just untrue—it’s dangerous, a modern twist on a classic anti-Semitic trope that has inspired the mass murder of countless Jews throughout the centuries,” the AJC petition said.\n\nEllie Cohanim, the deputy special envoy to combat anti-Semitism in the Trump administration, tweeted, “Under the Oslo Accords, the Palestinian Authority is responsible for all health and social welfare needs. Contact SNL and NBC and demand they apologize for their modern-day blood libel against Jews.”\n\nPro-Israel advocacy group StandWithUs launched an apology-demanding campaign, as well.\n\n“This may have been an uninformed comment, lacking in understanding of Israel’s diverse population or, worse, a blood-libel and a lie dressed up and played for laughs,” the petition read.\n\n“Israel’s healthcare system is available and equal to all and an example of coexistence. Those who allege otherwise tend to be extremist groups, who have already relished this ‘joke’ on social media.\n\n“The SNL libel has already been used to promote anti-Semitic words and deeds. ‘Saturday Night Live’ and NBC should apologize and disown this dangerous and misleading assertion.”\n\nThe Committee for Accuracy in Middle East Reporting and Analysis (CAMERA) also called on NBC to apologize for the anti-Semitic segment.\n\nCAMERA’s Israel Director Tamar Sternthal urged “NBC and SNL to apologize for the blatant anti-Semitic smear, and to make clear that Israel is providing equal access to the coronavirus vaccine for its entire population, Jews and non-Jews alike.”\n\nRabbi Aryeh Spero, president of the U.S.-based Conference of Jewish Affairs, issued a statement saying, “The producers of ‘Saturday Night Live’ decided they would sacrifice the truth and demonize the Jewish State for the sake of a cheap laugh or, worse, enable an age old blood libel accusing Jews of manufacturing and spreading plagues while being indifferent to others.\n\n“Surely [SNL creator Lorne] Michaels knows of the heroic efforts Israel has made in creating vaccines, medicines, and state-of-the art medical equipment to alleviate not only the coronavirus but also every type of disease found across the globe. The ‘Saturday Night Live’ crew would do best to educate themselves on how Israel, matched only by the United States, has sent its transportable medical units immediately to every part of the globe facing a meteorological or medical catastrophe.\n\n“The ‘Saturday Night Live’ crew would never be this callous, nor stereotype a Muslim or LTGBQ group. They know that in today’s culture, such demonization would get them cancelled and removed from media outlets.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Jewish groups outraged by SNL ‘joke’ about Israel only vaccinating Jews", "description": "“The ‘Saturday Night Live’ libel has already been used to promote anti-Semitic words and deeds. SNL and ‘NBC’ should apologize and disown this dangerous and misleading assertion,” states StandWithUs.", "url": "https://www.israel365news.com/344057/jewish-groups-outraged-by-snl-joke-about-israel-only-vaccinating-jews/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-02-22T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/micahel-che.png", "image:width": "991", "image:height": "553", "image:type": "image/png"}, "tags": ["Antisemitism"], "tweets": [], "movies": [], "links": [], "authors": ["JNS"], "publish_date": "2021-02-22T00:00:00+00:00"}