{"result_id": "177004", "URL": "https://www.israel365news.com/194570/israel-south-korea-sign-mutual-covid-19-vaccine-pact/", "timestamp": "2023-04-25 15:43:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/346908/israel-south-korea-sign-mutual-covid-19-vaccine-pact/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israel, South Korea sign mutual COVID-19 vaccine pact", "cleaned_text": "Israel and South Korea signed a COVID-19 vaccine supply agreement on Tuesday, allowing for more effective use of present and future inventories for both countries.\n\nUnder the deal, Israel will transfer about 700,000 doses of the Pfizer vaccine to South Korea by the end of July. South Korea has suffered a slow vaccine rollout due to global shortages and delivery delays.\n\nIn exchange, South Korea will deliver an identical quantity of vaccines to Israel from a future order in September-October 2021.\n\n“South Korea will receive vaccines from our existing stocks and we will receive vaccines from their future shipment. Thus we are plugging the holes and we will ensure that the State of Israel has a proper stock of vaccines,” he said in a statement.\n\nIsrael faced the prospect of having to throw out hundreds of thousands of COVID-19 vaccines if it couldn’t find a country willing to buy them before they expired.\n\nOn June 18, the Palestinian Authority on June 18 canceled a similar deal to the one between Israel and South Korea, claiming that the expiration date on the initial shipment was earlier than had been agreed upon.\n\nUnder the terms of the deal, Israel was to have supplied the P.A. with up to 1.4 million doses of the Pfizer-BioNTech vaccine, in exchange for a resupply of the same number of doses from the P.A. later in the year, Reuters reported.\n\nThe agreement with South Korea will take effect “upon the completion of all processes,” including testing of the vaccines after their arrival, according to the official Israeli statement about the deal.\n\nThe agreement was led by the Health Ministry in cooperation with the Foreign Ministry, the National Security Council (NSC) and the Prime Minister’s Office, with the knowledge of Pfizer, the statement said.\n\nBennett spoke with Pfizer chairman and CEO Albert Bourla several times recently in order to facilitate the deal and in regard to the formation of future vaccines policy.", "opengraph": {"locale": "en_US", "type": "article", "title": "Israel, South Korea sign mutual COVID-19 vaccine pact", "description": "Israeli Prime Minister Naftali Bennett: “We have made a win-win deal: South Korea will receive vaccines from our existing stocks and we will receive vaccines from their future shipment.”", "url": "https://www.israel365news.com/346908/israel-south-korea-sign-mutual-covid-19-vaccine-pact/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-07-06T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/south-korea.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Antisemitism"], "tweets": [], "movies": [], "links": [], "authors": ["JNS"], "publish_date": "2021-07-06T00:00:00+00:00"}