{"result_id": "177026", "URL": "https://www.israel365news.com/351464/israeli-study-antibodies-perform-best-after-covid-infection-not-vaccine/", "timestamp": "2023-04-25 15:43:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "http://www.israel365news.com/351464/israeli-study-antibodies-perform-best-after-covid-infection-not-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israeli study: Antibodies perform best after COVID infection, not vaccine", "cleaned_text": "Over time, the number of SARS-CoV-2 antibodies falls in both previously infected and vaccinated people, but the performance of antibodies improves only after previous infection and not vaccination.\n\nThis groundbreaking finding, led by Dr. Carmit Cohen of Israel’s Sheba Medical Center, will be presented at the European Congress of Clinical Microbiology and Infectious Diseases in April.\n\nCohen and her colleagues analyzed antibody-induced immune response in 130 recovered individuals for up to a year and compared it to 402 matched individuals who were double-vaccinated with the Pfizer vaccine but never had COVID-19.\n\nThe researchers found that the number of antibodies present a month after vaccination was higher than in patients who had recovered from COVID-19. However, these numbers declined more steeply in the vaccinated group. While the avidity (antibody performance quality) index was higher in vaccinated individuals than in recovered patients initially, avidity did not significantly change over time in vaccinated individuals but increased gradually in recovered patients. This could explain why double-vaccinated individuals who never contracted COVID-19 are more likely to experience infection after six months. The study also found that, contrary to expectations, antibodies of recovered patients with a body-mass index of 30 or higher (in the obese range) were higher at all time points when compared with those with a BMI under 30 (overweight to normal weight range). The obese people who had been previously infected were therefore better protected against future infection. Of all recovered patients, 42 (36%) experienced long COVID, including mental health (5%), neurological (9%), cardiovascular (5%) and respiratory (31%) symptoms. The authors conclude: “While the number of antibodies decreases with time in both COVID-19 recovered patients and vaccinated individuals, the quality of antibodies increases following infection but not after vaccination. These results provide specific characteristics of the immune response that may explain the differential protection against COVID-19 in previously infected and vaccinated individuals.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Israeli study: Antibodies perform best after COVID infection, not vaccine", "description": "The researchers also found that previously infected obese patients, contrary to expectations, had a higher and more sustained immune response.", "url": "http://www.israel365news.com/351464/israeli-study-antibodies-perform-best-after-covid-infection-not-vaccine/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2022-02-10T00:00:00+00:00", "image": "http://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_1852262386.png", "image:width": "660", "image:height": "330", "image:type": "image/png"}, "tags": ["Coronavirus", "noads"], "tweets": [], "movies": [], "links": [], "authors": ["JNS"], "publish_date": "2022-02-10T00:00:00+00:00"}