{"result_id": "177044", "URL": "https://www.israel365news.com/264160/plan-to-apply-green-pass-rules-to-shopping-malls-outrages-mks-retailers/", "timestamp": "2023-04-25 15:44:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/350331/plan-to-apply-green-pass-rules-to-shopping-malls-outrages-mks-retailers/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Plan to apply ‘Green Pass’ rules to shopping malls outrages MKs, retailers", "cleaned_text": "Israeli lawmakers and retailers on Tuesday harshly criticized the planned application of “Green Pass” vaccine certificate regulations to the country’s shopping malls.\n\nAccording to an outline of the plan, decided upon by Israeli Prime Minister Naftali Bennett and Health Minister Nitzan Horowitz, the measure will apply to all indoor complexes larger than 10,000 square meters (108,000 square feet). Digital vaccination certificates will be scanned by security personnel at the entrance, and vaccinated individuals will receive a bracelet allowing them to move around the mall freely.\n\nUnvaccinated individuals will not receive a bracelet, and will only be allowed to enter “essential” shops, with a list to be formulated by the government’s legal advisers.\n\nBennett and Nitzan also decided that children and adults who have been vaccinated with the first dose will receive a temporary “green pass” that will be valid for 30 days from the date of the first vaccination.\n\nThe directive has yet to be approved by the Cabinet and the Knesset Constitution, Law and Justice Committee.\n\nYisrael Beiteinu Knesset member Eli Avidar called the move a “hasty step that has no epidemiological logic and [that] disregards reality.”\n\nAdoption of the measure would be a blow to both businesses and citizens, he said, adding, “The democratic public is losing the little trust it has left, and in the culprits who participate in this madness.”\n\nUri Abel, CEO of the Seven Stars shopping mall in Herzliya, called the directive a “bad decision” that it would be “difficult” to implement and enforce.\n\n“It will create lines at the entrance, as well as hostility. This is the exact opposite of the experience we want to create in the mall,” he said. “I understand the intention [behind the plan], but instead of rewarding those who want to get vaccinated, the whole population is punished,” he added.\n\nThe management of the Dizengoff Center shopping mall in Tel Aviv said in a statement, “At this point, the decision is not applicable, effective or relevant to reality, but once we get the full details we will understand its requirements and examine whether it can be implemented. We will continue to keep the center a safe space for all while respecting the rights of the individual.”\n\nBennett and Horowitz also introduced new guidelines for Israelis returning from abroad.\n\nStarting on Friday, vaccinated individuals returning from so-called “red” countries will be required to take a coronavirus test at Ben-Gurion International Airport, sign an agreement, and self-isolate for seven days at home, at the end of which they will be required to take another PCR test. They will be able to exit quarantine after receiving both negative test results.\n\nUnvaccinated Israelis will also have to perform a coronavirus test upon arrival, isolate in a state-run hotel until they receive their test results, and if negative, sign an agreement and continue self-isolating for the rest of the seven days at home. They, too, will be required to take another PCR test at the end of the self-isolation period. If negative, they will be able to exit quarantine.\n\nIf an individual tests positive at the airport, he or she will be required to self-isolate for the entire seven days at the state-run hotel.\n\nBennett also instructed officials to re-examine the criteria for adding states onto the government’s no-fly list, in an effort to curb the spread of the Omicron coronavirus variant in Israel.", "opengraph": {"locale": "en_US", "type": "article", "title": "Plan to apply ‘Green Pass’ rules to shopping malls outrages MKs, retailers", "description": "Israeli Prime Minister Naftali Bennett mandates vaccination certificates in shopping centers • MK Eli Avidar calls the move “madness” and says the public is losing trust in the government.", "url": "https://www.israel365news.com/350331/plan-to-apply-green-pass-rules-to-shopping-malls-outrages-mks-retailers/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-12-15T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_669945538.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Coronavirus", "Covid-19", "noads"], "tweets": [], "movies": [], "links": [], "authors": ["JNS"], "publish_date": "2021-12-15T00:00:00+00:00"}