{"result_id": "177002", "URL": "https://www.israel365news.com/162013/a-third-of-israelis-plan-to-avoid-covid-vaccine-new-poll-shows/?fb_comment_id=3450322358413943_3454258404687005", "timestamp": "2023-04-25 15:43:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/342429/a-third-of-israelis-plan-to-avoid-covid-vaccine-new-poll-shows/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "A third of Israelis plan to Avoid COVID vaccine, new poll shows", "cleaned_text": "With Israel poised to begin rolling out COVID-19 vaccinations, a new poll indicates that just over a third of Israelis say they won’t take the shots.\n\nAccording to an Israel Hayom poll, 37 percent of respondents said they will not take the vaccine, while 19 percent would neither confirm nor deny they planned to get vaccinated. Forty-four percent of respondents said they planned to get the vaccine.\n\nThe older the respondent, the more likely they were to say they planned to be inoculated. Among respondents 65 and older, 63 percent said they would get vaccinated, while 20 percent said they would refuse the vaccine. Among those in the 50-to-64 range, 49 percent said they would take the vaccine, while 32 percent said they would not.\n\nAmong respondents aged 30 and 50, 42 percent said they would get vaccinated, while among 18- to 30-year-olds 34 percent said they would take the vaccine, while nearly half, or 48 percent, said they would refuse.\n\nAt 57 percent, secular Jews were the most likely to say they would get inoculated, followed by national religious Jews at 43 percent and self-defined traditional Jews at 38 percent.\n\nThe survey found that just 35 percent of Israel’s Christian and Muslim Arab population and 26 percent of its Haredi and formerly Haredi population said they would get vaccinated.\n\nWhen it comes to mask-wearing and social distancing, however, 93 percent of Israelis said they adhere to Health Ministry guidelines compared to four percent who said they did not.\n\nIsrael received its first shipment of 3,000-4,000 Pfizer coronavirus vaccines on Wednesday, and is set to begin inoculating citizens on Dec. 27.\n\nThe Health Ministry has yet to launch a campaign aimed at encouraging the general public to get vaccinated, preferring to focus its efforts on medical workers at this time. In the meantime, both the Israel Pediatric Association and the Israel Society for Infectious Diseases have been involved in efforts to educate the public on the benefits of the vaccine.\n\nThe survey of 525 individuals was carried out by the Maagar Mochot research institute.", "opengraph": {"locale": "en_US", "type": "article", "title": "A third of Israelis plan to Avoid COVID vaccine, new poll shows", "description": "As Israel prepares to begin its inoculation campaign and with the Health Ministry yet to launch a supporting PR effort, an “Israel Hayom” study finds widespread resistance to vaccination.", "url": "https://www.israel365news.com/342429/a-third-of-israelis-plan-to-avoid-covid-vaccine-new-poll-shows/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2020-12-13T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/F200402YS31-1-880x495-1.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Coronavirus"], "tweets": [], "movies": [], "links": [], "authors": ["JNS"], "publish_date": "2020-12-13T00:00:00+00:00"}