{"result_id": "177027", "URL": "https://www.israel365news.com/288542/israeli-company-one-step-closer-to-powerful-cancer-vaccine-health-and-science/", "timestamp": "2023-04-25 15:43:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/288542/israeli-company-one-step-closer-to-powerful-cancer-vaccine-health-and-science/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israeli Company One Step Closer to Powerful Cancer Vaccine", "cleaned_text": "Israeli biotherapeutic company Vaxil published the results of its recent clinical trials for its therapeutic vaccine to treat cancer patients in the British Journal of Haematology last month. The trial, which focused on patients with multiple myeloma, showed significant promise.\n\nIsrael has long been on the cutting-edge of cancer research, and Vaxil is no exception. It has been working on its cancer treatment, called ImMucin, for over five years now. The therapeutic vaccine — a format which differs from traditional vaccines in that it is given to already sick patients rather than healthy individuals — is designed to train the body’s own immune system to recognize and respond to tumor cells, destroying them and stopping the spread of cancer. It does so by identifying MUC1 markers, present in high concentration in cancer cells, and attacking only cells containing those markers.\n\nImMucin is not meant to replace chemotherapy or other traditional cancer treatments. Rather, “Vaxil is developing a drug to keep the cancer from coming back,” CFO Julian Levy told NoCamels. “We are trying to harness the natural power of the immune system to fight against cancer by seeking out cancer cells and destroying them.”\n\nThe company began its trials with multiple myeloma, a blood cancer, but says MUC1 markers are present in 90% of all cancers, meaning ImMucin should be effective in fighting all of them. In fact, says Dr. Lior Carmon, founder and CEO of Vaxil, tests have already begun on other cancers.\n\nIn a company press release regarding the British Journal of Haematology article, he said, “This article is an important validation for our technological approach which the scientific and medical community has been awaiting. The results we saw were highly encouraging and Vaxil is continuing with its clinical development of ImMucin towards a Phase II study in [multiple myeloma]. We are also exploring ImMucin’s application in other relevant cancers and to that end have started testing it in patients with metastatic breast cancer.”\n\nIn the recent trial, 15 patients with multiple myeloma who had been in remission but were experiencing a recurrence of the cancer were injected with ImMucin over a period of six months. Each patient received either six or 12 injections. The patients experienced minimal side effects, but 11 of the 15 achieved stability or improvement in the progress of their disease. Although there is still a long way to go before calling this a wonder-drug or a cure-all, it is a significant step along that path.\n\nThe Nes Ziona-based Vaxil expects the vaccine to be available no later than 2020.", "opengraph": {"locale": "en_US", "type": "article", "title": "Israeli Company One Step Closer to Powerful Cancer Vaccine", "description": "Israeli biotherapeutic company Vaxil published the results of its recent clinical trials for its therapeutic vaccine to treat cancer patients.", "url": "https://www.israel365news.com/288542/israeli-company-one-step-closer-to-powerful-cancer-vaccine-health-and-science/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2015-01-11T00:00:00+00:00", "article:modified_time": "2022-10-31T20:35:27+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/10/health-medicine-science.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Israel", "Technology", "Uncategorized", "Cancer", "Health and Science"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "600", "height": "338", "embed_code": "<iframe src=\"//www.youtube.com/embed/XhEwj6Ue13s?rel=0\" width=\"600\" height=\"338\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/XhEwj6Ue13s?rel=0"}], "links": ["https://www.www.israel365news.com/14878/israel-based-lab-develops-blood-test-detect-breast-cancer/#bmZrt2Ik7PzJCiPh.97", "https://www.www.israel365news.com/12545/tel-aviv-university-researchers-make-ovarian-cancer-breakthrough/#rqD0e9SboueUoz2P.97"], "authors": ["Ahuva Balofsky"], "publish_date": "2015-01-11T00:00:00+00:00"}