{"result_id": "177043", "URL": "https://www.israel365news.com/351028/prestigious-medical-journal-censors-israeli-trained-researcher-for-reporting-on-covid-vaccine-side-effects/", "timestamp": "2023-04-25 15:44:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "http://www.israel365news.com/351028/prestigious-medical-journal-censors-israeli-trained-researcher-for-reporting-on-covid-vaccine-side-effects/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Prestigious medical journal censors Israel-based researcher for reporting on Covid vaccine side effects", "cleaned_text": "A research paper co-authored by Israeli scientist Jessica Rose was withdrawn by the prestigious academic journal Elsevier. The reason appears to be because she suggested that the Covid vaccine caused myocarditis in children.\n\nRose, who got her PhD in computational biology from Bar-Ilan University in central Israel, teamed up with cardiologist, and epidemiologist Peter McCullough, to publish a paper on VAERS (Vaccine Adverse Event Reporting System) reports of myocarditis in young people—a problem that although has been acknowledged as a side effect of the vaccine, is considered to be rare.\n\nThe VAERS report collects data of any side effects experienced following a vaccine. Although there are roughly 40,000 reports per year, the Covid vaccine VAERS report produced over one million reports. This included over 21,000 deaths, 11,000 heart attacks, close to 13,000 cases of Bell’s palsy, and more than 25,000 cases of myocarditis or pericarditis.\n\nHer peer reviewedpaper reviewing VAERS data in young ‘vaccinated’ people showied an especially high incidence of myocarditis (inflammation and scaring of the heart)..\n\nDr. Rose concluded that a person inoculated under the age of 20, had 19 times greater chance of being hospitalized from a heart related adverse event than an unvaccinated person being hospitalized from Covid-19.\n\nRose was alarmed by the data. Making matters worse, she noticed that authorities and even several experts were dismissing it.\n\n“Clearly, there’s no concern [among these authorities and experts] for people who are suffering adverse events,” she said in an interview with the Epoch Times.\n\nSince July 9, they discovered 559 VAERS reports of myocarditis, 97 in children ages 12–15. Some may have been related to Covid-19 itself, which may also lead to heart problems. However, there were just too many cases making it hard to ignore the likelihood that they were caused by the vaccine, the authors wrote.\n\n“Within 8 weeks of the public offering of COVID-19 products to the 12–15-year-old age group, we found 19 times the expected number of myocarditis cases in the vaccination volunteers over background myocarditis rates for this age group,” the paper said.\n\nAlthough the paper was published in the journal for about two weeks, on Oct. 15, it was deleted from Elsevier’s website and replaced with a notice of “Temporary Removal.” The authors were given any reason, Rose said.\n\n“It’s unprecedented in the eyes of all of my colleagues.”\n\nWhen Rose and McCullough asked the journal why the paper was pulled, they were initially informed that the publication was pulled because it was not “invited,” Rose said. That was dismissed as irrelevant by McCullough, who threatened to sue Elsevier for breach of contract. The journal responded by referring to its terms of use, which says that it has the right to refuse any paper for any reason.\n\n“I do apologise, but Elsevier cannot comment on this enquiry,” said Jonathan Davis, the journal’s communications officer, in an email to The Epoch Times.", "opengraph": {"locale": "en_US", "type": "article", "title": "Prestigious medical journal censors Israel-based researcher for reporting on Covid vaccine side effects", "description": "Dr. Rose concluded that a person inoculated under the age of 20, had 19 times greater chance of being hospitalized from a heart-related adverse event than an unvaccinated person being hospitalized from Covid-19.", "url": "http://www.israel365news.com/351028/prestigious-medical-journal-censors-israeli-trained-researcher-for-reporting-on-covid-vaccine-side-effects/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2022-01-20T00:00:00+00:00", "article:modified_time": "2022-11-02T18:17:42+00:00", "image": "http://www.israel365news.com/wp-content/uploads/2022/11/jessica-rose.png", "image:width": "725", "image:height": "383", "image:type": "image/png"}, "tags": ["Coronavirus", "Covid-19", "noads"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/researcher-calls-out-censorship-after-journal-pulls-covid-19-vaccine-adverse-events-analysis_4221081.html?utm_source=newsnoe&utm_campaign=breaking-2022-01-19-3&utm_medium=email&est=msIl3Bb9PM18sXa6sHkQ6CDAZr4iJNxzx7AtrBrcDz%2BiFo0QIlmV6r1OC4GoSHLrHQ%3D%3D", "https://jessicar.substack.com/p/a-report-on-myocarditis-adverse-events", "https://www.theepochtimes.com/researcher-calls-out-censorship-after-journal-pulls-covid-19-vaccine-adverse-events-analysis_4221081.html?utm_source=newsnoe&utm_campaign=breaking-2022-01-19-3&utm_medium=email&est=msIl3Bb9PM18sXa6sHkQ6CDAZr4iJNxzx7AtrBrcDz%2BiFo0QIlmV6r1OC4GoSHLrHQ%3D%3D", "https://jessicar.substack.com/p/a-report-on-myocarditis-adverse-events"], "authors": ["David Sidman"], "publish_date": "2022-01-20T00:00:00+00:00"}