{"result_id": "177017", "URL": "https://www.israel365news.com/351367/israeli-coronavirus-expert-70-80-of-most-severe-cases-vaccinated-at-least-three-times/", "timestamp": "2023-04-25 15:43:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "http://www.israel365news.com/351367/israeli-coronavirus-expert-70-80-of-most-severe-cases-vaccinated-at-least-three-times/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israeli Coronavirus expert: 70-80% of most severe cases vaccinated at least three times", "cleaned_text": "Prof. Yaakov Jerris, director of Ichilov Hospital’s coronavirus ward, told Channel 13 News that the majority of serious cases were vaccinated patients.\n\n“Right now, most of our severe cases are vaccinated,” Jerris said on Channel 13 News. “They had at least three injections. Between seventy and eighty percent of the serious cases are vaccinated. So, the vaccine has no significance regarding severe illness, which is why just twenty to twenty-five percent of our patients are unvaccinated.”\n\nProfessor Jerris also related to an issue in reporting that has been revealed to be prevalent in reporting data. Speaking at a cabinet meeting on Sunday, he told ministers, “Defining a serious patient is problematic. For example, a patient with a chronic lung disease always had a low level of oxygen, but now he has a positive coronavirus test result which technically makes him a ‘serious coronavirus patient,’ but that’s not accurate. The patient is only in a difficult condition because he has a serious underlying illness.”\n\nJerris’s statements are consistent with a German government report that found more than 78.6% of reported cases of the omicron COVID-19 variant in the country were in vaccinated individuals. Four thousand and twenty people who reported contracting Omicron in the study – which equates to 95.6 percent of total cases – had received at least two doses of COVID-19 vaccines, meaning the vaccinated were 3.7 times more likely to contract the variant.", "opengraph": {"locale": "en_US", "type": "article", "title": "Israeli Coronavirus expert: 70-80% of most severe cases vaccinated at least three times", "description": "The findings are consistent with a German government report that found more than 78.6% of reported cases of the omicron COVID-19 variant in the country were in vaccinated individuals.", "url": "http://www.israel365news.com/351367/israeli-coronavirus-expert-70-80-of-most-severe-cases-vaccinated-at-least-three-times/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:author": "https://www.facebook.com/adameliyahu", "article:published_time": "2022-02-04T00:00:00+00:00", "image": "http://www.israel365news.com/wp-content/uploads/2022/11/Pfizer-BioNTech_COVID-19_vaccine_2020_C_cropped-e1608238375537-880x495-1-1.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Coronavirus"], "tweets": [], "movies": [], "links": ["https://thenationalpulse.com/2021/12/31/vaccinated-21-times-more-likely-to-get-omicron/"], "authors": ["Adam Eliyahu Berkowitz"], "publish_date": "2022-02-04T00:00:00+00:00"}