{"result_id": "177031", "URL": "https://www.israel365news.com/353755/covid-vaccine-impairs-ability-of-sperm-to-swim-israeli-study-reveals/", "timestamp": "2023-04-25 15:44:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/353755/covid-vaccine-impairs-ability-of-sperm-to-swim-israeli-study-reveals/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Covid vaccine temporarily impairs ability of sperm to swim, Israeli study reveals", "cleaned_text": "Concerns have been raised regarding the detrimental impact of COVID-19 vaccinations on male fertility.\n\nA retrospective study of 220 sperm samples provided by 37 donors at three Israeli sperm banks that provided 220 samples has found that sperm concentration was reduced during the three months after donors were vaccinated but that it then returned to normal, and semen volume and the ability of sperm to swim (motility) was not affected.\n\nThe study was conducted by Dr. Itai Gat of the sperm bank and andrology unit at Shamir Medical Center in the city of Tzrifin (in central Israel) in coordination with colleagues in sperm banks in a few other hospitals.\n\nEach included one to three semen samples per donor provided 15 to 45 days; 75 to120 days and over 150 days after vaccination was completed. respectively. The researchers found that sperm concentration declined just 15.4% up to three months after vaccination but had no effect later. “Systemic immune response after [Pfizer’s] COVID-19 vaccine is a reasonable cause for transient [passing decline in] semen concentration [but] the long-term prognosis remains good.”\n\nThe study was relevant only for semen donation and not regarding the chances of vaccinated men or women achieving a pregnancy during normal intercourse. A study funded by the US National Institutes of Health and published last January in the American Journal of Epidemiology by Dr. Amelia Wesselink of Boston University found that actually getting infected with COVID-19 can harm male fertility. The study of more than 2,000 couples also reported that the COVID-19 vaccination does not affect the chances of conceiving a child.\n\nThey said they “found no differences in the chances of conception if either male or female partner had been vaccinated, compared to unvaccinated couples. However, couples had a slightly lower chance of conception if the male partner had been infected with SARS-CoV-2 within 60 days before a menstrual cycle, suggesting that COVID-19 could temporarily reduce male fertility.\n\n“The findings provide reassurance that vaccination for couples seeking pregnancy does not appear to impair fertility,” said Diana Bianchi, M.D., director of NIH’s Eunice Kennedy Shriver National Institute of Child Health and Human Development, which funded the study. “They also provide information for physicians who counsel patients hoping to conceive.”\n\n“Overall, testing positive for SARS-CoV-2 infection was not associated with a difference in conception. However, couples in which the male partner had tested positive within 60 days of a given cycle were 18% less likely to conceive in that cycle… Fever, known to reduce sperm count and motility, is common during SARS-CoV-2 infection and so could explain the temporary decline in fertility the researchers observed in couples in which the male partner had a recent infection. Other possible reasons for a decline in fertility among male partners who recently tested positive could be inflammation in the testes and nearby tissues and erectile dysfunction, all common after SARS-CoV-2 infection.” The researchers noted that this short-term decline in male fertility could potentially be avoided by vaccination.”\n\nThe researchers concluded that their results suggest that vaccination against COVID-19 had no harmful association with fertility. “Vaccination against COVID-19 also could help avert the risks that SARS-CoV-2 infection poses for maternal and fetal health,” they concluded.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid vaccine temporarily impairs ability of sperm to swim, Israeli study reveals", "description": "The study was conducted by Dr. Itai Gat of the sperm bank and andrology unit at Shamir Medical Center in the city of Tzrifin (in central Israel) in coordination with colleagues in sperm banks in a few other hospitals. ", "url": "https://www.israel365news.com/353755/covid-vaccine-impairs-ability-of-sperm-to-swim-israeli-study-reveals/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2022-06-22T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/sad-man.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Medical/Science", "noads"], "tweets": [], "movies": [], "links": [], "authors": ["Judy Siegel-Itzkovich"], "publish_date": "2022-06-22T00:00:00+00:00"}