{"result_id": "177028", "URL": "https://www.israel365news.com/187760/whos-legitimizing-the-vaccine-blood-libel-opinion/", "timestamp": "2023-04-25 15:43:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/344208/whos-legitimizing-the-vaccine-blood-libel-opinion/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Who’s Legitimizing the Vaccine Blood Libel?", "cleaned_text": "Don’t put all the blame on “Saturday Night Live” and Michael Che.\n\nOne of the show’s head writers and the co-host of its “Weekend Update” skit was guilty of spreading a hateful smear of Israel during the show’s most recent episode when he quipped that it had vaccinated “half” of its population, but then added with a knowing smirk to his audience that, “I’m going to guess it’s the Jewish half.” The implication of this gag not only underestimates the percentage of Israel’s population that is Jewish (in 2020, it was 74 percent), but that it discriminates against Arabs, Christians and other non-Jewish citizens.\n\nThat is a lie. More to the point, since it’s a lie that claims that Jews are deliberately causing the deaths of non-Jews, Che’s jibe wasn’t merely a hurtful jibe, but a modern version of the ancient blood libel that has been used to fuel anti-Semitic violence against Jews throughout history.\n\n“SNL” and Che have been heavily criticized since the episode aired with even the Anti-Defamation League joining many other Jewish groups in denouncing the show.\n\nBut the interesting thing about the reaction to this outrage is not merely the failure of NBC, “SNL” or Che to apologize. It’s that a broad cross-section of the mainstream media, left-wing politicians and leftist Jewish groups are implicitly backing up Che’s smear.\n\nArticles in The New York Times and MSNBC have put forward the bogus argument that despite the fact that the vaccine has been offered to everyone in Israel, regardless of faith or ethnicity, the Jewish state was nonetheless also obligated as the “occupying power” over the West Bank and Gaza to vaccinate the millions of Palestinians who live there. This claim has been seconded by Sen. Bernie Sanders (I-Vt.), buttressed by the left-wing J Street lobby and doubled down on by the anti-Zionist Jewish Voice for Peace group in what is their latest in a series of openly anti-Semitic libels against Israel and its Jewish supporters.\n\nThis faux outrage against alleged discrimination against the people of the territories was further heightened by the news that Israel has shipped some of its excess vaccine supply to allies such as the Czech Republic and Honduras (both of which have pledged to move their embassies to Jerusalem), as well as trading some of it to Syria in exchange for their release of an Israeli woman who wandered over the border into that country. The notion that Israel was sending vaccines to “far away” nations—as The New York Times editorialized in a news story headline—while leaving Palestinians unvaccinated was seen as both an indication that the “apartheid state” libel was true and of Prime Minister Benjamin Netanyahu’s cynical foreign-policy strategy.\n\nWith so many voices backing up Che’s assertion, it’s hardly surprising that we haven’t heard an apology from him or his boss, the longtime producer of the show Lorne Michaels, who is himself Jewish.\n\nThus, rather than a “teachable moment” in which an ignorant celebrity stumbles into saying something terrible but then quickly understands the implications of the gaffe, and by apologizing reinforces the consensus against such an anti-Semitic lie, the opposite has happened. Che’s “joke” didn’t just mainstream an anti-Israeli slur. It was the vehicle for legitimizing a blood libel that is now being spread far more widely than it was even before this incident when it had already been put about by mainstream journalists like Christiane Amanpour.\n\nThe claim that as “the occupying power” in the West Bank and Gaza, Israel is obligated by international law to vaccinate Palestinians is as false as the assertion that non-Jews are being denied the vaccine inside of Israel. The Oslo Accords were explicit about health care for those areas being the responsibility of the Palestinian Authority. Just as important, the P.A. and its leader, Mahmoud Abbas, have not wanted any Israeli help in acquiring and distributing the vaccine.\n\nThough you would never know it from the constant claim about the “occupation,” almost all Palestinians in the territories aren’t governed by Israel. Instead, they languish under the tyrannical rule of Abbas’s corrupt Fatah Party in the West Bank and the Islamist terrorist group Hamas in Gaza. Israel does exercise security control of the West Bank in order to control terror there in order to defend its citizens, as well as to ensure Abbas’s survival. Gaza is an independent Palestinian state in all but name, even though Israel’s critics continue to falsely claim that it occupies that territory, too.\n\nIn order to give out vaccines in either place, Israel would have to take over the health-care systems that already exist there—something that would require either the permission of Fatah and Hamas (which they lack) or a military takeover. If Israel did that, it would, of course, be denounced for an act of aggression by those who, without irony, already think of it as an occupier there.\n\nIt’s also ironic that those among Israel’s critics and in the international community who think that a Palestinian state already exists and should be recognized as such also insist that Israel is somehow micromanaging every aspect of life in areas that have been governed autonomously by the P.A. or Hamas for the past 27 years since the Oslo Accords were first implemented.\n\nThat the P.A. has botched efforts to vaccinate Palestinians is a shame. But it is also in character for Abbas and his Hamas rivals, who have consistently shown that they aren’t interested in helping their own people. Governments that steal a sizable portion of the aid they receive from abroad or use it to pay salaries and pensions to terrorists (as the P.A. does) or to build terrorist fortifications and tunnels (as Hamas does) rather than for humanitarian projects aren’t likely to regard health care as a priority.\n\nIsrael has helped out where it can, such as sending doses for Palestinian health-care workers. But those who are urging Israel to cooperate with the Palestinians are ignoring the fact that, outside of such isolated circumstances, neither Fatah nor Hamas wants such cooperation. As Abbas demonstrated, his pretensions to govern parts of Israel’s capital of Jerusalem are so important to him that he rejected Israeli efforts to set up a vaccination station on the Temple Mount for the thousands of Muslim worshippers who gather there, lest that be interpreted as acquiescence to Israeli sovereignty over the holiest site in Judaism.\n\nWhy then is this false narrative being spread about so blithely?\n\nThe answer is clear. Though the vaccine argument lacks credibility, it fits in nicely with a narrative that not only smears Israel as a uniquely awful human-rights violator. By putting forward the claim that it is denying life-saving medicine to non-Jews, it buttresses other longstanding claims that Israel is also a uniquely illegitimate state.\n\nThat brings us back to where “SNL” and Che entered the argument. The reason why we’re having this discussion is neither a misunderstanding nor a mistake rooted in ignorance. The obsessive desire to associate Israel with every conceivable slander, including those that reinforce old hateful lies that have led to bloodshed, is based in the anti-Semitic premise that the Jewish state—alone of all nations in the world—has no right to exist. That is why so-called human-rights groups focus on the only democracy in the Middle East rather than the tyrannies that surround it.\n\nIsrael isn’t perfect. Nor are its leaders incapable of bad behavior. But the willingness of so many to say hateful things about it is unrelated to its actual faults. They smear Israel because of what it is—the one Jewish state on the planet—not because of what it does. Those who try to justify the “SNL” smear are giving aid and comfort to those who wish to deny to the Jews that which they would never think of denying to any other people. Whether you cloak that in lame humor or high-flown rhetoric about human rights, it amounts to the same thing: anti-Semitism.", "opengraph": {"locale": "en_US", "type": "article", "title": "Who’s Legitimizing the Vaccine Blood Libel?", "description": "Journalists, leftist Jewish groups and politicians like Bernie Sanders are lending weight to the toxic lie that Israel is denying the COVID vaccine to Palestinians.", "url": "https://www.israel365news.com/344208/whos-legitimizing-the-vaccine-blood-libel-opinion/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-03-02T00:00:00+00:00", "article:modified_time": "2022-11-02T12:46:28+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_1661797882.png", "image:width": "660", "image:height": "330", "image:type": "image/png"}, "tags": ["Opinion", "Covid-19", "Gaza Strip", "Israel", "Palestinians", "Benjamin Netanyahu", "Hamas", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.jns.org/jewish-groups-outraged-by-snl-joke-about-israel-only-vaccinating-jews/", "https://www.jns.org/opinion/a-gag-about-israel-and-vaccines-is-more-than-a-bad-joke/", "https://twitter.com/ADL/status/1363996197258633216?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1363996197258633216%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.huffpost.com%2Fentry%2Fisrael-palestinian-vaccine-michael-che-snl_n_6034acabc5b67c3296202ac5", "https://www.jns.org/jewish-groups-outraged-by-snl-joke-about-israel-only-vaccinating-jews/", "https://www.nytimes.com/2021/02/04/world/middleeast/israel-palestinians-vaccine.html?searchResultPosition=2", "https://www.msnbc.com/opinion/netanyahu-s-covid-plan-even-more-racist-trump-s-n1257283", "https://www.haaretz.com/israel-news/bernie-sanders-slams-israel-for-sending-covid-vaccines-to-allies-before-palestinians-1.9567856", "https://jstreet.org/press-releases/israels-impressive-vaccination-efforts-are-commendable-israel-also-obligated-to-work-with-pa-to-ensure-palestinians-in-occupied-territories-receive-vaccines/#.YDhEIRNKh0s", "https://twitter.com/jvplive/status/1363530385309663239", "https://www.nytimes.com/2021/02/23/world/middleeast/israel-palestinians-vaccine-diplomacy.html?searchResultPosition=1", "https://twitter.com/camanpour/status/1349802199388401666?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1349802199388401666%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.israelnationalnews.com%2FNews%2FNews.aspx%2F294947", "https://www.breakingisraelnews.com/sign-up-here/#fI26J4dDCSKsIZ6i.97", "https://www.timesofisrael.com/abbas-vetoes-israeli-vaccination-station-on-temple-mount-report/", "https://www.jns.org/opinion/whos-legitimizing-the-vaccine-blood-libel/"], "authors": ["Jonathan S. Tobin"], "publish_date": "2021-03-02T00:00:00+00:00"}