{"result_id": "177001", "URL": "https://www.israel365news.com/347965/unique-study-in-jerusalem-medical-center-that-delivers-more-babies-than-any-other-finds-covid-19-vaccine-significantly-protects-mothers-and-infants/", "timestamp": "2023-04-25 15:43:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/347965/unique-study-in-jerusalem-medical-center-that-delivers-more-babies-than-any-other-finds-covid-19-vaccine-significantly-protects-mothers-and-infants/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Unique study in Jerusalem medical center that delivers more babies than any other finds COVID-19 vaccine significantly protects mothers and infants", "cleaned_text": "The ultra-Orthodox (haredi) and Arab populations especially in Israel and couples around the world have been particularly concerned about whether the highly successful mRNA vaccines have a harmful effect on fertility. As a result, they have been a tough nut to crack when health officials pleaded for everyone to be vaccinated.\n\nBut there is no reason at all to worry, according to a first-of its-kind study at Jerusalem’s Shaare Zedek Medical Center, which delivers more Israeli babies than any other hospital in the country. They conducted an extensive examination and follow-up of 3,000 women during the course of their pregnancies and of their newborn babies and found that pregnant women who were vaccinated with the Pfizer vaccine suffered significantly fewer pregnancy complications than unvaccinated pregnant women who were infected with the virus.\n\nIn addition, among the babies of women who declined to be vaccinated and were infected was an increase in neonatal respiratory complications compared to infants born to women who were vaccinated during pregnancy.\n\nNo difference was found between the health status of women who chose to be vaccinated against corona and women who were not vaccinated but did not get infected. A cross-examination of the study findings with another study conducted by Shaare Zedek researchers in pregnant women showed a higher rate of preterm delivery compared to women who were vaccinated and an increase in the number of intensive care and respiratory complications in the newborns of such unvaccinated women.\n\nThe study was led by Dr. Misgav Rottenstreich, a senior physician in the hospital’s obstetrics and gynecology department, and Prof. Sorina Grisaru-Granovsky, head of the maternity and newborn branch, who examined various pregnancy complications for mothers and newborns in 700 pregnant women vaccinated in the third trimester of pregnancy.\n\nThe data were compared with data collected in parallel on 1,000 pregnant women who were not vaccinated and did not become ill and about 1,000 women who recovered from corona during pregnancy. The findings show that a high rate of pregnant women chose to be vaccinated and that the vaccine is safe.\n\nThe researchers also found that vaccination does absolutely no harm to a pregnancy, does not adversely affect the date of birth, birthweight and type of delivery. The study compared parameters of cesarean section, preterm birth, hospitalization in the neonatal intensive care unit and respiratory complications.\n\nNo difference was found between the immunized group and the group of women who did not become ill and were not vaccinated in the number of cases of pre-mature birth, which was 2.8% in the two groups. In the recovery group, on the other hand, it was 3.4%.\n\nAlso, in the neonatal intensive care unit, 4.1% of the were hospitalizations of babies born to women in the vaccinated group, compared with 4.5% in the group of women who chose not to be vaccinated. In contrast, in the group of women who had been infected with the virus, the researchers found an increase of about one percent with a rate of 5.2% of neonatal hospitalizations of the group of women recovering from the virus.\n\nAbout 0.8% of all newborns born to the vaccinated women group needed postpartum respiratory assistance, compared to 1.5% in the group of women who were not vaccinated and 1.1% in the group of women who recovered from corona during pregnancy.\n\nThey also tested the pregnant women for high blood pressure; these patients included cases of preeclampsia, a pregnancy complication involving high blood pressure and signs of damage to another organ system, most often the liver and kidneys; it usually begins after 20 weeks of pregnancy in women whose blood pressure had been normal.\n\nThey found that preeclampsia occurred in just 1.4% of the vaccinated women, compared to 1.8% in the unvaccinated group and 1.2% in women who had recovered from COVID-19.\n\nThere were no significant differences among women in the number of bacterial infections around childbirth – 3.2% among the vaccinated compared to 3.4% in the non-vaccinated group and 3.2% in the group of women who recovered from corona. Intrauterine fetal death was 0.7% of fetuses in women who were vaccinated compared to 0.5% in the unvaccinated group and 0.7% in the group of women who recovered from coronavirus.\n\nGrisaru-Granovsky commented that COVID-19 can be more dangerous for both pregnant women and their newborns compared to women who are not pregnant. “The vaccine is clearly beneficial for pregnant women and makes it possible for them continue with their normal lives and not to be isolated. In all age groups, we saw cases of pregnant women with complications of pregnancy and those who are obese or have other chronic diseases and had great difficulty in isolation and as a result did not undergo examinations and testing on a regular basis. With our new data, we can say without hesitation that all pregnant women should go and get fully vaccinated.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Unique study in Jerusalem medical center that delivers more babies than any other finds COVID-19 vaccine significantly protects mothers and infants", "description": "In addition, among the babies of women who declined to be vaccinated and were infected was an increase in neonatal respiratory complications compared to infants born to women who were vaccinated during pregnancy. ", "url": "https://www.israel365news.com/347965/unique-study-in-jerusalem-medical-center-that-delivers-more-babies-than-any-other-finds-covid-19-vaccine-significantly-protects-mothers-and-infants/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-08-25T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/צוות-החוקרים-מאגף-נשים-scaled-1.jpg", "image:width": "1024", "image:height": "577", "image:type": "image/jpeg"}, "tags": ["Medical/Science"], "tweets": [], "movies": [], "links": [], "authors": ["Judy Siegel-Itzkovich"], "publish_date": "2021-08-25T00:00:00+00:00"}