{"result_id": "177013", "URL": "https://www.israel365news.com/160974/netanyahu-promises-israelis-as-many-vaccines-as-possible-following-moderna-announcement/?fb_comment_id=3444405312311258_3446139032137886", "timestamp": "2023-04-25 15:43:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/341908/netanyahu-promises-israelis-as-many-vaccines-as-possible-following-moderna-announcement/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Netanyahu promises Israelis ‘as many vaccines as possible’ following Moderna announcement", "cleaned_text": "Israeli Prime Minister Benjamin Netanyahu voiced his optimism on Monday that the country’s coronavirus crisis could soon be over, after drug maker Moderna announced that testing had shown its SARS-CoV-2 vaccine to be highly effective.\n\n“This is great news for Israel,” said Netanyahu shortly after the announcement. “Already in June I, along with Health Minister Yuli Edelstein, instructed that an agreement be signed with Moderna for the supply of vaccines. Today, Moderna informed us that its vaccine has an efficacy of 94.5 percent.”\n\nNetanyahu said that his goal is “to bring as many vaccines as possible, from as many sources as possible, to as many citizens as possible—and as soon as possible.”\n\nModerna’s announcement comes just days after pharmaceutical giant Pfizer declared that its vaccine had an efficacy of more than 90 percent.\n\nIsrael signed an agreement with Pfizer last week guaranteeing it will be among the first countries to receive the vaccine once it is developed and approved. Netanyahu said that Pfizer’s vaccine will start arriving in Israel as early as January 2021.\n\nThe two vaccines are different in terms of their storage requirements. The Pfizer vials require storage at much colder temperatures, which could complicate their shipment to Israel.\n\nIsrael is also casting a wider net in its quest to secure a COVID-19 vaccine, approaching Russia on Monday to discuss buying its Sputnik V vaccine.\n\n“About an hour ago I spoke with Russian President Vladmir Putin regarding the possibility of purchasing an option on the vaccine Sputnik-V,” Netanyahu told reporters. “We will discuss this in the coming days.”\n\nLast week Russia stated that in accordance with interim data during the third stage of clinical trials, the vaccine was effective in 92 percent of cases.\n\nThe Kremlin issued a statement saying Putin and Netanyahu had discussed potential cooperation regarding the Russian vaccine, including supplying it to Israel and even producing it in the Jewish state.\n\nIsrael is also developing its own vaccine, called BriLife, which could potentially be market-ready by the end of the summer.\n\n“My goal is to bring as many vaccines from as many sources to as many citizens, as quickly as possible,” Netanyahu said.", "opengraph": {"locale": "en_US", "type": "article", "title": "Netanyahu promises Israelis ‘as many vaccines as possible’ following Moderna announcement", "description": "The goal is to get “as many vaccines as possible, from as many sources as possible, to as many citizens as possible—and as soon as possible,” says Israeli premier.", "url": "https://www.israel365news.com/341908/netanyahu-promises-israelis-as-many-vaccines-as-possible-following-moderna-announcement/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2020-11-17T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_1202899969.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Coronavirus"], "tweets": [], "movies": [], "links": [], "authors": ["JNS"], "publish_date": "2020-11-17T00:00:00+00:00"}