{"result_id": "177042", "URL": "https://www.israel365news.com/336602/through-miraculous-coincidence-israel-may-have-coronavirus-vaccine-ready-in-90-days/", "timestamp": "2023-04-25 15:44:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/336602/through-miraculous-coincidence-israel-may-have-coronavirus-vaccine-ready-in-90-days/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Challenge Issued to BDS: Through A Miraculous Coincidence, Israel May Have Coronavirus Vaccine Ready in 90 Days", "cleaned_text": "An Israeli company announced on Thursday that it may develop a vaccine for the coronavirus within a few weeks and another Israeli company has a diagnostic kit ready to go.\n\nMaayan Jaffe-Hoffman of J-Post reported on Thursday that Science and Technology Minister Ofir Akunis announced that the vaccine may be ready in a few weeks and will be ready for use by the general public in as little as 90 days.\n\n“Congratulations to MIGAL [The Galilee Research Institute] on this exciting breakthrough,” Akunis said. “I am confident there will be further rapid progress, enabling us to provide a needed response to the grave global COVID-19 threat,” Akunis said, referring to the respiratory disease caused by the coronavirus.\n\nIf the team succeeds in discovering the vaccine, it will be the product of amazing serendipity. The company wrote on its website that they have been working for the past four years towards developing a vaccine against a form of coronavirus which infects chickens called avian coronavirus Infectious Bronchitis Virus (IBV).\n\n“Our basic concept was to develop the technology and not specifically a vaccine for this kind or that kind of virus,” said Dr. Chen Katz, MIGAL’s biotechnology group leader, told J-Post. “Let’s call it pure luck. We decided to choose coronavirus as a model for our system just as a proof of concept for our technology.”\n\nFrom research conducted at MIGAL, it has been found that the poultry coronavirus has high genetic similarity to the human COVID-19, and that it uses the same infection mechanism, a fact that increases the likelihood of achieving an effective human vaccine in a very short period of time.\n\nThe vaccine’s effectiveness has been proven in pre-clinical trials carried out at the Volcani Institute. MIGAL has now made required genetic adjustments to adapt the vaccine to COVID-19, the human strain of coronavirus, and is working to achieve the safety approvals that will enable in-vivo testing, enable the initiation of production of a vaccine to counter the Coronavirus epidemic.\n\nCommenting on the news, David Zigdon, CEO of MIGAL GALILEE RESEARCH INSTITUTE, said, “Given the urgent global need for a human coronavirus vaccine, we are doing everything we can to accelerate development. Our goal is to produce the vaccine during the next 8-10 weeks, and to achieve safety approval in 90 days. This will be an oral vaccine, making it particularly accessible to the general public. We are currently in intensive discussions with potential partners that can help accelerate the in-human trials phase and expedite the completion of the final product development and regulatory activities.”\n\nMinister Akunis instructed the Director-General of the Ministry of Science and Technology to fast-track all approval processes with the goal of bringing the human vaccine to market as quickly as possible.\n\nIn conjunction with this miraculous discovery, another Israeli firm announced on Thursday that its biomedical division developed a new rapid and accurate diagnostics kit for the COVID-19 novel coronavirus. BATM Advanced, a leading provider of technologies for medical laboratory system based in Hod Hasharon, said in a release that “the kit has undergone testing by several central laboratories and hospitals that have now verified its ability to diagnose COVID-19.”\n\n“This kit has undergone testing by several central laboratories and hospitals that have now verified its ability to diagnose COVID-19,” the company said in a statement. “The Group has commenced production of the kit at its Adaltis facility in Rome. BATM is working with academic and research institutions, mainly in Europe, to progress the kit to make it at a price point suitable for large scale production. The kit, which supports all the Centers for Disease Control and Prevention (CDC) recommendations, has already received interest from customers in several countries.”\n\nThe current methods being used to test for the virus is an involved process that takes several days at least. There have been more than 80,000 cases of Covid-19, the disease caused by the coronavirus, and 2,700 deaths.\n\nThe virus was named for its appearance. During their research, scientists used microscopes to photograph the virus and the name comes from its shape, which resembles a crown when imaged, a fact which led Rabbi Aryeh Lipo, a religious studies teacher who ran for the Likud in 2014, to an insight on the cause of the pandemic.\n\n‘corona’ means, in every language, a crown,” Rabbi Lipo said. “The disease has come to remind us that the true crown of the world is missing. What will stop the coronavirus was taught to us by King David.”\n\n“May it be God’s will that we merit to build a crown and palace for the One King,” Rabbi Lipo said. “God willing, this crown will protect the world from the corona.”\n\nusing an electron microscope. Corona is Latin for ‘Crown’.\n\nAmerican Jewish Committee CEO David Harris threw down the gauntlet to the Boycott Divestment Sanctions (BDS) movement in a tweet.\n\n\n\n Seth Mandel, a conservative American author who is Jewish, tweeted a taunt to the BDS movement.", "opengraph": {"locale": "en_US", "type": "article", "title": "Challenge Issued to BDS: Through A Miraculous Coincidence, Israel May Have Coronavirus Vaccine Ready in 90 Days", "description": "Jewish leaders issue challenges to BDS after Israeli companies take the lead in battling the coronavirus.", "url": "https://www.israel365news.com/336602/through-miraculous-coincidence-israel-may-have-coronavirus-vaccine-ready-in-90-days/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:author": "https://www.facebook.com/adameliyahu", "article:published_time": "2020-02-28T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_1658048668.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Uncategorized", "Health and Science"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">As <a href=\"https://twitter.com/hashtag/coronavirus?src=hash&amp;ref_src=twsrc%5Etfw\">#coronavirus</a> spreads, Israeli researchers seek ways to combat it.</p>\n<p>Once again, <a href=\"https://twitter.com/hashtag/Israel?src=hash&amp;ref_src=twsrc%5Etfw\">#Israel</a> is helping advance the frontiers of human knowledge &amp; make the world a better place. <a href=\"https://twitter.com/hashtag/BDS?src=hash&amp;ref_src=twsrc%5Etfw\">#BDS</a> supporters, will you boycott any new Israeli anti-coronavirus medicines? <a href=\"https://t.co/yM5sT6twB4\">https://t.co/yM5sT6twB4</a></p>\n<p>— David Harris (@DavidHarrisAJC) <a href=\"https://twitter.com/DavidHarrisAJC/status/1232985650485432321?ref_src=twsrc%5Etfw\">February 27, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Good luck boycotting this, anti-Semites.<a href=\"https://t.co/IC2L21Cb9z\">https://t.co/IC2L21Cb9z</a></p>\n<p>— Jewish Journal (@JewishJournal) <a href=\"https://twitter.com/JewishJournal/status/1233210949210787840?ref_src=twsrc%5Etfw\">February 28, 2020</a></p></blockquote>\n"], "movies": [], "links": ["https://www.jpost.com/HEALTH-SCIENCE/Israeli-scientists-In-three-weeks-we-will-have-coronavirus-vaccine-619101", "https://www.migal.org.il/Migal.covid", "https://www.batm.com/", "https://www.www.israel365news.com/144383/kabbalah-expert-links-coronavirus-to-divine-punishment-for-chinas-modern-day-death-of-firstborn-plague/", "https://theisraelbible.com/glossary/david/", "https://theisraelbible.com/glossary/yisrael/", "https://theisraelbible.com/bible/2-samuel/chapter-24#verse-24", "https://twitter.com/hashtag/coronavirus?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Israel?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/BDS?src=hash&ref_src=twsrc%5Etfw", "https://t.co/yM5sT6twB4", "https://twitter.com/DavidHarrisAJC/status/1232985650485432321?ref_src=twsrc%5Etfw", "https://t.co/IC2L21Cb9z", "https://twitter.com/JewishJournal/status/1233210949210787840?ref_src=twsrc%5Etfw"], "authors": ["Adam Eliyahu Berkowitz"], "publish_date": "2020-02-28T00:00:00+00:00"}