{"result_id": "177035", "URL": "https://www.israel365news.com/342247/covid-is-product-of-amalek-but-it-will-also-usher-in-messiahs-arrival-kabalist-rabbi-says/", "timestamp": "2023-04-25 15:44:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/342247/covid-is-product-of-amalek-but-it-will-also-usher-in-messiahs-arrival-kabalist-rabbi-says/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "'Covid is Product of Amalek: But it will also Usher in Messiah's arrival' Kabalist Rabbi says", "cleaned_text": "In a recent talk given in Tzfat, one of Israel’s four holiest cities, Rabbi Alon Anava argues that COVID-19, and especially all the confusion and controversies surrounding it, are the work of the Biblical Amalek in order to distract the Jewish people and the rest of the world from focusing on the impending redemption.\n\nAnava explains the history of Amalek, the eternal enemy of the Jewish people. “Every time there’s a redemption coming, Amalek has to show up.\n\n\n\n “We went out of Mitzrayim (Egypt), Amalek shows up. In the story of Purim (Book of Esther), Haman is a descendent of Amalek. Every time, before the redemption comes, before there’s a geula (redemption), comes someone from zera Amalek, from the descendants of Amalek, and comes and causes problems, to a point close to annihilation, like Hitler yemach shemo (may his name be erased). [He is] another one from zera Amalek.\n\n \n\n Anava further explained that the numerical value of Amalek and safek, the Hebrew word for doubt, are the same (240). “What is the power of Amalek? It’s to put doubt into a person… Doubt will cause confusion and confusion will cause many other problems.”\n\n \n\n For the Jewish people, there is a commandment in the Torah to wipe out the memory of Amalek.\n\nAnava reminds his students that Moshiach will come and destroy Amalek completely.\n\nTHIS IS AN IMPORTANT YEAR FOR REDEMPTION\n\n\n\n The numerical value of Israel (541) and Amalek (240) equals 781, which are the last three numbers of the current Hebrew year – 5781. “This is the first hint that this is going to be the year that is going to be the final clash between Israel and Amalek.”\n\n\n\n\n\n Anava urges his listeners to not get distracted by the unresolved presidential elections in the US and the COVID vaccine. Rather, the coming battle between the Nation of Israel and Amalek is where we should be focusing. \n\n \n\n He explains that, whether he knows his destiny or not, the man who will be Moshiach (Messiah) is definitely already alive and waiting for what the prophet Isaiah explained will happen to him.\n\n“There’s going to be a man. He’s going to get a Godly revelation. The spirit of God is going to rest upon him and he’s going to come and redeem us.”\n\nCONFUSION OVER COVID-19 IS THE WORK OF AMALEK\n\nTurning his attention to our times, Anava calls COVID-19, “a genetically modified virus in a lab. It was planned for many, many years. What’s taken the world by storm is a little, invisible virus.”\n\nHe explains that the media has made things look much worse than they are in reality. “The media is pumping up something [tiny]. People are looking at the media 24/7 and they believe that… This is exactly what Amalek does to make something appear in a certain way. Amalek is a master of making everything look way out of proportion. And that’s what’s going on now.\n\n \n\n “There’s a virus… and it’s totally taken out of proportion… It’s all sheker (lies and deception). It’s one big show,” he asserts.\n\n \n\n In essence, Anava’s claim is that the coronavirus, or, more specifically, the media hype around the coronavirus, is designed to confuse people and introduce doubt into their minds. This is the work of Amalek.\n\n“That’s the main problem,” he claims. People don’t know what to believe. This is the work of Amalek. And the confusion over the coronavirus is just the beginning, according to Anava. “Watch what’s coming. There is going to be a lot of confusion.”\n\nNoting that, “the main test before redemption is going to be emunah (faith)… We will see such things that even observant Jews and righteous gentiles will question if God exists.\n\n \n\n “Amalek is not coming with an F-16. He’s coming with a suit. And he’s coming so deep into your conscious and subconscious that you’re going to start doubting… We have to be very careful that we don’t fall into that place. \n\n \n\n “Amalek is the one who’s fighting us. He’s fighting us in our mind [and] he’s fighting us in our hearts.”\n\nWHAT HAPPENS JUST BEFORE REDEMPTION?\n\n“We’ve been waiting thousands of years for the suffering of this exile to finish and knowing what we’re looking at, helps [us] to cope with the situation.”\n\nThe simple meaning of this verse is that God is going to take revenge against the evil people from nations that went against the Nation of Israel for thousands of years.\n\n“We know based on many holy books that right before Moshiach (Messiah) is going to come, Hashem (God) is going to bring back into the world [in new incarnations] all the wicked people from history – Nimrod [the leader of the people who rebelled against God and built the Tower of Babel], Nebuchadnezzar [the king who destroyed the First Temple and sent the Jews into captivity in Babylonian], and Paro [the Egyptian Pharaoh]… you name it! They are all here. \n\n \n\n “Titus [the Roman ruler who destroyed the Second Temple and captured Jerusalem] is here, Sancherev [known as Sennacherib who tried to destroy Jerusalem in the time of King Hezekiah] – everyone! They are all here. And each one fell into a body.\n\n \n\n “Why? So the Kadosh Baruch Hu (God) is going to put them altogether in one place to do a nekama (a revenge). And that’s where you see, really, what’s going on in the world.”\n\nWHAT SHOULD WE DO TO PREPARE FOR REDEMPTION?\n\n\n\n \n\n “When a person is in a good, healthy state, it’s easier to fight. Now we are all weakened. Our emotional state is very vulnerable right now. \n\n \n\n “The only solution is to strengthen yourself spiritually, and to understand it’s almost over. Don’t fall into distress and fear. Keep your mind focused. Don’t get distracted. The distractions are coming like winds to throw you from one side to the other. You have to be very, very focused.\n\n \n\n “The power of Israel over Amalek is only Torah. That’s your only weapon. Sit and learn Torah, as much as you can handle.” He also recommends prayer, charitable acts and working on oneself. \n\n \n\n “Don’t fall into the traps. Amalek is putting traps on Facebook, on CNN, on Twitter. It’s everywhere. The traps are all over the place and it’s very easy to be fooled. \n\n \n\n Focus on what you need to focus on. You’ll see it doesn’t affect you as much. Clear your mind. Don’t go after your desires. Don’t be convinced. It’s one big illusion,” he concluded.\n\n \n\n The lecture is entitled “Don’t Believe The Lies!” It was published on YouTube on November 29, 2020 and had more than 31,000 views at press time.", "opengraph": {"locale": "en_US", "type": "article", "title": "'Covid is Product of Amalek: But it will also Usher in Messiah's arrival' Kabalist Rabbi says", "description": "“Amalek is not coming with an F-16. He’s coming with a suit. And he’s coming so deep into your conscious and subconscious that you’re going to start doubting… We have to be very careful that we don’t fall into that place.", "url": "https://www.israel365news.com/342247/covid-is-product-of-amalek-but-it-will-also-usher-in-messiahs-arrival-kabalist-rabbi-says/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2020-12-03T00:00:00+00:00", "article:modified_time": "2022-11-01T00:49:21+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_1723264393.png", "image:width": "660", "image:height": "330", "image:type": "image/png"}, "tags": ["noads", "coronavirus", "Biblical News"], "tweets": [], "movies": [], "links": ["https://www.www.israel365news.com/160732/bible-codes-reveal-current-us-election-deadlock-how-it-can-end-in-mass-deaths-worldwide/", "https://theisraelbible.com/glossary/amalek/", "https://theisraelbible.com/glossary/yisrael/", "https://theisraelbible.com/glossary/rfidim/", "https://theisraelbible.com/bible/exodus/chapter-17#verse-8", "https://theisraelbible.com/bible/exodus/chapter-17#verse-8", "https://theisraelbible.com/glossary/amalek/", "https://theisraelbible.com/bible/deuteronomy/chapter-25#verse-19", "https://www.www.israel365news.com/160732/bible-codes-reveal-current-us-election-deadlock-how-it-can-end-in-mass-deaths-worldwide/", "https://www.www.israel365news.com/161598/israels-health-minister-admits-he-doesnt-want-to-be-first-to-receive-covid-vaccine/", "https://theisraelbible.com/bible/isaiah/chapter-11#verse-2", "https://theisraelbible.com/bible/isaiah/chapter-63#verse-4", "https://www.www.israel365news.com/161439/mystic-rabbi-covid-lockdown-is-king-davids-prophecy-in-time-for-messiah/", "https://youtu.be/S6NpSzHZWf8"], "authors": ["Rivkah Lambert Adler"], "publish_date": "2020-12-03T00:00:00+00:00"}