{"result_id": "177003", "URL": "https://www.israel365news.com/199396/time-for-both-parties-to-repent-for-their-nazi-analogies-opinion/", "timestamp": "2023-04-25 15:43:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "http://www.israel365news.com/348362/time-for-both-parties-to-repent-for-their-nazi-analogies-opinion/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Time for Both Parties to Repent for their Nazi Analogies", "cleaned_text": "After a generation in which Holocaust education has proliferated in the United States, it’s fair to ask whether all that lip service paid to the memory of the Six Million has done as much harm as good. Far from reinforcing the truth about the singularity of the attempt by the German Nazis and their collaborators to exterminate the Jewish people, the greater familiarity with it has turned it into a one-size-fits-all metaphor for anything that Americans currently oppose.\n\nThe latest to prove this was Josh Mandel, a candidate for an Ohio Senate seat in next year’s midterm elections.\n\nMandel, a former Ohio State Treasurer, lost a race for the U.S. Senate in 2012. He now hopes to replace Sen. Rob Portman (R-Ohio), who is retiring next year. A decade ago, Mandel was one of his party’s shining young stars, a Marine veteran who served in Iraq as well as someone whose identity as a proud Jew was very much part of his public image. But he is not currently considered the frontrunner for the GOP nomination and faces stiff competition from others on the right, principally author J.D. Vance. As a result, he is trying to stand out in the primary race as the most ardent supporter of former President Donald Trump. That’s the context for Mandel’s decision to come out against the coronavirus vaccine mandates that are being promoted by the Biden administration.\n\nAnyone who encourages Americans not to be vaccinated is doing the nation a grave disservice during a public health emergency. It’s also odd, although perhaps inevitable in our present-day polarized political culture, that Trump acolytes like Mandel are going down this road. The former president deserves credit for policies that prioritized vaccines and rushed them into production—something that made this year’s mass vaccination numbers possible. Trump also has been vocal about urging people to take them.\n\nIt’s possible to argue that attempts to force citizens to get vaccinated are unconstitutional. Broad mandates that would—as is the case in places like New York City—essentially ban the unvaccinated from every manner of public place and event may be considered legal by the courts. But they will also have the sort of disparate impact on minorities, including African-Americans who have lower vaccination rates than other ethnic groups, that would in any other context be labeled as racist.\n\nYet while the issue is worthy of debate, many opponents of the policy have not been able to resist the temptation to overstate their case and to make comparisons that are, to put it charitably, wildly inappropriate. And Mandel appears to have become the poster child for this fault.\n\nIn a short speech he posted on Twitter, Mandel posed in front of a “Trump for President” sign in an Ohio cornfield and not only questioned Biden’s right to be president but compared mandates to Nazi tactics. After urging the U.S. Supreme Court to strike down Biden’s order as unconstitutional, Mandel went on to say that “if they don’t, I call on my fellow Americans, do not comply. Do not comply with the tyranny, and when the Gestapo show up at your front door, you know what to do.”\n\nIf Mandel wanted to get some public attention for his campaign, he succeeded. The video of his comments has already gotten more than a million views. Yet he’s also been roasted not only by liberal media outlets but also Jewish organizations like the Anti-Defamation League and the American Jewish Committee, which rightly noted that comparing Biden or vaccine mandates to Nazi Germany is both wrongheaded and deeply offensive.\n\nHe’s not the only one on the right to demonstrate again “Godwin’s law” that the longer any argument lasts, the more likely it is a mathematical probability that someone will stupidly analogize the issue at hand to the Nazis. Rep. Marjorie Taylor Greene (R-Ga.), who was punished by House Democrats for her past embrace of QAnon conspiracy theories, compared the mandates to crimes against humanity, such as Nazi medical experiments on Holocaust victims. While Mandel’s “Gestapo” comment is not quite as crazy as that crackpot claim, it is still an atrocious assertion and one that both undermines his case about the mandates as well as cheapens the memory of the Holocaust.\n\nTo that, many on the right will point out what about the innumerable instances of liberals making offensive analogies about the Holocaust? Throughout the last six years since Trump entered politics, Nazi comparisons made about him have become commonplace. Jewish Democrats seemed to have adopted the rule that anyone I don’t like is Hitler.\n\nBut in the 2020 campaign, the Trump/GOP-Nazi analogies got out of hand. In September 2020, now President Joe Biden compared Trump to Nazi propagandist Joseph Goebbels. In response, all we heard from the ADL was crickets.\n\nYet even worse was to come. The Jewish Democratic Council of America released an Internet video ad in which the Trump-Nazi analogy was directly made. It’s hard to imagine a more inflammatory and deeply wrong-headed example of a group trying to exploit the Holocaust for political purposes. That’s especially true because, whatever his other failings, Trump deserved credit both for changing policies to take action against anti-Semitism on college campuses as well as his historic support of Israel.\n\nThis monstrous accusation was given a pass by leading liberal Jewish figures, including those who ought to have known better and who had in the past denounced those who did the same thing. Former ADL director Abe Foxman and Holocaust historian Deborah Lipstadt, who were likely thinking ahead to the competition to be the State Department Special Envoy to Combat and Monitor Anti-Semitism in a Biden administration, both betrayed their principles and gave this outrageous slur their approval. In the end, Lipstadt was the one who was rewarded for doing so when she was nominated for the job by Biden.\n\nIn a political culture where demonization of political foes is now universal, calling opponents horrible names is how both parties react to every controversy. The brazen hypocrisy of those who are all over Mandel but saw no problem when Democrats did the same thing is a function of partisanship and nothing else.\n\nStill, that doesn’t excuse Mandel, Taylor Greene or anyone else who is guilty of dragging the Holocaust into discussions where it doesn’t belong.\n\nIs there any way to reverse this trend in which both liberals and conservatives now regard comparisons to the Nazis and the Holocaust as merely a way to say something is really bad, rather than a reference to the greatest crime in human history?\n\nRight now, the answer is “no.”\n\nIn a world where Democrats would have been furious with Biden for crossing this line rather than applauding or winking at his offense and Republicans were prepared to do the same for similarly outrageous things said by Trump, we wouldn’t be having this conversation.\n\nBut we don’t live in such a world. Instead, Americans in both parties find themselves not merely deeply divided by political differences but actually believing that their opponents are thinly disguised authoritarians who, if given the opportunity, would re-enact Nazi tyranny against them. The way back from this dangerous precipice is unclear, though it will have to start with Jews—those with most at stake in the effort not to degrade the memory of the Holocaust—and their leading groups taking a consistent stand against these outrages. Until that happens, expect even more of these controversies. Sadly, the consequences of that failure in the battle against anti-Semitism are incalculable.", "opengraph": {"locale": "en_US", "type": "article", "title": "Time for Both Parties to Repent for their Nazi Analogies", "description": "A Jewish GOP Senate candidate was roasted for comparing vaccine mandates to the Gestapo. Democrats who have used such analogies about Republicans are not in a position to talk.", "url": "http://www.israel365news.com/348362/time-for-both-parties-to-repent-for-their-nazi-analogies-opinion/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-09-14T00:00:00+00:00", "article:modified_time": "2022-11-02T15:29:20+00:00", "image": "http://www.israel365news.com/wp-content/uploads/2022/10/josh-mandel-ohio.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Opinion", "antisemitism", "Donald Trump", "Josh Mandel", "Israel", "Holocaust"], "tweets": [], "movies": [], "links": ["https://www.usnews.com/news/national-news/articles/2021-03-17/trump-tells-followers-to-get-vaccinated-against-coronavirus", "https://www.kff.org/coronavirus-covid-19/issue-brief/latest-data-on-covid-19-vaccinations-race-ethnicity/", "https://www.newsweek.com/vaccine-mandates-will-have-disparate-impact-minorities-opinion-1619755?fbclid=IwAR34477XfjAChZPCBRkhbAqkDGI6riYnNhR9V-cfY8PFvN1LHhn5T9F4UZ4", "https://twitter.com/JoshMandelOhio/status/1436143658693185537?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1436143658693185537%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.newsweek.com%2Fjosh-mandel-blasts-gestapo-biden-administration-bizarre-cornfield-rant-1627849", "https://www.newsweek.com/deeply-offensive-video-senate-hopeful-likening-vaccine-mandates-gestapo-viewed-1m-times-1628167", "https://www.newsweek.com/marjorie-taylor-greene-invokes-nazi-era-medical-code-opposing-biden-vaccine-mandate-1627513", "https://www.www.israel365news.com/sign-up-here/#fI26J4dDCSKsIZ6i.97", "https://www.politico.com/news/2020/09/26/joe-biden-trump-joseph-goebbels-422047", "https://www.youtube.com/watch?v=0Zwj8Ir8mGk", "https://www.jns.org/biden-to-nominate-holocaust-historian-deborah-lipstadt-as-next-anti-semitism-envoy/", "https://www.jns.org/opinion/time-for-both-parties-to-repent-for-their-nazi-analogies/"], "authors": ["Jonathan S. Tobin"], "publish_date": "2021-09-14T00:00:00+00:00"}