{"result_id": "177020", "URL": "https://www.israel365news.com/351093/pfizer-ceo-to-israel-pharma-giant-making-yearly-covid-vaccine-to-take-forever-watch/", "timestamp": "2023-04-25 15:43:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "http://www.israel365news.com/351093/pfizer-ceo-to-israel-pharma-giant-making-yearly-covid-vaccine-to-take-forever-watch/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Pfizer CEO to Israel: Pharma giant making yearly COVID vaccine to take forever [Watch]", "cleaned_text": "Pharmaceutical giant Pfizer is working on developing a one-shot annual vaccine to replace its current vaccine, which loses its efficacy after three to six months and requires multiple booster shots, company CEO Albert Bourla told Israel’s Channel 12 on Saturday night.\n\nHe said that getting jabbed every four or five months “will not be a good scenario” and that having an annual shot, similar to the flu vacccine, “from a public health perspective, it is an ideal situation.”\n\nThe CEO noted that Pfizer is still on target to have an Omicron-specific vaccine by March, and that the company is also evaluating other types of offerings, including taking a fourth dose of the existing vaccine, increasing vaccine dosage and even a hybrid Delta-Omicron shot.\n\n“We want to cover all possible scenarios so we can protect, but of course time is ticking,” Bourla said.\n\nThe Omicron variant was discovered last month and since then it has spread rapidly around the world. In the United States, the seven-day daily average of cases is about 744,600 cases per day, Rochelle Walensky, the director of the Centers for Disease Control and Prevention, said Friday. In Israel, around 70,000 new cases have been diagnosed each day and health officials believe the real number is two or three times higher.\n\nBourla told Channel 12 that while he does not believe the virus will be eradicated but will be “with us for the years to come,” he does expect it to become more manageable, due to the tools developed by Pfizer and others.\n\n“I think we should be able to [live our] normal lives, and only if a variant like Omicron is a really different game, this is when we will have anomalies that we will be able to control in a few months,” Bourla said.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer CEO to Israel: Pharma giant making yearly COVID vaccine to take forever [Watch]", "description": "Pfizer CEO says he expects the COVID-19 virus to “be with us for the years to come,” but that barring another anomaly like Omicron, life should return to some form of normal within the next few months.", "url": "http://www.israel365news.com/351093/pfizer-ceo-to-israel-pharma-giant-making-yearly-covid-vaccine-to-take-forever-watch/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2022-01-24T00:00:00+00:00", "image": "http://www.israel365news.com/wp-content/uploads/2022/11/bourla-interview.png", "image:width": "750", "image:height": "331", "image:type": "image/png"}, "tags": ["Coronavirus", "Covid-19", "noads"], "tweets": [], "movies": [], "links": ["https://www.jns.org/israeli-hmo-reports-success-treating-covid-patients-with-paxlovid/"], "authors": ["JNS"], "publish_date": "2022-01-24T00:00:00+00:00"}