{"result_id": "177033", "URL": "https://www.israel365news.com/191222/israel-to-lift-most-coronavirus-restrictions-in-june/", "timestamp": "2023-04-25 15:44:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/345889/israel-to-lift-most-coronavirus-restrictions-in-june/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israel to lift most coronavirus restrictions in June", "cleaned_text": "Israeli Health Minister Yuli Edelstein announced on Sunday that in light of the country’s low and stable coronavirus morbidity figures, he will not seek an extension of the current pandemic-related restrictions, which are set to expire on June 1. This marks the first time that restrictions will have been fully lifted since the outbreak of the pandemic in Israel in March 2020.\n\nEdelstein said in a statement that discussions would be held over the next two weeks regarding the need to wear masks in enclosed spaces, and that pending a decision on this matter, the obligation will remain in force.\n\n“Israel is getting back to normal!” he exclaimed. “We began our vaccination campaign less than six months ago. Thanks to the outstanding work of health system personnel—HMOs, hospitals, MDA, Magen Israel and Health Ministry staff—and thanks to the amazing efforts of the citizens of Israel, we conducted the best vaccination campaign in the world.”\n\nWhile Israel has been enjoying the fruits of the campaign “for some time now,” he said, the challenge has been maintaining the low morbidity figures over time.\n\nTo that end, he continued, the Health Ministry had formulated an outline for the careful and gradual reopening of the economy.\n\n“And now, I am happy to announce that from a health perspective, it is possible to cancel the need for ‘green passes’ and ‘purple badges.’ The economy and the citizens of Israel will get a little more breathing room,” he said.\n\nHe emphasized, however, that should morbidity again begin to rise, restrictions would have to be put back in place.\n\nEdelstein also called on Israelis not to travel to countries with high morbidity, and urged them to heed the ministry’s travel warnings.\n\n“Even in countries to which travel is permitted, it is important to maintain social distancing,” he said, adding that upon returning to Israel, special attention had to be paid to the ministry’s directives.\n\nThe ministry on Sunday issued a severe travel warning for Argentina, Russia and the Seychelles. If morbidity figures in these countries do not improve “significantly,” the ministry said in a statement, they would join Ukraine, Ethiopia, Brazil, India, South Africa, Mexico and Turkey on the list of countries forbidden to Israeli travelers.\n\nThe ministry also warned against traveling to Africa and South and Central America, as well as to India, Greece, Egypt, Germany, Serbia, Poland, Croatia and Romania.\n\nOn May 23, Israel began allowing a limited number of vaccinated groups of tourists to enter the country, with the plan being to open up to an unlimited number of vaccinated groups in June, and to vaccinated individual travelers in July.\n\nSince the onset of its aggressive vaccination campaign, morbidity figures in Israel have plunged, with only 12 new cases being confirmed on Sunday, down from a high of 10,000 daily cases at the height of the outbreak.\n\n“It’s up to us to keep morbidity low,” said Edelstein.", "opengraph": {"locale": "en_US", "type": "article", "title": "Israel to lift most coronavirus restrictions in June", "description": "“Israel is getting back to normal,” says Minister of Health Yuli Edelstein.", "url": "https://www.israel365news.com/345889/israel-to-lift-most-coronavirus-restrictions-in-june/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-05-25T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/F210420YSPOOL51-880x495-1.jpg", "image:width": "880", "image:height": "495", "image:type": "image/jpeg"}, "tags": ["Coronavirus"], "tweets": [], "movies": [], "links": ["https://www.jns.org/israel-issues-severe-covid-travel-warning-for-argentina-russia-seychelles/", "https://www.jns.org/israel-to-start-reopening-to-tourism-beginning-in-may/"], "authors": ["JNS"], "publish_date": "2021-05-25T00:00:00+00:00"}