{"result_id": "177010", "URL": "https://www.israel365news.com/162339/rabbis-and-jewish-ethicists-praise-covid-vaccine-encourage-its-use/?fb_comment_id=4880476992024864_4883281741744389", "timestamp": "2023-04-25 15:43:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/342537/rabbis-and-jewish-ethicists-praise-covid-vaccine-encourage-its-use/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Rabbis and Jewish Ethicists Praise COVID Vaccine; Encourage Its Use", "cleaned_text": "This week, as the U.S. government launched the largest vaccine distribution program in the country’s history, rabbis and Jewish ethicists were united in support of the rollout to battle the coronavirus pandemic, stressing that vaccination is consistent with Judaism’s highest value: preserving life.\n\nOn Monday, an intensive-care nurse at the Long Island Jewish Medical Center, Sandra Lindsay, became one of the first Americans to get the new COVID-19 vaccine made by U. S. pharmaceutical giant Pfizer and its German partner, BioNTech.\n\nPfizer’s vaccine, deemed 95 percent effective in preventing symptomatic COVID-19 after two doses, is the first of several vaccines to receive approval from the U.S. Food and Drug Administration. Vaccines manufactured by Moderna, AstraZeneca and Johnson & Johnson are expected to receive the green light from the FDA in the coming weeks and months.\n\nThe Jewish authorities consulted for this story stressed that taking an FDA-approved vaccine is consistent with Judaism. Still, more than one poll has reported conflicted views about sectors of the Jewish public agreeing to get the vaccine, both in America and Israel.\n\nRabbi Shmuel Herzfeld of Ohev Sholom, an Orthodox synagogue in Washington, D.C., participated in the Moderna vaccine trial, posting video of himself receiving the shot to the video-sharing platform TikTok.\n\n“We have been given the Torah to live by its laws,” said Herzfeld. “The value of preserving life is the essential, axiomatic value of Judaism. Over the next few months, we encourage our communities to go—to run—when it’s their turn to get the vaccine.”\n\nHerzfeld’s participation in the clinical trial was an expression of religious faith and personal ethics. “I wanted to try to make a difference in whatever way I could to help those on the front lines fighting this virus,” he said. “It was important to me as a person of faith to embrace the gifts G-d has given us.\n\n“I believe the scientists are holy people,” he added, “and all the workers up and down the line who made the vaccines possible are incredible holy agents of our Creator.”\n\nOther rabbis echoed Herzfeld’s point about preserving and protecting life—both that of the individual and of others.\n\n“You can overturn virtually every law in the Torah to save life, and there’s no question that vaccination is overwhelmingly life-saving,” said Danny Schiff, a Reform rabbi and foundation scholar at the Jewish Federation of Greater Pittsburgh. “Vaccination does two things—it preserves your life and others.’ Judaism wants to preserve the well-being of the individual, and the idea is we also have a responsibility to each other.”\n\nRav Shoshana Mitrani Knapp, a New York-based spiritual leader and counselor ordained in the Conservative movement, said the idea expressed in Leviticus that “You shall love your neighbor as yourself” is consistent with the imperative to be vaccinated.\n\n“There’s a beautiful understanding in the Talmud that whoever sustains one soul has sustained the world,” she said, adding that “the web of connection between us and our fellow man or woman” is supported by Torah teachings, including the story of Cain and Abel in Genesis. “When Cain asks, ‘Am I my brother’s keeper?’ the answer is ‘Yes,’ and this is foundational.”\n\nRecommendations by the Centers for Disease Control and Prevention for the distribution of the vaccine list several groups in order of priority: health-care workers and nursing-home residents; other essential (non-health-care) workers; adults 65 years of age and up, along with those who have high-risk medical conditions; and then the general population. Rabbis and Jewish ethicists seem to agree with that.\n\nFrom both a “purely ethical” and utilitarian perspective, “you vaccinate most the vulnerable first—the elderly in nursing homes,” said Rabbi David Wolpe, the religious leader of Sinai Temple in Los Angeles, a conservative synagogue. Wolpe can see the argument, too, for prioritizing “frontlines workers who are forced out of their homes day after day.”\n\nSeveral praised the decision to prioritize the vaccination of essential workers in health care, agriculture, education, law enforcement, transportation, firefighting, food distribution and sanitation.\n\n“Both the government’s guidelines and Jewish law as I interpret it would have us save as many lives as possible,” said Rabbi Elliot Dorff, professor of philosophy at American Jewish University in Los Angeles. “I presume … non-health-care essential workers will get the vaccine before the elderly and those with medical conditions because people who stock grocery shelves and do other essential things to enable us to live need to be protected to do their jobs in the name of the communal good. … People can die of starvation as much as from COVID-19.”\n\nDorff theorized that seniors living independently and those with medical conditions like him (he has asthma) can take steps to try to avoid becoming infected, such as isolating until they can get the vaccine, “whereas essential workers have no choice but to endanger themselves to do their jobs.”\n\nWolpe noted that under the guidelines, “people who do what we used to call menial jobs but we now understand to be essential jobs,” such as janitors and sanitation workers, will “get precedence over people who have more money and can afford to wait. I think that’s a good thing for us to think about.”\n\nPeter Salk, a virologist and son of the late Jonas Salk, the pioneering scientist who developed the vaccine for polio at the University of Pittsburgh in the 1950s, said he supports the guidelines to “protect vulnerable people and people who are helping to keep society moving.”\n\nSalk spoke of the heavy toll of the pandemic on the African-American, Latino and Native American communities, pointing out that these sectors of society tend to be disproportionately represented among both essential workers and virus victims, and less likely to have the financial option of staying home to work.\n\nFrom an ethical perspective, Salk believes that it’s important to understand that past mistakes on the part of America’s medical establishment, such as the infamous 1932 Tuskegee study in which African-Americans were observed without their consent to assess the effects of untreated disease on a population, have contributed to people’s distrust.\n\n“Community leaders who are trusted will be most effective and needed now at helping people understand how these vaccines work,” honestly communicating any potential downside to taking them, and imparting “the positive impact they can have for an individual and … the community,” he said.\n\n‘Cure is its own compulsion’\n\nAs the COVID-19 vaccine rollout begins, authorities hope that enough Americans will take the vaccines to achieve herd immunity. While the exact threshold is unknown, experts estimate that between 75 percent and 85 percent of Americans will need to be vaccinated for that to be achieved. By some recent polls, as high a proportion as half of all Americans has said they have reservations about taking the vaccine.\n\nAllowing for medical exceptions, the Jewish value to preserve life would support mandating COVID-19 vaccination, if necessary, according to all rabbis and Jewish ethicists consulted for this piece.\n\nSome felt, however, that in a culture that prizes individual freedom, mandates could backfire.\n\nBecause vaccination protects both one’s own life and the lives of others, Jewish law “would allow the government to mandate a COVID-19 vaccine,” said Wolpe. However, he added that he thinks such a mandate “would not be a smart or productive strategy” in the United States, and thus should be a last resort. Education to promote voluntary participation is a better route, he believes, because on a practical level, Americans tend to rebel against mandates as an assault on their liberty.\n\n“Cure is its own compulsion,” said Wolpe. “If the vaccines work, that will be enough.”\n\nSalk also believes that, if successful, the vaccines will sell themselves to the American people.\n\n“People getting vaccinated [for COVID-19] will be protected from getting ill to a great extent; I think it will be obvious from the reality on the ground,” said Salk. “There are always going to be some who have a different point of view, but most will want to be vaccinated.”\n\nSalk added that the gradual pace of the rollout may have the added benefit of making people “want [the vaccine] more.”\n\nRabbi Yisroel Altein of Chabad Outreach in the Squirrel Hill neighborhood of Pittsburgh echoed a perspective heard from some other Americans, who according to polls favor a wait-and-see approach to taking the COVID-19 vaccine.\n\n“The Chassidic community is like the rest of the world, where you have all different voices, but in my experience, the majority of the community is looking to be safe and vaccinate in general,” said Altein. “The key is that the [coronavirus vaccine] is safe, and that obviously is up to the medical community. Seeing as that is what they are saying, I think it will be widely viewed as a way to protect everyone and try to get us through the pandemic already.”\n\nRabbi Mark Wildes, the founder of Manhattan Jewish Experience who works with Jewish singles in their 20’s and 30’s in New York, thinks that younger Americans will respond positively to opportunities to get the vaccine.\n\nIn addition to caring about older people and wanting “to do the right thing,” said Wildes, the young people with whom he works “want to go to work, to play sports, to date, to socialize, and if the vaccine is going to allow that, they are going to be flocking to it.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Rabbis and Jewish Ethicists Praise COVID Vaccine; Encourage Its Use", "description": "There’s no higher value in Judaism than protecting life itself, they say. Yet more than one poll has reported conflicting views about the public agreeing to get the vaccine, both in America and Israel.", "url": "https://www.israel365news.com/342537/rabbis-and-jewish-ethicists-praise-covid-vaccine-encourage-its-use/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2020-12-18T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/Pfizer-BioNTech_COVID-19_vaccine_2020_C_cropped-e1608238375537-880x495-1.jpg", "image:width": "880", "image:height": "495", "image:type": "image/jpeg"}, "tags": ["Coronavirus", "coronavirus"], "tweets": [], "movies": [], "links": ["https://www.jns.org/long-island-jewish-medical-center-site-of-one-of-first-injections-of-covid-vaccine/", "https://www.jns.org/as-race-for-coronavirus-vaccine-intensifies-americans-think-back-to-jonas-salk/", "https://apnews.com/article/ap-norc-poll-us-half-want-vaccine-shots-4d98dbfc0a64d60d52ac84c3065dac55", "https://www.foxnews.com/health/coronavirus-hesitancy-what-is-driving-it", "https://abcnews.go.com/Politics/americans-receive-covid-19-vaccine-divided-timing-poll/story?id=74703426"], "authors": ["JNS"], "publish_date": "2020-12-18T00:00:00+00:00"}