{"result_id": "177011", "URL": "https://www.israel365news.com/343858/one-dose-of-covid-19-vaccine-provokes-strong-immune-response-in-those-previously-infected/", "timestamp": "2023-04-25 15:43:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/343858/one-dose-of-covid-19-vaccine-provokes-strong-immune-response-in-those-previously-infected/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "One Dose of COVID-19 Vaccine Provokes Strong Immune Response in Those Previously Infected", "cleaned_text": "The massive COVID-19 vaccination campaign in Israel provides two shots to every resident at no cost, as recommended by the Pfizer pharmaceutical company that developed the vaccine. But in the US, England and elsewhere where inadequate supplies of vaccine are available (in the UK, the British AstraZeneca vaccine is the product provided), some have argued that everyone should be offered the first shot as quickly as possible, even if supplies for the second vaccination are not obtainable.\n\nAlthough clinical trial data are encouraging, real-world evidence with regard to the COVID19 vaccine remains scarce. In particular, response to the vaccine among those previously infected with SARS-CoV-2 is still not completely understood.\n\nA new study by researchers at Bar-Ilan University (BIU) in Ramat Gan (near Tel Aviv) and Ziv Medical Center in the northern city of Safed on 514 members of the hospital staff has discovered three important findings: One dose of COVID19 vaccine provokes a strong immune response in those previously infected; that a strong response was detected regardless of duration between infection and vaccination; and multi-ethnic groups exhibit a similar response to the vaccine.\n\nThe team reported preliminary evidence that people previously infected with the virus responded very strongly to one dose of the Pfizer vaccine, regardless of when they were infected and whether or not they had detectable antibodies against COVID19 prior to receiving the vaccine.\n\nTheir study was published in the journal Eurosurveillance under the title “Infection status on immunogenicity following a single dose of the BNT162b2 mRNA COVID-19 vaccine: real-world evidence from healthcare workers, Israel,” Seventeen of them were infected with COVID19 anytime between one and 10 months before receiving the first dose of the vaccine. Antibody levels of the entire cohort were measured prior to vaccination and thereafter to determine response to the vaccine.\n\nThe response among those previously infected was found to be so effective that it opens the debate as to whether one dose of the vaccine may suffice. “This finding can help countries make informed decisions regarding vaccine policy – for instance, whether those previously infected should be vaccinated in priority and, if so, with how many doses,” suggested Prof. Michael Edelstein of BIU’s Azrieli Faculty of Medicine who led the study. “It also offers reassurance that not having detectable antibodies after being infected does not necessarily mean that protection following infection is lost.”\n\nThe research also provided evidence that immune response was similar across multi-ethnic groups, whether they were Jews, Arabs or Druze, among others. The 350-bed Ziv Medical Center, where the study was conducted, is staffed by a workforce of numerous ethnic groups. Members of each of these responded very similarly to the first dose of the vaccine – a welcome finding considering the fact that the virus itself is known to affect some groups more than others.\n\nThe strong response to one dose of the vaccine among those previously infected regardless of how much time passed between infection and vaccination is good news. But the researchers stress that their findings must be confirmed in a larger cohort before reaching definitive conclusions. The researchers are continuing to follow healthcare workers after their second dose to better understand how long the vaccine will protect against COVID19 in different groups of people.\n\nAs of January 2021, Israel vaccinated 29.2% of its population with a single dose of vaccine – the highest proportion in the world, almost exclusively mRNA COVID-19 vaccine (Pfizer,\n\nNew York, United States (US) and BioNTech, Mainz,\n\nGermany). By the middle of February, 40 percent of the entire population of nine million have received at least the first shot (children and teens under the age of 16 have not received the shots, except for those at very high risk).\n\nBy January 21, 2021, 90% of the staff had received one dose of vaccine.\n\nThe study contained only a small number of previously infected people, as Israel’s Health Ministry guidelines recommended that these individuals are not prioritized for vaccination. Thus, findings from this study, the authors wrote, should be replicated on a larger scale so as to make policy decisions.", "opengraph": {"locale": "en_US", "type": "article", "title": "One Dose of COVID-19 Vaccine Provokes Strong Immune Response in Those Previously Infected", "description": "One dose of COVID19 vaccine provokes a strong immune response in those previously infected; that a strong response was detected regardless of duration between infection and vaccination; and multi-ethnic groups exhibit a similar response to the vaccine.", "url": "https://www.israel365news.com/343858/one-dose-of-covid-19-vaccine-provokes-strong-immune-response-in-those-previously-infected/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-02-11T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/F201223OF10-880x495-1.jpg", "image:width": "880", "image:height": "495", "image:type": "image/jpeg"}, "tags": ["Medical/Science"], "tweets": [], "movies": [], "links": [], "authors": ["Judy Siegel-Itzkovich"], "publish_date": "2021-02-11T00:00:00+00:00"}