{"result_id": "177023", "URL": "https://www.israel365news.com/348024/symptoms-of-serious-covid-cases-worse-than-side-effects-of-vaccine-israeli-study-finds/", "timestamp": "2023-04-25 15:43:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/348024/symptoms-of-serious-covid-cases-worse-than-side-effects-of-vaccine-israeli-study-finds/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Complications of serious Covid cases worse than side effects of vaccine, Israeli study finds", "cleaned_text": "The largest real-world, peer-reviewed study of COVID-19 vaccine safety published by Israel’s Clalit Research Institute has found that the complications and side effects from being infected with the corona virus outweigh by far the minimal and rare side effects caused by the Pfizer vaccine that has been given to nearly six million Israelis.\n\nThe study, just published in the prestigious New England Journal of Medicine under the title “Safety of the BNT162b2 mRNA COVID-19 vaccine in a Nationwide Setting,” was based on the Clalit health maintenance organization’s massive databank – one of the world’s largest integrated health record databases – and carried out with assistance from Harvard University researchers.\n\nIsrael was an early global leader in COVID-19 vaccination rates and is so far the only country to provide a free, third (booster) shot against COVID-19 to all residents from the age of 12 and up.\n\nPrevious efforts to characterize vaccine safety have relied on voluntary active reporting by vaccinated individuals, which is known to be incomplete. The present study relies on the analysis of millions of anonymized electronic medical records, which are far more comprehensive.\n\nIn addition, to provide the necessary context for interpreting vaccine safety findings, this study is the first to examine a wide range of adverse events both among vaccinated individuals and among unvaccinated people who were infected with the coronavirus. Thus, two separate analyses were conducted:\n\nAccording to the vaccination outcomes analysis, 884,828 vaccinated individuals aged 16 and over were carefully matched with 884,828 unvaccinated individuals based on an extensive set of sociodemographic, geographic and health-related attributes. They were assigned to each group dynamically based on their changing vaccination status (235,541 individuals moved from the unvaccinated cohort into the vaccinated cohort during the study). Rates of the 25 potential adverse events within three weeks following either vaccine dose were compared between the two groups. This analysis took place from December 20, 2020, the launch of Israel’s national vaccination campaign, through May 24, 2021.\n\nAccording to the study’s infection outcomes analysis, a separate analysis was conducted that estimated the rates of the same 25 potential adverse events among 173,106 unvaccinated individuals who were infected with the coronavirus, compared to 173,106 carefully matched controls who were not infected with the coronavirus. This analysis took place from March 1, 2020 (the beginning of the COVID-19 pandemic in Israel) through May 24, 2021.\n\nThe vaccine was found to be very safe. Out of 25 potential side effects examined, only four were found to have a strong association with the vaccine.\n\nMyocarditis was found to be associated with the vaccine, but rarely – only 2.7 excess cases per 100,000 vaccinated individuals. The myocarditis events observed after vaccination were concentrated in males between 20 and 34 and were all treated successfully. In contrast, coronavirus infection in unvaccinated individuals was associated with 11 excess cases of myocarditis per 100,000 infected individuals.\n\nOther adverse events moderately associated with vaccination were swelling of the lymph nodes, a mild side effect that is part of a standard immune response to vaccination, with 78 excess cases per 100,000, appendicitis with five excess cases per 100,000 (potentially as a result of swelling of lymph nodes around the appendix), and herpes zoster with 16 excess cases per 100,000.\n\nIn contrast to the relatively small number of adverse effects associated with the vaccine, high rates of multiple serious adverse events were associated with coronavirus infection among unvaccinated patients, including cardiac arrhythmias (irregular heartbeats – a 3.8-fold increase to an increase of 166 cases per 100,000 infected patients), kidney damage (14.8-fold increase; 125 excess cases per 100,000), pericarditis (5.4-fold increase; 11 excess cases per 100,000), pulmonary embolism (12.1-fold increase; 62 excess cases per 100,000), deep vein thrombosis (clots, 3.8-fold increase; 43 excess cases per 100,000), myocardial infarction (heart attack, 4.5-fold increase; 25 excess cases per 100,000), and stroke (2.1-fold increase; 14 excess cases per 100,000).\n\nThe research was conducted by Dr. Noam Barda, Dr. Noa Dagan, Yair Ben-Shlomo, Dr. Eldad Kepten, Dr. Jacob Waxman, Reut Ohana and Prof. Ran Balicer from the Clalit Research Institute, Dr. Doron Netzer of Clalit Health Services, as well as Prof. Miguel Hernán and Prof. Marc Lipsitch of Harvard’s Chan School of Public Health, Prof. Isaac Kohane of the department of biomedical informatics at Harvard Medical School, and Prof. Ben Reis of Boston Children’s Hospital and Harvard Medical School.\n\nThis study focused on adverse events that may develop in the short- to medium-term after vaccination and those with clinical significance. The study did not focus on common immediate symptoms such as redness and discomfort at the injection site or fever. Symptoms that occurred within six weeks of the vaccine (three weeks after each vaccine dose) were defined as an adverse event of the vaccine if they occurred more frequently among the vaccinated group compared to the control group.\n\nThe Israeli and American researchers declared that the results of their study validate and complement the previously reported findings of the Pfizer/BioNTech Phase-III randomized clinical trial, which, with 21,720 vaccinated individuals, could not precisely and comprehensively assess vaccine safety. The present study’s large size allows a more detailed assessment of the vaccine’s safety across a wider range of adverse events.\n\n“The extensive nationwide rollout of Israel’s COVID-19 vaccination campaign provided the Clalit Research Institute with a unique opportunity to assess, through its rich and comprehensive digital datasets, the safety of the vaccine in a real-world setting, without needing to rely on individual-driven active reporting of side-effects,” said Balicer, the senior author of the study who directors the Clalit Research Institute and is the HMO’s chief innovation officer. “These results show convincingly that this mRNA vaccine is very safe and that the alternative of ‘natural’ morbidity caused by the coronavirus puts a person at significant, higher and much more common risk of serious adverse events. These data should facilitate informed individual risk-benefit decision-making, and, in our view, make a strong argument in favor of opting-in to get vaccinated, especially in countries where the virus is currently widespread,” added Balicer, who also serves as chairman of Israel’s National Expert Advisory Team on COVID-19 response.\n\n“This study sheds light for the first time on the significant side effects of the coronavirus vaccine. Since this is a more comprehensive analysis based on electronic medical records, these are more reliable assessments than those published to date which have relied on voluntary active reporting systems,” explained Netzer, chief medical officer of Clalit’s Community Health Division.\n\nReis, director of the predictive medicine group at the Boston Children’s Hospital Computational Health Informatics Program and Harvard Medical School, added: “To date, one of the main drivers of vaccine hesitancy has been a lack of information regarding potential side effects of the vaccine. This careful epidemiological study provides reliable information on vaccine safety, which we hope will be helpful to those who have not yet decided about vaccination. Those who have hesitated until now to get vaccinated due to concerns about very rare side effects – such as myocarditis – should be aware that the risks for this very same side effect are actually higher among unvaccinated infected individuals.”\n\nHernán of Harvard’s Chan School of Public Health and director of its CAUSALab said: “This research is a perfect example of how randomized trials and observational healthcare databases complement each other. The original trial of the Pfizer/BioNTech vaccine provided evidence of its safety, but the estimates were too imprecise given the small sample size. This analysis of Clalit’s high-quality database emulates the design of the original trial, uses its findings as a benchmark and expands upon them to confirm the vaccine’s safety on a wide range of adverse events. This combination of evidence from randomized trials and observational studies is a model for efficient medical research, something which is especially important in COVID times.”\n\nChan School of Public Health Prof. Lipsitch, who is director of the Center for Communicable Disease Dynamics there, said, “In all studies of vaccine safety, a major challenge is to ensure that those we are comparing to identify the vaccine’s side effects are similar in the other characteristics that may predict whether they will experience these side effects. This is especially hard in the context of a rapidly growing, age-targeted vaccine campaign. Clalit’s extraordinary database made it possible to design a study that addressed these challenges in a way that provides tremendous confidence in the inferences that come out of the study.”\n\n“The strengthening of the scientific collaboration between Harvard and Clalit made possible by the Berkowitz Living Laboratory Collaboration is already bearing fruit and giving us a foretaste of the value of healthcare systems instrumented for research,” said Kohane, chairman of the department of biomedical informatics at Harvard Medical School and co-director of the Berkowitz Family Living Laboratory Collaboration along with Balicer, concluded: “Israel offers a unique environment in which to study the vaccine and its effects, and this study is an excellent example of what can be accomplished through such close scientific collaborations.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Complications of serious Covid cases worse than side effects of vaccine, Israeli study finds", "description": "This study focused on adverse events that may develop in the short- to medium-term after vaccination and those with clinical significance.", "url": "https://www.israel365news.com/348024/symptoms-of-serious-covid-cases-worse-than-side-effects-of-vaccine-israeli-study-finds/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-08-26T00:00:00+00:00", "article:modified_time": "2022-11-02T15:17:27+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/images.jpg", "image:width": "300", "image:height": "168", "image:type": "image/jpeg"}, "tags": ["Medical/Science"], "tweets": [], "movies": [], "links": [], "authors": ["Judy Siegel-Itzkovich"], "publish_date": "2021-08-26T00:00:00+00:00"}