{"result_id": "177009", "URL": "https://www.israel365news.com/342253/israel-to-receive-millions-of-doses-of-covid-vaccine/", "timestamp": "2023-04-25 15:43:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/342253/israel-to-receive-millions-of-doses-of-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "Israel to Receive Millions of Doses of COVID Vaccine", "cleaned_text": "Israel may receive up to four million doses of the COVID vaccine being produced by Pfizer by the end of this month beginning possibly as soon as next week. 200,000 to 500,000 doses are expected by the end of the month. The Israeli Health Ministry is preparing to inoculate up to 80,000 people per day as soon as the vaccine arrives. Though the US Food and Drug Administration has not yet approved the drug for general use, the Israeli Health Ministry is considering giving its approval regardless. Britain has approved the Pfizer vaccine.\n\nIsrael has already ordered eight million doses of vaccine from Pfizer, 10 million doses from the British firm AstraZeneca, and signed an agreement with the Moderna pharmaceutical company that ensures one million of Israeli citizens will receive its vaccine. A second agreement with Pfizer will supply vaccines for an additional four million people. The first to receive the vaccines are expected to be medical professionals and the elderly population.\n\nDr. Uri Feinstein, the head of the task force for vaccination efforts in the Health Ministry, confirmed this on Tuesday, saying that relatively few doses will arrive at first but many more will follow. He suggested that the Health Ministry may not approve non-FDA approved vaccinations. A Russian-made vaccine was ordered by Hadassah Medical Center in Jerusalem but it is unclear it will be approved for use in Israel.\n\nA vaccine developed by the Israel Institute for Biological Research is still in the testing stages. The Institute began vaccinating volunteers early last month, as part of a Phase I trial to see if the vaccine produces enough antibodies but the vaccine is not expected to be ready until the summer. Earlier in the week, the institute’s director general Prof. Shmuel Shapira voiced concerns to the Knesset Science and Technology Committee, expressing concern about over-regulation and the preference for foreign-made vaccines.\n\n“We don’t have strong enough backing,” Shapira said. “There is in Israel a very big tendency to give respect to companies whose mother tongue is English. We are not a company that is offering shares, there are no shares in the Institute. We are very very reliable. Our professional and ethical commitment is very high, and we keep our feet firmly on the ground.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Israel to Receive Millions of Doses of COVID Vaccine", "description": "Israel may receive up to four million doses of the COVID vaccine being produced by Pfizer by the end of this month beginning possibly as soon as next week.", "url": "https://www.israel365news.com/342253/israel-to-receive-millions-of-doses-of-covid-vaccine/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:author": "https://www.facebook.com/adameliyahu", "article:published_time": "2020-12-04T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/shutterstock_1506051596.png", "image:width": "660", "image:height": "330", "image:type": "image/png"}, "tags": ["Coronavirus", "Ministry of Health", "coronavirus"], "tweets": [], "movies": [], "links": [], "authors": ["Adam Eliyahu Berkowitz"], "publish_date": "2020-12-04T00:00:00+00:00"}