{"result_id": "177015", "URL": "https://www.israel365news.com/350183/93-israeli-doctors-petition-against-covid-vaccine-for-children-haste-is-from-the-devil/", "timestamp": "2023-04-25 15:43:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.israel365news.com/wp-content/uploads/2022/11/favicon-48x48.png", "canonical": "https://www.israel365news.com/350183/93-israeli-doctors-petition-against-covid-vaccine-for-children-haste-is-from-the-devil/", "encoding": "UTF-8"}, "image": null, "domain": "www.israel365news.com", "title": "93 Israeli doctors petition against Covid vaccine for children: \"Haste is from the Devil\"", "cleaned_text": "Ninety-three Israeli doctors have signed a petition calling to halt the administration of Coronavirus vaccines to children.\n\nIn the petition that reached Channel 12, that was submitted on Tuesday morning, the medical professionals explained that “There is no place to vaccinate children at this time,” and based their demand on “these values – the value of precaution, the value of humility”, and realizing that “haste is from the devil.” Additionally, they noted “recognizing that we don’t understand everything about the virus and the inoculation against it,” and “the first commandment of medicine – ‘First do no harm.'”\n\nThe letter’s signatories include Dr. Amir Shachar, head of the ER at Laniado Hospital, Dr. Yoav Yehezkeli, an expert in internal medicine and a lecturer at Tel Aviv University, and Dr. Avi Mizrahi, director of the intensive care unit at Kaplan Hospital.\n\nThe respected doctors penned the letter “to the heads of the Ministry of Health, to our fellow doctors across the nation, and to the public as a whole.”\n\nThey added that “the increasingly prevalent opinion within the scientific community is that the vaccine cannot lead to herd immunity, therefore there is currently no ‘altruistic’ justification for vaccinating children to protect at-risk populations.”\n\nThe letter also said that even now, it’s not clear if the vaccine prevents the spread of the virus and the duration of its protection and added that new variants “that can be more resistant to vaccination are popping up all the time.”\n\n“We believe that not even a handful of ids should be put at risk via mass vaccination against a disease that isn’t dangerous to them,” the letter read. “Additionally, it cannot be ruled out that the vaccine will have long-term adverse effects that have not yet been discovered at this time, including growth, reproduction, or fertility. Kids should be allowed a fast return to routine; the abundant tests and broad isolation should be halted. There should be no separation between the vaccinated and unvaccinated in the public sphere. Vaccination of at-risk populations should be allowed, and under the almost complete vaccination of this population – it is possible to return to regular routine (with periodic adjustments) even with the prevalence of the coronavirus.”\n\nAnother segment of the letter highlights the fact that no one knows the extent of any serious and rare side effects of the vaccine, due to the fact that many vaccinated people who experienced side effects failed to report it. “Therefore currently, there is under-reporting of side effects. Additionally, a causal link between events – if at all – will only come to light in due time, as more and more of a certain type of events accumulate. For example, if there is a serious health problem that affects 12 young people a year in Israel (ie – an average of 1 per month), while the vaccine also causes this serious event infrequently, it will take months to clarify that there is an increase in the incidence of the event and that there is a connection between the vaccine and its effect.”\n\n“Don’t rush to innoculate children so long as the entire picture is unclear. Covid-19 doesn’t endanger children, and the first rule in medicine is ‘first do no harm. The complete picture is expected in several months, and possibly years. Furthermore, one must wait for this type of data not only from Israeli data but from data worldwide. In this context, it is noteworthy to add that ‘black box warnings’ – warnings about severe or life-threatening side effects – pile up months or years following drug approval, due to the fact that severe but rare toxins appear, naturally, only over time.”\n\nAccording to the doctors, “Pediatrics in Israel is among the best in the world, and pediatric intensive care – all the more so. It is extremely rare for a child to die of a viral disease, and this can happen, unfortunately, as a result of various types of viruses. We do not think it is right to manage private life and public health policy out of an ongoing fear of a viral illness that is very rarely liable to hurt our children’s lives. ”\n\n“Due to the fact that the inoculation of the vulnerable population decreases hospitalizations and mortality from Covid – we believe that the negative effects of the virus will be much smaller when most of the at-risk population is vaccinated, as begins to seem to be the case in the nation, without the need to vaccinate children,” they explained.\n\n“We believe that our children should be permitted to go back to the routine of their blessed lives at once, and should not be vaccinated against Coronavirus,” the doctors concluded the joint letter. “Asymptomatic children’s tests, which bear no clinical meaning but create widespread indirect damage, and the mass isolation cycles in educational systems, must be halted immediately. It should be stressed to the people that even the vaccinated people can be infected and infect others and that similar rules of conduct apply to everyone regardless of vaccination status. We must end finger-pointing and blaming the unvaccinated, and we must end violating individual rights. We must stop all forms of exclusion immediately and separation between people in the public space.”", "opengraph": {"locale": "en_US", "type": "article", "title": "93 Israeli doctors petition against Covid vaccine for children: \"Haste is from the Devil\"", "description": "The letter's signatories include Dr. Amir Shachar, head of the ER at Laniado Hospital, Dr. Yoav Yehezkeli, an expert in internal medicine and a lecturer at Tel Aviv University, and Dr. Avi Mizrahi, director of the intensive care unit at Kaplan Hospital.", "url": "https://www.israel365news.com/350183/93-israeli-doctors-petition-against-covid-vaccine-for-children-haste-is-from-the-devil/", "site_name": "Israel365 News", "article:publisher": "https://www.facebook.com/Israel365News", "article:published_time": "2021-12-08T00:00:00+00:00", "image": "https://www.israel365news.com/wp-content/uploads/2022/11/covid-kids.jpg", "image:width": "660", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["noads", "Biblical News"], "tweets": [], "movies": [], "links": ["https://www.mako.co.il/news-lifestyle/2021_q2/article-089acf1079fb871027.htm", "https://www.israelnationalnews.com/news/304124?fbclid=IwAR3iSht6SEj5AeXw82tJIfdhqF2MWMZ8o3ppc3OvxIBG3lqbE88YmQ9iXGI"], "authors": ["David Sidman"], "publish_date": "2021-12-08T00:00:00+00:00"}