{"result_id": "180033", "URL": "https://www.jesus-is-savior.com/End%20of%20the%20World/Genetics%20Nightmare/vaccine_vegetables.htm", "timestamp": "2023-04-25 16:08:42 CEST+0200", "meta": {"description": "VACCINES IN VEGETABLE FORM", "lang": "en", "keywords": "VACCINES, VEGETABLES", "favicon": "", "canonical": "https://www.jesus-is-savior.com/End%20of%20the%20World/Genetics%20Nightmare/vaccine_vegetables.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "VACCINES IN VEGETABLE FORM", "cleaned_text": "HOUSTON - Genetically engineered fruits and vegetables that provide immunity could soon become a reality according to several recent studies.\n\nScientists now report that laboratory animals fed genetically engineered potatoes produced antibodies against hepatitis B, an infectious bacterium responsible for diarrheal disease. This is the first time that an oral vaccination has been achieved by feeding a genetically modified plant.\n\nThe researchers first transferred a gene that makes an antigen against hepatitis B (rHBsAg) from yeast to tobacco and then to potatoes. The immune response elicited by the transferred protein was similar to that obtained by immunizing mice with commercial vaccines for hepatitis B. Both the B- and T-cell epitopes of HBsAg were preserved when the antigen was expressed in the transgenic plant.\n\nIf these preliminary results translate into immunity against infection, it could open the door to edible vaccines against enteric diseases caused by viruses or bacteria, such as cholera. These diarrheal illnesses are blamed for the deaths of at least five million children each year in developing nations.\n\n\"In the developing world, a low-cost vaccine for these diseases would make a dramatic health improvement,\" said Dr. Charles J. Arntzen, a molecular biologist at Texas A&M University's Institute for Biosciences and Technology.\n\nArntzen says that potatoes were genetically engineered to produce a protein subunit from an infectious variety of E. coli bacteria. When mice consumed the raw potatoes as food, they produced antibodies against the protein in both their blood serum and in secretions in the gut.\n\nThese results are \"extremely hopeful, but not yet conclusive,\" Arntzen says. \"Because mice do not get the human form of diarrheal disease, we cannot determine protective immunity yet.\" Further tests in other animals that do get diarrheal disease are planned, he says.\n\nArntzen emphasizes that potatoes themselves are a good system in which to test the idea of edible vaccines, but probably would not be a practical to administer them to children. Other members of Arntzen's research group are attempting to introduce the E. coli genetic material into other food plants, especially bananas.\n\n\"The chances are that nobody is going to want to eat raw potatoes, and we believe that cooking is going to destroy the proteins that we're interested in, so we have to have something that's eaten raw. We're looking for something that could be eaten without cooking, and something that could be grown easily in developing areas of the world. Bananas seem to fill the bill,\" he noted.\n\n\"I don't see that every village in Africa or Latin America is going to have a pharmaceutical banana tree, because there might be disadvantages to eating this material on a repeated basis. I would say that if we are successful, this will be treated like any other pharmaceutical or herbal medicine and managed in a health care context,\" he added.\n\nAccording to the World Health Organization, some 2 million children around the world die each year from diseases that can be prevented with vaccines, such as diphtheria, tetanus, whooping cough, polio and measles.\n\nFor information on these studies, see articles by Arntzen et al. in the 5/5/95 issue of Science and the 4/11/95 issue of the Proceedings of the National Academy of Sciences.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.accessexcellence.org/WN/SUA01/vaccines.html"], "authors": [], "publish_date": null}