{"result_id": "180042", "URL": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/poison_cure/abortion_industry_contributes.htm", "timestamp": "2023-04-25 16:08:46 CEST+0200", "meta": {"description": "Abortion Industry Contributes to Vaccines!", "lang": "en", "keywords": "Abortion Industry Contributes to Vaccines!", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/poison_cure/abortion_industry_contributes.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "Abortion Industry Contributes to Vaccines!", "cleaned_text": "Ten weeks after conception, the baby's heart beat can be heard\n\nThe Chickenpox, Hepatitis-A and MMR vaccines were developed using aborted fetal cell lines, MRC-5 and WI-38. This has never been hidden from the public. When parents take their children to the doctor for inoculations, who asks for the package inserts? Who asks for a list of the vaccine ingredients? Most parents want to know the risks and possible side effects. Parents are mostly concerned with the health of their children as some doctors are. Doctors have been administering the vaccines for years. Yet, how many of them have ever checked into the ingredients? This has always been right at their fingertips. What would happen if they did? They would read that the vaccine contains \"MRC-5\", \"WI-38\" (or both) \"human diploid cell lines\".\n\nMost parents are not aware that the particular abortions which contribute the fetal tissue parts for vaccine manufacturing, were actually intended for vaccine manufacturing.\n\nOne if the most highly misunderstood notions among moral theologians and ethicists is that the abortions involved were not done with the intention of creating vaccines. In fact, in response to President Bush’s decision on federal funding for embryonic stem cell research (ESCR), the USCCB highlights this point as follows:\n\n“In the present case, human lives were taken in order to provide cells for research and, in some cases, precisely to qualify for federal grants; in the case of vaccines, tissues were taken following abortions performed for unrelated reasons.” -\n\nIt was the intent of the abortionist and the researcher to destroy these babies specifically for vaccine manufacturing. But first, the abortions had to be pre-arranged so the researchers were available to immediately preserve the tissues.\n\n\"In order to sustain 96% of the cells, the live tissue would need to be preserved within 5 minutes of the abortion\"\n\n...\"Within one the cells would continue to deteriorate, rendering the specimens useless.\n\nDr. C. Ward Kischer, Embryologist and Emeritus Professor of Anatomy; Specialist in Human Embryology, \n\n University of Arizona College of Medicine (Tucson, Arizona) Personal interview 7-02, ALL Conference]\n\n1961 Leonard Hayflick, employed by the Wistar Institute, research facility of University of Pennsylvania, started working with aborted fetal cell lines (WI-I through WI-25). Cell strains were derived from the lung, skin, muscle, kidney, heart, thyroid, thymus and liver of 19 separate abortions. The entire research was was for the development of viral vaccine cultivation.\n\n\"The isolation of characterization of human diploid cell strains from fetal tissue make this type of cell available as a substrate for the production of live virus vaccines. Other than the economic advantages, such strains in contrast to heteropoloid cells lines exhibit those characteristics usually reserved for normal or primary cells and therefore make the consideration of their use in the production of human virus vaccines a distinct possibility\" -(L. Hayflick and P.S.Moorhead, The Serial Cultivation of Human Diploid Cell Strains, Experimental Cell Research, 1961, 25, pg 618)\n\n1964 Hayflick isolates and gives name to the WI-38 cell line derived from the lungs of a baby girl 3 months gestation.\n\n\"This fetus was chosen by Dr. Sven Gard, specifically for this purpose. Both parents are known, and unfortunately, for the story, they are married to each other, still alive and well, and living in Stockholm, presumably. The abortion was done because they felt they had too many children. There were no familial diseases in the history of either parents, and no history of cancer specifically in the families.\"\n\n\"One of my duties as a young student in the laboratory in, Stockholm was to dissect human fetuses from legal abortions and send organs to the Wistar Institute. Such material was the source of many important studies of cell lines of the Institute, such as Leonard Hayflick's study of WI-38\"\n\n-Norrby, Erling \"Listen to the Music: The Life of Hilary Koprowski (review)\", Perspectives in Biology and Medicine - Volume 44, Number 2, Spring 2001, pp. 304-306\n\n\"Explant cultures were made of the dissected organs of a particular fetus aborted because of rubella, the 27th in our series of fetuses aborted. This fetus was from a 25-year-old mother exposed to rubella 8 days after her last menstrual period. 16 days later she developed rubella. The fetus was surgically aborted 17 days after maternal illness and dissected immediately. Explants from several organs were cultured and successful cell growth was achieved from lung, skin, and kidney. It was then grown on WI-38,. The new vaccine was tested on orphans in Philadelphia\"\n\n-American Journal Diseases of Children; Virus Production and Biological Control of Live Attenuated Rubella Virus Vaccines, Vol. 118 Aug 1969; Attenuation Of RA273 Rubella Virus; Studies of Immunization With Living Rubella Virus; Arch J Dis Child vol 110 Oct 1965\n\nThus, at least 47 separate abortions involved in the research for production of present day rubella vaccine.\n\nBrutal Murder and dissection of the unborn:\n\n\"The Fetus As Transplant Donor the Scientific, Social, and Ethical Perspectives,\" written by Peter McCullough, who is an immunologist at the University of Western Australia. It's published by the John Wiley Company in New York.\n\nHere's McCullough. The Australian International University in Canberra. This is the face page of the book, and he probably knows more about the subject of using fetal tissue than anybody in the world. Incidentally, he is pro-life, and it's remarkable that his book delineates some of the technologies which have formerly been used to get fetal brain tissue. For example, he talks about how in Sweden they have been puncturing the sac of a pregnant woman at let us say 14 to 16 weeks, and then they put a clamp on the head of the baby, pull the head down into the neck of the womb, drill a hole into the baby's head, and then put a suction machine into the brain and suck out the brain cells.\n\nAnd this is directly from his book. Healthy human fetuses from 7 to 21 weeks from legal abortions were used. This is in Sweden. The conceptional age was estimated from crown rump length and so on. Fetal liver and kidney were rapidly removed and weighed. Now at 21 weeks, what they were doing, or 18 weeks, or 16 weeks, was what are called prostaglandin abortions. They would inject a substance into the womb. The woman would then go into mini-labor and pass this baby. 50% of the time, the baby would be born alive, but that didn't stop them. They would just simply open up the abdomen of the baby with no anesthesia, and take out the liver and kidneys.\n\nDebi Vinnedge, Director of Children of God For Life ( ) is politically active. Please visit the organization's site to keep up to date and find out your President's stand on the issue, along with her correspondence with the manufacturing companies.\n\n[Published 28 August 2002 Source Espicom Business Intelligence]\n\n \n\n Xigris received approval from the FDA on 21st November 2001 for the reduction of mortality in adult patients with severe sepsis who have a high risk of death. Xigris has also been approved in Puerto Rico, Israel, Australia, Argentina, Peru, Romania, Columbia, Mexico, Switzerland, India, Singapore and South Africa. \n\n \n\n Xigris is a genetically-engineered version of the human activated protein C molecule, a naturally-occurring protein in the body that helps to balance many of the forces behind sepsis, including coagulation and\n\n suppression of fibrinolysis. Additionally, patients with severe sepsis treated with Xigris had a more rapid decline in interleukin-6 levels, consistent with a reduction in the inflammatory response. The drug is administered to patients as a 1-time, 96-hour infusion within an ICU setting. The precise dosage depends on the weight of the patient. In the PROWESS trial, bleeding was the most common adverse reaction associated with Xigris therapy. Serious bleeding events, including intracranial haemorrhage (0.2 per cent in Xigris-treated patients and 0.1 per cent in placebo-treated patients), were observed during the 28-day study period in 3.5 per cent of Xigris-treated patients and 2.0 per cent of placebo-treated patients. The difference in serious bleeding occurred\n\n primarily during infusion.\n\n \n\n A human cell line is used in the production of Xigris, as noted under FDA document, PC 3420 AMP, in the first paragraph, which states:\n\nare cells taken from the kidney of an aborted baby.\n\nThe protein C is produced in the HEK 293 aborted fetal cell line. 293 cells are available from the American Type Culture Collection. There are variants of the cell line that derive from the parent.\n\nThe 293 cell line is a permanent line of primary human embryonal kidney transformed by sheared human adenovirus type 5 (Ad 5)DNA. [RF32725]\n\nThe cells express the transforming gene of adenovirus 5. Although an earlier report suggested that the cells contained Adenovirus 5 DNA from both the right and left ends of the viral genome [RF32764], it is now clear that only left end sequences are present. [RF50113]\n\nThe cells express an unusual cell surface receptor for vitronectin composed of the integrin beta-1 subunit and the vitronectin receptor alpha-v subunit. [RF33793] Purified DNA from this line is available as ATCC 45504 (25 micrograms) and ATCC 45505 (100 micrograms).\n\nThe Ad5 insert was cloned and sequenced, and it was determined that a colinear seqment from nts 1 to 4344 is integrated into chromosome 19 (19q13.2). [RF50113]\n\n1. The recombinant human protein C molecule produced by inserting a vector comprising the DNA encoding human protein C into an adenovirus-transformed host cell then culturing said host cell under growth conditions suitable for production of said recombinant human protein C.\n\n2. The recombinant human protein C molecule of claim 1 wherein the adenovirus-transformed host cell is selected from the group consisting of AV12 cells and human embryonic kidney 293 cells.\n\n3. The recombinant human protein C molecule of claim 2 wherein the adenovirus-transformed host cell is an AV12 cell.\n\n4. The recombinant human protein C molecule of claim 2 wherein the adenovirus transformed host cell is a human embryonic kidney 293 cell.\n\nIn the FDA report found at\n\n\"So the Kidney material, the fetal kidney material was as follows. The kidney of the fetus was, with an unknown family history, was obtained in 1972 probably. The precise date is not known anymore.\n\nThe fetus, as far as I can remember was completely normal. Nothing was wrong. The reasons for the abortion were unknown to me. I probably knew it at the time, but it got lost, all this information.\"\n\nKey excerpts from the above document: Dr. Van Der Eb, Crucel NV is speaking...\n\n\"So I isolated retina from a fetus, from a healthy fetus as far as could be seen, of 18 weeks old. There was nothing special with a family history or the pregnancy was completely normal up to the 18 weeks, and it turned out to be a socially indicated abortus - abortus provocatus, and that was simply because the woman wanted to get rid of the fetus.\"\n\n\"The father was not known not to the hospital anymore, what was written down was unknown father, and that was, in fact, the reason why the abortion was requested.\"\n\n\"There was permission, et cetera, and that was, however, was in 1985, ten years before this. This shows that the cells were isolated in October 1985, Laeiden University in my lab. At that time already '85, I should say the cells were frozen, stored in liquid nitrogen, and in 1995 one of these was thawed for the generation of the PER.C6 cells.\n\n\"And this is the final slide just showing you some comparisons between 293 and PER.C6. Again, I remind you that both cell lines were made in my lab for different reasons. The objective, as I indicated, is for 293--was basic research, and we have done many different transformation studies after that, not transformation studies, but gene expressions studies with human embryonic kidney cells in the years following that up to now, I would say.\n\nPER C6 was made JUST FOR PHARMACEUTICAL MANUFACTURING OF ADENOVIRUS VECTORS As to RCA free, PER.C6 are RCA Free. The history documentation of the cell line has been carried out completely for PER. C6 and was not done at that time for 293.\n\nAbout the Cell Lines and Adenovirus (AD5) Safety issues...\n\nIn 1954, during discussions surrounding the development of adenovirus vaccines for use in the military, the U.S. Armed Forces Epidemiology Board (AFEB) recommended the use of \"normal cells\" as the substrate for vaccine production rather than cell lines established from human tumors. This decision was based on concerns about the possibility that human tumor cells might be contaminated with occult oncogenic agents that might be transferred to vaccine recipients, an event which might in turn increase the risk of cancer and other neoplastic diseases in vaccinees. As evidenced by current regulatory guidelines and activities of control authorities worldwide, the precedent set in 1954 by the AFEB remains an important factor in the acceptance of all substrates for vaccine manufacture. Currently, the only cultured animal cells that have been used as substrates in U.S. licensed viral vaccines have been primary cells (e.g., derived from monkey, chick, mouse), diploid cell lines (e.g., WI38, MRC-5, FRhL-2), or immortalized (continuous), non-tumorigenic cell lines (e.g., VERO).\n\nOver the past 47 years, two important factors have emerged that warrant serious consideration of the use of immortalized tumorigenic cell lines for viral vaccine production. The first of these factors is that certain novel virus vectors that are presently under development for high-priority target diseases, most notably AIDS, cannot feasibly be propagated in\n\ntraditionally acceptable cell substrates. The second factor is that scientific understanding of neoplastic processes and viral-induced carcinogenesis has rapidly advanced, as has the ability to detect and identify infectious, oncogenic agents and other types of adventitious agents that may potentially contaminate cell substrates. These factors underscore the need for developing a regulatory framework in which the relative benefits and risks in using tumorigenic cell lines for vaccine production can be carefully and cautiously revisited.\n\nFDA would like the VRBPAC to consider the potential risks in using two novel cell substrates, 293 cells and PER.C6 cells. These cell lines were developed by transforming human embryonic kidney cells (293) and human embryonic retinal cells (PER.C6) with the transforming early region 1 (E1) of adenovirus type 5 (Ad5). Since cell lines such as 293 and PER.C6 express the Ad5 E1 region, they are able to complement the growth of defective Ad5 vectors which have been \"crippled\" by deletion of E1. Defective Ad5 vectors have been engineered to express foreign genes such as those from human immunodeficiency virus (HIV), the causative agent of AIDS, and vectors of this type are thought to have significant potential for vaccine development because of their demonstrated ability to generate cell-mediated immune responses to HIV. However, a feature of regulatory importance associated with Ad5-transformed cells is their capacity to form tumors in immunodeficient animals such as nude mice.\n\nIn considering potential risks associated with the use of these so-called Designer Cell Substrates – i.e., neoplastic cells derived from normal human cells transformed by defined viral or cellular oncogenes or by immortalizing cellular genes (e.g., telomerase) – OVRR/CBER is considering the approach outlined below within the framework of a \"defined-risks\" assessment (see enclosed reference Lewis et al., \"A defined-risks approach to the regulatory assessment of the use of neoplastic cells as substrates for viral vaccine manufacture\", In Evolving Scientific and Regulatory Perspectives on Cell Substrates for Vaccine Development. Brown, Lewis, Peden, Krause (eds.) Develop. Biol. Stand. [in press]). This framework is intended to examine, and wherever possible, to quantify the potential risk of \"transmitting\" the tumorigenic components of the cell substrate used for vaccine production, and determine whether that \"transmission\" might pose a risk, particularly an oncogenic risk, to vaccinees. Factors that could influence the risk associated with the use of Designer Cell Substrates include (1) the known mechanism of cell transformation leading to the development of tumorigenic cells; (2) residual cell substrate DNA; and (3) the presence of adventitious agents, especially oncogenic viruses. These three factors are discussed in more detail below.\n\nThe purpose of tumorigenicity testing as applied to cell substrates used for viral vaccine manufacture is to discriminate between cells that have the capacity to form tumors and cells that do not form tumors. The potential risk of oncogenic activity is thought to be higher for cell substrates that have the capacity to form tumors, whereas the potential risk is thought to be low for cell substrates that are unable to form tumors. In considering the risk of tumorigenicity of Ad5-transformed Designer Cell Substrates, it is important to consider the molecular processes that determine the ability of the cells to form tumors.\n\nAdenovirus 5 does not produce tumors when injected into rodents, but it does transform rodent cells in tissue culture. Like adenovirus 5 virions, adenovirus 5-transformed cells do not produce tumors when injected into immunocompetent adult rodents, but these cells can form tumors when injected into immunodeficient rodents such as nude mice. The tumor-forming capacity of Designer Cell Substrates that are produced by transforming normal human cells with adenovirus 5 can be evaluated by comparing them with adenovirus 5-transformed rodent cells. The adenovirus 5 early region 1 (E1) is composed of the transcription units E1A and E1B, which transform normal cells to neoplastic cells through a multi-step process. The E1A transcription unit immortalizes the cells and establishes those characteristics of the transformed cells that permit them to be eliminated by the antitumor defenses of immunocompetent rodents. During the transformation process, E1A sensitizes cells to apoptosis (programmed cell death) and increases their susceptibility to killing by natural killer cells, macrophages, and cytotoxic lymphocytes, as well as cytokines such as tumor necrosis factor (see Routes et al., 2000a, 2000b). The adenovirus E1B region alone is unable to immortalize cells, but its function during neoplastic transformation ensures cell survival by inhibiting virus-induced cell killing. Thus, the E1A region immortalizes cells and determines their limited capacity to form tumors in immunodeficient rodents, whose antitumor immune defenses are compromised. The complexity of these tumor-host processes and their action through nontransferable, immune mechanisms of the host implies that the capacity of adenovirus 5 E1-transformed mammalian cells to form tumors in immunodeficient rodents does not represent a risk factor for the manufacture of viral vaccines provided the cells can be shown to be devoid of adventitious agents (see additional discussion on adventitious agents below).\n\nSeveral approaches can be considered in evaluating tumorigenicity of adenovirus 5-transformed human cell substrates. These approaches include demonstration that the tumor-forming capacity of the cells in rodents is adenovirus 5-like, and that the cells in the master cell bank are devoid of known and occult adventitious agents.\n\nResidual DNA in vaccines derived from tumorigenic cells, including those transformed by Ad5, can pose potential risks to the vaccine recipient in two respects: oncogenicity and infectivity. Each of these biological properties must be considered and evaluated for each cell substrate.\n\nThe oncogenic risk of cell substrate DNA has been considered to be due to several mechanisms. First, the residual DNA could have dominant activated oncogenes that could exert their effect following expression in recipient cells. In the case of Ad5-transformed cells, the dominant oncogenes would include the E1A and E1B genes. Second, the incoming DNA could integrate into the host genome in certain genes, such as the p53 gene or the retinoblastoma susceptibility (RB) gene, termed tumor suppressor genes, which are involved in cell cycle control among other cellular processes. Loss of function of tumor suppressor genes has been associated with certain human tumors. Third, integration of residual cell-substrate DNA could result in the activation of cellular regulatory genes by promoter/enhancer insertion, and this could result in the development of a neoplastic phenotype; this mechanism for tumor development was initially described in chickens for leukemia formation by avian leukosis viruses. Another result of integration that has been described is an increased methylation of adjacent DNA sequences as well as sequences on other chromosomes, although the consequences of such changes in methylation patterns to a cell are unknown.\n\nThe second biological activity of DNA that should be considered is its potential infectivity. If a genome of a DNA virus or the provirus of a retrovirus is present in the cell substrate used for vaccine manufacture, then the residual DNA has the potential, upon inoculation into the vaccine recipient, to produce infectious virus from this DNA and thus establish a productive infection.\n\nThe assessment of the risk of DNA — both the oncogenic risk and the infectious risk — needs to be considered both in terms of (1) the amount of residual DNA inoculated; and (2) the concentration of oncogene or infectious genome present in this DNA. One assumption is that the biological activity of any DNA administered is directly proportional to the amount of that DNA, and if the active component (oncogene or infectious genome) is carried as part of the cell-substrate DNA, the amounts of the oncogene or infectious genome will be present at a level of 10-5 to 10-6. This is because the haploid mammalian genome is 3 x 109 base pairs, whereas an average gene is between 3 x 103 and 104 base pairs. Thus, if the residual DNA is present at 10 ng, an oncogene in that DNA would be present at between 0.00001 and 0.0001 ng. Currently there are no data indicating that purified isolated oncogenes or any other DNA are biologically active at these levels.\n\nIt is also important to note that an additional safety margin for oncogenic activity is provided by the multi-step nature of cancer. This is because if more than one gene or event is required, the risk is diminished and is given by the product of the risk for each event. Thus, if the risk of a neoplastic event being induced by one oncogene is 1 in 106, then if two oncogenes are required, the risk is reduced to 1 in 1012.\n\nStrategies that can be considered in evaluating residual DNA for vaccine products manufactured in adenovirus 5-transformed cell substrates include restricting the level of residual DNA to 10 ng or less. If these levels of residual DNA are not feasible, other methods can be considered to demonstrate the safety of higher levels of DNA, such as the inoculation of cell-substrate DNA into neonatal rodents. In the future, more sensitive animal models and in vitro assays may be developed to assess the oncogenic activity of DNA.\n\nThe experience in the early 1960s with SV40 contamination of poliovirus and adenovirus vaccines and the continuing questions regarding whether SV40 could be responsible for some human neoplasms underscore the importance of keeping viral vaccines free of adventitious agents. This is particularly important when there is a theoretical potential for contamination of a vaccine with viruses that might be associated with neoplasia.\n\nIt is unclear whether neoplastic cells have a greater or lower adventitious agent risk than other types of cells. Because they can be grown for long periods in tissue culture, there may be greater opportunities for any adventitious agents to be detected. Because neoplastic cells survive indefinitely, it is easier to qualify and bank cells that have passed all tests, especially as compared with primary cells (which are derived repeatedly from live tissue and must be re-qualified with each use). Moreover, many neoplastic cells can be grown in serum-free medium, potentially reducing the likelihood of contamination with bovine adventitious agents. However, if their growth in tissue culture is not well controlled, there may exist additional opportunities for contamination of cells with a longer lifespan. In cases of neoplastic cells for which the transforming event is unknown, there is also a theoretical possibility that transformation occurred as a result of a previous viral infection. Because some mammalian tumors and some cells transformed by viruses contain infectious virus, cells transformed by an unknown mechanism have a theoretical risk of containing a transforming virus. Cells for which specific knowledge of the transforming event exists (and can be shown not to be a virus that persists in the cells) may be more easily characterized than cells for which there is no specific knowledge of the transforming event (which could theoretically have been due to an infection with a known or an unknown virus).\n\nExtensive adventitious agent testing is required for all cells that are proposed for use in vaccine production. This includes testing in various tissue culture systems, inoculation of animals followed by observation or detection of pathogen-specific antibodies, observation by electron microscopy, and molecular tests as is appropriate based on the history and type of cell to be tested. Specific polymerase chain reaction assays are used to rule out the presence of many different viruses. PCR-based reverse transcriptase assays are used to rule out the presence of retroviruses. The most sensitive of these assays include amplification steps, either as a result of viral growth in culture or in an organism, or molecular amplification such as in PCR.\n\nAlthough Ad5-transformed cells are thought to be transformed by a known mechanism, the consequences of overlooking an occult oncogenic agent are significant. As these are the first cells in their class to be considered for vaccine production, evaluating them for the presence of occult oncogenic agents could enhance confidence in their use. One relevant animal assay that could be used for such an evaluation is the inoculation of cell-free lysates into susceptible newborn rodents, followed by observation for 5-6 months. This assay would detect most known tumor viruses, as well as potentially detect unknown tumor viruses.\n\nSeveral promising areas of research suggest that experimental assays to detect unknown adventitious agents could soon become more generally available. As such assays become available, they could be considered for use in qualifying novel cell substrates, including neoplastic cell substrates.\n\nIn addition to assessing the possibility of contamination of cell substrates with infectious virus, it is important to consider other agents such as the agent of TSE. There are several mechanisms by which vaccine cell substrates, including neoplastic cells, could theoretically become infected with a TSE agent. First, viral vaccines are developed and manufactured in cell substrates that may be derived from humans, and all human cells represent a finite possibility of being derived from individuals with a propensity to develop sporadic or familial Creutzfeld-Jakob disease (CJD). Although the mechanism by which such individuals develop CJD is not understood, CJD has in the past been transmitted to humans by biological products derived from CJD patients, such as human growth hormone and dura mater grafts. Second, vaccine cell substrates are usually exposed to products derived from cattle during tissue culture. Bovine spongiform encephalopathy (BSE) has been transmitted to humans in Europe in the form of variant CJD, possibly due to ingestion of infected beef. Under certain circumstances, cells in tissue culture can support the replication of certain TSE agents, although it is not known whether human cells in tissue culture can sustain the replication of the BSE agent. Assays to detect TSE/BSE agent contamination exist, but they may not be sensitive enough to exclude low levels of contamination. Until more is known about the replication of TSE/BSE agents in tissue culture and until more sensitive assays to detect these agents become available, the concern over the possible contamination of viral vaccines with TSE/BSE agents will be at least a theoretical\n\nThe use of immortalized, neoplastic human cells as substrates to develop recombinant viral vectors as vaccines also raises theoretical concerns with regard to possible contamination with TSE/BSE agents. These concerns include: (1) the implications of the possible presence of a prion protein (PrP)-encoding gene (PRNP) that is abnormal in the individual from whom the cells were derived; (2) the possibility that the genomic instability attendant with neoplastic processes could produce pathogenic alterations in the normal PRNP gene; (3) the possible exposure to agents of BSE present in bovine serum used in the propagation of the cells; (4) the possibility that an increased level of expression of either a normal or abnormal PRNP gene or other unknown factors in neoplastic cells might, upon exposure, sustain the replication of abnormal PrP proteins or otherwise contribute to the development of TSE in humans; and (5) the possibility that differences in the levels of expression of PRNP genes among clonal/subclonal populations of neoplastic cells may make evaluation of these potential risks more difficult. Since the lifetime risk of sporadic TSE in the population is about one case per ten thousand people (see Brown, P. et al., [1985], Potential epidemic of Creutzfeldt-Jakob disease from human growth hormone therapy. N Engl J Med. 1985, 313:728-731), there is a finite risk that random tissue samples used for the development of neoplastic cell lines could contain abnormalities that might be associated with TSE transmission.\n\nSeveral strategies can be considered for evaluation of neoplastic human cells for possible contamination with TSE/BSE agents. These strategies include a determination of the origin of the cells with respect to the possible family history and medical history of the donor regarding TSE risk factors and the identification and documentation of possible exposure of the cell line to bovine-derived materials, such as fetal bovine serum from countries with BSE. Further, two validated methods that could be used to evaluate the potential risk from the TSE agent include sequencing of the PRNP gene from neoplastic cell substrates and evaluating all such cell substrates by Western blot for the presence of protease resistant PrP. Additional studies may become feasible in the near future and may include evaluation of PRNP expression levels, determination of the ability of a cell substrate to support replication of the BSE agent, and evaluation of for the presence of infectious TSE agents by animal inoculation. As new assays for the detection and evaluation of TSE agents become available, they should be introduced as appropriate for cell substrate screening.\n\nOVRR/CBER plans to present these issues to the FDA TSE Advisory Committee for a comprehensive discussion in the near future. In the interim, for cell substrates for which the presence of TSE could be a risk, sponsors should evaluate this issue by a combination of strategies, as may be technically feasible. Nevertheless, OVRR/CBER would like this Committee to be aware of and consider those issues related to the possible presence or exposure of cell substrates used for the development of viral vaccines to agents associated with TSE/BSE.\n\nRecent animal experiments have demonstrated the utility of Ad5 vaccine vectors as means of stimulating cell-mediated immunity against HIV-1. Based on the review of available data, OVRR/CBER believes that there is an extremely low probability that residual DNA from the adenovirus 5-transformed human cells could transfer traits that could induce neoplastic development in vaccinees. OVRR/CBER also believes that such cells may be considered for the development of HIV vaccines, provided that the phenotype of the cells can be documented to be of an adenovirus 5 E1 type, and that appropriate testing rules out the presence of adventitious agents within the limits of state-of-the-art technology.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cogforlife.org/fetalvaccinetruth.htm", "http://www.youtube.com/watch?v=yAbWbAe3Y04", "http://www.youtube.com/watch?v=yAbWbAe3Y04", "http://www.whale.to/vaccine/sf.html", "http://www.whale.to/vaccine/sf1a.html", "http://www.cogforlife.org", "http://iccvam.niehs.nih.gov/methods/endodocs/final/erta_brd/ertaappx/erta_a2.pdf", "http://www.fda.gov/ohrms/dockets/ac/01/transcripts/3750t1_01.pdf", "http://www.fda.gov/ohrms/dockets/ac/01/transcripts/3750t1_01.pdf", "http://www.fda.gov/ohrms/dockets/ac/01/briefing/3750b1_01.htm", "http://www.cogforlife.org", "http://www.jesus-is-savior.com"], "authors": [], "publish_date": null}