{"result_id": "180026", "URL": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/vaccinations_can_kill.htm", "timestamp": "2023-04-25 16:08:37 CEST+0200", "meta": {"description": "VACCINATIONS CAN BE VERY DEADLY!", "lang": "en", "keywords": "VACCINATIONS", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/vaccinations_can_kill.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "VACCINATIONS CAN KILL!", "cleaned_text": "And do more often than you think !!!!\n\n\n\n YES, THAT'S WHAT YOU ARE ALLOWING TO BE INJECTED DIRECTLY INTO YOUR BABY'S BLOOD STREAM !!! \n\n THESE ARE DEADLY TOXIC CHEMICALS !!! And these are just \n\n a few of the poisons vaccines are made with !!\n\nThe government is NOT going to let this information out -- they want \n\n YOUR child for their experiments; - - Plus they want YOU to believe \n\n and trust - - so YOU will willingly hand over your child or \n\n baby to them, so they can use your child as their lab rat !!\n\nAnd you know what ? YOU HAVE BEEN DOING JUST THAT FOR \n\n\n\nAre young parents completely brainwashed by the government ? \n\n \n\n You bet they are !!! \n\n \n\n [Unless they had parents who were not brainwashed themselves, and \n\n searched for the truth and taught their children the truth. But all others \n\n ARE brainwashed and controlled by the government, and don't even \n\n\n\nThe public has been continually lied to, intimidated, and manipulated via the \n\n Media and the doctors ! Doctors are threatened with loss of their medical \n\n license if they don't comply to the government's pressures ! Doctors are \n\n not allowed to tell you the truth; and in fact, very few of them even \n\n know the truth about the vaccinations themselves. They are only taught \n\n to push the vaccination program in medical school; they are not taught \n\n what the adverse reactions are. They are taught that everything that \n\n happens to a child\\baby after a vaccination is \"to be expected!!\" \n\n They are taught how to get reluctant parents to \"obey the rules\" set forth \n\n by the government. The drug companies are the ones who foster the \n\n medical schools, and primarily are the ones who dictate what doctors are \n\n taught. After all, these future doctors are the drug companies future \n\n drug pushers and salesmen !! [See on home page topic list: \"Vaccinations= \n\n\n\nThe government controls all the public schools and what and how YOUR \n\n\n\nIt's time for parents, especially the young government raised parents, to \n\n get their brains UNscrambled - - and to get the true facts about what the government has been doing to our children all these years --- \n\n and how YOU have helped them do it !!!\n\nThe public has become such \"trained seals\" and they are so well \"trained\" \n\n that they are not even aware of the they have become !! \n\n OPEN YOUR EYES - - - AND YOUR BRAINS !! \n\n The government is killing and maiming your child !!! WAKE UP !!!\n\n\n\n \n\n YOU believe what the government doctors tell you ! DON'T !!! \n\n They are FORCED to tell you certain things a \"certain way\" - - \n\n they are TRAINED on HOW to do this and to \n\n\n\nThis TAKE OVER of our children (face it, that's exactly what it is ! Take over !) \n\n is top priority to THIS government for their one world government \n\n \n\n \n\n WHAT THEY ARE DOING IS AGAINST OUR U.S. CONSTITUTION !!! \n\n \n\n Stop letting them take you over and own you !!! Because that's \n\n exactly what it is !! This goes against God, and everything else that we have \n\n ever held sacred in this country !!\n\nDon't even call yourself a \"parent\" if you have never checked into what \n\n you are told is \"ROUTINE\" - - - get to HATE that word !! \n\n \n\n Never let ANYONE use that word on you again ! \n\n \n\n It's a government word used to manipulate your mind !! \n\n \n\n Whenever you hear ANYONE use that word, a WARNING \n\n\n\nThe truth is out here - - but it won't be for long - - because the government \n\n is steadily closing down everyone that is trying to get the real truth out \n\n to the people ! The government stops books, people, printers, etc. - - \n\n and soon they will find a way to stop the truth on the web, as well. \n\n They are already working on it. \n\n \n\n They are calling it \"censorship of pornography to protect our children\" \n\n ---but that's a cover to really get at the web sites that are trying to warn and wake up the people to the truth ! Once they pass a \"web censorship law\" (and they will), \n\n they can label anything they want as \"pornography\" by the way they will have \n\n this law worded ! It's all in the PLAN of the government to control YOU \n\n and everybody else ! \n\n \n\n By the way, this also goes against our US Constitution - - - for ANY \n\n law passed that is NOT VOTED IN BY THE PEOPLE, is an ILLEGAL \n\n\n\nI suggest all you out there get a full copy of our U.S. Constitution and \n\n memorize it, while we are still able to get it. Go to the libraries, if you \n\n don't have an encyclopedia at home. The older the source, the better. \n\n That will show you the ORIGINAL Constitution. You can probably \n\n find it on the internet and print it out. It won't be long and it won't be \n\n available anymore, so get it now. This government will (and has already) \n\n altered our Constitution in interpretation and context, to fit into their \n\n take over of the U.S.! Eventually, they will \"dismiss'' it altogether ! \n\n It's in their PLAN. [See list on home page-\"Why Didn't I See THAT On \n\n\n\nYou and your child play a big role in this government take over of the lives \n\n of every man, woman, and child in America ! Controlling you is of the \n\n utmost importance ! If you are a young parent, and you have just gone \n\n along with the flow, and have not made any waves in doing what \"is expected\" of you, and you have never questioned the \"ROUTINE\" \n\n things that seem to be in our everyday life - - - then you are the Government's \n\n \"perfect little (brainwashed & controlled) citizen!\" YOU ARE OWNED, \n\n and don't even know it !! They want to keep it that way !\n\nThey don't want you to hear the truth - - for then you'd rebel - - and they \n\n can't have any of their \"perfect brainwashed little citizens\" rebelling how, \n\n\n\nIf you are under the age of 30, then you have been brainwashed since \n\n birth ! Yes, your parents also fell for the government lies too !! True \n\n information was not available to them back then, as it is now for you. \n\n Thirty years ago people still had blind faith in their government - - they \n\n trusted the government; they really didn't have much in the way of other \n\n options. They didn't have the communications that we have today; nor did \n\n they have the internet.\n\nBut also, those 30 and under, were \n\n school system. Yes, the public schools ARE Federal Government schools, \n\n and they control them - - - and the children in them !! \n\n THEY CONTROL THE CHILDREN ARE TAUGHT \n\n AND THEY ARE TAUGHT !!! \n\n \n\n\n\nSo, you can at least now get a picture of how the citizens of the U.S. \n\n \n\n They own the medical establishments, they own the doctors, and they \n\n own the public schools and brainwash your kid from kindergarten to \n\n 12th grade ! I can remember when our little country school was first \"centralized\" -- how upset my parents were ! Things changed drastically after that. They are even getting their hands into the pre-schools. \n\n They control the Media and use them to manipulate the public, especially \n\n on health issues; for if you control the peoples' health -- you control \n\n \n\n \n\n By the way - - The Clinton Health Care program is designed to do just \n\n that ! FULL CONTROL OF YOU , YOUR CHILDREN, YOUR \n\n HEALTH (or lack thereof), and it controls what doctors you are allowed \n\n to use. They already have done that with Medicaid. \n\n \n\n We Americans are the UNHEALTHIEST, MOST PRESCRIPTION \n\n \n\n \n\n When you see the government's FDA (Food and Drug Administration) \n\n \n\n\n\nThis FDA government agency CONTROLS what you put into your \n\n body - - - and your children's body !! Even if you don't want certain \n\n chemicals (poisons) in your foods - - Guess what ? They're in there \n\n anyway ! And you eat them !!\n\nI dare you to go into a regular grocer and find any candy, pastries, foods, \n\n even produce, that has not had some damaging chemical added to it ! You can't !\n\n [See - \"This Chemical Generation\" on home page list] \n\n \n\n The government IS controlling YOUR health and life quality, \n\n and life span ! [See topic list on home page- \"Is the Government Poisoning \n\n\n\nThey ARE controlling you - - and your child, from the cradle to the \n\n grave ! WAKE UP !! Get out of that trained brainwashed condition ! \n\n Get the truth while it is still available. It WILL save your life and your child's\n\n life !\n\nYou have NEVER been told the truth about child vaccinations - - NEVER ! \n\n And you will NEVER hear the government (or their doctors) admit that \n\n they have maimed and killed thousands of healthy innocent babies and \n\n children, AND CONTINUE TO DO SO !!! {They will never tell you \n\n or allow you to know about the millions of dollars that they pay out regularly \n\n to the parents of the children that have died or are permanently brain damaged \n\n from these child vaccinations !!! They have a special fund set up just for this, \n\n because of the thousands upon thousands of cases annually !!} This is not \n\n a rare situation. One out of every 9 children\\babies that get the vaccinations, \n\n are affected !! You probably have a child who has had brain damage and don't \n\n even know it because you were told certain reactions \"WERE TO BE \n\n EXPECTED !\" YOU WERE TOLD IT WAS \"NORMAL !\" \n\n YOU WERE LIED TO !!!!!! \n\n [ See topic on home page - \"Vaccinations = Death ?\" for the list of reactions to look for.]\n\nThe government makes YOU fear THEM - - They get you in a panic \n\n that if you do not do as THEY want, you will lose your child ! They \n\n threaten you, they use their schools against you, they sabotage you with \n\n their doctors, they hold the HRS (now called Childrens Services) over \n\n your head, they have their Media News deliver their threats, daily throwing \n\n their new laws and rules at you and telling you what will happen to YOU \n\n if you dare to disobey !!! Hey !! THIS IS BLACKMAIL !! THIS \n\n IS AGAINST THE LAW !!!\n\nsomething - - - TOMORROW MAY BE TOO LATE !!! \n\n THIS government passes out \"laws\" like candy being thrown out to a crowd, - - - and these ILLEGAL laws are taking away YOUR freedoms, \n\n and the freedom to choose !\n\nThose pro-choice people should do something beneficial for a change, and \n\n fight pro-choice for our lost freedoms in this country, that the government \n\n has taken away from us !! If you don't know THE BILL OF RIGHTS \n\n in our U.S. Constitution, then you don't know how we have been stripped \n\n of our rights and freedoms. We need to fight = not each other = but \n\n join as Americans, and fight for OUR COUNTRY, OUR CONSTITUTION, \n\n OUR FREEDOM, and OUR CHILDREN !!! \n\n \n\n Whether you realize it or not - - THIS government HAS TAKEN \n\n all those things away from us ! We are NOT suppose to FEAR \"our\" \n\n government = ARE SUPPOSE TO THE GOVERNMENT !\n\nAnd you probably also don't know, that THIS present \"U.S. government\" \n\n IS NOT the same government that was formed in 1776 with our U.S. \n\n Constitution, by the founding fathers ! That ORIGINAL government \n\n has been gradually and steadily taken over ! \n\n \n\n [see my home page listings - \"Why Didn't I See THAT On The Main Stream Agenda Media News ?\"] \n\n \n\n [Also on Book Corner list - \"The Planned Destruction of America\" -- \n\n Everything is documented in this little book. Everyone who calls themselves \n\n an 'American' needs to read THIS book !]\n\nDon't get so wrapped up in your own personal problems (we all have them) \n\n that you just let things slide by; you become \"conditioned\" to just following \n\n 'orders' that are fed to you. Question everything ! We are talking about life \n\n and death here = YOURS AND YOUR CHILDREN ! \n\n \n\n Don't let YOUR baby be the next victim of brain damage or death \n\n in the government's bit to USE us all as experiments ! The FACTS \n\n this government does NOT want you to know is --for one, \n\n diseases were already dying out on their own !! \n\n \n\n all these diseases back via vaccinations, only in a MORE DEADLY \n\n AND UNTREATABLE FORM !!! The man made disease vaccines are \n\n NOT the same thing as the Natural diseases - but they don't want you to \n\n know that either !! How do you like your horse urine and mercury and \n\n formaldehyde --- served with your food, or on the side ? These are just \n\n a few of the things used in the making of these vaccines ! Would you put \n\n it into your baby's bottle with his formula ? You'd be arrested if you \n\n did that ! But the government is pouring those things (and more) directly \n\n into your baby's blood stream, WITH YOUR BLESSING !!! \n\n Oh, how brainwashed we ARE !!! \n\n\n\nThen they \"convinced\" the American people to believe their LIES about \n\n how \"their vaccinations\" saved the day !! And the people fell for it !!! \n\n For three generations they have fallen for it !! They are still lying to us \n\n today, plus they are pushing the vaccinations even harder ! \n\n The vaccinations do NOT work; all they do is permanent damage ! The \n\n government KNOWS they do not work; but they keep forcing them on the \n\n\n\nRemember, once you let your baby get any vaccination, YOU HAVE \n\n \n\n \n\n DO NOT BUILD UP THE IMMUNE SYSTEM -- \n\n \n\n \n\n And you wonder why we people today have so easily fallen into the \n\n \"planned\" Aids epidemic ?! It begins with that first shot after the baby is \n\n born ! This begins to weaken the immune system, and destroy it. \n\n Remember, a baby's immune system is NOT DEVELOPED until the age \n\n of 4. And it WON'T develop, with all the vaccines that has been poured \n\n into a child by that age either !! Nature gives us the 'perfect' immune \n\n system and the way for it to develop, when we are born. When we take our \n\n first breath in this polluted world, we begin to \"adapt\" NATURALLY, \n\n THE WAY GOD INTENDED WHEN HE MADE US. This is how \n\n the immune system becomes strong and develops. Diseases MUST \n\n ENTER THE BODY IN A NATURAL WAY IN ORDER FOR \n\n THE IMMUNE SYSTEM TO RESPOND THE RIGHT WAY !!\n\nSo, your doctor tells you the \"routine story\" of how there's an 'outbreak' \n\n of some childhood disease, and you just MUST get your child vaccinated \n\n NOW !! DON'T BELIEVE HIM !! IT'S PART OF THE \n\n \n\n \n\n \n\n That's the only reason why they are still here !! \n\n \n\n If every child GOT the childhood diseases as Nature intended (they \n\n are very mild and treatable in children) -- none of those diseases would even \n\n be around today !! Getting the REAL disease ( or exposure to it) as a \n\n child, gives LIFE LONG IMMUNITY !! That's how God meant it to be, \n\n because if an adult gets these diseases (and we are seeing a LOT of this \n\n happening now) , it can be deadly. But getting them as a child, not only gives \n\n life long immunity, but this is HOW diseases die out NATURALLY, \n\n and they all would have, if this government had not come up with these \n\n vaccines to keep the diseases going !\n\nYou see, the government NEEDS these diseases to control you and \n\n That's why they push \n\n and manipulate the public so hard on these vaccinations ! They are planing \n\n to enforce babies after birth to be fully vaccinated !!! They will \n\n make it so you cannot go to a hospital to give birth UNLESS YOU \n\n COMPLY !!!! Blackmail AGAIN !!! Threats, and more threats, that is \n\n all the American people keep getting !! It's past time to DO something \n\n about this !!! Not to just sit and let it all keep going on ! We the people \n\n need to storm Washington and force OUR government back into \n\n office, where WE have the voice and the vote !!! [You must read \n\n \"The Planned Destruction of America\" - you just must; you will not be \n\n able to get this book much longer !! This little book will shock your \n\n brain alert faster than an electric shock ! It's a MUST READ !] \n\n\n\nThis government NEEDS to be able to CONTROL you and have you \n\n at THEIR mercy. They want you to 'depend' on THEM. They will \n\n do all they can to keep you from being independent from them. They want \n\n you to NEED them ! If you 'need' them, then they control you. \n\n The child vaccination program, and the public school system has put them \n\n in control over you and yours. It's part of their \"PLAN.\" Yes, their \n\n \"plan\" that they have had since the late 1770\"s. [See home page listings= \n\n \"Why Didn't I See THAT On the Main Stream Agenda Media News ?\"]\n\nIf you are any kind of person (and parent) at all, you will fight them fiercely, \n\n and not give in to their blackmailing pressures !!\n\nSpread the word ! We need to wake up the parents of America before \n\n it's too late, which it is almost already !!\n\n\n\n \n\n Write letters to the newspapers !! {Many won't even print them!} \n\n \n\n Create picket lines nation wide at the same time -- Wake up \n\n the people who are asleep, and not paying any attention to what \n\n we are having done to us !!\n\nSTOP THE VACCINATIONS == ALL OF THEM !! THEY DON'T WORK AND THEY PERMANENTLY TEAR DOWN THE IMMUNE SYSTEM FOR LIFE !!\n\nTAKE BACK YOUR RIGHTS AS THE PARENT !!!\n\nSee also these sites : \n\n \n\n Read the list of children who have either died or have permanent brain damage from the vaccinations! \n\n \n\n \n\n They also have books on vaccinations.\n\nDr. Russell Blaylock (Neurosurgeon), Dr. John Martin, Dr. Earl Mindell, Dr. Joseph Mercola, Dr. Sheri Tenpenny, Dr. Viera Scheiber, Dr. David Weldon, Dr. Leonard Horowitz, Dr. Mohammad Ali-albayati, Dr. Rebecca Carley, Dr. Brad Burke D.C., Dr. James A. Shannon, Dr. Robert Jendelsohn, Dr. Archie Kalokerinos, Dr. Mary N. Megson, Dr. F Yazbak, Dr. William C. Torch, Dr. Richard Moskowitz, Dr. Guylaine Lanctot, Dr. Barthelow Classen, Dr. Hadwen, Dr. Allinson, Dr. Glen Dettman, Dr. J. Anthony Morris, Dr. Paul Frame, Dr. Lendon H. Smith, Dr. Buchwald, Dr. Jerome Murphy, Dr. Kris Gaublomme, Dr. Jay Gordon...and so many more!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.new-atlantean.com/global/vaccine.html", "http://chetday.com/vacmenu.html", "http://www.access1.net/via/vaccine.htm", "http://www.unc.edu/~aphillip/www/vaccine/informed.htm", "http://www.909shot.com/", "http://www.pnc.com.au/~cafmr/online/vaccine/vacc.html", "http://home1.gte.net/carriet/VaccinationsKill.htm", "http://home1.gte.net/carriet/VaccinationsKill.htm"], "authors": [], "publish_date": null}