{"result_id": "180013", "URL": "https://www.jesus-is-savior.com/Health_Concerns/vaccination.htm", "timestamp": "2023-04-25 16:08:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/vaccination.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "THE VACCINATION FILES", "cleaned_text": "\"God Bless all the Little Children\"\n\nAN ALERT TO ALL PARENTS!\n\nFor the sake of all the children in the world!\n\n\n\n WHAT IS IN A SHOT? \n\n \n\n These are just some of the ingredients used to make a vaccine. \n\n \n\n Ethylene glycol (antifreeze) \n\n Phenol also known as carbolic acid (this is used as a disinfectant, dye) \n\n Formaldehyde a known cancer causing agent \n\n Aluminum which is associated with Alzheimer disease and seizures also cancer producing in laboratory mice \n\n (it is used as an additive to promote antibody response) \n\n Thimerosal (used as a mercury disinfectant/preservative) can result in brain injury and autoimmune disease \n\n Neomycin, Streptomycin (used as antibiotic) have caused allergic reactions in some people \n\n \n\n These vaccines are grown and strained through animal or human tissues like monkey kidney tissue, chicken embryo, embryonic guinea pig cells, calf serum, human diploid cells (the dissected organs of aborted fetuses as in the case of rubella, hepatitis A, and chickenpox vaccines) \n\n \n\n The problem with animal cells is that during serial passage of the virus through the animal cells, is that animal RNA and DNA can be transferred from one host to another and undetected animal viruses may slip past quality control testing procedures as in 1955 through 1961 with SV40 which stands for simian #40 (meaning the 40th virus found) which has oncogenic properties (causing cancer) What other viruses could be slipping by that we don't know of?\n\n From the Concerned Parents For Vaccine Safety Home page\n\nList Of Toxic Materials In Vaccine \n\n Toxic Materials Put Into The Body With Vaccines\n\n Many vaccines containing live virus, such as the smallpox vaccine, use bovine sera or other animal sera. \n\n Note - READ the vaccine ingredients list carefully. Do you want these items injected into your and your children's bodies? \n\n Among these many toxic and/or contaminated ingredients is the now infamous Thimerosal (MERCURY). \n\n Also, casein and gelatin are bovine products. \n\n And how about those 'washed sheep red blood cells' in DPT...\n\n sheep have had 'mad sheep' disease (scrapie) for many decades. \n\n Do you feel lucky?\n\n\n\n\"To heal a situation it must first be exposed \n\n Once exposed it must be healed.\"\n\nThis is the purpose of this document.\n\n\"About 12 billion toxic injections, an (unholy) Alliance and the bigger picture of programming mankind\"\n\nIt is getting serious! \n\n (Your) Our children are the target!\n\n Their well-being, their future and that of the coming generations depend on how and if we act now!\n\nFor your convenience; switch to different sections within this same page, brings you to other connections\n\n And for what's NEW go to Page 2 of our vaccination files!\n\nOur children are the main target with the already 12 billion toxic vaccinations given each year and the pressure will increase with the recently officially announced (unholy) in Davos.(February 2000) \n\n An Alliance between the Bill Gates Children's Vaccine program, the International Federation of Pharmaceutical Associations, Public health and Research Institutions, National Governments, The World Bank, The Rockefeller Foundation and The World Health Organisation. \"About 12 billion preventive and curative injections are given each year, signifying that everyday 40 million injections are administered world-wide, according to the World Health Organisation\n\nOne may wonder, even with the most remote consideration, how it would be possible that the toxic and sometimes altered ingredients by genetic engineering in a vaccine could ever prevent or eradicate diseases in spite of the impressive statements of the World Health Organisation in their \n\n If one considers the toxic and cancer producing ingredients in a vaccine, it would be more realistic to consider that the mass vaccination programs are a contributing factor to the increase of cancer world wide. Taking the numbers in the United States as an example, which are more or less representative as a model in the modern world, in the beginning of the 1900's the cancer rate was about 1 in 25 persons. By 1950 it had risen to about 1 in 8, and today it will affect 1 in every 3 Americans now living. Where/What are we heading for? Towards 1 in 2 every persons and finally everyone?\n\nOne may further wonder if the intention behind the vaccination programs, injecting the toxic and cancer producing ingredients in the bloodstream of the babies, youngsters and adults is really designed for prevention and cure or if it is planned for increasing diseases and dependency on treatments and medicines. As if the promotion of the demineralised and refined food, the promotion of junkfoods and drinks, the genetic engineered food, all kind of toxic in the environment, the promotion of the toxic fluoride in the water systems, in pills, drops, and toothpaste, and with many of the TV programs as junkfood for the mind, aren't already enough to worry about the overloaded human system.\n\nWe invite you to look at the many and many about the known dangers of vaccination, including neurological disorders, brain damage, cancer, polio and death. Compare this with the information provided by the World Health Organisation for the general public by stating; \"Serious reactions to vaccines are extremely rare\" , one may wonder if the \"brains\", the \"thinktanks\" behind the mass vaccination programming have still human feelings, compassion for creation and nature or do they consider human beings just as economic units to exploit.\n\nAre we dealing here with other , difficult for us to understand? Are we all seen as human resources, almost invisibly guided, programmed and herded and finally into ? Zombieland designed for politically and medically correct citizens? A new land in which individual freedom, creativity, expression and family life will belong to the past? Step by step directed by social engineers, the ones who really rule the world. .\n\nThis so called \"World Management Team\", are using the Hegelian dialectic of \"Problem, Reaction, Solution\". First, covertly creating the \"problem\" then, waiting in the wings, in anticipation of a \"reaction\" which is set out to cause, they have the alleged computerized \"solution\" to the problem? (Recommended reading David Icke's book \"And The Truth Shall Set You Free\" )\n\nAre the mass vaccination propaganda programs perhaps part of a bigger picture or plan, using fear as the tool? \n\n If you look into our previous posted document you will discover a remarkable parallel, following the same patterns. .First inventing a HIV virus, creating fear using the mass media as a willing tool and offering the solutions in the form of toxic vaccines bringing further down the immune system.. If you dive into the , the same pattern is used by promoting the fear that if you do not use fluoride your teeth will break down. Then offering the solution by adding fluoride to the drinkingwater systems and selling it in toothpaste, drops, vitamins, medicines and through other willing canals. No words about the damage, the effects on the DNA, brain, on the bones etc. Just business as usual.\n\nThe same with the promotion of junkfood. Creating the problem by refining the cereals whereby the body is thrown out of balance and all kinds of diseases are coming to the surface. Offering the solution; \"promoting and selling vaccines, medicines to help the people recovering their bodily function\". And when people are looking for minerals, controls and restrictions through of the sales are channeled through the , saying that only our trusted doctors are trained to know the public needs. In every area you see people who are becoming aware, protesting, struggling to alert their fellow human beings.\n\nWith vaccination the same tactics of creating fear are used. With polio par example, pictures of crippled and paralyzed children are presented to the public through the controlled media. First creating the problem; \"polio is caused by a virus, using fear. Parents are frightened and willing to surrender their responsibility to the doctors, nurses and other health officials. No words about the risk that the same administration of polio may be causing polio. Those who administer all kind of toxic shots, surrender their responsibility to the local health institutions, those of the local health institutions to the ministry of Health, and those within the ministries of Health to the World Health Organisation.\n\nThis organisation with connections in the and other organisations are more than happy to take over all the responsibility as they make the statistics, the propaganda, train the doctors, control the media, and medical science and decide what parents should do and what children should receive. And when people are getting cancer, nothing wrong as their brothers and sisters of the are well trained using chemotherapy, surgery and medicines and untrained with alternative treatments as this is also blocked from the general population. . In case sincere souls might get interested in other more natural approaches, then they will discovering what it means to work outside the system, and at the same time risking to loose their-well paid drivers seat in the company. Doctors can do an amazing job but remember also before giving away your responsibility to a health professional that Ooooops! doctors are killing more people than guns and traffic accidents combined.\n\nGoing through all the vaccination information it is clear enough that people aren't getting objective information, parents aren't informed about all the dangerous effects of the shots. For obvious reasons most of this information is withheld from the parents. \n\n The mass media hardly supplies any other information to the general public than that which is provided and promoted by the producers of the vaccination establishment. The next point to be wondered is if this mass vaccination program is designed to weaken the human species, to make us dependent, easier to be without being able to offer resistance. A last important point is to consider the wisdom and ability of our body to adjust to the environment, to get rid of all kind of toxins expressing its amazing mechanism by dis-ease. Many of our grand parents generations ago, par example, didn't consider measles as a child disease but more as a natural discharge of what the child had accumulated during the embryonic period. And if a child didn't develop this \"sickness\" his/her internal cleaning process would be hindered.\n\nStep by step we are now being programmed now to see measles as a disease and to believe that there is only one way of dealing with it; treating it with vaccinations. Mother's, using their intuition, may well be able to recall back through their feeling system what is the truth and what is the best for their child. Perhaps our grandparents were wiser by knowing the magic powers of nature better than all the so called \"health experts\" in the world behind their most advanced computers.\n\nThe question is what we can do? How can we alert parents with children without pretending what they should or shouldn't do in the case of vaccination, as it is their choice and responsibility if they are or are not willing to surrender their responsibility. But it is the RIGHT of all parents to KNOW all the effects and the risks of the shots on the short and long run before a honest decision can be made. In order to end this vicious circle of surrendering responsibilities, parents need to become informed, remembering and claiming their rights. If this does not happen, this human drama will continue and continue and become worse. \n\n\n\nAnd as all of us belong to the same human family, whereby every child is a member of our common family, it is also our responsibility to inform parents, doctors, nurses, health officials whenever and wherever we can. Due to to the vested financial interests, the control on the mass media, the long rooted belief about the need of vaccinations it isn't easy to approach people to get informed. It may appear next to impossible to change or heal this delicate situation but counting on the parents and especially the mother's love energy, the job can and must be done.\n\n\"To heal a situation it must first be exposed \n\n Once exposed it must be healed.\" \n\n\n\nFor this purpose we have prepared a for you to copy and to pass it on.\n\nThe mass vaccination programs might well enter in the books of history as one of the darkest pages of medical science.\n\nLet us act without condemning, without judging but let us inform and discern, and start \"A Global Parents Alliance\" as a human chain nourished and guided by the power of Love.\n\nFor you to discern.\n\nTHE GLOBAL ALLIANCE FOR VACCINES AND IMMUNIZATION\n\nThe Global Alliance for Vaccines and Immunization is a partnership dedicated to ensuring that all children, however poor, have equal access to these vaccines. Global Alliance Aims At Immunizing All Children \n\n A worldwide alliance of businesses, foundations, development banks, UN agencies and national governments \n\n Monday declared that millions of young lives can be saved each year through its new campaign to immunize all the world's children. The Global Alliance for Vaccines and Immunizations (GAVI) officially launched the vaccination campaign at the World Economic Forum in Davos, Switzerland. Calling the campaign \"The Children's Challenge,\" the GAVI members declared that children have a right to good health and that protecting all of the world's children against preventable diseases is not only a moral imperative, but an essential cornerstone of a healthy, stable world society. \"Businesses, governments and philanthropists should work together to provide the lifesaving vaccines that we take for granted to children around the world,\" said Bill Gates, co-founder of the Bill and Melinda Gates Foundation. \n\n \"Every child deserves access to these vaccines, and millions of lives can be saved. We can, and we should, do this together.\"\n\n\n\n SOME OF THE POSSIBLE VACCINE REACTIONS:\n\nunresponsiveness interrupted sleep or excessive sleepiness vomiting diarrhea inconsolable screaming encephalitis convulsions and other seizures blindness behavior problem autism anaphylactic shock neurological disabilities immune malfunction arthritis epilepsy brain damage cerebral palsy deafness \n\n recurrent Seizures multiple sclerosis Poliomyelitis diabetes mellitus chronic fatigue paralysis\n\n negative change in the genetic DNA structure of humans alzheimer death\n\nThe Nature of the Pharmaceutical Industry\n\n1. The natural purpose and driving force of the pharmaceutical industry is to increase sales of pharmaceutical drugs for ongoing diseases and to find new diseases to market existing drugs.\n\n2. By this very nature, the pharmaceutical industry has no interest in curing diseases. The eradication of any disease inevitably destroys a multi-billion dollar market of prescription drugs as a source of revenues. \n\n Therefore, pharmaceutical drugs are primarily developed to relieve symptoms, but not to cure.\n\n3. If eradication therapies for diseases are discovered and developed, the pharmaceutical industry has an inherent interest to suppress, discredit and obstruct these medical breakthroughs in order to make sure that diseases continue as the very basis for a lucrative prescription drug market.\n\n4. The economic interest of the pharmaceutical industry itself is the main reason why no medical breakthrough has been made for the control of the most common diseases such as cardiovascular disease, high blood pressure, heart failure, diabetes, cancer, and osteoporosis, and why these diseases continue like epidemics on a worldwide scale.\n\n5. For the same economic reasons, the pharmaceutical industry has now formed an international cartel by the code name \"Codex Alimentarius\" with the aim to outlaw any health information in connection with vitamins and to limit free access to natural therapies on a worldwide scale.\n\n6. At the same time, the pharmaceutical companies withhold public information about the effects and risks of prescription drugs and life-threatening side effects are omitted or openly denied.\n\n7. In order to assure the status quo of this deceptive scheme, a legion of pharmaceutical lobbyists is employed to influence legislation, control regulatory agencies (e.g. FDA), and manipulate medical research and education. Expensive advertising campaigns and PR agencies are used to deceiving the public.\n\n8. Millions of people and patients around the world are defrauded twice: A major portion of their income is used up to finance the exploding profits of the pharmaceutical industry. In return, they are offered a medicine that does not even cure.\n\n From Dr Rath; The Nature of the Pharmaceutical Industry article\n\nMore information about eight gigantic multinational corporations, which every day extend their control over the planet.\n\nEach of these eight corporations is at least four things: a pesticide company, a pharmaceutical company, a genetic food seed company and a producer of industrial chemicals. By Jon Rappoport\n\n\n\n\"The greatest threat of childhood disease lies in the dangerous and ineffectual efforts made to prevent them through mass immunisation\". - Dr. R. Mendelsohn Author and Pediatrician\n\n\"Official data have shown that the large-scale vaccinations undertaken in the US have failed to obtain any significant improvement of the diseases against which they were supposed to provide protection\". -- Dr. A. Sabin - Developer of Polio Vaccine\n\n\"Many here voice a silent view that the Salk and Sabin polio vaccine, being made of monkey kidney tissue has been directly responsible for the major increase in leukemia in this country\".- Dr. Frederick Klenner Polio Researcher, USA\n\nDID YOU KNOW...........\n\nto 90% of the decline in death rates from infectious disease occurred BEFORE vaccination commenced.\n\nThat almost every polio case in the US in the last 30 years has been associated with the vaccine itself, the same vaccine given to all Australian children.\n\nThe cost of the whooping cough vaccine had risen from 11 cents in 1982 to $11.40 in 1987. The Vaccine company was putting aside $8.00 per shot to cover legal costs and damages being paid out to parents of brain damaged children and children who die after vaccination.\n\n\n\n\n\n VACCINES PROVEN TO BE LARGEST CAUSE OF INSULIN DEPENDENT DIABETES IN CHILDREN\n\n \n\n \n\n \n\n GOVERNMENT GETS TOUGH ON VACCINATIONS - WHO’S REALLY BEHIND THE PUSH? \n\n By JOHN LESSO\n\nDuring the last decade governments in Australia have dramatically stepped up their push towards increasing vaccination levels and to that end they have initiated campaigns which threaten one of the the very essences of this country’s appeal: freedom of choice.\n\n Government gets tough on vaccinations-Who's really behind the push article\n\nTHE CAUSAL LINK BETWEEN ADMINISTRATION OF A GREAT VARIETY OF VACCINES AND SERIOUS REACTION INCLUDING PERMANENT BRAIN DAMAGE AND DEATH. VACCINATION IS THE SINGLE BIGGEST CAUSE OF SIDS (SUDDEN INFANT DEATH)\n\n Dr. Viera Scheibner\n\nPolio has not been eradicated by vaccination, it is lurking behind a redefinition and new diagnostic names like viral or aseptic meningitis. When the first, injectable polio vaccine was tested on some 1.8 million children in the United States in 1954, within 9 days there was huge epidemic of paralytic polio in the vaccinated and some of their parents and other contacts. The US Surgeon General discontinued the trial for 2 weeks.\n\nThere is another aspect to problems with vaccination: contrary to what you may have heard even from some of those who are calling for the discontinuation of mandatory vaccination in the United States, vaccines do not prevent diseases. The presumed and published \"eradication\" of diseases like smallpox and polio, or Hib meningitis is a myth not supported by even the staunchest pro-vaccinators' research. Smallpox was on the way out, indeed epidemics disappeared decades before the WHO decided to conduct the final \"eradication\" campaign.\n\nMandatory vaccination in the USA is indeed an arrogant insult to the American Constitution, freedom of choice and to just plain human decency and represents medical tyranny. It must be discontinued if the US wants to continue claiming to be the guarantor of freedom for all and from all forms of tyranny. Charity starts at home.\n\n The causal link between vaccines and serious reactions including permanent brain damage and death\n\nTaking vaccines made from blood of humans, aborted fetuses, diseased pigs and monkeys, mercury, aluminum and formaldehyde is a violation of God's law and more of a cause of disease than a cure. First Corinthians 3:16-17 and Deuteronomy 14:3 and 24:21 warns us not to defile the temple of God, our bodies, with anything unclean, which includes poisonous vaccines purposely designed to make us sick and dependent and to destroy the biological integrity and immunocompetence of the human race.\n\nThe National Vaccine Information Center (NVIC) operated by Dissatisfied Parents Together (DPT) charges that they have obtained evidence through the Freedom of Information Act that the Department of Health and Human Services (HHS) is failing to properly monitor reports of deaths and injuries following vaccination and that doctors around the country are failing to report deaths and injuries which occur after vaccination. Government bureaucrats report only 144 deaths annually associated with vaccines but NVIC-DPT found an estimated 5,760 deaths each year caused by vaccines. 159 doctors' offices in seven states were surveyed by NVIC-DPT. In New York, only one out of 40 doctors' offices confirmed that they report a death or injury following vaccination. This shameful cover-up of vaccine caused injury and death by doctors around the country and the federal government is why more and more parents are losing faith in mandatory vaccination. The doctors do not want to be sued for vaccine injury; they are pressured by medical Establishment to look the other way; and government goons sanction this form of legalized murder. \n\n\n\nDEVELOPING ALZHEIMER IS INCREASED BY HAVING HAD VACCINATIONS\n\nData suggest that a person's risk of developing Alzheimer's is increased by having had vaccinations and the resulting long-term impairment of cell-mediated immunity.\n\n \n\n\n\nPosted 23/12/97 CHILDREN vaccinated against whooping cough are 50 per cent more likely to develop asthma, eczema and hay fever in later life.. Being given antibiotics as a baby also puts children at three times greater risk of developing allergic diseases, says research presented yesterday at a lung conference in London.. It gives new support to doctors claiming there is a link between mass vaccination against whooping cough in infants and an explosion in the number of childhood asthma cases.. About one million children have had asthma diagnosed, while many thousands more have wheezing problems, allergic reactions and akin rashes caused by eczema \n\n\n\n\"IS INFANT IMMUNIZATION A RISK FACTOR FOR CHILDHOOD ASTHMA OR ALLERGY?\"\n\nEpidemiology (11/97) Vol. 8, No. 6, P. 678; Kemp, Trudi; Pearce, Neil; Fitzharris, Penny; et al. Results of the Christchurch Health and Development Study, conducted by a team of New Zealand researchers, found a greater rate of asthma and allergy episodes among immunized children.\n\n\n\nHilary Butler (c/- peter@netlink.co.nz) There are many causes of arthritis, but one which receives little acknowledgment is VACCINES. For many years, people who noticed the start of arthritis after a vaccine were told that it was co-incidental. For many years, I was told (and believed it) that the carpal tunnel and arthritis I suffered was as a result of my work and sport.\n\n\n\nData suggest that a person's risk of developing HSV-related epileptiform patterns or epilepsy is increased by having had vaccinations and the resulting long-term impairment of cell-mediated immunity.\n\n \n\n \n\n \n\n\n\nVACCINES AND PRODUCTION OF NEGATIVE GENETIC CHANGES IN HUMANS\n\n(c) 1996-1998 Leading Edge Research Group Vaccination and Genetic Change: Mobility of Genetic Material Between Life Forms: One of the indications that vaccinations may in fact be changing the genetic structure of humans became evident in September of 1971, when scientists at the University of Geneva made the discovery that biological substances entering directly into the bloodstream could become part of human genetic structure.\n\n Vaccines and production of negative genetic change in humans article\n\nVACCINATION & THE PRODUCTION OF MASS BEHAVIORAL AND NEUROLOGICAL PROBLEMS\n\nTechnically speaking, encephalitis is defined as a brain inflammation, and is a sub-class of a category of disease known as encephalopathy, generally defined as brain disease; physicians do not make a systematic distinction between these concepts, and they are used as synonyms. Physicians have always known that encephalitis can be caused by vaccinations/immunizations. One of the remarkable aspects of encephalitis is that it spawns a great variety of physiological, neurological, mental, behavioral and emotional symptoms.\n\n\n\nIn justifying the continued push for vaccinations, the medical and research establishment use the often-repeated argument that if it were not for vaccinations the developed countries would still be plagued by the major disease epidemics of the past. One of their favorite examples is polio. They often speak of the epidemics of paralytic polio cases occurring among infants in the early part of this century and in particular during the late 1940s and early 1950s, and they would have us believe that polio vaccination had saved us from this terrible scourge. Nothing could be further from the truth. Not only did the polio vaccine have nothing to do with the decline of paralytic polio (or polio in general), evidence shows that vaccinations for this and other diseases, notably diphtheria, triple antigen (diphtheria, pertussis and tetanus) and smallpox – were responsible for its increase. The decline of cases not caused by vaccination began to disappear in the West with improvements in hygiene and sanitation and most of the decline occurred well before the widespread use of polio vaccination.\n\n\n\nDr. Viera Scheibner Ph.D. has done research on babies breathing and stress and discovered the vaccine connection. These two people began there work unbiased not backed by vaccine manufacturers or others with stake in the vaccine business. Also there have been studies done in medical journals showing a causal relationship with DPT vaccine and SIDS.\n\nVACCINATION: 100 Years of Orthodox Research shows that Vaccines Represent a Medical Assault on the Immune System by Viera Scheibner ,Ph.D.\n\n \n\n\n\nIn an experiment to find out of they could give high-potency Edmonston Zagreb (EZ) measles vaccine to babies as young as four months old [completing disregarding developmental neurology and lack of myelinization in the nervous system of babies] in order to overwhelm their natural maternal antibodies and replace them with vaccine-induced antibodies, medical \"researchers\" at the CDC and Johns Hopkins University injected thousands of babies in the Third World with the experimental vaccine that reportedly caused chronic immune suppression and the deaths of an unknown number of babies. Also, in the United States, with the help of Kaiser Permanente, more than 1500 six-month old black and Hispanic babies in inner city Los Angeles were \"enrolled\" in the experiment starting in June 1990. The study was halted in October 1991, after more than one year of genocidal activity, after repeated reports from vaccine trial sites in Africa that girl babies were dying in higher than expected numbers six months to three years after injection. \n\n\n\nDuring the early 1990’s the WHO (World Health Organization) has been overseeing massive vaccination campaigns against Tetanus in a number of countries Mexico, Nicaragua, and the Philippines . In 1994 suspicion of these campaign protocols began. The vaccine protocols called for three injections in three months and five total within a years time . These tetanus vaccines were given only to woman age 12-49 children and men were excluded. More alarm bells went off when many of the pregnant women who were given the tetanus vaccine began to experience bleeding and early miscarriages . When several vials of this tetanus vaccine were analyzed by chemists many of the vials contained Human Chrionic Gonadotrophin (hCG) which the body uses to maintain pregnancy. So what does this all mean? Well when hCG is injected into the body with a tetanus toxic carrier (a tetanus toxois is used because the human body does not attack it’s own naturally occurring hormone hCG)the body will then begin to produce antibodies to hCG. So when a woman becomes pregnant and a sufficient amount of anti- hCG antibodies is built up in her system, she then becomes unable to maintain a pregnancy and she will miscarry. \n\n\n\nHow deliberately allowed biological toxins affect human health, reproduction, intelligence and social behavior, yielding social conditions involving learning disabilities, crime and other devolutionary phenomena, allowing specific social factions to control the consciousness of the general population, maintain conflict and prevent planetary evolution while reaping windfall profits from biologically aided neurophysiological degeneration.\n\n\" In regions in which there is no organized vaccination of the population, general paralysis is rare. It is impossible to deny a connection between vaccination and the encephalitis (brain damage) which follows it.\" Journal of the American Medical Association July 3, 1926, p.45 \n\n\n\nBabies are not the only human guinea-pigs that doctors use for experimental purposes with tragic results. The soldiers of the Gulf War were considered fair game, too. The soldiers developed a multitude of illnesses after receiving experimental vaccinations and pills before the war. We do know some Gulf War Vets were exposed to unknown chemicals of the enemy, but what about all the rest who are becoming ill those who did not even go overseas. Why are medical records being destroyed, Soldiers who received experimental vaccines are speaking out about how their medical records are disappearing or info on what they received was purposely not entered. The fact remains our soldiers are dying from these experimental vaccines and the Govt. refuses to do anything and now there is talk about giving theses same vaccines to our current men and women in the military and even the general public.\n\n\n\n\"The lengthy report of the Shays Subcommittee concludes that the anthrax policy \"lacks an essential element in a medical program: trust.\" The Pentagon's \"absolutist declarations, heavy-handed propaganda, and ad hominem attacks\" against those who question the policy are seen as another chapter in a long history of \"military medical malfeasance\" that includes lies about nuclear testing, Agent Orange, and Gulf War drugs and vaccines. The long-term effects of the anthrax vaccine have never been studied, but the immediate reactions include autoimmune disorders, lesions, rashes, memory lapses, thyroid problems, blurred vision, inability to drive or read, crippling bone-joint pain, loss of concentration and chronic fatigue.\"\n\n\n\nWASHINGTON, Jan. 31 /PRNewswire/The Bill Gates Foundation appealed today for more donations for a vaccine program designed to protect children in developing countries from various diseases, including tetanus. But the Gates tetanus program bears striking resemblance to another tetanus program that sterilized thousands of women and caused abortions in many others in the Philippines. As reported by the BBC in conjunction with the Philippine Department of Health and the Philippine Medical Association, women in childbearing years were given a vaccine that was combined with a chemical known as Human Chorionic Gonadotrophin (HCG), an anti-pregnancy agent.\n\nThis earlier program involved only women. The current Gates tetanus vaccine program also is administered only to women in childbearing years. American Life League president Judie Brown sent a certified letter to Bill and Melinda Gates today, asking them to publicly denounce the tetanus deceptions of the past that ``created such a devastating controversy in the Philippines.'' ``We're not blaming the Gateses for the forced sterilizations in the Philippines, but their program has disturbing similarities to the last one-and it's administered by the same deceptive agency, the World Health Organization,'' said Brown. ALL is also asking the Gateses to affirm their total opposition to abortion and their guarantee that no funding will be provided to childhood vaccines that are manufactured using cells of intentionally aborted children at any stage of development. Judie Brown is president of American Life League, the nation's largest > pro-life educational organization with more than 300,000 supporters. ALL, P.O. Box 1350, Stafford, VA 22555, 540-659-4171 \n\n\n\nA new report by Dr. Harold Buttram, a practicing physician in Quakertown, Pa., suggests the recent increase in the number of autistic children could be caused by the combination measles, mumps and rubella, or MMR, vaccine routinely given to children at age 18 months -- a phenomenon the Centers for Disease Control and Prevention claim is highly unlikely. \n\n \n\n\n\nA PARTIAL LIST OF MEDICAL JOURNAL ARTICLES DEALING WITH THE DANGER OF VACCINES\n\nThis is a collection of medical journal articles dealing with the dangers and ineffectiveness of vaccines. \n\n We will be adding more so check back to see what has been added. \n\n\n\nPancreatis Caused by Measles, Mumps, and Rubella Vaccine Pancreas vol. 6 no 4 1991 [2]\n\n Mumps Meningitis Following Measles, Mumps ,and Rubella Immunization Lancet July 1989 [1pg]\n\n Optic Neuritis Complicating Measles, Mumps, and Rubella Vaccination American Journal of Opthalmology 1978 :86 [4pgs.]\n\n A Prefecture-wide Survey of Mumps Meningitis Associated with Measles, Mumps and Rubella Vaccine (Infec Dis J 1991 \n\n Vol 10 pg 204-209)\n\n Bilateral Hearing Loss After Measles and Rubella Vaccination In An Adult ( NEW ENGLAND JOURNAL OF \n\n MEDICINE July 11, 1991 pg 134) [1pg]\n\n Reports of Sensorineural deafness after measles, mumps, and rubella immunization Arch of Disease in Childhood 1993:69 \n\n [2pgs.]\n\n Is RA27/3 Rubella immunization a cause of chronic fatigue (MEDICAL HYPOTHESES 1988 27 pgs. 217-220) [4pgs]\n\n Chronic Arthritis After Rubella Vaccination Clinical Infec Dis. 1992 15;307-12 [6pgs]\n\n An Explosive point-source measles outbreak in a highly vaccinated population (American Journal of Epidemiology 1989 Vol 129 no 1) [10]\n\n Neurological disorders Following Live Measles-Virus Vaccination (JAMA March 1973, Vol 223 No 13) [4pgs]\n\n A Persistent Outbreak of Measles Despite Appropriate Prevention And Control Measures ( American Journal of \n\n Epidemiology Vol 126 No3) [13pgs.]\n\n Child Mortality After High-Titre Measles Vaccines (this is on E-Z measles) Lancet Vol 338 1991 [4pgs]\n\n Pathogenesis of Encephalitis Occurring with Vaccination , Variola and Measles Arch of Neurology and Psychiatry 1938 Vol 39 [8pgs]\n\n Measles Vaccine Associated Encephalitis in Canada Lancet Sept. 1983 [2pgs]\n\n Pancreatitis Caused by Measles, Mumps, and Rubella Vaccine Pancreas vol 6 no 4 [2pgs]\n\n Measles Vaccine and Neurological Events Lancet May 1997 [2pgs]\n\n Mumps Vaccine and Nerve Deafness Amer J Dis Child Vol. 123 1972 [1pg]\n\n Vaccine Associated Poliomyelitis Lancet March 1994 Vol 343 [3pgs]\n\n Vaccine Associated Paralytic Poliomyelitis New England J of Med 1993 [1pg]\n\n More on Vaccine Associated Paralytic Poliomyelitis New England Journal of Medicine Dec 23,1993 [2pgs]\n\n Neurologic Complications In Oral Polio Vaccine Recipients J of Ped June 1986 [4pgs]\n\n Encephalopathy Following Diphtheria Pertussis Inoculation Arch Dis Childhood Vol 28 1953 [1pg]\n\n Fatal Anaphylactic Shock occurrence in identical twins following second injection of diphtheria toxoid and pertussis antigen \n\n JAMA June 1946 [6pgs]\n\n Pertussis Vaccination and Asthma: is there a link? JAMA 1994 Vol 272 no 8 [1pg]\n\n Neurological Complications of Pertussis Inoculation Arch Dis in Childhood 1974 ;49 [4pgs]\n\n Encephalopathies Following Prophylactic Pertussis Vaccine Pediatrics Vol 1 1948 [20pgs]\n\n Recurrent Seizures After Diphtheria, Tetanus, and Pertussis Vaccine Immunization AJDC Oct 1984 Vol 138[3pgs]\n\n Seizures Following Childhood Immunizations J of Pediatrics Vol 102 no 1 [7pgs]\n\n Unusual Neurological Complications Following Tetanus Toxoid Administration J Neurology 1977 ;215 [2pgs]\n\n Abnormal T- Lymphocyte Subpopulations in Healthy Subjects After Tetanus Booster Immunization New England Journal of Medicine Jan 1984 [2pgs]\n\n Acute Hepatitis B Infection after Vaccination Lancet Vol 345 Jan 1995\n\n Severe Acute Hepatitis B Infection After Vaccination Liver Dysfunction and DNA Antibodies After Hepatitis B Vaccination Thrombocytopenic Purpura After Recombinant Hepatitis B Vaccine Lancet Vol 344 [2pgs]\n\n Myocardial Complications of Immunizations Annals of Clinical Research 1978 Vol 10 [8pgs]\n\n Vaccine Damage Lancet Jan 1997 [1]\n\n Sudden Death Amoung Finnish Conscripts (this deals with vaccines causing death due to damage to heart ) British Med J \n\n 1976 [3pgs\n\n Childhood Immunization and Diabetes Mellitus New Zealand Medical Journal May 1996 [1pg]\n\n Malignant Tumors as a Late Complication o f Vaccination Arch Derm Vol 98 1968 [4pgs]\n\n Neurological Complications of Immunization Annals of Neurology Aug 1982 [10pgs]\n\n Multiple Sclerosis and Vaccination BMJ April 1967 [4 pgs ]\n\n Increase in Asthma correlates with Less Childhood Infection Lancet Jan 1997 [1pg]\n\n Possible Temporal Association Between Diphtheria-Tetanus Toxoid-Pertussis Vaccination and Sudden Infant Death \n\n Syndrome Pediatric Infectious Disease 1983 Vol 2 no 1 [5pgs]\n\n DTP Vaccination and Sudden Infant Deaths—Tennessee MMWR March 23,1979 [2pgs]\n\n Characteristics of Diphtheria-Pertussis- Tetanus (DPT) Postvaccinal Deaths and DPT- Caused Sudden Infant Death \n\n Syndrome (SIDS) : A Review Neurology April 1986 [2pgs] \n\n See the more complete list with references of Medical Journal articles dealing with the danger of vaccinations\n\nTHE STATE-BY STATE PUSH FOR VACCINE MANDATES (US)\n\nWeb site reveals Merck vaccine mandate strategy The state-by-state push for vaccine mandates is remarkably revealed by a Merck-supported legislative update.\n\n\n\nCONFLITS OF INTEREST AND VACCINE DEVELOPMENT: \n\n PRESERVING THE INTEGRITY OF THE PROCESS \n\n (US GOVERNMENT COMMITTEE)\n\nToday, we are going to continue our series of hearings on vaccine policy. For the last few months, we've been focusing on two important advisory committees. The Food and Drug Administration (FDA) and the Centers for Disease Control and Prevention (CDC) rely on these advisory committees to help them make vaccine policies that affect every child in this country.\n\nWe've looked very carefully at conflicts of interest. We've taken a good hard look at whether the pharmaceutical industry has too much influence over these committees. \n\n From the evidence we found, I think they do.\n\n Conflict of Interest and Vaccine development (US Government Committee) article \n\n\n\nThis page is a dedication, representing all the children that have been damaged by vaccines.\n\nLet us all stand up and be the voices for these innocent children who can not speak for themselves and stop these tragedies from happening to another child's life. Our thoughts and prayers go out to all these children and their families who's lives have been damaged by vaccines. \n\n This page is dedicated to all the children that have been damaged by vaccines article.\n\nGo to part 2 of the \"Vaccination Files\" with the following contents:\n\nHow the World Organisation informs the general public (questions and answers)\n\n* United nations Foundation grant to fuel expansion of World Health Organisation's child and * youth activities (Press Release WHO/78 13 December 1999)\n\n* Bill and Melinda Gates and Ted Turner donate US$ 78 million to accelerate the campaign *to eradicate polio by end 2000\n\n* WHO in partnership: (more) examples of work with the public and private sectors to fight infectious disease ( October 1999)\n\n* WHO safety of injections questions and answers (October 1999)\n\n* An offer of made to U.S.-licensed medical doctors who routinely \n\n administer -childhood vaccinations and to pharmaceutical company CEOs worldwide\n\n* And much more Updates.....\n\nTo Page 2 of the Vaccination Files", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://home.iae.nl/users/lightnet/health/vaccination.htm", "http://home.iae.nl/users/lightnet/health/vaccination.htm", "http://home.sprynet.com/~gyrene/whatsi~1.htm", "mailto:dr_p_doyle@hotmail.com", "http://www.rense.com/general32/thru.htm", "http://home.iae.nl/users/lightnet/health/vaccination2.htm", "#alliance", "http://www.who.int/inf-fs/en/fact234.html", "http://www.who.int/aboutwho/en/history.htm", "#medical", "http://home.iae.nl/users/lightnet/health/vaccination2.htm", "http://home.iae.nl/users/lightnet/health/mindset.htm", "http://home.iae.nl/users/lightnet/world/mark.htm", "http://home.iae.nl/users/lightnet/health/henrylamb.htm", "http://www.davidicke.com/icke/visitor.html", "http://www.davidicke.com/icke/cat-books.html", "http://home.iae.nl/users/lightnet/health/aidsfile.htm", "http://home.iae.nl/users/lightnet/health/fluoride.htm", "http://www.iahf.com/index1.html", "#pharmaceutical", "http://www.pnc.com.au/~cafmr/online/research/cancer.html", "http://www.sightings.com/politics2/doctors.htm", "http://home.iae.nl/users/lightnet/health/globalgovernance.htm", "http://home.iae.nl/users/lightnet/health/flyer.htm", "http://vaccinealliance.org/orgs/billmelinda.html", "http://vaccinealliance.org/orgs/ifpma.html", "http://vaccinealliance.org/reference/research_public.html", "http://vaccinealliance.org/orgs/unicef.html", "http://vaccinealliance.org/orgs/nationalgov.html", "http://vaccinealliance.org/orgs/rock.html", "http://vaccinealliance.org/orgs/world_bank.html", "http://vaccinealliance.org/orgs/who.html", "http://www.rath.nl/intro/usa.htm", "http://home.earthlink.net/~alto/boycott.html#international", "http://www.ias.org.nz/ian/vaxfacts.htm", "http://vaccines.net/newpage11.htm", "http://minyos.its.rmit.edu.au/~s9606643/41c.htm", "http://home.iae.nl/users/lightnet/health/scheibner.htm", "http://home.iae.nl/users/lightnet/health/mandatory.htm", "http://www.ias.org.nz/alz.htm", "http://www.ias.org.nz/asthma.htm", "http://www.ias.org.nz/asthma2.htm", "http://www.ias.org.nz/arth.htm", "http://www.ias.org.nz/epilep.htm", "http://www.trufax.org/vaccine/vaccgen.html", "http://www.trufax.org/m3v2/vacc2.html", "http://www.trufax.org/m3v2/vacc2.html", "http://home.sprynet.com/~gyrene/polio.htm", "http://home.sprynet.com/gyrene/sidsan~1.htm", "http://www.trufax.org/vaccine/0696.html", "http://home.sprynet.com/~gyrene/hcg.htm", "http://www.trufax.org/menu/bio.html", "http://home.sprynet.com/~noshots/gulfwar.htm", "http://home.iae.nl/users/lightnet/health/anthrax.htm", "http://home.iae.nl/users/lightnet/health/americanlife.htm", "http://home.iae.nl/users/lightnet/health/autism.htm", "http://home.sprynet.com/~gyrene/medart.htm", "http://home.iae.nl/users/lightnet/health/merck.htm", "http://home.iae.nl/users/lightnet/health/vaccinationconflict.htm", "http://home.sprynet.com/~gyrene/injured.htm", "http://home.iae.nl/users/lightnet/health/vaccination2.htm", "http://home.iae.nl/users/lightnet/health/vaccination2.htm", "#top", "http://home.iae.nl/users/lightnet/health/vaccination.htm"], "authors": [], "publish_date": null}