{"result_id": "180015", "URL": "https://www.jesus-is-savior.com/Health_Concerns/swine_flu.htm", "timestamp": "2023-04-25 16:08:32 CEST+0200", "meta": {"description": "SWINE FLU AND CORONA VIRUS PANDEMIC", "lang": "en", "keywords": "SWINE FLU AND CORONA VIRUS PANDEMIC", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/swine_flu.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "SWINE FLU AND CORONA VIRUS PANDEMIC", "cleaned_text": "According to reports, the virus is a “never-before-seen form of the flu that combines pig, bird and human viruses” which consists of an intercontinental mix of viruses from North America, Europe and Asia. “CDC officials detected a virus with a unique combination of gene segments that have not been seen in people or pigs before,” according to an “This strain of swine influenza that’s been cultured in a laboratory is something that’s not been seen anywhere actually in the United States and the world, so this is actually a new strain of influenza that’s been identified,” said Dr. John Carlo, Dallas Co. Medical Director ( video clip here\n\nNote as of May 2010: It's been one year since the Swine Flu scare. The crucial thing to realize is that from the beginning, Swine Flu was identified as a bioweapon. Bush, Obama and Rumsfeld are all stock owners in the drug, Tamiflu, which is the cure for Swine Flu. Connect the dots. This was only a test by the global elite, to get ready for the unthinkable, which is coming. FEMA has 500,000 coffins waiting for something!\n\nSwine Flu outbreaks have been reported so far in California, Texas, Indiana, Kansas and New York so far as of 04-28-09. All indications point toward a designer virus, a manmade bioweapon. One of the most telltale signs is that the Bush, Obama and Rumsfeld are all stock owners in the drug, Tamiflu, which is the cure for Swine Flu. Connect the dots.\n\nThis is a new virus never seen before according to the CDC, combining various flu strains. The Swine Flu pandemic WILL BE used as a means of furthering Police State control over the public. Anyone who refuses the shot, which has serious potential health risks, will be placed into a FEMA detention camp. FEMA has purchased over 500,000 plastic coffins in Georgia. Plans for Mass Graves have been Confirmed in New York. The government has been surveying cemetery readiness for a Flu outbreak. It's not hard to connect the dots.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.azstarnet.com/sn/health/290118.php", "http://www.theglobeandmail.com/servlet/story/RTGAM.20090424.wvswine_flu0424/VideoStory/International/?pid=RTGAM.20090424.wswine0424", "http://www.infowars.com/swine-flu-is-deadly-mix-of-never-before-seen-viruses", "http://upswing.newsvine.com/_news/2009/04/26/2735113-donald-rumsfelds-swine-flu-vaccine-tamiflu-could-paralyze-or-kill-you-while-it-makes-investors-rich?commentId=6727807", "http://www.youtube.com/results?search_type=&search_query=FEMA+coffins&aq=f", "http://www.cnn.com/2009/HEALTH/04/26/swine.flu.ny/index.html", "http://upswing.newsvine.com/_news/2009/04/26/2735113-donald-rumsfelds-swine-flu-vaccine-tamiflu-could-paralyze-or-kill-you-while-it-makes-investors-rich?commentId=6727807", "http://www.azstarnet.com/sn/health/290118.php", "http://www.youtube.com/watch?v=jeqjykY5wPk", "http://www.infowars.com/plans-for-mass-graves-confirmed-government-surveying-cemetery-readiness-for-flu-outbreak/"], "authors": [], "publish_date": null}