{"result_id": "180011", "URL": "https://www.jesus-is-savior.com/Wolves/chisholm.htm", "timestamp": "2023-04-25 16:08:30 CEST+0200", "meta": {"description": "George Brock Chisholm was an anti-American, anti-Christian, anti-family, Communist, SICKO!", "lang": "en", "keywords": "George Brock Chisholm", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Wolves/chisholm.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "George Brock Chisholm: SICKO!", "cleaned_text": "Mr. Chisholm (the father of public school philosophy) hated God, morality and country...\n\n“To achieve world government, it is necessary to remove from the minds of men their individualism, loyalty to family tradition, national patriotism, and religious dogmas.” \n\n Speech given at the, Conference on Education, Asilomar, California, September 11, 1954\n\nFew parents of public school children realize that one of the primary engineers of today's Godless public school philosophy was a God-hating, family-hating, immoral, sick-minded, Communist. His name is Dr. Brock Chisholm, the first head of the World Health Organization (WHO), laid the blame for war and human conflict squarely at the feet of parents and Sunday School teachers who — from the beginning — fed their children the “poisonous certainties” of the Bible:\n\nThe following excerpts are taken from the book, None Dare Call It Treason, by John A. Stormer:\n\nFor the rare citizen who escapes indoctrination in the \"new social order\" in progressive schools; for the Bible-believing Christian who rejects \"theologians\" who teach that socialism is the new \"Kingdom of God on Earth\"; for all the sturdy souls who hold to age-old concepts of right and wrong, and are vocal about it, the collectivists have one final, ultimate weapon. Declare them insane! Fantastic? Not at all. Just as in the fields of education, religion, press, radio and TV, the collectivists have succeeded in infiltrating and twisting the honorable psychiatric and psychological professions to their own ends.\n\nThe \"new leaders\" in the psychiatric field propose to re-educate the world's population using psychological procedures to create a new breed of amoral men who will accept a one-world socialistic government. They hold the weapon of commitment to a mental institution over the heads of those \"reactionaries\" who rebel at accepting the \"new social order.\"\n\nIt sounds unbelievable? Listen to the words of Dr. G. Brock Chisholm, first head of the World Federation of Mental Health, and later head of the World Health Organization of the United Nations. His address, sponsored by the William Alanson White Psychiatric Foundation was delivered in October 1945 in Washington D.C. to a large group of psychiatrists and high government officials. said:\n\nChisholm has been obsessed for years with the idea that instilling concepts of right and wrong, love of country, and morality in children by their parents is the paramount evil. In another speech, he said:\n\nWhat besides concepts of morality and right and wrong does Dr. Chisholm consider to be a neurosis? He explains it in this speech:\n\nChisholm proposes that psychotherapy be used to eradicate such neuroses as a man wishing to defend his own private property in this way:\n\nThis is the basic Marxist concept, i.e., that those who have should have it taken away. How different are Chisholm's ideas from those of America's pioneers. Had they decided on some scheme of redistribution of the wealth, all would have stayed poor and hungry, because there was no wealth.\n\nInstead of redistributing what meager wealth was available, they conceived a system of government which safeguarded private property. Initiative was stimulated and people were encouraged to produce, and by producing, to create new wealth for themselves. In the process, all men benefited from more jobs, new products and services. In freedom, men have made more spiritual, moral, intellectual progress, and produced more material wealth for themselves and others than under any other system conceived by man.\n\nAlthough honored and recognized by many as a great humanitarian, George Brock Chisholm was a wolf in sheep's clothing who despised God, morality, and the Christian family. The public school system today is controlled by evil people who have sold their souls to the Devil. Children who should be learning about their Creator are instead being brainwashed with the unproven and non-scientific THEORIES of godless Evolution. Sicko groups like GLSEN, working in the public school, are trying to turn children into homosexuals.\n\nDr. Chisholm, Margaret Mead (the federation’s second president) and other social scientists from ten countries wrote its founding document, \"Mental Health and World Citizenship\" (SOURCE: Origins of the World Federation for Mental Health\n\nToday, more than half a century later, that \"attitude of acceptance\" has been built. Nations around the world are fast conforming to the pattern set in the 1940s. The global network of \"mental health\" partners is working to prevent anything that would hinder \"positive\" collective thinking in the rising global village. Few notice its tentacles reaching into community health programs and civil society in over 130 nations around the world. END", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["../Family/none_dare_call_it_treason.htm", "../Evolution%20Hoax/evolution_the_big_hoax.htm", "../Evils%20in%20America/Sodomy/teaching_kids_gay_sex.htm", "../Evils%20in%20America/Sodomy/teaching_kids_gay_sex.htm", "http://www.psych.org/pnews/98-01-19/hx.html", "../Family/public_schools_are_evil.htm", "../Family/public_schools_are_evil.htm", "http://www.101reasons.org/", "http://www.homeschooldigest.com", "http://www.homeschooltoday.com", "http://www.honestedu.org"], "authors": [], "publish_date": null}