{"result_id": "180019", "URL": "https://www.jesus-is-savior.com/Health_Concerns/medical_fascism.htm", "timestamp": "2023-04-25 16:08:34 CEST+0200", "meta": {"description": "Forced Drugging and Vaccination of Children", "lang": "en", "keywords": "Forced Drugging, Vaccination, Children", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/medical_fascism.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "Forced Drugging and Vaccination of Children", "cleaned_text": "I do NOT endorse the Yin/Yang occultism promoted by ShirleysWellnessCafe.com. In my pursuit of finding the truth and sharing it with others, I am often placed in a dilemma of having to decide what to promote and what to discard. The health information provided by ShirleysWellnessCafe.com is excellent and thorough, and I think worthy of our attention. If I were to remove every offensive element of my ministry because of every sanctimonious believer who criticizes something I promote, then a lot of vital truth would be suppressed. How ironic!\n\nParents pressured to put kids on AZT, Ritalin, and other dangerous toxic drugs \n\nJudges can constitutionally order controversial drugs to be given to a child over the opposition of his parents. Parents are medicating their children for fear of having them hauled away by Child Protective Services. Please read, DCFS Monsters!\n\n\"The drugging of children has gotten so out of hand that America is waking up to this. This is a national catastrophe. I'm seeing children who are normal who are on five psychiatric drugs.\"\n\n—Peter R. Breggin, M.D. Director, International Center for the Study of Psychiatry and Psychology\n\nForced Drugging of Children - Parents may face jail over compulsory drug orders In the US judges can constitutionally order controversial drugs to be given to a child over the opposition of his parents. Parents are medicating their children for fear of having them hauled away by Child Protective Services. In the UK Parents of children diagnosed with attention deficit hyperactivity disorder (ADHD) will face jail under proposals in the new Mental Health Bill if they refuse to drug their children, a psychiatrist has warned.\n\nFDA WARNING FUELS NEED FOR FEDERAL PROTECTIONS AGAINST FORCED MULTI-BILLION DOLLAR PSYCHIATRIC DRUGGING IN SCHOOLS \n\nOn Monday, March 22, 2004, the Food and Drug Administration (FDA) issued a public health advisory putting doctors on notice and to be vigilant for signs of suicidality or worsening depression with the use of Selective Serotonin Reuptake Inhibitor (SSRI) antidepressant drugs use. Patients, families and other caregivers are also warned. The Citizens Commission on Human Rights (CCHR), an international psychiatric watchdog group, says the warning does not go far enough-the potential for antidepressants to cause suicidal and self-injurious behavior has been established-the drugs should not be prescribed to children at all. more\n\nJulian Whitaker M.D. - \"Ritalin: Legally Sanctioned \"Speed\" Ritalin is the number one prescription drug for children with attention deficit hyperactivity disorder (ADHD). This drug has such tremendous potential for abuse that it is classified as a controlled substance by the Drug Enforcement Agency. Ritalin is an amphetamine (in street jargon, \"speed\") with a lengthy list of side effects, including nervousness, insomnia, nausea, abdominal pain, loss of appetite, dizziness, palpitations, headaches, irregular heart rhythms, and psychic dependence — in short, addiction. In fact, Ritalin's appeal to drug users and its potential for abuse are so high that US House Judiciary Chair Henry Hyde (R-IL) recently filed a request with the General Accounting Office (GAO) to conduct an investigation of Ritalin abuse in public schools. In addition, class action lawsuits have been filed in Texas, California and New Jersey charging Swiss pharmaceutical giant Novartis, maker of Ritalin, with conspiracy to create the psychiatric disorder known as ADHD in order to fuel the market for their product.\"\n\nDr. Allen Buresz - \"In 1996 the World Health Organization warned that Ritalin over-use has reached dangerous proportions. Ritalin, for instance, may provoke seizures and suppress growth, or it may cause angina, blood pressure changes, depression or any of a very long list of serious side effects.\"\n\nLawsuits filed in Texas, California and New Jersey claim that the booming success of Ritalin is the result of a conspiracy in which the American Psychiatric Association, Novartis Pharmaceutical Corp. and national parents' group Children and Adults With Attention-Deficit/Hyperactivity Disorder (CHADD) colluded to create the diagnoses of Attention Deficit Disorder (ADD) and Attention Deficit Hyperactivity Disorder (ADHD). Following the acceptance of ADD/ADHD as medical diagnoses, sales of Ritalin and similar stimulants have skyrocketed, with more than 6 million such prescriptions being written in 1995, according to the National Institute of Mental Health.\n\nAZT - Parents forced to administer AZT, a toxic DNA chain terminator and known carcinogen, to their newborn children\n\nMarch against medicating children with stimulants (On May 14th, 2005)\n\nWHERE PARENTS TURN FOR HELP TO PROTECT THEIR CHILDREN \n\n that can help parents protect their kids from forced drugging and from the CPS and the government.\n\n\"Take the Pills, or We'll Take Your Kids!\" Death From Ritalin - The Truth Behind ADHD A testimonial and plea for help from a distraught mother WHERE PARENTS TURN FOR HELP TO PROTECT THEIR CHILDREN FDA Issues Public Health Advisory on Cautions for Use of Antidepressants in Adults and Children\n\n\n\n Death From Ritalin - The Truth Behind ADHD \n\nThis is an educational resource for parents whose children have been diagnosed with Attention Deficit Hyperactivity Disorder (ADHD) and are being pressured into drugging their child by a school Psychologist, social worker, teacher, or principle. This site expose the health risks, dangers, and deaths that are a direct result of administering psycho-tropic drugs to children. These psycho-tropic drugs given to children labeled with ADHD include Ritalin, Methylphenidate, Concerta, Dexedrine, Dextrostat, and Metadate, just to name a few. It is time for parents to come together and fight this horrific war against the drugging of our children, America's future. This site is full of resourced and information -\n\n\"To my knowledge there are but 8 states that have passed legislation banning the practice of a school forcing parents to drug their children. This is possible in 42 states. On a national level, The Child Medication and Safety Act has passed the House by a near unanimous vote. This legislation would let parents refuse to drug their children in every state.Our website-- http://www.fightforkids.org/ -- has a legislative grid where you can \n\nfind the states who have passed laws and other states that have passed resolutions, and still other \n\nstates with legislation, studies, and resolutions pending.\" Joe Bleich\n\nFebruary 29, 2004 -- The state Health Department has launched a probe into potentially dangerous drug research conducted on HIV-infected infants and children at a Manhattan foster-care agency, The Post has \n\nlearned. Some 50 foster kids were used as \"guinea pigs\" in 13 experiments with high doses of AIDS medications at Manhattan's Incarnation Children's Center, sources said.\n\nMost of the ICC experiments were funded by federal grants and in some cases, pharmaceutical companies. They used city foster children, who were sent to the Catholic Archdiocese-run facility by the Administration \n\nfor Children's Services. ICC was involved in 36 different experiments, according to the National Institutes of Health Web site. One study researched \"HIV Wasting Syndrome,\" which studied how a child's body changes when his medication is altered. A handful of the experiments involved combining up to six AIDS drugs - so-called \"cocktails\" - in children as young as 3 months, and another explores the reaction of not one, but two doses of the measles vaccine in kids ages 6 to 7 months.\n\nOther studies tested the \"safety,\" \"tolerance\" and \"toxicity\" of AIDS drugs. \"They are torturing these kids, and it is nothing short of murder,\" said Michael Ellner, a minister and president of Health Education AIDS Liaison, an advocacy group for HIV parents. Biochemist Dr. David Rasnick, a visiting scholar at the University of California at Berkeley and an expert in AIDS medication, was outraged because the drugs, alone or combined, have \"acute toxicity which could be fatal.\" He said the drugs' side effects include severe liver damage, cancerous tumors, severe anemia, muscle wasting, severe and life-threatening rashes and \"buffalo hump,\" where fatty tissues accumulate behind the neck. more\n\n\n\n In memory of our son, Alexander Horwin\n\nOn August 10, 1998 at age two, our son Alexander Horwin was diagnosed with the most common pediatric brain tumor, medulloblastoma. After Alexander endured two brain surgeries my husband and I located the best non-toxic therapy that had proven successful in treating brain cancer. However, on September 21, 1998, the FDA denied Alexander access to this potentially life-saving treatment. The oncologists told us that without their \"state-of-the-art\" chemotherapy, the cancer would soon return. We knew nothing of the history, efficacy and actual danger of chemotherapy but instinctively knew it was a poor choice for therapy. Alexander completed his third month of chemotherapy in December 1998 and died on January 31, 1999. He was just two and a half years old.\n\nThe \"state-of-the-art\" chemo protocol that the oncologists had administered to our son had proven its ineffectiveness in pediatric brain tumors many years before. In fact, in 1994, the exact same chemo drugs Alexander received in 1998 had been administered to children the same age with the same brain tumor (medulloblastoma) as Alexander. This experiment proved so unsuccessful that tumors spread within five months and the oncologists terminated the protocol. It was incredible to us to discover that chemotherapy that had already proven so ineffective that it required termination was being presented to parents as \"state of the art\" years later.\n\nWe were never informed about the failure of this therapy. We also discovered that we weren't the only parents being purposefully misinformed. Today, parents are still being misled and children with brain cancer are still getting these same toxic drugs that have proven their ineffectiveness in the past. But even if you are informed that orthodox therapy does not work you still may not have a choice. When we hesitated to bring Alexander in for chemo the oncologists were already gearing up to take him from us by court order. Learn more: read about the Horwin's story and their journey into research.\n\nQuestioning Chemotherapy : A Critique of the Use of Toxic Drugs in the Treatment of Cancer by\n\n\"I started as a believer in chemotherapy. As a science writer at Memorial Sloan-Kettering Cancer Center in New York, I wrote articles praising the latest advances in chemotherapy. Because chemotherapy drugs were general cellular poisons, they could be terribly toxic. They were also very expensive for patients and for society as a whole. When I learned about the links between the pharmaceutical industry and the cancer establishment (later detailed in my book, The Cance r Industry) I understood the commercial reason that such an inadequate modality was so heavily promoted.\"\n\nLaw Firm now focuses on protecting the rights of children who have been injured or killed by toxic and ineffective cancer treatments administered by oncologists.\n\nDr. Daniel H Duffy Sr. - Pharmaceutical Terrorism & Mandatory Vaccination - The very first words of the Nuremberg Principles issued following the Second World War and designed to outlaw Nazi medical experiments for all time were: “The voluntary consent of the human subject is absolutely essential.\" Failure to stem the present tide of invasive compulsory medical procedures result in terrible consequences downstream as these forces grow more powerful and more oppressive. We will eventually experience total loss of our freedom to determine ours and our family’s own destiny, not only in health matters but in all forms of living. Political power breeds more power – the system is out of control and must be brought back under control. Controversial mandatory medicine, especially mandatory vaccines must be stopped. This socially malignant situation is under the control of the educated, ruling classes, particularly that part of the scientific community (NIH, CDC, FDA, AMA etc.) exerting influence on government policy. Mandatory vaccination is the most repugnant idea ever put forth by organized medicine. It gives the government power to invade our most private space, our bodies. This is the most private domain of the citizen, their own body! Mandatory vaccination puts one in mind of the eugenics of Nazi Germany. The demand to yield to MANDATORY injection of a foreign substance into a human body under circumstances that highly intelligent specialists in all fields of scientific endeavor consider to be, at the very minimum, highly controversial, cannot AND WILL NOT be tolerated.\n\n\n\nContact your Congressman/Congresswoman Today In a society that parades billboards professing \"Say No To Drugs\" we as parents are being forced to subject our children to psychotropic drugs or lose custody of them just because someone outside the family has more jurisdiction over our children than we the parents...don't let your child become a statistic in the long list of those that have DIED or Attempted Suicide due to the adverce effects of Forced Drugging. There is a bill before congress that can stop outside intervention and the forced drugging of our children by school systems or social service employees that are not trained in the medical profession, that bill is called: more\n\n(August 29) - A 12-year-old boy remains in hiding with his mother while authorities in Utah battle to have him returned to undergo court-ordered chemotherapy to treat what they say is deadly bone cancer. Daren and Barbara Jensen fled Utah with their son, Parker, on Aug. 8, after the state ordered that the cancer-stricken boy be placed in state custody so that he can receive chemotherapy. The story began three months ago, when Parker was diagnosed with Ewing's sarcoma, a deadly form of bone cancer. Doctors at Primary Children's Medical Center in Salt Lake City said Parker needs chemotherapy, and that he has only a 5 percent chance of survival without it. A Salt Lake City court agreed, and ordered the parents to have the boy undergo the treatment. But the boy's family disagreed. They question the accuracy of the test that led to his cancer diagnosis, said Parker's uncle, Tracy Jensen. more\n\nCan a judge be unbiased when forced to rule whether or not his own order caused permanent injury to children?\n\n\"At the present time there are growing public and professional concerns about the safety of currently mandated childhood vaccine programs, as reflected in by a series of annual Congressional hearings in Washington DC that have taken place since 1999, sponsored by the U.S. House Government Reform Committee under the chairmanship of Congressman Dan Burton. The Autism Research Institute of San Diego is now widely known as an active support group for families with autistic children and is one of the more active organizations in this field. Its founding director, Bernard Rimland, Ph.D., has provided the statistics that, in their experience, from 50 to 60% of parents with autistic children believe that their children were damaged by vaccines.\" Dr. Buttram\n\n\"Considering the many side effects of the AIDS drug AZT, the question of giving it to pregnant women should be weighed carefully instead of being blindly accepted.\"\n\nThe life of a 4-year old child, who had tested positive for HIV and had faced the prospect of enforced treatments, was spared by a Maine judge in a decision which, among other things, underscored the fact that AIDS therapies are tantamount to poisoning by prescription.\n\nSome public schools are accusing parents of child abuse when they balk at giving their kids drugs such as Ritalin, (or AZT) and as judges begin to agree, some parents are medicating their children for fear of having them hauled away. \n\n\n\n\"There is a war raging over the control of our children. The cry of outrage is spreading across this nation, as increasing numbers of children are wrongfully ripped from their loving parent's arms and secreted away by the unscrupulous agents of the State\".\n\nFrom: Alive Magazine: Canadian Journal of Health and Nutrition - Issue #215 September 2000\n\nFDA Issues Public Health Advisory on Cautions for Use of Antidepressants in Adults and Children The Food and Drug Administration today issued a Public Health Advisory that provides further cautions to physicians, their patients, and families and caregivers of patients about the need to closely monitor both adults and children with depression. The drugs under review include bupropion, citalopram, fluoxetine, fluvoxamine, mirtazapine, nefazodone, paroxetine, sertraline, escitalopram and venlafaxine. It should be noted that the only drug that has received approval for use in children with major depressive disorder is fluoxetine (Prozac). more\n\nDiscovery of How Anti-Depressants Cause Psychotic Breaks Anti-depressants given to children can be tied directly to their sudden outbursts of psychotic reactions as evidenced in the numerous school shootings and other dramas that have occured. This effect can be measured directly at a sleep center and will stand up to any scientific criticism.\n\n\"Take the Pills, or We'll Take Your Kids!\" \n\nby David Crowe\n\nJane Doe in Montreal refuses to give toxic, lifelong medication to her two healthy sons, and loses custody of them. Another woman in Montreal hears this and decides to have an abortion.\n\nA woman in Maine has a daughter die on this medication, and finds that the debilitating symptoms she and her son were also experiencing rapidly disappear after stopping. The State takes her to court, but she wins her case.\n\nA couple in Oregon are less fortunate. They are \"legally\" forced to medicate their infant and the mother forbidden to nurse him! A woman in British Columbia is harassed by social workers who threaten to force her to medicate her two children, and then hastily leaves the province.\n\nA couple in London refuse to test their baby and flee from England after losing their case, fearing that forced medication will follow forced testing.\n\nAll these people have one thing in common--both they and their children are HIV-positive. They all reject the need for medication for their condition, and for their HIV-positive children. In fact, they question whether the HIV test indicates an illness at all.\n\nTo most Canadians, AIDS is something that happens to other people, largely gay men and drug addicts. They have no reason to doubt that HIV is the cause of AIDS, that new drugs are miraculous advances or that the tests for HIV are accurate--unless they test positive, of course.\n\nJust like a diagnosis of terminal cancer, most people are completely unprepared for this shattering moment, and rely on their doctors for advice, which is almost always to get on AIDS drugs immediately to try to stop the virus from its deadly advance. They usually do not question that they will die a painful and early death, but hope that the drugs can buy time.\n\nCanada's top AIDS scientist, Dr. Mark Wainberg believes that HIV always leads to AIDS. In his opinion, those people who question the accuracy of the HIV tests, or question whether immunosuppressive drugs are wise for a disease characterized by immunsuppression are considered a threat to public health and should be thrown in jail! (1)\n\nMany people would consider a parent refusing AIDS medication to be irresponsible but, considering the fatal nature of the diagnosis, perhaps within their rights to let their child die a natural death, versus gaining a longer, but lower quality life with medication. Few people would consider that Jane Doe is actually behaving more sanely than the doctors. Yet, her do-nothing approach to HIV has worked. 14 years after being found HIV-positive she is still extremely healthy, and has never taken medication.\n\nThe oldest, and still most widely prescribed AIDS medications are nucleoside analogs. If DNA is likened to a chain of beads, a nucleoside analog is a broken bead that can attach at one end, but not the other. Nucleoside analogs are supposed to stop retroviruses from being incorporated into DNA, but the inevitable incorporation of a molecule directly into a growing chain of DNA will cause replication of DNA to halt.\n\nOne of these nucleoside analogs, AZT, is prescribed to pregnant women to prevent transmission of HIV to their rapidly growing fetuses. It is also prescribed to HIV-positive children. Side effects of nucleoside analogs are similar to chemotherapy--anemia so serious that transfusions are required, bone marrow destruction, peripheral nerve damage, failure of the pancreas, and many others. (2) It is also known that nucleoside analogs can cross the placenta and likely cause cancer, birth defects and mutations. (3)\n\nThere are several reasons why AIDS doctors and researchers may be so adamant that not taking anti-HIV drugs is irresponsible: money, money and money. Dr. Mark Wainberg, for example, has acknowledged being a shareholder in the Montreal company Biochem Pharma that manufacturers 3TC, one of the drugs that Jane Doe's children are believed to be taking. While the income from one patient is probably not significant to him, the impression that every rational person supports taking them is worth millions. HIV/AIDS is worth billions of dollars to doctors, researchers, hospitals and manufacturers--far out of proportion to the number of people affected in Canada (1,751 at the peak in 1993, declining to 279 in 1998. (4)\n\nIf it becomes legitimate to question whether HIV tests are accurate, whether HIV always leads to AIDS, whether AIDS is always fatal without medication and whether anti-HIV drugs are useful, the entire infrastructure will collapse. While that would be the end of the career of men like Dr. Mark Wainberg, for Jane Doe this would be the end of her nightmare.\n\nJane Doe has been through hell ever since she had her first child about 8 years ago. When one son came down with a chest infection (variously diagnosed as bronchitis or mild pneumonia) in 1999, the entire weight of the medical, social service and legal establishment was thrown on her. It was only through the major financial support of the US-based International Coalition for Medical Justice (www.icmj.org) that she was able to fight back. Even so, after the involvement of several lawyers and tens of thousands of dollars, Jane Doe lost custody of her two sons. Her parents were placed in the horrible position of providing the three-drug AIDS cocktail to them several times a day. If the children vomit after taking the drugs (a common reaction), they must be given again. If the children refuse to take the drugs, they must be forced. If the children have diarrhea, that is just the price they have to pay. Nobody knows how long the children can live while taking these drugs, which have acknowledged fatal side effects, but that does not stop doctors from almost universally and absolutely recommending them.\n\nThe Canadian Government doesn't have statistics on how many Canadians are taking HIV medications, let alone how many adverse reactions there are.\n\nEvery page of one Health Canada report of adverse reactions notes \"Only a small proportion of suspected adverse reactions are reported to the program\". Other estimates suggest that one to 10 per cent of adverse reactions are reported.\n\nIn HIV/AIDS, where the drugs can destroy the bone marrow, and therefore the immune system, it is very difficult to distinguish the disease from the side effects of the therapy.\n\nGlaxo Wellcome, the largest manufacturer of AIDS drugs claims that a list of adverse reactions to their AIDS drugs in Canada is 'proprietary to the company'.\n\nAlive magazine is distributed free at most whole-food stores and alternative health practictioners in Canada and has an estimated circulation of 270,000\n\n\n\n \n\n 1. Picard A. HIV deniers should be jailed: researcher. Globe & Mail. 2000 May 1; A3.\n\n2. A file of referenced quotations on the side effects and ineffectiveness of AZT is available here: http://aras.ab.ca/azt.html\n\n3. Olivero OA et al. AZT is a Genotoxic Transplacental Carcinogen in Animal Models. J Acquir Immun Defic Syndr Hum Retro. 1997 Apr 1; 14(4): A29.,Olivero OA et al. Incorporation of zidovudine into leukocyte DNA from HIV-1-positive adults and pregnant women, and cord blood from infants exposed in utero. AIDS. 1999 May 28; 13: 919-25,Olivero OA et al. Transplacental effects of 3'-azido-2',3'-dideoxythymidine (AZT): tumorigenicity in mice and genotoxicity in mice and monkeys. J Natl Cancer Inst. 1997 Nov 5; 89(21): 1602-8.,Olivero OA et al. Vaginal epithelial DNA damage and expression of preneoplastic markers in mice during chronic dosing with tumorigenic levels of 3'-azido-2',3'-dideoxythymidine (AZT). Cancer Res. 1994; 54: 6235-42., Olivero OA et al. 3'-azido-3'-deoxythymidine (AZT) transplacental perfusion kinetics and DNA incorporation in normal human placentas perfused with AZT. Mutat Res Fundam Mol Mech Mutagen. 1999 Jul 16; 428(1-2): 41-7 .\n\n4. Laboratory Centre for Disease Control (Health Canada). HIV and AIDS in Canada: Surveillance Report to December 31, 1998. Health Canada. 1999.Available at www.hc-sc.gc.ca/hpb/lcdc/publicat.html\n\nThis article deals with pharmaceutical abuse in a children’s home in NYC. This is a most controversial story – however, it’s entirely based in fact and good reporting. I hope you’ll find it as compelling and shocking as I did investigating it.\n\nIn New York’s Washington Heights is a 4-story brick building called Incarnation Children’s Center (ICC). This former convent houses a revolving stable of children who’ve been removed from their own homes by the Agency for Child Services. These children are black, Hispanic and poor. Many of their mothers had a history of drug abuse and have died. Once taken into ICC, the children become subjects of drug trials sponsored by NIAID (National Institute of Allergies and Infectious Disease, a division of the NIH), NICHD (the National Institute of Child Health and Human Development) in conjunction with some of the world’s largest pharmaceutical companies – GlaxoSmithKline, Pfizer, Genentech, Chiron/Biocine and others.\n\n\"Doctors Are The Third Leading Cause of Death in the US Causing 250,000 Deaths Every Year\"\n\n\"The medical establishment works closely with the drug multinationals whose main objective is profits, and whose worst nightmare would be an epidemic of good health. Lots of drugs MUST be sold. In order to achieve this, anything goes: lies, fraud, and kickbacks. Doctors are the principal salespeople of the drug companies. They are rewarded with research grants, gifts, and lavish perks. The principal buyers are the public - from infants to the elderly - who MUST be thoroughly medicated and vaccinated...at any cost! Why do the authorities forbid alternative medicine? Because they are serving the industry, and the industry cannot make money with herbs, vitamins, and homeopathy. They cannot patent natural remedies. That is why they push synthetics. They control medicine, and that is why they are able to tell medical schools what they can and cannot teach.\"\n\nGuylaine Lanctot, M.Dis the author of The Medical Mafia: How To Get Out of It Alive and Take Back Our Health and Wealth.\n\nJuly 2003 - Pharmaceutical corporations accused of Genocide before ICC in The Hague Pharmaceutical companies including Pfizer, Merck, GlaxoSmithKline, Novartis, Amgen and Astra Zeneca are accused of deliberately preventing life-saving natural alternatives to drug based treatments from being applied in prevention and cure. A worldwide disinformation campaign undertaken by these companies is said to have caused the death of millions of people. more\n\n\"The Journal of the American Medical Association recently reported that as many as 106,000 deaths occur annually in US hospitals due to adverse reactions to prescription drugs that are properly prescribed by physicians that use them as directed by the drug companies. Even worse, the National Council for Patient Information and Education reported that an additional 125,000 deaths occur annually due to adverse reactions to drugs that the physician never should have prescribed. The annual death toll from synthetic prescription drugs, both from the correctly prescribed and the incorrectly prescribed, amounts to about 231,000 deaths every year. To put this into perspective, this is the equivalent of a world trade center disaster every week for over a year and a half or the crash of two fully loaded 747 aircraft every day of the year.\"\n\nPolitics in Healing: The Suppression & Manipulation of American Medicine by Daniel Haley\n\nAn ex-congressman from N.Y., Haley has written an historical account of immense importance. Here are detailed the true stories of ten physicians and their non-toxic cancer and other medical cures that were smashed by a pharmaceutical -AMA - federal machine which continues today. For anyone interested in the truth behind who controls the FDA and other federal agencies this is a must read. All health care professionals need to have a look at the reality existing today in the manipulation of the health care system as shown in these stories.\n\nFDA Issues Public Health Advisory on Cautions for Use of Antidepressants in Adults and Children The Food and Drug Administration today issued a Public Health Advisory that provides further cautions to physicians, their patients, and families and caregivers of patients about the need to closely monitor both adults and children with depression. The drugs under review include bupropion, citalopram, fluoxetine, fluvoxamine, mirtazapine, nefazodone, paroxetine, sertraline, escitalopram and venlafaxine. It should be noted that the only drug that has received approval for use in children with major depressive disorder is fluoxetine (Prozac). more\n\nAccording to the first comprehensive scientific review to include all available studies, including negative data that have long been withheld from public scrutiny by the pharmaceutical industry, four popular antidepressants being used to treat thousands of depressed American children are unsafe, ineffective or both. Those antidepressants are: Paxil, Zoloft, Effexor, Celexa. This is damning evidence of the drug companies' patent disregard for the safety of humans and focus on profits. GlaxoSmithKline was found to be concealing evidence that shows that these drugs do not benefit children in any way and only increase their risk of killing themselves. This was confirmed in an article in the Canadian Medical Journal. Drug companies do the research and learn that the drugs don't work, yet are willing to sell and market them to children even when it is clear that they are causing many children to commit suicide.\n\nMy name is Christine Howarth and I am a US citizen. My son Timothy (born April 21, 2001 in Vermont) is a dual US/Canadian citizen . My \n\nson was diagnosed with AUTISM in July 2004. I am a single parent facing an ongoing struggle (since May 2004) involving the notoriously over-zealous and blatantly corrupt Ministry of Child Protection here in Victoria British Columbia Canada, as well as a Removal Order from Canada issued by the Department of Immigration. Basically, this Ministry has CRIMINALIZED my child's AUTISM. Please read on\n\n\n\nCan you help us help the latest victim in the war on AIDS?\n\nCaught in the cross-fire of AIDS hysteria is an 18 month-old boy believed to have tested HIV positive in mandatory newborn screening (in NY). Although the boy's medical records do not show the results of this screening test, and his most recent HIV test is Indeterminate, he was taken from his home by seven police officers after his mother sought a second opinion on AIDS drug treatments that were making her child ill.The boy's older sister was also taken in the \"AIDS raid\" but was later returned to her family when authorities noted her negative HIV status.\n\nOur amazing and generous attorney has offered to assist the family to prepare for a custody hearing later this month. We also found an unprejudiced pyschiatrist to provide an evaluation of the parents' mental competency--they are accused of \"being in denial\" and are required to submit to psychiatric evaluation.\n\nToday, a psychoanalyst offered to assess and provide testimony on the damage the child suffers being separated from his family, and a well respected pediatrician has agreed to take him as his patient and treat the boy as an individual instead of an HIV positive diagnosis.\n\nWe are seeking donations to help cover costs involved in preparing the family for their custody hearing. The family needs $1,000 to pull together the necessary legal documents and pay for doctor visits and lab work that is not covered by their insurance. If you can pitch in any amount toward this goal, please let us know as soon as possible.\n\nIf what you've read so far has failed to inspire your concern and your generosity, please consider the cruel and inept system that is keeping the parents and child apart:\n\nA few weeks ago we alerted this list to the case of Baby Garfield, an 18 month old boy from New York caught up in the system of mandatory newborn HIV screening recently initiated in that state.\n\nAfter allegedly testing positive at birth (the actual test was missing from his medical records) and following a series of inconsistent lab work and other questionable tests and recommendations, his mother sought a second opinion about the AIDS drug treatments prescribed for her healthy son.\n\nA few days later, under orders from the department of social services, Baby Garfield was taken from his home by seven police officers. He was placed in foster care and put on an aggressive regimen of mandatory medication. His parents were allowed to see their child only one hour a week while awaiting a hearing to establish long-term arrangements for his custody.\n\nWhen the parents found Alive & Well, Garfield had been in a foster home for more than a month and the custody hearing was just a few weeks away.\n\nIn record time, helped by your donations and good wishes, we pulled together a legal defense team led by Alive & Well's pro bono attorney Denis Sheils of Philadelphia, PA. Although Denis is one of the best and busiest attorneys in the country, he gave his time--including weekends--to the effort to return Baby Gafield to his parents. A coincidental interview with a national news program brought me and my family to New York for the custody hearing.\n\nI am happy to report that the day after the hearing, Garfield was back in his mother's arms. The victory was resounding as the state has decided not to appeal the judge's decision. Outside the courtroom, after a round of hugs and tears of relief, I shared your e mail messages with the family. It was a great honor to present them with all the good wishes and promises of donations from across the the country and around the world--help and concern came from as far away as Australia, Canada, England, and Iceland.\n\nIn celebrating this legal victory we give our heartfelt thanks to Dr. Rudolph Ballentine, Dr. Ina Becker and Dr. Larry Palevsky who were essential components of the legal victory; to Lynn Gannett who served as the family's personal support group; to Denis Sheils for his incredible generosity and skills; and to all of you who continue to make it possible for Alive & Well to be here for those who need us most.\n\nThe following letter from Christine Maggiore’s book, \n\n‘What if Everything You’d Been Told About AIDS was Wrong’ makes for sobering reading...\n\n\"I was required by law to take an HIV test in June 1995. The test is mandatory in Colorado for pregnant women, and I was expecting my second child. I was shocked when the result came back positive, because I’d been married and monogamous for nine years. I started taking AZT in my fifth month. After ten months on AZT, I was sick all the time. I had constant diarrhoea, nausea, fever, night sweats and was totally exhausted. I was crawling to the bathroom and vomiting for hours. My doctor told me the HIV was making me ill, and that the virus had mutated into a form that was resistant to AZT. Further drugs turned my skin yellow with jaundice. Since it was clear that the drugs weren’t keeping me from getting AIDS and were actually destroying my liver, I let my prescription run out. I figured I’d rather die from AIDS than liver failure.\n\nAlmost immediately after I stopped taking my medicines, within a matter of days I started to feel much better…. My daughter is considered a success by medical standards because she tests negative, but I don’t care about HIV anymore. I am concerned about the effects of the AZT she was poisoned with while I was pregnant. Rachel has an enlarged cranium, seizures and a strange deformity near the base of her spine. At age three she still does not speak. I went to this conference on HIV and pregnancy at The Children’s Hospital here in Denver. A lot of mothers there had taken AZT during pregnancy and had their kids with them. Every single one of those kids had enlarged craniums. Their heads looked exactly like Rachel’s. They’re all AZT babies. I’m working now to repeal Colorado’s mandatory [HIV] testing law.\"\n\nDoctors Are Third Leading Cause of Death\n\nVaccines Are Being Made From A\n\nBiblical Support for NOT Vaccinating | Crib Death or Vaccine Death?\n\nDrugs and Big Money (The Creation of the Modern Medical Drug Establishment)\n\nDr. Russell Blaylock (Neurosurgeon), Dr. John Martin, Dr. Earl Mindell, Dr. Joseph Mercola, Dr. Sheri Tenpenny, Dr. Viera Scheiber, Dr. David Weldon, Dr. Leonard Horowitz, Dr. Mohammad Ali-albayati, Dr. Rebecca Carley, Dr. Brad Burke D.C., Dr. James A. Shannon, Dr. Robert Jendelsohn, Dr. Archie Kalokerinos, Dr. Mary N. Megson, Dr. F Yazbak, Dr. William C. Torch, Dr. Richard Moskowitz, Dr. Guylaine Lanctot, Dr. Barthelow Classen, Dr. Hadwen, Dr. Allinson, Dr. Glen Dettman, Dr. J. Anthony Morris, Dr. Paul Frame, Dr. Lendon H. Smith, Dr. Buchwald, Dr. Jerome Murphy, Dr. Kris Gaublomme, Dr. Jay Gordon...and so many more!\n\nNOTE: All information posted on this web site is the opinion of the author and is provided for educational purposes only. It is not to be construed as medical advice. Only a licensed medical doctor can legally offer medical advice in the United States. Consult the healer of your choice for medical care and advice.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.shirleys-wellness-cafe.com/aids.htm", "http://www.shirleys-wellness-cafe.com/ritalin.htm", "../Family/dcfs_monsters.htm", "../Family/dcfs_monsters.htm", "../Evils%20in%20Government/Police%20State/the_psycho_state.htm", "http://www.shirleys-wellness-cafe.com/", "http://www.shirleys-wellness-cafe.com/update.htm", "http://www.shirleys-wellness-cafe.com/contact-shirley.htm", "http://www.shirleys-wellness-cafe.com/author.htm", "http://www.shirleys-wellness-cafe.com/", "http://www.shirleys-wellness-cafe.com/sitemap.htm", "http://www.shirleys-wellness-cafe.com/search.htm", "http://www.shirleys-wellness-cafe.com/#Disclaimer", "http://www.shirleys-wellness-cafe.com/misc.htm#translation", "http://www.fightforkids.org/press/040323.htm", "http://www.shirleys-wellness-cafe.com/ritalin.htm", "http://www.shirleys-wellness-cafe.com/aids.htm", "http://www.shirleys-wellness-cafe.com/drugs.htm#org", "http://www.shirleys-wellness-cafe.com/drugs.htm#org", "http://www.shirleys-wellness-cafe.com/drugs.htm#pill", "http://www.shirleys-wellness-cafe.com/drugs.htm#death", "http://www.shirleys-wellness-cafe.com/drugs.htm#testimonial", "http://www.shirleys-wellness-cafe.com/drugs.htm#act", "http://www.shirleys-wellness-cafe.com/drugs.htm#org", "http://www.shirleys-wellness-cafe.com/drugs.htm#fda", "http://www.ritalindeath.com/", "http://www.fightforkids.org/", "http://cchr.org/", "http://pqasb.pqarchiver.com/nypost/568115181.html?did=568115181&FMT=ABS&FMTS=FT&date=Mar+2,+2004&author=DOUGLAS+MONTERO&desc=100+GUINEA-PIG+KIDS+-+SHOCKING+NEW+NUMBER+IN+HIV+TESTS", "http://pqasb.pqarchiver.com/nypost/568115181.html?did=568115181&FMT=ABS&FMTS=FT&date=Mar+2,+2004&author=DOUGLAS+MONTERO&desc=100+GUINEA-PIG+KIDS+-+SHOCKING+NEW+NUMBER+IN+HIV+TESTS", "http://www.ouralexander.org/index.htm", "http://www.ouralexander.org/index.htm", "http://www.shirleys-wellness-cafe.com/a/+queschembrby.html.html", "http://www.shirleys-wellness-cafe.com/cancer.htm", "http://www.cancerlaw.net/", "http://www.gallaherdesign.com/aparentschoice/index.html", "http://www.gallaherdesign.com/aparentschoice/index.html", "http://forum.pagans.org/bbs/viewtopic.php?t=1500", "http://www.vaclib.org/news/burton.htm", "http://www.shirleys-wellness-cafe.com/vaccines.htm", "http://abcnews.go.com/sections/living/SecondOpinion/secondopinion_55.html", "http://www.eagleforum.org/column/2000/sept00/00-09-13.shtml", "http://www.profane-justice.org/Public_Services/Profane_Justice/profane_justice.html", "http://www.fda.gov/bbs/topics/ANSWERS/2004/ANS01283.html", "http://www.fda.gov/bbs/topics/ANSWERS/2004/ANS01283.html", "http://www.thelatestmagazine.com/page24.html", "http://www.drugawareness.org/Archives/Survivors/record0081.html", "http://aras.ab.ca/azt.html", "http://www.hc-sc.gc.ca/hpb/lcdc/publicat.html", "http://www.altheal.org/toxicity/house.htm", "http://www.shirleys-wellness-cafe.com/overview.htm#medmafia", "http://www.newmediaexplorer.org/sepp/2003/06/23/pharmaceutical_corporations_accused_of_genocide_before_icc_in_the_hague.htm", "http://www.newmediaexplorer.org/sepp/2003/06/23/pharmaceutical_corporations_accused_of_genocide_before_icc_in_the_hague.htm", "http://www.shirleys-wellness-cafe.com/ama.htm", "http://www.shirleys-wellness-cafe.com/ama.htm", "http://www.amazon.com/exec/obidos/ASIN/0970115008/shirlswellncafen", "http://www.amazon.com/exec/obidos/ASIN/0970115008/shirlswellncafen", "http://www.fda.gov/bbs/topics/ANSWERS/2004/ANS01283.html", "http://www.fda.gov/bbs/topics/ANSWERS/2004/ANS01283.html", "http://www.cmaj.ca/cgi/content/full/170/5/783", "http://www.mercola.com/2004/feb/21/antidepressant_suicides.htm", "http://www.shirleys-wellness-cafe.com/autism-letter.htm", "http://www.shirleys-wellness-cafe.com/autism-letter.htm", "http://www.aliveandwell.org/", "mailto:christine@aliveandwell.org", "http://www.shirleys-wellness-cafe.com/aids.htm#christine", "http://www.shirleys-wellness-cafe.com/aids.htm", "http://www.shirleys-wellness-cafe.com/aids_part2.htm#Africa", "http://www.shirleys-wellness-cafe.com/aids_kids.htm", "http://www.shirleys-wellness-cafe.com/aids_origin.htm", "http://www.shirleys-wellness-cafe.com/aids_healing.htm", "http://christines.faithweb.com/", "http://www.kidshaverights.org/", "http://www.kidshaverights.org/march.html", "http://www.ablechild.org/", "http://www.cchr.org/forms/abuse/parent/index.htm", "http://www.cchr.org/forms/abuse/parent/index.htm", "http://cpswatch.com/", "http://www.profane-justice.org/Public_Services/Profane_Justice/profane_justice.html", "http://www.cchr.org/lndex.htm", "http://www.avoiceforchildren.com/", "http://www.familyrightsassociation.com/", "http://www.gallaherdesign.com/aparentschoice/index.html", "http://www.citizens.org/", "http://www.informedmomm.com/", "http://www.fightforkids.org/", "http://www.shirleys-wellness-cafe.com/ritalin.htm", "http://www.cchr.org/lndex.htm", "http://www.shirleys-wellness-cafe.com/freedom.htm", "http://www.shirleys-wellness-cafe.com/freedom.htm", "http://www.shirleys-wellness-cafe.com/drugs.htm", "http://www.orgonelab.org/fda.htm", "http://www.shirleys-wellness-cafe.com/freedom.htm#fda", "http://www.shirleys-wellness-cafe.com/freedom.htm#petition", "http://www.ed-sherbeyn.com/", "http://www.orgonelab.org/fda.htm", "http://www.shirleys-wellness-cafe.com/aids.htm#children", "http://www.shirleys-wellness-cafe.com/children.htm", "http://www.shirleys-wellness-cafe.com/children.htm", "http://www.shirleys-wellness-cafe.com/c-homeo.htm", "http://www.shirleys-wellness-cafe.com/vaccines.htm", "http://www.shirleys-wellness-cafe.com/circumcision.htm", "http://abcnews.go.com/sections/living/SecondOpinion/secondopinion_54.html", "http://www.shirleys-wellness-cafe.com/specialneedchildren.htm", "http://www.shirleys-wellness-cafe.com/ritalin.htm", "http://www.shirleys-wellness-cafe.com/infant.htm", "http://www.shirleys-wellness-cafe.com/infant.htm", "http://www.shirleys-wellness-cafe.com/children.htm", "http://www.shirleys-wellness-cafe.com/ritalin.htm", "http://www.shirleys-wellness-cafe.com/vaccines.htm", "http://www.bt.cdc.gov/agent/smallpox/vaccineimages.asp", "http://www.shirleys-wellness-cafe.com/vaccines.htm", "http://www.bt.cdc.gov/agent/smallpox/vaccineimages.asp", "http://abcnews.go.com/sections/living/SecondOpinion/secondopinion_archives.html", "http://www.bt.cdc.gov/agent/smallpox/vaccineimages.asp", "http://www.bt.cdc.gov/agent/smallpox/vaccineimages.asp", "http://www.shirleys-wellness-cafe.com/vaccines.htm", "http://www.shirleys-wellness-cafe.com/vaccines.htm", "http://www.shirleys-wellness-cafe.com/homeopat.htm", "http://www.shirleys-wellness-cafe.com/vaccgov.htm", "http://www.shirleys-wellness-cafe.com/petvacc.htm", "http://www.shirleys-wellness-cafe.com/aids.htm", "http://www.shirleys-wellness-cafe.com/aids_healing.htm", "http://www.shirleys-wellness-cafe.com/aids_part2.htm", "http://www.shirleys-wellness-cafe.com/aid-hiv-azt.htm", "http://www.shirleys-wellness-cafe.com/tf.htm", "http://www.shirleys-wellness-cafe.com/tf/s/kids.htm", "http://www.shirleys-wellness-cafe.com/tf.htm", "mailto:%20ahardi8@aol.com", "killer_vaccines.htm", "killer_vaccines.htm", "doctors_are_third_leading_cause_of_death.htm", "Vaccines/five_baffling_vaccination_facts.htm", "when_legal_drugs_kill.htm", "../Evils%20in%20America/Abortion%20is%20Murder/aborted_fetus_vaccines.htm", "../Evils%20in%20America/Abortion%20is%20Murder/aborted_fetus_vaccines.htm", "Vaccines/biblical_support-not_vaccinating.htm", "Vaccines/crib_death_or_vaccine_death.htm", "Vaccines/vaccinations_can_kill.htm", "Pharmageddon/pharmageddon.htm", "Pharmageddon/drugs_and_big_money.htm", "Vaccines/ask_your_pediatrician.htm", "Vaccines/twenty-thousand_dollar_offer.htm", "../Evils%20in%20Government/Police%20State/illinois_madness-teenscreen.htm", "http://poisonevercure.150m.com/adverse_reactions.htm", "../Evils%20in%20Government/Police%20State/the_psycho_state.htm", "http://poisonevercure.150m.com/cover.htm", "http://www.jesus-is-savior.com/Health_Concerns/Vaccines/vaccines-dr_len_horowitz.m3u", "http://www.jesus-is-savior.com/Health_Concerns/Vaccines/vaccines-dr_len_horowitz.MP3", "http://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/emerging_viruses-dr_len_horowitz.m3u", "http://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/emerging_viruses-dr_len_horowitz.MP3", "Vaccines/vaccines-follow_the_money.htm", "http://www.dangerousmedicine.com", "http://www.Jesus-is-Savior.com"], "authors": [], "publish_date": null}