{"result_id": "180022", "URL": "https://www.jesus-is-savior.com/Health_Concerns/Pharmageddon/drugs_and_big_money.htm", "timestamp": "2023-04-25 16:08:36 CEST+0200", "meta": {"description": "Drugs and Big Money", "lang": "en", "keywords": "Drugs and Big Money", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/Pharmageddon/drugs_and_big_money.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "Drugs and Big Money — by G. Edward Griffin", "cleaned_text": "\n• None Drug-oriented \"medicine\" gets all the financial support because it has the largest profit potential\n• None The low state of medical education in the U.S. prior to 1910\n• None The importance of the Flexner Report in dramatizing the need for reform\n• None The role played by the Rockefeller and Carnegie foundations in implementing the Flexner Report\n• None The use of foundation funding as a means of gaining control over American medical schools\n\nThere is an old saying: \"He who pays the piper, calls the tune.\" This is one of those eternal truths that exist - and always will exist - in business, in politics, and in education.\n\nWe have seen how John D. Rockefeller captured the hearts of Baptist ministers with a mere $600,000 granted to Chicago University. What remains to be demonstrated is that he also captured control of the university.\n\nWithin a year after the grant, Rockefeller's personal choice, Dr. William Rainey Harper, was named president of the institution. And within two years, the teaching staff had been successfully purged of all anti-Rockefeller dissidents. A professor of economics and a professor of literature distinguished themselves by proclaiming that Mr. Rockefeller was \"superior in creative genius to Shakespeare, Homer, and Dante.\"\n\nBy comparison, another teacher, a Professor Bemis, was expelled from the staff for \"incompetence\" when he repeatedly criticized the action of the railroads during the Pullman strike of 1894. A few years later, after the Rockefeller family, through the \"philanthropy\" of John Archbald, had gained parallel influence at Syracuse University in western New York, an economics instructor by the name of John Cummons was dismissed by the Chancellor for similar reasons.\n\nIn 1953, Representative B. Carroll Reese of Tennessee received the authority of Congress to establish a special committee to investigate the power and influence of tax-exempt foundations. The committee never got very far off the ground due to mounting political pressure from multiple sources high within government itself and, eventually, Reese was forced to terminate the committee's work. During its short period of existence, however, many interesting and highly revealing facts were brought to light. Norman Dodd, who was the committee's director of research, and probably one of the country's most knowledgeable authorities on foundations, testified during the hearings and told the committee:\n\nUnder the careful supervision of Fred Gates, John D. Rockefeller set out consciously and methodically to capture control of American education and particularly of American medical education. The process began in 1901 with the creation of the Rockefeller Institute for Medical Research. It included on its board such politically oriented \"medical\" names as Doctors L. Emmett Holt, Christian A. Herter, T. Mitchell Pruden, Hermann M. Briggs, William H. Welch, Theobald Smith, and Simon Flexner. Christian Herter was slated for bigger things, of course, and became Secretary of State under President Eisenhower. Simon Flexner also was destined for larger success. Although his name never became as well-known as that of Herter, he and his brother, Abraham Flexner, probably influenced the lives of more people and in a more profound way than has any Secretary of State.\n\nAbraham Flexner was on the staff of the Carnegie Foundation for the Advancement of Teaching. As mentioned previously, the Rockefeller and Carnegie foundations traditionally worked together almost as one in the furtherance of their mutual goals, and this certainly was no exception. The Flexner brothers represented the lens that brought both the Rockefeller and the Carnegie fortunes into sharp focus on the unsuspecting and thoroughly vulnerable medical profession.\n\nPrior to 1910, the practice of medicine in the United States left a great deal to be desired. Some medical degrees could be purchased through the mail and many others could be obtained with marginal training at understaffed and inadequate medical schools. The profession was suffering from a bad public reputation and reform was in the air.\n\nThe American Medical Association had begun to take an interest in cleaning its own house. It created a Council on Medical Education for the express purpose of surveying the status of medical training throughout the country and of making specific recommendations for its improvement. But by 1908 it had run into serious difficulty as a result of committee differences and insufficient funding. It was into this void that the Rockefeller-Carnegie combine moved with brilliant strategy and perfect timing. Henry S. Pritchett, the president of the Carnegie Foundation, approached the AMA and simply offered to take over the entire project. The minutes for the meeting of the AMA's Council on Medical Education held in New York in December of 1908 tell the story:\n\nHere was the classical \"philanthropic formula\" at work again. Have others pay a major portion of the bill (the AMA had already done most of the work. The total Carnegie investment was only $ 10,000), reap a large bonus from public opinion (isn't it wonderful that these men are taking an interest in upgrading medical education!), and gain an opportunity to control a large and vital sphere of American life.\n\nThis is how that control came about.\n\nThe Flexner Report, as it was called, was published in 1910. As anticipated, it was \"published far and wide,\" and it did \"do much to develop public opinion.\" The report quite correctly pointed out the inadequacies of medical education at the time. No one could take exception with that. It also proposed a wide range of sweeping changes, most of which were entirely sound. No one could take exception with those, either. The alert researcher will note, however, the recommendations emphatically included the strengthening of courses in pharmacology and the addition of research departments at all \"qualified\" medical schools.\n\nAnd so, the Flexner Report was above reproach and, undoubtedly, it performed a service that was much needed at the time. It is what followed in the wake of the report that reveals its true purpose in the total plan. Rockefeller and Carnegie began immediately to shower hundreds of millions of dollars on those better medical schools that were vulnerable to control. Those that did not conform were denied the funds and the prestige that came with those funds, and were forced out of business.\n\nA hundred and sixty schools were in operation in 1905. By 1927, the number had dropped to eighty. True, most of those that were edged out had been sub-standard. But so were some of those that received foundation money and survived. The primary test was not their previous standing but their willingness to accept foundation influence and control.\n\nHistorian Joseph Goulden describes the process this way:\n\n,Since 1910, the foundations have \"invested\" over a billion dollars in the medical schools of America. Nearly half of the faculty members now receive a portion of their income from foundation \"research\" grants, and over sixteen percent of them are entirely funded this way. Rockefeller and Carnegie have not been the only source of these funds. Substantial influence also has been exerted by the Ford Foundation, the Kellogg Foundation, the Commonwealth Fund (a Rockefeller interlock created by Edward Harkness of Standard Oil), the Sloan Foundation, and the Macy Foundation. The Ford Foundation has been extremely active in the field of medical education in recent years, but none of them can compare to the Rockefellers and the Carnegies for sheer money volume and historical continuity.\n\nJoseph C. Hinsey, in his highly authoritative paper entitled \"The Role of Private Foundations in the Development of Modern Medicine,\" reviews the sequence of this expanding influence:\n\nThis list, of course is not complete. It is necessary to add to it the medical schools of Northwestern, Kansas, and Rochester; each heavily endowed, either by Rockefeller money, or by the Commonwealth Fund which is closely aligned with Rockefeller interests.(6)\n\nAfter Abraham Flexner completed his report, he became one of the three most influential men in American medicine. The other two were his brother, Dr. Simon Flexner of the Rockefeller Institute and Dr. William Welch of Johns Hopkins Medical School and of the Rockefeller Institute. According to Hinsey, these men, acting as \"a triumvirate\":\n\nThe Association of American Medical Colleges has been one of the principal vehicles of foundation and cartel control over medical education in the United States and Canada. First organized in 1876, it serves the function of setting a wide range of standards for all medical schools. It determines the criteria for selecting medical students, for curriculum development, for programs of continuing medical education after graduation, and for communication within the profession as well as to the general public. The Association of American Medical Colleges, from its inception, has been funded and dominated by the Commonwealth Fund, the China Medical Board (created in 1914 as a division of the Rockefeller Foundation), the Kellogg Foundation, the Macy, Markle, Rockefeller, and Sloan foundations.(8)\n\nBy way of analogy, we may say that the foundations captured control of the apex of the pyramid of medical education when they were able to place their own people onto the boards of the various schools and into key administrative positions. The middle of the pyramid was secured by the Association of American Medical Colleges which set standards and unified the curricula. The base of the pyramid, however, was not consolidated until they finally were able to select the teachers themselves. Consequently, a major portion of foundation activity always has been directed toward what generally is called \"academic medicine.\" Since 1913, the foundations have completely preempted this field. The Commonwealth Fund reports a half a million dollars in one year alone appropriated for this purpose, while the Rockefeller Foundation boasts of over twenty thousand fellowships and scholarships for the training of medical instructors.(9)\n\nIn The Money Givers, Joseph Goulden touches upon this sensitive nerve when he says:\n\nEchoing this same refrain, David Hopgood, writing in the Washington Monthly, says:\n\nAnd so it hag come to pass that the teaching staffs of all our medical schools are a very special breed. In the selection and training process, heavy emphasis always has been put on finding individuals who, because of temperament or special interest, have been attracted by the field of research, and especially by research in pharmacology. This has resulted in loading the staffs of our medical schools with men and women who, by preference and by training, are ideal propagators of the drug-oriented science that has come to dominate American medicine. And the irony of it is that neither they nor their students are even remotely aware that they are products of a rigid selection process geared to hidden commercial objectives. So thorough is their insulation from this fact that, even when exposed to the obvious truth, very few are capable of accepting it, for to do so would be a tremendous blow to their professional pride. Generally speaking, the deeper one is drawn into the medical profession, the more years he has been exposed to its regimens, the more difficult it is to break out of its confines. In practical terms, this simply means that your doctor probably will be the last person on your Christmas card list to accept the facts presented in this study!\n\nDr. David L. Edsall at one time was the Dean of the Harvard Medical School. The conditions he describes at Harvard are the same as those at every other medical school in America:\n\nYes, he who pays the piper does call the tune. It may not be humanly possible for those who finance the medical schools to determine what is taught in every minute detail. But such is not necessary to achieve the cartel's desired goals. One can be sure, however, that there is total control over what is not taught, and that, under no circumstances will even one of Rockefeller's shiny dimes ever go to a medical college, to a hospital, to a teaching staff, or to a researcher that holds the unorthodox view that the best medicine is in nature. Because of its generous patron, orthodoxy always will fiddle a tune of man-made drugs. Whatever basic nutrition may be allowed into the melody will be minimal at best, and it will be played over and over again that natural sources of vitamins are in no way superior to those that are man-made or synthesized. The day when orthodox medicine finally embraces the field of nutrition will be the day when the cartel behind it also has monopolized the vitamin and food product industry essential to it - not one day before.\n\nIn the meantime, while doctors are forced to spend hundreds of hours studying the names and actions of all kinds of man-made drugs, they are lucky if they receive even a portion of a single course on basic nutrition. Many have none at all. The result is that the average doctor's wife or secretary knows more about practical nutrition than he does.\n\nReturning to the main theme, however, we find that the cartel's influence over the field of orthodox medicine is felt far beyond the medical schools. After the doctor has struggled his way through ten or twelve years of learning what the cartels have decided is best for him to learn, he then goes out into the world of medical practice and immediately is embraced by the other arm of cartel control The American Medical Association.\n\nSo let us turn, now, to that part of this continuing story.\n\nFootnotes:\n\n \n\n 1. As quoted by Weaver, U.S. Philanthropic Foundations, op. cit., pp. 175, 176.\n\n2. This is not the subject of the present study, but the reader should not pass over the fact that exactly the same strategy for control over education was being executed in other key areas as well.\n\n3. Morris Fishbein, M.D., A History of the AMA, (W.B. Saunders Co., Philadelphia & London, 1947). pp. 987, 989.\n\n11.\"The Health Professionals: Cure or Cause of the Health Crises?\" Washington Monthly, June, 1969.\n\n12. As quoted by Morris A. Bealle, The New Drug Story, (Columbia Publishing Co., Wash. D.C., 1958), pp. 19, 20.\n\nThe Healing of Cancer: The Cures the Cover-Ups and the Solution Now! by Barry Lynes - Read how the American Cancer Society misleads the American public and collects over 350 million dollars a year in contributions, and how part of the money is used against innovative cancer researchers, how the FDA conspires to stop promising treatments, and how so many victims undergo torture because of medical profiteering, outmoded thinking and a corrupt politics.\n\nThe Cancer Cure That Worked: 50 Years of Suppression by Barry Lynes - Office of Alter. Medicine in Wash,D.C. knows about Royal Rife. They continue to ignore - while 10,000 Americans die of cancer every week! Murder by bureaucratic autocracy and inertia. National Cancer Institute and FDA are equally aware and continue to lie about Rife and his remarkable cancer-curing approach. Shame on all the so-called \"experts\" keeping their heads in the sand in order to protect their privileges and outdated chemo-drug-surgery \"culture.\"\n\nWorld Without Cancer: The Story of Vitamin B17 by G. Edward Griffin - Provides an excellent exposé of an alternative natural way to prevent and cure cancer through nutrition, and the forces in government and in large pharmaceutical firms that are fighting to keep the secret from us. This book serves as an eye opener to anybody who has ever wondered why there has been so little progress in the fight against cancer, despite the vast sums of money being invested.\n\nThe Cancer Industry: The Classic Expose on the Cancer Establishment by Ralph W. Moss - An ex-cancer insider at the Sloan Kettering institute details all of the alternative therapies which have been railroaded by the cancer establishment. An interesting read for anyone who has the nagging feeling that the cancer war is being lost because pharmaceutical companies are avoiding possible natural, non patentable cures.\n\nBrain-Disabling Treatments in Psychiatry : Drugs, Electroshock, and the Role of the FDA Today! by Peter R. Breggin, M.D.\n\nToxic Psychiatry : Why Therapy, Empathy, and Love Must Replace the Drugs, Electroshock, and Biochemical Theories of the New Psychiatry by Peter R. Breggin, M.D.\n\nThe Manufacture of Madness : A Comparative Study of the Inquisition and the Mental Health Movements by Thomas S. Szasz, M.D., Professor\n\nLaw, Liberty, and Psychiatry : An Inquiry into the Social Uses of Mental Health Practices by Thomas S. Szasz, M.D., Professor\n\nBedlam : Greed, Profiteering, and Fraud in a Mental Health System Gone Crazy by Joe Sharkey\n\nThe Limits of Biological Treatments for Psychological Distress by Seymour Fisher and Roger P. Greenberg\n\nPsychiatric Drugs: Hazards to the Brain by Peter R. Breggin, M.D.\n\nDoctors Are Third Leading Cause of Death\n\nVaccines Are Being Made From A\n\nNOTE: All information posted on this web site is the opinion of the author and is provided for educational purposes only. It is not to be construed as medical advice. Only a licensed medical doctor can legally offer medical advice in the United States. Consult the healer of your choice for medical care and advice.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.flash.net/~jaybanks/real/g_edward_griffin_-_the_creature_from_jekyll_island.rm", "http://www.flash.net/~jaybanks/real/g_edward_griffin_-_the_creature_from_jekyll_island.rm", "http://www.amazon.com/exec/obidos/ASIN/0912986190/foundatfortruthi", "http://www.sntp.net/education/leipzig_connection_5.htm", "http://www.sntp.net/education/leipzig_connection_5.htm#gates", "http://www.sntp.net/education/leipzig_connection_8.htm", "http://www.sntp.net/education/CFAT.htm", "http://www.sntp.net/education/leipzig_connection_6.htm#top", "http://www.amazon.com/exec/obidos/ASIN/0919951449/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/0919951309/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/0912986190/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/1881025098/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/0826194907/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/0312113668/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/0815604610/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/0815602421/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/0312104219/foundatfortruthi/", "http://www.amazon.com/exec/obidos/ASIN/0805801383/foundatfortruthi/", "http://www.amazon.com/exec/obidos/ASIN/1563632896/foundatfortruthi", "http://www.amazon.com/exec/obidos/ASIN/0826129307/foundatfortruthi", "../killer_vaccines.htm", "../killer_vaccines.htm", "../doctors_are_third_leading_cause_of_death.htm", "../Vaccines/five_baffling_vaccination_facts.htm", "../when_legal_drugs_kill.htm", "../../Evils%20in%20America/Abortion%20is%20Murder/aborted_fetus_vaccines.htm", "../../Evils%20in%20America/Abortion%20is%20Murder/aborted_fetus_vaccines.htm", "../Vaccines/biblical_support-not_vaccinating.htm", "../Vaccines/crib_death_or_vaccine_death.htm", "../Vaccines/vaccinations_can_kill.htm", "pharmageddon.htm", "../Vaccines/ask_your_pediatrician.htm", "../Vaccines/twenty-thousand_dollar_offer.htm", "http://poisonevercure.150m.com/adverse_reactions.htm", "../../Evils%20in%20Government/Police%20State/the_psycho_state.htm", "http://poisonevercure.150m.com/cover.htm", "../medical_fascism.htm", "http://www.jesus-is-savior.com/Health_Concerns/Vaccines/vaccines-dr_len_horowitz.m3u", "http://www.jesus-is-savior.com/Health_Concerns/Vaccines/vaccines-dr_len_horowitz.MP3", "http://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/emerging_viruses-dr_len_horowitz.m3u", "http://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/emerging_viruses-dr_len_horowitz.MP3", "../Vaccines/vaccines-follow_the_money.htm", "http://www.organicconsumers.org/politics/corrupt21705.cfm", "http://www.jesus-is-savior.com/"], "authors": [], "publish_date": null}