{"result_id": "180029", "URL": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/five_baffling_vaccination_facts.htm", "timestamp": "2023-04-25 16:08:40 CEST+0200", "meta": {"description": "FIVE BAFFLING VACCINATION FACTS", "lang": "en", "keywords": "FIVE BAFFLING VACCINATION FACTS", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/five_baffling_vaccination_facts.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "FIVE BAFFLING VACCINATION FACTS", "cleaned_text": "Exposure to illness is an occupational hazard for the medical community. Doctors are among the highest risk population groups and most hospitals and practices make it mandatory for physicians to be vaccinated. Researcher and author Neil Z. Miller reports that approximately 66% of pediatricians and obstetricians refused the MMR shot in one study.[1] An equal percentage of doctors refused the Hepatitis B shot, mostly citing safety concerns because of rumors of animal DNA contamination in the shots.[2] The American Medical Association's (AMA) Archives of Pediatrics and Adolescent Medicine cite a 1994 study where approximately 1/3 of doctors were working without mandatory flu vaccines.[3] Yet the doctors blindly follow national recommendations to vaccinate every child they can round up (sometimes with as many as five vaccines in one visit). \n\n\n\nThe AMA reported that “measles is increasingly becoming a disease of adults,” admitting that the demographics of this typically childhood disease are shifting to adults as vaccines wear off too early.[4] Almost all childhood illnesses are deemed much more dangerous in adults. Mumps and rubella are also being reported to be shifting toward older children and adults. During epidemics, measles has been known to attack nearly 100% vaccinated populations.[5] Similar statistics have been seen during mumps outbreaks. Rubella, which is very innocuous in childhood, is now threatening women of child-bearing age (the very group the shot was supposed to protect to prevent birth defects).[6] After nearly 55 years of medical hoopla, the Centers for Disease Control reports that pertussis is at the highest levels since 1967. [7] Constant (and profitable) boosters are now the government’s only solution for shortsightedly disrupting the natural course of childhood illnesses. Yet, the policymakers are never apologetic. \n\n\n\nThe medical establishment has always maintained that there is no ethical way to study vaccine efficacy in a random, double-blind environment because of ethical implications. Efficacy is thus measured by blood antibody counts for a particular vaccine. As fact #2 shows with regard to measles in vaccinated populations, antibody titers are extremely unreliable predictors of whether a vaccinated child will contract a disease. Based on the antibody titer logic, the whole-cell pertussis (whooping cough) vaccine, the only product available in the U.S. until recently, was deemed 85 to 90% effective by the U.S. medical community.[8] When the same product was recently tested in Sweden and Italy during a U.S. Centers for Disease Control (CDC) funded study, the vaccine proved only 48 and 36% effective respectively.[9] Searching for a smokescreen, the CDC immediately hailed the newer acellular vaccine as being a safer, more effective product (they had initially blasted this Japanese product as being ineffective, but constant bad press about the safety of whole-cell vaccines changed their minds -- and statistics).\n\nThe government’s excuse for the miserable efficacy rates was that the kids in the study only got three shots, while American kids get additional boosters at 18 months and 4-6 years. Let’s see, pertussis is most dangerous for children under one, who get 3 shots (at 2, 4, and 6 months). Maybe the pertussis bacterium avoids infants fearing those upcoming boosters! As if that wasn’t absurd enough, the same official explained that the low efficacy of the vaccine can partially be attributed to the fact that both Sweden and Italy were in the middle of epidemics during the studies. Huh? You mean the product is 85-90% effective unless it comes in contact with the disease, at which point it fails 64% of the time? Yet, the medical community continues to give these products credit for eliminating infectious diseases. \n\n\n\nThe National Vaccine Injury Compensation Program (NVICP), established in 1986, has paid out over $1 billion in injury awards to date. Thousands of cases are pending, stuck in the federal bureaucracy.[10] This despite the fact that HHS Secretary Donna Shalala recently narrowed the definition of vaccine injury so critically that only immediate and severe reactions can now qualify.[11] Seizure disorders, brain damage, ataxia, aseptic meningitis, paralysis, learning difficulties, and death, that typically occur many days or weeks following these vaccines are now all excluded. And here’s the cherry on top: since doctors have little incentive to report themselves to a passive reporting system like the government's Vaccine Adverse Event Reporting System (VAERS), former FDA Director David Kessler once admitted that only 10% of vaccine injury cases are ever reported.[12] So the injuries can even conservatively amount to tens of thousands of children every year, while doctors continue to diagnose and treat mysterious new illnesses and maintain the “one in a million” adverse reaction myth taught in med schools (Hint: no drug is that safe).\n\nActually, the physicians’ creed, instead of, “First, do no harm,” might as well be, “First, deny causal relationship.” Not that a causal relationship matters either. The prestigious and supposedly independent Institute of Medicine (IOM) reported after a thorough review in 1991 that a causal relationship did exist between acute encephalopathy (brain inflammation) and the DPT shot.[13] They also found a causal relationship between the MMR shot and chronic arthritis in women. Yet, they did the obvious when it comes to pampering pharmaceutical giants -- they recommended continuing the suspect products and suggested “further study” (translation: maintain profitable and deceptive status quo). \n\n\n\nVaccines are Not Tested for Long-Term Safety, yet...\n\nAfter years of controversy the CDC finally admitted in 1996 that the polio vaccine used on millions in the 1950s may have contained the SV-40 monkey retrovirus (which causes cancer in laboratory animals). [14] Of course, they went on to deny that there is any, you guessed it, “causal relationship” between contaminated vaccines and the dramatic increases in many diseases like cancer, chronic fatigue, learning disorders, epilepsy, juvenile diabetes, etc.\n\nThe sad fact for the consumer is that vaccines will never be reliably implicated in diseases occurring years or even decades after a shot. Drug companies hardly have the incentive to provide researchers with multi-million dollar grants and risk being held responsible for altering the global gene pool. Vaccine inserts always warn that the mutagenic and carcinogenic potential of the products has not been tested. Forced into our children’s bloodstreams without the benefit of the natural defense our organs mount, horse, cow, chicken, monkey, rabbit or even worse, lab-engineered, DNA can have consequences that no scientist can predict with our limited knowledge of the human immune system. (Add to this diseased or lab-created tissue all the adjuvants and stabilizers like formaldehyde, antibiotics, aluminum salts and thimerosal -- a mercury derivative -- and you have a truly toxic witch’s brew).\n\nThe new breed of chronic illnesses are too profitable for the medical community to sweat over their mysterious causes. While more virulent and drug-resistant forms of infectious diseases manifest themselves, researchers are getting a cold shoulder from the government for discovering potential problems with old and new vaccines.[15] Emerging research into vaccine links to diabetes, arthritis, allergies, asthma, and many crippling autoimmune disorders seems to indicate that the chronic effects of these products can linger undetected for years (generations?) only to explode into our systems later. Chronic diseases are increasing at a staggering rate in the West. Many like Type 1 diabetes, asthma and certain cancers have increased three- to five-fold over the last 50 years. The reasons remain obscure and unresearched as the scientists \"speculate\" on the causes. We are in a short-sighted world which, in pursuit of a quick buck, shows little concern for contaminating our species with foreign proteins which can permanently alter or even incapacitate our future generations. Yet, we keep bowing to a system whose chief motive is simply profit. We are unsuspectingly handing people our hard earned money so they can sell us a product that has been suspect since its inception -- ineffective, unsafe, and potentially a threat to the survival of our species.\n\nLisa K. Jillani is a mother of two and a writer, editor and publisher who has been researching vaccines for over four years. She is the founder and president of P.A.V.E. \n\n\n\n5) FDA workshop to review warnings, use instructions, and precautionary information [on vaccines], July 18, 1992.\n\n6) Mendelsohn, Dr. Robert, How to Raise a Healthy Child...In Spite of Your Doctor, p.218.\n\n7) Preventing Emerging Infectious Diseases: A Strategy for the 21st Century. (U.S. Dept. of Health & Human Services/CDC publication), Oct. 1998, p.22.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.vaccines.bizland.com/pave2.html"], "authors": [], "publish_date": null}