{"result_id": "180028", "URL": "https://www.jesus-is-savior.com/Wolves/jack_chick.htm", "timestamp": "2023-04-25 16:08:39 CEST+0200", "meta": {"description": "Jack Chick's False Gospel", "lang": "en", "keywords": "Jack Chick's False Gospel", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Wolves/jack_chick.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "Jack Chick's False Gospel", "cleaned_text": "Mr. Chick's artwork is captivating and unsurpassed in quality. It is certainly true that Chick Tracts get read. Unfortunately, Jack Chick is doctrinally flawed (as are many religious leaders, authors, and influential people in churches today). Chick Tracts are recognized worldwide. Mr. Chick's ministry has received tens-of-millions of dollars in revenues from the sale of his religious cartoon tracts. The ministry boasts of having sold over 500,000,000 copies worldwide! Tragically, many people are being deceived by Mr. Chick's false gospel. Truly the love of money is the root of all evil (1st Timothy 6:10).\n\nJack Chick and others like him need to get out of the driver's seat and stop trying to do the Holy Spirit's job of convicting sinners concerning their sins and the changes that need to be made in one's life. That's God's department .\n\nAll of these men teach that faith in Christ is not sufficient for salvation unless a person is willing to surrender their life to Christ and be willing to stop sinning. This is salvation by WORKS (which is not salvation at all, Romans 11:6). The Bible speaks plainly in Romans 4:5, “But to him that worketh not, but believeth on him that justifieth the ungodly, his faith is counted for righteousness.” That's what saith the Scripture! How much clearer could the Word of God be... but to him that WORKETH NOT... HIS FAITH IS COUNTED FOR RIGHTEOUSNESS!!!\n\nI am not being unkind, but it's time for Christians to stop getting their theology from Hollywood movie stars like Kirk Cameron, high-level Freemasons like Pat Robertson (who was ordained into the ministry at the Freemason Street Baptist Church ), Council On Foreign Relations [CFR] members like Rick Warren, and cartoon artists like Jack Chick. WHAT SAITH THE SCRIPTURE? WHAT SAITH THE SCRIPTURE? WHAT SAITH THE SCRIPTURE? WHAT SAITH THE SCRIPTURE?\n\nAnd then I see influential Christian authors and leaders supporting men like Jack Chick who teach millions of people that they cannot be saved unless they surrender to Christ and are willing to stop sinning. In step one Jack Chick says to admit you are a sinner , and then in step two he requires people to be willing to turn from sin (repent) . Biblical repentance only requires step one; not step two. Since this is a separate step from admitting you're a sinner, clearly Jack Chick expects people to reform to be saved. This is a false gospel and I'm going to contend for the Christian faith against anyone who hinders sinners from coming to Christ for salvation. Jack Chick is hindering sinners from coming to Christ!\n\nI am sick and tired of Christian leaders being loyal to each other instead of the Bible. Anything can be justified. It is apostasy! I see pastors of large churches blindly supporting other pastors who deny the inspiration of the King James Bible. They're a disgrace to the ministry!!! Get right with God you Bible-inspiration-denying imposters!\n\nA man told me that he wouldn't get saved for a long time, because Jack Chick's Chick Tracts had taught him that God wouldn't save him unless he was willing to stop shacking up with his girlfriend in fornication. Since the man wasn't willing to turn from some of the sins in his life, he thought he couldn't be saved. I think that's a big issue and Jack Chick is corrupting the gospel, adding a step that God never added to be saved. We are the SINNERS and Jesus is the SAVIOR... it's that simple! A person is saved if they come to God as a needy sinner (Romans 3:19), and trust Jesus Christ, the Son of God, as their Savior (John 20:31). Christ died on the cross for our sins. He was buried , and 72 hours later He miraculously resurrected from the dead. This is 'The Gospel' that saves them that believe.\n\nDo not attempt to touch yourself up and make yourself something other than you really are; but come as you are to Him who justifies the ungodly. A great artist some short time ago had painted a part of the corporation of the city in which he lived, and he wanted, for historic purposes, to include in his picture certain characters well known in the town. A crossing-sweeper, unkempt, ragged, filthy, was known to everybody, and there was a suitable place for him in the picture. The artist said to this ragged and rugged individual, \"I will pay you well if you will come down to my studio and let me take your likeness.\" He came round in the morning, but he was soon sent about his business; for he had washed his face, and combed his hair, and donned a respectable suit of clothes. He was needed as a beggar, and was not invited in any other capacity. Even so, the gospel will receive you into its halls if you come as a sinner, not otherwise. Wait not for reformation, but come at once for salvation. God justifieth the ungodly, and that takes you up where you now are: it meets you in your worst estate.\n\nMay I, therefore, urge upon any who have no good thing about them—who fear that they have not even a good feeling, or anything whatever that can recommend them to God—that they will firmly believe that our gracious God is able and willing to take them without anything to recommend them, and to forgive them spontaneously, not because they are good, but because He is good. Does He not make His sun to shine on the evil as well as on the good? Does He not give fruitful seasons, and send the rain and the sunshine in their time upon the most ungodly nations? Ay, even Sodom had its sun, and Gomorrah had its dew. Oh friend, the great grace of God surpasses my conception and your conception, and I would have you think worthily of it! As high as the heavens are above the earth; so high are God's thoughts above our thoughts. He can abundantly pardon. Jesus Christ came into the world to save sinners: forgiveness is for the guilty.\n\nI would like to make this very plain. I hope that I have done so already; but still, plain as it is, it is only the Lord that can make a man see it. It does at first seem most amazing to an awakened man that salvation should really be for him as a lost and guilty one. He thinks that it must be for him as a penitent man, forgetting that his penitence is a part of his salvation. \"Oh,\" says he, \"but I must be this and that,\"--all of which is true, for he shall be this and that as the result of salvation; but salvation comes to him before he has any of the results of salvation. It comes to him, in fact, while he deserves only this bare, beggarly, base, abominable description, \"ungodly.\" That is all he is when God's gospel comes to justify him.\n\nPastor Charles H. Spurgeon (1834-1892) taught some Lordship Salvation and I refute him for that, but he correctly teaches the following. I think Mr. Spurgeon was torn between his influential peers in the ministry, trying to make everybody happy doctrinally, but he couldn't. Jesus Christ accepts an ungodly person just as they are to be saved:\n\nRepentance does not mean to turn from sins, for that would require human effort, which is a self-righteous work. Repentance is changing one's mind toward God, acknowledging the truth that one is a sinner. Without repentance, no man would ever come to Christ. John 3:20 teaches that men who do evil hate the light, neither will they come to the light, lest their evil deeds be reproved. When a person repents, they see their self as a guilty sinner in the eyes of a holy God.\n\nJack Chick does not believe that faith in Christ is enough to be saved, he also teaches that a sinner MUST have intent to reform to be saved. That is a very false Gospel, which the Bible calls in 2nd Corinthians 11:4, “ ANOTHER GOSPEL .” Mr. Chick can try to hide behind his statement of faith, which is vague; but his tracts, every one of them, teach the Lordship Salvation heresy!!!\n\nJack Chick plainly teaches in every Chick Track that faith in Jesus Christ is insufficient to save unless you are willing to cease from your sins. That is works salvation!!! Mr. Chick puts the cart before the horse, demanding a willingness to change as a qualifying prerequisite to faith in Christ. That is a back door approach to Lordship Salvation. I am not loyal to men, but to the Word of God. Anyone who messes with the Gospel needs to be exposed. Jack Chick is hindering sinners from coming to Christ!\n\nIn step #2 on how to go to Heaven, Jack Chick teaches damnable heresy... “Be willing to turn from sin (repent).” This is unbiblical. To require sinners to “be willing to turn from sin” to be saved is an act of self-righteousness.\n\nCarefully notice that this is not acknowledging one's sinnership, for that is requirement #1 in Chick Tracts. Jack Chick adds an entirely new requirement to be saved; not only admitting one's guilt of being a sinner, but also being willing to cease from those sins. In effect, Jack Chick is trying to do the Holy Spirit's job. Instead of allowing God to change a person who has come to Christ to be saved; Jack Chick requires sinners to change themselves as a prerequisite to placing their faith in Christ. This is a false gospel of qualification by works. 2nd Corinthians 11:3-4 warns us about “another gospel.”\n\nJack Chick has perverted the Gospel. The word “repent” in the Bible simply means “a change of mind”; not a change of behavior. Jack Chick cites Acts 17:30 as evidence of his perversion of the Gospel... “And the times of this ignorance God winked at; but now commandeth all men every where to repent.” Although it is certainly true that repentance is necessary for salvation, the Bible does not teach that a sinner must “be willing to turn from sin” in order to be saved. Jack Chick wrongly assumes that repentance means from sin; thus, he has fabricated his own false gospel of works salvation. This is a very serious issue, because if one's wrong on salvation—they're wrong on everything.\n\nPlease read REPENT! REPENT! REPENT! to learn the Biblical meaning of repentance.\n\nAlso, I just want to point out that California appears to be a hot-bed of heresy, considering that John MacArthur, Jack Chick, Ray Comfort, and Kirk Cameron are all based in the state of California.\n\nJack Chick's teaching on repentance is that you cannot come to Christ for salvation unless you first intend not to walk in sin after you receive Him. This is “qualification by works” as a prerequisite for receiving Christ as Savior.\n\nAlso, notice the prayer that Jack Chick leads sinners to pray in order to be saved. He includes the phrase... “I am willing to turn from sin.” This is of the Devil. Salvation is a free gift, NOT conditioned upon our willingness to turn from sin. You can't show me one Scripture where the Word of God requires someone to be willing to forsake their sins to be saved. Again, it is “qualification by works” as a prerequisite for receiving Christ as Savior. Please notice that the words “believe” and “believeth” are found 85-times in the Gospel of John, but the word “repent” is NOT mentioned even once. Hence, the man who believes on Christ has repented.\n\nRomans 4:5 plainly states... “But to him that , but believeth on him that justifieth the ungodly, his faith is COUNTED for righteousness .” Did you read that? ... a man's faith is COUNTED for righteousness!!! This means that a person can be saved and continue living in sin. Before you get upset, you'd better stop and realize that the Bible is filled with believers who lived in horrible sin. Noah was a drunkard. Samson was a whoremonger. David was an adulterer and murderer. Rahab was a prostitute. Isaiah had a dirty mouth. Jonah ran from God. Peter denied and cursed the name of Jesus. Ananias and Sapphira stole from the church. Demas forsook Paul in the ministry, having loved this present world. The church at Corinth had a serious problem with church members committing fornication, fighting against each other, suing one another, eating meats offered to idols, and even showing up drunk at the Lord's Supper. They were a house divided. The apostle Paul called them carnal in 1st Corinthians 3:1. \n\n\n\nJack Chick cites Acts 17:30 in support of his heresy. Carefully notice in Acts 17:30 that God COMMANDS all sinners to “repent” in order to be saved. Repentance is NOT optional. So “being willing” to repent is not enough! God orders us to REPENT!!! If repentance is merely being \"willing\" to turn from sin, as Jack Chick defines it, then salvation cannot occur. The Word of God plainly states that there can be no salvation without repentance. Yet, Jack Chick defines repentance as merely being \"willing\" to turn from sin (not actually doing anything about one's sins). Clearly, Jack Chick's definition of repentance is impossible, because how can you only be \"willing\" to do something that God absolutely requires you to do to be saved? Obviously Jack Chick is wrong on the Biblically meaning of repentance.\n\nYou won't find any Scripture references about \"repenting from sin\" to be saved. I n Acts 11:21 we read, \"And the hand of the Lord was with them: and a great number believed, and turned unto the Lord.\" This is Biblical repentance... turning to the Lord to be saved. To turn to Jesus by faith to be forgiven and saved from sin is repentance. God commands all men to turn to Jesus Christ to be saved, because we are sinners. It's as simple as that. Please read, What is Biblical Repentance? \n\n\n\nThank God—a believer's salvation is rooted in Jesus' righteousness, and not our own—because we have no righteousness of our own to offer God. 2nd Corinthians 5:21 states, \"For he hath made him to be sin for us, who knew no sin; that we might be made the righteousness of God in him.\" Our only hope is in the precious blood of Jesus Christ. The following page is from the Chick Tract, This Was Your Life...\n\nChick Tracts seem to have a different answer than the Bible to the question, \"What must I do to be saved?\"\n\nSurrender your life to Christ? That's !\n\n“And brought them out, and said, Sirs, what must I do to be saved? And they said, Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house.” — Acts 16:30-31\n\nOn their website's statement of faith, they state concerning salvation:\n\nYet, Mr. Chick horribly contradicts himself in every tract he writes when he REQUIRES lost sinners to “Be willing to turn from sin” to be saved. No Sir! Why doesn't he state that in his statement of faith? This is deception! Jesus plainly said in Revelation 21:6, “I will give unto him that is athirst of the fountain of the water of life FREELY.” Jesus said in John 7:28, “He that believeth on me, as the scripture hath said, out of his belly shall flow rivers of living water.” It hurts me to expose Jack Chick as a heretic, because I grew up reading Chick Tracts. I had quite a collection. I loved the cartoon art. It really made me think about the things of God.\n\nI always loved the booklet, “This Was Your Life!” Unfortunately, I really didn't know what I was reading. I didn't know about theology when I was a child. I was saved at age 13 in a fundamental Baptist church. I didn't learn theology until I attended Bible college when I was 18 to 26. And even then, it wasn't until 15 years after graduating from Bible college that I finally was perfected in my doctrines, and realized that the Gospel is being perverted everywhere today. I myself used to tell people to “Ask Jesus to come into your heart,” but that is wrong. I would NEVER tell anyone that today. To “Invite Jesus into your life” is a false Gospel. To “Ask Jesus into your heart” is a false Gospel. To “Surrender your life to Christ” is a false Gospel. To “Trust Jesus” is a false Gospel.\n\n“The Gospel” is defined as: Christ on the cross for our sins, He was , and bodily three days later according to 1st Corinthians 15:1-4, “Moreover, brethren, I declare unto you the gospel which I preached unto you, which also ye have received, and wherein ye stand; By which also ye are saved, if ye keep in memory what I preached unto you, unless ye have believed in vain. For I delivered unto you first of all that which I also received, how that Christ died for our sins according to the scriptures ; And that , and that he rose again the third day according to the scriptures .” Beware of all the garbage being taught in churches and on religious radio today! \n\n\n\nMr. Chick states on one hand that he believes \"salvation is the gift of God\"; but then on the other hand teaches that a person MUST \"be willing to turn from sin\" to be saved. What a contradiction! Regardless of what Mr. Chick claims to believe, we must analyze his Gospel tracts based upon their content. In order to be saved, Jack Chick requires a sinner to pray the words... \"I am willing to turn from sin.\" This is unbiblical. The implication is that a person must cease from the activity of sin to be saved. This is the heresy of Lordship Salvation, which is nothing less than works salvation, and a sure road to hellfire.\n\nBiblical salvation is when a person turns toward Jesus Christ to be saved from their sin; NOT turning from their sin in order to be saved. Romans 3:19 states, \"Now we know that what things soever the law saith, it saith to them who are under the law: that every mouth may be stopped, and all the world may become guilty before God.\" Carefully notice that a person is only required to turn to Jesus to be saved from the condemnation of sin, and not from the act of sin itself. The Law of God shows us our sinful condition, which causes us to realize that we are GUILTY! Repentance is when we \"turn\" to Jesus to receive His free gift of forgiveness and eternal life. To turn to Jesus Christ for the forgiveness of sins is Biblical repentance. This is drastically different than what Jack Chick is teaching, i.e., that a person is required to be willing to turn from the act of sin itself to be saved. You won't find the phrases \"repent of sin\" or \"turn from sin\" anywhere in the Bible.\n\nIt is false doctrine to require lost sinners to \"be willing to turn from sin\" as part of saving grace. Jesus shed His precious blood to pay for our sins, because our own self-righteousness could NOT save us. Isaiah 64:6 declares our own self-righteousness as \"filthy rags\" in the sight of God Almighty. Matthew 6:33, “But seek ye first the kingdom of God, and HIS RIGHTEOUSNESS; and all these things shall be added unto you.” To go to Heaven my friend, you need HIS RIGHTEOUSNESS, i.e., Jesus' righteousness. We read in Romans 10:3-4, “For they being ignorant of God's righteousness, and going about to establish their own righteousness, have not submitted themselves unto the righteousness of God. For Christ is the end of the law for righteousness to every one that believeth.” Jack Chick asks sinners to establish their own righteousness when he tells them they MUST \"be willing to turn from sin\" in order to have God's free gift of eternal life. If a person is required to be willing to do anything to obtain a gift (other than receive it), then it is no longer a gift. If I say to my son... \"You may borrow the car if you're to gas the tank,\" the implication is clear—I expect him to gas the tank before he returns the car! The implication is the same in Chick Tracts. If a person MUST “be to turn from sin” to be saved, in effect they are being required to forsake their sinful behavior to be saved. Jack Chick's mumbo-jumbo is nothing less than a backdoor approach to Lordship Salvation. According to Mr. Chick, you cannot be saved unless you're willing to turn from sin (which clearly implies that you must forsake your sinful bad habits to be saved). There's nothing in John 3:16 about being willing to turn from sin... “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” All that God requires for salvation is that we come as sinners and trust the Savior. Acts 16:30-31, “Sirs, what must I do to be saved? And they said, Believe on the Lord Jesus Christ, and thou shalt be saved, and thy house.” Salvation is receiving, NOT giving. It is the gift of God. Salvation is a take proposition, not a give proposition. Jesus paid for our sins with His own precious redeeming blood (i.e., His literal physical blood)... “Neither by the blood of goats and calves, but BY HIS OWN BLOOD he entered in once into the holy place, having obtained eternal redemption for us” (1st Peter 1:18-19). What a Wonderful Savior! For decades, since childhood, I ignorantly supported Jack Chick's ministry, not realizing that he was teaching the Lordship Salvation heresy. Several years ago a faithful Christian warned me concerning Chick Tracts. I was defensive at first, because Jack Chick was one of my childhood mentors. After several months of conviction by the Holy Spirit, I decided I needed to do the right thing and stop distributing Chick Tracts. I speak the truth without apology. Say what you will about how much Chick Tracts get read... it makes them all that much more dangerous, especially to children. Jack Chick is wrong on salvation! As with Ray Comfort, John MacArthur and other Lordship Salvationists, Jack Chick speaks double-talk, i.e., he says one thing in his official doctrinal statement, and something completely different in his Chick Tracts. The doctrinal content in Chick Tracts is 100% contradictory to Mr. Chick's official doctrinal statement. I agree with Mr. Chick's website statement of faith. Why the discrepancy? Many of the false prophets teaching the heresy of Lordship Salvation are from California (John Mac Arthur, Ray Comfort, Kirk Cameron, Jack Chick, et cetera). California is a hotbed of false prophets! “Lordship Salvation” is the false teaching that a person must receive Jesus as their “Lord” (i.e., Master or Boss) to be saved. And then the sinner is told that they must turn away from sinful behavior since Jesus is now their “Lord.” If they don't forsake their sinful bad habits, then they are accused of being lost. Hence, Lordship Salvation is definitely a form of works-salvation. This is not “the simplicity that is in Christ” (2nd Corinthians 11:3), which is “the Gospel” (Romans 1:16). Any plan of salvation that places the burden of sin upon a sinner's shoulders, instead of completely upon Christ, Who bore the weight of our sins upon the cross, they are teaching “another Gospel” (2nd Corinthians 11:4). Jesus paid a debt that He did not owe, because we owed a debt that we could not pay. What a great Savior! In Jack Chick's case, he's a bit more subtle, teaching that it's not enough to admit one's sinnership to be saved, but also that a person must also “be willing to turn from sin” to be saved. This is a damnable heresy that destroys the free gift of God. You don't give up anything to be saved, Jesus gave up everything to pay for your sin! Jesus came into the world to SAVE SINNERS! If you want to be saved, then repent toward God by placing your faith in Jesus Christ, the Son of God, to forgive your sins. It's that simple. God will take care of the rest from there. Salvation is not doing your best, it is having Christ's best put to your account through receiving Him by faith. God will not save anyone who is trying to be saved, He will only save those who are trusting to be saved. \n\n Salvation is Either a Free Gift or It's Not! Either salvation is a free gift, or else it's not, and we must be willing to change the direction of our life in order to obtain eternal life. Romans 4:5 plainly states that A MAN'S FAITH IS COUNTED for righteousness, which means that if we never do one good thing again, and choose to live in sin until we die, we can still go to Heaven if we believe on the name of Jesus Christ, i.e., He who justifieth the ungodly. This is what the Word of God teaches! See, Scriptural Proof that Lordship Salvation is a Lie! Anyone who admits they are a guilty sinner in God's sight, and receives Christ's sacrifice on the cross as full-payment for their sins, believing that Christ was buried, and 72 hours later raised up from the dead, is saved. This is the simplicity that is in Jesus Christ. In Acts 2:41, as the apostle Peter preached the Gospel on the Day of Pentecost, there were 3,000 souls saved simply because they “gladly received his word.” In Galatians 3:2, the apostle Paul said that the way to be saved, when you hear the Gospel preached, is “by the hearing of faith?” We are saved solely by BELIEVING the Gospel. Some people try to use Isaiah 55:7 to justify the false doctrine of Lordship Salvation... “Let the wicked forsake his way, and the unrighteous man his thoughts: and let him return unto the Lord, and he will have mercy upon him; and to our God, for he will abundantly pardon.” However, the Bible doesn't use the word “sin,” It says “way.” John 3:20 explains Isaiah 55:7, “For every one that doeth evil hateth the light, neither cometh to the light, lest his deeds should be reproved.” It is love for sin that prevents men from coming to the Lord for salvation. To be saved, a sinner must come to the place of becoming guilty before God (Genesis 3:19). This is what Isaiah 55:7 means. A sinner must come to the realization that they are guilty of violating God's commandments, and that they are hellbound in their sins if they don't come to Jesus for salvation. If “forsaking one's way” means departing from sin, then we're all in big trouble because there is NO Christian who doesn't sin every day. It is not that men must literally forsake the act of sin to be saved, nor even be willing to do so; BUT rather, they must become guilty before God as sinners, under the condemnation of God's Holy Law, in need of a Savior. One who has believed on the Lord Jesus for forgiveness has repented concerning his sin, although there may NOT be a willingness to turn from sin at that time. The church at Corinth was plagued with sins, and they clearly have a willingness to turn from sin. Paul called them \"babes in Christ\" (1st Corinthians 3:1). Perhaps Mr. Chick simply means that genuine repentance should result in inward change; BUT, that is NOT what his Chick Tracts teach!!! Jack Chick adds an unnecessary requirement to being saved; namely, being willing to turn from sin. America is saturated today with sanctimonious religious people, who refuse to acknowledge that a true believer can be immature in the Lord, living in horrible sin, and shaming the name of Jesus. The Bible is filled with such examples. Heaven will be filled with the only type of people there are—SINNERS! You see, Jack Chick is foolishly requiring the change that salvation brings as a requirement to be saved. That's like placing the cart in front of the horse and expecting him to pull it. Tragically, Chick Tracts are a big hits with Pentecostal Charismatics, who wrongly teach that a person can lose their salvation if they don't persevere in the faith. Again, this is a \"works salvation\" heresy. Man has NO part in salvation other than to believe on Jesus. John MacArthur also teaches Works Salvation!, while simultaneously stating that he believes salvation is by grace through faith. These are masters of deceit!\n\n Jack Chick is a false prophet! Stop trying to force people to live right by corrupting the simple plan of salvation! I realize that Mr. Chick has done MUCH to promote other ministries and Christian authors who are diligently fighting against the evils of Catholicism, Wicca, et cetera (and I can appreciate that); BUT, I cannot sit back as a God-fearing believer and remain silent while Jack Chick is telling millions of people that they MUST \"be willing to turn from sin\" to be saved. Mr. Chick fails to explain what he means in his tracts by the phrase, \"be willing to turn from sin.\" The only reasonable conclusion that a person can assume is that they cannot be saved unless they are willing to cease from their sinful living (which is untrue!). I recently received a letter from a gentleman, who told me that for many years he was reluctant to get saved, because he had read a Chick Tract and genuinely thought God wouldn't save him unless he was willing to stop living in sin. The man expressed his frustration that he would have died and went straight to Hell because of Jack T. Chick, if it weren't for a dear saint of God, who explained to him from the Bible that eternal life is a free gift of God which is NOT conditioned upon a lifestyle change or willingness to clean up one's life. Jack Chick is teaching heresy and should be avoided by all soulwinning ministries. My recommendation is to write and draw your own Gospel tracts. People will look at your pictures just as eagerly as they will Mr. Chick's. I am not happy to expose Jack Chick as a false prophet. In fact, it pains me. I realize most professed \"Christians\" today are phonies. Certainly, genuine repentance should result in a drastic change within the soul of the believer (2nd Corinthians 5:17). However, the change comes as a RESULT of genuine repentance; and NOT as a prerequisite to salvation itself. Jack Chick requires a willingness to change (i.e., turn from sin) as a requirement to be saved. This is damnable heresy and a road to Hell, because it is self-righteousness! Hebrews 12:8 tells us that God will chastise His children if they live in sin. Although no believer can live in sin without Holy Spirit conviction, many believers do live horribly sinful lives (as evidenced by king Solomon in the Bible). To be saved, a person must become GUILTY before God (Romans 3:19), realizing one's condemnation under God's Holy Law, and justly deserved penalty in Hellfire—turning by faith to Jesus Christ for forgiveness. The precious blood of Jesus Christ is what washes our sins away forever... “Forasmuch as ye know that ye were not redeemed with corruptible things, as silver and gold, from your vain conversation received by tradition from your fathers; But with the precious blood of Christ, as of a lamb without blemish and without spot” (1st Peter 1:18,19). Jesus paid a debt He did not owe; because we owed a debt we could not pay. Oh how foolish it is for anyone to require lost sinners to be willing to depart from their sins to be saved. According to Chick Tracts, it's enough to admit you're a sinner to be saved, you must also be willing to turn from those sins. Jack Chick needs to either change his tracts to accurately reflect his website's statement of faith; or else rewrite his statement of faith to backup the Lordship Salvation he's teaching in his tracts. To continue to teach both is contradictory, confusing, and deceitful. Don't you tell me that you believe salvation is the free gift of God, and then contradict yourself by saying that sinners must be willing to turn from their sins to be saved. No Sir! You are 100% wrong. What a Gospel Tract should tell people who want to be saved is: 1. Admit you are a GUILTY sinner, under the condemnation of God's Law, deserving of Hellfire (Romans 3:19,23; 6:23). 2. Believe on the Lord Jesus Christ, Whose redeeming blood will wash away your sins (Acts 16:31; 1st Peter 1:18,19). The change (i.e., the FRUIT of a believer's faith) that genuine repentance brings is not a requirement to be saved. It is a separate issue. We must not confuse the ROOT of a believer's faith with the FRUIT of a believer's faith (See: Are We Justified by Faith and Works?). It's the churches who don't take the matter of salvation seriously who are also bought and paid for by the government, having sold their soul to become a 501c3 organization. In a 501c3 organization, churches and religious organizations receive tax-exemption as a pay-off for not getting involved with government matters. if you criticize blatant crime, theft and tyranny in the government, then you lose your tax-exemption. Don't tell me that America's churches haven't been bought off!!! \n\n The Gospel is that Jesus Christ DIED on the cross for our sins, was BURIED and bodily RESURRECTED (1st Corinthians 15:1-4). If you receive Christ's sacrificial death on the cross as full-payment for your sins, believing that He raised up 72 hours later from the dead, you are saved. But don't I have to repent? Yes, of course! Biblical repentance is “a change of mind” that compels a person to believe the Gospel. Repentance is NOT a desire to stop sinning. Repentance is realizing that you are a guilty SINNER in the eyes of a holy God (Romans 3:19), and so you believe (place your confidence) in the Gospel and are saved. The ONLY thing that you need to repent of to be saved, is whatever it is that's been hindering you from coming to Christ to be saved. Whatever happened to “the gift of God,” which “is eternal life through Jesus Christ our Lord” (Romans 6:23). Anyone who says that eternal life is a “gift,” but says changing the course of your life (or being willing to turn from your sins) is necessary, is a Gospel pervert!!! ARE YOU A GOSPEL PERVERT? Here is the best quote that I've found on repentance, by Dr. Harry A. Ironside (1876-1951): “Which comes first, repentance or faith? In Scripture we read, 'Repent ye, and believe the gospel.' Yet we find true believers exhorted to 'repent, and do the first works.' So intimately are the two related that you cannot have one without the other. The man who believes God repents; the repentant soul puts his trust in the Lord when the Gospel is revealed to him. Theologians may wrangle over this, but the fact is, no man repents until the Holy Spirit produces repentance in his soul through the truth. No man believes the Gospel and rests in it for his own salvation until he has judged himself as a needy sinner before God. And this is repentance.” ( Except Ye Repent Seeing one's self as a needy sinner in the sight of God is very different than having a willingness to forsake sinful bad habits. It is the difference between “the knowledge of sin” (Romans 3:20b), verses trying to keep “the deeds of the law” to be saved, which is a false Gospel (Romans 3:20a). Romans 3:20, “Therefore by the deeds of the law there shall no flesh be justified in his sight: for by the law is .” A “willingness to turn from sin” effectively means keeping the deeds of the law. This is not the Gospel. The purpose of God's law is to show men their sinnership, so that they may repent toward God and believe the Gospel to be saved. Lamentations 1:12, “Is it nothing to you, all ye that pass by? behold, and see if there be any sorrow \n\nlike unto my sorrow, which is done unto me, wherewith the LORD hath afflicted me in the day of his fierce anger.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["../Basics/repent.htm", "http://www.jesus-is-savior.com/Believer's%20Corner/Doctrines/repentance.htm", "http://www.jesus-is-savior.com/False%20Doctrines/Lordship%20Salvation/foolish.htm", "http://www.chick.com/information/general/statementoffaith.asp", "http://www.jesus-is-savior.com/False%20Doctrines/Lordship%20Salvation/proof.htm", "../Basics/jesus_came_to_save.htm", "http://www.jesus-is-savior.com/False%20Doctrines/Lordship%20Salvation/proof.htm", "http://www.jesus-is-savior.com/False%20Doctrines/Lordship%20Salvation/macarthur-works.htm", "../Believer's%20Corner/Doctrines/faith_and_works.htm", "../Evils%20in%20Government/Police%20State/501c3.htm", "http://www.lovethetruth.com/bd/metanoia.htm", "http://www.jesusisprecious.org/books/harry_ironside/Except_Ye_Repent/01.htm"], "authors": [], "publish_date": null}