{"result_id": "180005", "URL": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/crib_death_or_vaccine_death.htm", "timestamp": "2023-04-25 16:08:28 CEST+0200", "meta": {"description": "Crib Death or Vaccine Death?", "lang": "en", "keywords": "Crib Death or Vaccine Death?", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/crib_death_or_vaccine_death.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "Crib Death or Vaccine Death?", "cleaned_text": "Crib death or sudden infant death syndrome (SIDS) kills more than 10,000 babies each year and is the second largest cause of infant deaths in the U.S. (congenital malformations are first).\n\nIts cause is unknown. Or is it?\n\nIn 1985 in Australia, Viera Scheibner, Ph.D. a retired principal research scientist with more than 90 published scientific papers in refereed journals to her credit, met Leif Karlsson, a biomedical electronics engineer specializing in patient monitoring systems. They developed the Cotwatch, a breathing monitor used for babies thought to be at risk of crib death or SIDS.\n\nTheir findings surprised them. \"Without endeavoring to do so... [we found that] the babies' breathing was affected in a certain characteristic manner and over a long period of time [40-65 days] following DPT injections.... We also learned from the parents of crib death infants that most commonly the child had died after DPT injection,\" said Dr. Scheibner.\n\nAs she continued her research, the link between crib death and vaccination became painfully obvious -- and undeniable. \"There was a significant and clear clustering of these (crib) deaths\" around the time of vaccination.\"\n\nYet when approaching pediatricians with her findings, she was shocked at their reaction. \"We realized that we had touched a very serious and contentious issue.... The resistance we encountered in pursuing this research... became the best and most effective goad to us to continue. So I wish to thank those who would not speak out against the silent killer of babies,\" said Scheibner.\n\nAccording to medical historian Harris Coulter, Ph.D., \"There is no way that a pathologist can tell the difference between crib death and death from vaccination.... I called attention to this fact at a vaccination committee meeting in Washington, D.C., where they had a panel of people from about ten countries and I asked, 'How can you tell the difference between sudden infant death syndrome and death from vaccination?'\n\n\"The Americans simply could not answer the question. They waffled and couldn't state any guidelines. But the European representatives were more honest and said, 'Indeed, there is no way in the world that we can tell the difference between them and it is a very big problem for us.' It appears that M.D's invented the term sudden infant death syndrome to explain away the 'coincidence' that babies die about the same time they receive vaccines,\" says Dr. Coulter.\n\nCoulter estimates that about two-thirds of the 10,000 annual cases of crib death are vaccine related but he may be conservative. Childhood vaccination rates in Australia dropped by 50% when they became non-mandatory (as it is becoming in many European countries) and SIDS dropped by 50%! In 1975, when Japan moved the vaccination age to two years (American babies receive their first shot at two months) crib death and infantile convulsions virtually disappeared (Cherry et al. 1988, Pediatrics Supplement, p.973). Japan then recorded the lowest incidence of infant mortality in the world.\n\nCoulter, in his book \"Vaccination, Social Violence and Criminality,\" studied the long-term effects of vaccination and he found them related to a single neurological disturbance caused by vaccination: \"Autism and SIDS appear to be generated in the same way -- by an encephalitis most commonly caused by vaccination.... The child who would have grown up autistic dies instead of 'sudden infant death syndrome.'\"\n\nCoulter discusses the mechanism of crib death: \"Vaccination affects in particular the top of the spine and the back of the skull through which the cranial nerves pass and has the effect of weakening the cranial nerves. Sudden infant death syndrome is probably caused by an effect of vaccination on the vagus nerve, which provides the neural impulse to the lungs which cause us to breathe. If the nerve is palsied by the vaccination the impulse doesn't pass through and the baby simply stops breathing. Parents who have witnessed this in their child have told me, 'The child was lying there and all of a sudden I heard no breathing...' In these cases the parents have rushed up, given the baby a shake and the baby starts breathing again. If the parent hadn't been there the baby wouldn't have started breathing again.\"\n\nAccording to Coulter, \"When the cranial nerves are affected, the result is weakness of the eyes, ears, voice, and respiratory system [i.e. asthma], the latter condition being responsible for the cases of 'sudden infant death' following upon vaccination.\"\n\nThis observation is not limited to the above authors. For decades, independent researchers in different countries have commented on the vaccination-crib death link. Further, the National Vaccine Compensation Office in Washington has already awarded approximately $500 million to families for vaccine damaged children, about half to parents of children killed by the shots that were originally labeled \"sudden infant death syndrome of unknown origin\" on the death certificate (doctors are loathe to write \"vaccine death\"). There are about 4,000 more cases in the pipeline with total compensation in the several billions of dollars.\n\nHow do these findings relate to the work of Abraham Towbin, M.D., and others that show a relationship between cervical spinal damage and crib death? Towbin dealt with gross trauma, while it appears that subtler chemical vaccine trauma creates meningeal irritation that subluxates the atlanto-occipital spine, affecting the vagus nerve.\n\nScheibner, incidentally, did not stop with crib death. In a daunting display of determination, she studied more than 35,000 pages of medical papers dealing with vaccination and discovered that in all that material there was no evidence of effectiveness and safety of vaccines.\n\nHer years of study culminated in her book: \"Vaccination, The Medical Assault on the Immune System,\" which led her to conclude: \"Immunizations, including those practiced on babies, not only did not prevent any infectious diseases, they caused more suffering and more deaths than has any other human activity in the entire history of medical intervention. It will be decades before the mopping-up after the disasters caused by childhood vaccination will be completed. All vaccination should cease forthwith and all victims of the side-effects should be appropriately compensated.\"\n\nIn a personal correspondence to this author, Scheibner restated this conclusion. \"Cot (crib) death is caused by vaccines. Vaccines are noxious substances. Serum of SIDS babies is so poisonous that all mice injected minute amounts of it die.\"", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}