{"result_id": "180039", "URL": "https://www.jesus-is-savior.com/Family/Parents%20Corner/schools_lie_to_parents.htm", "timestamp": "2023-04-25 16:08:44 CEST+0200", "meta": {"description": "Schools Lie to Parents and Children, Say Vaccinations are Mandatory", "lang": "en", "keywords": "Schools Lie to Parents and Children, Vaccinations, Mandatory", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Family/Parents%20Corner/schools_lie_to_parents.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "Schools Lie to Parents and Children, Say Vaccinations are Mandatory", "cleaned_text": "Summer is coming to a close and public schools all over the country are re-opening to welcome students back into classrooms, but not before they have gotten their shots. Schools everywhere tell parents that their children must have some nearly 40 vaccines before they can \"legally\" be permitted to attend school.\n\nThis is all a lie.\n\nThere has never been a law that one has to be vaccinated to attend public schools. School districts across the country have policies that have been deceptively concocted by the Federal government to appear to reflect the law but these policies merely reflect the color of the law. They are frauds.\n\nFor the last three years, the country marks mid-summer by the start of an ominous drumbeat: Announcements reminding parents to vaccinate their children are on the radio and plastered across the front pages of newspapers. They festoon public parks and swimming pools.\n\nIn Austin, Texas alone, there are dozens of television reports telling you of \"free vaccination clinics in public parks and gymnasiums,\" warning you that your children must be vaccinated or you could be arrested.\n\nFive years ago, the public was not subjected to this propaganda bombardment because only five years ago, 95 percent of the country was vaccinating their children. Today, that number has fallen to 65 percent, and the bottom is nowhere in sight.\n\nPeople have gotten wise to the fact that vaccines are contaminated with DNA\n\n fragments, viruses, fungus, mercury, and a cocktail of other poisonous toxins. Fleets of reputable studies have been published globally detailing the wide swaths of destruction caused by vaccines. So, now the establishment is on the offensive, attempting to bully us into submission. Big Pharma is one of the biggest businesses in the world. It is among the top three purchasers of advertisement in print, TV and radio, and has major pull.\n\nYou do not have to vaccinate your children.\n\nYou do not even have to get the affidavit. The schools have just been trained via color of law that they are \"required\" to demand it. In the 2003 legislative session in Texas, we were forced to get a law passed stating that it is illegal for health departments to claim that it's the law that you must have a vaccination in order to attend school.\n\nAll over the country, the propaganda is identical. Here is Austin they've even run newscasts saying mercury is good for children. There seems to be no end to the brazen fabrications we are subjected to. It's time to get angry, to spread the word and demand retractions from your local media. The bottom line is that it is illegal for government representatives to traffic in false information and to tell citizens that they are breaking the law when they are not. It's called coercion. It's called official oppression. It's called racketeering. And above all it's called tyranny.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.infowars.com"], "authors": [], "publish_date": null}