{"result_id": "180023", "URL": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/biblical_support-not_vaccinating.htm", "timestamp": "2023-04-25 16:08:36 CEST+0200", "meta": {"description": "BIBLICAL SUPPORT FOR NOT VACCINATING OUR CHILDREN", "lang": "en", "keywords": "BIBLICAL SUPPORT FOR NOT VACCINATING OUR CHILDREN", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/Vaccines/biblical_support-not_vaccinating.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "BIBLICAL SUPPORT FOR NOT VACCINATING OUR CHILDREN", "cleaned_text": "The Bible teaches that the truthfulness of an issue is to be sought and should stand on no less than two or more witnesses (Deuteronomy 19:15). The following is the result of a study on biblical parental responsibility in regards to the practice of unclean, unsafe vaccines.\n\n· A diligent study on vaccine safety and effectiveness reveals that there are many informed and qualified researchers and doctors who have found and teach that there are many serious health risks involved with vaccines. The Comprehensive Child Health Immunizations Act of 1993 made known the fact that there are risks to vaccinations by stating “Vaccine information should be simplified to ensure that parents understand the benefits and risks”. Congressional Records (2000 – 2003) have shown that the pharmaceutical companies are more concerned with profit than they are with safety and have knowingly used toxins in the manufacturing of vaccines regardless of the risks.\n\n· The Bible teaches us that children are a gift from God (1 Timothy 5:8). Some vaccines are produced using aborted baby lung tissue, which are man and government profiting from the murder of our innocent children. To partake in vaccines is to support that individuals/government that no longer has respect for the sanctity of human life.\n\n· The Bible teaches that the parents are entrusted with the care and welfare of the child. (1 Timothy 5:8). Parents, not the state, are responsible to make health care decisions on behalf of their children.\n\n· The Bible also teaches that there have been times in history when evil government and government employees have attempted, through force or color of law, to intimidate, harm or destroy the children of God’s people. (Exodus 1 and 2/ Matthew 2). Therefore, if a parent feels that vaccines are not safe, it is their responsibility to defend our children from and individual or government who is attempting to subject our children to those vaccine risks.\n\n· The Bible teaches that the body is “The temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own. For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God’s.” (1 Corinthians 6:19-20) To inject known neurotoxins into our children, which have known health risks, would be a violation of these biblical teachings.\n\n· The Bible teaches that there are clean and unclean animals and that God’s people are not to put the unclean into their bodies. Many vaccines are made from the blood of diseased animals, decomposed animal parts and are not sterile.\n\n· The Bible teaches that when man’s law contradicts God’s law, His people must obey God over man. (Acts 5:29) Therefore, be it known, should any policy, edict or legislation of man decree our children must be vaccinated, we must obey God rather than man just as Moses’ parents of old, we will do so without fear. (Exodus 2)\n\n· The Bible teaches us that we are not to harm or wrong our neighbor. (Romans 13:10 and James 2:8) Our decisions to decline vaccines do not wrong or threaten our neighbor. If vaccines were truly effective, the neighbor would not be in danger from someone who is not vaccinated.\n\nTherefore, be it known, that based upon the teachings of the Holy Bible, it is our religious conviction not to have our children vaccinated. We desire to be at peace with those who may feel or think differently than we do on this issue and that is why we humbly explain the choice we have made. We will protect our children from the injection of neurotoxins, retroviruses and foreign animal proteins that are in vaccinations.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}