{"result_id": "180010", "URL": "https://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/tetanus_shots.htm", "timestamp": "2023-04-25 16:08:29 CEST+0200", "meta": {"description": "Tetanus Shots and Sterilization", "lang": "en", "keywords": "Tetanus Shots and Sterilization", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/tetanus_shots.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "Tetanus Shots and Sterilization", "cleaned_text": "Many reports have surfaced over the years claiming that the World Health Organization is using Tetanus shots as a cover-up for forcibly sterilizing millions of young women in the Philippines, Mexico and other third world nations.\n\nIn a special report by James Miller from Human Life International, WHO is charged with sterilizing millions of unsuspecting women from underdeveloped countries. The tool used was a tetanus shot laced with human chorionic gonadotrophin (hCG), a naturally occurring hormone essential for maintaining a pregnancy. hCG alerts the woman that her body is pregnant and causes the release of other hormones to prepare for continuation of the pregnancy. The clearly documented report stated that \"when hCG is introduced into the body coupled with a tetanus toxoid carrier, antibodies will be formed not only against tetanus but also against hCG. In this case the body fails to recognize hCG as a friend and will produce anti-hCG antibodies. The antibodies will attack subsequent pregnancies by killing the hCG which naturally sustains a pregnancy; when a woman has sufficient anti-hCG antibodies in her system, she is rendered incapable of maintaining a pregnancy.\" In effect, a married woman could have many spontaneous abortions. The way in which the tetanus shots are administered points to the motive. In Mexico and the Philippines millions of only women, between the ages of 15 and 45 (don't men and children get tetanus?) were vaccinated. In Nicaragua the ages of the women were between 12 and 49. The vaccines in every instance were laced with hCG. Interestingly enough, the Center for Disease Control has set these ages as the reproductive years for females.\n\nHere are the known facts concerning the World Health Organization tetanus vaccination campaigns in Mexico and the Philippines:\n\nThe WHO began its \"Special Program in human reproduction in 1972, and by 1993 had spent more than $356 million on \"reproductive health\" research.(7) It is this \"Program\" which has pioneered the development of the abortificant vaccine. Over $90 million of this Program's funds were contributed by Sweden; Great Britain donated more than $52 million, while Norway, Denmark and Germany kicked in for $41 million , $27 million, and $12 million, respectively. The U.S., thanks to the cut-off of such funding during the Reagan-Bush administrations, has contributed \"only\" $5.7 million, including a new payment in 1993 by the Clinton administration of $2.5 million. Other major contributors to the WHO Program include UNFPA, $61 million; the World Bank, $15.5 million; the Rockefeller Foundation, $2.5 million; the Ford Foundation, over $1 million; and the IDRC (International Research and Development Centre of Canada), $716.5 thousand.\n\nAllied with the WHO in the development of an anti-fertility vaccine (AFV) using hCG with tetanus and other carriers have been UNFPA, the UN Development Program (UNDP), the World Bank, the Population Council, the Rockefeller Foundation, the All India Institute of Medical Sciences, and a number of universities, including Uppsala, Helsinki, and Ohio State.(5) The U.S. National Institute of Child Health and Human Development (part of NIH) was the supplier of the hCG hormone in some of the AFV experiments.(6)\n\n* WHO has been actively involved for more than 20 years in the development of an anti-fertility vaccine utilizing hCG tied to tetanus toxoid as a carrier -- the exact same coupling as has been found in the Mexican-Philippine-Nicaragua vaccines.(4)\n\n* Only women are vaccinated, and only the women between the ages of 15 and 45. (In Nicaragua the age range was 12-49.) But aren't men at least as likely as young women to come into contact with tetanus? And what of the children? Why are they excluded?\n\nThe evidence of overwhelming. There is a Satanic agenda at work to decrease the population, even going as far as to sterilize you and your children without your knowledge. They claim to be protecting you, requiring mandatory Tetanus shots which are actually a scheme to prevent you from having any more children. It is evil. Jesus said that the thief comes only to kill, steal and destroy (John 10:10). If it's not Herod sending in his henchman to kill the innocent, then it's abortion killing the innocent, but if not abortion, then it will be secret sterilizations. One way or another, Satan wants to prevent you from having children. If not Satan himself, who came to destroy Eve and her family; then he'll send a Planned Parenthood worker to rob you of your child; but if not someone from Planned Herodhood, then Satan will lie to you, forcing you to get a Tetanus vaccination to sterilize you; but if not any of those, then Satan will convince you that you are exercising your feminist rights as a real woman to abort your baby. Don't buy into the lie.\n\nIn a gut-wrenching report on abortions the Washington Post reveals that twenty-two percent of the world's pregnancies end in abortion every year. Citing the Alan Guttmacher Institute, partially funded by Planned Parenthood as proof, the report states that \"thirty-eight percent of the estimated 210 million pregnancies that occur each year are unintentional and 22 percent end in abortion. . ..\" The Guttmacher Institute states that the abortion rate in the U.S. is higher than the rest of the world at twenty-three percent. By using these figures the worldwide abortion rate exceeds 46,200,000 each year. With figures like these the glib remark by an American Association for the Advancement of Science (AAAS) panel member that, \"yes people are a cancer on the Earth...\" appears to be the mind-set for eradicating \"cancer.\"\n\nThe death statistics for WWI called the \"great war, since no one could conceive of a greater holocaust, was ten to eleven million. According to the Encyclopedia Britannica , WWI set the precedent for WWII. The death toll for WWII quadrupled WWI's at forty to fifty million. WWII and the Cold War with its secrecies set another precedent for WWIII with the death of our progeny. The death statistics for this \"war\" has quadrupled the previous world wars combined when broken down into per year rates. Even as Vietnam and Iraq were \"undeclared\" wars, so is it again. The weapons, carnage and destruction of this holocaust are less noticed, but more terrible than all of the ages preceding.\n\nThe Alan Guttmacher Institute's director of research gives us an eye-opening view of how they see the slaughter. Susheela Singh in glowing terms says, \"The fact that the rate is that high in the developing world, where abortion is illegal, and therefore expensive or unsafe, it indicates to us how motivated women are to get abortions.\" What Singh fails to note is the true motivating force in some of the developing countries. With the Alan Guttmacher Institute partially funded by Planned Parenthood, can we expect them to reveal their true motivating principles? Are women self \"motivated\" in these countries? A WINDS reveals another side of the story from these \"motivated\" parents.\n\nAbortion, infanticide, euthanasia and neonaticide are tools used to control population growth while they are masked with the terms of humanitarian benevolence. The grossest deceit and foulest tortures are considered altruistic. Nations who do not bow to these genocidal pressures are targeted as undemocratic and subjected to severe penalties. Three primary institutions that hide their activities under a benevolent, caring front are the United Nations Family Planning Agency (UNFPA), International Planned Parenthood Foundation (IPPF) and the World Health Organization (WHO).\n\nThe Maternal and Infant Health Care Law (MIHCL) in China prior to 1986, \"enforc[ed] certain eugenic measures by requiring the abortion of defective fetuses and the sterilization of certain categories of people, including those suffering from certain forms of mental illness, retardation and communicable or hereditary diseases.... Under various provincial regulations, hundreds of thousands have been sterilized.... Under this law, people with serious hereditary diseases, 'legal contagious diseases,' or 'relative mental disorders' continue to be prevented from bearing children.\" What brings this program, heartily endorsed by UNFPA, to our doorstep is the U.S.'s involvement. We helped to fund it to the tune of 34 million dollars. Population Research Institute (PRI) charges, \"Take, for example, the publication Training Family Planning Counselors in China, jointly published by UNFPA, the Chinese government's State Family Planning Commission, and the Program for Appropriate Technology in Health (PATH), which the U.S. government currently funds to the tune of $34 million.\" The women are motivated, but it is a forced motivation. Those disobedient to the law are physically tortured and/or financially ruined.\n\nTed Turner, who contributed a billion dollars to further U.N. activities, may have understood more of the inner workings of UNFPA than most when he said that the current population of five billion human beings needs to be cut back to no more than \"250 million to 350 million people.\" Bill Muelhenberg of The New Australian commenting of this aspect shrewdly asks, \"Of course one has to ask, How will this be achieved? Will Turner and wife Jane Fonda lead the way?\" The inference from this tongue-in-cheek statement implies that those who see overpopulation as a problem and want to reduce it should start with self-reduction.\n\nIf we examine Nazi Germany's abortion reasoning we find parallels and many clues to today's war on the unborn. The compelling motive for population control, under Germany's iron fist, was craftily disguised as concern for the social, mental and physical well-being of the mother. Another \"concern\" expressed for the mother was the removal of unsafe abortion procedures and the establishment of well-trained physicians. To further the deception, the \"doctor's\" oath taken to \"first do no harm,\" was turned into a lie, expressing compassion for the woman's emotional and physical state while ignoring the child she carried. Professor Wetzel from Berlin callously states:\n\nHuman Rights in China (HRIC), based in New York and Korea, has spoken against the horrific practices in China on one hand but, on the other, appears to agree with the procedure. They state, \"This eugenics policy is not based on agreed scientific information about the transmission of parents' conditions to their offspring....\" From this qualifier, could we assume that if there were \"agreed scientific information\" tying certain \"communicable or hereditary diseases,\" \"mental illnesses,\" \"seriously low intelligence\" quotients, \"defective fetuses\" or \"retardation\" to the birth parents, would the forced feticides be acceptable? What constitutes a \"seriously\" low intelligence? Where should we draw the line with \"certain\" forms of mental illness? What \"communicable\" or \"hereditary\" diseases would make euthanasia necessary? The boundaries for deception and interpretation of \"scientific information\" could include any interpretation within their imagination.\n\nA non-governmental organization (ngo) that pushes for population control disguised as health services is International Planned Parenthood Foundation (IPPF). PRI charges IPPF with spending \"billions of dollars to promote every type of family planning.\"\n\nMany countries have vigorous laws against abortion and the importation of abortion devices into the country. IPPF is up to this challenge. Through carefully worded and sanitized logic it has renamed abortion procedures as \"menstrual regulation,\" \"menstrual extraction,\" \"uterine evacuation,\" \"endometrial aspiration\" or \"collecting tissue samples.\" Malcolm Potts, a former IPPF medical director, clearly sees the solution. He cunningly states, \" Using the name 'menstrual regulation' alters the name of the game [abortion]....\" He goes on to state that openly calling abortion by its right name is against the law, but, by putting a different label on the same procedure, it becomes acceptable.\n\nEntire nations are now deceived into believing IPPF performs a valuable service. In Bangledesh, where abortions are illegal, IPPF claims that it carries out 22% of the abortions under the term \"menstrual regulation\" in direct defiance of India's law. Clearly, IPPF has become the global lawmaker, judge, jury and executioner of other nation's laws in regards to the sanctity of life.\n\nIn another twisted form of logic calling feticide saving lives, Dr. Richard Turkson, IPPF's Legal Counsel for the African region says, \"safe abortion is a medical procedure that can save lives and protect health: it is unethical to withhold it.\" The \"Vision 2000: Moving Forward After Cairo and Beijing\" paper under the heading, \"Actions for NGOs/FPAs\" advocates for the removal of any laws prohibiting their procedures. It says they should \"monitor the legal status of abortion and advocate for abortion law reform and repeal of any punitive measures.\" (emphasis added) IPPF reaffirms this in another document entitled, The Human Right to Family Planning. It is written that, \" action outside the law, and even in violation of it, is part of the process of stimulating change.\" It appears that the propagation of deceptions in the pro-choice world are increasing faster than the population.\n\nThe Reich Commission for Strengthening of Germandom, a Nazi SS organization, on November 25, 1939, shortly after the invasion of Poland, issued this amazing parallel statement:\n\nThis was confirmed in April of 1942 by another declaration from Professor Wetzel from Berlin. He writes, \" A contraceptive industry must be established. Neither the circulation and sale of contraceptives nor abortions must be prosecuted.\"\n\nThe amazing part of these parallel decrees is the context. It is the declaration of a ruthless nation during a time of war. As the war continued, the efforts escalated into decrees from free use of state funded contraceptives to abortions and forced sterilization. Eventually, women who became pregnant were killed. Infanticide and euthanasia orders were issued by Hitler for the Poles, Russians and Jews. Later his war policies were extended beyond these races to all who were \"non-German.\" Could the present organizations be taking lessons from the past? Or was the past just a small experiment to see if it would work on a global scale?\n\nIn a special report by James Miller from Human Life International, WHO is charged with sterilizing millions of unsuspecting women from underdeveloped countries. The tool used was a tetanus shot laced with human chorionic gonadotrophin (hCG), a naturally occurring hormone essential for maintaining a pregnancy.\n\nhCG alerts the woman that her body is pregnant and causes the release of other hormones to prepare for continuation of the pregnancy. The clearly documented report stated that \"when hCG is introduced into the body coupled with a tetanus toxoid carrier, antibodies will be formed not only against tetanus but also against hCG. In this case the body fails to recognize hCG as a friend and will produce anti-hCG antibodies. The antibodies will attack subsequent pregnancies by killing the hCG which naturally sustains a pregnancy; when a woman has sufficient anti-hCG antibodies in her system, she is rendered incapable of maintaining a pregnancy.\" In effect, a married woman could have many spontaneous abortions.\n\nMiller further charges, \"World Health Organization (WHO) [has been] overseeing massive vaccination campaigns against tetanus in a number of countries, among them Nicaragua, Mexico, and the Philippines.\" Africa is under current scrutiny for the same evidence of tetanus laced with hCG.\n\nThe way in which the tetanus shots are administered points to the motive. In Mexico and the Philippines millions of only women, between the ages of 15 and 45 (don't men and children get tetanus?) were vaccinated. In Nicaragua the ages of the women were between 12 and 49. The vaccines in every instance were laced with hCG. Interestingly enough, the Center for Disease Control has set these ages as the reproductive years for females.\n\nOne tetanus shot is supposed to be good for ten years or more but WHO has called for multiple shots. Three shots were to be given in a three-month time frame followed by two more for a total of five. This gives greater credence to the \"sufficient anti-hCG antibodies\" charge for sterilization. Since the tetanus shot is good for ten years, one might reasonably assume that the woman is doomed childless for ten years. James Miller further documents that WHO has been actively involved with the tetanus vaccination, alias secret sterility, campaign for more than twenty years.\n\nWHO denied the allegations at first. After undeniable evidence was presented, WHO capitulated that it was there but tried to justify it by stating it was in \"insufficient\" quantities for sterilization. Further testing proved this false. After that, the rumors spread like flies that the tests were contaminated by the process designed to locate the hCG. The tragedy in it by this time was the fact that the women were already effectively sterilized. One fact stood uncontroverted that WHO and the DOH had no answer. How did the hCG antibodies appear in the blood stream unless it was artificially introduced there?\n\nAnother interesting discovery with the tetanus charge is the contributors to the WHO tetanus campaign. \"WHO began its 'Special Programme' in human reproduction in 1972, and by 1993 had spent more than $356 million on 'reproductive health' research.\" There were major contributors from all over the world but some are especially noteworthy; they were UNFPA, the World Bank, the Rockefeller Foundation, the Ford Foundation and the U.S. Why would the World Bank and the Rockefeller Foundation be so interested in tetanus vaccinations?\n\nThe U.S. stopped payment under the Reagan Administration because of the mounting evidence against the vaccinations. Under the Clinton administration,which has always expressed great concern for the female population, it has become a major contributor again. Some may pat their backs for the brief period of non-support, but Human Life International is calling for congressional investigations because \"nearly every agency involved in the development of an anti-fertility vaccine is funded, at least in part, with U.S. monies.\"\n\nOnce again, Nazi Germany enters with a nearly exact similarity from the past. A sterilizing drug made from a South American plant called Caladium Seguinum caused one Nazi physician from Munich to exclaim, \"If we were to succeed on the basis of these researches, in producing as soon as possible a drug that would within a relatively short time, imperceptibly bring about sterilization in man, we should have a new and extremely effective weapon at our disposal.\" This claim furthers two very real possibilities that depopulation procedures are open war against mankind and that inoculation procedures containing hidden derivatives are one of its major weapons.\n\nBased on the experience of Nazi Germany and the Nuremberg War Crimes Tribunal, Article II of the Convention on the Prevention and Punishment of the Crime of Genocide defines as genocide \"imposing measures intended to prevent births within the group.\" It appears that the Nuremburg War Crimes Tribunal findings applied only to Germany and its genocidal acts. Are the children killed today different? With abundant deceptions from UNFPA, IPPF and WHO about depopulation procedures disguised as reproductive health care, family planning and vaccinations, can we imagine the U.S. is exempt from these deceptions?\n\nTHE U.S. KILLS MORALITY AND ETHICS\n\nThe Supreme Court in the Roe vs. Wade decision, taking as their source a Dr. Edelstein, quotes his \"theory\" stating that \"the [Hippocratic] oath originated in a group representing only a small segment of Greek opinion.... But with the end of antiquity a decided change took place.... The emerging teachings of Christianity were in agreement with the Pythagorean ethic (that \"abortion meant destruction of a living being\") ... and was applauded as the embodiment of truth. Thus suggests Dr. Edelstein, it is 'a Pythagorean manifesto' and not the expression of an absolute standard of medical conduct.\" So now we have the basis for the Roe vs. Wade decision. By throwing out the Hippocratic oath and Christian morals, the court was left open to its own consensus as to when life began and when aborticide was legal.\n\nJust as meanings have been deliberately changed in an attempt to soften the motives, the Roe vs. Wade decision paved the way for a change of mind as to when life begins. In an article published in the New York Times by Steven Pinker the line is moved again. Pinker heartily endorses the idea that a newborn child is on the same level as mice. He says, \"The right to life must come, the moral philosophers say, from morally significant traits that we humans happen to possess.\" One of the \"traits\" he categorically states \"include an ability to reflect upon ourselves as a continuous locus of consciousness, to form and savor plans for the future, to dread death and to express the choice not to die. And there's the rub: our immature neonates don't possess these traits any more than mice do.\" Carrying this logic on he openly advocates homicide by saying, \"several moral philosophers have concluded that neonates are not persons, and thus neonaticide should not be classified as murder.\" But it doesn't end there.\n\nAccording to the Center on Disease Control, a child is listed as a neonate until the 28th day. Can the definition as to when a human becomes a person be pushed to the 28th day or is it a year because a post-neonate lives from the 28th to the 365th day? Does an infant become a person when he/she can make logical conscious decisions of life and death? What of severely retarded children who do not seem to make these types of decisions? How many people while sleeping make conscious choices about life and death? Who can not help but notice a newborn child crying and kicking, making a decision to live and not die?\n\nThe New Encyclopedia Britannica carries this to its logical conclusion. In a section on ethics they state, \"A number of ethical questions cluster around both ends of the human life span. Whether abortion is morally justifiable has popularly been seen as depending on our answer to the question 'When does a human life begin?' \" This echoes the Roe vs. Wade decision that tried to establish viability beginning at birth. But Britannica evades this question by imposing another question that digs to the heart of the issue. \"Many philosophers believe this to be the wrong question to ask because it suggests that there might be a factual answer that we can somehow discover through advances in science. Instead, these philosophers think we need to ask what it is that makes killing a human being wrong and then consider whether these characteristics, whatever they might be apply to the fetus in an abortion.\" We would think that Britannica would withdraw from this last thought with disgust, but they push the borders even further by writing, \"There is no generally agreed upon answer, yet some philosophers have presented surprisingly strong arguments to the effect that not only the fetus but even the newborn infant has no right to life.... The task for those who defend the sanctity of human life is to explain why human life, no matter what its characteristics, is specially worthy of protection.\" Now the floodgates are wide open for human life at any age to come into question as to its right to life. Has the Encyclopedia Britannica come into harmony with the AAAS thought that humans are cancer cells needing to be cut out?\n\nJust as the Supreme Court threw out medical ethics and Christian morality, Britannica has emphasized the crux of the matter. It says, \"Explanation could no doubt be provided in such traditional Christian doctrines as that all humans are made in the image of God.... In the current debate, however, the opponents of abortion have eschewed religious arguments of this kind without finding a convincing secular alternative.\"\n\nEarly on in the abortion debate, many put forth the proposition that having an unwanted child would give rise to greater instances of child abuse. But the opposite has been proven from the horrible experiment carried on since the Roe vs. Wade decision. Since 1973, the number of reported cases of child abuse has increased by 1,497 per cent, from 167,000 in 1973 to 2.5 million in 1991 (from the U.S. Department of Health & Human Services). In an article in the Canadian Journal of Psychiatry entitled \"Relationship Between Abortion and Child Abuse\" some candid observations are made about the relationships between abortion and child abuse:\n• None The rate of increase in child abuse parallels the rate of increase in abortions [in industrialized nations].\n• None A woman, to abort her helpless young, must overcome her instinctual impulse to attend to the little one's helplessness.... Even the woman who has undergone several abortions, on seeing her limp fetus, experiences a profound psychological shock that can produce a serious illness.\n• None ...There appears to be...a decrease in the value of children to society.\n• None Guilt is one of the major factors causing battering and infanticide. There are intolerable feelings of self-hatred, which the parent takes out on the child. Abortion results in guilt and guilt contributes to child battering.\n• None Abortion contributes to lowered self-esteem, which contributes to child battering. Battering also increases guilt, which could lead to more frequent abortions of subsequent pregnancies.\n• None The survivor syndrome, a mixture of guilt and anger, may be experienced by children in a family where an abortion was done. Their guilt produces depression, often exhibited as irritability and lethargy, which to the parents smacks of rudeness and disrespect, the very things that trigger many batterings.\n• None In some instances, a guilt-ridden child unconsciously triggers parental hostility because he feels that he should be punished for his aggressive feeling. \"You killed my baby brother, you better go ahead and kill me.\"\n• None ...Abortion on request not only increases the rates of child battering at present, but it will increase the tendency to batter and abort in succeeding generations.\n• None Abortion, producing guilt in both the mother and in the children who survive, increases the probability of displaced hostility, which results in battered or murdered children.\n\nThis article, written in 1979, delineates how parents harden their hearts to the point of death toward their own offspring. Even in nature many animals and insects ferociously protect their offspring from other predators. America has descended lower than the level of brute beasts and insects to point of sanctioning, funding and defending the killing of the unborn worldwide. America has become an assassinator of those unable to defend or speak on their own behalf.\n\nCould we say that the U.S. is in the killing business disguised as \"reproductive rights\" and \"menstrual regulation?\" Can we expect to go to \"health departments\" and hospitals for vaccinations and drugs and not be deceived? Can we say for sure that we \"know\" what is in the medications and vaccinations given? With no sanctity for human life and placed upon the level of a disease, what prohibits the surgery from extending from the unborn and aged to the unfit and socially unacceptable? Where will the line be drawn now?\n\n\"I am happy to be alive. I almost died. Every day I thank God for life. I do not consider myself a by-product of conception, a clump of tissue, or any other of the titles given to a child in the womb. I do not consider any person conceived to be any of those things.\" Abortion survivor Gianna Jessen before the Constitution Subcommittee of the House Judiciary Committee on April 22, 1996.\n\nGianna Jessen's mother at seven and a half months' pregnancy was injected with a saline solution designed to burn the infant alive in the womb. She miraculously lived though she weighed only two-and-a-half pounds at birth. She was in intensive care for three months following the birth. Later she was diagnosed with cerebral palsy as a result of the saline injection. She attributes her survival to the fact that she was born three hours before the expected time so the doctor was not there to finish the aborticide.\n\nOf a world that has rejected God's laws in favor of killing its children it was prophesied, \"The Lord shall bring a nation against you from afar, from the ends of the earth, as swift as the eagle that flies; a nation whose language you do not understand; a people of fierce countenance, who shall not regard the person of the old , nor show mercy to the young.\" [Aborticide] What makes this statement pertinent is the time frame. \"And in the latter time of their kingdom, when the transgressions are come to the full, a king of fierce countenance and understanding riddles shall arise. And his power shall be mighty, but not by his own power; and he shall cause terrible destruction.... And through his craft and treachery his dominion shall prosper and he shall magnify himself in his heart, and suddenly he shall destroy many; and he shall rise up against the prince of princes; but he shall be defeated easily.\"", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#abortion", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#encyclopedia", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#family", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#pri", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#muelhenberg", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#poliakov", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#hric", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#pri", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#ippf", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#wetzel", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#hli", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#caladium", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#roe", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#pinker", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#encyclopedia", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html#ney", "http://www.apfn.org/THEWINDS/archive/medical/family_planning01-99.html", "http://www.pop.org/reports/rv069801.html", "http://www.newaus.com.au/news16d.html", "http://www.igc.apc.org/hric/crf/english/95fall/e11.html", "http://www.law.vill.edu/Fed-Ct/Supreme/Flite/opinions/410US113.htm", "http://www.gargaro.com/pinker.html", "http://www.radioliberty.com/pca.htm", "http://www.apfn.org/THEWINDS/archive/medical/planned_parenthood03-98.html", "http://www.apfn.org/THEWINDS/archive/medical/holocaust9-97.html", "http://www.apfn.org/THEWINDS/archive/medical/a050297c.html", "http://www.apfn.org/THEWINDS/arc_features/medical/abortions01-99.html"], "authors": [], "publish_date": null}