{"result_id": "180018", "URL": "https://jesus-is-savior.com/Health_Concerns/Vaccines/waiver_kept_secret.htm", "timestamp": "2023-04-25 16:08:33 CEST+0200", "meta": {"description": "PARENTS KEPT IN DARK ABOUT VACCINE WAIVER", "lang": "en", "keywords": "PARENTS, KEPT IN DARK, VACCINE, WAIVER", "favicon": "", "canonical": "https://jesus-is-savior.com/Health_Concerns/Vaccines/waiver_kept_secret.htm", "encoding": "windows-1252"}, "image": null, "domain": "jesus-is-savior.com", "title": "PARENTS KEPT IN DARK ABOUT VACCINE WAIVER", "cleaned_text": "Parents of children in Prince George's County Maryland were kept in the dark about their right to opt out of vaccines as over a thousand kids were herded into a courthouse to be injected while authorities kept a close watch on advocacy groups and reporters who tried to inform parents that there was no law to mandate the shots.\n\nParents were threatened with fines and jail time last week if they failed to have their children immunized, after schools kicked out kids for not taking the Hepatitis B vaccine.\n\nAccording to observers who were able to gain access to the courthouse, children with a history of medical issues were not properly screened as parents were simply told to get in line and have their kids take the shots.\n\n\"Many of those in line said their children were properly immunized, but the school system had misplaced the records. They said efforts to get the paperwork straightened out beforehand had been futile,\" reported the Associated Press.\n\nIn the following video, Kelli Ann Davis, a member of SafeMinds, a national autism advocacy organization, whose son Miles was diagnosed with autism in 2002 as a result of mercury poisoning from vaccines, relates how she was also followed by police with dogs to the bathroom after being told she \"was not one of them\".\n\nShe also explains how the information packs handed out to parents before they lined up to have their kids take the shots failed to include waiver forms giving parents the right to opt out due to personal, religious or medical reasons.\n\nState Attorney Glenn Ivey, who admitted during a radio interview last week that no law mandated the shots and also that he had chosen not to give his kids the vaccines, confirmed that exemption forms were available from the back of the room. However, when asked if they were aware of the right to opt out, parents were miffed. News reports failed to cite any cases where parents had opted out as a result of signing waiver forms.\n\nAccording to an Associated Press report, over a thousand children were vaccinated on Saturday, leaving around 1100 who did not show up to the courthouse. The fact that mandatory shots were being doled out in court after parents had been threatened with arrest, reminiscent of some nightmarish science fiction horror movie, and potentially dangerous in itself, was also overlooked by mainstream news coverage.\n\nOn Friday, the Association of American Physicians and Surgeons condemned the case as a \"vaccine roundup.\"\n\n\"This power play obliterates informed consent and parental rights,\" said Kathryn Serkes, director of policy for the Association of American Physicians and Surgeons (AAPS), one of the few national physician groups that refuse corporate funding from pharmaceutical companies. In a scenario reminiscent of cattle round-ups, the state's attorney has issued summons to more than 1600 parents of children who have not provided certificates of immunization for their children. But instead of toting a cattle prod, this state's attorney chooses to wield a syringe to keep the \"herd\" in line. Children should be carefully screened, medical records taken and decisions made carefully - not in an ad hoc assembly-line clinic in a county courtroom and under the brutal watch of law enforcement. This is a man-made disaster ready and waiting to detonate. Children could receive a dangerous cocktail of several vaccines without proper examinations. \"The procedure is reckless and subjects children to the risk of severe reactions. Physicians would not be allowed to treat children in this way, without individual histories and physical exams - or informed consent,\" said Jane M. Orient, M.D., AAPS Executive Director.\n\nAAPS also pointed out a blatant conflict of interest, highlighting the fact that the school district is set to lose a windfall in state funding unless students comply with the vaccine order.\n\nWith the state still hell-bent of getting over a thousand other children to take the shots, this case is far from over, and charges that parents have been subject to an intimidation campaign while not being properly informed of the exemption process will continue.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "embed", "provider": "youtube", "width": "425", "height": "355", "embed_code": "<embed src=\"http://www.youtube.com/v/r6Vj0EX_STU&amp;rel=1&amp;border=0\" width=\"425\" height=\"355\" type=\"application/x-shockwave-flash\" wmode=\"transparent\"></embed>", "src": "http://www.youtube.com/v/r6Vj0EX_STU&rel=1&border=0"}], "links": ["http://prisonplanet.com/index.html", "http://www.wmur.com/health/14626462/detail.html", "http://www.prisonplanet.com/articles/november2007/151107_attorney_admits.htm", "http://www.wmur.com/health/14626462/detail.html", "http://www.prisonplanet.com/articles/november2007/181107Vaccine.htm"], "authors": [], "publish_date": null}