{"result_id": "180031", "URL": "https://www.jesus-is-savior.com/End%20of%20the%20World/Chimeras/150_produced.htm", "timestamp": "2023-04-25 16:08:41 CEST+0200", "meta": {"description": "150 Chimeras Secretively Produced in UK Labs", "lang": "en", "keywords": "150 Chimeras Secretively Produced in UK Labs", "favicon": "", "canonical": "https://www.jesus-is-savior.com/End%20of%20the%20World/Chimeras/150_produced.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "150 Chimeras Secretively Produced in UK Labs", "cleaned_text": "And God said, Let the earth bring forth the living creature , cattle, and creeping thing, and beast of the earth : and it was so. And God made the beast of the earth , and cattle , and every thing that creepeth upon the earth : and God saw that it was good.”\n\nA “chimera” is combining animal DNA with human DNA in a laboratory to produce a monster! The Word of God teaches that God created the universe and everything in it. Genesis 1:11-12, 21, 24-25 teaches that God created life to reproduce AFTER THEIR KIND and AFTER HIS KIND. What mad scientists are doing today—combining the DNA from different KINDS is not only unethical, but also immoral and dangerous. God never intended for man to combine the DNA of plants with that of insects. I've read about Potatoes grown with the DNA of silk moths to ward off insect attacks on the crops. Scientists have produced transgenic cats, sheep, pigs, mice, salmon, and monkeys. They've produced spider-goats, human-cows, spinach-pigs, fish-tomato, vaccine-vegetables, and designer human babies. How about transgenics and transvestites?\n\nGenesis 1:25 says that God saw that His creation WAS GOOD; but mad scientists think they can do better and improve on God's creation, tampering with DNA under the pretense of trying to achieve something good. Chimeras are not good!\n\nIt was reported in the news in January of 2011 that mad scientists have Released 6,000 Mutant DNA Modified Mosquitoes into Nature! They did this to combat dengue fever, but other scientists fear the potential dire consequences of tampering with nature. One of these days scientists are going to unleash a plague that will kill millions of people, if not billions. Mankind is his own worst enemy. It is a dangerous thing to play God. It's Jurassic Park in real life.\n\nIt was reported in the news on July 23, 2011 that European scientists have been producing chimeras secretively for the past 3-years. You can be assured that countless other mad scientists around the world are playing God and tampering with DNA projects. As time passes, shocking works of darkness are going to unfold concerning chimeras. Literally, scientists are doing exactly what Dr. Moreau did on his island. Will a Pandora's Box be opened?\n\n150 human animal hybrids grown in UK labs: Embryos have been produced secretively for the past three years Scientists have created more than 150 human-animal hybrid embryos in British laboratories. The hybrids have been produced secretively over the past three years by researchers looking into possible cures for a wide range of diseases. The revelation comes just a day after a committee of scientists warned of a nightmare ‘Planet of the Apes’ scenario in which work on human-animal creations goes too far. PHOTO TO LEFT: Research centre: Warwick University has been growing animal human hybrids over the last three years Last night a campaigner against the excesses of medical research said he was disgusted that scientists were ‘dabbling in the grotesque.’ Figures seen by the Daily Mail show that 155 ‘admixed’ embryos, containing both human and animal genetic material, have been created since the introduction of the 2008 This legalised the creation of a variety of hybrids, including an animal egg fertilised by a human sperm; ‘cybrids’, in which a human nucleus is implanted into an animal cell; and ‘chimeras’, in which human cells are mixed with animal embryos. Scientists say the techniques can be used to develop embryonic stem cells which can be used to treat a range of incurable illnesses.\n• Hospital hoping to save cash tells families to stop visiting sick relatives and instead call them on SKYPE\n• THIRTY embryos created for every baby born by IVF... and thousands are thrown away\n• Beware 'Planet of the Apes' experiments that could create sci-fi nightmare Three labs in the UK – at King’s College London, Newcastle University and Warwick University – were granted licenses to carry out the research after the Act came into force. All have now stopped creating hybrid embryos due to a lack of funding, but scientists believe that there will be more such work in the future. The figure was revealed to crossbench peer Lord Alton following a Parliamentary question. Last night he said: ‘I argued in Parliament against the creation of human- animal hybrids as a matter of principle. None of the scientists who appeared before us could give us any justification in terms of treatment. ‘Ethically it can never be justifiable – it discredits us as a country. It is dabbling in the grotesque. ‘At every stage the justification from scientists has been: if only you allow us to do this, we will find cures for every illness known to mankind. This is emotional blackmail. DNA of animals mixed with humans secretively for the past three years\n\nThe Bible plainly teaches in Genesis 7:14 that God intended for every living thing to reproduce “after his kind.” Genesis 7:14, “They, and every beast , and all the cattle , and every creeping thing that creepeth upon the earth , and every fowl , every bird of every sort.” Yet men in their arrogance and unrestrained curiosity have crossed the line with God, creating mutant species AFTER ANOTHER KIND...", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["../Genetics%20Nightmare/frankenfoods.htm", "../Genetics%20Nightmare/glowing_cats.htm", "../Genetics%20Nightmare/transgenic_sheep.htm", "../Genetics%20Nightmare/spider_goats.htm", "../Genetics%20Nightmare/human_cows.htm", "../Genetics%20Nightmare/spinach_pig.htm", "http://en.wikipedia.org/wiki/Fish_tomato", "../Genetics%20Nightmare/vaccine_vegetables.htm", "../Genetics%20Nightmare/transgenics_and_transvestites.htm", "../Genetics%20Nightmare/mutant_mosquitoes.htm", "../Genetics%20Nightmare/mad_scientists.htm", "http://www.dailymail.co.uk/news/article-2017546/Hospital-hoping-save-cash-tells-families-stop-visiting-sick-relatives-instead-SKYPE.html", "http://www.dailymail.co.uk/news/article-2017821/THIRTY-embryos-created-baby-born-IVF--thousands-thrown-away.html", "http://www.dailymail.co.uk/sciencetech/article-2017475/Beware-Planet-Apes-experiments-create-sci-fi-nightmare.html", "http://www.dailymail.co.uk/news/article-2017818/Embryos-involving-genes-animals-mixed-humans-produced-secretively-past-years.html"], "authors": [], "publish_date": null}