{"result_id": "180036", "URL": "https://www.jesus-is-savior.com/Health_Concerns/when_legal_drugs_kill.htm", "timestamp": "2023-04-25 16:08:43 CEST+0200", "meta": {"description": "When Legal Drugs Kill!", "lang": "en", "keywords": "Legal, Drugs, Kill", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/when_legal_drugs_kill.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "When Legal Drugs Kill!", "cleaned_text": "It was to have been Jerry and Mary Sagen's first New Year's Eve together as a married couple. But on that morning in 1996, says Jerry Sagen, \"I awoke to hear her dying.\" As Mary gasped her last breaths, Jerry dialed 911 and frantically blew air into her lungs, but it was too late. At first the death of the healthy 45-year-old woman was a mystery. But last month an answer was stamped onto Mary's death certificate: accidental death due to a toxic level of the antihistamine Hismanal. (While not commenting on the case, Janssen Pharmaceutica, the maker of Hismanal, said it is difficult to confirm a drug as the ultimate cause of death and stressed that \"it's been taken safely by a huge number of people.\") For Jerry Sagen, 53, it was unfathomable. \"You're numb,\" he says; \"you can't believe it happened.\"\n\nFor millions of Americans, prescription drugs are a way of life - about 2 billion are dispensed each year. We rely on them for everything from allergies to diabetes to depression. But in a study published last week in The Journal of the American Medical Association, researchers found that adverse reactions to prescription drugs may rank somewhere between the fourth and sixth leading cause of death in the United States. Dr. Bruce Pomeranz, a professor at the University of Toronto, and his team analyzed 39 studies conducted in American hospitals over four decades (the study was funded by a scientific-research group). Of 33 million patients admitted to hospitals in 1994, more than 100,000 died from toxic reactions to medications that were administered properly, either before or after they were hospitalized. And more than 2 million suffered serious side effects.\n\nDrugs by nature are powerful substances, and individual responses are unpredictable. While the study didn't look at specific drugs, it has been documented that antihistamines, in combination with the wrong antibiotic, can lead to abnormal heart rhythms; in rare instances the result can be fatal. (Mary Sagan was taking an antibiotic with the Hismanal, though that combination has not been linked to her death). Mixing drugs isn't the only problem. Blood thinners alone, for example, can cause fatal internal hemorrhaging. \"We have to realize drugs are not magic bullets,\" says Pomeranz. \"They don't just hit the tissue we want them to hit, they hit all the other tissues as well.\"\n\nHe and others say the Food and Drug Administration must work harder to address the problem. Though the FDA has been lauded for a much-needed increase in the number of new drugs it approves each year (a record 46 in 1996), critics say it hasn't done enough to monitor medications once they're on the market. The FDA requests reports on adverse drug reactions from hospitals and physicians, but few participate in this voluntary program. Information that might warn of - or perhaps even ward off - side effects is buried in doctors' offices and hospital wards. \"It's the best FDA system in the world, but it's not enough,\" says Pomeranz. \"We need more post-market surveillance.\"\n\nThe FDA says it hopes to soon launch a computerized system that will make it easier to report adverse drug reactions. Monitoring medications is \"terribly important,\" says Michael Friedman, the FDA's acting commissioner. \"We want to give more attention to this.\" But surveillance isn't the FDA's dominion alone. \"I see problems at every link of the safety chain,\" says Thomas Moore, a senior fellow at the George Washington University Medical Center and author of \"Prescription for Disaster.\" He says physicians need to be much more cautious about the drugs - and drug combinations - they prescribe. And patients need to become wiser consumers. While the Pomeranz study didn't deal with patients who misread or disregard warning labels - taking an incorrect dosage, for example - that is a serious cause of adverse reactions.\n\nSome experts raised concerns about last week's study, noting that the hospitals surveyed were all teaching hospitals, where patients are sickest and receive the most drugs. And while 100,000 deaths is 100,000 too many, those represent just .32 percent of hospitalized patients. \"When you realize how many drugs we use,\" said Dr. Lucian Leape of the Harvard School of Public Health, \"maybe those numbers aren't so bad after all.\" Pomeranz isn't warning people to stay away from drugs. \"That would be a terrible message,\" he says. \"But we should increase our vigilance.\" That's a prescription everybody can live with.\n\nSOURCE: Reprinted from the 27 April, 1998, issue of Newsweek magazine. Excerpted in the public service of the national interest of the American people.\n\nADVERSE DRUG REACTIONS MAY CAUSE OVER 100,000 DEATHS AMONG HOSPITALIZED PATIENTS EACH YEAR \n\n \n\n Study suggests adverse drug reactions are among the top causes of death in U.S.\n\n \n\n CHICAGO—Adverse drug reactions (ADRs) in U.S. hospitals may be responsible for more than 100,000 deaths nationwide each year, making it one of the leading causes of death, according to an article in the April 14 issue of The Journal of American Medical Association (JAMA). \n\n \n\n Bruce H. Pomeranz, M.D., Ph.D., and colleagues from the University of Toronto, analyzed 39 studies of ADRs in the United States to estimate the incidence of serious and fatal adverse drug reactions in hospital patients. To obtain overall incidence rates of ADRs in hospitalized patients, the researchers combined the incidence of ADRs in the hospital and the incidence of ADRs causing admission to the hospital. \n\n \n\n The authors estimated that 2,216,000 hospital patients experienced a serious ADR and 106,000 deaths were caused by ADRs in the United States. This could account for 4.6 percent of all causes of recorded death in 1994, making these reactions between the fourth and sixth leading cause of death. \n\n \n\n The World Health Organization defines ADRs as any noxious, unintended and undesired effect of a drug, which occurs at doses used in humans for prophylaxis [prevention], diagnosis or therapy. The authors define a serious ADR as one requiring hospitalization prolonging hospitalization, or one that is permanently disabling or results in death. \n\n \n\n The researchers found no significant correlation between ADR incidence and year the studies were conducted. They write: \"This result seems surprising since great changes have occurred over the last four decades in U.S. hospitals that should have affected the incidence of ADRs. Perhaps, while length of hospital stay is decreasing, the number of drugs per day may be rising to compensate. Therefore, while the actual incidence of ADRs has not changed over the last 32 years, the pattern of their occurrence has, undoubtedly changed,\" the authors write. \n\n \n\n The authors determined that ADRs are one of the leading causes of death by using the highest and lowest possible estimates. Using the higher estimate placed ADRs as the fourth leading cause of death, behind heart disease (743,460 deaths), cancer (529,904 deaths) and stroke (150,108 deaths). Using the lower estimate placed ADRs as the sixth leading cause of death behind those previously mentioned, as well as pulmonary disease (101,077 deaths) and accidents (90,523 deaths). ADRs would then rank ahead of pneumonia and diabetes. \n\n \n\n The authors conclude: \"While our results must be viewed with some circumspection because of the heterogeneity among the studies and small biases in the sample, these data suggest that ADRs represent an important clinical issue.\" \n\n \n\n (JAMA. 1998; 279:1200-1205)\n\nJAMA - The Journal of the American Medical Association Adverse Drug Reactions\n\n \n\n J. Lazarou, B.H. Pomeranz, P.N. Corey, Incidence of Adverse Drug Reactions in Hospitalized Patients - A Meta-analysis of Prospective Studies, JAMA. 1998;279: 1200-1205 \n\n \n\n Objective.—To estimate the incidence of serious and fatal adverse drug reactions (ADR) in hospital patients. \n\n \n\n Data Sources.—Four electronic databases were searched from 1966 to 1996. \n\n \n\n Study Selection.—Of 153, we selected 39 prospective studies from US hospitals. \n\n \n\n Data Extraction.—Data extracted independently by 2 investigators were analyzed by a random-effects model. To obtain the overall incidence of ADRs in hospitalized patients, we combined the incidence of ADRs occurring while in the hospital plus the incidence of ADRs causing admission to hospital. We excluded errors in drug administration, noncompliance, overdose, drug abuse, therapeutic failures, and possible ADRs. Serious ADRs were defined as those that required hospitalization, were permanently disabling, or resulted in death. \n\n \n\n Data Synthesis.—The overall incidence of serious ADRs was 6.7% (95% confidence interval [CI], 5.2%-8.2%) and of fatal ADRs was 0.32% (95% CI, 0.23%-0.41%) of hospitalized patients. We estimated that in 1994 overall 2,216,000 (1,721,000-2,711,000) hospitalized patients had serious ADRs and 106,000 (76,000-137,000) had fatal ADRs, making these reactions between the fourth and sixth leading cause of death. \n\n \n\n Conclusions.—The incidence of serious and fatal ADRs in US hospitals was found to be extremely high. While our results must be viewed with circumspection because of heterogeneity among studies and small biases in the samples, these data nevertheless suggest that ADRs represent an important clinical issue.\n\nDoctors Are Third Leading Cause of Death\n\nVaccines Are Being Made From A\n\nBiblical Support for NOT Vaccinating | Crib Death or Vaccine Death?\n\nDrugs and Big Money (The Creation of the Modern Medical Drug Establishment)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.healingdaily.com/conditions/pharmaceutical-companies.htm", "killer_vaccines.htm", "killer_vaccines.htm", "doctors_are_third_leading_cause_of_death.htm", "Pharmageddon/no_child_left_undrugged.htm", "Pharmageddon/billion_dollar_drug_scam.htm", "Vaccines/five_baffling_vaccination_facts.htm", "when_legal_drugs_kill.htm", "../Evils%20in%20America/Abortion%20is%20Murder/aborted_fetus_vaccines.htm", "../Evils%20in%20America/Abortion%20is%20Murder/aborted_fetus_vaccines.htm", "Vaccines/biblical_support-not_vaccinating.htm", "Vaccines/crib_death_or_vaccine_death.htm", "Vaccines/vaccinations_can_kill.htm", "Pharmageddon/pharmageddon.htm", "Pharmageddon/drugs_and_big_money.htm", "Vaccines/twenty-thousand_dollar_offer.htm", "http://poisonevercure.150m.com/adverse_reactions.htm", "../Evils%20in%20Government/Police%20State/the_psycho_state.htm", "http://poisonevercure.150m.com/cover.htm", "medical_fascism.htm"], "authors": [], "publish_date": null}