{"result_id": "180006", "URL": "https://www.jesus-is-savior.com/Health_Concerns/killer_vaccines.htm", "timestamp": "2023-04-25 16:08:28 CEST+0200", "meta": {"description": "The Killer Vaccines", "lang": "en", "keywords": "The Killer Vaccines", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Health_Concerns/killer_vaccines.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "The Killer Vaccines", "cleaned_text": "Vaccines routinely given to millions of children and adults can be very dangerous to your health, a respected neurosurgeon warns.\n\nDr. Blaylock says that during the past few decades we have seen a “vaccination explosion.”\n\nFor example, the number of vaccines given to children has increased from a few vaccines, for polio and other common childhood diseases during the 1950s, to some 22 mandatory inoculations for many schoolchildren today.\n\nVaccines are even being promoted for newborns, often for diseases that pose no risk to children. The greatest danger is the vaccines themselves.\n\nAnd many in the medical community would like to see annual flu vaccinations as mandatory.\n\nPowerful lobbies are pushing for many more new vaccinations to be added to the list!\n\nThe popular theory is that vaccines vastly decrease the risk of disease, so the more the better.\n\nBut don’t believe it, Dr. Blaylock warns.\n\nHe argues that vaccinations themselves are now causing a major upsurge in childhood diseases, adult maladies – and even deadly ailments such as Gulf War Syndrome and Lou Gehrig’s disease.\n\nDr. Russell L. Blaylock is an admitted medical maverick. He doesn’t parrot what the New England Journal of Medicine – which receives heavy subsidies in advertisements – claims.\n\nDr. Blaylock is a nationally recognized, board-certified neurosurgeon, health practitioner, author and lecturer. He has more than a quarter century of medical experience.\n\nAnd he is now editing The Blaylock Wellness Report because he believes too many Americans are not getting the best advice for preventing and dealing with cancer, heart disease, diabetes, brain diseases such as Parkinson's and Alzheimer’s, and dozens of health problems besetting the American people. You can get the report by going here.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.newsMax.com", "https://www.newsmaxstore.com/newsletters/blaylock/offer1.cfm"], "authors": [], "publish_date": null}