{"result_id": "180035", "URL": "https://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/aids_created_as_biowarfare.htm", "timestamp": "2023-04-25 16:08:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/aids_created_as_biowarfare.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "AIDS Created as BIO-Warfare!", "cleaned_text": "The first African woman to win the Nobel Peace Prize, Wangari Maatha of Kenya, spoke out on the AIDS virus saying it was man-made and deliberately created as a weapon of bio-warfare.\n\n \n\n \"In fact it (the HIV virus) is created by a scientist for biological warfare,” she said. \"Why has there been so much secrecy about AIDS? When you ask where did the virus come from, it raises a lot of flags. That makes me suspicious,” Maathai said.\n\n \n\n The Kenya based East Africa Standard reported that in response to questions from Asian and European media, she said, \"I want to dedicate the prize the African woman. I want to hold and embrace her. She has suffered so much and I feel this is an honor to her.\n\n \n\n \"Although I am a biologist, I have not done any research. I may not be able to say who developed the (HIV) virus but it was meant to wipe out the Black race,\" she continued.\n\n \n\n \"When she first blamed the HIV/Aids on 'some sadistic scientists, Professor Maathai kicked a storm, leaving some experts outraged and others supporting her,\" the Standard reported.\n\n\"Initially, said Maathai, HIV/Aids was only concentrated in selected spots in the continent, only afflicting the 'undesirable classes.' She insisted that some scientists from the developed world deliberately researched and developed the virus in order to \"punish the Blacks\".\n\n \n\n \"I cannot prove this but everybody knows that there are biological weapons. America invaded Iraq because they believed such weapons existed,\" said Maathai.\n\n \n\n Africa accounts for 25 million out of the estimated 38 million people across the world infected with HIV/AIDS, and the vast majority of infected Africans are women, according to UNAIDS estimates. \n\n \n\n “Some say that AIDS came from the monkeys, and I doubt that because we have been living with monkeys (since) time immemorial, others say it was a curse from God, but I say it cannot be that.\n\n \n\n “Black people are dying more than any other people in this planet,” Maathai told a press conference in Nairobi a day after winning the prize for her work in human rights and reversing deforestation across Africa.\n\n \n\n “It’s true that there are some people who create agents to wipe out other people. If there were no such people, we could have not have invaded Iraq,” she said.\n\n \n\n “We invaded Iraq because we believed that Saddam Hussein had made, or was in the process of creating agents of biological warfare,” said Maathai, who is also the Kenyan Deputy Environment and Natural Resources Minister.\n\n \n\n The unspoken truth is that both the United Nations and the United States have promoted so-called \"population control\" for decades. What better agent for the reduction of population than a man-made virus that will take care of millions of so-called \"useless eaters\"?\n\n \n\n AIDS certainly fits the bill. But nobody is talking about its \"efficiency.\"\n\nThe Depopulation Bomb | Deadly Vaccines Of The New World Order\n\nAIDS - created by the military? Deliberate depopulation of third world nations?\n\nAIDS: \"The Manufactured Virus\" (Lots of information) | Three Myths of Overpopulation\n\nHIV not the cause of AIDS? | THE VACCINE MAFIA OR THE VACCINE CIA?\n\nThe Secret Origin of AIDS | Is the AIDS Virus Manmade?\n\nBeware of The Bill and Melinda Gates Foundation\n\nVaccines, by Dr. Len Horowitz (a frightening 121 Minute MP3 audio presentation, 37.3 MB. Did you know that public schools receive government money for vaccinating your child? ...Potentially deadly vaccines that parents are NEVER made aware of or given the option to refuse. You can LEGALLY refuse vaccinations and Dr. Horowitz tells you how in this presentation. Dr. Horowitz' own child was forcibly taken by the state government, you'll be shocked why. He advises people how not to make the same mistake. If you're a parent, you need to hear Dr. Len Horowitz!) Emerging Viruses, by Dr. Len Horowitz (a frightening 204 minute MP3 audio presentation, 114 MB. Dr. Horowitz exposes the evil conspiracy behind AIDS, Ebola, and other emerging manmade viruses. Learn how your own government has conspired against you. AIDS didn't just happen!)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.conspiracyplanet.com", "murder.htm", "http://video.google.com/videoplay?docid=8567399552051355527&q=AIDS+CURE:+U.S.+Patent+#5676977&total=1&start=0&num=10&so=0&type=search&plindex=0", "depopulation_bomb.htm", "vaccines.htm", "http://www.geocities.com/newworldorder_themovie/intro_aids.html", "http://www.apfn.org/apfn/aids.htm", "three_myths_of_overpopulation.htm", "kill_the_useless_eaters.htm", "http://www.geocities.com/newworldorder_themovie/intro_africa.html", "http://www.geocities.com/newworldorder_themovie/intro_geneticengineering.html", "http://www.whatisaids.com/mothering/aztpoisoningbabies.htm", "aids.htm", "http://www.totse.com/en/conspiracy/the_aids_conspiracy/index.html", "hiv_not_the_cause_of_aids.htm", "http://curezone.com/art/read.asp?ID=45&db=1&C0=1", "http://www.angelfire.com/nm/redcollarcrime/ue.html", "secret_origin_of_aids.htm", "is_the_aids_virus_manmade.htm", "aids_created_as_biowarfare.htm", "aids_and_population_control.htm", "aids.htm", "http://www.hiv-aids-factorfraud.com/", "../../Health_Concerns/Vaccines/vaccinations_can_kill.htm", "gates.htm", "../../Health_Concerns/Vaccines/vaccines-dr_len_horowitz.MP3", "../../Evils%20in%20Government/AIDS%20and%20Population%20Elimination/emerging_viruses-dr_len_horowitz.MP3", "../../Health_Concerns/Vaccines/vaccines-follow_the_money.htm", "http://www.dangerousmedicine.com", "http://www.Jesus-is-Savior.com"], "authors": [], "publish_date": null}