{"result_id": "180016", "URL": "https://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/world_vision.htm", "timestamp": "2023-04-25 16:08:32 CEST+0200", "meta": {"description": "World Vision Promotes the Population Control Agenda. So much for a so-called \"Christian\" group. The Devil is a liar. The UN and false Christian groups come in to help third world nations, and then sterilize their women without them knowing what's happening. It is evil.", "lang": "en", "keywords": "World Vision, Population Control, Agenda", "favicon": "", "canonical": "https://www.jesus-is-savior.com/Evils%20in%20Government/AIDS%20and%20Population%20Elimination/world_vision.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.jesus-is-savior.com", "title": "World Vision Promotes Population Control Agenda", "cleaned_text": "The number one agenda of the evil Global elite is Population Reduction. It is sad, but true, that many Christians think it's a good idea. What gives you or I, or anyone else, the right to decide who should be able to have children or not? Max Lucado, Third Day, TobyMac and Michael W. Smith are all going on tour around the country as of the fall of 2010. They're calling it the Make A Difference Tour 2010.\n\nDo you know who is sponsoring them? World Vision, a bogus religious organization that is a front for Population Reduction. You'll see the World Vision logo at the bottom of the Make A Difference Tour website.\n\nPopulation control is a top agenda with elite Globalists and the Council On Foreign Relations (the CFR created the United Nations by the way). Notice at the top of the advertisement below that World Vision is sponsoring these CCM apostates, “WORLD VISION PRESENTS” ...\n\nWASHINGTON, DC (Life Site News) - World Vision, a member of the Evangelical Council for Financial Accountability, calls itself “the largest privately funded, faith-based relief and development organization in the United States.” Despite its popularity and respected image, however, World Vision is generating criticism because of its support for population control.\n\n \n\n A 1995 World Vision policy document called “Health and Healing,” reported that “World Vision will supplement governmental and other NGO [non-governmental organization] efforts in making modern family planning methods available to the couples. ... These include copper IUDs, pills, and condoms.”\n\n \n\n Furthermore, according to a recent article in WORLD, an American Christian magazine, an internal survey of the organization last year revealed that “all responding NOs [national offices] are engaged in some type of family planning-related activity, either as a straightforward family planning or reproductive health project or buried within child survival, maternal health, or women's health activities.”\n\n \n\n WORLD also notes that $55 million of World Vision's $241 million revenue last year came from the U.S. Agency for International Development (USAID) — a group notorious for promoting population control in the third world.\n\nI don't want any part of any organization or group that thinks they are superior to others and have the right to decide who can have a family or not. Max Lucado, Third Day, TobyMac and Michael W. Smith are all a bunch of phonies, who are supporting the sterilization of poor women in third world nations.\n\nWorld Vision is just one of many front groups carrying out the elite's agenda to sterilize unsuspecting women with vaccinations. The women are told that the vaccines are for their own good and are necessary; but in reality, there are chemicals lacing the vaccinations that prevent them from having children.\n\nBill gates is working on two major items with his massive accumulation of wealth, in The Bill and Melinda Gates Foundation: Vaccinations and seeds. Their agenda is population control, to reduce the earth's population. \n\n\n\nIn the Kissinger Report 2004 to U.S. President George W. Bush, Henry Kissinger recommended that organizations LIE to the public, pretending to care about poor children in third world nations, as a cover to kill off and sterilize them. Read the monster's words for yourself...\n\nWorld Vision is fulfilling Kissinger's sinister plan, being deceitful about their real agenda. Isn't that tragic and sad! World Vision is serving the New World Order. Max Lucado and his CCM singer misfits are being sponsored by World Vision. The depth of wickedness in the world today is unprecedented.\n\nThere's not one Scripture in the Bible that tells us to worry about population control. In fact, Jesus teaches us the exact opposite...\n\nLuke 12:28-31, “If then God so clothe the grass, which is to day in the field, and to morrow is cast into the oven; how much more will he clothe you, O ye of little faith? And seek not ye what ye shall eat, or what ye shall drink, neither be ye of doubtful mind. For all these things do the nations of the world seek after : and your Father knoweth that ye have need of these things. But rather seek ye the kingdom of God; and all these things shall be added unto you.”\n\nIt is unbelievers and wicked men who worry about too many people on the earth, and a shortage of food, and oh my, what will we do? God has given the earth enough food for every one. God does not allow people to starve to death, people allow other people to starve to death by their greed and selfishness. \n\n\n\nThe truth is that top scientists around the world have exposed Global Warming as a fraud, including the founder of the weather channel. Whacko environmentalist groups were created in heathen universities, owned by heathens, and indoctrinated by heathen teachers. As with many other evil conspiracies designed to destroy the sovereignty of nations and enslave humanity, Global Warming was concocted as an excuse to raise taxes, sterilize women, form a Police State, control every facet of our lives, and impose every conceivable evil upon mankind. Global Warming has literally become a religion in these Last Days, which will no doubt be instrumental in the globalist elite's plan to kill off 90% of the population.\n\nFalse prophet and televangelist, Pat Robertson, supports the lying Global Warming scam. Other apostates, including The Salvation Army, Rick Warren and Billy Graham's ChristianityToday (which should be called Apostasy Today), also support the whacko Global Warming scam! The Great Global Warming Swindle . The founder of the weather channel knows what he's talking about when he says that Global Warming is a massive scam.\n\nTragically, 85 apostate Christian leaders met and signed on to join the Global Warming bandwagon. They're all a bunch of cowardly compromisers, who have chosen to go along to get along, selling their souls in exchange for worldly fame and prosperity. They all support of the Global Warming scam. The architects of the New World Order have turned Global Warming into a bizarre religious cult, publishing their own The Green Bible, and recruiting bought-off and compromised ministers and Christian leaders...\n\nIn the following video clip of multi-billionaire Bill Gates giving a speech, he openly admits that vaccines are being used to sterilize women (10-15%).\n\nIn this video clip, God-hater Ted Turner blames overpopulation (alleged overpopulation) for Global Warming. The founder of the weather channel has publicly stated that 'Global Warming is the Greatest Scam in History.' “According to Dr. Richard Lindzen, professor of meteorology at the Massachusetts Institute of Technology, “We are shifting away from science and into the realm of religious fanaticism, where the followers of the creed, brimming with self-righteous fury, believe that they are in possession of a higher truth.” God has given the earth enough food for everyone. God does not allow people to starve to death, people allow other people to starve to death by their greed and selfishness. Proverb 30:14, “There is a generation, whose teeth are as swords, and their jaw teeth as knives, to devour the poor from off the earth, and the needy from among men.” This is exactly what the evil Population Control agenda is all about—devouring the poor from off the earth, and the needy from among men. The global elite are playing God—deciding who lives and who dies, who has a future and who doesn't, who has children and who does not. They have no right to play God. “Climate control is about controlling people, it always has been and always will be.” —climatedepot.com It's bad enough that greedy evil people horde wealth and natural resources for themselves; but to add insult to injury now they want to kill the poor and prevent them from having any children. And those poor people have no clue what is being done to them. They have been forced into a starvation situation by oppression, taxation and government regulation; and now they are being left with no choice but to comply or starve to death. Yet the world's corporations and banks are owned by the wealthiest and most elite people of all, and they are causing this to happen. The United Nations is evil to the core, killing the very people that they claim to be helping. God calls them evil murderers, and promises to punish them in Hell, fire and eternal damnation (Isaiah 13:11).", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "object", "provider": "youtube", "width": "600", "height": "480", "embed_code": "<object width=\"600\" height=\"480\"><param name=\"movie\" value=\"http://www.youtube.com/v/-0gvDkVcFkI?fs=1&amp;hl=en_US\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/-0gvDkVcFkI?fs=1&amp;hl=en_US\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"600\" height=\"480\"/></object>", "src": "http://www.youtube.com/v/-0gvDkVcFkI?fs=1&hl=en_US"}, {"embed_type": "object", "provider": "youtube", "width": "600", "height": "480", "embed_code": "<object width=\"600\" height=\"480\"><param name=\"movie\" value=\"http://www.youtube.com/v/lScMcgvoESo?fs=1&amp;hl=en_US\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/lScMcgvoESo?fs=1&amp;hl=en_US\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"600\" height=\"480\"/></object>", "src": "http://www.youtube.com/v/lScMcgvoESo?fs=1&hl=en_US"}], "links": ["../../Wolves/max_lucado.htm", "../../Evils%20in%20America/CCM/third_day.htm", "../../Evils%20in%20America/CCM/tobymac.htm", "../../Evils%20in%20America/CCM/michael_smith_phony.htm", "http://www.worldvision.org/", "http://www.makeadifferencetour.com/", "http://www.lifesitenews.com/ldn/1999/mar/99030203.html", "gates.htm", "http://www.scribd.com/doc/10059513/Nssm-200Kissinger-Report", "../global_warming.htm", "../../Bible/green_bible.htm", "http://www.wnd.com/news/article.asp?ARTICLE_ID=51379", "../../Wolves/salvation_army_heresy.htm", "../../Wolves/rick_warren2.htm", "../../Wolves/billy_graham-pope.htm", "../../Evils%20in%20America/Apostasy/ct_drama_queen.htm", "http://video.google.com/videoplay?docid=-5576670191369613647", "http://infowars.net/articles/october2007/251007Wildfires.htm", "../../Bible/green_bible.htm", "http://www.wnd.com/news/article.asp?ARTICLE_ID=48866", "http://www.wnd.com/news/article.asp?ARTICLE_ID=51379", "http://www.youtube.com/watch?v=Z_rsVcAnnnw&feature=related", "../global_warming.htm", "http://video.google.com/videoplay?docid=-1656640542976216573&q=global+warming+scam&total=147&start=0&num=10&so=0&type=search&plindex=8", "http://video.google.com/videoplay?docid=-1656640542976216573&q=global+warming+scam&total=147&start=0&num=10&so=0&type=search&plindex=8", "http://video.google.com/videosearch?q=global+warming+scam", "../climate_chaos.htm", "http://www.climatedepot.com/", "../global_warming.htm", "../../Basics/gods_simple_plan.htm", "http://www.Jesus-is-Savior.com"], "authors": [], "publish_date": null}