{"result_id": "181001", "URL": "https://www.joebiden.news/2022-04-05-14-states-cut-off-from-monoclonal-antibodies.html", "timestamp": "2023-04-25 16:08:48 CEST+0200", "meta": {"description": "Slowly but surely, the Biden regime is eliminating access to monoclonal antibody treatments in the United States. The latest reports show that another 14 states are now prohibited from receiving shipments of sotrovimab, which is manufactured by GlaxoSmithKline (GSK) and Vir Biotechnology. A March 30 announcement from the Department of Health and Human Services (HHS) […]", "lang": "en", "keywords": "badhealth,badmedicine,biased,big government,Big Pharma,conspiracy,corruption,COVID,deception,fauci flu,FDA,Joe Biden,medical censorship,Medical Tyranny,molnupiravir,monoclonal antibodies,omicron,paxlovid pill,Pfizer,pharmaceutical fraud,Plandemic,Sotrovimab,traitors", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.joebiden.news/2022-04-05-14-states-cut-off-from-monoclonal-antibodies.html", "encoding": "UTF-8"}, "image": null, "domain": "www.joebiden.news", "title": "Another 14 states have been cut off from monoclonal antibody treatments, compliments of the Biden regime", "cleaned_text": "Another 14 states have been cut off from monoclonal antibody treatments, compliments of the Biden regime\n\nSlowly but surely, the Biden regime is eliminating access to monoclonal antibody treatments in the United States.\n\nThe latest reports show that another 14 states are now prohibited from receiving shipments of sotrovimab, which is manufactured by GlaxoSmithKline (GSK) and Vir Biotechnology.\n\nA March 30 announcement from the Department of Health and Human Services (HHS) indicated that the total number of states that are no longer receiving sotrovimab has reached 22.\n\nThe latest 14 states to get the axe include Alaska, Arizona, California, Hawaii, Idaho, Illinois, Indiana, Michigan, Minnesota, Ohio, Oregon, Nevada, Washington and Wisconsin.\n\nBiden has been on a witch hunt against monoclonal antibodies for several months now, having previously cut off most of the Northeast from receiving shipments in recent weeks.\n\nBoth in 2021 and in January of 2022, the United States government purchased millions of doses of sotrovimab to distribute across the country. The drug was granted emergency use authorization (EUA) during the early days of the plandemic to treat patients with mild-to-moderate Fauci Flu infection.\n\nMonoclonal antibodies compete with Pfizer’s new paxlovid pill, so they’ve got to go\n\nBecause the drug is supposedly not effective against the latest subvariant of omicron (moronic) strain of the Fauci Flu, called BA.2, the Biden regime says that it should no longer be distributed to states.\n\nThe ruling came from the Food and Drug Administration (FDA), which decided that EUA for sotrovimab is now obsolete because the latest subvariant of moronic does not respond to it.\n\nFederal data suggests that BA.2 of moronic is now causing a majority of “cases” in which Americans are testing “positive” using fraudulent PCR tests. Based on this, the government is now pushing more “vaccine boosters” as the solution.\n\nHHS has divided the country into 10 regions, and currently five of them have had their sotrovimab shipments “paused,” reports said. These five regions are also no longer allowed to administer any sotrovimab that they still have in stock.\n\nBesides competing with the so-called “vaccines,” sotrovimab is also getting in the way of Pfizer’s new paxlovid pill, which the drug giant is now marketing as an alternative to monoclonal antibodies.\n\nSince Pfizer appears to call many of the shots when it comes to U.S. government policy, monoclonal antibodies are quickly being canceled from the plandemic lineup of drugs in order to generate more profits for Pfizer.\n\n“GSK and Vir are preparing a package of data in support of a higher dose of sotrovimab for the omicron BA.2 subvariant and will be sharing these data with regulatory and health authorities around the world for discussion,” read a statement issued by the two manufacturers of sotrovimab.\n\nThe COVID-19 Treatment Guidelines Panel has stated that it will no longer recommend monoclonal antibodies in any region of the U.S. because of the FDA’s updates and “the increasing prevalence of the BA.2 subvariant across all regions.”\n\nInstead, the panel, which was assembled by the National Institutes of Health (NIH) under Francis Collins and Tony Fauci, will now recommend paxlovid from Pfizer and remdesivir from Gilead Sciences.\n\nThe panel will also recommend Merck’s new ivermectin rip-off drug molnupiravir in situations where neither of the other two drugs are available.\n\nIn other words, Pfizer has a whole lot of paxlovid to sell, and so does Merck with molnupiravir, so monoclonal antibodies have got to go. Just another day in the land of Big Pharma fascism, eh?\n\n“Is this because Ol’ Dementia Joe’s paper sacks from Pfizer stopped due to him not holding up his end of the bargain?” asked a commenter at the Epoch Times about these latest developments.\n\nThe latest Fauci Flu news can be found at Pandemic.news.", "opengraph": {"title": "Another 14 states have been cut off from monoclonal antibody treatments, compliments of the Biden regime", "type": "article", "url": "https://www.joebiden.news/2022-04-05-14-states-cut-off-from-monoclonal-antibodies.html", "site_name": "Joe Biden News", "description": "Slowly but surely, the Biden regime is eliminating access to monoclonal antibody treatments in the United States. The latest reports show that another 14 states are now prohibited from receiving shipments of sotrovimab, which is manufactured by GlaxoSmithKline (GSK) and Vir Biotechnology. A March 30 announcement from the Department of Health and Human Services (HHS) […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/04/Joe-Biden-Mask.jpg"}, "tags": ["conspiracy", "big government", "Big Pharma", "molnupiravir", "FDA", "COVID", "deception", "Pfizer", "corruption", "biased", "fauci flu", "paxlovid pill", "Sotrovimab", "Joe Biden", "medical censorship", "monoclonal antibodies", "Medical Tyranny", "omicron", "traitors", "Plandemic", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/biden-admin-cuts-off-14-more-states-from-covid-19-treatment-as-ba-2-variant-spreads_4380974.html", "https://naturalnews.com/2022-01-26-biden-cuts-off-monoclonal-antibodies-only-vaccines.html", "http://pandemic.news", "https://www.theepochtimes.com/biden-admin-cuts-off-14-more-states-from-covid-19-treatment-as-ba-2-variant-spreads_4380974.html", "https://naturalnews.com/2022-01-26-biden-cuts-off-monoclonal-antibodies-only-vaccines.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2022-04-05-14-states-cut-off-from-monoclonal-antibodies.html&linkname=Another%2014%20states%20have%20been%20cut%20off%20from%20monoclonal%20antibody%20treatments%2C%20compliments%20of%20the%20Biden%20regime", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}