{"result_id": "181012", "URL": "https://joebiden.news/2022-08-02-globalists-setting-world-up-vax-end-game.html", "timestamp": "2023-04-25 16:08:51 CEST+0200", "meta": {"description": "While double-vaxxed and double-boosted Joe Biden has tested positive for COVID once again, the latest proof to Americans that the vax never worked to prevent COVID and the latest evidence to the so-called ‘anti-vaxxers‘ that their judgement in not taking the hastily created shot was correct, if only Dr. Anthony Fauci had listened to his own words […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,conspiracy,Dangerous Medicine,end game,Fauci,globalists,Joe Biden,lies,pharmaceutical fraud,propaganda,science deception,science fraud,vaccine,vaccine damage,Vaccine deaths,vaccine injury", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2022-08-02-globalists-setting-world-up-vax-end-game.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "Absolute proof globalists knew it could ‘take years for all hell to break loose’ following release of a ‘new vaccine’, setting world up for death and depopulation", "cleaned_text": "Absolute proof globalists knew it could ‘take years for all hell to break loose’ following release of a ‘new vaccine’, setting world up for death and depopulation\n\nWhile double-vaxxed and double-boosted Joe Biden has tested positive for COVID once again, the latest proof to Americans that the vax never worked to prevent COVID and the latest evidence to the so-called ‘anti-vaxxers‘ that their judgement in not taking the hastily created shot was correct, if only Dr. Anthony Fauci had listened to his own words from back in February of 1999.\n\nWith Fauci speaking in the video we’ve embedded directly below during the entire AIDS mess, as the announcer to the brief video leads off before Fauci enters, “Many scientists are beginning to believe that a vaccine against AIDS may be impossible to make and too dangerous to test.”\n\nFauci then enters, claiming the following words of advice he and other so-called ‘experts‘ definitely should have paid attention to over the past couple of years but must have, conveniently, ‘forgotten‘.\n\n“If you take it and then a year goes by and everybody’s fine then you say okay, that’s good, now let’s give it to 500 people. And then a year goes by and everything’s fine, say, well now let’s give it to thousands of people. And then you find out that it takes 12 years for all hell to break loose and then what have you done.”\n\nProving to us that way back then in 1999, more than 23 years ago now, that he fully understood that sometimes, it takes 10 or more years for the ‘end game‘ of such ‘vaccines‘ to come out, then why were he, Biden and the globalists in such a mad rush to get people to take a new vax in the modern era, when he fully understood back then it might take ‘12 years for all hell to break loose?‘\n\nThat very brief video before we continue.\n\nAnd as this American Greatness story reports, with Biden originally testing positive for COVID on July 21st, that positive diagnosis came on the 1-year-anniversary of Biden falsely claiming the vaccinated couldn’t get COVID.\n\nJust the latest reason why the American people don’t trust our government or top institutions as far as we could throw them as seen in this Gallup poll showing Americans trust in government now at an all time low, did ‘science‘ change so much between Fauci claiming in 1999 that we won’t know the end results of vaccines for over a decade and now, when newly concocted vaxxes are being rolled out for seemingly every new variant as if our lives depended upon it, with the full approval of Fauci and the medical establishment?\n\nCertainly with quadruple vaxxed Biden joining quadruple vaxxed Fauci in ‘catching COVID‘ despite the vaxxes just more proof to everyone paying attention that we’ve been lied to by our public servants every step of the way, why would the long term vaccine trials that Fauci referred to back in 1999 be totally ignored in our present day unless something incredibly sinister was at play?\n\nAs Wayne Allen Root warns in this July 28th story titled “My List of Studies & Government Data from Around World Proving the Covid Vaccine is Dangerous and Deadly, and the Worst Heathcare Disaster in World History,” if you believe what Biden and Fauci have said about the vax, you’re a braindead sheep. From that story.:\n\nFirst, I wrote a column about my own personal Covid vaccine death and disease cluster. I wrote about my wedding November 21, 2021 to the beautiful Cindy Parker Root. We’re still in our honeymoon year- that was only eight months ago. But a strange and tragic thing has happened since that date. 33 people that my bride Cindy and I know have either died suddenly, or suffered severe disabling health issues.\n\n33. That is a remarkable number. That is an unimaginable number. That is an impossible number. That is a one-in-a-billion number.\n\nEven more remarkable, I did my research and found out all 33 were vaccinated. Yet since that same date eight months ago, not one person I know who is unvaccinated has either died or gotten seriously ill. Quite a case study. Quite a damning cluster of death and disease for one group- the vaccinated.\n\nI hate to be harsh, but if you see that story and don’t believe something is very wrong…don’t suspect the Covid vaccine is a killer…don’t demand an investigation…don’t demand questions be asked…or still trust anything the government, Biden, Dr. Fauci, the FDA, CDC or your own doctor says about the Covid vaccine…you’re a brain-dead sheep.", "opengraph": {"title": "Absolute proof globalists knew it could ‘take years for all hell to break loose’ following release of a ‘new vaccine’, setting world up for death and depopulation", "type": "article", "url": "https://www.joebiden.news/2022-08-02-globalists-setting-world-up-vax-end-game.html", "site_name": "Joe Biden News", "description": "While double-vaxxed and double-boosted Joe Biden has tested positive for COVID once again, the latest proof to Americans that the vax never worked to prevent COVID and the latest evidence to the so-called ‘anti-vaxxers‘ that their judgement in not taking the hastily created shot was correct, if only Dr. Anthony Fauci had listened to his own words […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/08/Fauci-Committee-Hearing-Coronavirus.jpg"}, "tags": ["conspiracy", "end game", "Joe Biden", "Big Pharma", "science deception", "Vaccine deaths", "globalists", "Fauci", "vaccine", "science fraud", "vaccine injury", "vaccine damage", "lies", "propaganda", "pharmaceutical fraud"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/MjVVw841eUo\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/MjVVw841eUo"}], "links": ["https://amgreatness.com/2022/07/21/quadruple-vaxxed-joe-biden-tests-positive-for-covid-19-on-1-year-anniversary-of-false-claim-that-vaccinated-cant-get-covid/", "https://allnewspipeline.com/They_Knew_It_Could_Take_Years_For_All_Hell_To_Break_Loose.php", "https://amgreatness.com/2022/07/21/quadruple-vaxxed-joe-biden-tests-positive-for-covid-19-on-1-year-anniversary-of-false-claim-that-vaccinated-cant-get-covid/", "https://news.gallup.com/poll/394283/confidence-institutions-down-average-new-low.aspx", "https://rootforamerica.com/covid-vaccine-dangerous-and-deadly/", "https://allnewspipeline.com/They_Knew_It_Could_Take_Years_For_All_Hell_To_Break_Loose.php", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2022-08-02-globalists-setting-world-up-vax-end-game.html&linkname=Absolute%20proof%20globalists%20knew%20it%20could%20%E2%80%98take%20years%20for%20all%20hell%20to%20break%20loose%E2%80%99%20following%20release%20of%20a%20%E2%80%98new%20vaccine%E2%80%99%2C%20setting%20world%20up%20for%20death%20and%20depopulation", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}