{"result_id": "181034", "URL": "https://joebiden.news/2021-08-12-white-house-covid-mask-mandate-federal-buildings.html", "timestamp": "2023-04-25 16:08:56 CEST+0200", "meta": {"description": "The White House has reinstated its Wuhan coronavirus (COVID-19) mask mandate for people inside federal buildings. The administration of President Joe Biden announced that it will bring back its mask mandate for people inside federal buildings after the Centers for Disease Control and Prevention (CDC) issued its latest guidance regarding masking on July 27. The CDC’s announcement strongly […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,congress,coronavirus,covid-19,face masks,health freedom,House of Representatives,Joe Biden,mask mandate,Medical Tyranny,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2021-08-12-white-house-covid-mask-mandate-federal-buildings.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "White House reinstitutes COVID-19 mask mandate for federal buildings, even for “fully vaccinated” people", "cleaned_text": "White House reinstitutes COVID-19 mask mandate for federal buildings, even for “fully vaccinated” people\n\nThe White House has reinstated its Wuhan coronavirus (COVID-19) mask mandate for people inside federal buildings.\n\nThe administration of President Joe Biden announced that it will bring back its mask mandate for people inside federal buildings after the Centers for Disease Control and Prevention (CDC) issued its latest guidance regarding masking on July 27.\n\nThe CDC’s announcement strongly recommended that vaccinated people wear masks indoors in areas with substantial or high rates of COVID-19 community transmission. (Related: White House considering nationwide mask mandate as post-vaccine coronavirus spike grips nation.)\n\nIn an email sent to all federal agencies late on Tuesday, Office of Management and Budget Deputy Director for Management Jason Miller said the federal government is abiding by the CDC’s recommendations.\n\nMiller said in his email that, in line with the CDC guidance, “in areas of substantial or high community transmission, agencies must require all federal employees, onsite contractors and visitors, regardless of vaccination status, to wear a mask inside of federal buildings. As of today, that includes the Washington, D.C. area.”\n\nThe deputy director added that people who are not fully vaccinated must segregate themselves by remaining “physically distant.” He justified this by saying it is the only way the White House can properly abide by CDC guidelines.\n\nThe White House’s announcement comes just two months after the administration of President Joe Biden rolled back its mask mandate for vaccinated White House employees and visitors.\n\nWhite House and public health officials are justifying the mask mandate by saying that it is necessary due to the spread of the post-vaccine delta variant of the coronavirus.\n\nBiden himself has described the CDC’s latest masking guidelines and his mask mandate as “another step on our journey to defeating this virus.”\n\nMultiple departments have already announced that they are following Biden’s orders and instituting mask mandates, including the departments of Defense, Homeland Security, Veterans Affairs, Energy and Interior.\n\nThe White House Correspondents’ Association, the main group representing journalists covering the White House and the president, also reimposed its masking requirements for all members while in indoor spaces of the White House.\n\nAttending Physician of the United States Congress Dr. Brian Monahan announced late on Tuesday after the CDC’s guidelines that the House of Representatives is reinstating its mask mandate.\n\n“For the Congress, representing a collection of individuals traveling weekly from various risk areas (both high and low rates of disease transmission), all individuals should wear a well-fitted, medical-grade filtration mask (for example an ear loop surgical mask or a KN95 mask) when they are in an interior space,” wrote Monahan in a letter sent to congressional staffers.\n\nThe “interior spaces” Monahan referred to included the House chamber, committee meeting chambers and every single office building of the House of Representatives.\n\nMonahan said the only exception to this rule is for people in the House chamber who are actively speaking, seeking recognition from a chair at a committee hearing or those who are alone in a room.\n\n“To be clear, for meetings in an enclosed U.S. House of Representatives controlled space, masks are REQUIRED,” wrote Monahan. “Failure to wear a mask in the Hall of the House is subject to fines imposed for violation as contained in the previous House rule.”\n\nMuch like the CDC, Monahan attempted to argue that the mask mandate was necessary due to the spread of the post-vaccine delta variant and the COVID-19 surge it has caused.\n\nMonahan also added that fully vaccinated individuals can still get infected with the delta variant.\n\n“There is still a possibility a fully vaccinated individual could acquire infection in their nose and throat … or the ability to transmit the coronavirus infection to others,” he wrote.\n\nLearn more about the unfortunate return of the unscientific mask mandates by reading the latest articles at Pandemic.news.", "opengraph": {"title": "White House reinstitutes COVID-19 mask mandate for federal buildings, even for “fully vaccinated” people", "type": "article", "url": "https://www.joebiden.news/2021-08-12-white-house-covid-mask-mandate-federal-buildings.html", "site_name": "Joe Biden News", "description": "The White House has reinstated its Wuhan coronavirus (COVID-19) mask mandate for people inside federal buildings. The administration of President Joe Biden announced that it will bring back its mask mandate for people inside federal buildings after the Centers for Disease Control and Prevention (CDC) issued its latest guidance regarding masking on July 27. The CDC’s announcement strongly […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2021/08/Joe-Biden-Mask.jpg"}, "tags": ["Joe Biden", "big government", "covid-19", "mask mandate", "White House", "congress", "House of Representatives", "Medical Tyranny", "coronavirus", "face masks", "health freedom"], "tweets": [], "movies": [], "links": ["https://news.yahoo.com/masks-masks-off-masks-again-150227895.html", "https://www.reuters.com/world/us/us-homeland-security-department-imposes-employee-mask-mandate-2021-07-28/", "https://www.naturalnews.com/2021-07-27-white-house-considering-pushing-mask-mandate-as-post-vaccine-coronavirus-spike-grips-nation.html", "https://www.axios.com/white-house-reimposes-mask-mandate-2378a946-cb95-419c-af73-ea320ce99a7f.html", "https://www.foxnews.com/politics/house-mask-mandate-fines-return-capitol-hill", "https://pandemic.news/", "https://news.yahoo.com/masks-masks-off-masks-again-150227895.html", "https://www.reuters.com/world/us/us-homeland-security-department-imposes-employee-mask-mandate-2021-07-28/", "https://www.axios.com/white-house-reimposes-mask-mandate-2378a946-cb95-419c-af73-ea320ce99a7f.html", "https://www.foxnews.com/politics/house-mask-mandate-fines-return-capitol-hill"], "authors": [], "publish_date": null}