{"result_id": "181029", "URL": "https://joebiden.news/2020-11-10-fact-big-media-big-tech-stole-2020-election.html", "timestamp": "2023-04-25 16:08:55 CEST+0200", "meta": {"description": "A new post-election poll from the Media Research Center, conducted by McLaughlin & Associates, shows 36 percent of Biden voters were NOT aware of the evidence linking Joe Biden to corrupt financial dealings with China through his son Hunter. Thirteen percent of these voters (or 4.6% of Biden’s total vote) say that had they known […]", "lang": "en", "keywords": "2020 elections,banned,Biden,Big Tech,Censorship,conspiracy,corporate media,democrats,elections,Facebook,fascism,Google,left cult,mainstream media,manipulation,rigged,speech police,tech giants,thought control,Trump,Twisted,Twitter", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2020-11-10-fact-big-media-big-tech-stole-2020-election.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "FACT: Big media and Big Tech stole the 2020 election", "cleaned_text": "A new post-election poll from the Media Research Center, conducted by McLaughlin & Associates, shows 36 percent of Biden voters were NOT aware of the evidence linking Joe Biden to corrupt financial dealings with China through his son Hunter. Thirteen percent of these voters (or 4.6% of Biden’s total vote) say that had they known these facts, they would not have voted for the former Vice President.\n\nSuch a shift away from Biden would have meant President Trump would have won the election with 289 electoral votes. (Details below.)\n\n“It is an indisputable fact that the media stole the election. The American electorate was intentionally kept in the dark. During the height of the scandal surrounding Hunter Biden’s foreign dealings, the media and the big tech companies did everything in their power to cover it up. Twitter and Facebook limited sharing of the New York Post’s reports, and the liberal media omitted it from their coverage or dismissed it as Russian disinformation. “Now we know the impact of that cover-up. 4.6% of Biden voters say they would not have voted for him had they been aware of evidence of this scandal. This story would have potentially changed the outcome of this election. The media and Silicon Valley were fully aware of this, so they actively tried to prevent it from reaching the American public. The American people deserved to know the truth; now it’s too late.”\n\nThe nationwide survey of 1,000 actual voters (including early voters) was conducted November 2-3. (PDF) Voters were asked about the bombshell reporting from the New York Post: “At the time you cast your vote for President, were you aware that evidence exists in emails, texts, eyewitness testimony and banking transactions that the FBI has been investigating since last year directly linking Joe Biden to a corrupt financial arrangement between a Chinese company with connections to the Chinese communist party and Hunter Biden’s business, which may have personally benefitted Joe Biden financially?”\n\nWhile 73% of respondents said they had heard about these allegations, 27% had not — including 36% of Biden voters. Those Biden voters were then asked: “If you had been aware of this actual evidence in emails, texts, testimony and banking transactions being investigated by the FBI, would you have…” The voters were then given several options: still voted for Joe Biden (86.9%), voted for a third party candidate (5.6%), not voted for any presidential candidate (4.7%), not voted at all (1.7%) or switched their vote to Donald Trump (1.1%).\n\nThe net effect: 13.1% of these voters (4.6% of Biden’s overall vote) say they would not have voted for Biden if they had been properly informed. Applying this to the most closely-contested states, Arizona, Georgia, North Carolina, Pennsylvania and Wisconsin would today all be in the Trump column, giving the President 289 electoral college votes and a second term. (This also assumes Alaska, where the current margins are not close, is also called for the President).\n\nThis national survey of 1,000 general election voters who voted in the 2020 election was conducted on November 2-3, 2020.\n\nAll interviews were conducted online; survey invitations were distributed randomly within predetermined geographic units. These units were structured to correlate with actual voter turnout in the general election.\n\nThis poll of 1,000 general election voters has an accuracy of +/- 3.1% at a 95% confidence interval. The accuracy of the responses from the 501 Biden voters is +/- 4.4% at a 95% confidence interval.", "opengraph": {"title": "FACT: Big media and Big Tech stole the 2020 election", "type": "article", "url": "https://www.joebiden.news/2020-11-10-fact-big-media-big-tech-stole-2020-election.html", "site_name": "Joe Biden News", "description": "A new post-election poll from the Media Research Center, conducted by McLaughlin & Associates, shows 36 percent of Biden voters were NOT aware of the evidence linking Joe Biden to corrupt financial dealings with China through his son Hunter. Thirteen percent of these voters (or 4.6% of Biden’s total vote) say that had they known […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2020/11/Trump-vs-Big-Tech-Facebook-Twitter-Google.jpg"}, "tags": ["Google", "conspiracy", "manipulation", "elections", "speech police", "left cult", "Twitter", "2020 elections", "Biden", "Trump", "banned", "Big Tech", "corporate media", "tech giants", "mainstream media", "Facebook", "fascism", "rigged", "Censorship", "thought control", "Twisted", "democrats"], "tweets": [], "movies": [], "links": ["https://newsbusters.org/blogs/nb/nb-staff/2020/11/09/fact-big-media-and-big-tech-stole-2020-election", "https://www.newsbusters.org/blogs/techwatch/alexander-hall/2020/10/14/twitter-disables-links-bombshell-new-york-post-report", "https://twitter.com/andymstone/status/1316423671314026496", "https://www.newsbusters.org/blogs/nb/geoffrey-dickens/2020/10/27/still-hidin-hunter-nets-spend-meager-21-minutes-out-113-hours", "https://www.newsbusters.org/blogs/nb/bill-dagostino/2020/10/26/video-tv-journalists-flat-out-lying-about-hunter-bidens-laptop", "https://mclaughlinonline.com/2020/11/05/ma-2020-national-post-election-poll/", "https://mclaughlinonline.com/pols/wp-content/uploads/2020/11/MA-National-Post-Elect-11-4-20-4.pdf", "https://nypost.com/2020/10/14/email-reveals-how-hunter-biden-introduced-ukrainian-biz-man-to-dad/", "https://mclaughlinonline.com/2020/11/05/ma-2020-national-post-election-poll/", "https://newsbusters.org/blogs/nb/nb-staff/2020/11/09/fact-big-media-and-big-tech-stole-2020-election", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2020-11-10-fact-big-media-big-tech-stole-2020-election.html&linkname=FACT%3A%20Big%20media%20and%20Big%20Tech%20stole%20the%202020%20election", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}