{"result_id": "181027", "URL": "https://www.joebiden.news/2022-10-26-paxlovid-antiviral-drug-linked-to-blood-clots.html", "timestamp": "2023-04-25 16:08:55 CEST+0200", "meta": {"description": "Pfizer’s Paxlovid antiviral medication, which is meant to treat Wuhan coronavirus (COVID-19) infections, has been linked to cases of blood clots. The Food and Drug Administration (FDA) first authorized Paxlovid, a combination of the two antiviral medications nirmatrelvir and ritonavir in December 2021. But these two drugs have significant risks of their own, with ritonavir […]", "lang": "en", "keywords": "antiviral,badhealth,badmedicine,Big Pharma,Blood clots,cardiovascular drugs,covid-19,Dangerous Medicine,nirmatrelvir,pandemic,paxlovid,Pfizer,pharmaceutical fraud,ritonavir,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.joebiden.news/2022-10-26-paxlovid-antiviral-drug-linked-to-blood-clots.html", "encoding": "UTF-8"}, "image": null, "domain": "www.joebiden.news", "title": "Pfizer’s Paxlovid antiviral drug for COVID-19 linked to blood clots", "cleaned_text": "Pfizer’s Paxlovid antiviral medication, which is meant to treat Wuhan coronavirus (COVID-19) infections, has been linked to cases of blood clots. The Food and Drug Administration (FDA) first authorized Paxlovid, a combination of the two antiviral medications nirmatrelvir and ritonavir in December 2021.\n\nBut these two drugs have significant risks of their own, with ritonavir alone potentially causing serious, life-threatening side effects such as inflammation of the pancreas (pancreatitis), heart rhythm problems, severe skin rash, allergic reactions and liver problems. Ritonavir may also reduce the effectiveness of oral hormonal contraceptives. Furthermore, animal studies on the antiviral drug also suggested that it could elevate the risk of cancer at high doses.\n\nStill, the orally-taken Paxlovid was permitted “for the treatment of mild to moderate COVID-19 in adult and pediatric patients aged 12 years and older weighing at least 40 kg, with a positive SARS-CoV-2 test [and] who are at high risk for progressing to severe COVID-19.”\n\nBut a study published October 2022 in the Journal of the American College of Cardiology revealed another risk. It warned that the use of Paxlovid “with medications commonly used to manage cardiovascular conditions can potentially cause significant drug-drug interactions and may lead to severe adverse effects.”\n\nMoreover, the Daily Mail showed other potential risks when Paxlovid is taken with other drugs for cardiovascular conditions, citing papers from U.S. institutions.\n\n“Paxlovid can cause serious health problems when coupled with common heart disease medications. The COVID-19 drug can increase the risk of developing blood clots when taken with blood thinners. It can also cause an irregular heartbeat when combined with drugs for heart pain and, when taken alongside statins [to address blood cholesterol levels], can be toxic to the liver,” the outlet reported.\n\nIncidentally, Paxlovid is not the first COVID-19 product from the New York-based drug firm linked to blood clots. Its COVID-19 vaccine, developed in partnership with German company BioNTech, was also linked to these clots. (Related: Israeli study links Pfizer vaccine to deadly blood disease that causes blood clots.)\n\nDr. Dan Barouch of the Beth Israel Deaconess Medical Center in Boston explained: “Ritonavir is a nonspecific drug that inhibits metabolism and increases the dose of the other drug [nirmatrelvir]. But the ritonavir in Paxlovid also can inhibit the metabolism of other drugs.”\n\n“You have to be really careful when you prescribe Paxlovid for people who are on certain blood thinners, cardiac medications, statins and other drugs. So it’s not just a free pass.”\n\nOne clear case of Barouch’s example was President Joe Biden himself, who contracted COVID-19 in July and took a course of Paxlovid to address his infection.\n\nThe 79-year-old leader had been taking a statin and a drug to prevent stroke prior to contracting the pathogen. Given this, White House Chief Physician Dr. Kevin O’Connor temporarily stopped Biden from taking the two drugs while the latter was taking Paxlovid.\n\nBiden also fell victim to the most notable risk linked to Paxlovid – the so-called “rebound infection.”\n\nAn Aug. 2 memorandum by O’Connor said Biden experienced a rebound infection on July 30 – prompting a return to isolation. O’Connor also noted that Biden’s antigen test on the morning of Aug. 2 returned a positive result.\n\n“[Biden] continues to feel well, though he is experiencing a bit of a return of a loose cough,” he wrote. Following the rebound infection, the White House chief physician did not recommend another round of Paxlovid treatment to the president.\n\nDangerousMedicine.com has more stories about the risks linked to Pfizer’s antiviral drug Paxlovid.\n\nWatch Jefferey Jaxen and Del Bigtree discuss Paxlovid’s risks when taken with cardiovascular drugs on “The HighWire.”\n\nThis video is from the Scriptural Scrutiny channel on Brighteon.com.\n\nFDA admits Pfizer antiviral oral drug paxlovid causes life-threatening reactions when taken with common medicines.\n\nPfizer’s new Paxlovid antiviral drug being pushed in place of ivermectin is linked to “severe adverse effects.”\n\nPfizer CEO expects more people will need COVID pills in future, essentially admitting vaccines don’t work.\n\nScientists warn that mRNA vaccines developed by Pfizer and Moderna are causing BLOOD CLOTS.\n\nBiden still promoting Paxlovid despite the drug causing his rebound COVID-19 infection.", "opengraph": {"title": "Pfizer’s Paxlovid antiviral drug for COVID-19 linked to blood clots", "type": "article", "url": "https://www.joebiden.news/2022-10-26-paxlovid-antiviral-drug-linked-to-blood-clots.html", "site_name": "Joe Biden News", "description": "Pfizer’s Paxlovid antiviral medication, which is meant to treat Wuhan coronavirus (COVID-19) infections, has been linked to cases of blood clots. The Food and Drug Administration (FDA) first authorized Paxlovid, a combination of the two antiviral medications nirmatrelvir and ritonavir in December 2021. But these two drugs have significant risks of their own, with ritonavir […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/10/Combination-Prescription-Diabetes-Drugs.jpg"}, "tags": ["nirmatrelvir", "pandemic", "cardiovascular drugs", "covid-19", "paxlovid", "Big Pharma", "antiviral", "Blood clots", "Pfizer", "ritonavir", "Wuhan coronavirus", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/the-gift-that-keeps-on-giving-pfizers-paxlovid-pill-linked-to-deadly-blood-clots.html", "https://www.jacc.org/doi/full/10.1016/j.jacc.2022.08.800", "https://www.dailymail.co.uk/health/article-11307139/PAxlovid-Pfizers-Covid-drug-cause-deadly-blood-clots-study-warns.html", "https://naturalnews.com/2021-06-28-israeli-study-pfizer-vaccine-blood-disease-clots.html", "https://www.whitehouse.gov/wp-content/uploads/2022/08/Update-8.2.pdf", "https://dangerousmedicine.com/", "https://www.brighteon.com/bfb5ef17-c2c6-469c-a818-a23ceec2c09e", "https://www.brighteon.com/channels/robbjerk", "https://fda.news/2022-01-03-pfizer-paxlovid-can-cause-life-threatening-reactions.html", "https://dangerousmedicine.com/2022-10-17-pfizer-paxlovid-dangerous-ivermectin-knockoff-severe-effects.html", "https://pandemic.news/2022-02-13-pfizer-essentially-admits-vaccines-do-not-work.html", "https://vaccinedamage.news/2021-05-07-mrna-vaccines-by-pfizer-moderna-blood-clots.html", "https://joebiden.news/2022-08-10-biden-promoting-paxlovid-despite-causing-rebound-infection.html", "https://www.naturalhealth365.com/the-gift-that-keeps-on-giving-pfizers-paxlovid-pill-linked-to-deadly-blood-clots.html", "https://www.jacc.org/doi/full/10.1016/j.jacc.2022.08.800", "https://www.dailymail.co.uk/health/article-11307139/PAxlovid-Pfizers-Covid-drug-cause-deadly-blood-clots-study-warns.html", "https://www.whitehouse.gov/wp-content/uploads/2022/08/Update-8.2.pdf", "https://www.brighteon.com/bfb5ef17-c2c6-469c-a818-a23ceec2c09e", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2022-10-26-paxlovid-antiviral-drug-linked-to-blood-clots.html&linkname=Pfizer%E2%80%99s%20Paxlovid%20antiviral%20drug%20for%20COVID-19%20linked%20to%20blood%20clots", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}