{"result_id": "181016", "URL": "https://www.joebiden.news/2022-05-09-military-vaccine-injuries-threaten-national-security.html", "timestamp": "2023-04-25 16:08:52 CEST+0200", "meta": {"description": "U.S. military personnel continue to die unexpectedly in the wake of COVID-19 vaccine mandates, although most people aren’t hearing about it as the media avoids drawing attention to the problem. For many young men and women in the military who have died under unusual circumstances recently, the cause of death is being listed as “pending.” […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,Dangerous Medicine,health freedom,medical fascism,Medical Tyranny,national security,pharmaceutical fraud,US military,vaccine damage,Vaccine deaths,vaccine injury,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.joebiden.news/2022-05-09-military-vaccine-injuries-threaten-national-security.html", "encoding": "UTF-8"}, "image": null, "domain": "www.joebiden.news", "title": "Vaccine mandates, military vaccine injuries continue to threaten national security by killing our soldiers", "cleaned_text": "Vaccine mandates, military vaccine injuries continue to threaten national security by killing our soldiers\n\nU.S. military personnel continue to die unexpectedly in the wake of COVID-19 vaccine mandates, although most people aren’t hearing about it as the media avoids drawing attention to the problem.\n\nFor many young men and women in the military who have died under unusual circumstances recently, the cause of death is being listed as “pending.” However, some inside the military have pointed to vaccine injuries and death as being far more common than we’ve been led to believe.\n\nFor example, a military medical officer, Dr. Theresa Long, recently testified in court that she was ordered by her superior to suppress vaccine injuries. She and two other medical professionals said that they noticed a spike in neurological disorders, miscarriages and cancer cases shortly after the vaccine mandate was put in place, but they say they were told to keep quiet about it.\n\nDr. Long said: “I have so many soldiers being destroyed by this vaccine. Not a single member of my senior command has discussed my concerns with me … I have nothing to gain and everything to lose by talking about it. I’m okay with that because I am watching people get absolutely destroyed.”\n\nA group of more than two dozen military members recently presented a case in court fighting the military vaccine mandate. The judge who heard their case, Steven Merryday, granted a preliminary injunction to two of the plaintiffs, allowing them to avoid the mandate for now. Mat Staver of Liberty Counsel, who is representing the group, said that the Department of Defense has refused to send witnesses for cross examination, which is something that could indicate a cover-up is taking place.\n\nAccording to reports, just two out of more than 3,000 Marines who have requested a religious exemption have been granted one. The military is not being very forthcoming about this low acceptance rate, with Captain Andrew Wood stating that they can’t discuss the specifics of the requests “due to privacy considerations.” Hundreds of marines have already been discharged over their refusal to get the jab.\n\nMeanwhile, Senator Ron Johnson has been pressing Secretary of Defense Lloyd Austin on the matter. In February, he sent a letter citing “dramatic increases in medical diagnoses among military personnel” and evidence that diagnoses of myocarditis among servicemembers have been removed from official databases.\n\nMilitary members are being hazed, shamed and punished\n\nMeanwhile, military whistleblowers have drawn attention to abuses against military members who refuse to get the jab. Some of the problems that have been identified include shaming, hazing, physical punishment and denying treatment for other medical problems. They have also described a “shadow process of coercion” that is being used to cover up serious vaccine injuries and fatalities.\n\nService members who request exemptions are being publicly humiliated, assigned extra duty and being threatened with dishonorable discharge. Those who dare to speak out about what is going on are facing discipline that could being their military careers to an end.\n\nThe problem is getting so bad that some experts fear it is putting our national security at risk. At a time when Russia continues to attack Ukraine, our Air Force is pushing out highly trained fighter pilots who cannot be easily replaced as a punishment for asking for vaccine exemptions. This is leaving our military without thousands of hours of valuable combat flight experience that is highly challenging to obtain. Meanwhile, those who do get the jab are putting public safety at risk by flying planes without being monitored for markers of cardiac arrest and heart damage.\n\nHow much weaker will our military become as service members continue to be forced to get vaccines or discharged for refusing to comply?", "opengraph": {"title": "Vaccine mandates, military vaccine injuries continue to threaten national security by killing our soldiers", "type": "article", "url": "https://www.joebiden.news/2022-05-09-military-vaccine-injuries-threaten-national-security.html", "site_name": "Joe Biden News", "description": "U.S. military personnel continue to die unexpectedly in the wake of COVID-19 vaccine mandates, although most people aren’t hearing about it as the media avoids drawing attention to the problem. For many young men and women in the military who have died under unusual circumstances recently, the cause of death is being listed as “pending.” […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/05/Coffin-American-Flag-Military-Soldier.jpg"}, "tags": ["big government", "medical fascism", "vaccine wars", "Big Pharma", "national security", "Vaccine deaths", "vaccine injury", "vaccine mandate", "Medical Tyranny", "vaccines", "vaccine damage", "health freedom", "US military", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://thecovidblog.com/2022/05/03/u-s-military-personnel-continue-dying-suddenly-and-unexpectedly-as-mainstream-media-deflect-most-attention-to-suicide/", "https://bigleaguepolitics.com/military-doctor-attests-she-was-ordered-to-cover-up-wave-of-injuries-following-covid-19-vaccine-regime/", "https://rairfoundation.com/cover-up-dod-silent-after-whistleblowers-expose-covid-vaccine-injuries-in-military/", "http://nationalsecurity.news", "https://healthfreedom.news/", "https://thecovidblog.com/2022/05/03/u-s-military-personnel-continue-dying-suddenly-and-unexpectedly-as-mainstream-media-deflect-most-attention-to-suicide/", "https://bigleaguepolitics.com/military-doctor-attests-she-was-ordered-to-cover-up-wave-of-injuries-following-covid-19-vaccine-regime/", "https://rairfoundation.com/cover-up-dod-silent-after-whistleblowers-expose-covid-vaccine-injuries-in-military/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2022-05-09-military-vaccine-injuries-threaten-national-security.html&linkname=Vaccine%20mandates%2C%20military%20vaccine%20injuries%20continue%20to%20threaten%20national%20security%20by%20killing%20our%20soldiers", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}