{"result_id": "181009", "URL": "https://joebiden.news/2021-06-30-biden-administration-does-not-value-free-speech.html", "timestamp": "2023-04-25 16:08:50 CEST+0200", "meta": {"description": "The seizure of journalistic websites by the Biden administration just proved that the current leadership in the U.S. does not value free speech. Leaders of the country have become enablers of censorship. An article from SHTFplan.com said: “With obvious censorship of those who dissent and research and use their own critical thinking and discernment to […]", "lang": "en", "keywords": "Biden administration,big government,Censorship,constitution,disinformation,Ebrahim Raisi,free speech,freedom of speech,heinous crimes,Houthi militia,hypocrisy,JCPOA,Joe Biden,Kataib Hezbollah,tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2021-06-30-biden-administration-does-not-value-free-speech.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "The Biden administration does not value free speech… government seizures of websites has begun", "cleaned_text": "The Biden administration does not value free speech… government seizures of websites has begun\n\nThe seizure of journalistic websites by the Biden administration just proved that the current leadership in the U.S. does not value free speech.\n\nLeaders of the country have become enablers of censorship. An article from SHTFplan.com said: “With obvious censorship of those who dissent and research and use their own critical thinking and discernment to come to their own conclusions, it has become blatant that there is no such thing as a Constitution that will ‘protect’ the rights of anyone.”\n\nOn July 22, the Department of Justice (DOJ) said that it seized the domains of 36 websites for violating U.S. sanctions. The Biden administration claimed many of the websites were associated with either disinformation activities or violent organizations. (Related: Joe Biden wants to massively increase online censorship.)\n\n“Today, pursuant to court orders, the United States seized 33 websites used by the Iranian Islamic Radio and Television Union (IRTVU) and three websites operated by Kata’ib Hizballah also known as Kataib Hezbollah (KH), in violation of U.S. sanctions,” the department said in a statement.\n\nKH is one of the main Iraqi militia groups aligned with Iran and has been designated a foreign terrorist organization by the U.S.\n\nThe DOJ said the 33 domains used by IRTVU are owned by a U.S. company and that IRTVU did not obtain a license from the Department of the Treasury’s Office of Foreign Assets Control before using the domain names. The domains operated by KH were also owned by a U.S. company that did not obtain a license.\n\nMove makes U.S. look like “absolute hypocrite”\n\nDaniel McAdams, executive director of the Ron Paul Institute for Peace and Prosperity, said the move made the U.S. look like “the absolute hypocrite of the whole universe.”\n\n“Here we going around the world preaching about the rules-based international order with hand, and then with the other hand we’re slapping people around and taking away their websites if they dare criticize the U.S. government or U.S. foreign policy,” McAdams said.\n\nThe International Federation of Journalists also criticized the move.\n\n“The blocking by the U.S. of websites run by groups affiliated with Iran is the wrong way to deal with so-called disinformation,” said the Anthony Bellanger, the group’s general secretary.\n\n“While real journalism requires the respect of solid ethical principles and full independence from governments, we cannot accept that governments unilaterally decide which websites they don’t like to shut down – thus challenging freedom of speech.”\n\nAmong the websites that were taken down were the state-owned Press TV, the Iranian government’s main English satellite television channel, and Al Alam, its Arabic-language equivalent. Both came back online using Iranian domain addresses Alalam.ir and Presstv.ir.\n\nAccording to Iranian news media, websites for the Iran-backed Houthi militia in Yemen and satellite and TV news channels dedicated to reports from the holy Shiite city of Karbala, Iraq have also been taken down.\n\nNotices appeared on a number of Iran-affiliated websites saying they had been taken down by the U.S. government as part of law enforcement action. Similar notices also appeared on the website of Lualua TV, an Arabic-language Bahraini independent news channel that broadcasts from the UK, and Yemen’s Al Masirah TV, run by Iran-aligned Houthi movement.\n\nThe notice on the Al Masirah website stated: “The domain almasirah.net has been seized by the United States Government in accordance with a seizure warrant … as part of a law enforcement action by the Bureau of Industry and Security, Office of Export Enforcement and Federal Bureau of Investigation.”\n\nAl Masirah said in a statement that it’s not surprised by the ban “as it comes from those that have supervised the most heinous crimes against our people.”\n\n“This American ban on the Al Masirah net website and other friendly websites reveals, once again, the falsehood of the slogans of freedom of expression and all the other headlines promoted by the United States of America, including its inability to confront the truth.”\n\nThe Iranian state-run news agency IRNA called the takedowns “an illegal act” and “terroristic policy” against independent media. The semi-official Iranian news agency YJC said the U.S. move “demonstrates that calls for freedom of speech are lies.” (Related: CENSORSHIP: Facebook deletes 1.7 million member group ‘Joe Biden is not my President!’ with NO WARNING or explanation.)\n\nThe spokesman for Iran’s mission to the United Nations, Shahrokh Nazemi, said the U.S. was trying to muzzle free speech. “While rejecting this illegal and bullying action, which is an attempt at limiting the freedom of expression, the issue will be pursued through legal channels,” Nazemi said.\n\nThe U.S. took down the sites just a day after the first news conference of Ebrahim Raisi, Iran’s newly elected president. Raisi, an Iranian conservative and the country’s former chief judge, told the media that his priorities would be to improve ties with regional neighbors and revive the 2015 Joint Comprehensive Plan of Action (JCPOA) nuclear deal. He also ruled out meeting with President Joe Biden.\n\nA day before Raisi’s news conference, envoys for Iran, the U.S., the UK, Russia, China, France and Germany adjourned high-stakes talks on reviving the tattered 2015 nuclear accord.\n\nFollow JoeBiden.news for more news and information related to Joe Biden and his administration.", "opengraph": {"title": "The Biden administration does not value free speech… government seizures of websites has begun", "type": "article", "url": "https://www.joebiden.news/2021-06-30-biden-administration-does-not-value-free-speech.html", "site_name": "Joe Biden News", "description": "The seizure of journalistic websites by the Biden administration just proved that the current leadership in the U.S. does not value free speech. Leaders of the country have become enablers of censorship. An article from SHTFplan.com said: “With obvious censorship of those who dissent and research and use their own critical thinking and discernment to […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2021/06/Censorship-Freedom-Speech-Silence-Mouth-Taboo-Tape.jpg"}, "tags": ["Joe Biden", "big government", "constitution", "Ebrahim Raisi", "freedom of speech", "hypocrisy", "Censorship", "Biden administration", "JCPOA", "Kataib Hezbollah", "disinformation", "tyranny", "Houthi militia", "free speech", "heinous crimes"], "tweets": [], "movies": [], "links": ["https://www.shtfplan.com/headline-news/u-s-website-seizures-is-the-act-of-a-tyrant", "https://www.naturalnews.com/2020-11-13-joe-biden-to-massively-increase-online-censorship.html", "https://www.nbcnews.com/news/world/u-s-seizes-over-30-websites-linked-iranian-disinformation-n1272076", "http://censorship.news", "https://www.naturalnews.com/2021-01-05-facebook-deletes-anti-joe-biden-group.html", "http://tyranny.news", "https://www.cnbc.com/2021/06/21/irans-president-elect-raisi-rules-out-meeting-biden-oil-markets-look-to-nuclear-deals-future.html", "https://JoeBiden.news", "https://www.shtfplan.com/headline-news/u-s-website-seizures-is-the-act-of-a-tyrant", "https://www.nbcnews.com/news/world/u-s-seizes-over-30-websites-linked-iranian-disinformation-n1272076", "https://www.cnbc.com/2021/06/21/irans-president-elect-raisi-rules-out-meeting-biden-oil-markets-look-to-nuclear-deals-future.html"], "authors": [], "publish_date": null}