{"result_id": "181018", "URL": "https://www.joebiden.news/2021-10-20-biden-covid-vaccine-mandate-authorizing-damages-injuries.html", "timestamp": "2023-04-25 16:08:52 CEST+0200", "meta": {"description": "The Biden regime has quietly inserted special language into its federal Wuhan coronavirus (Covid-19) “vaccine” mandate that openly acknowledges the jabs can cause serious adverse effects. Though said mandate has not yet been officially decreed by China Joe, his regime is readying to authorize the payout of damages to those who take the shots under […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,COVID,Dangerous Medicine,fascism,health coverage,Joe Biden,pharmaceutical fraud,Plandemic,vaccine,vaccine damage,vaccine injury", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.joebiden.news/2021-10-20-biden-covid-vaccine-mandate-authorizing-damages-injuries.html", "encoding": "UTF-8"}, "image": null, "domain": "www.joebiden.news", "title": "Biden sneaks caveat into covid vaccine mandate order authorizing damages for vaccine injuries", "cleaned_text": "The Biden regime has quietly inserted special language into its federal Wuhan coronavirus (Covid-19) “vaccine” mandate that openly acknowledges the jabs can cause serious adverse effects.\n\nThough said mandate has not yet been officially decreed by China Joe, his regime is readying to authorize the payout of damages to those who take the shots under duress and develop deadly blood clots, for instance.\n\nAccording to reports, this compensation clause is buried deep within documents that were published as part of a Division of Federal Employee’s Compensation bulletin that was issued in early October.\n\n“On September 9, 2021, President [sic] Biden issued an executive order mandating COVID-19 vaccination for most Federal employees,” the document reads.\n\n“The order directed each agency to implement a program to require COVID-19 vaccination for all of its employees, with exceptions only as required by law.”\n\nThe Federal Employees’ Compensation Act (FECA), the document goes on to explain, covers injuries that occurred “in the performance of duty.”\n\nAnd while the FECA does not normally authorize the provision of “preventive measures such as vaccines and inoculations,” this is the “responsibility of the employing agency under the provisions of 5 U.S.C. 7901,” it goes on to explain.\n\n“However, care can be authorized by OWCP for complications of preventive measures which are provided or sponsored by the agency, such as adverse reaction to prophylactic immunization,” it further adds.\n\nBiden regime prepares for deluge of covid vaccine injuries caused by mandate\n\nWhenever medical services that are “furnished” by an employing establishment cause “deleterious effects,” affected employees are covered by the provisions of FECA.\n\nWith Fauci Flu shots soon to be mandated by Beijing Biden, the language has been updated to emphasize that medical services required by an employing establishment will also be covered in the event that they harm an employee.\n\n“… this executive order now makes COVID-19 vaccination a requirement of most Federal employment,” the FECA bulletin states, again referring to Chinese Virus injections as “preventive” when there is no evidence out there to prove this.\n\n“As such, employees impacted by this mandate who receive required COVID-19 vaccinations on or after the date of the executive order may be afforded coverage under the FECA for any adverse reactions to the vaccine itself, and for any injuries sustained while obtaining the vaccination.”\n\nKeep in mind that these provisions only apply to people who are injured after being forced or coerced into taking an “Operation Warp Speed” shot. Those who become injured or die after voluntarily getting jabbed will not be covered.\n\nThere is an entire claims process within the FECA literature that injured employees who took the jabs under duress must follow if they hope to be reimbursed, as well as receive continuation of pay if they are no longer able to work.\n\n“When a claim is received for injury due to receipt of the COVID-19 vaccination, the claims examiner should determine if the vaccine was received prior to September 9, 2021,” the document states.\n\n“If the vaccination was received prior to this date, coverage is afforded only if the vaccine was administered or sponsored by the employing agency.”\n\nBack in December, CNBC made it clear that the general public cannot sue Pfizer or Moderna if they develop “severe covid vaccine side effects.” That same fake news network added that “the government likely won’t compensate you for damages either.”\n\n“The Biden administration’s recognition that serious side effects could lead to damages that need to be compensated because of the federal vaccine mandate but denial of civil litigation as a recourse for civilians illustrates just another two-tier system of justice in Biden’s America,” Becker News concluded.\n\nThe latest news about Chinese Virus injection tyranny can be found at Fascism.news.", "opengraph": {"title": "Biden sneaks caveat into covid vaccine mandate order authorizing damages for vaccine injuries", "type": "article", "url": "https://www.joebiden.news/2021-10-20-biden-covid-vaccine-mandate-authorizing-damages-injuries.html", "site_name": "Joe Biden News", "description": "The Biden regime has quietly inserted special language into its federal Wuhan coronavirus (Covid-19) “vaccine” mandate that openly acknowledges the jabs can cause serious adverse effects. Though said mandate has not yet been officially decreed by China Joe, his regime is readying to authorize the payout of damages to those who take the shots under […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2021/10/Joe-Biden-Weekend-In-Delaware.jpg"}, "tags": ["Joe Biden", "big government", "Big Pharma", "fascism", "COVID", "vaccine", "vaccine injury", "vaccine damage", "health coverage", "Plandemic", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://beckernews.com/biden-quietly-slipped-secret-clause-into-vaccine-mandate-docs-that-allow-damages-for-serious-side-effects-42584/", "https://www.naturalnews.com/2021-05-10-utah-teenager-hospitalized-blood-clots-covid-vaccine.html", "https://archive.is/1atd9", "http://fascism.news", "https://beckernews.com/biden-quietly-slipped-secret-clause-into-vaccine-mandate-docs-that-allow-damages-for-serious-side-effects-42584/", "https://www.naturalnews.com/2021-05-10-utah-teenager-hospitalized-blood-clots-covid-vaccine.html"], "authors": [], "publish_date": null}