{"result_id": "181003", "URL": "https://joebiden.news/2022-07-22-biden-covid-positive-despite-four-vaccine-doses.html", "timestamp": "2023-04-25 16:08:49 CEST+0200", "meta": {"description": "President Joe Biden has tested positive for the Wuhan coronavirus (COVID-19) despite being fully vaccinated and twice boosted against the disease. White House Press Secretary Karine Jean-Pierre confirmed the development in a July 21 statement. She said the 79-year-old president is experiencing “very mild symptoms” and will isolate himself for the time being. “[Biden] will continue […]", "lang": "en", "keywords": "Alexandria Ocasio-Cortez,Anthony Fauci,badhealth,badmedicine,big government,booster,congress,covid positive,COVID test,covid-19,infection,Joe Biden,Nancy Pelosi,pandemic,test result,vaccine,White House,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2022-07-22-biden-covid-positive-despite-four-vaccine-doses.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "Biden tests positive for COVID despite getting FOUR doses of the clot shot", "cleaned_text": "Biden tests positive for COVID despite getting FOUR doses of the clot shot\n\nPresident Joe Biden has tested positive for the Wuhan coronavirus (COVID-19) despite being fully vaccinated and twice boosted against the disease.\n\nWhite House Press Secretary Karine Jean-Pierre confirmed the development in a July 21 statement. She said the 79-year-old president is experiencing “very mild symptoms” and will isolate himself for the time being.\n\n“[Biden] will continue to carry out all of his duties fully … and work in isolation until he tests negative. Once he tests negative, he will return to in-person work.”\n\nAccording to Jean-Pierre, Biden returned a negative COVID-19 test result on July 19, two days before he contracted the pathogen. Given his advanced age, the president falls under the at-risk group in terms of developing severe illness.\n\nShe continued that the former vice president under the Obama administration had “been in contact with members of the White House staff by phone,” and will join planned meeting “via phone and Zoom.” The White House will also provide daily updates about Biden’s status, added Jean-Pierre.\n\n“Per standard protocol for any positive case at the White House, the White House Medical Unit will inform all close contacts of the president – including any members of Congress and any members of the press who interacted with [him].”\n\nBiden’s positive COVID-19 result followed that of White House Chief Medical Advisor Dr. Anthony Fauci, who caught the virus in June.\n\nA June 15 statement from the National Institutes of Health (NIH) confirmed Fauci’s illness, stating that a rapid antigen test he took returned a positive result. Just like Biden, the 81-year-old Fauci had “mild symptoms” even though he was “fully vaccinated and “boosted twice.” (Related: Shroyer: Quadruple-vaxxed Fauci LIED about COVID vaccines protecting people from infection.)\n\nThe NIH statement added that the infectious disease expert had not been in close contact with Biden or other senior officials before testing positive.\n\nGovernment officials prove the vaccines do not work at all\n\nBiden and Fauci are just two examples of prominent government officials who proved that the COVID-19 vaccines are ineffective in preventing infection. Despite receiving four vaccine doses, the two officials of advanced age still caught COVID-19.\n\nTwo members of the legislative branch, both part of the Democratic Party, also contracted SARS-CoV-2 following their vaccination.\n\nBack in April, House Speaker Nancy Pelosi contracted COVID-19 after attending events where she was in close proximity to vaccinated colleagues. Her deputy chief of staff Drew Hammill confirmed the test result on social media.\n\n“After testing negative this week, Speaker Pelosi received a positive test result for COVID-19 and is currently asymptomatic. The speaker is fully vaccinated and boosted, [and] encourages everyone to get vaccinated, boosted and [tested] regularly,” Hammill wrote on April 7.\n\nPrior to this, New York Rep. Alexandria Ocasio-Cortez tested positive for COVID-19 in January. She was fully vaccinated and boosted, having received her booster dose during the 2021 fall season.\n\nAccording to a statement from her office at the time, Ocasio-Cortez was “experiencing symptoms and recovering at home.” The congresswoman also called on Americans to “get their boosters” and follow public health guidance from the Centers for Disease Control and Prevention.\n\nHead over to BadMedicine.news for more stories about government officials catching COVID-19 despite multiple vaccine doses.\n\nWatch this Italian doctor showing that most COVID-positive patients are vaccinated.\n\nThis video is from the Chinese taking down EVIL CCP channel on Brighteon.com.\n\nSens. Warren, Booker and Crow all parrot SCRIPTED response upon testing “positive” for covid after triple vaccinations – are they parroting the same MEMO?\n\nSpeaker Pelosi now COVID-positive after being in close proximity to Joe Biden and other VAXXED Dems.\n\nFully vaccinated and boosted Trudeau AGAIN tests positive for COVID-19.\n\nAOC tests positive for covid despite being vaccinated and boosted.\n\nWhy it matters that Fauci got COVID-19.", "opengraph": {"title": "Biden tests positive for COVID despite getting FOUR doses of the clot shot", "type": "article", "url": "https://www.joebiden.news/2022-07-22-biden-covid-positive-despite-four-vaccine-doses.html", "site_name": "Joe Biden News", "description": "President Joe Biden has tested positive for the Wuhan coronavirus (COVID-19) despite being fully vaccinated and twice boosted against the disease. White House Press Secretary Karine Jean-Pierre confirmed the development in a July 21 statement. She said the 79-year-old president is experiencing “very mild symptoms” and will isolate himself for the time being. “[Biden] will continue […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/07/Joe-Biden-Close-Up.jpg"}, "tags": ["pandemic", "Joe Biden", "big government", "covid-19", "White House", "COVID test", "Nancy Pelosi", "Alexandria Ocasio-Cortez", "congress", "infection", "vaccine", "test result", "covid positive", "Anthony Fauci", "Wuhan coronavirus", "booster"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/biden-tests-positive-for-covid-19-white-house_4612708.html", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/07/21/statement-from-press-secretary-karine-jean-pierre/", "https://www.nih.gov/news-events/news-releases/niaid-director-fauci-tests-positive-covid-19", "https://naturalnews.com/2022-06-21-fauci-lied-about-covid-vaccine-protecting-people.html", "https://www.cbsnews.com/news/nancy-pelosi-tests-positive-covid-19/", "https://www.zerohedge.com/covid-19/aoc-tests-positive-covid", "https://badmedicine.news/", "https://www.brighteon.com/19c03c59-bfd3-4ba5-9cd8-ed1d5cc43f54", "https://www.brighteon.com/channels/nfsc", "https://lizwarren.news/2021-12-24-warren-booker-crow-scripted-positive-covid-vaccinated.html", "https://biggovernment.news/2022-04-08-pelosi-covid-positive-close-proximity-vaxxed-dems.html", "https://technocrats.news/2022-07-08-fully-vaccinated-trudeau-tests-positive-for-covid.html", "https://cortezwatch.com/2022-01-10-aoc-tests-positive-covid-despite-vaccinated-boosted.html", "https://faucitruth.com/2022-06-24-it-matters-that-fauci-got-covid-19.html", "https://www.theepochtimes.com/biden-tests-positive-for-covid-19-white-house_4612708.html", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/07/21/statement-from-press-secretary-karine-jean-pierre/", "https://www.nih.gov/news-events/news-releases/niaid-director-fauci-tests-positive-covid-19", "https://www.cbsnews.com/news/nancy-pelosi-tests-positive-covid-19/", "https://www.zerohedge.com/covid-19/aoc-tests-positive-covid", "https://www.brighteon.com/19c03c59-bfd3-4ba5-9cd8-ed1d5cc43f54", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2022-07-22-biden-covid-positive-despite-four-vaccine-doses.html&linkname=Biden%20tests%20positive%20for%20COVID%20despite%20getting%20FOUR%20doses%20of%20the%20clot%20shot", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}