{"result_id": "181008", "URL": "https://joebiden.news/2022-01-26-biden-cuts-off-monoclonal-antibodies-only-vaccines.html", "timestamp": "2023-04-25 16:08:50 CEST+0200", "meta": {"description": "The Biden regime is banning monoclonal antibodies by removing them from emergency use authorization (EUA). The U.S. Food and Drug Administration (FDA) decided out of the blue to cut off America’s supply of Regeneron, a “passive vaccine” that many Democrats seem to oppose because it was promoted by President Donald Trump. (Related: Sen. Rand Paul […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,banned,Biden,COVID,DeSantis,EUA,fascism,FDA,Florida,genocide,hospital homicide,medical murder,medical terrorism,monoclonal antibodies,passive vaccine,Plandemic,Regeneron", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2022-01-26-biden-cuts-off-monoclonal-antibodies-only-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "Biden cuts off America’s supply of monoclonal antibodies – only “vaccines” allowed", "cleaned_text": "Biden cuts off America’s supply of monoclonal antibodies – only “vaccines” allowed\n\nThe Biden regime is banning monoclonal antibodies by removing them from emergency use authorization (EUA).\n\nThe U.S. Food and Drug Administration (FDA) decided out of the blue to cut off America’s supply of Regeneron, a “passive vaccine” that many Democrats seem to oppose because it was promoted by President Donald Trump. (Related: Sen. Rand Paul called out Joe Biden for killing Americans by denying them access to monoclonal antibodies.)\n\nIn Florida, where monoclonal antibodies are widely popular, the state’s department of health released a statement condemning the Biden regime’s “abrupt” decision to eliminate access to monoclonal antibodies, which have been shown to prevent severe illness, hospitalization and death in high-risk patients who have contracted or been exposed to the Wuhan coronavirus (Covid-19).\n\nAs a result of the EUA’s removal, all of Florida’s monoclonal antibody administration sites are now “closed until further notice,” the Florida Department of Health (FDH) tweeted.\n\n“Unfortunately, as a result of this abrupt decision made by the federal government, all monoclonal antibody sites will be closed until further notice,” the announcement reads.\n\n“Individuals with appointments have been directly contacted regarding cancellations. If you have tested positive for COVID-19, please contact your health care provider for more information and resources on treatment options.”\n\nMonoclonal antibodies are safer and more effective than covid “vaccines”\n\nThe FDH clearly stated in the announcement that Florida “disagrees with the decision that blocks access to any available treatments in the absence of clinical evidence.”\n\n“To date, such clinical evidence has not been provided by the United States Food and Drug Administration (FDA),” the agency added.\n\nThe FDA decision applies to the entire country, just to be clear. It is now illegal, technically speaking, for providers to administer monoclonal antibodies in the U.S.\n\n“The FDA is trying to make it so that people in Florida die of Covid,” tweeted Mike Cernovich. “They’ll kill people to harm Republicans. Steel yourselves for the evil that is being unleashed.”\n\nGov. Ron DeSantis has been a heavy promoter of Regeneron, a company in which he holds stock.\n\nThe drug is said to help sick patients by giving them a quick fix of synthetic antibodies, which for many alleviates their symptoms quickly, often by the following day.\n\nAccording to the FDA, monoclonal antibodies from both Regeneron and Eli Lilly should no longer be used because they are “unlikely” to be effective against the “omicron” (moronic) variant of the Fauci Flu.\n\nRather than allow patients and their doctors to make their own determination and decision, the FDA has decided to just go ahead and prohibit the drugs because they might not (but also might) work.\n\nDeSantis, who helped set up infusion sites for Regeneron all across the Sunshine State, slammed the Biden regime over the FDA’s decision. The governor has promised to fight for these treatments to return, “come hell or high water.”\n\nAccording to DeSantis, Biden swept in to cut off access to monoclonal antibodies right as it was becoming obvious that the treatment works better than the “vaccines” at helping sick patients recover.\n\n“I believe that ivermectin, hydroxychloroquine, chlorine dioxide and many other remedies work to stop Covid-19 in its tracks,” wrote a Natural News reader.\n\n“I also believe that no one needs any more than a high-quality vitamin C combined with vitamin D3, and zinc to overcome even the most severe cases of Covid-19. I personally take 25,000 mg of vitamin C throughout the day when I am ill. I take up to 40,000 international units of vitamin D3 a day when ill, and up to 50mg of zinc. This always seems to do the trick. A shot of fresh squeezed lemon or a shot of apple cider vinegar with the mother to alkalize helps, too.”\n\nMore related news about the Biden regime can be found at Fascism.news.", "opengraph": {"title": "Biden cuts off America’s supply of monoclonal antibodies – only “vaccines” allowed", "type": "article", "url": "https://www.joebiden.news/2022-01-26-biden-cuts-off-monoclonal-antibodies-only-vaccines.html", "site_name": "Joe Biden News", "description": "The Biden regime is banning monoclonal antibodies by removing them from emergency use authorization (EUA). The U.S. Food and Drug Administration (FDA) decided out of the blue to cut off America’s supply of Regeneron, a “passive vaccine” that many Democrats seem to oppose because it was promoted by President Donald Trump. (Related: Sen. Rand Paul […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/01/Coronavirus-Quarantine-Hazmat-Injection-Syringe.jpg"}, "tags": ["hospital homicide", "Regeneron", "monoclonal antibodies", "fascism", "Biden", "medical murder", "banned", "FDA", "COVID", "DeSantis", "Florida", "genocide", "medical terrorism", "EUA", "passive vaccine", "Plandemic"], "tweets": [], "movies": [], "links": ["https://thepostmillennial.com/fda-prohibits-florida-from-using-monoclonal-antibody-treatments", "https://naturalnews.com/2021-09-22-rand-paul-biden-killing-americans-depriving-regeneron.html", "https://www.wfla.com/community/health/coronavirus/explainer-reports-on-florida-gov-ron-desantis-regeneron-explained/", "http://fascism.news", "https://thepostmillennial.com/fda-prohibits-florida-from-using-monoclonal-antibody-treatments", "https://naturalnews.com/2021-09-22-rand-paul-biden-killing-americans-depriving-regeneron.html", "https://www.wfla.com/community/health/coronavirus/explainer-reports-on-florida-gov-ron-desantis-regeneron-explained/"], "authors": [], "publish_date": null}