{"result_id": "181024", "URL": "https://joebiden.news/2022-03-07-senate-passes-bill-to-end-covid-national-emergency.html", "timestamp": "2023-04-25 16:08:54 CEST+0200", "meta": {"description": "The United States Senate passed a bill to end the Wuhan coronavirus (COVID-19) state of National Emergency in a party-line vote as mask mandates and social distancing restrictions continue. All Republicans voted for Senate Joint Resolution 38, which would effectively end the national emergency declared by then-President Donald Trump on March 13, 2020. Meanwhile, all […]", "lang": "en", "keywords": "Anthony Fauci,big government,coronavirus,covid-19,democrats,health freedom,Joe Biden,liberty,mask mandates,medical fascism,Medical Tyranny,national emergency,pandemic,propaganda,Republicans,social distancing,US Senate,vaccine mandates,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2022-03-07-senate-passes-bill-to-end-covid-national-emergency.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "Senate passes bill to end COVID-19 state of National Emergency", "cleaned_text": "The United States Senate passed a bill to end the Wuhan coronavirus (COVID-19) state of National Emergency in a party-line vote as mask mandates and social distancing restrictions continue.\n\nAll Republicans voted for Senate Joint Resolution 38, which would effectively end the national emergency declared by then-President Donald Trump on March 13, 2020. Meanwhile, all Democrats voted against the declaration, which President Joe Biden has already extended twice. With three Democratic and two Republican Senators not present in the session, the resolution ended with a 48-47 vote, passing the bill successfully in Senate. (Related: President Biden to extend COVID-19 “national emergency” status.)\n\nSenator Roger Marshall of Kansas, who introduced the measure, said in a statement after the vote: “After nearly two years of living under this state of emergency, the American people are worn out and yearning to breathe free; they long for their God-given freedoms, and for leaders to take their side. There is no doubt, it’s time for our nation to learn to live with COVID.”\n\nHowever, Democrats opposed the measure, with Senate Majority Leader Chuck Schumer of New York claiming that lifting the mandates would prevent the Biden administration from being able to fight the pandemic if a new strain develops. He added that it was too early to lift the emergency measures as it would handicap the administration’s ability to fight the pandemic.\n\n“The best way to ensure that we keep schools open and cases low is by staying at the ready, and that is what these emergency powers enable us to do,” he said. “By prematurely terminating the national emergency declaration on COVID, it will be harder to ensure we have enough supplies, enough support for health care workers, and it risks throwing tens of millions of student loan borrowers into needless uncertainty and anxiety.”\n\nMeanwhile, the White House pledged to veto the bill if it reaches Biden’s desk, saying that the GOP attempt at terminating the pandemic emergency declaration is a “reckless and costly mistake” to make.\n\nThe Democrats argue that the bill could halt COVID-19 policies and protections, such as student loan payment relief, looser telehealth regulations and higher reimbursement rates for providers. All these could also raise funding concerns.\n\nThe administration is already asking Congress for $18.25 billion to continue buying therapies, tests and vaccines. This does not include the billions more that the White House could ask for to implement an exit roadmap or other initiatives tied to the COVID response, such as bolstering nursing home oversights or pushing for mental health care plans.\n\nOfficials are still concerned about the ongoing effects of COVID, fearing that the chapter is not yet over. Biden’s chief medical adviser Anthony Fauci said emergency means different things to different people, and the United States remains in a situation where there are around 68,000 active cases. As the administration launched a roadmap for the pandemic’s next phase, Fauci noted that the government must always be prepared for the possibility of another variant.\n\nThe trends continue to look up, with the CDC saying that COVID-19 shifted its map again, placing roughly 90 percent of the country in low to moderate risk zones. However, there are more cases reported per day now compared to July 2021, when Biden declared a premature success. (Related: Trudeau and Biden EXTENDED national emergencies to create PERMANENT state of emergency for never-ending suspension of civil rights.)\n\nAnother factor that the administration is considering to address the state of the pandemic is the vaccination rate of the citizens. The gap between COVID-19 vaccination coverage in rural and urban America has grown wider in the past year, despite the increased availability and improved access to vaccines. In rural areas, only a little over 58 percent got at least one dose of any of the available COVID-19 vaccines, while it is at around 75 percent in urban counties.\n\nThis urban-rural coverage gap is similar in all age groups, but was more pronounced among younger Americans. In rural counties, nearly 40 percent of 12- to 17-year-olds have received at least one vaccine dose, compared to about 65 percent in urban counties. For the 5- to 11-year-old age range, the rates were at 15 and 30 percent, respectively.\n\nDr. Robert Malone calls for immediate end to Biden’s national emergency.\n\nBiden using “national emergency” to allow corrupt feds to rig the 2022 midterm elections.\n\nFor decades, U.S. Presidents have signed Executive Orders that activate a DICTATORSHIP during a “national emergency.”\n\nIt’s time for the American people to declare our own national emergency and remove destructive Dems from power.\n\nYes, the Democrats just admitted they plan to declare a national emergency to demand gun confiscation from all citizens.\n\nWatch the video to know why the emergency phase of the COVID-19 pandemic is over.\n\nThis video is from the GalacticStorm channel on Brighteon.com.\n\nFollow Pandemic.news for more updates related to the COVID-19 pandemic.", "opengraph": {"title": "Senate passes bill to end COVID-19 state of National Emergency", "type": "article", "url": "https://www.joebiden.news/2022-03-07-senate-passes-bill-to-end-covid-national-emergency.html", "site_name": "Joe Biden News", "description": "The United States Senate passed a bill to end the Wuhan coronavirus (COVID-19) state of National Emergency in a party-line vote as mask mandates and social distancing restrictions continue. All Republicans voted for Senate Joint Resolution 38, which would effectively end the national emergency declared by then-President Donald Trump on March 13, 2020. Meanwhile, all […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/03/us-senate-floor.jpg"}, "tags": ["pandemic", "big government", "mask mandates", "Anthony Fauci", "US Senate", "covid-19", "White House", "national emergency", "Republicans", "coronavirus", "propaganda", "Joe Biden", "vaccine mandates", "Medical Tyranny", "social distancing", "medical fascism", "liberty", "democrats", "health freedom"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/huge-senate-votes-to-end-covid-19-emergency-declaration/", "https://naturalnews.com/2022-02-24-biden-to-extend-covid-national-emergency-status.html", "https://www.dailymail.co.uk/news/article-10577965/Biden-threatens-VETO-Senate-vote-end-COVID-national-emergency.html", "http://whitehouse.news", "https://www.politico.com/newsletters/politico-pulse/2022/03/04/pressure-mounts-to-end-the-emergency-00014018", "http://infections.news", "https://naturalnews.com/2022-02-23-trudeau-biden-extend-national-emergencies-suspension-rights.html", "https://pandemic.news/2022-02-28-malone-calls-for-immediate-end-national-emergency.html", "https://newstarget.com/2021-09-16-biden-using-national-emergency-to-rig-2022-elections.html", "https://newstarget.com/2021-03-09-us-presidents-executive-orders-activate-dictatorship.html", "https://newstarget.com/2019-02-14-its-time-for-the-american-people-to-declare-our-own-national-emergency.html", "https://newstarget.com/2019-02-18-democrats-just-admitted-they-plan-to-declare-a-national-emergency-gun-confiscation.html", "https://www.brighteon.com/8565e5e3-f822-4f89-9435-04c86e018404", "https://www.brighteon.com/channels/galacticstorm", "http://Pandemic.news", "https://100percentfedup.com/huge-senate-votes-to-end-covid-19-emergency-declaration/", "https://www.dailymail.co.uk/news/article-10577965/Biden-threatens-VETO-Senate-vote-end-COVID-national-emergency.html", "https://www.politico.com/newsletters/politico-pulse/2022/03/04/pressure-mounts-to-end-the-emergency-00014018", "https://www.brighteon.com/8565e5e3-f822-4f89-9435-04c86e018404", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2022-03-07-senate-passes-bill-to-end-covid-national-emergency.html&linkname=Senate%20passes%20bill%20to%20end%20COVID-19%20state%20of%20National%20Emergency", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}