{"result_id": "181031", "URL": "https://joebiden.news/2022-01-22-texas-judge-blocks-biden-covid-vaccine-mandate.html", "timestamp": "2023-04-25 16:08:55 CEST+0200", "meta": {"description": "A federal judge in Texas has blocked President Joe Biden’s Wuhan coronavirus (COVID-19) vaccine mandate for federal workers, believing it to be a “bridge too far.” Had the COVID-19 vaccine mandate remained, it would have forced about 3.5 million government employees to get vaccinated by Nov. 22 if they did not have a religious or […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Biden,coercion,coronavirus,coronavirus vaccines,covid-19,freedom,government,Joe Biden,liberty,Medical Tyranny,Supreme Court,Texas,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2022-01-22-texas-judge-blocks-biden-covid-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "Texas district judge BLOCKS Biden’s COVID-19 vaccine mandate for federal employees", "cleaned_text": "A federal judge in Texas has blocked President Joe Biden’s Wuhan coronavirus (COVID-19) vaccine mandate for federal workers, believing it to be a “bridge too far.”\n\nHad the COVID-19 vaccine mandate remained, it would have forced about 3.5 million government employees to get vaccinated by Nov. 22 if they did not have a religious or medical waiver. Those who remained unvaccinated and did not have a waiver would have faced disciplinary action or been fired outright.\n\nIf the COVID-19 vaccine mandate had remained, it would have forced about 3.5 million government employees to get vaccinated by Nov. 22 if they did not have a religious or medical waiver. Those who remained unvaccinated and did not have a waiver would have faced disciplinary action or been fired outright.\n\nDistrict Judge Jeffrey Brown of the United States District Court for the Southern District of Texas, appointed by former President Donald Trump, wrote in a 20-page ruling that Biden’s executive order “amounts to a presidential mandate that all federal employees consent to vaccination against COVID-19 or lose their jobs.”\n\nBrown added that the case of the vaccine mandate is about “whether the President can, with the stroke of a pen and without the input of Congress, require millions of federal employees to undergo a medical procedure as a condition of their employment.”\n\n“Because the President’s authority is not that broad, the court will enjoin the second order’s enforcement,” he concluded.\n\nBrown cited the Supreme Court opinion blocking a federal rule that would have required federal workers at large corporations to either get tested for COVID-19 weekly or get vaccinated. He added that Biden’s mandate was a “bridge too far” and the president should never be given the power to change the condition of employment of millions of Americans.\n\nThe judge further pointed out that, in the interest of “maintaining the liberty of individuals,” they must always be allowed to make “intensely personal decisions according to their own convictions” and without coercion.\n\nBrown said that if the government wanted to protect its employees against COVID-19, it could do so by passing other public health initiatives that are not as intrusive. (Related: Supreme Court sides with continued mask tyranny on airplanes.)\n\nRuling latest blow to government’s campaign for vaccine mandates\n\nBrown’s ruling comes just one week after the Supreme Court blocked Biden’s vaccine-or-test mandate for all employees of private businesses with 100 or more workers.\n\nAccording to the majority opinion, Biden and his Occupational Safety and Health Administration’s (OSHA) vaccine-or-test rule was beyond the federal government’s authority to execute.\n\n“OSHA has never before imposed such a mandate. Nor has Congress. Indeed, although Congress has enacted significant legislation addressing the COVID-19 pandemic, it has declined to enact any measure similar to what OSHA has promulgated here,” wrote the Supreme Court majority.\n\nThe Department of Justice said it would appeal Brown’s decision in a higher court. The department noted that numerous other courts had already rejected similar challenges to the vaccine mandate, and that federal agencies have already stated that they will not discipline or punish employees with pending exemption requests.\n\nAsked about Brown’s ruling on Friday, White House Press Secretary Jen Psaki noted that a “remarkable” 98 percent of federal employees are already vaccinated or are seeking a religious or medical exemption.\n\n“We are confident in our legal authority,” she said.\n\nIf this is true, then it begs the question of why a COVID-19 vaccine mandate is even necessary for federal employees, especially if the vaccine is supposed to work as intended, and a 98 percent vaccination rate is already more than enough to provide herd immunity to federal employees to keep the remaining two percent safe from infection.\n\nFor his part, knowing that he has few options left, Biden has called on companies to voluntarily pass vaccine mandates and testing restrictions on their own.\n\n“The court has ruled that my administration cannot use the authority granted to it by Congress to require this measure,” he said. “But that does not stop me from using my voice as president to advocate for employers to do the right thing to protect Americans’ health and economy.”\n\nListen to this Situation Update episode of the Health Ranger Report, a podcast by Mike Adams, the Health Ranger, as he talks about how the Supreme Court betrayed America and the American people by authorizing the COVID-19 vaccine mandate for healthcare workers.\n\nThis video can be found on the Health Ranger Report channel on Brighteon.com.", "opengraph": {"title": "Texas district judge BLOCKS Biden’s COVID-19 vaccine mandate for federal employees", "type": "article", "url": "https://www.joebiden.news/2022-01-22-texas-judge-blocks-biden-covid-vaccine-mandate.html", "site_name": "Joe Biden News", "description": "A federal judge in Texas has blocked President Joe Biden’s Wuhan coronavirus (COVID-19) vaccine mandate for federal workers, believing it to be a “bridge too far.” Had the COVID-19 vaccine mandate remained, it would have forced about 3.5 million government employees to get vaccinated by Nov. 22 if they did not have a religious or […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/01/Joe-Biden-Presidential-Address-Congress.jpg"}, "tags": ["government", "Joe Biden", "covid-19", "vaccine wars", "Biden", "liberty", "Texas", "coercion", "Supreme Court", "Medical Tyranny", "vaccine mandate", "vaccines", "coronavirus", "freedom", "coronavirus vaccines"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/health/2022/01/21/federal-judge-blocks-bidens-vaccine-mandate-for-federal-workers/", "https://www.reuters.com/legal/government/us-judge-blocks-biden-federal-employee-covid-19-vaccine-mandate-2022-01-21/", "https://thehill.com/policy/healthcare/590797-federal-judge-in-texas-blocks-bidens-vaccine-mandate-for-federal-workers", "https://www.cnbc.com/2022/01/21/biden-covid-vaccine-rules-judge-blocks-mandate-for-federal-workers.html", "https://naturalnews.com/2022-01-21-supreme-court-sides-continued-mask-tyranny-airplanes.html", "https://www.brighteon.com/82f880f3-c30f-4b80-b5a0-d2eb2239b407", "https://www.brighteon.com/channels/hrreport", "https://www.breitbart.com/health/2022/01/21/federal-judge-blocks-bidens-vaccine-mandate-for-federal-workers/", "https://www.reuters.com/legal/government/us-judge-blocks-biden-federal-employee-covid-19-vaccine-mandate-2022-01-21/", "https://thehill.com/policy/healthcare/590797-federal-judge-in-texas-blocks-bidens-vaccine-mandate-for-federal-workers?rl=1", "https://www.cnbc.com/2022/01/21/biden-covid-vaccine-rules-judge-blocks-mandate-for-federal-workers.html", "https://www.brighteon.com/82f880f3-c30f-4b80-b5a0-d2eb2239b407"], "authors": [], "publish_date": null}