{"result_id": "181030", "URL": "https://joebiden.news/2023-03-15-america-china-have-started-new-cold-war.html", "timestamp": "2023-04-25 16:08:55 CEST+0200", "meta": {"description": "The United States and China have started a new Cold War. This was the assessment made by former U.S. Air Force Brigadier General Robert Spalding during a recent interview with NTD News anchor Stefania Cox. Cox mentioned that Chinese President Xi Jinping had made pointed remarks against the U.S. in a recent speech. Xi is blaming the […]", "lang": "en", "keywords": "America,big government,chaos,China,Chinese Communist Party,Cold War,dangerous,Joe Biden,John Kirby,national security,People's Liberation Army,Robert Spalding,Taiwan,United States,White House,World War III,Xi Jinping", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2023-03-15-america-china-have-started-new-cold-war.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "Gen. Robert Spalding: America, China have started a new Cold War", "cleaned_text": "The United States and China have started a new Cold War. This was the assessment made by former U.S. Air Force Brigadier General Robert Spalding during a recent interview with NTD News anchor Stefania Cox.\n\nCox mentioned that Chinese President Xi Jinping had made pointed remarks against the U.S. in a recent speech. Xi is blaming the U.S. for containing, encircling and suppressing China.\n\n“Western countries led by the United States have implemented all-round containment, encirclement and suppression of China, which has brought unprecedented severe challenges to our country’s development,” Xi told industry leaders in a direct criticism of America.\n\nCox noted that this was a rare moment of direct public affront from Xi to America. She added the Cold War came to mind because of an apparent shift in Xi’s stance.\n\nSpaulding, who is a senior fellow at the Hudson Institute, agreed with Cox that China is now changing its stance.\n\nShift in China’s stance signals start of the new Cold War\n\nThe retired Air Force brigadier general, who has served in senior positions of strategy and diplomacy within the Department of Defense and the Department of State for more than 26 years, mentioned that the Chinese Communist Party and the People’s Liberation Army have never directly called out the United States before.\n\n“The fact that he (Xi) directly called out the United States in the two-session meeting with the Chinese Communist Party indicates we’re entering a new phase of the relationships. It’s not something that we didn’t expect. We’re entering, and we have entered, the second Cold War. And I think this just shows you where China’s headed there,” Spalding explained.\n\n“They recognize that as becoming a bipolar world they are going to be leading let’s say the unfree part of the world and America is going to be leading the free part of the world. And they want to make that message known to the Chinese Communist Party. So, I think it’s a huge shift in the way that (the) Chinese Communist Party is interacting not only internally to China, but with the rest of the world.”\n\nJohn Kirby, the National Security Council’s coordinator for strategic communications, stated before that the U.S. doesn’t want conflict with China, only strategic competition.\n\nCox noted that this has been America’s approach for several decades now. She asked Spalding if this will remain with China taking a new stance.\n\nSpalding pointed out that there is a problem with Washington D.C.’s policy on China and that the Joe Biden administration has failed to recognize there are two parties in a relationship.\n\nHe said the U.S. is mirror-imaging China when it says that it doesn’t want a Cold War. He added that China nevertheless is seeing America in a Cold War light and the country has to accept that.\n\nThe national security policy strategist indicated this will eventually turn militaristic, especially with regard to Taiwan. (Related: China will not hesitate to use FORCE to retake Taiwan, warns Xi.)\n\nFollow CommunistChina.news for more news about China, the CCP and Chinese President Xi Jinping.\n\nWatch the video below to learn more about the brewing Cold War between the United States and China.\n\nThis video is from the Pool Pharmacy channel on Brighteon.com.\n\nThe Dr. Hotze Report: CCP has infiltrated most sectors of American society, including government, media, business and schools, in preparation for an INVASION – Brighteon.TV.\n\nWAR ALERT: China setting stage for NUCLEAR WAR with Taiwan, Australia, Japan, India and the USA.\n\nThe war between China and the United States has already begun, and America is the battleground.\n\nChina plans to use biological and genetic weapons in next world war.", "opengraph": {"title": "Gen. Robert Spalding: America, China have started a new Cold War", "type": "article", "url": "https://www.joebiden.news/2023-03-15-america-china-have-started-new-cold-war.html", "site_name": "Joe Biden News", "description": "The United States and China have started a new Cold War. This was the assessment made by former U.S. Air Force Brigadier General Robert Spalding during a recent interview with NTD News anchor Stefania Cox. Cox mentioned that Chinese President Xi Jinping had made pointed remarks against the U.S. in a recent speech. Xi is blaming the […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2023/03/China-America-Flags-War.jpg"}, "tags": ["chaos", "Joe Biden", "big government", "White House", "dangerous", "John Kirby", "national security", "World War III", "Robert Spalding", "Taiwan", "China", "Cold War", "America", "People's Liberation Army", "United States", "Xi Jinping", "Chinese Communist Party"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/8cf23aeb-beca-456f-97a4-c8f561dbab8b", "http://www.ntd.com/us-is-resourcing-its-authoritarian-adversary-china-gen-spalding_906156.html", "http://www.channelnewsasia.com/asia/china-president-xi-jinping-slams-united-states-suppression-private-sector-3330911", "http://www.hudson.org/experts/1265-robert-spalding", "https://naturalnews.com/2022-10-19-china-wont-hesitate-use-force-retake-taiwan.html", "http://communistchina.news", "http://www.brighteon.com/8cf23aeb-beca-456f-97a4-c8f561dbab8b", "http://www.brighteon.com/channels/poolpharmacy", "https://naturalnews.com/2022-10-18-semiconductor-ban-accelerates-severing-us-china-ties.html", "http://communistchina.news/2023-02-22-ccp-infiltrated-american-society-preparation-for-invasion.html", "https://naturalnews.com/2021-10-05-war-alert-china-setting-stage-for-nuclear-war.html", "https://naturalnews.com/2020-12-21-war-between-china-and-united-states-already-begun.html", "https://naturalnews.com/2021-05-21-china-to-use-bioweapons-in-world-war.html", "https://www.brighteon.com/8cf23aeb-beca-456f-97a4-c8f561dbab8b", "http://www.ntd.com/us-is-resourcing-its-authoritarian-adversary-china-gen-spalding_906156.html", "http://www.channelnewsasia.com/asia/china-president-xi-jinping-slams-united-states-suppression-private-sector-3330911", "http://www.hudson.org/experts/1265-robert-spalding", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2023-03-15-america-china-have-started-new-cold-war.html&linkname=Gen.%20Robert%20Spalding%3A%20America%2C%20China%20have%20started%20a%20new%20Cold%20War", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}