{"result_id": "181005", "URL": "https://joebiden.news/2022-01-28-biden-regime-to-continue-vaccine-mandate-businesses.html", "timestamp": "2023-04-25 16:08:49 CEST+0200", "meta": {"description": "The Occupational Safety and Health Administration is planning to cancel its emergency order allegedly authorizing the agency to impose Joe Biden’s COVID-19 vaccine mandate on businesses with 100 or more workers after the mandate was struck down earlier this month by the U.S. Supreme Court. However, according to a report, the agency is still looking […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,covid-19,fascism,health freedom,insanity,Joe Biden,obey,OSHA,pandemic,private businesses,scotus,Supreme Court,traitors,tyranny,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2022-01-28-biden-regime-to-continue-vaccine-mandate-businesses.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "Biden regime plans to continue pursuing COVID-19 vaccine mandate for businesses despite Supreme Court ban", "cleaned_text": "Biden regime plans to continue pursuing COVID-19 vaccine mandate for businesses despite Supreme Court ban\n\nThe Occupational Safety and Health Administration is planning to cancel its emergency order allegedly authorizing the agency to impose Joe Biden’s COVID-19 vaccine mandate on businesses with 100 or more workers after the mandate was struck down earlier this month by the U.S. Supreme Court.\n\nHowever, according to a report, the agency is still looking for a way to impose the mandate anyway, proving again that the Democrat Party, not the GOP, is the party of tyranny.\n\nAccording to a memo from OSHA scheduled to be published in the Federal Register, the mandate was officially withdrawn on Jan. 26, but again, the agency — under the direction of Biden’s leftist handlers — is already looking for a way to reimpose the vaccine and testing mandate.\n\n“OSHA is withdrawing the November 5, 2021, emergency temporary standard (ETS) which was issued to protect unvaccinated employees of large employers (100 or more employees) from the risk of contracting COVID–19 by strongly encouraging vaccination,” the memo said, as OSHA nevertheless continued to press companies to put their own vaccine mandate and testing regimes in place.\n\n“Although OSHA is withdrawing the Vaccination and Testing ETS as an enforceable emergency temporary standard, OSHA is not withdrawing the ETS to the extent that it serves as a proposed rule under section 6(c)(3) of the Act, and this action does not affect the ETS’s status as a proposal under section 6(b) of the Act or otherwise affect the status of the notice-and-comment rulemaking commenced by the Vaccination and Testing ETS. See 29 U.S.C. 655(c)(3),” the memo continued, which plainly indicates the agency intends to find a way around the SCOTUS ruling.\n\nThe Supreme Court ruled on January 13 to stay President Joe Biden’s order at least until the Sixth Circuit, which was picked to consolidate numerous legal challenges to the rule from across the country, can reach a decision on the case.\n\n“At question here isn’t whether or not the government has the right to enforce rules on its own employees. It’s whether or not unelected bureaucrats at OSHA have the right to coerce businesses into forcing PRIVATE employees to follow rules the government never had the right to impose in the first place,” Daily Wire CEO Jeremy Boreing said earlier in the month after his company won their case. “At the end of the day, the government has the POWER to make us all comply, but they do not have the RIGHT to make us all comply. That’s why we must keep fighting.”\n\nSixth Circuit Chief Judge Jeffrey Sutton wrote in a December dissent that the scope of Biden’s vaccine mandate is without parallel in the history of our country.\n\n“It is one thing to tell a worker to don a mask at the start of a hazard-filled shift and doff it at the end. It is quite another to tell a worker to vaccinate on the basis of a risk that exists whether he is on the clock or off and that amounts to a medical procedure that cannot be removed at the end of the shift,” he wrote.\n\n“Confirming the point, the Secretary of Labor has never imposed a vaccine mandate or for that matter a vaccinate-or-test mandate on American workers. The [Occupational Safety and Health Act] does not clearly give the Secretary power to regulate all health risks and all new health hazards, largely through off-site medical procedures, so long as the individual goes to work and may face the hazard in the course of the workday,” he added.\n\nThe Biden regime is picking up where Joe left off as vice president for ‘King’ Barack Obama, who also used unconstitutional imperial edicts to rule. Thankfully, Donald Trump managed to appoint and get a lot of constitutionalists seated on federal courts.", "opengraph": {"title": "Biden regime plans to continue pursuing COVID-19 vaccine mandate for businesses despite Supreme Court ban", "type": "article", "url": "https://www.joebiden.news/2022-01-28-biden-regime-to-continue-vaccine-mandate-businesses.html", "site_name": "Joe Biden News", "description": "The Occupational Safety and Health Administration is planning to cancel its emergency order allegedly authorizing the agency to impose Joe Biden’s COVID-19 vaccine mandate on businesses with 100 or more workers after the mandate was struck down earlier this month by the U.S. Supreme Court. However, according to a report, the agency is still looking […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/01/Joe-Biden-Russia-Sanctions.jpg"}, "tags": ["pandemic", "Joe Biden", "scotus", "big government", "covid-19", "vaccine wars", "fascism", "Supreme Court", "vaccine mandate", "private businesses", "vaccines", "tyranny", "obey", "traitors", "insanity", "health freedom", "OSHA"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2021-12-08-court-rules-against-government-vaccine-mandate-lawsuit.html", "https://public-inspection.federalregister.gov/2022-01532.pdf", "https://www.dailywire.com/news/osha-continues-to-pursue-vaccine-mandate-despite-supreme-court-loss", "http://www.tyranny.news", "https://www.dailywire.com/news/osha-continues-to-pursue-vaccine-mandate-despite-supreme-court-loss", "https://naturalnews.com/2021-12-08-court-rules-against-government-vaccine-mandate-lawsuit.html", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}