{"result_id": "181015", "URL": "https://www.joebiden.news/2023-02-09-free-speech-vs-disinformation-comes-to-head.html", "timestamp": "2023-04-25 16:08:52 CEST+0200", "meta": {"description": "In July 2021, as Covid-19 cases began to surge again, the surgeon general warned that misinformation had led to “avoidable illnesses and death” and urged the nation’s social media giants to do more to fight the sources of it. (Article republished from DNYUZ.com) “We’re asking them to operate with greater transparency and accountability,” the official, Dr. Vivek […]", "lang": "en", "keywords": "big government,Big Tech,Censorship,conspiracy,deception,disinformation,fascism,First Amendment,free speech,freedom,Government Slaves,Joe Biden,liberty,politics,rigged,Social media,speech police,suppressed,tech giants,thought police,tyranny,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.joebiden.news/2023-02-09-free-speech-vs-disinformation-comes-to-head.html", "encoding": "UTF-8"}, "image": null, "domain": "www.joebiden.news", "title": "Free speech vs. disinformation comes to a head", "cleaned_text": "Free speech vs. disinformation comes to a head\n\nIn July 2021, as Covid-19 cases began to surge again, the surgeon general warned that misinformation had led to “avoidable illnesses and death” and urged the nation’s social media giants to do more to fight the sources of it.\n\n“We’re asking them to operate with greater transparency and accountability,” the official, Dr. Vivek Murthy, said at the White House.\n\nFacebook’s vice president of global affairs, Nick Clegg, responded days later, sounding aggrieved. “It’s not great to be accused of killing people,” Mr. Clegg testily wrote in a private text message to Dr. Murthy.\n\nThe platform nonetheless announced a series of new policies and took down 17 accounts linked to the “Disinformation Dozen,” a disparate group of people who shared an estimated 65 percent of all anti-vaccination content online.\n\nThat exchange — one of dozens between officials and executives at Facebook, Google, Twitter and other social media companies that have spilled into public — is at the heart of a partisan legal battle that could disrupt the Biden administration’s already struggling efforts to combat disinformation.\n\nThe attorneys general of Missouri and Louisiana, both Republicans, have sued the White House and dozens of officials like Dr. Anthony S. Fauci, the nation’s top infectious-disease expert, accusing them of forcing the platforms to stifle the voices of its political critics in violation of the constitutional guarantee of free speech.\n\nThe outcome could help decide whether the First Amendment has become, for better or worse, a barrier to virtually any government efforts to stifle a problem that, in the case of a pandemic, threatens public health and, in the case of the integrity of elections, even democracy itself.\n\nGovernment officials have long urged social media companies to fight illegal or harmful content online, especially when it comes to terrorism or other criminal activity, like child sexual abuse or human trafficking.\n\nThe attorneys general, though, accuse the Biden administration of taking the effort too far. Their claims reflect a narrative that has taken root among conservatives that the nation’s social media companies have joined with government officials to discriminate against them, despite evidence showing the contrary — in Twitter’s case, for example, from its own study in 2021 of how political accounts were promoted.\n\n“When, in the public forum, there is speech they disagree with and does not align with their political narratives,” Andrew Bailey, Missouri’s new attorney general, said in an interview, referring to administration officials, “they then collude with and coerce Big Tech’s social media to take that speech down.”\n\nThe case, filed last year in U.S. District Court in Louisiana, has already succeeded in forcing the depositions of administration officials and the disclosure of scores of behind-the-scenes interactions with company executives. The administration’s efforts, the plaintiffs say, amounted to “open and explicit censorship programs.”\n\nYet the growing trail of internal communications suggests a more convoluted and tortured struggle between government officials frustrated by the spread of dangerous falsehoods and company officials who resented and often resisted government entreaties. When Mr. Clegg responded to Dr. Murthy about Facebook’s efforts, he sounded defensive and also frustrated.\n\n“I imagine you and your team are feeling a little aggrieved — as is the FB team,” he wrote after the company released a report challenging the administration’s criticisms.\n\nPaul M. Barrett, deputy director of the Center for Business and Human Rights at New York University’s Stern School of Business, who has studied the companies’ content moderation policies, said there was “no systematic evidence any place of a broad methodical plot” between the government and the platforms to censor.\n\nOn the contrary, social media platforms often appear reluctant to block political content, especially from Republicans, even when it appears to violate their own policies of abusiveness.\n\n“It’s not that they’re going after conservatives,” Mr. Barrett said. “They’re fearing conservative backlash.”\n\nA White House spokeswoman, Robyn M. Patterson, said in a written response that the administration remained focused on ensuring that Americans received “fact-based information” about Covid-19 and reiterated President Biden’s call for Congress to reform Section 230 of the Communications Decency Act, a law that broadly shields internet companies from liability for what users post on their sites.\n\n“We have also never shied away from the view that social media platforms also have a role to play by enforcing their own policies to address misinformation and disinformation,” she wrote.\n\nBig Tech has now become a favorite Republican target of attack, especially after Facebook and Twitter closed numerous accounts linked to the violence on Capitol Hill on Jan. 6, 2021, including former President Donald J. Trump’s. (The two services have reactivated Mr. Trump’s accounts in recent months.)\n\nFlorida and Texas have since enacted laws that would bar platforms from removing content based on political points of view. Their leaders have portrayed themselves as defenders of free speech, even as they have moved in other cases to restrict public discussion in schools, for example, of critical race theory and L.G.B.T.Q. issues.\n\nThe new Republican majority in the House has also formed a select subcommittee to investigate what its chairman, Representative Jim Jordan of Ohio, said recently were routine government violations of the First Amendment’s protections of assembly, religion and speech.\n\nElon Musk, the new owner of Twitter, has sought to make a similar case with the release of internal messages detailing the debates that executives had before he took over last year.\n\nThe messages, called the “Twitter Files,” have offered a selective and partly redacted view of the company’s interaction with government and law enforcement officials to block or restrict prominent accounts. They included revelations about the internal debate at Twitter over blocking links to a New York Post article about Hunter Biden, the president’s son, in 2020, during the previous presidential administration.\n\nIn a tweet, Mr. Musk said he had purchased “both a social media company and a crime scene.”\n\nThe “Twitter Files” have a political and, perhaps for Mr. Musk, a commercial agenda. The lawsuit against the Biden administration unfolding in a small town in northern Louisiana could, if successful, have far greater legal consequences.\n\nThe case is being heard by Terry A. Doughty, the chief U.S. district judge in the Western District of Louisiana. The court, according to a report late last year by Bloomberg Law, has become a favored venue for conservative attorneys general challenging the Biden administration.\n\nJudge Doughty, appointed by Mr. Trump in 2017, has previously blocked the Biden administration’s national vaccination mandate for health care workers and overturned its ban on new federal leases for oil and gas drilling. In this case, he has granted the plaintiffs’ request for extensive discovery even before considering their request for a preliminary injunction.\n\nThe lawsuit aims at only the government, not the technology companies themselves. It names dozens of officials in 11 agencies, including the Department of Health and Human Services, the State Department, the F.B.I. and the Census Bureau.\n\nAmong those deposed was Dr. Fauci, who served for 38 years as the director of the National Institute of Allergy and Infectious Diseases, part of the National Institutes of Health. In a full day of questioning in November, he repeatedly said he was not involved in any discussions to censor content online.\n\n“I do not get involved in any way with social media,” he said. “I don’t have an account. I don’t tweet, I don’t Facebook, and I don’t pay attention to that.”\n\nIn addition to the States of Missouri and Louisiana, the plaintiffs include two prominent epidemiologists who questioned of the government’s handling of the pandemic, Dr. Jayanta Bhattacharya and Martin Kulldorff; Dr. Aaron Kheriaty, a psychiatry professor dismissed by the University of California, Irvine, for refusing to have a Covid vaccination; Jill Hines, a director of Health Freedom Louisiana, an organization that has been accused of disinformation; and Jim Hoft, the founder of Gateway Pundit, a right-wing news site that claims in its promotions that “for 15 years, we’ve been fighting Big Tech and Leftists who want to shut us down.”\n\nJenin Younes, a lawyer with the New Civil Liberties Alliance, an organization representing the individual plaintiffs, said the government had sought to sidestep free-speech rights by forcing private companies to take action on discourse that is otherwise constitutionally protected.\n\n“It can’t use third parties to do what it can’t do,” she said in an interview in the organization’s Washington office.\n\nThere is no question the Biden administration has used the bully pulpit on any number of issues, including urging Americans to get vaccinated and calling on the platforms to restrict accounts that sought to dissuade them.\n\nThe legal challenge for the plaintiffs is to show that the government used its legal or regulatory power to punish the companies when they did not comply, which they often did not.\n\n“No, this isn’t feasible/we don’t do this,” one Twitter executive wrote, according to one of the Twitter Files, after Representative Adam Schiff, the California Democrat who led the House’s Permanent Select Committee on Intelligence, urged the company to remove accounts posting information about committee staff members.\n\nAs evidence of pressure, the lawsuit cites instances when administration officials publicly suggested that the companies could face greater regulation. For example, they pointed to warnings that the government could revise the liability shield provided under Section 230.\n\nThe White House administration could not repeal the law on its own, however, and Congress has shown little appetite for revisiting the issue, despite calls by Mr. Biden and others for greater accountability of social media companies.\n\nMany of the examples cited in the lawsuit also involved official actions taken during the Trump administration, including efforts to fight disinformation ahead of the 2020 presidential election and by Mr. Biden’s allies at a time when they did not hold power.\n\nMr. Bailey, the Missouri attorney general, said the social media platforms had become “open public forums” where virtually any debate should be able to thrive.\n\n“We need more speech,” he said. “We need free and open speech in those public forums,” he said. “When you’ve got the government targeting specific political speech, to take it off that forum, that becomes the problem.”\n\nThe post Free Speech vs. Disinformation Comes to a Head appeared first on New York Times.", "opengraph": {"title": "Free speech vs. disinformation comes to a head", "type": "article", "url": "https://www.joebiden.news/2023-02-09-free-speech-vs-disinformation-comes-to-head.html", "site_name": "Joe Biden News", "description": "In July 2021, as Covid-19 cases began to surge again, the surgeon general warned that misinformation had led to “avoidable illnesses and death” and urged the nation’s social media giants to do more to fight the sources of it. (Article republished from DNYUZ.com) “We’re asking them to operate with greater transparency and accountability,” the official, Dr. Vivek […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2023/02/Censorship-Censored-Freedom-Tape-Mouth.jpg"}, "tags": ["conspiracy", "big government", "speech police", "deception", "White House", "First Amendment", "Big Tech", "Joe Biden", "tech giants", "politics", "Social media", "thought police", "disinformation", "suppressed", "Government Slaves", "fascism", "rigged", "liberty", "Censorship", "tyranny", "freedom", "free speech"], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/2021/07/15/us/politics/surgeon-general-vaccine-misinformation.html", "https://dnyuz.com/2023/02/09/free-speech-vs-disinformation-comes-to-a-head/", "https://counterhate.com/research/the-disinformation-dozen/", "https://blog.twitter.com/en_us/topics/company/2021/rml-politicalcontent", "https://about.fb.com/news/2021/07/support-for-covid-19-vaccines-is-high-on-facebook-and-growing/", "https://www.nytimes.com/2023/01/19/technology/supreme-court-online-free-speech-social-media.html", "https://www.nytimes.com/2022/03/18/us/dont-say-gay-bill-florida.html", "https://judiciary.house.gov/media/press-releases/jim-jordan-why-select-subcommittee-weaponization-federal-government-necessary", "https://www.thefp.com/p/twitters-secret-blacklists", "https://www.nytimes.com/2020/10/16/technology/twitter-new-york-post.html", "https://news.bloomberglaw.com/us-law-week/western-louisiana-becomes-gop-home-court-for-suits-against-biden-21", "https://ago.mo.gov/docs/default-source/press-releases/135885afauci112322_full_redacted.pdf?sfvrsn=35f4a425_2", "https://www.ocregister.com/2022/11/24/appeals-court-upholds-dismissal-of-uc-professors-covid-vaccination-challenge/", "https://www.theadvocate.com/baton_rouge/news/covid-vaccine-misinformation-ran-rampant-during-this-louisiana-senate-hearing/article_9bce972a-c31e-11eb-ad63-578068388d5f.html", "https://www.nytimes.com/", "https://www.nytimes.com/", "https://dnyuz.com/2023/02/09/free-speech-vs-disinformation-comes-to-a-head/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2023-02-09-free-speech-vs-disinformation-comes-to-head.html&linkname=Free%20speech%20vs.%20disinformation%20comes%20to%20a%20head", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}