{"result_id": "181039", "URL": "https://joebiden.news/2022-06-02-white-house-climate-extremist-supply-chain-advisor.html", "timestamp": "2023-04-25 16:08:57 CEST+0200", "meta": {"description": "Joe Biden’s new supply chain czar is a globalist through and through. Betty Cremmins, the White House’s new advisor to supply chain issues, is a bedfellow alum of the World Economic Forum (WEF). She headed up numerous climate change initiatives while at the WEF and is also a former fellow at a think tank chaired […]", "lang": "en", "keywords": "Betty Cremmins,big government,climate alarmist,climate extremist,conspiracy,corruption,deception,globalists,great reset,Hunter Biden,insanity,Joe Biden,lunatics,propaganda,supply chain advisor,White House,world economic forum", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2022-06-02-white-house-climate-extremist-supply-chain-advisor.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "White House hires WEF climate extremist and Hunter Biden think tank employee as new “supply chain advisor”", "cleaned_text": "White House hires WEF climate extremist and Hunter Biden think tank employee as new “supply chain advisor”\n\nJoe Biden’s new supply chain czar is a globalist through and through.\n\nBetty Cremmins, the White House’s new advisor to supply chain issues, is a bedfellow alum of the World Economic Forum (WEF). She headed up numerous climate change initiatives while at the WEF and is also a former fellow at a think tank chaired by Hunter Biden.\n\nCremmins’ official title is “Director for Sustainable Supply Chains” at the White House, a title she has officially held since February. For the past several months, she has supposedly been overseeing America’s supply chain woes, which are, in part, a consequence of the Biden regime’s Wuhan coronavirus (Covid-19) “vaccine” mandates for truckers and many other American workers.\n\nRight before she was appointed to this position, Cremmins was a National Security Fellow and Climate Affiliate Group Co-Lead at the Truman National Security Project. This left-leaning, Washington, D.C.-based foreign policy network has had Hunter Biden on its board since 2011.\n\nNow-archived versions of the group’s website reveals that Hunter Biden progressively rose to the top of the pyramid, eventually gaining the role as vice-chairman of the board. He served there until at least March of 2019, which means his tenure there overlapped with Cremmins’ fellowship.\n\nThe Biden regime is crawling with WEF-tied globalists\n\nAs for Cremmins’ work at the WEF, keep in mind that the Klaus Schwab-run globalist organization has as part of its mission the abolishment of private property ownership. The WEF also used both the Wuhan coronavirus (Covid-19) plandemic and climate change to push its “Great Reset” agenda.\n\nOne WEF initiative that Cremmins led was called 1t.org. It involved support for the United Nations Decade on Ecosystem Restoration, and she led it from June of 2020 to July of 2021. It sought to:\n\n“… conserve, restore and grow one trillion trees by 2030.”\n\nCremmins was later promoted to the Lead on Engagement for 1t.org, as well as the WEF Natural Climate Solutions Alliance, which has among its goals the combatting of climate change through “voluntary or compliance action” with businesses, governments and investors.\n\nSeveral articles on the WEF website pushing climate change agendas on the private sector bear Cremmins’ name as the author. One post from July 29, 2021, contains the following statement:\n\n“Beyond the disruptive and tragic effects of the COVID-19 pandemic, the world finds itself facing a crisis like no other in every corner of the planet; the accelerated destruction of nature and the impacts of climate change. Although these issues have often been regarded in silos, we cannot ignore that they are inextricably linked.”\n\nCremmins also worked at the Carbon Disclosure Project (CDP), which is described as a “not-for-profit charity that runs the global disclosure system for investors, companies, cities, states and regions to manage their environmental impacts.”\n\nCDP runs its own supply chain program where Cremmins worked as its Senior Account Manager. Her role involved prioritizing “sustainability” while combatting climate change at the world’s leading multinational corporations.\n\nIn a slideshow presentation delivered by Cremmins, another stated goal of the CDP is “[t]o transform the global economic system to prevent dangerous climate change.”\n\nThe National Pulse is credited with unearthing this information, which just goes to show that the Biden regime is infiltrated with WEF-linked activists who are advocating for Chinese Communist Party (CCP)-style “re-education camps.”\n\nKeep in mind that in the past, the WEF has hinted at the possible use of a global cyber “pandemic” to aid in the implementation of its Great Reset agenda. Is the Biden regime planning for this type of scenario in the near future?\n\nMore related news about the Biden regime can be found at Corruption.news.", "opengraph": {"title": "White House hires WEF climate extremist and Hunter Biden think tank employee as new “supply chain advisor”", "type": "article", "url": "https://www.joebiden.news/2022-06-02-white-house-climate-extremist-supply-chain-advisor.html", "site_name": "Joe Biden News", "description": "Joe Biden’s new supply chain czar is a globalist through and through. Betty Cremmins, the White House’s new advisor to supply chain issues, is a bedfellow alum of the World Economic Forum (WEF). She headed up numerous climate change initiatives while at the WEF and is also a former fellow at a think tank chaired […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2022/06/Joe-and-Hunter-Biden.jpg"}, "tags": ["climate extremist", "conspiracy", "Joe Biden", "big government", "climate alarmist", "great reset", "Hunter Biden", "White House", "world economic forum", "globalists", "insanity", "Betty Cremmins", "deception", "lunatics", "supply chain advisor", "corruption", "propaganda"], "tweets": [], "movies": [], "links": ["https://thenationalpulse.com/2022/05/31/biden-supply-chain-director-is-hunter-biden-linked-wef-alum/", "https://naturalnews.com/2021-10-06-is-the-american-food-supply-chain-collapsing.html", "https://naturalnews.com/2021-04-14-world-economic-forum-global-cyber-pandemic-reset.html", "http://corruption.news", "https://thenationalpulse.com/2022/05/31/biden-supply-chain-director-is-hunter-biden-linked-wef-alum/", "https://naturalnews.com/2021-10-06-is-the-american-food-supply-chain-collapsing.html", "https://naturalnews.com/2021-04-14-world-economic-forum-global-cyber-pandemic-reset.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2022-06-02-white-house-climate-extremist-supply-chain-advisor.html&linkname=White%20House%20hires%20WEF%20climate%20extremist%20and%20Hunter%20Biden%20think%20tank%20employee%20as%20new%20%E2%80%9Csupply%20chain%20advisor%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}