{"result_id": "181040", "URL": "https://joebiden.news/2020-12-10-biden-federal-mask-mandate-immediately-after-inauguration.html", "timestamp": "2023-04-25 16:08:58 CEST+0200", "meta": {"description": "Democratic nominee Joe Biden said that, on the first day of his administration, he will “follow the science” and sign a federal mask mandate. This is being touted as the first step in his 100-day plan to fight the Wuhan coronavirus (COVID-19) pandemic. “I’m absolutely convinced that in 100 days, we can change the course […]", "lang": "en", "keywords": "Anthony Fauci,AstraZeneca,badhealth,badmedicine,Biden,Big Pharma,coronavirus,covid-19,democrats,face masks,Fauci,federal mask mandate,government,health freedom,infections,Joe Biden,mask mandate,mask order,medical fascism,Medical Tyranny,Moderna,obey,outbreak,pandemic,Pfizer,superbugs,vaccines,virus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://joebiden.news/2020-12-10-biden-federal-mask-mandate-immediately-after-inauguration.html", "encoding": "UTF-8"}, "image": null, "domain": "joebiden.news", "title": "Biden wants to enact a federal a mask mandate immediately after inauguration", "cleaned_text": "Biden wants to enact a federal a mask mandate immediately after inauguration\n\nDemocratic nominee Joe Biden said that, on the first day of his administration, he will “follow the science” and sign a federal mask mandate. This is being touted as the first step in his 100-day plan to fight the Wuhan coronavirus (COVID-19) pandemic.\n\n“I’m absolutely convinced that in 100 days, we can change the course of the disease and change life in America for the better,” said Biden on Tuesday, Dec. 8, as he began introducing several key health advisors who he plans to appoint for his administration.\n\n“My first 100 days, I’m going to ask for a masking plan,” he added. “Everyone for the first 100 days of my administration to wear a mask.”\n\nDuring his announcement, Biden said that his new mask plan is going to require the support of the American people. “We need your help,” he said. “Wear a mask for just 100 days.” (Related: Biden wants to enact a national mask mandate, but has no legal authority to enforce such an order.)\n\nThis is not the first time that Biden has floated the possibility of imposing a nationwide mask order on the American populace. He previously scaled back his plans after he found out that he may not have the authority to authorize such an order, since public health directives are the purview of state governments.\n\nBiden has pledged to issue an order that will make wearing face masks mandatory in federal buildings and on transportation that crosses state lines, such as buses and airplanes.\n\nAfter he does this, Biden said that he will be working with governors and mayors to get them to enact mask mandates in their states and cities. “We’re going to require masks wherever possible.”\n\nThirty-eight states and the District of Columbia currently have mask mandates. The 12 states that do not are Alaska, Arizona, Florida, Georgia, Idaho, Mississippi, Missouri, Nebraska, Oklahoma, South Carolina, South Dakota and Tennessee.\n\nBiden emphasized that the mask mandate is the opening salvo in his three-point plan to deal with the coronavirus pandemic in just 100 days. After he announced the mask mandate and the potential members of his pandemic response team, the Democratic nominee pledged to vaccinate the entire country and then to open schools back up.\n\n“I’m absolutely convinced that in 100 days, we can change the course of the disease and change life in America for the better.”\n\nIn his vaccination plan, Biden vowed to get “at least 100 million COVID-19 vaccine shots” within just 100 days in office. If the coronavirus vaccine requires two shots, this means Biden plans to get at least 50 million people vaccinated.\n\nHe said that he will “follow the guidance of scientists” and make sure that the vaccines first go to at-risk populations, including people in long-term care facilities and health care workers.\n\nOnce the initial vaccinations have been sent out, Biden then stressed that his next national priority will be “to get our kids back into school and keep them in school.”\n\nHe then said that this process will require enough funding from Congress to protect students as well as education workers, and it will require states and cities to support his public health recommendations so that the schools can remain open.\n\nThe bill Congress is currently debating is a $900 billion COVID-19 economic relief bill that is intended to support struggling Americans and to get small businesses to reopen.\n\nBiden emphasized that his coronavirus plan was made after extensive consultations with Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases. The Democratic nominee has even tapped Fauci to serve as his chief medical adviser on the coronavirus.\n\nBy the end of his speech, Biden called on President Donald Trump to purchase the vaccines it has negotiated with pharmaceutical companies Pfizer and Moderna, and to work with big pharma to make sure plenty more shots of the vaccine are manufactured for export as well as for domestic consumption.\n\n“Our preliminary review of Trump administration vaccine distribution plans confirms media reports,” warned Biden. “Without urgent action by this Congress this month … there is a real chance that after an early round of vaccinations, the effort will slow and stall.”\n\nBy late January, three pharmaceutical companies – Pfizer, Moderna and AstraZeneca – could potentially be given emergency use authorization by the Food and Drugs Administration (FDA). Other companies working on coronavirus vaccines, like Johnson & Johnson, may follow soon after.\n\nBiden wants to expand CDC power to track down coronavirus patients\n\nOther parts of Biden’s health plan include protecting and restoring ObamaCare, expanding the Centers for Disease Control and Prevention’s (CDC) ability to track coronavirus patients, and to make all COVID-19 testing in the country free.\n\nBiden has also pushed to restore and protect the Affordable Care Act. He previously talked about how he is afraid that the confirmation of Supreme Court Justice Amy Coney Barrett could lead to the dismantling of former President Barack Obama’s healthcare plan. Biden has talked about how important ObamaCare is to fighting the pandemic.\n\nEarlier this year, Trump’s Department of Health and Human Services attempted to take away the CDC’s contact tracing powers, however, this received backlash from public health officials, and the administration was forced to relent.\n\nIf Biden is allowed to enter the White House, he not only plans to protect the CDC’s ability to track down coronavirus patients, he wants to expand their power to conduct their contact tracing program.\n\nHe has stated that he wants the CDC to establish “real-time dashboards” for tracking every single coronavirus-related hospital admission in the country, especially if these are ICU and emergency admissions. Along with this, he wants to work with hospital chains and hospital equipment suppliers to supply the country with enough personal protective equipment.\n\nFinally, the Democratic nominee has also pledged to make all testing free for all Americans, whether or not they have health insurance.\n\n“We should be investing a great deal more money in testing and tracing,” he said during an interview with CBS News. “It’s not enough to know in seven days or five days or three days whether or not you have COVID.”\n\nLearn more about the progress of the coronavirus pandemic in the country, as well as the plans federal, state and local governments have to protect Americans against it at Pandemic.news.", "opengraph": {"title": "Biden wants to enact a federal a mask mandate immediately after inauguration", "type": "article", "url": "https://www.joebiden.news/2020-12-10-biden-federal-mask-mandate-immediately-after-inauguration.html", "site_name": "Joe Biden News", "description": "Democratic nominee Joe Biden said that, on the first day of his administration, he will “follow the science” and sign a federal mask mandate. This is being touted as the first step in his 100-day plan to fight the Wuhan coronavirus (COVID-19) pandemic. “I’m absolutely convinced that in 100 days, we can change the course […]", "image": "https://www.joebiden.news/wp-content/uploads/sites/375/2020/12/Joe-Biden-Mask-Trouble.jpg"}, "tags": ["federal mask mandate", "government", "pandemic", "mask mandate", "Big Pharma", "outbreak", "Pfizer", "Anthony Fauci", "covid-19", "Biden", "coronavirus", "obey", "virus", "face masks", "Joe Biden", "Fauci", "infections", "Medical Tyranny", "mask order", "medical fascism", "Moderna", "AstraZeneca", "superbugs", "vaccines", "democrats", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.independent.co.uk/news/world/americas/us-politics/biden-mask-mandate-coronavirus-covid-b1768238.html", "https://www.newsweek.com/biden-impose-mask-mandate-day-one-presidency-executive-order-1553285", "https://www.naturalnews.com/2020-12-06-joe-biden-wants-national-mask-mandate.html", "https://www.cbsnews.com/news/biden-call-for-masks-first-100-days-in-office-inauguration/", "https://www.foxnews.com/politics/bidens-3-part-plan-to-tackle-the-coronavirus-masks-vaccinations-opening-schools", "https://vaccines.news/", "https://edition.cnn.com/2020/12/08/politics/biden-100-million-vaccines-100-days/index.html", "https://www.marketwatch.com/story/joe-bidens-pandemic-plan-2020-11-07", "https://pandemic.news/", "https://www.independent.co.uk/news/world/americas/us-politics/biden-mask-mandate-coronavirus-covid-b1768238.html", "https://www.newsweek.com/biden-impose-mask-mandate-day-one-presidency-executive-order-1553285", "https://www.cbsnews.com/news/biden-call-for-masks-first-100-days-in-office-inauguration/", "https://www.foxnews.com/politics/bidens-3-part-plan-to-tackle-the-coronavirus-masks-vaccinations-opening-schools", "https://edition.cnn.com/2020/12/08/politics/biden-100-million-vaccines-100-days/index.html", "https://www.marketwatch.com/story/joe-bidens-pandemic-plan-2020-11-07", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fjoebidennews%2F2020-12-10-biden-federal-mask-mandate-immediately-after-inauguration.html&linkname=Biden%20wants%20to%20enact%20a%20federal%20a%20mask%20mandate%20immediately%20after%20inauguration", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}