{"result_id": "183041", "URL": "https://www.larouchepac.com/20200413/defeating-pandemic-part-ii-public-health-measures", "timestamp": "2023-04-25 16:11:35 CEST+0200", "meta": {"description": "In Part I, we laid out our overview of tackling the global pandemic from a global standpoint. Here in Part II, we will discuss necessary health measures in more detail. Part III will take up the physical, economic, scientific, and political changes needed to make these measures possible on a...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20200413/defeating-pandemic-part-ii-public-health-measures", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Defeating the Pandemic, Part II: Public Health Measures", "cleaned_text": "In Part I, we laid out our overview of tackling the global pandemic from a global standpoint. Here in Part II, we will discuss necessary health measures in more detail. Part III will take up the physical, economic, scientific, and political changes needed to make these measures possible on a global scale.\n\nThe Institute for Health Metrics and Evaluation (University of Washington School of Medicine) estimates, as of April 8, that a peak of approximately 100,000 hospital beds, 20,000 ICU beds, and over 16,000 ventilators will be required, based on current rates of spread and medical care. According to a survey by the American Hospital Association, in 2018 there were just shy of 800,000 staffed beds in U.S. community hospitals, and around 70,000–80,000 adult ICU beds. Since these beds are not typically empty, just waiting for patients to need them, the large number of beds does not mean that there will not be shortages, especially local shortages, as the number of hospitalized patients reaches its peak.\n\nThe current level of total hospital beds in the United States, in its broadest measure, is 2.8 per 1,000 people, barely one-third the 1970 level of 7.9 beds. On the basis of “community hospital beds,” which most of the population uses, there are only 2.4 beds per 1,000 people.\n\nConsider the power, water, sanitation, and transportation requirements of hospitals. Using the United States as a case study, an additional 575,000 beds would be required to bring the national average to 4.5 per 1,000 people. According to a 2007 report by the U.S. Energy Information Administration (EIA), the largest 3,040 hospitals, with approximately 915,000 beds (at the time of the study), used about 458 trillion BTUs of energy per year: 194 trillion BTUs in the form of electricity (57 billion kWh) and the remainder in the form of natural gas, district heating, and fuel oil.\n\nUsing this figure, hospitals with an additional 575,000 beds would require about 36 billion kWh of electricity per year. That translates into power plants supplying 5,000 MW at an 80% capacity factor. This would be the equivalent of five large nuclear reactors or two Grand Coulee Dams (running at average capacity). And that doesn’t even take into account the natural gas requirements!\n\nIn the same report, EIA estimated that these 3,040 large hospitals used 133 billion gallons of water per year. Hospitals with an additional 575,000 beds would require an additional 84 billion gallons per year. For a sense of perspective, the world’s largest proposed desalination plant, located in the Kingdom of Saudi Arabia, would provide about 100 billion gallons of desalinated water per year.\n\nTo bring online another 15 to 20 million hospital beds — to bring the world hospital bed count to the Hill–Burton level of 35 million hospital beds — would require about 100,000 MW of generating capacity, as could be supplied by 100 large nuclear power plants or nearly 2,000 small scale modular nuclear plants. Global water requirements for these new hospitals would require about 4 trillion gallons annually, which is about half the volume of water contained by the Three Gorges Dam.\n\nHospital beds aren’t much good without doctors and nurses. The current crisis is seeing retired health care workers coming back to work, and there are cases of medical schools offering early graduation for students in their final year if they are willing to immediately go to work as doctors. As virus hotspots move around the world, healthcare providers able to travel should be encouraged to work in other regions and countries.\n\nUsing influenza pandemic scenarios considered in a 2005 planning study by the U.S. Department of Health and Human Services, there could be several million hospitalizations in the United States, with up to a million or more patients requiring ICU treatment and half a million requiring mechanical ventilators. Projecting from these figures to the present world population, 10 million people could require ventilators, with an estimated 1 million each in Africa, Latin America, and India.\n\nPersonal Protective Equipment (PPE) is used at health care facilities to prevent patients from transmitting disease to health care workers or other patients. This includes gloves, respirators and masks, face visors, goggles, gowns, hair coverings, and full-body suits. Without the high-quality filtration afforded by a N95 (or equivalent) certified mask, workers are put at serious risk of catching the disease themselves. Shortages are causing enormous price increases and tensions among nations seeking to produce or to import equipment from those nations that manufacture it.\n\nAn industrial gear-up is required to ensure that adequate supplies of PPE are available.\n\nThe physical layout of a hospital or other care facility can have an enormous impact on the quantity of PPE required. In a healthcare setting that includes only confirmed COVID-19 cases, care need not be taken to avoid transmitting the disease from one patient to another, and health care workers can wear protective equipment through an entire shift. But if nurses must attend to patients of mixed COVID-19 status, best practices mandate that they equip themselves with PPE before entering a COVID-19 patient room, and then dispose of the equipment immediately upon leaving, to avoid carrying the virus to the uninfected patients they will next be visiting. With this setup, ten sets of PPE could be consumed per day per patient room. Thus, health care facility arrangements that separate COVID from non-COVID patients can permit significant savings of PPE. Accurately separating these patients requires testing.\n\nA properly fitted N95 respirator protects the wearer from 95% of particles over 0.3 microns in size. While the SARS-CoV-2 coronavirus itself is smaller than this size, the virions do not float around entirely on their own and are effectively blocked by N95 respirator masks.\n\nA 2015 study by the U.S. National Library of Medicine, part of the National Institutes of Health, examining three scenarios of demand, estimated that if 20–30% of the U.S. population were to become ill, some 4 billion N95 respirator masks would be required. Extrapolating this figure to the world’s population, the global requirements would be on the order of 100 billion N95 masks for the duration of the outbreak: some 15 billion in Africa, 10 billion in Latin America, and 20 billion in India.\n\nDevelopments in testing technology now allow for thousands of tests to be processed per day by a single piece of equipment in a dedicated laboratory (high-throughput) as well as for rapid test results at the point of care. The development by Abbott Laboratories of a portable testing unit capable of delivering a positive result in as little as 5 minutes or a negative result within a quarter hour greatly speeds the process of processing patients presenting with possible COVID symptoms, allowing them to be sent to the appropriate COVID-only or non-COVID facility or hospital wing.\n\nEveryone confirmed to have the novel coronavirus should have the opportunity to be isolated from their neighbors, roommates, and families. This means that asymptomatic or mildly symptomatic individuals must be offered free room and board accommodations in facilities designed to keep them isolated and healthy. Hotels — which have occupancy rates in the single digits — could be repurposed to this effect, with adequate PPE supplies and training for a reduced hospital staff. The types of shelter arrangements provided following natural disasters would also be appropriate for these individuals.\n\nThis was the approach taken in Wuhan, in which every positive confirmed case was isolated under medical supervision, whether in a hospital, gymnasium, or hotel. Mild and asymptomatic cases could then socialize and engage in group exercise classes — far better for their mental health than hiding in a room at home, fearful of infecting their loved ones! Two negative nucleic acid tests for the virus, taken 24 hours apart, were required before people could leave the isolation facilities. This form of isolation, going beyond staying (and infecting) at home, helped drive Wuhan’s eventual victory over the virus.\n\nIn fact, China’s achievement in Wuhan remains the most successful model to date for combating the coronavirus.\n\nSince anywhere from one-quarter to one-half of those infected with the coronavirus display extremely mild symptoms or no symptoms at all, it is impossible to rely on symptoms to locate all cases of the disease. Large-scale community testing — emphatically including for those without symptoms — will make it possible to isolate cases in an effective and targeted way and make contact-tracing more manageable. South Korea tested one in 170 people and used this knowledge to trace contacts, alert residents via text messages of nearby cases and hotspots, and reduce the spread of the disease.\n\nThe large-scale shutdowns currently used to crush the spread of the coronavirus do carry a toll, both economic and social. While these shutdowns are appropriate given a relatively low level of testing, truly large-scale testing will make it possible to make intelligent decisions about lifting restrictions.\n\nTo test the world at the South Korea level of one in 170, would require 45 million tests. But many people will require more than one test: Examples include a person who has tested negative but who has had recent potential exposure or a person in an isolation facility who is being tested to make sure it is safe to discharge them. To perform 60 million tests (factoring in some people being tested multiple times) at current worldwide testing rates would take the better part of a year.\n\nThe nasal swab tests most widely used at present operate by detecting components of the virus’s genome. These are referred to as PCR tests, named for the polymerase chain reaction process by which the genetic material is multiplied by 1,000,000 to 1,000,000,000 times to allow it to be detected.\n\nAnother kind of test would use blood, rather than swabs, and would detect, instead of the virus itself, antibodies produced by the body to fight the disease. These antibodies are present in people who were once infected but have since recovered. A virus test would come back negative, but an antibody test would be positive. With these tests, it will be possible to identify potential blood plasma donors (for convalescent blood serum therapy) and identify people who are no longer infected and likely to be immune. If further research reveals that the immunity enjoyed by those who have recovered is long-lasting, perhaps such people could be allowed to return to work, or be recruited to serve in the community as coordinators of meal deliveries, workers in isolation facilities for mild cases, etc.\n\nYet another form of testing could use samples of untreated sewage to detect the general presence and prevalence of the virus in a community.\n\nPharmaceutical interventions can save lives and reduce disease in several ways. Vaccines “teach” the immune system about a pathogen, allowing it to immediately fight it when encountered in the future. Antiviral medications can target the virus itself, by preventing its entry into cells or its replication. Antibodies, derived from the blood of recovered patients or produced in a laboratory, can help the immune system fight the virus. Combating cytokine storms is a fourth approach, which could reduce the deadly respiratory effects of the virus, while not fighting the virus itself.\n\nReaders eager to learn more can visit the accompanying information page “Pharmaceutical Interventions to Defeat COVID-19.”\n\nVaccines are used in advance to protect people from contracting a disease, by \"priming the pump\" of the immune system to get practice in defeating something that is similar to the pathogen but does not itself cause harm. People who are vaccinated against a disease are able to quickly fight it off if they come in contact with it, since their bodies are already prepared to do so.\n\nThe first phase of research is to establish the safety of the new vaccine. Researchers must make sure that the vaccine doesn’t itself cause problems. If study results are promising, the next phases of study will determine the effectiveness of the vaccine. Then manufacturing capabilities must be developed to produce the specific treatment. These multiple stages are the reason that a timespan of 12-18 months is given for vaccine development and production.\n\nOnce the virus has taken hold in the body, treatments can prevent it from entering cells, prevent it from replicating, or target it for destruction by the immune system.\n\nSeveral already existing medications are undergoing testing:\n• Avigan (favilavir / favipiravir) — an anti-influenza drug developed by Fujifilm in Japan, it is now included in China’s treatment plan and is being studied in several countries, including the United States, China, and Japan.\n• Remdesivir — undergoing trials in several nations, this drug was originally developed to combat Ebola by Gilead Sciences in the U.S., a company with significant experience treating other viral infections.\n• Plaquenil (hydroxychloroquine) and chloroquine — originally used to treat malaria, these drugs have been used for auto-immune disorders as well. Trials are underway around the world, and many hospitals are already using hydroxychloroquine for their COVID-19 patients. Hundreds of millions of tablets are being produced even as its effectiveness is being studied.\n\nAntibodies are structures created by the human immune system, which attach to pathogens, deactivating them, preventing their entry into cells, or marking them for destruction by the immune system. They can be created in the laboratory by using yeast, mice, or other animals as “factories.” At least a dozen groups are working on developing antibodies against the coronavirus.\n\nWhen someone recovers from the coronavirus, their blood continues to contain antibodies created by their own immune system to defeat the virus. Their donated blood can be transfused into severely ill patients to help their bodies fight the disease. U.S. hospital use of this technique began in the last weekend in March, and appeals on social media are now recruiting recovered COVID-19 survivors to donate their blood to help others.\n\nThere are some drugs that do not target the virus itself, but seek to reduce the death rate and symptoms of COVID-19.\n\nAn advanced stage of the disease, in which severe and life-threatening respiratory problems develop, is associated with an excessive response by the body’s own immune system, in which the patient’s body damages healthy lung cells in addition to those harboring the virus. Two antibody drugs already approved for other conditions — Kevzara (sarilumab) and Actemra (tocilizumab) — are being studied and used to reduce this excessive immune system activity. Entirely new antibodies are also being developed for this purpose.\n\nSteroids can be used to reduce the immune auto-response, although they have the side effect of weakening the immune system. They are also becoming widely used by physicians.\n\nSociety must maintain stability, and people who are ill must be able to follow public health measures.\n\nIt is impossible to require people to remain at home if they rely on their daily work to supply their necessities of life. It is impossible to require homeless people to remain at home.\n\nEmployees must be provided with sick leave time to allow them to quarantine themselves to arrest the spread of the virus. Loans and grants must be made to businesses to allow them to continue to pay employees unable to work. Unemployment protection should be expanded to include those in nontraditional employment situations. To protect those who work informally and could not be expected to benefit from such programs, direct assistance in the form of basic income payments and the supply of necessities such as food and basic supplies is required. It is important that the isolation facilities for positive cases include people without homes, and that food and other necessities be included to allow everyone to isolate safely.\n\nBasic income to ensure the necessities of life will not be sufficient to pay mortgages, rent, utilities and car payments. A moratorium on foreclosures, evictions and utility shutoffs (including internet and telephones) must be implemented during the time of lockdown, and payments on mortgages and personal loans should be made optional. Businesses negatively affected by these policies will be able to apply for aid.\n\nThe world’s financial system, particularly that in the trans-Atlantic world, includes quadrillions of dollars in financial instruments that can never be settled. There should be no general attempt to maintain the values of financial markets. The financial collapse now occurring may have been triggered by the coronavirus, but the conditions for the blow-out have been laid by decades of disastrous policies. As Lyndon LaRouche expressed concisely with his triple-curve image, the physical productivity of many so-called “western” nations (including the United States) has decreased in per capita terms over the last several decades, in a way that accelerated with the collapse of the Soviet Union, while financialization has increased at a rapid and accelerating rate.\n\nThe required summit of the leaders of the United States, Russia, China, and India must take up the need for an orderly bankruptcy-style reorganization of the financial markets, to set the stage for banking to play a useful role in financing a global economic and health gear-up.\n\nPeople whose daily work is not truly essential for the functioning of society should stay home. Financial and logistical arrangements required to support their livelihood must be implemented.\n\nEveryone should wear masks when they are among other people (which should be kept to an absolute minimum). This will provide the wearers themselves some protection against infection and reduce the potential for wearers to spread the disease. They also reduce face-touching. Read why here. (Note that the CDC now does recommend wearing masks.)\n\nFrequent hand washing with soap can help reduce the spread of coronavirus, as does the use of alcohol-based hand sanitizers.\n\nBut there are over three-quarters of a billion people on this globe without access to improved water. Two and a half billion people lack access to improved sanitation infrastructure. The costs to health and well-being are staggering. According to a fact sheet issued by the CDC, citing research published in the Lancet, every year 800,000 children under five years of age die from diarrheal diseases. Lack of sanitation and of water for drinking and hygiene contributes to 88% of deaths from diarrheal diseases worldwide.\n\nUrging a community without sanitary facilities to practice frequent handwashing is both insulting and foolish. A crash program to develop sanitary facilities must be implemented, supplemented with the provision of hand sanitizer for hygiene purposes.\n\nIn the United States, the NSA’s intimate knowledge of the whereabouts of everyone with a cellphone can be put to good use! As one example, it could be used to provide text alerts to people who have been in the vicinity of someone who later tests positive. This approach was used in South Korea to help people get a better sense of their risk of exposure, and is part of the relative success that nation has seen in reducing the spread of coronavirus.\n\nWhen testing is performed at a high enough level to give a sense of the different incidence of the virus in different areas, travel restrictions may be sensible to prevent its spread from areas with significant community transmission. This may make more sense as the first wave of the pandemic is crushed.", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20200413/defeating-pandemic-part-ii-public-health-measures", "title": "Defeating the Pandemic, Part II: Public Health Measures", "description": "In Part I, we laid out our overview of tackling the global pandemic from a global standpoint. Here in Part II, we will discuss necessary health measures in more detail. Part III will take up the physical, economic, scientific, and political changes needed to make these measures possible on a...", "image": "https://larouchepac.com/sites/default/files/Mercy%20ICU.jpg", "image:url": "https://larouchepac.com/sites/default/files/Mercy%20ICU.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/Mercy%20ICU.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://larouchepac.com/20200411/larouche-s-apollo-mission-defeat-global-pandemic-build-world-health-system-now", "https://larouchepac.com/20200413/defeating-pandemic-part-iii-industry-infrastructure-and-political-requirements", "https://www.aha.org/statistics/fast-facts-us-hospitals", "https://www.eia.gov/consumption/commercial/reports/2007/large-hospital.php", "https://www.cdc.gov/flu/pdf/professionals/hhspandemicinfluenzaplan.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/25878300", "https://docs.google.com/document/d/1gXBTYBLMSGWNJIWhbO0DoXbGuGgc0lxDnCvnaGEcBls/edit#heading=h.33eeaq30t3r3", "https://medium.com/@Cancerwarrior/covid-19-why-we-should-all-wear-masks-there-is-new-scientific-rationale-280e08ceee71", "https://www.cdc.gov/healthywater/global/wash_statistics.html", "https://larouchepac.com/20200413/defeating-pandemic-part-iii-industry-infrastructure-and-political-requirements"], "authors": [], "publish_date": null}