{"result_id": "183052", "URL": "https://www.larouchepac.com/thank_god_for_donald_trump_thank_god_for_the_united_states_of_america", "timestamp": "2023-04-25 16:12:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/thank_god_for_donald_trump_thank_god_for_the_united_states_of_america", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Thank God for Donald Trump! Thank God for the United States of America!", "cleaned_text": "Speak what we feel, not what we ought to say –King Lear\n\nNearly all of us who claim to be Christians or Jews have allowed our children, for nearly two generations, to be seduced into a cult which mocks the God of Abraham. Nearly all of us who claim to be Americans, have allowed our children to be saturated with this cult’s trampling of American principles into the dirt.\n\nWhat right do we have to be astonished at the depths of moral cowardice shown by Americans in high places today–with the exception of Donald Trump and maybe a handful of others? Wasn’t it our very own cowardice that allowed our children to be led away by the Pied Piper? The “Pied Piper” I’m talking about here is the “Greenie” anti-religion-- not the more recent “Critical Race Theory” and its companion cults of hatred. “Hate this one! Now hate that one!” Many Americans have to get up very early in the morning, to study up on just who it is that they’re supposed to hate today when they come to work. This organized hatred has already hounded some to suicide. If allowed to continue there will be many more During China’s very similar Cultural Revolution 1966-76, some rivers were clogged with the bodies of suicides. But the eggs of all these poisonous snakes were laid by the cult of “Green.” Our tradition defines Man as in 1:26-28, as God’s agent in the continuing creation and perfection of the Universe. We believe with Plato that “there is something divine in the soul.”\n\nThe Green cult follows the contrary pagan tradition that man is a burden on Mother Earth, who must curtail his growth and progress for her sake–or even ultimately do away with himself. It has been years since Africa has been able to access international credit for power generation through fossil fuels. If they remain limited to ridiculous wind-farms and solar as they are now, scarcity of power--which is nothing but enforced backwardness and regression,--will kill millions of Africans. Not only that, but fake president Biden’s controllers intend the same for us here. Everything else follows from that original blasphemy, including the destruction of the institution of the family, which would otherwise bring forth more children to burden the earth still more. With that, in the turning of child against parent, which is a regular feature of all the new cults. The world imperial class is totally committed to the “Green” agenda, now repackaged as the “Great Reset” of the Davos Conferences. But there is nothing “new” about any of this. This is a road which most previous civilizations have followed before us–the road to our self-extinction by virtue of our own terrible folly. What immediately prompted this report today, was the appearance showing that Russia is adapting itself to the Green cult’s “Paris Accords,” and trying to do its best within their limits, rather than challenging them , an analysis this author has since confirmed. This even though President Putin knows personally that the scientific claim of man-caused global warming is false. Unfortunately, this should not really be surprising. President Trump was the national leader who ever withdrew from the Paris Accords. Once President Trump was removed from office through a stolen election, no nation in the world was able to exercise full national sovereignty again--even Russia. At the very best, one or two governments may try to reach some sort of rotten compromise between the vital interests of their own people, and the ruling international financier networks centered in London, which run the international monetary system and all the supranational institutions.\n\nWhat this means, is what Lyndon repeated again and again: that the American Revolution and the adoption of our Constitution were a totally unique turning point in human history: ours was the first and only nation which was ever created to be a sovereign republic. The result was a recurring nightmare for the London-centered imperial masters: the nightmare of a world of cooperating sovereign republics, and the end of empire forever. London launched war after war, usually surreptitiously, to prevent that from happening–through the Nineteenth and Twentieth centuries, and all the way through to the Vietnam War, and the Libyan and Syrian wars of the Obama Administration. But now our day has come at last. Now we are preparing for a second Donald Trump Administration, in which, this time, President Trump comes to office accompanied by a core Executive, by Legislative majorities, and most important, by a citizenry which understand the American System, in this day and age, to the point that they will stake their very lives on it as our Founders did. clock is ticking. The fulfillment of the American Revolution is approaching; the days of empire are numbered. Soon, the “Green” gloom will be lifted forever. To download a .pdf of this article, click here.", "opengraph": {"title": "Thank God for Donald Trump! Thank God for the United States of America!", "url": "https://www.larouchepac.com/thank_god_for_donald_trump_thank_god_for_the_united_states_of_america", "description": "Nearly all of us who claim to be Christians or Jews have allowed our children, for nearly two generations, to be seduced into a cult which mocks the God of Abraham. Nearly all of us who claim to be Americans, have allowed our children to be saturated with this cult’s trampling of American principles into the dirt.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/5937/meta_images/original/50505297128_ab6ab926e3_b_%281%29.jpg?1625918876", "site_name": "LaRouchePAC"}, "tags": ["4.Campaign-Defend-Trump", "1.Written-Update", "3.Category-USA"], "tweets": [], "movies": [], "links": ["https://d3n8a8pro7vhmx.cloudfront.net/larouchepac/pages/5875/attachments/original/1625930757/Thank_God_for_Trump_-_Papert_-_7-10_.pdf?1625930757"], "authors": [], "publish_date": null}