{"result_id": "183002", "URL": "https://www.larouchepac.com/the_fanatical_frogman_who_stunk_up_who_s_china_covid_investigation", "timestamp": "2023-04-25 16:09:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/the_fanatical_frogman_who_stunk_up_who_s_china_covid_investigation", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "The Fanatical Frogman Who Stunk Up WHO’s China COVID Investigation", "cleaned_text": "No literate scientific community would tolerate a Daszak posing as a public health official. In fact, the biased, heavy handed, and unscientific COVID response was only made possible by the broad acceptance of linear forecast models from discredited academics like Brit Neil Ferguson of the Imperial College of London, or the University of Washington/Gates Foundation’s Institute for Health Metrics and Evaluation (IHME).\n\nSuch models are widely used throughout all scientific fields, from cosmology to climate change—and often consciously used to instigate hysteria and social control—and the underlying methods of linear forecasting models are based on unproven assumptions and have no actual connection to physical reality. If the practitioners of this fraudulent method were exposed, it would shatter the pseudo-scientific edifice top to bottom. (For more on the fraud of linear forecasting, and a discussion on the true science of forecasting, see this paper by Lyndon LaRouche.)\n\nIt is the attempted ideological takeover of real science which presents the greatest threat to our civilization, and this has far greater consequences on the Earth than carbon dioxide or the coronavirus could ever have.\n\nConsider what they call “ethics” at any college today: “Imagine you are on a trolley car, and you are about to run over four people, or you can redirect the track and kill only one? Which do you choose, and why?”\n\nBritish degenerates, like Ms. Foot of the infamous Trolley Problem, have come to dominate American pseudo-science on college campuses, and their ideological program intends nothing less than to destroy the genius and creativity of the American spirit of industry and science, and replace it with apocalyptic ideologies, where all you can do is mitigate the suffering. Think of so-called experts like John Kerry on climate change or Anthony Fauci on COVID.\n\nThis hardcore indoctrination began with the direct attempt by British demagogues at the turn of the 20th Century, like Bertrand Russell, who co-wrote an entire book in 1910, Principia Mathematica, trying to prove one plus one equals two via abstract logic, all in the hopes of destroying actual scientific thought and replacing it with linear mathematic models. Russell was closely tied to eugenicists like Julian Huxley, and had the following to say in his “The Impact of Science on Society” in 1952:\n\n“It may be hoped that in time anybody will be able to persuade anybody of anything if he can catch the patient young and is provided by the State with money and equipment. This subject will make great strides when it is taken up by scientists under a scientific dictatorship.... The social psychologists of the future will have a number of classes of school children on whom they will try different methods of producing an unshakable conviction that snow is black. Various results will soon be arrived at. First, that the influence of home is obstructive. Second, that not much can be done unless indoctrination begins before the age of ten. Third, that verses set to music and repeatedly intoned are very effective. Fourth, that the opinion that snow is white must be held to show a morbid taste for eccentricity. But I anticipate. It is for future scientists to make these maxims precise and discover exactly how much it costs per head to make children believe that snow is black, and how much less it would cost to make them believe it is dark gray. Although this science will be diligently studied, it will be rigidly confined to the governing class. The populace will not be allowed to know how its convictions were generated. When the technique has been perfected, every government that has been in charge of education for a generation will be able to control its subjects securely without the need of armies or policemen.”\n\nAnd later in that same work:\n\nThere are other (means), which, one must suppose, opponents of birth control would prefer. War, as I remarked a moment ago, has hitherto been disappointing in this respect, but perhaps bacteriological war may prove more effective. If a Black Death could be spread throughout the world once in every generation survivors could procreate freely without making the world too full. There would be nothing in this to offend the consciences of the devout or to restrain the ambitions of nationalists. The state of affairs might be somewhat unpleasant, but what of that? Really high-minded people are indifferent to happiness, especially other people's.", "opengraph": {"title": "The Fanatical Frogman Who Stunk Up WHO’s China  COVID Investigation", "url": "https://www.larouchepac.com/the_fanatical_frogman_who_stunk_up_who_s_china_covid_investigation", "description": "Even the China CDC disagrees with the World Health Organization (WHO) investigative team’s leading hypothesis that the Wuhan wet market remains the most likely origins of the COVID pandemic. A team of Chinese scientists in a paper published in the January 24, 2020 British medical journal The Lancet concluded that the wet market was not the source.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/5786/meta_images/original/who-4984801_1280.jpg?1614006760", "site_name": "LaRouchePAC"}, "tags": ["4.Campaign-Defend-Trump", "3.Category-Geopolitics", "1.Written-Article", "3.Category-Science"], "tweets": [], "movies": [], "links": ["https://www.nationalreview.com/corner/professor-lockdown-modeler-resigns-in-disgrace/", "https://dossier.substack.com/p/how-the-gates-foundation-seeded-americas", "https://larouchepub.com/lar/2013/4005const_princip_involved.html", "donate?recruiter_id=139893"], "authors": [], "publish_date": null}