{"result_id": "183025", "URL": "http://www.larouchepac.com/barack_obama_hits_the_trail_in_vain_effort_to_stop_the_red_wave", "timestamp": "2023-04-25 16:10:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/barack_obama_hits_the_trail_in_vain_effort_to_stop_the_red_wave", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Barack Obama Hits the Trail in Vain Effort to Stop the Red Wave", "cleaned_text": "Everywhere, the Democratic Party, its funders, and Washington’s Tory Republican traitors are in a state of absolute panic. It looks like a red wave is emerging featuring candidates backed by Donald Trump just when Washington’s Uniparty thought they had gotten things back to “normal.” As outlined below, Trump insurgents are leading their races or within striking distance despite the defamation campaign conducted against them and sabotage by Washington’s Republicans. Desperate Democrats have waved Barack Obama back into the game from the Fourth Quarter Bench since Joe Biden is so toxic that no one wants to campaign with him. Securing his place as the most out of touch President in U.S. history, Biden asserted last week that the “economy is strong as hell,” while chomping away on his favorite Baskin and Robbins ice cream cone.\n\nThe question now is whether the Republicans have enough eyes and ears on the ground to prevent vote fraud, and whether patriotic Americans will turn out in the overwhelming numbers necessary to defeat whatever fraud and October “surprises” the Democrats have in place.\n\nThe tectonic shifts in the election battlefield are the result of the population seeing and internalizing the ongoing economic collapse, and the fact that the current political class not only has no answers, but are witting accomplices in its creation. They live in an elite universe of dead ideas and their own echo chamber. Daily, on the other hand, actual human beings live the reality of economic collapse, unable to make ends meet or envision a future. Toleration of the drug poisoning of our youth, rampant crime, and outright madness (like the present Big Pharma trans push), are all reflections of societal collapse and decadence. The voters are demanding change, radical change.\n\nWashington answers with determined attempts at distraction. Russia, they yell, is to blame for inflation. Yet U.S., British, and European Net Zero policies against the energy needed to run an economy have played the key role. The same elites provoked Russia into the Ukraine war, and then issued sanctions which boomeranged and are now resulting in the rapid and complete physical collapse of European economies. No one knows the ultimate impact of the Fed’s interest rate rises on the $600 trillion in derivatives now exploding through the world economy. But anyone can see that the members of the Federal Reserve and other central bankers who built this new bubble after the collapse of 2008 should be in jail rather than running economies.\n\nUnder these conditions, all the artificially-created political boundaries are collapsing. Political appeals based on algorithms, social media profiles, and big data no longer work at all, because people, under these conditions, are changing, radically.\n\nWitness Liz Truss in Britain, who was forced to resign after 44 days, the shortest reign in office in British history. Lots of reasons are offered for Truss’ collapse. The reality is that the Bank of England had to intervene to save the over-indebted British economy which seized up. While immediately triggered by a derivatives-based implosion of that nation’s pension funds, the collapse was otherwise inevitable. The disastrously incompetent Truss could simply no longer be tolerated at this political moment.\n\nOr, think about former DNC Vice-Chair, Bernie Sanders supporter, and staunch opponent of the Ukraine War, Tulsi Gabbard, now campaigning for Trump-endorsed candidate Kari Lake in Arizona. Gabbard just quit the Democratic Party, characterizing it as “an elitist cabal of warmongers driven by cowardly wokeness . . . stoking anti-white racism and dragging us ever closer to nuclear war.” Lake, a fighter for election integrity who has refused to recognize Joe Biden’s election, now leads the race for Arizona Governor.\n\nOr look at the Northeast and the Pacific West, traditional liberal Democratic bastions. In New York, Republican Lee Zeldin is within the margin of error against the current Dem Governor Kathy Hochul. In Washington, Republican Tiffany Smiley is within the margin of error in her race against Democratic Senator Patty Murray. In Oregon, Republican Christine Drazen is within striking distance of Democrat Tina Koten in the race for Governor. In traditionally deep blue Congressional Districts in Connecticut and Rhode Island, republicans are leading their races. Billionaires like Phil Knight of Nike in Oregon, are stepping up and throwing millions to anyone willing to eliminate the forces of outright destruction in their states. Focus on the abortion issue as the ultimate distraction is also apparently backfiring. In a New York Times-Siena poll, independent women, who were solidly behind the Democrats one month ago, shifted by twenty-three points in one month and now solidly support Republicans.\n\nOn November 8th there will be a full lunar eclipse, a Red Moon, signaling that the universe itself is participating in what looks now like the righteous Midterms result. According to Obama’s campaign schedule, he is focused on saving the Senate for Democrats by going to Wisconsin, Nevada, and Georgia. Michigan is also targeted, but for a different reason. All these states, of course, are battleground states for 2024 and the Democrats must hold them to save the White House.\n\nExcept for Nevada, every one of these states went for Trump in 2016, rejecting both Hillary Clinton and Barack Obama. That is the backdrop to Obama’s Friday podcast with his supporters in which he implored them to stop emphasizing Trump and January 6th. It is now widely recognized that the Democratic jihad against President Trump is backfiring, increasing Trump’s popularity, and turning him into a modern folk hero.\n\nIn Michigan, a grassroots revolt led by Trump-supporting Republicans is defying all the political rules. The Republican Party has denied funding to these candidates for Governor, Attorney General, and Secretary of State, respectively, and the local Republican elites, led by the DeVos family, have done everything possible to hold onto power. Yet here again, the insurgents are in striking distance, led by a surprising shift in the working class and middle class vote across all racial and ethnic lines. It could turn this battleground state, a bastion of the so-called Rust Belt “blue line,” reliably red. So, we will start here in evaluating the significance of Barack Obama’s campaign choices.\n\nThe state’s Democratic administration is presently composed of the equivalent of the three witches from Shakespeare’s Macbeth. They presided over the dissolution of Donald Trump’s November 2, 2020, decisive election lead. Despite the economic duress caused by the shift to Biden’s electric car program and Covid lockdowns, Governor Gretchen Whitmer has been allowed to cling to power through such devices as the fabricated FBI entrapment plot which featured her potential kidnapping and assassination. The psy-war-intended polls had Whitmer up over seventeen points a few weeks ago, and the Dem national strategy of using the abortion issue to demonize the Republicans has been on overdrive here. But Republican challenger Tudor Dixon effectively punctured the demonization strategy in her first debate with Whitmer. More fundamentally, the Republican slate has been hammering hard on the questions which actually concern average Americans: inflation, the economy, and education. Some polls now show Dixon surging, within four points of Whitmer.\n\nThe Attorney General race presents an equally stark contrast, with Trump-backed (and equally demonized) lawyer Matt DePerno pitted against lesbian Dana “Put a Drag Queen in Every School” Nessel. Nessel is such an atrocious Attorney General that one of Detroit's two major newspapers, the , refused to make an endorsement in the AG race! DePerno is also playing a recording from Nessel warning that their race is a statistical dead heat and that she could lose.\n\nIn the other major state-wide race, Secretary of State candidate Kristina Karamo is the leading Black candidate on a slate which includes a growing number of Black and Hispanic Republicans, and has led the charge into traditionally “blue areas” of the electorate. Karamo has run a substantive grassroots campaign not only addressing the issues of election integrity, but making clear that her opponent, Jocelyn Benson, is not a liberal, but an “authoritarian extremist.” The press in Michigan has given Karamo the Trump treatment, with typical headlines like, “Election Denier Karamo is Michigan GOP Secretary of State Nominee.” In his campaign plan, Obama specifically mentioned his goal of defeating “down ballot” secretary of state candidates who could “control future elections.”\n\nAs in the Virginia gubernatorial race of 2021, the education/culture battle could very well provide the margin, not just for a Republican victory in Michigan, but for a fundamental shift in the political complexion of the state. At an explosive school board event on October 13 in Dearborn, MI, over one thousand parents and citizens, many of them Muslim, demanded the removal of pornographic books portraying homosexual activity from their school libraries. The opposition to their demands from the Democratic-dominated school board provoked many parents to tell LaRouchePAC organizers on the scene, that “I will never vote for a Democrat again IN MY LIFETIME.”\n\nIn Wisconsin, GOP Senator Ron Johnson now leads Lt. Governor Mandela Barnes by six points. The maverick Senator has been a prime target of national Democrats this election cycle, with millions spent on defeating him.\n\nJohnson has attacked Covid mandates and the censoring and persecution of doctors who questioned the efficacy of the mRNA vaccines while advocating various therapeutics. He has also paired with Senator Chuck Grassley to produce damning evidence on the Biden family’s pay-for-play operations with China, Ukraine, and other countries. He has been a committed supporter of Donald Trump, and has attacked the idea that January 6th constituted “an insurrection.”\n\nBarnes, on the other hand, is a committed “progressive,” now campaigning primarily on abortion rights. He had previously supported abolishing ICE and defunding the police, although he repudiated both prior positions when he started the present campaign.\n\nIn the race for Governor, the Trump-endorsed candidate Tim Michels has closed on current Governor Tony Evers to the point where the race is rated “toss up” even in the skewed polling. As in Michigan, Michels was not the preferred candidate of the Republican elite. First, a grassroots revolt led by Michels prevented the endorsement of the establishment candidate, Rebecca Kleefisch, at the Republican state convention. Then Michels defeated Kleefisch in the primary, despite major Republican financial support flowing to Kleefisch and endorsements by Mike Pence, Ted Cruz, and former Governor Scott Walker. Michels is the owner of a major family-owned construction business, and a veteran whose support comes from the grassroots.\n\nUnlike Michigan and Wisconsin, Nevada has been viewed throughout this election cycle as a possible Republican pickup in the Senate. At issue is the seat presently held by Catherine Cortez Mastro. The latest polling shows the race a dead heat between Cortez Mastro and Adam Laxalt, the grandson of the late Senator Paul Laxalt, with Laxalt now pulling ahead by two points. Joe Lombardo, the Republican candidate for governor against the incumbent Governor Steve Sisolak, is now also showing a slight lead. The polling, however, underestimates the dire straits facing the Democrats.\n\nNo state was hit harder by Covid than Nevada. The hospitality industry, which is the state’s economic lifeblood and largest employer by huge margins, shut down. Ninety-eight percent of the “hospitality industry” workforce was unemployed overnight. Despite state legislation guaranteeing a “right to return” to work, 10,000 of those wanting to return to work still cannot because of the slow reopening. Others have simply left the state or their former employment and moved on. Rents rose faster than anywhere else in the country, and gas prices are higher than any other state except for California. While Democrats used to enjoy a 4.8 percent registration advantage over Republicans, that margin has now shrunk to 2.4 percent.\n\nMore than almost any other state, Nevada elections are determined by working class and Hispanic voters, and Democrats are facing major head winds with both. Joe Biden is underwater here—despised and blamed for inflation. Hispanics opposed abortion as a matter of religious and cultural conviction. They are against open borders. They are against the vaccine mandates and the “woke” sexual and other policies now at the center of the Democratic consensus. A similar trend in this state features working class Black people walking away from the “woke” Democratic Party.\n\nThe Democratic Party itself is deeply split between the Bernie Sanders supporters who control the state party machinery, and the centrist machine once led with an iron fist by the late Senator Harry Reid who died last year.\n\nMost polling shows Herschel Walker, the Trump-endorsed candidate for Senate, trailing the incumbent, Senator Raphael Warnock, but within the margin of error. These razor-thin margins have continued despite Walker’s self-acknowledged personal baggage and the Democrats weaponizing his family to attack him on the claim that he paid for an abortion while opposing the practice.\n\nBiden, however, is deeply underwater in the state, where he is blamed for the crashing economy and inflation.\n\nThen there is Stacey Abrams, who is Obama’s rally companion for this state. On October 19th, Abrams, like Janet Yellen before her, declared that abortion is a great economic benefit, and that the only reason people are worried about the economy is because they have or want to have children. Clearly, Abrams, a proponent of abortion-on-demand including at term, can’t fathom why people would want to have children. She can’t even imagine an economy in which one paycheck can provide all the funds needed to raise a healthy family--the standard before the American economy was deindustrialized and collapsed--let alone fight to create it. As in Nevada, there are significant indications that Blacks and Hispanics are fleeing from the Democrats’ attacks on families and parents, in addition to blaming them for the crashing economy, crime, and drugs.", "opengraph": {"title": "Barack Obama Hits the Trail in Vain Effort to Stop the Red Wave", "url": "https://www.larouchepac.com/barack_obama_hits_the_trail_in_vain_effort_to_stop_the_red_wave", "description": "Everywhere, the Democratic Party, its funders, and Washington’s Tory Republican traitors are in a state of absolute panic. It looks like a red wave is emerging featuring candidates backed by Donald Trump just when Washington’s Uniparty thought they had gotten things back to “normal.”  As outlined below, Trump insurgents are leading their races or within striking distance despite the defamation campaign conducted against them and sabotage by Washington’s Republicans. Desperate Democrats have waved Barack Obama back into the game from the Fourth Quarter Bench since Joe Biden is so toxic that no one wants to campaign with him. Securing his place as the most out of touch President in U.S. history, Biden asserted last week that the “economy is strong as hell,” while chomping away on his favorite Baskin and Robbins ice cream cone. ", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/7773/meta_images/original/FOpN6QDVQBwxFaP.png?1666381607", "site_name": "LaRouchePAC"}, "tags": ["4.Campaign-Defend-Trump", "3.Category-USA", "1.Written-Article"], "tweets": [], "movies": [], "links": ["https://thehill.com/homenews/campaign/3697767-gop-wave-threatens-blue-state-strongholds/"], "authors": [], "publish_date": null}