{"result_id": "183014", "URL": "https://www.larouchepac.com/president_trump_takes_on_big_pharma", "timestamp": "2023-04-25 16:10:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/president_trump_takes_on_big_pharma", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "President Trump Takes on Big Pharma", "cleaned_text": "Donald Trump is President of the United States. An afternoon White House press conference addressed by the President revealed sweeping changes in prescription drug pricing. It followed a midday press conference on the fight against COVID-19. In the afternoon event, President Trump revealed several steps his administration had taken to reduce drug prices: Medicare rebates would now go directly to patients, rather than to any middlemen.\n\nMedicare would have most-favored nation status, paying the lowest price among those paid by a collection of developed countries. At present, Medicare often pays more than any other country for some drugs! He has ended the Unapproved Drug Initiative, which removed from the market drugs that had not been FDA approved. This sounds good, of course, but one side-effect is that drugs developed decades ago, before approval was required, would now be banned unless a company stepped forward to do the testing required for approval, following which the company would have a monopoly on sales. For example, vasopressin has been on the market since 1928, but was just patented in 2015, bringing monopoly sales until 2035 and increasing its price by nearly 1,500%. Pharmacy contractual gag orders, under which a pharmacist could not tell a customer that it would be cheaper to pay cash than to use insurance, are to be done away with. A path is to be opened to import drugs from Canada to save money.\n\nHealth and Human Services Secretary Alex Azar reported that Pfizer is filing today for an Emergency Use Authorization for its COVID vaccine. The FDA will decide within weeks, and within 24 hours of that authorization, distribution will begin.\n\nGood news — the pharmaceutical industry is pissed. Pharmaceutical Research and Manufacturers of America will be considering “all options to stop this reckless attack on the companies working around the clock to beat COVID-19.”\n\nAt noon, White House Press Secretary Kayleigh McEnany held a press conference to discuss progress made on the fight against COVID-19. There are expected to be 40 million vaccine doses available by the end of the year, to protect the most vulnerable. The 64 jurisdictions making up the United States have submitted distribution plans, allowing rapid distribution.\n\nMortality rates have declined significantly, as a result of improved treatments and therapeutics, including repurposed drugs and soon to include the monoclonal antibody treatments that could treat the infection in its early stages and allowing patients to recover without having to be hospitalized.\n\nAlthough there were numerous questions about the presumed transition to a Biden Administration and the lawsuits filed by the Trump campaign, McEnany deferred to the campaign itself, rather than the White House press secretary. She did remind the assembled press that Trump himself has been subject to four years of efforts to delegitimize and undermine his 2016 electoral victory.", "opengraph": {"title": "President Trump Takes on Big Pharma", "url": "https://www.larouchepac.com/president_trump_takes_on_big_pharma", "description": "Donald Trump is President of the United States. An afternoon White House press conference addressed by the President revealed sweeping changes in prescription drug pricing. It followed a midday press conference on the fight against COVID-19. In the afternoon event, President Trump revealed several steps his administration had taken to reduce drug prices: Medicare rebates would now go directly to patients, rather than to any middlemen.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/5323/meta_images/original/20201121-pharma.jpg?1606252838", "site_name": "LaRouchePAC"}, "tags": ["1.Written-Update"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}