{"result_id": "183042", "URL": "https://larouchepac.com/20200914/covid-19-vaccine-result-possible-early-mid-october", "timestamp": "2023-04-25 16:11:36 CEST+0200", "meta": {"description": "Science Wins? Unless It's Stopped, Vaccine by October. Kamala Harris Pounds Sand. The following article by Dr. Ned Rosinsky outlines the current vaccine trials and the predictive studies which show that a vaccine for COVID could be available in October under Project Warp Speed. Panicked, the...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20200914/covid-19-vaccine-result-possible-early-mid-october", "encoding": "utf-8"}, "image": null, "domain": "larouchepac.com", "title": "COVID-19 Vaccine Result Possible by Early to Mid-October", "cleaned_text": "On September 7 NPR put out a vaccine coverage story entitled, “How Can You Tell if a COVID-19 Vaccine Is Working?” The coverage includes an interview with Holly Janes, PhD, a biostatistician at the Fred Hutchinson Cancer Research Center in Seattle. She stated that the trials currently underway are event-driven studies, and said, “An event-driven trial means that the primary analysis of the trial happens when you get enough events.” The article explains that by the term “events,” “Janes means laboratory- confirmed cases of COVID-19 disease. Janes says that the trial now underway aims to get at least 150 events among the trial participants.” That is, the trial is completed when you get enough events. The Covid-19 Phase 3 trials do not have a time endpoint, such as 3 months. The trials are run until a certain number of participants get Covid-19, enough to make a statistical comparison between the vaccine group and the control group. The trials are also tracking the number of people who get hospitalized for Covid-19. That statistical comparison will indicate if the vaccine is efficacious, and how efficacious it is.\n\nHow long should it take to show efficacy? The U.S. has recently been identifying approximately 45,000 new Covid-19 cases daily, out of a national population of 331 million, which calculates to 1.36 new cases per 10,000 population per day, or 1.36/10,000 per day. In a test cohort of 30,000, which is the planned cohort size of each of the Moderna and Pfizer Phase 3 studies, the number of expected cases would depend on the efficacy of the vaccine. For example, if the vaccine were not at all efficacious, all 30,000 subjects in the study would be at risk, which would calculate to 30,000 X 1.36/10,000 or 4 new cases in the 30,000 participants per day, or 120 per month. If the vaccine were 100% efficacious, there would be only 15,000 people at risk, the people in the unvaccinated placebo group, which would predict half of the 4 cases, or 2 new cases per day, totaling 60 per month. If the vaccine were moderately efficacious, say 60% efficacious — which is good enough for FDA approval, which requires at least 50% efficacy — then approximately 84 new cases per month would be expected.\n\nModerna and Pfizer have been recruiting and vaccinating study participants since 7/27/2020. Moderna is now at or very near its target of 30,000 participants, and Pfizer reported they were at 23,000 participants as of Sept. 3, so they have both been vaccinating and testing participants for all of August. There are other factors which would tend to increase the rate of new cases or “events.” First, Moderna is targeting high-risk populations for recruitment into their study, so their event rate should be considerably above the national average, in some populations more than 4 times the national average. Second, it is widely acknowledged that the actual rate of COVID-19 is significantly higher than the reported rate, due to lack of comprehensive testing of the population. The study participants are expected to be tested whether they are symptomatic or not, to be sure to pick up the non-symptomatic cases, so the event rate will be higher than the currently reported national rate, and much closer to the actual rate in the population. Although there are no publicly available accurate measurements of the increased rate expected from targeting high risk populations, or the increased rate expected due to the actual rate in the population compared to the usual estimates based on current testing, these numbers would imply approximately 150 “events” for Moderna at least by or before early October, for a moderately effective vaccine, and for Pfizer, which is slightly behind Moderna in recruitment, by two weeks into October.\n\nThe earlier Phase 1 and Phase 2 studies of the Moderna and Pfizer vaccines showed a very high rate of efficacy, as estimated by the immune response of the test volunteers. There was nearly a 100% response of antibody production, with antibodies generally at the level of people who have previously had the disease and recovered. However, in the general population it would be expected that the immune response would vary due to a number of factors, such as age, genetics, the presence of other diseases, stress level, and nutritional status. It is well known that a similar set of factors is associated with the severity Covid-19 when people are infected. That is why a large, broad-based Phase 3 is important. However, given the current extreme emergency situation of the state of the epidemic, with approximately 1000 people dying daily in the US from Covid-19, it would be a prudent and justifiable policy for the FDA to issue an Emergency Use Authorization to allow the vaccine to be used broadly in the population when the number of cases is reached as indicated above.\n\nThe FDA has a Drug Safety Oversight Board, which requests unblinded data from drug research teams. The DSOB typically checks the progress of ongoing studies approximately every 2 months, to gauge efficacy and monitor for adverse effects. In the case of the Covid-19 studies, the DSOB is likely tracking the Phase 3 studies much more frequently due to the national emergency. Taking the above possibilities of efficacy as examples, if the Moderna vaccine were at or nearly at 100% efficacy, then if approximately 2 new cases per of Covid-19 were found monthly within the study population of 30,000, the FDA would know which arm of the study had the cases. If all or nearly all the cases were in the non- vaccinated group, and if there were an acceptable level of adverse effects, the DSOB and FDA could decide that there was sufficient justification for an Emergency Use Authorization. Conversely, if the vaccine were only mildly efficacious, such as 50%, then there would be 3 new cases per day, and the FDA would know which group these came from, 1 from the vaccine group and 2 from the placebo group. After a month there would be 75 cases total. The FDA could then decide to wait for more time, to get a more accurate statistical estimate of actual efficacy.\n\nThe above estimate by Dr. Janes of the number of events needed to complete the Covid-10 vaccine studies is based on her long experience and her expertise in the vaccine research field. She holds a PhD in biostatistics from the University of Washington, and she is working on the design and analysis of vaccine studies, with particular expertise in HIV prevention and vaccine science. She also develops and applies statistical methodology for evaluating biomarkers for risk prediction and optimizing treatment decisions. She is an Affiliate Associate Professor, Biostatistics, at the University of Washington, and a member of the Graduate Faculty, Biostatistics, at the University of Washington. She has research interests in statistics design and analysis of vaccine efficacy trials, HIV vaccine development, clinical trial design, and pediatric vaccine trials. Her current projects include providing leadership for the Statistical Data Management Center of the HIV Vaccine Trials Network, statistical methods for HIV prevention efficacy trials, statistical methods for human challenge studies, and statistical evaluation of biomarkers for making treatment decisions.", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20200914/covid-19-vaccine-result-possible-early-mid-october", "title": "COVID-19 Vaccine Result Possible by Early to Mid-October", "description": "Science Wins? Unless It's Stopped, Vaccine by October. Kamala Harris Pounds Sand. The following article by Dr. Ned Rosinsky outlines the current vaccine trials and the predictive studies which show that a vaccine for COVID could be available in October under Project Warp Speed. Panicked, the...", "image": "https://larouchepac.com/sites/default/files/laboratory-analysis-chemistry-research-chemist-lab-phd-diagnostics-hospital%20(1).jpg", "image:url": "https://larouchepac.com/sites/default/files/laboratory-analysis-chemistry-research-chemist-lab-phd-diagnostics-hospital%20(1).jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/laboratory-analysis-chemistry-research-chemist-lab-phd-diagnostics-hospital%20(1).jpg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}