{"result_id": "183007", "URL": "https://www.larouchepac.com/la_times_admits_newsom_might_lose", "timestamp": "2023-04-25 16:09:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/la_times_admits_newsom_might_lose", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Lessons of the California Recall Fight", "cleaned_text": "The California recall tested all the assumptions and showed that the state is winnable ... but only by republicans (small \"r\" republicans) fighting against Empire, on exactly those terms.\n\nAn examination of the preliminary map of the recall vote shows, that despite massive fraud, California is no longer firmly in the grip of the Empire. Almost half of the state's counties voted for the recall.\n\nThe recall effort showed that a new force is emerging in California, fighting on the basis of such ideas, and independent of the green, woke Democrats and RINO Republics, who have nothing to offer.\n\nIn this week's strategic overview, delivered on election eve, Bob Ingraham discusses the quality of mind which characterizes those leaders who lose battles and win wars.", "opengraph": {"title": "Lessons of the California Recall Fight", "url": "https://www.larouchepac.com/la_times_admits_newsom_might_lose", "description": "Recall Countdown: The Los Angeles Times, the lead propagandist for saving Gov. Gavin Newsom, let the cat out of the bag.  While promoting one of their fake polls showing Newsom saving his seat, they admit that when the population was focused on who Gavin Newsom is and the harm he has inflicted, Newsom was losing the recall.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/6066/meta_images/original/20210913-so.png?1631657938", "site_name": "LaRouchePAC"}, "tags": ["1.Video-Strategic-Overview", "3.Category-USA"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}