{"result_id": "183008", "URL": "https://www.larouchepac.com/stop-wwiii?page=5", "timestamp": "2023-04-25 16:10:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/stop-wwiii", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Stop WWIII", "cleaned_text": "At the final plenary meeting of the Valdai International Discussion Club on the theme of \"The World Order: New Rules or a Game without Rules,\" Russian President Vladimir Putin addressed the international situation in undiplomatic, truthful terms. The Valdai Club was attended this year by 108 experts, historians, and political analysts from 25 countries, including 62 foreign participants. What follows are excerpts from his remarks:\"Some of what I say might seem a bit too harsh, but if we do not speak directly and honestly about what we really think, then there is little point in even meeting in this way. It would be better in that case just to keep to diplomatic get-togethers, where no one says anything of real sense and, recalling the words of one famous diplomat, you realize that diplomats have tongues so as not to speak the truth.\n\n\"First of all, changes in the world order ... have usually been accompanied by, if not global war and conflict, then by chains of intensive local-level conflicts. Second, global politics is above all about economic leadership, issues of war and peace, and the humanitarian dimension, including human rights.\n\n\"Sadly, there is no guarantee and no certainty that the current system of global and regional security is able to protect us from upheavals. This system has become seriously weakened, fragmented, and deformed.\n\n\"The Cold War ended, but it did not end with the signing of a peace treaty with clear and transparent agreements on respecting existing rules or creating new rules and standards. This created the impression that the so-called victors in the Cold War had decided to pressure events and reshape the world to suit their own needs and interests.\n\n\"International law has been forced to retreat over and over by the onslaught of legal nihilism. Objectivity and justice have been sacrificed on the altar of political expediency. Arbitrary interpretations and biased assessments have replaced legal norms. At the same time, total control of the global mass media has made it possible when desired to portray white as black and black as white.\n\n\"In a situation where you had domination by one country and its allies, or its satellites rather, the search for global solutions often turned into an attempt to impose their own universal recipes. This groups ambitions grew so big that they started presenting the policies they put together in their corridors of power as the view of the entire international community. But this is not the case.\n\n\"The very notion of national sovereignty became a relative value for most countries. In essence, what was being proposed was the formula: The greater the loyalty towards the worlds sole power centre, the greater this or that ruling regimes legitimacy.\n\n\"The measures taken against those who refuse to submit are well-known and have been tried and tested many times. They include use of force, economic and propaganda pressure, meddling in domestic affairs, and appeals to a kind of supra-legal legitimacy when they need to justify illegal intervention in this or that conflict or toppling inconvenient regimes. Of late, we have increasing evidence, too, that outright blackmail has been used with regard to a number of leaders. It is not for nothing that Big Brother is spending billions of dollars on keeping the whole world, including its own closest allies, under surveillance.\n\n\"Let's ask ourselves: How comfortable are we with this, how safe are we, how happy living in this world, and how fair and rational has it become? Maybe, we have no real reasons to worry, argue, and ask awkward questions? Maybe the United States' exceptional position and the way they are carrying out their leadership really is a blessing for us all, and their meddling in events all around the world is bringing peace, prosperity, progress, growth and democracy, and we should maybe just relax and enjoy it all?\n\n\"Let me say that this is not the case, absolutely not the case.\n\n\"A unilateral diktat and imposing one's own models produces the opposite result. Instead of settling conflicts, it leads to their escalation, instead of sovereign and stable states we see the growing spread of chaos, and instead of democracy there is support for a very dubious public ranging from open neo-fascists to Islamic radicals.\n\n\"Why do they support such people? They do this because they decide to use them as instruments along the way in achieving their goals, but then burn their fingers and recoil. I never cease to be amazed by the way that our partners just keep stepping on the same rake, as we say here in Russia, that is to say, make the same mistake over and over.\n\n\"They once sponsored Islamic extremist movements to fight the Soviet Union. Those groups got their battle experience in Afghanistan and later gave birth to the Taliban and al-Qaeda. The West, if not supported, at least closed its eyes, and, I would say, gave information, political and financial support to international terrorists' invasion of Russia (we have not forgotten this) and the Central Asian region's countries. Only after horrific terrorist attacks were committed on U.S. soil itself did the United States wake up to the common threat of terrorism.\n\n\"Only the current Egyptian leadership's determination and wisdom saved this key Arab country from chaos and having extremists run rampant. In Syria, as in the past, the United States and its allies started directly financing and arming rebels and allowing them to fill their ranks with mercenaries from various countries. Let me ask where do these rebels get their money, arms and military specialists? Where does all this come from? How did the notorious ISIL manage to become such a powerful group, essentially a real armed force?\n\n\"As for financing sources, today, the money is coming not just from drugs, production of which has increased not just by a few percentage points but many-fold, since the international coalition forces have been present in Afghanistan. You are aware of this. The terrorists are getting money from selling oil too. Oil is produced in territory controlled by the terrorists, who sell it at dumping prices, produce it and transport it. But someone buys this oil, resells it, and makes a profit from it, not thinking about the fact that they are thus financing terrorists who could come sooner or later to their own soil and sow destruction in their own countries.\n\n\"Russia warned repeatedly about the dangers of unilateral military actions, intervening in sovereign states affairs, and flirting with extremists and radicals. We insisted on having the groups fighting the central Syrian government, above all the Islamic State, included on the lists of terrorist organizations. But did we see any results? We appealed in vain.\n\n\"Essentially, the unipolar world is simply a means of justifying dictatorship over people and countries. The unipolar world turned out too uncomfortable, heavy, and unmanageable a burden even for the self-proclaimed leader.\n\n\"Joint economic projects and mutual investment objectively bring countries closer together and help to smooth out current problems in relations between states.\n\n\"I think that our American friends are quite simply cutting the branch they are sitting on.\n\n\"Our active policy in the Asian-Pacific region began not just yesterday, and not in response to sanctions, but is a policy that we have been following for a good many years now. Like many other countries, including Western countries, we saw that Asia is playing an ever greater role in the world, in the economy and in politics, and there is simply no way we can afford to overlook these developments.\n\n\"Developing economic ties with these countries and carrying out joint integration projects also creates big incentives for our domestic development. Today's demographic, economic, and cultural trends all suggest that dependence on a sole superpower will objectively decrease. This is something that European and American experts have been talking and writing about, too.\n\n\"So, what is in store for us if we choose not to live by the rules, even if they may be strict and inconvenient—but rather live without any rules at all? And that scenario is entirely possible; we cannot rule it out, given the tensions in the global situation. Many predictions can already be made, taking into account current trends, and unfortunately, they are not optimistic. If we do not create a clear system of mutual commitments and agreements, if we do not build the mechanisms for managing and resolving crisis situations, the symptoms of global anarchy will inevitably grow.\n\n\"Russia has made its choice—we want to develop our economy and develop democratic values. We work with our counterparts in the Shanghai Cooperation, the BRICS union for example. We want our opinions to be respected likewise. We all need to be cautious to not make hasty and dangerous steps. Some of the players on the global front have forgotten about the need for this.\"", "opengraph": {"title": "Stop WWIII"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}