{"result_id": "183048", "URL": "https://www.larouchepac.com/biden_admin_steps_up_euthanasia_program_for_political_vaccine_opponents", "timestamp": "2023-04-25 16:11:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/biden_admin_steps_up_euthanasia_program_for_political_vaccine_opponents", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Biden Admin Steps Up Euthanasia Program for Political Vaccine Opponents", "cleaned_text": "The Biden administration is enacting the advice of Obama’s medical advisor Ezekiel Emanuel, that simply denying medical care is the best way to reduce costs, rather than euthanasia. But don’t let anyone fool you into thinking this is about reducing medical overspending, or the “equitable” rationing of scarce medical therapies. It’s also a dictatorial power grab with undercurrents of racial supremacy.\n\nIn his 1949 warning to the American medical community about how the medical atrocities perpetrated by Nazi doctors emerged from small beginnings, Dr. Leo Alexander writes, “It is rather significant that the German people were considered by their Nazi leaders more ready to accept the exterminations of the sick than those for political reasons. It was for that reason that the first exterminations of the latter group were carried out under the guise of sickness.”\n\nPolitical and racial rationing of life-saving monoclonal antibody therapies (mAbs) is happening now, and it’s happening on the federal, state, county, and city level. Furthermore, this denial of medical care is already overlapping with the racist dogmas of the radical left’s false narrative: that black, indigenous, and people of color (BIPOC) should be given greater preference for this medical care than whites, instead of everyone being treated fairly as individuals, with individual medical conditions and comorbidities, regardless of skin tone. This is done in an effort to provide “equity” in the face of “systemic racism” and “institutional oppression”. The readily refuted claim is that being a BIPOC is somehow intrinsically a medical liability with respect to COVID-19.\n\nWhat do you get when critical race theory overlaps political rationing of COVID-19 therapeutics? You get crimes worthy of a new Nuremberg Tribunal. This insanity must be stopped now, in its infancy phase, because, as Dr. Alexander noted, crimes like that grow from their small beginnings to full blown ethnic cleansings. This policy violates the U.S. Constitution, and all law flowing from the 14th Amendment.\n\nLet’s review the timeline in summary form, since it has already been well documented elsewhere:\n\nFrom August to September, seven southern states with predominantly Republican governments from Texas through Florida were experiencing high hospitalization and death rates from the Delta variant of COVID-19. Florida pioneered opening mAb treatment centers across the state, which rapidly dropped their death rate to nearly zero. The Biden administration intervened on Sept. 13, saying these seven states represented 70% of mAb purchases, and interrupted the delivery of these therapeutics in the name of “equitable” distribution to states that weren’t experiencing the same level of hospitalizations.\n\nAt the same time, complicit media misrepresented the provision of therapeutics by these southern governors as simply defying the Biden Administration’s mass vaccination mandates. In reality, these were a lifesaving measure for the unvaccinated (who are disproportionately BIPOC), who the liberal media and politicians were otherwise arguing should be denied medical care. This was done as it had become evident that the vaccines’ protections were waning in the face of Delta and other new variants, with many breakthrough cases among the vaccinated.\n\nIn the run up to Thanksgiving holiday gatherings, the Biden collective announced that Omicron is a new variant of concern, despite evidence to the contrary from South Africa, where it emerged. In mid December, the CDC announced that Omicron was now responsible for 73.2% of all cases. The mAbs produced by Regeneron and Eli Lilly were effective at rapidly treating the Delta variant, but ineffective at treating Omicron, according to our now demonstrably incompetent CDC. So the government decided to withhold their distribution, even as the Delta variant continued to surge. The mAb produced by GlaxoSmithKline is effective for Omicron, but in short supply, with absolutely no effort by President Biden to ramp up production, as President Trump did with Operation Warp Speed.\n\nThen, in late December, the CDC corrected itself, and said Delta is still the dominant variant, and Omicron was actually only responsible for 22.5% of cases. Oops. The Ministry of Truth offers condolences for your loss. That’s why Fauci said you should have cancelled holiday gatherings.\n\nNow that the Biden collective has created artificial scarcity, what do they consider the most “equitable” manner of prioritizing these life saving monoclonal antibodies? According to new ethical guidelines released by the Food and Drug Administration (FDA) in mid-November, priority should be given to people who are black Americans or African, non-white Hispanic, indigenous or Native American/Alaskan, Pacific Islander, or mixed race (BIPOC), over someone who is Caucasian or east Asian. According to their logic, this is because these people are considered to be at greater risk of comorbidities, hospitalization, and death, not because COVID-19 targets a specific genetic feature associated with melanin or ancestry, but because of purported “systemic inequities” and “institutional oppression” that require favored treatment for these “races” of people.\n\n’s recent article debunks this false logic more than adequately. He notes that the lack of access to adequate medical care is primarily a product of class, not race. You can read his report for the details, but we are making a bigger point here.\n\nThe racial discrimination was in place months before the FDA’s new “ethical” guidelines were published. Harrison Hill Smith published this on his Twitter in November 2021, which shows him being denied mAbs in Texas because he’s white, and according to “the qualifications” should be able to recover from COVID-19 without it, so the nurse needs to save the mAbs for someone who is deemed more at risk. attempted to refute his video by calling the Texas Department of State Health Services, and spoke with Chris Van Deusen, who reportedly said there is no state policy to ration care by race. A simple website search reveals the DSHS refers to the National Institutes for Health (NIH) for treatment and therapy guidelines for high risk, non hospitalized patients, and for outpatient therapies. The NIH refers to the CDC for guidelines on for contracting severe COVID-19, which include the same race-based weighted assessment. So there you go.\n\nIf you don’t want to follow that rabbit hole, you can just go straight to this August 24, 2021 on Tarrant County’s website, which lists race as a pre-existing medical condition warranting prioritizing mAb therapies.\n\nwasted no time in explicitly adopting the FDA’s new “ethical” guidelines to rank a person’s status as “black, indigenous, or person of color” with a higher priority to receive treatment than a person without such status, and preemptively deny the latter from receiving such therapies. Here is the relevant excerpt:\n\nhas also jumped on the ethnic cleansing bandwagon. Its Health Department guidelines state: “Risk factors for hospitalization and mortality are now well-recognized and include age, cumulative comorbidities, male gender, shortness of breath, and importantly, but for reasons not well-understood, non-white race/ethnicity.” , Dr. Ron Elfenbein said he had to cancel mAb infusions to approximately 250 people in one week, due to Biden collective rationing based on the false data. “People are definitely going to die because of this or need hospitalization,” he said.\n\nThe list goes on, but the point has been made. Whether a state, county, or city explicitly chooses to racialize their prioritization, or simply defer to federal guidelines that do, leaving individual decisions up to front line workers, this is a top down policy that opens the door to racial euthanasia. It is not accidental that Ezekiel “EZ Kill” Emanuel is a key advisor to the Biden COVID task force. Emanuel, who was the author of ObamaCare’s infamous “death panels,” now argues that no one deserves to live beyond age 75. And, of course, more than 80% of all COVID deaths and hospitalizations are in the age 65 and over age group.\n\nThis chart compares the known ethnic distribution of COVID-19 deaths in the United States from the beginning of the pandemic through December 8, 2021, with the ethnic makeup of the country.\n\nWhat is immediately obvious is that the death count basically matches the population count. Nearly 2/3 of all Americans killed by COVID-19 are white, far more than all other ethnicities combined. Yet the virtue-signaling statisticians are hyper-focused on the slightly higher proportional death toll among black/African people, ignoring the vastly higher total death toll among white people. For this reason, monoclonal antibodies are being rationed on a racial bias to drive up the proportional death toll among white people, instead of massively increasing production (which would be the actual “equitable” solution).\n\nTo Download a .pdf copy of this article click here.", "opengraph": {"title": "Biden Admin Steps Up Euthanasia Program for Political Vaccine Opponents", "url": "https://www.larouchepac.com/biden_admin_steps_up_euthanasia_program_for_political_vaccine_opponents", "description": "The Biden administration is enacting the advice of Obama’s medical advisor Ezekiel Emanuel, that simply denying medical care is the best way to reduce costs, rather than euthanasia. But don’t let anyone fool you into thinking this is about reducing medical overspending, or the “equitable” rationing of scarce medical therapies. It’s also a dictatorial power grab with undercurrents of racial supremacy.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/6747/meta_images/original/51101782971_ec2fbfb9f2_b_%281%29.jpg?1641147437", "site_name": "LaRouchePAC"}, "tags": ["3.Category-Geopolitics", "1.Written-Article", "3.Category-USA"], "tweets": [], "movies": [], "links": ["https://greenwald.substack.com/p/new-york-is-using-race-to-determine", "https://twitter.com/Harrison_of_TX/status/1459591738809622532?s=20", "https://www.usatoday.com/story/news/factcheck/2021/11/24/fact-check-texas-antibody-treatment-eligibility-not-based-race/8699689002/", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/clinical-care/underlyingconditions.html", "https://www.tarrantcounty.com/en/news/2021/covid-19-infusion-center-opens-in-tarrant-county.html", "https://www.health.state.mn.us/diseases/coronavirus/hcp/mabethical.pdf", "https://coronavirus-download.utah.gov/Health/Utah_CSC_Monoclonal_Ab_Guidelines_v16_09012021.pdf", "https://www1.nyc.gov/site/doh/about/press/pr2021/monoclonal-antibody-treatments-save-lives.page", "https://www.foxnews.com/us/maryland-doctor-monoclonal-antibody-treatments", "https://www.larouchepac.com/are_unvaccinated_lives_unworthy_of_life", "https://d3n8a8pro7vhmx.cloudfront.net/larouchepac/pages/6747/attachments/original/1641502506/20220102-Biden's_Euthanasia.pdf?1641502506"], "authors": [], "publish_date": null}