{"result_id": "183016", "URL": "https://larouchepac.com/20201024/trump-s-crash-program-vaccine-being-sabotaged-renegade-democratic-health-establishment", "timestamp": "2023-04-25 16:10:20 CEST+0200", "meta": {"description": "Thursday evening’s debate seemed to begin hopefully. The moderator, Kristen Welker, gave President Donald Trump “two and one-half minutes without interruption” to address the COVID-19 crisis. Trump opened with America’s scientific crash program, “Operation Warp Speed,” and its amazing progress...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20201024/trump-s-crash-program-vaccine-being-sabotaged-renegade-democratic-health-establishment", "encoding": "utf-8"}, "image": null, "domain": "larouchepac.com", "title": "Trump’s Crash Program for Vaccine Is Being Sabotaged by Renegade Democratic “Health” Establishment", "cleaned_text": "Thursday evening’s debate seemed to begin hopefully. The moderator, Kristen Welker, gave President Donald Trump “two and one-half minutes without interruption” to address the COVID-19 crisis. Trump opened with America’s scientific crash program, “Operation Warp Speed,” and its amazing progress in developing a vaccine to be available within weeks. Welker, as if allergic or immune to optimistic thought, immediately forgot her own instructions and interrupted: Would he “guarantee” the vaccine? And what vaccines? Trump said it was not a guaranteed matter, but it would be here by the end of the year. He emphasized that the military had made all the logistical arrangements for a rapid deployment. (Gen. Gustave Perna, chief operating officer, is the logistical co-head of Operation Warp Speed, while Dr. Moncef Slaoui, chief advisor, is the scientific co-head.)\n\nIn contrast to Welker’s deaf response, Dr. Robert Wachter, the chair of Medicine at UC San Francisco and a furious critic of the Trump Administration’s pandemic response, had an honest if very reluctant response recorded in today’s Washington Post and other media: “Going from where we were in January and February — where we are going to be hit by this tsunami — to very likely having a vaccine, or more than one vaccine, that is proven safe and effective within a year, is staggeringly impressive, and would only have happened with strong and effective federal action.” Wachter called the vaccine mobilization “nearly flawless,” and which he told the Washington Post he found the words difficult to say.\n\nWachter’s response is honest. It contrasts with the deliberate sabotage of vaccine development attempted by politicized doctors who see totally unnecessary deaths as a collateral consequence of maintaining the total lie that President Trump is responsible for all deaths by COVID. These “doctors” have delayed vaccine deployment until after the November election amidst a totally predictable spike in virus infections, because of their personal hatred of Donald Trump. How many unnecessary deaths will ultimately result from this genocidal campaign against our nation’s infirm and elderly?\n\nPfizer began phase 3 trials on July 27th and said on September 3rd that they were on track to deliver excellent results no later than mid-October, that is, before the election. Egged on by New York Times and Washington Post warnings of a Trump “October Surprise,” one Dr. Eric Topol, a cardiologist at California’s Scripps Research Institute with a big Twitter following, swung into action. Topol has been the media’s go-to guy for months for “authoritative” medical objections to Trump’s program. His argument has been that, if it is fast — that is, a crash program — it is suspect; and no one need pay attention to the “emergency” part of the Emergency Use Authorization.\n\nIn September, Topol led a campaign accusing FDA head Stephen Hahn of being a tool of Trump in the push for a vaccine, and calling upon him to resign. He targeted and enlisted board members of Pfizer. This led to a series of phone calls between Topol and Hahn, which Topol describes as rather chummy: “I went from way negative to way positive.” He now calls Hahn a “friend,” who has had to withstand tremendous pressure from Trump and HHS Secretay Alex Azar. Hahn consented to a change in policy in mid-to-late September, whereby any vaccine EUA approval would be delayed for an extra two months after the successful assessment of the Phase 3 trial. Peter Marks, the man at FDA who must approve the vaccine has been fully on board with this deadly scam. Andrew Cuomo, Kamala Harris, and others are leading the campaign against any vaccine for which Donald Trump could get credit. These are the conceits of the same oligarchs who cheered Obama’s death panels or who, like Michael Bloomberg, called for triage of the elderly completely out of medical treatment because. “it will bankrupt us.”\n\nSTAY IN TOUCH WITH US\n\n SIGNUP HERE FOR UPDATES", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20201024/trump-s-crash-program-vaccine-being-sabotaged-renegade-democratic-health-establishment", "title": "Trump’s Crash Program for Vaccine Is Being Sabotaged by Renegade Democratic “Health” Establishment", "description": "Thursday evening’s debate seemed to begin hopefully. The moderator, Kristen Welker, gave President Donald Trump “two and one-half minutes without interruption” to address the COVID-19 crisis. Trump opened with America’s scientific crash program, “Operation Warp Speed,” and its amazing progress...", "image": "https://larouchepac.com/sites/default/files/trump-warp-speed-july27-2020.jpg", "image:url": "https://larouchepac.com/sites/default/files/trump-warp-speed-july27-2020.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/trump-warp-speed-july27-2020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://dailycaller.com/2020/02/18/mike-bloomberg-deny-treatment-elderly-cancer-patients/", "https://act.larouchepac.com/email?recruiter_id=139893"], "authors": [], "publish_date": null}