{"result_id": "183049", "URL": "https://www.larouchepac.com/recall_mandate_newsom_send_a_powerful_blow_to_president_covid_joe", "timestamp": "2023-04-25 16:11:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/recall_mandate_newsom_send_a_powerful_blow_to_president_covid_joe", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Recall Mandate Newsom—Send a Powerful Blow to President COVID Joe!", "cleaned_text": "The next days are critical. Every action you take to mobilize your friends, family and complete strangers will have an impact on the recalling of Governor Mandate Newsom.\n\nMany of you are angry at Newsom because of his mandates to vaccinate, mask up, and lockdown. That includes the many police, fire fighters, nurses, and others, of every political persuasion and creed, who have done their own frontline and other research on whether these measures will “solve” COVID. They won’t. Others, who have already had COVID, don’t need to be vaccinated because they have natural immunity.\n\nYesterday, the Mad Hatter occupying the White House issued national mandates for vaccination, angrily denouncing those who aren’t vaccinated as the modern equivalent of leppers in our land. Not surprising since Biden owes his election to the politicization of COVID. That’s why we call him COVID Joe. This move is part of the Washington effort to back Mandate Newsom.\n\nBut COVID Joe and Mandate Newsom are just the well-trained stooges, conducting crisis management and rule by decree for a global empire ruled by oligarchs and central bankers, and centered in City of London and its offshoots like Prince Charles’ World Economic Forum. These are the same British intelligence and financial networks which ran the Russiagate and other soft coup actions against Donald Trump. These are the very same networks which ran September 11, 2001, imposing our present police and surveillance state based on rule by decree.\n\nThey are now desperate, as their financial system is failing, their power is waning, and millions of Americans have risen to take the nation back. These citizens include Democrats, Republicans, and independents in full revolt against what we became after September 11, 2001—a country propelled into permanent war and disenfranchisement and censorship of any opposing voice.\n\nMandate Newsom now thinks he can bully and buy the citizens of California by threatening them and inciting fear, pessimism, and rage while finally flooding out the COVID relief checks which should have been in people’s mailboxes months ago.\n\nCOVID, he says, will spread if he is recalled. That’s some bluster in a state with the highest COVID incidence and deaths in the nation under his leadership, cases and deaths concentrated in the minority communities Newsom is seeking to whip to his side. Now, that champion of totally unfilled hope and change, Barack Obama is putting up 30 second spots echoing Newsom. If you recall Newsom, Obama implies, the children of your state will die. That would be the same children who Newsom’s education policies have left without the ability to read or write. This onslaught also features a multitude of false polls, already claiming victory for Mandate Newsom, urging you not to bother to vote.\n\nBehind these desperate lies is a simple fact, if they lose now in California, they lose the United States. They are counting on pessimism, rage, cynicism, and the small mindedness they have otherwise inculcated in our citizens to get their way.\n\nGrab the power granted to us by our Declaration of Independence and Constitution and vote Yes, on the recall. These principles in our founding documents give us the means to rebuild our state, our nation, and all of humanity with the creative beautiful minds that our creator has given us. Use that power now and in the future.\n\nGo out and mobilize and overwhelm our enemy’s fake narratives and machinations by organizing the many who agree with us against the few who would control us. Go to the polls and vote in person, bringing your friends with you. Bring your mail in ballot and watch poll workers write surrendered or void. Bring your black ball point pen, in case they try to give you a felt marker.\n\nDo this knowing that we can build nuclear and other advanced energy sources to power a productive and growing economy once again. We can build the infrastructure to bring water to our cities and farms while using advanced science to produce more water. We can end homelessness by building a real economy based on growth and industry and the real wages to support families. We can create a culture of beauty and classical ideas, so that our children and our children’s children will be able to create new generations of growth and development.\n\nLyndon LaRouche often spoke of just the moment in which we now find ourselves:\n\n\"Sometimes, thus, when a people is strained to the limit, when despair envelops the sensibilities, as the vast majority of our despairing citizens are crying out now, their capacity to respond to a higher aspect of their inherent human nature, empowers them to hope, and through the power of hope to recognize that they, as a people, are given the power to bestow, as if by a prayer, a rescue from evil for themselves.\"\n\nWe now have the power to completely change all rotten history of the past 20 odd years. RECALL MANDATE NEWSOM!", "opengraph": {"title": "Recall Mandate Newsom—Send a Powerful Blow to President COVID Joe!", "url": "https://www.larouchepac.com/recall_mandate_newsom_send_a_powerful_blow_to_president_covid_joe", "description": "The next days are critical. Every action you take to mobilize your friends, family and complete strangers will have an impact on the recalling of Governor Mandate Newsom.\r\n\r\nMany of you are angry at Newsom because of his mandates to vaccinate, mask up, and lockdown.  That includes the many police, fire fighters, nurses, and others, of every political persuasion and creed, who have done their own frontline and other research on whether these measures will “solve” COVID.  They won’t.  Others, who have already had COVID, don’t need to be vaccinated because they have natural immunity.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/6058/meta_images/original/E-yH-08VQAA3aCa_%281%29.jpg?1631296194", "site_name": "LaRouchePAC"}, "tags": ["1.Written-Update", "3.Category-USA"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}