{"result_id": "183028", "URL": "https://www.larouchepac.com/are_unvaccinated_lives_unworthy_of_life", "timestamp": "2023-04-25 16:10:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/are_unvaccinated_lives_unworthy_of_life", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Are Unvaccinated Lives Unworthy of Life? We Are Slipping into the Space Addressed at Nuremberg", "cleaned_text": "It is difficult to pinpoint exactly when it started, but we are now at a point where the threat posed is undeniable to any rational person: those treating COVID-19 as an unending apocalypse, worthy of stripping away all personal freedoms in the name of security and safety by emergency decree, have embraced the same subtle shift in thinking that Dr. Leo Alexander warned about in his 1946 article, , written following the Nuremberg Trial of the Nazi medical doctors. This move to totalitarianism also draws upon the playbook Lord Bertrand Russell described in his 1951 book, The Impact of Science on Society . Russell proposed the use of mass psychology to institute a “scientific dictatorship” that places the state between children and their families, first exemplified in the imposition of gender and race ideologies in the schools, and now, in implementing child vaccine mandates.\n\nIn this engineered fascist propaganda shock front regarding public health, science, critical thinking, and the Hippocratic Oath are being abandoned in favor of politically punishing the unvaccinated by denying them necessary medical treatment—while deliberately sabotaging viable treatments for COVID other than vaccines. In previous iterations of American science, treatments would have been found by now for those objecting to vaccinations—life-saving treatments for COVID. Elective surgeries and preventive care and screenings, now creating a healthcare crisis of their own as needlessly endangered patients swarm emergency rooms, would have continued.\n\nThe fully complicit mainstream media attempts to justify what can only be called a “soft program” for actually killing people, by claiming that those who are unvaccinated, not wearing masks, or otherwise resisting, are uniformly Trump supporters, and therefore unworthy of medical treatment or scientific consideration. According to their brutal narrative, these citizens represent a “threat” to the compliant and vaccinated. In reality, large swaths of the working poor and poor are unvaccinated across all races and ethnicities. Many first responders, nurses, firemen, and police are unvaccinated. The Biden Administration is now engineering a remake of the American military, using vaccination status and adherence to Critical Race Theory (CRT) and gender fluidity as criteria for employment.\n\nIt is noteworthy that Dr. Alexander characterized the Nazi doctors as “on the whole meek and over-polite fellows who committed inhuman crimes because they found themselves suspect by their superiors.” Cancel culture has simply dispensed with the jackboots.\n\nDo not expect a simple historical repeat of the Nazi medical experiments described by Dr. Alexander—rather, the means employed here are more subtle. Yet the motive remains the same as in Adolf Hitler’s decree: some lives are “unworthy of life” and should be afforded a “mercy killing” for the good of society as a whole. Overpopulation is a political and economic problem for the world’s oligarchical elites, as it was for the Nazi war machine.\n\nJoe Biden’s COVID task force is being advised by the notorious Dr. Ezekiel Emanuel, the infamous death panel proponent of Obamacare. Now, he is arguing that anyone over 75 is leading an unworthy life and deserves, simply, a “good death.” Do not imagine Zeke Emanuel is an outlier. His views infect medical ethics circles nationally, and are espoused by the Wall Street crowd which currently controls both political parties, outside the Trump movement. Michael Bloomberg, for example, argued in a 2011 video released by the during his failed 2020 Presidential campaign, that fully treating the oncoming Baby Boomer elderly, rather than rationing and denying medical care, “was going to bankrupt us.”\n\nThis is the same argument that Dr. Gerhard Wagner, leader of the Nazi Doctors group, made at the National Socialist Party Congress in 1934: “The economic burden represented by people suffering from hereditary diseases is a danger for the State and for society. In all, it is necessary to spend 301 million Reichsmarks per year for treatment....”\n\nWhatever proportions these crimes finally assumed, it became evident to all who investigated them that they had started from small beginnings. The beginnings at first were merely a subtle shift in emphasis in the basic attitude of the physicians. It started with the acceptance of the attitude, basic in the euthanasia movement, that there is such a thing as life not worthy to be lived. This attitude in its early stages concerned itself merely with the severely and chronically sick. Gradually the sphere of those to be included in this category was enlarged to encompass the socially unproductive, the ideologically unwanted, the racially unwanted and finally all non-Germans. But it is important to realize that the infinitely small wedged-in lever from which this entire trend of mind received its impetus was the attitude toward the non-rehabilitable sick.\n\nVaccination as a Requirement to Receive Emergency and Life-Saving Medical Care\n\nIt is rather significant that the German people were considered by their Nazi leaders more ready to accept the exterminations of the sick than those for political reasons. It was for that reason that the first exterminations of the latter group were carried out under the guise of sickness.\n\nOn August 19, 2021, the published an article about a leaked memo written by Dr. Robert Fine, co-chair of the North Texas Mass Critical Care Guideline Task Force. In the memo, Dr. Fine anticipated a possible hospitalization surge from Delta variant infections, and stated that “[COVID-19 vaccine] status therefore may be considered when making triage decisions as part of the physician’s assessment of each individual’s likelihood of survival.” He elaborated that physicians should be more accommodating if the reason the person seeking treatment is not vaccinated was outside their control. Fine continues, “Many are understandably angry and frustrated with the unvaccinated, but triage must remain grounded upon likelihood of survival. Health care professionals should continue to honor duties of care and compassion.”\n\nHad there not been major, immediate blowback from the leaking of this memo, which was circulated to triage centers across northern Texas in anticipation of the Delta variant surge, that would have been the first time doctors would have been allowed to take a person’s vaccine status into account (among other morbidity factors) when considering who is allowed to be treated at the hospital in a Level 3 crisis, and who will be allowed to die. Dr. Mark Casanova, director of clinical ethics for Baylor University Medical Center and a spokesperson for the task force, admitted this is a conversation that has “been bubbling under the surface” for some time. Following the publication of the article, he quickly backtracked, and said vaccinations should not be among the factors hospitals consider when making critical care triage decisions.\n\nAs the article noted, Casanova predicted that if this change were copied by others, then medical care, for as long as the crisis persists, “is going to look and feel different for everybody who is alive right now in the United States of America.” Consider two case studies:\n\nDawn McLaughlin, of Denver, Colorado, had been on the waiting list for kidney transplants since 2018, due to her hereditary disease that covers her kidneys in painful, bursting cysts. As reported by CBS Channel 4 on October 20, 2021, McLaughlin’s doctor had recommended she not get the jab due to the still experimental nature of the vaccine, and an abundance of caution for unexpected side effects relating to her unique condition. University of Colorado Health removed her from the list for transplant consideration, because they had recently adopted a policy requiring full COVID-19 vaccination to remain approved. Their reason for denying her this life-saving set of transplants is because, “For transplant patients who contract COVID-19, the mortality rate ranges from about 20% to more than 30%. This shows the extreme risk that COVID-19 poses to transplant recipients after their surgeries….”\n\nLeilani Lutali, of Colorado Springs, Colorado, was also denied her kidney transplant by UCHealth because she wasn’t vaccinated. Lutali has stage five kidney failure at age 56. She says she already had COVID-19 and recovered naturally. Her friend (also unvaccinated) was willing to offer one of her kidneys. Both were denied.\n\nIn addition to Colorado, transplant centers in Washington, Vermont, Alabama, Massachusetts, and Ohio also require full vaccination prior to surgery. (In both the McLaughlin and Lutali cases, lives were saved because they were approved for transplants in northern Texas.)\n\nIllinois State Representative Jonathan Carroll (D) filed legislation on December 6, 2021 to prohibit medical insurance from covering costs for those who choose not to receive the vaccine and then go to the hospital for COVID-19 treatment. His bill summary reads: “A person who is eligible to receive a COVID-19 vaccine and chooses not to be vaccinated shall pay for healthcare expenses out-of-pocket if the person becomes hospitalized because of COVID-19 symptoms.” In an interview, Carroll complained he has been called a Nazi for his bill, and defended himself by saying, “When we see over $5 billion has been spent on health care costs related to the unvaccinated, those of us that are vaccinated are frustrated.”\n\nVaccination as a Requirement to Keep Your Job\n\nAn important feature of the experiments performed in concentration camps is the fact that they ... also were motivated by rather sinister practical ulterior political and personal purposes, arising out of the requirements and problems of the administration of totalitarian rule.... These cases illustrate a method consciously and methodically used in the SS, an age-old method used by criminal gangs everywhere: that of making suspects of disloyalty clear themselves by participation in a crime that would definitely and irrevocably tie them to the organization….\n\nThe important lesson here is that this motivation, with which one is familiar in ordinary crimes, applies also to war crimes and to ideologically conditioned crimes against humanity—namely, that fear and cowardice, especially fear of punishment or of ostracism by the group, are often more important motives than simple ferocity or aggressiveness.\n\nOn August 23, 2021, Defense Secretary Lloyd Austin required all branches of the military to set deadlines for service members to become vaccinated or face discharge, and later included National Guard and Reserves. Active-duty Air Force and Space Force personnel had to be fully vaccinated by November 2, active-duty Navy and Marines personnel by November 28, and active-duty Army personnel by December 15. About 46,000 personnel have refused the mandate or been denied exemption. They will be expelled without an honorable discharge. They will lose their veteran’s benefits, and will have to repay their bonuses and education grants. Guard members who do not get vaccinated will be prohibited from attending drills, which means they will not get paid, receive credit toward retirement, or receive their other benefits. According to Austin, these measures, are necessary because troops might get sick on deployment. Really? A total of 75 military personnel have died from COVID-19 since the pandemic began. The actual push is to punish independence and dissent, the type of thinking individuals the U.S. military needs to survive.\n\nOn September 9, 2021 and November 4, 2021, Biden signed two executive orders mandating full vaccination as a condition of employability for all federal employees (except the Congress, Supreme Court, and their staffs), and 17 million federal contractors, requiring all corporations with 100 or more employees to require vaccination as a condition of employment, and requiring vaccination of all health care workers at medical facilities which participate in Medicare and Medicaid. Presently these mandates have been stayed as unconstitutional in the federal courts.\n\nIn October, Biden’s Departments of Labor, Health and Human Services, and Treasury allowed employers to add an “affordable” monthly surcharge to the insurance premiums of the unvaccinated. In Nevada, for example, the surcharge for unvaccinated state employees is $55 per month. Kroger’s, one of the nation’s largest grocers, is cancelling paid leave for the unvaccinated who contract COVID and adding a $50 surcharge on the health insurance plans of unvaccinated managers and other nonunion employees. Delta Airlines has added a $200 monthly surcharge to its healthcare plan.\n\nOutgoing New York City mayor Bill De Blasio issued a city-wide vaccine mandate on December 6, 2021. In order to enter restaurants, fitness centers, and entertainment or performance venues, all children ages 5-11 will be required to prove at least partial vaccination, and everyone aged 12 and up must prove full vaccination. Dates for being banned from these businesses are December 15 and December 27, respectively. All employees at any business in NYC must be fully vaccinated to keep their job no later than December 27. All 5-11 year olds must show proof to participate in “high risk” extracurricular activities, such as school sports, band, orchestra, or dance.\n\nVaccination as a Requirement to Raise Your Children\n\nThe subject [of mass psychology] will make great strides when it is taken up by scientists under a scientific dictatorship.... The social psychologists of the future will have a number of classes of school children on whom they will try different methods of producing an unshakable conviction that snow is black. Various results will soon be arrived at.\n\nFirst, that the influence of home is obstructive.\n\nSecond, that not much can be done unless indoctrination begins before the age of ten.\n\nThird, that verses set to music and repeatedly intoned are very effective.\n\nFourth, that the opinion that snow is white must be held to show a morbid taste for eccentricity.\n\nBut I anticipate. It is for future scientists to make these maxims precise and discover exactly how much it costs per head to make children believe that snow is black, and how much less it would cost to make them believe it is dark gray.... When the technique has been perfected, every government that has been in charge of education for a generation will be able to control its subjects securely without the need of armies or policemen.\n\n[Johann Gottlieb] Fichte laid it down that education should aim at destroying free will, so that, after pupils have left school, they shall be incapable, throughout the rest of their lives, of thinking or acting otherwise than as their schoolmasters would have wished.... Diet, injections, and injunctions will combine, from a very early age, to produce the sort of character and the sort of beliefs that the authorities consider desirable, and any serious criticism of the powers that be will become psychologically impossible. Even if all are miserable, all will believe themselves happy, because the government will tell them that they are so.\n\nAlthough everybody who was in any degree progressive recognized the evils of oligarchy throughout the past history of mankind, many progressives were taken in by an argument for a new kind of oligarchy. “We, the progressives”—so runs the argument—“are the wise and good; we know what reforms the world needs; if we have power, we shall create a paradise.” And so, narcissistically hypnotized by contemplation of their own wisdom and goodness, they proceeded to create a new tyranny, more drastic than any previously known.\n\nPerhaps bacteriological war may prove more effective [at controlling population growth than traditional war]. If a Black Death could spread throughout the world once in every generation, survivors could procreate freely without making the world too full.... The state of affairs might be somewhat unpleasant, but what of it? Really high-minded people are indifferent to happiness, especially other people’s.\n\nThink about these statements by the man Lyndon LaRouche correctly characterized as the most evil man of the 20th Century when you view Dr. Anthony Fauci’s statement that he is science, addressing a pandemic which will last, perhaps, forever. COVID is not generally lethal in children, and those who get it generally have very mild symptoms. Think about these statements when you contemplate the Biden Administration’s support of the teachers’ unions and their bought politicians, who openly campaign against parent involvement in education while overtly brainwashing children.\n\nAfter the Food and Drug Administration (FDA) approved the Pfizer vaccine for minors aged 12-15 years, three medical policy writers working at the University of Pennsylvania and Yale published an op-ed in the Journal of the American Medical Association Pediatric (JAMA), to discuss their dislike of “political and culturally conservative” parents and guardians who do not want their children to be subject to vaccine mandates. In “COVID-19 Vaccination of Minors Without Parental Consent, Respecting Emerging Autonomy and Advancing Public Health,” the authors make the following recommendations:\n• \n• Lowering the standard age that children can petition for autonomy in medical decisions from 14 to 12 for healthy children, and 10 years old for children with an underlying medical condition that medical experts deem could be improved by vaccination;\n• Children aged 12 to 14 should be able to consent to vaccination, and while parents should be notified, they do not have to be, if the parent disapproves of that action;\n• Children aged 15-17 should be able to consent to vaccination, and parents do not need to be involved in the decision at all. Immunization should be kept confidential.\n\nThe authors argue that while states generally set 14 as the youngest age that children can begin to reason like adults about medical decisions, the crisis of the pandemic necessitates these changes. They conclude their article stating the imposition of the state between parents and their children on the question of medical autonomy is a matter of “individual and public health” that is necessary for the continued functioning of society. They even go so far as to claim “the ethical and public health concerns at stake are not restricted to COVID-19 vaccines. Policy makers and health officials must take action to address these concerns beyond the context of the current pandemic....”\n\nIn early December 2021, an employee at Barack Obama Global Prep Academy in south Los Angeles bribed a 13-year-old teenager with pizza, to get the jab without parental consent. His mother told NBC that the woman who gave him the shot and signed the paper told her son, “Please don’t say anything. I don’t want to get in trouble.”\n\nThe Los Angeles United School District’s (LAUSD) policy is that all children aged 12 and older must be vaccinated by January 10, 2022 or they will have to return to virtual classrooms. In a statement, the school admitted it rewards students who have been vaccinated, but refused to comment otherwise. Several lawsuits are pending against LAUSD.\n\nLast fall, the District of Columbia Council voted to allow children as young as 11 to get recommended vaccines without parental consent—a provision also challenged in court. The New Jersey and New York legislatures have bills pending that would allow children as young as 14 to consent to vaccines; Minnesota has one that would permit some children as young as 12 to consent to COVID-19 shots.\n\nAs of December 13, 2021, more than 1,000 colleges and universities across the United States require full COVID-19 vaccination as a prerequisite to attend school, and various school districts across 14 states have some level of mandate to attend in-person learning and/or participate in extra-curricular activities. There are many, many horror stories which circulate throughout the Internet and on Fox News, highlighting the results of these vaccine and lockdown strategies, strategies which are poisoning or otherwise destroying the minds of the nation’s next generation.\n\nHaving prosecuted the Nazi doctors for what became an overt euthanasia program, begun with cost-benefit analysis tables concerning human life, the Nuremberg Tribunal established principles of medical ethics concerning human experimentation. These principles, they said, need enforcement if the Nazi atrocities are not to occur again. The very first of these 10 principles is being violated, rampantly, in the world-wide medical experiment now taking place regarding COVID.\n\nLockdowns, mass masking, shutting the schools, rationing medical care --all such measures have caused massive societal harm without curbing the course of the virus. And all of them are being conducted without the element of informed consent. Propaganda-driven fear has replaced actual science and actual scientific evidence about the efficacy and dangers of the measures used.\n\nPresident Trump adopted a two prong strategy consisting of vaccines and therapeutics. Joe Biden’s presidential campaign was focused solely on a political attack on Trump’s strategy, proclaiming the need for a “national plan,” instead, staffed by scientific experts, i.e., people like Anthony Fauci and Zeke Emmanuel, and socially ostracizing and “canceling” medical professionals who proposed alternative measures and treatments. More people have died under Biden’s plan than died in the first year of the pandemic under Trump and there is evidence that this is intentional. For example, monoclonal antibody treatments were made widely available in Florida by Governor DeSantis with success, but the Biden Administration quickly imposed a regime of rationing.\n\nAll of this could have been avoided if Nuremburg’s first principle concerning informed consent had been uniformly applied. Here it is, with emphasis supplied: “The voluntary consent of the human subject is absolutely essential. This means that the person involved should have legal capacity to give consent; should be so situated as to be able to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, over-reaching, or other ulterior form of constraint or coercion; and should have sufficient knowledge and comprehension of the elements of the subject matter involved as to enable him to make an understanding and enlightened decision This latter element requires that before the acceptance of an affirmative decision by the experimental subject there should be made known to him the nature, duration, and purpose of the experiment; the method and means by which it is to be conducted; all inconveniences and hazards reasonably to be expected; and the effects upon his health or person which may possibly come from his participation in the experiment.\n\n“The duty and responsibility for ascertaining the quality of the consent rests upon each individual who initiates, directs or engages in the experiment. It is a personal duty and responsibility which may not be delegated to another with impunity.” You can see the rest of the principles here: https://www.ushmm.org/information/exhibitions/online-exhibitions/special-focus/doctors-trial/nuremberg-code\n\nSimple resistance --mass marches, and protests, are an important dynamic in halting this madness. But simple resistance is not sufficient to win the war in which we find ourselves. How far away we are from the space of Never Again, must be recognized. The new globalist fascism is out to destroy the United States and its republican experiment which they despise. Rather, like Lyndon LaRouche and Donald Trump you must stand on the shoulders of our forefathers and qualify yourself to run this government, recognizing that all the so called “experts” are corrupt, incompetent, and revel in the evil subversion of science proposed by Bertrand Russell. We have come far down a dark road, but the hysteria and desperation of our historic enemy, the modern British Empire and their insane acolytes inhabiting the White House, demonstrates that they have no answer to an aroused population which is wholeheartedly rejecting the left-wing antics which have always served as the breeding ground for fascism. Qualifying patriots to run the government, based on the science of political economy developed by Lyndon LaRouche, Alexander Hamilton, Matthew and Henry Carey, Friedrich List, and others, is the core mission of LaRouche PAC.\n\nFor a .pdf of this document, click here.", "opengraph": {"title": "Are Unvaccinated Lives Unworthy of Life? We Are Slipping into the Space Addressed at Nuremberg", "url": "https://www.larouchepac.com/are_unvaccinated_lives_unworthy_of_life", "description": "It is difficult to pinpoint exactly when it started, but we are now at a point where the threat posed is undeniable to any rational person: those treating COVID-19 as an unending apocalypse, worthy of stripping away all personal freedoms in the name of security and safety by emergency decree, have embraced the same subtle shift in thinking that Dr. Leo Alexander warned about in his 1946 article, Medical Science Under Dictatorship, written following the Nuremberg Trial of the Nazi medical doctors.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/6734/meta_images/original/1857858274_2343568d69_3k-resize.jpg?1639599195", "site_name": "LaRouchePAC"}, "tags": ["1.Written-Update", "3.Category-Geopolitics", "3.Category-USA"], "tweets": [], "movies": [], "links": ["https://nypost.com/2015/07/12/end-of-life-counselling-death-panels-are-back/", "https://dailycaller.com/2020/02/18/mike-bloomberg-deny-treatment-elderly-cancer-patients/", "https://www.ushmm.org/information/exhibitions/online-exhibitions/special-focus/doctors-trial/nuremberg-code", "https://d3n8a8pro7vhmx.cloudfront.net/larouchepac/pages/6734/attachments/original/1640898919/20211230-Are_Unvaccinated_Lives_Unworthy_of_Life__%281%29.pdf?1640898919"], "authors": [], "publish_date": null}