{"result_id": "183006", "URL": "https://www.larouchepac.com/only_real_american_economics_will_work_now_flee_the_austrian_fraud", "timestamp": "2023-04-25 16:09:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/only_real_american_economics_will_work_now_flee_the_austrian_fraud", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "It’s Time to Learn Real American Economics", "cleaned_text": "We are at a time when millions of Americans are outraged at government coercion over citizens’ lives, particularly the assaults on personal freedom and free speech. This ranges across the spectrum, from the vaccine mandates to the censorship and “de-platforming” now occurring on YouTube and throughout social media, to outright Satanic actions like suspending (or firing) teachers and school children for publicly stating that “there are only two genders.” All rational people recognize these attacks on personal liberty and sanity as un-Constitutional, anti-American, and evil.\n\nPart 3: Hayek’s Constitution of Liberty: The Worship of Oligarchical Culture\n\nBut we, as a people, are also plummeting into the worst economic crisis in decades. This is not simply a “financial” crisis, but a trajectory which is destroying the well-being and the lives of tens of millions of people. This process of death and destruction will only worsen and escalate under the prescriptions demanded by the World Economic Forum and the COP-26 climate agreements, agreements, and policies to which the Biden Administration is fully wedded.\n\nWe are facing an historic moment of decision. Thankfully, many citizens are answering the call to fight for a better future. They are speaking out, running for office, and taking other actions to defend the Republic.\n\nIn this environment, however, there is a great danger; there is a pernicious anti-American snake-in-the-grass which is attempting to worm its way into the patriotic movement. This force, while declaring its ardent patriotism and mouthing its dedication to “freedom” and “liberty,” is in reality pushing a philosophy and agenda which is contrary in every way to the founding principles of the American Republic. The economic prescriptions being put forward are British, not American; and what they propose will destroy what is left of the American productive economy. It must also be stated that the economic agenda of these people is hostile to, and in opposition to, what Donald Trump has enunciated as his own economic goals.\n\nThe people I am talking about go under different names and operate through many organizations. The thread which connects them all is their declared loyalty to what is called the “Austrian School” of Economics and to the writings of Friedrich A. Hayek and Ludwig von Mises. They declare the economic writings of Hayek and Mises to be the true basis for the American system of liberty and economy. This is an outright lie. What they are holding up for praise are the economic policies and cultural degeneracy of the 19 century British Empire, a monstrosity which was the declared enemy of the American Republic. In hiding behind buzz words like “liberty” and “freedom,” they seek to seduce Americans into supporting the imperial economics of the British oligarchy.\n\nIn this series of articles, we shall examine the outlook of Friedrich Hayek and the Austrian School in depth. We shall expose the evil which sits at its core, as Dante’s Lucifer ruled over Inferno from his frozen lake. This will all be discussed in the weeks to come. For now, in this introduction, we turn our attention to Hillsdale College. We do this for only one reason. It would be a mistake to over-emphasize the importance of Hillsdale, but at the same time it must be recognized that Hillsdale is now intervening aggressively, in a very pernicious way, into the patriotic pro-Trump movement, and were they to succeed they could destroy the history-changing potential of that movement.\n\nCurrently, Hillsdale is attempting to flood patriotic circles with a plethora of internet-based classes and courses, covering a wide variety of topics, but with a heavy emphasis on economics, American history and “western culture.” They maintain an extensive outreach operation, with seemingly a very large mailing list. They are attempting to make their anti-American outlook hegemonic among Trump supporters.\n\nHillsdale hides behind its noble beginnings. Founded in 1844 by abolitionist members of the First Free Will Baptist Church, a number of Hillsdale’s founders participated in the creation of the Michigan Republican Party, and a higher percentage of its student body served in the Union army during the Civil War than any other mid-west college. However, those events all took place more than 150 years ago, and since 1945—and particularly since the 1970s—things at Hillsdale have taken a very dark turn.\n\nIn the post-World War II years, Hillsdale became closely associated with Hayek’s Mont Pelerin Society, even hosting a number of their conferences. The Mont Pelerin Society was founded in Switzerland in 1947, with a major chunk of its initial funding coming from the Bank of England, arranged by the British aristocrat Baron Grantchester of Knightsbridge. From the beginning the Society has championed what is called 19 century “British Liberalism.” Hillsdale also works closely with a large number of other organizations and foundations, among which are the International Churchill Society and The Adam Smith Institute, both of which promote the ideas and practices of the 19 century British Empire. In the post-war years, Hayek and von Mises became regular speakers at Hillsdale. In 1975 the College hosted a special meeting of the Mont Pelerin Society, devoted entirely to the work of Hayek, and today Hillsdale boasts proudly of this connection. On their website they state:\n\n“Our economics program is shaped by a free-market perspective, and professors will help guide you through the essential ideas of thinkers such as the Austrian School economists Ludwig von Mises and Friedrich A. Hayek.”\n\nIn fact, upon his death, the entirety of Ludwig von Mises’ personal library was donated to Hillsdale, and the College is now the unofficial protector of the von Mises legacy.\n\nIn perusing the class courses at Hillsdale and the speeches and writings of its leading representatives, an astonishing discovery is to be made. For an institution which purports to be pro-American, the historical personages who are put forward as the intellectual heroes of the American Republic are Aristotle, the arch-imperialist Winston Churchill, the enemy of the American Revolution Adam Smith, and John Locke, the propagandist for the new Anglo-Dutch financial empire after 1688. Hillsdale’s leaders adore John Locke, and they treat Churchill like a God, as opposed to the British imperialists they both were in the real world.\n\nIn the Hillsdale curriculum, there is almost no discussion of Benjamin Franklin, George Washington or Alexander Hamilton, the initiators of the American Revolution, the , the U.S. Constitution, and the American System of Economics. No mention at all of Gouverneur Morris, the author of the to the U.S. Constitution, nor of his close friend John Jay. Abraham Lincoln, the savior of the American Republic, is barely mentioned, and then what is said about him misrepresents his views and policies.\n\nThere is only one American figure whom the elders of Hillsdale hold up for uncritical and effusive praise, —James Madison. He is the American paragon of freedom, as declared by Hillsdale. In a 2010 article published in the Hillsdale College journal , titled “Outline of a Platform for Constitutional Government,” College President Larry Arnn heaps praise on Madison, without ever mentioning Washington, Hamilton, and Morris, —and this is not an anomaly. The Hillsdale faculty devote an enormous amount of time promoting Madison.\n\nIn answer to them, let us here present a little of the actual history:\n\nAt the Philadelphia Constitutional Convention, Madison was a note taker and little more. In addition to the doubtful veracity of those notes and his later recollections, Madison’s views on government were at great variance with those of Washington, Hamilton, and Morris, and it was their views, not Madison’s which generally prevailed in the final document. As to the , Madison was Hamilton’s as an author for a selection of those Papers. Initially, Hamilton asked Gouverneur Morris to be his partner in a series of essays on the Constitution, but Morris declined. Next, he asked John Jay, but after authoring a number of them, Jay was forced to withdraw due to ill health. Then Hamilton asked William Duer, but he rejected Duer’s several proposed articles as incompetent. It was only then that he turned to Madison, probably because there was no one else left to ask.\n\nArnn and Hillsdale bigwigs slobber over the Madison-authored , but for anyone who has both read the entirety of those Papers and who also comprehends the intention of both the the U.S. Constitution, the insights and power of Hamilton’s contributions to the towers over those authored by Madison, and on a number of subjects which Madison addresses, it is very clear that he does not understand at all the true nature of a Constitutional Republic.\n\nEven worse, Madison led the almost treasonous insurrection against George Washington and Alexander Hamilton during Washington’s first Presidential term, and then in 1799 he authored the which avowed that individual states could both declare a federal law unconstitutional and declare the same law null and void. George Washington was so outraged by this that he told Patrick Henry that if “systematically and pertinaciously pursued,” it would “dissolve the union or produce coercion.” Later, as President in 1812, when DeWitt Clinton and Gouverneur Morris met with him, seeking federal funding for the Erie Canal, Madison flatly refused, declaring the project unconstitutional. That same year, Madison and his supporters in Congress succeeded in abolishing Hamilton’s Bank of the United States and plunging America into economic chaos. It should also be noted that Madison was a lifelong enthusiastic supporter of slavery, never even showing the moral qualms that haunted Thomas Jefferson.\n\nYet it is the incompetent fool Madison—not Franklin, nor Washington, nor Lincoln—who is the American hero in the Hillsdale curriculum!\n\nTo return to economics, Hillsdale’s economics curriculum is devoted almost entirely to the Austrian (or more accurately, the Austrian-British) School. Its premier class is titled “Austrian Economics I and II,” a course which they state “will present, analyze and critically assess the Austrian school of economics from its founder, Carl Menger, to present-day representatives such as Murray Rothbard and Israel Kirzner. The course will emphasize the works of Ludwig von Mises, whose personal library and papers will be utilized.”\n\nThere is also a heavy emphasis on “mathematical economics,” a 20 century oligarchical invention which attempts to reduce human creative economic progress to linear mathematical formulas, something which the Austrian School actually borrowed from that other British imperialist John Maynard Keynes.\n\nWhat you will not find in any of their offerings is a discussion of true American economics, —the economics of Franklin, Hamilton, John Quincy Adams, Henry Carey, and Abraham Lincoln. It has all been excised from the narrative of American history, to be replaced by a substitute which has been imported from London and other loci of the European oligarchy.\n\nSome readers might respond to this article, by saying, “OK, you’ve shown the connection of Hillsdale with Hayek, von Mises and the Mont Pelerin Society. But what’s the big deal? Their website supports Trump, and they seem to be patriots, and anyway I agree with them about the tyranny of big government, so what is the problem?”\n\nThose questions will be answered in the next two installments of this series. By the end, hopefully, the pure evil and anti-Americanism of what Hillsdale is selling will become very, very clear.\n\nDownload a copy of this post here.\n\nPart 4—Hayek and Keynes: Two Peas in a Pod", "opengraph": {"title": "It’s Time to Learn Real American Economics", "url": "https://www.larouchepac.com/only_real_american_economics_will_work_now_flee_the_austrian_fraud", "description": "Part 1 — Introduction:  What’s Wrong with Hillsdale College? - We are at a time when millions of Americans are outraged at government coercion over citizens’ lives, particularly the assaults on personal freedom and free speech. This ranges across the spectrum, from the vaccine mandates to the censorship and “de-platforming” now occurring on YouTube and throughout social media, to outright Satanic actions like suspending (or firing) teachers and school children for publicly stating that “there are only two genders.”  All rational people recognize these attacks on personal liberty and sanity as un-Constitutional, anti-American, and evil.\r\n", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/6124/meta_images/original/Untitled-1.jpg?1636987201", "site_name": "LaRouchePAC"}, "tags": ["4.Campaign-USA-Economy", "3.Category-Geopolitics", "1.Written-Article", "3.Category-American-History"], "tweets": [], "movies": [], "links": ["https://soundcloud.com/larouche-pac", "https://soundcloud.com/larouche-pac/hayek-1", "https://www.larouchepac.com/it_s_time_to_learn_real_american_economics_part_2", "https://www.larouchepac.com/it_s_time_to_learn_real_american_economics_part_3", "https://d3n8a8pro7vhmx.cloudfront.net/larouchepac/pages/6124/attachments/original/1637776754/Part_1_-_What's_Wrong_with_Hillsdale_College.pdf?1637776754", "it_s_time_to_learn_real_american_economics_part_2", "https://www.larouchepac.com/it_s_time_to_learn_real_american_economics_part_3", "https://www.larouchepac.com/it_s_time_to_learn_real_american_economics_part_4", "https://www.larouchepac.com/it_s_time_to_learn_real_american_economics_part_5", "https://www.larouchepac.com/it_s_time_to_learn_real_american_economics_part_6", "https://www.larouchepac.com/it_s_time_to_learn_real_american_economics_part_7"], "authors": [], "publish_date": null}