{"result_id": "183033", "URL": "https://larouchepac.com/20210115/british-empire-s-great-reset", "timestamp": "2023-04-25 16:11:09 CEST+0200", "meta": {"description": "by Robert Ingraham - On January 20, 2021 Joe Biden is scheduled to be inaugurated as President of the United States. On the very next day the World Economic Forum, an organization composed of the richest and most powerful people in the world, will be convening a four day online international...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20210115/british-empire-s-great-reset", "encoding": "utf-8"}, "image": null, "domain": "larouchepac.com", "title": "The British Empire’s ‘Great Reset’", "cleaned_text": "On January 20, 2021 Joe Biden is scheduled to be inaugurated as President of the United States. On the very next day the World Economic Forum, an organization composed of the richest and most powerful people in the world, will be convening a four day online international conference. The title of that event is “The Davos Agenda,” and it is intended to launch an organizing drive for the WEF’s “Great Reset Initiative.” Since Joe Biden’s campaign slogan and the Great Reset’s campaign slogan are exactly the same, you can make some pretty sound predictions about what is coming from Biden. Do not be fooled by the fact that he repeatedly stumbles over the words in that slogan every time he says it. And, he stumbles through the words repeatedly, in every speech he gives, as if hypnotically entranced.\n\nThe idea of a “Great Reset” was first proclaimed at last year’s WEF conference which took place January 21-24, 2020 in Davos, Switzerland. Participants at that 2020 conference included Kristalina Georgieva (Managing Director of the International Monetary Fund), António Guterres (Secretary-General of the United Nations), Christine Lagarde (President, European Central Bank), Sharan Burrow (General Secretary, International Trade Union Confederation), Bradford L. Smith (President, Microsoft), Bernard Looney (Chief Executive Officer, British Petroleum), George Soros (Chairman of the Soros Fund), and Ajay S. Banga (Chief Executive Officer, Mastercard)—among others. In other words, a who’s who of the oligarchical, financial and corporate elite.\n\nThe agenda of the Great Reset is pure fascism: Rule by an oligarchy, the elimination of national sovereignty, the abrogation of personal liberty, a curtailment of science and industrial progress, and the systematic reduction of living standards, particularly in the United States and Europe. In one sense, the Great Reset bears a strong resemblance to what is known as “corporatism,” as that term was applied to the regimes of Mussolini’s Italy and Hitler’s Germany. Another term that is applicable is “synarchism,” which essentially defines a “Nazi-Communist” movement, created and led by oligarchical interests. It is simultaneously both “left” and “right:”—the key to understanding it is its oligarchical sponsorship.\n\nWhat is the British Empire?\n\nCritics of the Great Reset denounce it as “socialism.” Wrong! Wrong! Wrong! This is not socialism, but rather an extreme form of imperial economic and social policy. The “Great Reset Initiative” is nothing but a grab for power by the modern-day British Empire, the very empire against which the American Revolution was fought in 1776. The intention is to subjugate every nation to the diktats of the financial and oligarchical elite.\n\nThe problem is that very few people understand what the British Empire is. Some think it no longer exists, that it disappeared. But the British Empire never disappeared—it simply adapted. Part of the problem is that people make the mistake of identifying the British Empire with the nation-state of Great Britain, rather than with the oligarchical financial system based in the City of London. That imperial financial system owes allegiance to no nation-state, and it has underlings all over the world.\n\nThe British Empire is a financial and oligarchical empire. Its origins began in Amsterdam between 1601 and 1609, with the establishment of the Bank of Amsterdam, the Bourse (stock exchange) and the Dutch East India Company. This financial paradigm was then exported to London between 1690 and 1698, with the creation of the Bank of England, the London Stock Exchange and the (new) British East India Company. As Lyndon LaRouche described it, this was the Anglo-Dutch system of imperial finance. In contrast to the Renaissance idea of the Commonwealth (Common Good), the Anglo-Dutch model was always intended to serve a ruling elite. Out of those 17th century developments, a system of Private Central Banking was born, a system which has remained hegemonic in Europe for 300 years and one which insists that private oligarchical interests will control the economy, banking and finance, not sovereign governments.\n\nThe oligarchy’s Central Banking System defines “wealth” strictly in monetary terms. It’s all about money:—who has it, who controls it and who sets the rules. It has no concern for actual human progress. From the beginning, this system has been hostile to science and physical economic growth. The British Empire of the 18th and 19th century, for example, was primarily financed by enormous profits from slave-trading and drug-trafficking.\n\nAs George Washington and Alexander Hamilton understood, only sovereign government has the power to defy the demands of empire and to pursue policies which will benefit the Common Good. The United States Constitution explicitly places all power over money, banking and finance under the authority of the sovereign U.S. government, and Hamilton’s creation of a National Bank established a national Credit System, whereby the financial resources of the nation could be put to use to catalyze growth in industrial and scientific projects which would increase the productivity and well-being of the population.\n\nDonald Trump’s primary sin, in the eyes of the oligarchy, is that he insisted on reasserting the national sovereignty of the United States.\n\nToday’s imperial elites demand a de facto surrender of all national sovereignty. They proclaim that they—not sovereign governments—run the world. This is not socialism, nor merely “globalization” as that term is usually understood. It is a financial empire run by and for private oligarchical interests. The Greta Thunbergs and Bernie Sanders of the world are just the oligarchy’s foot-soldiers, too stupid to recognize the genocidalists they serve.\n\nThe oligarchs are now attempting to seize total control. One of the major speeches at the 2020 Davos conference was delivered by Prince Charles—His Royal Highness Prince Charles Philip Arthur George, Prince of Wales, KG, KT, GCB, OM, AK, QSO, CC, SOM, CD, PC, ADC, Earl of Chester, Duke of Cornwall, Duke of Rothesay, Earl of Carrick, Baron of Renfrew, Lord of the Isles and Prince and Great Steward of Scotland—who stated:\n\n“We have a golden opportunity to seize something good from this crisis — its unprecedented shockwaves may well make people more receptive to big visions of change... “It is an opportunity we have never had before and may never have again.”\n\nCharles’ role in the Great Reset is not peripheral. An official statement on the website of the World Economic Forum credits him with co-authorship of the project:\n\n“The Great Reset is a new initiative from the World Economic Forum and HRH the Prince of Wales to guide decision-makers on the path to a more resilient, sustainable world beyond coronavirus.”\n\nExactly what does the Great Reset propose to do? The first—unstated—goal is to eradicate all traces of the Trump presidency and to force total American subservience to a Malthusian global agenda.\n\nIn addition, their proposed policies revolve around three main thrusts:\n• First, to use the Covid-19 pandemic to conduct a sweeping remaking of political, social and economic life, all of which is to be dictated top-down, overriding or coopting national, state and local governments. As part of this, all dissenting voices will be silenced, and civil liberties will be surrendered.\n• Second, the heart of their agenda is green, green, green. They intend to force compliance to the Paris Climate Accords, de-carbonize the world economy in a way that will prevent any industrial or manufacturing growth and reduce living standards across North America and Europe. Productive jobs will be eliminated, and an impoverished population will be made dependent on “hand-outs” from their respective governments. Don’t think “socialism” here; rather, think of the “bread and circuses” provided to the poor by the rulers of the Roman Empire.\n• Third, any remaining semblance of sovereign control over banking and finance will be eliminated, this by a number of measures, including the creation of a global “digital currency” which will function above the authority of sovereign governments, as well as all national banking systems. This will initiate a global financial dictatorship controlled and run by the oligarchy itself.\n\nSpokesmen for the Great Reset are very candid about much of this. In fact, their arrogance is somewhat astonishing. Things are being openly proposed and discussed which would have rightly been called treasonous only a few decades ago. Their confidence, however, is not entirely misplaced. Europe is already completely on-board with this agenda. This is lawful. Europe never freed itself from the oligarchy’s private central banking system, and since the creation of the European Union in 1992 and its further oligarchical transformation by the Lisbon Treaty in 2007, Europe has become the world’s premier oligarchical state. Today it plays a central role in promoting the elites’ global agenda.\n\nIn the months ahead, “Climate Change” will be the primary argument used to force through a destruction of what is left of the productive economy, both in the United States and elsewhere. Joe Biden has already appointed the mentally challenged John Kerry to a newly created position of “Special Presidential Envoy for Climate” where he will have a prominent position on the National Security Council. In recent remarks, where he endorsed the WEF’s Great Reset, Kerry stated:\n\n“The notion of a Reset is more important than ever before. I personally believe we’re at the dawn of an extremely exciting time.... I know Joe Biden believes this. It’s not enough just to rejoin the Paris Climate Agreement for the United States. It’s not enough for us to do just the minimum of what the agreement requires. The Biden administration will focus on every sector of the American economy. There will be a 2035 goal to achieve net neutrality with respect to power and production … we’re ready to come back in and help to lead and raise the ambition in Glasgow to accelerate this incredible capacity for a transformation in the private sector.”\n\nOne of the key buzzwords repeated over and over by these oligarchical mouthpieces is “sustainable.”—a sustainable economy, a sustainable energy grid, a sustainable food supply, etc. This phraseology is taken directly from the United Nation’s Malthusian Agenda 2030 report, and what it prescribes is poverty level living standards for the population, depopulation, and a prohibition on real economic growth. Building new nuclear or other electrical generating capacity is outlawed. Instead, solar and wind power will be used to eke out just enough electricity to “sustain” a shrinking population. Similarly, for food consumption, health care, etc.—just enough production to “get by”—under conditions of growing poverty. Under this zero-growth regime, Europeans and Americans will be required to reduce their standards of living, so as to make the world more “clean,” “equitable” and “sustainable.”\n\nThe Vatican, under Pope Francis, is participating directly in this fascist agenda. They have created an organization named “The Council for Inclusive Capitalism with the Vatican,” which according to their website, is committed to building “inclusive and sustainable economies and societies.”\n\nThe president of the World Economic Forum is an individual named Klaus Schwab. Schwab is an “economist” who, over the last several decades has proven himself useful to the global elites he serves and has been rewarded with promotions to higher and higher positions. He was born in 1938 in Ravensburg, Germany, under the Nazi Regime, and if one looks at his writings, they smack of fascism, particularly of a certain variety. In his books The Fourth Industrial Revolution (2016), The Great Reset (2020) and Stakeholder Capitalism (2021), Schwab sets forth an explicit fascist/corporatist economic model interwoven with a Malthusian, anti-progress green agenda. His outlook bears an eerie similarity to the ideas of the green Nazi, Martin Heidegger.\n\nSchwab has been prominent in proposing something called “Stakeholder Capitalism.” In fact, the title of the WEF’s 2020 conference was “Stakeholders for a Cohesive and Sustainable World.” To put this in perspective, consider that in the 1980s and ‘90s Lyndon LaRouche waged a relentless campaign against what he called “Shareholder Values.” In fact, he wrote a book, The Ugly Truth About Milton Friedman, as part of this campaign. LaRouche exposed Friedman, as well as the whole “free market” Austrian School of Friedrich von Hayek, as un-American, as supporters of British Empire monetarism, where money—and its accumulation—is the primary purpose of economic activity.\n\nToday, we see Schwab and other proponents of the Great Reset also denouncing “Shareholder Capitalism,” but what they prescribe is the direct opposite of what LaRouche proposed. LaRouche called for a return to the Hamiltonian policy of directed credit into manufacturing, science, and technology, for the purpose of increasing human productivity and sparking upward human progress. “Stakeholder Capitalism,” as defined by the WEF, instead proposes to force governments and corporations to impose a “share the wealth” no-growth Malthusian policy upon every nation.\n\nThe co-founder of Salesforce.com, Marc Benioff, has stated, “Capitalism, as we know it, is dead. We’re going to see a new kind of capitalism—and it won't be the Milton Friedman capitalism, that is just about making money.”\n\nThis is nothing other than fascist corporatism,-- a partnership between the financial elite, Silicon Valley and the extended tentacles of an hereditary aristocracy to impose on the world a regime of poverty, depopulation, the elimination of national sovereignty and the massive centralization of wealth and power in the hands of a few,—all in the name of “equality,” “fighting racism,” “fighting misogyny,” and “saving mother earth.”\n\nWhat Can be Done?\n\nDespite the ravings of Prince Charles, Klaus Schwab and others, however, their success in implementing this imperial agenda is by no means assured. It is critical to grasp that the financial oligarchy is operating from a position of weakness. Over the last 50 years, and particularly since the financial crisis of 2007-2008, they have transformed the world’s banking and monetary systems into a giant speculative bubble, based on usury and gambling. That system—their system—is bankrupt. It is hanging by a thread. At the same time their determination to impose policies which will further impoverish the people of the United States and other nations will only lead to greater resistance.\n\nWhat is of great importance right now is that emerging patriotic leaders begin to educate themselves as to the economic solutions to the present crisis. It is urgent that growing numbers of people educate themselves as to the difference between American System of Hamilton and Lincoln and British Imperial economics. For example, John Maynard Keynes and Friedrich von Hayek are usually portrayed as opponents in economic theory, but, in reality, they were simply competitors within a British imperial system—two puppets of the City of London, who simply differed on how the British Imperial system should be run. They both were enemies of the policies of Alexander Hamilton and the American System. Lyndon LaRouche spent a lifetime organizing, writing and fighting to revive the American System. Isn’t it time now to find out what our founders and Abraham Lincoln were fighting for?\n\nLAROUCHEPAC IS DETERMINED TO SAVE THE USA\n\n GET OUR EMAILS AND FOLLOW US ON SOCIAL MEDIA", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20210115/british-empire-s-great-reset", "title": "The British Empire’s ‘Great Reset’", "description": "by Robert Ingraham - On January 20, 2021 Joe Biden is scheduled to be inaugurated as President of the United States. On the very next day the World Economic Forum, an organization composed of the richest and most powerful people in the world, will be convening a four day online international...", "image": "https://larouchepac.com/sites/default/files/biden-second-covid-vac-jan22-2021.jpg", "image:url": "https://larouchepac.com/sites/default/files/biden-second-covid-vac-jan22-2021.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/biden-second-covid-vac-jan22-2021.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://action.larouchepac.com/?recruiter_1d=139893"], "authors": [], "publish_date": null}