{"result_id": "183045", "URL": "https://www.larouchepac.com/the_message_from_tuesday_s_vote_there_is_a_limit_to_a_tyrant_s_power_but_can_we_re_americanize_the_economy_soon_enough", "timestamp": "2023-04-25 16:11:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/the_message_from_tuesday_s_vote_there_is_a_limit_to_a_tyrant_s_power_but_can_we_re_americanize_the_economy_soon_enough", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "The Message From Tuesday’s Vote: There Is a Limit to a Tyrant’s Power, But Can We Re-Americanize the Economy Soon Enough?", "cleaned_text": "It was a joyous day Wednesday throughout the nation, like morning in America again. The people spoke. They said, “Let’s Go Brandon” in a thousand ways with their votes, telling Washington, D.C. and the White House, on everything from woke culture, to mask and vaccine mandates, to critical race theory, to Silicon Valley censorship, to our open borders, to the price of groceries and gas: Enough!\n\nNow, however, we need to use this wonderful moment to start the march to total victory and we need your help and engagement to do that.\n\nThe radical left was defeated in municipal elections in Seattle, of all places. Defunding the police went down to defeat in Minneapolis.\n\n\n\nIn blue New York and New Jersey, Republicans and independents won down-ballot races in traditional Democratic areas. In New Jersey, the Democrat governor barely escaped defeat by a whisker. A trucker in New Jersey, Ed Durr, spent $153 and defeated one of the most powerful politicians in New Jersey, the State Senate President, Steve Sweeney. That is not to mention the tremendous Republican clean sweep led by the Glenn Youngkin for Governor campaign in Virginia, where Joe Biden won by ten points in 2020. That sweep also elected Virginia’s first black female lieutenant governor, the former Marine, Winsome Sears. It also captured the Hispanic vote, upped the black vote for Republicans, and won large sections of the Asian vote, while Barack Obama and Joe Biden campaigned in the state solely on racial division and incitement of hatred of Donald Trump. \n\n\n\nBut here is the rub. In survey after survey, the people say they are responding to the economic peril which has now become obvious. As a result of decades of the looting, outsourcing and debasing of the nation’s physical assets and the power of its labor force, our economy is collapsing physically, while its financial side, fed by the quantitative easing of the equivalence of funny money, has ballooned.\n\n\n\nNow, the losers of this election, the globalist Democrats, fresh from Glasgow, Scotland’s Climate Change séance, are pushing measures which will make the economy irreversibly worse—downgrading our energy grid to useless windmills and solar panels. The Republicans (with their RINO faction still in the grip of Wall Street and the City of London who hate Donald Trump’s America First re-industrialization idea) have no economic ideas which will not also make this crisis irreversibly worse. \n\n\n\nHistory is made in precious moments like this, when the majority of the population is wide awake and rising. It is so very clear that now is the time when the Washington swamp can be finally defeated. \n\n\n\nBut that can only happen if we focus on building our way out of this economic crisis—not like Biden’s Malthusian pea brains propose, but the American ways which Lyndon LaRouche, Abe Lincoln, and Alexander Hamilton championed. We need to jump up to a modern infrastructure platform using the most advanced energy sources—nuclear and thermonuclear fusion power—and completely reindustrialize this country, making everything we need. \n\n \n\nNow we need the new discoveries which come from space exploration and advanced frontier science. LaRouchePAC is all in on this, but we need the funds to now push LaRouche’s economic agenda and our educational program about it. Let us not allow the enemy to regroup.\n\nHelp us push this forward, make a donation today", "opengraph": {"title": "The Message From Tuesday’s Vote: There Is a Limit to a Tyrant’s Power, But Can We Re-Americanize the Economy Soon Enough?", "url": "https://www.larouchepac.com/the_message_from_tuesday_s_vote_there_is_a_limit_to_a_tyrant_s_power_but_can_we_re_americanize_the_economy_soon_enough", "description": "It was a joyous day Wednesday throughout the nation, like morning in America again. The people spoke. They said, “Let’s Go Brandon” in a thousand ways with their votes, telling Washington,\r\nD.C. and the White House, on everything from woke culture, to mask and vaccine mandates, to critical race theory, to Silicon Valley censorship, to our open borders, to the price of groceries\r\nand gas: Enough! ", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/6108/meta_images/original/youngkin-rally.png?1636067617", "site_name": "LaRouchePAC"}, "tags": ["4.Campaign-Defend-Trump", "1.Written-Update", "3.Category-USA"], "tweets": [], "movies": [], "links": ["https://donations-larouchepac.nationbuilder.com/", "https://donations-larouchepac.nationbuilder.com/"], "authors": [], "publish_date": null}