{"result_id": "183020", "URL": "https://www.larouchepac.com/the_twitter_files_some_sunlight_on_the_american_panopticon", "timestamp": "2023-04-25 16:10:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/the_twitter_files_some_sunlight_on_the_american_panopticon", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "The Twitter Files: Some Sunlight on the American Panopticon", "cleaned_text": "Click here for a .pdf of this article.\n\nJeremey Bentham, the “philosopher” and agent of the British Empire’s evil Lord Shelburne in subversion against the young United States, defender of usury, free trade, and pederasty, designed a prison, which he saw as his proudest accomplishment. He called it the “Panopticon,” and intended for it to replace machine power—like that of the steam engine—with prison labor.\n\nIts key feature was a design which allowed all prisoners in an institution to be observed by a single guard without the inmates being able to tell whether they were being watched or to communicate with one another. According to Bentham, because the inmates know they are being watched but cannot tell when they are being watched, they will assume they are being watched all the time and “behave.” They are compelled by seemingly omnipresent surveillance to regulate their own behavior. In the prison, criminals, the indigent, the retarded, and their children were engaged in slave labor. They were placed in jail cells equipped with primitive machinery run by a central power source, which in turn was fueled by the swings, merry-go-rounds, and see-saws in the children’s cellblock. A sign above the main door read, “Had they been industrious when free, they need not have dredged here like slaves.”\n\nOn Friday evening, Elon Musk, partially fulfilled a promise he made when he purchased Twitter, one of the crown jewels of the modern American Panopticon, its omnipresent surveillance state. He provided access to Twitter’s internal documents regarding the censorship of the ’s explosive October 2, 2020 story about the Biden family foreign influence peddling scheme, a story of corruption involving Ukraine, China, and Russia which netted the family of the current President millions of criminally illicit dollars.\n\nThe Post story was based on Hunter Biden’s abandoned laptop where the evidence of the corrupt family scheme was laid out in Hunter’s hand in detail. In mafia-like fashion, Joe Biden was referred to as “the Big Guy” in all the schemes and deals. Polling done by the conservative Media Research Center following the 2020 election found that one of six Biden voters would have changed their vote had they known more about the Biden family scandal or Trump’s accomplishments which the media refused to cover. Dr. Robert Epstein has repeatedly proved that Google’s manipulation of its algorithms to favor Democrats determines close elections.\n\nEverything possible was done by the intelligence community and the Democratic Party to suppress the Biden corruption story beginning months before the ’s publication. Senators Ron Johnson and Chuck Grassley were focused on the Biden family scandal as of July even absent the “laptop from hell.” As the Senators have detailed, Democrats in the Senate became deeply concerned about what the two Senators had, and called in friends at the FBI to intimidate them and discredit their investigation. According to journalist Andy McCarthy, Tim Thibault of the Washington FBI field office and Brian Auten were two of the agents involved, both of whom were up to their necks in the coup against the 45th President then and subsequently. Auten prepared an FBI assessment characterizing the Senators’ investigation as “disinformation.”\n\nWhen the owner of the computer store where Hunter Biden left his laptop, John Paul Mac Isaac, notified the FBI that Hunter Biden’s abandoned laptop contained probable national security threats and massive illegalities, the FBI took the laptop and thought they had locked it away into oblivion. They had it for a year before the published its story. But the computer store’s owner, John Paul Mac Isaac, gave copies of the laptop’s contents to Robert Costello, Rudy Giuliani’s attorney, who shared it with the . Everyone with access to the copy of the laptop provided by Isaac to Costello, including Giuliani, Costello, the ’s reporter, Miranda Devine, and Steve Bannon were placed under FBI surveillance and tracked as they authenticated the laptop and discussed its contents.\n\nThe FBI then began frantically briefing Google, Apple, FaceBook, and Twitter to be on the lookout for a possible drop of Russian “hack and leak” disinformation ahead of November’s election which would require immediate and drastic censorship. In testimony in a lawsuit brought by state attorneys general against the Biden Administration, FBI Supervisory Special Agent Elvis Chan testified that he organized weekly meetings with Twitter and FaceBook in San Francisco for as many as seven Washington based FBI agents to brief Twitter and FaceBook executives. According to Miranda Devine’s continuing explosive reporting for the Post, Twitter’s then head of Site Integrity, Yoel Roth, has sworn in a declaration that the briefings specifically included reference to hack and leak operations by state actors involving Hunter Biden. Twitter had implemented a new censorship policy regarding hacked materials in October of 2020.\n\nOnce the published the story, the CIA promulgated the lie that the laptop was a classic Russian disinformation operation, repeating the Russiagate lies used to defame Donald Trump throughout his entire presidency. They farmed the lie out to 51 “former high intelligence officials” (all of whom were participants in the coup against the 45th president) for purposes of making the CIA’s Russian hacking or disinformation claim public. The traitorous lie of the 51 was picked up and promoted everywhere by the mainstream media. John Ratcliffe, Director of National Intelligence under Trump and even Attorney General Bill Barr, said that the ’s story was not Russian disinformation of any sort, but to no avail. Their statements were barely covered.\n\nAs a result, Joe Biden was rescued from dealing with the story in his debate with Trump, by referencing the statements of the 51 high intelligence officials, “including four former heads of the CIA.” John Paul Mac Isaac was defamed as a purveyor of Russian hacked materials and his business was destroyed. FaceBook followed Twitter in censoring the story. Anyone attempting to promote it was attacked and smeared. Famed journalist Glenn Greenwald attempted to cover the story at the outlet he founded, the , and was censored by his own organization, leading to his resignation. Greenwald rightly described the censorship of the story as the biggest media scandal to occur in the United States in memory.\n\nJournalists Matt Taibbi and Bari Weiss were given access to documents concerning Twitter’s censorship actions by Musk and Taibbi published the first batch on his Twitter account Friday evening. You can read them here. In a two-hour marathon Twitter Spaces forum session on Saturday, Musk promised there was more coming, and noted that his assassination was a real possibility given the stakes. Exactly because of its significance for the American surveillance state, this reflection is hardly hyperbole. He described Twitter’s censorship action as election interference undertaken on behalf of the government.\n\nThe White House last week and Treasury Secretary Janet Yellen reflected the complete freakout emanating from America’s modern Panopticon. They declared that they are “watching Musk” while covertly seeking to totally destroy his various business interests, starting with stampeding Twitter into bankruptcy. Musk’s free speech fanaticism is poison to them. Under their regime, the prisoners are not allowed to talk to one another, let alone express and develop their thoughts. Any dissidents from the regime are supposed to be isolated and alienated from any social process other than the ones they are sucked into on the internet. Musk has captured one of the most significant watch towers and is in position to chronicle all of the guards’ misdeeds. As the intelligence community would state it, he is “a clear and present danger.”\n\nThe key headline from Twitter Files I is that the executive suite of the company, absent former CEO Jack Dorsey and led by Twitter’s chief censors, legal counsel Vijaya Gadde and former FBI General Counsel James Baker, knew they had no factual basis to censor the story and lock the ’s account for a month, but did it anyway. They used the most drastic tools to do so, censoring anyone anywhere who even attempted to tweet about the ’s story, a regime normally reserved for child pornography.\n\nBaker, who became General Counsel to the FBI because of his close personal relationship to James Comey, has been implicated in every aspect of the Clinton Campaign/Obama intelligence community coup against Trump. He joined Twitter’s legal team after he was forced to resign from the FBI. He remains adamant that every action taken against the sitting President and those around him was justified. Special Agent Chan describes Baker as a personal friend, and, according to Miranda Devine, Chan remains in contact with Andrew McCabe’s notorious and disgraced counsel, Lisa Page. Twitter Files I show that Twitter regularly deleted and censored tweets and accounts based on requests from the Biden Campaign. Aside from Ro Khanna, who, to his credit, questioned the action against the , Democrats in Washington totally supported Twitter’s action and demanded even more censorship, according to the documents.\n\nLaRouchePAC needs your financial support. Donate today and help grow our operations.\n\nSilicon Valley and Big Tech are, and always have been, a key element of the surveillance state which arose like a modern Panopticon over the United States in the wake of 9/11. The relationship between the Valley and the intelligence community, which has become an unaccountable Fourth Branch of government, is incestuous. The NSA/CIA, etc. are completely dependent upon the Valley for their surveillance tools. The Valley itself was born of major and covert intelligence agency and Pentagon funding. Yasha Levine amply documents this in his book, Surveillance Valley, The Secret Military History of the Internet . Since Donald Trump’s election, this unaccountable intelligence community, a Fourth Branch of government, which believes that it, not the people, should determine the fate of the Republic, undertook a coup to subvert his presidency and ensure that no such election ever occurred again.\n\nJust look at Google’s Eric Schmidt as an example of how the incestuous relationships between Big Tech and the Pentagon and the intelligence community work. Schmidt, a globalist completely dedicated to the Great Reset, the Green New Deal, and the globalist Davos creed, transformed Google in the wake of the Dot-Com collapse into a surveillance behemoth gathering and selling its users’ personal information for profit. He campaigned relentlessly for Barack Obama and became a key administration insider as Obama and Eric Holder worked to perfect the internet and social media into an intelligence weapon. Edward Snowden’s revelations that the NSA and Big Tech had been spying on Americans were simply a bump in the road. James Clapper, the Director of National Intelligence escaped any consequence for outrageously lying to Congress about the very programs Snowden revealed. To enforce their intention in creating a complete surveillance and censorship regime, the Obama Administration opened unprecedented prosecutions and investigations of journalists to keep them in line.\n\nEric Schmidt, while heading Google, served on Obama’s Council of Advisors on Science and Technology and in 2016 became chairman of the Pentagon’s Defense Innovation Advisory Board, serving there until 2020 when he was succeeded by an equally disgusting servant of the international oligarchy, Michael Bloomberg. From 2019 to 2021, Schmidt served on the National Security Commission on Artificial Intelligence with the Pentagon’s Robert O. Work.\n\nAll of these Pentagon positions are meant to integrate artificial intelligence and robots into military tactics, echoing the World Economic Forum’s utopian Fourth Industrial Revolution in which humans and machines are fully integrated. Like all such schemes, it will fail on the battlefield and did fail in Iraq, Afghanistan, Libya, and Syria, because humans are neither beasts or machines—they have a God-given mind and a capacity for creativity and change which neither AI and its machines and robots can neither fully anticipate nor replicate.\n\nBarack Obama’s first term featured Cass Sunstein as his key contact with the Valley. Sunstein famously advocated government infiltration of internet chat rooms to sow “cognitive dissonance” in those deemed potential enemies of the regime, whether domestic or foreign. That policy was implemented. The Obama Administration also partnered with Twitter and FaceBook for intelligence operations, for the color revolutions of the Arab Spring, and, it is suspected, the 2014 coup in Ukraine. They also utilized these tools domestically in their campaign to neutralize the Tea Party movement.\n\nBut prior to Donald Trump, overt censorship on Twitter and FaceBook were not the norm. The object was surveillance and the use of surveillance to target domestic enemies and gather evidence against them. In that metric, driving potential targets underground is counterproductive. One of the untold stories of the 2016 campaign involves FaceBook, which as part of its public relations effort, offered to embed its techs in both the Trump and the Clinton campaigns. Hillary Clinton, confident that her circle of techs from the Valley knew everything there was to know about social networking, declined the offer. Trump’s campaign took it up and used it brilliantly to target and mobilize previously unidentified voters. In addition, Trump used Twitter as a major communications device, allowing him to break the wall of solid opposition and hysteria from the woke mainstream media and reach the population.\n\nWhen Trump won, Congress working in lockstep with the Fourth Branch of government and its British partners, turned on FaceBook and Twitter, threatening them in numerous Congressional hearings that unless they adopted policies which would never allow for another Trump, their businesses would become toast. At the same time, an entire public/private industry emerged, composed of the intelligence community and establishment-funded think tanks, to police so-called “disinformation” on the internet and to ban it entirely or shadow ban it, decreasing its distribution. Teams of “private” trolls were paid to wander through tweets and FaceBook posts, outing politically incorrect opinions and positions. If Twitter or FaceBook didn’t respond, “appropriately,” the mainstream media and Congressional Democrats would pounce. By the 2019-2020 election cycle, the censorship regime at both companies was firmly in place. Conservatives and Trump supporters were routinely censored and deplatformed. When COVID hit, the social media platforms uniformly acted to prevent any dissenting views concerning the lockdowns, mandates, and vaccines from reaching the public.\n\nLaRouchePAC needs your financial support. Donate today and help grow our operations.", "opengraph": {"title": "The Twitter Files: Some Sunlight on the American Panopticon", "url": "https://www.larouchepac.com/the_twitter_files_some_sunlight_on_the_american_panopticon", "description": "Jeremey Bentham, the “philosopher” and agent of the British Empire’s evil Lord Shelburne in subversion against the young United States, defender of usury, free trade, and pederasty, designed a prison, which he saw as his proudest accomplishment. He called it the “Panopticon,” and intended for it to replace machine power—like that of the steam engine—with prison labor.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/7809/meta_images/original/Interieur_Koepelgevangenis_Arnhem_2.jpg?1670252146", "site_name": "LaRouchePAC"}, "tags": ["3.Category-Geopolitics", "1.Written-Article", "cta-5", "3.Category-USA"], "tweets": [], "movies": [], "links": ["https://assets.nationbuilder.com/larouchepac/pages/7809/attachments/original/1670693931/The_Twitter_Files__Sunlight_on_Panopticon.pdf?1670693931", "https://www.timesfreepress.com/news/2020/nov/26/cooper-biden-voters/", "https://nypost.com/2022/12/04/how-the-fbis-nod-wink-got-social-media-to-censor-the-posts-hunter-biden-reporting/", "https://nypost.com/2022/12/04/fbi-warned-twitter-of-hunter-biden-hack-before-censoring-the-post/", "https://twitter.com/mtaibbi/status/1598830911776251906", "https://donations-larouchepac.nationbuilder.com/?recruiter_id=139893", "https://donations-larouchepac.nationbuilder.com/?recruiter_id=139893"], "authors": [], "publish_date": null}