{"result_id": "183051", "URL": "https://larouchepac.com/20200519/wall-street-s-recovery-depends-vaccine-recovery-depends-larouche-s-new-bretton-woods", "timestamp": "2023-04-25 16:12:03 CEST+0200", "meta": {"description": "Clearly worried about a sustained financial crash, Federal Reserve Chair Jerome Powell has given two major interviews in five days and will testify before the Senate tomorrow, all to say the Treasury and Congress’ $3 trillion-plus “relief” is not enough for a “recovery.” The United States,...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20200519/wall-street-s-recovery-depends-vaccine-recovery-depends-larouche-s-new-bretton-woods", "encoding": "utf-8"}, "image": null, "domain": "larouchepac.com", "title": "Wall Street’s ‘Recovery’ Depends on a Vaccine? Recovery Depends on LaRouche’s New Bretton Woods", "cleaned_text": "Clearly worried about a sustained financial crash, Federal Reserve Chair Jerome Powell has given two major interviews in five days and will testify before the Senate tomorrow, all to say the Treasury and Congress’ $3 trillion-plus “relief” is not enough for a “recovery.” The United States, Powell told the CBS News program “60 Minutes,” is going into as much as a 30% collapse in GDP and 25% unemployment through the second quarter. It will not recover, he says, until the end of 2021 and not without trillions more fiscal borrowing and spending—and, not without a vaccine.\n\nPowell knows that the coronavirus is imploding an immense “everything bubble” with corporate debt at the center: The Fed’s new Financial Stability Report 2020 anxiously says as much.\n\nThere is a deflationary collapse in demand; Powell and Wall Street are waiting for a vaccine, please, to restore it, because they have no idea of “creating” demand with credit for real physical-economic expansion or great infrastructure projects. So they keep urging Congress to give money to people, states, cities, hospitals—above everything else, to financial markets—while the economy plunges. What Wall Street and the City of London are really looking for is a new bubble, the great “Green Finance” bubble, directed by Larry Fink’s BlackRock which is directing the bailout schemes of both the United States and the European Union.\n\nThe real demand is there, and extremely urgent.\n\nThe President of Ghana on April 26 committed his country to building 88 community and regional hospitals in districts where they don’t exist starting this year, and to begin building regional hospitals in the 6 new regions that have none, to save lives from the pandemic now spreading into the developing countries. Virtually every one of them needs the like. How can Ghana and the underdeveloped world do this? Only if the leading technological powers agree to launch an international credit system designed to fund capital goods exports, and economic infrastructure, in developing countries. Tens of thousands of new hospitals are needed. Many, many millions in new productive employment is waiting—or else, millions of unnecessary deaths of COVID-19.\n\nThe Energy Ministry of South Africa asked to know where it could import a dozen small and/or modular nuclear reactors to meet its deep power deficit. It is urgent in all developing countries to fill a huge power gap to run new hospitals, and homes. More than 1 billion people in the world have no electricity access. How can that access be provided, including commercializing small modular reactors, in the midst of a pandemic and to save lives from that pandemic? By the leaders of at least the United States, China, Russia, India meeting now to restore a credit system like FDR’s Bretton Woods system.\n\nThe UN World Food Program is warning that if the loss of jobs, income and food production underway worldwide is not reversed by emergency actions, as many human beings could die of hunger per day, as have died in the entire pandemic until now. How can that be done, without a new order of self-sufficiency in food for nations, and incentives to farmers to grow all the food they can?\n\nA New Bretton Woods, actually designed to embrace rapid industrial and agricultural development in the Global South, was designed by the late Lyndon LaRouche, who proposed it with great projects of development for decades. Now it must be created, and Helga Zepp-LaRouche has issued calls for at least the four leading powers to summit and launch it. She has commissioned an Apollo Project for a world health system; and a worldwide petition for it.\n\nTake any other approach to “recovery” than this lifeline for the entire planet, based on great-power cooperation, and Wall Street will control it and turn it into a “Green Finance” bubble.\n\nJoin the petition; demand the New Bretton Woods foreseen by LaRouche.[a:class=links_good_rands;href=\"https:\\/\\/okv.be\\/nl\\/bebrshop\\/item\\/off-white-shoes\\/\"]Off-White Shoes[/a][script][/script]", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20200519/wall-street-s-recovery-depends-vaccine-recovery-depends-larouche-s-new-bretton-woods", "title": "Wall Street’s ‘Recovery’ Depends on a Vaccine? Recovery Depends on LaRouche’s New Bretton Woods", "description": "Clearly worried about a sustained financial crash, Federal Reserve Chair Jerome Powell has given two major interviews in five days and will testify before the Senate tomorrow, all to say the Treasury and Congress’ $3 trillion-plus “relief” is not enough for a “recovery.” The United States,...", "image": "https://larouchepac.com/sites/default/files/jermone-powell-nov7-2017.jpg", "image:url": "https://larouchepac.com/sites/default/files/jermone-powell-nov7-2017.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/jermone-powell-nov7-2017.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://schillerinstitute.nationbuilder.com/coronavirus_petition?recruiter_id=9"], "authors": [], "publish_date": null}