{"result_id": "183021", "URL": "https://www.larouchepac.com/20150428/tpp-will-be-death-republic", "timestamp": "2023-04-25 16:10:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20150428/tpp-will-be-death-republic", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "TPP Will Be the \"Death of the Republic\"", "cleaned_text": "The resistance to the supranational straitjacket masquerading as the Trans-Pacific Partnership trade deal (TPP) continues to galvanize Democrats, especially in the wake of Obama's callous, imperial dismissal that Sen. Elizabeth Warren and others were being \"dishonest\" in their criticisms. In fact, Arizona Democrat Raul Grijalva took the fight directly to Obama (and implicitly Hillary Clinton) telling Roll Call magazine this morning, that, \"if the vast majority of Democrats in the House are willing to confront their President, it only makes sense that any candidate for that position is on the line.\"\n\nA lot of latitude has been handed to Clinton, about her equivocating statement that she is \"closely watching\" the TPP. Yesterday, Politico put the lie to those statements, running comments by White House Deputy Press Secretary Eric Shultz at a press conference April 22, telling reporters that, as far as they know, Hillary Clinton is foursquare behind them and fully supportive of the TPP. \"I haven't seen anything to suggest any distance,\" is the way Schultz put it, and, when asked if the White House considers Clinton an ally on trade, Schultz said \"yes.\"\n\nFor their part, Senators Warren and Sherrod Brown are not backing down. On April 25, they wrote a powerful letter to Obama, urging him to make the text of the TPP available to the public. \"Your Administration has deemed the draft text of the agreement classified and kept it hidden from public view,\" they say, \"thereby making it a secret deal. It is currently illegal for the press, experts, advocates, or the general public to review the text of this agreement. And while you noted that Members of Congress may walk over ... and read the text of the agreement — as we have done — you neglected to mention that we are prohibited by law from discussing the specifics of that text in public.\"\n\nThey make the case that, in 2001, even George Bush made \"portions\" of the Free Trade Area of the Americas (FTAA) deal public \"several months\" before the Congressional vote on fast track. At the time, U.S. Trade Representative Robert Zoellick noted that the release would \"make international and its economic and social benefits more understandable to the public and would increase public awareness of and support\" for the deal. \"We respectfully suggest,\" they say, \"that characterizing the assessments of labor unions, journalists, Members of Congress, and others who disagree with your approach to transparency on trade issues as 'dishonest' is both untrue and unlikely to serve the best interests of the American people.\"\n\nGlass-Steagall promoter Ellen Brown wrote a piece over the April 25-26 weekend, in which she took aim at the supranational Investor-State Dispute Settlement (ISDS) courts. After quoting revelations made by Yves Smith and others, Brown concludes that, \"something else besides attracting investment money and encouraging foreign trade seems to be going on. The TPP would destroy our republican form of government under the rule of law, by elevating the rights of investors — also called the rights of 'capital' — above the rights of the citizens. That means that TPP is blatantly unconstitutional.\"\n\nIn Monday's Australian blog MacroBusiness, Joseph Stiglitz and Paul Krugman expose that, after examination of the intellectual property and investment chapters that have been leaked via WikiLeaks, the TPP would establish a U.S.-style regulatory structure that would hand considerable monopoly-style power to U.S. pharmaceutical and digital firms. \"Included in the draft intellectual property chapter was the proposal to extend patent protection and strengthen monopolies on clinical data. It also flagged the extension of patents for new forms of known substances, as well as on new uses on old medicines—an outcome that would lead to evergreening, whereby patents can be renewed continuously.\"\n\nThe question remains as to whether this resistance can be galvanized into the larger question, of removal of Obama for his accumulating crimes, and for his future one, the imminent threat of global thermonuclear war.", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20150428/tpp-will-be-death-republic", "title": "TPP Will Be the \"Death of the Republic\"", "image": "https://larouchepac.com/sites/default/files/", "image:url": "https://larouchepac.com/sites/default/files/", "image:secure_url": "https://larouchepac.com/sites/default/files/"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}