{"result_id": "183046", "URL": "https://www.larouchepac.com/stop_the_murderous_coverup_of_lifesaving_treatment_for_covid_19", "timestamp": "2023-04-25 16:11:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/stop_the_murderous_coverup_of_lifesaving_treatment_for_covid_19", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Stop The Murderous Coverup Of Lifesaving Treatment For Covid-19!", "cleaned_text": "Every day, amidst the “Delta” COVID surge, the media bombard us with terrifying news headlines about overflowing hospitals and ICUs, and about breakthrough cases even among the vaccinated. These narratives filled with fear, pessimism, and shaming are the product of perverse political intent, right now directed at governors, like those of Texas and Florida, who insist that medical decisions are a matter of privacy and choice. They should not be made by states or corporations using emergency conditions to condition the population to permanent rule by decree.\n\nBuried in this is the simple fact that you don’t have to choose between controversial vaccines and controversial therapies offered over the Internet. There are now proven medical therapies which work, provided you don’t sit around with symptoms, take a COVID test and test positive, and are at high-risk.\n\nMonoclonal antibody treatments, the same treatments which resulted in President’s Trump’s apparently miraculous recovery back in October of 2020, are now publicly available. Yet, the availability of this treatment has remained the nation’s best kept secret, thanks to the political machinations of the Washington Swamp and the mainstream media, who wish to use COVID for their own sinister political purposes.\n\nThese monoclonal antibodies, manufactured by Eli Lilly and Regeneron in the US, are artificial proteins that mimic the immune system’s ability to fight off the COVID-19 virus, by attacking and disabling the spike protein. The medication is given by an infusion in an outpatient setting at a hospital or clinic. The infusion typically takes an hour with an observation period afterwards. After the infusion, you go home. Your symptoms will typically resolve within a few days. You will be asked to quarantine for ten days after the first symptoms appeared or 24 hours after the complete resolution of your symptoms.\n\nTO FIND AN INFUSION LOCATION, CLICK HERE: https://protect-public.hhs.gov/pages/therapeutics-distribution\n\nHere are the current High-Risk Criteria:\n\nThe fact is that this outpatient antibody treatment prevents serious COVID-19 illness for those at high risk, those who would otherwise end up in the hospital or die, if the treatment is given when symptoms first appear.\n\nHow many could have been saved if they had been given access to this treatment over the past 7 months, by a serious public health offensive making the treatment available and telling the public about it?\n\nSo, take advantage of this great scientific breakthrough, brought about by the spirit of national scientific mobilization carried out by President Trump. The next time your Big City Mayor, local news outlet, or the current occupant of the White House, begins the daily lecture about the moral turpitude of the unvaccinated and unmasked, that is the time to ask them, how many lives have they sacrificed by covering up the fact of the availability of this life-saving treatment?", "opengraph": {"title": "Stop The Murderous Coverup Of Lifesaving Treatment For Covid-19!", "url": "https://www.larouchepac.com/stop_the_murderous_coverup_of_lifesaving_treatment_for_covid_19", "description": "Every day, amidst the “Delta” COVID surge, the media bombard us with terrifying news headlines about overflowing hospitals and ICUs, and about breakthrough cases even among the vaccinated.  These narratives filled with fear, pessimism, and shaming are the product of perverse political intent, right now directed at governors, like those of Texas and Florida, who insist that medical decisions are a matter of privacy and choice.  They should not be made by states or corporations using emergency conditions to condition the population to permanent rule by decree.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/6049/meta_images/original/50897681958_771be9b674_k_%281%29.jpg?1630514076", "site_name": "LaRouchePAC"}, "tags": ["1.Written-Update", "3.Category-USA"], "tweets": [], "movies": [], "links": ["https://protect-public.hhs.gov/pages/therapeutics-distribution"], "authors": [], "publish_date": null}