{"result_id": "183015", "URL": "https://larouchepac.com/20200411/larouche-s-apollo-mission-defeat-global-pandemic-build-world-health-system-now", "timestamp": "2023-04-25 16:10:20 CEST+0200", "meta": {"description": "Defeating this deadly virus will require immediate, coordinated global action: intensive public health measures, including extensive testing and isolation of those found to be infected; a huge increase in the availability of healthcare facilities and equipment; significant investment and...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20200411/larouche-s-apollo-mission-defeat-global-pandemic-build-world-health-system-now", "encoding": "utf-8"}, "image": null, "domain": "larouchepac.com", "title": "LaRouche’s ‘Apollo Mission’ to Defeat the Global Pandemic: Build a World Health System Now!", "cleaned_text": "At the time this urgent call to build a World Health System was published, the world had confirmed over 1.75 million cases of COVID-19, and the number of deaths attributed to the pandemic was over 100,000. This disease, first active in humans in December or November 2019, has spread, within a matter of months, to nearly all nations of the world, with a ferocious rate of growth in populations not taking strong measures to arrest its advance. The mortality rate among those infected is estimated to be an order of magnitude greater than that of the seasonal flu. At the time you are reading this call to action, the numbers will be greater, possibly much, much greater.\n\nGravest of all, we could be witnessing an explosion of infections and deaths in the so-called less-developed sector or Third World, especially in Africa — whose underdevelopment is the Achilles Heel of the entire human species, which requires special attention, as we specify below.\n\nDefeating this deadly virus will require immediate, coordinated global action: intensive public health measures, including extensive testing and isolation of those found to be infected; a huge increase in the availability of healthcare facilities and equipment; significant investment and resources devoted to finding cures and a vaccine; great strides in sanitation measures, especially in less-developed nations; and an end to the historically unnecessary lack of development — and outright looting — in the world. This global pandemic emphatically requires a global response, as reservoirs of the virus in any part of the world could cause resurgences for years\n\nIt requires a World Health System covering every part of the planet.\n\nSuch a global response requires, most centrally, the coordination of the United States, China, Russia, and India, a Four Powers alliance open to all nations of the planet. The leaders of those four nations should hold a summit as soon as possible to work out common approaches to addressing the enormous health, material, and infrastructural needs of the world, as a first step towards creating an entirely New Paradigm to replace the bankrupt old system.\n\nThere is no other way, no lesser course, that will actually defeat the pandemic.\n\nAlthough COVID-19 is the disaster currently inflicting itself on humanity, it is only one of many to which the world is susceptible, due to a failure of the international order over the past fifty years, most especially the deadly looting of developing sector nations. A solar coronal mass ejection could knock out most of the world’s electricity grids — why have they not been hardened against this, even in the so-called “developed” countries? An as-yet-undiscovered asteroid or comet could destroy an entire continent — why have we developed no defenses against this threat? There are 800 million people on this planet who lack adequate food — why has this been tolerated? A plague of locusts currently menaces the lives and livelihoods of tens of millions. Another disease could spring up any week — why do we not have better defenses against viruses?\n\nThe world community must create a resiliency for successful long-term survival, not just in the short-term while hoping that no unusual events occur, but prepared for true safety and security. This cannot occur under the neo-liberal economic paradigm that is now failing. It cannot occur under a regime of bailout and treating financial values as sacrosanct. That system, with its $1.8 quadrillion speculative bubble, is now thoroughly bankrupt, and must be put through a process of bankruptcy reorganization long specified by the American economist Lyndon H. LaRouche, along with the simultaneous requirement to build a new Hamiltonian credit system, nationally and internationally, to put humanity back on the track of science-driven physical-economic development. The long-term successful survival and flourishing of the human species requires a world system that recognizes the divine spark of potential genius in each individual and which seeks to foster that potential through economic, cultural, and scientific development.\n\nBelow, we take up the task of delineating the needed World Health System. This is a first approximation of the requirements, which we hope will be enriched by input from international experts and concerned people in the immediate weeks ahead.\n\nWe begin by posing, and answering, two questions:\n\n 1. What is the cause of this, possibly the worst crisis humanity has ever faced?\n\n 2. What is the full set of measures that should be taken on all fronts, both in the United States and worldwide, to defeat the pandemic?\n\nWe do not start by listing all the bottlenecks and shortages, and try to work from the bottom up. We start instead by figuring out what is required: We must use this existential crisis to finally overcome the underdevelopment of large sections of mankind, a condition that is not worthy of the human species. Then, we determine the physical economic requirements to achieve each step along the way, including the bills of materials and manpower requirements, as defined from the standpoint of industrial engineering. We then return to the bottlenecks and figure out how we are going to break through them, on schedule or earlier. We will find that, to achieve that trajectory, we will be on a forced march requiring constant technological breakthroughs; we will find that we are in the domain of the science of physical economy, where Lyndon LaRouche’s work is our only guide and road map.\n\nWe will also find that such an approach requires full international cooperation, especially between the United States and China, to achieve these common aims of mankind. Anyone opposing such cooperation should be scientifically classed in the same genus and species, politically, as the coronavirus itself.\n\nThat approach is how Franklin D. Roosevelt mobilized the nation to defeat fascism in World War II. That is how NASA engineers turned the looming Apollo 13 catastrophe into success. And in our current endeavor to defeat the coronavirus across the planet, here too failure is not an option.\n\nThis Is a Crisis Fifty Years in the Making\n\nThe coronavirus was not caused by a Chinese proclivity to feast on bats. Nor was it cooked up in a secret military lab in the United Kingdom or the United States (although Prince Philip’s public promotion of his desire to return as a virus to help reduce the planet’s population, gives pause for thought). It was caused by an underlying physical-economic process that has been underway for at least a half century. In fact, Lyndon LaRouche forecast the current pandemic nearly 50 years ago, first in 1971 in his public warning about the end of the Bretton Woods system; and then repeatedly beginning in 1974 testimony before the U.S. House Judiciary Committee where he warned of the danger of an impending biological holocaust, due to misguided economic policies.\n\nIn a 1985 document titled “The Role of Economic Science in Projecting Pandemics as a Feature of Advanced Stages of Economic Breakdown,” LaRouche explained that the actual cause of pandemics and similar phenomena is when society’s Potential Relative Population Density (PRPD) — the physical-economic power of a society to maintain a rising population at improved standards of living and longevity — drops below the actual population.\n\n“Sustainable economic (and population) growth, is measured as an (ideally) constant rate of increase of the potential relative population-density of that society. This is the measure of the average potential for growth of the society as a whole, and is also the absolute measure of per capita productivity of labor in that society.” LaRouche explained that achieving a rising PRPD requires that the economy produce “free energy” above the “energy of the system,” and he specified:\n\n“In economic processes, the ‘energy of the system’ is represented by the interdependency among three ‘market-baskets’ of consumption. Each of these ‘market-baskets,’ corresponds to a minimum value, required to maintain the economic process at a constant level of negentropic potential. These three are: 1) The ‘market-basket’ of households’ consumption, per capita; 2) The ‘market-basket’ of producers’ goods; 3) The ‘market-basket of ‘basic economic infrastructure: energy production and distribution, water management, transportation, etc.”\n\n“The ‘ideal’ case, at which economies are to be examined for economically-determined eruption of pandemics, is the case for which the potential relative population-density falls below the level of the existing population… [such as] the instance in which the average consumption is determined by a fall of potential relative population-density, below the level of requirements for the existing population.”\n\nBut there is also the case, LaRouche emphasizes, where “the differential rates of distribution of the households’ ‘goods market-basket’ falls below the level of ‘energy of the system’ for a large part of the population. We are most concerned with the effects on health, as the nutritional throughput per capita falls below some relative biological minimum, and also the effect of collapse of sanitation and other relevant aspects of basic economic infrastructure upon the conditions of an undernourished population… [In this case], the undernourished population might become a breeding-culture for eruption of epidemic and pandemic disease,..”\n\nThat is precisely what has occurred during the last 50 years of deadly looting of Third World populations, especially Africa, through the policies of the City of London, Wall Street, and of course the International Monetary Fund.\n\nThe full impact of such policies, LaRouche concluded, can only be understood by locating man’s development (or what Vladimir Vernadsky referred to as the noösphere) within the total biosphere.\n\n“Society is an integral part of the biosphere, both the biosphere as a whole, and regionally… Rather than viewing a deep fall of the potential relative population-density, as merely a fall in the relative value for the society as such; let us examine this as a fall in the relative level of the biosphere including that society… This must tend to be adjusted, by increasing the role of relatively lower forms of life… [which] ‘consume’ human and other higher-level forms of life as ‘fuel’ for their own proliferation… In that variant, human and animal pandemics, and sylvatics, must tend to resurge, and evolve, under certain kinds of ‘shock’ to the biosphere caused by extreme concentration of fall of population-potential.”\n\nThe world as a whole possesses a current inventory of 18.63 million hospital beds. This constitutes a tremendous deficit, rendering country after country incapable of defeating the novel coronavirus. To consider the needed level of beds, consider the United States 1946 Hill–Burton Act, which set a standard of 4.5 hospital beds per 1,000 people, per county, in order to ensure the health and well-being of the population. Current levels are 2.8 for the United States, 0.7 for South Asia, 0.7 for the Heavily Indebted Poor Countries, and 0.5 for Nigeria, which is one-fifth of the population of sub-Saharan Africa.\n\nTo meet the standard of 4.5 beds per 1000 people, the world would have to increase its hospital bed inventory to 35 million beds, nearly double the current level. This would require the construction of 35,200 new modern hospitals, especially in Africa, Ibero-America, and Asia, where the new beds would be immediately put to necessary use.\n\nBeds themselves do not save lives. Medical staff are required, and acute cases demand additional equipment, such as ventilators.\n\nThe total global inventory of ventilators is hard to determine, but there are certain figures that point to the problems of dealing with COVID-19 in impoverished nations lacking health infrastructure. The United States has a total of about 170,000 ventilators for its 330 million people, which is about 5000 ventilators for every million people. Germany has about 25,000 ventilators for its 83 million people, about 3000 ventilators per million — the highest per capita level in Europe.\n\nThe picture in Africa, however, is absolutely devastating. According to Time, there are 500 ventilators for the 200 million people of Nigeria, which comes out to 2.5 ventilators for every million people — about 2000 times less than the United States on a per capita basis. In Sudan, there are 1.9 ventilators for every million people. The Central African Republic (population nearly 5 million) has a total of three ventilators, and Liberia, with a population of 4.7 million people, has none.\n\nEstimates by the Brookings Institution and the Financial Times are that India has approximately 20,000 ventilators, which would be 15 ventilators for every million people.\n\nFor the entire world to be at the United States per capita level of ventilators would require a global inventory of 40 million.\n\nCOVID-19 attacks the body in at least two ways. First, it has effects very much like the flu as it multiplies within the body. Fevers, body aches, headaches, and fatigue are common, as well as a cough, especially a dry cough. The cough is due to a specific characteristic of the virus: its targeting of lung cells and the immune system response it elicits. At the time of writing, it is believed that in many patients reaching the second stage of the disease, ARDS (acute respiratory distress syndrome), the body itself is attacking the lung cells as a “storm” of cytokines trigger an escalating response against the virus and cells infected with it, as well as healthy cells.\n\nThe death rate for those afflicted with the disease ranges from 0.5% to over 5% and depends on the physiology of the individual and the capacity of their local healthcare system. It is also uncertain, due to low testing rates. The percentage of infected persons requiring hospitalization ranges from 10% to 30%.\n\nIt is possible to target the following areas of disease transmission and morbidity: reducing the transmission rate through social distancing, hygiene, masks, and business closures; reducing the infection rate through vaccinations; treating the virus itself with antiviral medications; and preventing the acute respiratory distress syndrome that the virus causes in acute cases. These methods will be discussed in greater detail below.\n\nSub-Saharan Africa is home to 1.1 billion people, 14% of the total population of the planet. Due to their colonial past and present, the nations of the region suffer extreme poverty, lack of electricity, and slum conditions in its urban centers, at anywhere from 2–5 times the average global rate. Sub-Saharan Africa has:\n\n70% of those worldwide lacking access to electricity\n\nData Source: World Bank, which defines a slum* as a housing unit lacking one or more of the following: running water, adequate sanitation, sufficient living area, or durability of housing.\n\nThis is a part of the human race where the potential relative population-density has clearly plunged way below the actual population, courtesy of the genocidal policies of the British Empire and their Wall Street sidekicks.\n\nConsider also the case of Haiti, by far the poorest country in Latin America and the Caribbean, with conditions similar to those of the most immiserated African nations. Haiti has a population of 11.1 million. Health experts have estimated that the COVID-19 pandemic could claim about 800,000 lives in Haiti — over 7% of the population.\n\nNigeria, with about a fifth of Sub-Saharan Africa’s total population, has key poverty and related indicators that are typical for the whole region. The problems that Nigeria faces in combating the coronavirus are emblematic of not only Africa, but the entire Third World.\n\nIn the developing sector in general, including countries like Nigeria, large percentages of their populations live in inhuman squalor. The majority of their workforces are in the “informal economy,” surviving from day to day on street activities that range from the gray to the black economy. In many cases, up to 70–80% of their workforce is part of the informal economy. “Sheltering in place” or locking down without work means literal starvation for very large numbers of people, as well as certain infection with COVID-19 in the slums where they live. Wash your hands repeatedly? This is a cruel joke to the millions and millions of Africans, Asians, Latin Americans and others who do not even have running water.\n\nSo how should the pandemic be addressed in such nations?\n\n1) There must be a totally centralized national approach, in many countries centered on the military, which is often the only institution capable of organizing and carrying out such an approach. In many cases, for good or bad, they are also the only remaining national institution still standing, and with popular credibility.\n\n2) The population, especially in the cities, has to be fully tested and segregated into two broad groups: Group A, who do not have COVID-19; and Group B, those who tested positive, even if they are asymptomatic. The health care and other public officials conscripted to perform the tests must be supplied with advanced testing equipment in sufficient supply, along with adequate PPEs and other protection.\n\n3) “Group B” must be immediately quarantined in separate housing units, whether hotels, converted office buildings, sports and convention centers, or quickly constructed new modular housing units. Those new facilities must have work and recreational facilities in situ, for those well enough to use them, as well as necessary staffing of skilled personnel, including nurses and doctors. Those health professionals will also have to be quarantined, so as to not infect their own families and friends.\n\n4) Sick and very sick patients must be hospitalized. New hospitals have to be built with sufficient beds to handle the patient load, and dedicated exclusively to COVID-19 cases. Adequate staffing by doctors and nurses has to be organized, including by nationally conscripting them.\n\n5) “Group A” must be quickly formed into education and work brigades, both in industry and agriculture, much like FDR’s CCC project in the Great Depression in the United States. They must produce food, housing and clothing sufficient to feed themselves, as well as “Group B.” This will require a return to national food self sufficiency, which in turn will necessitate the importation of the capital inputs for modern agriculture — such as fertilizer, pesticides, tractors and irrigation. The local workforce must also start building the housing, hospitals, and other required infrastructure to get the job done. This will require on-the-job training and large-scale transfer of modern technologies\n\nWhat China is already doing in Africa with the construction of new rail lines and other infrastructure is exemplary. The extension of the World Land-Bridge into Africa is essential, and will benefit enormously from in-depth cooperation between China and the United States in particular, as well as other countries.\n\nBut more must immediately be done by the world community to address the African situation, as we elaborate at the conclusion of this report.", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20200411/larouche-s-apollo-mission-defeat-global-pandemic-build-world-health-system-now", "title": "LaRouche’s ‘Apollo Mission’ to Defeat the Global Pandemic: Build a World Health System Now!", "description": "Defeating this deadly virus will require immediate, coordinated global action: intensive public health measures, including extensive testing and isolation of those found to be infected; a huge increase in the availability of healthcare facilities and equipment; significant investment and...", "image": "https://larouchepac.com/sites/default/files/testing%20in%20nj.jpg", "image:url": "https://larouchepac.com/sites/default/files/testing%20in%20nj.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/testing%20in%20nj.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://larouchepub.com/lar/2020/4712-projecting_pandemics-lar.html", "https://time.com/5816299/coronavirus-africa-ventilators-doctors/", "https://larouchepac.com/20200413/defeating-pandemic-part-ii-public-health-measures"], "authors": [], "publish_date": null}