{"result_id": "183003", "URL": "https://larouchepac.com/20200318/covid-19-pandemic-forces-rethinking-international-cooperation-indispensable", "timestamp": "2023-04-25 16:09:23 CEST+0200", "meta": {"description": "by Helga Zepp-LaRouche, zepp-larouche@eir.de We are now experiencing the worst international health crisis of the past hundred years. This crisis is so extremely dangerous, because the coronavirus pandemic now coincides with the systemic global financial crisis that was already near explosion...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20200318/covid-19-pandemic-forces-rethinking-international-cooperation-indispensable", "encoding": "utf-8"}, "image": null, "domain": "larouchepac.com", "title": "COVID-19 Pandemic Forces Rethinking: International Cooperation Indispensable!", "cleaned_text": "We are now experiencing the worst international health crisis of the past hundred years. This crisis is so extremely dangerous, because the coronavirus pandemic now coincides with the systemic global financial crisis that was already near explosion before the medical crisis broke out. The pandemic was merely the trigger. A solution exists—but only if western societies are prepared to replace all the axioms of the neoliberal model with an economic policy, which is not guided by monetarist considerations, i.e., to speculators’ profits, but guided instead by the absolute value of human life, the principles of science, and solidarity with the entire family of mankind.\n\nEven President Macron of France has recently mentioned what can no longer be overlooked: The liberal democratic political system is ill-suited to react adequately to existential threats. The sooner Europe and the U.S.A. grasp the fact that we must take exactly the same public health measures that China took in January in the city of Wuhan and Hubei Province, the more human lives will be saved. Rather than making use of the time gained for the world by the Chinese government’s decisive actions—correctly characterized by the WHO as absolutely exemplary—the western governments have wasted priceless weeks. As a result, Europe has now become the epicenter of the pandemic and the situation in the United States is quite unclear due to the lack of testing up to this point.\n\nBut the necessary reorganization can’t be limited to the area of human health. We need a completely new paradigm in politics and economics if we are to prevent a collapse of civilization like that of the 14th Century. Many scientists in a number of nations are assuming that about 70% of the population will be infected within the next one to two years, at least until a vaccine can be developed and produced. Prof. Christian Drosten of the Berlin Charité Hospital cites a new study that says we can no longer count on a slower spread of the virus in the Spring and Summer. At the same time, it has to be assumed that the pandemic will spread further throughout the Southern Hemisphere during its Winter, and then come back to the Northern Hemisphere in the Autumn, strengthened and possibly in a mutated form.\n\nThis means that we not only have to correct the consequences of the takedown of our national public health system in the recent decades, and equip it in the shortest possible time to treat the expected number of patients. We also have to create the conditions for a global healthcare system in the short term.\n\nThe current crisis is in no way unexpected. In 1974, Lyndon LaRouche initiated what he called a “biological holocaust taskforce,” tasked to investigate the impact—above all, on the developing nations—of the austerity policy and conditionalities of the International Monetary Fund and World Bank. LaRouche and his colleagues presented the results of these studies in a series of reports that warned that the decline in living standards on several continents, which these institutions would be unleashing over the coming years, would lead to the resurgence of old plagues and the occurrence of new diseases and pandemics.\n\nWhen one considers the conditions in many nations in Africa, Asia, Latin America, and even in the poorer regions of Europe and the United States today, it becomes very clear that only a global change of policy can remedy this. About two billion people currently have no clean drinking water and most so-called developing countries have nothing close to a modern healthcare system. Famine exists at the present time in several southern African countries. A locust plague, against which the international community did not act in a timely way, threatens to lay waste dozens of nations in Africa, Asia and Latin America. As a result of the so-called “wars of humanitarian intervention” and the underdevelopment already referred to, millions of refugees have fled toward Europe and America to escape danger to life and limb.\n\nTherefore, if we want to prevent the coronavirus pandemic from spreading in waves and migrating from the Northern to the Southern Hemisphere and back—thus potentially creating the breeding grounds for additional similar and worse viruses—we must initiate radical changes.\n\nHospitals with isolation wards must be built throughout the world, following the example of the city of Wuhan and Hubei Province, which built a total of 14 temporary hospitals, including the necessary intensive care beds. World Health Organization standards must be observed in doing so. China, for example, built facilities with 16,000 new hospital beds in just one month.\n\nInternational scientific research centers must be established for research on the COVID-19 virus and other viral and bacterial pathogens. Vaccines must be developed and tested. The results of research in biophysics, nuclear biology and space medicine must be made available immediately to all nations. The point of reference for this is the conception of a Strategic Defense of Earth (SDE) developed by Lyndon LaRouche, in which the protection of human life from pandemics is one focal point.\n\nThese worldwide measures require investments that cannot be made under the conditions of the present, collapsing financial system. The current actions of the central banks in injecting liquidity into this financial system by the trillions of dollars, and even the allocation of budget funds by governments, is due to a hyperinflationary monetary explosion, and is unsustainable.\n\nIf we are to fight the coronavirus pandemic successfully, and build and equip the necessary hospitals, we need the total package of actions proposed by Lyndon LaRouche a number of years ago:\n\n1. A system of bank separation must be introduced immediately on a worldwide scale, based exactly on the model of the Glass-Steagall Act signed by President Franklin Roosevelt on June 16, 1933. Commercial banks must be put under Federal protection under this system and completely separated by a firewall from speculative investment banking firms and units, which will no longer have any access to the assets of the commercial banks, nor have the privilege of being saved by taxpayers’ money. The toxic paper of these banks, including their outstanding financial derivatives contracts, must be written off. Legitimate receivables that are connected with the real economy or with pensions and other assets of working people should be classified as valid in the new system as well. Some types of claims for payment must be provisionally frozen and reviewed for validity by Federal institutions.\n\n2. A national bank must be founded in each country, in the tradition of Alexander Hamilton or on the model of the German Kreditanstalt für Wiederaufbau (Reconstruction Finance Corporation) after World War II. Their purpose is to supply Federal credit for productive investments that will provide the physical economy with the necessary funds. The issuance of these credits must be guided by the principles of high energy-flux density and an optimal increase of the productivity of productive capacities and the powers of labor, through an emphasis on scientific and technological progress.\n\n3. Among the participating countries, a system of fixed parities must be established, and cooperation treaties must be established among sovereign states for the purpose of well-defined infrastructure and development projects. These treaties together represent in fact a New Bretton Woods system as it was intended by Roosevelt, with the explicit intention of providing credit for the industrial development of the developing sector.\n\n4. An urgent increase in the productivity of the world economy—to accommodate a world population of presently almost eight billion people —must be facilitated through an international crash program for the realization of thermonuclear fusion power and other advanced technologies, in such fields as optical biophysics and life sciences, in order to find solutions for challenges such as the coronavirus. This increase in productivity must also be enabled through international cooperation in space technology and travel, which can establish the necessary next higher economic platform for the world economy, as this concept has been developed by the economist Lyndon LaRouche.\n\nThe only institutions which can carry out such a worldwide program are the leading governments of the planet, which must be representative of the entire world’s population in their composition. Therefore it is in no way sufficient that the governments of the G7 should agree among themselves; these solutions can be implemented only with the involvement of Russia, China and India.\n\nThat also means that geopolitics must finally be overcome and replaced by the idea of the common future and goals of mankind. If we do not want to fall into a new dark age, we have to replace neo-Malthusian ideas, the anti-scientific “Green New Deal,” monetarism and Eurocentrism with the ideas of physical economy, guided exclusively by the scientifically provable principles of the laws of the universe.\n\nAnd finally, perhaps the most important change which we must make in our thinking: We need a new humanist Renaissance, a renaissance of classical culture. For the world has been brought to this point not least by the unbounded hedonism which went along with liberal and neoliberal democracy. The moment has arrived when the ideology of “anything goes” must be put aside. We will overcome this crisis only if we are inner-directed in accord with the love of humanity. But it is for that, after all, that we are human beings!", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20200318/covid-19-pandemic-forces-rethinking-international-cooperation-indispensable", "title": "COVID-19 Pandemic Forces Rethinking: International Cooperation Indispensable!", "description": "by Helga Zepp-LaRouche, zepp-larouche@eir.de We are now experiencing the worst international health crisis of the past hundred years. This crisis is so extremely dangerous, because the coronavirus pandemic now coincides with the systemic global financial crisis that was already near explosion...", "image": "https://larouchepac.com/sites/default/files/ausdyf-710x399.jpg", "image:url": "https://larouchepac.com/sites/default/files/ausdyf-710x399.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/ausdyf-710x399.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["/cdn-cgi/l/email-protection", "https://action.larouchepac.com/four_laws_global?recruiter_id=139893"], "authors": [], "publish_date": null}