{"result_id": "183004", "URL": "https://larouchepac.com/20141031/ebola-pandemic-bertrand-russells-black-death-0", "timestamp": "2023-04-25 16:09:24 CEST+0200", "meta": {"description": "Today, as the Ebola pandemic ravages West Africa, the horrible fantasies of the British imperial genocidalists are fast becoming a reality and it is a reality that could have been avoided. In the early 1970s, American statesman and economist Lyndon LaRouche warned that the economic policies imposed on Africa and the developing sector threatened to create a lush environment for", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20141031/ebola-pandemic-bertrand-russells-black-death-0", "encoding": "utf-8"}, "image": null, "domain": "larouchepac.com", "title": "Ebola Pandemic: Bertrand Russell's Black Death?", "cleaned_text": "Now, with Ebola cases turning up in a totally unprepared United States and Western Europe, the horrible reality is unavoidably asserting itself: there is no place on earth which is protected from the spread of this deadly virus, or one like it. During Barack Obama’s time in office, health care capabilities have been taken down, public health measures slashed, research budgets decimated, and living standards sharply reduced. Add to that the policy of continuous warfare, and it is inescapable: we are well on the way to suffering a new Black Death. In truth, due to globalization, this new Black Death is likely to be worse than what Europe experienced in the 14th century.\n\nHow has the Obama Administration responded? with a body of lies that leaves the population of the United States totally vulnerable.\n\nJust look at the most egregious lies spewed by Obama and prostitutes like Anthony Fauci, Director of the National Institute of Allergy and Infectious Disease. First, Fauci asserted that while EVD (Ebola Virus Disease) was a terrible tragedy for West Africa, that nobody who received treatment in the U.S. was likely to die from the disease. Just a day later, Thomas Duncan did die. Obama and Fauci said they weren't worried; that Ebola wasn't very contagious and that U.S. hospitals were more than prepared.\n\nBut then it was revealed that when Thomas Duncan first arrived at Texas Presbyterians emergency room with all the symptoms of Ebola, including informing personnel there that he had just come from Liberia, he was sent home! It was only days later when he returned to the hospital near death, that he was admitted.\n\nYou were told that it was just terrible. But he didn't become infected here. That this isn't Africa after all. That we were capable of containing any discreet cases that might turn up. Dr. Fauci, who does know better, repeated that it was very hard to get Ebola. President Obama went to play golf.\n\nPart of the assurance was that the virus wasn't “airborne.” All that means is the virus doesn't exist freely in the air. What it is is a waterborne virus that is present in high concentration in all body fluids, including saliva and sputum. Translation? Yes, it can indeed be spread by sneezing or any other exposure to the aerosol spray of an infected person.\n\nDidn’t you wonder why, if Ebola is so hard to spread, why thousands and thousands of new cases turn up in West Africa every week? Didn’t you wonder why, when infected American health care workers were brought back to the U.S. from West Africa it was done in specially equipped aircraft by personnel wearing full biocontainment suits?\n\nNow, two of the medical personnel who cared for Mr. Duncan are sick with Ebola. But you were told that U.S. hospitals had a protocol and isolation wards that would prevent that. And you were told that those who treated Mr. Duncan were being monitored. Today you learn that there are only four level 4 hospitals in the U.S. that are truly capable of dealing with Ebola. And as for monitoring, the second nurse who took ill obviously wasn’t monitored very closely. After Duncan died, she flew on a commercial plane to visit friends and family in Cleveland, took ill there, and flew back to Texas on a commercial plane.\n\nMore can be said, but the bottom line is that this is intentional criminal malfeasance. On the part of health care professionals like Dr. Fauci, it is because he is a prostitute. In the case of Obama, it is because he is and always has been, a tool of the same British imperial forces who fantasize about reducing the world’s population.", "opengraph": {"title": "Ebola Pandemic: Bertrand Russell's Black Death?", "description": "Today, as the Ebola pandemic ravages West Africa, the horrible fantasies of the British imperial genocidalists are fast becoming a reality and it is a reality that could have been avoided. In the early 1970s, American statesman and economist Lyndon LaRouche warned that the economic policies imposed on Africa and the developing sector threatened to create a lush environment for the creation of pandemics that would not only devastate Africa, but would spread throughout the world."}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}