{"result_id": "183032", "URL": "https://larouchepac.com/20200206/china-deserves-praise-and-cooperation-fight-against-coronavirus", "timestamp": "2023-04-25 16:11:08 CEST+0200", "meta": {"description": "By Helga Zepp-LaRouche The name of the German weekly magazine “Der Spiegel” actually means in English, “The Mirror.” And indeed what you see this week on the cover page of the print version of Der Spiegel—a person with a gas mask, goggles, earphones and a hoody⁠—is the mirror image of...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20200206/china-deserves-praise-and-cooperation-fight-against-coronavirus", "encoding": "utf-8"}, "image": null, "domain": "larouchepac.com", "title": "China Deserves Praise and Cooperation in the Fight against the Coronavirus", "cleaned_text": "By Helga Zepp-LaRouche, founder of the Schiller Institute\n\nThe name of the German weekly magazine “Der Spiegel” actually means in English, “The Mirror.” And indeed what you see this week on the cover page of the print version of Der Spiegel—a person with a gas mask, goggles, earphones and a hoody⁠—is the mirror image of the ugly face of the racism of its editors. The caption “Corona-virus Made in China” should actually be “The ugly face of the racist monster Spiegel.”\n\nThis piece of yellow trash journalism was so bad that the Chinese embassy in Germany issued a formal complaint on their website. The notorious Jylllands-Posten of Denmark had an equally disgusting so-called cartoon putting the corona virus on the Chinese flag. Various American so-called mainstream media use the abdominal racist term “The Yellow Peril.” What all of these portrayals demonstrate is the ugly reality of an obviously deep-seated racism under a very thin varnish of “western values.”\n\nThe reality of the matter is, that the Director General of the WHO, Dr. Tedros Adhanom Ghebreyesus, has praised China repeatedly for the excellent handling of the epidemic, noting that China has set a new standard of dealing with such problems. That the Chinese government had published a full genome-mapping of the new variants within days of the outbreak made it easier for scientists in other countries to start working on possible vaccines, but also that China has made significant breakthroughs in the biological sciences over the past 15-20 years. Other health officials stated that the response of the Wuhan regional government and the dissemination of information was “state of the art“ and that an extremely impressive quantity of new information contained in their daily updates had been published since December 31st/January 1st.\n\nTo call any virus a “Chinese” virus is as silly as to say that it is someone’s fault if he catches the flu or gets sick in general. It can happen anywhere in the world and it can happen to every person on the planet. The lesson from this recent case of the reaction to the outbreak of the coronavirus is that it shows who in the international community is capable of responding to dangers that threaten all of humanity, and who is a troglodyte, and who is not.\n\nIf Europe and the US want to be credible in talking about “human rights” and “western values” then they should join hands with China and cooperate on the fight to defeat the coronavirus. The coronavirus and the fact that every year 100,000s of people get killed by the influenza shows how urgent it is to make new breakthroughs in the fundamental understanding of living processes to overcome what are today, life threatening diseases. Europe and the US should also cooperate with the most future oriented vision on the international agenda, namely the extension of the BRI into south west Asia and Africa and the international cooperation in the Space Silk Road.\n\nFor sure we should reflect on the actuality of the judgment of Gottfried Leibniz who said:\n\n“In any case it seems that the situation of our present conditions in light of the growing moral decadence is such that it almost seems necessary that Chinese missionaries are sent to us, who could teach us the application and practices of natural theology….I therefore believe, that if a wise man would be elected not to judge about the beauty of goddesses, but about the excellence of peoples, he would give the golden apple to the Chinese.”\n\nI think Leibniz was a lot wiser than Der Spiegel, Jyllands-Posten and New York Times. [a:class=links_good_rands;href=\"https:\\/\\/www.scelf.fr\\/sshop\\/product\\/air-jordan-1-retro-high-og-rust-pink-861428-101-for-sale\\/\"]Air Jordan 1 Retro High OG 'Rust Pink' 861428-101 For Sale[/a][script][/script]", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20200206/china-deserves-praise-and-cooperation-fight-against-coronavirus", "title": "China Deserves Praise and Cooperation in the Fight against the Coronavirus", "description": "By Helga Zepp-LaRouche The name of the German weekly magazine “Der Spiegel” actually means in English, “The Mirror.” And indeed what you see this week on the cover page of the print version of Der Spiegel—a person with a gas mask, goggles, earphones and a hoody⁠—is the mirror image of...", "image": "https://larouchepac.com/sites/default/files/cvattpieet.jpg", "image:url": "https://larouchepac.com/sites/default/files/cvattpieet.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/cvattpieet.jpg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}