{"result_id": "183053", "URL": "https://www.larouchepac.com/20200829/leaping-future", "timestamp": "2023-04-25 16:12:08 CEST+0200", "meta": {"description": "Much of the world is hungry for something better, eager to achieve great things and to unlock new potentials. In President Donald Trump’s speech at the Republican National Convention, he said that “the Republican Party, the party of Abraham Lincoln, goes forward united, determined, and ready to...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20200829/leaping-future", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "Leaping into the Future", "cleaned_text": "Much of the world is hungry for something better, eager to achieve great things and to unlock new potentials. In President Donald Trump’s speech at the Republican National Convention, he said that “the Republican Party, the party of Abraham Lincoln, goes forward united, determined, and ready to welcome millions of Democrats, Independents, and anyone who believes in the greatness of America and the righteous heart of the American people.” Promising to create economic growth, to develop a vaccine by the end of the year, and to protect the people from violent anarchists and criminals, Trump referred repeatedly to the “special purpose” of the United States, in contrast to the America-is-evil rhetoric emanating from the freak-show DNC.\n\nThe United States was created as a nation, in the form of an idea, an intention. From the first settlers in Boston, committed to creating a new society free of the oligarchism of Europe, through the American Revolution that achieved victory over that empire, to achievements in space and science, the United States truly has played a unique role in human history.\n\nIt is a rededication to the best impulses of the United States that can drive this nation towards playing a positive, collaborative world role in catalyzing the unlocking of new potentials that will define human life for the next century—new breakthroughs in nuclear science, space travel, biology, culture, and more. Struggling against decades of deindustrialization, the U.S. has developed a huge upgrade of the production of ventilators, increased production of PPE, and developed several promising potential treatments and vaccines. On Thursday, the White House announced the purchase of 150 million new, rapid antigen tests, with production expected to scale up to 50 million tests per month by October.\n\nBut there is an enormous tension between Trump’s intentions, his campaign promises both in 2016 and today, and the plans of the British Empire that has hated the United States since its creation. Absurd lies, manufactured in London, with some varnish applied in the United States, have duped some into believing that Russian President Vladimir Putin controls Donald Trump (a claim absurd on its face) and even achieved the impeachment of Trump regarding dealings with Ukraine of which his mentally addled opponent is actually himself guilty. Within the administration remain elements of what Trump has colorfully termed “The Swamp”—people like Mike Pompeo who seek to create new conflicts, in opposition to Trump’s repeatedly expressed desire to end the endless wars.\n\nSeveral military events over the past week point to the very real danger of conflict:\n• Russia has conducted, in international waters near Alaska, the largest military exercise in the Arctic since the Soviet era, involving 50 naval ships and 40 aircraft.\n• In Syria, there was a collision between U.S. and Russian military vehicles, despite advance efforts to coordinate. What could have been the result of a U.S. or Russian service member being killed by the other nation?\n• B-52 bombers were flown over all 30 NATO countries in a show of force.\n\nThe LaRouche movement has had a unique understanding of what is driving this conflict, and of how it parallels events in the economic sphere. It is not a coincidence that enormous, ever-larger bailouts are required to pump up the value of stocks: as economic window dressing and to maintain the parasitic British financial system at the expense of the real economy.\n\nTrump and the world need the economic policies of LaRouche, if they are to succeed. Trump’s intentions for the economy are good, although the means of realizing those intentions eludes him. Wrongly attacking China and boasting of killing Iranian Gen. Qassem Soleimani are not helpful steps achieving campaign promises of ending wars and creating economic growth.\n\nThe impulse to break from the recent, horrible past requires a strategy, and the Schiller Institute event next weekend will bring to life a dialog focused on the policies of the LaRouche movement, urgently needed today. A preliminary program and schedule of speakers is now posted to the Schiller Institute Invitation and Registration page.\n\nDream big and unite around achieving things all people can be proud of. Trump said in his speech on Thursday: “We will launch a new age of American Ambition in Space. America will land the first woman on the Moon—and the United States will be the first nation to plant its flag on Mars. This is the unifying national agenda that will bring our country together.”\n\nTake up a mission that can bring the entire world together—overcoming the attempts to drive people apart within the United States and create barriers to collaboration among the nations of the world—a mission to make the world better than it has ever been.[a:class=links_good_rands;href=\"https:\\/\\/www.fodesep.gov.co\\/index.php\\/afffhcshop\\/search\\/label\\/running\\/\"]Running Archives[/a][script][/script]", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20200829/leaping-future", "title": "Leaping into the Future", "description": "Much of the world is hungry for something better, eager to achieve great things and to unlock new potentials. In President Donald Trump’s speech at the Republican National Convention, he said that “the Republican Party, the party of Abraham Lincoln, goes forward united, determined, and ready to...", "image": "https://larouchepac.com/sites/default/files/trump-rnc-20200827-small.jpg", "image:url": "https://larouchepac.com/sites/default/files/trump-rnc-20200827-small.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/trump-rnc-20200827-small.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://schillerinstitute.nationbuilder.com/20200905_conference?recruiter_id=9"], "authors": [], "publish_date": null}