{"result_id": "183037", "URL": "https://www.larouchepac.com/everything_is_at_stake_a_morning_report", "timestamp": "2023-04-25 16:11:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.nationbuilder.com/larouchepac/sites/1030/favicon_images/original/favicon.png?1612211172", "canonical": "https://www.larouchepac.com/everything_is_at_stake_a_morning_report", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "‘Everything Is At Stake’: A Morning Report On The Battle For The United States", "cleaned_text": "This morning, November 11, we highlight the following critical events, illustrative of the evolving state of the battle for the future of the United States and the world:\n\nStop the Steal: President Donald Trump’s campaign team continues to develop evidence, reach out to witnesses, and file lawsuits to address election fraud, with the support of some Congressional Republicans and by his many supporters around the country. Attorney General William Barr has issued guidance to Department of Justice (DOJ) officials that investigations of potentially election-changing voting crimes can begin now—albeit he is a bit late in flipping that switch. Richard Pilger, the Director of the DOJ’s Election Crimes Branch, immediately quit because Barr demanded that he do his job. Pilger, when he was at the IRS, was deeply implicated in the political targeting of conservative groups seeking tax exempt status by his then boss, Lois Lerner.\n\nThe Harris/Biden fascist movement has now targeted the Trump campaign’s lawyers, doxing them. A group called the Trump Accountability Project is swearing that it will “cancel” anyone who worked in the Trump Administration or who supports Donald Trump. There was, of course, never any plan to “bring the nation together,” as Biden duped those aching for some imaginary “calm” after four years of the news media and the intelligence community repeatedly injecting outright venomous hatred into minds of the populace. Twitter is now censoring any reference by President Trump to election fraud and Fox joined other media in not covering White House press statements about it.\n\nThe Schiller Institute yesterday sponsored an event featuring J. Kirk Wiebe, Col. Richard Black, Jim Jatras, Harley Schlanger, and Helga Zepp-LaRouche discussing the state of this fight. Wiebe particularly focused on the universal manipulation of software and vote count transmission programs, along with traditional and new methods of committing the fraud which, for the most part, occurred in Democrat-controlled urban enclaves. Helga Zepp-LaRouche presented the actual history of the American Revolution, something Americans have been prevented from knowing based on the revisionist and deliberately false histories circulated in such places as the New York Times 1619 project. Zepp-LaRouche summed up the current situation by noting that “everything is at stake.”\n\nAhead of the scheduled million-person car/truck and people’s parades in support of the President and the Constitution this Saturday, as the Trump voters adopt the correct tactic in taking to the streets in overwhelming numbers, Georgia’s automatic recount has started and the Trump campaign filed an 85-page Federal complaint cataloging the horror show which took place in Pennsylvania.\n\nDrain the Swamp: Trump fired key swamp monster Mark Esper as Secretary of Defense. Esper is a corrupt avatar for the Raytheon Corporation, itself a key component of the entity called “the Beltway Bandits” that dominate life in the Washington, DC part of the swamp. Esper repeatedly fought the President in order to continue America’s role as war provocateur extraordinaire and policeman on behalf of the oligarchical Empire centered in the City of London and Wall Street.\n\nOther defense officials got the axe or resigned.\n\nThen, Trump deployed Kash Patel from the National Security Council to serve as strategic adviser to the new Secretary of Defense, Christian Miller. The swamp immediately began to scream and howl. Patel is the person who, while working for Congressman Devin Nunes, discovered and revealed chunks of the coup against President Trump. Hysterical, John Brennan called for the invocation of the 25th Amendment immediately because Trump was bound now to reveal “vital defense secrets.” In reality, just such a deployment is necessary to ensure the declassification of critical documents concerning the coup against the President at one of its most vital centers, the Pentagon. Trump also axed key people in the “climate catastrophe” business in government, including Mike Kuperberg, responsible for the national climate assessment, and Indranil “Neil” Chatterjee, of the U.S. Global Change Research Program. This follows the earlier dismissal of NOAA’s chief climate hysteric, Craig McClean. CIA Director Gina Haspel and FBI Director Christopher Wray are also said to be on the chopping block.\n\nCOVID: As the number of new cases rises throughout the world, vaccines from Pfizer, Eli Lilly, and others roll out of trials as the result of Operation Warp Speed and Russia’s Sputnik vaccine program. Based on the continuing politicization of the virus as a weapon against Trump and the population, Pfizer is claiming that Warp Speed had nothing to do with this wonderful development and deliberately delayed announcing that it was 90% effective until after the election. Similar effectiveness has been demonstrated by Russia’s vaccine. Eli Lilly received an emergency use authorization for its antibody treatment; Regeneron is seeking the same authorization for its antibody treatment. Lilly’s therapeutic was used to treat former New Jersey Governor Chris Christie; Regeneron’s was used to treat Donald Trump.\n\nActivities on the Biden/Harris Front: Biden appointed his own virus task force composed of people who have been advising him all along. It includes the infamous Ezekiel “Easy-Kill” Emanuel, the advocate for denying medical treatment to anyone over age 75 and to certain children as defined in the death panel formulations of the Obama Administration. For more on Emanuel’s beliefs and background, see EIR’s coverage of the Nazi euthanasia program.\n\nRemember, that the baby boomer generation is hitting this age and, according to Sir Michael Bloomberg and others on Biden’s team, will overwhelm the current hospital system and the ability of the country to pay for their care. Better to send them off with the cheery greeting, “Go, you’ve had a good life,” according to infamous remarks by Bloomberg aired by his opponents during the Presidential campaign. Across the pond, in the City of London itself, the Green Horizon Summit continued as Prince Charles along with the world’s central bankers and oligarchs continued to create the program for the putative Harris/Biden administration. They plan a global central bankers’ dictatorship to implement draconian and genocidal austerity based on the myth of catastrophic climate change. Biden already identified himself with this globalist world fascist movement by adopting their slogan, “Build Back Better,” as the slogan for his campaign.\n\nAmong the dozen members of Biden’s proposed coronavirus task force is Ezekiel “Easy-Kill” Emanuel, who worked on health care policy in the Obama Administration, leading to what ended up as the cost-cutting gift to the insurance “industry” known as Obamacare. Eager to reduce healthcare expenditures, Emanuel worked out which people should be thrown in the trash. In his “Principles for Allocation of Scarce Medical Interventions,” published in the Lancet British medical journal shortly after Obama’s inauguration, Emanuel unveiled his invention called the “Complete Lives System” (CLS). It “produces a priority curve on which individuals aged between 15 and 40 years get the most substantial chance, whereas the youngest and oldest people get chances that are attenuated.” The title of his 2014 article, “Why I Hope to Die at 75: An argument that society and families—and you—will be better off if nature takes its course swiftly and promptly,” speaks for itself.\n\nDevelopments elsewhere in the world put the ongoing fight for the future of the United States into deeper perspective. In Bolivia, the candidate of the party of former President Evo Morales, who was deposed a year ago in a coup, won a resounding victory in the election, defeating the attempted attack on democracy in that nation. In the Caucasus, the growing conflict between Armenia and Azerbaijan has reached a new stage of resolution through the mediation of Russia, preventing an outbreak of conflict and terrorism in that region so crucial to global integration, and so long a target of British destabilization. In Iraq, the oil-for-reconstruction program worked out between that nation and China is back on the table, according to the Prime Minister. This offers a true path forward toward development, free of the trans-Atlantic financial miasma emanating from a deep Green pit.", "opengraph": {"title": "‘Everything Is At Stake’: A Morning Report On The Battle For The United States", "url": "https://www.larouchepac.com/everything_is_at_stake_a_morning_report", "description": "This morning, November 11, we highlight the following critical events, illustrative of the evolving state of the battle for the future of the United States and the world:\r\n\r\nStop the Steal: President Donald Trump’s campaign team continues to develop evidence, reach out to witnesses, and file lawsuits to address election fraud, with the support of some Congressional Republicans and by his many supporters around the country. Attorney General William Barr has issued guidance to Department of Justice (DOJ) officials that investigations of potentially election-changing voting crimes can begin now—albeit he is a bit late in flipping that switch. Richard Pilger, the Director of the DOJ’s Election Crimes Branch, immediately quit because Barr demanded that he do his job. Pilger, when he was at the IRS, was deeply implicated in the political targeting of conservative groups seeking tax exempt status by his then boss, Lois Lerner.", "type": "article", "image": "https://assets.nationbuilder.com/larouchepac/pages/5333/meta_images/original/20201026-trump.jpg?1606269802", "site_name": "LaRouchePAC"}, "tags": ["1.Written-Update", "3.Category-USA"], "tweets": [], "movies": [], "links": ["https://schillerinstitute.com/blog/2020/11/10/round-table-discussion-the-2020-election-an-intelligence-war-with-very-high-stakes-for-the-world/", "https://beta.documentcloud.org/documents/20403506-trump-campaign-kathy-boockvar-pennsylvania-election-federal-lawsuit", "https://larouchepub.com/eiw/public/2009/eirv36n24-20090619/eirv36n24-20090619_074-the_nazi_euthanasia_program_fore.pdf"], "authors": [], "publish_date": null}