{"result_id": "183024", "URL": "https://www.larouchepac.com/20200410/larouche-s-apollo-mission-defeat-global-pandemic-build-world-health-system-now", "timestamp": "2023-04-25 16:10:37 CEST+0200", "meta": {"description": "At the time this urgent call to build a World Health System was written, the world had confirmed over 1.5 million cases of COVID-19, and the number of deaths attributed to the pandemic was over 80,000. This disease, first active in humans in December or November 2019, has spread, within a matter...", "lang": "en", "keywords": "Lyndon LaRouche, Political Action Committee", "favicon": "/sites/default/files/favicons/apple-touch-icon-57x57.png", "canonical": "https://larouchepac.com/20200410/larouche-s-apollo-mission-defeat-global-pandemic-build-world-health-system-now", "encoding": "utf-8"}, "image": null, "domain": "www.larouchepac.com", "title": "LaRouche’s ‘Apollo Mission’ To Defeat the Global Pandemic: Build a World Health System Now!", "cleaned_text": "The following is the introduction to the Schiller Institute international statement on how to defeat the global pandemic, the full text of which will be released soon.\n\nAt the time this urgent call to build a World Health System was written, the world had confirmed over 1.5 million cases of COVID-19, and the number of deaths attributed to the pandemic was over 80,000. This disease, first active in humans in December or November 2019, has spread, within a matter of months, to nearly all nations of the world, with a ferocious rate of growth in populations not taking strong measures to arrest its advance. The mortality rate among those infected is estimated to be an order of magnitude greater than that of the seasonal flu. At the time you are reading this call to action, the numbers will be greater, possibly much, much greater.\n\nGravest of all, we could be witnessing an explosion of infections and deaths in the so-called less-developed sector or Third World, especially in Africa—whose underdevelopment is the Achilles Heel of the entire human species.\n\nDefeating this deadly virus will require immediate, coordinated global action: intensive public health measures, including extensive testing and isolation of those found to be infected; a huge increase in the availability of healthcare facilities and equipment; significant investment and resources devoted to finding cures and a vaccine; great strides in sanitation measures, especially in less-developed nations; and an end to the historically unnecessary lack of development—and outright looting—in the world. This global pandemic emphatically requires a global response, as reservoirs of the virus in any part of the world could cause resurgences for years.\n\nIt requires a World Health System covering every part of the planet.\n\nSuch a global response requires, most centrally, the coordination of the United States, China, Russia, and India, a Four Powers alliance open to all nations of the planet. The leaders of those four nations should hold a summit as soon as possible to work out common approaches to addressing the enormous health, material, and infrastructural needs of the world, as a first step towards creating an entirely New Paradigm to replace the bankrupt old system.\n\nThere is no other way, no lesser course, that will actually defeat the pandemic.\n\nAlthough COVID-19 is the disaster currently inflicting itself on humanity, it is only one of many to which the world is susceptible, due to a failure of the international order over the past fifty years, most especially the deadly looting of developing sector nations. A solar flare could knock out most of the world’s electricity grids—why have they not been hardened against this, even in the so-called “developed” countries? An as-yet-undiscovered asteroid or comet could destroy an entire continent—why have we developed no defenses against this threat? There are 800 million people on this planet who lack adequate food—why has this been tolerated? A plague of locusts currently menaces the lives and livelihoods of tens of millions. Another disease could spring up any week—why do we not have better defenses against viruses?\n\nThe world community must create a resiliency for successful long-term survival, not just in the short-term while hoping that no unusual events occur, but prepared for true safety and security. This cannot occur under the neo-liberal economic paradigm that is now failing. It cannot occur under a regime of bailout and treating financial values as sacrosanct. That system, with its $1.8 quadrillion speculative bubble, is now thoroughly bankrupt, and must be put through a process of bankruptcy reorganization long specified by the American economist Lyndon H. LaRouche, along with the simultaneous requirement to build a new Hamiltonian credit system, nationally and internationally, to put humanity back on the track of science-driven physical-economic development. The long-term successful survival and flourishing of the human species requires a world system that recognizes the divine spark of potential genius in each individual and which seeks to foster that potential through economic, cultural, and scientific development.\n\nBelow, we take up the task of delineating the needed World Health System, by posing, and answering, two questions:\n\n1) What is the cause of this, possibly the worst crisis humanity has ever faced?\n\n2) What is the full set of measures that should be taken on all fronts, both in the United States and worldwide, to defeat the pandemic?\n\nWe do not start by listing all the bottlenecks and shortages, and try to work from the bottom up. We start instead by figuring out what is required: We must use this existential crisis to finally overcome the underdevelopment of large sections of mankind, a condition, which is not worthy of the human species. Then, we determine the physical economic requirements to achieve each step along the way, including the bills of materials and manpower requirements, as defined from the standpoint of industrial engineering. We then return to the bottlenecks and figure out how we are going to break through them, on schedule or earlier. We will find that, to achieve that trajectory, we will be on a forced march requiring constant technological breakthroughs; we will find that we are in the domain of the science of physical economy, where Lyndon LaRouche’s work is our only guide and roadmap.\n\nWe will also find that such an approach requires full international cooperation, especially between the United States and China, to achieve these common aims of mankind. Anyone opposing such cooperation should be scientifically classed in the same genus and species, politically, as the coronavirus itself.\n\nThat approach is how Franklin D. Roosevelt mobilized the nation to defeat fascism in World War II. That is how NASA engineers turned the looming Apollo 13 catastrophe into success. And in our current endeavor to defeat the coronavirus across the planet, here too failure is not an option.\n\nEMERGENCY IMPLEMENTATION OF THE\n\n FOUR LAWS OF LYNDON LAROUCHE", "opengraph": {"type": "article", "url": "page URL https://larouchepac.com/20200410/larouche-s-apollo-mission-defeat-global-pandemic-build-world-health-system-now", "title": "LaRouche’s ‘Apollo Mission’ To Defeat the Global Pandemic: Build a World Health System Now!", "description": "At the time this urgent call to build a World Health System was written, the world had confirmed over 1.5 million cases of COVID-19, and the number of deaths attributed to the pandemic was over 80,000. This disease, first active in humans in December or November 2019, has spread, within a matter...", "image": "https://larouchepac.com/sites/default/files/lyndon-helga-hussein-2018.jpg", "image:url": "https://larouchepac.com/sites/default/files/lyndon-helga-hussein-2018.jpg", "image:secure_url": "https://larouchepac.com/sites/default/files/lyndon-helga-hussein-2018.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://action.larouchepac.com/four_laws_global?recruiter_id=139893"], "authors": [], "publish_date": null}