{"result_id": "184006", "URL": "https://learntherisk.org/", "timestamp": "2023-04-25 16:12:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://learntherisk.org/", "encoding": "UTF-8"}, "image": null, "domain": "learntherisk.org", "title": "Home Page", "cleaned_text": "THE U.S. HEALTHCARE SYSTEM IS A LEADING CAUSE OF DEATH\n\nA 2016 report from Johns Hopkins School of Medicine shows that medical errors in hospitals and other healthcare facilities are incredibly common, and may now be the third-leading cause of death in the United States — claiming 251,000 lives every year, more than respiratory disease, accidents, stroke and Alzheimer’s.\n\nMoreover, a 2014 study found that prescription drugs are now the fourth leading cause of death in the US. The Harvard study reported 2.74 MILLION serious adverse drug reactions per year come from properly prescribed drugs. And about 106,000 people DIE EVERY YEAR from drugs prescribed to them.\n\nIn addition to pharmaceutical drugs and medical error, vaccines are put into the mix. Vaccines do not create immunity, they create customers. It’s the best business model in the world. It keeps people coming back for more – forever.\n\nThere are multiple toxic ingredients in vaccines — some known to cause cancer and autoimmune disorders. These toxins create health issues that in turn create customers.\n\nThe best defense against disease is a healthy, strong immune system, not overloaded with toxins from food, water, air, and pharmaceutical products.", "opengraph": {"locale": "en_US", "type": "website", "title": "Home Page - Learn the Risk", "description": "THE REALITY OF OUR HEALTH The United States is sicker than ever.  The U.S. spends more than any other country on healthcare yet has more chronic health issues than any other country. Half of all adults in the U.S. have a chronic illness, and nearly half will eventually die of cancer.  We are exposed to a cocktail of synthetic chemicals […]", "url": "https://learntherisk.org/", "site_name": "Learn the Risk", "image": "https://learntherisk.org/wp-content/uploads/elementor/thumbs/do-you-know-back-cv-format5mm-1-oza5zze377w2jppt7p8anz11jck6z4ws86839r0drg.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bmj.com/content/353/bmj.i2139", "https://www.fda.gov/Drugs/DevelopmentApprovalProcess/DevelopmentResources/DrugInteractionsLabeling/ucm110632.htm"], "authors": [], "publish_date": null}