{"result_id": "184003", "URL": "https://learntherisk.org/sudden-infant-death/", "timestamp": "2023-04-25 16:12:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://learntherisk.org/sudden-infant-death/", "encoding": "UTF-8"}, "image": null, "domain": "learntherisk.org", "title": "Sudden Infant Death", "cleaned_text": "We hypothesize that vaccine components could have a direct role in sparking off a lethal outcome in vulnerable babies. In conclusion, we sustain the need that deaths occurring in a short space of time after hexavalent vaccination are appropriately investigated and submitted to a post-mortem examination particularly of the autonomic nervous system by an expert pathologist to objectively evaluate the possible causative role of the vaccine in SIDS. Current Medicinal Chemistry, 2014.\n\nInfant mortality rates regressed against number of vaccine doses routinely given: Is there a biochemical or synergistic toxicity?\n\nAlmost no SIDS prior to vaccine programs. SIDS diagnosis introduced in 1973 (note 16, page 10) Human & Experimental Toxicity, 2011\n\nThe epidemiology of fatalities reported to the vaccine adverse event reporting system 1990-1997.\n\nOver 600 cases of sudden infant death syndrome following vaccination were reported from 1990-1997. Pharmacoepidemiology & Drug Safety, 2001", "opengraph": {"locale": "en_US", "type": "article", "title": "Sudden Infant Death - Learn the Risk", "description": "Sudden Infant Death (SIDS) following hexavalent vaccination: a neuropathology study.  We hypothesize that vaccine components could have a direct role in sparking off a lethal outcome in vulnerable babies. In conclusion, we sustain the need that deaths occurring in a short space of time after hexavalent vaccination are appropriately investigated and submitted to a post-mortem examination […]", "url": "https://learntherisk.org/sudden-infant-death/", "site_name": "Learn the Risk", "article:modified_time": "2022-05-31T23:30:45+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://pubmed.ncbi.nlm.nih.gov/24083600/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3170075/", "https://pubmed.ncbi.nlm.nih.gov/11760487/"], "authors": [], "publish_date": null}