{"result_id": "184012", "URL": "https://learntherisk.org/vaccines/", "timestamp": "2023-04-25 16:12:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://learntherisk.org/vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "learntherisk.org", "title": "Vaccines", "cleaned_text": "Vaccines are not as safe and effective as they say.\n\nIt’s up to YOU to do the real research on vaccines and protect the health of your family!\n\nWe have researched vaccines for years and compiled our favorite studies, books, videos, and other resources to help people educate themselves on the real dangers of vaccines.\n\nYou do NOT need an injection for protection. The BEST defense against disease is a strong immune system — NOT one overloaded with toxic additives from food, air, water, and VACCINES. Yep, vaccines. They contain many toxic ingredients – some KNOWN to cause cancer and brain damage – that have no place to go once injected into the body. So they go straight to vital organs, bypassing the body’s natural line of defense and detox.\n\nYou inject toxins, you get diseases. Plain and simple. In recent years the vax schedule has catapulted to insane levels since no accountability exists. As has the cancer rate in children. The more vaccines added, the higher the rate of chronically ill children. It’s not rocket science.\n\n— DID DISEASES DECLINE BECAUSE OF VACCINES? NOT ACCORDING TO HISTORY…\n\nIn the United States (and other countries), historical records show that disease mortality declined nearly 90% before the introduction of the vaccine program and routine vaccination programs, according to the Trends in the Health of Americans report. In fact, some of the most prevalent diseases in the early 1900s — including Tuberculosis (TB), Scarlet Fever and Typhoid — followed the same declines WITHOUT ever having a vaccine program (in the US). These diseases were nearly eradicated in the U.S. without the population ever having been vaccinated for them.\n\nThe pharmaceutical industry would like you to believe that all doctors think vaccines are safe and effective, but there are many doctors who know this is not the reality. Most will not come forward and risk their careers, but there are some who bravely do.\n\nLearning about vaccines? You need to watch these videos! They include talks, doctors interviews, Learn The Risk billboards, stories, and documentaries.\n\n“Routine” pet vaccinations can cause side effects, either short or long term. Considering pet vaccines are repeated year after year, the frequency and severity of these side effects in our pets have increased dramatically.\n\nDid you know the risk of getting cervical cancer is 1 in 40,000… yet severe reactions are estimated in only 1 in 500 girls? In fact, more than 55,000 serious reactions, including deaths, have been reported in the U.S. alone.\n\nIt’s no fun getting the flu. But is it worth the health risks involved with getting the shot? The flu shot (aka flu vaccine) is one of the most dangerous vaccines on the market, linked to sudden death syndrome, stroke, paralysis and more. And studies show that it rarely protects people from getting the flu. Think twice before rolling up your sleeve. Actually, think three times, four times, five times…\n\nThe U.S. has the highest rate of baby death (aka infant mortality) in the developed world — and the most vaccines for babies under a year old. Now we know the real reason infant deaths are so high in this country.\n\nDid you know that seizures CAN be triggered by vaccination? Sometimes these seizures can result in chronic seizure disorders and/or epilepsy. These are REAL risks that are even included on the vaccine product inserts.\n\nVACCINES CAN and DO trigger autism!! Thousands of parents describe their children as ‘fine’ one day, then suddenly they develop autism (a neurological regression) after vaccines. But what does the science say? It AGREES . . .\n\nTraveling abroad? Wondering about vaccines? As with other vaccines, travel vaccines also have associated risks and side effects that doctors often fail to mention to their patients.\n\nDid you know that CANCER IN CHILDREN is skyrocketing? It’s now the leading cause of disease death… in KIDS. Not long ago, cancer was a disease mainly seen in older people — after a lifetime of toxic exposures added up and took their toll. But now children are being exposed to so many toxic chemicals so early in life that childhood cancer rates have nearly TRIPLED in the last 20 years!\n\n— ARE VIRUSES ACTUALLY GOOD FOR US? THE SCIENCE MAY SURPRISE YOU\n\nPharmaceutical companies and the medical system love to vilify viruses, but are they truly bad for your body? Science is discovering there are many benefits to common illnesses, particularly in childhood, and researchers theorize that viruses actually help train the immune system in a way that can REDUCE the risk of more serious issues, including cancer, later in life.\n\n— VACCINES & IMMUNITY: WHAT DOES THE REAL SCIENCE SHOW?\n\nVaccines create temporal (short-term) antibodies ONLY. This is the sole requirement from the FDA in order to get approval to sell the vaccine. BUT Science has long known that antibodies alone do NOT create real immunity.\n\nThese books and documentaries will help you be and stay HEALTHY in the best way. They’re all the best books for people who already know about vaccines and other health dangers and for those who have yet to learn!\n\nDid you now that vaccines are not actually required for schools, universities and employment? There are exemptions available in every state.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccines - Learn the Risk", "description": "Vaccine Ingredients  Vaccine Studies  Did Diseases Decline Because of Vaccines? Doctors Speak Out Videos  Pet Vaccines HPV Vaccine  Flu Shot SIDS Seizures & Vaccines  Travel Vaccines Childhood Cancer Vitamin K Shot Autism & Vaccines: Is There A Link? Are viruses Actually Good For Us? Vaccines & Immunity: The Real Science Our Favorite Books & Documentaries […]", "url": "https://learntherisk.org/vaccines/", "site_name": "Learn the Risk", "article:modified_time": "2022-05-31T23:34:24+00:00", "image": "https://learntherisk.org/wp-content/uploads/2020/12/ttav-logo-new-1024x336.png"}, "tags": [], "tweets": [], "movies": [], "links": ["/vaccines/ingredients/", "https://learntherisk.org/vaccines/studies/", "/vaccines/diseases/", "https://learntherisk.org/doctors/index.htm", "https://learntherisk.org/videos/index.htm", "https://learntherisk.org/pet-vaccines/index.htm", "https://learntherisk.org/hpv-human-papillomavirus-vaccine/", "https://learntherisk.org/vaccines/flu-shot-is-it-worth-the-risk/", "https://learntherisk.org/sudden-infant-death/", "https://learntherisk.org/seizures/index.htm", "https://learntherisk.org/autism/index.htm", "https://learntherisk.org/travel/index.htm", "https://learntherisk.org/childhood-cancer/index.htm", "https://learntherisk.org/viruses/index.htm", "#", "https://learntherisk.org/books/index.htm", "https://learntherisk.org/exemptions/index.htm"], "authors": [], "publish_date": null}