{"result_id": "184002", "URL": "https://learntherisk.org/vaccines/studies/", "timestamp": "2023-04-25 16:12:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://learntherisk.org/vaccines/studies/", "encoding": "UTF-8"}, "image": null, "domain": "learntherisk.org", "title": "Studies", "cleaned_text": "“Many commonly used vaccines have their origin in cell lines that were originally developed from an aborted fetus.” Ethics & Medics http://www.immunize.org/concerns/furton.pdf\n\n“Diploid cells (WI-38, MRC-5) vaccines have their origin in induced abortions. Among these vaccines we find the following: rubella, measles, mumps, rabies, polio, smallpox, hepatitis A, chickenpox, and herpes zoster. Nowadays, other abortion tainted vaccines cultivated on transformed cells (293, PER.C6) are in the pipeline: flu, Respiratory Syncytial and parainfluenza viruses, HIV, West Nile virus, Ebola, Marburg and Lassa, hepatitis B and C, foot and mouth disease, Japanese encephalitis, dengue, tuberculosis, anthrax, plague, tetanus and malaria” Cuadernos De Bioetica 2008 https://www.ncbi.nlm.nih.gov/m/pubmed/18611078/\n\n“These scientific and medical advances are dependent on the use of fetal tissue from aborted fetuses. While the practice of induced abortion despite societal benefit may be theologically objectionable to some, these practices are professionally responsible. Federal regulations exist to discourage patients from being influenced by the societal benefit of fetal research in arriving at the decision to terminate as well as to prevent researchers from influencing a patient’s decision.” American Journal of Obstetrics & Gynecology 2015 https://www.ncbi.nlm.nih.gov/m/pubmed/26432465\n\n“Research using fetal tissue has allowed for development of vaccines for numerous diseases including polio, rubella, and measles.”\n\n“Vaccines manufactured in human fetal cell lines contain unacceptably high levels of fetal DNA fragment contaminants. The human genome naturally contains regions that are susceptible to double strand break formation and DNA insertional mutagenesis.” Issues in Law & Medicine 2015 https://www.ncbi.nlm.nih.gov/m/pubmed/26103708/\n\n“We have developed a new HDCS, Walvax-2, which we derived from the lung tissue of a 3-month-old fetus.” Human Vaccines & Immunotherapeutics 2015 https://www.ncbi.nlm.nih.gov/m/pubmed/25803132/\n\nCharacteristics and viral propagation properties of a new human diploid cell line, Walvax-2, and its suitability as a candidate cell substrate for vaccine production.\n\n“Most anaphylactic reactions and some urticarial reactions to gelatin-containing measles, mumps, and rubella monovalent vaccines are associated with IgE-mediated gelatin allergy. DTaP immunization histories suggest that the gelatin-containing DT” Allergy Clin Immunol. 1999. https://www.ncbi.nlm.nih.gov/m/pubmed/21244488/\n\nA clinical analysis of gelatin allergy and determination of its causal relationship to the previous administration of gelatin-containing acellular pertussis vaccine combined with diphtheria and tetanus toxoids.\n\n“Gelatin and other nonprimate mammal–derived products are common excipient ingredients in several vaccines, and it has been postulated that patients with alpha-gal allergy might react to these vaccines.” The journal of allergy and clinical immunology http://www.jacionline.org/article/S0091-6749(16)31455-5/fulltext\n\nWe present three cases of anaphylaxis that we encountered after MMR vaccination in children sensitized to hen’s egg and cow’s milk. https://www.ncbi.nlm.nih.gov/m/pubmed/21244488/\n\nAnaphylactic reactions to measles-mumps-rubella vaccine in three children with allergies to hen’s egg and cow’s milk.\n\nClick here for more studies on Allergies\n\nResearchers believe that there may be a link between a vaccine against cervical cancer and a rapidly progressive, fatal disease known as amyotrophic lateral sclerosis (ALS) in two young women. www.webmd.com/sexual-conditions/hpv-genital-warts/news/20091016/rare-disease-may-be-linked-vaccine?fbclid=IwAR0lFI15zyMn3DzNbS4j2W_ml3XFlFgwROlCq4q0EMGCanp-Cmp56CV7PuY#1\n\nTwo ALS Cases May Be Linked to Gardasil Vaccine\n\nAluminum hydroxide injections lead to motor deficits and motor neuron degeneration Morin stain detected the presence of aluminum in the cytoplasm of motor neurons with some neurons also testing positive for the presence of hyper-phosphorylated tau protein, a pathological hallmark of various neurological diseases, including Alzheimer’s disease and frontotemporal dementia. A second series of experiments was conducted on mice injected with six doses of aluminum hydroxide. Behavioural analyses in these mice revealed significant impairments in a number of motor functions as well as diminished spatial memory capacity. The demonstrated neurotoxicity of aluminum hydroxide and its relative ubiquity as an adjuvant suggest that greater scrutiny by the scientific community is warranted. Inorganic Biochemistry 2009 www.ncbi.nlm.nih.gov/m/pubmed/19740540\n\nExperimental evidence has repeatedly demonstrated that chronic Aluminum (Al) intoxication reproduces neuropathological hallmarks of Alzheimers’ Disease (AD). Misconceptions about Al bioavailability may have misled scientists regarding the significance of Al in the pathogenesis of AD. The hypothesis that Al significantly contributes to AD is built upon very solid experimental evidence and should not be dismissed. Immediate steps should be taken to lessen human exposure to Al, which may be the single most aggravating and avoidable factor related to AD. Journal of Alzheimer’s Disease, 2011 http://www.ncbi.nlm.nih.gov/pubmed/21157018\n\nAluminum and Alzheimer’s disease: after a century of controversy, is there a plausible link?\n\nYoung, male colony CD-1 mice were injected with the adjuvants at doses equivalent to those given to US military service personnel. Behavioral testing showed motor deficits in the aluminum treatment group that expressed as a progressive decrease in strength. Significant cognitive deficits were observed in the combined aluminum and squalene group. Neuromolecular Medicine, 2007 http://www.ncbi.nlm.nih.gov/pubmed/17114826\n\nA correlation between increasing ASD rates and aluminium (Al) adjuvants in common use in paediatric vaccines in several Western countries. The correlation between ASD rate and Al adjuvant amounts appears to be dose-dependent. Journal of Inorganic Biochemistry, 2013 http://www.ncbi.nlm.nih.gov/pubmed/23932735\n\nAdministration of aluminium to neonatal mice in vaccine relevant amounts is associated with adverse long term neurological outcomes.\n\nClick here for more studies on Aluminum\n\n“This study provides the first clinical evidence for a temporal relationship of vaccine-associated IMHA in the dog.” Journal of Veterinary Internal Medicine 1996 https://www.ncbi.nlm.nih.gov/m/pubmed/8884713/\n\n“We describe an immunocompetent child who developed transient severe aplastic anemia concomitant with a typical clinical and laboratory-proven chickenpox syndrome 3 weeks after immunization.” The Pediatric Infectious Disease Journal 2009 https://www.ncbi.nlm.nih.gov/m/pubmed/19633522/\n\nProlonged exposure to low levels of aluminum leads to changes associated with brain aging and neurodegeneration “Epidemiological studies suggest that aluminum may not be as innocuous as was previously thought and that aluminum may actively promote the onset and progression of Alzheimer’s disease.” Toxicology 2014 https://www.ncbi.nlm.nih.gov/m/pubmed/24189189\n\nThe neurotoxicity of environmental aluminum is still an issue “Aluminum is a strong candidate for consideration as a subtle promoter of events typically associated with brain aging.” Neurotoxicology 2010 https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2946821\n\nIncreased blood mercury levels in patients with Alzheimer’s disease “These results demonstrate elevated blood levels of mercury in AD, and they suggest that this increase of mercury levels is associated with high CSF levels of A beta, whereas tau levels were unrelated.” Neural Transmission 1989 https://www.ncbi.nlm.nih.gov/m/pubmed/9588761\n\n“Experimental evidence has repeatedly demonstrated that chronic Aluminum (Al) intoxication reproduces neuropathological hallmarks of Alzheimers’ Disease (AD). Misconceptions about Al bioavailability may have misled scientists regarding the significance of Al in the pathogenesis of AD. The hypothesis that Al significantly contributes to AD is built upon very solid experimental evidence and should not be dismissed. Immediate steps should be taken to lessen human exposure to Al, which may be the single most aggravating and avoidable factor related to Alzheimer’s disease [AD].” Journal of Alzheimer’s Disease, 2011 http://www.ncbi.nlm.nih.gov/pubmed/21157018\n\nAluminum and Alzheimer’s disease: after a century of controversy, is there a plausible link?\n\nAutoimmune/Inflammatory Syndrome Induced by Adjuvants and Thyroid Autoimmunity “More studies and cases have reported the correlation of the exposure to various adjuvants with diverse autoimmune diseases…Clinical cases and series of heterogeneous autoimmune conditions including systemic sclerosis, systemic lupus erythematosus, and rheumatoid arthritis have been reported to be induced by several adjuvants. ” Frontiers in Endocrinology 2017 https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5256113/\n\nAutoimmune/auto-inflammatory syndrome induced by adjuvants (ASIA) after quadrivalent human papillomavirus vaccination in Colombians: a call for personalised medicine “This was a case study in which 3 patients with autoimmune/auto-inflammatory syndrome induced by adjuvants (ASIA) after quadrivalent human papillomavirus vaccination (HPV) were evaluated and described. Our results highlight the risk of developing ASIA after HPV vaccination and may serve to increase the awareness of such a complication.” Clinical and Experimental Rheumatology 2015 https://www.ncbi.nlm.nih.gov/m/pubmed/25962455\n\n“It was observed that cases with the SAAE outcomes of gastroenteritis (odds ratio (OR) = 4.6, 95% confidence interval (CI) = 1.3-18.5), arthritis (OR = 2.5, 95% CI = 1.4-4.3), systemic lupus erythematosus (OR = 5.3, 95% CI = 1.5-20.5), vasculitis (OR = 4, 95% CI = 1.01-16.4), alopecia (OR = 8.3, 95% CI = 4.5-15.9), or CNS conditions (OR = 1.8, 95% CI = 1.04-2.9) were significantly more likely than controls to have received HPV4 vaccine (median onset of SAAE symptoms from 6 to 55 days post-HPV4 vaccination).” https://www.ncbi.nlm.nih.gov/m/pubmed/25535199\n\nA one year followup of chronic arthritis following rubella and hepatitis B vaccination based upon analysis of the Vaccine Adverse Events Reporting System (VAERS) database This study revealed that: “adult rubella and adult hepatitis B vaccines were statistically associated with chronic arthritis which persisted for at least one year. The etiology for these adverse reactions may involve autoimmune mechanisms.” https://www.ncbi.nlm.nih.gov/m/pubmed/12508767\n\n“Recombinant hepatitis B vaccine may trigger the development of RA [Rheumatoid Arthritis] in MHC class II genetically susceptible individuals.” https://www.ncbi.nlm.nih.gov/m/pubmed/9733447\n\nClick here for more studies on Arthritis\n\n“Parents who refuse vaccinations reported less asthma and allergies in their unvaccinated children. Although this relationship was independent of measured confounders, it could be due to differences in other unmeasured lifestyle factors or systematic bias. https://www.sciencedirect.com/science/article/pii/S0091674905000266\n\nThe relationship between vaccine refusal and self-report of atopic disease in children\n\nThe Christchurch Health and Development Study comprises 1,265 children born in 1977. The 23 children who received no diphtheria/pertussis/tetanus (DPT) and polio immunizations had no recorded asthma episodes or consultations for asthma or other allergic illness before age 10 years; in the immunized children, 23.1% had asthma episodes, 22.5% asthma consultations, and 30.0% consultations for other allergic illness. Similar differences were observed at ages 5 and 16 years. https://www.ncbi.nlm.nih.gov/m/pubmed/9345669/\n\n“The odds of having a history of asthma was twice as great among vaccinated subjects than among unvaccinated subjects. DTP or tetanus vaccination appears to increase the risk of allergies and related respiratory symptoms in children and adolescents.” Journal of Manipulative and Physiological Therapeutics 2000 https://www.ncbi.nlm.nih.gov/m/pubmed/10714532\n\nEffects of diphtheria-tetanus-pertussis or tetanus vaccination on allergies and allergy-related respiratory symptoms among children and adolescents in the United States.\n\nDelay in diphtheria, pertussis, tetanus vaccination is associated with a reduced risk of childhood asthma. “Among 11, 531 children who received at least 4 doses of DPT, the risk of asthma was reduced to ½ in children whose first dose of DPT was delayed by more than 2 months. The likelihood of asthma in children with delays in all 3 doses was 0.39 (95% CI, 0.18-0.86).” Allergy and Clinical Immunology 2007 http://www.jacionline.org/article/S0091-6749(07)02379-2/fulltext\n\n“Phase one showed significantly increased risks for autism, speech disorders, mental retardation, personality disorders, and thinking abnormalities reported to VAERS following thimerosal-containing DTaP vaccines in comparison to thimerosal-free DTaP vaccines. Phase two showed significant associations between cumulative exposures to thimerosal and the following types of NDs: unspecified developmental delay, tics, attention deficit disorder (ADD), language delay, speech delay, and neurodevelopmental delays in general.” Medical Science Monitor 2005 https://www.ncbi.nlm.nih.gov/m/pubmed/15795695/\n\n“Consistent significantly increased rate ratios were observed for autism, autism spectrum disorders, tics, attention deficit disorder, and emotional disturbances with Hg exposure from TCVs.” Neurological Sciences 2008 https://www.ncbi.nlm.nih.gov/m/pubmed/18482737/\n\nThimerosal exposure in infants and neurodevelopmental disorders: an assessment of computerized medical records in the Vaccine Safety Datalink.\n\nThere were significant and comparable increases in maternal Rh-negativity among children with NDs {neurodevelopmental disorders} (Clinic: A=24.2%), autism spectrum disorders (Clinic: A=28.3%, B=25.3%), and attention-deficit-disorder/attention-deficit-hyperactivity-disorder (Clinic: A=26.3%) observed at both clinics in comparison to both control groups (Clinic: A=12.1%, B=13.9%) employed. Children with NDs born post-2001 had a maternal Rh-negativity frequency (13.6%) similar to controls. CONCLUSION: This study associates TCR exposure with some NDs in children.” Neuro Endocrinology Letters 2008 https://www.ncbi.nlm.nih.gov/m/pubmed/18404135/\n\n“There are over 165 studies that have focused on Thimerosal, an organic-mercury (Hg) based compound, used as a preservative in many childhood vaccines, and found it to be harmful. Of these, 16 were conducted to specifically examine the effects of Thimerosal on human infants or children with reported outcomes of death; acrodynia; poisoning; allergic reaction; malformations; auto-immune reaction; Well’s syndrome; developmental delay; and neurodevelopmental disorders, including tics, speech delay, language delay, attention deficit disorder, and autism. BioMed Research International 2014 https://www.ncbi.nlm.nih.gov/pubmed/24995277\n\nMethodological issues and evidence of malfeasance in research purporting to show thimerosal in vaccines is safe.\n\nThere is a compelling argument that the occurrence of regressive autism is attributable to genetic and chromosomal abnormalities, arising from the overuse of vaccines, which subsequently affects the stability and function of the autonomic nervous system…Heavy Metals and Mercury in particular, affects the function of the Central Nervous System. North American Journal of Medical Sciences, 2009 https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3364648/\n\nWhat is regressive autism and why does it occur? Is it the consequence of multi-systemic dysfunction affecting the elimination of heavy metals and the ability to regulate neural temperature?\n\nThe increase in exposure to aluminum adjuvants significantly correlates with the increase in ASD prevalence. Elsevier, 2011 http://www.sciencedirect.com/science/article/pii/S0162013411002212\n\nDo aluminum vaccine adjuvants contribute to the rising prevalence of autism?\n\nThe present study provides new evidence supporting an association between childhood vaccines and the risk of an ASD diagnosis. Translational Neurodegeneration, 2013 https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3878266/\n\nA two-phase study evaluating the relationship between Thimerosal-containing vaccine administration and the risk for an autism spectrum disorder diagnosis in the United States.", "opengraph": {"locale": "en_US", "type": "article", "title": "Studies - Learn the Risk", "description": "A B C D E F G H I J K L M N O P Q R S T U V W X Y Z A Aborted Human Fetal DNA Allergies ALS Aluminum Alzheimer’s & Dementia Anemia Arthritis Asthma Attention Deficit Disorder (ADD & ADHD) Autism & Vaccines Autoimmune Issues & Vaccines B Bell’s Palsy Brain Damage (Encephalitis) — seeNeurological C Cancer Cardiovascular Chickenpox Vaccine Chronic Fatigue Syndrome  D Death Dementia Diabetes E Ears Eczema Eyes F Fetal […]", "url": "https://learntherisk.org/vaccines/studies/", "site_name": "Learn the Risk", "article:modified_time": "2022-05-31T23:10:37+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["..\\autism-studies\\index.htm", "https://www.omicsonline.org/open-access/evidence-that-food-proteins-in-vaccines-cause-the-development-of-foodallergies-and-its-implications-for-vaccine-policy-2329-6631-1000137.pdf", "https://www.ncbi.nlm.nih.gov/m/pubmed/25427994/", "..\\autoimmune-issues-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2928079/", "https://www.ncbi.nlm.nih.gov/m/pubmed/21994316", "https://www.ncbi.nlm.nih.gov/m/pubmed/28025240", "https://www.ncbi.nlm.nih.gov/m/pubmed/24457866/", "https://www.ncbi.nlm.nih.gov/m/pubmed/4066602/", "https://www.ncbi.nlm.nih.gov/m/pubmed/17933552", "https://www.ncbi.nlm.nih.gov/m/pubmed/15202523/", "..\\cancer-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/17130313", "https://www.ncbi.nlm.nih.gov/m/pubmed/17515437", "https://www.ncbi.nlm.nih.gov/m/pubmed/11529542", "..\\cardiovascular-studies\\index.htm", "http://www.ncbi.nlm.nih.gov/pubmed/22659447", "https://www.ncbi.nlm.nih.gov/m/pubmed/17071055", "https://www.ncbi.nlm.nih.gov/m/pubmed/25506472", "https://www.ncbi.nlm.nih.gov/m/pubmed/8888270", "..\\chronicfatigue-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/8182813", "https://www.ncbi.nlm.nih.gov/m/pubmed/25598306", "https://www.ncbi.nlm.nih.gov/m/pubmed/22727350", "..\\death-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1116914/", "https://www.ncbi.nlm.nih.gov/m/pubmed/12482192", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1114674/", "https://www.cdc.gov/nchs/data/nvsr/nvsr68/nvsr68_02-508.pdf", "https://www.ajc.com/news/health-med-fit-science/rate-dementia-deaths-has-more-than-doubled-cdc-says/rT8bdwfp2TzKewAC9OLqIN/", "https://www.wsbradio.com/news/national/rate-dementia-deaths-has-more-than-doubled-cdc-says/XBIrRUXR9mw2xOGp6UlSgL/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3056430/", "https://www.ncbi.nlm.nih.gov/m/pubmed/24189189/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2946821/", "https://www.ncbi.nlm.nih.gov/pubmed/23932735", "https://www.ncbi.nlm.nih.gov/pubmed/21157018", "https://www.ncbi.nlm.nih.gov/m/pubmed/21568886/", "https://jmedicalcasereports.biomedcentral.com/articles/10.1186/1752-1947-8-41", "..\\diabetes-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/25391635/", "https://www.ncbi.nlm.nih.gov/m/pubmed/18255204/", "https://www.ncbi.nlm.nih.gov/m/pubmed/8024302/", "https://www.ncbi.nlm.nih.gov/m/pubmed/19027813", "http://www.nejm.org/doi/pdf/10.1056/NEJMra022500", "https://www.ncbi.nlm.nih.gov/m/pubmed/18419490", "..\\eczema-studies\\index.htm", "http://bjo.bmj.com/content/94/1/137.long", "https://www.ncbi.nlm.nih.gov/m/pubmed/23999961/", "https://www.ncbi.nlm.nih.gov/m/pubmed/23378179/", "..\\eyes-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/22727350", "https://www.ncbi.nlm.nih.gov/pubmed/23023030", "https://www.ncbi.nlm.nih.gov/m/pubmed/18406499", "..\\fetaldeath-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/25427994", "https://www.ncbi.nlm.nih.gov/m/pubmed/18706528", "https://www.ncbi.nlm.nih.gov/m/pubmed/17071055", "..\\fibromyalgia-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/21244488", "http://www.jacionline.org/article/S0091-6749(16)31455-5/fulltext", "https://www.ncbi.nlm.nih.gov/m/pubmed/25439422", "..\\foodallergy-studies\\index.htm", "http://www.ncbi.nlm.nih.gov/m/pubmed/25598306", "https://www.ncbi.nlm.nih.gov/m/pubmed/15060267", "https://www.ncbi.nlm.nih.gov/m/pubmed/25535199", "..\\gastrointestinal-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/10030074", "https://www.ncbi.nlm.nih.gov/m/pubmed/50424/", "http://jnnp.bmj.com/content/82/11/1296.long", "..\\guillain-barre-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/17114826", "https://www.ncbi.nlm.nih.gov/m/pubmed/19740540", "https://www.ncbi.nlm.nih.gov/m/pubmed/12127050", "..\\gulf-war-syndrome-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/27071855/", "https://www.ncbi.nlm.nih.gov/m/pubmed/9326478/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2956183/", "..\\hair-loss-studies\\index.htm", "http://www.ncbi.nlm.nih.gov/pubmed/15722255", "https://www.tandfonline.com/doi/abs/10.1080/02772240701806501#preview", "http://www.ncbi.nlm.nih.gov/pubmed/22249285", "..\\hepatitis-b-studies\\index.htm", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1116914/", "http://www.ncbi.nlm.nih.gov/pubmed/12911277", "https://www.ncbi.nlm.nih.gov/m/pubmed/8182813/", "..\\hib-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4528880/", "http://www.sciencedirect.com/science/article/pii/S0264410X16002036?via%3Dihub", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4475239/", "..\\HPV-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/21036134", "https://www.ncbi.nlm.nih.gov/m/pubmed/22771654", "https://www.ncbi.nlm.nih.gov/m/pubmed/22796025", "..\\immune-system-studies\\index.htm", "http://m.ccn.aacnjournals.org/content/36/3/e1.full.pdf", "..\\seizures\\index.htm", "https://www.ncbi.nlm.nih.gov/pubmed/28958404", "https://www.ncbi.nlm.nih.gov/pubmed/?term=23324619", "..\\influenza-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/25819538/", "https://www.ncbi.nlm.nih.gov/m/pubmed/22476507/", "https://www.ncbi.nlm.nih.gov/m/pubmed/10050577", "https://www.ncbi.nlm.nih.gov/m/pubmed/27033285/", "https://www.ncbi.nlm.nih.gov/m/pubmed/28281896/", "https://www.ncbi.nlm.nih.gov/m/pubmed/26935002/", "‎https://learntherisk.org/kawasaki-studies/", "https://www.ncbi.nlm.nih.gov/m/pubmed/25916030/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1597965/", "https://www.ncbi.nlm.nih.gov/m/pubmed/22771654/", "‎https://learntherisk.org/kidney-studies/", "https://www.ncbi.nlm.nih.gov/m/pubmed/27417999", "https://www.ncbi.nlm.nih.gov/m/pubmed/25962455/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5256113/", "..\\lupus-studies\\index.htm", "https://n.neurology.org/content/78/1_Supplement/P03.243", "http://www.ncbi.nlm.nih.gov/pubmed/16940266", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3697452/", "http://www.ncbi.nlm.nih.gov/pubmed/16940266", "http://jid.oxfordjournals.org/content/early/2013/04/29/infdis.jit143.full", "http://www.ncbi.nlm.nih.gov/pubmed/18539365", "https://www.ncbi.nlm.nih.gov/pubmed/1884314", "https://www.ncbi.nlm.nih.gov/pubmed/16266774", "https://www.ncbi.nlm.nih.gov/m/pubmed/18805844", "http://jnnp.bmj.com/content/82/11/1296.long", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4266455", "..\\multiple-sclerosis-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/28302408/", "https://www.ncbi.nlm.nih.gov/m/pubmed/28063707/", "http://www.bmj.com/content/346/bmj.f794", "http://m.ccn.aacnjournals.org/content/36/3/e1.long", "https://www.ncbi.nlm.nih.gov/m/pubmed/22868743", "https://www.ncbi.nlm.nih.gov/m/pubmed/17106158", "https://www.ncbi.nlm.nih.gov/m/pubmed/27087245", "..\\neurological-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/26425627", "https://www.ncbi.nlm.nih.gov/m/pubmed/23902317/", "https://www.ncbi.nlm.nih.gov/m/pubmed/26125978", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2951028/", "https://www.ncbi.nlm.nih.gov/m/pubmed/23035167", "http://www.ncbi.nlm.nih.gov/m/pubmed/27421720/", "https://www.ncbi.nlm.nih.gov/m/pubmed/1876605/", "https://www.mja.com.au/journal/2008/189/3/pancreatitis-following-human-papillomavirus-vaccination", "https://www.ncbi.nlm.nih.gov/m/pubmed/17261831/", "https://www.ncbi.nlm.nih.gov/m/pubmed/27642491", "https://www.ncbi.nlm.nih.gov/m/pubmed/2561040", "https://www.ncbi.nlm.nih.gov/m/pubmed/9846820", "..\\paralysis-studies\\index.htm", "https://neuro.psychiatryonline.org/doi/pdf/10.1176/appi.neuropsych.11110324", "https://www.ncbi.nlm.nih.gov/m/pubmed/15675624", "https://www.ncbi.nlm.nih.gov/m/pubmed/12445523", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2946821/", "https://www.ncbi.nlm.nih.gov/m/pubmed/1350062/", "http://jnnp.bmj.com/content/63/2/258.long", "http://www.pnas.org/content/111/2/787.abstract", "http://cid.oxfordjournals.org/content/early/2012/03/13/cid.cis287.short", "https://www.omsj.org/blogs/historic-whooping-cough-outbreak-happening-among-the-fully-vaccinated", "https://www.ncbi.nlm.nih.gov/pubmed/3835080", "https://www.ncbi.nlm.nih.gov/pubmed/6470775?dopt=Abstract", "https://academic.oup.com/aje/article/160/4/306/165872", "http://jvi.asm.org/content/77/9/5039.full", "https://link.springer.com/article/10.1007/s40264-016-0456-3", "https://www.ncbi.nlm.nih.gov/m/pubmed/26354426/", "https://www.ncbi.nlm.nih.gov/m/pubmed/27867145/", "..\\pots-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/27421722", "https://www.ncbi.nlm.nih.gov/m/pubmed/16766480", "https://www.ncbi.nlm.nih.gov/m/pubmed/22235057", "..\\psychiatric-studies\\index.htm", "http://europepmc.org/abstract/med/9164004", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4912703/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1718684/", "http://pediatrics.aappublications.org/content/pediatrics/early/2012/01/04/peds.2011-1111.full.pdf", "http://journals.sagepub.com/doi/abs/10.1177/0961203313499959", "http://adc.bmj.com/content/78/3/273", "https://jamanetwork.com/journals/jamapediatrics/article-abstract/2587559", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3888271/", "https://www.ncbi.nlm.nih.gov/m/pubmed/28063725/", "..\\pregnancy-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/21048370/", "https://www.ncbi.nlm.nih.gov/m/pubmed/26666611/", "https://www.ncbi.nlm.nih.gov/m/pubmed/11529542", "..\\respiratory-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/25495973/", "https://www.ncbi.nlm.nih.gov/m/pubmed/18404135/", "https://www.ncbi.nlm.nih.gov/pubmed/12933322", "..\\rhogam-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3050973", "https://www.ncbi.nlm.nih.gov/m/pubmed/18670", "https://www.ncbi.nlm.nih.gov/m/pubmed/21425100", "..\\seizures-studies\\index.htm", "https://jamanetwork.com/journals/jamapediatrics/article-abstract/2300374", "https://www.ncbi.nlm.nih.gov/m/pubmed/15050101/", "http://www.bmj.com/rapid-response/2011/10/30/errors-diagnosis-child-abuse", "http://www.jacionline.org/article/S0091-6749(16)31455-5/fulltext", "https://www.ncbi.nlm.nih.gov/m/pubmed/10920184", "https://www.ncbi.nlm.nih.gov/m/pubmed/25452596", "..\\shingles-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/27166466", "https://www.ncbi.nlm.nih.gov/m/pubmed/20955829", "https://www.ncbi.nlm.nih.gov/m/pubmed/24284281", "https://n.neurology.org/content/78/1_Supplement/P01.009?", "https://www.ncbi.nlm.nih.gov/m/pubmed/22291779", "https://www.ncbi.nlm.nih.gov/m/pubmed/15580216", "http://www.ncbi.nlm.nih.gov/m/pubmed/24083600/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3170075", "http://www.ncbi.nlm.nih.gov/pubmed/11760487", "..\\sudden-infant-death-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/pubmed/22015977", "http://www.ncbi.nlm.nih.gov/pubmed/16079072", "http://www.ncbi.nlm.nih.gov/pubmed/21350943", "..\\thimerosal-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/m/pubmed/27417999", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5256113/", "https://www.ncbi.nlm.nih.gov/m/pubmed/20369619/", "..\\thyroid-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/pubmed/24995277", "https://www.ncbi.nlm.nih.gov/m/pubmed/21785120", "https://www.ncbi.nlm.nih.gov/m/pubmed/18482737", "https://www.ncbi.nlm.nih.gov/m/pubmed/15795695", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4961900/", "https://www.ncbi.nlm.nih.gov/m/pubmed/21487527", "https://www.ncbi.nlm.nih.gov/m/pubmed/11027094", "https://www.ncbi.nlm.nih.gov/m/pubmed/21425100", "https://www.ncbi.nlm.nih.gov/m/pubmed/19880568", "https://www.ima.org.il/FilesUpload/IMAJ/0/107/53806.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1597965", "https://www.ncbi.nlm.nih.gov/m/pubmed/985298", "https://www.ncbi.nlm.nih.gov/m/pubmed/28162821", "https://www.ncbi.nlm.nih.gov/m/pubmed/10050577", "https://www.ncbi.nlm.nih.gov/m/pubmed/6698459", "https://www.ncbi.nlm.nih.gov/m/pubmed/27642491", "https://www.ncbi.nlm.nih.gov/m/pubmed/8182813/", "https://www.ncbi.nlm.nih.gov/m/pubmed/20481116/", "..\\failure-studies\\index.htm", "http://journal.frontiersin.org/article/10.3389/fpsyt.2017.00003/full", "http://www.ncbi.nlm.nih.gov/pubmed/23576057", "http://www.ncbi.nlm.nih.gov/m/pubmed/22561998/?i=3&from=%2F27153005%2Frelated", "http://www.fda.gov/biologicsbloodvaccines/scienceresearch/biologicsresearchareas/ucm127327.htm", "https://www.sciencedirect.com/science/article/pii/S1383574211000548?via%3Dihub", "https://www.ncbi.nlm.nih.gov/pubmed/21477676", "https://www.ncbi.nlm.nih.gov/pubmed/18922486", "http://pediatrics.aappublications.org/content/125/2/e438", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2627963/pdf/10998384.pdf", "http://www.whale.to/vaccines/goldman.pdf", "https://www.ncbi.nlm.nih.gov/m/pubmed/6772571", "https://www.ncbi.nlm.nih.gov/m/pubmed/27417999", "https://www.ncbi.nlm.nih.gov/m/pubmed/16220670", "..\\veterinary-studies\\index.htm", "http://pediatrics.aappublications.org/content/98/3/457.long", "https://www.ncbi.nlm.nih.gov/m/pubmed/24059412", "https://www.ncbi.nlm.nih.gov/m/pubmed/1392886", "..\\vitamink-studies\\index.htm", "https://www.ncbi.nlm.nih.gov/pubmed/22551029", "http://www.ncbi.nlm.nih.gov/pubmed/25405025", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3310656/", "https://www.ncbi.nlm.nih.gov/pubmed/12455906", "https://www.ncbi.nlm.nih.gov/pubmed/18564013", "https://www.ncbi.nlm.nih.gov/pubmed/15837230"], "authors": [], "publish_date": null}