{"result_id": "184010", "URL": "http://learntherisk-backup.learntherisk.org/human-cells/index.htm", "timestamp": "2023-04-25 16:12:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "..\\wp-content\\themes\\jupiterx\\lib\\favicon.ico", "canonical": "http://learntherisk-backup.learntherisk.org/index.htm", "encoding": "UTF-8"}, "image": null, "domain": "learntherisk-backup.learntherisk.org", "title": "Human Cells in Vaccines – Learn The Risk", "cleaned_text": "Can you be pro-life AND pro-vaccine? Scientists admit aborted babies are used to create vaccines, including those bought from Planned Parenthood. These aborted fetal cells are still in the needle when vaccines are given and go into the body of those vaccinated.\n\n Many experts claim that we are mutating our own DNA when we inject foreign DNA and cells — not a good thing. Just one of the potential forms of harm done by vaccines.\n\n So what do you think? Can one be pro-life and pro-vaccines at the same time?\n\nScientists say fetal tissue remains essential for vaccines and developing treatments.\n\nBOSTON — The furor on Capitol Hill over Planned Parenthood has stoked a debate about the use of tissue from aborted fetuses in medical research, but U.S. scientists have been using such cells for decades to develop vaccines and seek treatments for a host of ailments, from vision loss and neurological disorders to cancer and AIDS.\n\nAnti-abortion activists set off the uproar by releasing undercover videos of Planned Parenthood officials that raised questions of whether the organization was profiting from the sale of fetal tissue. Planned Parenthood has denied making any profit and said it charges fees solely to cover its costs.\n\nUniversity laboratories that buy such cells strongly defend their research, saying tissue that would otherwise be thrown out has played a vital role in lifesaving medical advances and holds great potential for further breakthroughs.\n\nFetal cells are considered ideal because they divide rapidly, adapt to new environments easily and are less susceptible to rejection than adult cells when transplanted.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.pbs.org/newshour/health/medical-researchers-say-fetal-tissue-remains-essential", "http://www.pbs.org/newshour/rundown/fights-ahead-planned-parenthood-senate-vote/", "http://www.pbs.org/newshour/rundown/leaked-planned-parenthood-video-defensive/"], "authors": [], "publish_date": "March 27, 2018"}