{"result_id": "184007", "URL": "https://learntherisk.org/vaccines/ingredients/", "timestamp": "2023-04-25 16:12:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://learntherisk.org/vaccines/ingredients/", "encoding": "UTF-8"}, "image": null, "domain": "learntherisk.org", "title": "Do You Know What’s in a Vaccine?", "cleaned_text": "As with all pharmaceutical products, it’s important to know what exactly you’re taking — or injecting. Vaccines are no exception.\n\nIn fact, because vaccines are injected rather than taken orally, it even more important to know exactly what you’re putting in your body. Why? Because science shows that whatever is injected is far more potent than anything ingested. Injections, like vaccines, bypass the body’s natural detox pathway.\n\nThis means more of the injected material in vaccines stays in the body and reaches vital organs and tissues via the bloodstream. This causes both acute and chronic inflammation that leads to many of the health issues that are common nowadays. It can even lead to sudden death.\n\nDid Your Doctor Tell You What Was In That Needle?\n\nUnfortunately, vaccine ingredients include many synthetic chemicals that are known to be toxic to humans, as well as foreign human fragments (from aborted babies) and animal cells and DNA. These ingredients can cause a host of issues, especially when injected.\n\nVaccines can contain aluminum, mercury, formaldehyde, antibiotics, human fetal cells, GMOs, animal proteins and DNA, glyphosate and other substances that are potentially dangerous when injected.\n\nVaccines are injected into muscle tissue, where they form a slow-release reservoir intended to stimulate the production of antibodies for some time. The ingredients are not simply flushed out like they might be if taken in as food, and some ingredients such as aluminium and mercury make their way to the brain and accumulate over time.", "opengraph": {"locale": "en_US", "type": "article", "title": "Do You Know What’s in a Vaccine? - Learn the Risk", "description": "Aluminum, Formaldehyde, MSG, E.Coli & More… As with all pharmaceutical products, it’s important to know what exactly you’re taking — or injecting. Vaccines are no exception. In fact, because vaccines are injected rather than taken orally, it even more important to know exactly what you’re putting in your body. Why? Because science shows that whatever […]", "url": "https://learntherisk.org/vaccines/ingredients/", "site_name": "Learn the Risk", "article:modified_time": "2020-12-02T20:53:15+00:00", "image": "https://learntherisk.org/wp-content/uploads/2020/12/do-you-know-back-cv-format5mm-1.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://learntherisk.org/studies/index.htm", "https://learntherisk.org/death-studies/index.htm", "https://learntherisk.org/animals/index.htm", "https://learntherisk.org/aluminum/index.htm", "https://learntherisk.org/mercury/index.htm", "https://learntherisk.org/formaldehyde/index.htm", "https://learntherisk.org/gmos-in-vaccines/index.htm", "https://learntherisk.org/animals/index.htm", "https://learntherisk.org/gmos-in-vaccines/index.htm"], "authors": [], "publish_date": null}