{"result_id": "185025", "URL": "https://www.leftcult.com/2022-10-02-radical-left-make-believe-biology-babies-heartbeats.html", "timestamp": "2023-04-25 16:12:58 CEST+0200", "meta": {"description": "The corporate-controlled media is once again going to bat for Georgia Democratic gubernatorial candidate Stacey Abrams, who continues to lie about the humanity of unborn babies. In a recent statement, Abrams falsely declared that “there is no such thing as a heartbeat at six weeks,” referring to embryonic development at the month-and-a-half stage of gestation. […]", "lang": "en", "keywords": "abortion,badhealth,badmedicine,badscience,biology,brainwashed,culture wars,fetal heartbeat,groomers,left,left cult,LGBT,Liberal Mob,Libtards,perversion,pregnancy,science fraud,Stacey Abrams,stupid,woke,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.leftcult.com/2022-10-02-radical-left-make-believe-biology-babies-heartbeats.html", "encoding": "UTF-8"}, "image": null, "domain": "www.leftcult.com", "title": "The radical Left’s world of make-believe biology: Babies don’t have heartbeats but men can give birth", "cleaned_text": "The radical Left’s world of make-believe biology: Babies don’t have heartbeats but men can give birth\n\nThe corporate-controlled media is once again going to bat for Georgia Democratic gubernatorial candidate Stacey Abrams, who continues to lie about the humanity of unborn babies.\n\nIn a recent statement, Abrams falsely declared that “there is no such thing as a heartbeat at six weeks,” referring to embryonic development at the month-and-a-half stage of gestation. (Related: Remember when the American College of Obstetricians and Gynecologists called for the word “baby” to never be used in reference to pre-born human life?)\n\n“It is a manufactured sound designed to convince people that men have the right to take control of a woman’s body,” Abrams alleges.\n\nA six-week-old embryo does have a heartbeat, by the way. And mainstream media “fact checkers” should know this, except for the fact that they conveniently forgot because they really, really want Abrams to win the election.\n\n“FWIW (for what it’s worth), ‘fetal heartbeat’ is a misnomer,” responded Glenn Kessler of The Washington Post, a fake news outlet now owned by Jeff Bezos of Amazon.\n\n“The ultrasound picks up electrical activity generated by an embryo. The so-called ‘heartbeat’ sound you hear is created by the ultrasound. Not until 10 weeks can the opening and closing of cardiac valves be detected by a Doppler machine.”\n\nLeft-wing politics has become an insane asylum circus\n\nKessler is not a doctor, by the way. He just plays one for the Post, and only when having to defend a Democrat for making false claims that lead to the spread of misinformation.\n\n“I was today years old when I discovered that an ultrasound can pick up electrical activity,” joked Anish Koka, one of many cardiologists who responded to the false claims of Abrams and Kessler.\n\n“This is scientifically and medically incorrect, 100 percent,” also said Pradheep J. Shanker. “Ultrasound can’t detect electrical activity. Who told you otherwise?”\n\nIn his defense, Kessler pointed to a September 2021 article from NPR that quoted OB-GYN Jennifer Kerns, who declared in the piece that the term “fetal heartbeat” is “pretty misleading.”\n\n“What we’re really detecting is a grouping of cells that are initiating some electrical activity,” Kerns falsely said. “In no way is this detecting a functional cardiovascular system or a functional heartbeat.”\n\nShanker shot back to this that ultrasound technology captures motion, not electricity.\n\n“In fact, ultrasound doesn’t measure electricity at all,” Shanker added. “It is literally detecting motion … motion of the soft tissue (in this case, the wall of the cardiac chamber … measuring electrical activity in a fetal heart is VERY DIFFICULT.”\n\nKeep in mind that Abrams, Kessler, and their ilk are the very same people who claim that men can give birth to children, another pseudoscientific farce that often gets said to push the LGBT agenda.\n\nWhether it is abortion or deviant sexuality, you can always count on leftists to push a false narrative as truth. In this case, Abrams is desperate to win, as well as desperate to dehumanize unborn human life to appeal to her baby-hating base.\n\nIf she can score a few more points with some LGBT talking points, perhaps by explaining how men are able to pass a child through their genitalia (let alone create a baby inside their stomach?), will it be a winning strategy this November?\n\n“Cardiovascular development in a human embryo occurs between 3 and 6 weeks after ovulation,” explains a study published in The Journal of Prenatal Medicine, defying the false claims of Abrams and Kessler.\n\n“At the end of the 4th week of gestation, the heartbeats of the embryo begin.”\n\nIf you enjoyed reading this story, you will find more like it at Libtards.news.", "opengraph": {"title": "The radical Left’s world of make-believe biology: Babies don’t have heartbeats but men can give birth", "type": "article", "url": "https://www.leftcult.com/2022-10-02-radical-left-make-believe-biology-babies-heartbeats.html", "site_name": "Left Cult Com", "description": "The corporate-controlled media is once again going to bat for Georgia Democratic gubernatorial candidate Stacey Abrams, who continues to lie about the humanity of unborn babies. In a recent statement, Abrams falsely declared that “there is no such thing as a heartbeat at six weeks,” referring to embryonic development at the month-and-a-half stage of gestation. […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2022/10/Pregnant-Man-Flash-Card.jpg"}, "tags": ["Liberal Mob", "LGBT", "biology", "Libtards", "stupid", "culture wars", "left cult", "perversion", "Stacey Abrams", "groomers", "pregnancy", "wokies", "left", "fetal heartbeat", "abortion", "brainwashed", "woke", "science fraud"], "tweets": [], "movies": [], "links": ["https://www.realclearwire.com/articles/2022/09/28/what_happens_when_a_fact-checker_doesnt_get_the_facts_right_148253.html", "https://naturalnews.com/2022-03-21-american-obgyn-baby-shouldnt-be-used-preborn.html", "http://libtards.news", "https://www.realclearwire.com/articles/2022/09/28/what_happens_when_a_fact-checker_doesnt_get_the_facts_right_148253.html", "https://naturalnews.com/2022-03-21-american-obgyn-baby-shouldnt-be-used-preborn.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2022-10-02-radical-left-make-believe-biology-babies-heartbeats.html&linkname=The%20radical%20Left%E2%80%99s%20world%20of%20make-believe%20biology%3A%20Babies%20don%E2%80%99t%20have%20heartbeats%20but%20men%20can%20give%20birth", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}