{"result_id": "185008", "URL": "https://leftcult.com/2023-02-16-eugene-oregon-bans-natural-gas-hookups-homes.html", "timestamp": "2023-04-25 16:12:53 CEST+0200", "meta": {"description": "The city council of Eugene, Oregon voted to ban natural gas hookups in new residential constructions that are three stories or less – becoming the first city in the Beaver State to do so. In a 5-3 vote, the council agreed on the ban that would then take effect on June 30. It followed two […]", "lang": "en", "keywords": "banned,big government,carbon dioxide,climate alarmism,climate change,democrats,environment,fossil fuel,fossil fuels,gas furnaces,gas hookups,gas stove,green deal,green tyranny,insanity,left cult,lunatics,natural gas,Republicans,zero emissions", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2023-02-16-eugene-oregon-bans-natural-gas-hookups-homes.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "City of Eugene in Oregon bans natural gas hookups in new homes", "cleaned_text": "City of Eugene in Oregon bans natural gas hookups in new homes\n\nThe city council of Eugene, Oregon voted to ban natural gas hookups in new residential constructions that are three stories or less – becoming the first city in the Beaver State to do so.\n\nIn a 5-3 vote, the council agreed on the ban that would then take effect on June 30. It followed two years of debate and the city council rejecting offers to put the ordinance on the ballot on May 2023. Concerns about climate change and public health, specifically those regarding carbon emissions and air quality hazards, were cited in justification of the ordinance – which does not apply to existing buildings.\n\nEugene Mayor Lucy Vinis lauded the decision, saying: “We have a governor who has pledged to build 36,000 new houses a year. We do not want those houses with natural gas hookups, and we can lead the way in the city of Eugene to say ‘This is how it’s done.'”\n\nCouncilor Jennifer Yeh, who supported the ban, remarked that they are just getting started. She added that the ordinance is the first step in making Eugene fossil fuel-free. (Related: California bans gas-powered water heaters and furnaces to push “green” agenda.)\n\nBut the ban had been passed amid opposition coming from city residents. Independent research firm DHM found that 70 percent of Eugene residents it surveyed oppose the prohibition on natural gas hookups for new construction. The Lane County Republicans, meanwhile, warned that the ban will worsen the ongoing housing shortage in Eugene and impose prohibitive costs on small businesses already struggling to recover from the pandemic.\n\nCouncilor Mike Clark, who voted not to impose the ban, said the prohibition will discourage developers and anger many voters who wanted to express their opposition through the ballot. Western Oregon Builders Association Executive Director Sid Leiken agreed with the councilor.\n\n“Our members are committed to helping create the housing our community needs to solve our homelessness and affordability crisis,” he told the Epoch Times. “We believe that actions like the surprise vote the Eugene councilors took will do little to actually improve our climate, and significantly hurt our local builders’ ability to create housing that is truly affordable for our neighbors.”\n\nBan on gas stoves a perfect example of green tyranny\n\nAccording to natural gas provider NW Natural, science does not support the ban. It cited a study that states: “Ventilation plays a key role in mitigating cooking-related air emissions that come from both gas and electric stoves. This is why kitchen exhaust has been required for all new homes in Oregon for many years, whether they have gas or electric cooking.”\n\nNW Natural supplies natural gas to the homes of more than 2.5 million Oregonians.\n\nThe ordinance in Eugene came at a time when news of the Biden administration’s plan to ban gas stoves nationwide broke out. The fiasco began when an official from the Consumer Product Safety Commission (CPSC) remarked that “any option is on the table” when it comes to regulating gas stoves.\n\nMembers of Congress took to social media to express opposition to the plan, including Rep. Ronny Jackson (R-TX).\n\n“I’ll never give up my gas stove. If the maniacs in the White House come for my stove, they can pry it from my cold, dead hands,” he tweeted back in January. The Texas congressman concluded his tweet by challenging authorities to “come and take it.”\n\nMeanwhile, two senators announced a proposal to prevent this from happening. In early February, Sen. Joe Manchin (D-WV) and Sen. Ted Cruz (R-TX) introduced the Gas Stove Protection and Freedom Act. The bill would prevent the CPSC from using federal funds to outlaw new or existing gas stoves.\n\nFollow GreenTyranny.news for more about city ordinances against “climate change.”\n\nWatch the video below where a CNN host accidentally reveals real motives for the gas stove ban.\n\nThis video is from the Be Children of Light channel on Brighteon.com.\n\nCalifornia “Greenies” ban gas furnaces, water heaters in pursuit of zero carbon emissions.\n\nGREEN GOES STUPID: California to ban sale of gasoline-powered cars by 2035.\n\nEco-terrorists smash gas pumps, absurdly claim that too much oil and gas will cause global starvation and crop failures.", "opengraph": {"title": "City of Eugene in Oregon bans natural gas hookups in new homes", "type": "article", "url": "https://www.leftcult.com/2023-02-16-eugene-oregon-bans-natural-gas-hookups-homes.html", "site_name": "Left Cult Com", "description": "The city council of Eugene, Oregon voted to ban natural gas hookups in new residential constructions that are three stories or less – becoming the first city in the Beaver State to do so. In a 5-3 vote, the council agreed on the ban that would then take effect on June 30. It followed two […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2023/02/Tea-Kettle-Steam-Stove-Hot-Water.jpg"}, "tags": ["big government", "climate change", "left cult", "lunatics", "fossil fuel", "green deal", "zero emissions", "banned", "Republicans", "environment", "gas hookups", "natural gas", "carbon dioxide", "insanity", "fossil fuels", "democrats", "gas furnaces", "green tyranny", "gas stove"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/oregons-eugene-council-bans-natural-gas-hookups-in-new-residences_5053759.html", "https://www.kgw.com/article/tech/science/environment/eugene-natural-gas-ban-hookups/283-214f3d2e-088b-4c12-9823-9ceeaac47809", "https://pdx.eater.com/2023/2/10/23594659/eugene-oregon-natural-gas-appliances-ban", "https://naturalnews.com/2022-09-30-california-bans-gas-powered-water-heaters-furnaces.html", "http://fuelsupply.news", "https://www.commerce.senate.gov/services/files/16159500-F671-4BEC-857B-BFA51DDBBC29", "https://greentyranny.news/", "https://www.brighteon.com/dc2d57bf-2b63-4b40-b1b4-a6436aa04645", "https://www.brighteon.com/channels/bechildrenoflight", "https://naturalnews.com/2022-09-12-states-emulating-california-banning-gas-powered-cars.html", "https://carbondioxide.news/2022-09-27-california-ban-gas-furnaces-heaters-zero-carbon.html", "https://robocars.news/2022-08-30-california-to-ban-gas-powered-cars-2035.html", "https://greentyranny.news/2022-04-29-eco-terrorists-smash-gas-pumps-oil-starvation.html", "https://www.theepochtimes.com/oregons-eugene-council-bans-natural-gas-hookups-in-new-residences_5053759.html", "https://www.kgw.com/article/tech/science/environment/eugene-natural-gas-ban-hookups/283-214f3d2e-088b-4c12-9823-9ceeaac47809", "https://pdx.eater.com/2023/2/10/23594659/eugene-oregon-natural-gas-appliances-ban", "https://www.commerce.senate.gov/services/files/16159500-F671-4BEC-857B-BFA51DDBBC29", "https://www.brighteon.com/dc2d57bf-2b63-4b40-b1b4-a6436aa04645", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2023-02-16-eugene-oregon-bans-natural-gas-hookups-homes.html&linkname=City%20of%20Eugene%20in%20Oregon%20bans%20natural%20gas%20hookups%20in%20new%20homes", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}