{"result_id": "185014", "URL": "https://leftcult.com/2019-04-27-satanic-temple-has-evolved-into-an-anti-trump-movement.html", "timestamp": "2023-04-25 16:12:55 CEST+0200", "meta": {"description": "The Satanic Temple is the perfect religion for progressives.  You can believe anything you want, as long as you hate what Donald Trump, Christians and conservatives believe.  Unlike the Church of Satan, the Satanic Temple doesn’t even believe in a supernatural entity called Satan.  Instead, they celebrate Satan as “the ultimate rebel”, and they relish […]", "lang": "en", "keywords": "Anti Christ,Anti-Trump,Christians,conservatives,deep state,democrats,demonic,Donald Trump,election,left cult,Leftists,progressices,Satanic,satanism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2019-04-27-satanic-temple-has-evolved-into-an-anti-trump-movement.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "The satanic temple has evolved into an anti-Trump movement, and leftists are flocking to it", "cleaned_text": "The satanic temple has evolved into an anti-Trump movement, and leftists are flocking to it\n\nThe Satanic Temple is the perfect religion for progressives. You can believe anything you want, as long as you hate what Donald Trump, Christians and conservatives believe. Unlike the Church of Satan, the Satanic Temple doesn’t even believe in a supernatural entity called Satan. Instead, they celebrate Satan as “the ultimate rebel”, and they relish in using the symbol of Satan to greatly upset Christians. The Satanic Temple was founded in 2013, and from the very beginning it was clear that they were primarily a political movement. In fact, they openly tell prospective members that the only real requirement for joining is to believe “in the political and secular actions” of the group…\n\nPreviously, Satanism in America had always been a shadowy underground movement, but the Satanic Temple has changed all that.\n\nInstead of avoiding the public eye, they believe that their rebellion against conservatives and Christians “requires a level of political participation”…\n\nThe organization grew rapidly after it was founded, but if Hillary Clinton had won the 2016 election that probably would have put a damper on their political activism.\n\nBut once Donald Trump won the election, interest in the group absolutely exploded…\n\n“The Satanic Temple attracted ‘thousands’ of new members in just the first 36 hours after the election of Donald Trump,” the group reported. “The 4-year-old temple, which had a pre-Trump membership of around 50,000, has never before seen a spike in registration nearly this big.” “We’re definitely a resistance movement,”spokesperson and co-founder Lucien Greaves said after a speech outside the University of Colorado Boulder. “We stand in stark opposition to this idea that we must unify under a single religious banner.”\n\nThanks to a favorable new documentary about the group, it is getting a lot of attention right now.\n\nAnd even many leftists that have absolutely no intention of joining the Satanic Temple are saying very positive things about the organization. For example, the following comes from a Huffington Post article entitled “Satan Is Having A Moment”…\n\nSatanists, it turns out, are everything you think they’re not: patriotic, charitable, ethical, equality-minded, dedicated to picking up litter with pitchforks on an Arizona highway. That much is clear in the fantastic new documentary “Hail Satan?” — which chronicles the rise of the Satanic Temple, a movement that has little to do with its titular demon. Founded in 2013, the organization is equal parts modern-day religion, political activist coalition and meta cultural revolution. By reclaiming the pop iconography that has long frightened evangelical America ? devil worship, ritualistic sacrifice, horns, pentagrams, the so-called Black Mass ? the Satanic Temple aims to catch people’s attention and then surprise them with messages of free speech, compassion, liberty and justice for all.\n\nPositive articles like that make members of the Satanic Temple sound like civic-minded do-gooders that just want to make a positive impact on society, but the truth is that they absolutely loathe everything that conservatives and Christians stand for.\n\nThey really hate President Trump, and they really, really hate Vice-President Pence. Just consider what one of the co-founders of the Satanic Temple recently said about Pence…\n\nAnd despite the fact that they claim that they “don’t worship Satan”, the group does celebrate the black mass, it does conduct Pentagram rituals, and it does seek to put statues of Baphomet up in prominent public locations.\n\nAs the group continues to grow, their national influence undoubtedly will as well.\n\nPerhaps it is appropriate that the Satanic Temple has gained such prominence. In our society today, we are literally locked in a battle of good vs. evil for the future of our nation, and it seems quite fitting that Satan has become a key symbol for the other side.\n\nTo me, the Satanic Temple is more than just a little bit hypocritical. They claim to not believe in any supernatural entities, and yet they were just granted tax-exempt status “as a church” by the Internal Revenue Service…\n\nEither they are a “faith” or they are not.\n\nUnfortunately, I have a feeling that there is a lot more to the Satanic Temple than meets the eye.\n\nJust like their hero, the leaders of the Satanic Temple appear to be experts in deception, and they are leading thousands upon thousands of people down a very dark path.", "opengraph": {"title": "The satanic temple has evolved into an anti-Trump movement, and leftists are flocking to it", "type": "article", "url": "https://www.leftcult.com/2019-04-27-satanic-temple-has-evolved-into-an-anti-trump-movement.html", "site_name": "Left Cult Com", "description": "The Satanic Temple is the perfect religion for progressives.  You can believe anything you want, as long as you hate what Donald Trump, Christians and conservatives believe.  Unlike the Church of Satan, the Satanic Temple doesn’t even believe in a supernatural entity called Satan.  Instead, they celebrate Satan as “the ultimate rebel”, and they relish […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2022/05/lucifer_satan_devil_Hillary_Clinton.jpg"}, "tags": ["Anti Christ", "demonic", "satanism", "deep state", "Donald Trump", "left cult", "Leftists", "progressices", "Christians", "conservatives", "democrats", "election", "Satanic", "Anti-Trump"], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/The_Satanic_Temple", "http://endoftheamericandream.com/archives/the-satanic-temple-has-evolved-into-an-anti-trump-movement-and-leftists-are-flocking-to-it", "https://www.dailymail.co.uk/news/article-6616577/The-rise-Satanism-America-members-dont-ACTUALLY-worship-devil-push-activism.html", "https://www1.cbn.com/cbnnews/us/2018/september/how-satanists-are-working-to-stop-trump-and-his-evangelical-supporters", "https://m.facebook.com/TheSatanicTempleSeattle/posts/1233621173327603", "https://www.huffpost.com/entry/hail-satan-documentary-penny-lane_n_5cb62721e4b0ffefe3b84c1c", "https://thehill.com/blogs/blog-briefing-room/news/427628-leader-of-satanic-temple-mike-pence-really-scares-me", "https://en.wikipedia.org/wiki/The_Satanic_Temple", "https://en.wikipedia.org/wiki/The_Satanic_Temple", "https://en.wikipedia.org/wiki/The_Satanic_Temple", "https://amzn.to/2GFvBUe", "https://www.thewrap.com/satanic-temple-tax-exempt-hail-satan/", "http://endoftheamericandream.com/archives/the-satanic-temple-has-evolved-into-an-anti-trump-movement-and-leftists-are-flocking-to-it", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2019-04-27-satanic-temple-has-evolved-into-an-anti-trump-movement.html&linkname=The%20satanic%20temple%20has%20evolved%20into%20an%20anti-Trump%20movement%2C%20and%20leftists%20are%20flocking%20to%20it", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}