{"result_id": "185020", "URL": "https://leftcult.com/2021-10-15-gofundme-takes-down-fundraising-campaign-vaccine-mandate-litigation.html", "timestamp": "2023-04-25 16:12:56 CEST+0200", "meta": {"description": "We previously discussed how GoFundMe has joined social media sites in censoring opposing viewpoints on subjects from critical race theory to vaccines to election fraud. The site once offered a neutral site for those seeking to support others with similar views or interests. The company now insists that it will only allow people to gather on the […]", "lang": "en", "keywords": "badmedicine,Censorship,freedom,fundraising,GoFundMe,Government Slaves,Leftist,medical fascism,Medical Tyranny,pandemic,Resist,Suppressed,traitors,vaccine mandates,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2021-10-15-gofundme-takes-down-fundraising-campaign-vaccine-mandate-litigation.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "GoFundMe takes down fundraising campaign for litigation over vaccine mandate", "cleaned_text": "GoFundMe takes down fundraising campaign for litigation over vaccine mandate\n\nWe previously discussed how GoFundMe has joined social media sites in censoring opposing viewpoints on subjects from critical race theory to vaccines to election fraud. The site once offered a neutral site for those seeking to support others with similar views or interests. The company now insists that it will only allow people to gather on the site if it believes their views are true and correct. However, it was still surprising to see the site take down a fundraising account for litigation against vaccine mandates. The effort of former nurse Jennifer Bridges was simply to get such matters before the courts, which can be the ultimate authority on what is “misinformation.” GoFundMe however blocked people from contributing to the litigation.\n\nBridges is a former registered nurse at Houston Methodist hospital who was fired after refusing to comply with the hospital’s vaccine requirement. She raised more than $180,000 for her lawsuit before being shutdown under the company’s “misinformation” policy. Heidi Hagberg, a spokesperson for GoFundMe, said in a statement to Business Insider that “when our team initially reviewed the fundraiser, it was within our terms of service as the funds were for legal fees to fight vaccine mandates. The fundraiser has since been updated to include misinformation which violates our terms of service.”\n\nWhat is striking about this latest ban is that the courts are the place for such claims to be weighed in a neutral and dispassionate forum. “Misinformation” can be addressed by judges after both sides are allowed to present evidence. Bridges’ lawsuit was dismissed in June, Bridges’ attorneys appealed the decision. We should all favor such reviews. Indeed, if GoFundMe believes that Bridges is wrong, it should invite further judicial review to established a clear record on such issues.\n\nGoFundMe admits to have taken down “hundreds” of fundraisers that included statements of “misinformation related to vaccines.”\n\nI do not agree with the arguments against the vaccine. I and my family are vaccinated. However, I am equally concerned with avoiding the growing virus of censorship. In the last few years, we have seen an increasing call for private censorship from Democratic politicians and liberal commentators. Faculty and editors are now actively supporting modern versions of book-burning with blacklists and bans for those with opposing political views. The most chilling aspect of this story is how many on the left applaud such censorship. A new poll shows roughly half of the public supporting not just corporate censorship but government censorship of anything deemed “misinformation.”\n\nFree speech can be its own disinfectant for bad speech. GoFundMe is a private company and can impose such rules on users. However, it is an act of censorship and it is a denial of free speech by a corporation. In this case, the company is preventing its site from being used to raise money to allow courts to review the factual and legal basis for these claims — a curious effort for a company that claims to be fighting “misinformation.”", "opengraph": {"title": "GoFundMe takes down fundraising campaign for litigation over vaccine mandate", "type": "article", "url": "https://www.leftcult.com/2021-10-15-gofundme-takes-down-fundraising-campaign-vaccine-mandate-litigation.html", "site_name": "Left Cult Com", "description": "We previously discussed how GoFundMe has joined social media sites in censoring opposing viewpoints on subjects from critical race theory to vaccines to election fraud. The site once offered a neutral site for those seeking to support others with similar views or interests. The company now insists that it will only allow people to gather on the […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2021/10/Censorship-Computer-Handcuffs-Freedom-Internet.jpg"}, "tags": ["pandemic", "vaccine wars", "medical fascism", "GoFundMe", "Resist", "Censorship", "Suppressed", "vaccine mandates", "Leftist", "Medical Tyranny", "traitors", "freedom", "fundraising", "Government Slaves"], "tweets": [], "movies": [], "links": ["https://jonathanturley.org/2021/03/31/gofundme-shuts-down-fundraiser-of-parents-opposing-critical-race-theory-in-loudoun-county/", "https://jonathanturley.org/2021/10/12/go-fund-me-takes-down-fundraising-campaign-for-litigation-over-vaccine-mandate/", "https://www.businessinsider.com/gofundme-takes-down-fundraiser-for-anti-vaccine-mandate-lawsuit-2021-10", "https://abc13.com/houston-methodist-hospital-workers-suspended-covid19-vaccine-requirement-jennifer-bridges-lawsuit/10783881/", "https://jonathanturley.org/2021/01/22/why-burn-books-when-you-can-ban-them-writers-and-publishers-embrace-blacklisting-in-an-expanding-american-anti-free-speech-movement/", "https://jonathanturley.org/2021/08/20/the-new-censors-polls-shows-almost-half-of-americans-favor-the-government-censoring-misinformation/", "https://jonathanturley.org/2021/10/12/go-fund-me-takes-down-fundraising-campaign-for-litigation-over-vaccine-mandate/"], "authors": [], "publish_date": null}