{"result_id": "185039", "URL": "https://www.leftcult.com/2023-02-28-the-plan-to-wreck-america.html", "timestamp": "2023-04-25 16:13:01 CEST+0200", "meta": {"description": "In America, we have an oligarch problem, and it’s much bigger than the oligarch problem that Putin faced when he became president in 2000. The entire West is now in the grips of billionaire elites who have a stranglehold on the media, the political establishment and all of our important institutions. In recent years we have […]", "lang": "en", "keywords": "big government,chaos,Collapse,communism,conspiracy,deep state,domestic terrorism,enslaved,fascism,freedom,George Soros,globalists,great reset,left cult,obey,Orwellian,overlords,patriots,politics,Russia,Tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.leftcult.com/2023-02-28-the-plan-to-wreck-america.html", "encoding": "UTF-8"}, "image": null, "domain": "www.leftcult.com", "title": "The plan to wreck America", "cleaned_text": "In America, we have an oligarch problem, and it’s much bigger than the oligarch problem that Putin faced when he became president in 2000. The entire West is now in the grips of billionaire elites who have a stranglehold on the media, the political establishment and all of our important institutions. In recent years we have seen these oligarchs expand their influence from markets, finance and trade to politics, social issues and even public health. The impact this group has had on these other areas of interest, has been nothing short of breathtaking. Establishment elites and their media not only stood foursquare behind Russiagate, the Trump impeachment, the BLM riots and the January 6 fiasco, they also had a hand in the Covid hysteria and the host of repressive measures that were imposed in the name of public health. What we’d like to know is to what extent this group is actively involved in the shaping of other events that are aimed at transforming the American Republic into a more authoritarian system?\n\nIn other words, are the mandated injections, the forced lockdowns, the aggressive government-implemented censorship, the dubious presidential elections, the burning of food processing plants, the derailing of trains, the attacks on the power grid, the BLM-Antifa riots, the drag queen shows for schoolchildren, the maniacal focus on gender issues, and glitzy public show-trials merely random incidents occurring spontaneously during a period of great social change or are they, in fact, evidence of a stealthily orchestrated operation conducted by agents of the state acting on behalf of their elite benefactors? We already know that the FBI, the DOJ and the intel agencies were directly involved in Russiagate –which was a covert attack on the sitting president of the United States. So, the question is not “whether” these agencies are actively involved in other acts of treachery but, rather, to what extent these acts impact the lives or ordinary Americans, our politics and the country? But before we answer that question, take a look at this quote from from a recent interview by Colonel Douglas MacGregor:\n\nI was reading a document that was authored by George Soros over 10 years ago in which he talks specifically about this all-out war that would ultimately come against Russia because he said this ‘was the last nationalist state that rests on a foundation of orthodox christian culture with Russian identity at its core. That has to be removed. So I think that the people who are in charge in the west and the people in charge in Washington think they have successfully destroyed the identities of the European and American peoples, that we have no sense of ourselves, our borders are undefended, we present no resistance to the incoming migrants from the developing world who essentially roll over us as though we owe them a living and that our laws do not count. Thus, far I would say that is an accurate evaluation of what we’ve been doing. And I think that’s a great victory for George Soros and the globalists, the anti-nationalists; those who want open borders what they call it an “Open Society” because you end up with nothing, an amorphous mass of people struggling to survive who are reduced to the lowest levels of subsistence … (Soros) even goes so far as to talk about how useful it would be if it was east Europeans whose lives were expended in this process and not west Europeans who simply won’t take the casualties. This is not a minor matter. This is the kind of thinking that is so destructive and so evil, in my judgement, that that’s what we’re really dealing with in our own countries and I think Putin recognizes that.”\n\nThe reason I transcribed this comment from MacGregor was because it sums up the perceptions of a great many people who see things the same way. It expresses the hatred that globalist billionaires have toward Christians and patriots, both of which they see as obstacles to their goal of a borderless one-world government. MacGregor discusses this phenom in relation to Russia which Soros sees as “the last nationalist state that rests on a foundation of orthodox Christian culture with Russian identity at its core.” But the same rule could be applied to the January 6 protestors, could it not? Isn’t that the real reason the protestors were rounded up and thrown into the Washington gulag. After all, everyone knows there was no “insurrection” nor were there any “white supremacists”. The protestors were locked up because they’re nationalists (patriots) which are the natural enemy of the globalists. The MacGregor quote lays it out in black and white. Elites don’t believe that nationalists can be persuaded by propaganda,. They must be eradicated through incarceration or worse. Isn’t that the underlying message of January 6?\n\nThe other underlying message of January 6, is that ordinary people are no longer allowed to challenge the authority of the people in power. Again, political legitimacy in the US has always been determined by elections. What January 6 indicates, is that legitimacy no longer matters. What matters is power, and the person who can have you arrested for questioning his authority, has all the power he needs. Check out this excerpt from a post on Substack by political analyst Kurt Nimmo:\n\n“Klaus Schwab, a student of the war criminal Henry Kissinger, is a mentor to power-hungry and narcissistic sociopaths. The WEF “Great Reset” is designed to turn the world into an impoverished social concentration camp, where destitute serfs “own nothing” and this, in true Orwellian fashion, will set them free… I challenge people to investigate the WEF’s Global Redesign Initiative. According to the Transnational Institute in the Netherlands, this “initiative” proposes a transition away from intergovernmental decision-making towards a system of multi-stakeholder governance. In other words, by stealth, they are marginalizing a recognized model where we vote in governments who then negotiate treaties which are then ratified by our elected representatives with a model where a self-selected group of ‘stakeholders’ make decisions on our behalf. (Emphasis added.) In other words, large transnational corporate “stakeholders” will be deciding where you live, what you eat (insects and weeds), how you reproduce (or not reproduce; children produce carbon emissions), and what you can “rent” from them, or not be allowed to rent if you complain about an unelected globalist “economic” cartel driving humanity into serfdom, worldwide poverty, and depopulation.” (“WEF Calls for Destruction of America’s Middle Class“, Kurt Nimmo on Geopolitics)\n\nWhat Nimmo is saying is that these billionaire elites are now so powerful, that they can openly say they’re going to “transition away from intergovernmental decision-making” (ie– representative government”) to a system of “multi-stakeholder governance.” If I’m not mistaken, that is a pretty unambiguous declaration of a new form of supra-national government, in which only the billionaire stakeholders have a vote in what policies are implemented. But isn’t that the way things work already? On any number of topics from ESG, to digital currencies, to vaccine passports, to AI, to gain-of-function research, to 15-minute cities, to transhumanism, to war with Russia; the decisions are all being made by a handful of people of whom we know every little and who were never voted into office.\n\nAnd that brings us back to our original question: How many of these oddball events (in recent years) were conjured up and implemented by agents of the deep state to advance the elitist agenda?\n\nThis seem like an impossible question since it’s hard to find a link between these dramatically divers events. For example, what is the link between a Drag Queen Children’s Hour and, let’s say, firebombing a food processing plant in Oklahoma? Or the relentless political exploitation of gender issues and the January 6 public show trials? If there was a connection, we’d see it, right?\n\nNot necessarily, because the link might not have anything to do with the incident itself, but instead, with its impact on the people who experience it. In other words, all of these events could be aimed at generating fear, uncertainty, anxiety, alienation and even terror. Have the intelligence agencies launched such destabilizing operations before?\n\nIndeed, they have, many times. Here’s an excerpt from an article that will help you to see where I’m going with this. It’s from a piece at The Saker titled Operation Gladio: NATO’s Secret War for International Fascism.” See if you notice any similarities with the way things have been unfolding in America for the last few years:\n\nYves Guerin-Serac: the Black Ops Grandmaster behind Operation Gladio…. wrote the basic training and propaganda manuals which can be fairly described as the Gladio order of battle.”… Guerin-Serac was a war hero, agent provocateur, assassin, bomber, intelligence agent, Messianic Catholic, and the intellectual grandmaster behind the ‘Strategy of Tension’ essential to the success of Operation Gladio. Guerin-Serac published via Aginter Press the Gladio manual, including Our Political Activity in what can aptly be described as Gladio’s First Commandment: “Our belief is that the first phase of political activity ought to be to create the conditions favoring the installation of chaos in all of the regime’s structures…In our view the first move we should make is to destroy the structure of the democratic state under the cover of Communist and pro-Soviet activities…Moreover, we have people who have infiltrated these groups.” “Two forms of terrorism can provoke such a situation [breakdown of the state]: blind terrorism (committing massacres indiscriminately which cause a large number of victims), and selective terrorism (eliminate chosen persons)… This destruction of the state must be carried out under the cover of ‘communist activities.’ After that, we must intervene at the heart of the military, the juridical power and the church, in order to influence popular opinion, suggest a solution, and clearly demonstrate the weakness of the present legal apparatus. Popular opinion must be polarized in such a way, that we are being presented as the only instrument capable of saving the nation.” Anarchic random violence was to be the solution to bring about such a state of instability thus allowing for a completely new system, a global authoritarian order. Yves Guerin-Serac, who was an open fascist, would not be the first to use false-flag tactics that were blamed on communists and used to justify more stringent police and military control from the state….” (“Operation Gladio: NATO’s Secret War for International Facism”, The Saker)\n\nRepeat: the first phase of political activity ought to be to create the conditions favoring the installation of chaos in all of the regime’s structures… This destruction of the state must be carried out under the cover of (communist) activities…. Popular opinion must be polarized in such a way, that we are being presented as the only instrument capable of saving the nation.”\n\nIn other words, the objective of the operation is to completely disrupt all social relations and interaction, cultivate feelings of uncertainty, polarization and terror, find a group that can be scapegoated for the wide societal collapse, and, then, present yourself (elites) as the best choice for restoring order.\n\nIs this what’s going on?\n\nIt’s very possible. It could all be part of a Grand Strategy aimed at “wiping the slate clean” in order to “transition away from intergovernmental decision-making” to a system of “multi-stakeholder governance.”\n\nThat could explain why there has been such a vicious and sustained attack on our history, culture, traditions, religious beliefs, monuments, heroes, and founders. They want to replace our idealism with feelings of shame, humiliation and guilt. They want to erase our past, our collective values, our heritage, our commitment to personal freedom, and the very idea of America itself. They want to raze everything to the ground and start over. That is their basic Gameplan writ large.\n\nThe destruction of the state is being carried out behind the cover of seemingly random events that are spreading chaos, exacerbating political divisions, increasing the incidents of public mayhem, and clearing the way for a violent restructuring of the government.\n\nThey can’t build a new world order until the old one is destroyed.", "opengraph": {"title": "The plan to wreck America", "type": "article", "url": "https://www.leftcult.com/2023-02-28-the-plan-to-wreck-america.html", "site_name": "Left Cult Com", "description": "In America, we have an oligarch problem, and it’s much bigger than the oligarch problem that Putin faced when he became president in 2000. The entire West is now in the grips of billionaire elites who have a stranglehold on the media, the political establishment and all of our important institutions. In recent years we have […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2023/02/American-Flag-Protests-Riots-Fire-Explosion.jpg"}, "tags": ["conspiracy", "big government", "great reset", "deep state", "left cult", "overlords", "chaos", "communism", "globalists", "obey", "George Soros", "enslaved", "Russia", "domestic terrorism", "politics", "Tyranny", "patriots", "fascism", "Orwellian", "Collapse", "freedom"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "400", "height": "225", "embed_code": "<iframe src=\"//www.youtube.com/embed/3yGozTWRqLk?enablejsapi=1&amp;autoplay=0&amp;autohide=2&amp;theme=darl&amp;color=red&amp;controls=1\" width=\"400\" height=\"225\" allowfullscreen=\"allowfullscreen\" data-origwidth=\"800\" data-origheight=\"450\"></iframe>", "src": "//www.youtube.com/embed/3yGozTWRqLk?enablejsapi=1&autoplay=0&autohide=2&theme=darl&color=red&controls=1"}], "links": ["https://www.unz.com/mwhitney/the-plan-to-wreck-america/", "https://kurtnimmo.substack.com/p/wef-calls-for-destruction-of-americas", "http://thesaker.is/operation-gladio-natos-secret-war-for-international-fascism/", "https://www.unz.com/mwhitney/the-plan-to-wreck-america/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2023-02-28-the-plan-to-wreck-america.html&linkname=The%20plan%20to%20wreck%20America", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}