{"result_id": "185023", "URL": "https://leftcult.com/2023-03-28-state-financial-officials-demand-jpmorgan-end-woke-banking.html", "timestamp": "2023-04-25 16:12:57 CEST+0200", "meta": {"description": "A group of fourteen state financial officers wrote a letter to the CEO of JPMorgan Chase, urging the company to discontinue what appears to be “politically motivated” de-banking practices against certain industries, individuals, and groups. The letter comes on the heels of institutions like Silicon Valley Bank collapsing in recent weeks after taking up “woke” […]", "lang": "en", "keywords": "bank collapse,biased,big government,Bubble,Collapse,conspiracy,de-banking,fascism,finance riot,financial officials,investors,JPMorgan Chase,left cult,left-wing politics,money supply,politically motivated banking,profits,risk,shareholders,Tyranny,woke,woke banking", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2023-03-28-state-financial-officials-demand-jpmorgan-end-woke-banking.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "State financial officials demand JPMorgan Chase end woke banking practices that are leading to collapses", "cleaned_text": "State financial officials demand JPMorgan Chase end woke banking practices that are leading to collapses\n\nA group of fourteen state financial officers wrote a letter to the CEO of JPMorgan Chase, urging the company to discontinue what appears to be “politically motivated” de-banking practices against certain industries, individuals, and groups.\n\nThe letter comes on the heels of institutions like Silicon Valley Bank collapsing in recent weeks after taking up “woke” left-wing banking and investment strategies that focus on ideology instead of traditional financial objectives like growing stock prices and increasing profits for shareholders.\n\n“We urge Chase to immediately take steps to identify and address internal drivers of political or anti-religious bias that could undermine its fiduciary obligations and impair the freedom of its customers to access financial services without fear of discrimination,” the group wrote, according to Breitbart News.\n\nIn the letter, the state financial officers acknowledged that the bank remains a member of the Net-Zero Banking Alliance (NZBA), a coalition of banks that have pledged to significantly decrease their carbon financing and investment activities. However, the officials also noted that the bank’s CEO, Jamie Dimon, testified before Congress recently and stated that divesting from fossil fuels would lead America down a “road to hell.”\n\n“The bank’s apparent move to discriminate against politically disfavored industries is spilling over into its other activities. Recently, Chase closed the National Committee for Religious Freedom’s (NCRF) account without explanation. After repeated requests to reinstate the account, Chase informed NCRF that it would only consider doing so if the non-profit agreed to disclose detailed information about its donors and the criteria used to decide which political candidates it supports,” the letter noted, adding:\n\nThis is not the first time Chase has engaged in questionable incidents of de-banking. In 2021, WePay, a subsidiary of Chase, denied ticket payment processing services for a mainstream republican event hosted by the non-profit, Defense of Liberty. As justification, WePay cited a policy that barred payment processing services in connection with “hate . . . racial intolerance . . . or items or activities that encourage, promote, facilitate, or instruct others regarding the same.” Such vague and ambiguous terms can easily be used to hide viewpoint-based discrimination.\n\nThere are other similar cancellation incidents that raise the specter of viewpoint bias. In 2021, Chase cancelled a credit card account connected to former general Michael Flynn for questionable reasons. That same year, Chase terminated the Arkansas Family Council’s account because the organization was deemed “High Risk,” even though they had done business with the bank for over two years.\n\nThe state financial officers also said they are “concerned” about the bank’s recent pattern of “apparent politically motivated de-banking,” which they say is likely a violation of the bank’s fiduciary duty due to it “sacrificing profitable investment opportunities (e.g., fossil fuels) for political reasons.”\n\n“In addition to sacrificing profitable investment opportunities (e.g., fossil fuels) for political reasons, the appearance of politicized de-banking harms the company’s reputation with its customers. The freedom to bank and access financial services without fear of viewpoint-based discrimination is fundamental to maintaining the trust of people and institutions in a diverse and pluralistic society. The public backlash against Chase’s questionable moves indicates growing public distrust of the company and invites heightened regulatory scrutiny that could substantially impact its financial performance,” the letter said.\n\nThe officials say they want Chase to take immediate steps to identify and stop the “internal drivers of political or anti-religious bias” that could “undermine its fiduciary obligations and impair the freedom of its customers to access financial services without fear of discrimination based on their political or religious views.”\n\nAs noted by Breitbart, the letter was signed by various state financial officers, including Nebraska Treasurer John Murante, Alaska Commissioner of Revenue Adam Crum, Arkansas Auditor Dennis Milligan, Idaho Treasurer Julie Ellsworth, Indiana Treasurer Dan Elliott, Kansas Treasurer Steven Johnson, Mississippi Treasurer David McRae, Missouri Auditor Scott Fitzpatrick, Missouri Treasurer Vivek Malek, Nevada Controller Andy Matthews, North Dakota Treasurer Thomas Beadle, Oklahoma Treasurer Todd Russ, South Carolina Treasurer Curtis M. Loftis Jr., and Utah Treasurer Marlo Oaks.", "opengraph": {"title": "State financial officials demand JPMorgan Chase end woke banking practices that are leading to collapses", "type": "article", "url": "https://www.leftcult.com/2023-03-28-state-financial-officials-demand-jpmorgan-end-woke-banking.html", "site_name": "Left Cult Com", "description": "A group of fourteen state financial officers wrote a letter to the CEO of JPMorgan Chase, urging the company to discontinue what appears to be “politically motivated” de-banking practices against certain industries, individuals, and groups. The letter comes on the heels of institutions like Silicon Valley Bank collapsing in recent weeks after taking up “woke” […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2023/03/chase.png"}, "tags": ["woke banking", "conspiracy", "big government", "bank collapse", "de-banking", "left cult", "financial officials", "JPMorgan Chase", "biased", "money supply", "profits", "politically motivated banking", "Bubble", "finance riot", "woke", "Tyranny", "shareholders", "fascism", "investors", "Collapse", "left-wing politics", "risk"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2023-03-27-moodys-economist-warns-things-break-financial-system.html", "https://www.breitbart.com/economy/2023/03/24/state-financial-officers-demand-chase-stop-politically-motivated-de-banking/", "http://fascism.news", "https://www.breitbart.com/economy/2023/03/24/state-financial-officers-demand-chase-stop-politically-motivated-de-banking/", "https://www.naturalnews.com/2023-03-27-moodys-economist-warns-things-break-financial-system.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2023-03-28-state-financial-officials-demand-jpmorgan-end-woke-banking.html&linkname=State%20financial%20officials%20demand%20JPMorgan%20Chase%20end%20woke%20banking%20practices%20that%20are%20leading%20to%20collapses", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}