{"result_id": "185034", "URL": "https://leftcult.com/2021-10-03-nyc-vaccine-mandate-racist.html", "timestamp": "2023-04-25 16:13:00 CEST+0200", "meta": {"description": "A leader of the greater New York chapter of Black Lives Matter has slammed the city’s mayor, Bill de Blasio, over his vaccine mandate, which she says is “racist and specifically targets black New Yorkers” as a disproportionate percentage of the unvaccinated in America are black. Chivona Newsome, who is a co-founder of the chapter […]", "lang": "en", "keywords": "Bill de Blasio,Black Lives Matter,COVID-19 vaccine,discrimination,medical fascism,Medical Tyranny,NYC,obey,race wars,racism,vaccine mandate,vaccine mandates,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2021-10-03-nyc-vaccine-mandate-racist.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "BLM leader says NYC vaccine mandate is racist, likens it to “modern-day freedom papers”", "cleaned_text": "BLM leader says NYC vaccine mandate is racist, likens it to “modern-day freedom papers”\n\nA leader of the greater New York chapter of Black Lives Matter has slammed the city’s mayor, Bill de Blasio, over his vaccine mandate, which she says is “racist and specifically targets black New Yorkers” as a disproportionate percentage of the unvaccinated in America are black.\n\nChivona Newsome, who is a co-founder of the chapter and ran for the congressional seat in New York’s 15th district in last year’s election, took the mayor to task for the mandate. She told Fox News that De Blasio is aware that people of African descent have a general hesitancy and distrust when it comes to vaccination as well as their interactions with law enforcement and the government yet he “chose to disenfranchise and force the very people who elected him into poverty and second-class citizenship.”\n\nShe believes that the vaccine mandates are infringing on the black community’s civil liberties. It’s not just about being unable to go out to eat or enjoy the city’s entertainment; she says it will lead to a loss of income as black healthcare workers and educators in the state who don’t get the jab will lose their jobs as of September 27.\n\nOn the deadline for healthcare workers to have received at least one dose of the vaccine yesterday, New York hospitals began firing or suspending those who did not comply with the state’s order. This has led to staff shortages and the postponement of elective surgeries in some hospitals.\n\nShe also told the outlet: “The vaccination passports are modern-day Freedom Papers, which limit the free will of Black people.”\n\nWhile black citizens account for nearly 18 percent of the population of New York State, they only make up 14 percent of the state’s vaccinated individuals. This is a ratio not seen in any other group. Compare this to the figure for white citizens, who account for 69.9% of New York’s population and 69 percent of its vaccinated individuals. Hispanics, meanwhile, make up 19.3% of New York’s population and 20.9% of its vaccination share. Asian New Yorkers make up just 9 percent of the state’s overall population yet they account for 15% of its total vaccination share.\n\nNewsome said that she feels it is the duty of Black Lives Matter’s Greater New York chapter to fight for black people’s liberty and to demonstrate until it abolishes the vaccine mandate. She added that the requirements for mask wearing and social distancing have caused black New Yorkers to be “brutalized and arrested.”\n\nThe controversial mandate, which went into effect the week of September 13, ordered all indoor establishments in the state to require proof of vaccination before patrons can enter. It also requires the employees at certain establishments to furnish vaccination proof. Those that fail to comply with the order will face fines of up to $5000; 3,200 businesses were issued warnings after the first week of the mandate for failure to comply.\n\nThis is having the effect of prohibiting unvaccinated people, many of whom are black, from taking part in society. De Blasio himself said in announcing his mandate: “If you’re unvaccinated, unfortunately, you will not be able to participate in many things.”\n\nAs Natural News has reported extensively, black Americans have long been targeted by much of the medical experimentation that goes on in our country for public health purposes, and past vaccines have been statistically more damaging to blacks than other races. It’s a global problem; some vaccines administered to African women have even been found to be spiked with infertility chemicals.\n\nTheir hesitation is not unreasonable, nor is their feeling that these mandates will exclude them from society. Black Lives Matter has harmed our country in many ways, but Newsome is not wrong in calling attention to the racial element of New York City’s vaccine mandate.", "opengraph": {"title": "BLM leader says NYC vaccine mandate is racist, likens it to “modern-day freedom papers”", "type": "article", "url": "https://www.leftcult.com/2021-10-03-nyc-vaccine-mandate-racist.html", "site_name": "Left Cult Com", "description": "A leader of the greater New York chapter of Black Lives Matter has slammed the city’s mayor, Bill de Blasio, over his vaccine mandate, which she says is “racist and specifically targets black New Yorkers” as a disproportionate percentage of the unvaccinated in America are black. Chivona Newsome, who is a co-founder of the chapter […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2021/10/Immunity-Vaccine-Passport-Phone-App-1.jpeg"}, "tags": ["medical fascism", "racism", "COVID-19 vaccine", "Bill de Blasio", "vaccine mandate", "Medical Tyranny", "vaccine mandates", "vaccines", "Black Lives Matter", "obey", "discrimination", "NYC", "race wars"], "tweets": [], "movies": [], "links": ["https://www.infowars.com/posts/ny-blm-leader-de-blasios-vaccine-mandate-is-racist-and-specifically-targets-black-new-yorkers/", "https://www.foxnews.com/politics/black-lives-matter-leader-calls-nyc-vaccine-mandate-modern-day-freedom-papers", "https://www.naturalnews.com/2018-02-13-vaccines-target-blacks-depopulation-science-paper-infertility-chemical-african-women.html", "https://vaccines.news/", "https://www.infowars.com/posts/ny-blm-leader-de-blasios-vaccine-mandate-is-racist-and-specifically-targets-black-new-yorkers/", "https://www.foxnews.com/politics/black-lives-matter-leader-calls-nyc-vaccine-mandate-modern-day-freedom-papers"], "authors": [], "publish_date": null}