{"result_id": "185030", "URL": "https://leftcult.com/2022-04-14-midterms-on-horizon-democrat-politicians-have-covid-preparing-mail-in-ballots.html", "timestamp": "2023-04-25 16:12:59 CEST+0200", "meta": {"description": "Blame it on partying and voting. Within a week, nearly a dozen House Democrats claim they tested positive for Wuhan Flu after they sat around boozing together mask-less while talking political strategies for the upcoming midterm elections. The rest claim they caught the scamdemic disease while “late night” voting for their next spending (money-laundering) bill. It’s […]", "lang": "en", "keywords": "covid tests,dc elites,democrats covid,election fraud,false-flag,hoax,House Democrats,Midterm elections,midterms,pcr fake,pelosi covid,Plandemic,politics,propaganda,scamdemic,vote fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2022-04-14-midterms-on-horizon-democrat-politicians-have-covid-preparing-mail-in-ballots.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "With midterms on the horizon, several Democrat politicians suddenly have COVID in preparation for promoting MAIL-IN BALLOTS", "cleaned_text": "With midterms on the horizon, several Democrat politicians suddenly have COVID in preparation for promoting MAIL-IN BALLOTS\n\nBlame it on partying and voting. Within a week, nearly a dozen House Democrats claim they tested positive for Wuhan Flu after they sat around boozing together mask-less while talking political strategies for the upcoming midterm elections. The rest claim they caught the scamdemic disease while “late night” voting for their next spending (money-laundering) bill. It’s all just part of their push for midterm mail-in ballots, so their cohorts can have even the slightest chance of victory, after these last couple years of their absolute dismal performance.\n\nSure, knock back some whiskey sours and come up with a corrupt plan to steal the mid-term elections, maybe by leading by example? See, the lesson is… if you go out and party and vote while drunk, you’ll catch a death of a cold… COVID-19 that is. Didn’t all of these House Democrats swear up and down they got vaccinated? They sure do have some explaining to do.\n\nPolitical STUNT? Nine House Democrats test positive for COVID at virtually the same time as we turn the corner towards mid-term elections\n\nOh, they are hurting, and not from COVID. Every scamdemic protocol that the Democrats pushed has turned into epic failure, including quarantines, lockdowns, social distancing, masks and especially the beloved clot shots. The economy is in the crapper. Millions have lost their jobs due to force-vaccination mandates. Inflation is skyrocketing daily. So what do House Democrats do about it? They party in Philadelphia at a “retreat” where the party favors must have been PCR-test kits.\n\nOther “Hypocrites of the House” spent hours this same week on the floor maskless while voting for their latest money-laundering spending Bill, after preaching to Americans to never take off their masks, even indoors, and be sure to get “fully vaccinated” for COVID, including every booster “recommended” by the CDC. Then they all got on buses and headed to a big party. Surely they weren’t wearing masks on the bus either.\n\nIt’s all just smoke and mirrors, like a David Copperfield show. An act. A staged event where a bunch of House Hypocrites “catch deadly COVID” while voting mask-less, to convince the populace they should stay home and vote from there, where it’s safe, and then just head to the “drop boxes” with their crates full of votes late at night, when nobody is around to spread the Wuhan Flu (or catch them in the act).\n\nThe scamdemic rages on… even Kamala “Bad Knees” Harris claims her husband caught Wuhan Flu at the retreat\n\nDemocrats want to scare the public just enough to vie for mail-in ballots for every election, but not frustrate everyone too much with other mandates that might ruin Democrat votes for midterms. Surely, after the elections, should they win, every mandate will be put back in place, strictly again, with no exceptions (while the politicians continue to party mask-less).\n\nThough fully-vaccinated lawmakers are NOT required to wear a mask, they all seem to be catching COVID anyway, according to their own stories published all over mainstream media. What does that say about the “efficacy” of the so-called “vaccines?” Sounds like if you get the COVID jabs you should be REQUIRED to wear your mask at all times, if we’re using real-life situations as proof of the need for precautionary measures.\n\nWho says they have COVID from partying and/or late night voting at the House of Horrors? Nancy “Dominion” Pelosi, Representative Madeleine Dean of Pennsylvania, Gerald E. Connolly of Virginia, Peter Welch of Vermont, Zoe Lofgren of California, Kim Schrier of Washington, Rosa DeLauro of Connecticut, Jared Golden of Maine, Joe Neguse of Colorado, and Andy Kim of New Jersey. All of this, somehow, within one hour.\n\nNobody is sure how many shots of tequila were swallowed before, during and after the rapid antigen tests the reps took in their hotel rooms. Resident Biden also attended the “retreat,” but he somehow tested negative (only three percent of people who take the PCR tests, whether healthy or not, test negative). Jen “illogical” Psaki said EVERY representative at the retreat had been vaccinated. So much for herd theory, huh?\n\nThis is a huge reminder, if true, that the COVID vaccines do not work at all. The DC elites think they can pull the wool over everyone’s eyes, and these staged events are not helping them gain votes for the midterms. Either way, they lose big.\n\nTune your internet to Censored.news for huge swaths of truth news about the upcoming midterms that’s being censored from the rest of media as you read this.", "opengraph": {"title": "With midterms on the horizon, several Democrat politicians suddenly have COVID in preparation for promoting MAIL-IN BALLOTS", "type": "article", "url": "https://www.leftcult.com/2022-04-14-midterms-on-horizon-democrat-politicians-have-covid-preparing-mail-in-ballots.html", "site_name": "Left Cult Com", "description": "Blame it on partying and voting. Within a week, nearly a dozen House Democrats claim they tested positive for Wuhan Flu after they sat around boozing together mask-less while talking political strategies for the upcoming midterm elections. The rest claim they caught the scamdemic disease while “late night” voting for their next spending (money-laundering) bill. It’s […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2022/04/Coronavirus-America-New-York-Statue-of-Liberty-Mask.jpg"}, "tags": ["dc elites", "false-flag", "vote fraud", "House Democrats", "hoax", "midterms", "politics", "covid tests", "election fraud", "Midterm elections", "pelosi covid", "scamdemic", "democrats covid", "Plandemic", "propaganda", "pcr fake"], "tweets": [], "movies": [], "links": ["https://www.reuters.com/world/us/us-house-speaker-pelosi-tests-positive-covid-spokesman-2022-04-07/", "https://www.thegatewaypundit.com/2022/04/covid-19-outbreak-hits-dc-elites-72-high-profile-personalities-tests-positive-attending-gridiron-dinner/", "https://www.axios.com/democrat-positive-covid-retreat-26237fe1-13b2-4e35-9ad6-f9ea93d10b94.html", "https://twitter.com/RepDean/status/1503372621295104001", "https://twitter.com/GerryConnolly/status/1502335394045648905", "https://twitter.com/PeterWelch/status/1503522618330202120", "https://twitter.com/RepZoeLofgren/status/1503070222927998977", "https://twitter.com/RepKimSchrier/status/1503132951940419594", "https://twitter.com/rosadelauro/status/1502721527753715733", "https://twitter.com/RepGolden/status/1503749134913884171", "https://twitter.com/JoeNeguse/status/1503737862688178182", "https://twitter.com/AndyKimNJ/status/1503733008305725440", "https://www.censored.news/", "https://www.naturalnews.com/2022-01-02-what-dr-robert-malone-could-not-tell-joe-rogan.html", "https://www.thegatewaypundit.com/2022/04/covid-19-outbreak-hits-dc-elites-72-high-profile-personalities-tests-positive-attending-gridiron-dinner/", "https://www.reuters.com/world/us/us-house-speaker-pelosi-tests-positive-covid-spokesman-2022-04-07/", "https://www.axios.com/democrat-positive-covid-retreat-26237fe1-13b2-4e35-9ad6-f9ea93d10b94.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2022-04-14-midterms-on-horizon-democrat-politicians-have-covid-preparing-mail-in-ballots.html&linkname=With%20midterms%20on%20the%20horizon%2C%20several%20Democrat%20politicians%20suddenly%20have%20COVID%20in%20preparation%20for%20promoting%20MAIL-IN%20BALLOTS", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}