{"result_id": "185022", "URL": "https://www.leftcult.com/2019-02-26-civil-discourse-is-over-in-america-vote-and-buy-guns.html", "timestamp": "2023-04-25 16:12:57 CEST+0200", "meta": {"description": "There are a lot of political pundits on cable TV who are very animated and prone to hyperbole in order to make their points but former federal prosecutor Joe diGenova isn’t one of them. A current practicing attorney and frequent critic of special counsel Robert Mueller’s “witch hunt” investigation of POTUS Donald Trump, diGenova is […]", "lang": "en", "keywords": "biased,chaos,civil discourse,civil war,civility,Collapse,conflict,Democratic protectors,distraction,enemy of the people,fake news,hate crimes,intolerance,joe digenova,Laura Ingraham,left cult,lies,lunatics,mainstream media,preparedness,propaganda,Republican hate,revolt,survival,Trump hate,violence,vote", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.leftcult.com/2019-02-26-civil-discourse-is-over-in-america-vote-and-buy-guns.html", "encoding": "UTF-8"}, "image": null, "domain": "www.leftcult.com", "title": "The possibility for civil discourse is OVER in America… “vote and buy guns” says former federal prosecutor, because the Left has gone lawless", "cleaned_text": "The possibility for civil discourse is OVER in America… “vote and buy guns” says former federal prosecutor, because the Left has gone lawless\n\nThere are a lot of political pundits on cable TV who are very animated and prone to hyperbole in order to make their points but former federal prosecutor Joe diGenova isn’t one of them.\n\nA current practicing attorney and frequent critic of special counsel Robert Mueller’s “witch hunt” investigation of POTUS Donald Trump, diGenova is a ‘tell it like it is’ kind of guy. Not only is he knowledgeable of government processes and the inner workings of the Justice Department, but he’s also an articulate and effective defender of due process and equal treatment under the law.\n\nWith that in mind, what he said this week during an appearance on Fox News host Laura Ingraham’s podcast should jolt Americans to their core and make all of us — regardless of political party affiliation — take stock of just how badly our institutions have been corrupted to the point where none of us is safe.\n\nThe two were discussing how the Left-wing media and Democrats have mastered the “art of deflection” — that is, the ability to refocus the country’s attention away from an issue that is harmful to them politically and on o one that is advantageous to them.\n\nOne of the most recent examples is the mainstream media (MSM) ignoring a story involving Ralph Northam, the Democratic governor of Virginia, who was exposed recently for posting a photo in his medical school yearbook featuring one person in blackface and another wearing a KKK hood and robe (Northam has not said which one was him and in fact has denied that either of the people in the photo was of him — and the media isn’t asking).\n\nMeanwhile, another Virginia Democratic leader, Lt. Gov. Justin Fairfax, who is black, was credibly accused by two women of sexual harassment. When female accusers were pointing their fingers at now-Justice Brett Kavanaugh, the MSM was wall-to-wall with the story, the accusations, and the condemnation (sans proof).\n\nAfter perfunctory outrage by some in the media and the Democratic Party, both stories have now essentially died. All Northam had to do was “wait it out,” Ingraham said, long enough for the MSM to move on to something else that is less damaging to their preferred political party. (Related: Fake HATE goes hand in hand with fake NEWS, and it’s all enforced by the censorship of the tech giants.)\n\nThe media are driving our division and hate\n\nThe ‘deflection’ came when “Empire” actor Jussie Smollett’s story broke. The MSM and Democrats quickly leaped on Smollett’s bandwagon, claiming that real racism and hate exists among POTUS Donald Trump supporters; never mind that within days Smollett’s story fell apart and he’s now been accused by Chicago PD of staging a hate crime hoax.\n\nWhen Smollett’s story turned out to be a nothing burger, the MSM deflected again, picking up on another aspect of “Trump/Republican hate” — a radicalized Coast Guard officer who bought a bunch of guns and ammo and devised a “target list” of Democrats and Leftist media types.\n\nBut always Democrats and their MSM lackeys are hating on Republicans, and especially POTUS Trump, is the point; the media never focus for very long when Democrats are exposed as the anti-American haters they are.\n\n“There’s two standards of justice, one for Democrats one for Republicans,” the outspoken diGenova told Ingraham.\n\nThe press is all Democrat, all liberal, all progressive, all Left – they hate Republicans, they hate Trump. So the suggestion that there’s ever going to be civil discourse in this country for the foreseeable future in this country is over. It’s not going to be. It’s going to be total war. And as I say to my friends, I do two things – I vote and I buy guns.\n\nTranslation: The media is feeding our national discourse and division and will be the primary catalyst for our next civil war.\n\nSee more stories on this issue at Revolt.news.", "opengraph": {"title": "The possibility for civil discourse is OVER in America… “vote and buy guns” says former federal prosecutor, because the Left has gone lawless", "type": "article", "url": "https://www.leftcult.com/2019-02-26-civil-discourse-is-over-in-america-vote-and-buy-guns.html", "site_name": "Left Cult Com", "description": "There are a lot of political pundits on cable TV who are very animated and prone to hyperbole in order to make their points but former federal prosecutor Joe diGenova isn’t one of them. A current practicing attorney and frequent critic of special counsel Robert Mueller’s “witch hunt” investigation of POTUS Donald Trump, diGenova is […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2019/02/joe-digenova-purple.jpg"}, "tags": ["Trump hate", "left cult", "lunatics", "lies", "biased", "civil war", "chaos", "Laura Ingraham", "survival", "vote", "intolerance", "preparedness", "joe digenova", "propaganda", "fake news", "Democratic protectors", "mainstream media", "conflict", "hate crimes", "Republican hate", "civility", "Collapse", "revolt", "distraction", "violence", "civil discourse", "enemy of the people"], "tweets": [], "movies": [], "links": ["https://thenationalsentinel.com/2019/02/26/former-fed-prosecutor-joe-digenova-says-were-in-a-civil-war-i-buy-guns/", "https://www.newstarget.com/2019-02-01-virginia-gov-ralph-infanticide-northams-med-school-yearbook-features-photo-with-him-wearing-either-blackface-or-a-kkk-hood.html", "https://www.naturalnews.com/2019-02-09-washington-post-buries-story-about-sexual-assault-claim-against-virginia-democrat.html", "http://newsfakes.com/2019-02-20-fake-hate-goes-hand-in-hand-with-fake-news-censorship-tech-giants.html", "https://www.nbcnews.com/news/military/coast-guard-officer-wanted-kill-democrats-msnbc-hosts-say-prosecutors-n973786", "http://www.revolt.news", "https://www.newstarget.com/2019-02-01-virginia-gov-ralph-infanticide-northams-med-school-yearbook-features-photo-with-him-wearing-either-blackface-or-a-kkk-hood.html", "https://www.naturalnews.com/2019-02-09-washington-post-buries-story-about-sexual-assault-claim-against-virginia-democrat.html", "https://thenationalsentinel.com/2019/02/26/former-fed-prosecutor-joe-digenova-says-were-in-a-civil-war-i-buy-guns/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2019-02-26-civil-discourse-is-over-in-america-vote-and-buy-guns.html&linkname=The%20possibility%20for%20civil%20discourse%20is%20OVER%20in%20America%E2%80%A6%20%E2%80%9Cvote%20and%20buy%20guns%E2%80%9D%20says%20former%20federal%20prosecutor%2C%20because%20the%20Left%20has%20gone%20lawless", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}