{"result_id": "185038", "URL": "https://leftcult.com/2022-11-02-dhs-treasonous-collusion-twitter-facebook-censor-americans.html", "timestamp": "2023-04-25 16:13:01 CEST+0200", "meta": {"description": "Newly leaked documents show that the U.S. Department of Homeland Security (DHS) regularly met with executives from Facebook and Twitter to conjure up new ways to censor critical and damning information on social media. The Intercept is credited with obtaining the leaks, as is Missouri Attorney General Eric Schmitt, who recently filed a lawsuit against […]", "lang": "en", "keywords": "big government,Big Tech,Censorship,Collusion,conspiracy,corruption,deception,deep state,Department of Homeland Security,DHS,Elon Musk,Facebook,First Amendment,Glitch,globalist narrative,Jack Dorsey,mark zuckerberg,media fact watch,meta tyranny,misinformation,pandemic,propaganda,Social media,treason,Twitter", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2022-11-02-dhs-treasonous-collusion-twitter-facebook-censor-americans.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "DHS engaged in treasonous collusion with Twitter and Facebook to censor Americans, bombshell report reveals", "cleaned_text": "DHS engaged in treasonous collusion with Twitter and Facebook to censor Americans, bombshell report reveals\n\nNewly leaked documents show that the U.S. Department of Homeland Security (DHS) regularly met with executives from Facebook and Twitter to conjure up new ways to censor critical and damning information on social media.\n\nThe Intercept is credited with obtaining the leaks, as is Missouri Attorney General Eric Schmitt, who recently filed a lawsuit against the Biden regime for engaging in criminal collusion with Big Tech to suppress the First Amendment rights of Americans.\n\nTwitter’s Vijaya Gadde, who was recently fired by Elon Musk, participated in these discussions between DHS and Big Tech, which dealt with topics beyond just the Wuhan coronavirus (Covid-19). We now know that there were efforts to control the narratives surrounding United States withdrawal from Afghanistan, as well as “racial justice” issues stemming from the George Floyd false flag incident.\n\nThe leaked materials show that specifically with regard to the Fauci Flu, DHS honed in on stopping “misinformation” surrounding “the origins of the COVID-19 pandemic and the efficacy of COVID-19 vaccines, racial justice, U.S. withdrawal from Afghanistan, and the nature of U.S. support to Ukraine.”\n\n“Facebook and Twitter created special portals for the government to rapidly request takedowns of content,” tweeted The Intercept‘s Lee Fang.\n\n“The portals, along with NGO partners used to censor a wide range of content, including obvious parody accounts and content disagreeing w gov pandemic policy.” (Related: Facebook and Twitter also took cash in exchange for protecting Hunter “crackhead” Biden and the rest of the Biden Crime Family from public scrutiny.)\n\nMicrosoft executive said social media platforms “have got to get comfortable with gov’t”\n\nPrivate text messages between tech executives and DHS officials were also leaked, one of them showing an executive at Microsoft stating that social media and other tech platforms “have got to get comfortable with gov’t.”\n\nThe implication, of course, is that so-called “private” tech companies are now an extension of the government, and that they must get used to this fascism as the new normal.\n\nOne of the worst offenders that we know of in all this is Facebook, which actually created an official process for the government itself to flag “misinformation” on the platform. Here is how it is described by The Intercept:\n\n“There is also a formalized process for government officials to directly flag content on Facebook or Instagram and request that it be throttled or suppressed through a special Facebook portal that requires a government or law enforcement email to use. At the time of writing, the ‘content request system’ at facebook.com/xtakedowns/login is still live. DHS and Meta, the parent company of Facebook, did not respond to a request for comment. The FBI declined to comment.”\n\nKate Starbird, the infamous leftist professor who leads the “Election Integrity Partnership,” a group devoted to ensuring that Democrats always “win,” also reportedly participated in these shady talks between Big Tech and DHS.\n\nStarbird played a critical role in drafting a report for the CISA director calling for the creation of an expansive new role for DHS in patrolling and policing the “information ecosystem.” That report called for close monitoring of:\n\n“… social media platforms of all sizes, mainstream media, cable news, hyper partisan media, talk radio and other online resources.”\n\nThe report also called for DHS to intervene immediately to stop the “spread of false and misleading information” online, including anything deemed to be a threat to “key democratic institutions, such as the courts, or by other sectors such as the financial system, or public health measures.”\n\nBe sure to check out the full report from The Intercept to learn more.\n\nInterested in learning more about Big Tech collusion and criminality? Visit TechGiants.news.", "opengraph": {"title": "DHS engaged in treasonous collusion with Twitter and Facebook to censor Americans, bombshell report reveals", "type": "article", "url": "https://www.leftcult.com/2022-11-02-dhs-treasonous-collusion-twitter-facebook-censor-americans.html", "site_name": "Left Cult Com", "description": "Newly leaked documents show that the U.S. Department of Homeland Security (DHS) regularly met with executives from Facebook and Twitter to conjure up new ways to censor critical and damning information on social media. The Intercept is credited with obtaining the leaks, as is Missouri Attorney General Eric Schmitt, who recently filed a lawsuit against […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2022/11/Censored-Twitter-Tablet-Computer.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "Elon Musk", "deep state", "deception", "corruption", "Twitter", "Jack Dorsey", "First Amendment", "media fact watch", "Big Tech", "meta tyranny", "misinformation", "propaganda", "treason", "mark zuckerberg", "Department of Homeland Security", "Social media", "DHS", "Facebook", "Glitch", "Censorship", "Collusion", "globalist narrative"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/tech/2022/10/31/report-twitter-and-facebook-had-regular-meetings-with-dhs-on-censoring-americans/", "https://naturalnews.com/2020-12-18-facebook-twitter-gave-biden-cash-protecting-hunter.html", "https://theintercept.com/2022/10/31/social-media-disinformation-dhs/", "http://TechGiants.news", "https://www.breitbart.com/tech/2022/10/31/report-twitter-and-facebook-had-regular-meetings-with-dhs-on-censoring-americans/", "https://naturalnews.com/2020-12-18-facebook-twitter-gave-biden-cash-protecting-hunter.html", "https://theintercept.com/2022/10/31/social-media-disinformation-dhs/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2022-11-02-dhs-treasonous-collusion-twitter-facebook-censor-americans.html&linkname=DHS%20engaged%20in%20treasonous%20collusion%20with%20Twitter%20and%20Facebook%20to%20censor%20Americans%2C%20bombshell%20report%20reveals", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}