{"result_id": "185029", "URL": "https://leftcult.com/2022-05-10-california-to-become-first-abortion-destination-state.html", "timestamp": "2023-04-25 16:12:59 CEST+0200", "meta": {"description": "With the landmark 1973 Supreme Court Ruling (Roe v. Wade) soon to get the ax, California is already preparing to become the first ABORTION TOURISM STATE. A new bill, proposed by California senators Nancy Skinner and Anna Caballero, would pay pregnant women to travel into California and terminate the life of their baby. This program […]", "lang": "en", "keywords": "abortion,abortion incentives,abortion tourism,abortion vacations,abuse of women,badhealth,badmedicine,body autonomy,California,child murder,coercion,culture wars,demonic,dignity,evil,fetal organs,future,hope,infanticide,insanity,left cult,life,Organ Trafficking,predatory government,right-to-life,Satanic,serial murder,Twisted,vaccine industry,women's health", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2022-05-10-california-to-become-first-abortion-destination-state.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "California to become the first “abortion tourism” state, luring pregnant women to the state with funds for airfare, lodging, meals", "cleaned_text": "California to become the first “abortion tourism” state, luring pregnant women to the state with funds for airfare, lodging, meals\n\nWith the landmark 1973 Supreme Court Ruling (Roe v. Wade) soon to get the ax, California is already preparing to become the first ABORTION TOURISM STATE. A new bill, proposed by California senators Nancy Skinner and Anna Caballero, would pay pregnant women to travel into California and terminate the life of their baby. This program would financially incentivize women to get pregnant and abort their babies, over and over again.\n\nThis new package (Senate Bill 1142) would provide pregnant women with all the funds they need for a free abortion vacation. The bill calls these abortion vacation amenities “practical support services.” These funds include money for airfare, lodging, meals, dependent childcare, gas, and other financial assistance – as long as the women commit to aborting their babies. This program can target women at any stage of their pregnancy, even when the baby is viable outside the womb.\n\nCalifornia Democrats look to regulate the population by controlling and coercing women\n\nCalifornia Democrats are literally trying to regulate the population of the United States by coercing women into convenient abortions, at any stage of their baby’s gestation. The state would issue abortion vacation funds to various nonprofit organizations in the form of grants. Additionally, the law would require the California Health and Human Services Agency to conduct an “educational and outreach campaign” to lure women into abortion. The Agency would be tasked with developing a website, pointing women in the direction of the nearest abortion provider. After they make travel arrangements for the abortion, the targeted women can be reimbursed for practically all expenses related to the trip.\n\nFor the Democrats, this program is obviously all about control, as they take other people’s money to dictate predatory medical procedures over a woman’s body. In the process, they degrade the woman and discard innocent human life, while providing NO assistance to help the woman or her child find healing, life, dignity, and a future together.\n\nHigh-level Democrats would love to end Roe v. Wade, because it allows them to control women at the state level, using taxpayer funds to dictate a pregnant woman’s future, while shouldering her loss, shame, and guilt. Democrats do not care about a woman’s choice, or else they would provide financial assistance programs to support her baby and the woman’s mental, emotional, and spiritual health. Protecting human life is more important than ever, as predatory governments and corporations’ prey on women and offer no hope for her situation, her family, or her future.\n\nCalifornia already disregards body autonomy rights in favor of coercion and death\n\nCalifornia is already pushing abortion for women. Abortion is financially incentivized by the state’s Medicaid program. California taxpayers are forced to pay for population control, as women are coerced into violating the body autonomy rights of the most vulnerable – their own child. Private insurers are even forced to pay for abortions under state law. California legislators are trying to erase the “right to life, liberty, and the pursuit of happiness” from the U.S. Constitution by guaranteeing unchecked abortion rights in the state’s Constitution.\n\nDemocrats pretend to be about “women’s rights,” but their actions suggest they only care about destroying the next generation of women and men. Suddenly, in California, it’s all about “my body, my choice” – as the state disregards the basic human rights of the unborn, allowing unchecked dismembering and vacuuming of their body parts, straight from the mother’s womb.\n\nOf course, these fetal organs are valuable in the organ trafficking industry. The vaccine industry notoriously uses fetal organs to replicate pathogens for their biologics. Perhaps the state of California is being used to keep this organ trafficking industry viable, as the vaccine industry expands. Ironically, California is the same state that has vanquished all body autonomy rights, forcing adults, children, and babies to succumb to destructive vaccine mandates and passports (that are also causing further harm and loss of life).", "opengraph": {"title": "California to become the first “abortion tourism” state, luring pregnant women to the state with funds for airfare, lodging, meals", "type": "article", "url": "https://www.leftcult.com/2022-05-10-california-to-become-first-abortion-destination-state.html", "site_name": "Left Cult Com", "description": "With the landmark 1973 Supreme Court Ruling (Roe v. Wade) soon to get the ax, California is already preparing to become the first ABORTION TOURISM STATE. A new bill, proposed by California senators Nancy Skinner and Anna Caballero, would pay pregnant women to travel into California and terminate the life of their baby. This program […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2022/05/Welcome-To-California-Road-Sign.jpg"}, "tags": ["body autonomy", "infanticide", "left cult", "life", "abortion incentives", "child murder", "abuse of women", "right-to-life", "serial murder", "demonic", "Organ Trafficking", "women's health", "culture wars", "dignity", "future", "hope", "abortion vacations", "Satanic", "fetal organs", "insanity", "abortion", "vaccine industry", "evil", "abortion tourism", "predatory government", "coercion", "Twisted", "California"], "tweets": [], "movies": [], "links": ["https://westernjournal.com//california-bill-turn-state-abortion-destination-lure-pregnant-women-travel-funds/", "https://www.naturalnews.com/2022-05-08-buy-levis-help-murder-unborn-child.html", "http://populationcontrol.news", "https://naturalnews.com/038873_childhood_vaccines_aborted_babies_DNA.html", "https://westernjournal.com//california-bill-turn-state-abortion-destination-lure-pregnant-women-travel-funds/", "https://www.naturalnews.com/2022-05-08-buy-levis-help-murder-unborn-child.html", "https://naturalnews.com/038873_childhood_vaccines_aborted_babies_DNA.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2022-05-10-california-to-become-first-abortion-destination-state.html&linkname=California%20to%20become%20the%20first%20%E2%80%9Cabortion%20tourism%E2%80%9D%20state%2C%20luring%20pregnant%20women%20to%20the%20state%20with%20funds%20for%20airfare%2C%20lodging%2C%20meals", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}