{"result_id": "185007", "URL": "https://www.leftcult.com/2021-09-12-jimmy-kimmel-wants-all-unvaccinated-people-to-die.html", "timestamp": "2023-04-25 16:12:53 CEST+0200", "meta": {"description": "Have you heard of the new comedy show based on children dying? Yes, it’s hosted by Jimmy Kimmel, who’s running a “hit piece” on how hospitals should deny all care to anyone who won’t take the China Flu gene therapy jabs. Send them home to die, is the message, the punch line. Tell them to […]", "lang": "en", "keywords": "anti-vaxxer,bigotry,Birth defects,Celebrity,covid vaccines,demented,dirty vaccines,discrimination,insanity,Jimmy Kimmel,left cult,Liberty,Libtard,lunatics,Sick,television,vaccine bigotry,vaccine horror,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.leftcult.com/2021-09-12-jimmy-kimmel-wants-all-unvaccinated-people-to-die.html", "encoding": "UTF-8"}, "image": null, "domain": "www.leftcult.com", "title": "SICK AND TWISTED: Jimmy Kimmel wants all unvaccinated people to DIE, but hopes the Covid clot shot won’t clog his son’s blood and strain his heart that already has an oxygen-depriving birth defect", "cleaned_text": "SICK AND TWISTED: Jimmy Kimmel wants all unvaccinated people to DIE, but hopes the Covid clot shot won’t clog his son’s blood and strain his heart that already has an oxygen-depriving birth defect\n\nHave you heard of the new comedy show based on children dying? Yes, it’s hosted by Jimmy Kimmel, who’s running a “hit piece” on how hospitals should deny all care to anyone who won’t take the China Flu gene therapy jabs. Send them home to die, is the message, the punch line. Tell them to rest in peace. No jab, no hospital care, not even for emergencies. Go home and die! (laugh track sounds here).\n\nIn his ‘no blow is too low’ debut performance, after taking the summer off, Kimmel ran a full-length pharma presentation promoting vaccines and Fauci-ology, with fear-mongering hoax charts and falsified statistics from faulty PCR tests. The ‘comedy’ sketch went over about as well as that time a few years back when he made fun of children who have permanent damage to their brains and bodies from vaccines.\n\nHollywood is dying from bad jokes and dirty vaccines\n\nMany Americans have no clue that Hollywood is one big psychological operation (psyop) to sell ‘consumers’ bad food and ‘patients’ bad medicine. That’s why the kids are always drinking milk on shows and in movies, and that’s why they always push vaccines that cause damage to children’s brains.\n\nSales are nearly 100 percent psychological, and that’s why Jimmy Kimmel is trying his best to rag on Joe Rogan and especially ivermectin, because ivermectin is the ‘arch enemy’ of the blood-clotting, ADE-causing Covid vaccines, Remdesivir and those choke-you-to-death ventilators. Joe Rogan beat Covid rather easily with ivermectin, nutrients and some key vitamins, while completely avoiding vaccines.\n\nKimmel’s joke about Rogan as the “Unvaccinated guy who gobbled horse goo?” didn’t resonate so well, with his punch line for Rogan (who beat Covid in 3 days) being “Rest in peace, wheezy.” Make no mistake, Hollywood is selling dirty vaccines. Hollywood is ‘all in’ for murdering Americans by burying the safe remedies for Covid. It’s nothing new. Kimmel is the only joke that’s happening on his show.\n\nKimmel’s son’s health was never a topic to joke about\n\nJimmy Kimmel wants everyone to die now who won’t take the Covid jabs, and he’s not joking when he says it. Yet, it wasn’t too long ago, just about 4 years, that Kimmel’s newborn son, William, was diagnosed with a birth defect in his heart, called tetralogy of fallot, where there’s a hole in the wall between the heart’s chambers. Jimmy had an emotional monologue for that harrowing hospital story, and he managed to conjure up a few fake tears for the cameras to share with America (or at least the Leftist paid studio audience).\n\nAs a result of Kimmel’s son’s heart birth defect, his blood is not fully oxygenated as it circulates throughout his body. This is strikingly similar to what the Covid vaccines are doing to people, with billions of toxic spike proteins circulating through all the blood vessels, clogging the heart and restricting the flow of oxygen and nutrients. Sounds familiar?\n\nLet us not forget, Kimmel loves telling jokes about vaccine-deformed children\n\nJust six years ago, Kimmel popularized hate-based bigotry aimed at vaccine-damaged kids and their families, and just like as of late, it wasn’t some one-liner, but a whole scripted bit teaching America how to laugh at tragedy when it’s someone else’s kids with brain or heart damage from vaccines. How are birth defects so different? Many children suffer birth defects from flu shot vaccinations when their pregnant mother gets jabbed with high doses of mercury (in the multi-dose vials), thanks to the CDC’s advice.\n\nKimmel encourages violence against natural health advocates, and against crippled “anti-vaxxer” children. Does it matter if the kids are Black or Jewish? What if his kids get severely damaged by the Covid vaccines, will they be the next “hit piece” on the Kimmel Vax-Shill Show? Only time will tell, well, that and a few deadly “booster” clot-shots. Turns out vaccines are a form of medical violence against children and all human beings, and it’s no laughing matter.\n\nTune your truth news dial to Pandemic.news for updates on the war against dirty vaccines and socialism, and how to keep your family happy, healthy and safe.", "opengraph": {"title": "SICK AND TWISTED: Jimmy Kimmel wants all unvaccinated people to DIE, but hopes the Covid clot shot won’t clog his son’s blood and strain his heart that already has an oxygen-depriving birth defect", "type": "article", "url": "https://www.leftcult.com/2021-09-12-jimmy-kimmel-wants-all-unvaccinated-people-to-die.html", "site_name": "Left Cult Com", "description": "Have you heard of the new comedy show based on children dying? Yes, it’s hosted by Jimmy Kimmel, who’s running a “hit piece” on how hospitals should deny all care to anyone who won’t take the China Flu gene therapy jabs. Send them home to die, is the message, the punch line. Tell them to […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2021/09/Death-Holocaust-Vaccine-Syringe.jpg"}, "tags": ["Birth defects", "Liberty", "left cult", "demented", "lunatics", "Sick", "discrimination", "anti-vaxxer", "covid vaccines", "Celebrity", "vaccine horror", "wokies", "bigotry", "Jimmy Kimmel", "television", "insanity", "dirty vaccines", "Libtard", "vaccine bigotry"], "tweets": [], "movies": [], "links": ["https://www.westernjournal.com/jimmy-kimmel-says-hospitals-turn-away-unvaccinated-tell-rest-peace/", "https://www.naturalnews.com/2021-09-03-joe-rogan-covid-nutrients-ivermectin-vitamin-drip.html", "https://www.naturalnews.com/048834_jimmy_kimmel_hate_speech_labels_anti-vaxxers.html", "https://pandemic.news/2021-08-27-top-8-ways-americans-pollute-their-bodies-every-day.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2021-08-23-surgeon-general-proclaims-americans-have-no-right-to-spread-disinformation.html", "http://www.truthwiki.org/cdc-centers-for-disease-control-and-prevention/", "https://www.naturalnews.com/2021-08-28-bryan-ardis-exposes-truth-behind-covid-protocols.html", "https://www.westernjournal.com/jimmy-kimmel-says-hospitals-turn-away-unvaccinated-tell-rest-peace/", "https://www.naturalnews.com/048834_jimmy_kimmel_hate_speech_labels_anti-vaxxers.html"], "authors": [], "publish_date": null}