{"result_id": "185001", "URL": "https://leftcult.com/2023-02-10-government-sent-deadlier-covid-vaccines-red-states.html", "timestamp": "2023-04-25 16:12:51 CEST+0200", "meta": {"description": "Mike Yeadon, the former head of respiratory research at Pfizer, and independent researcher Craig Paardekooper have sourced Vaccine Adverse Event Reporting System (VAERS) data on vaccine deaths and injuries in the United States showing that “red,” or conservative-leaning, states are seeing, on average, twice the number of covid “vaccine”-related deaths compared to “blue,” or liberal-leaning, […]", "lang": "en", "keywords": "badhealth,badmedicine,bias,Biden,big government,Big Pharma,bioterrorism,Censored Science,conspiracy,corruption,COVID,deception,deep state,demonic,depopulation,discoveries,dod,evil,Globalism,HHS,left cult,Operation Warp Speed,red states,research,traitors,Trump,vaccination,Vaccine deaths,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2023-02-10-government-sent-deadlier-covid-vaccines-red-states.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "EVIDENCE: Government sent deadlier covid “vaccines” to red states to depopulate conservatives", "cleaned_text": "EVIDENCE: Government sent deadlier covid “vaccines” to red states to depopulate conservatives\n\nMike Yeadon, the former head of respiratory research at Pfizer, and independent researcher Craig Paardekooper have sourced Vaccine Adverse Event Reporting System (VAERS) data on vaccine deaths and injuries in the United States showing that “red,” or conservative-leaning, states are seeing, on average, twice the number of covid “vaccine”-related deaths compared to “blue,” or liberal-leaning, states.\n\nVAERS, a government-run database, currently logs more than 700,000 adverse reactions caused by covid injections from Moderna, Pfizer, and Janssen (Johnson & Johnson) – these are the only three covid jabs that were emergency authorized and / or approved by the Food and Drug Administration (FDA) for use in the U.S.\n\nYeadon and Paardekooper’s research led them to conclude that not all batches, or lots, of covid jabs are the same. Some lots are highly lethal while others are mostly harmless or even entirely placebo. More information about their methods and findings can be found at HowBadIsMyBatch.com and at HowBad.info.\n\n“These vaccines have been deployed in different batches, officially referred to as lots,” explains Greg Reese from Infowars. “This has allowed Yeadon’s team to back-engineer Big Pharma’s covid vaccine deployment agenda in the U.S.”\n\n“About 0.5% of all the different batches are highly toxic, resulting in hospitalization, disability, and death within days or weeks of injection. Other batches cause minimal adverse reactions and most seem to be harmless placebos.”\n\nIs the deep state poisoning conservatives with covid jabs to reinvent “democracy?”\n\nWe know that Pfizer, Moderna, and Janssen have been quietly monitoring the lethal effectiveness of the specific deadly batches they deployed. And while one company is deploying a lethal batch, the other two are deploying harmless ones, creating the scientific environment to conduct dose-range finding, or the maximum tolerated dose for each lethal batch.\n\nEach lethal batch is preceded and followed by quiet period, Reese says, allowing the three pharmaceutical giants time to establish their baseline before they deploy their next deadly batch.\n\nPrivate documents from the Centers for Disease Control and Prevention (CDC) further show expiration dates that include only certain lots – these being the very same lots that were found in Paardekooper’s database to be highly toxic – there is no need to list expiration dates for harmless placebos, after all.\n\nFrom this, the team discovered that the overwhelming majority of vaccine deaths are happening in red states.\n\n“Some states, in particular Kentucky, Montana, Alaska, Tennessee, North Dakota, and South Dakota, are experiencing 4x, 5x, 6x, even 11x the number of deaths per 100,000 vaccinated compared to other states,” Paardekooper found.\n\n“Such a situation should be raising a safety signal, and requires investigation. The higher death rate in these states following vaccination suggests that they may be receiving more toxic batches, or being administered to more vulnerable people.”\n\nOn average, red states are experiencing twice the number of vaccine deaths and injuries than blue states. This can only be due, the experts say, to red states receiving at least twice the amount of highly lethal covid jab batches compared to blue states.\n\n“They are killing people who voted against the Build Back Better agenda while flooding the borders with unvaccinated foreigners,” Reese warns.\n\nIn the comments, someone else asked:\n\n“Didn’t we go to war against Iraq and Syria because they were supposed to be killing their own people with chemical and biological weapons? Now the U.S. government is doing exactly the same thing.”\n\nThe latest news about dangerous and ineffective covid “vaccines” can be found at ChemicalViolence.com.", "opengraph": {"title": "EVIDENCE: Government sent deadlier covid “vaccines” to red states to depopulate conservatives", "type": "article", "url": "https://www.leftcult.com/2023-02-10-government-sent-deadlier-covid-vaccines-red-states.html", "site_name": "Left Cult Com", "description": "Mike Yeadon, the former head of respiratory research at Pfizer, and independent researcher Craig Paardekooper have sourced Vaccine Adverse Event Reporting System (VAERS) data on vaccine deaths and injuries in the United States showing that “red,” or conservative-leaning, states are seeing, on average, twice the number of covid “vaccine”-related deaths compared to “blue,” or liberal-leaning, […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2023/02/Covid-vaccine-child.jpg"}, "tags": ["conspiracy", "big government", "Big Pharma", "deep state", "left cult", "COVID", "deception", "Operation Warp Speed", "corruption", "bias", "Censored Science", "vaccination", "demonic", "Biden", "bioterrorism", "Trump", "HHS", "red states", "vaccine wars", "dod", "depopulation", "evil", "Vaccine deaths", "research", "vaccines", "traitors", "discoveries", "Globalism"], "tweets": [], "movies": [], "links": ["https://allnewspipeline.com/Govt_Targeted_Red_States_With_Deadly_Batches_Of_COVID_Vaxxes.php", "http://www.howbadismybatch.com", "http://www.howbad.info", "https://naturalnews.com/2022-01-25-government-targeting-red-states-deadlier-covid-vaccines.html", "http://chemicalviolence.com", "https://allnewspipeline.com/Govt_Targeted_Red_States_With_Deadly_Batches_Of_COVID_Vaxxes.php", "https://naturalnews.com/2022-01-25-government-targeting-red-states-deadlier-covid-vaccines.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2023-02-10-government-sent-deadlier-covid-vaccines-red-states.html&linkname=EVIDENCE%3A%20Government%20sent%20deadlier%20covid%20%E2%80%9Cvaccines%E2%80%9D%20to%20red%20states%20to%20depopulate%20conservatives", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}