{"result_id": "185013", "URL": "https://leftcult.com/2022-08-25-blackrock-architect-of-woke-capitalism-destroying-america.html", "timestamp": "2023-04-25 16:12:55 CEST+0200", "meta": {"description": "It’s an innocuous-looking initialism that swims among a sea of other investment terms. But make no mistake, ESG, or “Environmental, Social, and Governance,” is a vicious shark that’s leaving higher prices for energy, housing, and groceries in its wake. (Article republished from Breitbart.com) Much like China’s social credit system which the Communist government wields to reward citizens […]", "lang": "en", "keywords": "BlackRock,Bubble,China,Collapse,communism,Consumers Research,corporations,deep state,economy,ESG,Inflation,insanity,investment,Larry Fink,left cult,Libtards,obey,pensions,politics,risk,traitors,woke capitalism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2022-08-25-blackrock-architect-of-woke-capitalism-destroying-america.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "Meet BlackRock: The ‘architect of woke capitalism’ destroying America from within", "cleaned_text": "Meet BlackRock: The ‘architect of woke capitalism’ destroying America from within\n\nIt’s an innocuous-looking initialism that swims among a sea of other investment terms. But make no mistake, ESG, or “Environmental, Social, and Governance,” is a vicious shark that’s leaving higher prices for energy, housing, and groceries in its wake.\n\nMuch like China’s social credit system which the Communist government wields to reward citizens for approved behaviors and penalize them for non-compliance, the ESG investment scheme similarly seeks to transform American society by assigning companies a score to compel their adherence to a set of subjective goals.\n\nLarry Fink, chairman and CEO of BlackRock Investment Management Company, has been referred to as the “architect of woke capitalism.” Together in coordination with other financiers, Fink has sought to weaponize pension funds through ESG to make radical changes to our economy that would never be approved in a legislature or ballot box. “Society is increasingly looking to companies, both public and private, to address pressing social and economic issues,” he wrote in a 2019 letter to CEOs. “These issues range from protecting the environment to retirement to gender and racial inequality, among others.”\n\nConspicuously absent from these priorities is maximizing their clients’ financial investments.\n\nAs the world’s largest asset manager, BlackRock controls more than $8.5 trillion in assets. Fink and BlackRock leverage this vast pool of money that doesn’t belong to them as a means of compelling companies to fall in line with their agenda. “Behaviors are going to have to change, and this is one thing we are asking companies, you have to force behaviors and at BlackRock, we are forcing behaviors,” Fink has stated.\n\nBlackRock and Larry Fink spent years trying to force oil and gas companies to divest and to make it more difficult and expensive for them to operate. As a result, American families are paying more to fuel their cars and to warm and cool their homes. BlackRock’s former ESG czar Brian Deese, who now serves as President Biden’s economic advisor, notoriously responded to concerns over high gasoline prices in June by saying, “This is about the future of the liberal world order and we have to stand firm.”\n\nGermany, which has had environmental policies mirroring ESG in place for years, provides a warning for America. Fuel shortages caused by a mandated transition away from oil and gas in favor of renewable energy sources has left Germany on the brink of de-industrialization, overly reliant on gas from a hostile Russian government and potentially facing a winter of death.\n\nReckless ESG energy decrees and other commands from BlackRock’s leftist cabal have also contributed heavily to inflation and America’s economic recession – a crushing blow to the nation’s pension funds. On top of that, BlackRock-owned companies are snatching up houses, sending rent soaring and crippling families.\n\nAnd then there’s another troubling concern: BlackRock’s extraordinarily close relationship with the Chinese Communist Party. Despite China’s deeply disturbing human rights, military, and environmental record – on top of a contracting economy, Fink declared, “I continue to believe firmly China will be one of the biggest opportunities for BlackRock over the long term, both for asset managers and investors.” One must wonder, how much of Larry Fink and BlackRock’s ESG push is a result of their entanglements with the Chinese Communist Party?\n\nBlackRock’s financial commitments has adversely impacted the U.S. economy and likely violates its fiduciary duty to seek the best return, putting Americans’ retirement at risk. That’s why Consumers’ Research, the nation’s oldest consumer group, has issued a Consumer Warning advising consumers to be wary of investments managed by BlackRock.\n\nWe cannot let extreme left elites like Larry Fink dictate how Americans should live so that they can force a woke political agenda while lining their own pockets.", "opengraph": {"title": "Meet BlackRock: The ‘architect of woke capitalism’ destroying America from within", "type": "article", "url": "https://www.leftcult.com/2022-08-25-blackrock-architect-of-woke-capitalism-destroying-america.html", "site_name": "Left Cult Com", "description": "It’s an innocuous-looking initialism that swims among a sea of other investment terms. But make no mistake, ESG, or “Environmental, Social, and Governance,” is a vicious shark that’s leaving higher prices for energy, housing, and groceries in its wake. (Article republished from Breitbart.com) Much like China’s social credit system which the Communist government wields to reward citizens […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2022/08/Burned-Dollar-US-Economy.jpg"}, "tags": ["corporations", "deep state", "left cult", "China", "investment", "communism", "pensions", "Consumers Research", "Inflation", "obey", "Bubble", "Larry Fink", "politics", "economy", "woke capitalism", "insanity", "ESG", "Libtards", "Collapse", "risk", "traitors", "BlackRock"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/politics/2022/08/23/meet-blackrock-the-architect-of-woke-capitalism-destroying-america-from-within/", "https://mailchimpsites.us1.list-manage.com/track/click?u=367dde762b5fe72c155e4e60d&id=189eb40f73&e=56c2b46fca", "https://whoislarryfink.com/", "http://blackrockloveschina.com/", "http://blackrockloveschina.com/", "https://consumersresearch.org/ConsumerWarning_BlackRock_Crushing_America/", "https://www.breitbart.com/politics/2022/08/23/meet-blackrock-the-architect-of-woke-capitalism-destroying-america-from-within/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2022-08-25-blackrock-architect-of-woke-capitalism-destroying-america.html&linkname=Meet%20BlackRock%3A%20The%20%E2%80%98architect%20of%20woke%20capitalism%E2%80%99%20destroying%20America%20from%20within", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}