{"result_id": "185016", "URL": "https://leftcult.com/2022-09-14-kids-texting-miami-plastic-surgeon-mutilation-surgery.html", "timestamp": "2023-04-25 16:12:55 CEST+0200", "meta": {"description": "This is happening. A plastic surgeon based in Miami Beach is advertising on Twitter and TikTok via video for kids and teens to literally text her to set up sex-organ-mutilation-surgery appointments. “Here at Gallagher Plastic Surgery you can just text us” … “probably set up most of the surgery without talking to anybody on the […]", "lang": "en", "keywords": "bad doctors,badhealth,badmedicine,culture wars,dangerous doctors,Dangerous Medicine,deception,gay mafia,gender mutilation,gender surgery,insanity,left cult,medical violence,sex change,surgery,trans surgery,transgender,transhumanism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://leftcult.com/2022-09-14-kids-texting-miami-plastic-surgeon-mutilation-surgery.html", "encoding": "UTF-8"}, "image": null, "domain": "leftcult.com", "title": "KIDS and TEENS are texting Miami plastic surgeon by her request on TWITTER to set up sex-organ-mutilation-surgery appointments (op-ed)", "cleaned_text": "KIDS and TEENS are texting Miami plastic surgeon by her request on TWITTER to set up sex-organ-mutilation-surgery appointments (op-ed)\n\nThis is happening. A plastic surgeon based in Miami Beach is advertising on Twitter and TikTok via video for kids and teens to literally text her to set up sex-organ-mutilation-surgery appointments. “Here at Gallagher Plastic Surgery you can just text us” … “probably set up most of the surgery without talking to anybody on the phone,” so “just text us on this number,” as she points downward to the number literally posted on the video for kids to text so they can set up their permanent sex-organ-mutilation-surgery. How cool, huh?\n\nDr. Sidhbh Gallagher, a.k.a. “Doctor G” (G as Gangsta’ cool sex-organ-mutilation surgery), says she can decide whether you are mentally and physically “well enough” to undergo surgery, and that “no year in gender role” is needed, meaning that if you just decided today you want to switch from being a boy or girl to the other, just jump right in and text-set-up that appointment!\n\nAll this while she plays gangster rap (about ‘bitches’ and ho’s) in the video’s background to influence children and teens how ‘cool’ it is to get permanent sex-organ-mutilation-surgery. Doctor “G” is featured throughout her Twitter and YouTube video advertisements with her smug, confident smile as she sadistically draws in America’s youth for this sick way of mutilating children’s bodies for money and twisted kicks.\n\nThere are serious risks associated with sex-change surgery and sex-organ-alteration surgery, including the risk of depressive illness and suicide. The cost of changing from a boy to a girl or girl to a boy runs about $25,000 for genital mutilation and deformation operations and $50,000 for facial feature changes. The ability to orgasm can be destroyed forever. Permanently deformed sex-organs are not uncommon. Sometimes a “year of hormones” is indicated as needed prior to surgery, but sometimes not. These dangerous gender-altering hormones can cause cancer and tumors to develop that can wind up deadly in just a few years.\n\nThere are lots of fancy nicknames for these surgeries, including TS (top surgery), BS (bottom surgery), LBS (less-than-bottom surgery), MTF (male-to-female), FTM (female-to-male), V-plasty (vaginoplasty), and P-plasty (phalloplasty).\n\nAn orchiectomy is the surgical removal of one or both testicles. Some “transgender” women choose this for pretending to convert to female from male. Vaginoplasty is a bottom surgery for transgender “women” who call themselves transfeminine. This is where “Doctor G” would create a vagina from genital tissue and a new clitoris made from the penis head. Vaginoplasty can result in permanent loss of sensation in part or ALL of the neo-clitoris due to nerve damage. Plus, rectovaginal fistula can occur, and that’s when the intestines open into the vagina.\n\nWhen the doctor “G’s” of America perform MTF (or transfeminine bottom) surgery, they construct a vagina from the boy’s penis and scrotum tissues using grafts and shafts to form vaginal walls. Then, the urethra is shortened and ‘repositioned’ for female urination ‘patterns.’ Surgery damage risks include bleeding, infection, poor healing of incisions, hematoma, nerve injury, stenosis of the vagina, inadequate depth of the vagina, injury to the urinary tract, abnormal connections between the urethra and the skin, and of course, painful intercourse.\n\nWhen doctor “G’s” perform FTM surgery, a.k.a. phalloplasty, they create a penis and urethra so the female can now stand up while urinating, like a boy. They use tissue from the thigh and/or forearm, while stretching out the genital tissue (called metoidioplasty) and turning it into a phallus. The surgeon cuts ligaments around the clitoris (new ‘erectile tissue’) to add 4 to 6 centimeters of length to the new ‘micro-penis’ shaft.\n\nThe removal of the boy’s prostate affects the way the bladder empties. This can cause urinary tract infections, bladder stones, incontinence, acute urinary retention, a weak urine stream, difficulty urinating, and the complete inability to urinate, all of which can prove deadly.\n\nOh, but Dr. ‘G’ tells you that physical side effects, defects, and failures are uncommon, but that’s simply not true. The warnings issued are so bad, it’s deranged for anyone to ever even consider this type of surgery. While talking about the complications after TS (top surgery) breast surgery, she tries to downplay the seriousness of your new “fresh designer nips.”\n\nOther serious complications include epidermolysis, where blisters appear inside and/or outside the body, which can be long-term side effects. This can occur around the nipple(s) and cause the skin to die, bringing infections and neoplastic complications. Other complications of surgery include wound breakdown, pelvic bleeding and pain, bladder and rectal injuries, and the prolonged need for drainage.\n\nTune your internet dial to gender.news for updates on crazy laws the perverted libs are putting in place to allow child sex-change mutilation in the pursuit of their own perverted agenda.", "opengraph": {"title": "KIDS and TEENS are texting Miami plastic surgeon by her request on TWITTER to set up sex-organ-mutilation-surgery appointments (op-ed)", "type": "article", "url": "https://www.leftcult.com/2022-09-14-kids-texting-miami-plastic-surgeon-mutilation-surgery.html", "site_name": "Left Cult Com", "description": "This is happening. A plastic surgeon based in Miami Beach is advertising on Twitter and TikTok via video for kids and teens to literally text her to set up sex-organ-mutilation-surgery appointments. “Here at Gallagher Plastic Surgery you can just text us” … “probably set up most of the surgery without talking to anybody on the […]", "image": "https://www.leftcult.com/wp-content/uploads/sites/372/2022/09/Trans-Whisper-Secret.jpg"}, "tags": ["gender mutilation", "sex change", "culture wars", "left cult", "gay mafia", "deception", "medical violence", "bad doctors", "dangerous doctors", "transgender", "transhumanism", "gender surgery", "insanity", "trans surgery", "surgery"], "tweets": [], "movies": [], "links": ["https://citizenfreepress.com/breaking/miami-plastic-surgeon-needs-some-time-in-a-jail-cell/", "http://medicalviolence.com", "https://www.metoidioplasty.net/risks-complications/", "http://transhumanism.news", "https://prostatesource.com/does-sex-change-surgery-on-a-male-include-removal-of-prostate-how-an-all-natural-technique-fixes-enlarged-prostate-for-good/", "https://gender.news/2022-09-08-california-passes-law-protecting-abusive-parents-transgenderism.html", "https://citizenfreepress.com/breaking/miami-plastic-surgeon-needs-some-time-in-a-jail-cell/", "https://naturalnews.com/2021-10-24-open-borders-policies-child-trafficking-operation-democrats.html", "https://www.metoidioplasty.net/risks-complications/", "https://prostatesource.com/does-sex-change-surgery-on-a-male-include-removal-of-prostate-how-an-all-natural-technique-fixes-enlarged-prostate-for-good/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fleftcult%2F2022-09-14-kids-texting-miami-plastic-surgeon-mutilation-surgery.html&linkname=KIDS%20and%20TEENS%20are%20texting%20Miami%20plastic%20surgeon%20by%20her%20request%20on%20TWITTER%20to%20set%20up%20sex-organ-mutilation-surgery%20appointments%20%28op-ed%29", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}