{"result_id": "186025", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://lesmoutonsrebelles.com/macron-a-t-il-menti-sur-sa-date-de-vaccination/&prev=search&pto=aue", "timestamp": "2023-04-25 16:13:43 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://lesmoutonsrebelles.com/macron-a-t-il-menti-sur-sa-date-de-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "Macron a-t-il menti sur sa date de vaccination ?", "cleaned_text": "Le président français ne se serait fait vacciner contre le Covid que le 13 juillet, et non six semaines plus tôt comme annoncé par Macron, affirme Mediapart qui a pu consulter le certificat officiel.\n\nAlors que le président de la République française a annoncé s’être fait vacciner le 31 mai, jour de l’ouverture de la campagne à tous les adultes, son certificat officiel comporte une autre date, révèle Mediapart.\n\nLe site d’investigation explique avoir pu consulter le certificat d’Emmanuel Macron grâce à une faille de sécurité révélée par ses journalistes en janvier et qui n’a toujours pas été corrigée depuis. Le document indique que c’est bien le 13 juillet que le président, contaminé par le Covid-19 en décembre 2020, a reçu sa dose du vaccin de Pfizer.\n\nContactée par Mediapart, l’équipe présidentielle a assuré que l’erreur « provenait de la télétransmission à l’Assurance-maladie de la vaccination du président », réalisée le 13 juillet. Selon l’Élysée, une « confusion » entre la date de vaccination et celle de saisie s’est produite lors du remplissage du document de transmission.\n\nAdmettant la possibilité d’une erreur humaine, Mediapart souligne que « la seule date d’ordonnance, le 31 mai, ne permet pas de prouver définitivement que le président a bien été vacciné ce jour-là ».\n\nLes journalistes indiquent que d’autres données, telles que le numéro de lot de vaccin ou la date de signature par l’agent vaccinateur qui figurent sur le formulaire télétransmis à l’Assurance-maladie, « pourraient permettre de trancher entre les dates ».\n\nPourtant, l’Élysée « a refusé de communiquer à Mediapart ces informations » en dépit de « multiples relances depuis 48 heures », constate le média.\n\nLa date du 13 juillet ne semble pas avoir été choisie par hasard. En effet, la veille, Emmanuel Macron prononçait un discours annonçant la généralisation du pass sanitaire. Les annonces du chef de l’État ont alors provoqué une ruée des Français vers les rendez-vous pour se faire vacciner.\n\nMediapart rappelle en outre qu’aucune photographie de la vaccination du président n’a été diffusée, « contrairement à Olivier Véran ou Jean Castex ».", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Macron a-t-il menti sur sa date de vaccination ?", "description": "Le président français ne se serait fait vacciner contre le Covid que le 13 juillet, et non six semaines plus tôt comme annoncé par Macron, affirme Mediapart qui a pu consulter le certificat officiel. Alors que le président de la République française a annoncé s’être fait vacciner le 31 mai, jour de l’ouverture de la campagne à tous les […]", "url": "https://lesmoutonsrebelles.com/macron-a-t-il-menti-sur-sa-date-de-vaccination/", "site_name": "Les Moutons Rebelles", "article:publisher": "https://www.facebook.com/lesmoutonsrebelless/", "article:author": "https://www.facebook.com/lesmoutonsrebellesss/", "article:published_time": "2021-08-28T23:56:22+00:00", "image": "https://lesmoutonsrebelles.com/wp-content/uploads/2021/08/9-27-740x431-1.jpg", "image:width": "740", "image:height": "431"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lesmoutonsrebelles-com.translate.goog/wp-content/uploads/2021/08/9-27-740x431-1.jpg?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://fr.sputniknews.com/france/202105311045673996-emmanuel-macron-sest-fait-vacciner-contre-le-covid-19/", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://fr.sputniknews.com/france/202107131045872422-pass-sanitaire-vaccination-quand-macron-et-le-gouvernement-promettaient-le-contraire-de-ce-quils/", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://fr.sputniknews.com/france/202108261046054213-macron-a-t-il-menti-sur-sa-date-de-vaccination/"], "authors": [""], "publish_date": "2021-08-28T23:56:22+00:00"}