{"result_id": "186079", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://lesmoutonsrebelles.com/video-vaccination-les-gens-ne-sont-plus-assez-structures-intellectuellement-regrette-florence-portelli/&prev=search&pto=aue", "timestamp": "2023-04-25 16:14:48 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://lesmoutonsrebelles.com/video-vaccination-les-gens-ne-sont-plus-assez-structures-intellectuellement-regrette-florence-portelli/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "[VIDEO] Vaccination : \"les gens ne sont plus assez structurés intellectuellement\", regrette Florence Portelli", "cleaned_text": "Florence Portelli, Vice-présidente du conseil régional d’Île-de-France et Maire de Taverny était l’invitée de l’émission «Midi News» ce mardi 29 décembre 2020.\n\nClaire-Elisabeth Beaufort: «Moins d’1 Français sur deux se dit prêt à recevoir cette dose justement de vaccin contre le coronavirus. Vous comprenez cette défiance?» Florence Portelli: «Ça montre aussi la place des réseaux sociaux.\n\nLe fait que les gens ne lisent plus autre chose que ce qu’ils voient sur leur écran. Et ce n’est pas une attaque des réseaux sociaux qui ont parole presque d’évangile aujourd’hui, sans capacité à contredire, à questionner. C’est un problème aussi de régression éducative, culturelle, un problème de régression, même de l’intelligence collective. Je pèse mes mots mais je pense que dans cette société, moi, je suis toujours sidérée qu’on passe du temps sur des faits divers, des moments ponctuels, très, très intéressants, plus personne ne parle d’éducation et de culture.»\n\n«C’est que les gens ne sont plus assez structurés intellectuellement»\n\nClaire-Elisabeth Beaufort: «Ce qui pèche aujourd’hui terriblement dans tous les domaines, c’est que les gens ne sont plus assez structurés intellectuellement et du coup, ils ne questionnent plus, ils ne s’interrogent plus, ils ne vont pas chercher la bonne source d’information. Et plus, on va aller comme ça vers une régression intellectuelle.\n\nEt quand je dis intellectuel, ce ne sont pas des grands mots. Je ne dis pas qu’il faut lire l’intégrale de Kante pour être intelligent, mais juste apprendre à réfléchir. Vous savez, dans tous les milieux sociaux, il y a plusieurs années, même les plus défavorisés, il y avait une intelligence et on faisait confiance à des gens qui étaient respectables parce qu’ils étaient de vrais sachants.»\n\nPatrick Pelloux sur les anti vaccins: « C’est bien la liberté d’expression, même les cons peuvent dire quelque chose »", "opengraph": {"locale": "fr_FR", "type": "article", "title": "[VIDEO] Vaccination : \"les gens ne sont plus assez structurés intellectuellement\", regrette Florence Portelli", "description": "Florence Portelli, Vice-présidente du conseil régional d’Île-de-France et Maire de Taverny était l’invitée de l’émission «Midi News» ce mardi 29 décembre 2020. Claire-Elisabeth Beaufort: «Moins d’1 Français sur deux se dit prêt à recevoir cette dose justement de vaccin contre le coronavirus. Vous comprenez cette défiance?» Florence Portelli: «Ça montre aussi la place des réseaux […]", "url": "https://lesmoutonsrebelles.com/video-vaccination-les-gens-ne-sont-plus-assez-structures-intellectuellement-regrette-florence-portelli/", "site_name": "Les Moutons Rebelles", "article:publisher": "https://www.facebook.com/lesmoutonsrebelless/", "article:author": "https://www.facebook.com/lesmoutonsrebellesss/", "article:published_time": "2021-01-01T11:30:21+00:00", "image": "https://lesmoutonsrebelles.com/wp-content/uploads/2021/01/EqZms2WXAAAGnEJ.jpg", "image:width": "1200", "image:height": "675"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lesmoutonsrebelles-com.translate.goog/wp-content/uploads/2021/01/EqZms2WXAAAGnEJ.jpg?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://lesmoutonsrebelles-com.translate.goog/wp-content/uploads/2021/01/jqp6YcbSHAT_RZ6R.mp4?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://lesmoutonsrebelles-com.translate.goog/patrick-pelloux-sur-les-anti-vaccins-cest-bien-la-liberte-dexpression-meme-les-cons-peuvent-dire-quelque-chose/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc"], "authors": [""], "publish_date": "2021-01-01T11:30:21+00:00"}