{"result_id": "186004", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://lesmoutonsrebelles.com/le-danemark-annonce-la-prochaine-mise-en-place-dun-passeport-numerique-de-vaccination/&prev=search&pto=aue", "timestamp": "2023-04-25 16:13:07 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://lesmoutonsrebelles.com/le-danemark-annonce-la-prochaine-mise-en-place-dun-passeport-numerique-de-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "Le Danemark annonce la prochaine mise en place d’un passeport numérique de vaccination", "cleaned_text": "Le Danemark a annoncé la prochaine mise en place d’un passeport numérique de vaccination afin de permettre aux voyageurs de circuler et d’assouplir les restrictions sanitaires.\n\nLe gouvernement danois a annoncé le 3 février qu’il développerait un passeport numérique de vaccination : ce document servirait à voyager au Danemark et à assouplir les restrictions sanitaires amenées par la pandémie de covid-19.\n\nLe ministre de Finances par intérim Morten Boedskov a affirmé lors d’une conférence de presse qu’en attendant le lancement du permis, « dans trois à quatre mois, un passeport corona numérique sera prêt à l’emploi pour, par exemple, les voyages d’affaires ».\n\n« Il est absolument crucial pour nous d’être capables de relancer la société danoise afin que les entreprises se remettent sur les rails. Beaucoup d’entreprises danoises sont des multinationales ayant le monde pour marché », a-t-il ajouté.\n\nÀ la fin du mois de février, les Danois devraient, en attendant le lancement de ce passeport vaccinal, avoir accès à un site indiquant s’ils ont été vaccinés ou non. « Il s’agira d’un passeport extra dont vous pourrez disposer sur votre téléphone et qui documentera le fait que vous ayez été vacciné », a expliqué le ministre. « Nous pouvons être parmi les premiers pays au monde à l’instaurer et pouvons le montrer au reste du monde. »\n\nUn certificat sera délivré aux personnes ayant reçu les deux doses du vaccin. Il sera accessible sur un portail de santé électronique appelé « Sundhed ». Chaque Danois peut s’y inscrire pour effectuer un test, recevoir ses résultats et gérer son dossier médical.\n\nCette présentation du ministre a été faite devant des représentants de la Confédération des industries danoises, l’une des plus grandes organisations d’affaires du pays, ainsi que devant la Chambre de commerce danoise.\n\nL’Islande et l’Estonie sur la même voie\n\nDepuis la mi-janvier, l’Islande propose déjà un certificat à ses ressortissants et autorise les touristes européens qui sont munis d’un certificat vaccinal, à entrer sur son sol sans obligation d’isolement. Israël réfléchit aussi à la mise en place d’un tel passeport.\n\nLe 2 février, l’Estonie a affirmé qu’elle autoriserait les passagers qui arrivent sur son territoire avec une preuve de vaccination à ne pas être placés en quarantaine.", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Le Danemark annonce la prochaine mise en place d’un passeport numérique de vaccination", "description": "Le Danemark a annoncé la prochaine mise en place d’un passeport numérique de vaccination afin de permettre aux voyageurs de circuler et d’assouplir les restrictions sanitaires. Le gouvernement danois a annoncé le 3 février qu’il développerait un passeport numérique de vaccination : ce document servirait à voyager au Danemark et à assouplir les restrictions sanitaires amenées […]", "url": "https://lesmoutonsrebelles.com/le-danemark-annonce-la-prochaine-mise-en-place-dun-passeport-numerique-de-vaccination/", "site_name": "Les Moutons Rebelles", "article:publisher": "https://www.facebook.com/lesmoutonsrebelless/", "article:author": "https://www.facebook.com/lesmoutonsrebellesss/", "article:published_time": "2021-02-04T18:40:14+00:00", "image": "https://lesmoutonsrebelles.com/wp-content/uploads/2021/02/le-ministre-danois-des-finances-morten-boedskov-a-annonce-en-conference-de-presse-un-passeport-vaccinal-86e9ec-0@1x.jpeg", "image:width": "1280", "image:height": "720"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lesmoutonsrebelles-com.translate.goog/wp-content/uploads/2021/02/le-ministre-danois-des-finances-morten-boedskov-a-annonce-en-conference-de-presse-un-passeport-vaccinal-86e9ec-0@1x.jpeg?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://francais.rt.com/international/83503-danemark-annonce-prochaine-mise-place-passeport-numerique-vaccination"], "authors": [""], "publish_date": "2021-02-04T18:40:14+00:00"}