{"result_id": "186003", "URL": "https://lesmoutonsrebelles.com/video-un-pompier-temoigne-dune-surmortalite-par-avc-suite-a-la-vaccination/", "timestamp": "2023-04-25 16:13:06 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://lesmoutonsrebelles.com/video-un-pompier-temoigne-dune-surmortalite-par-avc-suite-a-la-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "lesmoutonsrebelles.com", "title": "[CORRECTION] Non, un hôpital n'a pas constaté une hausse des AVC après la vaccination", "cleaned_text": "Témoignage d’un pompier de Lyon, très ému, il nous raconte s’être rendu au Centre Hospitalier Saint Joseph et Saint Luc à Lyon, emmener une dame de 71 ans qui a fait un accident vasculaire cérébral (AVC) suite à une vaccination.\n\n» Cette dame a été vaccinée et j’ai demandé au personnel soignant, — c’est la première fois que je demande à une infirmière — et je lui dis que cela fait quelque temps que je fais des interventions concernant des AVC où les personnes ont été vaccinées. »\n\n« Ça peut paraître complotiste, mais est-ce qu’il n’y a pas éventuellement un lien avec ? Elle me répond par l’affirmative. En effet il y en a de plus en plus, elle me dit que très souvent c’est dans les quinze jours qui suivent la vaccination. On alerte tout le monde, mais il n’y a rien qui remonte… Il y a des AVC massifs, tout le personnel est au courant et voilà ! . »\n\nNon, l’hôpital n’a pas constaté une hausse des AVC après la vaccination\n\nJoint par 20 Minutes, le centre hospitalier Saint Joseph-Saint Luc dément formellement les affirmations avancées dans cette vidéo : « Nous n’avons constaté aucune hausse du nombre d’AVC ni de thrombophlébite cérébrales depuis le début de la campagne vaccinale. Médicalement, il n’y a aucun cas de lien de cause à effet entre vaccin [anti-Covid-19] et AVC. »\n\nLe service départemental-métropolitain d’incendie de secours (SDMIS), qui rassemble les sapeurs-pompiers de la métropole de Lyon et du département du Rhône, n’avait pas été en mesure de répondre aux sollicitations de 20 Minutes à la parution de notre article afin de déterminer si l’auteur de la vidéo est un pompier du SDMIS.\n\nDans le cadre de leur surveillance des vaccins anti-Covid-19, assurée depuis le début de campagne de vaccination française, ni les centres de pharmacovigilance ni l’Agence nationale de sécurité du médicament (ANSM) n’ont relevé de cas d’AVC liés à la vaccination.\n\nDans une récente enquête de pharmacovigilance autour du vaccin Pfizer, les centres de pharmacovigilance de Bordeaux et de Marseille soulignaient en outre que les 45 cas d’AVC observés depuis le début de l’utilisation du sérum en France concernaient essentiellement des personnes de 80 ans ou plus « présentant des facteurs de risque cardiovasculaire » et des antécédents d’AVC. « Les données recueillies depuis le début de la campagne vaccinale n’apportent, à ce jour, au regard des caractéristiques des cas analysés et des connaissances actuelles, pas d’élément faisant suspecter un rôle du vaccin dans la survenue d’AVC ischémique. La conclusion concernant ces événements demeure donc inchangée », concluait ce rapport de mars 2021.", "opengraph": {"locale": "fr_FR", "type": "article", "title": "[CORRECTION] Non, un hôpital n'a pas constaté une hausse des AVC après la vaccination", "description": "Témoignage d’un pompier de Lyon, très ému, il nous raconte s’être rendu au Centre Hospitalier Saint Joseph et Saint Luc à Lyon, emmener une dame de 71 ans qui a fait un accident vasculaire cérébral (AVC) suite à une vaccination.  » Cette dame a été vaccinée et j’ai demandé au personnel soignant, — c’est la […]", "url": "https://lesmoutonsrebelles.com/video-un-pompier-temoigne-dune-surmortalite-par-avc-suite-a-la-vaccination/", "site_name": "Les Moutons Rebelles", "article:publisher": "https://www.facebook.com/lesmoutonsrebelless/", "article:author": "https://www.facebook.com/lesmoutonsrebellesss/", "article:published_time": "2021-05-24T23:22:10+00:00", "article:modified_time": "2021-05-25T17:45:23+00:00", "image": "https://lesmoutonsrebelles.com/wp-content/uploads/2021/05/Pompier-Lyon-1.jpg", "image:width": "660", "image:height": "480"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lesmoutonsrebelles.com/wp-content/uploads/2021/05/Pompier-Lyon-1.jpg", "https://lesmoutonsrebelles.com/wp-content/uploads/2021/05/R4Vsp6sbctT7gC4y.mp4", "https://ansm.sante.fr/actualites/point-de-situation-sur-la-surveillance-des-vaccins-contre-la-covid-19-periode-du-07-05-2021-au-13-05-2021", "https://ansm.sante.fr/uploads/2021/03/19/20210319-covid-19-vaccins-pfizer-comirnaty-9.pdf", "https://www.20minutes.fr/societe/3048079-20210525-coronavirus-non-hopital-constate-hausse-avc-apres-vaccination"], "authors": [""], "publish_date": "2021-05-24T23:22:10+00:00"}