{"result_id": "186030", "URL": "https://lesmoutonsrebelles.com/pr-peyromaure-de-lhopital-cochin-a-paris-des-millions-de-francais-ont-ete-vaccines-pour-rien/", "timestamp": "2023-04-25 16:13:50 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://lesmoutonsrebelles.com/pr-peyromaure-de-lhopital-cochin-a-paris-des-millions-de-francais-ont-ete-vaccines-pour-rien/", "encoding": "UTF-8"}, "image": null, "domain": "lesmoutonsrebelles.com", "title": "Pr Peyromaure de l’hôpital Cochin à Paris : « Des millions de Français ont été vaccinés pour rien !", "cleaned_text": "Dans cette vidéo (voir ci-dessous), le Pr Michaël Peyromaure, chef du service d’urologie de l’hôpital Cochin à Paris et auteur de « Hôpital, ce qu’on ne vous a jamais dit » aux éditions Albin Michel, répondait à Sonia Mabrouk. Les questions portaient sur l’état de l’hôpital, le risque de saturation des hôpitaux, l’obligation vaccinale déguisée, le passe sanitaire ou passe vaccinal, le variant Omicron et la vaccination des enfants de 5 à 11 ans.\n\n« Moi, je considère que le passe sanitaire sur le plan fondamental est une espèce de discrimination, c’est-à-dire qu’on autorise certaines personnes à avoir recours à certaines activités sur un critère médical. Le principe me heurte et ça devrait être une mesure d’exception, or on constate que ça va durer. A titre personnel je ne suis pas très favorable au passe sanitaire. »\n\nLoin de la langue de bois, le Pr Peyromaure assure dans des propos explosifs que « le reproche qu’on peut faire au passe sanitaire et donc bientôt au passe vaccinal, c’est qu’il y a des millions de gens qui se sont fait vacciner pour rien parce qu’ils ne sont pas à risque. Tous les jeunes, par exemple, tous les gens qui ont 40-50 ans. […] il aurait fallu cibler les gens à risque et laisser le virus circuler chez tous les autres. »\n\nA la question les non-vaccinés sont-ils responsables de l’engorgement des hôpitaux, sa réponse est « Non je crois qu’il faut attribuer le délitement de l’hôpital à tous nos politiques à tous nos gouvernants successifs de droite de gauche et du centre qui n’ont rien fait pour sauver cette institution […] toutes les mesures qui ont été prises ces dernières années pour l’hôpital sont allées dans le même sens, c’est-à-dire une gestion très comptable, très rigide. Le pouvoir a imposé à l’administration la mise au pas des soignants, la mise à l’écart de notre mission de soins. »\n\nLe professeur pointe l’état de son service et ses conséquences catastrophiques : « Notre service d’urologie à l’hôpital Cochin a toujours 50 % de ses salles d’opération fermées, faute d’infirmières de bloc, ce qui est tout à fait considérable parce que nous déprogrammons chaque semaine des patients. On estime que ces derniers mois on a dû reporter ou annuler 380 interventions chirurgicales rien que dans notre spécialité. »\n\nSource : Le Média en 4-4-2", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Pr Peyromaure de l’hôpital Cochin à Paris : « Des millions de Français ont été vaccinés pour rien ! »", "description": "Dans cette vidéo (voir ci-dessous), le Pr Michaël Peyromaure, chef du service d’urologie de l’hôpital Cochin à Paris et auteur de « Hôpital, ce qu’on ne vous a jamais dit » aux éditions Albin Michel, répondait à Sonia Mabrouk. Les questions portaient sur l’état de l’hôpital, le risque de saturation des hôpitaux, l’obligation vaccinale déguisée, le passe sanitaire ou […]", "url": "https://lesmoutonsrebelles.com/pr-peyromaure-de-lhopital-cochin-a-paris-des-millions-de-francais-ont-ete-vaccines-pour-rien/", "site_name": "Les Moutons Rebelles", "article:publisher": "https://www.facebook.com/lesmoutonsrebelless/", "article:author": "https://www.facebook.com/lesmoutonsrebellesss/", "article:published_time": "2021-12-23T00:36:33+00:00", "image": "https://lesmoutonsrebelles.com/wp-content/uploads/2021/12/Professeur-Michael-Peyromaure.jpg", "image:width": "911", "image:height": "607"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "700", "height": "400", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/CoDVIG2kYzY\" width=\"700\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/CoDVIG2kYzY"}], "links": ["https://lesmoutonsrebelles.com/wp-content/uploads/2021/12/Professeur-Michael-Peyromaure.jpg", "https://livre.fnac.com/a14086304/Michael-Peyromaure-Hopital-ce-qu-on-ne-vous-a-jamais-dit", "https://lemediaen442.fr/pr-peyromaure-de-lhopital-cochin-a-paris-des-millions-de-francais-ont-ete-vaccines-pour-rien/"], "authors": [""], "publish_date": "2021-12-23T00:36:33+00:00"}