{"result_id": "186043", "URL": "https://lesmoutonsrebelles.com/60-000-scientifiques-demandent-larret-de-la-vaccination-de-masse/", "timestamp": "2023-04-25 16:14:06 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://lesmoutonsrebelles.com/60-000-scientifiques-demandent-larret-de-la-vaccination-de-masse/", "encoding": "UTF-8"}, "image": null, "domain": "lesmoutonsrebelles.com", "title": "60 000 scientifiques demandent l’arrêt de la vaccination de masse", "cleaned_text": "La communauté scientifique s’élève contre la politique sanitaire des autorités : la déclaration de Great Barrington (USA) contre les injections massives d’ARNm a récolté 870 000 signatures.\n\nAlors que le président de la République française réunit ce lundi 6 décembre, un nouveau Conseil de Défense pour lutter contre la propagation de l’épidémie de Covid-19, de plus en plus de voix s’élèvent contre la politique sanitaire complètement folle des autorités qui vise à vacciner toujours plus la population. Après la troisième dose de vaccin imposée, sous peine de désactivation du pass sanitaire ! Voilà qu’il est question de vacciner les enfants de 5 à 11 ans. Une décision qui serait gravissime selon de nombreux médecins et chercheurs dont nous nous sommes faits l’écho ici même.\n\nLa vaccination de masse avec un vaccin encore expérimental à ARN messager inquiète depuis longtemps la communauté scientifique. Dès le 4 octobre 2020, trois scientifiques de haut niveau, le Pr Martin Kulldorff, professeur de médecine à l’université de Harvard, biostatisticien et épidémiologiste, spécialisé dans la détection et le suivi des épidémies de maladies infectieuses et dans l’évaluation de la sécurité des vaccins. La Dr Sunetra Gupta, professeur à l’Université d’Oxford, épidémiologiste spécialisée dans l’immunologie, le développement de vaccins et la modélisation mathématique des maladies infectieuses. Et le Dr Jay Bhattacharya, professeur à la faculté de médecine de l’université de Stanford, médecin, épidémiologiste, économiste de la santé et expert en politique de santé publique, spécialisé dans les maladies infectieuses et les populations vulnérables recommandaient une approche alternative contre la Covid-19 dans ce que l’on a appelé la Déclaration de Great Barrington. Car ils sont très inquiets des effets secondaires de la vaccination de masse sur les populations.\n\nQue préconisent-ils ? Une protection « focalisée ». C’est-à-dire de protéger autant que possible les personnes âgées, infirmes, fragiles et de laisser aux autres le soin de vivre normalement jusqu’à ce que la société atteigne l’immunité collective. Or, la vaccination massive par ARNm rend impossible cette immunité collective.\n\nL’un des premiers cosignataires était le Dr Simon Thornley, épidémiologiste et biostatisticien à l’Université d’Auckland. De plus en plus connue dans le monde, la Déclaration de Great Barrington a, depuis, été signée par 60 000 médecins et scientifiques. Une pétition a recueilli à ce jour 870 000 signatures de soutien.\n\n« En tant qu’épidémiologistes des maladies infectieuses et scientifiques spécialisés en santé publique, nous sommes inquiets des impacts physiques et mentaux causés par les politiques actuelles contre la COVID-19 et nous recommandons une approche alternative que nous appelons Protection focalisée (Focused Protection), écrivent les trois premiers signataires.\n\n« Que nous soyons de gauche ou de droite et quel que soit notre pays d’origine, nous avons consacré nos carrières à la protection des populations. Les politiques actuelles de confinement produisent des effets désastreux sur la santé publique à court, moyen et long terme. Parmi les conséquences, on peut citer, entre autres, une baisse des taux de vaccination chez les enfants, une aggravation des cas de maladies cardio-vasculaires, une baisse des examens pour de possibles cancers ou encore une détérioration de la santé mentale en général. Cela va engendrer de grands excès de mortalité dans les années à venir, notamment dans la classe ouvrière et parmi les plus jeunes. Maintenir les écoliers en dehors de l’école est une grande injustice.\n\nConserver ces mesures en attendant qu’un vaccin soit disponible causera des dégâts irréparables. Les couches sociales les moins favorisées seront les plus touchées.\n\nUne maladie peu dangereuse pour les enfants\n\nHeureusement, notre compréhension du virus s’améliore. Nous savons que la vulnérabilité à la mort par la COVID-19 est plus de mille fois plus haute parmi les personnes âgées et infirmes que chez les jeunes. En effet, pour les enfants, la COVID-19 est moins dangereux que bien d’autres maux, y compris la grippe.\n\nL’immunité grandissant dans la population, le risque d’infection baisse pour tout le monde, y compris les plus vulnérables. Nous savons que toutes les populations vont finir par atteindre l’immunité collective, c’est-à-dire le point où le nombre de nouvelles infections est stable, et que ce processus peut s’accompagner (sans pour autant dépendre) de l’existence d’un vaccin. Par conséquent, notre objectif devrait être de minimiser la mortalité et le mal fait à la société jusqu’à ce qu’on atteigne l’immunité collective.\n\nUne approche à la fois compassionnelle et prenant en compte les risques et les bénéfices consiste à autoriser celles et ceux qui ont le moins de risques de mourir du virus de vivre leurs vies normalement afin qu’ils fabriquent de l’immunité au travers d’infections naturelles tout en protégeant celles et ceux qui ont le plus de risques de mourir. Nous appelons cela la Protection Focalisée (Focused Protection).\n\nLe fait d’adopter des mesures pour protéger les plus vulnérables devrait être le but central des réponses de santé publique à la COVID-19. À titre d’exemples, les résidences pour personnes âgées devraient être dotées de personnel qui a acquis l’immunité et qui réalise fréquemment des tests pour les autres membres du personnel et les visiteurs. Par ailleurs, la rotation du personnel devrait être la plus faible possible. Les personnes retraitées qui vivent chez elles devraient se voir livrer leurs courses à domicile. Quand c’est possible, elles devraient rencontrer les proches en plein air plutôt qu’à l’intérieur.\n\nUne liste de mesure complète et détaillée, incluant des approches pour les foyers comprenant plusieurs générations, peut être mise en œuvre. C’est largement dans la capacité et les prérogatives des professionnels de la santé publique.\n\nCeux qui ne sont pas vulnérables devraient immédiatement être autorisés à reprendre une vie normale. Des mesures d’hygiène simples, comme se laver les mains et rester chez soi si l’on est malade, devraient être pratiquées par chacun pour réduire le seuil de l’immunité collective. Les écoles et les universités devraient rouvrir pour des enseignements en présentiel. Les activités extrascolaires comme le sport devraient reprendre. Les jeunes adultes qui présentent peu de risques devraient travailler normalement plutôt que depuis chez eux. Les restaurants et les commerces devraient ouvrir. Les arts, la musique, le sport et les autres activités culturelles devraient reprendre. Les personnes qui présentent plus de risque peuvent participer si elles le souhaitent à ce processus tandis que la société dans son ensemble bénéficie de la protection ainsi conférée aux plus vulnérables par ceux qui ont construit l’immunité collective ».", "opengraph": {"locale": "fr_FR", "type": "article", "title": "60 000 scientifiques demandent l’arrêt de la vaccination de masse", "description": "par Emilien Lacombe. La communauté scientifique s’élève contre la politique sanitaire des autorités : la déclaration de Great Barrington (USA) contre les injections massives d’ARNm a récolté 870 000 signatures. Alors que le président de la République française réunit ce lundi 6 décembre, un nouveau Conseil de Défense pour lutter contre la propagation de l’épidémie de […]", "url": "https://lesmoutonsrebelles.com/60-000-scientifiques-demandent-larret-de-la-vaccination-de-masse/", "site_name": "Les Moutons Rebelles", "article:publisher": "https://www.facebook.com/lesmoutonsrebelless/", "article:author": "https://www.facebook.com/lesmoutonsrebellesss/", "article:published_time": "2021-12-07T23:29:19+00:00", "article:modified_time": "2021-12-07T23:40:44+00:00", "image": "https://lesmoutonsrebelles.com/wp-content/uploads/2021/12/1-3.jpg", "image:width": "740", "image:height": "431"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lesmoutonsrebelles.com/wp-content/uploads/2021/12/1-3.jpg", "https://infodujour.fr/societe/52065-covid-19-la-vaccination-des-enfants-en-question-s", "https://infodujour.fr/societe/54292-la-vaccination-des-enfants-une-pure-folie", "https://gbdeclaration.org/la-declaration-de-great-barrington/", "https://infodujour.fr/societe/54559-60-000-scientifiques-demandent-larret-de-la-vaccination-de-masse", "https://reseauinternational.net/60-000-scientifiques-demandent-larret-de-la-vaccination-de-masse/"], "authors": [""], "publish_date": "2021-12-07T23:29:19+00:00"}