{"result_id": "186042", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://lesmoutonsrebelles.com/propagande-quand-akhenaton-denonce-un-montage-trompeur-de-france-info-sur-les-variants/&prev=search&pto=aue", "timestamp": "2023-04-25 16:14:05 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://lesmoutonsrebelles.com/propagande-quand-akhenaton-denonce-un-montage-trompeur-de-france-info-sur-les-variants/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "«Propagande» : Quand Akhenaton dénonce un montage trompeur de France Info sur les variants", "cleaned_text": "Dans un montage vidéo, France Info soutient qu’Akhenaton affirme que les variants du Covid sont causés par la vaccination. L’artiste nie les propos que le média lui prête, et publie un extrait plus long de l’entretien, qu’il avait contre-filmé.\n\nCritique de la stratégie sanitaire du gouvernement, le rappeur Akhenaton a été interviewé par France Info sur le sujet, l’entretien ayant été diffusé le 3 février. Lors de cette rencontre publiée sous forme de montage vidéo, ainsi que dans un article de fact checking de la cellule «Vrai ou fake ?» du média public, le rappeur affirmerait, selon France Info, que «l’apparition des variants coïncide toujours aux débuts des campagnes de vaccination».\n\n«Le rappeur Akhenaton en est convaincu, les différents variants du Covid existeraient à cause de la vaccination», explique ainsi une journaliste en voix off, avant de montrer un court extrait de l’interview.\n\nDans une vidéo explicative postée sur compte Facebook le 3 février, l’artiste se défend d’avoir tenu de tels propos. Il publie un extrait plus long de l’échange en question – que son équipe avait contre-filmé – afin de le contextualiser : «J’ai été très étonné de voir la diffusion sur leurs réseaux d’une sorte de fact checking, où on prenait 30 secondes de ce que j’ai dit, qui est titré Vrai ou fake, les variants du Covid causés par la vaccination ? Le titre a été changé depuis, mais pas le sous-titre, « Le rappeur Akhenaton affirme que les différents variants du Covid-19 auraient été causés par la vaccination ». Je n’ai absolument pas dit ça.»\n\n«Dans l’ensemble des fake news, on a toute une spirale. La presse devrait réaliser qu’elle est à un tournant, qu’il y a beaucoup de gens qui n’y croient plus parce que [les médias] suivent une doxa. Ils ne font plus de l’information, ils font de la propagande», commence-t-il dans son entretien avec France Info, un passage qui n’a pas été diffusé par le média public.\n\n«Je vous prends un exemple. Aujourd’hui un article du Parisien : Les variants apparaissent dans les pays où les gens ne sont pas vaccinés. Voilà le titre de l’article. Donc on va être factuel, je vous montrer les chiffres de [l’Université] John Hopkins, qui n’est absolument pas complotiste. Le premier pays est l’Inde : vous avez l’épidémie de Delta. La vaccination commence quand ? Au moment où le Delta apparaît. Ca coïncide. L’Afrique du Sud : la vaccination est là, Omicron est là, la 4e vague [apparaît] après la vaccination», poursuit-il.\n\n«Les trois variants principaux qu’on a connus dans le monde occidental, Alpha, Delta, Omicron, sont apparus dans des pays qui entamaient des campagnes de vaccination massive», soutient-il alors, avant de conclure : «Je ne suis pas assez calé en la matière pour dire pourquoi, comment.»\n\nDans sa vidéo de rechecking publié sur Facebook, Akhenaton souligne : «Voilà, je ne fais que répondre à l’article de presse. Je n’ai jamais affirmé que la vaccination engendrait des variants, on peut le vérifier, y compris dans leur fact checking.» Il a également demandé des «excuses» de la part des journalistes venus l’interviewer : «A ce moment-là, ce n’est plus de l’information, ça devient de la propagande.»", "opengraph": {"locale": "fr_FR", "type": "article", "title": "«Propagande» : Quand Akhenaton dénonce un montage trompeur de France Info sur les variants", "description": "Dans un montage vidéo, France Info soutient qu’Akhenaton affirme que les variants du Covid sont causés par la vaccination. L’artiste nie les propos que le média lui prête, et publie un extrait plus long de l’entretien, qu’il avait contre-filmé. Critique de la stratégie sanitaire du gouvernement, le rappeur Akhenaton a été interviewé par France Info sur […]", "url": "https://lesmoutonsrebelles.com/propagande-quand-akhenaton-denonce-un-montage-trompeur-de-france-info-sur-les-variants/", "site_name": "Les Moutons Rebelles", "article:publisher": "https://www.facebook.com/lesmoutonsrebelless/", "article:author": "https://www.facebook.com/lesmoutonsrebellesss/", "article:published_time": "2022-02-07T15:47:33+00:00", "image": "https://lesmoutonsrebelles.com/wp-content/uploads/2022/02/000_Par7719229_1.jpg", "image:width": "752", "image:height": "423"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"> \n           <p dir=\"ltr\" lang=\"fr\">Le rappeur Akhenaton est très remonté contre les vaccins Covid. Il nous a donné entre autres cet argument : l’apparition des variants coïncide toujours aux débuts des campagnes de vaccination. Étrange. Alors Vrai ou Fake? <a href=\"https://translate.google.com/website?sl=fr&amp;tl=en&amp;hl=en&amp;prev=search&amp;u=https://t.co/UcHqaErqIP\">pic.twitter.com/UcHqaErqIP</a></p> \n           <p>— Julien Pain (@JulienPain) <a href=\"https://translate.google.com/website?sl=fr&amp;tl=en&amp;hl=en&amp;prev=search&amp;u=https://twitter.com/JulienPain/status/1489281236182970369?ref_src%3Dtwsrc%255Etfw\">February 3, 2022</a></p>\n          </blockquote> \n          "], "movies": [], "links": ["https://lesmoutonsrebelles-com.translate.goog/wp-content/uploads/2022/02/000_Par7719229_1.jpg?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://twitter.com/JulienPain/status/1489281236182970369", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francetvinfo.fr/sante/maladie/coronavirus/vaccin/vrai-ou-fake-les-variants-du-covid-19-causes-par-la-vaccination_4940235.html", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://t.co/UcHqaErqIP", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://twitter.com/JulienPain/status/1489281236182970369?ref_src%3Dtwsrc%255Etfw", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://francais.rt.com/france/95505-propagande-akhenaton-denonce-montage-trompeur-france-info-variants?utm_source%3Dbrowser%26utm_medium%3Daplication_chrome%26utm_campaign%3Dchrome"], "authors": [""], "publish_date": "2022-02-07T15:47:33+00:00"}