{"result_id": "186051", "URL": "https://lesmoutonsrebelles.com/aux-usa-le-chantage-sintensifie-pas-vaccine-pas-de-boulot/", "timestamp": "2023-04-25 16:14:16 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png", "canonical": "https://lesmoutonsrebelles.com/aux-usa-le-chantage-sintensifie-pas-vaccine-pas-de-boulot/", "encoding": "UTF-8"}, "image": null, "domain": "lesmoutonsrebelles.com", "title": "Aux USA le chantage s’intensifie : pas vacciné, pas de boulot", "cleaned_text": "Une récente offre d’emploi pour un poste de sommelier au sein du restaurant new-yorkais Eleven Madison Park énumérait une série de compétences nécessaires, dont une connaissance exceptionnelle du vin et la capacité de soulever 15 kg. Une ultime condition concluait la liste : être vacciné contre le Covid-19.\n\nAlors que le marché du travail américain retrouve des couleurs, les entreprises exigent désormais des candidats qu’ils soient vaccinés – ou prêts à le faire dans les trente jours suivant leur embauche.\n\nLe réseau de l’hôpital méthodiste de Houston a rendu obligatoire la vaccination des salariés actuels et des nouvelles recrues, sauf dérogation. Ceux qui ne s’y conforment pas seront d’abord suspendus sans solde, puis licenciés, prévient une porte-parole de l’hôpital. Selon le Dr Boom, il est possible que certains salariés choisissent de démissionner plutôt que de se faire vacciner, mais il prévoit que la grande majorité d’entre eux se conformeront à la nouvelle obligation.\n\nOn retrouve ces obligations dans différents secteurs et types de postes. En Alaska, une offre d’emploi de GCI Communication indiquait qu’un vaccin serait nécessaire pour travailler cet été comme guide dans un centre de retraite de cette entreprise de télécoms, pour encadrer les randonneurs et les kayakistes. Dans la région de la baie de San Francisco, une annonce pour un poste d’assistant des ressources humaines au Boys & Girls Clubs of the Peninsula mentionne en caractères gras que le candidat « DOIT fournir une preuve de vaccination contre le Covid ».\n\nL’entreprise Lastique International, indique désormais ses exigences en matière de vaccins sur ses offres d’emploi, notamment pour les opérateurs de machines. Elle commence maintenant les entretiens d’embauche en demandant : « Avez-vous reçu le vaccin Covid, ou prévoyez-vous de le recevoir ? »\n\nSi un candidat n’est pas disposé à le faire, l’entrevue prend fin. « Ce n’est pas un problème du tout, leur répond-elle. Mais vous ne pourrez pas travailler chez Lastique. »", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Aux USA le chantage s’intensifie : pas vacciné, pas de boulot", "description": "Aux États-Unis, le chantage fait entrer le vaccin dans les normes sociales. Désormais, les employeurs n’hésitent pas à faire figurer la vaccination comme critère d’embauche dans leurs offres d’emploi et à refuser les postes aux candidats qui ne voudraient pas se faire vacciner. Les premiers signes d’apartheid commencent à voir le jour. Une récente offre d’emploi […]", "url": "https://lesmoutonsrebelles.com/aux-usa-le-chantage-sintensifie-pas-vaccine-pas-de-boulot/", "site_name": "Les Moutons Rebelles", "article:publisher": "https://www.facebook.com/lesmoutonsrebelless/", "article:author": "https://www.facebook.com/lesmoutonsrebellesss/", "article:published_time": "2021-04-29T01:54:30+00:00", "image": "https://lesmoutonsrebelles.com/wp-content/uploads/2021/04/image_1044304_20210428_ob_7f2c9d_vaccination-emploi.jpg", "image:width": "660", "image:height": "480"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.lopinion.fr/edition/wsj/patron-d-indeed-il-faut-simplifier-recherche-d-emploi-241013", "https://www.lopinion.fr/edition/wsj/aux-etats-unis-obtenir-emploi-vaccin-sera-obligatoire-242989"], "authors": [""], "publish_date": "2021-04-29T01:54:30+00:00"}