{"result_id": "187013", "URL": "https://www.liberty.news/2022-10-24-new-report-covid-vaccines-never-prevented-spread-of-virus.html", "timestamp": "2023-04-25 16:15:06 CEST+0200", "meta": {"description": "Once again, it turns out that the alternative media — outlets like ours, for instance — were 100 percent right about the most life-changing health event of our lifetimes thus far: the COVID-19 pandemic. Not only did the alternative media report early and correctly that the virus was likely the product of experimental research that […]", "lang": "en", "keywords": "covid vaccines,covid-19,deception,government cover-up,lies,medical violence,pharmaceutical fraud,scamdemic,vaccine scandal,virus transmission", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.liberty.news/2022-10-24-new-report-covid-vaccines-never-prevented-spread-of-virus.html", "encoding": "UTF-8"}, "image": null, "domain": "www.liberty.news", "title": "FRAUD FROM DAY ONE: Stunning new report notes that COVID vaccines NEVER prevented spread of the virus", "cleaned_text": "FRAUD FROM DAY ONE: Stunning new report notes that COVID vaccines NEVER prevented spread of the virus\n\nOnce again, it turns out that the alternative media — outlets like ours, for instance — were 100 percent right about the most life-changing health event of our lifetimes thus far: the COVID-19 pandemic.\n\nNot only did the alternative media report early and correctly that the virus was likely the product of experimental research that leaked, accidentally or otherwise, from the Wuhan Institute of Virology in China, but we were also out front questioning the veracity of reports that claimed the vaccines were ‘highly effective’ at preventing the spread of the disease.\n\nTurns out, we were right about that, too.\n\nYou may recall not long ago the left-wing hatred and insanity people throughout the Western world faced who did not want to take a vaccine. Deemed “anti-vaxxers,” many were shunned, canceled online, and fired from their jobs. They were made to feel worse than second-class citizens, and many were deprived of their basic legal and constitutional rights, all because they attempted to exercise some caution about a vaccine that was experimental and proven to be highly dangerous for millions of people.\n\nBut as it turns out, the skeptical ‘anti-vaxxers’ were justified in their refusal to take the jab, mostly because the claim being pushed by governments and the mainstream ‘scientific’ community that the vaccines prevented the spread of COVID-19 was a lie, according to a comprehensive investigative report published this week in Tablet Magazine:\n\nVaccine mandates were mainly rationalized through the belief that the higher the rate of vaccination, the less the virus would spread. For example, during oral arguments for Biden’s health care worker mandate, Associate Justice of the Supreme Court Elena Kagan claimed that health care workers had to get vaccinated “so that you’re not transmitting the disease.” But recently, on Oct. 10, 2022, a Pfizer spokesperson told the European Parliament that the vaccines had never actually been tested for preventing transmission. While this was presented on social media as “breaking news,” the fact that the vaccines were not tested for this purpose has been documented extensively ever since Pfizer and Moderna received their original Emergency Use Authorization (EUA).\n\nOn Dec. 10, 2020, in a Food and Drug Administration meeting where the first mRNA vaccines were authorized, an adviser to the agency, Dr. Patrick Moore, said: “Pfizer has presented no evidence in its data today that the vaccine has any effect on virus carriage or shedding, which is the fundamental basis for herd immunity.” Despite the information that was presented for individual efficacy, Moore added that “we really, as of right now, do not have any evidence that it will have an impact, social-wide, on the epidemic.”\n\nAlso, the FDA EUA press release from December 2020 confirms that there was no “evidence that the vaccine prevents transmission of SARS-COV-2 from person to person.”\n\nPut another way, most people were led to believe the vaccines prevented the spread of the virus because they were told that was the case by liars who wanted to mislead the masses so they could impose their will. This was also done, of course, with the help of the deep state’s allies in the ‘mainstream’ media and on the major social media platforms like Twitter, Facebook, and YouTube, all of whom censored or took down content that questioned the ‘accepted official narratives’ on COVID.\n\n“For anyone content with their vaccination status, this might not be a big deal. Yes, the vaccine information that was provided in 2021 wasn’t entirely accurate, but you might still feel that getting vaccinated was the right decision,” Tablet Magazine noted, before pointing out: “However, being misinformed about potential benefits and risks is an enormous deal for, say, a male college athlete who got vaccinated because he wanted to protect his elderly family members, but who then developed myocarditis.”\n\nThe COVID-19 pandemic, which led to crippling economic shutdowns and massive shifts in wealth, was a scam from start to finish. And we still have not felt all of the effects of the bad policy decisions, including keeping kids out of school for two years.", "opengraph": {"title": "FRAUD FROM DAY ONE: Stunning new report notes that COVID vaccines NEVER prevented spread of the virus", "type": "article", "url": "https://www.liberty.news/2022-10-24-new-report-covid-vaccines-never-prevented-spread-of-virus.html", "site_name": "Liberty News", "description": "Once again, it turns out that the alternative media — outlets like ours, for instance — were 100 percent right about the most life-changing health event of our lifetimes thus far: the COVID-19 pandemic. Not only did the alternative media report early and correctly that the virus was likely the product of experimental research that […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2022/10/Vaccine-Vial-Bottles-Covid-19.jpg"}, "tags": ["government cover-up", "covid vaccines", "covid-19", "virus transmission", "deception", "medical violence", "scamdemic", "vaccine scandal", "lies", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.tabletmag.com/sections/science/articles/vaccines-never-prevented-transmission-covid-alex-gutentag", "https://www.fda.gov/media/144859/download", "https://www.fda.gov/news-events/press-announcements/fda-takes-key-action-fight-against-covid-19-issuing-emergency-use-authorization-first-covid-19#:~:text=At%20this%20time%2C%20data%20are,2%20from%20person%20to%20person.", "http://www.vaccines.news", "https://www.brighteon.tv", "https://www.tabletmag.com/sections/science/articles/vaccines-never-prevented-transmission-covid-alex-gutentag", "https://www.fda.gov/news-events/press-announcements/fda-takes-key-action-fight-against-covid-19-issuing-emergency-use-authorization-first-covid-19#:~:text=At%20this%20time%2C%20data%20are,2%20from%20person%20to%20person.", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2022-10-24-new-report-covid-vaccines-never-prevented-spread-of-virus&linkname=FRAUD%20FROM%20DAY%20ONE%3A%20Stunning%20new%20report%20notes%20that%20COVID%20vaccines%20NEVER%20prevented%20spread%20of%20the%20virus", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}