{"result_id": "187007", "URL": "https://liberty.news/2022-08-04-coast-guard-sues-biden-covid-vaccine-mandate.html", "timestamp": "2023-04-25 16:15:02 CEST+0200", "meta": {"description": "More than 130 members of the United States Coast Guard are suing the Biden regime for trying to force them to get “vaccinated” for the Wuhan coronavirus (Covid-19) against their religious beliefs. Filed on July 25 in the U.S. District Court for the Southern District of Texas, Galveston Division, the suit alleges that the federal […]", "lang": "en", "keywords": "armed services,badhealth,badmedicine,big government,Coast Guard,COVID,health freedom,lawsuit,Liberty,medical fascism,medical martial law,Medical Tyranny,Plandemic,Resist,revolt,uprising,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2022-08-04-coast-guard-sues-biden-covid-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Hundreds of Coast Guard members sue Biden regime over covid vaccine mandates", "cleaned_text": "More than 130 members of the United States Coast Guard are suing the Biden regime for trying to force them to get “vaccinated” for the Wuhan coronavirus (Covid-19) against their religious beliefs.\n\nFiled on July 25 in the U.S. District Court for the Southern District of Texas, Galveston Division, the suit alleges that the federal government’s jab mandate is unconstitutional.\n\nAccording to Dale Saran, one of the attorneys representing the service members, the final tally of plaintiffs is likely to exceed 200. The defendants include Alejandro Mayorkas, secretary of the U.S. Department of Homeland Security (DHS); Linda L. Fagan, commandant of the Coast Guard; Lloyd Austin, secretary of the U.S. Department of Defense (DOD); and Dr. Janet Woodcock, acting commissioner of the U.S. Food and Drug Administration (FDA).\n\nAll of the plaintiffs are either active-duty or reserve members of the Coast Guard, and all of them “have sincerely held religious beliefs that prohibit them from receiving the COVID-19 vaccine.”\n\nReports indicate that the plaintiffs filed for a religious exemption from the mandate, which is their right, only to have the Coast Guard deny it. The Aug. 24, 2021 jab mandate from the DOD clearly states that there are to be “medical, administrative, and Religious Accommodation Requests (RARs) to the mandate.”\n\nTwo days after the mandate was issued, the Coast Guard joined it, “incorporat[ing] the provisions of the DOD mandate.” (Related: Covid jabs are killing people.)\n\n“In practice, only servicemembers with medical or administrative reasons for an exemption from the mandate are accommodated, and even those sparingly, while RARs are universally denied unless the requester is eligible for administrative separation – i.e., imminently leaving the Service,” the suit explains.\n\nThis “conclusively demonstrates that the Armed Services have systematically and willfully violated service members’ free exercise rights under RFRA [Religious Freedom Restoration Act] and the First Amendment.”\n\nCoast Guard used “formulaic language” to deny exemptions with “nearly identical form letters”\n\nThe DOD mandate states that any service member who does not take the Fauci Flu shots will be involuntarily separated, which is what the plaintiffs currently face. They are also being discriminated against based on their vaccination status, which is unlawful.\n\n“Because of their vaccination status, Plaintiffs have been harassed, treated differently than their peers, singled out publicly by their leaders, had their normal leave and liberty restricted, been removed from senior / leadership positions, been denied promotion, received official discipline, been barred from training, travel, new assignments and permanent change of station (‘PCS’) orders, and face imminent involuntary separation, all while they have continued to perform the mission alongside their ‘vaccinated’ peers, in many cases, while their ‘vaccinated’ peers got sick with COVID-19 in large numbers,” the suit adds.\n\nThe plaintiffs also say that each of them received an identical letter of rejection from the Coast Guard using “formulaic language.” It appears as though nobody even read the exemption requests and instead just sent off patent form letters to every service member who filed one.\n\nAdditionally, none of the original 122 plaintiffs who filed for an exemption received a response within the required 30-day deadline.\n\nMore than 90 percent of the plaintiffs have natural immunity anyway – not that this should be a requirement to maintain bodily autonomy, just to be clear. This is just another point made in the lawsuit as to the illegitimacy of the DOD mandate for the Coast Guard.\n\nThe lawsuit also makes clear that the mRNA (messenger RNA) injections from Pfizer-BioNTech and Moderna are not, in fact, vaccines, but rather “gene-therapy treatments that meet none of the statutory and historical definitions to be considered ‘vaccines.'”\n\nMore Fauci Flu shot-related news can be found at Vaccines.news.", "opengraph": {"title": "Hundreds of Coast Guard members sue Biden regime over covid vaccine mandates", "type": "article", "url": "https://www.liberty.news/2022-08-04-coast-guard-sues-biden-covid-vaccine-mandate.html", "site_name": "Liberty News", "description": "More than 130 members of the United States Coast Guard are suing the Biden regime for trying to force them to get “vaccinated” for the Wuhan coronavirus (Covid-19) against their religious beliefs. Filed on July 25 in the U.S. District Court for the Southern District of Texas, Galveston Division, the suit alleges that the federal […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2022/08/Lawsuit-Paperwork-Pen.jpg"}, "tags": ["big government", "lawsuit", "Liberty", "medical fascism", "vaccine wars", "Resist", "COVID", "armed services", "revolt", "vaccine mandate", "Medical Tyranny", "vaccines", "health freedom", "medical martial law", "Plandemic", "uprising", "Coast Guard"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/130-coast-guard-members-sue-federal-government-over-vaccine-mandates_4641107.html", "https://naturalnews.com/2021-11-27-higher-covid-vaccine-coverage-higher-excess-mortality.html", "https://www.brighteon.tv", "http://vaccines.news", "https://www.theepochtimes.com/130-coast-guard-members-sue-federal-government-over-vaccine-mandates_4641107.html", "https://naturalnews.com/2021-11-27-higher-covid-vaccine-coverage-higher-excess-mortality.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2022-08-04-coast-guard-sues-biden-covid-vaccine-mandate&linkname=Hundreds%20of%20Coast%20Guard%20members%20sue%20Biden%20regime%20over%20covid%20vaccine%20mandates", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}