{"result_id": "187014", "URL": "https://liberty.news/2022-08-31-cost-of-truth-army-whistleblower-involuntary-separation.html", "timestamp": "2023-04-25 16:15:07 CEST+0200", "meta": {"description": "First Lt. Mark Bashaw, a preventive medicine officer in the Army, is now facing involuntary separation for disobeying Wuhan coronavirus (COVID-19) protocol. He is the whistleblower who noticed the sudden increase in diseases in the Defense Medical Epidemiology Database (DMED). “The DMED, which tracks disease and injuries of 1.3 million active component service members, showed during the pandemic a […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,conspiracy,Dangerous Medicine,DMED,dod,fascism,medical fascism,Medical Tyranny,military,pandemic,Pentagon,pharmaceutical fraud,ron johnson,vaccine damage,vaccine injury,vaccine mandates,Whistleblower", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2022-08-31-cost-of-truth-army-whistleblower-involuntary-separation.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "BOOTED OUT: Army whistleblower faces involuntary separation for telling the truth about COVID-19", "cleaned_text": "BOOTED OUT: Army whistleblower faces involuntary separation for telling the truth about COVID-19\n\nFirst Lt. Mark Bashaw, a preventive medicine officer in the Army, is now facing involuntary separation for disobeying Wuhan coronavirus (COVID-19) protocol. He is the whistleblower who noticed the sudden increase in diseases in the Defense Medical Epidemiology Database (DMED).\n\n“The DMED, which tracks disease and injuries of 1.3 million active component service members, showed during the pandemic a significant surge in reports of cancers, myocarditis, and pericarditis, as well as some other diseases like male infertility, tumors, a lung disease caused by blood clots and HIV,” Bashaw said.\n\nFor example, the number of cancer cases among active service members in 2021 nearly tripled as compared to the average number of cancer instances per year from 2016 to 2020.\n\nBashaw’s whistleblower declaration was submitted to Senator Ron Johnson, who is facilitating the sharing of information from the early investigations of COVID-19 products with Congress.\n\nHowever, a week after this information was brought out in January in a “COVID-19: Second Opinion” roundtable organized by Johnson, the data in DMED changed. All of the troubling spikes in diseases and injuries “seemed to have disappeared and been realigned with previous years,” Bashaw said.\n\nJohnson sent three letters to the Department of Defense (DoD) requesting an explanation of the sudden increase in medical diagnosis and the changes in the DMED data. He also sent a letter to the technology company that manages DMED, asking for clarification of all data integrity issues in the database.\n\nDoD spokesperson Major Charlie Dietz told the Epoch Times that the DMED data “was incorrect for the years 2016-2020,” so the system was taken offline to correct the root cause of the data corruption, which didn’t impact data from 2021.\n\nBashaw disputed the “glitch” and pulled up data from the Vaccine Adverse Event Reporting System, where an average of the last 24 years to data for 2021 has been found to have an 11-fold increase in the number of suspected adverse incidents reported in 2021.\n\n“I compared it to the average of the last 24 years, it’s a 1,100 percent increase in 2021. And the only difference we had in 2021 was the rollout of these experimental emergency uses authorized COVID-19 vaccines,” he said.\n\nHe also raised his concerns to his superiors through the proper channels, but they were never addressed. Instead, “I was targeted due to my own vaccination status,” the medical officer said. (Related: US army silences whistleblower who reported his commanding officer for ordering troops to take non-FDA approved COVID-19 vaccines.)\n\nBashaw was court-martialed and later convicted for disobeying the mandated COVID-19 protocol. The judge did not hand down any punishment and recommended to the commanding general to drop the conviction.\n\nBut the general upheld the conviction instead.\n\nAs soon as he was declared guilty, the Army initiated his involuntary separation after 17 years of honorable service, withholding the lieutenant’s expected promotion to captain.\n\nHe lodged a whistleblower complaint at DoD, but the decision was made that there was no retaliation against him and the case was closed out. The serviceman then filed another complaint, which exercises his right guaranteed by the code of military justice to challenge such decisions.\n\nRecently, Bashaw also petitioned the Army’s judge advocate general, asking the high-ranking official to review what he has brought forth in the official documentation. Bashaw pointed out he would not be risking 17 years of his service and the health and welfare of his family on some flimsy argument.\n\n“I will absolutely do everything in my power to warn my brothers and sisters in uniform. And that’s my job as a medical officer, to communicate risks and potential harms,” Bashaw said. “That is my duty.”\n\nVisit MedicalTyranny.com for more news related to vaccines and mandates imposed on the public and the military.\n\nWatch the below video where Lt. Mark Bashaw revealed to Dr. Lee Merritt his struggles with COVID-19 health mandates in the Army on Brighteon.TV.\n\nScott Kesterson: Military COVID-19 vaccine mandate a ploy to get rid of soldiers who would disobey illegal orders – Brighteon.TV.\n\nAirman fighting possible DISMISSAL for refusing to get the COVID clot shot.\n\nMilitary doctor says she was ordered to cover up wave of covid “vaccine” injuries in servicemen.\n\nSMOKING GUN: Pentagon’s DMED data proves that skyrocketing disease rates in military servicemen caused by covid “vaccines.”", "opengraph": {"title": "BOOTED OUT: Army whistleblower faces involuntary separation for telling the truth about COVID-19", "type": "article", "url": "https://www.liberty.news/2022-08-31-cost-of-truth-army-whistleblower-involuntary-separation.html", "site_name": "Liberty News", "description": "First Lt. Mark Bashaw, a preventive medicine officer in the Army, is now facing involuntary separation for disobeying Wuhan coronavirus (COVID-19) protocol. He is the whistleblower who noticed the sudden increase in diseases in the Defense Medical Epidemiology Database (DMED). “The DMED, which tracks disease and injuries of 1.3 million active component service members, showed during the pandemic a […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2022/08/Military-Soldiers-Salute-1.jpg"}, "tags": ["pandemic", "conspiracy", "DMED", "big government", "medical fascism", "Big Pharma", "fascism", "dod", "ron johnson", "vaccine injury", "vaccine mandates", "Medical Tyranny", "Pentagon", "vaccine damage", "Whistleblower", "military", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/drastic-increase-non-infectious-diseases-military-explained-data-glitch-whistleblower/5791069", "https://www.theepochtimes.com/drastic-increase-in-non-infectious-diseases-in-military-explained-as-data-glitch-whistleblower_4681292.html", "https://naturalnews.com/2022-04-12-army-whistleblower-nonfda-approved-vaccines-silenced.html", "https://medicaltyranny.com/", "https://www.brighteon.tv", "https://www.brighteon.com/51092633-eb02-4ccc-a5ca-0ee6f31683e2", "https://brighteon.tv/home/", "https://naturalnews.com/2022-07-25-military-vaccine-mandate-soldiers-disobey-illegal-orders.html", "https://biggovernment.news/2022-05-05-airman-fighting-dismissal-for-refusing-covid-vaccine.html", "https://vaccines.news/2022-03-21-military-doctor-ordered-to-suppress-vaccine-injuries.html", "https://pandemic.news/2022-02-09-pentagon-dmed-data-proves-disease-military-covid-vaccines.html", "https://www.globalresearch.ca/drastic-increase-non-infectious-diseases-military-explained-data-glitch-whistleblower/5791069", "https://www.theepochtimes.com/drastic-increase-in-non-infectious-diseases-in-military-explained-as-data-glitch-whistleblower_4681292.html", "https://www.brighteon.com/51092633-eb02-4ccc-a5ca-0ee6f31683e2", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2022-08-31-cost-of-truth-army-whistleblower-involuntary-separation&linkname=BOOTED%20OUT%3A%20Army%20whistleblower%20faces%20involuntary%20separation%20for%20telling%20the%20truth%20about%20COVID-19", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}