{"result_id": "187027", "URL": "https://www.liberty.news/2021-07-11-government-document-instructs-vaccine-strike-force-teams-how-to-clear-buildings-violate-trespass-laws-and-flag-anti-vaxxers-for-forced-quarantines.html", "timestamp": "2023-04-25 16:15:15 CEST+0200", "meta": {"description": "A government document that has recently surfaced offers horrifying details on how door-to-door “strike force” vaccine enforcement teams plan to operate. Labeled, “Community Health Ambassador Outreach Door Knocking Project,” a now-public document published by the government of Lake County, Illinois, instructs “ambassadors” to: Violate “no soliciting” restrictions and illegally trespass onto private property. Impersonate Health […]", "lang": "en", "keywords": "coercion,door-to-door,forced quarantine,government,health freedom,medical fascism,Medical Tyranny,pandemic,strike forces,vaccine enforcement,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.liberty.news/2021-07-11-government-document-instructs-vaccine-strike-force-teams-how-to-clear-buildings-violate-trespass-laws-and-flag-anti-vaxxers-for-forced-quarantines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.liberty.news", "title": "Government document instructs vaccine “strike force” teams how to clear buildings, violate trespass laws and flag anti-vaxxers for forced quarantines", "cleaned_text": "Government document instructs vaccine “strike force” teams how to clear buildings, violate trespass laws and flag anti-vaxxers for forced quarantines\n\nA government document that has recently surfaced offers horrifying details on how door-to-door “strike force” vaccine enforcement teams plan to operate. Labeled, “Community Health Ambassador Outreach Door Knocking Project,” a now-public document published by the government of Lake County, Illinois, instructs “ambassadors” to:\n• Impersonate Health Dept. officials and attempt to intimidate building managers into consenting to allowing entry for the strike force teams.\n• Lie to the public and falsely claim covid vaccines are safe by withholding information about serious vaccine side effects, including hospitalizations and deaths.\n• Clear buildings in military fashion, going floor by floor, wing by wing, knocking on doors and intimidating residents of apartment buildings and residential units.\n• Recording the locations (address, room number) of anti-vaxxers in order to feed this information into a government database for further action — most likely forced quarantine removal (medical kidnapping).\n\nWhite House spokesperson Jen Psaki announced last week that the Biden regime would activate door-to-door “strike forces” to coerce more people into getting vaccinated:\n\nFollowing that announcement, Lake County, Illinois posted this document that provides instructions for how such teams should operate:\n\nAn accompanying FAQ document (English version) is available here:\n\nLying to the public: False claims that the vaccine is safe and approved\n\nWhile the VAERS system (VAERS.HHS.gov) now reports over 9,000 deaths in the US following covid vaccination, the Lake County government document instructs strike force teams to lie to the public:\n\nQuestion: Is the COVID-19 vaccine safe?\n\n Answer: COVID-19 vaccines are tested in large clinical trials to make sure they meet safety standards… All routine safety standards must be met to ensure that any authorized or approved vaccine is as safe as possible.\n\nNote that these teams are instructed to lie to the public and imply that these are “approved vaccines” which are completely safe. In truth, none of the covid vaccines are FDA approved, and all of them have been linked to hospitalizations, deaths and a long list of side effects including myocarditis (heart inflammation), heart attacks, strokes, blood clots, muscle tremors, neurological problems and more.\n\nThe document instructs strike force team members to illegally trespass onto private property, instructing them to “Ignore no soliciting signs.” Once they illegally obtain access to a building by violating no soliciting signs, they are instructed to impersonate Health Dept. officials, which is also illegal under Illinois law (see citation below).\n\nHere’s the explanation given in the document:\n\nIgnore no soliciting signs. You’re not soliciting! You’re offering critical information and resources. What you are doing is not illegal.\n\nMake clear up front that the building has let you in and you’re from the health department.\n\nFirst, these strike force teams are, in fact, soliciting for the commercial, for-profit benefit of the vaccine manufacturers who stand to generate tens of billions of dollars in vaccine sales, thanks in part to the coercion techniques described in this very document. The fact that Big Pharma corporate profits are being pushed by proxy does not nullify the commercial motivation of the effort. Thus, door-to-door vaccine coercion campaigns are for-profit campaigns that benefit for-profit corporations which fund election campaigns of government officials that are ordering the actions. (RICO style, organized racketeering and criminal operations.)\n\nUnder Illinois Statutes Chapter 720, Criminal Offenses, Subchapter 3, Criminal Trespass to Real Property, the law states: (emphasis added)\n\n(a)?A person commits criminal trespass to real property when he or she:\n\n (1)?knowingly and without lawful authority enters or remains within or on a building;\n\n (2)?enters upon the land of another, after receiving, prior to the entry, notice from the owner or occupant that the entry is forbidden;\n\n (3)?remains upon the land of another, after receiving notice from the owner or occupant to depart;\n\n (3.5)?presents false documents or falsely represents his or her identity orally to the owner or occupant of a building or land in order to obtain permission from the owner or occupant to enter or remain in the building or on the land;\n\nA “no soliciting” sign is prior notice that entry is forbidden. And strike force team volunteers being instructed to tell people, “you’re from the health department” is teaching them to illegally misrepresent themselves as Health Dept. employees or officers, when they are neither.\n\nNote that this document doesn’t tell the volunteers to say, “We’re volunteers and have no real authority to be here.” They are told to imply under color of law that they are Health Dept. employees or officials. This is illegal. It’s the equivalent to a local police department recruiting volunteers and instructing them to say, “I’m from the police department” when they aren’t law enforcement officials.\n\nGives instructions for “clearing” residential buildings, flood by floor, while meticulously recording the locations of those who refuse vaccines\n\nAfter you enter the building, orient yourself so you systematically proceed from floor-to-floor, covering each wing. Utilize the tally sheet to keep count of those interested in getting the vaccine, those who refuse and those with further questions.\n\nThis instruction smacks of military or law enforcement building clearing activities, and its purpose seems clear: To canvass the entire building and record the locations of people who refuse vaccines.\n\nThe obvious question becomes: Why would the government need a database of the physical locations of people who refuse vaccines?\n\nThe obvious answer is: Because they plan to come back, and they need to know where these people are located.\n\nThere are really only two logical reasons why the government would come back: 1) To force vaccinated these people. 2) To medically kidnap them and take them away to covid quarantine centers, almost certainly run by FEMA.\n\nStrike force teams are told to lie about vaccine side effects and downplay their significance, potentially encouraging people to ignore medically serious adverse reactions\n\nIn addition to all the violations mentioned above, these strike force team members are further instructed to lie to the public about vaccine adverse events, downplaying their significance:\n\n…it’s important to know that side effects are a sign that your body is working to build up a defense against the virus. And side effects are not nearly as bad as a bad case of COVID.\n\nThus, they are instructed to tell the public two horrific lies:\n\nLie #1) That side effects are GOOD things, not bad things, and the more side effects you have, the more the vaccine is “working.”\n\nLie #2) That no matter how bad the side effects are, getting covid is worse.\n\nThis dishonest, dangerous misinformation may cause people to avoid seeking emergency medical attention when they suffer serious adverse reactions following vaccination, and this may lead to permanent injury or death. Thus, the Lake County government is directly teaching its strike force team volunteers to distribute misinformation that may get people killed.\n\nFalsely tells people who already have natural immunity that they need to get vaccinated\n\nIn direct violation of medical ethics and overwhelming science, this document tells strike force team members to commit fraud and tell people that natural immunity doesn’t work. Only vaccines can provide safety, they are told.\n\nThese claims are fraudulent, deceitful and dangerous. From the “talking points” document:\n\nQuestion: Do I need to get vaccinated if I already had COVID-19?\n\n Answer: Yes. Right now it’s unclear how long immunity for COVID-19 lasts after you have been sick. We do know that immunity from having the virus decreases over time, especially for mild cases. Getting vaccinated is the best way to protect yourself from getting COVID-19 again.\n\nNowhere in this information are team members told to tell the truth: That most of the people now being hospitalized with covid are those who were previously vaccinated. Nor are they told to inform the public that vaccines are already failing to work against covid variants, such as the Delta variant.\n\nA dangerous precedent that will be used for door-to-door forced quarantines and gun confiscations\n\nWhat these Lake County documents reveal is a dangerous escalation of government dispatching “strike force” teams — likely accompanied by armed personnel at some point — to intimidate, harass and illegally coerce people into doing the government’s bidding. These strike force teams are taught to impersonate public health officials, lie their way into residential buildings, trespass onto private property, deceive the public about vaccine safety and side effects, and make a written recording of those who refuse to be vaccinated.\n\nThis is a coercive, dangerous government initiative being run under color of law “authority” that essentially seeks to intimidate people into complying with gross violations of their civil rights and human rights.\n\nBut since the covid plandemic has established this precedent, governments will readily use this as a template for other campaigns of coercion and intimidation. This will almost certainly include mandatory quarantine efforts where people are literally dragged out of their private residences and swept away to covid camps, against their consent. All it will take is one more “covid variant emergency” and local governments all across the country will leap at the opportunity to assert more power and deprive citizens of their civil rights.\n\nAlmost any new emergency — including those carried out by the government itself — can now be invoked to authorize “emergency” door-to-door visits of citizens, powered by government databases listing names, addresses, vaccine status and gun ownership records, for example. A false flag shooting operation can now be easily invoked to demand door-to-door gun confiscation campaigns across the nation, following the same template discussed here. Teams of volunteers can be taught to impersonate law enforcement and demand gun confiscations in the name of “public safety,” all while violating due process and using tactics of intimidation and coercion ripped right out of Nazi Germany.\n\nCovid internment centers already exist in Canada, New Zealand, Australia and the USA\n\nThe Toronto Sun — a mainstream media news outlet in Canada — has already documented the existence of forced covid quarantine operations there:\n\nYou will have to forgive Steve Duesing for not believing there are no COVID-19 internment centres in Canada.\n\n“I’m in one,” the 34-year-old Scarborough man told the Toronto Sun on Tuesday.\n\n“I was told when I arrived (at Pearson International Airport) Sunday night from Charlotte that it was either three days quarantine or go to jail.”\n\nSo he was escorted on a shuttle bus from Pearson to the nearby Radisson Hotel on Dixon Rd. But this is no normal hotel stay.\n\n“I am not allowed to leave the room,” he said. “There is a guard at the end of the hall.”\n\nFrom Fox News: New Zealand sets up mandatory quarantine ‘camps’ for COVID patients.\n\nFrom Associated Press, in early 2020: Australia defends plan to create island quarantine camp.\n\nFrom the Wall Street Journal: Australia Considers New Covid-19 Quarantine Strategy: Outback Isolation… Fearing the import of new coronavirus strains, one state wants to repurpose remote camps designed for resources workers.\n\nIn Canada, the government is paying private companies to essentially kidnap and imprison people against their will. From HealthFreedom.news: INVESTIGATION: Canadian government PAYING private companies to imprison new workers in covid quarantine camps against their will\n\nEven USA Today, a mouthpiece for Big Pharma, the CDC and the WHO, tried to “fact check” claims about quarantine camps and ended up confirming they are real:\n\nFrom the story: The claim: U.S. military has approved COVID-19 quarantine ‘camps’ that will access personal information and be monitored by militarized CDC police.\n\nUSA Today does not dispute the existence of militarized covid quarantine camps in the USA, but cites some unknown internet user who speculated about exactly what might go on there, attempting to discredit the entire idea.\n\nAnalysis of what comes next: Medical kidnappings, covid death camps and forced inoculations with deadly spike proteins\n\nWhat follows here is my own educated analysis and speculation on where I believe this goes.\n\nFirst, the FDA fraudulently “approves” one or more covid vaccines as “safe and effective” with full regulatory approval. This is likely to happen in September or October of this year, despite all the reports of vaccine deaths.\n\nOnce this is done, local governments — and the Pentagon — start pushing mandatory vaccinations, claiming the vaccine is now “approved” and therefore no one has any reason to object to it.\n\nAt some point, a new covid variant is released — I’ll call it the Omega strain — and the media ratchets its hysteria campaign to unprecedented new levels, spreading mass fear through journo-terrorism psyop campaigns.\n\nIn reaction to the Omega strain, local, state and national governments call for forced quarantines for those who refuse to be vaccinated. The lists of anti-vaxxers now being gathered via door-to-door strike force teams gets handed over to medical kidnap teams.\n\nPeople are ripped out of their homes and thrown into covid prison camps run by FEMA. Most will face extermination via spike protein injections or forced ventilator deaths.\n\nSomewhere along the line, government must come up with a reason to issue a nationwide gun confiscation order and try to go door-to-door, taking away guns and arresting (or executing) those who refuse to comply. All semiautomatic guns will be outlawed from civilian ownership, and the government will use ATF records and FBI background check records to create a list of residential targets which will be hit with armed strike force teams.\n\nThe “final solution” for America is mass extermination via vaccines and covid concentration camps, mass gun confiscation, and the unleashing of total tyranny by a criminal government that honors no boundaries, no human rights and no civil rights.\n\nAmerica will find itself in a desperate war, with the government waging war against its own people\n\nThe only “safe” places will be rural areas in red states, where free Americans push back against the tyranny. Blue cities will fall to mass death / extermination campaigns, with estimated losses in the tens of millions across major U.S. cities over the next 3 years.\n\nMass deaths from vaccine-induced heart failure — caused by micro clots from the spike protein injections — will accelerate from 2022 – 2025, but the medical establishment, tech giants and media propagandists will blame covid “variants” (or the unvaccinated) for all the deaths, using the vaccine holocaust to push for even more aggressive vaccine enforcement, complete with forced quarantines and rapid executions of those who attempt to defend themselves with firearms.\n\nBy 2025, America is unrecognizable as the nation it was once founded to be. Law enforcement will have collapsed across most major cities, and tens of millions of Americans will be dead from spike protein injections and covid concentration camp executions. We will be living under medical martial law, complete with food rations, biometric vaccine passports, highway vaccine checkpoints and even the rationing of water and fuel supplies.\n\nAn engineered debt collapse will have already wiped out of the middle class, forcing tens of millions into homelessness and destitution. Elections will be suspended, and the nation will be vulnerable to land-based attacks from China, entering across the U.S. southern border. Before long, America will find itself occupied by communist Chinese troops, perhaps under the guise of running “humanitarian food assistance missions” which are really just another excuse to see America overrun and destroyed by its enemies.\n\nDisease, starvation, violence and lawlessness will spread across the nation, and many states will be forced to denounce federal tyranny and declare their own sovereign status, likely leading to the breaking up of the “United” States of America, and the forming of new, regional boundaries: Free states (red) vs. Slave states (blue). In the Slave states, run by Democrats, economic collapse and mass death will prevail. In the Free states, deaths will be far fewer, and society may continue to function at some level, even though many such states will find themselves in an active war footing against the tyrannical federal government, now run by communist China.\n\nSo if you thought that vaccines were the worst that might happen, think again: It’s only the beginning.\n\nPrepare now or die. Relocate to a red state or prepare for the worst. Get out of dollars before they collapse, or lose everything. Only the prepared will survive what’s coming, and most people are utterly oblivious to what has just been set in motion.\n\nThe America you once knew is over, and there is no “going back to normal.” History ends here. Now we must decide on what new history we will create together, based on our actions from this day forward. If we do not rise up and resist the tyranny, we will be systematically disarmed, injected and exterminated.\n\nListen to my Situation Update podcast each weekday at:", "opengraph": {"title": "Government document instructs vaccine “strike force” teams how to clear buildings, violate trespass laws and flag anti-vaxxers for forced quarantines", "type": "article", "url": "https://www.liberty.news/2021-07-11-government-document-instructs-vaccine-strike-force-teams-how-to-clear-buildings-violate-trespass-laws-and-flag-anti-vaxxers-for-forced-quarantines.html", "site_name": "Liberty News", "description": "A government document that has recently surfaced offers horrifying details on how door-to-door “strike force” vaccine enforcement teams plan to operate. Labeled, “Community Health Ambassador Outreach Door Knocking Project,” a now-public document published by the government of Lake County, Illinois, instructs “ambassadors” to: Violate “no soliciting” restrictions and illegally trespass onto private property. Impersonate Health […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/07/HRR-2021-07-11-Special-Alert-vaccine-death-squads.jpg"}, "tags": ["pandemic", "government", "vaccine wars", "medical fascism", "forced quarantine", "door-to-door", "coercion", "Medical Tyranny", "vaccine enforcement", "vaccines", "health freedom", "strike forces"], "tweets": [], "movies": [], "links": ["https://www.lakecountyil.gov/DocumentCenter/View/39074/CHA-Doorknocking-Info-and-Script", "https://www.lakecountyil.gov/DocumentCenter/View/39074/CHA-Doorknocking-Info-and-Script", "https://www.lakecountyil.gov/DocumentCenter/View/37998/CHA-Vaccination-Talking-Points_20210114", "https://VAERS.HHS.gov", "https://codes.findlaw.com/il/chapter-720-criminal-offenses/il-st-sect-720-5-17-2.html", "https://www.brighteon.tv", "http://Brighteon.com/e4dff000-a916-4cb8-85f7-d9a82350a821", "https://torontosun.com/news/local-news/warmington-man-in-forced-detention-in-a-canada-covid-camp", "https://video.foxnews.com/v/6205139266001#sp=show-clips", "https://apnews.com/article/asia-pacific-immigration-international-news-christmas-island-indian-ocean-c129280f6ab2a832908b8dcf4888364b", "https://archive.fo/5xH2t", "https://healthfreedom.news/2021-05-03-canadian-government-paying-private-companies-imprison-workers-covid.html", "https://www.usatoday.com/story/news/factcheck/2020/08/09/fact-check-quarantine-sites-real-covid-19-claim-stretches-truth/5499196002/", "http://vaccinedeaths.com", "https://principia-scientific.com/doctor-heart-failure-from-mrna-jabs-will-kill-most-people/", "https://www.brighteon.com/channels/hrreport"], "authors": [], "publish_date": null}