{"result_id": "187039", "URL": "https://liberty.news/2019-02-27-serious-question-when-will-the-first-vaccine-enforcers-be-shot-by-parents-defending-their-children.html", "timestamp": "2023-04-25 16:15:22 CEST+0200", "meta": {"description": "The political Left in America today now openly advocates the murder of living human babies, even after they’re born. This is part of the new abortion legislation that has been passed and signed into law in both New York and Vermont… and the entire idea of killing human babies in the name of “women’s rights” […]", "lang": "en", "keywords": "bad doctors,badhealth,badmedicine,badscience,Dangerous Medicine,fascism,Medical Tyranny,medical violence,police state,self-defense,vaccine enforcers,vaccine mandates,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2019-02-27-serious-question-when-will-the-first-vaccine-enforcers-be-shot-by-parents-defending-their-children.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "A serious question: When will the first “vaccine enforcers” be shot by parents defending their children against the felony assault of forced immunizations?", "cleaned_text": "A serious question: When will the first “vaccine enforcers” be shot by parents defending their children against the felony assault of forced immunizations?\n\nThe political Left in America today now openly advocates the murder of living human babies, even after they’re born. This is part of the new abortion legislation that has been passed and signed into law in both New York and Vermont… and the entire idea of killing human babies in the name of “women’s rights” is spreading to more states, much to the applause of Democrats who cheer the new “right” to kill babies with your bare hands.\n\nOne abortionist recently told a former patient they would, “break the baby’s neck” if it survived an abortion attempt, reports LifeSiteNews:\n\nThe woman said she asked the two abortionists, “If you guys were to take him out right now while he’s still, his heart rate is still, you know, going, what would you guys do?”\n\nShe said one of the abortionists looked at the other one, then looked back at her, “and she told me that we don’t tell women this, and a lot of women don’t even ask this question, but if we was to proceed with the abortion and the baby was to come out still alive and active, most likely we would break the baby’s neck.”\n\nThe very same people who are gleeful about breaking the raw necks of newborn human babies in the name of “women’s health” also claim they “care” about all your other children that you didn’t, for some reason, decide to murder immediately after birth. In fact, according to Democrats, they are so concerned about the health of your children that they demand to come to your private home with a team of armed vaccine enforcers and violate your child’s body with a dangerous, toxic medical intervention that is documented by the U.S. government itself to harm, maim and kill over a thousand U.S. children every year. (Source: VAERS data, HHS)\n\nThe power of the elements: Discover Colloidal Silver Mouthwash with quality, natural ingredients like Sangre de Drago sap, black walnut hulls, menthol crystals and more. Zero artificial sweeteners, colors or alcohol. Learn more at the Health Ranger Store and help support this news site.\n\nAs reported by Natural News in an article entitled ‘Vaccine Industry to partner with police, come after home school students in Iowa for mandated quarterly “health and wellness” checks‘ :\n\nIowa State Representative Mary Mascher has proposed a piece of legislation that would target them in their homes, to enforce compliance. Iowa’s HF 272 would require home school families to submit proof of their child’s vaccination record to the state, while requiring the families to submit to quarterly “health and wellness” safety checks, which may be conducted by officials from the Health and Human Services Department and accompanied by local law enforcement.\n\nIf the parent does not consent, then the district can obtain probable cause from the juvenile court to forcefully enter the home and conduct the observation and the interview. The superintendent of the school district shall “designate a person to carry out the duties.” This person is designated as the “mandatory reporter.” Most sickening, the school district may collaborate with the department of human services and “local, county and service area officers” to enter the home and conduct the checkup.\n\nThis means the vaccine industry is about to recruit gun-toting police to enforce mandatory medical interventions against people who are rationally refusing to give consent to the procedure. There are a huge number of rational reasons to say no to vaccines, including the fact that many vaccine insert sheets openly admit they cause atrocious reactions which may include seizures, comas and even death in certain cases.\n\nRead the language in the following photo of the FLULAVAL vaccine insert sheet.\n\nFLULAVAL is a vaccine indicated for active immunization against influenza disease… but doesn’t ever claim the vaccine actually works.\n\nIn the very next bullet point, the vaccine insert admits:\n\n…there have been no controlled trials adequately demonstrating a decrease in influenza disease after vaccination with FLULAVAL.\n\nIn other words, GlaxoSmithKline confirms there is no evidence to back this flu shot.\n\nThere’s even more. If you keep reading the FLULAVAL insert, it says in black and white text, “Safety and effectiveness of FLULAVAL in pediatric patients have not been established.”\n\nThe same insert also says, “FLULAVAL has not been evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.”\n\nAs you can also see, this same insert also explains that when you’re being injected with a flu shot, you’re also being injected with mercury, formaldehyde and other toxic ingredients:\n\n“Thimerosal, a mercury derivative, is added as a preservative. Each … dose contains 50 mcg thimerosal. Each dose may also contain residual amounts of ovalbumin, formaldehyde, and sodium deoxycholate from the manufacturing process.”\n\nJust some of the adverse effects experienced after flu shot vaccines include:\n• Eye pain and chest pain\n• Arthritis\n• Dizziness, tremors and losing consciousness (syncope)\n• Convulsions and seizures\n• Gullain-Barre Syndrome\n• Cranial nerve paralysis or limb paralysis\n• Swelling of the brain\n• Partial facial paralysis\n\n … and much more. See the text yourself:\n\nHere’s a more complete list of some of the adverse effects typically listed on flu shot vaccine insert sheets:\n\nKnowing all this, imagine a local vaccine enforcer holding down a screaming child by force, jabbing it with an autism-causing toxic brew of aluminum, mercury, formaldehyde and squalene (all ingredients in modern vaccines) while a police officer holds the mother at gunpoint.\n\nThis scenario is about to become a reality in America. The vaccine industry is about to unleash “death squads” across the nation, and if you resist, you may be arrested or shot.\n\nDo parents have the right to protect their children from violent assaults carried out in the name of medicine?\n\nThe right of a parent to protect her child from a violent assault is inherently understood across America, and that right is enshrined both in common law and specific state law almost everywhere. If a unscrupulous person attempts to stab your child with a knife, or penetrate your child in an act of pedophilia rape, or harm your child by kidnapping or assaulting them, you as the parent have every right to deploy all means of self-defense, including, where legal, firearms.\n\nThis right to protect children from violent assaults is not nullified by the false authority of the vaccine deep state, which is steeped in felony crimes, scientific fraud, the abuse of children as human guinea pigs for medical experiments, and a long history of cover-ups to bury the truth about vaccine injuries. Regardless of the false claims of “safety” by the vaccine industry, such claims do not overrule the basic human right of self-defense. Even if vaccines had a perfect safety record and killed no children at all, no medical intervention is justified without informed consent. This fundamental principle of western medicine is enshrined by the American Medical Association, which insists that doctors must inform potential patients about both the possible benefits and risks of any given intervention, then allow the patient (or the parent) to decide whether to consent to the intervention.\n\nThe AMA plainly states in its section entitled Code of Medical Ethics Opinion 2.1.1:\n\nInformed consent to medical treatment is fundamental in both ethics and law. Patients have the right to receive information and ask questions about recommended treatments so that they can make well-considered decisions about care.\n\nIn seeking a patient’s informed consent… physicians should … Present relevant information accurately and sensitively, in keeping with the patient’s preferences for receiving medical information. The physician should include information about:\n\n1. The diagnosis (when known)\n\n 2. The nature and purpose of recommended interventions\n\n 3. The burdens, risks, and expected benefits of all options, including forgoing treatment\n\nWhile exceptions are made for cases in which the patient is unconscious from a serious injury and therefore unable to consent to a lifesaving procedure, there is no medical ethics argument that says children and mothers should be held at gunpoint while they are injected with substances that are known to carry significant risks of harm and even death. Yet this is exactly what is now being proposed in Iowa and California, all under the guise of “public health” by the very same people who claim executing living human babies is not an act of violence against children.\n\nTo force an immunization jab onto a person without their consent is, by any sensible definition, a felony assault. There is no getting around this. To invade, pierce and contaminate the body of another human being against their wishes or consent is an act of violence (or “medical rape”), even when carried out by so-called “authorities.”\n\nThe very idea of such vaccine enforcer teams holding mothers at gunpoint while their children are violated in the name of Big Pharma’s false promises is abhorrent to every last pillar of a free society. No civil society can allow the mandatory vaccine injections of children who are essentially kidnapped at gunpoint by state authorities. And any vaccine enforcer attempting to carry out such an act of medical kidnapping and felony assault against a child may be forcefully resisted and stopped using every legal means available.\n\nIn Texas and many other states, it is within the legal right of any gun owner to deploy a firearm to stop the commission of a felony crime, including crimes of violence against children. Thus, in Texas, if a vaccine enforcement team trespasses on your property, invades your home, attempts to kidnap and assault your child, any reasonable parent would seem to be both morally and legally within their rights to engage those vaccine enforcers with lethal force in order to stop them carrying out a crime of violence against innocent children. I’m not calling for violence, by the way: I’m calling for an end to medical violence against children. I’m also not an attorney, so I cannot advise you on particular actions you might take in your own circumstances, so do your homework first (and get competent legal advice).\n\nAlways act within your local laws, of course, and try to avoid violence wherever possible. Do not initiate violence against anyone, but always be ready to stop violence when it is imminent. A medical assault of a child with a potentially deadly substance is a form of felony assault by any reasonable definition. Concealed carry permits are granted to adults precisely for the purpose of allowing those adults to deploy such tools to halt violence and protect the lives of the innocent. That’s also why the pro-vaccine zealots are also the anti-gun whackos who want all parents to be disarmed. It makes it so much easier to medically assault and penetrate your children when you have no means to stop such acts of violence from being carried out in your own home while you are being held at gunpoint by a pharma-controlled coercive government thug who works for the medical police state.\n\nGun control is the first step to mandatory vaccines, forced euthanasia, eugenics and depopulation injections carried out by the state. The minute you give up your guns, you and your children will be assaulted and forcefully penetrated by the armed narco-pharma state, probably with the help of the same armed FBI thugs who raided the home of Roger Stone.\n\nEven at the federal level, the right of self-defense against a violent assault of an innocent child is widely recognized. That’s why I’m seriously asking at what point the tyranny and medical fascism of the vaccine industry collides with the basic human right of self-defense. Sooner or later, it seems, one of these vaccine enforcers is going to encounter a parent who knows her rights and isn’t afraid to assert them, even in the face of outright vaccine tyranny by the state itself.\n\nAnd can you blame her?\n\nParents have an obligation to protect their children from violence, including medical violence and chemical violence\n\nJust because intruders and trespassers are carrying vaccines does not grant them some supreme power to override the individual right of self-defense. Although I do not have children, if I did have children, and if a vaccine enforcer were attempting to commit a crime of felony assault against my child, I would of course defend my child without hesitation. Any loving parent would do the same thing.\n\nThat’s because all parents have an obligation to protect their children from all forms of violence, including medical violence and chemical violence. Mandatory vaccines encompass both forms of violence at the same time, subjecting children to an unsafe piercing of their skin and the injection of foreign RNA, foreign chemicals and foreign substances into their body. By any definition, this is a felony assault.\n\nIf you don’t believe me, try running around your local town with a needle and jabbing people with it to see what happens. I say this in jest, of course, because if you were stupid enough to carry out such an act of lunacy, you would be immediately arrested and charged with felony assault.\n\nSo why is it somehow okay when a corrupt, paid-off shill of the vaccine industry orders health workers or the local police to do the very same thing? Health workers are not granted immunity from all other laws in society, and if a health worker assaults you with a potentially harmful or deadly substance — which is exactly what vaccines are — you have the right to defend yourself against such an assault using every legal means available.\n\nGood parents, it might be stated, stop bad people who attempt to harm their children. And if the vaccine jihadis are running around society trying to assault homeschooled children, it seems to be only a matter of time before some of them are engaged and stopped by parents who decide to stand their ground.\n\nThe Vaccine Jihadis are part of a fanatical cult that sacrifices children to appease the pharma gods\n\nThat’s why I encourage all the vaccine zealots and vaccine jihadis — I use the term “Jihadi” because the vaccine cult is carrying out a kind of religious fanaticism war against humanity — to think very carefully about what they may encounter across America if they attempt to force risky medical inventions onto children and parents who do not consent to the procedure. No person has any right to force another person to undergo a potentially deadly medical intervention without their consent… this is true even if those carrying out the assault claim to be acting for “the greater good.”\n\nRemember, it was under Nazi Germany that mass euthanasia, eugenics and depopulation programs were carried out “for the greater good,” too. Six million Jews were exterminated under that dogma, and the only way that crime against humanity was stopped was through the use of (Allied) rifles, bullets and bombs. In other words, what the Allies learned in World War II is that the only way to stop an insane, deranged national cult of violent authoritarians is to shoot them dead. You cannot reason with them or negotiate a settlement that respects human life. You simply have to exterminate them at gunpoint, which is exactly what America, France and Russia achieved during that horrific war that saw tens of millions of human exterminated in the name of “the greater good.”\n\nNow the vaccine industry is at war with humanity. In particular, it is at war with human children, much like the abortion industry which is now steeped in infanticide. The vaccine industry cannot be reasoned with, because they censor and block all opposing views. They cannot be negotiated with, because they claim supremacy in the name of “science” while rejecting all evidence that contradicts their cult-like religion of vaccinism. They cannot be made to respect medical ethics, since they believe that their “cause” supersedes all ethics. They actually tell themselves that they must save you against yourself, even if that means injecting you at gunpoint or kidnapping your children in the name of “medical science.”\n\nNo, the vaccine jihadis cannot be reasoned with. They are not operating in good faith and they are not swayed by scientific evidence or even the exploding cases of autism across America, many of which occur mere hours after vaccines are injected into children. The vaccine jihadis must be defeated and stopped using all available legal means, including lawsuits and criminal indictments leveled against them by local prosecutors.\n\nWhen they come for your children, call the police and report a felony assault and kidnapping in progress\n\nWhen they come for your children, will you protect your children against medical violence, or will you surrender them to the tyranny of the medical police state that demands you sacrifice your children to the will of the pharma cartels in order to appease your government “god” controllers?\n\nMy advice is that when they come for your children in your own home, you call the police, report a felony assault and medical kidnapping in progress, demand the criminal prosecution of those carrying it out, and prepare to defend the lives of your children using every legally available tool at your disposal. Then again, I’m not an attorney, so I can’t officially give you legal advice. Do your own research based on local laws and make your own best decision considering your capabilities, finances and circumstances.\n\nPersonally, if I had children, any person who invaded my home and attempted to commit felony violence against my child would be engaged and halted. At some point, I might even call 911 and report the resulting mess to the local sheriff. This seems to be the only reasonable response when living in a world ruled by unreasonable vaccine zealots who have never been told, “No!”\n\nSooner or later, someone is going to stop these perpetrators of medical violence and felony assault against children. It might happen soon in Iowa.\n\nStay informed on this issue and be ready to defend your children, because the vaccine police state is quite literally coming for you. Read John W. Whitehead’s excellent book, “Battleground America,” and visit his website, the Rutherford Institute, at Rutherford.org. Read Tyranny.news and Vaccines.news to stay informed on the important issues.\n\nSee vaccine videos at Brighteon.com, which is rapidly becoming the go-to video site for vaccine truth. See the “Vaxxed” channel there, which now features over 800 vaccine videos, including heartbreaking testimony from parents whose children have been permanently maimed (and even killed, in some cases) by vaccines.\n\nAlso, check out the upcoming documentary film “Vaxxed2” at Vaxxed2.com, where you can even donate to the production costs and help this film get finished in 2019.", "opengraph": {"title": "A serious question: When will the first “vaccine enforcers” be shot by parents defending their children against the felony assault of forced immunizations?", "type": "article", "url": "https://www.liberty.news/2019-02-27-serious-question-when-will-the-first-vaccine-enforcers-be-shot-by-parents-defending-their-children.html", "site_name": "Liberty News", "description": "The political Left in America today now openly advocates the murder of living human babies, even after they’re born. This is part of the new abortion legislation that has been passed and signed into law in both New York and Vermont… and the entire idea of killing human babies in the name of “women’s rights” […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2019/02/mandatory-vaccines.jpg"}, "tags": ["vaccine enforcers", "fascism", "self-defense", "medical violence", "bad doctors", "vaccine mandates", "Medical Tyranny", "vaccines", "police state"], "tweets": [], "movies": [], "links": ["http://infanticide.news/2019-02-27-the-nazis-decided-who-lived-and-who-died-democrats-party-of-infanticide.html", "https://www.lifenews.com/2019/02/27/planned-parenthood-doc-said-she-would-break-the-babys-neck-if-born-alive-after-abortion/", "https://vaers.hhs.gov/data.html", "https://colloidalsilvermouthwash.healthrangerstore.com/colloidal-silver-mouthwash.html", "https://www.naturalnews.com/2019-02-27-vaccine-industry-plans-to-come-after-home-school-students.html", "http://vaccineinjurynews.com", "https://www.naturalnews.com/048571_mandatory_vaccines_code_of_ethics_american_medical_association.html", "https://www.ama-assn.org/delivering-care/ethics/informed-consent", "http://violence.news", "http://vaccinejihad.com", "http://Rutherford.org", "http://Tyranny.news", "http://Vaccines.news", "http://Brighteon.com", "https://www.brighteon.com/channel/liverpool8997", "http://Vaxxed2.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2019-02-27-serious-question-when-will-the-first-vaccine-enforcers-be-shot-by-parents-defending-their-children&linkname=A%20serious%20question%3A%20When%20will%20the%20first%20%E2%80%9Cvaccine%20enforcers%E2%80%9D%20be%20shot%20by%20parents%20defending%20their%20children%20against%20the%20felony%20assault%20of%20forced%20immunizations%3F", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}