{"result_id": "187048", "URL": "https://liberty.news/2021-05-11-florida-lawmakers-bill-total-ban-vaccine-passports.html", "timestamp": "2023-04-25 16:15:27 CEST+0200", "meta": {"description": "Legislators in Florida passed a bill instituting a total ban on vaccine passports in the Sunshine State. On April 29, the Florida Legislature passed Senate Bill (SB) 2006 – which prevents both government agencies and private businesses from requiring people to show proof of vaccination before availing of a product or service. The bill bolsters […]", "lang": "en", "keywords": "Anthony Sabatini,badmedicine,coronavirus vaccine,covid-19 pandemic,Florida,Florida legislature,goodhealth,goodmedicine,goodscience,health freedom,Medical Tyranny,Ron DeSantis,Senate Bill 2006,vaccine passports,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2021-05-11-florida-lawmakers-bill-total-ban-vaccine-passports.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Florida lawmakers pass bill banning vaccine passports in the state", "cleaned_text": "Legislators in Florida passed a bill instituting a total ban on vaccine passports in the Sunshine State. On April 29, the Florida Legislature passed Senate Bill (SB) 2006 – which prevents both government agencies and private businesses from requiring people to show proof of vaccination before availing of a product or service. The bill bolsters an executive order signed by Gov. Ron DeSantis early that month prohibiting the use of vaccine passports.\n\nAccording to the bill, “any business operating in this state may not require patrons or customers to provide any documentation certifying COVID-19 vaccination or post-infection recovery to gain access to, entry upon or service from the business operations in this state.” Businesses who flout the state government’s vaccine passport ban can face fines of up to $5,000 per violation.\n\nThe bill also extended to government offices and educational institutions. It said that these two “may not require persons to provide any documentation certifying COVID-19 vaccination or post-infection recovery” as a pre-requisite for service. However, the bill provided caveats for both entities: They are still permitted to institute “screening protocols in accordance with state or federal law to protect public health.”\n\nBased on its text, SB 2006 appears to take DeSantis’s vaccine passport ban a step further. ClickOrlando.com reported that the governor signed an executive order on April 2 banning the use of such passports in the state. “Requiring so-called COVID-19 vaccine passports for taking part in everyday life … would create two classes of citizens based on vaccination, the order said.” It continued that vaccines are not required in Florida and a person’s decision to get vaccinated is private health information.\n\nThe Republican governor has been vocal about his opposition to vaccine passports. He slammed such documents as unnecessary during a March 30 press conference. “It’s completely unacceptable for either the government or the private sector to impose upon you the requirement that you show proof of [vaccination] to just simply be able to participate in normal society,” he said. (Related: South Koreans without vaccine passports will not be able to go to work and enter stores.)\n\nThe joint effort by Florida’s legislative and executive branches gives more legal basis for banning vaccine passports\n\nWith the Florida Legislature passing SB 2006, it only needs DeSantis’s signature to become a law. State Rep. Anthony Sabatini announced the bill’s passing in a tweet. His Apr. 29 post said: “Just voted to ban vaccine passports in Florida. [The] bill passed 76-40.”\n\nThe GOP state lawmaker previously remarked that DeSantis’s April 2 executive order ought to be passed into law. “This [executive] order is immediate, but must be passed into law. As a state [representative], I’ll be fighting to make sure this law passes [as soon as possible],” Sabatini earlier tweeted.\n\nSabatini told National File that he and his allies in the Florida Legislature are trying to “limit the role of local governments to interfere with people’s personal lives and liberty, including medical freedom.” He added that they were “pushing back” against “businesses in [the] state [and] woke corporations.” These entities aim to “mandate vaccines and control the lives of every consumer,” Sabatini argued. (Related: Former Clinton adviser warns that vaccine passports could lead to “end of human liberty.”)\n\nThe state lawmaker continued: “It’s the ‘woke’ corporations [such as the] airlines [and] the cruise industry. They’re the ones who would have tried to require a vaccine passport.” He also exhorted other GOP states to use Florida’s new law as a model. “Pass the same exact bill. Take the bill and pass it in every state in the country,” Sabatini commented.\n\nBut according to Lawrence Gostin, director of Georgetown University‘s O’Neill Institute for National and Global Health Law, the Florida governor’s executive order was unlikely to have an impact. However, he remarked that laws passed by state legislatures – such as SB 2006 – may be more effective in curtailing moves by local governments to mandate vaccine passports.\n\nHe told NBC News via an email: “Governors [such as DeSantis] have no power to prohibit cities or counties from issuing passports or banning the private sector. But if the [Florida Legislature] or other state legislature passed a law, it could pre-empt local governments from issuing passports.”\n\nA number of GOP states – such as Texas, Arizona and South Dakota – have followed the footsteps of Florida by issuing executive orders that ban vaccine passports. However, it remains to be seen if their respective legislatures will pass laws similar to what the Sunshine State did.\n\nVisit MedicalTyranny.com to read more news about the fight against COVID-19 vaccine passports.", "opengraph": {"title": "Florida lawmakers pass bill banning vaccine passports in the state", "type": "article", "url": "https://www.liberty.news/2021-05-11-florida-lawmakers-bill-total-ban-vaccine-passports.html", "site_name": "Liberty News", "description": "Legislators in Florida passed a bill instituting a total ban on vaccine passports in the Sunshine State. On April 29, the Florida Legislature passed Senate Bill (SB) 2006 – which prevents both government agencies and private businesses from requiring people to show proof of vaccination before availing of a product or service. The bill bolsters […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/05/Travel-App-Passport-Vaccine-Coronavirus-Covid-19.jpg"}, "tags": ["vaccine passports", "Anthony Sabatini", "Florida", "Florida legislature", "coronavirus vaccine", "covid-19 pandemic", "Medical Tyranny", "Senate Bill 2006", "Ron DeSantis", "health freedom", "Wuhan coronavirus"], "tweets": [], "movies": [], "links": ["https://humansarefree.com/2021/04/florida-legislature-passes-bill-banning-vaccine-passports.html", "https://nationalfile.com/breaking-florida-legislature-passes-bill-banning-vaccine-passports/", "https://www.flsenate.gov/Session/Bill/2021/2006/BillText/e1/HTML", "https://www.clickorlando.com/news/local/2021/04/02/florida-governor-signs-executive-order-banning-vaccine-passport-use-at-businesses/", "https://www.naturalnews.com/2021-04-07-south-korean-prime-minister-coronavirus-vaccine-passport.html", "https://twitter.com/AnthonySabatini/status/1387462391005384709", "https://twitter.com/AnthonySabatini/status/1378039674707533827", "https://www.naturalnews.com/2021-04-01-former-clinton-adviser-vaccine-passports-end-liberty.html", "https://www.georgetown.edu/", "https://www.nbcnews.com/politics/politics-news/politicization-vaccine-passports-could-aggravate-gop-hesitancy-experts-warn-n1263048", "https://medicaltyranny.com/", "https://humansarefree.com/2021/04/florida-legislature-passes-bill-banning-vaccine-passports.html", "https://nationalfile.com/breaking-florida-legislature-passes-bill-banning-vaccine-passports/", "https://www.flsenate.gov/Session/Bill/2021/2006/BillText/e1/HTML", "https://www.clickorlando.com/news/local/2021/04/02/florida-governor-signs-executive-order-banning-vaccine-passport-use-at-businesses/", "https://twitter.com/AnthonySabatini/status/1387462391005384709", "https://twitter.com/AnthonySabatini/status/1378039674707533827", "https://www.nbcnews.com/politics/politics-news/politicization-vaccine-passports-could-aggravate-gop-hesitancy-experts-warn-n1263048"], "authors": [], "publish_date": null}