{"result_id": "187015", "URL": "https://liberty.news/2019-02-04-is-big-vaccine-plotting-to-use-argentinas-new-mandatory-vaccine-law-as-blueprint-for-similar-tyranny-in-america-watch-at-brighteon.html", "timestamp": "2023-04-25 16:15:08 CEST+0200", "meta": {"description": "It’s been 13 years in the making, but the so-called REAL ID Act, which was passed into law by the Bush Administration back in 2005 following the 9/11 terrorist attacks, is finally being implemented by the Trump Administration. But the tyrannical implications of what it could entail for everyday Americans in terms of their health […]", "lang": "en", "keywords": "Argentina,Big Pharma,Dangerous Medicine,forced vaccination,health freedom,health tyranny,Mandatory vaccines,Mar Siegel,Medical Tyranny,medical violence,Parental rights,Real ID,REAL ID Act,vaccine industry,vaccine jihad,vaccine mandates", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2019-02-04-is-big-vaccine-plotting-to-use-argentinas-new-mandatory-vaccine-law-as-blueprint-for-similar-tyranny-in-america-watch-at-brighteon.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Is Big Vaccine plotting to use Argentina’s new mandatory vaccine law as blueprint for similar tyranny in America? Watch at Brighteon.com", "cleaned_text": "Is Big Vaccine plotting to use Argentina’s new mandatory vaccine law as blueprint for similar tyranny in America? Watch at Brighteon.com\n\nIt’s been 13 years in the making, but the so-called REAL ID Act, which was passed into law by the Bush Administration back in 2005 following the 9/11 terrorist attacks, is finally being implemented by the Trump Administration. But the tyrannical implications of what it could entail for everyday Americans in terms of their health freedom is nothing short of terrifying – and most Americans are completely unaware of what it entails.\n\nDuring a recent episode of “The HighWire” with Del Bigtree, available for viewing at Brighteon.com, Bigtree interviewed Robert Scott Bell about how the REAL ID Act threatens the freedom of Americans to refuse “mandatory” vaccinations.\n\nSimilar to what’s currently taking place in Argentina, where mandatory vaccinations are now a prerequisite for travel and other “privileges,” the REAL ID Act here in the United States contains open-ended provisions that allow for federal regulators to alter its requirements over time – without Congressional approval.\n\n“The head of the Department of Homeland Security has the ability under this law to continue to expand, without congressional oversight, what laws and rules apply to this REAL ID,” Bell warned during the segment.\n\n“We could see an expansion into limiting your ability to travel if you are not fully vaccinated. Tie this into the REAL ID, tie this into the Health People 2020 mandates where they’re looking to go into adult mandates for vaccination,” he added.\n\nBe sure to watch the full segment below:\n\nIn Argentina, citizens are being told vaccines are both a “right” and an “obligation”\n\nArgentinians are already suffering the dire consequences of this type of tyrannical government overreach, as they’re reportedly no longer able to obtain passports, driver’s licenses, and various other necessities they require in order to freely move about and travel – and some say that America could be next, unless Americans fight back against this encroaching evil.\n\nGet CLEAN FOOD and help support our mission to keep you informed: The Health Ranger Store lab verifies everything we sell with accredited testing for heavy metals, microbiology and food safety. Certified organic facility, ISO-accredited on-site laboratory, no GMOs or synthetic ingredients. The world's #1 source of lab-verified clean foods and superfoods for nutritional healing. 600+ products available. Explore now.\n\n“The law is perhaps the most overarching example seen to date of how invasive a government can become by forcing a medical intervention [vaccines] with questionable safety profiles onto its people,” wrote Jefferey Jaxen in an article published at RobertScottBell.com.\n\n“The recently approved law indicates ‘certification of compliance with the National Vaccination Calendar must be required’ including for passports, driver’s licenses and National Identity Documents (DNI).”\n\nIt’s the type of thing that vaccine tyrants like Fox News Medical Correspondent, Dr. Marc Siegel, are chomping at the bit to see implemented here in the U.S., which currently functions as the global hub for Big Vaccine.\n\nBy incorporating various tracking and surveillance tools like biometrics, a.k.a. facial recognition, the REAL ID Act could potentially be exploited as a weapon against medical freedom. Bell says that Big Brother can very easily tie individuals’ biometric data into their vaccine records, making it simpler than ever for the federal government to track who’s been vaccinated in accordance with official guidelines, and who’s resisting the agenda by exercising their constitutional right to autonomous control over their own bodies.\n\n“The people of Argentina are now under siege by a medical-industrial complex that is actively forcing invasive medical products [vaccines] of questionable value upon them,” Jaxen adds.\n\n“The slow, boiling frog process experienced in the U.S. of incrementally eroding individual and parental rights with state laws, tracking systems and continual media propaganda has been abandoned in Argentina as their leadership has gone for broke. The desperation appears clear that medical systems are desperately trying to keep people locked into a limited healing paradigm.”\n\nFor more vaccine-related news, be sure to check out Vaccines.news. You can also keep up with the latest news about Big Pharma’s assault against health freedom by visiting MedicalViolence.com.", "opengraph": {"title": "Is Big Vaccine plotting to use Argentina’s new mandatory vaccine law as blueprint for similar tyranny in America? Watch at Brighteon.com", "type": "article", "url": "https://www.liberty.news/2019-02-04-is-big-vaccine-plotting-to-use-argentinas-new-mandatory-vaccine-law-as-blueprint-for-similar-tyranny-in-america-watch-at-brighteon.html", "site_name": "Liberty News", "description": "It’s been 13 years in the making, but the so-called REAL ID Act, which was passed into law by the Bush Administration back in 2005 following the 9/11 terrorist attacks, is finally being implemented by the Trump Administration. But the tyrannical implications of what it could entail for everyday Americans in terms of their health […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2019/02/T-2017-HRR-Vaccine-tyranny-medical-police-state.jpg"}, "tags": ["REAL ID Act", "Big Pharma", "Mar Siegel", "Real ID", "health tyranny", "forced vaccination", "medical violence", "vaccine industry", "vaccine jihad", "Medical Tyranny", "vaccine mandates", "Argentina", "health freedom", "Mandatory vaccines", "Parental rights"], "tweets": [], "movies": [], "links": ["https://www.newsweek.com/what-real-id-new-airport-security-cards-issued-california-and-states-787238", "https://www.brighteon.com/5992048005001", "https://www.naturalnews.com/2019-01-24-argentina-launches-new-vaccine-mandate.html", "http://healthrangerstore.com", "http://healthrangerstore.com", "http://www.robertscottbell.com/government/argentinas-new-mandatory-vaccine-law-blueprint-for-u-s-real-id-by-jefferey-jaxen/", "https://www.naturalnews.com/2019-01-31-fox-news-now-demanding-the-criminalization-and-arrest-of-anti-vaxxers.html", "http://vaccines.news", "http://medicalviolence.com", "https://www.newsweek.com/what-real-id-new-airport-security-cards-issued-california-and-states-787238", "https://www.brighteon.com/5992048005001", "https://www.naturalnews.com/2019-01-24-argentina-launches-new-vaccine-mandate.html", "http://www.robertscottbell.com/government/argentinas-new-mandatory-vaccine-law-blueprint-for-u-s-real-id-by-jefferey-jaxen/", "https://www.naturalnews.com/2019-01-31-fox-news-now-demanding-the-criminalization-and-arrest-of-anti-vaxxers.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2019-02-04-is-big-vaccine-plotting-to-use-argentinas-new-mandatory-vaccine-law-as-blueprint-for-similar-tyranny-in-america-watch-at-brighteon&linkname=Is%20Big%20Vaccine%20plotting%20to%20use%20Argentina%E2%80%99s%20new%20mandatory%20vaccine%20law%20as%20blueprint%20for%20similar%20tyranny%20in%20America%3F%20Watch%20at%20Brighteon.com", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}