{"result_id": "187008", "URL": "https://liberty.news/2023-03-07-california-bill-merck-gardasil-hpv-vaccine-eighth-grade.html", "timestamp": "2023-04-25 16:15:02 CEST+0200", "meta": {"description": "Proposed legislation submitted to the California State Assembly would require children in eighth grade to be vaccinated against HPV using Merck’s dangerous Gardasil vaccine. Introduced on Feb. 9 to the State Assembly, Assembly Bill 659, known as the “Cancer Prevention Act,” would require HPV vaccinations for all incoming eighth graders in both public and private schools in […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,California,california collapse,campus insanity,children's health,Dangerous Medicine,freedom,Gardasil,health freedom,HPV,HPV vaccine,Medical Tyranny,Merck,pharmaceutical fraud,public schools,Vaccine dangers,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2023-03-07-california-bill-merck-gardasil-hpv-vaccine-eighth-grade.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Proposed California bill seeks to mandate Merck’s Gardasil HPV vaccine for children entering eighth grade", "cleaned_text": "Proposed legislation submitted to the California State Assembly would require children in eighth grade to be vaccinated against HPV using Merck’s dangerous Gardasil vaccine.\n\nIntroduced on Feb. 9 to the State Assembly, Assembly Bill 659, known as the “Cancer Prevention Act,” would require HPV vaccinations for all incoming eighth graders in both public and private schools in California with few exceptions. (Related: Warning as Merck’s COVID-19 pill molnupiravir is reportedly causing new mutations of the virus.)\n\nThe Food and Drug Administration‘s current recommendation is for children to be vaccinated against HPV between the ages of eight and 12.\n\nThe first hearings by the Assembly’s Health Committee could begin as early as March 14. If it passes through the Assembly and State Senate and is signed into law by Gov. Gavin Newsom, it could go into effect as early as 2024.\n\n“If there is a way to prevent cancer, why not do this?” claimed State Assembly Member Cecilia Aguiar-Curry, a Democrat and the main sponsor of the bill. She claimed in an interview that these vaccinations could also help determine if children experience adverse reactions to Gardasil.\n\n“With that additional time, parents of vaccine-vulnerable children have plenty of time to take advantage of the medical exemption that is in the bill,” said Aguiar-Curry. The current draft of the bill provides exemptions for students who are homeschooled or those with medical conditions that make them exceptionally vulnerable to vaccinations.\n\n“People keep saying it’s just a woman’s issue. No, it’s not just a woman’s issue. It’s a people’s issue. I have a philosophy that anything I can do to prevent cancer, I’m going to do that,” said Aguiar-Curry. “I know that people are going to be at my doorstep yelling and screaming at me, but this is a fact of saving lives.”\n\nCall to lower age for Gardasil HPV vaccine “just another marketing ploy”\n\nMichael Baum, a senior attorney with Wisner Baum, the main law firm representing the consolidated lawsuits of young American men and women who were seriously injured by Merck’s HPV vaccine, noted that Merck’s plan is “just another Merck marketing ploy to expand Gardasil use among nine- to 10-year-old children.”\n\n“The goal of medicine should be health, not completion of a profit-driven protocol,” noted Mary Holland, president of Children’s Health Defense, in a statement about how Merck’s goal is for more of its Gardasil vaccines to be sold.\n\nShe further noted how numerous reports have popped up linking the vaccine to the appearance of serious health complications, including autoimmune disorders and negative neurological effects.\n\n“Children and adults around the world have been disabled and died from Gardasil shots,” said Holland. “These shots should no longer be on the market.”\n\nIn California, not everybody is on board with the idea of mandating the HPV vaccine.\n\n“This whole mandatory thing, there is no choice, parents have no choice, children have no choice,” said Donald Harte, a chiropractor who opposes the bill.\n\n“Anything mandated makes me a little worried,” said mom Destiny Childress. “I don’t think mandating it is a good idea … We should always have [other] options.”\n\nLearn more about experimental and dangerous vaccines at Vaccines.news.\n\nWatch this clip from “The Stew Peters Show” as host Stew Peters interviews Rochelle Wilson, a victim of Gardasil, and how the HPV vaccine gave her all kinds of neurological issues.\n\nThis video is from the channel The Prisoner on Brighteon.com.\n\nCOLLUSION: Merck, Big Pharma trying to kill off all generic ivermectin production because it’s cutting into profits.\n\nMore than 30 Christian employees FIRED by San Diego’s community college system for refusing COVID-19 vaccinations.\n\nMerck’s Gardasil vaccine crippled a young man – an ongoing medical tragedy that must be stopped.", "opengraph": {"title": "Proposed California bill seeks to mandate Merck’s Gardasil HPV vaccine for children entering eighth grade", "type": "article", "url": "https://www.liberty.news/2023-03-07-california-bill-merck-gardasil-hpv-vaccine-eighth-grade.html", "site_name": "Liberty News", "description": "Proposed legislation submitted to the California State Assembly would require children in eighth grade to be vaccinated against HPV using Merck’s dangerous Gardasil vaccine. Introduced on Feb. 9 to the State Assembly, Assembly Bill 659, known as the “Cancer Prevention Act,” would require HPV vaccinations for all incoming eighth graders in both public and private schools in […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2023/03/Gardasil-Vaccine-Destroy.jpg"}, "tags": ["big government", "Big Pharma", "Merck", "campus insanity", "vaccine mandate", "public schools", "Vaccine dangers", "vaccine wars", "Medical Tyranny", "HPV vaccine", "children's health", "Gardasil", "California", "vaccines", "HPV", "freedom", "health freedom", "california collapse", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/merck-lower-age-gardasil-hpv-vaccine/", "https://abc7news.com/hpv-vaccine-california-mandate-8th-grade-human-papillomavirus-sti/12816158/", "https://www.cbs8.com/article/news/local/proposed-legislation-would-require-hpv-vaccine/509-3e004468-654f-40c6-87b9-70b1c70e448f", "https://www.naturalnews.com/2023-02-03-merck-covid-pill-molnupiravir-causing-mutations-virus.html", "https://vaccines.news/", "https://www.brighteon.com/973380b6-3b7b-4af4-b14a-efe2bee0c73d", "https://www.brighteon.com/channels/theprisoner", "https://www.brighteon.com/channels/theprisoner", "https://bigpharmanews.com/2023-03-02-big-pharma-kill-ivermectin-cutting-profits.html", "https://naturalnews.com/2023-02-23-christians-fired-college-system-over-covid-vaccinations.html", "https://bigpharmanews.com/2022-08-02-student-athlete-injured-by-gardasil-sues-merck.html", "https://vaccines.news/2021-01-26-mercks-gardasil-vaccine-cripples-young-man.html", "https://www.brighteon.tv", "https://medicine.news/2020-07-17-gardasil-vaccines-lead-to-cancer-epidemic-in-young-girls.html", "https://childrenshealthdefense.org/defender/merck-lower-age-gardasil-hpv-vaccine/", "https://abc7news.com/hpv-vaccine-california-mandate-8th-grade-human-papillomavirus-sti/12816158/", "https://www.cbs8.com/article/news/local/proposed-legislation-would-require-hpv-vaccine/509-3e004468-654f-40c6-87b9-70b1c70e448f", "https://www.brighteon.com/973380b6-3b7b-4af4-b14a-efe2bee0c73d", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2023-03-07-california-bill-merck-gardasil-hpv-vaccine-eighth-grade&linkname=Proposed%20California%20bill%20seeks%20to%20mandate%20Merck%E2%80%99s%20Gardasil%20HPV%20vaccine%20for%20children%20entering%20eighth%20grade", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}