{"result_id": "187017", "URL": "https://liberty.news/2023-03-23-physician-assistant-fired-reporting-covid-vaccine-adverse-reactions.html", "timestamp": "2023-04-25 16:15:09 CEST+0200", "meta": {"description": "A physician assistant in New York was fired from her job after reporting Wuhan coronavirus (COVID-19) vaccine reactions to the Vaccine Adverse Events Reporting System (VAERS). Deborah Conrad first noticed the side effects of the COVID-19 injections in 2021. However, these adverse reactions were being ignored by fellow medical professionals. Conrad’s colleagues were also hesitant […]", "lang": "en", "keywords": "adverse reactions,badhealth,badmedicine,Big Pharma,conspiracy,corruption,covid-19,Dangerous Medicine,Deborah Conrad,deception,medical fascism,Medical Tyranny,pandemic,pharmaceutical fraud,physician assistant,vaccine damage,vaccine injury,vaccine wars,vaccines,VAERS,Whistleblower,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2023-03-23-physician-assistant-fired-reporting-covid-vaccine-adverse-reactions.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Physician assistant FIRED for reporting adverse COVID vaccine reactions to VAERS", "cleaned_text": "A physician assistant in New York was fired from her job after reporting Wuhan coronavirus (COVID-19) vaccine reactions to the Vaccine Adverse Events Reporting System (VAERS).\n\nDeborah Conrad first noticed the side effects of the COVID-19 injections in 2021. However, these adverse reactions were being ignored by fellow medical professionals. Conrad’s colleagues were also hesitant to report these, so she took the initiative of doing so.\n\nBut when she tried to file reports with VAERS, senior officials in her workplace did not take too kindly to her actions.\n\n“They kept telling me, ‘We’re looking into it’ and ‘We’ll get back to you,'” she said. “Around April 2021, leadership came back and said no one else is reporting injuries – implying that I was crazy and there was nothing really going on with the vaccines.”\n\nConrad was then accused of over-reporting to VAERS and “contributing to vaccine hesitancy” as her reports implied that the vaccines were unsafe. Her workplace became a “very hostile environment” after that. “No one cared,” she lamented. (Related: New York physician assistant says she was told to stop reporting COVID shot injuries.)\n\n“Finally, I had it. It was so unethical, I couldn’t take it anymore. I couldn’t remain silent, even if it meant losing my career and everything I worked for. I was fired a few weeks later and walked out like a criminal in front of all my peers.”\n\nSpeaking to the Epoch Times, Conrad herself disclosed that she was never trained to even acknowledge VAERS or adverse events related to the shots throughout her education as a physician’s assistant.\n\n“When it came to learning about the vaccines, we learned the basic immunology associated with the vaccines and the adult and childhood schedule, but there’s no discussion on their side effects,” she said. “We go into practice with the idea that vaccines are safe and effective. I never considered otherwise until COVID-19 happened.”\n\nConrad outlines the damage caused by the COVID-19 injections\n\nThe physician assistant also disclosed that there was an “uptick in unusual symptoms” after the COVID-19 vaccines were rolled out. She had never seen some of the symptoms in her 20-year career, she added.\n\n“In every case, it was in somebody who had received the COVID-19 vaccine.”\n\nAmong the cases she saw were recently vaccinated children suffering from intense bouts of pneumonia. “They weren’t able to walk or eat, and they were completely and totally fatigued,” Conrad said. The children were completely healthy before getting injected with the vaccine.\n\nShe also addressed the rising cases of myocarditis or heart muscle inflammation linked to the COVID-19 vaccines, most especially with the mRNA shots from Pfizer and Moderna.\n\n“A lot of these myocarditis cases came in with fevers because of this massive inflammatory response that was taking place in the body,” Conrad said. “They would be labeled as septic, treated as if we were treating pneumonia or fevers of unknown origin. We’d treat them with antibiotics and all sorts of other things, not realizing that they were having heart failure.”\n\nMoreover, the physician assistant revealed that she had never encountered an adult patient with a respiratory syncytial virus (RSV) – which typically affects children – until the COVID-19 vaccines were released to the public.\n\n“It’s not normal,” she remarked, pertaining to adult patients being admitted with RSV. “Every patient who came in with RSV was vaccinated for COVID-19.”\n\nGiven these negative reactions to the vaccine, Conrad emphasized that “these VAERS reports are critical to assuring these vaccines are safe for us all.”\n\nIt was only after her termination for speaking the truth and advocating for the safety of Americans that she realized that “the whole system is corrupt.”\n\n“The light in this whole experience for me is that now, I’m aware of how deep the lies and corruption really are,” Conrad said. “I could no longer be a part of a system that is lying to the American people.”\n\nMedicalTyranny.com has more stories like this.\n\nWatch Deborah Conrad discuss what happened after her termination on “The HighWire with Del Bigtree.”\n\nThis video is from The HighWire with Del Bigtree channel on Brighteon.com.\n\nVAERS whistleblower Debra Conrad tells Dr. Bryan Ardis: Healthcare workers are required by law to report adverse reactions to COVID vaccines – Brighteon.TV.\n\nWhistleblower: FDA and CDC both know, but won’t admit, that 90% of covid patient hospitalizations are the fully vaccinated.\n\nAnalyst says systematic flaws prevent VAERS from accurately tracking adverse reactions to vaccines.\n\nTop reasons why healthcare professionals refuse to speak up about covid vaccine injury and death.", "opengraph": {"title": "Physician assistant FIRED for reporting adverse COVID vaccine reactions to VAERS", "type": "article", "url": "https://www.liberty.news/2023-03-23-physician-assistant-fired-reporting-covid-vaccine-adverse-reactions.html", "site_name": "Liberty News", "description": "A physician assistant in New York was fired from her job after reporting Wuhan coronavirus (COVID-19) vaccine reactions to the Vaccine Adverse Events Reporting System (VAERS). Deborah Conrad first noticed the side effects of the COVID-19 injections in 2021. However, these adverse reactions were being ignored by fellow medical professionals. Conrad’s colleagues were also hesitant […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2023/03/Covid-19-Coronavirus-Nurse-Vaccine-Syringe-Vial.jpg"}, "tags": ["pandemic", "conspiracy", "Big Pharma", "deception", "corruption", "Whistleblower", "covid-19", "VAERS", "Wuhan coronavirus", "physician assistant", "vaccine wars", "Medical Tyranny", "pharmaceutical fraud", "medical fascism", "adverse reactions", "Deborah Conrad", "vaccine injury", "vaccines", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/physician-assistant-fired-after-reporting-adverse-reactions-to-the-covid-19-vaccine-to-vaers/", "https://www.naturalnews.com/2021-11-30-physician-assistant-told-to-stop-reporting-vaccine-injuries.html", "https://www.theepochtimes.com/physician-assistant-fired-for-reporting-covid-vaccine-adverse-events-to-vaers_5130783.html", "https://deception.news", "https://www.brighteon.tv", "http://MedicalTyranny.com", "https://www.brighteon.com/930968b3-4a73-4e9e-8169-be7b08d9e22b", "https://www.brighteon.com/channels/highwire", "https://medicine.news/2022-09-01-health-care-workers-report-adverse-reactions-vaccines.html", "https://cdc.news/2021-10-19-fda-cdc-90percent-covid-hospitalizations-fully-vaccinated.html", "https://vaccines.news/2021-11-02-vaers-not-accurately-tracking-vaccine-adverse-reactions.html", "https://vaccinewars.com/2021-11-24-reasons-healthcare-professionals-refuse-to-speak-up.html", "https://health.news/2021-10-28-manipulating-vaers-data-through-underreporting.html", "https://100percentfedup.com/physician-assistant-fired-after-reporting-adverse-reactions-to-the-covid-19-vaccine-to-vaers/", "https://www.theepochtimes.com/physician-assistant-fired-for-reporting-covid-vaccine-adverse-events-to-vaers_5130783.html", "https://www.brighteon.com/930968b3-4a73-4e9e-8169-be7b08d9e22b", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2023-03-23-physician-assistant-fired-reporting-covid-vaccine-adverse-reactions&linkname=Physician%20assistant%20FIRED%20for%20reporting%20adverse%20COVID%20vaccine%20reactions%20to%20VAERS", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}