{"result_id": "187028", "URL": "https://liberty.news/2019-01-27-world-health-organization-declares-anti-vax-movement-a-top-global-health-threat-just-like-climate-change-hoax.html", "timestamp": "2023-04-25 16:15:15 CEST+0200", "meta": {"description": "The deep state is utterly petrified that the general public is finally waking up to the Great Vaccine Hoax – so much so that, in a desperate attempt to scare people into still getting vaccinated, the World Health Organization (WHO) recently put out a fear-mongering claim that vaccine refusal represents one of the biggest global […]", "lang": "en", "keywords": "anti-vaxxers,bad doctors,badhealth,Dangerous Medicine,deception,deep state,Flu shots,Globalism,health freedom,immunization,lies,measles,Medical Tyranny,MMR,Orwellian,side effects,vaccination,vaccines,WHO,World Health Organization", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2019-01-27-world-health-organization-declares-anti-vax-movement-a-top-global-health-threat-just-like-climate-change-hoax.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "World Health Organization declares anti-vax movement to be a top “global health threat” just like the climate change hoax… the vaccine deep state grows desperate", "cleaned_text": "World Health Organization declares anti-vax movement to be a top “global health threat” just like the climate change hoax… the vaccine deep state grows desperate\n\nThe deep state is utterly petrified that the general public is finally waking up to the Great Vaccine Hoax – so much so that, in a desperate attempt to scare people into still getting vaccinated, the World Health Organization (WHO) recently put out a fear-mongering claim that vaccine refusal represents one of the biggest global health threats of 2019.\n\nIn addition to things like air pollution, “climate change,” a global influenza pandemic, and dengue fever, “vaccine hesitancy” is now classified by the WHO as a global health crisis, as “vaccine hesitancy threatens to reverse progress in tackling vaccine-preventable diseases” – vaccine hesitancy, as defined by the WHO, constituting any refusal or delay in getting vaccinated, assuming vaccines are readily available, according to official government guidelines and schedules.\n\nAccording to the WHO, somewhere between two and three million deaths are prevented every year as a result of vaccination – though concrete data to back this up remains murky, if not completely non-existent. If more people were to agree to get vaccinated, the WHO contends, upwards of 1.5 million more deaths could be avoided – though, again, there’s no valid scientific evidence to back this claim, either.\n\n“Measles, for example, has seen a 30 percent increase in cases globally,” the WHO claims, ignoring the fact that MMR vaccines for measles, mumps, and rubella not only cause more measles, but also cause more deaths from measles, compared to non-vaccinated individuals who contract measles naturally.\n\nMother Nature's micronutrient secret: Organic Broccoli Sprout Capsules now available, delivering 280mg of high-density nutrition, including the extraordinary \"sulforaphane\" and \"glucosinolate\" nutrients found only in cruciferous healing foods. Every lot laboratory tested. See availability here.\n\nIt’s important to keep in mind that measles is much like the chicken pox in that it’s a relatively harmless disease when contracted naturally. As depicted in an old episode of “The Brady Bunch,” for instance, contracting measles has never historically been all that big of a deal – and once a person recovers from it naturally, he or she has lifelong immunity, unlike the temporary “immunity,” at best, that’s afforded by MMR vaccines.\n\nAt least the WHO admitted in the same statement that this 30 percent increase in measles cases globally is, in fact, caused by other things besides not getting vaccinated – though we would contend that not getting vaccinated plays no role whatsoever in causing more cases of measles.\n\n“The reasons for this rise are complex, and not all of these cases are due to vaccine hesitancy,” WHO states. “However, some countries that were close to eliminating the disease have seen a resurgence,” it adds, suggesting that this automatically points to people not getting vaccinated.\n\nMore and more parents are refusing vaccines for their children, report finds\n\nBut once again, there’s no evidence to prove this – just hearsay. And that’s why parents are increasingly deciding to forego vaccines for their little ones, instead choosing to allow them to develop natural immunity without the need for deadly chemicals, aborted human fetal tissue, and the many other toxins found in government-sanctioned vaccines.\n\nFlu shots are also declining in popularity, as revealed in a recent report published by the Chicago Department of Public Health (CDPH).\n\nAccording to Dr. Julie Morita, CDPH’s Commissioner, a whopping 83 percent of local parents refused to get flu shots for their children at Lurie Children’s Hospital. And an impressive 14 percent of local parents, the same report found, refused vaccines of all types, pointing to a growing trend of parents doing their homework independently, regardless of what health officials tell them.\n\nInstead of flu shots and vaccines in general, Vaxxter recommends that you “[w]ash your hands frequently (but not obsessively); make sure your 25-OH Vitamin D level is between 80 and 100 nmol/l; take Vitamin C Ascorbates 3000mg/day; (and) avoid white sugar, white flour and white rice.”\n\nFor more related news, be sure to check out Vaccines.news.", "opengraph": {"title": "World Health Organization declares anti-vax movement to be a top “global health threat” just like the climate change hoax… the vaccine deep state grows desperate", "type": "article", "url": "https://www.liberty.news/2019-01-27-world-health-organization-declares-anti-vax-movement-a-top-global-health-threat-just-like-climate-change-hoax.html", "site_name": "Liberty News", "description": "The deep state is utterly petrified that the general public is finally waking up to the Great Vaccine Hoax – so much so that, in a desperate attempt to scare people into still getting vaccinated, the World Health Organization (WHO) recently put out a fear-mongering claim that vaccine refusal represents one of the biggest global […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2019/02/Doctor-Evil-Scary-Death-Skull-Vaccine-Abstract.jpg"}, "tags": ["MMR", "immunization", "vaccination", "Orwellian", "deep state", "side effects", "deception", "World Health Organization", "bad doctors", "measles", "Medical Tyranny", "vaccines", "anti-vaxxers", "lies", "health freedom", "WHO", "Flu shots", "Globalism"], "tweets": [], "movies": [], "links": ["http://crazzfiles.com/who-list-anti-vaccine-movement-as-one-of-top-2019-threats/", "https://www.naturalnews.com/2019-01-17-science-confirms-vaccines-spread-measles.html", "https://www.naturalnews.com/2019-01-21-measles-vaccine-linked-to-127-deaths-in-last-15-years.html", "http://organicbroccolisproutpowder.healthrangerstore.com/organic-broccoli-sprout-powder-capsules.html", "https://www.naturalnews.com/049050_measles_vaccine_propaganda_MMR.html", "https://www.naturalnews.com/2017-12-01-measles-mortality-rates-the-efficacy-and-safety-of-vaccines.html", "https://vaxxter.com/83-of-parents-refuse-flu-shot-at-chicago-hospital-stunning-health-officials/", "http://vaccines.news", "http://crazzfiles.com/who-list-anti-vaccine-movement-as-one-of-top-2019-threats/", "https://www.naturalnews.com/2019-01-17-science-confirms-vaccines-spread-measles.html", "https://www.naturalnews.com/2019-01-21-measles-vaccine-linked-to-127-deaths-in-last-15-years.html", "https://www.naturalnews.com/049050_measles_vaccine_propaganda_MMR.html", "https://www.naturalnews.com/2017-12-01-measles-mortality-rates-the-efficacy-and-safety-of-vaccines.html", "https://vaxxter.com/83-of-parents-refuse-flu-shot-at-chicago-hospital-stunning-health-officials/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2019-01-27-world-health-organization-declares-anti-vax-movement-a-top-global-health-threat-just-like-climate-change-hoax&linkname=World%20Health%20Organization%20declares%20anti-vax%20movement%20to%20be%20a%20top%20%E2%80%9Cglobal%20health%20threat%E2%80%9D%20just%20like%20the%20climate%20change%20hoax%E2%80%A6%20the%20vaccine%20deep%20state%20grows%20desperate", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}