{"result_id": "187020", "URL": "https://liberty.news/2022-09-23-nurse-fired-refusing-vax-testifies-against-mandate.html", "timestamp": "2023-04-25 16:15:10 CEST+0200", "meta": {"description": "A health worker terminated for refusing the Wuhan coronavirus (COVID-19) shot gave a strong testimony against the vaccine mandate currently in place in California’s San Diego County. Former nurse Tawny Buettner testified before local administrators during the Sept. 13 meeting of the San Diego County Board of Supervisors. Her testimony focused on Supervisor Nathan Fletcher, who was […]", "lang": "en", "keywords": "badhealth,badmedicine,board of supervisors,California,covid-19,Dangerous Medicine,freedom,health freedom,Liberty,medical fascism,Medical Tyranny,myocarditis,Nathan Fletcher,pandemic,public meeting,Rady Children's Hospital,Resist,San Diego County,Tawny Buettner,testimony,vaccine,vaccine damage,vaccine mandate,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2022-09-23-nurse-fired-refusing-vax-testifies-against-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "California nurse fired for declining COVID shot testifies against San Diego County’s vax mandate", "cleaned_text": "A health worker terminated for refusing the Wuhan coronavirus (COVID-19) shot gave a strong testimony against the vaccine mandate currently in place in California’s San Diego County.\n\nFormer nurse Tawny Buettner testified before local administrators during the Sept. 13 meeting of the San Diego County Board of Supervisors. Her testimony focused on Supervisor Nathan Fletcher, who was in attendance that day.\n\n“I was ridiculed by those who were supposed to be my colleagues and my friends,” said Buettner, who formerly worked at the cardiovascular intensive care unit (ICU) at Rady Children’s Hospital.\n\n“I am the face of your misinformation campaign, Nathan. I am the one who lost my career in pediatric cardiovascular ICU care. I took care of children who had COVID. I never got COVID at the hospital. I tested twice a week. I wore my PPE because I love my job, and I love this community.”\n\nBuettner also mentioned that she took care of children affected with myocarditis after being injected with the COVID-19 vaccines. The said cases were not reported to the Vaccine Adverse Event Reporting System, she revealed. (Related: COVID vaccines found to increase risk of myocarditis in children by over 13,000 percent.)\n\n“It was an unspoken thing that we were not allowed to talk about openly on the unit.”\n\nAccording to San Diego outlet KUSI News, Buettner had worked at Rady for 13 years. She was “removed from the bedside” in October 2021 due to noncompliance with San Diego County’s vaccine mandate for health workers. However, other hospitals in the county allowed unvaccinated nurses to remain employed with exceptions.\n\nEventually, Rady “removed the unvaccinated nurses because they were too great a risk” – even though vaccinated employees were not being tested for COVID-19.\n\nBuettner was placed on unpaid, unprotected leave for six months, then officially terminated from her job on March 1. She explained that she didn’t realize how much passion she had for being a nurse and saving children’s lives until it was taken from her.\n\nA day after the hearing, Buettner sat down with KUSI News anchor Lauren Phinney to talk about her testimony. The former nurse, a resident of Fletcher’s district, told the “Good Morning San Diego” host that she reached out to the supervisor’s office many times – but received no replies.\n\n“I sat through the Board of Supervisors meeting and was listening to the comments,” she said during the Sept. 14 interview. “I had a completely separate speech that I wanted to give. The topic was specifically on money allocation for testing and the continuance of the [county] emergency order.”\n\nBuettner specifically pointed her finger at Fletcher for pushing the policies that led to the loss of her career, eventually deciding to tell him face-to-face during the public hearing. According to the former nurse, her testimony sought “to hold Fletcher accountable for his poor leadership.” The county supervisor degraded those who opposed COVID-19 vaccine mandates by accusing them of spreading misinformation.\n\n“When I got up there, I was explaining who I was. And I realized: I’m not a nurse anymore, I don’t take care of these children anymore. That’s the speech that I ended up giving.”\n\n“I was never disciplined, I’ve never had any complaints. I was always someone who was considered a leader on my unit, and then I was removed from the bedside because of politics.”\n\nThe former nurse also told Phinney that Rady later accepted religious exemptions for the COVID-19 booster dose, and allowed nurses with approved religious exemptions to continue working bedside.\n\n“Because of the rhetoric that has gone on, those within hospital leadership are able to make claims that we have found … are unsubstantiated in many respects.”\n\n“We know the vaccine does not prevent infection … [and] it doesn’t prevent transmission. And so, we need to be able to have a conversation about that and allow people to continue to work within their jobs.”\n\nBuettner found a silver lining in spite of her termination, telling the KUSI News anchor that since losing her job, she has been “trying to be an advocate” for all the other healthcare professionals and hospital employees who were fired for noncompliance with COVID-19 vaccine mandates.\n\nWatch nurse practitioner Tamika Morrow reveal the dangers of the COVID-19 vaccine below.\n\nThis video is from the Take Heed Lest Ye Fall channel on Brighteon.com.\n\nYoung nurse suffers from hemorrhage and brain swelling after second dose of Pfizer’s COVID-19 vaccine.", "opengraph": {"title": "California nurse fired for declining COVID shot testifies against San Diego County’s vax mandate", "type": "article", "url": "https://www.liberty.news/2022-09-23-nurse-fired-refusing-vax-testifies-against-mandate.html", "site_name": "Liberty News", "description": "A health worker terminated for refusing the Wuhan coronavirus (COVID-19) shot gave a strong testimony against the vaccine mandate currently in place in California’s San Diego County. Former nurse Tawny Buettner testified before local administrators during the Sept. 13 meeting of the San Diego County Board of Supervisors. Her testimony focused on Supervisor Nathan Fletcher, who was […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2022/09/Latex-Glove-Vaccine-Vial-Syringe.jpg"}, "tags": ["pandemic", "Tawny Buettner", "Liberty", "public meeting", "Resist", "myocarditis", "Rady Children's Hospital", "board of supervisors", "Nathan Fletcher", "covid-19", "vaccine", "vaccine mandate", "Wuhan coronavirus", "Medical Tyranny", "testimony", "medical fascism", "San Diego County", "freedom", "health freedom", "California", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/california-nurse-fired-for-refusing-covid-jab-gives-powerful-testimony-against-county-vaccine-mandate/", "https://www.kusi.com/former-nurse-calls-out-sup-nathan-fletchers-failed-policies-that-led-to-loss-of-her-career/", "https://vaccinedamage.news", "https://naturalnews.com/2022-03-01-covid-vaccines-increase-risk-of-myocarditis-in-children-by-over-13000-percent.html", "https://www.brighteon.tv", "https://medicaltyranny.com", "https://www.brighteon.com/db0bcf4c-0928-4a6b-bfd4-cf2d14967cf2", "https://www.brighteon.com/channels/takeheedlestyefall", "https://collapse.news/2021-09-24-exodus-nurse-quits-tyrannical-covid-vaccine-mandates.html", "https://healthfreedom.news/2021-08-22-healthcare-workers-quit-over-maine-vaccine-mandates.html", "https://resist.news/2021-06-02-houston-methodist-employees-sue-covid-vaccine-mandate.html", "https://vaccinedamage.news/2021-02-17-young-nurse-suffers-hemorrhage-covid-vaccine.html", "https://www.lifesitenews.com/news/california-nurse-fired-for-refusing-covid-jab-gives-powerful-testimony-against-county-vaccine-mandate/", "https://www.kusi.com/former-nurse-calls-out-sup-nathan-fletchers-failed-policies-that-led-to-loss-of-her-career/", "https://www.brighteon.com/db0bcf4c-0928-4a6b-bfd4-cf2d14967cf2", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2022-09-23-nurse-fired-refusing-vax-testifies-against-mandate&linkname=California%20nurse%20fired%20for%20declining%20COVID%20shot%20testifies%20against%20San%20Diego%20County%E2%80%99s%20vax%20mandate", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}