{"result_id": "187002", "URL": "https://www.liberty.news/2021-06-09-texas-prohibits-businesses-from-requiring-vaccine-passports.html", "timestamp": "2023-04-25 16:14:58 CEST+0200", "meta": {"description": "Gov. Greg Abbott of Texas has signed into law a bill prohibiting private businesses and government entities from requiring proof of vaccination for the Wuhan coronavirus (Covid-19). Now that the Lone Star State is “open 100 percent,” Abbott announced in a video posted to Twitter that the next step was to ensure that “you have […]", "lang": "en", "keywords": "Abbott,businesses,coronavirus,COVID,freedom,goodhealth,goodmedicine,Liberty,prohibited,Texas,vaccination,vaccine passports,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.liberty.news/2021-06-09-texas-prohibits-businesses-from-requiring-vaccine-passports.html", "encoding": "UTF-8"}, "image": null, "domain": "www.liberty.news", "title": "Texas prohibits businesses from requiring “vaccine passports”", "cleaned_text": "Gov. Greg Abbott of Texas has signed into law a bill prohibiting private businesses and government entities from requiring proof of vaccination for the Wuhan coronavirus (Covid-19).\n\nNow that the Lone Star State is “open 100 percent,” Abbott announced in a video posted to Twitter that the next step was to ensure that “you have the freedom to go where you want without limits.”\n\nBack in March, Abbott ended all lockdowns and mask mandates, effectively reopening the state of Texas mostly back to what it was before the plandemic.\n\nThe only thing left was to stop the medical fascists who are trying to make “vaccine passports” a thing. The good news is that they are failing, and failing big time, as even far-left states are realizing that mandatory injections are unpopular among both Republicans and Democrats.\n\n“No business or government entity can require a person to provide a vaccine passport or any other vaccine information as a condition of receiving any service or entering any place,” the legislation states.\n\nKnown as SB 968, the bill covers many other aspects of a public health disaster and associated public health emergency preparedness and response. It was first approved back in April unanimously, and was passed by the state House by a vote of 146-2 later in May.\n\nEffective immediately, Texas businesses “may not require a customer to provide any documentation certifying the customer’s COVID-19 vaccination or post-transmission recovery on entry to, to gain access to, or to receive service from the business.”\n\nIn order to conduct business in the state of Texas, all companies must comply with the law or else face penalties, including potential closure.\n\n“State agencies in charge of different business sectors can require that businesses comply with the new law as a condition to be authorized to conduct business in Texas,” reported The Epoch Times.\n\n“Furthermore, businesses that don’t comply with the law will not be able to enter any state contracts and will be ineligible to receive a grant.”\n\nCarnival Cruise Line says it will still require proof of vaccination because that’s what “guests expect”\n\nTexas businesses will still be allowed to implement other Chinese Virus infection protocols if they so choose, just so long as they align with state and federal laws governing the protection of “public health.”\n\nBusinesses that decide to go this route will be excluded from receiving any kind of public funding, however they will still not be allowed to require vaccine passports under any circumstances.\n\nThe Carnival Cruise Line, which operates out of the Port of Galveston, issued a statement indicating that U.S. Centers for Disease Control and Prevention (CDC) guidelines make it too difficult to accommodate unvaccinated passengers, so vaccine passports will still be required.\n\n“Current CDC requirements for cruising with a guest base that is unvaccinated will make it very difficult to deliver the experience our guests expect,” Carnival insists, adding that it plans to reinstate operations for vaccinated passengers only starting on July 3.\n\nThe CDC has decreed that if cruise liners are to obtain a conditional sailing certificate for simulated (“trial) voyages during the Wuhan coronavirus (Covid-19) plandemic, then their volunteer passengers must show proof of being fully vaccinated or present written documentation that the passenger has no medical conditions that pose a high risk for Chinese Virus infection.\n\nIt is this latter stipulation that Carnival appears to be ignoring in its quest to only let vaccinated passengers travel aboard its vessels. All we have to say is: Let the lawsuits against Carnival for medical discrimination commence.\n\nTo keep up with the latest about the Wuhan coronavirus (Covid-19), be sure to check out Pandemic.news.", "opengraph": {"title": "Texas prohibits businesses from requiring “vaccine passports”", "type": "article", "url": "https://www.liberty.news/2021-06-09-texas-prohibits-businesses-from-requiring-vaccine-passports.html", "site_name": "Liberty News", "description": "Gov. Greg Abbott of Texas has signed into law a bill prohibiting private businesses and government entities from requiring proof of vaccination for the Wuhan coronavirus (Covid-19). Now that the Lone Star State is “open 100 percent,” Abbott announced in a video posted to Twitter that the next step was to ensure that “you have […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/06/Texas-Flag-Background-Wood-State-Texture-Wall.jpg"}, "tags": ["vaccine passports", "Abbott", "Liberty", "COVID", "prohibited", "Texas", "vaccines", "coronavirus", "freedom", "businesses", "vaccination"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/texas-bans-businesses-from-requiring-vaccine-passports_3848787.html", "https://www.naturalnews.com/2021-03-03-texas-ends-all-coronavirus-lockdowns-mask-mandates.html", "http://pandemic.news", "https://www.theepochtimes.com/texas-bans-businesses-from-requiring-vaccine-passports_3848787.html", "https://www.naturalnews.com/2021-03-03-texas-ends-all-coronavirus-lockdowns-mask-mandates.html"], "authors": [], "publish_date": null}