{"result_id": "187026", "URL": "https://liberty.news/2019-02-26-fda-commissioner-vaccine-exemptions-need-to-be-expanded.html", "timestamp": "2023-04-25 16:15:14 CEST+0200", "meta": {"description": "In a telling interview with CNN, the Commissioner for the Food and Drug Administration (FDA), Dr. Scott Gottlieb, stated that vaccine laws at the state level are “lax” and exemptions are too easy to obtain. Gottlieb said that widespread exemptions to vaccination may “force the hand of the federal health agencies” to mandate vaccines at […]", "lang": "en", "keywords": "adverse events,autism,Big Pharma,Child abuse,coercion,compounding toxicity,Dangerous Medicine,encephalitis,exemptions,fda commissioner,goodhealth,goodmedicine,immunity,immunization,informed consent,ingredients,Parental rights,science integrity,toxins,vaccine inserts,vaccine safety,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2019-02-26-fda-commissioner-vaccine-exemptions-need-to-be-expanded.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Sorry FDA Commissioner: Vaccine exemptions need to be expanded, not eliminated", "cleaned_text": "Sorry FDA Commissioner: Vaccine exemptions need to be expanded, not eliminated\n\nIn a telling interview with CNN, the Commissioner for the Food and Drug Administration (FDA), Dr. Scott Gottlieb, stated that vaccine laws at the state level are “lax” and exemptions are too easy to obtain. Gottlieb said that widespread exemptions to vaccination may “force the hand of the federal health agencies” to mandate vaccines at the federal level.\n\nPerpetual vaccine marketing, propaganda, and vaccine laws have not convinced hundreds of thousands of Americans to blindly submit their children to mandated injections. These pro-common sense Americans have weighed the risk versus reward of vaccines and have either delayed vaccination, chosen a reduced schedule, or decided NO altogether. They have either witnessed vaccine injury, reported vaccine injury, been compensated for vaccine injury (including autism), or have lost a loved one to “SIDS,” a life threatening allergy, seizure disorders, or encephalitis (brain swelling) following vaccination.\n\nVaccine exemptions should be expanded, not removed by federal laws\n\nBecause of the widespread problems with vaccination, which are documented extensively by testimonial accounts at the Vaccine Adverse Events Reporting System (VAERS), vaccine exemptions should drastically be expanded, not removed. Sorry FDA Commissioner, but you’re doing a horrible job on public health issues, yet you are doing so well pushing the needless vaccines that your agency should be cracking down on. It’s a surprise the President has not fired you after you publicly supported coercion in medicine.\n\nCurrently, children are not allowed to attend preschool or receive a public education if they have not been vaccinated according to state requirements; however, there are ways to opt out of vaccine requirements in each state. In forty-seven states, parents can opt out of vaccines for religious and/or medical reasons. In eighteen states, parents can additionally opt out of vaccines based on personal belief. Three states, West Virginia, Mississippi, and California, have removed all parental rights and only allow medical exemptions approved by a state-licensed medical doctor.\n\nMother Nature's micronutrient secret: Organic Broccoli Sprout Capsules now available, delivering 280mg of high-density nutrition, including the extraordinary \"sulforaphane\" and \"glucosinolate\" nutrients found only in cruciferous healing foods. Every lot laboratory tested. See availability here.\n\nAs the authoritarian FDA pressures states to limit vaccine exemptions further, parents must always remember that their child is not the property of the state and definitely not the property of the federal government. Every vaccine dose is a choice that requires informed consent. Because medical professionals are biased and sometimes coercive with vaccine administration, not only should they be required to give informed consent to parents, but they should also disclose their conflicts of interest and provide the full vaccine insert. Most importantly, medical professionals should respect the concerns and decisions of parents, especially informed parents who have witnessed vaccine injury. Medical professionals should never be allowed to discriminate against parents and violate medical ethics by refusing them medical care if they choose to forgo vaccination.\n\nHere are five new vaccine exemptions that states should adopt to protect parental rights and reduce coercion:\n\nToxic Substance Abuse Exemption: If after being informed of the ingredients in a vaccine, a parent determines that an ingredient in question would be illegal to feed to their child, they may claim a toxic substance abuse exemption. A parent may determine that an ingredient in question should not be forcefully introduced pass their child’s gastrointestinal tract because doing so would be akin to poisoning the child or committing child abuse.\n\nCompounding Toxicity Exemption: Upon being informed of the type and amount of toxic ingredients used in the vaccine, a parent may determine that the compounding toxicity of multiple vaccines poses a health threat to their child. The parent may forgo any further vaccine recommendations because higher concentrations of toxic elements pose greater health threats to the low blood volume and body weight of a child.\n\nScience Integrity Exemption: Upon determining that the science of vaccination is not synonymous with 100 percent provable efficacy for immunization, a parent should be able to claim a science integrity exemption. With this exemption, parents believe that waning vaccine immunity is not scientifically sufficient to guarantee their child strong immunity throughout life. A parent may choose to opt out of a measles vaccination because they prefer their child is exposed to the virus in the environment so they can gain real, lifelong immunity. Did you know that Health and Human Services recently admitted in court that they haven’t filed required vaccine safety reports in thirty years? Did you know that Merck virologists admit the company faked mumps vaccine efficacy for more than a decade?\n\nCoercion exemption: If a parent feels that a pediatrician, nurse, or other healthcare professional misled them about the need to vaccinate, did not provide adequate informed consent, or coerced them in any way, the parent may claim a coercion exemption. A parent may exempt their kid from the vaccine because the vaccine was promulgated for ulterior interests and controlling reasons that violate medical ethics.\n\nNecessity Exemption: A necessity exemption for a particular vaccine could be obtained if a parent determines that the vaccine is unnecessary for the disease it alleges to protect against. For example, parents who do not have hepatitis B should be able to claim a necessity exemption for their newborn. Newborns are currently vaccinated for Hep B carte blanche, with no scientific rationale to justify the measure. Likewise, a parent may determine that a rota-virus vaccine is unnecessary for the problem it is trying to prevent: a specific case of diarrhea.\n\nParents who are informed about disease risk versus adverse events from vaccines should not be bullied by the state and forced to submit to a coercive dictates. Parents should understand that their children can face viruses and bacteria and overcome them, without fearing death. Parents should understand the failure of “vaccine efficacy” and how impure ingredients cause health problems in their child. Most importantly, parents should have the leading role in determining whether each vaccine is safe or necessary for their child. The FDA should be concerned with vaccine safety, instead of limiting the rights of parents.\n\nKeep up-to-date with vaccine research at Vaccines.News.", "opengraph": {"title": "Sorry FDA Commissioner: Vaccine exemptions need to be expanded, not eliminated", "type": "article", "url": "https://www.liberty.news/2019-02-26-fda-commissioner-vaccine-exemptions-need-to-be-expanded.html", "site_name": "Liberty News", "description": "In a telling interview with CNN, the Commissioner for the Food and Drug Administration (FDA), Dr. Scott Gottlieb, stated that vaccine laws at the state level are “lax” and exemptions are too easy to obtain. Gottlieb said that widespread exemptions to vaccination may “force the hand of the federal health agencies” to mandate vaccines at […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2019/02/FDA.png"}, "tags": ["informed consent", "Big Pharma", "exemptions", "toxins", "compounding toxicity", "vaccine inserts", "Parental rights", "Child abuse", "encephalitis", "immunization", "fda commissioner", "science integrity", "vaccine safety", "ingredients", "autism", "adverse events", "coercion", "vaccines", "immunity"], "tweets": [], "movies": [], "links": ["https://www.cnn.com/2019/02/20/health/vaccine-exemptions-fda-gottlieb/index.html", "https://www.thenewamerican.com/usnews/health-care/item/31551-fda-boss-to-states-eliminate-vaccine-exemptions-or-else?fbclid=IwAR0m-18pbYfyT1fdUUcH-kNAHnR7-20W2KsI9rqEMfZtAe3F75mrq0DS8x4", "http://ahrp.org/federal-court-compensated-83-vaccine-injured-autistic-children/", "https://vaers.hhs.gov/", "http://www.vaccinesafety.edu/cc-exem.htm", "http://organicbroccolisproutpowder.healthrangerstore.com/organic-broccoli-sprout-powder-capsules.html", "https://www.ama-assn.org/delivering-care/ethics/informed-consent", "https://thefreethoughtproject.com/hhs-vaccine-safety-reports-lawsuit/", "https://www.naturalnews.com/036328_Merck_mumps_vaccine_False_Claims_Act.html", "http://vaccines.news", "https://www.cnn.com/2019/02/20/health/vaccine-exemptions-fda-gottlieb/index.html", "https://www.thenewamerican.com/usnews/health-care/item/31551-fda-boss-to-states-eliminate-vaccine-exemptions-or-else?fbclid=IwAR0m-18pbYfyT1fdUUcH-kNAHnR7-20W2KsI9rqEMfZtAe3F75mrq0DS8x4", "http://ahrp.org/federal-court-compensated-83-vaccine-injured-autistic-children/", "https://thefreethoughtproject.com/hhs-vaccine-safety-reports-lawsuit/", "https://www.ama-assn.org/delivering-care/ethics/informed-consent", "https://www.naturalnews.com/036328_Merck_mumps_vaccine_False_Claims_Act.html", "http://www.vaccinesafety.edu/cc-exem.htm", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2019-02-26-fda-commissioner-vaccine-exemptions-need-to-be-expanded&linkname=Sorry%20FDA%20Commissioner%3A%20Vaccine%20exemptions%20need%20to%20be%20expanded%2C%20not%20eliminated", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}