{"result_id": "187046", "URL": "https://liberty.news/2022-02-03-european-countries-move-to-ease-pandemic-rules.html", "timestamp": "2023-04-25 16:15:26 CEST+0200", "meta": {"description": "Several European countries are now moving to ease their pandemic rules, including Finland, the U.K., Denmark and Ireland. Finnish Prime Minister Sanna Marin recently announced that the country will be lifting all Wuhan coronavirus (COVID-19) restrictions by mid-February, but controls would start to ease as early as this week. This will include restrictions on restaurants and sports […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,covid restrictions,covid-19,EU,Europe,health freedom,infections,Liberty,mask mandates,medical fascism,Medical Tyranny,outbreak,pandemic,vaccine mandates,vaccine passports,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2022-02-03-european-countries-move-to-ease-pandemic-rules.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "End of COVID-19 tyranny: European countries move to ease pandemic rules", "cleaned_text": "Several European countries are now moving to ease their pandemic rules, including Finland, the U.K., Denmark and Ireland.\n\nFinnish Prime Minister Sanna Marin recently announced that the country will be lifting all Wuhan coronavirus (COVID-19) restrictions by mid-February, but controls would start to ease as early as this week. This will include restrictions on restaurants and sports facilities.\n\nMarin also said that the lifting of restrictions should be done “in a gradual manner” as the pandemic is still placing a “relatively high burden” on hospital resources.\n\nMeanwhile, Finnish Minister of Justice Anna-Maja Henriksson said that the COVID-19 vaccine passports are currently not justified as it limits the basic rights of those who haven’t been vaccinated, obtained a negative test result or have been previously infected by the virus.\n\nThe U.K., Denmark and Ireland have also announced that they will be relaxing or scrapping their COVID-19 restrictions.\n\nU.K. Prime Minister Boris Johnson announced the end of some COVID-related restrictions in England, including passports, mask mandates and work restrictions. (Related: Dr. Paul Cottrell talks coronavirus solutions with Mike Adams.)\n\nFor Scotland and Wales, the removal of certain omicron limitations is underway, although mandatory indoor masks and vaccine passports will remain in place.\n\n“As COVID becomes endemic, we will need to replace legal requirements with advice and guidance, urging people with the virus to be careful and considerate of others,” Johnson said.\n\nDays after the U.K.’s announcement, Ireland’s leaders announced the limitations that will remain in place in their country, including COVID-19 certificates, social distancing, curfews and capacity limits of public areas and businesses.\n\nDenmark Health Minister Magnus Geunicke said that while they don’t know what’s going to happen next December, the Danish government promised its citizens that it will only enforce restrictions when truly necessary and that they will be lifted as soon as possible. Vaccine passports and mask mandates for restaurants, bars and other venues are also ending despite the high case rates in the country.\n\nAuthorities say that the virus no longer qualifies as a “critical threat” due to their high vaccination rates. To date, over 80 percent of the population over the age of five are fully vaccinated, while over 60 percent have already been given their third dose.\n\nEpidemiologist Lone Simonsen of the University of Roskilde said that with omicron not being severe for those who are vaccinated, lifting restrictions is now reasonable.\n\nThe national COVID pass app is also no longer required, although event organizers can still choose to use it as a condition of entry in different venues. (Related: How many ways is the flu vaccine failing us?)\n\nThe early moves of these nations to relax precautions are based on the declining case counts, the highly contagious omicron has still fueled more cases worldwide over the past 10 weeks compared to 2020. However, the World Health Organization said that some countries may consider relaxing their rules if they have high immunity rates or if their health care systems are strong enough.\n\nIn the U.S., local leaders have different responses. The city of Denver is ending requirements for proof of vaccination and mask rules for businesses and public spaces but will be keeping them for schools and public transportation.\n\nNew York plans to review whether or not to keep the state’s mask mandates as cases have plummeted significantly since the omicron surge. New York City is now averaging 4,200 cases a day compared to 41,000 at the beginning of the year.\n\nOver 370 million cases and 5.6 million deaths linked to COVID have been reported worldwide, but the slowing down of the omicron variant in many places has given hope to citizens and experts that the outbreak is about to enter a new phase where it will become endemic – like the regular flu, which may remain persistent, but manageable to live with.\n\nAussie state lawmakers call to scrap all COVID restrictions in Victoria.\n\nFully vaccinated people make up 71% of new cases and 60% of COVID hospitalizations in US.\n\nWas Omicron engineered by WHITE HATS as a self-spreading ANTIDOTE to end the covid pandemic?\n\nIsrael now #1 in covid cases per capita, proving all the draconian vaccinations, lockdowns and restrictions are utterly worthless and stupid.\n\nIf masks are no longer needed in UK, why do they work in the USA? Does the virus know what continent it’s on?\n\nWatch the video below to learn more about COVID rates in the vaccinated vs. the unvaccinated.\n\nThis video is from The HighWire with Del Bigtree channel on Brighteon.com.\n\nFollow Pandemic.news for more updates about the coronavirus pandemic.", "opengraph": {"title": "End of COVID-19 tyranny: European countries move to ease pandemic rules", "type": "article", "url": "https://www.liberty.news/2022-02-03-european-countries-move-to-ease-pandemic-rules.html", "site_name": "Liberty News", "description": "Several European countries are now moving to ease their pandemic rules, including Finland, the U.K., Denmark and Ireland. Finnish Prime Minister Sanna Marin recently announced that the country will be lifting all Wuhan coronavirus (COVID-19) restrictions by mid-February, but controls would start to ease as early as this week. This will include restrictions on restaurants and sports […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2022/02/european-union-flag-grunge.jpg"}, "tags": ["pandemic", "vaccine passports", "EU", "big government", "covid-19", "Liberty", "medical fascism", "vaccine wars", "mask mandates", "outbreak", "infections", "vaccine mandates", "Medical Tyranny", "vaccines", "Europe", "covid restrictions", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.ntd.com/growing-number-of-countries-ending-covid-19-rules_735145.html", "https://www.naturalnews.com/2020-03-31-dr-paul-cottrell-talks-coronavirus-solutions-with-mike-adams-video-interview.html", "https://www.bbc.com/news/world-europe-60215200", "https://ruc.dk/en", "https://www.naturalnews.com/2020-02-25-how-many-ways-is-the-flu-vaccine-failing-us.html", "https://www.usnews.com/news/business/articles/2022-02-02/new-turning-point-more-countries-easing-covid-restrictions", "http://medicaltyranny.com", "https://www.brighteon.tv", "https://pandemic.news/2022-02-01-aussie-lawmakers-call-scrap-covid-restrictions-victoria.html", "https://vaccines.news/2022-02-02-majority-new-covid-cases-hospitalizations-fully-vaccinated.html", "https://www.pandemic.news/2022-01-05-was-omicron-engineered-by-white-hats-as-a-self-spreading-antidote-to-end-covid-pandemic.html", "https://www.vaccines.news/2022-01-26-israel-now-1-in-covid-cases-per-capita-proof-draconian-measures-worthless.html", "https://www.naturalnews.com/2022-01-26-if-masks-not-needed-uk-why-in-usa.html", "https://www.brighteon.com/fdb6297a-63b3-4f41-83c8-107a30823bc3", "https://www.brighteon.com/channels/highwire", "http://Pandemic.news", "https://www.ntd.com/growing-number-of-countries-ending-covid-19-rules_735145.html", "https://www.bbc.com/news/world-europe-60215200", "https://www.usnews.com/news/business/articles/2022-02-02/new-turning-point-more-countries-easing-covid-restrictions", "https://www.brighteon.com/fdb6297a-63b3-4f41-83c8-107a30823bc3", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2022-02-03-european-countries-move-to-ease-pandemic-rules&linkname=End%20of%20COVID-19%20tyranny%3A%20European%20countries%20move%20to%20ease%20pandemic%20rules", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}