{"result_id": "187034", "URL": "https://liberty.news/2022-01-14-supreme-court-betrays-america-and-authorizes-outrageous-vaccine-mandate.html", "timestamp": "2023-04-25 16:15:19 CEST+0200", "meta": {"description": "Yesterday, the US Supreme Court proved once again that it will betray the American people at every opportunity in order to forward the government’s anti-human agenda that claims “they” own your body. In a 6-3 decision, SCOTUS struck down the OSHA mandate affecting all employers with 100 or more employees, but the court affirmed the […]", "lang": "en", "keywords": "human rights,scotus,Supreme Court,traitors,vaccine mandates,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2022-01-14-supreme-court-betrays-america-and-authorizes-outrageous-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Supreme Court BETRAYS America and authorizes outrageous vaccine mandate for health care workers; does NOTHING to affirm human right to reject dangerous medical experiments", "cleaned_text": "Supreme Court BETRAYS America and authorizes outrageous vaccine mandate for health care workers; does NOTHING to affirm human right to reject dangerous medical experiments\n\nYesterday, the US Supreme Court proved once again that it will betray the American people at every opportunity in order to forward the government’s anti-human agenda that claims “they” own your body.\n\nIn a 6-3 decision, SCOTUS struck down the OSHA mandate affecting all employers with 100 or more employees, but the court affirmed the legality of the vaccine mandate for all health care workers, including those in nursing homes, hospitals, clinics and more. This decision means SCOTUS just declared the government owns your body and can force you to take experimental medical injections in direct violation of the Nuremberg Code.\n\nEven in striking down the wider OSHA mandate, SCOTUS did not state that your body belongs to you. Instead, they said Congress hasn’t yet authorized OSHA to have enough power to force you to take these vaccines. In doing this, SCOTUS left the door wide open for Congress to legislate vaccine mandates and force them into your body, against your will.\n\nJustice Roberts voted with the majority in both decisions, meaning he voted against the wider OSHA mandate but voted in favor of the health care mandate. On both issues, the left-wing Marxist justices who seem ripped right out of communist China — Breyer, Kagan and Sotomayor — voted to grant the federal government total ownership over your body. Only Thomas, Alito, Barrett and Gorsuch reliably defended the right of the individual against the tyranny of the state.\n\nThis means about half the US Supreme Court — even after the Trump appointments — believes you are a literal slave to the US government.\n\nIf you can’t control your own body, then you don’t “own” it\n\nIf you aren’t allowed to control your own body, then you don’t own it. Who owns it? The government owns it, according to SCOTUS, and all they need is to grant themselves sufficient legal authorization to forcibly inject you with absolutely anything they want, even if they have to change the definition of a “vaccine” in order to do it (which is exactly what they already did).\n\nThe US government, in other words, is running an actual Nazi-style medical holocaust that is forcing the American people into dangerous medical experiments against their will.\n\nThat new legalization push by Congress to mandate medical experiments for everyone is right around the corner, by the way, and all they need is the deliberate release of a hemorrhagic fever virus that achieves a high fatality rate. Once the bodies start piling up, the media’s mass hysteria will push lawmakers to issue a new round of vaccine mandates that SCOTUS will uphold.\n\nMake no mistake: The deliberate, weaponized release of a hemorrhagic fever strain has already been decided and is likely already under way.\n\nAt that point, with mass panic and high mortality from a new outbreak, not even the Supreme Court will defend your right to say NO to vaccines. You will be 100% owned by the state. If they own your body, then they also, by definition, own the product of your labor and can control your behavior without limits. SCOTUS serves no function other than to more tightly bind the chains around your wrists and ankles as they turn your body over to the state for endless medical experimentation.\n\nAnd yes, SCOTUS also believes the government owns your children, since they said nothing about affirming the rights of parents to reject medical experiments for children.\n\nGet full details on this story in today’s Situation Update. The part about SCOTUS begins around minute 33.\n\nFind a new podcast each day, along with special reports and emergency updates, at:\n\nDownload my free audiobooks — including Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:\n\nAlso follow me on:", "opengraph": {"title": "Supreme Court BETRAYS America and authorizes outrageous vaccine mandate for health care workers; does NOTHING to affirm human right to reject dangerous medical experiments", "type": "article", "url": "https://www.liberty.news/2022-01-14-supreme-court-betrays-america-and-authorizes-outrageous-vaccine-mandate.html", "site_name": "Liberty News", "description": "Yesterday, the US Supreme Court proved once again that it will betray the American people at every opportunity in order to forward the government’s anti-human agenda that claims “they” own your body. In a 6-3 decision, SCOTUS struck down the OSHA mandate affecting all employers with 100 or more employees, but the court affirmed the […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2022/01/HRR-2022-01-14-Situation-Update.jpg"}, "tags": ["scotus", "vaccine wars", "human rights", "Supreme Court", "vaccine mandates", "vaccines", "traitors"], "tweets": [], "movies": [], "links": ["https://www.brighteon.tv", "http://Brighteon.com/82f880f3-c30f-4b80-b5a0-d2eb2239b407", "https://www.brighteon.com/channels/hrreport", "https://audiobooks.naturalnews.com/", "http://Brighteon.social/@HealthRanger", "https://t.me/RealHealthRanger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts"], "authors": [], "publish_date": null}