{"result_id": "187043", "URL": "https://www.liberty.news/2021-05-30-whistleblowers-expose-facebook-plan-censor-vaccine-hesitancy.html", "timestamp": "2023-04-25 16:15:24 CEST+0200", "meta": {"description": "Whistleblowers have confirmed what many of us have long suspected: Facebook systematically censors posts about vaccine hesitancy, preventing people from learning about the dangers of vaccines and potentially causing them to put their health at risk. Two anonymous Facebook employees leaked documents to Project Veritas exposing how the company uses an algorithm that targets anti-vaxxers. […]", "lang": "en", "keywords": "banned,Big Tech,Censored,Censorship,controlled narrative,COVID-19 vaccine,Facebook,free speech,Glitch,informed consent,Social media,speech police,tech giants,thought police,Tyranny,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.liberty.news/2021-05-30-whistleblowers-expose-facebook-plan-censor-vaccine-hesitancy.html", "encoding": "UTF-8"}, "image": null, "domain": "www.liberty.news", "title": "Whistleblowers expose Facebook’s plans to censor vaccine hesitancy posts", "cleaned_text": "Whistleblowers have confirmed what many of us have long suspected: Facebook systematically censors posts about vaccine hesitancy, preventing people from learning about the dangers of vaccines and potentially causing them to put their health at risk.\n\nTwo anonymous Facebook employees leaked documents to Project Veritas exposing how the company uses an algorithm that targets anti-vaxxers. According to the documents, a beta version of the algorithm was tested on 1.5 percent of Facebook’s 3.8 billion users as well as on another Facebook-owned platform, Instagram. One whistleblower said that the so-called “vaccine hesitancy score” that the algorithm calculates is used to demote user comments or leave them alone depending on the comment’s content.\n\nThe document, which is entitled Vaccine Hesitancy Comment Demotion, contains an executive summary section that makes no secret of its goal. It states that it aims to “drastically reduce user exposure to vaccine hesitancy (VH) in comments.”\n\nThe document goes on to declare that “reducing the visibility of these comments represents another significant opportunity for us to remove barriers to vaccination that users on the platform may potentially encounter.”\n\nThe platform wants to ostracize those who dare to speak out against vaccines: “The narrative [is] get the vaccine, the vaccine is good for you, everyone should get it. If you don’t, you will be singled out as an enemy of society.”\n\nOne of the whistleblowers voiced concerns that Facebook is more interested in building a community “where everyone complies” than having open discussions about the important decisions and topics of our time.\n\nUsers are being placed in tiers that assess their degree of vaccine hesitancy\n\nUsers of the social media platform are being ranked into tiers that grade their comments based on the degree they aim to dissuade other people from getting vaccines, with Tier 0 being given to comments that promote interference with administering vaccines, such as events or groups dedicated to this purpose. Tier 1, meanwhile, is reserved for comments that express criticism or alarmism over vaccines and comments that suggest or imply they are unsafe or ineffective.\n\nTier 2 is given to comments that contain “indirect discouragement” against vaccination by speculating about side effects or death – never mind the fact that side effects and deaths from the COVID vaccine are facts and not speculation. The document suggests using action mapping to demote or remove comments entirely according to how serious the violation is.\n\nSpeaking on Fox News, Project Veritas Head James O’Keefe said: “What’s remarkable about these private documents that Facebook has not wanted you to see until tonight is that ‘Tier 2’ [violation] says even if the facts are true that you will be targeted and demoted — your comments will be targeted and demoted.” He added that there is “more to come.”\n\nFacebook announced earlier this spring that it would be adding information labels to posts about vaccines in an effort to counter what it terms “misinformation.” They also added a tool that helps users get vaccines by linking them to information about locations and dates the shots are being administered.\n\nInterestingly, Facebook has said that it bans “’claims that COVID-19 vaccines kill or seriously harm people (such as causing blood clots)” even though health regulators around the world have investigated the vaccines for these very reasons and have even placed official warnings on their packaging cautioning that they can indeed cause blood clots.\n\nIn other words, Facebook doesn’t want you repeating the truth about vaccines and many other topics, and this is just more proof that the social media giant exerts its substantial influence to try to control the public narrative via censorship.", "opengraph": {"title": "Whistleblowers expose Facebook’s plans to censor vaccine hesitancy posts", "type": "article", "url": "https://www.liberty.news/2021-05-30-whistleblowers-expose-facebook-plan-censor-vaccine-hesitancy.html", "site_name": "Liberty News", "description": "Whistleblowers have confirmed what many of us have long suspected: Facebook systematically censors posts about vaccine hesitancy, preventing people from learning about the dangers of vaccines and potentially causing them to put their health at risk. Two anonymous Facebook employees leaked documents to Project Veritas exposing how the company uses an algorithm that targets anti-vaxxers. […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/05/Censored-Facebook-Social-Media.jpg"}, "tags": ["informed consent", "Censored", "COVID-19 vaccine", "speech police", "banned", "tech giants", "Censorship", "Glitch", "Social media", "thought police", "vaccines", "Facebook", "free speech", "controlled narrative", "Big Tech", "Tyranny"], "tweets": [], "movies": [], "links": ["https://www.projectveritas.com/news/breaking-facebook-whistleblowers-expose-leaked-internal-docs-detailing-new/", "https://www.dailymail.co.uk/news/article-9615409/Facebook-tried-censor-posts-vaccine-hesitancy-according-leaked-documents.html", "http://fakebook.news/", "https://www.dailymail.co.uk/news/article-9615409/Facebook-tried-censor-posts-vaccine-hesitancy-according-leaked-documents.html", "https://www.projectveritas.com/news/breaking-facebook-whistleblowers-expose-leaked-internal-docs-detailing-new/"], "authors": [], "publish_date": null}