{"result_id": "187016", "URL": "https://liberty.news/2021-12-03-judge-strikes-dod-pfizer-eua-comirnaty-interchangeable.html", "timestamp": "2023-04-25 16:15:08 CEST+0200", "meta": {"description": "U.S. Federal District Judge Allen Winsor of the U.S. District Court for the Northern District of Florida has ruled that Pfizer-BioNTech’s Wuhan coronavirus (Covid-19) “vaccine” bearing emergency use authorization (EUA) is not interchangeable with the company’s new Comirnaty injection, which was fully licensed by the U.S. Food and Drug Administration (FDA) back in August. Since […]", "lang": "en", "keywords": "Allen Winsor,badhealth,badmedicine,big government,Big Pharma,Comirnaty,COVID,EUA,fascism,FDA,health freedom,Medical Tyranny,Pfizer,pharmaceutical fraud,Plandemic,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2021-12-03-judge-strikes-dod-pfizer-eua-comirnaty-interchangeable.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "HUGE: Federal judge strikes down DOD claim that Pfizer’s EUA “vaccine” and Comirnaty are “interchangeable”", "cleaned_text": "HUGE: Federal judge strikes down DOD claim that Pfizer’s EUA “vaccine” and Comirnaty are “interchangeable”\n\nU.S. Federal District Judge Allen Winsor of the U.S. District Court for the Northern District of Florida has ruled that Pfizer-BioNTech’s Wuhan coronavirus (Covid-19) “vaccine” bearing emergency use authorization (EUA) is not interchangeable with the company’s new Comirnaty injection, which was fully licensed by the U.S. Food and Drug Administration (FDA) back in August.\n\nSince the two injections contain different ingredients and are manufactured in different ways, Judge Winsor said that they are legally not the same, and that the EUA one cannot be forced on people by the Department of Defense (DOD).\n\nJudge Winsor did, however, reject a preliminary injunction requested by 16 service members against the U.S. military’s Chinese Virus injection mandate. A hearing for that case is scheduled for Sept. 14, 2022, which is nearly 10 months down the road.\n\nJudge Winsor’s decision about the EUA injection from Pfizer-BioNTech also applies to those from Moderna and Johnson & Johnson (Janssen), both of which are also not approved or licensed by the FDA.\n\nIt turns out that the FDA’s approval of Comirnaty was accompanied by confusing documents and equally confusing public statements that did not specify any differences between the two injections.\n\n“The licensed vaccine has the same formulation as the EUA-authorized vaccine and the products can be used interchangeably to provide the vaccination series without presenting any safety or effectiveness concerns,” one such confounding statement read.\n\n“The products are legally distinct with certain differences that do not impact safety or effectiveness.”\n\nThe FDA utterly failed to explain how the licensed Comirnaty injection and the Pfizer-BioNTech EUA jab could “be used interchangeably,” despite having “certain differences” that make them “legally distinct.”\n\nEUA drugs CANNOT be mandated under U.S. law\n\nAs explained by The Defender, EUA products are considered experimental under U.S. law. This means that they cannot be mandated, and everyone has the right to refuse them.\n\n“?he Nuremberg Code, as well as federal law, provide that no human being can be forced to participate in a medical experiment,” The Defender further reported.\n\n“Under 21 U.S. Code Sec.360bbb-3(e)(1)(A)(ii)(III), ‘authorization for medical products for use in emergencies,’ it is unlawful to deny someone a job or an education because they refuse to be an experimental subject.”\n\nThe FDA’s own fact sheet also says something similar, explaining that under an EUA, “it is your choice to receive or not receive the vaccine. Should you decide not to receive it, it will not change your standard medical care.”\n\nLicensed vaccines can supposedly be pushed on employees and students, according to The Defender, however it is not explained how or why from a constitutional perspective.\n\nInterestingly, the law further states that once a fully licensed product becomes available, in this case Comirnaty, none of the EUA products can continue to be administered. This means that the Biden regime and anyone else trying to force people to take any of these injections is a criminal.\n\nKeep in mind that Comirnaty is not even available to the public yet. This means that there are no vaccines currently available that can legally be mandated on anyone.\n\n“This EUA for the Pfizer-BioNTech COVID-19 Vaccine and COMIRNATY will end when the Secretary of HHS determines that the circumstances justifying the EUA no longer exist or when there is a change in the approval status of the product such that an EUA is no longer needed,” the FDA fact sheet explains.\n\nActing FDA commissioner Dr. Janet Woodcock said much the same thing about how the “black letter law is clear.”\n\n“There can be no biologic license approved to a medical product for diagnosing, preventing or treating COVID-19 if there is also still an Emergency Use Authorization for the same medical product serving the same purpose,” she said.\n\nMore of the latest news about the Chinese Virus injection scam can be found at ChemicalViolence.com.", "opengraph": {"title": "HUGE: Federal judge strikes down DOD claim that Pfizer’s EUA “vaccine” and Comirnaty are “interchangeable”", "type": "article", "url": "https://www.liberty.news/2021-12-03-judge-strikes-dod-pfizer-eua-comirnaty-interchangeable.html", "site_name": "Liberty News", "description": "U.S. Federal District Judge Allen Winsor of the U.S. District Court for the Northern District of Florida has ruled that Pfizer-BioNTech’s Wuhan coronavirus (Covid-19) “vaccine” bearing emergency use authorization (EUA) is not interchangeable with the company’s new Comirnaty injection, which was fully licensed by the U.S. Food and Drug Administration (FDA) back in August. Since […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/12/fda.png"}, "tags": ["Comirnaty", "big government", "Allen Winsor", "Big Pharma", "fascism", "FDA", "COVID", "vaccine", "Medical Tyranny", "EUA", "Pfizer", "health freedom", "Plandemic", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/judge-allen-winsor-pfizer-eua-comirnaty-vaccines-interchangeable/", "https://naturalnews.com/2021-09-08-no-forced-take-comirnaty-covid-vaccine-pfizer.html", "http://fda.news", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://childrenshealthdefense.org/defender/judge-allen-winsor-pfizer-eua-comirnaty-vaccines-interchangeable/", "https://naturalnews.com/2021-09-08-no-forced-take-comirnaty-covid-vaccine-pfizer.html"], "authors": [], "publish_date": null}