{"result_id": "187040", "URL": "https://liberty.news/2021-09-25-president-croatia-exposes-media-lying-covid-vaccines.html", "timestamp": "2023-04-25 16:15:23 CEST+0200", "meta": {"description": "President Zoran Milanovi? of Croatia is done with the Wuhan coronavirus (Covid-19) “vaccine” scam. In a scathing indictment of the medical establishment, Milanovi? announced that Croatians have been “vaccinated enough” and that “we will not be vaccinated anymore in Croatia.” “The media spread panic and nonsense,” Milanovi? boldly proclaimed. “I start every day with CNN […]", "lang": "en", "keywords": "COVID,Croatia,fascism,goodhealth,goodmedicine,goodscience,health freedom,lies,pandemic,Plandemic,scam,vaccine,Vaccine deaths,vaccine injury,vaccine wars,vaccines,Zoran Milanovi?", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2021-09-25-president-croatia-exposes-media-lying-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "President of Croatia exposes media for LYING and spreading panic about covid, says NO MORE vaccination allowed in his country", "cleaned_text": "President of Croatia exposes media for LYING and spreading panic about covid, says NO MORE vaccination allowed in his country\n\nPresident Zoran Milanovi? of Croatia is done with the Wuhan coronavirus (Covid-19) “vaccine” scam.\n\nIn a scathing indictment of the medical establishment, Milanovi? announced that Croatians have been “vaccinated enough” and that “we will not be vaccinated anymore in Croatia.”\n\n“The media spread panic and nonsense,” Milanovi? boldly proclaimed. “I start every day with CNN and those few channels and I wonder if I am normal or are they crazy. They spread panic. They do it from the beginning.”\n\nUnlike United States politicians, which are too weak, compromised, or just plain evil to ever say anything like this, Milanovi? is not going to stand idly by as his countrymen continue to get medically raped by the Western Big Pharma machine.\n\n“There is no life without risk, without the possibility of getting sick,” Milanovi? added. “People get sick from a thousand other more serious things, and while that’s happening, we’ve been talking about COVID-19 for a year and a half.”\n\n“We need to know what the goal of this frenzy is. If the goal is to completely eradicate the virus, then we have the goal. I have not heard that this is the goal. If someone tells me it’s a goal, I will tell him he’s out of his mind.”\n\nYou can watch Milanovi? speak below:\n\nAt the current time, Croatia is about half vaccinated among its adult population. In Milanovi?’s view, this is more than enough.\n\nIt sounds like, based on the rhetoric, that if it were up to Milanovi?, the “Operation Warp Speed” injections brought into existence under Donald “father of the vaccine” Trump never would have been allowed in Croatia in the first place.\n\n“We will not go more than 50 percent,” Milanovi? stated emphatically to the media. “Let them fence us with wire. They won’t do it.”\n\n“There is simply no chance of endangering those people … Since the New Year, I only listen to nonsense.”\n\nWhat Milanovi? is saying, in essence, is that the mainstream media, which is a product of the United States et al. – also known as Mystery Babylon – is spreading nothing but propaganda and fear when it comes to the Chinese Virus.\n\nHearing Milanovi? speak these words is certainly a breath of fresh air. To see an actual man stand up to this nonsense is both inspiring and depressing when considering that all we have here in the U.S. is a bumbling pedophile occupying our country’s highest office.\n\n“I wish we had a president like him instead of a Marxist pedo with the brain capacity of a house plant,” is how one commenter at Citizen Free Press put it.\n\n“Croatia survived communism,” wrote another. “It is the middle state of three that comprised communist Yugoslavia from 1946 to 1992.”\n\n“It was part of the Hapsburg Austrian Empire from 1500s to 1918 becoming a separate kingdom. Then, in 1946 post-WW2 it became communist Yugoslavia. In 1963, Tito claimed himself ‘Prez for Life.’ War broke out in 1990. By 1995, a Treaty was signed establishing among others the independent States of Croatia, Slovenia (which also rejects further vaccines) and Bosnia. So, freedom is a new, hard-fought reality.”\n\nAnother commenter from Croatia indicated that she loves her president and is proud to be a Croat.\n\n“We need more leaders like this fine person in public office,” wrote another.\n\n“I’m of the opinion that [Milanovi?] watches commie news network because he knows propaganda when he sees it and wants to stay on top of the latest fertilizer being spewed.”\n\nAs America dives headlong into the deep end with medical fascism, other countries like Croatia are resisting. To keep up with the latest, visit Fascism.news.", "opengraph": {"title": "President of Croatia exposes media for LYING and spreading panic about covid, says NO MORE vaccination allowed in his country", "type": "article", "url": "https://www.liberty.news/2021-09-25-president-croatia-exposes-media-lying-covid-vaccines.html", "site_name": "Liberty News", "description": "President Zoran Milanovi? of Croatia is done with the Wuhan coronavirus (Covid-19) “vaccine” scam. In a scathing indictment of the medical establishment, Milanovi? announced that Croatians have been “vaccinated enough” and that “we will not be vaccinated anymore in Croatia.” “The media spread panic and nonsense,” Milanovi? boldly proclaimed. “I start every day with CNN […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/09/Covid-19-Montage-Vaccine-Syringe.jpg"}, "tags": ["pandemic", "vaccine wars", "fascism", "Vaccine deaths", "COVID", "scam", "vaccine", "vaccine injury", "vaccines", "Croatia", "lies", "health freedom", "Zoran Milanovi?", "Plandemic"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/cXTGgup_Yto\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/cXTGgup_Yto"}], "links": ["https://citizenfreepress.com/breaking/president-of-croatia-we-will-not-be-vaccinated-anymore/", "https://www.naturalnews.com/2021-09-06-covid-vaccines-mark-of-the-beast-system.html", "https://archive.is/WAZLp", "http://fascism.news", "https://citizenfreepress.com/breaking/president-of-croatia-we-will-not-be-vaccinated-anymore/", "https://www.naturalnews.com/2021-09-06-covid-vaccines-mark-of-the-beast-system.html"], "authors": [], "publish_date": null}