{"result_id": "187010", "URL": "https://www.liberty.news/2022-01-13-desantis-says-vaccine-passports-big-failure.html", "timestamp": "2023-04-25 16:15:03 CEST+0200", "meta": {"description": "For Florida Gov. Ron DeSantis, vaccine passports are a big failure – not only with regard to their inability to curb the spread of the Wuhan coronavirus (COVID-19), but also for being discriminatory and for splitting society. DeSantis lashed at vaccine passports during a press conference at the Broward Medical Center. “How big of a failure have […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,covid-19,Florida,health freedom,medical fascism,Medical Tyranny,pandemic,Resist,Ron DeSantis,vaccine mandate,vaccine passport,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.liberty.news/2022-01-13-desantis-says-vaccine-passports-big-failure.html", "encoding": "UTF-8"}, "image": null, "domain": "www.liberty.news", "title": "Florida Gov. Ron DeSantis says vaccine passports are a big failure", "cleaned_text": "For Florida Gov. Ron DeSantis, vaccine passports are a big failure – not only with regard to their inability to curb the spread of the Wuhan coronavirus (COVID-19), but also for being discriminatory and for splitting society.\n\nDeSantis lashed at vaccine passports during a press conference at the Broward Medical Center. “How big of a failure have vaccine passports been?” he asked, citing that they have largely been ineffective in areas where they’ve been implemented.\n\nAccording to DeSantis, even the Centers for Disease Control and Prevention (CDC) and business mogul Bill Gates have admitted that vaccines were unable to prevent transmission. “All it served to do was discriminate against people based on an individual choice, [and] create a two-tiered society,” said DeSantis, who opposed the vaccine passports since they were first launched in March last year. (Related: OBEY: New York becomes first state to launch “vaccine passport” for coronavirus jab recipients.)\n\nAside from Florida, the other states that banned the implementation of vaccine passports were Alabama, Arizona, Arkansas, Florida, Georgia, Idaho, Indiana, Iowa, Montana, North Dakota, South Carolina, South Dakota, Texas, Wyoming, and, partially, Utah.\n\nThose which did not require them for travel or mass gatherings were the states of California, Colorado, Connecticut, Delaware, Illinois, Kansas, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, North Carolina, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, Tennessee, Vermont, Virginia, Washington, West Virginia and Wisconsin.\n\nAlthough the use of vaccine passports has not taken ground, DeSantis noted that some entities like New York City, Washington, D.C. and California are batting for “booster” COVID shots for certain workers as an added layer of protection. Also moving toward that direction are many universities and businesses across the United States.\n\nDeSantis, however, believes the majority of the Americans are against forced booster shots and are showing their displeasure by relocating to states hostile to vaccine passports. “So those policies have not worked. And I think ultimately people vote with their feet. If you look from July 2020 to July of 2021, we led the country,” said DeSantis, noting people have been moving to Florida in droves.\n\nAnd DeSantis has the data to support his claim.\n\nIslander News revealed in a May 2021 report that Florida was the No. 1 destination for relocating Americans in 2020 as determined by internal metrics, U.S. Census Bureau data, and a Pollfish survey of 700 U.S. adults.\n\nThe influx of new residents to Florida hardly surprised DeSantis, saying it is a result of protecting people’s freedoms and making sure they have a state worth living in.\n\nFlorida businesses that would require vaccine passports will be fined $5,000. Government entities are prohibited from requiring the vaccination of employees with even stiffer penalties. A Florida county coughed up more than $3.5 million just because it required municipal employees to show proof of their vaccination.\n\nOf course, DeSantis isn’t alone in his fight against vaccine passports and their repercussions.\n\nDr. Erika Smith, for one, is aligned with DeSantis’ thoughts on the vaccine passports. Attending a hearing for an Ohio bill that would let residents reject vaccination by submitting a written statement or a verbal testimony, Smith warned of a possible “apartheid state” if governments insist on strict vaccine measures.\n\n“Any student of history clearly sees the distinct parallels between segregation due to race and segregation due to vaccine status,” said Smith, who is of African descent. Smith said the Civil Rights movement guarantees equal privileges under the law, so the unvaccinated shouldn’t be discriminated against.\n\nWatch the video below about breakthrough cases and vaccine passports.\n\nThis video is from the Data Dumper channel on Brighteon.com.", "opengraph": {"title": "Florida Gov. Ron DeSantis says vaccine passports are a big failure", "type": "article", "url": "https://www.liberty.news/2022-01-13-desantis-says-vaccine-passports-big-failure.html", "site_name": "Liberty News", "description": "For Florida Gov. Ron DeSantis, vaccine passports are a big failure – not only with regard to their inability to curb the spread of the Wuhan coronavirus (COVID-19), but also for being discriminatory and for splitting society. DeSantis lashed at vaccine passports during a press conference at the Broward Medical Center. “How big of a failure have […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2022/01/Woman-Covid-19-App-Phone-Vaccine-Passport.jpg"}, "tags": ["pandemic", "big government", "medical fascism", "covid-19", "vaccine wars", "Florida", "Resist", "vaccine mandate", "Medical Tyranny", "vaccines", "vaccine passport", "Ron DeSantis", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/desantis-slams-vaccine-passports-as-discriminatory-and-creating-a-two-tiered-society/", "https://naturalnews.com/2021-03-30-new-york-first-state-vaccine-passport-coronavirus.html", "http://resist.news", "https://www.lifesitenews.com/news/medical-apartheid-forced-vaccination-compared-to-civil-rights-abuse-in-powerful-testimony/", "https://www.brighteon.com/ed3e441d-a5b5-4f4c-8ffa-bc7cd923fc67", "https://www.brighteon.com/channels/datadumper", "http://infections.news", "https://www.lifesitenews.com/news/desantis-slams-vaccine-passports-as-discriminatory-and-creating-a-two-tiered-society/", "https://www.lifesitenews.com/news/medical-apartheid-forced-vaccination-compared-to-civil-rights-abuse-in-powerful-testimony/", "https://www.brighteon.com/ed3e441d-a5b5-4f4c-8ffa-bc7cd923fc67"], "authors": [], "publish_date": null}