{"result_id": "187025", "URL": "https://www.liberty.news/2023-01-17-disney-state-actor-implementing-covid-vaccine-mandate.html", "timestamp": "2023-04-25 16:15:13 CEST+0200", "meta": {"description": "A lawsuit filed against The Walt Disney Company accused the media giant of acting as an arm of the Biden administration in implementing Wuhan coronavirus (COVID-19) vaccine mandates. The lawsuit from former ESPN employees Beth Faber and Allison Williams alleged that Disney played the role of a “state actor” in terminating them for noncompliance with […]", "lang": "en", "keywords": "Allison Williams,badhealth,badmedicine,Beth Faber,Bob Chapek,Cheron Hayes,covid-19,disney,espn,freedom,health freedom,Joe Biden,lawsuit,Liberty,medical fascism,medical martial law,Medical Tyranny,pandemic,religious exemption,Resist,Seth Schmidt,vaccine,vaccine mandate,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.liberty.news/2023-01-17-disney-state-actor-implementing-covid-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.liberty.news", "title": "Lawsuit claims Disney served as “state actor” in implementing COVID vaccine mandate", "cleaned_text": "A lawsuit filed against The Walt Disney Company accused the media giant of acting as an arm of the Biden administration in implementing Wuhan coronavirus (COVID-19) vaccine mandates.\n\nThe lawsuit from former ESPN employees Beth Faber and Allison Williams alleged that Disney played the role of a “state actor” in terminating them for noncompliance with the company’s COVID-19 vaccine mandate. Faber, who worked in the network as a producer, was terminated in September 2021. Williams, who was fired in the same month as Faber, later joined Fox Sports as a commentator.\n\nThe plaintiffs’ lawsuit argued that Disney, in its role as a “state actor,” is subject to the Constitution’s “equal protection clause.” Lawyers for Faber and Williams wrote: “The Constitution provides that the government – and state actors alike – cannot take life, liberty or property without due process and equal protection of the law.”\n\nThe complaint further argued that the termination of both Faber and Williams, which coincided with President Joe Biden’s announcement of a COVID-19 vaccine mandate for private companies, was “more than just symbolic” as it was “part of a very orchestrated and choreographed partnership.”\n\nThe California-based entertainment company owns 80 percent of ESPN, with the remaining 20 percent owned by Hearst Communications.\n\nMoreover, Faber and Williams’ lawsuit referenced a White House meeting attended by then-Disney CEO Bob Chapek less than a week after Biden announced his vaccine mandate. Chapek mandating COVID-19 injections for Disney employees served as a “clear and obvious response” to the president’s demand, it added. Originally taking over his predecessor Bob Iger, Chapek stepped down as CEO in November 2022 only to be replaced by Iger himself.\n\nThe complaint also mentioned that in the course of acting as an arm of the Biden administration, Disney – and by extension ESPN – infringed on the religious rights of employees. It cited how the network rejected the application for religious exemption filed by both plaintiffs.\n\nOther former employees sue Disney over vaccine mandates\n\nThe two former ESPN employees are not the only ones who challenged Disney’s vaccine mandate in court.\n\nAccording to a report by NBC affiliate channel WESH 2, seven former employees sued Disney for “discrimination” under the Florida Civil Rights Act. Two of the plaintiffs, Cheron Hayes and Seth Schmidt, claimed the company rejected their applications for religious exemption to the COVID-19 vaccine mandate – leading to their termination. (Related: Cast members to sue Disney for its COVID-19 “vaccinate or terminate” mandate.)\n\nHayes was fired in November 2021 after working as a senior financial analyst for almost 15 years. She lamented: “I thought I’d found the company I would retire from. So for them to hit me with this just for a shot and for them to literally say ‘No shot, no job’ … was very humiliating.”\n\nSchmitt also suffered the same fate even though he had worked or 11 years at the Disney Hollywood Studios in Florida’s Disney World theme park. “My manager said it’s not because of the job,” he told WESH 2. “‘You do a great job. But because of our policies, we have to let you go.’ It just felt disheartening.”\n\nRachel Rodriguez, an attorney representing the seven plaintiffs, said the law is clearly on her clients’ side.\n\n“It can’t be overstated that the problems here have to do with discrimination under long-standing law,” she said, adding that Disney “violated the privacy rights” of employees by mandating them to get the COVID-19 vaccine under threat of termination.\n\nWatch Disney employee Nick Caturano discuss his and his colleagues’ fight against the company’s COVID-19 vaccine mandate on “Lawfare with Tom Renz.”\n\nThis video is from the BrighteonTV channel on Brighteon.com.\n\nVaccine industry social influence document reveals attempted bribery of ‘key social influencers’ such as Disney / Marvel, ESPN, Oprah and a CNN reporter.", "opengraph": {"title": "Lawsuit claims Disney served as “state actor” in implementing COVID vaccine mandate", "type": "article", "url": "https://www.liberty.news/2023-01-17-disney-state-actor-implementing-covid-vaccine-mandate.html", "site_name": "Liberty News", "description": "A lawsuit filed against The Walt Disney Company accused the media giant of acting as an arm of the Biden administration in implementing Wuhan coronavirus (COVID-19) vaccine mandates. The lawsuit from former ESPN employees Beth Faber and Allison Williams alleged that Disney played the role of a “state actor” in terminating them for noncompliance with […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2023/01/walt-disney-image.png"}, "tags": ["pandemic", "lawsuit", "Liberty", "Seth Schmidt", "Resist", "espn", "Bob Chapek", "covid-19", "vaccine", "disney", "vaccine mandate", "Cheron Hayes", "Beth Faber", "medical martial law", "Joe Biden", "vaccine wars", "Allison Williams", "religious exemption", "Medical Tyranny", "medical fascism", "freedom", "health freedom"], "tweets": [], "movies": [], "links": ["https://thenewamerican.com/mickey-mouse-and-uncle-sam-lawsuit-claims-disney-was-a-state-actor-with-covid-vaccine-mandate/", "https://www.wesh.com/article/employees-sue-disney-covid-19-shot/42435703", "https://www.naturalnews.com/2022-07-01-cast-members-suing-disney-vaccinate-terminate-mandate.html", "https://medicaltyranny.com", "https://www.brighteon.com/d16d8d75-314d-47b2-ade1-245f4544cafe", "https://www.brighteon.com/channels/brighteontv", "https://medicalfascism.news/2022-10-20-tdr-to-charge-unvaxxed-patrons-higher-fees.html", "https://resist.news/2021-11-11-steel-truth-americans-pushing-back-vaccine-mandate.html", "https://joebiden.news/2021-11-09-biden-vaccine-mandate-poorly-planned-ill-timed.html", "https://medicaltyranny.com/2021-11-12-tom-renz-nick-caturano-disney-vaccine-mandates.html", "https://www.naturalnews.com/050706_vaccine_industry_attempted_bribery_social_influencers.html", "https://thenewamerican.com/mickey-mouse-and-uncle-sam-lawsuit-claims-disney-was-a-state-actor-with-covid-vaccine-mandate/", "https://www.wesh.com/article/employees-sue-disney-covid-19-shot/42435703", "https://www.brighteon.com/d16d8d75-314d-47b2-ade1-245f4544cafe", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2023-01-17-disney-state-actor-implementing-covid-vaccine-mandate&linkname=Lawsuit%20claims%20Disney%20served%20as%20%E2%80%9Cstate%20actor%E2%80%9D%20in%20implementing%20COVID%20vaccine%20mandate", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}