{"result_id": "187004", "URL": "https://www.liberty.news/2023-03-09-pfizer-blackrock-mass-chicken-vaccination-avian-flu.html", "timestamp": "2023-04-25 16:14:59 CEST+0200", "meta": {"description": "If they can’t get you to willingly take a Wuhan coronavirus (Covid-19) “vaccine,” then the next best thing is to secretly “vaccinate” you with tainted chicken meat and eggs from birds that were injected with Zoetis’ new avian flu injection. According to the latest reports, Kristin Peck, the CEO of Zoetis, a Pfizer offshoot, is […]", "lang": "en", "keywords": "animal health,avian flu,bird flu,BlackRock,chickens,food supply,homesteading,Kristin Peck,Liberty,Pfizer,vaccination,vaccine wars,vaccines,Zoetis", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.liberty.news/2023-03-09-pfizer-blackrock-mass-chicken-vaccination-avian-flu.html", "encoding": "UTF-8"}, "image": null, "domain": "www.liberty.news", "title": "Former Pfizer executive, BlackRock board member pushing for mass chicken vaccination to “cure” avian flu", "cleaned_text": "Former Pfizer executive, BlackRock board member pushing for mass chicken vaccination to “cure” avian flu\n\nIf they can’t get you to willingly take a Wuhan coronavirus (Covid-19) “vaccine,” then the next best thing is to secretly “vaccinate” you with tainted chicken meat and eggs from birds that were injected with Zoetis’ new avian flu injection.\n\nAccording to the latest reports, Kristin Peck, the CEO of Zoetis, a Pfizer offshoot, is lobbying the Biden regime to mass inject all birds across the nation with her company’s experimental bird flu shots. Once this is accomplished, she says, chicken meat and eggs will once again be plentiful – just in time for fake president Joe Biden’s 2024 “reelection.”\n\n“For President Biden,” reported the sympathetic New York Times, “there are also political considerations at work. Egg prices, which soared in 2022, were 70 percent higher in January than they were a year earlier. Those high prices have given Republicans another opportunity to attack Mr. Biden over inflation just as he is preparing to run for re-election in 2024.”\n\nNote the Times‘ use of antagonistic rhetoric to paint Republicans as aggressors against poor little Biden, who is merely a victim of all this economic turmoil as he aims to steal the White House a second time to complete Barack Obama’s fourth term as America’s hidden president.\n\n“‘If a vaccination campaign could provide economic relief for households,” the Times went on to report, “Mr. Biden would certainly be interested in such an undertaking,’ one official said.”\n\nThe same fake PCR tests used during covid are now being administered to chickens to look for bird flu\n\nIt is important to note that there is still no evidence whatsoever to suggest that bird flu, also known as H5N1, even poses a threat to humans. The government has simply decided that a “positive” PCR test from just one bird warrants culling all birds in the vicinity, creating more egg and chicken meat shortages.\n\nThose PCR tests, by the way, are the same fraudulent ones that were given to humans during the Wuhan coronavirus (Covid-19) “scamdemic” – tests that the original creator of them says were never intended for use in detecting viruses.\n\nNone of this is about disease, though – it is all about profits. Pfizer used to own Zoetis but split off the company in 2013. Now, Peck, who previously worked at Pfizer as the company’s Executive Vice President of Worldwide Business Development and Innovation, is lobbying the Biden regime to once again promote mass mystery chemical injections, this time in chickens rather than humans.\n\n“[Kristin Peck] used to work at Pfizer & is now CEO of Zoetis, a Pfizer spinoff and the largest animal vax manufacturer in the world,” tweeted DC Draino. “She sits on the BlackRock board & is lobbying the Biden regime to vaccinate every U.S. chicken against bird flu.”\n\nThe fact that Peck’s career includes many years of work at one of the world’s most evil pharmaceutical corporations (Pfizer), followed by heading up its animal vaccine spinoff company (Zoetis), along with sitting on the board of one of the most predatorial and cash-rich investment firms (BlackRock) is concerning, to say the least.\n\n“All it takes is one bird testing positive in one house and the entire farm is culled,” one commenter wrote about how the chicken meat and egg shortages are engineered by another phony testing regimen similar to the covid testing of humans.\n\n“The chicken doesn’t even have to appear sick. That can be hundreds of thousands of birds on one farm.”\n\nMore related news about the Big Pharma-Big Government racket can be found at Fascism.news.", "opengraph": {"title": "Former Pfizer executive, BlackRock board member pushing for mass chicken vaccination to “cure” avian flu", "type": "article", "url": "https://www.liberty.news/2023-03-09-pfizer-blackrock-mass-chicken-vaccination-avian-flu.html", "site_name": "Liberty News", "description": "If they can’t get you to willingly take a Wuhan coronavirus (Covid-19) “vaccine,” then the next best thing is to secretly “vaccinate” you with tainted chicken meat and eggs from birds that were injected with Zoetis’ new avian flu injection. According to the latest reports, Kristin Peck, the CEO of Zoetis, a Pfizer offshoot, is […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2023/03/Close-Up-Chicken-Face-Head.jpg"}, "tags": ["BlackRock", "Liberty", "vaccination", "Kristin Peck", "vaccine wars", "Zoetis", "homesteading", "animal health", "vaccines", "avian flu", "Pfizer", "food supply", "chickens", "bird flu"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2023/03/update-blackrock-board-member-and-former-pfizer-executive-is-behind-push-for-chicken-vaccinations-chicken-vax-company-is-an-offshoot-of-pfizer/", "https://www.naturalnews.com/2023-03-07-natural-news-releases-lab-results-of-tractor-supply-producers-pride-chicken-feed.html", "https://www.brighteon.tv", "http://fascism.news", "https://www.thegatewaypundit.com/2023/03/update-blackrock-board-member-and-former-pfizer-executive-is-behind-push-for-chicken-vaccinations-chicken-vax-company-is-an-offshoot-of-pfizer/", "https://www.naturalnews.com/2023-03-07-natural-news-releases-lab-results-of-tractor-supply-producers-pride-chicken-feed.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2023-03-09-pfizer-blackrock-mass-chicken-vaccination-avian-flu&linkname=Former%20Pfizer%20executive%2C%20BlackRock%20board%20member%20pushing%20for%20mass%20chicken%20vaccination%20to%20%E2%80%9Ccure%E2%80%9D%20avian%20flu", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}