{"result_id": "187049", "URL": "https://liberty.news/2019-02-26-florida-now-following-california-forcing-toxic-deadly-vaccines-onto-millions-of-children.html", "timestamp": "2023-04-25 16:15:28 CEST+0200", "meta": {"description": "A shocking new report from the National Vaccine Information Center (NVIC) reveals that Florida is now following liberal California’s tyrannical lead — along with 29 other states looking to usher in vaccine mandates this season. Over 100 bills targeting vaccine rights have been filed nationwide. While a select few are doubling down on rights to […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Brother,Dangerous Medicine,Florida,freedom,health freedom,HPV vaccine,Liberty,medical ethics,medical fascism,Medical Tyranny,Tyranny,Vaccine dangers,vaccine injury,vaccine mandates,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2019-02-26-florida-now-following-california-forcing-toxic-deadly-vaccines-onto-millions-of-children.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Florida now following California in forcing toxic, deadly vaccines onto millions of children", "cleaned_text": "Florida now following California in forcing toxic, deadly vaccines onto millions of children\n\nA shocking new report from the National Vaccine Information Center (NVIC) reveals that Florida is now following liberal California’s tyrannical lead — along with 29 other states looking to usher in vaccine mandates this season. Over 100 bills targeting vaccine rights have been filed nationwide. While a select few are doubling down on rights to medical freedom and informed consent, a devastatingly large majority of these bills are aimed at restricting or eliminating the rights of the American people.\n\nThe NVIC Advocacy Portal team has reportedly identified a number of bills which flat-out threaten voluntary vaccination decisions and has issued multiple advocacy alerts for bills which threaten health freedom.\n\nVaccine mandates are a threat not just to human health, but to American freedom. Beyond concerns about potential vaccine damage, there is a greater concern about state and federal governments expanding their power. Allowing government entities to force the public to be vaccinated sets a dangerous precedent for the future. And once you give government the power to do something, they’re not going to just give it up.\n\nCalifornia became the nation’s leader in vaccine tyranny just a few short years ago, with the passing of SB 277. Senator Richard Pan is credited with pushing SB 277 into action and dismantling parental rights when it comes to inoculation and children’s healthcare.\n\nAccording to a report from the Sacremento Bee, Pan has received many thousands of dollars from the pharmaceutical industry. Vaccine manufacturers reportedly gave millions to multiple California politicians just shortly before SB 277 was pushed through.\n\nMother Nature's micronutrient secret: Organic Broccoli Sprout Capsules now available, delivering 280mg of high-density nutrition, including the extraordinary \"sulforaphane\" and \"glucosinolate\" nutrients found only in cruciferous healing foods. Every lot laboratory tested. See availability here.\n\nDozens of pharmaceutical companies made hefty campaign contributions as well as direct lobbying payments. “Lobbying payments” is, of course, a term used to whitewash what these “payments” really are: Bribes.\n\nPan himself received a cool $95,000 — earning him the lion’s share of pharma cash, as well as the champion of mandatory vaccine legislation.\n\nAnd yet, politicians like Pan try to convince the public that their legislation — no matter how unconstitutional — is fueled solely by their desire to protect the public. It’s as if we’re supposed to believe the millions of dollars these tyrants receive from the pharma industry has had no influence on their opinions — even though the sole purpose of lobbying is to influence politicians and their policy decisions.\n\nThere are substantial questions about vaccine mandates and who they are truly intended to serve. Given what the Sacremento Bee has found, it seems that vaccine mandates are more rooted in corporate interests than they are in public health.\n\nIn addition to pushing vaccine mandates, Senator Pan has also tried to outlaw vaccine skepticism. Just in case making vaccines mandatory wasn’t enough, the tyrant-in-chief wants to make sure the public can’t even talk about vaccine science — unless it’s a government-approved conversation. Surely thought suppression and censorship will be for the “public good,” as well.\n\nIndeed, the war on free speech is actually the perfect complement to the war on health freedom. As Mike Adams, founder of Natural News and creator of Brighteon.com, contends, once “fake news” is criminalized, any speech that dissents from the leftist narrative will be rendered illegal.\n\nNo matter how you slice it, vaccine mandates are a threat to humanity. And now that the vaccine industry has tested the waters in California, we are seeing an uptick in mandatory vaccination legislation nationwide. Soon, the federal government may even be in on it.\n\nSee more coverage of the latest vaccine atrocities at Vaccines.news.", "opengraph": {"title": "Florida now following California in forcing toxic, deadly vaccines onto millions of children", "type": "article", "url": "https://www.liberty.news/2019-02-26-florida-now-following-california-forcing-toxic-deadly-vaccines-onto-millions-of-children.html", "site_name": "Liberty News", "description": "A shocking new report from the National Vaccine Information Center (NVIC) reveals that Florida is now following liberal California’s tyrannical lead — along with 29 other states looking to usher in vaccine mandates this season. Over 100 bills targeting vaccine rights have been filed nationwide. While a select few are doubling down on rights to […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2019/02/vaccine-blue.jpg"}, "tags": ["Liberty", "medical fascism", "Vaccine dangers", "Florida", "Big Brother", "medical ethics", "vaccine injury", "vaccine mandates", "Medical Tyranny", "vaccines", "HPV vaccine", "freedom", "health freedom", "Tyranny"], "tweets": [], "movies": [], "links": ["https://nvicadvocacy.org/members/Home.aspx", "https://www.sacbee.com/news/politics-government/capitol-alert/article24913978.html", "http://organicbroccolisproutpowder.healthrangerstore.com/organic-broccoli-sprout-powder-capsules.html", "https://www.naturalnews.com/2018-05-18-senator-richard-pushing-bill-crime-question-vaccines.html", "https://www.naturalnews.com/2018-04-09-california-state-senator-who-pushed-vaccine-mandate-now-seeks-to-criminalize-fake-news.html", "http://brighteon.com", "http://vaccines.news", "http://www.greenmedinfo.com/blog/urgent-mandatory-hpv-jabs-school-kids-fl-100-vaccine-bills-flood-30-states", "https://www.sacbee.com/news/politics-government/capitol-alert/article24913978.html", "https://www.nvic.org/NVIC-Vaccine-News/February-2019/more-than-100-vaccine-bills-proposed-in-30-states.aspx?utm_source=Vaccine%20Bills%20in%2030%20States%20To%20Expand%2C%20Restrict%20or%20Eliminate%20Rights&utm_campaign=July%20NVIC%20Newsletter&utm_medium=email", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2019-02-26-florida-now-following-california-forcing-toxic-deadly-vaccines-onto-millions-of-children&linkname=Florida%20now%20following%20California%20in%20forcing%20toxic%2C%20deadly%20vaccines%20onto%20millions%20of%20children", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}