{"result_id": "187022", "URL": "https://liberty.news/2021-10-04-youtube-bans-channels-airing-criticism-of-vaccines.html", "timestamp": "2023-04-25 16:15:12 CEST+0200", "meta": {"description": "YouTube continued the expansion of corporate censorship on the Internet with the encouragement of leading Democratic leaders. The company has banned channels associated with anti-vaccine activists like Joseph Mercola and Robert F. Kennedy Jr. Once again, rather than rebutting or refuting claims made by others, many sought to silence those with opposing views. YouTube will not allow people […]", "lang": "en", "keywords": "banned,Big Tech,Censored,Censorship,covid-19,free speech,Liberty,obey,politics,speech police,tech giants,thought police,vaccine,vaccine mandate,YouTube", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2021-10-04-youtube-bans-channels-airing-criticism-of-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Free speech immunity: YouTube bans channels airing criticism of vaccines", "cleaned_text": "YouTube continued the expansion of corporate censorship on the Internet with the encouragement of leading Democratic leaders. The company has banned channels associated with anti-vaccine activists like Joseph Mercola and Robert F. Kennedy Jr. Once again, rather than rebutting or refuting claims made by others, many sought to silence those with opposing views. YouTube will not allow people to hear views that do not comport with an approved range of opinions. The move magnifies concerns that we are seeing the emergence of a new type of state media as private companies conduct censorship operations barred by the Constitution for the government to conduct directly. This move comes days after Sen. Elizabeth Warren (D., Mass.) asked Amazon to steer customers to “true” books on subjects like climate change to avoid their exposure to “disinformation.” It also follows YouTube censoring videos of jailed Kremlin critic Alexei Navalny before Russia’s parliamentary elections. The move helped Putin and his authoritarian government crack down on pro-Democracy forces.\n\n The Google-owned site is now openly engaged in viewpoint regulation to force users to view only those sources that are consistent with the corporate agenda. Facebook banned misinformation on all vaccines seven months ago and Twitter regularly bans those questioning vaccines.\n\nThese companies are being encouraged by many on the left to expand censorship.\n\nFaculty and editors are now actively supporting modern versions of book-burning with blacklists and bans for those with opposing political views. Columbia Journalism School Dean Steve Coll has denounced the “weaponization” of free speech, which appears to be the use of free speech by those on the right. So the dean of one of the premier journalism schools now supports censorship.\n\nFree speech advocates are facing a generational shift that is now being reflected in our law schools, where free speech principles were once a touchstone of the rule of law. As millions of students are taught that free speech is a threat and that “China is right” about censorship, these figures are shaping a new society in their own intolerant images.\n\nIn one critical hearing, tech CEOs appeared before the Senate to discuss censorship programs. Twitter CEO Jack Dorsey apologized for censoring the Hunter Biden laptop story, but then pledged to censor more people in defense of “electoral integrity.”\n\nDelaware Sen. Chris Coons, however, was not happy. He was upset not by the promised censorship but that it was not broad enough.\n\nHe noted that it was hard to define the problem of “misleading information,” but the companies had to impose a sweeping system to combat the “harm” of misinformation on climate change as well as other areas. “The pandemic and misinformation about COVID-19, manipulated media also cause harm,” Coons said. “But I’d urge you to reconsider that because helping to disseminate climate denialism, in my view, further facilitates and accelerates one of the greatest existential threats to our world.”\n\nConnecticut Sen. Richard Blumenthal also warned that he and his colleagues would not tolerate any “backsliding or retrenching” by “failing to take action against dangerous disinformation.” He demanded “the same kind of robust content modification” from the companies – the new Orwellian term for censorship.\n\nThis is the face of censorship. As demanded, the companies are now sanitizing their sites to remove opposing views on these subjects. Rather than offer a free forum for the full debate on such issues, anti-free speech advocates have again prevailed in silencing those with opposing views.", "opengraph": {"title": "Free speech immunity: YouTube bans channels airing criticism of vaccines", "type": "article", "url": "https://www.liberty.news/2021-10-04-youtube-bans-channels-airing-criticism-of-vaccines.html", "site_name": "Liberty News", "description": "YouTube continued the expansion of corporate censorship on the Internet with the encouragement of leading Democratic leaders. The company has banned channels associated with anti-vaccine activists like Joseph Mercola and Robert F. Kennedy Jr. Once again, rather than rebutting or refuting claims made by others, many sought to silence those with opposing views. YouTube will not allow people […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/10/YouTube-Logo-Phone-Screen.jpg"}, "tags": ["covid-19", "Liberty", "Censored", "speech police", "tech giants", "banned", "vaccine", "Censorship", "politics", "YouTube", "vaccine mandate", "thought police", "obey", "free speech", "Big Tech"], "tweets": [], "movies": [], "links": ["https://jonathanturley.org/2021/07/17/the-lethality-of-free-speech-biden-denounces-big-tech-as-killing-people-by-not-censoring-speech/", "https://www.msn.com/en-us/news/us/youtube-is-banning-prominent-anti-vaccine-activists-and-blocking-all-anti-vaccine-content/ar-AAOXmdF", "https://jonathanturley.org/2021/09/29/enlightened-algorithms-democrats-call-for-increased-corporate-controls-to-protect-citizens-from-their-own-dangerous-curiosities/", "https://jonathanturley.org/2021/09/28/youtube-removes-videos-of-putin-critic-in-latest-act-of-corporate-censorship/", "https://www.vox.com/recode/2021/2/8/22272798/facebook-vaccine-misinformation-covid-19-conspiracy-theories", "https://jonathanturley.org/2021/09/29/free-speech-immunity-youtube-bans-channels-airing-criticism-of-vaccines/", "https://jonathanturley.org/2021/01/22/why-burn-books-when-you-can-ban-them-writers-and-publishers-embrace-blacklisting-in-an-expanding-american-anti-free-speech-movement/", "https://jonathanturley.org/2020/12/09/free-speech-is-being-weaponized-columbia-dean-and-new-yorker-writer-calls-for-more-censorship/", "https://jonathanturley.org/2020/05/04/china-was-right-academics-and-democratic-leaders-call-for-censorship-of-social-media-and-the-internet/", "https://jonathanturley.org/2020/11/02/the-case-for-internet-originalism/", "https://www.nytimes.com/live/2020/10/28/technology/tech-hearing", "https://jonathanturley.org/2021/09/29/free-speech-immunity-youtube-bans-channels-airing-criticism-of-vaccines/"], "authors": [], "publish_date": null}