{"result_id": "187018", "URL": "https://liberty.news/2019-03-03-bezos-amazon-bans-anti-vaccine-movies-from-prime-book-burning.html", "timestamp": "2023-04-25 16:15:09 CEST+0200", "meta": {"description": "In yet another shocking escalation of techno-fascism and online censorship, Amazon has banned numerous “anti-vaccine” videos from its Prime videos after CNN pressured the tech company to remove them. CNN Business now reports that, “Amazon has apparently started removing anti-vaccine documentaries from its Amazon Prime Video streaming service.” CNN, widely known as the fake news […]", "lang": "en", "keywords": "Adam Schiff,Amazon,Anti Vaxx,Anti-vax,badhealth,badmedicine,badscience,banned,Big Pharma,Book Burning,Censorship,censoship,CNN,evil,fascism,films,free speech,health freedom,human knowledge,Immunizations,Jeff Bezos,measles,Movies,outbreaks,speech police,techno-fascism,thought police,Tyranny,Vaccinations,vaccines,Vaxxed", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2019-03-03-bezos-amazon-bans-anti-vaccine-movies-from-prime-book-burning.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "BEZOS goes full FASCIST: Amazon bans “anti-vaccine” movies from Prime; remote book burning of Kindle books coming next", "cleaned_text": "BEZOS goes full FASCIST: Amazon bans “anti-vaccine” movies from Prime; remote book burning of Kindle books coming next\n\nIn yet another shocking escalation of techno-fascism and online censorship, Amazon has banned numerous “anti-vaccine” videos from its Prime videos after CNN pressured the tech company to remove them.\n\nCNN Business now reports that, “Amazon has apparently started removing anti-vaccine documentaries from its Amazon Prime Video streaming service.” CNN, widely known as the fake news propaganda branch of the DNC, goes on to boast how it pressured Amazon to carry out the video censorship, explaining:\n\nThe move came days after a CNN Business report highlighted the anti-vaccine comment available on the site, and hours after Rep. Adam Schiff wrote an open letter to Amazon CEO Jeff Bezos, saying he is concerned “that Amazon is surfacing and recommending” anti-vaccination books and movies.\n\nSome of the documentaries now banned by Amazon include:\n\n– Vaxxed: From Cover-Up to Catastrophe\n\n – We Don’t Vaccinate!\n\n – Shoot ‘Em Up: The Truth About Vaccines\n\nSee my full video coverage of this breaking news here:\n\nCNN now calling for Amazon to ban “anti-vaccine” books\n\nThe same CNN article that celebrates the elimination of “anti-vax” documentaries from Amazon Prime is also seen calling out Amazon for selling anti-vaccine books. CNN apparently believes that Amazon should ban whatever books CNN doesn’t like, even though CNN receives over half of its advertising revenue from the pharmaceutical industry that profits from vaccines and media hysteria surrounding measles outbreaks.\n\n100% organic essential oil sets now available for your home and personal care, including Rosemary, Oregano, Eucalyptus, Tea Tree, Clary Sage and more, all 100% organic and laboratory tested for safety. A multitude of uses, from stress reduction to topical first aid. See the complete listing here, and help support this news site.\n\n“[A] number of anti-vaccine books were still available for purchase on Amazon.com,” CNN warns. “Titles still listed include ‘Miller’s Review of Critical Vaccine Studies: 400 Important Scientific Papers Summarized for Parents and Researchers’ and ‘The Vaccine-Friendly Plan: Dr. Paul’s Safe and Effective Approach to Immunity and Health — from Pregnancy Through Your Child’s Teen Years.'”\n\nCNN reveals that Adam Schiff, a lunatic Democrat tyrant, has been writing warning letters to other tech giants, demanding they remove all content that questions modern vaccine dogma:\n\nSchiff had previously written letters to the heads of Facebook and Google, which owns YouTube, about anti-vaccine content on their platforms. Both companies publicly vowed to make changes to how anti-vaccine content is made available.\n\nComing next: Amazon will push to delete all “anti-vaccine” books from Kindle devices\n\nAs explained in my detailed commentary video, above, the next step for Amazon will be to remotely delete all “anti-vaccine” books from Kindle devices.\n\nBefore long, Amazon will also roll out its nationwide pharmacy retail plan and ban the sales of all nutritional supplements that prevent disease. Just like Google, Twitter, Pinterest and Facebook, Amazon is entirely beholden to Big Pharma and is now accelerating its effort to destroy human knowledge of natural medicine, disease prevention and nutritional science.\n\nWe are living through the Dark Ages of digital tyranny, with Amazon and other tech giants colluding to obliterate human knowledge about natural health while forcing all online speech to promote the most destructive poisons of our age: Pesticides, chemotherapy, fluoride, psychiatric drugs, herbicides, geoengineering pollutants, vaccines and GMOs.\n\nEvery tech giant in America is now 100% dedicated to promoting those poisons while eliminating all speech about natural health, organics, nutritional supplements and natural cures. Twitter recently told Natural News that natural health content is now “hate speech.” Thousands of Twitter channels will soon be banned for promoting organics and anti-cancer foods. (The @HealthRanger channel on Twitter was permanently banned two weeks ago for this very reason.)\n\nThe real goal is the complete criminalization of all speech about organics, nutrition and healthy living\n\nUltimately, the real goal in all this is the criminalization of all speech that promotes natural health, nutrition or disease prevention. The entire establishment now — including the “science” journals, medical schools, media giants and tech giants — are all part of a techno-pharma drug cartel that uses censorship and online defamation to eliminate all opposing views.\n\nBeginning now, the only “allowed” online speech will be speech that promotes pharmaceuticals, fluoride, GMOs, climate change, vaccines, pesticides and chemotherapy poison. Only those websites and content channels that promote these poisons will be ranked on Google or allowed to speak through Facebook, Twitter or other social media platforms.\n\nAll those who promote nutrition, natural health, organics and herbal cures will be banned, defamed, blacklisted and ultimately arrested and prosecuted.\n\nWe are launching a new online non-profit organization to combat this. We’re currently seeking legal representation to file class action lawsuits against multiple tech giants.\n\nVisit OnlineCivilRights.org to see our launch over the next few days. Join the free email list to stay informed.\n\nWhere to stay informed about vaccines\n\nMore coverage of the “Dr. Evil” Jeff Bezos at JeffBezosWatch.com", "opengraph": {"title": "BEZOS goes full FASCIST: Amazon bans “anti-vaccine” movies from Prime; remote book burning of Kindle books coming next", "type": "article", "url": "https://www.liberty.news/2019-03-03-bezos-amazon-bans-anti-vaccine-movies-from-prime-book-burning.html", "site_name": "Liberty News", "description": "In yet another shocking escalation of techno-fascism and online censorship, Amazon has banned numerous “anti-vaccine” videos from its Prime videos after CNN pressured the tech company to remove them. CNN Business now reports that, “Amazon has apparently started removing anti-vaccine documentaries from its Amazon Prime Video streaming service.” CNN, widely known as the fake news […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2019/03/jeff-bezos-dr-evil.jpg"}, "tags": ["censoship", "Big Pharma", "speech police", "free speech", "human knowledge", "measles", "techno-fascism", "Anti-vax", "Vaxxed", "Book Burning", "banned", "films", "Vaccinations", "Anti Vaxx", "Adam Schiff", "outbreaks", "thought police", "Tyranny", "Movies", "evil", "fascism", "Amazon", "Censorship", "CNN", "vaccines", "Immunizations", "health freedom", "Jeff Bezos"], "tweets": [], "movies": [], "links": ["https://www.cnn.com/2019/03/01/tech/amazon-anti-vaccine-movies-schiff/index.html", "http://Brighteon.com/6009511692001", "http://organicessentialoils.naturalnews.com/organic-essential-oil-gift-set.html", "http://techgiants.news", "https://www.naturalnews.com/2017-07-27-confirmed-amazon-going-all-in-with-big-pharma-plans-to-launch-online-pharmaceutical-sales-to-earn-billions-in-drug-profits.html", "http://naturalnews.com", "http://OnlineCivilRights.org", "http://Vaccines.news", "http://VacTruth.com", "http://ChildrensHealthDefense.org", "http://Brighteon.com", "http://Vaxxed2.com", "http://RobertScottBell.com", "http://JeffBezosWatch.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibertynews%2F2019-03-03-bezos-amazon-bans-anti-vaccine-movies-from-prime-book-burning&linkname=BEZOS%20goes%20full%20FASCIST%3A%20Amazon%20bans%20%E2%80%9Canti-vaccine%E2%80%9D%20movies%20from%20Prime%3B%20remote%20book%20burning%20of%20Kindle%20books%20coming%20next", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}