{"result_id": "187044", "URL": "https://liberty.news/2021-08-28-vaccine-mandate-ecuador-defeated-health-freedom-organization.html", "timestamp": "2023-04-25 16:15:25 CEST+0200", "meta": {"description": "A government-backed Wuhan coronavirus (COVID-19) vaccine mandate in the Loja Province of Ecuador was defeated on Aug. 5. A health freedom organization in Ecuador has successfully defeated a government-backed Wuhan coronavirus (COVID-19) vaccine mandate in the Loja Province. Ecuador has an above-average vaccination rate when compared to the rest of its South American neighbors. As of […]", "lang": "en", "keywords": "coercion,coronavirus,coronavirus vaccines,covid-19,Ecuador,freedom,goodhealth,government,health freedom,Liberty,medical fascism,Medical Tyranny,Resist,Tyranny,vaccine mandate,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://liberty.news/2021-08-28-vaccine-mandate-ecuador-defeated-health-freedom-organization.html", "encoding": "UTF-8"}, "image": null, "domain": "liberty.news", "title": "Vaccine mandate in Ecuador province defeated by health freedom organization", "cleaned_text": "A government-backed Wuhan coronavirus (COVID-19) vaccine mandate in the Loja Province of Ecuador was defeated on Aug. 5.\n\nA health freedom organization in Ecuador has successfully defeated a government-backed Wuhan coronavirus (COVID-19) vaccine mandate in the Loja Province.\n\nEcuador has an above-average vaccination rate when compared to the rest of its South American neighbors. As of press time, it has fully vaccinated around 41 percent of its adult population, while another 16 percent have received one dose of the COVID-19 vaccine. The government of Ecuador is very close to its goal of fully vaccinating nine million people – over half of the country’s population – by early September.\n\nThe Ecuadorian government is able to conduct its mass vaccination program by employing a number of tyrannical, invasive and coercive strategies.\n\nTo identity people that are eligible for vaccination, the government has people’s personal information using the national electoral register. This register was recently updated because of the country’s general election held earlier this year. Eligible Ecuadorians were contacted and told to head to mass vaccination centers.\n\nThe government enlisted the help of the country’s armed forces to set up these mass vaccination centers in voting locations all over the country.\n\nTo force people to go on their designated vaccination dates, provincial governments enacted vaccine mandates. This is what Loja Province did. (Related: Ecuadorians go online to fight against vaccine mandates in their country.)\n\nOn July 6, the Emergency Operations Committee (COE), the crisis response and management agency of the provincial government, announced the vaccine mandate. According to the announcement, all provincial residents over the age of 16 have to be vaccinated by Aug. 9.\n\nThe COE also announced restrictions on unvaccinated individuals. These were meant to segregate the unvaccinated population and to coerce them into getting the experimental vaccines that can cause deadly side effects.\n\nThe restrictions prevented unvaccinated individuals from entering government buildings, bills payment centers, banks, restaurants and many other public spaces.\n\nNick Vasey, an activist and the founder of Loja-based pro-health freedom organization Human Rights Ecuador, went to work immediately to oppose the vaccine mandate.\n\n“You had to extrapolate the real end result of all this,” said Vasey in an interview with The Epoch Times. “They [COE] gave the Ecuadorian community zero time to respond to their decree and planned to steamroll the population.”\n\nAccording to Human Rights Ecuador, the proposed vaccine mandate is not only unconstitutional, but it also violates international law, namely the UNESCO Universal Declaration on Bioethics and Human Rights. The country’s constitution states that international agreements ratified by the government, like the UNESCO declaration, take precedence over provincial-level regulations.\n\nThe constitution of Ecuador guarantees citizens the right to refuse medical treatments. It also guarantees that all citizens must be treated equally before the law.\n\nVasey, through his lawyer, filed an injunction against the COE and its vaccine mandate on July 30. His lawyer then scheduled a meeting for Aug. 3. with the provincial ombudsman. Vasey and his organization were hoping this meeting would convince the ombudsman to side with them and override the COE’s vaccine mandate.\n\nThis is exactly what happened. On Aug. 5, the ombudsman’s office announced that the COE’s vaccine mandate and its accompanying restrictions on the unvaccinated were unconstitutional.\n\nThe ombudsman’s office explained that the mandate and the restrictions on the unvaccinated violated people’s rights to conscientious objection, to freely engage in economic activities, to personal and family privacy and to make free, responsible and informed decisions regarding their health.\n\n“There was formidable and constitutionally binding human rights opposition to the proposed measure,” said Vasey.\n\nThis was a significant blow to the Ecuadorian government’s mass vaccination plan. But that’s not all. On the same day, the Constitutional Court of Ecuador ruled against extending the state of emergency in two more provinces – in Guayas and El Oro. These two provinces have a combined population of over 5.1 million people, or around 28 percent of the entire country’s population.\n\nWithout the extended state of emergency, the COEs of those two provinces lack the administrative power to push for more COVID-19 vaccinations through mandates and restrictions on the unvaccinated.\n\nA large segment of the Ecuadorian population is already fully vaccinated. But efforts from organizations like Vasey’s help give the remainder of the populace that does not want to get the deadly vaccines hope.\n\nLearn more about the ways people all over the world are resisting vaccine mandates by reading the latest articles at Vaccines.news.", "opengraph": {"title": "Vaccine mandate in Ecuador province defeated by health freedom organization", "type": "article", "url": "https://www.liberty.news/2021-08-28-vaccine-mandate-ecuador-defeated-health-freedom-organization.html", "site_name": "Liberty News", "description": "A government-backed Wuhan coronavirus (COVID-19) vaccine mandate in the Loja Province of Ecuador was defeated on Aug. 5. A health freedom organization in Ecuador has successfully defeated a government-backed Wuhan coronavirus (COVID-19) vaccine mandate in the Loja Province. Ecuador has an above-average vaccination rate when compared to the rest of its South American neighbors. As of […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/08/Coronavirus-Covid-19-No-Vaccine-Protestors.jpg"}, "tags": ["government", "covid-19", "Liberty", "medical fascism", "Resist", "Ecuador", "coercion", "vaccine mandate", "Medical Tyranny", "Tyranny", "vaccines", "coronavirus", "freedom", "health freedom", "coronavirus vaccines"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/vaccine-mandate-in-ecuador-province-defeated-by-legal-action_3964903.html", "https://www.nytimes.com/interactive/2021/world/covid-vaccinations-tracker.html", "https://blogs.worldbank.org/latinamerica/why-ecuador-vaccinates-its-population-faster-rest-world", "https://www.naturalnews.com/2021-08-17-ecuadorians-website-fight-against-vaccine-mandates.html", "https://healthfreedom.news/", "http://www.lodelmomentoloja.com/inicio/no-podra-exigir-carnet-de-vacunacion/", "https://vaccines.news/", "https://www.theepochtimes.com/vaccine-mandate-in-ecuador-province-defeated-by-legal-action_3964903.html", "https://www.nytimes.com/interactive/2021/world/covid-vaccinations-tracker.html", "https://blogs.worldbank.org/latinamerica/why-ecuador-vaccinates-its-population-faster-rest-world", "http://www.lodelmomentoloja.com/inicio/no-podra-exigir-carnet-de-vacunacion/"], "authors": [], "publish_date": null}