{"result_id": "187011", "URL": "https://www.liberty.news/2021-06-16-houston-methodist-hospital-suspends-unvaccinated-employees.html", "timestamp": "2023-04-25 16:15:04 CEST+0200", "meta": {"description": "The Houston Methodist Hospital system in Texas has suspended 178 employees without pay for refusing to get vaccinated against the Wuhan coronavirus (COVID-19). Houston Methodist comprises eight hospitals and several other emergency centers and clinics throughout the Greater Houston metropolitan area. Last month, it put out a new policy requiring all of its roughly 25,000 employees […]", "lang": "en", "keywords": "badhealth,badmedicine,coronavirus,health freedom,Houston Methodist Hospital,Liberty,medical fascism,Medical Tyranny,pandemic,Texas,Tyranny,vaccine mandates,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.liberty.news/2021-06-16-houston-methodist-hospital-suspends-unvaccinated-employees.html", "encoding": "UTF-8"}, "image": null, "domain": "www.liberty.news", "title": "Houston Methodist Hospital suspends 178 employees who refused to get vaccinated", "cleaned_text": "Houston Methodist Hospital suspends 178 employees who refused to get vaccinated\n\nThe Houston Methodist Hospital system in Texas has suspended 178 employees without pay for refusing to get vaccinated against the Wuhan coronavirus (COVID-19).\n\nHouston Methodist comprises eight hospitals and several other emergency centers and clinics throughout the Greater Houston metropolitan area. Last month, it put out a new policy requiring all of its roughly 25,000 employees to get vaccinated. In addition, the company required everyone to get two doses of either the Pfizer-BioNTech or Moderna vaccines or one dose of the Johnson & Johnson vaccine by June 7 or risk termination.\n\nAccording to Houston Methodist CEO Marc Boom, 99 percent of the hospital system’s employees were fully vaccinated by the passage of the imposed deadline. Only 178 individuals – less than one percent of the company’s workforce – refused to get the vaccine and did not receive a deferral or a waiver from the company. These individuals were suspended for two weeks without pay.\n\nTwenty-seven of the 178 suspended workers have received one dose of the vaccine. Boom is hopeful that the two-week unpaid suspension will convince them to get the second dose.\n\nAll 178 workers are set to be fired if they refuse to get the first or second dose of the COVID-19 vaccine by the end of their two-week suspension.\n\n“We are nearly 100 percent compliant with our COVID-19 vaccine mandate,” wrote Boom in an email to staff on Tuesday, June 8. “Houston Methodist is officially the first hospital system in the country to achieve this goal for the benefit of its patients.”\n\n“I wish the number could be zero, but unfortunately, a small number of individuals have decided not to put their patients first,” added Boom. (Related: Houston Methodist Hospital orders staff to withhold adverse reactions caused by COVID vaccines from official records.)\n\nAn additional 332 employees were granted deferrals for pregnancies and other related medical reasons, and 285 employees were exempted due to medical or religious exemptions.\n\nRegarding the suspension, Boom said:\n\nHouston Methodist became the first hospital system in the U.S. to impose a vaccine mandate on its employees. Back in April, the hospital system told its administrative staff and new hires to get vaccinated by mid-April. It later extended this deadline to June 7. The company even offered employees a $500 bribe if they got vaccinated early on in the rollout of the vaccines.\n\nAfter the suspensions, dozens of protesters held a rally outside the Houston Methodist Baytown Hospital. They were joined by medical workers in the hospital who staged a walkout.\n\n“No one should be forced to put something into their body if they’re not comfortable with it,” said Jennifer Bridges, a nurse who has been working with the hospital system for over six years.\n\nBridges was presented with documentation regarding her suspension on June 7. “I cried the whole way out.”\n\n“I’m not an anti-vax person,” she said. “If you want to get it, by all means, get it. I don’t take that away from anybody. Just let everybody have a choice and the right to make their own decision.”\n\nThe protesters were joined by Dr. Angelina Farella, a pediatrician and member of America’s Frontline Doctors, a group that is strongly opposed to vaccine mandates, especially for the experimental coronavirus vaccines. Farella has refused to administer any of the COVID-19 vaccines.\n\n“If you are a healthy American under the age of 50 there is no reason for you to get this vaccine,” she said. She added that the vaccines might actually be dangerous for people who have already recovered from the coronavirus and have naturally developed antibodies against it.\n\nFarella and the other protesters believe that the Houston Methodist Hospital system is downplaying data from the Vaccine Adverse Event Reporting System, the federal database for adverse reactions to vaccinations. VAERS indicates there have been a significant number of deaths and adverse events related to the coronavirus vaccines.\n\n“This is not how medicine was ever,” said Farella. “Forcing people to get a vaccine, in some cases in which they are already immune since they’ve had the disease, is medical tyranny.”\n\nOne-hundred and seventeen of the suspended workers have filed a lawsuit against Houston Methodist over its vaccine mandate. The group is being represented by Jared Woodfill from the Houston-based Woodfill Law Firm.\n\nWoodfill said that, in addition to the 117 initial plaintiffs, another 50 individuals have indicated their interest in joining the lawsuit.\n\nThe Woodfill Law Firm has already asked the court to declare the hospital’s vaccine mandate illegal. He argues that, because the vaccine is an experimental product, it should be illegal to force employees to receive it.\n\n“[The vaccine] that’s been on the market for less than a year. And yes, it’s being used under [emergency use authorization], but at the same time, that is experimental by definition,” said Woodfill.\n\n“You can’t fire someone for refusing to do something illegal, and if you look at federal law, it makes it very clear that it’s illegal to force someone to participate in a vaccine trial.”\n\nThe case was initially filed in the Montgomery County District Court. But it has since been moved to federal court. The case is being handled by Judge Lynn Hughes, who has requested filings from both parties and plans to make a quick decision. Woodfill said once Hughes has issued a ruling there may be an emergency appeal filed with the Fifth Circuit Court of Appeals.\n\n“This issue, in either this case or another, should end up before the Supreme Court,” said Woodfill.\n\n“We will fight this all the way to the Supreme Court,” said Bridges during the protest. “This is wrongful termination and a violation of our rights.”\n\nLearn more about how companies like Houston Methodist are attempting to force their employees to take the coronavirus vaccine through vaccine mandates by reading the latest articles at Vaccines.news.", "opengraph": {"title": "Houston Methodist Hospital suspends 178 employees who refused to get vaccinated", "type": "article", "url": "https://www.liberty.news/2021-06-16-houston-methodist-hospital-suspends-unvaccinated-employees.html", "site_name": "Liberty News", "description": "The Houston Methodist Hospital system in Texas has suspended 178 employees without pay for refusing to get vaccinated against the Wuhan coronavirus (COVID-19). Houston Methodist comprises eight hospitals and several other emergency centers and clinics throughout the Greater Houston metropolitan area. Last month, it put out a new policy requiring all of its roughly 25,000 employees […]", "image": "https://www.liberty.news/wp-content/uploads/sites/40/2021/06/Coronavirus-Hospital-Team-Nurses-Doctors-Tired-Overtime-Work.jpg"}, "tags": ["pandemic", "medical fascism", "Liberty", "Texas", "vaccine mandates", "Medical Tyranny", "vaccines", "Houston Methodist Hospital", "coronavirus", "health freedom", "Tyranny"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-9668979/More-170-employees-Houston-Methodist-Hospital-suspended-refusing-vaccine.html", "https://www.usatoday.com/story/news/health/2021/06/09/houston-methodist-hospital-workers-refuse-covid-vaccine-get-suspended/7616446002/", "https://www.naturalnews.com/2021-06-08-houston-methodist-orders-staff-withhold-reactions-vaccines.html", "https://thetexan.news/houston-hospital-nurses-stage-walkout-over-vaccine-mandate/", "https://tyranny.news/", "https://vaccines.news/", "https://www.dailymail.co.uk/health/article-9668979/More-170-employees-Houston-Methodist-Hospital-suspended-refusing-vaccine.html", "https://www.usatoday.com/story/news/health/2021/06/09/houston-methodist-hospital-workers-refuse-covid-vaccine-get-suspended/7616446002/", "https://thetexan.news/houston-hospital-nurses-stage-walkout-over-vaccine-mandate/"], "authors": [], "publish_date": null}