{"result_id": "188008", "URL": "https://www.libertyplanets.com/articles/pfizer-admits-myocarditis-risk-for-5-12-year-olds-requires-5-year-study/", "timestamp": "2023-04-25 16:15:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/pfizer-admits-myocarditis-risk-for-5-12-year-olds-requires-5-year-study/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "Pfizer Admits Myocarditis Risk for 5-12 Year Olds Requires 5-Year Study", "cleaned_text": "Pfizer has finally admitted that they needed to do more clinical trials, and what was conducted was too short to determine the long term effects of myocarditis risk in children, according to a report they submitted to the FDA.\n\nPerhaps they could have made this admission known BEFORE “vaccines” were approved for use in children aged 5-11 years old.\n\nParents have already rushed out and had their children jabbed, which is confusing considering the large influx of negative information on the “vaccine.”\n\nMaybe most parents just hate their kids and want them dead…\n\nPerhaps the FDA could have also not issued emergency use authorization for the Pfizer “vaccine,” when only a month ago they had, at the same time, held back on issuing an EUA for the Moderna shot, which has had similar issues to Pfizer.\n\nThe admittance occurs on page 11 of their FDA advisory committee briefing, admitting the sample size of volunteers in their clinical trials was also too small to detect myocarditis in children under 12.\n\n“The number of participants in the current clinical development program is too small to detect any potential risks of myocarditis associated with vaccination,” Pfizer states in its Overall Risk-Benefit Conclusions.\n\n“Long-term safety of COVID-19 vaccine in participants 5 to <12 years of age will be studied in 5 post-authorization safety studies, including a 5-year follow-up study to evaluate long term sequelae of post-vaccination myocarditis/pericarditis.”\n\nPfizer recently opted to add tromethamine to their children’s doses, which is used to treat metabolic acidosis which can occur after a heart attack.\n\nThe introduction of tromethamine went largely unnoticed and unreported, and comes with a host of its own potential adverse reactions, including liver failure.\n\nDuring a congressional hearing on November 15, addressing China Virus “vaccine” injuries and death, Sen. Ron Johnson (R-WI) called out the government’s response to the “pandemic” and the effectiveness of the “vaccines.”\n\nIn his address to Congress, he stated:\n\n“Telling the truth in today’s ‘cancel culture’ is not necessarily easy. Had government officials, the heads of our healthcare agencies, had they been doing their job, had they been honest and transparent with the American public, we wouldn’t be here today. But the very sad fact of the matter is, is they haven’t.”\n\n“One of the huge blunders of our government response is we not only ignored, but ‘higher ups’ in the agencies sabotaged early treatment. Had the vaccines been effective, had they done that, you [would] see a tailing off of that curve basically into infinity, but that’s not what we see, we see a whole new surge.”\n\nThe senator then tore into the validity of the “vaccine” mandates and the effectiveness of the “vaccines” overall:\n\n“If the vaccines are effective, then the mandates are pointless. If the vaccines are effective, there’s no need for mandates. If you want the vaccine, you’ve got it, you’re protected and you don’t care if someone else is vaccinated,” Johnson said. “Are the vaccines effective? If it’s a ‘no’, then it’s the same point, the mandates are pointless.”\n\nHe then called out policy makers for ignoring natural immunity to the virus:\n\n“Another thing our policy makers are ignoring is natural immunity. Why would we force a vaccine that’s not effective as we had all hoped? Why would we force that on someone who is naturally immune?”\n\n“Where the science tells us those with natural immunity probably have better and more long lasting immunity than those fully-vaxxed.”\n\n“The other reality that our policy makers are denying is that vaccines prevent infection, prevent transmission, they’re not. It’s obvious they’re not. So again, if you’re vaccinated, can still get infected and still transmit, what is the rationale for the mandates? There is no rationale, they’re pointless,” he concluded.\n\nThe point of the mandates is GLOBAL DEPOPULATION.\n\nPoliticians, in particular, really need to get that before it’s too late, before the Globalists claim the planet and destroy the United States while doing it. Because that’s the aim.\n\nWhat really needs to happen is that politicians need to be supplied with the New World Order white papers, and then after that, we can really let off some fireworks — this is, of course, with the politicians who aren’t controlled by the Globalists or compromised by their money. And let’s be honest, there’s quite a few of them in D.C.\n\nBut with the ones who aren’t, sky’s the limit.\n\nSay it with me: GLOBAL DEPOPULATION. GLOBAL DEPOPULATION. GLOBAL DEPOPULATION.\n\nThat’s what it’s all about, and it needs to be addressed QUICKLY in a mainstream spotlight.\n\nWe do that, we win.\n\nThis is all a numbers game.\n\nThe bigger the resistance, the less power the Globalists have.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer Admits Myocarditis Risk for 5-12 Year Olds Requires 5-Year Study - Liberty Planet", "description": "Pfizer has finally admitted that they needed to do more clinical trials, and what was conducted was too short to determine the long term effects of myocarditis risk in children, according to a report they submitted to the FDA. Perhaps they could have made this admission known BEFORE \"vaccines\" we", "url": "https://www.libertyplanets.com/articles/pfizer-admits-myocarditis-risk-for-5-12-year-olds-requires-5-year-study/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "November 18, 2021 at 2:47 pm"}