{"result_id": "188009", "URL": "https://www.libertyplanets.com/articles/fda-cdc-admit-pfizer-and-moderna-vaccines-cause-myocarditis-in-young-people-with-males-affected-most/", "timestamp": "2023-04-25 16:15:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/fda-cdc-admit-pfizer-and-moderna-vaccines-cause-myocarditis-in-young-people-with-males-affected-most/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "FDA, CDC Admit Pfizer and Moderna Vaccines Cause Myocarditis in Young People, With Males Affected Most", "cleaned_text": "It would probably come as no surprise to you, if you’ve been paying attention during this pandemic, that the Food and Drug Administration (FDA) and Centers for Disease Control and Prevention (CDC) have finally admitted – that the covid vax causes an increased risk of myocarditis.\n\nThe worst group affected is of course 12 to 15 year olds, and data from the Vaccine Adverse Effects Reporting System (VAERS) shows that males in particular, have a 133 times greater risk of developing the heart condition, that’s a 13,300 percent higher risk.\n\nAccording to their study, which used 1,626 cases of myocarditis occurring in the past year, found that the Pfizer vax was the most dangerous of them all – 105.9 cases of myocarditis per million doses of the second vax in males aged 16 and 17 and 70.7 cases of myocarditis per million doses after the second shot in males aged 12 to 15.\n\nMyocarditis inflames the heart muscles, causing rapid, abnormal heart rhythms, straining the heart and significantly reducing its capability to pump blood around the body.\n\nThe heart muscles eventually become weak, the rest of the body becomes deoxygenated due to the lack of blood and this can lead to stroke and heart attack.\n\nMales who are between the ages of 18 and 24, didn’t fare much better and also had higher rates of developing myocarditis – around 52.43 cases per million doses for the Pfizer vax and 56.31 cases per million doses for Moderna’s vax.\n\nFemales who are between the ages of 12 to 15 are at lower risk of developing myocarditis than males, but their risk is still high with 6.35 cases per million doses after having a second Pfizer dose.\n\nFemales between 16 and 17 years old, sit in at 10.98 cases per million doses after the second Pfizer shot.\n\nThose females in the 18 to 24 age range have a higher risk too, with 4.21 cases per million doses after the second Pfizer shot and 6.87 cases per million doses for the Moderna shot\n\nInterestingly, those older individuals were actually at the lower end of the risk table. The FDA and CDC found that those both male and female, before the age of 49 still had an increased risk of developing myocarditis after having the shots, but those 50 and over showed they had little to no risk of developing myocarditis.\n\nAccording to the data, following a Pfizer vax, males between the ages of 18 to 24 have a 2,879 percent increased risk of developing myocarditis and males who are 16 and 17 have a whopping 7,800 percent greater chance of developing myocarditis.\n\nModerna was slightly less, after the data showed after the shots, the risk increases by 3,099 percent for males 16 to 24 and 1,568 percent for males 25 to 29.\n\nThis isn’t isolated, however, as other studies have reported similar results, that the covid vax is increasing the risk of heart inflammation exponentially.\n\nData released from a study done in Hong Kong in November 2021, showed that male children aged between 12 and 17 have a one in 2,680 chance of developing the condition within two weeks of taking a second Pfizer vax.\n\nResearch from Israel found that males ages 16 to 19 have a one in 6,600 chance of developing a heart condition and the study also showed an 81 percent chance of hospitalization for myocarditis and the death rate is almost one percent.\n\nThe United Kingdom found that the risk of myocarditis in men under 40 is several times higher for those who have taken a covid vax, than those who haven’t. Their study also noted that the vax itself is making the disease far worse than normal.\n\nThe heart condition can affect a person for years to come and they may never fully recover and because they have already had the heart condition previously, the risk of heart attack later on in life also increases.", "opengraph": {"locale": "en_US", "type": "article", "title": "FDA, CDC Admit Pfizer and Moderna Vaccines Cause Myocarditis in Young People, With Males Affected Most - Liberty Planet", "description": "It would probably come as no surprise to you, if you've been paying attention during this pandemic, that the Food and Drug Administration (FDA) and Centers for Disease Control and Prevention (CDC) have finally admitted - that the covid vax causes an increased risk of myocarditis.  The worst group", "url": "https://www.libertyplanets.com/articles/fda-cdc-admit-pfizer-and-moderna-vaccines-cause-myocarditis-in-young-people-with-males-affected-most/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "March 3, 2022 at 3:39 pm"}