{"result_id": "188004", "URL": "https://www.libertyplanets.com/articles/rand-paul-quickly-leaves-congressional-meeting-the-dems-try-to-prank-him/", "timestamp": "2023-04-25 16:15:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/rand-paul-quickly-leaves-congressional-meeting-the-dems-try-to-prank-him/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "Rand Paul Quickly Leaves Congressional Meeting-The Dems Tried To \"Prank\" Him", "cleaned_text": "Senator Rand Paul (R-Ky.) left the committee hearing early on Wednesday when the Democratic chairman took actions to discredit the Republican committee members.\n\nThe Fire Grants and the Safety Act, a measure that would expand government financing for fire departments were being discussed by the Senate Homeland Security Committee. But when Chairman Gary Peters (D) utilized procedural strategies against Paul and the revisions he had proposed, the meeting turned tense.\n\nOne of those changes would bar fire departments from receiving federal funding if they fired staff members for refusing the COVID-19 vaccine. But, if they rehired such people and granted them back pay, they would be qualified.\n\nPeters, however, “by substituting wording mandating the inspector general of the U.S. to undertake an audit and report on impediments that impede fire departments from getting funding,” The Hill noted, effectively nullified the impact of Paul’s amendment.\n\nFor Paul, that was the deciding factor.\n\nHe accused Peters of pulling a “legislative hoax on the American public” by continually challenging his amendments using second-degree amendments, that are actually amendments of amendments. According to Paul, Peters is taking this action to spare Democrats from having to “directly vote on a vaccination amendment.”\n\nThe two senators then disagreed about the proper protocol to follow when proposing an amendment, whether Paul could do so, as well as whether Peters’ amendment was genuinely a third-degree amendment.\n\n“If this is the way you’re going to lead the committee, I would advise that Republicans leave,” Paul eventually stated. “If you’re going to make up the rule, I don’t see why we should stay. You intend to propose a third-degree amendment?”\n\nSenator Kyrsten Sinema of Arizona interjected and urged the legislators to control their rage, but Paul made it obvious that Peters was taking an unfair advantage of the situation.\n\n“Since I have been here, this is the only hearing I am aware of where we have had second-degree amendments on each of our amendments to refuse voting on the amendment. Therefore, we’ve just followed the identical procedure” Paul clarified. “That came from this microphone and was given. I was approved to offer it, but now they’re backtracking and attempting to amend the rules.”\n\n“If we’re going to allow for a third-degree amendment that solely the majority can propose, I, for one, won’t be staying here,” Paul stated.\n\nPaul walked away after that.\n\nAll Democrats voted in favor of Peters’ proposal, which the committee ultimately endorsed; not a single Republican did.", "opengraph": {"locale": "en_US", "type": "article", "title": "Rand Paul Quickly Leaves Congressional Meeting-The Dems Tried To \"Prank\" Him - Liberty Planet", "description": "Senator Rand Paul (R-Ky.) left the committee hearing early on Wednesday when the Democratic chairman took actions to discredit the Republican committee members. The Fire Grants and the Safety Act, a measure that would expand government financing for fire departments were being discussed by the Se", "url": "https://www.libertyplanets.com/articles/rand-paul-quickly-leaves-congressional-meeting-the-dems-try-to-prank-him/", "site_name": "Liberty Planet", "article:section": "Featured", "image": "https://www.libertyplanets.com/wp-content/uploads/2023/03/Depositphotos_106913610_S.jpg", "image:secure_url": "https://www.libertyplanets.com/wp-content/uploads/2023/03/Depositphotos_106913610_S.jpg", "image:width": "600", "image:height": "400", "image:url": "https://www.libertyplanets.com/wp-content/uploads/2023/03/Depositphotos_106913610_S.jpg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "March 19, 2023 at 2:03 pm"}