{"result_id": "188031", "URL": "https://www.libertyplanets.com/articles/zuckerberg-caught-telling-his-own-people-about-the-dangers-of-the-covid-19-vaccine-months-before-it-was-rolled-out/", "timestamp": "2023-04-25 16:15:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/zuckerberg-caught-telling-his-own-people-about-the-dangers-of-the-covid-19-vaccine-months-before-it-was-rolled-out/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "Zuckerberg Caught Telling His Own People About The Dangers Of The COVID-19 Vaccine Months Before It Was Rolled Out", "cleaned_text": "Leaked footage has dropped of Meta Platforms, Inc. CEO Mark Zuckerberg cautioning his inner circle at Facebook of the effects of the covid vaccine, which he called “experimental gene technology.”\n\nThis was well before the rollout of the vaccine happened, by the way, and the footage, which was taken in July of 2020, showed Zuckerberg warning his employees of the potential dangers related to taking the covid shots – ironic given Facebook has been feverishly censoring social media users who share information about the vaccines being dangerous.\n\nIn a leaked video, taken during an internal meeting at Facebook, Zuckerberg said “I just want to make sure that I share some caution on this [vaccine] because we just don’t know the long-term side-effects of basically modifying people’s DNA and RNA to directly encode in a person’s DNA and RNA basically the ability to produce those antibodies and whether that causes other mutations or other risks downstream.”\n\nJames O’Keefe, founder of Project Veritas, pointed out that Zuckerberg would have been censored and possibly banned from his own platform if he had posted such sentiments about the vaccines – “basically violating his own code of conduct,” said O’Keefe.\n\nNews website News Punch pointed out the obvious hypocrisy, “It is yet another case of ‘one rule for thee, and another for me’ that the elite use to control the masses,” News Punch said.\n\nSince the beginning of the pandemic, Facebook has censored over 20 million posts by social media users and this includes some high-profile people and major groups who were not only booted from the Facebook platform, but from Instagram too, which is part of Meta Platforms Inc.\n\nMeta had censored 20 million posts since start of pandemic\n\nLast year, FB and Instagram (IG), which is also under the Meta Platforms umbrella, banned major groups, accounts and IG pages for speaking out and raising concerns and doubts about the vaccines’ adverse effects.\n\nDuring an interview with Gayle King on CBS last August, Zuckerberg was asked about how many people had viewed what Facebook had deemed misinformation about the covid vaccine, to which Zuckerberg admitted that there had been millions of posts removed but couldn’t answer exactly how many people had seen them.\n\n“I think, to some degree, there are also different definitions that people have over what misinformation is. A lot of the stuff that’s actually the hardest for us to really address is not what I would call ‘misinformation’ but instead another category that I would call ‘hesitancy,’” he said at the time.\n\nOne prominent user that was banned was Robert F. Kennedy Jr., an environmental lawyer and self-described vaccine safety advocate – who was banned after “fact-checker” banned Kennedy Jr. from Instagram for speaking out against the covid vaccines.", "opengraph": {"locale": "en_US", "type": "article", "title": "Zuckerberg Caught Telling His Own People About The Dangers Of The COVID-19 Vaccine Months Before It Was Rolled Out - Liberty Planet", "description": "Leaked footage has dropped of Meta Platforms, Inc. CEO Mark Zuckerberg cautioning his inner circle at Facebook of the effects of the covid vaccine, which he called “experimental gene technology.” This was well before the rollout of the vaccine happened, by the way, and the footage, which was take", "url": "https://www.libertyplanets.com/articles/zuckerberg-caught-telling-his-own-people-about-the-dangers-of-the-covid-19-vaccine-months-before-it-was-rolled-out/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "July 18, 2022 at 4:09 pm"}