{"result_id": "188029", "URL": "https://www.libertyplanets.com/articles/octopus-like-worms-found-in-bizarre-and-rubbery-baseball-sized-blood-clots-in-the-vaccinated-ccp-military-making-new-human-infecting-coronavirus-deadlier-than-covid-elites-deploy-massive-campaign-to/", "timestamp": "2023-04-25 16:15:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/octopus-like-worms-found-in-bizarre-and-rubbery-baseball-sized-blood-clots-in-the-vaccinated-ccp-military-making-new-human-infecting-coronavirus-deadlier-than-covid-elites-deploy-massive-campaign-to/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "OCTOPUS-LIKE WORMS Found in Bizarre and Rubbery BASEBALL-SIZED BLOOD CLOTS in the Vaccinated, CCP Military Making New Human-Infecting Coronavirus DEADLIER Than COVID; Elites Deploy MASSIVE Campaign to Remove Joe Rogan From Spotify for \"COVID Misinfo\", American Truckers Launch THEIR OWN Convoy Protest Against \"Vax\" Mandates From CALI TO DC", "cleaned_text": "Mr. Richard Hirschman, a mortician who has noticed a sharp increase in deaths related to heart attacks and strokes as of late, says he has pulled out strange looking blood clots from bodies he has embalmed. During an interview with Dr. Ruby Jane, Mr. Hirschman said that many of the deceased he had worked with had died from a heart attack or stroke.\n\nHe said during the embalming process, he had found it difficult in patients who had received a Chinese Communist Party (CCP) Virus “vaccine,” and out of their large blood vessels, he pulled out strange materials. “I actually pulled this long, fibrous-looking clot out prior to embalming,” Hirschman said, showing images of a clot he took out of a person. “At the front end of it, it looks like a normal blood clot, but that white fibrous-looking stuff just isn’t normal,” he added.\n\nHe continued, “If one of these small fibrous tissues gets up into the brain, they’re going to have a stroke. If it gets into your heart, it’s going to lead you to a heart attack…I don’t want to be the bearer of bad news but at the same time, people need to know this. If it is the vaccine that’s causing this, we need to stop it. Whatever this stuff is, if we can figure out what it is, then maybe we can figure out a way to dissolve these things to help save peoples’ lives.” British man, Mark Ruston got the AstraZeneca vax due to him being at risk of covid, since he has kidney issues requiring dialysis and he had had a kidney transplant. He quickly reported feeling ill, not long after taking the vax but after his second dose, Ruston reported patchy vision, severe headaches and inability to generate body heat and leaked a discharge from his one for more than four months. He then discovered a large blood clot in his leg that doctors were able to dissolve before it caused too much damage. After getting agonizing pain in his arm and being admitted to hospital, Ruston was diagnosed with arteriovenous fistula thrombosis – blood clots at the site of his dialysis tubes.\n\n“Vaccines” are now being used as bioweapons and there are five major fronts that vax manufacturers and the Communist Chinese use to make war on humanity. 3. mRNA is used to recode cells, which then produce toxic prions that cause clotting.\n\n4. Vital organs are attacked as well as the immune system. This includes the heart and the brain. 5. Blood is invaded by billions of prions that can cause cancer and blood clotting.\n\nCHINA IS TINKERING WITH VIRUSES AGAIN\n\nNeoCoV is allegedly the next deadly virus, described by Chinese scientists from Wuhan University as potentially more transmissible and more lethal. What is most disturbing about this, is the fact that the Chinese have been showing interest in this virus since January 2021 and have said that the virus is only one mutation away from being able to infect humans. We all know where covid-19 came from.\n\nTHE PRESSURE IS ON SPOTIFY\n\nA growing number of musicians and podcasters are taking their content off Spotify’s platform because they fear what Joe Rogan has to say on his podcast – The Joe Rogan Experience. Rogan has recently come out to talk about the vax and the alternative treatments that work, like ivermectin and Hydroxychloroquine, much to the distaste of the vax pushing celebrities, who are no doubt raking in Big Pharma cash to sell out their fans. Neil Young, the geriatric rocker from Canada threatened to take his music off the platform if they didn’t ditch Rogan. But now he has been joined by a growing number of artists like Joni Mitchell and the Foo Fighters’ Dave Grohl and podcaster Brené Brown. Even World Health Organization (WHO) chief Tedros Adhanom Ghebreyesus announced that he supported Neil Young. So far in 2022, Spotify has lost $4 billion worth of its value, losing 25 percent in the last week alone. It will be interesting to see whether they cave or not.\n\nFollowing the lead of their northern neighbors, American truck drivers are planning a convoy from California all the way to Washington DC to protest against the vaccine mandates. Canadian truckers numbering around 50,000 are heading to Ottawa to protest the government’s tyrannical covid restrictions and vax mandates. The protest is gathering steam and Prime Minister Justin Trudeau has recently fled into hiding.", "opengraph": {"locale": "en_US", "type": "article", "title": "OCTOPUS-LIKE WORMS Found in Bizarre and Rubbery BASEBALL-SIZED BLOOD CLOTS in the Vaccinated, CCP Military Making New Human-Infecting Coronavirus DEADLIER Than COVID; Elites Deploy MASSIVE Campaign to Remove Joe Rogan From Spotify for \"COVID Misinfo\", American Truckers Launch THEIR OWN Convoy Protest Against \"Vax\" Mandates From CALI TO DC - Liberty Planet", "description": "Mr. Richard Hirschman, a mortician who has noticed a sharp increase in deaths related to heart attacks and strokes as of late, says he has pulled out strange looking blood clots from bodies he has embalmed. During an interview with Dr. Ruby Jane, Mr. Hirschman said that many of the deceased he h", "url": "https://www.libertyplanets.com/articles/octopus-like-worms-found-in-bizarre-and-rubbery-baseball-sized-blood-clots-in-the-vaccinated-ccp-military-making-new-human-infecting-coronavirus-deadlier-than-covid-elites-deploy-massive-campaign-to/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.infowars.com/posts/pivotal-interview-embalmers-finding-strange-clots-in-jabbed-people/"], "authors": [], "publish_date": "February 1, 2022 at 12:37 pm"}