{"result_id": "188006", "URL": "https://www.libertyplanets.com/articles/vax-detox-200-million-americans-may-want-to-consider-pursuing-a-ccp-virus-vaccine-detoxification-program-while-avoiding-all-boosters-like-the-plague/", "timestamp": "2023-04-25 16:15:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/vax-detox-200-million-americans-may-want-to-consider-pursuing-a-ccp-virus-vaccine-detoxification-program-while-avoiding-all-boosters-like-the-plague/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "VAX DETOX: 200 Million Americans May Want to Consider Pursuing a CCP Virus \"Vaccine\" Detoxification Program While Avoiding All Boosters Like the Plague", "cleaned_text": "The late Rush Limbaugh had some good advice for anyone trying to find the true motivations behind suspicious actions: follow the money.\n\nTake Pfizer, probably the world’s premier biopharmaceutical company. Follow the money to Pfizer and look just below the surface to see where honest fact checking can paint an odiferous patina of suspicion verging on conspiracy theory.\n\nThe fact is that Pfizer received a multibillion-dollar drug order, and as we discussed in , our panicking bureaucrats gave away the store and the public took it in the shorts.\n\nThere are more facts giving a surface credibility to conservative talk show host Alex Jones’s worries that big pharma and its quack pill pushers working for the government are more interested in power and big-bucks sinecures than in public welfare.\n\nHowever, whether one believes Jones’s assertions that the shadowy figures running the government-medical industrial complex are out to rid the world of human infestation, or if they are just in it for the money is a matter of judging motivation.\n\nFollow the money. It could be both.\n\nConspiracy theories aside, here are more suspicious facts 200 million Americans may want to consider. They run counter to what “Mr. Covid” Dr. Fauci has been telling everyone:\n\n-The COVID-19 “vaccine” is not really a vaccine. It is a gene therapy shot. It has already caused blood clots, myocarditis, cancer and\n\nThe CDC adamantly denigrates its own alarming data and tries to put it into an unbelievable context that those nearly 19,000 deaths reported so far were not caused by COVID. They were just people who had received the COVID vaccination.\n\n-The CDC claims that COVID-19 is “safe and effective.” To meet the criteria of “safe and effective,” however, a vaccine must undergo years of trials. That has not been done with the current vaccine, and taking a booster shot as the efficacy wears off at an untested (and unpredictable) rate, poses unknown dangers now.\n\n-The public has a right to know why the FDA approved a vaccine at warp speed. That would require public disclosure of all the research data Pfizer submitted with its licensing request. The FDA wants 55 years— we’re not making this up —to process a freedom of information request for that data.\n\nIn fairness to the overworked FDA people, Pfizer inundated the system with about 329,000 pages of vaccine-related material. Laid lengthwise end to end, those research papers would cover about 57 linear miles.\n\nAnd the FDA has done its own math, and asserts it cannot meet the requested March 3, 2022 deadline posed by the plaintiffs, a group called the Public Health and Medical Professionals for Transparency.\n\nThat would require the FDA to review about 80,000 pages per month. It would need a staff of ten employees to go through a line-by-line check to make sure everything released to the public is authorized by the Freedom of Information Act.\n\nThe plaintiffs, on the other hand, make a valid point: “We assume, as the FDA has stated, that it conducted an intense, robust, thorough and complete review and analysis of those documents in order to assure that the Pfizer vaccine was safe and effective for licensure.”\n\nProbably—and the facts may ultimately bear this out—the FDA doesn’t want to admit they didn’t have the time to do that “robust, thorough and complete” review as they caved in to political pressures to get the vaccine rolled out.\n\nLikewise, Pfizer probably isn’t interested in disclosing its proprietary research either because they may have taken shortcuts, or their research could open new vistas for genetic immunology research.\n\nIf the FDA and Pfizer have their way, we’ll probably know everything in 55 years.\n\nIn the meantime, millions of Americans followed Dr. Fauci and his coterie of elected leaders and voluntarily lined up for vaccinations. Those vaccinations seem to be wearing off. From its first dose, according to this the body’s immune system is weakened by an antibody dependent enhancement syndrome.\n\nby Natural News gives some advice on how to clean out the COVID-19 vaccine-induced pathogens. The article ends with this advice: “And remember, avoid the Covid booster shots like the plague, because they are one.”", "opengraph": {"locale": "en_US", "type": "article", "title": "VAX DETOX: 200 Million Americans May Want to Consider Pursuing a CCP Virus \"Vaccine\" Detoxification Program While Avoiding All Boosters Like the Plague - Liberty Planet", "description": "The late Rush Limbaugh had some good advice for anyone trying to find the true motivations behind suspicious actions: follow the money. Take Pfizer, probably the world’s premier biopharmaceutical company. Follow the money to Pfizer and look just below the surface to see where honest fact checking", "url": "https://www.libertyplanets.com/articles/vax-detox-200-million-americans-may-want-to-consider-pursuing-a-ccp-virus-vaccine-detoxification-program-while-avoiding-all-boosters-like-the-plague/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wealthauthnews.com/articles/global-bombshell-united-states-government-signs-secret-treaty-with-pfizer-granting-company-dictatorial-powers-over-u-s-economy/", "https://openvaers.com/covid-data", "https://www.reuters.com/legal/government/wait-what-fda-wants-55-years-process-foia-request-over-vaccine-data-2021-11-18/", "https://www.naturalnews.com/2021-11-22-top-5-reasons-not-to-get-a-covid-booster-vaccine-ever.html", "https://www.naturalnews.com/2021-11-23-200-million-americans-may-want-to-consider-covid-19-vaccine-detox.html"], "authors": [], "publish_date": "December 6, 2021 at 1:37 pm"}