{"result_id": "188005", "URL": "https://www.libertyplanets.com/articles/clown-world-triple-vaxxed-cardiologist-transmits-omicron-variant-to-another-triple-vaxxed-cardiologist/", "timestamp": "2023-04-25 16:15:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/clown-world-triple-vaxxed-cardiologist-transmits-omicron-variant-to-another-triple-vaxxed-cardiologist/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "CLOWN WORLD™: TRIPLE-VAXXED Cardiologist Transmits “Omicron Variant” to Another TRIPLE-VAXXED Cardiologist", "cleaned_text": "One of the most heavily vaccinated countries in the world, Israel, has had the new variant omicron, discovered in one person and suspected in seven others. Thus far, the omicron variant has only been detected in people who have been vaxxed for the Chinese Communist Party (CCP) Virus.\n\nThe sudden ‘rise’ in the number of cases being seen in patients has prompted an extreme response from governments around the globe.\n\nThe United States, Britain and the European Union have all imposed travel bans and restrictions to non-citizens coming from South Africa, Botswana, Zimbabwe, Namibia, Lesotho, Eswatini, Mozambique and Malawi.\n\nIsrael has closed its borders completely for 14 days and has imposed some of the strictest restrictions on border control in the world.\n\nAn announcement from Israeli Prime Minister, Naftali Bennett said the government had already prepared for such an event, saying:\n\n“The government of Israel is working quickly and vigorously thanks to the conclusions that were formulated following the ‘Omega’ national drill which gamed various situations regarding the appearance of new variants.”\n\nOne report out of Israel is about omicron infecting a 70 year old cardiologist and a colleague of his who is also a cardiologist.\n\nBother doctors had each got a total of three doses of the “vaccine” each.\n\nOne of the doctors had attended a conference in London and had attended another two before he started to display symptoms.\n\nThere is a definite correlation between the increase in people taking the vax and the rise in new variants, putting in question (yet again) the point of the vaccinations if they don’t actually cure anything but in fact aids in it being more transmissible.\n\nWhen you take into account the way that the virus behaves, having multiple mutations, it’s easy to believe that this was not an accident. It’s easy to believe that this virus and all its variants, were artificially engineered and are being used as a bio-weapon, designed to slowly depopulate.\n\nOf course to utter such things out loud would have you labeled a conspiracy theorist or an anti-vaxxer.\n\nNever before has something like this been seen on such a scale and people globally are being pressured and harassed, ostracized and isolated if they don’t ‘comply.’\n\nIsrael is also using invasive monitoring systems on their citizens through the internal security agency Shin Bet. The agency will be monitoring compliance to self-isolation, using tracking capabilities in cell phones.\n\nA High Court Justice already ruled that the similar contact-tracing program used in 2020 was “no longer justifiable.”\n\nDuring an emergency meeting, the World Health Organization (WHO) officially designated omicron as a “variant of concern.”\n\nThis is contradictory to the South African physician who first identified the new strain and said that the patients who had presented with the new variant, had only mild symptoms and that the omicron variant was actually far less deadly than delta.\n\nYet, the world is now in a panic and big pharma and the media machine have been ramping up the fear machine to scare and bully more unvaxxed into compliance. The travel bans are a knee jerk reaction and will lead to more authoritarianism.", "opengraph": {"locale": "en_US", "type": "article", "title": "CLOWN WORLD™: TRIPLE-VAXXED Cardiologist Transmits “Omicron Variant” to Another TRIPLE-VAXXED Cardiologist - Liberty Planet", "description": "One of the most heavily vaccinated countries in the world, Israel, has had the new variant omicron, discovered in one person and suspected in seven others. Thus far, the omicron variant has only been detected in people who have been vaxxed for the Chinese Communist Party (CCP) Virus. The sudden '", "url": "https://www.libertyplanets.com/articles/clown-world-triple-vaxxed-cardiologist-transmits-omicron-variant-to-another-triple-vaxxed-cardiologist/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "December 3, 2021 at 3:03 pm"}