{"result_id": "188007", "URL": "https://www.libertyplanets.com/articles/taiwan-has-seen-a-significant-drop-in-birth-rates-since-the-covid-19-vaccine-was-rolled-out/", "timestamp": "2023-04-25 16:15:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/taiwan-has-seen-a-significant-drop-in-birth-rates-since-the-covid-19-vaccine-was-rolled-out/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "Taiwan Has Seen A Significant Drop In Birth Rates Since The COVID-19 Vaccine Was Rolled Out", "cleaned_text": "Birth rates around the world have been in a steady decline for the past few decades, and since the covid vax was rolled out, it is getting far worse and one country that seems to be getting hit the hardest, is Taiwan.\n\nNumbers are plummeting in Taiwan, who when compared to the rest of the world only a year ago, has seen a drop by 23 percent in birth rates.\n\nGreat Game India reported that based on the available data, Taiwan is heading towards a 26-sigma event – a way of measuring the probability of something happening by random chance.\n\nOn Taiwan’s birth rate and the country being hurled towards a 26-sigma event, Great Game said, “This can be described as ‘unimaginable’ in terms of the likelihood of it happening due to random chance.”\n\n“The Wolfram-Alpha illustration of likelihood by sigma only goes to ten-sigma. They thought that it would be pointless to show more sigmas. Except a 26-sigma drop-in birth rate just happened in Taiwan.”\n\nBecause Taiwan’s birth rate is a 26-sigma event, that means the probability that this has happened randomly is zero.\n\nTaiwan was one of the stand-out nations that successfully managed to mass inoculate its population, however, since the vax rollout, less than 77 percent of all expected babies were delivered.\n\n“People of Taiwan got their shots, felt assured that Covid-19 stops with every vaccinated person, and moved on with their lives,” Great Game India explains.\n\n“I doubt that the people of Taiwan noticed anything at the end of September. They knew for sure that their vaccines were safe and effective and would not affect their sperm or pregnancies. So, they proceeded with family plans just as before, trying to make babies on purpose, or partying and having fun and getting pregnant accidentally, just as people do elsewhere.”\n\n“Except for 9 months later, they only gave birth to 77% of the number of babies expected … I hope that the people of Taiwan will start asking their authorities: what is happening to us?”\n\n“Covid vaccines are known to ‘disrupt the menstrual cycle’ and lower sperm counts,” Great Game India further reveals.\n\nSome in the medical industry have speculated that the damage may be permanent, however, and those who have received a shot, especially multiple shots, may become sterile.\n\n“It is possible that some women, for a period of several months, could not conceive and become pregnant due to these disruptions. Because all Taiwanese women were vaccinated at the same time, those disruptions created a precipitous drop in birth rates.”\n\nQuestions are starting to be asked around the world about the safety of the covid jabs, as there are now untold amounts of people – who were fit and healthy – suddenly dropping dead from random heart attacks and strokes and there has been a significant up tick in still births and miscarriages.\n\nIt is no secret that the Globalist elites who are the people behind the funding, development and government forced mandates, are trying to depopulate the planet in the name of “saving the planet” from “climate change.”\n\nTheir biggest “enemy” is carbon and how to reduce it, while people forget that we human beings – are also carbon.\n\nHumanity is the “carbon” Bill Gates’ and his Globalist ilk want to reduce.", "opengraph": {"locale": "en_US", "type": "article", "title": "Taiwan Has Seen A Significant Drop In Birth Rates Since The COVID-19 Vaccine Was Rolled Out - Liberty Planet", "description": "Birth rates around the world have been in a steady decline for the past few decades, and since the covid vax was rolled out, it is getting far worse and one country that seems to be getting hit the hardest, is Taiwan. Numbers are plummeting in Taiwan, who when compared to the rest of the world on", "url": "https://www.libertyplanets.com/articles/taiwan-has-seen-a-significant-drop-in-birth-rates-since-the-covid-19-vaccine-was-rolled-out/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "July 8, 2022 at 11:17 pm"}