{"result_id": "188023", "URL": "https://www.libertyplanets.com/articles/six-jabs-biontech-ceo-says-omicron-variant-may-need-three-more-vaccine-doses-plus-initial-vaccine-and-boosters-the-nwo-eventually-will-give-out-12-doses-per-year-1-per-month/", "timestamp": "2023-04-25 16:15:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/six-jabs-biontech-ceo-says-omicron-variant-may-need-three-more-vaccine-doses-plus-initial-vaccine-and-boosters-the-nwo-eventually-will-give-out-12-doses-per-year-1-per-month/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "SIX JABS: BioNTech CEO Says Omicron Variant May Need Three More \"Vaccine\" Doses, Plus Initial \"Vaccine\" and Boosters (The NWO Eventually Will Give Out 12 DOSES PER YEAR — 1 PER MONTH — via Their White Papers)", "cleaned_text": "Yet again, the world’s pharmaceutical overlords have come up with more excuses to inject you with more “vaccines” that you don’t need.\n\nBioNTech CEO, Usually Sahin said that the new “vaccine” currently being developed for the omicron variant would have to be taken in three doses. Bringing the total number of “vaccines” needed to ‘fight’ the wu-flu to a whopping six injections.\n\nPerhaps it should be asked why anyone would need a specific “vaccine” for omicron when the reports about it all say that the symptoms are relatively mild and the strain is less ‘deadly’ than the Delta variant, which never had a specific “vaccine” made for it.\n\nDuring a press conference, Sahin made his comments while discussing the Pfizer-BioNTech “vaccines” effectiveness against the omicron variant.\n\nAccording to a statement released by BioNTech, the pharmaceutical company claimed that initial studies showed that a booster, given alongside the two wu-flu “vaccine” doses, would give the recipient ‘protection’ from the omicron variant, saying:\n\n“Our preliminary, first dataset indicate that a third dose could still offer a sufficient level of protection from disease of any severity caused by the Omicron variant,” Sahin said in a statement. “Broad vaccination and booster campaigns around the world could help us to better protect people everywhere and to get through the winter season.”\n\nWhat the statement also revealed was that BioNTech had been making an “adapted” version of the “vaccine” for the omicron variant – requiring people to take three doses instead of two.\n\nWhen asked whether people should take a booster now, after taking the first two shots of the original injection or wait until the omicron specific “vaccine” is developed, Sahin said that it was “very clear” that people should take both, making it now a total of six shots.\n\n“The data that we have clearly indicates the value of the third dose, and we should be really clear about that, that an Omicron vaccine, even if you start supply in March, would not be broadly available,” Sahin said. “We would start with the first 25, 50, maybe 75 million doses. But the best [way] to ensure better protection would be have to a booster shot.”\n\nA study, which is still waiting to be peer-reviewed, suggested the omicron variant shares a similar genetic code as the common cold, explaining the variants’ relatively mild symptoms but quick infection rate.\n\nCompletely ignoring key facts about the omicron variant largely being found in already vaxxed people and the mild symptoms associated with it, Democrats continue to push vaccine mandates and are calling for more mass injections.\n\nSo much for “trusting the science.” Of course, you can’t trust the “science” when there are people in that field actively trying to deceive you.\n\nThe “vaccines” are not “vaccines”. They are experimental gene therapies, designed to kill the recipient slowly over time and the boosters and extra shots are needed desperately to achieve this.\n\nVaccine hesitancy is at an all time high and after nearly two years of fear mongering and a year of threats of being forced to take a shot that’s not necessary, it’s going to do nothing but climb higher.\n\nGovernments across the globe who push a strict “vaccine” mandate policy are essentially drug pushers.\n\nThe “vaccine” does not stop you from getting, spreading or dying from the wu-flu. What it does guarantee, however, is neverending control over your life with never ending shots and restrictions.\n\nIt’s time that people just say NO.", "opengraph": {"locale": "en_US", "type": "article", "title": "SIX JABS: BioNTech CEO Says Omicron Variant May Need Three More \"Vaccine\" Doses, Plus Initial \"Vaccine\" and Boosters (The NWO Eventually Will Give Out 12 DOSES PER YEAR — 1 PER MONTH — via Their White Papers) - Liberty Planet", "description": "Yet again, the world's pharmaceutical overlords have come up with more excuses to inject you with more \"vaccines\" that you don't need. BioNTech CEO, Usually Sahin said that the new \"vaccine\" currently being developed for the omicron variant would have to be taken in three doses. Bringing the tota", "url": "https://www.libertyplanets.com/articles/six-jabs-biontech-ceo-says-omicron-variant-may-need-three-more-vaccine-doses-plus-initial-vaccine-and-boosters-the-nwo-eventually-will-give-out-12-doses-per-year-1-per-month/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "December 14, 2021 at 1:52 pm"}