{"result_id": "188032", "URL": "https://www.libertyplanets.com/articles/ted-cruz-unleashes-on-liberal-media-for-covid-lies/", "timestamp": "2023-04-25 16:15:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/ted-cruz-unleashes-on-liberal-media-for-covid-lies/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "Ted Cruz Unleashes On Liberal Media For Covid Lies", "cleaned_text": "Senator Ted Cruz (R-TX) made fun of reporter Glenn Kessler on Sunday after a new U.S. intelligence report revealed that one federal group thinks the covid outbreak was caused by a Chinese lab leak, according to the report.\n\nAccording to The Wall Street Journal on Sunday, the U.S. Energy Department determined that a lab leak in Wuhan, China, was most likely the cause of the pandemic. The FBI also thinks a Chinese lab breach was the cause of the outbreak.\n\n“The conclusion was reached because of recently obtained information from the study,” and “it is noteworthy because the agency has extensive scientific competence and administers a network of U.S. labs, some of which perform advanced biological research.”\n\nCruz responded to Kessler’s tweet from May 2020 in which he stated that it was “doubtful” the covid pandemic started with a lab breach.\n\n“Amazing is undoubtedly the appropriate word to describe this video. Another way to describe it is that WaPo abandons all pretenses of journalism to generate CCP propaganda,” Cruz said. “This reporter would not have received a passing grade if they had turned in this video for a first-year logic class.”\n\nCruz then posted a lengthy thread outlining all of the information available at the time.\n\nAt the time, Kessler replied, “I think Ted Cruz overlooked the scientific animation throughout the video that explains how it is essentially impossible for covid to leap from the lab. Or the numerous discussions with real scientists. We should deal in facts, so viewers can make their own decisions.”\n\nOn Sunday, Cruz replied to the tweet with a screenshot of an article from The Wall Street Journal with the headline “Lab Leak Very Likely Origin of Covid-19 Epidemic, U.S. Agency Now Says.”\n\n“Glenn gets four stars,” Cruz said.\n\nCruz’s Special Communications Advisor Steve Guest also criticized Kessler online over the latest study, labeling it “Kessler’s BIGGEST MISS ever.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Ted Cruz Unleashes On Liberal Media For Covid Lies - Liberty Planet", "description": "Senator Ted Cruz (R-TX) made fun of reporter Glenn Kessler on Sunday after a new U.S. intelligence report revealed that one federal group thinks the covid outbreak was caused by a Chinese lab leak, according to the report. According to The Wall Street Journal on Sunday, the U.S. Energy Department", "url": "https://www.libertyplanets.com/articles/ted-cruz-unleashes-on-liberal-media-for-covid-lies/", "site_name": "Liberty Planet", "article:section": "Featured", "image": "https://www.libertyplanets.com/wp-content/uploads/2023/02/Depositphotos_106268372_S-1.jpg", "image:secure_url": "https://www.libertyplanets.com/wp-content/uploads/2023/02/Depositphotos_106268372_S-1.jpg", "image:width": "600", "image:height": "400", "image:url": "https://www.libertyplanets.com/wp-content/uploads/2023/02/Depositphotos_106268372_S-1.jpg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "March 1, 2023 at 2:59 pm"}