{"result_id": "188030", "URL": "https://www.libertyplanets.com/articles/exposed-covid-1984-vaccines-feature-nanotechnology-to-track-people-octopus-like-worms-that-constantly-renew-and-never-die-that-are-laying-eggs-inside-human-bodies-and-being-controlled-by-5g-inte/", "timestamp": "2023-04-25 16:15:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/exposed-covid-1984-vaccines-feature-nanotechnology-to-track-people-octopus-like-worms-that-constantly-renew-and-never-die-that-are-laying-eggs-inside-human-bodies-and-being-controlled-by-5g-inte/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "EXPOSED: COVID-1984 \"Vaccines\" Feature NANOTECHNOLOGY to TRACK PEOPLE, OCTOPUS-LIKE WORMS That CONSTANTLY RENEW and NEVER DIE That Are LAYING EGGS Inside HUMAN BODIES and Being CONTROLLED By 5G INTERNET CONNECTION (VACCINATED HUMANS Are Sending IP ADDRESSES Out and CONNECTING to PEOPLE'S BLUETOOTH on Their PHONE)", "cleaned_text": "A group of New Zealand scientists have found that inside the Pfizer Chinese Communist Party (CCP) Virus “vaccine” is undeclared nanotechnology that assembles into “microchip circuit boards” that can be utilized to track people, once it has been exposed to heat.\n\nFix The World Project Morocco discussed the nanotechnology in the Pfizer vaccine and a video that was shared by the SGT Report Channel showed that small basic shapes, such as squares, circles and rectangles are floating within the “vaccine” samples. Once exposed to heat after being out in a car, they formed more complex structures.\n\nLA Quinta Columna’s Ricardo Delago has previously stated that some “vaccine” samples from Pfizer contain graphene oxide, the ingredient necessary to transform the frequencies that facilitate the forming of self-assembling microchips.\n\nThe microchips themselves can perform multiple functions and this includes the ability to track and control the humans it is injected into.\n\nThere is also evidence of the jab destroying white blood cells when it comes into contact with human blood, while also heavily damaging red blood cells.\n\nCurrently trending is a phenomenon called the “Bluetooth Challenge.”\n\nVideos are circulating of the challenge and the footage is disturbing at best, seeing what is being picked up using Bluetooth capabilities.\n\nNormally, a person’s Bluetooth device will pick up names, but now when a person in a crowded room with vaxxed people searches for Bluetooth devices, anonymous Bluetooth addresses show up.\n\nThey’re anonymous addresses from vaccinated people who are now emitting a signal.\n\nA research team from France conducted a study using vaxxed and unvaxxed individuals randomly in a park, separated by their vax status.\n\nBoth groups had their devices tested and the research team found that the vaxxed group registered unnamed MAC addresses.\n\nA MAC address is a machine address code that makes electronic devices, identifiable wirelessly and is unique to the device, a number that identifies particular hardware and each vaccinated person, put out their own unique code.\n\nThe “Mark of the Beast” was also covered in the SGT Report Channel video.\n\nOne of the video’s creators, Hope said:\n\n“It’s in this vaccine. It’s emitting codes that you can’t do by yourself. We’re getting towards that time. So with it, they’re already doing it. We’re seeing evidence that it’s already being done in human beings.”\n\nHope also spoke to her fellow creator, Tivon about gene editing and DNA data collection being carried out by the government, under the guise of a vax rollout.\n\nEven more disturbing than the “Bluetooth Challenge” is the Hydra vulgaris, a polyp that was also found in the vax. They are tiny organisms described as:\n\n“Freshwater invertebrates that look like fleshy palm trees with swaying fronds of tentacles. They have stem cells that exist in a continuous state of renewal and may hold within their genomic code the key to biological immortality as these organisms renew themselves every 20 days.” As reported by Natural News.\n\n“You can cut little pieces out of the animal and it will regrow and maybe the most amazing thing is that you can dissociate the animal into single cells, mix them all up, put them back in a ball and a new Hydra will just grow out of it.” According to Celina Juliano of the University of California Davis Department of Molecular and Cellular Biology.\n\nJuliano also stated that these organisms neither age nor die.\n\n“What these vaccine manufacturers are trying to do is make their own new species and change and edit our DNA,” Hope said.\n\nThese organisms are genetically modified. Researchers shockingly found dormant eggs present and they became active and started to grow as soon as they were exposed to graphite tape or graphene.", "opengraph": {"locale": "en_US", "type": "article", "title": "EXPOSED: COVID-1984 \"Vaccines\" Feature NANOTECHNOLOGY to TRACK PEOPLE, OCTOPUS-LIKE WORMS That CONSTANTLY RENEW and NEVER DIE That Are LAYING EGGS Inside HUMAN BODIES and Being CONTROLLED By 5G INTERNET CONNECTION (VACCINATED HUMANS Are Sending IP ADDRESSES Out and CONNECTING to PEOPLE'S BLUETOOTH on Their PHONE) - Liberty Planet", "description": "A group of New Zealand scientists have found that inside the Pfizer Chinese Communist Party (CCP) Virus \"vaccine\" is undeclared nanotechnology that assembles into \"microchip circuit boards\" that can be utilized to track people, once it has been exposed to heat. Fix The World Project Morocco discu", "url": "https://www.libertyplanets.com/articles/exposed-covid-1984-vaccines-feature-nanotechnology-to-track-people-octopus-like-worms-that-constantly-renew-and-never-die-that-are-laying-eggs-inside-human-bodies-and-being-controlled-by-5g-inte/", "site_name": "Liberty Planet", "article:tag": "vaccines"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "February 11, 2022 at 12:59 pm"}