{"result_id": "188010", "URL": "https://www.libertyplanets.com/articles/climate-change-is-a-lie-the-united-states-temperature-has-not-risen-in-17-years/", "timestamp": "2023-04-25 16:15:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/climate-change-is-a-lie-the-united-states-temperature-has-not-risen-in-17-years/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "Climate Change Is A LIE: The United States Temperature Has NOT Risen In 17 Years", "cleaned_text": "The Globalists want everyone to believe that we as a planet are facing an “existential threat” from global warming and we will all die if we don’t eat bugs and live in crammed “smart cities” to save it.\n\nIn reality, many scientists who are not paid off by the elites who pay for the results they want, agree that the world is nowhere near as bad as they are trying to make out it is – the only existential threat to humanity, are the Globalists themselves.\n\nAccording to a rarely referenced dataset from the Natural Oceanic and Atmospheric Administration (NOAA), the United States has had no temperature warming for at least the last 17 years and may in fact be cooler than it was compared to 2005.\n\nAnthony Watts, a United States meteorologist, compiled the information from the NOAA’s weather stations, a total of 114 which dotted across the U.S, away from urban development in the latest survey.\n\nThe U.S. Climate Reference Network (USCRN), NOAA started it in 2005 and noted that it was aiming for “superior accuracy and continuity in places that land use will not likely impact during the next five decades”.\n\nIn his latest survey of U.S. “Corrupted Climate Stations”, Anthony Watts notes the existence of USCRN, adding: “It is free of localized heat biases by design, but the data it produces is never mentioned in monthly or yearly climate reports published by NOAA for public consumption.”\n\nThe USCRN disclosures are the latest evidence suggesting global warming started to run out of steam over 20 years ago. Local temperature measurements by the U.K. Met Office show that the average temperature across the U.K. fell to 9.17oC in the 2010s, compared to 9.31oC in the 2000s. Meanwhile, global datasets run by NOAA, the Met Office and NASA continue to show substantial warming since 2000, helped by regular ‘adjustments’ that mostly warm the recent record and depress earlier readings. As a result, surface global datasets show an increasing disconnect from accurate satellite and meteorological balloon records, both of which point to a lengthy pause from about 1998-2012, and a current one that has lasted almost eight years. The only significant temperature rise during this period occurred around 2016, and was caused by a powerful, and natural, El Nino oscillation.\n\nState-funded weather services around the world have become increasing politicized in recent years, and they offer strong support for the command-and-control Net Zero project. With global warming currently dying on its feet, they have increasingly turned to the promotion of what used to called ‘bad’ weather, but has now been re-branded as ‘extreme’. Datasets that continue to show some warmth are used to proclaim records and promote the political view that one-off events are caused by man-made climate change, i.e., burning fossil fuel. Having bet the ranch on global warming, any suggestion that the current warming phase, seen countless times in the paleoclimatic record, is pausing, or even stopping, is a major blow to the elite backers of the trillion-dollar Net Zero project. Without warming, the need for Net Zero, and the economic and societal devastation it will cause, disappears.\n\nSpecific mention of NOAA’s urban heatless data – showing the absence of domestic warming for at least 17 years – was missing from its recent 2021 climate report. North America was said to have had its seventh warmest year on record, with nine of the 10 warmest years having occurred since 2001.\n\nWatts found that 96 percent of the United States temperature stations had failed to meet the NOAA’s own standards of what they consider acceptable and uncorrupted. His latest nationwide study “follows up widespread corruption and heat biases found at NOAA stations in 2009, and the heat bias distortion problem is even worse now”.\n\nAtmospheric scientists William Happer and Richard Lindzen have both said for decades that the “NASA and NOAA have been fabricating temperature data to argue that rising CO2 levels have led to the hottest year on record”. They described what they identified as false and manipulated data as an “egregious violation of scientific method”.\n\nWatts notes that the corruption of data “strongly undermines the legitimacy and the magnitude of the official consensus on long-term climate warming trends in the United States.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Climate Change Is A LIE: The United States Temperature Has NOT Risen In 17 Years - Liberty Planet", "description": "The Globalists want everyone to believe that we as a planet are facing an “existential threat” from global warming and we will all die if we don’t eat bugs and live in crammed “smart cities” to save it. In reality, many scientists who are not paid off by the elites who pay for the results they wa", "url": "https://www.libertyplanets.com/articles/climate-change-is-a-lie-the-united-states-temperature-has-not-risen-in-17-years/", "site_name": "Liberty Planet", "article:tag": "United States"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "August 3, 2022 at 2:04 am"}