{"result_id": "188022", "URL": "https://www.libertyplanets.com/articles/new-white-papers-from-world-economic-forum-the-globalists-wants-to-microchip-the-entire-planet-embedded-into-skin-by-2026-that-would-literally-control-every-aspect-of-your-life-from-medical-info/", "timestamp": "2023-04-25 16:15:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/new-white-papers-from-world-economic-forum-the-globalists-wants-to-microchip-the-entire-planet-embedded-into-skin-by-2026-that-would-literally-control-every-aspect-of-your-life-from-medical-info/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "NEW WHITE PAPERS (From World Economic Forum): The Globalists Want to MICROCHIP the ENTIRE PLANET (EMBEDDED Into YOUR SKIN) By 2026 That Would LITERALLY CONTROL EVERY ASPECT OF YOUR LIFE (From Medical Info to Finances to Even Travel and Online Purchases...EVERYTHING) (THE MARK OF THE BEAST IS HERE) (VIDEO)", "cleaned_text": "Your Globalist overlords will stop at nothing to have you under their complete control. They want to know what you eat, drink, what you purchase, where you live, where you’re planning on vacationing and with whom.\n\nEvery single aspect of your life.\n\nThe Globalists are taking a huge step towards this, or at least are trying to, and of course, Dr. Evil look-alike Klaus Schwab thinks this should be happening in only a few short years.\n\nWhite papers released by the World Economic Forum (WEF) outlines how Globalists will introduce the concept of a digital ID system that would be rolled out on a worldwide scale.\n\nThe technology they will use will be a tiny microchip, implanted under the skin, sort of a souped up “vaccine” passport of sorts.\n\nMark of the Beast, anyone?\n\nThe document is 46 pages long, called “Advancing Digital Agency: The Power of Data Intermediaries”\n\nsays that the digital ID will be used for absolutely everything, including financial services, travel and commerce, allegedly the main use would be to “enhance privacy protection” and “reduce rise of identity fraud.”\n\nIf you actually bother to read the 46 page rant, the document goes further than just wanting to use the chip for authentication and identity protection. It will also include your private medical information, biometrics, credit history, online purchasing and control your ability to go on a vacation wherever and whenever you want.\n\nThe global vaccine passports have already been a massive flop for the most part, with a huge amount of the population rejecting the intrusions on their lives. Despite this, the WEF still calls it an “incredible public health asset.”\n\nWATCH: KLAUS SCHWAB SAYS MICROCHIPS WILL BE IN HUMANS BY 2026\n\nSuch vaccine passports are used when travelling between jurisdictions and at a local level, such as when entering dining establishments or other places where proof of vaccination status is necessary. Importantly, these intermediaries provide a means of verifying status without sharing health data with the establishment per se, in a sort of zero-knowledge proof scenario whereby the trusted data intermediary verifies that the data subject is vaccinated but does not share any other information. This avoids unwanted secondary effects of the establishment sharing the data any further.\n\nIt’s all part of the plan for world domination and would be the perfect vehicle to move in Schwab’s Great Reset, that would pretty much see everyone on the planet enslaved and forced into smart cities, that’s is the Globalist don’t kill everyone with a bio attack first.\n\nThe Great Reset would also “transform” the global economy AKA the Globalist bankers who created the current state of our financial systems, will use this as a weapon against us when they crash the whole thing, forcing us peasants to rely on their “charity.”\n\nIn this Great Reset, property rights will not exist and the free market will be a thing of the past – you will own nothing and you will be happy – according to Klaus Schwab, one of the richest men in the world, go figure.\n\nTheir great plans for the 99 percent, using the digital ID, is a transhumanist future, where humans will merge physically, digitally and biologically with a “matrix” of sorts, changing what it means to be human.\n\nWhat the one percent need to realize is, we are not their chattel. We are not their slaves.", "opengraph": {"locale": "en_US", "type": "article", "title": "NEW WHITE PAPERS (From World Economic Forum): The Globalists Want to MICROCHIP the ENTIRE PLANET (EMBEDDED Into YOUR SKIN) By 2026 That Would LITERALLY CONTROL EVERY ASPECT OF YOUR LIFE (From Medical Info to Finances to Even Travel and Online Purchases...EVERYTHING) (THE MARK OF THE BEAST IS HERE) (VIDEO) - Liberty Planet", "description": "Your Globalist overlords will stop at nothing to have you under their complete control. They want to know what you eat, drink, what you purchase, where you live, where you're planning on vacationing and with whom.  Every single aspect of your life.  The Globalists are taking a huge step toward", "url": "https://www.libertyplanets.com/articles/new-white-papers-from-world-economic-forum-the-globalists-wants-to-microchip-the-entire-planet-embedded-into-skin-by-2026-that-would-literally-control-every-aspect-of-your-life-from-medical-info/", "site_name": "Liberty Planet", "article:tag": "World Economic Forum"}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/VigilantFox/status/1493797930742042624", "https://www.scribd.com/document/559370194/WEF-Advancing-Towards-Digital-Agency-2022#download&from_embed"], "authors": [], "publish_date": "February 18, 2022 at 12:01 pm"}