{"result_id": "188025", "URL": "https://www.libertyplanets.com/articles/world-economic-forum-wef-founder-klaus-schwab-announces-great-narrative-project/", "timestamp": "2023-04-25 16:15:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/world-economic-forum-wef-founder-klaus-schwab-announces-great-narrative-project/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "World Economic Forum (WEF) Founder Klaus Schwab Announces ‘Great Narrative’ Project", "cleaned_text": "are all terms we are hearing a lot more of. Through the use of mainstream media outlets, we are being fed propaganda-laced information telling us how things will be in the future.\n\nThrough the use of technology, these “world leaders” are trying to talk us into believing their rhetoric.\n\nThe problem is that many of us are so focused on the hustle and bustle of our daily lives we are only half-heartedly listening.\n\nNow is not the time to be complacent!\n\nWe need to start listening now before it’s too late to change the path these people have laid out for us.\n\nis actually a plan for the future where everything is simplified.\n\nThis simplification will be the death of our society and lifestyle as we know it.\n\nSchwab and his group of peers have created a storyline that simplifies the world.\n\nThis storyline includes reducing the global population by well-over half, shutting down industries across the globe, and creating a hierarchy where they are the ones in control.\n\nThe elite few would be in complete control of the masses, forcing us to live the way they see fit, giving them the power and using us to do their bidding.\n\nKlaus Schwab is an economist and engineer from Germany.\n\nStrongly affiliated with the Bilderberg Group in the past, he is one of the elites who have been pushing for the New World Order for many years.\n\nSince the introduction of COVID, the members of the World Economic Forum (many of which are in the top 1%) have been putting together the Great Narrative so they can ultimately achieve the goals outlined within the Great Reset.\n\nmagazine is getting in on the act.\n\nThe main sticking point is that while much of this is being made to sound good, the reality is we lose everything we have worked so hard for.\n\nWhen Schwab talks about “self-centered” people, he isn’t referring to the wealthy.\n\nNo, he, in fact, is referring to us.\n\nWe are the ones who work every day to earn a living and put food on the table for our families.\n\nWe create a small fraction of the carbon footprint of the elite, yet we are the ones who are “self-centered.”\n\nWe are the ones who eat Hamburger Helper and processed foods, while they sit at tables laden with the most expensive foods on the planet.\n\nPrime beef, escargot, truffles, you name an expensive dish, and it’s there for their enjoyment, but WE are the selfish ones.\n\nThe world for Schwab and the WEF is quite simple.\n\nThey have the money and we don’t.\n\nThey want to make sure they maintain that status quo so the easiest way is to push technology and do away with industry.\n\nThat might seem fine on paper, but in reality, it will lead to chaos, mass confusion, and a level of unrest across the world that will quickly get out of control.\n\nIf you truly want to simplify the world, eliminate the elite and their status of superiority.\n\nShow them the value of a hard day’s work.\n\nIt may not completely open their eyes, but it most certainly will get their attention.\n\nThe Fourth Industrial Revolution and the Great Reset\n\nThe goal of the WEF is to “deindustrialize” the West for the good of climate change.\n\nThe problem is the West is not the problem.\n\nThe ones who are most guilty of influencing climate change are the elite.\n\nThe top 1% of the world’s population travels on private jets to have lunch two hundred miles away.\n\nThey basically use their private aircraft as daily drivers, much like those of us in the West who use our Chevy Malibu for daily jaunts to and from work.\n\nSchwab and his band of elites in the WEF are known for saying one thing and doing another.\n\nThey lack transparency on every level, yet still demand “do as I say, not as I do.”\n\nTheir ultimate goal through the Great Reset is world domination, even though they claim they are only fighting for climate change.\n\nThey want to change the climate alright.\n\nJust not in the way they want us to believe.", "opengraph": {"locale": "en_US", "type": "article", "title": "World Economic Forum (WEF) Founder Klaus Schwab Announces ‘Great Narrative’ Project - Liberty Planet", "description": "The New World Order, Great Reset and the Great Narrative are all terms we are hearing a lot more of. Through the use of mainstream media outlets, we are being fed propaganda-laced information telling us how things will be in the future. Through the use of technology, these “world leaders” are try", "url": "https://www.libertyplanets.com/articles/world-economic-forum-wef-founder-klaus-schwab-announces-great-narrative-project/", "site_name": "Liberty Planet", "article:tag": "World Economic Forum"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.deseret.com/indepth/2021/1/2/22203108/great-reset-world-economic-forum-politics-conservative-conspiracy-parler-america-first", "https://time.com/collection/great-reset/"], "authors": [], "publish_date": "November 23, 2021 at 9:00 pm"}