{"result_id": "188015", "URL": "https://www.libertyplanets.com/articles/trump-says-we-wouldnt-have-vaccine-mandates-if-he-were-president/", "timestamp": "2023-04-25 16:15:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/trump-says-we-wouldnt-have-vaccine-mandates-if-he-were-president/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "Trump says We Wouldn't Have Vaccine Mandates if He Were President", "cleaned_text": "We have good reason to believe there’s a good chance Trump will run in 2024, and we have even better reason to believe that if he does, he’ll win. At least, he’ll win in truth, whether or not we get cheated out of our rightful president again. On top of that thrilling possibility, the Big Man, as we sometimes refer to him, is dropping enticing clues about what could happen if he does retake the White House.\n\nIn a recent interview with Bill O’Reilly, Trump said if he were president the country wouldn’t need vaccine mandates. He cited the fact that his administration was able to oversee the production of three vaccines.\n\nAs regular readers will know, the vaccines he is referring to were rushed to market and did not get the multiple year’s worth of data gathering necessary to produce a vaccination that is statistically better than the placebo effect. Unfortunately, Trump has never seemed to be well versed in deeper, so-called conspiracy news. He is what some of us in the truth-research movement refer to as a “super-normie.”\n\nThat is to say, he believes our institutions are still essentially good. Trump may be naïve in many ways, but he is still likely to be this nation’s best chance of avoiding total dissolution, civil war, and much worse. But despite his naiveté, Trump never even hinted at the notion of trying to force anyone to take the vaccine who didn’t want it.\n\nThe former president reinforced this in his statements to O’Reilly, saying, he would “sell it to them.” By this, he meant that he would try to convince people to take the vaccines. He would argue for it, perhaps campaign for it, but he would not attempt to strong-arm anyone into it. This is reasonable. After all, he seems to believe the vaccines are good for their stated purpose. If you believe in something, you have a moral duty to share knowledge of it, defend it, and promote it.\n\nBut what we never have the right to do is initiate force and violate the free will of non-aggressive people by forcing them to take a medical procedure they don’t want. Now, supposing President Trump does manage to retake his rightful office, it would be distressing to hear him advocate for injections which we have shown are at best experimental, at worse a weapon system designed to further empower the virus that causes COVID.\n\nBut Trump is a reasonable man, and with him as president, we would have access to drugs that have been proven effective against viruses like novel coronavirus and its mutant offspring – drugs like Ivermectin.\n\nBy the way, Ivermectin has been approved by the FDA for use in treatment against COVID, or SARS-CoV-2. It has been shown to be good as a preventative and good as a safe and effective treatment. Be aware that government websites conflict over this. The FDA.gov website says Ivermectin should not be taken for COVID, and the NCBI.gov says it’s good. So, take their approval/non-approval with a grain of sea salt.", "opengraph": {"locale": "en_US", "type": "article", "title": "Trump says We Wouldn't Have Vaccine Mandates if He Were President - Liberty Planet", "description": "We have good reason to believe there's a good chance Trump will run in 2024, and we have even better reason to believe that if he does, he'll win. At least, he'll win in truth, whether or not we get cheated out of our rightful president again. On top of that thrilling possibility, the Big Man, as we", "url": "https://www.libertyplanets.com/articles/trump-says-we-wouldnt-have-vaccine-mandates-if-he-were-president/", "site_name": "Liberty Planet", "article:tag": "vaccine mandates"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}