{"result_id": "188011", "URL": "https://www.libertyplanets.com/articles/the-cover-up-warning-labels-on-cigarettes-now-changed-to-cover-for-ccp-virus-vaccine-deaths-claiming-they-can-trigger-sudden-blood-clots-heart-attacks-and-strokes-govt-data-vax-death/", "timestamp": "2023-04-25 16:15:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/the-cover-up-warning-labels-on-cigarettes-now-changed-to-cover-for-ccp-virus-vaccine-deaths-claiming-they-can-trigger-sudden-blood-clots-heart-attacks-and-strokes-govt-data-vax-death/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "THE COVER UP: Warning Labels on CIGARETTES Now Changed to COVER for CCP Virus 'Vaccine' DEATHS Claiming They Can Trigger 'SUDDEN BLOOD CLOTS, HEART ATTACKS AND STROKES'; Gov't Data: 'Vax' DEATH RATE HIGH, UNVACCINATED Being TRACKED", "cleaned_text": "It’s long been reported that the Chinese Communist Party (CCP) Virus ‘vaccines’ aren’t as safe as the mainstream media, government officials, and senior health officials such as Dr. Fauci have asserted them to be.\n\nIn fact, as of December 21, 2021, over 20,000 deaths from the COVID jab have been reported to Vaccine Adverse Event Reporting System (VAERS).\n\nWhat’s more, statistics show that in many nations the COVID death rate jumps right as a large percentage of the population follows the government’s urge to get the jab.\n\nSome have even linked the current huge shortage of workers to the fact that people are dying not just from COVID, but also from the side effects of the ‘vaccine.’\n\nNews of healthy athletes suffering debilitating heart attacks while playing sports has made international headlines, especially when one thing these stars all have in common is that they had just been vaccinated or boosted before suffering serious heart problems that were non-existent before they got jabbed.\n\nGiven these facts, it’s not surprising that the government would try to find a scapegoat that could be blamed for the increase in deaths and serious health problems in previously healthy individuals.\n\nHowever, the scapegoat is one that would likely surprise many people: cigarettes.\n\nJust about everyone knows that these “cancer sticks” cause serious, long-term health problems for smokers and those who live and work near them.\n\nMandatory warning labels have long warned that smoking can lead to lung cancer and a host of other health problems.\n\nHowever, what many people don’t realize is that lately some of these labels have been changed to warn of a risk of sudden blood clots, heart attacks, and strokes.\n\nMany people may not even realize the labels have changed, or that the new label makes little sense, as smoking is obviously an inherently unhealthy activity.\n\nHowever, even a cursory look at the facts makes it apparent that smoking would not cause a person to immediately suffer life-threatening blood clots.\n\nWhile it does increase the risk of clots and strokes by creating fatty build-up in the blood vessels, these harmful effects occur over time, not instantly as the new warning labels indicate.\n\nGetting the COVID-19 jab, on the other hand, has been associated with sudden blood clotting, as even the mainstream media has not been able to hide serious blood clotting related to getting the J&J and Astra-Zeneca CCP ‘vaccines.’\n\nIn a sensible world, a government that realizes that a particular medication causes serious side effects in healthy people would pull this medication from the market and investigate the company or companies that created it.\n\nNot so in today’s world.\n\nRather, ‘President’ Joe Biden is imposing mandates to try to force as many people as possible to get one of these questionable shots.\n\nThe U.S. government is compiling the private information of military members who refuse to get the jab on religious grounds, urging states to disregard the recent Supreme Court ruling banning OSHA from imposing a Draconian vaccine mandate on large and mid-size businesses.\n\nRather, they create their own local mandates, and pushing ahead with mandates for medical workers in spite of the fact that the healthcare industry is already suffering from a huge shortage of personnel.\n\nThe new mandates will almost certainly exacerbate the problem, causing tens of millions of Americans to lose access to life-saving healthcare.\n\nSeeing this is the case, it’s not surprising that a government far more concerned about pushing an agenda rather than helping ordinary people would have no qualms modifying the warning label on a product that already has a bad reputation.\n\nAnd doing this in order to cover for the negative side effects of a ‘vaccine’ that it still wants to force on the general public.", "opengraph": {"locale": "en_US", "type": "article", "title": "THE COVER UP: Warning Labels on CIGARETTES Now Changed to COVER for CCP Virus 'Vaccine' DEATHS Claiming They Can Trigger 'SUDDEN BLOOD CLOTS, HEART ATTACKS AND STROKES'; Gov't Data: 'Vax' DEATH RATE HIGH, UNVACCINATED Being TRACKED - Liberty Planet", "description": "It's long been reported that the Chinese Communist Party (CCP) Virus 'vaccines' aren't as safe as the mainstream media, government officials, and senior health officials such as Dr. Fauci have asserted them to be. In fact, as of December 21, 2021, over 20,000 deaths from the COVID jab have been r", "url": "https://www.libertyplanets.com/articles/the-cover-up-warning-labels-on-cigarettes-now-changed-to-cover-for-ccp-virus-vaccine-deaths-claiming-they-can-trigger-sudden-blood-clots-heart-attacks-and-strokes-govt-data-vax-death/", "site_name": "Liberty Planet", "article:tag": "vaccines"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 18, 2022 at 5:17 pm"}