{"result_id": "188016", "URL": "https://www.libertyplanets.com/articles/athletes-are-dropping-dead-for-no-apparent-reason/", "timestamp": "2023-04-25 16:15:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/athletes-are-dropping-dead-for-no-apparent-reason/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "Athletes Are Dropping Dead for No Apparent Reason", "cleaned_text": "There has been a strange phenomenon happening over the past year or so that should cause you at least a small amount of concern, and that would be the number of athletes that are falling dead for no apparent reason, despite being in peak physical condition.\n\nAthletes are dropping dead at an alarming rate.\n\nIn the past year alone, from March 2021 to March 2022, nearly 800 athletes in the prime of their lives, have suddenly stopped and even more alarming is that the average, for those who have died suddenly, is around 23 years of age.\n\nNow, if you are one of those people that likes to put puzzles together, you have probably already arrived at a decent explanation. Any other answer you could produce, would be wrong.\n\nThere is a common link between all these athletes and it is not that they are all fabulously wealthy, it is that they all received the experimental gene therapy that has been pushed by governments around the world since the beginning of 2021.\n\nOne America News journalist Pearson Sharp reported that 15 vaccinated tennis players have been forced to drop out of the Miami Open because of cardiac issues.\n\nPaula Badosa of Spain and Jannik Sinner of Italy – both crowd favorites – were two of those 15 athletes who had no choice but to quit.\n\nBadosa had to leave the tennis court at one stage because she started experiencing chest pains and Sinner just bent up in pain, also suffering chest pains.\n\nSharp remarked, “These are just two of more than 769 athletes who have collapsed during a game, on the field, over the last year,” adding, “Nearly 800 athletes – young, fit people in the prime of life – falling down on the field. In fact, 500 percent more soccer players in the [European Union] are dropping dead from heart attacks than just one year ago.”\n\n“How many 23-year-old athletes were collapsing and suffering heart attacks before this year? Do you know any 23-year-old people who had heart attacks before now? These are just the ones we know about; how many have gone unreported?”\n\nSharp also reported on the link between these athletes being the Pfizer shot and stated that, “In fact, many doctors treating these players list their injuries and deaths as being directly caused by the vaccine,” said Sharp.\n\nChest pain and cardiac problems being only two of the adverse side effects that one can experience after taking the vaccine and the more shots you have taken, the more likely it becomes that you could experience a cardiac event.\n\nFormer sports commentator and retired British soccer star, Matt Le Tissier, expressed his concerns at all the sudden deaths occurring.\n\n“I played for 17 years, [and] I don’t think I saw one person in 17 years have to come off the football pitch with breathing difficulties [and] heart problems,” he told Red Voice Media in an interview.\n\n“The last year, it’s just been unbelievable how many people … are just keeling over. And at some point, surely you have to say ‘This isn’t right, this needs to be investigated.’”\n\nFrench tennis player Jeremy Chardy suffered a severe adverse reaction to the Pfizer vaccine in September 2021 – about a month after he had announced his intent to get injected with it.\n\n“Since I got my vaccine, I have a problem, I have a series of problems. As a result, I can’t train [and] I can’t play. I prefer to take more time to heal myself and be sure that, in the future, I won’t have any problems,” the 34-year-old Chardy told French sports newspaper L’Equipe. “At the moment, my season is stopped and I don’t know when I’ll start again. So now, I regret having taken the vaccine – but I couldn’t have known. It’s the first time that the idea that [the] next [tennis] season might be my last has crossed my mind.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Athletes Are Dropping Dead for No Apparent Reason - Liberty Planet", "description": "There has been a strange phenomenon happening over the past year or so that should cause you at least a small amount of concern, and that would be the number of athletes that are falling dead for no apparent reason, despite being in peak physical condition. Athletes are dropping dead at an alarmi", "url": "https://www.libertyplanets.com/articles/athletes-are-dropping-dead-for-no-apparent-reason/", "site_name": "Liberty Planet", "article:tag": "vaccine"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "April 23, 2022 at 2:24 pm"}