{"result_id": "188014", "URL": "https://www.libertyplanets.com/articles/a-large-amount-of-satanic-mysteries-surround-the-name-of-the-latest-ccp-virus-variant/", "timestamp": "2023-04-25 16:15:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.libertyplanets.com/articles/a-large-amount-of-satanic-mysteries-surround-the-name-of-the-latest-ccp-virus-variant/", "encoding": "UTF-8"}, "image": null, "domain": "www.libertyplanets.com", "title": "A Large Amount of SATANIC Mysteries Surround the Name of the Latest CCP Virus \"Variant\"", "cleaned_text": "There are many strange happenings surrounding the Chinese Communist Party (CCP) Virus , the “vaccines” and the people who are behind all of it.\n\nOnce you start to pay attention, you’ll start to see things that can not be unseen.\n\nThere’s no doubt there is a satanic cabal, plotting against the human race, bent on wreaking havoc and attempting to depopulate us all. That’s pretty clear, they even tell you openly they want to kill you.\n\nThey are the Globalist elites, the billionaires who basically own everything. They’re the 1%. They are the people you see nearly everyday on your TV, telling you how you can and can’t live your life. They are the people who want you to take the “vaccine.”\n\nBill Gates, Klaus Schwab, George Soros, Jeff Bezos, along with some very rich, very influential families like the Morgan, Rockefeller, Rothchilds (Bauer or Bower), Bruce, Cavendish (Kennedy), Medici, Hanover, Habsburg, Krupp, Plantagenet, Romanov, Sinclair (St Clair), Warburg, Windsor (Saxe-Coburg-Gothe) are all top elites.\n\nThese people all think that they have a divine right (since they believe they are of Royal lineage) to rule over us peasants, that we should bend to their will and basically be their chattel.\n\nSatanists are all about their symbolism and rituals, and they love to hide their ‘marks’ on everything they do. If you know what to look for, it becomes easy to see them hiding in plain sight.\n\nThe symbolism around the “vaccines” is heavily satanic, and points to certain establishments or secret societies.\n\nThe World Health Organization (WHO) decided to use the Greek alphabet, apparently we’ve been racing through variants without us being aware, because we went from the Delta variant, to the Omicron variant.\n\nWATCH: The Inside Voodoo of the OMICRON Fear Campaign\n\nWhether it was intentional or not, they missed the two letters right before omicron, Nu and Xi. Of course, they couldn’t use the Nu variant, it sounds too much like ‘the new variant’. Using Xi was also a no no, since it sounds too close to Chinese dictator President Xi Jingpjng.\n\nThe use of the Delta and Omicron letters are interesting when you know the symbols behind each of them. Delta is represented by the triangle. Omicron is represented by the eye.\n\nTogether, they make the all seeing eye, the symbol of the Illuminati, one of the secret societies that top Globalists belong to. They also belong to the highest orders of the Freemasons.\n\nThen you have the anagrams that can be made out of the omicron name. One anagram for omicron is moronic. Another is oncomir.\n\nAccording to Wikipedia, oncomir is described as follows:\n\n“An oncomir (also oncomiR) is a microRNA (miRNA) that is associated with cancer. MicroRNAs are short RNA molecules about 22 nucleotides in length. Essentially, miRNAs specifically target certain messenger RNAs (mRNAs) to prevent them from coding for a specific protein. The dysregulation of certain microRNAs (oncomirs) has been associated with specific cancer forming (oncogenic) events. Many different oncomirs have been identified in numerous types of human cancers.”\n\n“Oncomirs are associated with carcinogenesis, malignant transformation, and metastasis. Some oncomir genes are oncogenes, in that overexpression of the gene leads to cancerous growth. Other oncomir genes are tumor suppressors in a normal cell, so that underexpression of the gene leads to cancerous growth.”\n\nOne of the adverse effects that will be seen long term with the “vaccines” is cancer.\n\nThe Globalists love their symbolism and it’s hidden within everything they do. Look for the signs, they’re trying to wipe us out and they happily let you know about it.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Large Amount of SATANIC Mysteries Surround the Name of the Latest CCP Virus \"Variant\" - Liberty Planet", "description": "There are many strange happenings surrounding the Chinese Communist Party (CCP) Virus plandemic, the \"vaccines” and the people who are behind all of it. Once you start to pay attention, you'll start to see things that can not be unseen. There's no doubt there is a satanic cabal, plotting again", "url": "https://www.libertyplanets.com/articles/a-large-amount-of-satanic-mysteries-surround-the-name-of-the-latest-ccp-virus-variant/", "site_name": "Liberty Planet", "article:tag": "Variant"}, "tags": [], "tweets": [], "movies": [], "links": ["https://banned.video/watch?id=61aa41e8ea42eb012c5bbfae"], "authors": [], "publish_date": "December 7, 2021 at 7:31 pm"}