{"result_id": "189019", "URL": "https://www.libtards.news/2022-05-17-olp-head-plans-mandate-covid-vaccines-kids.html", "timestamp": "2023-04-25 16:16:02 CEST+0200", "meta": {"description": "The leader of the Ontario Liberal Party (OLP) said he plans to make Wuhan coronavirus (COVID-19) injections mandatory for public school children if elected as the province’s premier. Steven Del Duca, head of the OLP, told the crowd at Ottawa’s Celebration Park on May 7 that COVID-19 shots will be added to the compulsory immunization schedule […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,campus insanity,Canada,covid-19,Doug Ford,health freedom,Libtards,medical fascism,Medical Tyranny,Ontario,Ontario Liberal Party,pandemic,public schools,schoolchildren,Steven Del Duca,vaccine,vaccine mandate,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.libtards.news/2022-05-17-olp-head-plans-mandate-covid-vaccines-kids.html", "encoding": "UTF-8"}, "image": null, "domain": "www.libtards.news", "title": "Ontario Liberal Party head plans to make COVID injections mandatory for kids if elected as provincial premier", "cleaned_text": "Ontario Liberal Party head plans to make COVID injections mandatory for kids if elected as provincial premier\n\nThe leader of the Ontario Liberal Party (OLP) said he plans to make Wuhan coronavirus (COVID-19) injections mandatory for public school children if elected as the province’s premier.\n\nSteven Del Duca, head of the OLP, told the crowd at Ottawa’s Celebration Park on May 7 that COVID-19 shots will be added to the compulsory immunization schedule for all children in Ontario public schools if he becomes premier. His speech comes ahead of the June 2 provincial elections – where he is up against incumbent premier Doug Ford, who is seeking re-election.\n\n“The best way to get back to normal is to make classrooms safer. Ontario Liberals will do just that by expanding the list of universal vaccines to include the COVID-19 vaccine, and requiring all frontline education workers to be vaccinated,” said Del Duca. (Related: California legislators, including Richard Pan, trying to force all schoolchildren to get “vaccinated” for covid.)\n\nAccording to the 1990 Immunization of School Pupils Act, children attending public schools in Ontario must be vaccinated against nine different diseases – including tetanus, polio, measles, mumps and rubella. The OLP’s website states that religious, conscientious and medical exemptions outlined in the Act will still apply to the COVID-19 vaccine.\n\nThe OLP leader promised that he will “make a different choice [through] partnering with parents, educators and healthcare professionals to positively promote vaccination as the best available tool to keep kids safe.”\n\nHe also denounced Ford and his Progressive Conservative Party for “dismantling the infrastructure we need to boost vaccine uptake on a voluntary basis.”\n\n“The Doug Ford Conservatives’ approach to the pandemic was chaotic and confusing. Their hyper-political approach undermined confidence in vaccines and prolonged lockdowns and suffering – particularly for our kids.”\n\nFord’s government locked down Ontario public schools more than any other place in North America. He also mandated face masks and vaccine passports.\n\nIn January, Ford ordered the closure of schools in the province following the spread of the B11529 omicron variant. The closure order applied to both publicly-funded and private schools, with in-person learning suspended Jan. 3 to 17.\n\nHe bragged about his move, saying that it only took him 30 seconds to decide on the closure after a five-hour meeting.\n\nAccording to Ontarians, Ford did not provide any concrete plans to ensure that children can return to school safely – which fueled their frustration even more. They remarked that the incumbent premier’s actions look like he is caving in to political pressure instead of “listening to the science.”\n\nA month after announcing the school closures, the Ontario premier walked back on his support for COVID-19 vaccines, face masks and vaccine passports. “You can go to Costco, you can go to Walmart, you can go shopping. You don’t know if the person beside you has a shot or not, but we also know that it doesn’t matter if you have one shot or ten shots, you can [still] catch COVID-19,” he said in February, in response to a question about the end of the province’s vaccine passport system.\n\nFord later admitted wrongdoing on his part on the issue of lockdowns months later in April, tearfully apologizing to Ontarians during an April 21 press conference in Etobicoke. He had been isolating at his late mother’s home in the suburb at that time as one of his staff members tested positive for COVID-19.\n\n“I understand your frustration. This experience, this pandemic, it’s something that has affected every single person,” he remarked. “Simply put, we got it wrong. We made a mistake. These decisions left a lot of people really concerned. We moved too fast. For that I am sorry, and I sincerely apologize.”\n\nMedicalTyranny.com has more stories about mandatory COVID-19 vaccinations for children.\n\nWatch Ontario Premier Doug Ford below denouncing COVID-19 vaccine passports and face masks after initially advocating for them.\n\nOntario Premier Doug Ford changes stance on COVID vaccines and other mandates after freedom convoy gains traction.\n\nWOW: Canadian provincial leader actually admits officials “got it wrong” with widespread COVID lockdowns in tearful apology.", "opengraph": {"title": "Ontario Liberal Party head plans to make COVID injections mandatory for kids if elected as provincial premier", "type": "article", "url": "https://www.libtards.news/2022-05-17-olp-head-plans-mandate-covid-vaccines-kids.html", "site_name": "Libtards News", "description": "The leader of the Ontario Liberal Party (OLP) said he plans to make Wuhan coronavirus (COVID-19) injections mandatory for public school children if elected as the province’s premier. Steven Del Duca, head of the OLP, told the crowd at Ottawa’s Celebration Park on May 7 that COVID-19 shots will be added to the compulsory immunization schedule […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2022/05/Doctor-Girl-Child-Vaccine-Flu-Shot-Syringe.jpg"}, "tags": ["pandemic", "big government", "covid-19", "Libtards", "medical fascism", "Ontario", "vaccine wars", "vaccine", "Ontario Liberal Party", "Canada", "Steven Del Duca", "Medical Tyranny", "public schools", "vaccine mandate", "Doug Ford", "schoolchildren", "health freedom", "campus insanity"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/ontario-liberals-vow-to-make-covid-jab-compulsory-for-public-schools/", "https://naturalnews.com/2022-01-28-california-legislators-pan-force-schoolchildren-vaccinated-covid.html", "https://www.theepochtimes.com/closing-schools-at-this-stage-of-the-pandemic-is-wrong_4194897.html", "https://www.lifesitenews.com/news/ontario-premier-does-complete-reversal-on-covid-shots-lockdowns-everyones-done-with-this/", "https://www.cbc.ca/news/canada/toronto/doug-ford-ontario-covid-19-news-conference-1.5997521", "https://medicaltyranny.com/", "https://www.brighteon.com/f648c6de-2678-4fc5-82b8-0e1d4c2763f0", "https://pandemic.news/2022-01-12-ontario-closes-schools-rising-omicron-cases.html", "https://pandemic.news/2022-02-17-doug-ford-changes-stance-on-covid-mandates.html", "https://biggovernment.news/2022-04-20-senator-pauses-mandatory-covid-vaccination-bill-schoolchildren.html", "https://healthfreedom.news/2021-04-26-canadian-leader-admits-got-it-wrong-covid-lockdowns.html", "https://www.lifesitenews.com/news/ontario-liberals-vow-to-make-covid-jab-compulsory-for-public-schools/", "https://www.theepochtimes.com/closing-schools-at-this-stage-of-the-pandemic-is-wrong_4194897.html", "https://www.lifesitenews.com/news/ontario-premier-does-complete-reversal-on-covid-shots-lockdowns-everyones-done-with-this/", "https://www.cbc.ca/news/canada/toronto/doug-ford-ontario-covid-19-news-conference-1.5997521", "https://www.brighteon.com/f648c6de-2678-4fc5-82b8-0e1d4c2763f0", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2022-05-17-olp-head-plans-mandate-covid-vaccines-kids.html&linkname=Ontario%20Liberal%20Party%20head%20plans%20to%20make%20COVID%20injections%20mandatory%20for%20kids%20if%20elected%20as%20provincial%20premier", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}