{"result_id": "189006", "URL": "https://www.libtards.news/2022-07-01-abortion-activists-use-bible-as-soccer-ball.html", "timestamp": "2023-04-25 16:15:54 CEST+0200", "meta": {"description": "Abortion activists kicking a Bible around like a soccer ball during a pro-choice protest were caught on video. The offensive footage was first posted on social media Sunday, June 26, by a user named The Seattle Preacher (TSP). It was recorded during a protest against the overturn of the 1973 Roe v. Wade abortion ruling […]", "lang": "en", "keywords": "abortion,arson,Bible,Colorado,culture wars,demonic,evil,extremism,hate crime,infanticide,left cult,Oregon,pregnancy centers,pro-life,Roe v. Wade,sacrilege,Seattle,social justice,Twisted,vandalism,violence", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.libtards.news/2022-07-01-abortion-activists-use-bible-as-soccer-ball.html", "encoding": "UTF-8"}, "image": null, "domain": "www.libtards.news", "title": "SACRILEGE: Abortion activists use Bible as soccer ball in Seattle protest", "cleaned_text": "SACRILEGE: Abortion activists use Bible as soccer ball in Seattle protest\n\nAbortion activists kicking a Bible around like a soccer ball during a pro-choice protest were caught on video.\n\nThe offensive footage was first posted on social media Sunday, June 26, by a user named The Seattle Preacher (TSP). It was recorded during a protest against the overturn of the 1973 Roe v. Wade abortion ruling in Seattle.\n\n“[The] desecration of another person’s religious material is a hate crime. If this was a Quran, people would be outraged. People must really hate the Word of God right now,” TSP captioned the video.\n\nLeftist protesters were captured in the act of repeatedly kicking the holy book – before TSP stepped in. He remarked amid cackling laughter: “Look at this, disrespectful. This is a hate crime. You realize you guys are committing a hate crime right now?” (Related: Leftists make good on “night of rage” riot threats after Roe v. Wade gets overturned.)\n\nTSP later turned to the offenders, rebuking them: “This was a crime. You would not have done that if this was the Quran.” One of the protesters then grabbed the damaged Bible, which he attempted to retrieve – but in vain.\n\nThe next section of the clip showed the desecrated Bible thrown in the bottom of a portable toilet, amid human waste.\n\n“That right there is a hate crime. That is ungodly and [that] is wrong,” TSP lamented. He continued in a mournful voice: “I can’t believe these people. I can’t believe they would do that.”\n\nTSP’s footage resulted in a firestorm of reactions from Christians on social media, who denounced the sacrilegious act in Seattle.\n\nProminent songwriter “Five Times August” called the deranged protesters “truly the cancer of [the] Earth.” He added: “Everything they pretend to be against is exactly who they are.”\n\nChristian evangelist and former professional poker player Anna Khait expressed sadness toward the protesters who desecrated the Bible. “One day, their souls will understand how foolish and blind they are,” she said.\n\nThe holy book of Christians was not the only target of pro-abortion ire after the Supreme Court reversed the 1973 Roe v. Wade decision. In a 5-4 vote, the high court returned the question of abortion’s legality to the states on June 24. While some Republican states enacted bans on abortion, some Democratic states reiterated that they would be “safe havens” for abortion.\n\nFollowing the ruling, two Christian pregnancy centers in Colorado and Oregon fell victim to pro-abortion leftists.\n\nOn the early morning of June 25, police were called to the Life Choices pregnancy center in Longmont Colorado after it was set on fire. The perpetrators also vandalized the center with pro-abortion messages. The slogans sprayed on the walls of the facility included “bans off our bodies” and “if abortions are safe, neither are you.”\n\nThe building where Life Choices was located suffered “heavy fire and smoke damage.” The Longmont Police Department, meanwhile, said it is currently looking for the suspects behind the attack.\n\nThe Dove Medical Center in Eugene, Oregon also bore the brunt of attacks by pro-abortion protesters. A press release from the Eugene Police Department stated that more than 75 rioters gathered in front of the hospital as part of the “Night of Rage” protests against the Supreme Court decision.\n\nMany of the protesters were “wearing all-black clothing with masks and hoods,” with “some people … picking up rocks” and “[donning] gas masks.” It added that “unknown people in the crowd threw smoke bombs at officers along with several filled water bottles.” Ten individuals were arrested during the protests.\n\nAccording to LifeSiteNews, both Life Choices and Dove Medical Center promote themselves as faith-based pregnancy centers that explicitly state that they will not refer or direct women for abortions.\n\nWatch the footage from a pro-abortion protest in front of the Los Angeles County Courthouse below.\n\nThis video is from the Covid Times channel on Brighteon.com.\n\nTHIS IS TOLERANCE? Christian crisis pregnancy center in Colorado vandalized, set on fire over Roe v. Wade.\n\nAbortion activists call for PROTESTS at conservative SCOTUS judges’ houses following leaked Roe v. Wade opinion.\n\nDHS says angry leftists plan to “storm the Supreme Court building” and “murder justices” if Roe v. Wade is overturned.\n\nPro-abortion leftists DOX and TARGET conservative SCOTUS justices following leak of draft opinion overturning Roe v. Wade.\n\nHowling leftist demons call for targeted violence against high court justices over Supreme Court plan to overturn Roe v. Wade.", "opengraph": {"title": "SACRILEGE: Abortion activists use Bible as soccer ball in Seattle protest", "type": "article", "url": "https://www.libtards.news/2022-07-01-abortion-activists-use-bible-as-soccer-ball.html", "site_name": "Libtards News", "description": "Abortion activists kicking a Bible around like a soccer ball during a pro-choice protest were caught on video. The offensive footage was first posted on social media Sunday, June 26, by a user named The Seattle Preacher (TSP). It was recorded during a protest against the overturn of the 1973 Roe v. Wade abortion ruling […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2022/07/Holy-Bible.jpg"}, "tags": ["infanticide", "left cult", "Oregon", "pregnancy centers", "demonic", "Colorado", "culture wars", "extremism", "Bible", "hate crime", "Roe v. Wade", "social justice", "pro-life", "vandalism", "arson", "Seattle", "abortion", "evil", "sacrilege", "Twisted", "violence"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/pro-abortion-activists-play-soccer-with-a-bible-commit-acts-of-desecration/", "https://demonictimes.com", "https://naturalnews.com/2022-06-25-leftists-night-rage-riots-roe-wade-overturned.html", "https://www.lifesitenews.com/news/pro-life-pregnancy-centers-face-arson-smoke-bomb-attacks-after-roe-v-wade-reversal/", "http://abortions.news", "https://www.brighteon.com/285adc01-790b-4259-8c92-2b1d8cc010f6.", "https://www.brighteon.com/channels/royalbluekid", "https://culturewars.news/2022-06-28-christian-crisis-pregnancy-center-colorado-vandalized.html", "https://evil.news/2022-05-06-abortion-activists-urge-protests-scotus-judges-houses.html", "https://domesticterrorism.com/2022-05-20-dhs-leftists-storm-supreme-court-murder-justices.html", "https://abortions.news/2022-05-09-pro-abortion-leftists-dox-target-conservative-justices.html", "https://infanticide.news/2022-05-05-howling-leftist-demons-violence-scotus-roe-wade.html", "https://www.lifesitenews.com/news/pro-abortion-activists-play-soccer-with-a-bible-commit-acts-of-desecration/", "https://www.lifesitenews.com/news/pro-life-pregnancy-centers-face-arson-smoke-bomb-attacks-after-roe-v-wade-reversal/", "https://www.brighteon.com/285adc01-790b-4259-8c92-2b1d8cc010f6", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2022-07-01-abortion-activists-use-bible-as-soccer-ball.html&linkname=SACRILEGE%3A%20Abortion%20activists%20use%20Bible%20as%20soccer%20ball%20in%20Seattle%20protest", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}