{"result_id": "189010", "URL": "https://libtards.news/2023-02-27-deadly-conditions-sudafed-revealed-safety-review.html", "timestamp": "2023-04-25 16:15:57 CEST+0200", "meta": {"description": "Regulators are currently examining the safety of common decongestants due to concerns over their possible connection to two fatal brain conditions, according to a report published this week. Pseudoephedrine, found in tablets and capsules used to alleviate nasal congestion, is a key ingredient in some popular decongestant brands such as Sudafed, Day & Night Nurse, […]", "lang": "en", "keywords": "banned,blood transfusion,cold and flu,cold treatment,Dangerous Medicine,flu medicine,government regulation,health freedom,over the counter,prescription only,RCVS,Sudafed,United Kingdom", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://libtards.news/2023-02-27-deadly-conditions-sudafed-revealed-safety-review.html", "encoding": "UTF-8"}, "image": null, "domain": "libtards.news", "title": "Deadly conditions associated with Sudafed revealed in safety review as over-the-counter cold remedies at risk of becoming prescription-only in Britain", "cleaned_text": "Deadly conditions associated with Sudafed revealed in safety review as over-the-counter cold remedies at risk of becoming prescription-only in Britain\n\nRegulators are currently examining the safety of common decongestants due to concerns over their possible connection to two fatal brain conditions, according to a report published this week.\n\nPseudoephedrine, found in tablets and capsules used to alleviate nasal congestion, is a key ingredient in some popular decongestant brands such as Sudafed, Day & Night Nurse, and Nurofen’s Cold and Flu. In rare circumstances, this drug can prompt a dangerous response in the blood vessels of the brain, leading to either posterior reversible encephalopathy syndrome (PRES) or reversible cerebral vasoconstriction syndrome (RCVS), the UK’s Daily Mail reported.\n\nThe Medicines and Healthcare products Regulatory Agency (MHRA) in the UK has initiated a review of several over-the-counter drugs that contain pseudoephedrine, a drug used to alleviate nasal congestion. This move follows a similar review by the European Medicines Agency (EMA).\n\nThe purpose of the reviews is to investigate potential links between the drug and two rare and life-threatening brain conditions, posterior reversible encephalopathy syndrome (PRES) and reversible cerebral vasoconstriction syndrome (RCVS).\n\nThe prevalence of the two conditions is so low that there are no reliable figures available. Both conditions involve the brain receiving a reduced blood supply, known as ischaemia, which causes it to swell, the outlet reported.\n\nWhile PRES can develop at any age from infancy to old age, dozens of studies have found that it most commonly affects adults in their 40s and 50s, and it is slightly more prevalent in women. On the other hand, RCVS is mostly diagnosed in women between the ages of 20 and 50, and is sometimes associated with changes in women’s bodies during or after pregnancy, or when starting or changing birth control pills. PRES mainly affects the back of the brain, although it can affect other areas as well, the report noted further.\n\nDoctors are not certain about the underlying cause of PRES. However, approximately seven out of ten individuals with the condition have high blood pressure, which can cause pressure on the blood vessels and subsequent swelling of the surrounding brain tissue, the Daily Mail continued in its analysis of the findings.\n\nOn the other hand, RCVS occurs when blood vessel constriction, or vasoconstriction, persists, leading to a narrowing of arteries. This results in reduced blood flow and oxygen delivery to the affected area of the brain.\n\nThe report also detailed how the conditions can be triggered:\n\nPRES is linked with a swathe of conditions, though most frequently with high blood pressure, eclampsia, severe infection, kidney disease and some autoimmune diseases. Certain medicines, particularly decongestants like Sudafed and Nurofen’s Cold and Flu, or immunosuppressants and cancer chemotherapy, are also thought to raise the risk. In rarer cases, it could occur as a side effect of the antibiotic linezolid, scorpion poisoning or after LSD and cocaine use.\n\nCertain prescription medications such as anti-depressants, nasal decongestants, and nicotine patches, as well as head injuries, are among the risk factors associated with RCVS. Blood and intravenous immunoglobulin transfusions, as well as some tumors, can also trigger the condition, the Daily Mail noted.\n\nAccording to the NHS, common signs of PRES include headaches, vision problems, and seizures, which occur in over two-thirds of cases. Those affected may also experience confusion, weakness in one or more limbs, nausea, and difficulty speaking. The symptoms of PRES typically appear suddenly, within a few hours, and can worsen over a period of 12 to 48 hours, the report said.\n\nA severe headache known as a ‘thunderclap’ is the main symptom of RCVS and may be the only one. However, other signs can include seizures, vision problems, and weakness on one side of the body. Some people also have difficulty understanding others when they’re speaking and difficulty speaking themselves.\n\n“In the vast majority of cases of PRES and RCVS, patients recover from their symptoms. But in some instances, it can be life-threatening,” the outlet noted.", "opengraph": {"title": "Deadly conditions associated with Sudafed revealed in safety review as over-the-counter cold remedies at risk of becoming prescription-only in Britain", "type": "article", "url": "https://www.libtards.news/2023-02-27-deadly-conditions-sudafed-revealed-safety-review.html", "site_name": "Libtards News", "description": "Regulators are currently examining the safety of common decongestants due to concerns over their possible connection to two fatal brain conditions, according to a report published this week. Pseudoephedrine, found in tablets and capsules used to alleviate nasal congestion, is a key ingredient in some popular decongestant brands such as Sudafed, Day & Night Nurse, […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2023/02/cold-flu.jpg"}, "tags": ["blood transfusion", "cold treatment", "flu medicine", "United Kingdom", "banned", "Sudafed", "prescription only", "government regulation", "over the counter", "RCVS", "health freedom", "cold and flu"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-11784223/The-deadly-conditions-Sudafed-safety-review-flu-remedies-pulled-shelves.html", "https://naturalnews.com/043155_Tylenol_liver_damage_warning_label.html", "https://www.dailymail.co.uk/health/article-11784223/The-deadly-conditions-Sudafed-safety-review-flu-remedies-pulled-shelves.html", "https://naturalnews.com/043155_Tylenol_liver_damage_warning_label.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2023-02-27-deadly-conditions-sudafed-revealed-safety-review.html&linkname=Deadly%20conditions%20associated%20with%20Sudafed%20revealed%20in%20safety%20review%20as%20over-the-counter%20cold%20remedies%20at%20risk%20of%20becoming%20prescription-only%20in%20Britain", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}