{"result_id": "189021", "URL": "https://www.libtards.news/2022-12-12-roe-protest-vasectomies-leftist-men-34-percent.html", "timestamp": "2023-04-25 16:16:03 CEST+0200", "meta": {"description": "In a show of solidarity for all the women out there who no longer have easy access to abortion on demand now that Roe v. Wade has been overturned, leftist men in growing numbers are reportedly opting for a vasectomy to prevent pregnancy. According to Dr. Grace Shih, the director of vasectomy services at Planned […]", "lang": "en", "keywords": "abortion,abortions,bias,Fact Check,infanticide,intolerance,left cult,Liberal Mob,liberals,men,men's health,misinformation,population control,protest,Roe v. Wade,vasectomy", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.libtards.news/2022-12-12-roe-protest-vasectomies-leftist-men-34-percent.html", "encoding": "UTF-8"}, "image": null, "domain": "www.libtards.news", "title": "Since Roe v. Wade was overturned, “protest vasectomies” among leftist men have increased 34%, says Planned Parenthood", "cleaned_text": "Since Roe v. Wade was overturned, “protest vasectomies” among leftist men have increased 34%, says Planned Parenthood\n\nIn a show of solidarity for all the women out there who no longer have easy access to abortion on demand now that Roe v. Wade has been overturned, leftist men in growing numbers are reportedly opting for a vasectomy to prevent pregnancy.\n\nAccording to Dr. Grace Shih, the director of vasectomy services at Planned Parenthood of the Great Northwest, there has been a 34 percent increase in vasectomies ever since the Supreme Court’s June abortion ruling on Dobbs v. Jackson Women’s Health.\n\nShih says one man told her personally that his decision to get a vasectomy was an “act of love” towards women and their “reproductive rights.” Others simply said they simply do not want to have any children.\n\n“Men are interested in learning about contraception and learning about a vasectomy,” Shih told KIRO 7 News. “I think the change in our political climate brought ideas and motivations that were there but to the surface.”\n\nShih’s Planned Parenthood affiliate has facilities not just in the Northwest but also in Alaska, Hawaii, Indiana, and Kentucky. The latter two are among the states where abortion is now more restricted.\n\nPlanned Parenthood markets the vasectomy procedure as being “almost” pain-free, comparing it to “going to the dentist or getting blood drawn.” (Related: Vasectomy “parties” started to become a thing around the time of the 2016 election.)\n\nSince the Affordable Care Act (ACA), also known as Obamacare, does not cover the cost of a vasectomy, Planned Parenthood offers it for “free.” Depopulation is the group’s goal, after all, and making it easy and cost-free helps greatly to accomplish it.\n\nDoctors across America are reporting increased demand for vasectomies\n\nIt is not just Planned Parenthood that is reporting more vasectomies these days. Physicians in Kansas, Florida, and Washington say sterilization requests are on the rise at their clinics as well.\n\nDr. Marah Hehemann from the University of Washington says more than half of the patients she sees for vasectomies are men who currently do not have any children.\n\nOne man from Washington named Evan Pulgino told a local news affiliate that his decision to get a vasectomy hinged upon the feeling that he “had to do something, kind of, on my end” in response to the Roe decision.\n\n“Half the country lost their rights,” he complained. “Pregnancy requires two people, and it’s not fair that the burden falls on one person because they’re the ones that can get pregnant.”\n\nMost American women can still get an abortion, of course, despite Pulgino’s politically charged misinformation. Only 13 states are enforcing pro-life laws that ban or strictly limit the murdering of unborn babies while the other 37 are still providing abortions just as they always were – with some actually having expanded their abortion laws in defiance of Roe‘s overturning.\n\nIt is up to individual states to decide their own abortion laws, which means women who demand to have abortions whenever they feel like it will simply have to move, if they do not live in one already, to a “blue” state for easy access to baby murder.\n\n“This reality is hell,” wrote a commenter at Natural News about the issues of our day. “It is best not to bring any children to this place, especially in the U.S. If they are born here, they will be injected with too many vaccines which will make their lives miserable with many health problems caused by the ingredients in vaccines.”\n\n“Given the direction in which we as a species seemed to be headed, given the non-stop provocations of nuclear war by the U.S. government, given the inescapable collapse of our debt-based society, given that more people are now working for government than working to produce things in the manufacturing sector, given that more people are living parasitically off others via government programs than producing, why would one want to provide yet another generation of hosts for the parasite to feed upon?” wrote another.\n\nMore related news can be found at Depopulation.news.", "opengraph": {"title": "Since Roe v. Wade was overturned, “protest vasectomies” among leftist men have increased 34%, says Planned Parenthood", "type": "article", "url": "https://www.libtards.news/2022-12-12-roe-protest-vasectomies-leftist-men-34-percent.html", "site_name": "Libtards News", "description": "In a show of solidarity for all the women out there who no longer have easy access to abortion on demand now that Roe v. Wade has been overturned, leftist men in growing numbers are reportedly opting for a vasectomy to prevent pregnancy. According to Dr. Grace Shih, the director of vasectomy services at Planned […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2022/12/Male-men-checkup-doctor-reproductive-organ.jpg"}, "tags": ["Liberal Mob", "Fact Check", "population control", "abortions", "infanticide", "left cult", "intolerance", "liberals", "men", "protest", "vasectomy", "Roe v. Wade", "abortion", "men's health", "bias", "misinformation"], "tweets": [], "movies": [], "links": ["https://www.lifenews.com/2022/12/06/huge-wave-of-liberal-men-are-getting-vasectomies-to-protest-overturning-roe/", "https://naturalnews.com/055704_vasectomy_parties_children_population_reduction.html", "https://www.washington.edu/", "http://depopulation.news", "https://www.lifenews.com/2022/12/06/huge-wave-of-liberal-men-are-getting-vasectomies-to-protest-overturning-roe/", "https://naturalnews.com/055704_vasectomy_parties_children_population_reduction.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2022-12-12-roe-protest-vasectomies-leftist-men-34-percent.html&linkname=Since%20Roe%20v.%20Wade%20was%20overturned%2C%20%E2%80%9Cprotest%20vasectomies%E2%80%9D%20among%20leftist%20men%20have%20increased%2034%25%2C%20says%20Planned%20Parenthood", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}