{"result_id": "189018", "URL": "https://www.libtards.news/2022-10-30-democrat-candidate-dies-inexplicably-while-walking-his-dog.html", "timestamp": "2023-04-25 16:16:01 CEST+0200", "meta": {"description": "Seemingly, the most dangerous risk a human being can take after getting a Fauci Flu jab is bad-mouthing everyone who chooses not to get one. This would be the case, as we’ve seen it happen to many folks, with a 41-year-young progressive Democrat candidate, Richard Allen Rowe, who told the world he does not “give […]", "lang": "en", "keywords": "badhealth,badmedicine,cancel culture,clot shot,covid vaccine,Crybullies,culture wars,democrat vaccine,died suddenly,hate,intolerance,left cult,Libtard,lunatics,sudden death,vaccine death,Vaccine deaths,vaccine kills,vaccine wars,vaccines,woke", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.libtards.news/2022-10-30-democrat-candidate-dies-inexplicably-while-walking-his-dog.html", "encoding": "UTF-8"}, "image": null, "domain": "www.libtards.news", "title": "41-year-old Florida Democrat candidate DIES inexplicably while walking his dog after BLASTING health advocates for not getting same Fauci Flu jab he had just got", "cleaned_text": "41-year-old Florida Democrat candidate DIES inexplicably while walking his dog after BLASTING health advocates for not getting same Fauci Flu jab he had just got\n\nSeemingly, the most dangerous risk a human being can take after getting a Fauci Flu jab is bad-mouthing everyone who chooses not to get one. This would be the case, as we’ve seen it happen to many folks, with a 41-year-young progressive Democrat candidate, Richard Allen Rowe, who told the world he does not “give a f##k” what happens to “anti-vaxxers” and he hopes Darwin does his work in killing us all off. Then he dropped dead while walking his dog. Coincidence? Maybe so, but it’s happening time and time again to these pro-vax-fanatics who brag and boast about their spike-protein-prion injections, then drop dead from SADS (sudden adult death syndrome), a.k.a. the clot shot effect.\n\nThe latest Democrat vaccine fanatic mocked and scolded the fully unvaccinated masses for helping to “kill 700,000 Americans” and then died a few short months after getting the shot. We’ve seen body builders, newscasters, and politicians alike die from “unexplainable causes” shortly after getting shot up with millions of spike proteins in the nano-bot-clot shots, ironically WHILE telling the world of non-vaxxers they are going to die and kill people for not getting the deadly jabs themselves.\n\nNano-bot-clot-shot may have killed pro-vaccine fanatic while he accused the fully unvaccinated of being the biggest threat to the world\n\nDemocrat vax-fanatic and truck driver Richard Rowe went and got his first Pfizer jab this August and thought he was gaining protection from the gain-of-function flu, when in actuality he may have committed involuntary suicide in the face of it all. Well, you can’t catch or spread Covid if you’re dead, so in that sense, the clot shot worked. Survival of the fittest would then mean that avoiding the clot shot would be your best chance at surviving the pandemic.\n\nHere’s the Democrat vax-fanatic blowing up social media post-Pfizer-stab and before he croaked while walking his dog:\n\n“Let me be real clear….I do not give a F##K what happens to anti-vaxxers. I don’t. Let Darwin do his work. They helped kill 700,000 Americans. I do not have the pity or tears to spare for any of them. It’s all dried up now. Sorry. At this point. I’m just hoping they feel 1/10th of the pain they’ve caused everyone else. The kids will be fine. THEY’RE going to suffer. And I f##king well think they’ve earned it.”\n\nCovid Democrat and vax and mask fanatic dies after saying everyone who doesn’t vax up or mask up deserves to die\n\nPro-jab-fanatic and Democrat candidate for office, Richard Rowe, plastered social media with hate speech about non-vaxxers, but was never banned, barred, censored, or booted off Twitter, Fakebook, Instagram, or any of the other Far Left extremist social hate platforms, because he’s not conservative or going against the narratives. Simple as that.\n\nStrange how these vaccine fanatics who voice their anger and vicious slams at the fully unvaccinated millions end up suffering inexplicable death shortly after (or during) the Wuhan flu shots.\n\nMaybe mainstream media “MSM” will blame some random referee whistle that might have been blown in the vicinity of Rowe dropping dead while walking his dog, or maybe Rowe took a nice cold shower first and that made his heart fluctuate so badly that it just stopped working altogether. We’ve seen those stories scattered and splattered all over fake news as of late.\n\nMaybe Rowe had so much hatred for the fully unvaccinated that the hatred itself caused his heart to stop working or a blood vessel in his brain to pop and give him a stroke. Nobody knows what really caused his death, yet, but maybe an embalmer or coroner will find those strange rubbery long clots made of heavy metals in his blood and reveal the real culprit. Only time and an honest autopsy will tell.\n\nBookmark Vaccines.news to your favorite independent websites for updates on experimental “vaccines” that cause blood clots, myocarditis, and severe, chronic inflammation.", "opengraph": {"title": "41-year-old Florida Democrat candidate DIES inexplicably while walking his dog after BLASTING health advocates for not getting same Fauci Flu jab he had just got", "type": "article", "url": "https://www.libtards.news/2022-10-30-democrat-candidate-dies-inexplicably-while-walking-his-dog.html", "site_name": "Libtards News", "description": "Seemingly, the most dangerous risk a human being can take after getting a Fauci Flu jab is bad-mouthing everyone who chooses not to get one. This would be the case, as we’ve seen it happen to many folks, with a 41-year-young progressive Democrat candidate, Richard Allen Rowe, who told the world he does not “give […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2022/10/Doctor-Office-Man-Vaccine-Injection-Masks.jpg"}, "tags": ["left cult", "lunatics", "democrat vaccine", "sudden death", "died suddenly", "culture wars", "intolerance", "clot shot", "covid vaccine", "Crybullies", "vaccine wars", "woke", "cancel culture", "Vaccine deaths", "hate", "vaccine kills", "vaccines", "Libtard", "vaccine death"], "tweets": [], "movies": [], "links": ["https://ballotpedia.org/Richard_Allen_Rowe", "https://naturalnews.com/2022-10-24-top-5-outrageous-cover-stories-covid-vaccine-heart-attacks-teens-young-adults.html", "https://naturalnews.com/2022-10-22-bodybuilder-doug-brignole-dies-after-moderna-covid-jab.html", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://www.infowars.com/posts/former-dem-candidate-who-said-i-dont-give-a-fk-what-happens-to-anti-vaxxers-died-suddenly-while-walking-dog/", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.infowars.com/posts/former-dem-candidate-who-said-i-dont-give-a-fk-what-happens-to-anti-vaxxers-died-suddenly-while-walking-dog/", "https://naturalnews.com/2022-10-22-bodybuilder-doug-brignole-dies-after-moderna-covid-jab.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2022-10-30-democrat-candidate-dies-inexplicably-while-walking-his-dog.html&linkname=41-year-old%20Florida%20Democrat%20candidate%20DIES%20inexplicably%20while%20walking%20his%20dog%20after%20BLASTING%20health%20advocates%20for%20not%20getting%20same%20Fauci%20Flu%20jab%20he%20had%20just%20got", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}