{"result_id": "189023", "URL": "https://libtards.news/2023-03-06-board-member-arizona-sd-reject-christian-teachers.html", "timestamp": "2023-04-25 16:16:04 CEST+0200", "meta": {"description": "A leftist school board member in Arizona said her school district should stop hiring Christian teachers because of their beliefs. Tamillia Valenzuela, one of the board members of the Washington Elementary School District (ESD) in Arizona, opposed the five-year contract inked by the school district and Arizona Christian University (ACU). Under the contract, student teachers […]", "lang": "en", "keywords": "Arizona,biased,campus insanity,Christian teachers,Connecticut,culture wars,education system,fascism,Greenwich Public Schools,Jeremy Boland,Kyle Clayton,left cult,public education,school districts,social justice,Tamillia Valenzuela,Washington Elementary School District", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://libtards.news/2023-03-06-board-member-arizona-sd-reject-christian-teachers.html", "encoding": "UTF-8"}, "image": null, "domain": "libtards.news", "title": "School board member says Arizona school district should reject hiring Christian teachers", "cleaned_text": "A leftist school board member in Arizona said her school district should stop hiring Christian teachers because of their beliefs.\n\nTamillia Valenzuela, one of the board members of the Washington Elementary School District (ESD) in Arizona, opposed the five-year contract inked by the school district and Arizona Christian University (ACU). Under the contract, student teachers from ACU would be placed in Washington ESD classrooms in order to gain experience. Given this opposition, the school board agreed on a motion to dissolve the partnership with ACU on Feb. 23.\n\nValenzuela, who describes herself as “a bilingual, disabled, neurodivergent queer Black Latina,” openly criticized the contract. She zeroed in on ACU’s goals to “transform the culture with truth” by promoting “the centrality of family, traditional sexual morality and lifelong marriage between one man and one woman” – values that are “foundational to Western civilization.”\n\n“I want to know how bringing [teachers] from an institution that is ingrained in their values so directly brings impact to three of your board members who are a part of the LGBT community.” Valenzuela stated. “Because if we’re bringing people in whose mission [is] … to influence people to [be] biblically-minded, how does that hold space for people of other faiths?”\n\n“How does that hold space for our members of the LGBT community? How does that space for people who think differently and do not have the same beliefs? At some point, we need to get real with ourselves and take a look at who we’re making legal contracts with and the message that is sending to our community. Because that makes me feel like I could not be safe in this school district.”\n\nValenzuela found an ally in Kyle Clayton, another school board member. He focused not only on ACU’s core values, but the statement of faith the university asks students to sign and live by.\n\n“Proselytizing is embedded into how they teach,” Clayton said. “I just don’t believe that that belongs in schools.”\n\nValenzuela and Clayton are not the only school officials who opposed the inclusion of Christian teachers in their school districts. One assistant principal in a Connecticut school was found to have been discriminating against educators at the school under his purview.\n\nBack in August of last year, Project Veritas exposed the anti-conservative bias of Cos Cob Elementary School Assistant Principal Jeremy Boland. Undercover footage recorded and published by the activist group revealed the school official admitting he would not hire applicants who are Catholic and above 30 years old.\n\n“If someone is raised hardcore Catholic, it’s like they’re brainwashed. You can never change their mindset,” he told a Project Veritas undercover journalist. “When you ask them to consider something new, like a new opportunity or [a new way] to think about [something] differently, they’re stuck – just rigid.” (Related: Woke assistant principal caught on video bragging about child indoctrination, refusing to hire Catholic teachers.)\n\nBoland also bragged how he refused to interview older teachers entirely due to their more conservative viewpoints.\n\n“Greenwich Public Schools (GPS) needs younger teachers. Because [the school district] pays very well, you get teachers from other districts who have been there for a long time that want to come to Greenwich. If they’re older, I’m not allowed to do that. I can’t tell them: ‘I’m not interviewing you because you’re older. I just don’t interview them.”\n\n“For one position, I think we had 30 applicants. Out of all those applicants, I don’t think I interviewed anybody over the [age] of 30. Because sometimes – the older you get, the more set in your ways [and] the more conservative you [become].”\n\nFollowing the expose, GPS Superintendent Dr. Toni Jones wrote in an email that an investigation had been conducted. She later sent a subsequent email stating that Boland had been “placed on administrative leave” over his remarks.\n\nPublicEducation.news has more stories about anti-Christian school officials in public schools.\n\nWatch this Project Veritas footage where Boland admits to discriminating against conservatives.\n\nThis video is from the Current Update channel on Brighteon.com.\n\nLEFTISTS in America do not practice the TOLERANCE they preach – watch ‘liberal’ fascist school administrators caught on video discriminating against race and religion.\n\nStudents push back against anti-Catholic rhetoric, events at Jesuit-run university in Missouri.\n\nConnecticut school district suspends official who admitted he won’t hire conservatives.", "opengraph": {"title": "School board member says Arizona school district should reject hiring Christian teachers", "type": "article", "url": "https://www.libtards.news/2023-03-06-board-member-arizona-sd-reject-christian-teachers.html", "site_name": "Libtards News", "description": "A leftist school board member in Arizona said her school district should stop hiring Christian teachers because of their beliefs. Tamillia Valenzuela, one of the board members of the Washington Elementary School District (ESD) in Arizona, opposed the five-year contract inked by the school district and Arizona Christian University (ACU). Under the contract, student teachers […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2023/03/Arizona-State-Flag-On-Wood-Background.jpg"}, "tags": ["Kyle Clayton", "Arizona", "Connecticut", "culture wars", "fascism", "Greenwich Public Schools", "left cult", "public education", "school districts", "Tamillia Valenzuela", "Christian teachers", "Washington Elementary School District", "Jeremy Boland", "biased", "campus insanity", "education system", "social justice"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/education/2023/03/03/arizona-school-board-member-says-district-should-reject-hiring-christian-teachers/", "https://www.arizonachristian.edu/", "http://leftcult.com", "https://www.projectveritas.com/news/exposed-greenwich-ct-assistant-principals-hiring-discrimination-ensures/", "https://www.naturalnews.com/2022-09-04-woke-assistant-principal-caught-bragging-child-indoctrination.html", "https://www.projectveritas.com/results-and-impact-2022/", "https://publiceducation.news/", "https://www.brighteon.com/2ef6edd0-f028-416d-b082-505f9e826324", "https://www.brighteon.com/channels/currentupdates", "https://leftcult.com/2022-09-08-school-administrators-caught-on-video-discriminating-race-religion.html", "https://resist.news/2022-11-17-students-push-back-anti-catholic-events-jesuit-university.html", "https://newstarget.com/2022-09-02-school-official-suspended-for-not-hiring-conservatives.html", "https://www.breitbart.com/education/2023/03/03/arizona-school-board-member-says-district-should-reject-hiring-christian-teachers/", "https://www.projectveritas.com/news/exposed-greenwich-ct-assistant-principals-hiring-discrimination-ensures/", "https://www.projectveritas.com/results-and-impact-2022/", "https://www.brighteon.com/2ef6edd0-f028-416d-b082-505f9e826324", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2023-03-06-board-member-arizona-sd-reject-christian-teachers.html&linkname=School%20board%20member%20says%20Arizona%20school%20district%20should%20reject%20hiring%20Christian%20teachers", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}