{"result_id": "189004", "URL": "https://libtards.news/2021-12-14-in-a-world-dominated-by-mass-delusion-the-truly-sane-seem-like-outcasts.html", "timestamp": "2023-04-25 16:15:52 CEST+0200", "meta": {"description": "We live in a world where the masses are delusional. They have been manipulated via engineered media hysteria into believing in an invisible “pandemic” that’s going to kill them if they don’t comply. At first, the compliance demand was something like, “Wear these masks. You’ll only need to wear them until there’s a vaccine.” Once […]", "lang": "en", "keywords": "brainwashed,culture wars,delusion,gullible,hallucinations,indoctrinated,insane,insanity,left cult,Libtards,lunatics,mass hypnosis,mental health,mind control,mind games,psychiatry,reality,stupid,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://libtards.news/2021-12-14-in-a-world-dominated-by-mass-delusion-the-truly-sane-seem-like-outcasts.html", "encoding": "UTF-8"}, "image": null, "domain": "libtards.news", "title": "In a world dominated by mass DELUSION, the truly sane seem like outcasts", "cleaned_text": "In a world dominated by mass DELUSION, the truly sane seem like outcasts\n\nWe live in a world where the masses are delusional. They have been manipulated via engineered media hysteria into believing in an invisible “pandemic” that’s going to kill them if they don’t comply.\n\nAt first, the compliance demand was something like, “Wear these masks. You’ll only need to wear them until there’s a vaccine.”\n\nOnce the vaccine became available, the compliance demand was ramped up to, “Take two shots and we’ll get back to normal.”\n\nNow, of course, at the end of 2021, people are required to both take endless booster shots and keep wearing masks… all while social distancing and complying with endless lockdowns and covid quarantine camps, of course.\n\nAt this point, anyone going along with this insanity is clinically delusional and suffering from shared mass psychosis (or what’s called “mass formation” by some scientists). They are proving that they cannot cognitively parse the world around them in a meaningful way that supports their own continued existence.\n\nImportantly, the fact that delusional thinking is widespread does not make it sane. Through media programming, censorship and authoritarian measures, entire nations can be ensnared under grotesque delusions. Look no further than North Korea if you need a current example, and then realize that North Korea-style censorship and propaganda has been on the march in the USA for several years now.\n\nAnyone who trusts the mainstream media is both delusional and gullible\n\nVirtually the entire corporate media establishment fell for the Jussie Smollett hate crime hoax. They fell for the Russia collusion hoax, and they fell for the “meat market” origins lie about the coronavirus. They also still push the fraudulent PCR “cases” lie that’s rooted in complete scientific fraud.\n\nIf there were any honest news trust rating system in place, every major media outlet would be rated with an “F” grade, since they’ve falsified or misreported nearly every major event over the last several years (including news about Nick Sandman and Kyle Rittenhouse, for example).\n\nAny person who still believes the mainstream media has credibility is delusional (and gullible). Anyone who believes the CDC or FDA have “scientific authority” is either stupid or living in a fairy tale world. What we’ve all learned over the past two years — or should have learned if we were paying attention — is that when it matters most, every mainstream institution will deliberately deceive you even if such deception results in the loss of innocent human life.\n\nBecause of all this, it’s easy to identify gullible, delusional people in our society: They’re the ones still wearing masks! They’re the ones somehow still watching CNN, the pedophile network. They’re the ones still lining up for booster shots, somehow telling themselves that the reason they need booster shots is because all the previous shots have failed, yet this booster will magically work even though it’s the same shot from the same exact company.\n\nNever forget the definition of insanity.\n\nDelusional people will also tell you they believe women have a penis and men can get pregnant. These are the truly insane ones, and they’ve become so mass hypnotized into their fairy tale false realities that they’ve become completely disconnected from biological reality.\n\nIt’s truly bizarre that these are the same people who line up for vaccine booster shots, because if they really believed physiology was subjective, couldn’t they just decide to “self identify” as someone who’s already immune to covid? Why do they believe biology is real when it comes to vaccine injections but biology is imaginary when it comes to pregnancy and penises?\n\nThe answer, of course, is because they are mentally ill delusional lunatics. And by the laws of natural selection, they are gradually removing themselves from the human gene pool through vaccine-assisted suicide, which may be one of the few silver linings in this entire mess. Signing up for spike protein depopulation injections really is a kind of global IQ test, and billions of people are failing it… with fatal consequences that will play out over the next ten years or so.\n\nDon’t even try to fit in with an insane, delusional culture\n\nFor those of us who are still anchored in reality, it’s important to remember that there’s no need to try to conform to an insane, demonic culture or society. When society (or “sickciety”) has turned into a clown world of lunatics, trying to fit in is just a bizarre form of self-inflicted suffering. Instead of bending to the twisted will of the delusional masses, spend your time reconnecting with reality. That’s your consciousness anchor that prevents you from drifting off into la la libtard land.\n\nHow do you reconnect with reality?\n• Have a garden and grow some food. Touch soil. Save seeds. Experience reality through firsthand senses. Listen, touch, feel and see.\n• Take walks in nature. Experience the real world around you.\n• Avoid artificial worlds, augmented worlds and virtual reality. They enslave you in fake illusions. They sap your soul.\n• Connect with God and rediscover your spiritual self. Your soul is real. Consciousness is real. It may not be physical, but it’s the most real thing about human existence.\n• Connect with real people who are living in reality, and distance yourself from old “friends” who are delusional herd followers and gullible conformists.\n• Take time away from all screens. Although it’s great to gather information from those who have something valuable to share, don’t allow your life to be dominated by screens and mobile devices.\n\nIn today’s Situation Update podcast, I cover the nature of reality and even get into extradimensional “elves” that people report encountering when they take DMT. (Yes, seriously, they say they meet cosmic elves. The only elf I’ve ever seen is an evil elf named Fauci…)\n\nIt’s a wild ride through the delusions of a society gone mad… and how to maintain your sanity through it all. (Laughter is also a great anchoring tool, which is why I mock so many things happening in the world today.)\n\nBonus today: A sing-along ditty about a new transgender superhero who wields the male member as a weapon…\n\nFind a new podcast each day, along with interviews and special reports, at:", "opengraph": {"title": "In a world dominated by mass DELUSION, the truly sane seem like outcasts", "type": "article", "url": "https://www.libtards.news/2021-12-14-in-a-world-dominated-by-mass-delusion-the-truly-sane-seem-like-outcasts.html", "site_name": "Libtards News", "description": "We live in a world where the masses are delusional. They have been manipulated via engineered media hysteria into believing in an invisible “pandemic” that’s going to kill them if they don’t comply. At first, the compliance demand was something like, “Wear these masks. You’ll only need to wear them until there’s a vaccine.” Once […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2021/12/Tv-People-Influences-Illustration.jpg"}, "tags": ["left cult", "lunatics", "mental health", "culture wars", "mass hypnosis", "reality", "wokies", "brainwashed", "insane", "gullible", "stupid", "insanity", "mind control", "indoctrinated", "psychiatry", "delusion", "Libtards", "mind games", "hallucinations"], "tweets": [], "movies": [], "links": ["http://Brighteon.com/735b38ce-8b06-4641-be2f-48619082f81a", "https://www.brighteon.com/channels/hrreport"], "authors": [], "publish_date": null}