{"result_id": "189016", "URL": "http://libtards.news/2018-03-18-abortion-mills-now-offer-transgender-hormone-treatments.html", "timestamp": "2023-04-25 16:16:00 CEST+0200", "meta": {"description": "Now that the baby-murdering organization known as Planned Parenthood has been outed for running an illegal, underground body parts butcher mill, the pro-abortion death cult is switching gears a bit in an attempt to diversify its “health services” and presumably clean up its image. According to reports, Planned Parenthood has already begun to attempt this […]", "lang": "en", "keywords": "abortion,cecile richards,death cult,gender,genocide,health care,health services,hormones,identity politics,murder,Planned Parenthood,transgender,transgenderism,unborn,women's health", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "http://libtards.news/2018-03-18-abortion-mills-now-offer-transgender-hormone-treatments.html", "encoding": "UTF-8"}, "image": null, "domain": "libtards.news", "title": "The same group that murders babies with “abortion mills” now claims to offer transgender hormone “treatments” for gender-confused youth", "cleaned_text": "The same group that murders babies with “abortion mills” now claims to offer transgender hormone “treatments” for gender-confused youth\n\nNow that the baby-murdering organization known as Planned Parenthood has been outed for running an illegal, underground body parts butcher mill, the pro-abortion death cult is switching gears a bit in an attempt to diversify its “health services” and presumably clean up its image.\n\nAccording to reports, Planned Parenthood has already begun to attempt this by promising to devote more of its resources towards providing transgender hormone therapy to gender-confused individuals seeking to “change sexes” – as if this is somehow better than murdering unborn babies in the womb.\n\nA recent announcement made by Planned Parenthood President Cecile Richards reveals that the organization is “pioneering” new ways to expand “access to care,” which for Planned Parenthood means offering everything from “self-injectable birth control” to “new services for our transgender patients.”\n\n“Planned Parenthood has focused on expanding services to people who are too often overlooked by the larger medical community – including trans patients,” Richards stated in her report.\n\nKeep in mind that, according to Planned Parenthood’s 2016-17 annual report, the organization is struggling to stay afloat. Not only are fewer women seeking abortions, according to the data, but many patients are seeking health care services elsewhere amid the growing controversy surrounding Planned Parenthood’s eugenics roots.\n\n“17 states now have Planned Parenthood health centers that provide hormone therapy,” Richards added, proudly, glossing over the fact that all Planned Parenthood is doing is shifting some of its destructive focus from one vulnerable group, unborn babies, to another, individuals with gender dysphoria.\n\nPlanned Parenthood is on the decline\n\nEven as Planned Parenthood is struggling to keep its clinics open in many areas of the country – seven states, in fact, are now down to just one Planned Parenthood clinic each – money still seems to be pouring in for the organization.\n\nAccording to the latest data, Planned Parenthood raised $532.7 million in 2017 from private donors and bequests, which is up 19 percent from the $445.8 million it generated in 2016. In other words, despite offering its “services” to fewer clients, Planned Parenthood is flush with money.\n\nThis, of course, is in addition to the more than half a billion dollars that Planned Parenthood still receives from the American taxpayer coffers.\n\n“This means that Planned Parenthood is somehow making more money with fewer patients,” stated Randy O’Bannon, one of the directors of the National Right to Life Committee, to the Daily Wire.\n\nAll of this money could eventually dry up, it’s important to note. Planned Parenthood’s newfound focus on transgendered individuals will likely be short-lived, seeing as how only 0.6 percent of the United States population identifies as being transgender.\n\nYear after year, Planned Parenthood is seeing fewer and fewer people aligning themselves with it. While it boasted about three million patients back in 2010, it only saw 2.4 million patients this past year – a 20 percent decline.\n\nAnd despite its increased funding from 2016 to 2017, Planned Parenthood saw an asset decrease of more than $43.4 million last year, which included the closure of at least 33 clinics. One of these occurred right at the end of 2017 in Iowa’s Quad Cities region.\n\n“That was the largest shutdown in recent years – Planned Parenthood shed just $16.7 million in assets in 2016 – amid a decline in the national abortion rate, which has hit its lowest level since the procedure was legalized nationwide by the 1973 U.S. Supreme Court’s landmark Roe v. Wade decision,” writes Valerie Richardson for The Washington Times.\n\n“A 2016 Guttmacher Institute study found that the abortion rate fell in 2014 to 14.6 per 1,000 women after peaking in 1980 at 29.3, falling for the first time below the 16.3 abortions per 1,000 women immediately after Roe.”", "opengraph": {"title": "The same group that murders babies with “abortion mills” now claims to offer transgender hormone “treatments” for gender-confused youth", "type": "article", "url": "https://www.libtards.news/2018-03-18-abortion-mills-now-offer-transgender-hormone-treatments.html", "site_name": "Libtards News", "description": "Now that the baby-murdering organization known as Planned Parenthood has been outed for running an illegal, underground body parts butcher mill, the pro-abortion death cult is switching gears a bit in an attempt to diversify its “health services” and presumably clean up its image. According to reports, Planned Parenthood has already begun to attempt this […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2019/04/planned-parenthood.jpg"}, "tags": ["Planned Parenthood", "death cult", "murder", "health care", "hormones", "cecile richards", "women's health", "genocide", "transgender", "gender", "transgenderism", "unborn", "abortion", "health services", "identity politics"], "tweets": [], "movies": [], "links": ["https://www.dailywire.com/news/25376/planned-parenthood-targeting-new-clientele-amanda-prestigiacomo", "https://www.washingtontimes.com/news/2018/jan/3/planned-parenthood-enters-transgender-market/", "https://www.naturalnews.com/2017-11-16-planned-parenthood-was-set-up-out-of-a-motivation-to-exterminate-human-weeds.html", "http://www.abortions.news/", "https://www.dailywire.com/news/25376/planned-parenthood-targeting-new-clientele-amanda-prestigiacomo", "https://www.washingtontimes.com/news/2018/jan/3/planned-parenthood-enters-transgender-market/", "https://www.naturalnews.com/2017-11-16-planned-parenthood-was-set-up-out-of-a-motivation-to-exterminate-human-weeds.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2018-03-18-abortion-mills-now-offer-transgender-hormone-treatments.html&linkname=The%20same%20group%20that%20murders%20babies%20with%20%E2%80%9Cabortion%20mills%E2%80%9D%20now%20claims%20to%20offer%20transgender%20hormone%20%E2%80%9Ctreatments%E2%80%9D%20for%20gender-confused%20youth", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}