{"result_id": "189027", "URL": "https://www.libtards.news/2021-06-15-national-parent-group-to-fight-woke-education.html", "timestamp": "2023-04-25 16:16:07 CEST+0200", "meta": {"description": "Less than a year ago, Elana Fishbein was a happy stay-at-home mother, raising her three boys in a well-off Philadelphia suburb. She’d noticed the school that two of her boys attended would push out some lessons and activities that she considered politically biased or inappropriate, but each time was able to resolve the situation by […]", "lang": "en", "keywords": "education,parent,woke", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.libtards.news/2021-06-15-national-parent-group-to-fight-woke-education.html", "encoding": "UTF-8"}, "image": null, "domain": "www.libtards.news", "title": "National parent group emerges to fight ‘woke’ education, says it harms children", "cleaned_text": "National parent group emerges to fight ‘woke’ education, says it harms children\n\nLess than a year ago, Elana Fishbein was a happy stay-at-home mother, raising her three boys in a well-off Philadelphia suburb. She’d noticed the school that two of her boys attended would push out some lessons and activities that she considered politically biased or inappropriate, but each time was able to resolve the situation by opting her children out. In June last year, however, she saw no other choice than to take action.\n\nFollowing the protests and riots sparked by the death of George Floyd in Minnesota, the school issued new “cultural proficiency” lessons.\n\n“My husband and I looked at the lesson plan and opened the links to the books that they included for the lesson plan and we were thoroughly horrified because they were totally racist,” she told The Epoch Times.\n\nThe events that followed led to the launch of a group that now runs chapters in nearly half the states, sporting tens of thousands of followers.\n\nThe school materials Fishbein examined followed what she called “woke” culture—a set of quazi-Marxist ideologies that divides society into “oppressors” and the “oppressed” based on characteristics such as race, sex, class, or sexual proclivities. The term “woke” is sometimes used interchangeably with critical race theory (CRT), which is only one of the ideologies that operate within this framework.\n\nFishbein immediately opted her children out of the lessons and sent an incensed letter to the school district superintendent.\n\n“The material selected for this indoctrination pumps their brains with LIES that puts unbearable emotional burdens on them for years to come,” she wrote, backing her argument with a doctorate in child welfare (pdf). “Why must our kids feel like villains and hate themselves for something they had no control over—the color/pigmentation of their skin?!?”\n\n“They are doing to us what they told us not to do to others,” her 9-year-old commented, according to the letter.\n\nHer children didn’t return to the school in fall—a decision she’d already made before she learned of the new curriculum.\n\n“I was just a happy mom. But somebody made a point of destroying the life of my children and many other children,” she said.\n\nSince nobody responded to her letter, she posted it on the parents Facebook page of the school, asking others what they thought.\n\nThe response took her aback.\n\n“I was called racist and bigoted and homophobe and whatever,” she said.\n\nHer post was then taken down.\n\nShe tried several other local Facebook pages with similar results.\n\n“I was blown away,” she said. “They won’t even discuss it. They just call you a name.”\n\nShe contacted her friend at a conservative-leaning news outlet that agreed to run a story about her experience.\n\nIt was then that people facing similar issues started to reach out to her.\n\n“They were telling me, every single one of them, that they’re afraid to speak up,” she said.\n\nThis was the watershed moment for her.\n\nBeing of Jewish descent, Fishbein felt an implicit threat behind the ideology.\n\n“This is ridiculous,” she said she told herself. “This is going to take over our country. They’re attacking our children. They’re attacking our families, our values, our way of life and we’re just going to sit around and take the bullet? And people are just afraid? Just because somebody called you a racist?”\n\nIn that moment, in late-August, “it hit me … and I launched a movement,” she said.\n\nShe assembled in her living room a few parents that contacted her and she shared her idea with them.\n\n“Are you a racist? If you’re a racist, I understand, but if you’re not a racist, why are you not standing up for your kid and for your family?” she told them.\n\nIn mid-September, she was invited on Fox News’ “Tucker Carlson Tonight” after somebody forwarded the initial article about Fishbein to the show.\n\nOver the week after the show aired, her small Facebook page called “No Left Turn in Education” received over a million visits.\n\nTens of thousands of people were reaching out to her with their fears and worries.\n\n“They were tormented. And many of them said, ‘We would like to act, but we don’t know what to do,'” she said.\n\nAnd so she started to organize people into chapters.\n\nSoon after, the organization launched its first lawsuit after Fishbein connected a Nevada mother with a lawyer.\n\nThe mother, Gabrielle Clark, had a son in his senior year at Democracy Prep at the Agassi Campus charter school in Las Vegas. In late August, the school launched a series of lessons that asked students to “label and identify” which groups they belonged to based on race, sex, religion, and family income. The teacher leading the lessons then attached the labels of “privileged” and “oppressive” versus “oppressed” to the groups, according to court documents (pdf).\n\nPrivilege was defined as “the inherent belief in the inferiority of the oppressed group,” while “oppression” was defined as “malicious or unjust treatment or exercise of power.”\n\nWhile Clark is a black single mother of five, her son William inherited blond hair, green eyes, and light skin from his deceased father. As it turned out, the young man hit nearly all the “privileged” and “oppressive” checkboxes, being raised in Judeo-Christian values and the only one perceived as white in his class.\n\nThe teacher also instructed the students that they have to “unlearn” and “fight back” against “oppressive” structures supposedly implicit in their family arrangements, religious beliefs, race, and sex, the court documents say.\n\n“All I could think of was, ‘How in the world is my son supposed to function in his life normally with his siblings and with his mother with this idea in the back of his head that he is somehow privileged and oppressing us?’ I couldn’t allow that to be the way my son felt about himself,” she said during a March interview with YouTube channel “The Reason We Learn.”\n\nHer son refused to follow the classes and complete the related assignments and was thus failed, which would lead to a failure to graduate. The family pleaded with the school to allow him to take an alternative class, but the school refused.\n\nIn December, the family filed a suit, alleging the constitutional rights of both William and his mother were violated and that a government-funded school has no business attaching moral judgements to students based on their identities and compel them to participate in the exercise, much less to “unlearn” some of the traditional values they’ve learned at home.\n\nThe school hired a powerful law firm and responded by saying Clark’s son wasn’t really facing any adverse action and was just trying to avoid lessons he didn’t like.\n\nBut two expert witnesses presented by Clark concluded that the class materials were indeed discriminatory.\n\n“The class materials appear to teach critical race theory as both morally superior and factual, rather than as a theory,” concluded Ilana Redstone, associate professor of sociology at the University of Illinois at Urbana Champaign, in her expert opinion (pdf).\n\nSuch school materials that place students in a hierarchy based on immutable identities are “unacceptable and discriminatory,” said Redstone, a specialist in “political polarization, viewpoint diversity, and communication across ideological divides.”\n\n“This material inherently pits students against one another based on their race and sex (among other identities),” wrote the other witness, Erec Smith, associate professor of Rhetoric and Composition at York College of Pennsylvania (pdf).\n\nThe school didn’t respond to a request for comment.\n\nClark is now the chapter head of No Left Turn in Nevada.\n\nThe group helps parents oppose the woke education based on a strategy of four “E”s, Fishbain said. “We’re educating them, then we’re empowering them, then we’re engaging them, and finally, we are going to eradicate this whole thing.”\n\nThe group is providing legal help, offering model curricula, and even model legislation to ban CRT from schools, as some states have already done.\n\nIt’s also helping parents to file Freedom of Information requests to obtain school materials, especially where schools refuse to disclose what’s happening in their classrooms, Fishbain said.\n\n“A lot of our work is actually exposing what’s going on.”\n\nThe next step is to explain to parents what they could do about any woke influence they find in their children’s schools.\n\n“We educate them about the importance of the school board, the role of the school board, and who’s making the decision about the curriculum, who’s making the decision on what books are going to be at your kid’s class, what curriculum, what lesson plan, who’s hiring all those trainers [that proliferate woke ideologies], how much money they are paying for them to come and brainwash your kids and poison their minds and their heart,” Fishbain said.\n\nShe’s compiled a list of nearly 100 “euphemisms” used by these woke proponents aimed at helping people to decode the meaning of the jargon-laden materials used by schools.\n\nThe group is planning to launch a new website in a few weeks that will make available all the various materials and advice as well as testimonials from parents, students, and teachers.\n\nOne of the most crucial points is to help people get together and organize themselves, she said.\n\n“Facing this whole machine alone is really almost impossible.”\n\nRead more at: TheEpochTimes.com and Indoctrination.news", "opengraph": {"title": "National parent group emerges to fight ‘woke’ education, says it harms children", "type": "article", "url": "https://www.libtards.news/2021-06-15-national-parent-group-to-fight-woke-education.html", "site_name": "Libtards News", "description": "Less than a year ago, Elana Fishbein was a happy stay-at-home mother, raising her three boys in a well-off Philadelphia suburb. She’d noticed the school that two of her boys attended would push out some lessons and activities that she considered politically biased or inappropriate, but each time was able to resolve the situation by […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2021/06/Children-Classroom-Learning-School.jpg"}, "tags": ["woke", "education", "parent"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/national-parent-group-emerges-to-fight-woke-education-says-it-harms-children_3850219.html", "https://www.theepochtimes.com/t-woke", "https://www.theepochtimes.com/t-critical-race-theory", "https://noleftturn.us/wp-content/uploads/2021/02/SUPT-Copland.pdf", "https://noleftturn.us/", "https://noleftturn.us/wp-content/uploads/2021/04/Complaint-to-EF.pdf", "https://www.youtube.com/watch?v=Xs46FYD4ZuM", "https://noleftturn.us/wp-content/uploads/2021/05/3.29.21-Expert-Redstone-Report-in-re-Clark-1.pdf", "https://noleftturn.us/wp-content/uploads/2021/05/3.29.21-Smith-Expert-Report-in-re-Clark-Matter-2.pdf", "https://www.theepochtimes.com/t-education", "https://www.theepochtimes.com/states-banning-critical-race-theory-in-government-add-up_3833931.html", "https://www.theepochtimes.com/national-parent-group-emerges-to-fight-woke-education-says-it-harms-children_3850219.html", "http://Indoctrination.news"], "authors": [], "publish_date": null}