{"result_id": "189002", "URL": "https://libtards.news/2023-02-07-pete-santili-mark-houck-case-government-overreach.html", "timestamp": "2023-04-25 16:15:51 CEST+0200", "meta": {"description": "Pete Santili of “The Pete Santili Show” pointed out that the case against now-acquitted pro-life activist Mark Houck was a perfect example of the federal government’s overreach against Christian conservatives. During the podcast’s Feb. 2 episode, which had Houck himself as a guest, Santili mentioned the recent exoneration of the activist after being accused of […]", "lang": "en", "keywords": "acquittal,big government,Department of Justice,FACE Act,fascism,Federal Bureau of Investigation,federal government,Mark Houck,overreach,Pete Santili,Planned Parenthood,pro-life,The Pete Santili Show,Tyranny,warrantless arrest", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://libtards.news/2023-02-07-pete-santili-mark-houck-case-government-overreach.html", "encoding": "UTF-8"}, "image": null, "domain": "libtards.news", "title": "Pete Santili: Mark Houck case a clear example of government overreach against Christian conservatives", "cleaned_text": "Pete Santili: Mark Houck case a clear example of government overreach against Christian conservatives\n\nPete Santili of “The Pete Santili Show” pointed out that the case against now-acquitted pro-life activist Mark Houck was a perfect example of the federal government’s overreach against Christian conservatives.\n\nDuring the podcast’s Feb. 2 episode, which had Houck himself as a guest, Santili mentioned the recent exoneration of the activist after being accused of violating the Freedom of Access to Clinic Entrances (FACE) Act. Houck allegedly “assaulted” and “forcefully shoved” 72-year-old volunteer Bruce Love at a Planned Parenthood in the city of Philadelphia back in October 2021.\n\nThe 48-year-old father was subsequently arrested by agents of the Federal Bureau of Investigation (FBI) during a raid on his home in September of last year. However, Fox News reported that a jury acquitted him of charges relating to the violation of the FACE Act.\n\nAccording to Santili, the Department of Justice under President Joe Biden has literally tried to destroy Houck’s life – but he stood firm.\n\nHouck recounted to Santili what happened during the Sept. 23, 2022 raid on their home and his subsequent arrest. At around 6:45 a.m. on that day, no less than 20 federal agents and Pennsylvania State Troopers surrounded the pro-life activist’s home. (Related: Journalist calls FBI raid on pro-life activist ‘act of terrorism’ as politicized Justice Dept. unleashed to target conservatives.)\n\nHouck mentioned that on the Friday morning of September 23, 2022, at 6:45 a.m. around 20 plus federal agents and Pennsylvania State Troopers came to his home to arrest him.\n\n“What I saw was a complete circus. I saw 15 marked and unmarked units with five federal agents, long guns pointing at me; heavily armored vests; ballistic shields and helmets; and a battering ram ready to come into my home if I didn’t open the door.”\n\nAccording to Houck, the government intended to humiliate him and instill fear in him, his family and the entirety of pro-life America.\n\nThe pro-life activist also shared to Santili that his wife came down and asked the agents if they had a warrant for his arrest, to which the agents replied that they will take Houck into custody with or without a warrant.\n\nHouck was charged with two counts of violating the FACE Act – both felonies. If found guilty, Houck would have faced up to three years of supervised probation and a $350,000 fine. A conviction would yield 11 years’ jail time, he said.\n\nThe pro-life activist also mentioned an interesting detail about his jury trial, with its jury selection happening last Jan. 24. Many of the potential jurors were supporters of Planned Parenthood and had used its services. Even though the selection process was tough, he and his legal team picked the best 12 for the trial that began on Jan. 25.\n\nSantili ultimately commented that the federal government’s overreach needs to stop.\n\n“”It needs to stop this kidnapping of people from their 10 square mile jurisdiction in D.C.,” he said. “These federal agents – we’re talking about government overreach coming into jurisdictions – this stuff that is happening is yet another example where they come in from a foreign jurisdiction and it is foreign to the sovereign state of Pennsylvania. That’s not a radical concept. This stuff needs to stop because it’s done for political and ideological reasons.”\n\nWatch Pete Santili and Mark Houck talk about the latter’s acquittal on “The Pete Santili Show” below.\n\nThis video is from The Resistance 1776 channel on Brighteon.com.\n\nSheriff Mack wants law enforcement officers to lead the way in helping America wake up and resist government overreach – Brighteon.TV.\n\nCorrupt Biden Justice Department, FBI raid homes of Project Veritas journalists for the “crime” of doing their jobs and exposing malfeasance.\n\nThe Zelenko Report: DOJ and FBI don’t have any credibility, argues Kevin Jenkins – Brighteon.TV.\n\nFDA, FBI raid natural cancer treatment clinic in Tulsa without due cause; force patients to leave without medicine needed for survival.", "opengraph": {"title": "Pete Santili: Mark Houck case a clear example of government overreach against Christian conservatives", "type": "article", "url": "https://www.libtards.news/2023-02-07-pete-santili-mark-houck-case-government-overreach.html", "site_name": "Libtards News", "description": "Pete Santili of “The Pete Santili Show” pointed out that the case against now-acquitted pro-life activist Mark Houck was a perfect example of the federal government’s overreach against Christian conservatives. During the podcast’s Feb. 2 episode, which had Houck himself as a guest, Santili mentioned the recent exoneration of the activist after being accused of […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2023/02/Military-Police-Raid-Weapons.jpg"}, "tags": ["Planned Parenthood", "big government", "Department of Justice", "fascism", "overreach", "pro-life", "Pete Santili", "warrantless arrest", "federal government", "FACE Act", "Mark Houck", "The Pete Santili Show", "acquittal", "Federal Bureau of Investigation", "Tyranny"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/fba99e45-b9fb-4118-a2d0-39d95bee433f", "http://www.foxnews.com/us/pennsylvania-jury-acquits-pro-life-activist-mark-houck-charges-obstructing-abortion-clinic-access", "https://naturalnews.com/2022-09-29-fbi-raid-on-pro-life-activist-act-of-terrorism.html", "https://biggovernment.news", "http://www.brighteon.com/fba99e45-b9fb-4118-a2d0-39d95bee433f", "https://www.brighteon.com/channels/americanpatriot", "https://naturalnews.com/2021-11-03-sheriff-mack-resists-government-overreach.html", "https://naturalnews.com/2021-11-06-corrupt-biden-justice-department-fbi-raid-homes-of-project-veritas-journalists.html", "https://naturalnews.com/2022-08-23-kevin-jenkins-doj-fbi-dont-have-credibility.html", "https://naturalnews.com/040225_Camelot_Cancer_Care_FBI_raid.html", "https://biggovernment.news/2023-02-01-connecticut-police-arrest-parents-letting-kids-walk.html", "https://www.brighteon.com/fba99e45-b9fb-4118-a2d0-39d95bee433f", "http://www.foxnews.com/us/pennsylvania-jury-acquits-pro-life-activist-mark-houck-charges-obstructing-abortion-clinic-access", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2023-02-07-pete-santili-mark-houck-case-government-overreach.html&linkname=Pete%20Santili%3A%20Mark%20Houck%20case%20a%20clear%20example%20of%20government%20overreach%20against%20Christian%20conservatives", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}