{"result_id": "189011", "URL": "https://libtards.news/2022-08-08-democrats-irs-billions-to-harass-hardworking-americans.html", "timestamp": "2023-04-25 16:15:57 CEST+0200", "meta": {"description": "The Democratic Party’s latest economic package, which it is working furiously to push through Congress before the August break, will include an additional nearly $80 billion for the Internal Revenue Service (IRS) for better taxation enforcement over the next 10 years. According to a deal worked out between Senate Majority Leader Chuck Schumer and moderate West Virginia […]", "lang": "en", "keywords": "big government,conspiracy,corruption,deception,democrats,insanity,IRS,left cult,Liberal Mob,Libtards,lunatics,Republicans,tax audit,Taxes,taxpayers,traitors", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://libtards.news/2022-08-08-democrats-irs-billions-to-harass-hardworking-americans.html", "encoding": "UTF-8"}, "image": null, "domain": "libtards.news", "title": "Democrats to give the IRS $80 billion to harass hardworking Americans with more audits and increased scrutiny", "cleaned_text": "Democrats to give the IRS $80 billion to harass hardworking Americans with more audits and increased scrutiny\n\nThe Democratic Party’s latest economic package, which it is working furiously to push through Congress before the August break, will include an additional nearly $80 billion for the Internal Revenue Service (IRS) for better taxation enforcement over the next 10 years.\n\nAccording to a deal worked out between Senate Majority Leader Chuck Schumer and moderate West Virginia Sen. Joe Manchin, in return for not raising taxes on hard-working Americans, the party will provide the IRS with $79.6 billion over the next 10 years, increasing the agency’s yearly budget by about a third. This proposal reportedly also has the backing of centrist Democrat Sen. Kyrsten Sinema of Arizona.\n\nThe injection of billions of taxpayer dollars into the IRS is expected to go toward hiring 87,000 new IRS agents, which will double the agency’s size. The agency is also expected to use the money to modernize its technology, which will help it better force hardworking Americans to hand over their money. (Related: The Sheriff Mack Show: Joe Banister tells Sheriff Richard Mack that IRS wants to increasingly tax hard-working Americans – Brighteon.TV.)\n\nThe Democrats argue that IRS investment is necessary to ensure that corporations and wealthy Americans fully pay what they owe in taxes.\n\n“This will give us the chance to raise the revenue from wealthy tax cheats who are getting out of paying what they owe,” said Senate Finance Committee Chairman Ron Wyden of Oregon.\n\nAccording to the non-partisan Congressional Budget Office (CBO), a $79.6 billion investment into the IRS will yield the government an additional $204 billion in tax collection over the next decade. internal figures at the Department of the Treasury project that what the IRS could take from Americans could be more than $400 billion.\n\nFormer Treasury Secretary Lawrence Summers, who served under former President Bill Clinton, claims that what the IRS could collect could be even higher.\n\n“If this program is really implemented, instead of the $200 billion that the CBO estimates, I think the benefit could be $500 billion or even, possibly, if they do a great job, $1 trillion,” he said.\n\nRepublicans: IRS investment will go toward increased scrutiny of hardworking Americans\n\nRepublicans have pointed out that this money will just go toward increased scrutiny of small business owners in the form of more audits.\n\n“In a time of inflation, Democrats want to spend $80 billion to roughly double the size of the IRS so they can take more money out of the American people through harassment and audits, using taxpayer money to make taxpayers’ lives worse,” said Senate Minority Leader Mitch McConnell of Kentucky on the Senate floor.\n\n“I think it’s terrible for them to want to weaponize the Internal Revenue Service, to supersize it in an effort to go after, you know, families and farmers and small businesses and try to raise more money,” commented Republican Sen. John Barrasso of Wyoming. “It’s basically a shakedown operation.”\n\nSome Republicans believe the IRS does need more funding, but that this funding should be directed to better taxpayer customer services and technology, rather than bring greater scrutiny to taxpayers.\n\n“First, take care of good, honest taxpayers just trying to get basic assistance out of the IRS,” said Sen. Steve Daines of Montana.\n\nThe Senate is expected to begin voting on the legislation as early as Aug. 6 and it could reach the House of Representatives before the end of the weekend, where it would still need to be voted upon before it can go to President Joe Biden’s desk to become law.\n\nRead more stories about government overreach at BigGovernment.news.\n\nWatch this clip from Fox News as Tucker Carlson discusses the possibility of the IRS militarizing itself by stockpiling ammunition.\n\nThis video is from the Son of the Republic channel on Brighteon.com.\n\nIRS buying up massive amounts of ammunition while Biden regime tries to shut down CIVILIAN ammo supply chain,\n\nIRS colluded with Clinton Foundation to cheat taxpayers out of $2.5 billion.\n\nThe IRS actually works for Satan: Tax-exempt status granted to Satanic orgs, but denied to Christian groups.", "opengraph": {"title": "Democrats to give the IRS $80 billion to harass hardworking Americans with more audits and increased scrutiny", "type": "article", "url": "https://www.libtards.news/2022-08-08-democrats-irs-billions-to-harass-hardworking-americans.html", "site_name": "Libtards News", "description": "The Democratic Party’s latest economic package, which it is working furiously to push through Congress before the August break, will include an additional nearly $80 billion for the Internal Revenue Service (IRS) for better taxation enforcement over the next 10 years. According to a deal worked out between Senate Majority Leader Chuck Schumer and moderate West Virginia […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2022/08/IRS-Building-Revenue-Taxes-Money-1.jpg"}, "tags": ["Liberal Mob", "conspiracy", "big government", "Taxes", "Libtards", "left cult", "insanity", "deception", "lunatics", "tax audit", "Republicans", "IRS", "democrats", "traitors", "corruption", "taxpayers"], "tweets": [], "movies": [], "links": ["https://apnews.com/article/joe-manchin-congress-internal-revenue-service-government-and-politics-dd2e6eaeb914eea553615e231332f3fb", "https://www.newsnationnow.com/us-news/inflation-reduction-act-irs-agents/", "https://www.bloomberg.com/news/articles/2022-08-05/wealthy-americans-escape-tax-hikes-but-will-face-beefed-up-irs?sref=jB82HHlm", "https://www.irs.gov/statistics/irs-budget-and-workforce", "https://naturalnews.com/2022-08-01-joe-banister-irs-wants-tax-americans-further.html", "http://canceldemocrats.news", "https://biggovernment.news/", "https://www.brighteon.com/b9785c03-af72-41da-a9fc-40fabf0d1104", "https://www.brighteon.com/channels/ssp67047", "https://biggovernment.news/2022-06-20-irs-buying-ammunition-biden-destroying-civilian-supplies.html", "https://chaos.news/2022-05-16-tax-pros-express-horror-irs-destroys-data-30-million-filers.html", "https://corruption.news/2020-10-13-irs-colluded-clinton-foundation-cheat-taxpayers-out-billions.html", "https://satanism.news/2019-05-01-irs-actually-works-for-satan-tax-exempt-status.html", "https://apnews.com/article/joe-manchin-congress-internal-revenue-service-government-and-politics-dd2e6eaeb914eea553615e231332f3fb", "https://www.newsnationnow.com/us-news/inflation-reduction-act-irs-agents/", "https://www.bloomberg.com/news/articles/2022-08-05/wealthy-americans-escape-tax-hikes-but-will-face-beefed-up-irs?sref=jB82HHlm", "https://www.irs.gov/statistics/irs-budget-and-workforce", "https://www.brighteon.com/b9785c03-af72-41da-a9fc-40fabf0d1104", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2022-08-08-democrats-irs-billions-to-harass-hardworking-americans.html&linkname=Democrats%20to%20give%20the%20IRS%20%2480%20billion%20to%20harass%20hardworking%20Americans%20with%20more%20audits%20and%20increased%20scrutiny", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}