{"result_id": "189003", "URL": "https://libtards.news/2022-07-11-biden-signs-order-promoting-abortion-on-demand.html", "timestamp": "2023-04-25 16:15:52 CEST+0200", "meta": {"description": "Finding a way around the Supreme Court’s decision to upend Roe v. Wade, President Joe Biden just signed an executive order “protecting access to reproductive health services” on July 8. “Two weeks ago, the Supreme Court issued a decision that overturned Roe v. Wade and eliminated a woman’s Constitutional right to choose. This decision expressly […]", "lang": "en", "keywords": "abortion,abortion on demand,badhealth,big government,culture wars,domestic terrorism,extremism,infanticide,insanity,Joe Biden,left cult,Liberal Mob,Libtards,pro-life,propaganda,Roe v. Wade,social justice,traitors,violence,White House,women's health", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://libtards.news/2022-07-11-biden-signs-order-promoting-abortion-on-demand.html", "encoding": "UTF-8"}, "image": null, "domain": "libtards.news", "title": "Biden signs executive order promoting abortion on demand following Roe v. Wade overturn", "cleaned_text": "Finding a way around the Supreme Court’s decision to upend Roe v. Wade, President Joe Biden just signed an executive order “protecting access to reproductive health services” on July 8.\n\n“Two weeks ago, the Supreme Court issued a decision that overturned Roe v. Wade and eliminated a woman’s Constitutional right to choose. This decision expressly took away a right from the American people that it had recognized for nearly 50 years, a woman’s right to make her own reproductive health care decisions, free from government interference,” the White House stated in a fact sheet.\n\nThe said executive order will support abortion on demand until the moment of birth.\n\nOn Friday morning, July 8, the fact sheet was released directing the Department of Health and Human Services (HHS) to protect and expand access to “medication abortion.” It also ordered the Attorney General and the White House Counsel to “convene private pro bono attorneys, bar associations and public interest organizations” to provide legal counsel for women seeking abortions and doctors committing abortions.\n\nThe Biden administration promised to fight any “attack by a state or local official who attempts to interfere with women exercising this right.”\n\nHHS Secretary Xavier Becerra reportedly said the administration has “no magic bullet” that can restore access to abortion, as the executive order seemed vague on how the president hopes to accomplish those goals.\n\nAnti-abortion advocates denounced this massive move to disrespect the high court’s decision and the sanctity of life.\n\n“President Biden has once again caved to the extreme abortion lobby, determined to put the full weight of the federal government behind promoting abortion. Democrats will stop at nothing to promote their agenda of abortion on demand, up until the moment of birth, paid for by the taxpayers,” Susan B. Anthony (SAB) Pro-Life America President Marjorie Dannenfelser said. (Related: Even as threats continue to rise globally, Biden’s Pentagon gets its priorities in order: Protecting access to abortion.)\n\nPro-life activist Evangelist Alveda C. King, the niece of civil rights legend Martin Luther King Jr., said the president and the liberals in Congress are focused on expanding the death care known as abortion. We must pray and we must act to save our unborn, she tweeted.\n\n“Abortion is not a ‘reproductive healthcare service,'” Ryan Anderson, president of the Ethics and Public Policy Center, stated in his social media post. He pointed out that reproduction has already occurred and there are two patients who need “healthcare services,” if you are contemplating abortion.\n\nDannenfelser said their pro-life organization is “committed to exposing Democrats’ abortion extremism to voters across key battleground states so this extreme agenda can be soundly rejected at the ballot box this November.”\n\nPro-abortion supporters would do anything to get what they want\n\nBiden signed the executive order designed to ensure access to abortion medication and emergency contraception while preparing for the legal fights to come. But even before this, violent and chaotic acts have been performed that may have added to the pressure on Biden to do something.\n\nLeftists would do just about anything as they were disappointed with what they perceived as inaction to protect abortion following the overturning of the landmark decision. Pro-abortion groups continue to wreak havoc on pro-life sites.\n\nFire broke out at a Christian pregnancy clinic late last month in Colorado. There were chilling messages that were spray painted onto the walls and ground outside: “If abortions aren’t safe, neither are you” and “Bans off our bodies.”\n\nAuthorities believe the fire was set deliberately. The center aims to educate women on pregnancy and no abortion procedures are being carried out in this clinic.\n\nVandals also struck at the Montpelier state capitol. Windows were broken and a message was painted outside the main door: “If abortions aren’t safe, you’re not either.”\n\nPolice said seven windows worth $25,000 were smashed and damaged.\n\nPro-abortion protestors also attempted an insurrection at the Arizona State Senate. Extremist demonstrators made their way to the entrance of the Senate building and began forcibly entering by breaking windows and pushing down doors. Law enforcement monitoring this situation called for backup and was able to disperse the crowd with tear gas before entry was made.\n\nWatch the below video that talks about current issues, including Biden’s executive order on protecting access to abortion.\n\nThis video is from the Terral03.com channel on Brighteon.com.\n\nHouse Republicans call on Biden’s AWOL Homeland Security to investigate radical “Jane’s Revenge” pro-abortion group as domestic terrorists.\n\nABORTION LUNACY: Elizabeth Warren called for abortion TENTS at national parks to butcher babies in red states.\n\nBiden promises that your tax dollars will be used by HHS to transport women across state lines for baby killing… “abortion Uber.”\n\nTo the horror of Leftists, Biden just admitted that abortion involves the death of a “child.”", "opengraph": {"title": "Biden signs executive order promoting abortion on demand following Roe v. Wade overturn", "type": "article", "url": "https://www.libtards.news/2022-07-11-biden-signs-order-promoting-abortion-on-demand.html", "site_name": "Libtards News", "description": "Finding a way around the Supreme Court’s decision to upend Roe v. Wade, President Joe Biden just signed an executive order “protecting access to reproductive health services” on July 8. “Two weeks ago, the Supreme Court issued a decision that overturned Roe v. Wade and eliminated a woman’s Constitutional right to choose. This decision expressly […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2022/07/Abortion_bar.jpg"}, "tags": ["big government", "infanticide", "left cult", "White House", "women's health", "culture wars", "extremism", "Roe v. Wade", "propaganda", "social justice", "Liberal Mob", "Joe Biden", "abortion on demand", "domestic terrorism", "pro-life", "insanity", "abortion", "Libtards", "violence", "traitors"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/breaking-biden-to-sign-executive-order-promoting-abortion-on-demand/", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/07/08/fact-sheet-president-biden-to-sign-executive-order-protecting-access-to-reproductive-health-care-services/", "https://www.nytimes.com/2022/07/08/us/politics/biden-abortion-executive-order.html", "http://abortions.news", "https://naturalnews.com/2022-07-06-bidens-pentagon-prioritizes-protecting-access-to-abortion.html", "https://twitter.com/AlvedaCKing/status/1545397484515631104", "https://archive.vn/qeYmV", "https://www.wcax.com/2022/06/25/vt-state-house-vandalized-following-scotus-abortion-ruling/", "https://wendyrogers.org/planned-parenthood-insurrection/", "https://www.brighteon.com/5cbc7daa-21e1-4733-8c23-35a3192fa0b3", "https://www.brighteon.com/channels/terral03", "https://naturalnews.com/2022-07-03-republicans-bidens-awol-homeland-security-investigate-radical-proabortion-group-domestic-terrorists.html", "https://evil.news/2022-07-04-elizabeth-warren-wants-abortion-tents-national-parks.html", "https://abortions.news/2022-06-30-biden-taxes-hhs-transport-women-baby-killing.html", "https://joebiden.news/2022-05-05-biden-admits-abortion-involves-death-child.html", "https://www.lifesitenews.com/news/breaking-biden-to-sign-executive-order-promoting-abortion-on-demand/", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/07/08/fact-sheet-president-biden-to-sign-executive-order-protecting-access-to-reproductive-health-care-services/", "https://www.nytimes.com/2022/07/08/us/politics/biden-abortion-executive-order.html", "https://twitter.com/AlvedaCKing/status/1545397484515631104", "https://archive.vn/qeYmV", "https://www.wcax.com/2022/06/25/vt-state-house-vandalized-following-scotus-abortion-ruling/", "https://wendyrogers.org/planned-parenthood-insurrection/", "https://www.brighteon.com/5cbc7daa-21e1-4733-8c23-35a3192fa0b3", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2022-07-11-biden-signs-order-promoting-abortion-on-demand.html&linkname=Biden%20signs%20executive%20order%20promoting%20abortion%20on%20demand%20following%20Roe%20v.%20Wade%20overturn", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}