{"result_id": "189005", "URL": "https://www.libtards.news/2022-05-07-branch-covidians-an-apocalyptic-medical-extremist-group-of-tyrants.html", "timestamp": "2023-04-25 16:15:53 CEST+0200", "meta": {"description": "Science is no longer evidence-based when it comes to medicine in America, it’s a new religion that’s all faith-based. Do you “believe” in vaccines? Do you “believe” that wearing face masks all day and night works to prevent the spread of COVID? If not, you will be persecuted for not believing in the new religion […]", "lang": "en", "keywords": "Branch Covidians,branch davidians,CDC,conspiracy theories,COVID,covid cult,covidian,covidian cult,cult,death cult,insanity,lunatics,Mental illness,pandemic,plague,psycho,Texas,vaccine cult,vaccine damage,vaccine death,vaccine wars,vaccines,waco", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.libtards.news/2022-05-07-branch-covidians-an-apocalyptic-medical-extremist-group-of-tyrants.html", "encoding": "UTF-8"}, "image": null, "domain": "www.libtards.news", "title": "Meet the BRANCH COVIDIANS: An apocalyptic medical-extremist group of tyrants whose avid followers participate in genocide by vaccination", "cleaned_text": "Meet the BRANCH COVIDIANS: An apocalyptic medical-extremist group of tyrants whose avid followers participate in genocide by vaccination\n\nScience is no longer evidence-based when it comes to medicine in America, it’s a new religion that’s all faith-based. Do you “believe” in vaccines? Do you “believe” that wearing face masks all day and night works to prevent the spread of COVID? If not, you will be persecuted for not believing in the new religion of faith-based science. If you buck the system, your “conspiracy theories” will land you strung up on a cross (bankrupted and force-injected with prions), or burnt at the stake like a witch (put on deadly Remdesivir and a choke-you-to-death ventilator at the hospital).\n\nMeet the Branch Covidians, an apocalyptic medical-extremist group of scientists, doctors, patients, and propagandists who have one end goal in mind, coerce the rest of the world to “practice” their religion, or die.\n\nThe Branch Covidian Cult includes everyone who makes vaccines, funds them, pushes them, and takes them. It’s a religious new world order, and their fake science and ministry of truth propaganda machine has brainwashed over 4 billion worshippers, and in just the first two years of “membership.” It’s a doomsday war happening for control of your health and psyche, and if you don’t resist or fight back, you automatically lose.\n\nThe Branch Davidians apocalyptic religious movement (cult) was founded in the 1950s, the same time as the fake-science-religion of vaccines\n\nRemember the “Seventh-Day Adventists?” The Feds burned 76 of the 85 of their “offshoots” alive, including some children (the ones ATF agents couldn’t coax out), for not coming out of their compound and surrendering. It happened in Waco, Texas, where the “Mount Carmel Center” was the home of the Branch Davidians. The leader? David Koresh – the self-proclaimed “Final Prophet” (think Fauci here).\n\nKoresh taught his followers about the Seven Seals and that the end of the world was “imminent.” This is much like the CDC right now claiming that if we don’t all get experimental vaccines, the whole world will DIE from COVID-19 (which has a .01 percentage kill rate and mainly among the immune compromised). Vaccines, ever since the Polio vaccine, have caused more harm than help, that is, if you REALLY look at the evidence-based science behind them.\n\nIn other words, the “science” of vaccines is a religion that you must believe in, without any evidence-based proof of efficacy. It’s faith-based medicine and the “end of the world” is hinged on everyone getting flu shots that cause blood clots and myocarditis.\n\nThe Branch Covidian Cult has over 4.6 billion members worldwide and growing\n\nMost Branch Covidian Cult members (vaccine pushers and takers) wholly believe that all “anti-vaxxers” are crazed lunatics (heretics) who don’t value human life and are walking around KILLING people because they “do NOT believe in” getting toxic gene therapy injections (“vaccines”) or wearing a useless, bacteria-laden mask 24/7/365. The mask has become a cult member signature cloth, and all members are instructed to give dirty looks to the mask-less and declare them guilty of blasphemy and sacrilegious acts (report them to DHS) for opposing the religious belief that masks help save the world from the Black Plague of 2022 (the Fauci Flu).\n\nThe Branch Covidian Cult is chock full of vaccine fanatics who are suffering from mercury poisoning, also called Mad Hatter Syndrome, from all the “thimerosal” in flu shots over the years, and now from Spike Protein Syndrome from the nanoparticle, clot shot injections. Are the booster shots the poisonous “magic kool-aid” of the next Jonestown Massacre? It’s genocide by vaccination, and the leading tyrants have all the “church” attendees worshipping at the inoculation altar.\n\nHow many more members will the Branch Covidians recruit for the “final siege” before the whole herd goes “up in flames?” The end of the world looks like it’s really coming soon, but it’s really just coming for the Branch Covidians, little do they know. Bookmark Vaccines.news to your favorite independent websites for updates on experimental COVID “vaccines” that cause blood clots and other horrific side effects.", "opengraph": {"title": "Meet the BRANCH COVIDIANS: An apocalyptic medical-extremist group of tyrants whose avid followers participate in genocide by vaccination", "type": "article", "url": "https://www.libtards.news/2022-05-07-branch-covidians-an-apocalyptic-medical-extremist-group-of-tyrants.html", "site_name": "Libtards News", "description": "Science is no longer evidence-based when it comes to medicine in America, it’s a new religion that’s all faith-based. Do you “believe” in vaccines? Do you “believe” that wearing face masks all day and night works to prevent the spread of COVID? If not, you will be persecuted for not believing in the new religion […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2022/05/Satan-Demon-Hell.jpg"}, "tags": ["pandemic", "covidian cult", "COVID", "lunatics", "waco", "CDC", "psycho", "covid cult", "Mental illness", "plague", "Texas", "vaccine cult", "death cult", "covidian", "vaccine wars", "cult", "Branch Covidians", "insanity", "conspiracy theories", "vaccines", "vaccine death", "branch davidians", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/050543_conspiracy_theories_mainstream_media_truth_news.html", "https://naturalnews.com/2022-03-24-fauci-knows-remdesivir-killing-people-says-ardis.html", "https://naturalnews.com/2021-10-08-whistleblower-medical-device-expert-covid-ventilators-deadly.html", "https://off-guardian.org/2022/01/18/the-last-days-of-the-covidian-cult/", "https://thebluestateconservative.com/2022/04/26/from-covid-to-globalism-to-russiagate-the-lefts-war-on-americas-psyche/", "http://www.truthwiki.org/polio-a-true-investigative-history/", "https://naturalnews.com/2022-02-09-why-no-mercury-in-covid-vaccines-if-so-effective.html", "https://naturalnews.com/2021-09-16-webmd-covid-vaccine-complaint-board-horrific-critical-injuries.html", "https://adst.org/2012/11/the-jonestown-massacre/?gclid=Cj0KCQjwyMiTBhDKARIsAAJ-9Vsvn5RDOM0Tau5NSz3K6eyb6WCC_u6p30qmHpKPDAzx9B8UHqokJ7QaAmW_EALw_wcB", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.thegatewaypundit.com/2022/04/fda-experts-meet-today-strategize-new-plan-boosters/", "https://www.naturalnews.com/2022-04-29-new-dhs-disinformation-unit-is-designed-to-spread-the-governments-disinformation-while-criminalizing-truth.html", "https://off-guardian.org/2022/01/18/the-last-days-of-the-covidian-cult/", "https://thebluestateconservative.com/2022/04/26/from-covid-to-globalism-to-russiagate-the-lefts-war-on-americas-psyche/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2022-05-07-branch-covidians-an-apocalyptic-medical-extremist-group-of-tyrants.html&linkname=Meet%20the%20BRANCH%20COVIDIANS%3A%20An%20apocalyptic%20medical-extremist%20group%20of%20tyrants%20whose%20avid%20followers%20participate%20in%20genocide%20by%20vaccination", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}