{"result_id": "189015", "URL": "https://libtards.news/2023-02-08-satanic-temple-free-abortion-clinic-new-mexico.html", "timestamp": "2023-04-25 16:15:59 CEST+0200", "meta": {"description": "The Satanic Temple will open a free abortion clinic in New Mexico that will offer prescriptions for drugs that cause abortion. The new “reproductive health clinic” will be called “The Samuel Alito’s Mom’s Satanic Abortion Clinic.” The group is directing its ire at Supreme Court Justice Alito for being the primary author of the court’s […]", "lang": "en", "keywords": "abortifacients,abortion,abortion drugs,badhealth,badmedicine,demonic,evil,First Amendment,freedom of religion,infanticide,New Mexico,religion,Ruth Bader Ginsburg,Samuel Alito,Satanic Temple,satanism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://libtards.news/2023-02-08-satanic-temple-free-abortion-clinic-new-mexico.html", "encoding": "UTF-8"}, "image": null, "domain": "libtards.news", "title": "Satanic Temple to open free abortion clinic in New Mexico", "cleaned_text": "Satanic Temple to open free abortion clinic in New Mexico\n\nThe Satanic Temple will open a free abortion clinic in New Mexico that will offer prescriptions for drugs that cause abortion. The new “reproductive health clinic” will be called “The Samuel Alito’s Mom’s Satanic Abortion Clinic.”\n\nThe group is directing its ire at Supreme Court Justice Alito for being the primary author of the court’s majority opinion that overturned Roe v. Wade, which made abortion a federally guaranteed right in the United States for nearly 50 years. (Related: Biden’s Health Department mulls declaring public health emergency on abortion, claiming it’s an emergency to NOT kill babies.)\n\n“In 1950, Samuel Alito’s mother did not have options and look what happened,” said Malcolm Jarry, co-founder of the Satanic Temple, in a press release. “The clinic’s name serves to remind people just how important it is to have the right to control one’s body and the potential ramifications of losing that right.”\n\nAccording to the organization, anybody in New Mexico will be able to access online medical services, including confidential telehealth screenings and virtual appointments. These will result in prescriptions being sent “to the clinic’s pharmacy partner, who will mail the [abortion] medications in a discreet package.”\n\nThe consultations will be free, provided that the women agree to conduct the “Religious Abortion Ritual.” The fees for the anonymous pharmacy are expected to cost around $90.\n\nTST Health, the Satanic Temple’s “religious medical services arm,” said it will have licensed medical staff available for patient questions and has a 24-hour on-call patient hotline.\n\n“Regardless of where you live, if you are in the state of New Mexico during your video consultation and when you perform your abortion ritual, you will have abided by the law,” the Satanic Temple said on its “frequently asked questions” page.\n\nSatanic Temple claims abortions are essential to its religious practices and protected by freedom of religion laws\n\nIn New Mexico, abortion is legal up to the point of birth, except in certain municipalities like the small cities of Clovis and Hobbs that have passed local ordinances restricting abortion. The Satanic Temple’s abortion clinic is seen as an attempt to counter any restrictions on abortion in the state.\n\nThe Satanic Temple has previously stated that, under the First Amendment, as well as federal and state laws protecting freedom of religion, the organization’s “abortion ritual” is an essential part of its religious practice and is therefore protected against any restrictions and bans on abortion.\n\nThe Internal Revenue Service has officially recognized the Satanic Temple as a religious organization, granting it nonprofit tax-exempt status.\n\n“[The Satanic Temple] is proud to expand reproductive options for our members. This is just the beginning,” said Erin Helian, executive director of campaign organizations for the group. “We will remain steadfast as we continue the fight to uphold reproductive justice in the United States.”\n\n“This should be a wake-up call for all New Mexicans, but especially Christians and all those who voted for pro-abortion Democrats who have made New Mexico a welcoming state for abortion – and now for ‘ritual abortion,'” said Elisa Martinez, founder and executive director of the New Mexico Alliance for Life. “Again, it’s just another example of an out-of-state operation finding safe haven here in New Mexico’s extreme abortion-to-full-term climate.”\n\nEthel Maharg, executive director of Right to Life in New Mexico said the Satanic Temple’s plan is “just an egregious thing.”\n\n“They’re trying to make it a religious right so that they can use, I guess, the First Amendment right to practice – but that’s different, freedom of speech and religion,” she said.\n\nLearn more about abortion in the U.S. at Abortions.news.\n\nWatch this report from EWTN‘s “News Nightly” about the Satanic Temple’s attempts to open abortion clinics to provide “religious abortion” and “abortion ritual” care.\n\nThis video is from the Thrive Time Show channel on Brighteon.com.\n\nJudicial Watch sues HHS for ignoring FOIA request to reveal info about government use of human fetal tissue.\n\nWalgreens, CVS to sell ABORTION PILLS in states where abortion is still legal.\n\n$1.7 trillion omnibus spending bill contains “sinister” depopulation provisions: $575M to be spent on abortions in areas with high population growth.", "opengraph": {"title": "Satanic Temple to open free abortion clinic in New Mexico", "type": "article", "url": "https://www.libtards.news/2023-02-08-satanic-temple-free-abortion-clinic-new-mexico.html", "site_name": "Libtards News", "description": "The Satanic Temple will open a free abortion clinic in New Mexico that will offer prescriptions for drugs that cause abortion. The new “reproductive health clinic” will be called “The Samuel Alito’s Mom’s Satanic Abortion Clinic.” The group is directing its ire at Supreme Court Justice Alito for being the primary author of the court’s […]", "image": "https://www.libtards.news/wp-content/uploads/sites/166/2023/02/satan_statue.jpg"}, "tags": ["demonic", "Ruth Bader Ginsburg", "evil", "New Mexico", "infanticide", "religion", "Samuel Alito", "satanism", "freedom of religion", "abortion drugs", "First Amendment", "Satanic Temple", "abortion", "abortifacients"], "tweets": [], "movies": [], "links": ["https://newspunch.com/satanic-temple-announce-grand-opening-of-free-abortion-clinic-in-new-mexico-to-perform-rituals/", "https://www.abqjournal.com/2570996/satanic-temple-samuel-alito-mom-abortion-clinic-to-offer-abortion-services-in-new-mexico.html", "https://www.naturalnews.com/2023-02-02-biden-hhs-public-health-emergency-on-abortion.html", "https://www.catholicnewsagency.com/news/253547/the-satanic-temple-to-open-free-abortion-clinic-in-new-mexico", "https://firstamendment.news", "https://infanticide.news/", "https://www.abortions.news/", "https://www.brighteon.com/c1cc3663-a1e4-4e90-a233-dc17578abeef", "https://www.brighteon.com/channels/thrivetimeshow", "https://www.brighteon.com/channels/thrivetimeshow", "https://www.abortions.news/2023-02-05-pro-abortion-statue-late-justice-ruth-bader-ginsburg-texas.html", "https://www.naturalnews.com/2023-02-03-hhs-sued-ignoring-foia-human-fetal-tissue.html", "https://satanism.news/2023-02-03-satanic-temple-opens-abortion-clinic.html", "https://naturalnews.com/2023-01-06-walgreens-cvs-to-sell-abortion-pills.html", "https://infanticide.news/2022-12-27-omnibus-spending-bill-contains-sinister-depopulation-provisions.html", "https://newspunch.com/satanic-temple-announce-grand-opening-of-free-abortion-clinic-in-new-mexico-to-perform-rituals/", "https://www.abqjournal.com/2570996/satanic-temple-samuel-alito-mom-abortion-clinic-to-offer-abortion-services-in-new-mexico.html", "https://www.catholicnewsagency.com/news/253547/the-satanic-temple-to-open-free-abortion-clinic-in-new-mexico", "https://www.brighteon.com/c1cc3663-a1e4-4e90-a233-dc17578abeef", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Flibtardsnews%2F2023-02-08-satanic-temple-free-abortion-clinic-new-mexico.html&linkname=Satanic%20Temple%20to%20open%20free%20abortion%20clinic%20in%20New%20Mexico", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}