{"result_id": "190004", "URL": "https://lifespa.com/diet-detox/covid-gluten-free/", "timestamp": "2023-04-25 16:16:18 CEST+0200", "meta": {"description": "It is possible that the global trend to avoid wheat, dairy, and other foods that often irritate our digestion may be weakening our immunity and making us more vulnerable to viruses and bacteria?", "lang": "en", "keywords": "", "favicon": "https://lifespa.com/wp-content/uploads/2021/10/cropped-cropped-lifespa-mandala-01-1-32x32.png", "canonical": "https://lifespa.com/diet-detox/covid-gluten-free/", "encoding": "UTF-8"}, "image": null, "domain": "lifespa.com", "title": "How a Gluten-Free Diet May Impact Immunity", "cleaned_text": "Considering Going Gluten-Free? Think Twice\n\nGoing gluten-free, or even lectin-free, has become a badge of honor for the health conscious, but before you join in, new science suggests there may be health benefits to continuing to eat those gluten-rich carbs.\n\nGluten, as well as other harder-to-digest foods, like lectins, has an immune-boosting hormetic effect on the human body.\n\nHormesis is based on the principle that what doesn’t kill you makes you stronger. Eating challenging foods is one of the reasons our species has developed a mostly robust immune system. Yes, these foods act as mild irritants to the digestive system, but they also trigger a natural immune response that makes us healthier (70 percent of the human immune response originates from the microbiome inhabiting our guts).\n\nIn the same way the human immune system becomes stronger after being stressed with certain hormetic foods, plants become stronger when their systems are stressed. When humans consume that stressed plant and its benefits, it’s called xenohormesis.\n\nTaking all the hard-to-digest foods out of your diet can leave your immune system compromised and your body more vulnerable over time.\n\nRest assured, I’m not going to ask you to eat wheat, dairy, and lectins if you are intolerant to them. Rather, I want to help you troubleshoot your digestive system and in turn build a stronger immune response.\n\nJumping to the conclusion that wheat, nuts, seeds, grains, legumes, nightshades, oxalates, goitrogens, and lectins are bad foods is just kicking the real problem down the road.\n\nIn a 2017 study published in the Oxford University journal Nutrition Reviews, researchers studied the hormetic effect of the Mediterranean Diet. Many of the foods in the Mediterranean Diet, like gluten-rich wheat, lectin-rich beans, nuts, and tomatoes, are considered hormetins and provide protection against inflammation.\n\nThe study concluded that food stressors, as well as exposure to bacteria and viruses, were the major selective forces for the evolution of the human immune system. Hormetins like wheat, grains, nuts, beans, tomatoes, olive oil, and alcohol act as intestinal stressors that trigger an immune response (they also play a role in decreasing the risk of numerous chronic health concerns).\n\nWhile these hormetic foods can commonly cause indigestion, Ayuvedic wisdom makes the case that re-teaching the body how to consume these foods (of course non-processed, organic, and unrefined) will support immune strength, healthy aging, and years of vitality, as seen in Mediterranean countries.\n\nThe Truth about Lectins and Gluten\n\nLectins are a large group of proteins that are found in plants, animals, and microorganisms. Their role is to protect plants from microbial invaders, while helping plant carbohydrates bind together. They’re found in larger amounts in certain foods like beans, nuts, lentils, eggplant, potatoes, wheat, whole grains, peppers, fruits, and tomatoes.\n\nThere is no such thing as a lectin-free diet, since lectins are too pervasive in the foods we eat There are also no studies that suggest a diet loaded with lectins are harmful. The problems come when you have weak digestion and try to consume lectins. They can be hard to digest.\n\nA 2019 study published in the journal Food, Chemistry and Toxicology debunked the potential harmful effects of lectins. In fact, the studio showed that that they can actually be beneficial in regulating a healthy immune response.\n• They trigger an immune response by releasing several beneficial cytokines.\n• Lectins can act as a vaccine to provide long-term protection against deadly microbes.\n• Lectin-based therapy can be used to fight microbial diseases.\n\nSeveral studies have also documented the benefits of eating gluten, and the potential consequences of going gluten-free.\n\nThe potential health harms correlated with a gluten-free diet include higher blood mercury levels, more bad gut bacteria, fewer killer T cells (a measure of immune strength), and a higher risk of heart disease and diabetes.\n\nOne of the most basic Ayurvedic rules is that 85 percent of all disease starts in the digestive system. And what science has long known is that viruses primarily infiltrate the body through the protective lining of the respiratory and intestinal tracts. Healthy gut and respiratory linings are linked to robust immunity. Research has now linked the health of the gut microbiome to the health of the respiratory microbiome.\n\nThe health, integrity, and quality of intestinal skin is the body’s first defense against disease. An imbalance in the intestinal skin alters the gut and respiratory microbiomes and compromises immunity. For these gut and respiratory microbiomes to be healthy, they depend on a specific environment. The respiratory and intestinal mucus membrane linings (epithelium or inner skin) must not be to dry, wet, irritated, or inflamed in order to propagate a healthy immune boosting stable of good bacteria.\n\nThe health of these systems starts with upper digestion. If you have a food intolerance, undigested proteins and fats enter the intestines and act as irritants to the intestinal lining, working to break down its defenses. From there, they enter the blood stream and lymphatic system, which is also linked to healthy immune response. Overwhelming the lymphatic system, along with the intestinal lining, with undigested foods will, in short order, overwhelm the body’s immune system.\n\nIn Ayurveda, we treat the host (the environment), not the invader, when we’re troubleshooting digestive woes or poor immunity. There are too many invaders for us to create a pill for each one. But a healthy stable of beneficial bacteria can be the golden ticket. Instead of blaming foods, which are the invaders, you may have better long-term success if you bring your host environments back into balance. Meaning, before you eliminate something like gluten from your diet, work first on your digestive health.\n\nFor more on fixing your digestion, get LifeSpa’s free Digestive Troubleshooting Guide.\n\nTo get a more comprehensive understanding of how the digestive and lymphatic systems work in harmony to support immunity, download LifeSpa’s free Miracle of Lymph ebook.\n\nFor a deeper dive on how your digestive system and immunity benefit from grains, read my book Eat Wheat.\n\nDon’t Be a Victim of the Billion-Dollar Gluten-Free Industry\n\nWe have been manipulated by the new gluten-free food industry to think of gluten as a “bad food.” Global sales of gluten-free foods are predicted to reach US$8.6 billion by 2025. Today, the gluten-free crowd is spending just north of US$5.6 billion a year. In the height of the gluten-free craze, between the years 2012 and 2013, the sale of gluten-free products rose by 81 percent . According to statistics from Satista, while the vast majority of gluten-free folks are gluten sensitive, some 31 percent are not and choose to avoid gluten as a lifestyle choice.\n\nThere are millions of marketing dollars being spent to convince you that gluten is public enemy #1.\n\nThankfully, this potentially dangerous gluten-free trend is beginning to slow down. In the United States, sales of artisan bread, which is handcrafted, made with unrefined organic flour, and no additives, are on the rise. By 2024, market research predicts that global artisan bread sales will reach $US4.5 billion U.S.\n\nIt is time to take your health and immunity back by addressing digestive issues early on and preventing more severe issues to come.", "opengraph": {"locale": "en_US", "type": "article", "title": "How a Gluten-Free Diet May Impact Immunity", "description": "It is possible that the global trend to avoid wheat, dairy, and other foods that often irritate our digestion may be weakening our immunity and making us more vulnerable to viruses and bacteria?", "url": "https://lifespa.com/diet-detox/covid-gluten-free/", "site_name": "John Douillard's LifeSpa", "article:published_time": "2021-12-28T11:00:00+00:00", "article:modified_time": "2022-01-18T22:52:37+00:00", "image": "https://lifespa.com/wp-content/uploads/2021/12/bakery-shelf-bread-angelo-pantazis-unsplash-scaled.jpg", "image:width": "2560", "image:height": "1703", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#Considering_Going_Gluten-Free_Think_Twice", "#Better_Digestion_Better_Immunity", "#The_Truth_about_Lectins_and_Gluten", "#Ayurveda_and_Immunity", "#Dont_Be_a_Victim_of_the_Billion-Dollar_Gluten-Free_Industry", "https://lifespa.com/xenohormesis-stressed-plant-benefits/", "https://lifespa.com/hormesis-digestion-longevity/", "https://academic.oup.com/nutritionreviews/article/75/6/442/3865377", "https://lifespa.com/a-super-high-fat-mediterranean-diet-boosts-the-heart-and-brain/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7115788/", "https://lifespa.com/lectins-plant-paradox/", "https://lifespa.com/dangers-gluten-free-diet/", "https://digestive.lifespa.com/", "https://miraclelymph.lifespa.com/", "https://store.lifespa.com/product/eat-wheat/", "https://www.statista.com/statistics/248467/global-gluten-free-food-market-size/", "https://www.marketresearchfuture.com/reports/artisan-bakery-market-3143"], "authors": ["Dr. John Douillard, DC, CAP"], "publish_date": "2021-12-28T11:00:00+00:00"}