{"result_id": "190016", "URL": "https://lifespa.com/health-topics/childrens-health/confused-about-vaccines/", "timestamp": "2023-04-25 16:16:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://lifespa.com/wp-content/uploads/2021/10/cropped-cropped-lifespa-mandala-01-1-32x32.png", "canonical": "https://lifespa.com/health-topics/childrens-health/confused-about-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "lifespa.com", "title": "Confused About Vaccines?", "cleaned_text": "With a government mandate that all children be vaccinated, there is still a cloud of suspicion as to whether they are safe or not. With an impressive track record against diseases like Polio and Small Pox, the convention which includes academia, the pharmaceutical industry and the government, consider all vaccines safe. At the same time, as a result of the success of vaccinations, many parents have a false sense of security and do not get their children vaccinated, despite the evidence of success. Why?\n\nContrary to what the government would like us to believe, vaccines are not 100% safe. For example, from 1989 to 2011, the pharmaceutical industry paid out $2.3 billion a year for vaccine injuries. (1) In 2011, the Supreme Court passed a law protecting pharmaceutical companies from all liability related to vaccine injuries, even if the vaccine could have somehow been made safer. (1)\n\nThis law might be OK if vaccines were 100% safe, but a recent article in the journal Alternative Therapies makes a strong case that they are not. (1) In one study, published in the Journal of American Medicine (JAMA) in 2004, the influenza vaccine was linked to a life-threatening condition called Guillain-Barré syndrome. (1,2) In the journal Apoptosis, the Hepatitis B vaccine – which is given to newborns within 12 hours of birth – has been linked to liver cell destruction and accelerated cell death. (1,3) While the CDC and the American Association of Pediatrics insist this is necessary, Hepatitis B is only spread by blood or intimate contact with body fluids from someone infected, and mothers are always screened during pregnancy.\n\nTaking these isolated studies and claiming that vaccinations are completely unsafe is also way out of context when considering the benefits and immunity they provide to millions of people worldwide.\n\nThe answer to this problem is not clear, but there are still many things that physicians are suggesting to make vaccination safer.\n\nReduce or Spread Out Dosages for Newborns\n\nGiving 49 doses of 14 vaccinations beginning as early as 6 weeks of age and up to six years old may be just too overwhelming for the immune system. In 1983, they gave 23 doses of only 7 vaccines. While there are no studies direct-linking Autism to vaccines, the increase in Autism over the past 2 decades is staggering. Today, 1 child in 50 is diagnosed with Autism, and in 1990 that number was 1 in 550. (1)\n\nPerhaps the most dangerous outcome of the Supreme Court’s ruling to hold harmless the pharmaceutical industry from vaccine-related injury is the subsequent lack of motivation to improve the vaccines and use more natural ingredients. That said, ask your pediatrician to order vaccines without mercury or other toxic substances commonly found in vaccines. More of these are coming onto the market.\n\nBelow is a list from the CDC of common substances found in vaccines: (1)\n• Aluminum as adjuvants to boost the immune response.\n• Antibiotics to prevent growth of germs in vaccines.\n• Egg Protein – many vaccines are prepared using chicken eggs.\n• Formaldehyde is used to inactivate bacteria and bacterial toxins. Most is removed before packaging.\n• Monosodium glutamate (MSG) is used as a stabilizer for some vaccines.\n• Thimerosal is a mercury containing preservative and antibacterial agents.\n\nWhat is your opinion on vaccinations?\n• Alternative Therapies Journal. Editorial. Vaccines: Both Sides of the Coin. July/Aug 2015. Vol 21, No.4. Alternative-Therapies.com", "opengraph": {"locale": "en_US", "type": "article", "title": "Confused About Vaccines?", "url": "https://lifespa.com/health-topics/childrens-health/confused-about-vaccines/", "site_name": "John Douillard's LifeSpa", "article:published_time": "2015-12-20T03:07:00+00:00", "article:modified_time": "2022-05-07T17:14:23+00:00", "image": "https://lifespa.com/wp-content/uploads/2015/12/vaccines-scaled.jpg", "image:width": "2560", "image:height": "1707", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#Are_vaccines_safe", "#My_Suggestions", "http://www.ncbi.nlm.nih.gov/pubmed/15562126", "http://www.ncbi.nlm.nih.gov/pubmed/22249285"], "authors": ["Dr. John Douillard, DC, CAP"], "publish_date": "2015-12-20T03:07:00+00:00"}