{"result_id": "190010", "URL": "https://lifespa.com/diet-detox/cleanses/how-to-minimize-your-exposure-to-perfluorochemicals-pfcs/", "timestamp": "2023-04-25 16:16:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://lifespa.com/wp-content/uploads/2021/10/cropped-cropped-lifespa-mandala-01-1-32x32.png", "canonical": "https://lifespa.com/diet-detox/cleanses/how-to-minimize-your-exposure-to-perfluorochemicals-pfcs/", "encoding": "UTF-8"}, "image": null, "domain": "lifespa.com", "title": "How to Minimize your Exposure to Perfluorochemicals (PFCs)", "cleaned_text": "The levels of industrial chemicals detected in groundwater and municipal water supplies are rising at an alarming rate.\n\nIn particular, perfluorochemicals (PFCs, PFOAs, and PFOSs) are being found. These chemicals are used for making Gore-Tex (waterproof-breathable fabric), rain jackets, carpets, scotch guard fabric protectors, computer chips, fast food wrappers, popcorn bags, foam fire retardants, non-stick pans and anything else that needs a slippery surface that nothing can attach to. (1)\n\nDeveloped in the 1940s by the manufacturing company, 3M, PFCs have been used for decades in hundreds of products, and unfortunately are now found widely dispersed in soils and groundwater worldwide. Virtually every human in the industrialized world has PFCs in their bloodstream from consuming water, crop-grown food, fish, and meat. (1,2,3)\n\nThe FDA recently lowered “safe” levels of PFCs in drinking water to 70 parts per trillion. That is about half a teaspoon in 20 Olympic-sized swimming pools. The PFCs are non-biodegradable. Nothing, the sun, no known microbe, plant or bacteria has been able to break down these chemical bonds. They are completely unnatural. While many countries in the world have dialed production down or stopped producing them altogether, China, for example, is still producing 500 tons a year. (1,2,3)\n\nMost other toxic, banned industrial chemicals, like DDT, are excreted from the body through the urine, but PFCs are reabsorbed in the kidneys and circulate in the blood for years. The effects on rats and mice have been well-documented, but the PFCs seem to harm each species uniquely. In mice, PFCs cause enlarged livers, suppressed immune systems, cancers, obesity, neurological changes and more, but the effects were different with monkeys. (1,2,3)\n\nSome studies in humans have shown a link (not cause and effect, however) between exposure to PFCs and kidney and testicular cancers, ulcerative colitis, thyroid disease, high cholesterol and pregnancy-related hypertension. Other studies suggest that PFC exposure will weaken the effect of vaccines and reduce the production of antibodies when exposed to a certain pathogen. (1)\n\nSadly, there is no known detox method for PFCs, but for the 4 billion pounds of environmental fat-soluble toxins and pollutants dumped in the American environment each year, there are ways to detoxify your body! (5) The technique, developed thousands of years ago has now been scientifically investigated, and the results were astonishing.\n\nThe technique is called lipophilic-mediated detoxification. It is the process where fats are ingested to act as chelators to attach to toxic fats and pull them out of the body. This is the same procedure used at LifeSpa for the 4-day Short Home Cleanse and the 2-week Colorado Cleanse. (6) During the cleanse, ghee acts as a natural chelator to pull fatty toxins from deep in the tissues. Oil pulling techniques using sesame and coconut oil are thought to use the same mechanism.\n\nMost of the toxins dumped into the environment are fat-soluble. These lipophilic toxins have been associated with concerns for hormonal, immune and reproductive health, as well as a whole host of other potentially serious health issues. Due to environmental persistence and bioaccumulation, body burdens of certain toxins, such as dichlorodiphenyldichloroethylene (DDE) and polychlorinated biphenyls (PCBs), appear to be a health risk – despite the toxin having been banned for decades. (4)\n\nIn a recent study, 48 volunteers participated in a classic Ayurvedic detox using ghee as the lipophilic or fat-chelating agent. They were compared to 40 volunteers in a control group.\n\nIn the study, 9 PCBs and 8 pesticides revealed that serum PCB levels were significantly lower in the detoxification subjects than in controls. In the longitudinal evaluation after the detox, mean levels of PCBs (46%) and beta-HCH (58%) declined significantly in the subjects. (4)\n\n>>> Learn more about Ayurvedic Cleansing here\n• It is important that you contact your local municipal water company and ask for the levels of PFCs. The hotspots, where levels are way above FDA safe levels, are growing in number.\n• Write your congressman in concern of PFCs in your local water supply. Sadly, in today’s America, environmental regulations are being rolled back while we are being distracted. It is so important, now more than ever, for us to step up to the plate and fight to defend and strengthen these regulations to keep ourselves and our future generations safe and healthy.\n• While I don’t have a specific brand of water filter to recommend currently, some are saying that granular activated carbon (GAC, also called charcoal filters), reverse osmosis (RO), and point-of-use water treatment systems (POUs) have been effective in removing PFCs from the water. The State of Minnesota Department of Health conducted studies on these and their findings are published Reverse osmosis filtration systems do have their downfalls – as they typically waste about two to four gallons of water for every one gallon of treated water produced.\n• Find products that haven’t been pre-treated. Skip optional stain-repellent treatment on new carpets and furniture. Many of these coatings are made with PFCs.\n• Cut back on fast food and greasy carryout food. These foods often come in PFC-treated wrappers.\n• Do your research, especially when buying outdoor gear, and choose clothing that doesn’t carry Gore-Tex or Teflon tags. Be wary of all fabrics labeled stain- or water-repellent, even when they don’t carry a recognizable brand tag.\n• Avoid non-stick pans and kitchen utensils. Opt for stainless steel or cast iron instead.\n• Pop popcorn the old-fashioned way – on the stovetop. Microwaveable popcorn bags are often coated with PFCs on the inside.\n• Choose personal care products without “PTFE” or “fluoro” ingredients. Use EWG’s Skin Deep database and app to find safer choices. Avoid using Oral-B Glide floss, which is made by Gore-Tex.", "opengraph": {"locale": "en_US", "type": "article", "title": "How to Minimize your Exposure to Perfluorochemicals (PFCs)", "url": "https://lifespa.com/diet-detox/cleanses/how-to-minimize-your-exposure-to-perfluorochemicals-pfcs/", "site_name": "John Douillard's LifeSpa", "article:published_time": "2018-04-25T00:30:00+00:00", "article:modified_time": "2022-04-16T20:23:25+00:00", "image": "https://lifespa.com/wp-content/uploads/2018/04/dirt-scaled.jpg", "image:width": "2560", "image:height": "1707", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#About_PFCs", "#The_Health_Concerns", "#Ancient_Wisdom_of_Detox_Meets_Modern_Science", "#How_to_Avoid_PFCs", "https://lifespa.com/cleansing/short-home-cleanse/", "https://lifespa.com/cleansing/colorado-cleanse/", "https://lifespa.com/ayurvedic-supplement-facts/ghee/", "https://lifespa.com/?s=oil+pulling", "https://lifespa.com/cleansing/", "http://static.ewg.org/reports/2015/poisoned_legacy/EWG_Guide_to_PFCs.pdf?_ga=1.220142298.257076409.1490810337", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4187289/", "https://www.niehs.nih.gov/health/materials/perflourinated_chemicals_508.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/12233802", "http://www.mountsinai.org/patient-care/service-areas/children/areas-of-care/childrens-environmental-health-center/childrens-disease-and-the-environment/children-and-toxic-chemicals", "https://lifespa.com/cleansing/colorado-cleanse/the-group-colorado-cleanse/"], "authors": ["Dr. John Douillard, DC, CAP"], "publish_date": "2018-04-25T00:30:00+00:00"}