{"result_id": "190011", "URL": "https://lifespa.com/health-topics/oral-health/is-xylitol-safe/", "timestamp": "2023-04-25 16:16:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://lifespa.com/wp-content/uploads/2021/10/cropped-cropped-lifespa-mandala-01-1-32x32.png", "canonical": "https://lifespa.com/health-topics/oral-health/is-xylitol-safe/", "encoding": "UTF-8"}, "image": null, "domain": "lifespa.com", "title": "Is Xylitol Safe?", "cleaned_text": "While xylitol is one of the more popular sugar alcohols used as a sugar substitute, it is also found naturally in fruits and vegetables. Surprisingly, it is also produced by the body during carbohydrate metabolism. The average adult actually makes up to 15 grams of xylitol per day. (1)\n\nXylitol is about 40 times as sweet as sugar but has 40% fewer calories – so not a terrible choice if you need something sweet. But the story about xylitol is less about its sweet taste and more about its benefits for healthy teeth.\n\nSugars feed acid-forming bacteria in the mouth that contribute to the mineral loss and decay of the teeth. Xylitol, while sweet, does not feed acid-forming bacteria (Streptococcus mutans), but instead starves such bacteria in the mouth by as much as 73%. (2)\n\nInterestingly, studies show that the Ayurvedic technique called “oil pulling” has a similar effect on Streptococcus mutans.\n\nIn one study, some 300 children chewed xylitol gum regularly for two years and then stopped. These children showed a significant reduction in tooth decay for the next five years! (3) Newer research has shown that the number of times the mouth is exposed to xylitol is more important than the length of exposure time. Thus, researchers believe regularly chewing xylitol gum after a meal or using xylitol toothpaste may be beneficial. (4)\n\nOther studies concluded that xylitol is surprisingly slow to be absorbed through the stomach, therefore having a negligible effect on blood sugar levels and insulin production. (5) Its glycemic index – which measures how quickly a food becomes sugar in the bloodstream – is only 13, which is very low. By contrast, white table sugar is 59, and bread can be as high as 75.\n\nXylitol has also been shown to support healthy bone, teeth and mineral formation. This is not only a healthy agent for the teeth, animal studies show that xylitol supports health bone density as well. (6)\n\nFor kids, xylitol was shown to inhibit certain bacteria from sticking to the upper respiratory tract wall, supporting a natural immune response by a whopping 30-40%. (7)\n\nI always advocate caution with the consumption of anything with a concentrated sweet taste, since it’s a taste we can easily become dependent on and, with a blood sugar epidemic raging in this country, this is something to consider. If your fasting blood sugars are in the healthy range (below 85mg/dL) and you have a balance of the six tastes (sweet, sour, salty, bitter, pungent and astringent) in your diet, enjoy xylitol in moderation for its teeth and bone supporting benefits.\n\nFind more on this topic here: “Healthy Sugar for your Teeth”.\n\n*Please be warned that, according to the American Society for the Prevention of Cruelty to Animals, xylitol is toxic to animals. Even small amounts can cause rapid insulin release and, potentially, liver failure. So enjoy your xylitol toothpaste and gum, but don’t share it with your furry friends!", "opengraph": {"locale": "en_US", "type": "article", "title": "Is Xylitol Safe?", "url": "https://lifespa.com/health-topics/oral-health/is-xylitol-safe/", "site_name": "John Douillard's LifeSpa", "article:published_time": "2014-04-12T00:42:00+00:00", "article:modified_time": "2022-05-05T18:38:36+00:00", "image": "https://lifespa.com/wp-content/uploads/2014/04/xylitol-pexels-mali-maeder-scaled.jpg", "image:width": "2560", "image:height": "1707", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#Sugar_Substitutes", "#Xylitol_for_Strong_Choppers", "#Show_Me_the_Research", "#Beyond_Dental_Health", "https://lifespa.com/?s=oil+pulling", "https://lifespa.com/healthy-sugar-for-your-teeth/", "http://www.xylitol.org/"], "authors": ["Dr. John Douillard, DC, CAP"], "publish_date": "2014-04-12T00:42:00+00:00"}