{"result_id": "190014", "URL": "https://lifespa.com/health-topics/weight-management/calorie-restriction-whey/", "timestamp": "2023-04-25 16:16:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://lifespa.com/wp-content/uploads/2021/10/cropped-cropped-lifespa-mandala-01-1-32x32.png", "canonical": "https://lifespa.com/health-topics/weight-management/calorie-restriction-whey/", "encoding": "UTF-8"}, "image": null, "domain": "lifespa.com", "title": "Hacking the Benefits of Calorie Restriction with Whey Protein", "cleaned_text": "Have you heard about intermittent fasting or calorie restriction? The health and longevity benefits of calorie restriction have been known for decades.11\n\nWhile the benefits of calorie restriction are compelling, sticking to a restricted-calorie diet has proven to be a challenge for most people.\n\nTo remedy this, researchers set out to find ways to mimic calorie restriction in other ways, without sacrificing the health and longevity benefits. At the top of the list was whey protein—shown in numerous studies to mimic the benefits of calorie restriction.\n\nCows’ milk is 80% casein and 20% whey. Most cheeses, unfortunately, throw away the whey and leave the much harder-to-digest casein to enrich the cheese. Human mothers’ milk is just the opposite, with as much as 80% whey and only 20% casein, suggesting we are hardwired to digest, assimilate, and utilize whey protein.1\n\nWhey protein is one of the highest sources of branched-chain amino acids, which has made it popular for building muscles in athletes and the elderly.2 But it’s benefits go way beyond muscle.\n\nNew research finds branched-chain amino acids and whey’s other constituents can extend life in in certain organisms (such as mice) by as much as nine human years.3,4\n\nIn one study, 16 resistance-trained athletes were put on a calorie-restricted diet with a workout carbohydrate or whey protein. The goal of the study was to retain lean body mass while effectively burning fat. This study was interesting because many folks have concerns about losing muscle mass, but still want to become leaner and burn say some extra belly, hip, or thigh fat.\n\nIn this study, the whey-supplemented group maintained lean body mass while burning fat. The whey group gained significantly more strength compared to the carb group. They concluded the whey group lost unwanted fat while maintaining lean body mass, while the carb group lost weight by losing lean body mass.13\n\nThe Right Kind of Whey Protein Powder\n\nLifeSpa’s Whey Pure is a pure (no additive) low-heat processed whey protein powder sourced from pristine grass-fed New Zealand cows. Whey Pure is uniquely rich in immunoglobulins (antibodies), derived from careful processing techniques under controlled temperatures (low heat and quick cooling techniques protect the proteins) and pH. During a series of gentle filtration steps, lactose and water are removed from a slurry of whey. Special care is taken to maintain integrity of the proteins and antibodies and to optimize the protein complex. The result is a special fresh protein powder with a six-month expiration date—unlike any other protein powder on the market. We get two shipments a year, so get it while it’s fresh.\n\nIn comparison to cow’s milk and ordinary whey protein concentrate, Whey Pure contains significantly greater concentrations of proteins and immunoglobulins.8\n\nWhey Pure can be used not only as a high quality protein source for healthy individuals, but also to provide immunoglobulins to those in need. The immunoglobulins it contains are almost identical to those found in humans and resist peptic digestion. The immune-balancing effect of immunoglobulins supports the body’s normal defense mechanisms.8\n\nResearchers were fascinated how certain worms had extremely long lifespans. They discovered their longevity was in part linked to their ability to upregulate the same branched-chain amino acids found in whey.3\n\nIn mice, those supplemented with a branched-chain amino acid formula similar to whey lived 95 days or 12% longer than mice not supplemented. Translated to human years, that is 9.4 years of extended life!4\n\nSymptoms of Inadequate Protein as You Age16,17\n\nWhey protein is rich in branched-chain amino acids, shown to support healthy development of muscle mass and reduce muscle breakdown from aging or calorie-restricted diets.12,14-17 Whey protein is particularly high in leucine, a branched-chain amino acids responsible for supporting and maintaining muscle mass.8,18\n\nBuilding muscle is not an aesthetic requirement as we age; it is a health requirement. As we age, it’s common for muscles to store or be laced with fat, making the muscle weaker and more metabolically active.\n\nToo much sugar in the diet over the years can store as fat in muscles, making you gain weight, have weaker muscles, and become more vulnerable to blood sugar concerns.\n\nIn one study, 25 healthy human volunteers received either 0, 5, or 30 grams of whey protein and 50 grams of glucose (sugar) to create a state of insulin resistance every morning for eleven days. The study found whey protein significantly reduced fasting blood sugar levels in each group.5\n\nA new study reported in the 2016 annual meeting of the Endocrine Society found eating a high-protein breakfast that included whey protein had a powerful effect on weight loss, satiety, and post-meal blood sugar spikes.19\n\nThe study evaluated 48 overweight and obese individuals with blood sugar spikes for 23 months. They were asked to consume a large breakfast, a medium-sized lunch, and a light supper. All meals delivered the same number of calories.\n\nThe participants were broken up into three groups, divided by different types of foods they consumed for breakfast:\n\nDuring the study, they measured BMI and weight loss, satiety levels, and sugar spikes after meals.\n\nThe group who had the whey protein shake for breakfast lost more weight, reported less hunger, and had lower post-meal blood sugar spikes compared to the groups who ate other foods.\n\nThe lead researcher of the study, Daniela Jakubowicz, MD, added that the whey protein significantly lowered ghrelin, the hunger hormone.19\n\nNumerous studies link whey protein to a healthy immune response. After vaccinations, it is common to have an aggressive immune response. Whey protein was shown to robustly support a primary and secondary antibody response to a variety of vaccines.6\n\nIn another study, whey was found superior to other protein sources, like soy, casein, wheat, corn, egg white, fish, beef, or spirulina in boosting a humoral immune response and immune antibodies. In fact, in some instances, the response was nearly five times greater than other protein sources in supporting a healthy adaptive and humoral immune response, which play a major role in a healthy immune response.7\n\nGlutathione, a powerful immune system stimulant and antioxidant, is greatly increased by supplemental whey protein.7\n\nCysteine and glutamate are found in higher concentrations in Whey Pure than in other high biological value proteins. These amino acids serve as precursors to glutathione,9 an endogenous antioxidant, especially needed during stress, exercise, and poor nutrition.\n\nLactoferrin, alpha-lactalbumin, beta-lactoglobulin, and bovine serum albumin are other proteins in Whey Pure that contribute to glutathione synthesis and support immune function.9,10\n\nEach immunoglobulin in LifeSpa’s Whey Pure (IgG1, IgG2, IgM, and IgA) has a specific role in immune function:\n• IgM responds quickly to antigens, which may include bacteria and viruses.\n• Later in the response, IgG1 and IgG2 can help the body fight harmful pathogens\n• IgA is critical to the immune system.\n• Immunoglobulins also contribute to the humoral immunity of gut-associated lymphoid tissue (GALT).\n\nAs you can see, there are many reasons why I love whey protein so much. Have you tried LifeSpa’s Whey Pure? What did you notice?", "opengraph": {"locale": "en_US", "type": "article", "title": "Hacking the Benefits of Calorie Restriction with Whey Protein", "description": "Have you heard about intermittent fasting or calorie restriction? The health and longevity benefits of calorie restriction have been known for decades.", "url": "https://lifespa.com/health-topics/weight-management/calorie-restriction-whey/", "site_name": "John Douillard's LifeSpa", "article:published_time": "2020-09-22T10:00:08+00:00", "article:modified_time": "2021-10-29T21:55:41+00:00", "image": "https://lifespa.com/wp-content/uploads/2016/03/lifespa-image-protein-powder-container-scooper.jpg", "image:width": "310", "image:height": "206", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#Whey_Protein_Mimics_Benefits_of_Calorie_Restriction", "#Health_Benefits_of_Calorie_Restriction", "#Casein_Whey", "#Calorie_Restriction_Whey_Protein_Study", "#The_Right_Kind_of_Whey_Protein_Powder", "#Whey_Protein_Longevity", "#Symptoms_of_Inadequate_Protein_as_You_Age1617", "#Whey_Muscle_Mass", "#Whey_Supports_Healthy_Blood_Sugar", "#Whey_for_Breakfast_Boosts_Weight_Loss", "#Whey_Boosts_Immunity", "#Boosts_Antioxidant_Activity", "#Whey_Benefits_Lymph-Based_Immunity8", "https://store.lifespa.com/product/whey-pure/", "https://lifespa.com/eat-less-thrive-without-hunger/", "https://store.lifespa.com/product/whey-pure/", "https://store.lifespa.com/product/whey-pure/", "https://store.lifespa.com/product/whey-pure/", "https://store.lifespa.com/product/whey-pure/", "https://store.lifespa.com/product/whey-pure/"], "authors": ["Dr. John Douillard, DC, CAP"], "publish_date": "2020-09-22T10:00:08+00:00"}