{"result_id": "192028", "URL": "https://www.liveaction.org/news/pinterest-bans-live-action-conspiracy-anti-vax/", "timestamp": "2023-04-25 16:17:16 CEST+0200", "meta": {"description": "Pinterest banned Live Action, saying its content causes \"immediate and detrimental effects\" on users, later claiming it was a conspiracy, anti-vax site.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/pinterest-bans-live-action-conspiracy-anti-vax/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "Pinterest bans Live Action, alleges 'conspiracy theories, anti-vax advice'", "cleaned_text": "Earlier today, it was revealed that Pinterest, a popular social media company, had chosen to block Live Action’s content using a “porn blocklist.” Inexplicably, Pinterest suspended Live Action’s account early this morning after watchdog group Project Veritas sought comment from the company prior to breaking the story, featuring firsthand testimony from a Pinterest employee (donate to a GoFundMe set up on behalf of the since-fired employee, Eric Cochran, here). Pinterest support claimed that the permanent suspension was due to Pinterest’s policies disallowing “misinformation,” stating that Live Action’s pro-life account “may have immediate and detrimental effects on a Pinner’s health or on public safety.”\n\nSIGN THE PETITION to STOP PINTEREST’S CENSORSHIP OF PRO-LIFERS\n\nOriginally, it appeared that Megan McClellan, Pinterest’s Law Enforcement and Government Operations (LEGO) Program Manager, placed Live Action on the porn blocked list. But after a source reached out to Pinterest regarding the permanent ban, the story changed (emphasis added):\n\nFrom Pinterest: “From: Pinterest communications <press@pinterest.com>\n\n Sent: Tuesday, June 11, 2019 12:43 PM\n\n To:\n\n Subject: Re: Seeking comment on story about censorship, religion on Pinterest\n\nHi [X] Thank you for reaching out to Pinterest. We have provided a statement below from a Pinterest spokesperson. Regarding the domain, it was actioned for misinformation related to conspiracies and anti-vaccination advice, and not porn. Sometimes our internal tools have legacy names for the technology that enforces some of our policies. This technology was named years ago to combat porn, and has since expanded to a variety of content despite retaining its original internal name. We are updating our internal labeling to make this clear.\n\n“Religious content is allowed on Pinterest, and many people use our service to search for and save Pins inspired by their beliefs. To protect our users from being targeted based on personal characteristics such as their religion, we have policies in place so that ads and recommendations don’t appear alongside certain terms.” –– Pinterest spokesperson\n\nInstead of being blocked for pornography, Pinterest now claims that Live Action was blocked for “conspiracy theories and anti-vaccine advice.” While this classification is completely inaccurate, it is possible that Pinterest has chosen to make this claim based on the idea that simply reporting on news related to life issues is controversial. Live Action News has published articles regarding the Center for Medical Progress’s undercover videos exposing the harvesting of aborted fetal body parts at various Planned Parenthood affiliates. But despite the fact that the full, unedited videos (all available online from the beginning) were forensically examined by Coalfire Systems four years ago and found to be “authentic with no evidence of manipulation,” pro-abortion operatives have labeled David Daleiden and Sandra Merritt’s video investigations as “conspiracies.”\n\nIn addition, many social media outlets have been blocking websites that have espoused anti-vaccine views, but Live Action has been and remains neutral on the issue of vaccines. None of the boards Live Action maintained on Pinterest addressed this issue whatsoever. Live Action News has, however, reported on the controversy surrounding the use of human fetal cell lines used to grow certain vaccines; while we have reported that children are not continuing to be aborted for the sake of vaccines in the United States, some pro-lifers feel there is an ethical dilemma considering that several vaccines are grown in the fetal cell lines of three babies aborted in the 1960s. (In China, however, such experimentation on the body parts of aborted babies is continuing for the sake of developing vaccines.) Other pro-lifers believe that because vaccine-preventable diseases pose a risk to people’s lives, including the lives of preborn children, using these vaccines, no matter how they were derived, is considered ethical.\n\nLive Action News has also reported on efforts by some to obtain ‘ethical alternatives’ from pharmaceutical companies. A new shingles vaccine, for example, was created as an alternative to the previous vaccine, which was created using aborted fetal cells. This new vaccine, Shingrix, is actually more effective than the previous vaccine. In addition, Live Action News reported approximately seven years ago on the controversy at PepsiCo, which was at the time using aborted fetal cell lines in some of their flavor testing. This practice was discontinued shortly thereafter.\n\nIt is the job of Live Action News to report on life issues, which may include cell lines originally derived from aborted children, and the moral dilemma some pro-lifers feel. Live Action takes no stance on vaccines, but will continue to investigate and expose instances where the body parts of aborted children are being used for experimentation, whether or not this information relates to vaccines. Considering Live Action’s neutral stance and Live Action News’ even-handed reporting on these issues, and the fact that Live Action did not pin or publish anti-vaccine information, it seems that Pinterest’s claims are a smokescreen to cover the fact that a pro-abortion company simply wished to censor Live Action’s pro-life views.\n\nSIGN THE PETITION to STOP PINTEREST’S CENSORSHIP OF PRO-LIFERS\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "Pinterest bans Live Action, alleges 'conspiracy theories, anti-vax advice'", "description": "Pinterest banned Live Action, saying its content causes \"immediate and detrimental effects\" on users, later claiming it was a conspiracy, anti-vax site.", "url": "https://www.liveaction.org/news/pinterest-bans-live-action-conspiracy-anti-vax/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Analysis", "article:published_time": "2019-06-11T16:27:53-05:00", "article:modified_time": "2019-06-15T21:07:17-05:00", "updated_time": "2019-06-15T21:07:17-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2019/06/censored-ultrasoundjpg.jpg", "image:width": "1200", "image:height": "650"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.liveaction.org/news/pinterest-censors-live-action-labeling-content-porn/", "https://www.gofundme.com/pinterest-whistleblower-on-prolife-censorship", "https://www.liveaction.org/news/pinterest-censors-live-action-labeling-content-porn/permanent-banning-live-action-pinterest/", "https://petitions.liveaction.org/pinterestcensorship/", "https://www.youtube.com/watch?v=jjxwVuozMnU&list=PL_S490a2o7lTPt1CNEpI37RJO7JOcS2Rs", "https://www.liveaction.org/news/forensic-analysis-finds-full-planned-parenthood-videos-authentic/", "https://web.archive.org/web/20170727123425/https://www.pinterest.com/LiveActionFilms/", "https://www.liveaction.org/news/shingles-vaccine-babies-dont-die/", "https://www.liveaction.org/news/pro-life-groups-herald-pepsico-decision-to-stop-using-aborted-fetal-cells-lines/", "https://petitions.liveaction.org/pinterestcensorship/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Cassy Fiano-Chesser"], "publish_date": "2019-06-11T16:27:53-05:00"}