{"result_id": "192027", "URL": "https://www.liveaction.org/news/abortions-drop-20-percent-10-years/", "timestamp": "2023-04-25 16:17:16 CEST+0200", "meta": {"description": "Though the CDC's numbers are far lower than those of Guttmacher, the CDC shows a 20 percent decrease in the number of abortions over the past ten years.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/abortions-drop-20-percent-10-years/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "Abortions have dropped 20 percent over the last 10 years", "cleaned_text": "A newly released abortion statistics report from the Centers for Disease Control (CDC) reveals a reduction in the number of abortions reported in 2014. According to the CDC, over the last 10 years, abortion has seen a significant drop in the United States, with a 20 percent decrease.\n\nCDC’s Abortion Surveillance report, released on November 22, 2017, states that 652,639 abortions were reported in 2014. This represents a two percent drop from 2013. In addition to abortion totals, the abortion rate also decreased two percent (from 12.4 abortions per 1,000 women aged 15–44 years), and the abortion ratio decreased 7 percent (from 199 abortions per 1,000 live births). The CDC report also revealed that four women died from legal abortion in 2013.\n\nIn October of 2017, Guttmacher, the former “special affiliate” and research arm of Planned Parenthood, reported an abortion total of 926,200 in 2014, far more than what the CDC claims. The CDC admits it was “unable to obtain the total number,” and pointed to “requirements by the individual reporting areas” as a reason. The CDC claims Guttmacher’s numbers are higher because Guttmacher uses “numerous active follow-up techniques to increase the completeness of the data obtained through its periodic national census of abortion providers,” a fact Live Action News has previously documented.\n\nNeither the CDC nor Guttmacher counts the use of emergency contraception such as Ella or Plan B in their abortion numbers. This is despite the fact that each of these drugs clearly state on their label that they can prevent implantation, thus aborting a life that has begun. (There would be no way of knowing if these drugs had actually caused an abortion in a particular instance, however, and therefore, there is no way to report.)\n\nThe CDC’s report indicates that abortion data was provided voluntarily by the central health agencies of 49 reporting areas (the District of Columbia; New York City; and 47 states, excluding California, Maryland, and New Hampshire). Here are a few key findings:\n\nThe fact that women have multiple abortions is kept fairly quiet by the abortion industry, but the CDC report reveals that this does indeed occur, and more than you might expect. In 2014, there were 40 areas in the U.S. that reported the number of previous abortions, as follows:\n• Three or more previous abortions 8.6% (39,111)\n\nNearly 45 percent of women having abortions had already had at least one committed previously.\n\nIn 2014, women in their 20s accounted for the majority of abortions and had the highest abortion rates; women in their 30s and older accounted for a much smaller percentage of abortions and had lower abortion rates. In 2014, women aged 20–24 and 25–29 years accounted for 32.2% and 26.7% (totaled, nearly 59%) of all reported abortions among the 46 areas that reported by maternal age. Women aged 20-24 and 25-29 also had the highest abortion rates: 21.3 and 18.4 abortions per 1,000 women.\n\nOut of the 652,639 reported abortions in 2014, 393,448 abortions from only 30 reporting areas accounted for race/ethnicity. This amounted to one additional reporting area than 2013 and may account for the slight increase in abortion percentages among white and Black women (a .7 percent increase and a .4 percent increase respectively).\n\nFor years, pro-lifers have contended that abortion disproportionately affects the African American Community. They point to US Census Bureau data estimates, which show that in 2014, while Blacks made up approximately 13 percent of the US population, CDC figures for 2014 reveal that non-Hispanic Black women accounted for 36 percent of reported abortions that reported this criterion.\n\nNon-Hispanic Black women continue to have the highest abortion rate (26.6 abortions per 1,000 women aged 15–44 years) and ratio (391 abortions per 1,000 live births).\n\nAccording to abortion numbers reported by Planned Parenthood‘s former “special affiliate,” The Guttmacher Institute (founded by a leader of the American Eugenics Society), 28 percent of abortions reported to them in 2014 were committed on Black women, 39 percent of abortions on white women, 25 percent on Hispanic women, and 9 percent on women of other races.\n\nOnly 40 reporting areas gave the CDC an estimate of gestational age, excluding 12 areas (California, Connecticut, District of Columbia, Florida, Illinois, Maryland, Massachusetts, New Hampshire, New York State, Pennsylvania, Wisconsin, and Wyoming) that either did not report, did not report by gestational age, or did not meet reporting standards.\n\nThe CDC reports that 91.5 percent of abortions that report gestational age were done at less than 13 weeks, 7.2 percent between 14 and 20 weeks, and 1.3 percent at more than 21 weeks.\n\nAdditional gestational numbers break down as follows:\n\nNotably, just 440,330 of the 652,639 reported abortions were identified by gestational age. What this reveals is that while the abortion industry would like the public to believe that late-term abortion is not happening in the U.S., 212,309 abortions were not classified by gestational age. How many abortions are committed late-term without being reported as such, or in the second trimester without public knowledge? The most common second trimester procedure is the D&E abortion.\n\nIn 2014, 43 areas reported by method type. While medical abortions (also called medication abortions, abortion pill, and RU-486) have been increasing, the data reveals that many women still opt for surgical procedures. In the areas that reported medical abortions, 22.6 percent of these abortions were medical abortions committed at less than eight weeks, 1.5 percent were medical abortions committed at greater than eight weeks, 67.4 percent were surgical abortions committed at less than 13 weeks, and 8.6 percent were surgical abortions committed at greater than 13 weeks.\n\nThe use of early medical abortion increased one percent from 2013 to 2014. Over a ten-year period, between 2005 and 2014, surgical abortions decreased 14 percent.\n\nAccording to the CDC, data on induced abortion-related deaths that occurred from 1972–2012 were previously published, and possible abortion-related deaths that occurred during 2014–2017 are now being assessed.\n\nHowever, the CDC does report that four women died from legal abortion in 2013. This number was not available when it released 2013 abortion totals last year.\n\nA previous Live Action News report identified at least two of the four women who are known to have died from legal abortion in 2013:\n• Maria Santiago died from “cardiopulmonary arrest” following a first trimester abortion, after being left in the care of an “unlicensed medical assistant.”\n• Jennifer Morbelli died at the hands of infamous abortionist LeRoy Carhart while undergoing a late-term abortion at 33 weeks of pregnancy. Carhart has a long history of abortion complications and deaths.\n\nWhile the CDC has not reported abortion deaths after 2013 yet, it is known that multiple women have died due to a botched abortion from 2014-2016. A Live Action News article identified the following women’s abortion deaths:\n• Twenty-two year old Lakisha Wilson died in 2014 following a botched abortion in Ohio at Preterm in Cleveland, Ohio.\n• In 2016, at least two women died from legal abortion: Jamie Lee Morales of Buffalo, New York (who died after blood loss from a second trimester abortion), and Cree Irwin-Sheppard of Michigan (who had her abortion at Planned Parenthood and was found dead by her mother just days later).\n• 2012: Four deaths from legal abortion, three of whom are unknown. Only one, Tonya Reaves, made headlines. Reaves died after a Chicago Planned Parenthood abortionist (Mandy Gittler, who is now employed by Planned Parenthood in Michigan) left her to hemorrhage for five hours after her 16 week abortion without medical care and without calling 911.\n• 2010: Ten deaths from legal abortion, all unknown except for one — Alexandra Nunez from Queens, New York, who died after an artery was severed during her abortion, leading to cardiac arrest\n• 2009: Eight deaths from legal abortion, with only two identities known — Karnamaya Mongar, who died after a painkiller overdose at Kermit Gosnell’s Philadelphia “house of horrors,” and Ying Chen, who died as a result of what the OC Register called “a toxic reaction to anesthetic.”\n\nIn 2017, Abortion Free New Mexico obtained the autopsy report for Keisha Marie Atkins, 23, who died from her legal abortion on February 4, 2017. Atkins had a late-term abortion, initiated at Southwestern Women’s Options (SWO), in Albuquerque, New Mexico. SWO is the largest abortion facility in the U.S. that openly “specializes” in abortion throughout all nine months of pregnancy. SWO is also the facility involved in the ongoing baby part harvesting investigation in New Mexico. The facility provided whole aborted baby brains for a students’ summer camp, likely without parents’ knowledge.\n\nBy its own admission, the CDC “cannot be used alone to calculate national case-fatality rates (number of legal induced abortion-related deaths per 100,000 reported legal induced abortions in the United States) because certain states did not report abortion data every year during this period.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Abortions have dropped 20 percent over the last 10 years", "description": "Though the CDC's numbers are far lower than those of Guttmacher, the CDC shows a 20 percent decrease in the number of abortions over the past ten years.", "url": "https://www.liveaction.org/news/abortions-drop-20-percent-10-years/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Investigative", "article:published_time": "2017-11-25T13:56:01-05:00", "article:modified_time": "2017-11-27T10:39:45-05:00", "updated_time": "2017-11-27T10:39:45-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2017/11/aborted-arm-on-dime.jpg", "image:width": "640", "image:height": "426"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/5THDmys8z30\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/5THDmys8z30"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/jgw4X7Dw_3k\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/jgw4X7Dw_3k"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/lRDnVSMr5j0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/lRDnVSMr5j0"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "355", "embed_code": "<iframe src=\"https://www.youtube.com/embed/SI6HwbxYCfI\" width=\"640\" height=\"355\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/SI6HwbxYCfI"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/r5Af8vIym2o\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/r5Af8vIym2o"}], "links": ["https://www.cdc.gov/mmwr/volumes/66/ss/pdfs/ss6624-H.PDF", "https://www.cdc.gov/mmwr/volumes/65/ss/ss6512a1.htm", "https://www.liveaction.org/news/how-independent-is-guttmacher-from-planned-parenthood/", "https://www.guttmacher.org/sites/default/files/factsheet/fb_induced_abortion.pdf", "https://www.liveaction.org/news/understanding-abortion-reporting-numbers/", "https://www.liveaction.org/news/the-fungibility-factor-funding-emergency-contraception-is-funding-potential-abortion/", "https://www.cdc.gov/mmwr/volumes/66/ss/pdfs/ss6624-H.PDF", "https://www.census.gov/quickfacts/fact/table/US#viewtop", "https://www.census.gov/data/datasets/2016/demo/popest/state-detail.html", "http://liveaction.org/abortioncorporation", "https://www.liveaction.org/news/how-independent-is-guttmacher-from-planned-parenthood/", "https://www.guttmacher.org/fact-sheet/induced-abortion-united-states", "https://www.liveaction.org/news/former-planned-parenthood-prez-alan-guttmacher-population-control-coercion-limiting-births/", "https://www.guttmacher.org/fact-sheet/induced-abortion-united-states", "https://www.liveaction.org/news/centers-for-disease-control-reveals-more-women-dying-from-abortion-than-we-thought/", "http://www.washingtontimes.com/news/2013/jun/6/4-maryland-abortion-clinics-shut-down-3-doctors-su/", "https://www.liveaction.org/news/breaking-carhart-patient-dead-after-33-week-abortion/", "http://www.jillstanek.com/2013/02/carhart-patient-cause-of-death/", "https://www.liveaction.org/news/md-weeks-after-carhart-reestablishes-abortion-woman-leaves-ambulance/", "http://liveactionnews.org/leroy-carhart-needs-investigated/", "https://www.liveaction.org/news/centers-for-disease-control-reveals-more-women-dying-from-abortion-than-we-thought/", "https://www.liveaction.org/news/cleveland-22-year-old-woman-dead-after-abortion-late-in-pregnancy/", "http://www.nydailynews.com/new-york/queens/queens-gynecologist-hit-manslaughter-charges-article-1.2826925", "http://rlmblog.blogspot.com/2017/03/cree-erwin-cause-of-death-confirmed.html", "http://liveactionnews.org/tragic-911-call-mom-finds-daughter-cold-ice-abortion/", "https://www.liveaction.org/news/centers-for-disease-control-reveals-more-women-dying-from-abortion-than-we-thought/", "http://dailycaller.com/2017/03/16/women-dying-from-safe-and-legal-abortions/#ixzz4bcBDEMHx", "http://dailycaller.com/2017/03/16/women-dying-from-safe-and-legal-abortions/#ixzz4bcBDEMHx", "http://liveactionnews.org/planned-parenthood-retains-improperly-licensed-abortionist-killed-patient/", "http://liveactionnews.org/autopsy-report-points-to-planned-parenthoods-negligence-in-tonya-reaves-death/", "http://www.nydailynews.com/news/queens-clinic-a1-medicine-probed-alexandra-nunez-fatally-injured-undergoing-abortion-article-1.460728", "http://liveactionnews.org/kermit-gosnell-ordered-pay-victims-family-4-million/", "http://www.ocregister.com/articles/rutland-259905-board-homicide.html", "http://abortiondocs.org/wp-content/uploads/2017/08/Autopsy-Report-Keisha-Atkins.pdf", "http://www.operationrescue.org/archives/woman-dead-from-abortion-at-late-term-facility-currently-under-criminal-investigation/", "http://www.lifenews.com/2017/03/09/largest-late-term-abortion-clinic-in-the-u-s-under-investigation-for-selling-body-parts-of-aborted-babies/", "https://www.liveaction.org/news/abortion-clinic-provided-whole-brains-for-summer-camp/"], "authors": ["Carole Novielli"], "publish_date": "2017-11-25T13:56:01-05:00"}