{"result_id": "192031", "URL": "https://www.liveaction.org/news//scientist-who-experiments-aborted-baby-brains-proven-wrong-dengue-vaccine/", "timestamp": "2023-04-25 16:17:17 CEST+0200", "meta": {"description": "Actual cures for diseases have not been discovered from fetal cells. Now a vaccine for Dengue fever has been made without baby body parts.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/scientist-who-experiments-aborted-baby-brains-proven-wrong-dengue-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "Scientist who experiments on aborted baby brains proven wrong on Dengue vaccine", "cleaned_text": "Those involved with fetal tissue research would have us believe that it is a necessary path to finding cures for diseases and creating vaccines to save lives. But once again, that’s been shown to be far from the truth. This week, Science Transitional Medicine reported that the creation of a vaccine is helping victims of the Dengue virus. The Zika virus is in the same virus family, and this creation shows promise for that vaccine, as well.\n\nNone of this research has involved human fetal tissue.\n\nJust two weeks ago, the House Select Investigative Panel on Infant Lives heard from witnesses who insisted that fetal tissue was a necessary form of research because it was the most promising option for finding cures for diseases and vaccines to stop viruses.\n\nThe most notable of the hearing’s witnesses was a man who partners with Planned Parenthood to do research on aborted babies’ brains. Lawrence S.B. Goldstein, PhD, a professor in the Department of Cellular and Molecular Medicine at the University of California, San Diego School of Medicine, insisted that his fetal research is imperative to save lives. Yet another study now proves him wrong, and Chairman Marsha Blackburn (R-TN) is “chiding the Democrats for exaggerating the importance of fetal tissue.”\n\nI am extremely pleased with recent studies showing potential cures for Dengue fever and the Zika virus. Both diseases are causing untold pain and suffering to thousands of people. Both of these scientific breakthroughs show a solution to end these crippling diseases is on the horizon. I find it very interesting that this news comes in direct contrast to accusations made by Democrats and their witnesses during our March 2nd hearing on Bioethics and Fetal Tissue where they claimed that the work of our panel would slow down progress on efforts to find a vaccine for the Zika virus.\n\nIndeed, it was announced just this past Wednesday that the experimental vaccine, developed by the National Institutes of Health, showed conclusive evidence of efficacy. Beth Kirkpatrick, Professor of Medicine at the University of Vermont, said:\n\nBlackburn’s office points out that this contradicts Goldstein’s testimony:\n\nClearly, Goldstein’s “self-evident” theories have been proven wrong.\n\nAs Live Action reported, Goldstein has ties to Planned Parenthood and has acquired fetal parts from the abortion giant. He has also received funding from them for his research, and has donated to them as well.\n\nGoldstein even defended the necessity of “exploration” with baby brains, saying that since researchers don’t know which area of the brain is affected by certain diseases, it’s important to “explore the landscape” of the brains.\n\nNow Blackburn is calling his bluff. Her statement continues:\n\nAnd this is not unusual, as, thus far, actual cures for diseases have not been discovered from fetal cells. Even vaccines made from fetal cells have ethical alternatives – vaccines for the same virus that are constructed by other means. Some of these are not currently allowed or available in the United States, but they do exist in other nations.\n\nBlackburn also expressed anger that people continue to suffer while fetal tissue advocates continue their ineffective research without pursuing cures from more legitimate and proven sources. She said:\n\nOnce again, the medical breakthroughs come from research that does not involve parts from dead babies. No matter what the researchers testify to justify further research, at the end of the day, the facts speak for themselves.\n\nThe Dengue vaccine is expected to be widely available in 2018. Meanwhile, Goldstein and his colleagues might still be “exploring the landscape” of baby brains.", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientist who experiments on aborted baby brains proven wrong on Dengue vaccine", "description": "Actual cures for diseases have not been discovered from fetal cells. Now a vaccine for Dengue fever has been made without baby body parts.", "url": "https://www.liveaction.org/news/scientist-who-experiments-aborted-baby-brains-proven-wrong-dengue-vaccine/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:tag": "Washington Post", "article:section": "Analysis", "article:published_time": "2016-03-18T11:02:04-05:00", "article:modified_time": "2016-03-18T11:25:34-05:00", "updated_time": "2016-03-18T11:25:34-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2015/07/Planned-Parenthood-fetal-parts.jpg", "image:width": "1920", "image:height": "1080"}, "tags": [], "tweets": [], "movies": [], "links": ["http://stm.sciencemag.org/content/8/330/330ra36.full", "https://energycommerce.house.gov/select-investigative-panel", "http://docs.house.gov/meetings/IF/IF04/20160302/104605/HHRG-114-IF04-Wstate-GoldsteinL-20160302.pdf", "https://www.washingtonpost.com/news/to-your-health/wp/2016/03/16/scientists-say-they-have-found-final-puzzle-piece-for-dengue-vaccine-a-breakthrough-that-could-help-in-fight-against-zika/", "https://www.washingtonpost.com/news/to-your-health/wp/2016/03/16/scientists-say-they-have-found-final-puzzle-piece-for-dengue-vaccine-a-breakthrough-that-could-help-in-fight-against-zika/", "https://energycommerce.house.gov/select-investigative-panel", "https://energycommerce.house.gov/hearings-and-votes/hearings/bioethics-and-fetal-tissue", "/news/experimenting-baby-brains-worthwhile-endeavor-doctor-testifies/", "/news/experimenting-baby-brains-worthwhile-endeavor-doctor-testifies/", "/news/experimenting-baby-brains-worthwhile-endeavor-doctor-testifies/", "/news/why-it-matters-that-a-pro-life-woman-introduced-a-bill-in-congress-to-defund-the-abortion-business/cdc19144-b921-4bcb-a105-eb2401423554/"], "authors": ["Catherine Livingston, PhD"], "publish_date": "2016-03-18T11:02:04-05:00"}