{"result_id": "192002", "URL": "https://www.liveaction.org/news/california-law-free-speech-restrictions-pro-lifers/", "timestamp": "2023-04-25 16:17:00 CEST+0200", "meta": {"description": "Last Friday, California Gov. Newsom signed a new law that pro-lifers fear could be a “Trojan horse” for restricting them from sidewalk advocacy.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/california-law-free-speech-restrictions-pro-lifers/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "New California law could lead to free speech restrictions, pro-lifers say", "cleaned_text": "Last Friday, California Governor Gavin Newsom signed a new state law that pro-lifers fear could be a “Trojan horse” for restricting pro-lifers from peacefully assembling outside abortion facilities.\n\nSB 742 is purportedly aimed at protecting frontline workers and patients attempting to receive vaccinations (including those for COVID-19) from protestors at vaccination sites, such as hospitals, clinics, doctors’ offices, and pop-up locations. The law stipulates that protestors may not come within 30 feet of anyone who is within 100 feet of the facility, including people in cars.\n\nA press release claims that the buffer zone is intended to mitigate the spread of COVID-19, and protect patients and front-line workers from harassment and physical interference. Violators of the law could face a misdemeanor charge, fines, and imprisonment.\n\nAlthough the new law appears to have been introduced to address anti-vaccination protests at vaccination sites, pro-lifers are concerned that the legislation could pave the way for unconstitutional restrictions on peaceful pro-life activities, including prayer and sidewalk counseling near abortion facilities. Planned Parenthood recently announced that its facilities are administering COVID-19 vaccines in the state. And therefore, Planned Parenthood could also be classified as a protected vaccination site because it provides other vaccines, like Gardasil, the vaccine to prevent human papilloma virus, an STD.\n\nWhile the original bill restricted speech only “in connection with vaccination services,” that phrase was ultimately removed because the government can only restrict free speech when content neutral. However, the removal of the phrase from the final bill could impact the ability of pro-life groups to provide sidewalk counseling, hold signs, and hand out literature — all of which could constitute “harassment” under the new law.\n\nBefore the bill was signed into law, the Right to Life League urged the governor to veto the bill on the grounds that it creates an unconstitutional infringement on First Amendment-protected speech. They cited Schenck v. Pro-Choice Network of W. New York, a case where the Supreme Court ruled that a 15-foot buffer zone was unconstitutional because it burdens more speech than is necessary.\n\n“If a fifteen-foot floating buffer zone is unconstitutional, then the thirty-foot floating buffer zone proposed by SB-742 is unconstitutional,” the group stated on its website. “SB-742 creates an unconstitutional buffer zone around any vaccination site, defining First Amendment political speech, such as picketing and leafleting, to be forms of harassment. It will chill our First Amendment right to protest.”\n\nConcerned that the new law will lead to the infringement of pro-life free speech, Life Legal filed a lawsuit in federal court on Tuesday, arguing that lawmakers are using COVID-19 as an “excuse” to push “breathtaking restrictions” on First Amendment-protected activities.\n\nREAD: These three families say ‘thank you’ to pro-life sidewalk counselors\n\n“Creating no-approach zones around every abortion facility, drug store, stand-alone health clinic, and supermarket in the state is unconstitutionally over-inclusive and overbroad,” said Life Legal Chief Officer Katie Short. “In an age of unprecedented incursions on freedom, this law is an unheard-of restriction on core First Amendment activities, and we are confident that the federal court will strike down SB 742.”\n\nCalifornia Family Council President Jonathan Keller also raised concerns about the legislation, fearing Planned Parenthood will use the legislation as an excuse to restrict pro-life activity. “Vaccination can be controversial, so every person should be free to make the best choice for them and their family,” Keller said in a statement. “But SB 742 is a Trojan Horse attack on the First Amendment rights of all Californians. Groups like Planned Parenthood will use this law to silence peaceful pro-life speech and assembly.”\n\nPro-lifers expect the new law to impact the 40 Days for Life campaign, which plays a vital role in ensuring women are offered options other than abortion.\n\nUnfortunately, unconstitutional restrictions on peaceful pro-life assembly in California are far from unprecedented. Just recently, Live Action News reported that the Napa City Council voted in favor of putting a 30-foot buffer zone into place around the local Planned Parenthood facility.\n\nIn the days and weeks ahead, California pro-lifers stand ready to continue to fight for their right to advocate for and defend life.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "New California law could lead to free speech restrictions, pro-lifers say", "description": "Last Friday, California Gov. Newsom signed a new law that pro-lifers fear could be a “Trojan horse” for restricting them from sidewalk advocacy. ", "url": "https://www.liveaction.org/news/california-law-free-speech-restrictions-pro-lifers/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:tag": "vaccine", "article:section": "Newsbreak", "article:published_time": "2021-10-13T16:37:10-05:00", "article:modified_time": "2021-10-13T14:23:39-05:00", "updated_time": "2021-10-13T14:23:39-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2021/10/GettyImages-1344305444-gavin-newsom.jpg", "image:width": "1200", "image:height": "650"}, "tags": [], "tweets": [], "movies": [], "links": ["https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202120220SB742", "https://sd06.senate.ca.gov/news/2021-10-09-governor-signs-legislation-sb-742-protect-our-right-get-vaccinated", "https://www.plannedparenthood.org/about-us/newsroom/press-releases/planned-parenthood-launches-two-million-dollar-covid-19-vaccine-campaign", "https://lifelegaldefensefoundation.org/life-legal-defends-pro-life-speech-against-newsom-power-grab/", "https://www.chicoer.com/2021/10/11/new-law-bans-harassment-at-vaccination-sites-but-free-speech-concerns-persist/", "https://righttolifeleague.org/urge-a-veto-on-sb-742/", "https://righttolifeleague.org/urge-a-veto-on-sb-742/", "https://lifelegaldefensefoundation.org/life-legal-defends-pro-life-speech-against-newsom-power-grab/", "https://www.liveaction.org/news/three-families-say-thank-pro-life-sidewalk-counselors/", "https://lifelegaldefensefoundation.org/life-legal-defends-pro-life-speech-against-newsom-power-grab/", "https://www.sacbee.com/news/politics-government/capitol-alert/article254595807.html", "https://www.40daysforlife.com/en/", "https://www.liveaction.org/news/napa-city-council-free-speech-planned-parenthood/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Amanda Vicinanzo"], "publish_date": "2021-10-13T16:37:10-05:00"}