{"result_id": "192017", "URL": "https://www.liveaction.org/news/guide-fetal-cell-lines-aborted-vaccine-development/", "timestamp": "2023-04-25 16:17:09 CEST+0200", "meta": {"description": "The bodies of preborn babies have been harvested for vaccine development for decades. Multiple fetal cell lines in use can be traced back to preborn babies.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/guide-fetal-cell-lines-aborted-vaccine-development/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "A guide to human fetal cell lines from aborted children used in vaccine development", "cleaned_text": "The bodies of preborn babies have been harvested for vaccine development and testing for decades dating back as far as the 1960s. There are multiple aborted fetal cell lines currently in use, and each one can be traced back to a preborn baby.\n\nMRC-5 is derived from the lungs of a 14-week normal male fetus. MRC-5 stands for “Medical Research Council,” a UK research center funded by British taxpayers, according to LifeIssues.net. The cell line was developed by J.P. Jacobs in September 1966 after an abortion was committed on a physically healthy 27-year-old woman for “psychiatric reasons.”\n\nIn the Journal of Biological Standardization, Jacobs wrote, “The cells were derived from the lungs of a 14-week-old normal male foetus at our laboratories in 1966. The family history was genetically normal; there was no indication of any congenital abnormalities and no sign of neoplastic disease at abortion.”\n\nAccording to Rene Leiva, M.D., author of “A Brief History of Human Diploid Cell Strains,” published by the National Catholic Bioethics Quarterly, Jacobs also reported creating a second cell strain. MRC-9 was created from the lungs of a different aborted baby, a female approximately 15 weeks gestation in 1974. The baby’s 14-year-old mother allegedly had the abortion because she was unmarried.\n\nWI-38 was developed from the lung tissue of a three-month-old preborn female baby. “WI” stands for Wistar Institute, a scientific institute located on the campus of the University of Pennsylvania in Philadelphia, where biologist Leonard Hayflick was working on a cell line using the lungs of aborted children for vaccines in the early 1960s. The number 38 refers to the preborn child from which the cells were obtained. According to National Geographic, Hayflick obtained aborted children from the University of Pennsylvania Hospital for some of his research, but the aborted female child used to develop WI-38 came from Sweden, where the mother aborted at a hospital in 1962 because she felt she had too many children. Her baby, measuring about 20 centimeters long, was dissected at the Karolinska Institute in the lab of virologist Sven Gard.\n\n“There, the lungs were dissected, packed on ice and dispatched to the airport, where they were loaded onto a transatlantic flight. A few days later, Leonard Hayflick…at the Wistar Institute for Anatomy and Biology in Philadelphia, Pennsylvania, unpacked that box,” reported Nature.\n\nThe Embryo Project at Arizona State University writes, “Hayflick cultured fetal lung tissues which he had received from male and female fetuses, and which he named the male derived cells WI-26 and the female derived cells WI-38 and WI-44.”\n\n“Hayflick and his collaborators (including Anthony Girardi from the Merck Institute for Therapeutic Research) started working with these cell strains to develop viral vaccines: a poliovirus vaccine was developed in the WI-1 cell strain in 1962….Finally, after these improvements in the technique, Hayflick published his reports of the development of WI-38,” Dr. Leiva stated.\n\nREAD: What you need to know about the COVID-19 vaccines\n\n“Walvax-2 was derived from a fetal lung tissue, similar to WI-38 and MRC-5, and was obtained from a 3-month-old female fetus aborted because of the presence of a uterine scar from a previous caesarean birth by a 27-year-old healthy woman,” according to Chinese researchers in a 2015 study.\n\nIn an article titled, “Characteristics and viral propagation properties of a new human diploid cell line, Walvax-2, and its suitability as a candidate cell substrate for vaccine production,” researchers state that the aborted child was provided by the Department of Obstetrics and Gynecology of Yunnan Hospital, with legal and ethical agreements from the donor.\n\nHEK293 was derived from the kidney of an aborted baby in the Netherlands in the 1970s. According to CourtHouseNews,”The original cells were transformed and immortalized in January 1973 by a young Canadian postdoc by the name of Frank Graham, who was working at the time in Leiden, the Netherlands in the laboratory of Professor Alex van der Eb. Normally, a cell has a finite number of divisions, but Graham managed to modify these cells so that they divide ad infinitum. This was his 293rd experiment, hence the name of the line (HEK stands for ‘human embryonic kidney cells’).”\n\nA transcript of a May 2001 committee of the U.S. Food and Drug Administration (FDA) Vaccines and Related Biological Products Advisory Committee quotes Dr. Alex van der Eb in part:\n\nThe kidney of the fetus was, with an unknown family history, was obtained in 1972 probably. The precise date is not known anymore. The fetus, as far as I can remember was completely normal. Nothing was wrong. The reasons for the abortion were unknown to me. I probably knew it at that time, but it got lost, all this information.\n\nAlvin Wong, M.D. investigated this cell line and published his finding in the National Catholic Bioethics Quarterly, where he wrote, “In examining the issue further, it appears that in all probability the cells were obtained from the embryo of a willfully induced abortion.”\n\nPER.C6 originated from human embryonic retina cells from an 18 week old, aborted baby in 1985. About this cell line, Wong wrote, “In the FDA proceedings, Dr. Alex Van Der Eb admits that the fetus was ‘completely normal.’ He later gives testimony to the development of PER.C6 (human embryonic retinal cells), in which the evidence that it was obtained from a willfully induced abortion is undeniable. Again, it was a ‘healthy fetus.’ PER.C6 is used for similar purposes as HEK 293 in the field of gene therapy.”\n\nDr. Alex Van Der Eb told the FDA, “So what I would like to do is to describe to you how and why we have made two different cell lines, adenovirus transformed human embryo cell lines which are called 293 and PER.C6. Both cell lines were made in my lab, and also the cells, the starting material, was prepared by myself at the University of Leiden. The 293 cell was made by Frank Graham in 1973 from human embryonic kidney cells that were made from fetal tissue one year ago by myself one year before that, so that was… probably in 1972, whereas the PER.C6 cell was made by Ron Bout and Frits Fallaux in 1995 from an embryonic retina cultures that were made from fetal tissue by me ten years before that, in 1985,” he stated.\n\nHe added, “We had no donor information on 293 or what was available got lost, and this is available for PER.C6.”\n\nDr. Alex van der Eb described the circumstances of the abortion:\n\nSo I isolated retina from a fetus, from a healthy fetus as far as could be seen, of 18 weeks old. There was nothing special with a family history or the pregnancy [which] was completely normal up to the 18 weeks, and it turned out to be a socially indicated abortus’, abortus provocatus, and that was simply because the woman wanted to get rid of the fetus…\n\n… The mother was completely normal…. there was nothing wrong with the mother. She had at least two children afterwards in the same hospital in Leiden, which were completely healthy. The father was not known, not to the hospital anymore; what was written down [was there was an] unknown father, and that was, in fact, the reason why the abortion was requested.\n\nEthical concerns surrounding abortion-derived fetal cell lines in vaccines continue, even as several COVID-19 vaccines are revealed to have been developed and/or tested using one or more of these aborted human fetal cell lines. A list of each vaccine’s development and testing has been published by the Charlotte Lozier Institute (CLI).\n\nLive Action’s statement on COVID-19 vaccines is published here.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "A guide to human fetal cell lines from aborted children used in vaccine development", "description": "The bodies of preborn babies have been harvested for vaccine development for decades. Multiple fetal cell lines in use can be traced back to preborn babies.", "url": "https://www.liveaction.org/news/guide-fetal-cell-lines-aborted-vaccine-development/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Analysis", "article:published_time": "2020-12-30T07:35:05-05:00", "article:modified_time": "2020-12-29T15:59:52-05:00", "updated_time": "2020-12-29T15:59:52-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2020/12/GettyImages-495311747-vaccine.jpg", "image:width": "1194", "image:height": "650"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "355", "embed_code": "<iframe src=\"https://www.youtube.com/embed/NdFCT-XY_Pk\" width=\"640\" height=\"355\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/NdFCT-XY_Pk"}], "links": ["https://www.fda.gov/vaccines-blood-biologics/vaccines/vaccines-licensed-use-united-states", "https://www.liveaction.org/news/shingles-vaccine-babies-dont-die/", "http://www.lifeissues.net/writers/tay/tay_20abrchickenpoxvac.html", "https://www.nature.com/articles/227168a0", "https://vacunasaep.org/sites/vacunasaep.org/files/jacobs-1976_doi10.10160092-11577690018-4.pdf", "https://www.pdcnet.org/ncbq/content/ncbq_2006_0006_0003_0443_0451", "https://embryo.asu.edu/pages/limited-vitro-lifetime-human-diploid-cell-strains-1964-leonard-hayflick", "http://www.the-scientist.com/?articles.view/articleNo/42256/title/Of-Cells-and-Limits/", "https://www.nationalgeographic.com/news/2017/02/vaccine-race-history-science-politics-meredith-wadman/", "http://ki.se/en/startpage", "https://www.nature.com/news/medical-research-cell-division-1.13273?src=longreads", "https://embryo.asu.edu/pages/limited-vitro-lifetime-human-diploid-cell-strains-1964-leonard-hayflick", "https://www.pdcnet.org/ncbq/content/ncbq_2006_0006_0003_0443_0451", "https://www.liveaction.org/news/what-you-need-know-covid-19-vaccines/", "https://www.liveaction.org/news/vaccines-fetal-cells-moral-dilemma/", "https://www.tandfonline.com/doi/pdf/10.1080/21645515.2015.1009811", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4526020/", "https://www.politifact.com/factchecks/2020/nov/18/facebook-posts/oxford-astrazeneca-vaccine-does-not-contain-aborte/", "https://www.courthousenews.com/how-fetal-cells-from-the-1970s-power-medical-innovation-today/", "https://web.archive.org/web/20030329164343/https://www.fda.gov/ohrms/dockets/ac/01/transcripts/3750t1_01.pdf", "https://www.ncis.com.sg/For-Patients-and-Visitors/Pages/Find-a-Doctor-Details.aspx?docid=Wong_Seng_Cheong_Alvin", "https://www.pdcnet.org/ncbq/content/ncbq_2006_0006_0003_0473_0495", "https://www.pdcnet.org/ncbq/content/ncbq_2006_0006_0003_0473_0495", "https://web.archive.org/web/20030329164343/https://www.fda.gov/ohrms/dockets/ac/01/transcripts/3750t1_01.pdf", "https://web.archive.org/web/20030329164343/https://www.fda.gov/ohrms/dockets/ac/01/transcripts/3750t1_01.pdf", "https://lozierinstitute.org/update-covid-19-vaccine-candidates-and-abortion-derived-cell-lines/", "https://www.liveaction.org/news/what-you-need-know-covid-19-vaccines/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Carole Novielli"], "publish_date": "2020-12-30T07:35:05-05:00"}