{"result_id": "192009", "URL": "https://www.liveaction.org/news/truth-covid-19-vaccines-cells-aborted-tissue/", "timestamp": "2023-04-25 16:17:04 CEST+0200", "meta": {"description": "While some COVID-19 vaccines in development do use fetal cell lines, most do not, and the majority \"do not have any ethical concerns,\" said Dr. Prentice.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/truth-covid-19-vaccines-cells-aborted-tissue/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "The truth about COVID-19 vaccines, cells from aborted children, and 'fetal tissue' research", "cleaned_text": "As the COVID-19 pandemic continues to rage across the nation, some groups and politicians are increasingly urging the Trump administration to lift its restrictions on National Institutes of Health (NIH) research using the bodies of aborted children, often referred to simply as “fetal tissue.” Multiple media articles, in outlets like Vox and the Washington Post, are claiming that the restrictions are preventing scientists from finding a treatment for COVID-19. Now, as researchers get closer to finding a vaccine, concerns about research using aborted babies’ bodies are growing, among both pro-lifers and abortion supporters.\n\nEven though the restrictions are not hindering research on treatments for COVID-19, the myth continues to spread. “The Trump admin refuses to lift its baseless restrictions on human fetal tissue research, which is preventing our nation’s scientists from advancing studies to find treatments and cures for coronavirus,” Rep. Diana DeGette tweeted, and also released a statement. “These restrictions, which include an ethics panel to review requests for this kind of research that has yet to be set up, have made some medical research amid the devastating coronavirus pandemic nearly impossible,” she wrote.\n\nDespite the claims that no one is able to conduct research without using aborted children, pharmaceutical companies around the world are working to make a vaccine against COVID-19. Some pro-lifers are expressing concern, claiming they’re being made with aborted fetal cells. So what’s really going on?\n\nDr. David Prentice, Vice President and Research Director for the Charlotte Lozier Institute, told Live Action News that at this time, “No vaccines [for the coronavirus] have yet been developed, though there are a lot (over 40) proposed or under development; but only a few are even at initial testing stage yet. Among those proposed there are some that raise concern because they use an abortion-derived cell line as part of the process.”\n\nWhile some of the vaccines in development are using fetal cell lines, most are not. “The vast majority of proposed vaccines [for COVID-19] do not have any ethical concerns,” Prentice said.\n\n“There are indeed some potential vaccines against the virus that causes COVID-19 (SARS-CoV-2) that are produced using abortion-derived fetal cell lines, including PER.C6 and HEK293 cell lines,” Prentice noted. “These were derived from abortions in the 1970’s and 1980’s, not from ongoing abortion, and they are not fetal tissue, but their origin makes them ethically tainted,” Prentice said. “In these cases, the cell lines are not used to produce the coronavirus itself, but rather bits of SARS-CoV-2 DNA packaged in a carrier virus, and these carrier viruses are what is given in the vaccine. The tainted cells themselves are not contained in the vaccine, but they are used as factories to produce the carrier virus.”\n\nDr. Prentice added that “ of the proposed vaccines or treatments use fresh aborted fetal tissue.” And when it comes to vaccines and cells from aborted children, “The tainted cells themselves are not contained in any vaccine,” he emphasized. “Instead, the cells are used as factories to produce the carrier virus, and it’s the carrier virus or pieces of DNA that are used in the vaccine.”\n\nYet there are possible alternatives. “There are actually many licitly-produced vaccines under consideration, including vaccines using insect cells, ethically-derived human cells, and some that use no cells at all,” Prentice explained. “It’s important that we advocate for such vaccines and treatments so that all people can access new vaccines in good conscience.”\n\nThe issue of whether or not the vaccines grown in fetal cell lines can be used is a complicated one, however. Refusing vaccines, even those grown in fetal cell lines, can cause vulnerable people, like pregnant women and their preborn children, to be at risk for dangerous diseases.\n\nJohn Di Camillo, an ethicist with the National Catholic Bioethics Center, spoke to Live Action News about the ethics of the potential vaccines. “The Church’s clearest teaching on this is in ‘Dignitas Personae’ from 2008,” he explained. “If we are talking about the use of cell lines that were developed through the use of tissue from aborted fetuses, there is an obligation for researchers to avoid the use of such biological material, and to make use of sound materials that aren’t associated with such immorality.”\n\nYet if a vaccine using the fetal cell lines is the only one available, Di Camillo said, “One is allowed to make use of it where there’s a serious threat to the health or life of the individual, or of the greater population. This does not amount to a strict obligation to use it, but it certainly can be a legitimate choice in conscience if there’s that serious reason, and there’s no other reasonable alternative.”\n\nIt’s still too early to know what will ultimately happen with COVID-19, vaccines, and other potential treatments. But what is certain is that vaccines can be created without using fetal cell lines, and the bodies of aborted children are not necessary for medical research and advancements — not even during the COVID-19 pandemic.\n\nEditor’s Note: This article originally stated that there was a ban on research using aborted children. We have clarified that the restrictions are on the NIH for research using aborted children. We regret this oversight.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "The truth about COVID-19 vaccines, cells from aborted children, and 'fetal tissue' research", "description": "While some COVID-19 vaccines in development do use fetal cell lines, most do not, and the majority \"do not have any ethical concerns,\" said Dr. Prentice.", "url": "https://www.liveaction.org/news/truth-covid-19-vaccines-cells-aborted-tissue/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Analysis", "article:published_time": "2020-04-17T08:00:48-05:00", "article:modified_time": "2020-04-18T12:32:24-05:00", "updated_time": "2020-04-18T12:32:24-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2020/04/GettyImages-1209810853.jpg", "image:width": "1024", "image:height": "683"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The Trump admin refuses to lift its baseless restrictions on human fetal tissue research, which is preventing our nation's scientists from advancing studies to find treatments and cures for coronavirus.</p>\n<p>We're calling on HHS Secretary Azar to immediately lift these restrictions. <a href=\"https://t.co/ysjtfNLVDc\">pic.twitter.com/ysjtfNLVDc</a></p>\n<p>— Rep. Diana DeGette (@RepDianaDeGette) <a href=\"https://twitter.com/RepDianaDeGette/status/1247292626858119168?ref_src=twsrc%5Etfw\">April 6, 2020</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "355", "embed_code": "<iframe src=\"https://www.youtube.com/embed/87lKaP0OtVg\" width=\"640\" height=\"355\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/87lKaP0OtVg"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "355", "embed_code": "<iframe src=\"https://www.youtube.com/embed/NdFCT-XY_Pk\" width=\"640\" height=\"355\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/NdFCT-XY_Pk"}], "links": ["https://www.foxnews.com/politics/trump-administration-ends-fetal-tissue", "https://www.vox.com/policy-and-politics/2020/3/19/21186743/coronavirus-treatment-research-delay-trump-fetal-tissue-ban", "https://www.washingtonpost.com/health/trump-ban-on-fetal-tissue-research-blocks-coronavirus-treatment-effort/2020/03/18/ddd9f754-685c-11ea-abef-020f086a3fab_story.html", "https://www.sciencemag.org/news/2019/06/trump-administration-restricts-fetal-tissue-research", "https://www.liveaction.org/news/covid-19-ban-aborted-babies-research/", "https://twitter.com/RepDianaDeGette/status/1247292626858119168", "https://degette.house.gov/media-center/in-the-news/degette-lift-trump-ban-on-fetal-tissue-research-to-find-covid-19-cure", "https://t.co/ysjtfNLVDc", "https://twitter.com/RepDianaDeGette/status/1247292626858119168?ref_src=twsrc%5Etfw", "https://www.usnews.com/news/health-news/articles/2020-02-03/labs-worldwide-working-on-coronavirus-vaccine-but-rollout-could-take-time", "https://www.all.org/a-coronavirus-vaccine-containing-aborted-baby-cells-yes/", "https://lozierinstitute.org/", "https://www.ncbcenter.org/", "https://www.vatican.va/roman_curia/congregations/cfaith/documents/rc_con_cfaith_doc_20081208_dignitas-personae_en.html", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Cassy Fiano-Chesser"], "publish_date": "2020-04-17T08:00:48-05:00"}