{"result_id": "192034", "URL": "https://www.liveaction.org/news/vaccines-modern-medicine-end-reliance-fetal-cells/", "timestamp": "2023-04-25 16:17:18 CEST+0200", "meta": {"description": "Abortion has not just cast a shadow over vaccines, but over common household medications used by Americans on a daily basis.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/vaccines-modern-medicine-end-reliance-fetal-cells/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "Modern medicine must end the use of cells from aborted children", "cleaned_text": "Editor’s Note, 9/30/21: This article has been updated using further research revealing that many of the drugs listed as having a current association with aborted fetal cell lines were developed and created long before any fetal cell lines were used in the research, development, or testing of drugs. We regret this omission in the original publication of this article.\n\nIn 2020, the production of COVID-19 vaccines reignited a debate surrounding the ethics of using fetal cell lines derived from aborted children in the creation of such vaccines. As noted in a previous article published at Live Action News, “Live Action strongly condemns the use of abortion-derived cell lines in any stage of vaccine development (research, design, testing, or manufacturing) because these cell lines were created by violating the fundamental human rights of a preborn victim.”\n\nHowever, there is more beneath the surface, and the connection of modern medicine to abortion is deep and complicated — and must be broken.\n\nThe three COVID vaccines currently in use in the United States are from Pfizer, Moderna, and Johnson & Johnson. While Pfizer and Moderna used the fetal cell line HEK-293 (derived from the kidney of an aborted baby in the 1960s) in the testing phase of their vaccines, Johnson & Johnson used the fetal cell line PER.C6 (derived from the retinal tissue of an 18-week aborted baby boy in the Netherlands in the mid-1980s) in both the testing and production of its COVID-19 vaccine.\n\nThe news led many pro-lifers to denounce the vaccines and call for others to do the same. Johnson & Johnson was labeled as the most morally compromised because it utilized fetal cells for the actual production of the vaccine, though many argued against using any vaccine with any connection to fetal cell lines.\n\nFr. Matthew P. Schneider, LC, a Catholic priest, wrote an article for Patheos in January, in which he noted that modern medicine and abortion-derived fetal cell lines are deeply intertwined, claiming, “[I]f we reject a medication merely for being tested on a fetal cell line,” he explained, “most of a standard pharmacy would be immoral.”\n\nHowever, while many drugs are currently linked to testing using aborted fetal cell lines, this was not always the case — and this is important to note.\n\nA quick search on Google Scholar for common medications and HEK-293 (the most commonly used fetal cell line) yields countless results of the connection between HEK-293 and nearly every drug from Albuterol to Zithromax. It has been decades since the scientific research community began using fetal cell lines to both produce and test medications, vitamins, and vaccines. Completely phasing out the use of cells from aborted children is likely to take a number of years — and yet, as Live Action News previously noted, this should be the goal:\n\nUsing cell lines derived from the murders of innocent preborn children should not be normalized, and legal, financial, or market incentives for the harvesting of aborted children must be put to an end. These actors — lawmakers, pharmaceutical companies, and scientific researchers — should be strongly encouraged to develop alternative cell lines….\n\nIt isn’t just HEK-293 that yields these types of results on Google Scholar — it’s also WI-38, MRC-5, PER C6, WI-26, VA4, and Walvax-2. All are cell lines derived from children aborted decades ago and are used for vaccines such as rubella, chickenpox, hepatitis A, and shingles. But even if we only listed the medications or vaccines currently connected to HEK-293 through testing alone (as the Pfizer and Moderna COVID-19 vaccines are), that list would be unimaginably long.\n\nThis list includes Tylenol, Advil, Motrin, Aleve, Sudafed, Benadryl, Claritin, Robitussin, Mucinex, Tums, Maalox, Colace, Ex-Lax, Pepto-Bismol, Albuterol, Azithromycin, Lidocaine, and even the drug that endured such controversy early on in the COVID-19 pandemic: hydroxychloroquine.\n\nHowever, Fr. Schneider failed to note some important distinctions in his article when referencing these common medications. Dr. Brian Kopp of the Pro-Life Healthcare Alliance noted in a post at Creative Minority Report that “when [Schneider] researched these medications, he failed to distinguish those that were tested on, developed with and/or manufactured with fetal cells before or during their initial introduction, from those that, for academic reasons, years later were tested on fetal stem cell lines.” Kopp continued:\n\nFor instance, [Schneider] named multiple over the counter as well as prescription drugs that were developed well before 1960. But fetal stem cells were not initially isolated until 1963, and not actually utilized in drug testing and manufacture until years later.\n\nSo it’s important to realize that using those medications and vaccines in the meantime does not equal participation in or acceptance of abortion….\n\nJust because some academic or researcher somewhere subsequently did tests on that drug utilizing fetal stem cells, it does not mean those drugs were ethically tainted in their origin or subsequent manufacture or testing.\n\nAnd at Children of God for Life, Jose Trasancos, Ph.D., listed a host of medications that Schneider noted in his article, pointing out that these drugs, could not possibly have been developed using fetal cells because that practice did not even exist at the time they were created, adding:\n\nWhile any use of the remains of aborted children ought to be rejected by anyone who values the dignity of human life, these medicines do not exist ‘but for the use of’ those children’s bodies. These medicines were developed independently of such use. Later on, other researchers may have conducted tests on the already existing medicines using HEK-293 or some other aborted fetal cell line, but there is a distinction between medicines that would not be here but for the use of aborted children and those that were later tested.\n\nSchneider claimed, “If we were to disallow all remote cooperation, we would need to reject all of modern society more than contemplative nuns.” Fr. Schneider also stated that even the common and simple act of purchasing items made in China loosely connects us to the forced abortion the Chinese government has carried out on its citizens for decades.\n\nBut that doesn’t mean pro-lifers should simply accept it.\n\nLooking to the future\n\nPro-lifers can and should demand that new methods be created and utilized for developing and testing the medications and vaccines that benefit our health. For instance, in 2020, major pharmaceutical company Sanofi Pasteur discontinued the use of the MRC-5 fetal cell line from aborted children in the development of its polio vaccines. Instead, the company now uses Vero (monkey) cells. There are other avenues that can be explored as well, but the change cannot be accomplished overnight. It will take incentives and deadline goalposts as well as motivated individuals working in the field.\n\n“One thing that the ubiquity of HEK-293 brings up is that Catholics, especially those in the field, should work for other research methods,” encouraged Fr. Schneider. “Can we start a cell line from umbilical cord blood or from other ethical sources that could replace HEK-293 as a standard way to do in vitro tests? We need to encourage the move from HEK-293 to one or more ethical lines…”\n\nProgress can be made and it starts with pro-life individuals pushing back against the overwhelming use of aborted fetal cell lines created decades ago in the production and testing of medications and vaccines that we have come to rely on. But it also involves ending the trafficking of body parts from aborted children that is happening today in the U.S.\n\nPreborn babies are being killed right now and are being sold for parts to scientific research companies. Pro-life politicians must be encouraged to pass vital pro-life legislation. Pro-lifers must continue to expose the predatory abortion industry for profiting from the deaths of children and continue to educate Americans about abortion. They must also remain present outside abortion businesses to help women choose life.\n\nIt will be a long road to removing fetal cell lines completely from vaccine and medication research, but it is a direction we need to energetically and urgently pursue.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "Modern medicine must end the use of cells from aborted children", "description": "Abortion has not just cast a shadow over vaccines, but over common household medications used by Americans on a daily basis.", "url": "https://www.liveaction.org/news/vaccines-modern-medicine-end-reliance-fetal-cells/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:tag": "Kel editing", "article:section": "Investigative", "article:published_time": "2021-04-16T09:36:10-05:00", "article:modified_time": "2021-10-02T17:42:55-05:00", "updated_time": "2021-10-02T17:42:55-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2020/04/GettyImages-1208534181-coronavirus.jpg", "image:width": "1194", "image:height": "653"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.liveaction.org/news/guide-fetal-cell-lines-aborted-vaccine-development/", "https://www.liveaction.org/news/what-you-need-know-covid-19-vaccines/", "https://www.patheos.com/blogs/throughcatholiclenses/2021/01/if-any-drug-tested-on-hek-293-is-immoral-goodbye-modern-medicine/", "https://www.liveaction.org/news/what-you-need-know-covid-19-vaccines/", "https://creativeminorityreport.com/blog/2021/09/02/not-so-fast-the-very-misleading-article-by-a-priest-on-drugs-and-abortion-testing/", "https://cogforlife.org/2021/09/21/14-medicines-fr-matthew-schneider-claimed-use-aborted-fetal-cell-lines-but-do-not/", "https://www.liveaction.org/news/manufacturer-discontinues-aborted-cell-polio-vaccine/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Nancy Flanders"], "publish_date": "2021-04-16T09:36:10-05:00"}