{"result_id": "192029", "URL": "https://www.liveaction.org/news/what-you-need-know-covid-19-vaccines/", "timestamp": "2023-04-25 16:17:16 CEST+0200", "meta": {"description": "There is news that safe and effective COVID-19 vaccines are becoming available, yet troubling reports say many utilized cell lines from aborted children.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/what-you-need-know-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "What you need to know about the COVID-19 vaccines", "cleaned_text": "FINAL EDITOR’S NOTE, 1/10/22: Live Action News continues to monitor all vaccine development that potentially violates the right to life of preborn children, including COVID-19 vaccines that are still in production. However, Live Action News will provide no further editorial updates or corrections to this article due to its age. We encourage readers to follow the Lozier Institute’s more recent updates on COVID-19 vaccine development.\n\n12/24/20: The coronavirus pandemic has claimed more than one and a half million lives worldwide, including many from vulnerable populations like the elderly and people with comorbidities. Many people are rightly concerned about the health and safety of their families and loved ones.\n\nThere is news that safe and effective COVID-19 vaccines are becoming available, yet troubling reports have emerged that many of these vaccines were developed and/or tested using cell lines derived from aborted children.\n\nLive Action strongly condemns the use of abortion-derived cell lines in any stage of vaccine development (research, design, testing, or manufacturing) because these cell lines were created by violating the fundamental human rights of a preborn victim.\n\nPolitical leaders and lawmakers around the world must take immediate steps to disincentivize the scientific community and pharmaceutical companies from using these cell lines in any stage of research and development and, when possible, impose legal sanctions.\n\nLeading pro-life ethicists say consumers may take a vaccine in good conscience despite the ongoing evil actions of pharmaceutical companies. As they explain, people taking a vaccine created with abortion-derived cell lines are not committing a moral evil because they are not directly participating in the act of abortion that led to the creation of these cell lines. In many cases, the cell lines being used were originally derived from abortions committed in the early 1970s.\n\nThe moral wrong was already committed by the abortionist and the mother who killed the child, while the pharmaceutical companies engage in an ongoing evil by using abortion-derived cell lines for medical research, testing, and manufacturing.\n\nAs citizens and consumers who believe in protecting human life, we must be educated and informed about which vaccines are ethically compromised. It is our responsibility to actively resist efforts by lawmakers, pharmaceutical companies, and medical researchers, to continue using abortion-derived cell lines to develop vaccines.\n\nConcerned citizens may wish to call or write to representatives and elected leaders, urging them to ban the use of abortion-derived cell lines in medical research. Citizens may also wish to organize community or church letter-writing campaigns to these pharmaceutical companies demanding that they stop using abortion-derived cell lines for medical research.\n\nHow are these ethically compromised cell lines used?\n\nThe practice of using abortion-derived cell lines in vaccine development goes back decades, and the most commonly used include MRC-5, HEK-293, and PER C6. These cell lines are derived from children who were aborted between the 1960s and 1970s. [Editor’s Note, 1/10/22: We previously listed other abortion-derived cell lines which do not appear on Lozier Institute’s most recent vaccine update, one of which may been have derived from an abortion as late as 2015.]\n\nResearch using these lines has led to vaccines for rubella, chickenpox, hepatitis A, and shingles. For instance, a common rubella vaccine was developed using the WI-38 cell line, which was derived from the cells of a baby girl aborted in the 1960s because the family felt they had too many children.\n\nRubella is a serious disease, especially dangerous for pregnant women and their preborn babies. A major US outbreak in 1964 caused thousands of miscarriages, 11,600 cases of babies born deaf, and 3,580 cases of blindness.\n\nAs noted in a 2005 statement from the Vatican’s Pontifical Academy for Life, the development of a vaccine for a disease like rubella represents a scientific “milestone” in the fight to eradicate highly contagious diseases. The Vatican statement also says that a consumer who takes a vaccine developed with these cell lines is not formally cooperating in abortion.\n\nStill, the use of these abortion-derived cell lines to develop vaccines poses alarming “ethical problems” for society, which must be addressed by lawmakers and decision-makers in the medical and scientific communities.\n\nIn fact, the same Vatican statement makes it clear that “those who prepare the vaccines” and “those who participate in the mass marketing” of the vaccines have a high degree of moral culpability because they (unlike consumers) are in a position to be able to reduce or end the ongoing practice of using abortion-derived cell lines.\n\nUsing cell lines derived from the murders of innocent preborn children should not be normalized, and legal, financial, or market incentives for the harvesting of aborted children must be put to an end. These actors — lawmakers, pharmaceutical companies, and scientific researchers — should be strongly encouraged to develop alternative cell lines for vaccine research.\n\nWhich vaccines were created with the use of abortion-derived cell lines?\n• Pfizer : The Pfizer vaccine that has received from the Food and Drug Administration (FDA) is with abortion-derived cells. However, the abortion-derived cell lines were used in at least one confirmatory lab test. This cell line comes from the kidney tissue of a baby girl who was killed in an abortion committed in the Netherlands in the early 1970s.\n• Moderna , relied on the HEK-293 cell line for testing, but not in manufacturing. Regarding the Moderna and Pfizer vaccines, some pro-life commenters have said these vaccines are ethically “ .” Theologian John Hass of the National Catholic Bioethics Center (NCBC) has said their “connection” to abortion is distant since the HEK-293 line was not used in the manufacturing process, although Hass stopped short of calling these vaccines ethically uncontroversial. The (USCCB) has also stated the Pfizer and Moderna vaccines “are not completely free from any connection to abortion” since both companies used HEK-293 for confirmatory lab testing.\n• Sanofi Pasteur : The Sanofi Pasteur vaccine, funded and developed in partnership with using the HEK-293 cell line. Sanofi Pasteur is also developing a vaccine in partnership with which appears to have used no abortion-derived cell lines in its . Sanofi and GSK are not as advanced in clinical trials as other companies like Pfizer, Moderna, or AstraZeneca. Sanofi expects to finish its Phase 2 trial by the end of 2020.\n• Novavax : According to the , Maryland-based drugmaker Novavax is “using an ethically-derived invertebrate cell line Sf9” in testing its vaccine, which is currently in . Companies like Novavax and Sanofi are clearly demonstrating that safe and effective COVID-19 vaccines can be developed without reliance on abortion-derived cell lines. is among a handful of vaccines that may be available in the United States as soon as tested using HEK-293 cells.] . [Editor’s Note, 12/20/21: The Lozier Institute notes that this vaccine wasusing HEK-293 cells.]\n• AstraZeneca: Currently in Phase 3 clinical trials, AstraZeneca is using abortion-derived HEK-293 cell lines in testing and manufacturing.\n• Johnson and Johnson : Johnson and Johnson, which is also currently in Phase 3 clinical trials, is using abortion-derived PER.C6 cell lines in testing and manufacturing. The line was taken from the retinal tissue of a boy at 18 weeks, aborted in the Netherlands in the mid-1980s.\n\nMany of the vaccines under development, including Pfizer and Moderna, were developed using a novel approach to vaccine research called messenger RNA (mRNA). The mRNA vaccines teach cells to make a protein in order to trigger an immune response, whereas commonly known vaccines place a weakened germ into the body. The process of developing and manufacturing mRNA vaccines can be much faster than conventional methods, which makes the approach exciting to many as a medical breakthrough.\n\nAccording to the Centers for Disease Control and Prevention (CDC) “there are limited data available on the safety of COVID-19 vaccines for people who are pregnant.” However, the CDC also says: “While studies have not yet been done, based on how mRNA vaccines work, experts believe they are unlikely to pose a risk for people who are pregnant.” Further studies, however, will be needed to determine the safety profile for those who are pregnant.\n\nThe CDC warns that pregnant women are at heightened risk for severe illness from COVID-19, and should discuss the decision to receive a vaccination with their clinician.\n\nLive Action has been at the forefront of defending preborn children against the horrific practice of harvesting aborted babies for medical research.\n\nThe routine practice of using decades-old fetal cell lines derived from aborted babies is, alarmingly, just the tip of the iceberg.\n\nIn a recent University of Pittsburgh study, the skin of an aborted baby was grafted onto rodents to study skin infections and the human immune system. The child’s mother consented to this experimentation when she aborted her baby. This study was paid for in part with grants from the National Institutes of Health, a government agency.\n\nAccording to Father Tadeusz Pacholczyk of NCBC, “a mother automatically disqualifies herself from being able to give valid consent to use the child’s remains whenever she intentionally and directly causes that child’s death.”\n\nIn 2019, the Trump administration changed National Institutes of Health (NIH) rules on grantmaking, prohibiting applicants from using aborted human fetal tissue in research without a justification for why no alternative is available. This policy applies to all NIH grants after October of 2019. The University of Pittsburgh study appears to have been funded in part by NIH.\n\nIf we continue to allow this kind of barbarity to happen in universities and research labs, the market for harvesting aborted children will continue to expand to the point that every drug, vaccine, therapy, and treatment you use might have been developed by medical research that can be linked to back to an abortion.\n\nUnfortunately, our lawmakers continue to permit and even reward the use of abortion-derived cell lines in medical research.\n\nAt the beginning of the pandemic, the Trump administration launched Operation Warp Speed to “accelerate the development, manufacturing, and distribution of COVID-19 vaccines, therapeutics, and diagnostics.”\n\nThe Department of Health and Human Services (HHS), through the Biomedical Advanced Research and Development Authority (BARDA) has administered billions in grant funds to accelerate vaccine research, including $483 million to Moderna, more than $1 billion to AstraZeneca, and $456 million to Johnson and Johnson.\n\nIn fact, many of the most prominent pharmaceutical companies received BARDA funding to develop their vaccines and will likely continue to receive BARDA funding.\n\nIt is alarming that more than $1 billion taxpayer subsidies have already funded companies using abortion-derived cell lines. Any taxpayer-subsidized medical research should be conditioned on using ethical research practices. That means companies using abortion-derived cell lines in their research and development should not be receiving federal funds from BARDA or any other government entity.\n\nEditor’s Note: Readers may also find the following link helpful: A guide to human fetal cell lines from aborted children used in vaccine development\n\nEditor’s Note, 9/7/21: For further updates regarding vaccines, visit the Lozier Institute.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "What you need to know about the COVID-19 vaccines", "description": "There is news that safe and effective COVID-19 vaccines are becoming available, yet troubling reports say many utilized cell lines from aborted children. ", "url": "https://www.liveaction.org/news/what-you-need-know-covid-19-vaccines/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Analysis", "article:published_time": "2020-12-24T17:20:38-05:00", "article:modified_time": "2023-01-22T22:26:42-05:00", "updated_time": "2023-01-22T22:26:42-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2020/12/GettyImages-1250234582-covid-vaccine.jpg", "image:width": "1196", "image:height": "650"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lozierinstitute.org/what-you-need-to-know-about-the-covid-19-vaccine/", "https://www.worldometers.info/coronavirus/coronavirus-death-toll/", "https://www.catholicnews.com/bishops-in-canada-spain-remind-catholics-of-importance-of-the-elderly/", "https://www.fathertad.com/files/6516/1377/4265/MSOB185_Must_Catholics_Refuse_a_COVID-19_Vaccine_Made_With_a_Cell_Line_from_an_Abortion_Updated.pdf", "https://www.catholicnews.com/update-use-of-pfizer-moderna-covid-19-vaccines-is-morally-acceptable-say-bishops/", "https://s27589.pcdn.co/wp-content/uploads/2020/12/12.04.20-warp-speed-vaccines.pdf", "https://www.ncregister.com/news/vatican-issues-doctrinal-note-in-anti-covid-19-vaccines-full-text?fbclid=IwAR1k6NUle8pvFliDZLxomYBCnPWRZ2fBTkP7UQNCE8VQSV42f3JdY4rBbvk", "https://www.ncregister.com/cna/us-bishops-approve-use-of-coronavirus-vaccines-with-remote-connection-to-abortion", "https://www.ncbcenter.org/resources-and-statements-cms/n-statement-on-the-covid-19-vaccinecbc?rq=Points%20to%20Consider%20on%20the%20Use%20of%20COVID-19%20Vaccines", "https://www.ncbcenter.org/resources-and-statements-cms/faq-on-the-use-of-vaccines", "https://immunize.org/talking-about-vaccines/vaticandocument.htm", "https://www.fda.gov/emergency-preparedness-and-response/coronavirus-disease-2019-covid-19/pfizer-biontech-covid-19-vaccine", "https://catholicherald.co.uk/breakthrough-vaccine-does-not-use-cell-lines-from-aborted-children/", "https://s27589.pcdn.co/wp-content/uploads/2020/12/COVID-19-Vaccine-Candidates-and-Abortion-Derived-Cell-Lines.pdf", "https://www.ncregister.com/news/what-connection-does-moderna-s-vaccine-have-to-aborted-fetal-tissue", "https://www.nih.gov/news-events/news-releases/statement-nih-barda-fda-emergency-use-authorization-moderna-covid-19-vaccine", "https://www.cbsnews.com/video/pfizer-moderna-vaccines-covid-19-compared/", "https://www.catholicworldreport.com/2020/07/28/is-the-coronavirus-vaccine-made-from-fetal-cell-lines/", "https://www.usccb.org/resources/memo-to-bishops-on-vaccines-for-covid-19.pdf", "https://www.biorxiv.org/content/10.1101/2020.10.14.337535v1.full", "https://s27589.pcdn.co/wp-content/uploads/2020/12/COVID-19-Vaccine-Candidates-and-Abortion-Derived-Cell-Lines.pdf", "https://www.cnbc.com/2020/10/28/sanofi-gsk-to-provide-200-million-covid-vaccine-doses-to-who-immunization-program.html", "https://s27589.pcdn.co/wp-content/uploads/2020/12/COVID-19-Vaccine-Candidates-and-Abortion-Derived-Cell-Lines.pdf", "https://www.pop.org/which-covid-19-vaccines-are-being-developed-with-fetal-cell-lines-derived-from-aborted-babies/", "https://ir.novavax.com/news-releases/news-release-details/novavax-provides-phase-3-covid-19-vaccine-clinical-development", "https://nypost.com/2020/07/07/novavax-gets-1-6b-from-government-to-develop-coronavirus-vaccine/", "https://www.cnbc.com/2020/12/08/bill-gates-says-six-covid-vaccines-could-be-available-by-spring-2021.html", "https://lozierinstitute.org/what-you-need-to-know-about-the-covid-19-vaccine/", "https://www.lifeissues.org/2012/04/293-per-c6-cell-lines-using-ad5/", "https://www.health.harvard.edu/blog/why-are-mrna-vaccines-so-exciting-2020121021599", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/mrna.html", "https://www.wfaa.com/article/news/health/coronavirus/vaccine/what-is-an-mrna-covid-19-vaccine-and-how-does-it-differ-from-other-vaccines/287-240b8181-f13f-47a4-9514-9b6b30988d32", "https://www.salon.com/2020/12/05/mrna-history-vaccines-coronavirus-moderna-immunology-lipid-nanoparticles/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html", "https://www.ncregister.com/blog/how-aborted-children-are-used", "https://www.ncregister.com/news/will-ethical-covid-vaccines-arrive-at-warp-speed", "https://www.washingtonpost.com/health/nih-issues-strict-new-requirements-for-fetal-tissue-research-funding/2019/07/26/e9f7e6f8-afdf-11e9-bc5c-e73b603e7f38_story.html", "https://grants.nih.gov/grants/policy/nihgps/html5/section_4/4.1.14_human_fetal_tissue_research.htm", "https://www.washingtonexaminer.com/opinion/op-eds/defund-grotesque-taxpayer-funded-human-fetal-tissue-experiments-on-lab-animals", "https://www.nature.com/articles/s41598-020-71548-z#Ack1", "https://www.hhs.gov/about/news/2020/05/15/trump-administration-announces-framework-and-leadership-for-operation-warp-speed.html", "https://www.reuters.com/article/us-health-coronavirus-moderna-funding/moderna-receives-483-million-barda-award-for-covid-19-vaccine-development-idUSKBN21Y3E0", "https://www.medicalcountermeasures.gov/app/barda/COVIDTimeline.aspx#event-52", "https://www.cnn.com/2020/07/22/politics/republicans-stimulus-coronavirus-testing/index.html", "https://www.liveaction.org/news/guide-fetal-cell-lines-aborted-vaccine-development/", "https://lozierinstitute.org/what-you-need-to-know-about-the-covid-19-vaccine/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Newsroom"], "publish_date": "2020-12-24T17:20:38-05:00"}