{"result_id": "192033", "URL": "https://www.liveaction.org/news/documentary-exposes-abortion-industry-covid-19-africa/", "timestamp": "2023-04-25 16:17:18 CEST+0200", "meta": {"description": "Africa in particular has been receiving COVID relief funds from western nations — but as with many previous forms of aid, that help comes with a catch.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/documentary-exposes-abortion-industry-covid-19-africa/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "New documentary exposes how the abortion industry is exploiting COVID-19 in Africa", "cleaned_text": "The COVID-19 pandemic has affected virtually every country across the globe, with a tiny handful as the exception. And while everyone is struggling, those in developing countries are in a more desperate position than most. Africa in particular has been receiving COVID relief funds from western nations — but as with many previous forms of aid, that help comes with a catch.\n\nObianuju Ekeocha, a Nigerian biomedical scientist, is the founder of Culture of Life Africa. A new documentary released by the pro-life organization, “Africa’s Pandemic: A Gateway To Neocolonialism,” reveals how global relief funds are being used in yet another attempt to force African countries to liberalize their abortion laws. Featuring a panel of international and African experts, “Africa’s Pandemic” uncovers the ideological agenda of abortion in Africa, and how the abortion industry is exploiting the pandemic for its own financial gain.\n\nREAD: While Africa asks for ventilators and PPE during COVID-19, groups send abortion kits instead\n\n“Why is it that at this time, when countries and communities find themselves in the most vulnerable situation, should the abortion movement be moving to take advantage of these communities?” Ekeocha asked in the documentary. “Why is it that at a time like this, that some western leaders and western donors should be pushing for their own sexual and reproductive health and rights agenda? Why is it that at this time, the United Nations is coming out full force to align so perfectly with pro-abortion ideas and ideologies, and pro-abortion groups? Why exactly is it happening, and why now?”\n\n“Africa’s Pandemic” aims to answer those questions. Featured in the documentary are Elyssa Koren, Director of United Nations Advocacy for ADF International, Dr. Zacc Kawalala, Chairman of the Ethics, Peace and Justice Commission for the Evangelical Association of Malawi, and Joy B. Mdivo, Executive Director of the East African Centre for Law and Justice.\n\nKoren and Ekeocha discussed how abortion activists are insisting abortion should be deemed essential, for what Koren says is a specific reason: an international human right to abortion. Not long after the American College of Obstetricians and Gynecologists (ACOG) declared that abortion was an essential service, the World Health Organization (WHO) followed suit in April. “This time, they directed it specifically to governments,” Koren said. “They told governments, you have to ensure that abortion is offered as an essential service, to anyone that wants it, during the course of the pandemic.”\n\nCanada was the first to respond, using millions of dollars in COVID funding for ‘reproductive rights’ in developing nations. “And so, you run into, essentially, a catch-22,” Koren explained. “These are countries that need the COVID money, but at the same time, they want to protect the laws and policies they have in place that protect the right to life of the unborn.”\n\nThis behavior is something that Koren described as “humanitarian blackmail.”\n\nEarlier this year, the United Nations International Commission on Population and Development (ICPD) was supposed to produce a text focusing on the theme of nutrition, which would include pressing issues like the “burden of disease; hunger and undernutrition; and overweight and obesity.” As COVID has exacerbated existing problems with things like starvation in developing nations, aid from the United Nations was especially needed. Yet according to Koren, European nations refused to sign on to the text unless a right to abortion was included.\n\nIn Malawi, already-fragile health care systems were even more overloaded when the COVID-19 pandemic hit. Yet abortion advocates attempted to rush an abortion bill through parliament. “In the midst of a pandemic, mobilization starts again,” Dr. Zacc Kawalala said in the video. “Advocacy starts again, among our traditional leaders, among the clergy, among members of parliament, [to] be taken out to conferences and workshops, to be taught, you need to pass this bill of abortion — in the time when the country should have been focusing on COVID-19.”\n\nKawalala said some clergy and chiefs bought into this, and formed a pro-abortion coalition. Instead of using the media to talk about COVID-19 measures, Kawalala said they were instead being sent on air to discuss abortion — and in his case, to defend life. All the while, IPAS, a pro-abortion organization, was allegedly taking members of Parliament to lunches and dinners with the goal of persuading them to legalize abortion.\n\nThankfully, 125 out of the 188 MPs said no to legalizing abortion, despite pressure from abortion groups. The sponsors for these bills did not come from Malawi’s MPs; the funding for promoting legal abortion, according to Kawalala, came from IPAS and the Guttmacher Institute, two American abortion organizations. “The Malawians, the people in this country, are not for this bill!” Kawalala said. “It’s the worst trying to impose itself upon the laws of Malawi.”\n\nWhat Malawi actually needs to battle the pandemic, Kawalala said, is better maternity care and more schools so students can better socially distanced. Malawi does not need abortion.\n\nJoy B. Mdivo, Executive Director of the East African Centre for Law and Justice, reported from Kenya, where the response to COVID-19 was originally “robust.” But as the country implemented lockdown measures to prevent the spread of the virus, the economy in Kenya crashed, with over one million Kenyans losing their jobs. Children, meanwhile, were suffering in their education, as they lost much-needed time in school.\n\nLike in Malawi, a coordinated effort was launched amid the COVID-19 pandemic to advance an abortion bill, which had first been introduced late in 2019. “It was in all our news bulletins, in all the major news houses, it was in the media every single day,” Mdivo said. “It was in the print media, in the electronic media, on social media. Before people could even internalize what was going on, the bill was on the floor of the House, and it was being debated.”\n\nThere were few issues being debated at the time, due to the pandemic, with only “urgent national issues” meant to be taken up. “But this suddenly became an ‘urgent national issue,'” Mdivo said. “But the good thing is, we’ve had this fight for a long time. And so we’re able to recognize that this was actually a follow-up with what we saw last year with the ICPD.”\n\nChristians and Muslims alike, as well as health care professionals and parents’ groups, joined together to lobby against the bill. Polling found that 85% of Kenyans oppose abortion on demand, while international organizations attempt to force abortion on the country anyway.\n\nEkeocha has long criticized western nations for attempting to force abortion onto African countries, something she has described as “ideological colonization.” And that colonization is continuing, now under the guise of COVID-19 aid.\n\n“The effects of the pandemic have been devastating for Africans and on the economy of African nations, as well as on the already strained infrastructure throughout the continent, putting countries in a more dire situation,” Ekeocha said in a press release sent to Live Action News. “Some western donors including government and international institutions, have used this as an opportunity to insert an ideological agenda focused on so-called ‘sexual and reproductive health and rights’ under the cover of COVID-19 humanitarian relief.”\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "New documentary exposes how the abortion industry is exploiting COVID-19 in Africa", "description": "Africa in particular has been receiving COVID relief funds from western nations — but as with many previous forms of aid, that help comes with a catch.", "url": "https://www.liveaction.org/news/documentary-exposes-abortion-industry-covid-19-africa/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Analysis", "article:published_time": "2020-12-08T13:48:30-05:00", "article:modified_time": "2020-12-07T22:13:40-05:00", "updated_time": "2020-12-07T22:13:40-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2020/12/Screenshot-from-YouTube-4.png", "image:width": "1100", "image:height": "600"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "355", "embed_code": "<iframe src=\"https://www.youtube.com/embed/eBxDgpUdjUw\" width=\"640\" height=\"355\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/eBxDgpUdjUw"}], "links": ["https://www.aljazeera.com/news/2020/9/14/which-countries-have-not-reported-any-coronavirus-cases", "https://www.liveaction.org/news/africa-ventilators-covid-19-abortion-kits/", "https://www.liveaction.org/news/canada-trudeau-covid-19-fund-abortion/", "https://www.un.org/development/desa/pd/events/EGM-on-population-food-security-nutrition-and-sustainable-development", "https://www.liveaction.org/news/?attachment_id=235844", "https://www.liveaction.org/news/?attachment_id=235845", "https://www.liveaction.org/news/?attachment_id=235846", "https://www.liveaction.org/news/melinda-gates-pushes-family-planning-developing-countries/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Cassy Fiano-Chesser"], "publish_date": "2020-12-08T13:48:30-05:00"}