{"result_id": "192038", "URL": "https://www.liveaction.org/news/manufacturer-discontinues-aborted-cell-polio-vaccine/", "timestamp": "2023-04-25 16:17:20 CEST+0200", "meta": {"description": "Major pharmaceutical company Sanofi Pasteur has discontinued the use of fetal cell lines from aborted children in the development of its polio vaccines.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/manufacturer-discontinues-aborted-cell-polio-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "GOOD: Vaccine manufacturer discontinues use of cell lines from aborted babies for polio vaccines", "cleaned_text": "Major pharmaceutical company Sanofi Pasteur has discontinued the use of fetal cell lines from aborted children in the development of its polio vaccines. The change, discovered through research by Children of God for Life, is “the first time in decades” that the company will not have a version of the polio vaccine which was developed using the cells of aborted children.\n\nAccording to Children of God for Life, the company will cease production of the Poliovax vaccine created using the MRC-5 aborted fetal cell line, and will change the production of the Pentacel and Quadracel polio combination vaccines from MRC-5 cells to Vero (monkey) cells. The company will also continue to produce the IPOL polio vaccine, which already made use of Vero cells. In December 2019, the FDA sent a letter approving a request from the company to make the change and to update the package insert, carton, and container labels.\n\nREAD: The truth about COVID-19 vaccines, cells from aborted children, and ‘fetal tissue’ research\n\nThough the original vaccines that used the MRC-5 will remain on shelves until their expiration — which, according to Children of God for Life, is up to 18 months — the change in development is welcome news for pro-life parents who have long-refused vaccines using MRC-5 cell lines for their own children or reluctantly accepted them. The MRC-5 cell line was created in 1966 from the lung tissue of a 14-week-old male preborn baby who was aborted due to mental health concerns of the mother. That cell line has been used to develop the polio, chickenpox, and hepatitis-A vaccines as well as some rubella, rabies, shingles, and smallpox vaccines, according to Children of God for Life.\n\nThis is only the latest step in the right ethical direction for Sanofi Pasteur. In 2017, the company purchased Protein Sciences, which uses caterpillar cells to develop its flu vaccine, according to Children of God for Life. And about two months ago, Sanofi Pasteur teamed up with GSK to produce a COVID-19 vaccine using Sanofi’s insect-based vaccine development platform.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "GOOD: Vaccine manufacturer discontinues use of cell lines from aborted babies for polio vaccines", "description": "Major pharmaceutical company Sanofi Pasteur has discontinued the use of fetal cell lines from aborted children in the development of its polio vaccines.", "url": "https://www.liveaction.org/news/manufacturer-discontinues-aborted-cell-polio-vaccine/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Issues", "article:published_time": "2020-06-10T12:48:20-05:00", "article:modified_time": "2020-06-09T22:51:18-05:00", "updated_time": "2020-06-09T22:51:18-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2020/06/GettyImages-467898448-vaccine.jpg", "image:width": "1195", "image:height": "651"}, "tags": [], "tweets": [], "movies": [], "links": ["https://cogforlife.org/2020/06/04/sanofi-pasteur-discontinues-aborted-fetal-polio-vaccine-using-moral-cell-lines-instead/", "https://www.fda.gov/media/138197/download", "https://www.fda.gov/media/74385/download", "https://www.liveaction.org/news/truth-covid-19-vaccines-cells-aborted-tissue/", "https://www.liveaction.org/news/truth-covid-19-vaccines-cells-aborted-tissue/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Nancy Flanders"], "publish_date": "2020-06-10T12:48:20-05:00"}