{"result_id": "192010", "URL": "https://www.liveaction.org/news/birth-control-north-carolina/", "timestamp": "2023-04-25 16:17:05 CEST+0200", "meta": {"description": "Birth control can now be given to women in North Carolina without a prescription, putting women at higher risk since they won't have a doctor's guidance.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/birth-control-north-carolina/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "Birth control can now be dispensed without a prescription in North Carolina", "cleaned_text": "North Carolina women no longer need a prescription for several of the most common types of birth control. The law making birth control pills and patches available over-the-counter was passed in August of 2021, but didn’t take effect until February 1.\n\nThe contraceptive dispensation change was slipped into a much broader bill created to allow pharmacists to administer the COVID-19 vaccine. The press release from North Carolina Governor Roy Cooper’s office regarding the bill signing read simply, “This important legislation will help our state administer COVID-19 vaccines more quickly and efficiently.” No mention was made in the release regarding the provision about birth control.\n\nProponents argue that over-the-counter contraception will decrease the state’s 44% unplanned pregnancy rate, and one Republican lawmaker cited the change as a way to decrease abortions. State Senator Jim Burgin explained his support for the bill, saying, “Can we just all agree that an abortion is a bad outcome for everybody? What can we do to prevent people from ever having to make that decision? And so the best way to do that is to prevent an unplanned pregnancy.”\n\nGail Murphy-Geiss, a sociology professor from Colorado, similarly insisted, “It’s been proven that when people have access to birth control, there are lower abortion rates. This can be a space where we all agree.”\n\nHowever, the claim that increased contraceptive access automatically leads to decreased abortion rates is not as cut-and-dried as she implies.\n\nREAD: Is being on birth control safer than being pregnant?\n\nWhile advocates insist that over-the-counter contraceptive dispensation will lead to increased access for women in rural areas and health care deserts, they ignore multiple safety concerns associated with foregoing a doctor’s office visit to obtain birth control.\n\nWomen seeking the pill need only present to their nearest pharmacy, where any pharmacist who has undergone training will administer a questionnaire created by the Centers for Disease Control and Prevention. The United States Medical Eligibility Criteria for Contraceptive Use questionnaire is a self-assessment, meaning that even though hormonal birth control poses particularly high risk for development of blood clots, heart attacks, and strokes in women with certain personal or family risk factors, no one will cross-check the woman’s answers with her documented personal or familial medical history before dispensing birth control. Of note, within 72 hours after birth control is dispensed, the North Carolina law mandates that the woman’s primary care provider must be notified if she lists one.\n\nWomen who take advantage of over-the-counter contraception also potentially miss out on timely diagnosis of sexually transmitted infections like chlamydia, which may be asymptomatic, but can cause infertility, since STIs are often diagnosed as part of a contraception office visit. North Carolina sociology professor Lori Brown noted, “A lot of the women I work with wouldn’t take care of themselves and wouldn’t go to a doctor unless they needed birth control. I love my pharmacist, but he’s not going into a back room with me or checking my weight and blood pressure.”\n\nFurthermore, many women cycle through multiple forms of birth control due to side effects. According to the bill, “If the immunizing pharmacist has administered or dispensed a hormonal contraceptive to the patient, the immunizing pharmacist shall counsel the patient about preventative care, including well-woman visits, sexually transmitted infection testing information, and Pap smear testing,” but no mention is made about who will follow up with the woman and provide continuity of care for side effects.\n\nThe bill does specify that it does not extend to cover emergency contraception, which, like oral contraceptives, can be abortifacient.\n\nOver a dozen other states, including Illinois, Delaware and Arizona, have similarly removed the doctor-patient relationship from the contraception access equation.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "Birth control can now be dispensed without a prescription in North Carolina", "description": "Birth control can now be given to women in North Carolina without a prescription, putting women at higher risk since they won't have a doctor's guidance.", "url": "https://www.liveaction.org/news/birth-control-north-carolina/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:tag": "United States Medical Eligibility Criteria for Contraceptive Use", "article:section": "Analysis", "article:published_time": "2022-03-03T16:54:50-05:00", "article:modified_time": "2022-11-10T13:35:29-05:00", "updated_time": "2022-11-10T13:35:29-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2018/11/bbc-birth-control-documentary.jpg", "image:width": "1200", "image:height": "650"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cleveland19.com/2022/02/01/women-north-carolina-can-now-get-birth-control-without-prescription/ target=", "https://www.ncleg.gov/Sessions/2021/Bills/House/PDF/H96v5.pdf", "https://governor.nc.gov/news/press-releases/2021/08/20/governor-cooper-signs-bill-law", "https://www.liveaction.org/news/contraception-not-solution-abortion-proof/", "https://www.liveaction.org/news/media-contraception-reduced-abortion-pregnancies-term/", "https://www.liveaction.org/news/birth-control-safer-pregnant/", "https://www.cdc.gov/reproductivehealth/contraception/mmwr/mec/summary.html", "https://www.northcarolinahealthnews.org/2022/02/18/north-carolina-no-longer-requires-a-doctors-prescription-for-birth-control-but-who-can-afford-it/", "https://www.liveaction.org/news/studies-show-all-forms-of-emergency-contraception-cause-abortion/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Anne Marie Williams, RN, BSN"], "publish_date": "2022-03-03T16:54:50-05:00"}