{"result_id": "192026", "URL": "https://www.liveaction.org/news/pro-life-rates-encouraging-covid-vaccine-development/", "timestamp": "2023-04-25 16:17:15 CEST+0200", "meta": {"description": "A pro-life research group clarified which of the top COVID vaccine candidates in the US have not used abortion-derived cell lines in production or testing.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/pro-life-rates-encouraging-covid-vaccine-development/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "Pro-life research group rates ‘encouraging’ COVID vaccine development", "cleaned_text": "(Catholic News Agency) A pro-life research group has clarified which of the leading COVID vaccine candidates in the United States have not used abortion-derived cell lines in production or testing.\n\nThe Charlotte Lozier Institute (CLI), the research arm of the pro-life Susan B. Anthony List, said on Thursday it is “encouraging” that “many leading vaccine candidates” funded by the U.S. “do not use abortion-derived cell lines in their production.”\n\nHowever, the institute said, some of the tests conducted on these vaccine candidates used the abortion-derived cell lines—which “unnecessarily put American families in a difficult position,” CLI said.\n\nSince COVID-vaccine development began, the group has documented any use of aborted fetal cell lines in production or testing of the vaccine candidates. CLI has also tracked vaccine development under Operation Warp Speed, the Trump administration’s campaign to fund companies to rapidly produce a COVID vaccine.\n\nAs some COVID vaccines are on the cusp of government approval in the U.S., CLI updated its list of the ethically-produced or tested vaccines, concluding that while some of the leading candidates were ethically-produced, some of the testing on these candidates used fetal cell lines derived from an aborted baby.\n\nPharmaceutical companies have already submitted requests to the U.S. Food and Drug Administration (FDA) for emergency use authorization of two COVID vaccine candidates, developed by Pfizer and BioNTech, and Moderna.\n\nWhile these two vaccine candidates did not use an abortion-derived cell line in production, some of the tests on the vaccine did use this cell line, CLI said.\n\nThree other leading vaccine candidates developed by AstraZeneca with Oxford University, Johnson & Johnson, and Novavax, all have used aborted fetal cell lines both in production and in testing. All three candidates are still in Phase III trials.\n\nCLI called on developers to use ethical alternatives to fetal cell lines in the testing phase.\n\n“Many developers already opt to use animal cell lines, non-fetal human cells, yeast, or chicken eggs instead,” the group stated, adding that using ethical alternatives “will reduce vaccine hesitancy for those who oppose the use of fetal cell lines.”\n\nREAD: FDA commissioner who helped get abortion pill to U.S. to co-chair presumed Biden COVID-19 board\n\nMany vaccines are produced by using certain human cell lines; common vaccines, including those used to innoculate children for smallpox, measles, and rubella, have been produced with cell lines derived from aborted babies, such as the HEK-293 cell line.\n\nThe Pontifical Academy for Life has said that Catholics should advocate for ethically-produced vaccines which do not use cell lines of aborted babies.\n\nAs recently as 2017, the academy recognized “the moral obligation to guarantee the vaccination coverage necessary for the safety of others,” and said that “the cell lines currently used” from babies aborted in the 1960s “are very distant from the original abortions and no longer imply that bond of moral cooperation indispensable for an ethically negative evaluation of their use.”\n\nOn the matter of medical research conducted on fetal tissue from aborted babies, the Trump administration in 2019 declared a halt to such research at NIH facilities; any federally-funded research proposals involving fetal tissue conducted outside of NIH facilities would be reviewed on a case-by-case basis by an ethics advisory board.\n\nThe advisory board in August recommended to withhold federal funding of 13 different fetal tissue research proposals.\n\nHowever, under Operation Warp Speed the administration funded multiple COVID vaccine candidates that were produced with aborted fetal cell lines, such as the Oxford University/AstraZeneca vaccine currently in Phase 3 trials; it also funded other candidates that used the cell lines in some testing, such as the Moderna and Pfizer/BioNTech vaccine candidates.\n\nWhile the production of Moderna’s vaccine did rely on some research that was connected to aborted fetal cell lines, the production process itself did not use cell lines at all. Moderna scientists were not involved in the problematic research.\n\nEditor’s Note: This article was published at Catholic News Agency and is reprinted here with permission.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "Pro-life research group rates ‘encouraging’ COVID vaccine development", "description": "A pro-life research group clarified which of the top COVID vaccine candidates in the US have not used abortion-derived cell lines in production or testing.", "url": "https://www.liveaction.org/news/pro-life-rates-encouraging-covid-vaccine-development/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Guest Column", "article:published_time": "2020-12-09T11:27:27-05:00", "article:modified_time": "2020-12-08T23:41:17-05:00", "updated_time": "2020-12-08T23:41:17-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2020/05/GettyImages-1213304774-covid-19-vaccine.jpg", "image:width": "1197", "image:height": "650"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.catholicnewsagency.com/news/pro-life-research-group-rates-encouraging-covid-vaccine-development-26454", "https://lozierinstitute.org", "http://sba-list.org", "https://www.liveaction.org/news/fda-commissioner-abortion-pill-biden-covid/", "https://www.catholicnewsagency.com/news/pro-life-research-group-rates-encouraging-covid-vaccine-development-26454", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Catholic News Agency"], "publish_date": "2020-12-09T11:27:27-05:00"}