{"result_id": "192043", "URL": "https://www.liveaction.org/news/shingles-vaccine-babies-dont-die/", "timestamp": "2023-04-25 16:17:28 CEST+0200", "meta": {"description": "A new shingles vaccine, which proves far more effective than the old vaccine, was made without the use of an aborted fetal cell line.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/shingles-vaccine-babies-dont-die/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "New ethical shingles vaccine proves babies don't have to die", "cleaned_text": "While some scientists claim they need aborted babies to develop and produce vaccines, vaccine researchers have just developed an FDA-approved shingles vaccine without the use of fetal cells.\n\nA recent story reveals that, despite the insistence that aborted fetal cells are necessary for vaccine development, a new shingles vaccine, Shingrix, has been developed by pharmaceutical giant, Glaxo SmithKline (GSK). The new vaccine was created from “Chinese hamster cells, unlike Merck’s Zostavax which uses aborted fetal cells.” Until October, when the FDA approved it, people with the painful shingles virus either had to suffer through it or use Merck’s aborted fetal cell creation.\n\nThis latest scientific innovation proves that fetal cell lines are absolutely not essential to combat diseases. As the Associated Press reported last month, this new vaccine is actually more effective than the current one made with fetal cells. The AP reports: “[I]t prevents shingles in about 90 percent of people. Merck’s is about 50 percent effective.”\n\nBut some vaccine researchers still insist that they need new aborted children for research because the “supply chain is dwindling” from the aborted fetal cell lines used to make common vaccines, such as Measles, Mumps and Rubella (MMR) and chickenpox. (Chickenpox and shingles are related conditions, yet researchers are taking two different avenues to combat them. This is not uncommon in the ongoing conflict over ethical manufacturing of vaccines.)\n\nHow a three month old fetus became a new cell line called Walvax-2\n\nEven some prolifers have agreed that since the aborted fetal cell lines were already in existence (and not created for the purpose of making a vaccine), at least some good came from the babies who died, though they would never condone the abortion itself. Focus on the Family and the Catholic Church make this argument, as they advise parents on making ethical vaccine decisions.\n\nBut now Walvax-2 (Human diploid cell strains, or HDCSs), a new fetal cell line, is creating yet another ethical dilemma. Its development shows that aborted babies will continue to be used as research specimens in order to fight disease — at least until ethical vaccine development prevails.\n\nWalvax-2 was developed after researchers chose a three-month old preborn female baby out of nine available aborted children. Chinese researchers, Bo Ma and others, discuss the vaccine line’s development in their article, “Characteristics and viral propagation properties of a new human diploid cell line, walvax-2, and its suitability as a candidate cell substrate for vaccine production.”\n\nHDCSs have been considered ideal for vaccine development for years. Virtually every child vaccinated today has received a vaccine containing cell line MRC-5 or WI-38.\n• MRC-5 was developed from the cells of a preborn baby aborted for “psychiatric reasons.” The mother was a physically healthy 27-year-old.\n• WI-38 was developed from the from lung tissue of a three-month-old preborn female baby.\n\nBetween those, MRC-5 and WI-38’s cell lines were used to create numerous vaccines, including chickenpox (varicella), hepatitis, (DTaP + polio+ HiB), Measles/Mumps/Rubella (MMR), smallpox, and others.\n\nNow Walvax-2 is striving to join the ranks of popular aborted fetal cell lines. Researchers explain that while HDCSs “are of great use in developing human vaccines,” it’s hard to find “qualified” ones for mass production. So, they “have developed a new HDCS, Walvax-2, which we derived from the lung tissue of a 3-month-old fetus.” They say their analysis “showed the Walvax-2 cells to be equal or superior to MRC-5 cells for cultivating these viruses.”\n\nThough the babies used for older vaccines have already died, their cell lines cannot last forever, and new aborted babies will be used for new vaccines. The researchers write:\n\nAfter ‘Live Abortions’ Babies are Killed Outside the Womb to Preserve Their Cells for Vaccines.\n\nThis prompts memories of The Center for Medical Progress investigative videos. While these are Chinese researchers, the nature of the research is similar to what happens in U.S. research labs. The Walvax-2 researchers’ criteria for selecting the best aborted baby to provide the cell line is, “1) gestational age 2 to 4 months; 2) induction of labor with the water bag method” so “tissues from the freshly aborted fetuses [are] immediately sent to the laboratory for the preparation of the cells.”\n\nThe second criterion provides a troubling peek into what it takes to obtain a baby that will “qualify” for this research. Children of God for Life explains:\n\nWhat is a “water bag” abortion? Illegal in the United States but practiced in China, it requires delivering a baby via water bag induction, so that the baby’s organs are fresh and intact. Once outside the womb, the baby is killed, her organs harvested. The U.S. has used Chinese abortions as a way to get fetal cell lines for vaccines, though the same process would be illegal in America.\n\nEven more disturbing is the revelation that the public has been sold the lie that no more abortions would ever be necessary to produce vaccines:\n\nAs CMP videos showed, it is not uncommon to alter the method of abortion in order to get an intact fetus, even though doing so is illegal in the U.S.:\n\nWhile Walvax-2 was not developed in the U.S., it behooves governing authorities to question the ways U.S. researchers happen to obtain intact fetuses or “live intact organs “as they research cures for diseases and shines a light on the dangers of using brutally gathered fetal cells lines.\n\nWhile the majority agrees that vaccines are beneficial, many are conflicted by the unethical use of aborted babies to make this happen.\n\nAbortion supporters present it this way: Either the baby dies and we help save you, or the baby lives and you might die — an either/or fallacy of logic. Of course, it’s never stated that way, but the idea is that abortion is necessary to develop vaccines and cure diseases.\n\nIn its statement on permitting vaccine use, Focus on the Family “calls upon vaccine manufacturers to develop immunizations that do not rely on fetal tissue from aborted babies.” The United States Conference of Catholic Bishops (USCCB) agrees: “A long-term solution lies in working to ensure that future vaccines and other medicines are not based on cooperation with practices demeaning human life.”\n\nChildren of God for Life produces a chart showing the list of vaccines available, including ethical alternatives. A good number of vaccines on the list have these, but some are not approved for use in the United States for various reasons.\n\nThe modern world of vaccine development proves at least two significant things: 1) the current fetal cell lines are, indeed, dwindling, and new babies’ abortion deaths are being used to develop vaccines (meaning we cannot continue to argue it’s something that happened a long time ago, so we might as well benefit from it), and 2) it is entirely possible to produce effective vaccines without babies having to die in the process. Shingrix has proven what’s possible.", "opengraph": {"locale": "en_US", "type": "article", "title": "New ethical shingles vaccine proves babies don't have to die", "description": "A new shingles vaccine, which proves far more effective than the old vaccine, was made without the use of an aborted fetal cell line.", "url": "https://www.liveaction.org/news/shingles-vaccine-babies-dont-die/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Investigative", "article:published_time": "2017-11-30T13:29:46-05:00", "article:modified_time": "2017-11-30T11:25:32-05:00", "updated_time": "2017-11-30T11:25:32-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2016/02/needle-672.jpg", "image:width": "672", "image:height": "372"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "355", "embed_code": "<iframe src=\"https://www.youtube.com/embed/bHe8YGPGzj4\" width=\"640\" height=\"355\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/bHe8YGPGzj4"}], "links": ["https://cogforlife.org/2017/10/25/moral-shingles-vaccine-fda-approved/#more-18737", "https://apnews.com/d35f32fbf51a4691aa44a9618fd391e4/FDA-approves-better-vaccine-against-painful-shingles-virus", "http://media.focusonthefamily.com/topicinfo/position-statement-vaccine-ethics.pdf", "http://www.usccb.org/beliefs-and-teachings/how-we-teach/catholic-education/upload/Vaccines-Conscience-Exemption-updated-April-2015.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4526020/", "http://www.nature.com/nature/journal/v227/n5254/abs/227168a0.html?foxtrotcallback=true", "http://www.nature.com/nature/journal/v227/n5254/abs/227168a0.html?foxtrotcallback=true", "https://embryo.asu.edu/pages/limited-vitro-lifetime-human-diploid-cell-strains-1964-leonard-hayflick", "https://cogforlife.org/wp-content/uploads/vaccineListOrigFormat.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4526020/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4526020/", "http://www.centerformedicalprogress.org/cmp/investigative-footage/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4526020/", "https://cogforlife.org/2015/09/09/new-aborted-fetal-cell-line-emerges-for-vaccine-production/", "https://cogforlife.org/2015/09/09/new-aborted-fetal-cell-line-emerges-for-vaccine-production/", "http://www.centerformedicalprogress.org/2015/08/intact-fetal-cadavers-at-20-weeks-just-a-matter-of-line-items-at-planned-parenthood-tx-mega-center-abortion-docs-can-make-it-happen/", "https://www.liveaction.org/support/donate/", "http://media.focusonthefamily.com/topicinfo/position-statement-vaccine-ethics.pdf", "http://www.usccb.org/beliefs-and-teachings/how-we-teach/catholic-education/upload/Vaccines-Conscience-Exemption-updated-April-2015.pdf", "https://cogforlife.org/wp-content/uploads/vaccineListOrigFormat.pdf"], "authors": ["Catherine Livingston, PhD"], "publish_date": "2017-11-30T13:29:46-05:00"}