{"result_id": "192041", "URL": "https://www.liveaction.org/news/tiktok-eu-vaccine-blood-clots-birth-control/", "timestamp": "2023-04-25 16:17:26 CEST+0200", "meta": {"description": "\"Amongst the hundreds of side effects that come with the contraceptive pill, one of which is death, is an average of a 6 in 10,000 chance of a blood clot.\"", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/tiktok-eu-vaccine-blood-clots-birth-control/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "TikTok user: EU nations halt vaccine over blood clot risk but won't halt even riskier birth control", "cleaned_text": "According to Newsweek, some countries in the European Union are considering stopping, or have stopped, the rollout of AstraZeneca’s COVID-19 vaccine because it carries a 6 in 1,000,000 chance of a blood clot. Yet one TikTok user pointed out her confusion because hormonal contraception is still widely distributed despite women having a 6 in 10,000 chance of developing blood clots from use.\n\nThere have been about 17 reported cases of blood clots from the 17 million people who have already received the AstraZeneca vaccine in Europe. Some nations in Europe have halted distribution of the vaccine over the side effect, though many have decided to resume distribution after the European Medicine Agency and the World Health Organization noted the rarity of the side effect, according to Newsweek.\n\nREAD: Seizures, blood clots, and depression: Why many women in the UK are leaving the Pill behind\n\nHowever, the concern over blood clots from the vaccine has sparked a different debate: Why aren’t these nations willing to block the distribution of hormonal birth control pills, which have caused the deaths of countless women from blood clots?\n\n“So I couldn’t help but notice on the news this morning, that 15 countries have now stopped the rollout of the AstraZeneca vaccine,” said Alyss Elizabeth in a TikTok video now viewed by more than 700,000 people, “because there is a six in one million chance of getting a blood clot. Millions of women everywhere take the contraceptive pill and amongst the hundreds of side effects that come with the contraceptive pill, one of which is death, is an average of a six in 10,000 chance of a blood clot. Someone make it make sense.”\n\nAccording to the Public Discourse, 300-400 women die annually from stroke and heart attack caused by blood clots from hormonal birth control. The pill increases the chance of a blood clot two to four times, according to an Endocrinology report, and a recent study showed that women taking hormonal birth control pills may be at an even greater increased risk of fatal blood clots if they contract COVID-19, though more research is needed.\n\n“We don’t know there is an increase of blood clots with the AstraZeneca vaccine, we only know there are reports of individual patients getting blood clots within a short time frame after receiving the vaccine,” explained Dr. Alok Khorana, Chairman of the NBCA Medical and Scientific Advisory Board.\n\nMeanwhile, the increased risk of blood clots from hormonal birth control has been well researched with scientific studies to back up the findings. And it isn’t the only health risk associated with contraception. Breast cancer, cervical cancer, rare brain tumors, infertility, and other conditions have all been reportedly linked to hormonal birth control.\n\nWhether or not the European countries’ concerns are valid, by halting the rollout of a COVID vaccine due to the risk of blood clots while still distributing contraception, these nations are showing themselves willing to risk women’s lives only if it means preventing them from reproducing.\n\n“Like” Live Action News on Facebook for more pro-life news and commentary!", "opengraph": {"locale": "en_US", "type": "article", "title": "TikTok user: EU nations halt vaccine over blood clot risk but won't halt even riskier birth control", "description": "\"Amongst the hundreds of side effects that come with the contraceptive pill, one of which is death, is an average of a 6 in 10,000 chance of a blood clot.\"", "url": "https://www.liveaction.org/news/tiktok-eu-vaccine-blood-clots-birth-control/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "International", "article:published_time": "2021-03-23T06:36:20-05:00", "article:modified_time": "2021-03-22T23:48:01-05:00", "updated_time": "2021-03-22T23:48:01-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2021/03/GettyImages-147220275-birth-control.jpg", "image:width": "1200", "image:height": "650"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.newsweek.com/viral-tiktok-highlights-how-birth-control-pills-have-higher-blood-clot-risk-astrazeneca-vaccine-1577527", "https://www.tiktok.com/foryou?referer_url=https%3A%2F%2Fwww.newsweek.com%2F&referer_video_id=6940337107181243653&refer=embed&is_copy_url=1&is_from_webapp=v1&item_id=6940337107181243653#/@alysselizabeth/video/6940337107181243653", "https://www.liveaction.org/news/seizures-blood-clots-depression-uk-birth-control-pill/", "https://www.tiktok.com/foryou?referer_url=https%3A%2F%2Fwww.newsweek.com%2F&referer_video_id=6940337107181243653&refer=embed&is_copy_url=1&is_from_webapp=v1&item_id=6940337107181243653#/@alysselizabeth/video/6940337107181243653", "https://www.tiktok.com/foryou?referer_url=https%3A%2F%2Fwww.newsweek.com%2F&referer_video_id=6940337107181243653&refer=embed&is_copy_url=1&is_from_webapp=v1&item_id=6940337107181243653#/@alysselizabeth/video/6940337107181243653", "https://www.thepublicdiscourse.com/2019/03/49896/", "https://www.liveaction.org/news/fathers-daughters-death-birth-control/", "https://health.clevelandclinic.org/yes-your-birth-control-could-make-you-more-likely-to-have-a-blood-clot/", "https://www.liveaction.org/news/birth-control-pill-covid-blood-clots/", "https://www.liveaction.org/news/birth-control-pill-covid-blood-clots/", "https://www.liveaction.org/news/10-risks-hormonal-birth-control-women-know/", "https://www.facebook.com/liveactionnewsonline/"], "authors": ["Newsroom"], "publish_date": "2021-03-23T06:36:20-05:00"}