{"result_id": "192016", "URL": "https://www.liveaction.org/news/federal-judge-strikes-california-pro-life-speech/", "timestamp": "2023-04-25 16:17:09 CEST+0200", "meta": {"description": "The law regulating vaccine sites effectively banned all advocacy outside many abortion facilities, since some, like Planned Parenthood, administer vaccines.", "lang": "en", "keywords": "", "favicon": "https://www.liveaction.org/news/wp-content/uploads/2020/09/lva-favicon1.png", "canonical": "https://www.liveaction.org/news/federal-judge-strikes-california-pro-life-speech/", "encoding": "UTF-8"}, "image": null, "domain": "www.liveaction.org", "title": "Federal judge strikes down California law restricting pro-life speech", "cleaned_text": "A federal judge has struck down a California law that would have prohibited the right of pro-lifers to protest outside abortion facilities in the state.\n\nSB 742 was signed by Governor Gavin Newsom in 2021 under the guise of protecting COVID-19 vaccination sites. The law created a 100-foot buffer zone around any vaccine administration site and banned free-speech activities within 30 feet of any person who is within 100 feet of the vaccine site. The bill particularly noted that “harassment” would be defined as approaching or standing within 30 feet of anyone “for the purpose of passing a leaflet or handbill to, displaying a sign to, or engaging in oral protest, education, or counseling with, that other person in a public way or on a sidewalk area.”\n\nPro-life groups were quick to call attention to the law, noting that it effectively banned all advocacy outside many abortion facilities, since some, like Planned Parenthood, administer vaccines.\n\nSeveral pro-life groups sued following the law’s enactment, and the law was temporarily blocked in November 2021 after a judge ruled that the 30-foot prohibition was too restrictive. Life Legal Defense Foundation, one of the organizations that filed a federal lawsuit against the law, announced Thursday that a federal judge had struck down the provision that infringed on the rights of pro-lifers to gather outside abortion facilities.\n\nAccording to the group, the court held that “the prohibition on ‘harassing’ in the statute violates the First and Fourteenth Amendments,” noting that “[T]he loss of First Amendment freedoms, for even minimal periods of time, unquestionably constitutes irreparable injury.”\n\n“We are pleased that the court emphasized the unconstitutionality of the legislature’s shameless abuse of the term ‘harassing’ to encompass protected speech and activities,” said Life Legal’s Katie Short, who litigated the case before the court. “At a time when all manner of liberties is in jeopardy, pro-lifers – even in California – can be assured that federal courts have not wholly abandoned fundamental First Amendment principles.”\n\nDid you know that as little as $10 a month is enough to reach more than 3,000 people with the truth about abortion that no one else is telling them? Click here to start saving lives 365 days a year.", "opengraph": {"locale": "en_US", "type": "article", "title": "Federal judge strikes down California law restricting pro-life speech", "description": "The law regulating vaccine sites effectively banned all advocacy outside many abortion facilities, since some, like Planned Parenthood, administer vaccines.", "url": "https://www.liveaction.org/news/federal-judge-strikes-california-pro-life-speech/", "site_name": "Live Action News", "article:publisher": "https://www.facebook.com/liveaction", "article:section": "Newsbreak", "article:published_time": "2023-04-03T18:45:01-05:00", "article:modified_time": "2023-04-05T12:07:02-05:00", "updated_time": "2023-04-05T12:07:02-05:00", "image": "https://www.liveaction.org/news/wp-content/uploads/2021/11/GettyImages-632854866-pray.jpg", "image:width": "1200", "image:height": "650"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.liveaction.org/news/california-law-free-speech-restrictions-pro-lifers/", "https://www.liveaction.org/news/groups-sue-california-buffer-zone-pro-life/", "https://www.liveaction.org/news/ca-court-issues-temporary-ruling-buffer-zone-silences-pro-life-speech/", "https://lifelegaldefensefoundation.org/life-legal-defeats-gavin-newsoms-move-to-strangle-pro-life-speech/?fbclid=IwAR15FZdw2Pd-D0iTeruTDRJiVcobVA7YOXUF1c5tEorFXs1gbgoloOwFGuA", "https://www.liveaction.org/walgreens-cvs-petition/", "https://give.liveaction.org/general-donation/?utm_source=lan&utm_medium=display&utm_campaign=monthly&utm_content=article"], "authors": ["Bridget Sielicki"], "publish_date": "2023-04-03T18:45:01-05:00"}