{"result_id": "193019", "URL": "https://www.livestrong.com/article/13763794-how-to-overcome-fear-of-needles-injections/", "timestamp": "2023-04-25 16:18:00 CEST+0200", "meta": {"description": "Don't let a fear of needles keep you from getting the COVID vaccine. Here, an anxiety expert lays out three steps to help you conquer the fear and get the shot.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13763794-how-to-overcome-fear-of-needles-injections/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "Have a Fear of Needles? Here Are 3 Steps to Overcome It | Livestrong.com", "cleaned_text": "Everyone has their reasons for being excited — or hesitant — about receiving the COVID-19 vaccine. If you're reading this, one of your reasons for being squeamish about the shot may be a fear of needles.\n\nFor some adults, it's a frequent reason to avoid getting a vaccine. In a meta-analysis of 35 articles published January 2019 in the ​Journal of Advanced Nursing​, 16 percent of adults said they avoided getting the flu vaccine because of needle fear.\n\nPast research has found that 19 and 20 percent of adults, respectively, didn't get the pneumococcal or tetanus vaccines because of this anxiety. The study also pointed out that those giving the injections may underestimate just how strong this worry can be. And who could blame them — they see needles all day!\n\nSo, if you want to get the COVID-19 vaccine but the anticipation of getting an injection is a source of anxiety, or you think you might avoid the shot altogether, there are steps you can take to feel calmer in the face of a needle.\n\nYou can take steps to get closer and closer to the goal that most aligns with what you want to do: Get a vaccine. This is done through small exposures that build upon one another. Allowing yourself to sit through each step until the fear eases will ultimately break the connection with the fear.\n\nNow, it's time to schedule your shot. If you feel dread about going and then are relieved it's over as you triumphantly walk out, that's totally normal.\n\n\"This is a healthy and typical response to most medical procedures,\" McNamara says. \"The goal isn't to get to the point where going to the hospital is fun. That's not realistic. It's getting to a place where you can do what you need to do.\" In this case, you want to get to a place where you can carry out the steps that align with your health goals.\n\nIf you've completed the above exposure steps at a pace that feels safe for you, and you still don't feel like you can go through with the shot, then reach out to a professional for help, McNamara says.\n\nWhen you're at your vaccine appointment, there are some ways to prompt your body's relaxation response to help you get through the injection, McNamara says. And this is especially important if you have a vasovagal response (aka you have a history of fainting in response to needles).\n\nWhen doing this, make sure you're breathing in to expand your stomach and then out to pull it back in. Need more guidance? Try one of these six types of breathing exercises to reduce stress.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "Don't let a fear of needles keep you from getting the COVID vaccine. Here, an anxiety expert lays out three steps to help you conquer the fear and get the shot.", "url": "https://www.livestrong.com/article/13763794-how-to-overcome-fear-of-needles-injections/", "title": "Have a Fear of Needles? Here Are 3 Steps to Overcome It | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F4a1b58ca1edf47f4ba8a231ededdf9f3.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://pubmed.ncbi.nlm.nih.gov/30109720/", "/article/13763718-covid-vaccine-guilt/", "/article/13763878-dr-b-covid-vaccine/", "/article/13771372-mask-mandates-ending-anxiety/", "https://www.livestrong.com/article/13732163-reasons-to-get-covid-vaccine/", "https://ufhealth.org/joseph-p-mcnamara", "/article/13763718-covid-vaccine-guilt/", "/article/13763878-dr-b-covid-vaccine/", "/article/13771372-mask-mandates-ending-anxiety/", "https://www.livestrong.com/article/13763878-dr-b-covid-vaccine/", "https://www.livestrong.com/article/13727126-breathing-exercises-for-stress/", "https://www.livestrong.com/article/13731521-covid-vaccine-facts/", "https://www.livestrong.com/article/13732238-covid-vaccine-ethics-priority-groups/", "https://www.livestrong.com/article/13731000-covid-vaccine-conspiracy-theories/"], "authors": ["Jessica Migala"], "publish_date": null}