{"result_id": "193031", "URL": "https://www.livestrong.com/article/13732238-covid-vaccine-ethics-priority-groups/", "timestamp": "2023-04-25 16:18:22 CEST+0200", "meta": {"description": "Experts in vaccine ethics answer whether you should get the COVID-19 vaccine when it's available to you if you're healthy and think other people need it more.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13732238-covid-vaccine-ethics-priority-groups/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "Should You Wait to Get the COVID Vaccine if You Think Other People Need It More? | Livestrong.com", "cleaned_text": "But what if you're healthy and feel like you really \"don't need\" to get the vaccine right away? Would getting yours take it away from someone else? Or should you get vaccinated for the good of public health?\n\n\"The first thing I'd say to someone is thank you for being reflective, thoughtful and generous,\" Kelly Michelson, MD, MPH, director of the Center for Bioethics and Medical Humanities at Northwestern University Feinberg School of Medicine in Chicago, Illinois, tells LIVESTRONG.com. \"This is exactly what we need as a community to get through this.\"\n\n\"That gave me a lot of pause, particularly when I have parents who are much older and higher risk. I would have given them the vaccine before me, but it didn't work out that way,\" she says.\n\nLet's say you're a teacher, for example, or a grocery store worker. By getting vaccinated, you're avoiding a potential chain of transmission that starts with you and spreads to any one of the people you come into contact with on a regular basis, who could then continue to spread the disease to others, including higher-risk people.\n\nOr let's say you have obesity or are a smoker — two groups of people that have a higher risk of getting really sick from COVID-19. Even if you're otherwise healthy, getting COVID could land you in the hospital. That's not great for you, and it adds to the strain on the health care system, which is also trying to care for higher-risk people who haven't gotten the shot.\n\nA similar ethical issue popping up is getting an appointment and receiving the vaccine when it's not your turn. Pretending to be a smoker, for example, or stretching the truth about where you work in order to qualify based on your state's guidelines. Or even traveling to another state to get vaccinated.\n\nAt the rollout of the vaccine, it was overwhelmingly tough to make an appointment or even figure out how to get one. Some places gave appointments by lottery, others first-come-first-serve, while some allowed walk-ins at the end of the day for open vials. The result? Lots of confusion and then distrust of that whole \"wait your turn\" thing, Dr. Kahn says.\n\n\"There will always be people who cut in line at a concert. But the system works because that's a small fraction of people who do that. Everyone else in line notices that the person budged in line and says ​hey, that's not right!​\" Dr. Kahn says. But if everyone saw that guy cut and then all decided to rush the line, well, there would be big problems.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "Experts in vaccine ethics answer whether you should get the COVID-19 vaccine when it's available to you if you're healthy and think other people need it more.", "url": "https://www.livestrong.com/article/13732238-covid-vaccine-ethics-priority-groups/", "title": "Should You Wait to Get the COVID Vaccine if You Think Other People Need It More? | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F100e44388852494c94630f6317a28cc2.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.livestrong.com/stay-healthy/", "https://bioethics.jhu.edu/people/profile/jeffrey-kahn/", "/article/13763718-covid-vaccine-guilt/", "/article/13727616-covid-19-test/", "/article/13732031-is-it-safe-to-visit-people-who-have-gotten-covid-vaccine/", "https://www.bioethics.northwestern.edu/members/profile.html?xid=17626", "/article/13763718-covid-vaccine-guilt/", "/article/13727616-covid-19-test/", "/article/13732031-is-it-safe-to-visit-people-who-have-gotten-covid-vaccine/", "https://www.livestrong.com/article/13732163-reasons-to-get-covid-vaccine/", "https://www.livestrong.com/article/13731143-what-to-do-after-covid-vaccine/", "https://www.livestrong.com/article/13731758-covid-vaccine-side-effects-treatment/", "https://www.livestrong.com/article/13732031-is-it-safe-to-visit-people-who-have-gotten-covid-vaccine/"], "authors": ["Jessica Migala"], "publish_date": null}