{"result_id": "193011", "URL": "https://www.livestrong.com/article/13763878-dr-b-covid-vaccine/", "timestamp": "2023-04-25 16:17:48 CEST+0200", "meta": {"description": "The Dr. B site aims to connect anyone who wants a COVID-19 vaccine with available doses that would otherwise go to waste. Here's what to know about it.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13763878-dr-b-covid-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "The Dr. B Site Lets You Know When Extra COVID-19 Shots Are Available Near You | Livestrong.com", "cleaned_text": "The COVID-19 pandemic has made life strange in a lot of ways, but one of the oddest might be this: Some people are now chasing down vaccines the way they used to clamor for tickets to see ​Hamilton​ on Broadway or Bruce Springsteen in concert.\n\nPeople who want the COVID-19 vaccine but might not yet be eligible according to their state guidelines may be able to secure a leftover dose from a pharmacy or vaccination center that may otherwise go to waste. (The vaccines must be kept at specific temperatures, so it's not like you can just save it for tomorrow.) Doing this requires some legwork, though, via repeated calls or waiting at a center at the end of the day.\n\nEnter Dr. B: a new site that's getting a ton of buzz. In short, it allows you to sign up and get notified when a COVID vaccine is available near you. \"Have you been unable to get a vaccination appointment? Dr. B can connect you with local providers with extra doses using a standby system,\" the website reads.\n\nThe idea is that when someone cancels their vaccination appointment, their dose can still get into an arm. According to the site, more than 2 million people have signed up in hopes of being that arm. (You're eligible if you're 18 years old or older, live in the U.S. and can get texts.)\n\nAnd it's super easy to sign up. You'll add in some basic info about yourself and — now this is key — identify if you fit into a priority group. (A priority group is someone who may have underlying health conditions that put them at risk for more severe illness or are part of a group of essential workers that may have a lot of exposure to the public.)\n\nThen you wait for a text message notifying you if there is an appointment for you in your area. If you're lucky and get one, you have 15 minutes to reply and claim your dose, and you'll also be notified where to go.\n\nHere's the thing: Personally, I'm not in a priority group. While I'm excited to get my vaccine, I'm also happy to wait until appointments open up for the general public in my state. And so, I was worried about the ethics of it all. Is this jumping to the head of the line? Would I be taking a shot away from someone who needs it more?\n\nNot necessarily, as long as the site follows its stated goal and mission. Meaning, if you're receiving a vaccine dose that would otherwise have to go in the trash, then you're not doing anything wrong. In fact, you're doing your part to help the U.S. reach herd immunity as quickly as possible, which is the ultimate goal.\n\n\"This site and other efforts at 'vaccine hunting' speak to the fragmented processes in place nearly everywhere, so that there is no single portal to put yourself on a list or to see what might be available at the end of the day,\" Jeffrey Kahn, PhD, MPH, the director of the Johns Hopkins Berman Institute of Bioethics in Baltimore, Maryland, tells LIVESTRONG.com.\n\n\"If they stay true to the priority tiers in place in the states in which they're operating, then all the better, since vaccine chasing often leads to people otherwise ineligible receiving doses to avoid their going to waste,\" Kahn says.\n\nThe Dr. B site says it prioritizes people based on eligibility criteria, the order in which you sign up and available doses from providers in your area. In other words, someone who signs up who has an underlying health condition or is an older adult or essential worker would get one of these doses before I do. And that's the way it should be.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "The Dr. B site aims to connect anyone who wants a COVID-19 vaccine with available doses that would otherwise go to waste. Here's what to know about it.", "url": "https://www.livestrong.com/article/13763878-dr-b-covid-vaccine/", "title": "The Dr. B Site Lets You Know When Extra COVID-19 Shots Are Available Near You | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F5ceab30a272a4aaa9e08cf49360e3ed8.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://hidrb.com/", "/article/13731143-what-to-do-after-covid-vaccine/", "/article/13763794-how-to-overcome-fear-of-needles-injections/", "/article/13727967-what-is-telemedicine/", "https://www.livestrong.com/stay-healthy/", "/article/13731143-what-to-do-after-covid-vaccine/", "/article/13763794-how-to-overcome-fear-of-needles-injections/", "/article/13727967-what-is-telemedicine/", "https://www.livestrong.com/article/13732238-covid-vaccine-ethics-priority-groups/", "https://www.livestrong.com/article/13726454-herd-immunity-explained/", "https://bioethics.jhu.edu/people/profile/jeffrey-kahn/", "https://www.livestrong.com/article/13731521-covid-vaccine-facts/", "https://www.livestrong.com/article/13731143-what-to-do-after-covid-vaccine/", "https://www.livestrong.com/article/13732163-reasons-to-get-covid-vaccine/"], "authors": ["Jessica Migala"], "publish_date": null}