{"result_id": "193040", "URL": "https://www.livestrong.com/article/13764251-which-arm-to-get-covid-vaccine/", "timestamp": "2023-04-25 16:18:38 CEST+0200", "meta": {"description": "One of the most common side effects of the COVID vaccine is arm pain, so which arm should you get the shot in? And should you switch arms for the second dose?", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13764251-which-arm-to-get-covid-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "Should You Get Your Second COVID Shot in the Same Arm? | Livestrong.com", "cleaned_text": "The COVID-19 vaccine is a pain in the arm. Literally. One of the most common side effects of the vaccine is pain, redness and swelling at the site of the injection, notes the Centers for Disease Control and Prevention (CDC).\n\nIn fact, you may as well plan for your arm to hurt a bit. In the clinical trials of the Pfizer vaccine, 83 percent of participants ages 18 to 55 reported pain at the injection site following the first dose, and nearly 78 percent felt pain after the second, per the CDC. (Swelling and redness happened less often.)\n\nFor the Moderna vaccine, clinical trials reported that about 87 percent of people ages 18 to 64 had arm pain after dose one and 90 percent dealt with it after dose two, per the CDC. Again, redness and swelling also occurred, but at a far lower rate.\n\nGiven the likelihood of a bit of post-vax arm soreness, get your first dose in your non-dominant arm, John Segreti, MD, medical director of infection control and prevention at Rush University Medical Center in Chicago, tells LIVESTRONG.com.\n\n\"If you're right-handed and get the injection in the right arm, you may notice the soreness more, which can be more bothersome,\" he says. (If you're naturally ambidextrous, then the choice is yours.)\n\nIf you're getting the Pfizer or Moderna vaccine, both of which require two doses, then you'll also have to decide to stick with the same arm as dose one or switch. Most people will want to roll up their sleeve and, once again, get dose two in their non-dominant arm.\n\n\"There is plenty of time to recover between the two doses. These are tiny needles that do not cause any damage to the muscle,\" Dr. Segreti says. \"The vast majority of reactions, like pain at the site of the injection, are gone within 24 hours.\"\n\nCOVID arm refers to a specific side effect where a red, itchy, swollen or painful rash appears at the injection site anywhere from a few days to a week-plus after the shot, explains the CDC. It's still recommended to go get your second shot when it's your time, and there's no guarantee you'll get the rash again after dose two.\n\nTalk to the provider administering the shot — they might recommend you switch arms for the second dose. However, it's probably up to you. As Dr. Segreti says: \"If [COVID arm] was bad to begin with, would you rather it affect your dominant or non-dominant arm? Personally, I'd choose the same arm as before.\"", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "One of the most common side effects of the COVID vaccine is arm pain, so which arm should you get the shot in? And should you switch arms for the second dose?", "url": "https://www.livestrong.com/article/13764251-which-arm-to-get-covid-vaccine/", "title": "Should You Get Your Second COVID Shot in the Same Arm? | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F32ea13cbe0034094aef5178c00d4ba11.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.livestrong.com/article/13731758-covid-vaccine-side-effects-treatment/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html", "https://www.cdc.gov/vaccines/covid-19/info-by-product/pfizer/reactogenicity.html", "/article/13731758-covid-vaccine-side-effects-treatment/", "/article/398102-weight-lifting-after-a-tetanus-vaccine/", "/article/261895-what-causes-muscle-spasms-in-the-arms/", "https://www.livestrong.com/stay-healthy/", "https://www.rushu.rush.edu/faculty/john-segreti-md", "/article/13731758-covid-vaccine-side-effects-treatment/", "/article/398102-weight-lifting-after-a-tetanus-vaccine/", "/article/261895-what-causes-muscle-spasms-in-the-arms/", "https://www.livestrong.com/article/13731885-exercises-reduce-arm-soreness-after-covid-vaccine/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/allergic-reaction.html", "https://www.livestrong.com/article/13731143-what-to-do-after-covid-vaccine/", "https://www.livestrong.com/article/13763955-fully-vaccinated-covid/", "https://www.livestrong.com/article/13763794-how-to-overcome-fear-of-needles-injections/"], "authors": ["Jessica Migala"], "publish_date": null}