{"result_id": "193024", "URL": "https://www.livestrong.com/article/13731648-face-mask-guide-covid/", "timestamp": "2023-04-25 16:18:09 CEST+0200", "meta": {"description": "Here's your guide to when and where you should still wear a face mask, including the best type of mask to wear to protect against COVID-19 and how to wear it.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13731648-face-mask-guide-covid/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "When and Where You Should Still Wear a Face Mask | Livestrong.com", "cleaned_text": "By now, you should almost be a face mask pro: Popping one on wherever you go, stashing extras in your car, etc. But with mask mandates changing, it can be tough to know exactly what you need to wear and when. We have some answers.\n\nKeep in mind that the advice surrounding COVID-19 is constantly evolving. Per February 2022 guidelines from the Centers for Disease Control and Prevention (CDC), If you're feeling sick, have had a positive COVID-19 test or have been exposed to someone with COVID-19, you should mask up.\n\nOtherwise, you should look at the total number of COVID cases and hospitalizations in your area (you can check that here) to determine whether or not to mask:\n\n\"Even as some jurisdictions lift masking requirements, we must grapple with the fact that millions of people in the U.S. are immunocompromised, more susceptible to severe COVID outcomes, or still too young to be eligible for the vaccine,\" AMA president Gerald E. Harmon, MD, said in a February 2022 statement. \"In light of those facts, I personally will continue to wear a mask in most indoor public settings, and I urge all Americans to consider doing the same, especially in places like pharmacies, grocery stores, on public transportation— locations all of us, regardless of vaccination status or risk factors, must visit regularly.\"\n\nDr. Harmon went on to say: \"Although masks may no longer be required indoors in many parts of the U.S., we know that wearing a well-fitted mask is an effective way to protect ourselves and our communities, including the most vulnerable, from COVID-19 — particularly in indoor settings when physical distancing is not possible.\"\n\nCloth masks were the go-to for the majority of the pandemic, but the CDC updated its guidance in January 2022 to recommend respirators such as N95s and KN95s, which have better filtration and provide a higher level of protection against virus particles.\n\nN95 masks filter out at least 95 percent of both large and small particles in the air, per the CDC. While they were reserved for frontline health care personnel earlier in the pandemic, they're now much more widely available.\n\nKeep in mind, though: It's never appropriate to wear an N95 (or any other mask) with a valve on it. The valve allows viral particles from your nose and mouth to spray out into the surrounding air, putting people around you at risk.\n\n\"There's not an instance that I can think of where wearing only a face shield is appropriate,\" says Colleen Nash, MD, MPH, an infectious disease doctor at Rush University Medical Center in Chicago. \"But a face shield plus a mask is always reasonable,\" she adds.\n\nIf you work at a place where you readily interact with people every day, like a grocery store, then the addition of a face shield or goggles can give your eyes a layer of protection, too. While the nose and mouth are the biggest sources of viral transmission, the eyes are also a potential route.\n\nYou might also consider a face shield if you are interacting with someone who is deaf or hearing impaired, in which case, choose one that wraps around the sides of your face and extends below the chin or is hooded, suggests the CDC.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "Here's your guide to when and where you should still wear a face mask, including the best type of mask to wear to protect against COVID-19 and how to wear it.", "url": "https://www.livestrong.com/article/13731648-face-mask-guide-covid/", "title": "When and Where You Should Still Wear a Face Mask | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F51b7c16eaf99454c8e5d8e6bf1a14695.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/about-face-coverings.html", "https://www.cdc.gov/coronavirus/2019-ncov/your-health/covid-by-county.html", "/article/13729103-glasses-covid/", "/article/13763795-what-can-you-do-after-covid-vaccine/", "/article/13732031-is-it-safe-to-visit-people-who-have-gotten-covid-vaccine/", "https://www.livestrong.com/stay-healthy/", "https://www.ama-assn.org/about/board-trustees/gerald-e-harmon-md", "https://www.ama-assn.org/press-center/press-releases/ama-statement-cdc-covid-19-updates", "/article/13729103-glasses-covid/", "/article/13763795-what-can-you-do-after-covid-vaccine/", "/article/13732031-is-it-safe-to-visit-people-who-have-gotten-covid-vaccine/", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/respirator-use-faq.html", "https://www.rushu.rush.edu/faculty/colleen-b-nash-md-mph", "https://www.livestrong.com/article/13728064-face-shield-coronavirus/", "https://www.livestrong.com/article/13727561-how-to-wear-face-mask/", "https://www.livestrong.com/article/13770515-how-to-clean-n95-mask/", "https://www.livestrong.com/article/13731143-what-to-do-after-covid-vaccine/", "https://www.livestrong.com/article/13728584-what-to-clean-every-day-covid/"], "authors": ["Jessica Migala"], "publish_date": null}