{"result_id": "193018", "URL": "https://www.livestrong.com/article/266510-how-to-lift-weights-after-a-flu-shot/", "timestamp": "2023-04-25 16:17:59 CEST+0200", "meta": {"description": "Can you lift weights after a flu shot? Yes, as long as your side effects are mild. Use these tips for a more comfortable strength workout after a flu shot.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/266510-how-to-lift-weights-after-a-flu-shot/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "Want to Do a Strength Workout After a Flu Shot? Follow These Tips | Livestrong.com", "cleaned_text": "In fact, working out after your shot can help you fight the flu. In a May 2022 study in ​Brain, Behavior, and Immunity,​ researchers found exercising for 90 minutes following your shot can actually up your body's antibody response, improving the vaccine's effectiveness.\n\nPlus, working out after a flu shot may also reduce symptoms like soreness at the injection site, according to a January 2020 ​Brain, Behavior, and Immunity - Health​ study. Exercising after a flu shot gets your blood flowing and can act as an anti-inflammatory for your body. And a June 2022 review in ​PLOS One​, which combed through past studies on exercise and vaccines, found including the same arm where you received the shot in your workout may boost your antibody response even more.\n\nThere are generally no restrictions on post-vaccine exercise, and it's fine to do strength workouts after a flu shot as long as you feel up to them and listen to your body. But following these strategies can make lifting weights after a flu shot far more comfortable:\n\nAs soon as you sit down in the pharmacist or doctor's chair, ask to get the vaccine in your non-dominant arm. This will make it easier to continue your normal daily activities, like working out, even if you experience some mild soreness in that shoulder.\n\nThough recent research suggests same-arm exercise gives you the most benefit, if your arm's not totally comfortable after your shot (it's feeling very sore or you have trouble accessing your shoulder's full range of motion), stick to lower-body exercises until your arm feels better. Trying to do moves like overhead presses and bench presses when you're lacking shoulder mobility can increase your risk of injury.\n\nSpeaking of shoulder mobility, do some dynamic stretching and warm up well before doing any lifting — even if you don't plan on taxing your deltoids. Even a move like a back squat requires your arms and shoulders to move around freely.\n\nToday's probably not the day to shoot for a PR. And that's OK. Respect that there's a lot going on in your body right now — even if you don't have any intense side effects. Let your immune system focus on responding to the vaccine rather than overwhelming it with super-hard exercise.\n\nOn a scale of 1 to 10, try to keep your rate of perceived exertion under an 8 — or keep things even lighter if you need to.\n\nAfter you receive your flu shot, it's normal to have some side effects such as redness, soreness and swelling at the injection site, according to the Centers for Disease Control and Prevention. This soreness is often the result of the immune system creating protective antibodies in response to the vaccine, which is what allows your body to fight the flu.\n\nIf you experience any of these flu-like symptoms, consider it a rest day. Also, if you have any nausea or dizziness, it is not safe to lift weights or do any exercise. If the symptoms are severe or worsen, consult your doctor.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "Can you lift weights after a flu shot? Yes, as long as your side effects are mild. Use these tips for a more comfortable strength workout after a flu shot.", "url": "https://www.livestrong.com/article/266510-how-to-lift-weights-after-a-flu-shot/", "title": "Want to Do a Strength Workout After a Flu Shot? Follow These Tips | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F41b849c1b165459da815a3b87ac59877.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#-tips-for-doing-a-strength-workout-after-a-flu-shot", "#when-not-to-work-out-after-a-flu-shot", "https://pubmed.ncbi.nlm.nih.gov/35131444/", "https://www.sciencedirect.com/science/article/pii/S2666354619300092", "https://www.livestrong.com/article/13763799-anti-inflammatory-exercises/", "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0268625", "/article/13732149-20-minute-workout-recover-flu/", "/article/13731758-covid-vaccine-side-effects-treatment/", "/article/398102-weight-lifting-after-a-tetanus-vaccine/", "/article/13732149-20-minute-workout-recover-flu/", "/article/13731758-covid-vaccine-side-effects-treatment/", "/article/398102-weight-lifting-after-a-tetanus-vaccine/", "https://www.livestrong.com/article/13731885-exercises-reduce-arm-soreness-after-covid-vaccine/", "https://www.livestrong.com/sscat/lower-body-exercises/", "https://www.livestrong.com/slideshow/1011246-10-dynamic-warmup-exercises-prime-workout/", "https://www.livestrong.com/article/13722060-exercises-stretches-tight-shoulders/", "https://www.livestrong.com/sscat/the-immune-system/", "https://www.livestrong.com/article/543824-what-is-the-rpe-scale-in-exercise/", "https://www.livestrong.com/article/13719717-indoor-cycling-benefits/", "https://www.livestrong.com/article/283396-signs-to-look-for-after-a-flu-shot/", "https://www.cdc.gov/flu/about/qa/flushot.htm"], "authors": ["K. Aleisha Fetters", "//storage.leafmedia.io/contentlab-data/profile/6/1/8099d376180f4c37a60fd7fb698d5cf6.jpg"], "publish_date": null}