{"result_id": "193033", "URL": "https://www.livestrong.com/article/398102-weight-lifting-after-a-tetanus-vaccine/", "timestamp": "2023-04-25 16:18:26 CEST+0200", "meta": {"description": "Injections can be painful, especially when they are administered in the muscle. You can still exercise after a tetanus shot, but might want to rest your arm.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/398102-weight-lifting-after-a-tetanus-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "Weight Lifting After a Tetanus Vaccine | Livestrong.com", "cleaned_text": "A tetanus vaccine is administered to protect you against tetanus. Tetanus, also known as lockjaw, is a bacterial infection according to Mayo Clinic. The bacteria enter your body through a puncture wound, dirty cut or animal bite. Once in the body, the bacteria release toxic poisons that impair nerves that control your muscles. The doctor may advise you to avoid vigorous arm activities like weightlifting after receiving a tetanus vaccine.\n\nTetanus vaccine is administered to adults and children 7 years or older. Tetanus vaccine is also given to infants with two other vaccines for diphtheria and whooping cough in a series of three injections. Booster injections are given to children and adults every 10 years. It is very important for patients to receive booster doses every 10 years so as to maintain active immunization against tetanus. Booster injections are also given to patients receiving care for wounds or injuries that break the skin.\n\nTetanus vaccine is administered as a deep intramuscular injection in the muscles of the upper arm, and it may cause arm soreness, redness and swelling at the site of the injection. Doctors often advise patients who have received a tetanus shot to frequently move the arm that has received the shot so as to reduce discomfort.\n\nHowever, weightlifting might not be recommended. Lifting weights too soon after a tetanus vaccine may increase soreness in the arm that has received the tetanus vaccine. Instead, focus on cardio after a tetanus shot or leg strengthening exercises as your arm heals.\n\nPeople who receive a tetanus vaccine might be advised to wait one or two days before resuming vigorous exercises such as weightlifting so as to allow arm soreness and swelling to heal. During the waiting period, assess the site of tetanus vaccine injection for any signs of infections. Check the general appearance of the arm and report any abnormalities to the doctor. If no arm abnormalities are noted after two days, you may likely resume weightlifting.\n\nWeightlifting can worsen muscular weakness, which can be an adverse side effects of tetanus vaccine. Lifting weights when you have muscular weakness caused by a negative reaction to a tetanus vaccine causes further stress on the arm muscles.\n\nSome people who receive tetanus injection have difficulties lifting their arm or picking things up using the arm, but this usually resolves one or two days after injection. People who continue to experience muscle weakness three days after receiving a tetanus vaccine should consult the doctor.\n\nReduce pain after your tetanus injection by applying an ice pack for 20 minutes, three to four times per day for the first 24 to 48 hours. If you still have soreness or swelling after that time frame, switch to heat.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "Injections can be painful, especially when they are administered in the muscle. You can still exercise after a tetanus shot, but might want to rest your arm.", "url": "https://www.livestrong.com/article/398102-weight-lifting-after-a-tetanus-vaccine/", "title": "Weight Lifting After a Tetanus Vaccine | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/clsd/getty/e96f4ecc99c541cc8082420850e4df51.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.mayoclinic.org/diseases-conditions/tetanus/symptoms-causes/syc-20351625", "/article/13731758-covid-vaccine-side-effects-treatment/", "/article/13764251-which-arm-to-get-covid-vaccine/", "/article/110009-signs-symptoms-pulled-muscle/", "https://www.livestrong.com/article/137561-are-flu-shot-symptoms-contagious/", "/article/13731758-covid-vaccine-side-effects-treatment/", "/article/13764251-which-arm-to-get-covid-vaccine/", "/article/110009-signs-symptoms-pulled-muscle/", "https://www.cdc.gov/vaccines/vpd/dtap-tdap-td/public/index.html", "https://www.livestrong.com/article/266510-how-to-lift-weights-after-a-flu-shot/", "https://www.cardiosmart.org/healthwise/sig3/065/sig3065"], "authors": ["Destiny Simmons", "http://s3.amazonaws.com/cme_public_images/www_demandstudios_com/sitelife.studiod.com/ver1.0/Content/images/store/9/1/19b8556b-7cab-424e-b189-62cd6efe1ef1.Small.jpg"], "publish_date": null}