{"result_id": "193035", "URL": "https://www.livestrong.com/article/13763718-covid-vaccine-guilt/", "timestamp": "2023-04-25 16:18:30 CEST+0200", "meta": {"description": "It's normal to have some COVID vaccine guilt if you're able to get the shot before other people. Here are five things that might help with those feelings.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13763718-covid-vaccine-guilt/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "5 Things to Do if You're Feeling Guilty About Getting the COVID Vaccine | Livestrong.com", "cleaned_text": "You're on the list! You scored an appointment! Now it's time to get the vaccine. But wait, something doesn't feel quite right. There are so many people around you that haven't gotten theirs.\n\nThe COVID-19 vaccine is now available to every adult who wants it, but finding an appointment can still be difficult. So if you got lucky, the happiness associated with the vaccine may be intermingled with feelings of guilt. Or, if you're relatively young and healthy and feel that other people need the vaccine more, you may also be feeling mixed emotions. There's a name for that: It's called COVID vaccine guilt.\n\n\"COVID vaccine guilt is normal, and some people who have received the vaccine in a younger age group may not want to disclose they received it,\" says Sanam Hafeez, PsyD, a licensed neuropsychologist and faculty member at Columbia University in New York City.\n\n\"People may feel guilty because they think they 'don't deserve' the shot when so many other people are having trouble securing an appointment, feel that others are in a more critical condition than they are or if they're young, working remotely or generally healthy,\" Dr. Hafeez explains.\n\nFirst, recognize that your guilt can help. \"Guilt helps us be aware of our actions, and it means that we care about others,\" Dr. Hafeez says.\n\n\"Each individual getting the vaccine when they can means they are doing their part not only to help reach herd immunity, but this will also lead to a reduction in anxiety, isolation, hospitalizations and economic strain,\" says Jordan Golubcow-Teglasi, MD, internist at Westmed Medical Group in Westchester, New York. \"The pandemic itself is causing a lot of harm to society at large, in addition to being a deadly virus. Every vaccine takes us one step closer to emerging from this situation.\"\n\nDon't feel comfortable opening up? Write down the reasons why you feel guilty and then challenge them: Why might that thought not be true? For example, you might remind yourself that you are not actually taking a shot from someone else.\n\nWhat would you say to your best friend in this situation? You probably wouldn't tear them down, right? Then apply this advice to yourself, Dr. Hafeez says.\n\nIf you have an elderly family member or neighbor who has been looking for an appointment, help them out by searching online to find an appointment, or volunteer with a local vaccination center, suggests Dr. Golubcow-Teglasi.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "It's normal to have some COVID vaccine guilt if you're able to get the shot before other people. Here are five things that might help with those feelings.", "url": "https://www.livestrong.com/article/13763718-covid-vaccine-guilt/", "title": "5 Things to Do if You're Feeling Guilty About Getting the COVID Vaccine | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/clsd/getty/c3a0674897c34ef5ab34ea00d704ec4a.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.livestrong.com/article/13732238-covid-vaccine-ethics-priority-groups/", "http://comprehendthemind.com/about-us/", "/article/13763794-how-to-overcome-fear-of-needles-injections/", "/article/13729706-how-to-help-someone-with-copd/", "/article/13726036-gratitude-exercise-reduce-stress/", "https://www.livestrong.com/stay-healthy/", "/article/13763794-how-to-overcome-fear-of-needles-injections/", "/article/13729706-how-to-help-someone-with-copd/", "/article/13726036-gratitude-exercise-reduce-stress/", "https://www.livestrong.com/article/13726454-herd-immunity-explained/", "https://www.westmedgroup.com/providers/jordan-golubcow-teglasi/", "https://www.livestrong.com/article/13732163-reasons-to-get-covid-vaccine/", "https://www.livestrong.com/article/13763878-dr-b-covid-vaccine/", "https://www.livestrong.com/article/13763955-fully-vaccinated-covid/", "https://www.livestrong.com/article/13731143-what-to-do-after-covid-vaccine/", "https://www.livestrong.com/article/13731758-covid-vaccine-side-effects-treatment/"], "authors": ["Jessica Migala"], "publish_date": null}