{"result_id": "193038", "URL": "https://www.livestrong.com/article/13721578-flu-shot-benefits/", "timestamp": "2023-04-25 16:18:36 CEST+0200", "meta": {"description": "The flu shot benefits everyone, but it has surprising side effects for pregnant women, people with high blood pressure and those with other health conditions.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13721578-flu-shot-benefits/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "4 Surprising Benefits of the Flu Shot (Beyond, You Know, Not Getting the Flu) | Livestrong.com", "cleaned_text": "You may hear it from your mom, your employer or your local pharmacist (or, more likely, all three): \"Don't forget your flu shot.\" But did you know that getting vaccinated offers more benefits than just, well, protection from the flu?\n\nOf course, there's no guarantee you won't get sick, since the shot is meant to protect against only the most common strains of the flu virus. But it is highly effective: According to the Centers for Disease Control and Prevention (CDC), between 2016 and 2017, the flu vaccination prevented an estimated 5.3 million cases of influenza.\n\n\"There are no benefits to not getting the flu shot,\" Waleed Javaid, MD, an infectious disease expert at Mount Sinai in New York City, tells LIVESTRONG.com. It's inexpensive, easy to get and shown to be safe. \"Plus, it's never too late to get the flu shot, as long as it's available,\" he says.\n\nThe flu can really knock you out… or quite literally put you in the hospital. Symptoms of the flu, such as low appetite, fever, vomiting and diarrhea, can lead to dehydration and pneumonia. Also, if you have a chronic illness, such as diabetes or respiratory issues, getting the flu can lead to dangerous health complications and even up your risk of dying.\n\nThat's where the flu shot comes in. According to the CDC, the vaccination reduces the risk of flu-related hospitalizations by about 40 percent. It also greatly decreases the odds that the flu will land you in the ICU.\n\nPregnant women are particularly at risk for flu and more likely to have severe symptoms than women who are not pregnant, according to the Mayo Clinic. For this reason, \"It's important for pregnant women get vaccinated as early in their pregnancy and in the flu season as possible,\" says Dr. Javaid.\n\nAnd keep in mind that the flu shot acts as a double whammy of protection because the flu-fighting benefits are transferred to your baby and can last up to six months after birth — when little ones are old enough to get their own flu vaccination, James Cherry, MD, a pediatric infectious disease expert at UCLA Mattel Children's Hospital, tells LIVESTRONG.com.\n\nFor people with high blood pressure, the flu vaccine is associated with an 18 percent reduced risk of death during flu season, according to new research presented in September 2019 at the European Society of Cardiology's World Congress of Cardiology.\n\nAccording to researchers, patients with high blood pressure saw a decrease in heart attacks, stroke and death when they received the flu shot. \"Some people with hypertension (high blood pressure), especially if they're older, have a greater risk of dying to start with,\" says Dr. Cherry. \"And if they get the flu on top of those factors, they have a higher mortality rate than most.\"\n\nWant to be more of a do-gooder? Now's your chance! Getting the flu shot boosts more than just your own health and wellbeing — it helps decrease the overall spread of influenza, which is good news for everyone. \"Protecting ourselves means we're preventing a big flu epidemic, like we've seen in the past,\" says Dr. Javaid. (Case in point: The influenza pandemic of 1918 claimed at least 50 million lives.)", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "The flu shot benefits everyone, but it has surprising side effects for pregnant women, people with high blood pressure and those with other health conditions.", "url": "https://www.livestrong.com/article/13721578-flu-shot-benefits/", "title": "4 Surprising Benefits of the Flu Shot (Beyond, You Know, Not Getting the Flu) | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/clsd/getty/6985f48eeec04beda5b7d5ca0f18988e.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.livestrong.com/article/13728485-how-to-get-flu-vaccine/", "https://www.livestrong.com/article/13768052-flu-statistics/", "https://www.cdc.gov/flu/prevent/keyfacts.htm#benefits", "/article/13728165-flu-shot-vaccine-myths/", "/article/13723327-your-weight-and-the-flu/", "/article/13727799-vaccine-schedule/", "https://www.mountsinai.org/profiles/waleed-javaid", "/article/13728165-flu-shot-vaccine-myths/", "/article/13723327-your-weight-and-the-flu/", "/article/13727799-vaccine-schedule/", "https://www.livestrong.com/article/397913-should-you-exercise-when-you-have-the-flu/", "https://newsnetwork.mayoclinic.org/discussion/mayo-clinic-minute-why-pregnant-women-need-flu-shots/", "https://www.uclahealth.org/james-cherry", "https://www.escardio.org/The-ESC/Press-Office/Press-releases/Flu-vaccination-linked-with-lower-risk-of-death-in-patients-with-high-blood-pressure", "https://www.cdc.gov/flu/pandemic-resources/1918-pandemic-h1n1.html"], "authors": ["Ashley Macha", "https://s3-us-west-1.amazonaws.com/contentlab.studiod/profile/6/27/ffaa82c5def4480e8eccc942878fd55d.jpg"], "publish_date": null}