{"result_id": "193007", "URL": "https://www.livestrong.com/article/13764253-what-happens-if-injection-missed-muscle/", "timestamp": "2023-04-25 16:17:41 CEST+0200", "meta": {"description": "Learn why the COVID-19 vaccine needs to be injected into the shoulder muscle, and what happens if the shot lands in your arm fat or shoulder joint instead.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13764253-what-happens-if-injection-missed-muscle/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "What Happens if a Vaccine Shot Misses the Muscle? | Livestrong.com", "cleaned_text": "The thrill of getting an appointment for your first COVID shot might quickly be followed by worries — about side effects, maybe, or even what might happen if you're given the shot incorrectly.\n\nOnce injected, the mRNA in the Pfizer or Moderna vaccines enters muscle cells, where it instructs these cells to make a piece of the spike protein of the virus. That's what triggers the body to produce antibodies, which can then recognize and fight off the coronavirus if and when you come into contact with it.\n\nSimilarly, the one-shot Johnson & Johnson is a viral vector vaccine, which means it uses a deactivated cold virus to carry genetic info from the novel coronavirus into your muscle cells, where it creates the spike protein that triggers your immune response.\n\n\"It is possible to miss the muscle with the COVID-19 vaccine. That's because different arms have different amounts of fat,\" John Segreti, MD, medical director of infection control and prevention at Rush University Medical Center in Chicago, tells LIVESTRONG.com.\n\nPeople in bigger bodies, including those who fall into very high BMI categories, may need a longer needle in order to reach the muscle. Otherwise, it's difficult to miss the deltoid muscle, Dr. Segreti says.\n\nThe Centers for Disease Control and Prevention (CDC) gives little advice on what to do if this happens and the vaccine is injected into the fat, except for telling providers not to repeat the same dose of the vaccine. (In other words, if it missed the deltoid, it's not like the vaccine \"doesn't count.\")\n\nIf the error happened during your first shot of a two-dose vaccine, you should still go in and get the second dose at the correct interval (21 days later for Pfizer, 28 days for Moderna).\n\nTo help make sure the shot lands where it's supposed to, wear clothing that can easily and completely expose your shoulder (rather than, say, pulling the neck of your shirt down around your shoulder).\n\nIf the provider thinks the shot didn't go in correctly, he or she should talk to you about potential side effects.\n\nThe nonprofit Institute for Safe Medication Practices flags a particular problem called \"shoulder injury related to vaccine administration\" (SIRVA). SIRVA is the result of a vaccine being injected into the shoulder joint, which can lead to inflammation that causes:\n\nShoulder pain and inflammation can be easily mistaken for an injury. If you experience shoulder pain that does not go away, tell your doctor you received the vaccine so they have this info when evaluating you.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "Learn why the COVID-19 vaccine needs to be injected into the shoulder muscle, and what happens if the shot lands in your arm fat or shoulder joint instead.", "url": "https://www.livestrong.com/article/13764253-what-happens-if-injection-missed-muscle/", "title": "What Happens if a Vaccine Shot Misses the Muscle? | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F77459d5472ce40adbdfe15215e20e472.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.livestrong.com/article/13731758-covid-vaccine-side-effects-treatment/", "https://www.cdc.gov/vaccines/covid-19/downloads/healthcare-professionals-mRNA.pdf", "/article/13731758-covid-vaccine-side-effects-treatment/", "/article/13764251-which-arm-to-get-covid-vaccine/", "/article/288470-how-to-give-b12-im-injections/", "https://wexnermedical.osu.edu/blog/explaining-johnson-johnson-astrazeneca-vaccines", "https://www.livestrong.com/stay-healthy/", "https://www.rushu.rush.edu/faculty/john-segreti-md", "/article/13731758-covid-vaccine-side-effects-treatment/", "/article/13764251-which-arm-to-get-covid-vaccine/", "/article/288470-how-to-give-b12-im-injections/", "https://www.cdc.gov/obesity/adult/defining.html", "https://www.cdc.gov/vaccines/covid-19/info-by-product/clinical-considerations.html", "https://ismp.org/resources/prevent-shoulder-injuries-during-covid-19-vaccinations", "https://www.livestrong.com/article/13764251-which-arm-to-get-covid-vaccine/", "https://www.livestrong.com/article/13763955-fully-vaccinated-covid/", "https://www.livestrong.com/article/13763794-how-to-overcome-fear-of-needles-injections/"], "authors": ["Jessica Migala"], "publish_date": null}