{"result_id": "193014", "URL": "https://www.livestrong.com/article/13732031-is-it-safe-to-visit-people-who-have-gotten-covid-vaccine/", "timestamp": "2023-04-25 16:17:54 CEST+0200", "meta": {"description": "If a loved one has gotten the COVID-19 vaccine, can you safely visit them without wearing a mask or social distancing? A public health expert weighs in.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13732031-is-it-safe-to-visit-people-who-have-gotten-covid-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "Is It Safe to Visit Friends and Family Once They've Been Vaccinated? | Livestrong.com", "cleaned_text": "There are loved ones who you haven't seen in almost a year. There are friends you haven't hugged or laughed with in person in forever. And you just really can't do more Zoom meet-ups. Now that the COVID vaccine is out, is it finally safe to see people after they've been vaccinated?\n\n\"I know that this isn't what people want to hear, but at the moment, we don't know whether or not people who have been vaccinated will spread the disease to others,\" Ranit Mishori, MD, MHS, professor of family medicine at Georgetown University School of Medicine and interim Chief Public Health Officer at Georgetown University in Washington, DC, tells LIVESTRONG.com.\n\nThat's why fully vaccinated people should only get together indoors with unvaccinated people from one other household at a time, according to the Centers for Disease Control and Prevention (CDC). You can skip the masks, too, unless any of those people (or anyone in their respective households) is at a higher risk for getting severely sick from COVID-19.\n\nThat means vaccinated grandparents can see their grandchildren, as long as those grandkids all live under the same roof. But something like, say, a birthday party that brings together families from multiple households is still not a good idea.\n\nThe COVID-19 vaccines protect against moderate and severe disease, as well as death, Dr. Mishori says. Obviously, that's a great thing. But what's less clear is whether a vaccinated person can be a carrier of the coronavirus (in other words, be infected without showing symptoms) and then transmit it to others.\n\nMost vaccines out there reduce transmission of the virus they're made to protect against, according to the FDA. While we hope this is the case for the COVID vaccine, the truth is we just don't know yet because there hasn't been enough research to confirm either way.\n\nSo, here's the deal: You can see family and friends, but you should still maintain caution. If you are not vaccinated but are seeing a parent or grandparent who is, for example, you should still think about sticking to physical distancing guidelines and washing your hands often, Dr. Mishori says. (Go ahead and hug them, but then step back apart, she says.)\n\nThe vaccinated person might still be able to infect you. Or, there's also a chance ​you​ could pass the virus along to them, and while they would only get mildly ill (or not at all), they could then pass it along to someone in their circle who is unvaccinated.\n\nIf you're fully vaccinated, you can feel free to get together indoors, sans masks, with other fully vaccinated people, according to the CDC. (Keep in mind that \"fully vaccinated\" means it has been at least two weeks since you received a single-dose vaccine, like the one from Johnson & Johnson, or since you received the second dose of a two-dose vaccine, such as the ones from Pfizer and Moderna.)\n\n\"There's a very good chance both of you are OK, with the caveat that both of you could infect each other. But, we know with a certain degree of certainty that you wouldn't get very sick,\" Dr. Mishori says.\n\nStill, new COVID variants, which may be more transmissible or cause more severe disease, are circulating in the U.S. and they make it even more important to continue to keep up with public health recommendations, despite vaccination. (In short, the less the virus spreads, the less likely it is to mutate and leave us with more variants to deal with, which could end up being resistant to the current vaccines.)\n\n\"If enough people are vaccinated (about 75 to 80 percent of the population), the virus has little chance of transmission and dies down. That's why we want as many people as possible, as quickly as possible, to be vaccinated,\" Dr. Mishori says.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "If a loved one has gotten the COVID-19 vaccine, can you safely visit them without wearing a mask or social distancing? A public health expert weighs in.", "url": "https://www.livestrong.com/article/13732031-is-it-safe-to-visit-people-who-have-gotten-covid-vaccine/", "title": "Is It Safe to Visit Friends and Family Once They've Been Vaccinated? | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F7b2e9d0074be422e991874b37959de25.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gufaculty360.georgetown.edu/s/contact/00336000014RZvoAAG/ranit-mishori-md", "/article/13727783-covid-19-risk-medications/", "/article/13727455-social-distancing-tips-seeing-loved-ones/", "/article/13731648-face-mask-guide-covid/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated.html", "https://www.cdc.gov/coronavirus/2019-ncov/need-extra-precautions/people-with-medical-conditions.html", "https://www.livestrong.com/stay-healthy/", "https://www.livestrong.com/article/13729140-covid-19-vaccine-development/", "https://www.livestrong.com/article/13729340-mistakes-that-spread-covid/", "/article/13727783-covid-19-risk-medications/", "/article/13727455-social-distancing-tips-seeing-loved-ones/", "/article/13731648-face-mask-guide-covid/", "https://www.fda.gov/emergency-preparedness-and-response/mcm-legal-regulatory-and-policy-framework/pfizer-biontech-covid-19-vaccine-frequently-asked-questions", "https://www.livestrong.com/article/13731126-covid-variant-mutation/", "https://www.cdc.gov/coronavirus/2019-ncov/transmission/variant-cases.html", "https://www.livestrong.com/article/13726454-herd-immunity-explained/", "https://www.livestrong.com/article/13727561-how-to-wear-face-mask/", "https://www.livestrong.com/article/13731648-face-mask-guide-covid/", "https://www.livestrong.com/article/13731521-covid-vaccine-facts/", "https://www.livestrong.com/article/13731758-covid-vaccine-side-effects-treatment/"], "authors": ["Jessica Migala"], "publish_date": null}