{"result_id": "193012", "URL": "https://www.livestrong.com/article/13730767-covid-vaccine-immunity-vs-natural-immunity/", "timestamp": "2023-04-25 16:17:50 CEST+0200", "meta": {"description": "You may have some natural immunity to COVID-19 if you've had the disease, but is that as effective as getting the vaccine? Here's what you should know.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.livestrong.com/article/13730767-covid-vaccine-immunity-vs-natural-immunity/", "encoding": "utf-8"}, "image": null, "domain": "www.livestrong.com", "title": "If You’ve Had COVID-19, Do You Still Need to Get the Vaccine? | Livestrong.com", "cleaned_text": "Now that doses of several COVID-19 vaccines are becoming more widely available across the country, you probably have a lot of questions about what happens when you're OK'd to get the shot.\n\nThe Centers for Disease Control and Prevention (CDC) says yes, and health experts suggest you do, too — both for your health and the safety of others. Here's why.\n\n​\"​Patients who have been infected with COVID-19 should still get the vaccine. We are not certain that a prior infection will lead to lifelong immunity. Current data suggests a prior infection could confer immunity for around six months,\" says Michelle Prickett, MD, an associate professor of medicine at Northwestern University Feinberg School of Medicine in Chicago and a Northwestern Medicine pulmonary and critical care specialist.\n\nWhile not common, there have been confirmed cases of people who have gotten reinfected with COVID-19. One report on a young man from Nevada, described in ​The Lancet Infectious Diseases​, noted the second infection was worse than the first, sending the patient to the hospital for oxygen.\n\nSo, even if you think you're comfortable with risking it because your brush with COVID wasn't that bad, that doesn't mean a future illness would be a walk in the park.\n\nBecause we don't know how long natural immunity really lasts, Lisa Lee, PhD, research professor in the department of population health sciences at Virginia Tech, also recommends getting the vaccine even if you've had COVID-19 in the past, and stresses that it's safe to do so.\n\nLee explains that while vaccine trials didn't actively seek out and enroll people who had previously had COVID, some participants did actually have the infection before. (There were, after all, tens of thousands of people included.)\n\nBecause of that, \"in terms of safety, it's not an issue to get vaccinated [after recovering from COVID-19], and it will certainly help prevent a person from becoming infected again,\" she says. (The Pfizer vaccine, for example, is 95 percent effective against symptomatic COVID.)\n\nTypical side effects are similar to a flu vaccine, per the CDC: Your arm may get sore from the needle prick, and you might also get a fever or feel achy for a day or two after, a sign that your immune system is responding to the vaccine.\n\nHere's the not-so-great news: Some early research shows that people who've had COVID tend to have a stronger reaction to the first shot of the Pfizer or Moderna vaccines. In a preprint study posted to medRxiv, researchers said these people reported fever, chills, fatigue, headache and body aches more often than people who had never been infected with the virus.\n\nOn the bright side, though, COVID survivors also showed much higher antibody levels after both the first and second shots. We don't yet know exactly what that means for immunity, but having more antibodies to fight a deadly virus seems like it could only be a good thing.\n\nAs of October 2020, less than 10 percent of the world population had been infected with COVID-19, according to the World Health Organization. In other words? There are still so many people who could get severely ill and possibly die from the disease.", "opengraph": {"site_name": "LIVESTRONG.COM", "description": "You may have some natural immunity to COVID-19 if you've had the disease, but is that as effective as getting the vaccine? Here's what you should know.", "url": "https://www.livestrong.com/article/13730767-covid-vaccine-immunity-vs-natural-immunity/", "title": "If You’ve Had COVID-19, Do You Still Need to Get the Vaccine? | Livestrong.com", "type": "article", "image": "https://img.livestrong.com/640/cme-data/getty%2F8a74139b87084ab183bf679394ab6337.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.livestrong.com/article/13727403-positive-covid-19-antibody-test/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/faq.html", "https://www.livestrong.com/stay-healthy/", "/article/13731521-covid-vaccine-facts/", "/article/13727489-covid-19-recovery/", "/article/13764469-no-covid-vaccine-side-effects-meaning/", "https://www.feinberg.northwestern.edu/faculty-profiles/az/profile.html?xid=19688", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(20)30783-0/fulltext", "/article/13731521-covid-vaccine-facts/", "/article/13727489-covid-19-recovery/", "/article/13764469-no-covid-vaccine-side-effects-meaning/", "https://publichealth.vt.edu/people/facultystaff/lisamlee.html", "https://www.cdc.gov/vaccines/acip/recs/grade/covid-19-pfizer-biontech-vaccine.html", "https://www.livestrong.com/article/13731758-covid-vaccine-side-effects-treatment/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html", "https://www.livestrong.com/article/13725963-what-is-immune-system/", "https://www.medrxiv.org/content/10.1101/2021.01.29.21250653v1.full", "https://www.who.int/news-room/q-a-detail/herd-immunity-lockdowns-and-covid-19", "https://www.livestrong.com/article/13726454-herd-immunity-explained/", "https://health.clevelandclinic.org/how-much-of-the-population-will-need-to-be-vaccinated-until-the-pandemic-is-over/", "https://www.livestrong.com/article/13732163-reasons-to-get-covid-vaccine/", "https://www.livestrong.com/article/13732238-covid-vaccine-ethics-priority-groups/", "https://www.livestrong.com/article/13763878-dr-b-covid-vaccine/"], "authors": ["Jessica Migala"], "publish_date": null}