{"result_id": "195030", "URL": "https://www.mediafactwatch.com/2017-02-22-google-blacklists-natural-news-removes-140000-pages-from-its-index-memory-holes-natural-news-investigative-articles.html", "timestamp": "2023-04-25 16:19:02 CEST+0200", "meta": {"description": "Late last week, I received a direct threat that warned if I did not take steps to destroy Alex Jones and InfoWars, I would be targeted for destruction in a campaign of smears, censorship and defamation. Instead of giving in to the enemy, I refused to take the bait and went public with details of […]", "lang": "en", "keywords": "Big Pharma,Blacklisted,Censorship,free speech,globalists,Google,investigations,Journalism,Natural.news", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.mediafactwatch.com/2017-02-22-google-blacklists-natural-news-removes-140000-pages-from-its-index-memory-holes-natural-news-investigative-articles.html", "encoding": "UTF-8"}, "image": null, "domain": "www.mediafactwatch.com", "title": "GOOGLE blacklists Natural News… removes 140,000 pages from its index… “memory holes” Natural News investigative articles on vaccines, pharma corruption, fraudulent science and more", "cleaned_text": "GOOGLE blacklists Natural News… removes 140,000 pages from its index… “memory holes” Natural News investigative articles on vaccines, pharma corruption, fraudulent science and more\n\nLate last week, I received a direct threat that warned if I did not take steps to destroy Alex Jones and InfoWars, I would be targeted for destruction in a campaign of smears, censorship and defamation.\n\nInstead of giving in to the enemy, I refused to take the bait and went public with details of the threat, warning everyone in the new media that sinister forces were now being pursued to undermine and silence every anti-establishment (and pro-Trump) voice on the internet.\n\nNEW: Sign this White House petition NOW to halt Google’s outrageous censorship of Natural News, InfoWars and other independent media publishers.\n\nTrue to form, today the entire Natural News website has been blacklisted by Google, entirely without warning. This is just one of many censorship events that have all taken place over the last few days:\n• Last weekend, damning videos were leaked in a focused effort to take out Milo Yiannopoulos, a former Breitbart News editor and gay conservative who has openly supported President Trump. Milo was hit with an attack wave of “opposition research” and was forced to resign from Breitbart on Monday, citing the “cynical media witch hunt” that brought him down.\n• Yesterday, InfoWars was blackballed by AdRoll.com, an online advertising distribution company. According to Alex Jones, the blacklisting by AdRoll will cost InfoWars $3 million in annual revenues, possibly causing InfoWars to abandon plans of opening a Washington D.C. bureau to cover the Trump administration with real news (instead of the fake news from CNN and elsewhere).\n• The Shopify e-commerce platform was aggressively threatened by organized Leftists to dump the Breitbart online store and thereby deny revenues to Breitbart. Shopify’s CEO refused to kow-tow to the intimidation and censorship and has maintained a “neutral” position on political issues, focusing on running e-commerce platforms for everyone.\n• Today, Natural News has been hit by Google, which has blacklisted the entire Natural News domain and removed over 140,000 pages from its index. The take down of Natural News happened this morning, and it follows a pattern of censorship we’re seeing being leveled against other pro-Trump websites. Google sent no warning whatsoever to our “webmaster tools” email address on file with them. The shut off of Natural News was clearly driven by a human decision, not an algorithm. We’re currently attempting to determine Google’s claimed justification for censoring our entire website, and we hope to have NaturalNews.com restored in Google’s index.\n\nSome of the news now being censored by Google includes our laboratory testing of the U.S. water supply, where we conducted laboratory testing to discover that 6.7% of municipal water is contaminated with toxic metals. Google has also blacklisted our announcement of free laboratory testing services for Native American water supplies impacted by oil pipeline leaks. Also blacklisted is our exclusive coverage of the GlaxoSmithKline criminal indictment by the U.S. Justice Dept. and our interview with the whistleblower who helped achieved a record $3 billion settlement with the criminal drug company.\n\nApparently, Google believes the public should no longer have access to these investigative journalism articles… and 139,997 more articles that cover activism, science frauds, drug industry criminality, political corruption and more. You are witnessing a modern-day book burning by the internet Gestapo that now decides what knowledge you’re never allowed to access… especially because much of that knowledge can help set humanity free.\n\nI describe it in more detail in this podcast: (article continues below)\n\nSilencing Natural News is all part of the globalist “script” for the enslavement of a population kept ignorant of reality\n\nNatural News is, of course, one of the world’s top educational and activism sources exposing the lies of dangerous medicine, toxic mercury in vaccines, the corporate-quack science behind GMOs, cancer industry fraud and so on. By providing truthful, empowering and passionate information to the public, we harm the profit model of the corrupt medical cartels that fund the media, lobby the government and influence internet gatekeepers with advertising money. (Google has already declared war on natural medicine and nutritional supplements, all but banning them from being advertised on Google Adsense.)\n\nThe removal of Natural News from Google’s index means that millions of people may now be unnecessarily harmed by toxic medicines, herbicides and brain-damaging mercury in vaccines because they are being denied the “other side of the story” that’s censored by the corporate-controlled media. By censoring Natural News, Google is, in effect, siding with the criminal pharmaceutical industry that has been charged with multiple felony crimes and caught bribing doctors, fraudulently altering scientific studies, conducting medical experiments on children and price fixing their drugs to maximize profits.\n\nIn effect, censorship of Natural News is part of the establishment’s war on humanity which includes depopulation measures (Bill Gates), covert infertility vaccines, corporate-run media disinfo campaigns and a full-on assault against scientific truth and free speech conducted in the public interest.\n\nWith the attacks on Milo, InfoWars and Natural News, what you are witnessing right now is the coordinated silencing of every voice that opposes the corrupt, globalist establishment. All such voices are being “memory holed” in the run-up to an attempted Orwellian-style domination over all information run by Facebook, Google, Yahoo, Twitter and other internet gatekeepers. This is all by design. It is nefarious, sinister and represents nothing less than the final desperate assault to enslave humanity by silencing truth.\n\nIt’s clear to me that Natural News is being targeted primarily because of our support for President Trump and his review of vaccine safety. It is now apparent that any person who engages in real science, critical thinking or any attempt to protect children from the brain damaging effects of mercury in vaccines is going to be silenced, discredited, smeared and blacklisted. This is an astonishing realization about the depths of total corruption in society today and how the medical cartels control information to maximize their profits off human suffering.\n\nNote that if I had agreed to betray my colleagues and agree to participate in a smear campaign against Alex Jones, everything would have been fine with Natural News and you wouldn’t see the attacks being waged against us. The tactic now being pursued by the establishment is, “Join the Dark Side or be destroyed.”\n\nI won’t ever join the Dark Side, which means I will be silenced. The message from Google and other information gatekeepers is now clear: Obediently conform to the status quo or you will be banished from the digital realm.\n\nThis is, in essence, nothing less than a modern-day book burning by anti-human globalists who are determined to keep humanity ignorant (and diseased).\n\nThe real agenda of the humanity-hating globalist agenda is now on full display: It’s about total domination over all information so that humanity never learns that cancer can be prevented with vitamin D, or that glyphosate herbicide causes cancer, or that statin drugs are a multi-billion-dollar medical scam. The Sheeple are all slated to be sacrificed upon the altar of Big Pharma profits, and anyone who dares stand in their way will be eliminated by any means necessary.\n\nWhat you can do to fight this brazen censorship and assault being waged against humanity\n\nFirst off, stop using anti-truth internet gatekeepers like Google, Facebook, Yahoo and Twitter. They are quietly controlling your thoughts, ideas and beliefs by limiting your access to valuable resources like Natural News.\n\nSecond, use GoodGopher.com as your search engine, as it provides you with uncensored search results from thousands of independent media websites (many of which are banned or penalized by Google).\n\nThird, bookmark NaturalNews.com in your browser and check it at least twice daily (we post new content each morning and each evening). Manually type it into your browser if you have to. From now on, never rely on some other gatekeeper to bring you to Natural News, because those gatekeepers are censoring all our content.\n\nBe sure to also sign up to our email newsletter using the form below. This email newsletter is one of the best ways we can reach you without being filtered out by other sources. As you might expect, Gmail censors our newsletters too, so don’t use a Gmail email address. (Yes, the censorship is an all-out assault.)\n\nFinally, make Censored.news a primary resource to watch for breaking news on important events that are being censored by the fake news media (CNN, WashPo, NYT, etc.).\n\nFinally, prepare for total war on humanity. I’m being told from other sources that the “final solution” is coming soon from the globalists, and it’s going to be unleashed as an all-out war against Trump, liberty, free speech, natural medicine and every individual who dares stand up and speak the truth against the lying globalists and their fake news minions. The reason they are silencing Natural News, InfoWars and other outlets is because they are preparing for a very big false flag assault and they don’t want independent media websites to be able to counter the “official” news narrative.\n\nI’m serious. Get ready. It’s all coming down soon.", "opengraph": {"title": "GOOGLE blacklists Natural News… removes 140,000 pages from its index… “memory holes” Natural News investigative articles on vaccines, pharma corruption, fraudulent science and more", "type": "article", "url": "https://www.mediafactwatch.com/2017-02-22-google-blacklists-natural-news-removes-140000-pages-from-its-index-memory-holes-natural-news-investigative-articles.html", "site_name": "Media Fact Watch Com", "description": "Late last week, I received a direct threat that warned if I did not take steps to destroy Alex Jones and InfoWars, I would be targeted for destruction in a campaign of smears, censorship and defamation. Instead of giving in to the enemy, I refused to take the bait and went public with details of […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2017/02/GoogleTimeLine.jpg"}, "tags": ["Google", "investigations", "Natural.news", "Big Pharma", "globalists", "Journalism", "Censorship", "free speech", "Blacklisted"], "tweets": [], "movies": [], "links": ["http://www.naturalnews.com/2017-02-16-health-ranger-threatened-by-left-wing-media-goons-destroy-alex-jones-or-we-will-destroy-you.html", "https://petitions.whitehouse.gov/petition/petition-ban-googles-blatant-suppression-free-speech", "http://www.naturalnews.com/2017-02-20-attempted-takedown-of-milo-yiannopoulos-a-timed-character-assassinate-conservative-voices.html", "http://www.infowars.com/breaking-infowars-is-being-censored/", "https://medium.com/@tobi/in-support-of-free-speech-275d62670203", "http://www.naturalnews.com/054580_heavy_metals_municipal_water_systems_independent_science.html", "http://www.naturalnews.com/2017-01-25-health-ranger-donates-lab-testing-native-american-communities-impacted-by-keystone-and-dakota-pipelines.html", "http://www.naturalnews.com/036499_Glaxo_whistleblower_bribery.html", "http://naturalnews.com", "http://www.naturalnews.com/046076_Big_Pharma_criminal_racket_irrefutable_proof.html", "http://www.naturalnews.com/036328_Merck_mumps_vaccine_False_Claims_Act.html", "http://www.naturalnews.com/023654.html", "http://www.naturalnews.com/2017-02-04-what-youre-not-being-told-about-the-lawsuit-against-big-pharma-illegal-drug-price-fixing.html", "http://www.naturalnews.com/051852_Bill_Gates_totalitarian_socialism_climate_change.html", "http://www.naturalnews.com/047571_vaccines_sterilization_genocide.html", "http://www.naturalnews.com/031042_breast_cancer_sunshine.html", "http://www.naturalnews.com/053883_glyphosate_cancer_Roundup_weedkiller.html", "http://www.naturalnews.com/051636_statins_drug_scam_premature_aging.html", "http://GoodGopher.com", "http://NaturalNews.com", "http://www.naturalnews.com/Readerregistration.html", "http://Censored.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2017-02-22-google-blacklists-natural-news-removes-140000-pages-from-its-index-memory-holes-natural-news-investigative-articles&linkname=GOOGLE%20blacklists%20Natural%20News%E2%80%A6%20removes%20140%2C000%20pages%20from%20its%20index%E2%80%A6%20%E2%80%9Cmemory%20holes%E2%80%9D%20Natural%20News%20investigative%20articles%20on%20vaccines%2C%20pharma%20corruption%2C%20fraudulent%20science%20and%20more", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}