{"result_id": "195039", "URL": "https://mediafactwatch.com/2022-11-22-brazil-freezes-bank-accounts-election-integrity-protesters.html", "timestamp": "2023-04-25 16:19:08 CEST+0200", "meta": {"description": "The Brazilian government froze the bank accounts of several individuals who participated in protests against election fraud. The move appeared to mirror the Canadian government’s retaliatory actions against truckers protesting Ottawa’s vaccine mandates. Brazilian President-elect Luiz Inacio Lula da Silva, more popularly known as Lula, won the country’s Oct. 30 runoff election against his predecessor […]", "lang": "en", "keywords": "big government,Brazil,Canada,election integrity,elections,fascism,frozen bank account,Jair Bolsonaro,Justin Trudeau,Luiz Inacio Lula da Silva,police state,protest,resist,revolt,rigged,stolen election,totalitarianism,Tyranny,vote fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2022-11-22-brazil-freezes-bank-accounts-election-integrity-protesters.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "Brazilian government under Leftist Lula freezes bank accounts of anti-election fraud protesters", "cleaned_text": "The Brazilian government froze the bank accounts of several individuals who participated in protests against election fraud. The move appeared to mirror the Canadian government’s retaliatory actions against truckers protesting Ottawa’s vaccine mandates.\n\nBrazilian President-elect Luiz Inacio Lula da Silva, more popularly known as Lula, won the country’s Oct. 30 runoff election against his predecessor Jair Bolsonaro. The closely contested election saw Lula win with a 50.9 percent to 49.1 percent margin, propelling him to the federal capital Brasilia for a second time.\n\nThe leftist president’s term did not sit well with supporters of the populist Bolsonaro, however. They took to the streets to denounce the results of the runoff election, claiming widespread vote fraud that put Lula back into power. Thousands of pro-Bolsonaro drivers parked their vehicles on highways across the Portuguese-speaking nation.\n\nIn response, Brazilian Supreme Federal Court Justice Alexandre de Moraes ordered the freezing of the protesters’ bank accounts. He argued that “repeated abuse of the right to assemble” justified the decision to block the bank accounts of those expressing their grievances.\n\n“It is necessary, appropriate and urgent to block the bank accounts of those investigated, given the possibility of using resources to finance illicit and undemocratic acts, in order to stop the injury or threat to law,” Moraes explained. “Those who, by criminal means, have been taking part in anti-democratic acts will be treated like criminals.”\n\nAccording to local news outlets in Brazil, the magistrate froze the bank accounts of more than 40 people and companies linked to the protests – which Lula’s government blasted as “election denial.”\n\n“Democracy in Brazil was attacked, but it survived,” Moraes later said during a trip to New York. He remarked that the “trend of doubting election results” began in the U.S. with former President Donald Trump and subsequently “spread to Eastern Europe and then to Brazil.”\n\nMoraes’ strategy of targeting the bank accounts of anti-election fraud protesters mirrored that of Justin Trudeau, the prime minister of Canada. The Canadian leader used his country’s Emergencies Act to penalize truckers opposing Wuhan coronavirus (COVID-19) vaccine mandates by freezing their bank accounts.\n\nEarly this year, Canadian truckers organized the Freedom Convoy from the westernmost British Columbia province. The convoy went eastward to the federal capital Ottawa, stopping at Parliament Hill where the truckers and their supporters called on Trudeau to uphold health freedom.\n\nBut on Feb. 14, 2022, Trudeau invoked the Emergencies Act – passed during the tenure of his father Pierre as prime minister – to respond against the demonstrations.\n\n“After discussing with cabinet and caucus, after consultation with premiers from all provinces and territories, the federal government has invoked the Emergencies Act to supplement provincial and territorial capacity to address the blockades and occupations,” the younger Trudeau told reporters during a press conference at the time.\n\nCanadian Finance Minister Chrystia Freeland confirmed the order to freeze Freedom Convoy participants’ accounts during the same press conference.\n\n“This order covers both personal and corporate accounts,” she said, adding that banks and other financial institutions in Canada “have the authority to temporarily cease providing financial services where the institution suspects that an account is being used to further the illegal blockades and occupations.” (Related: Canadian bank runs appear to be under way as the Trudeau regime declares WAR on bank assets of citizens.)\n\nCanadian Justice Minister David Lametti, meanwhile, issued a warning aimed at convoy participants who were part of what he called the “pro-Trump” movement that time.\n\n“If you are a member of … a pro-Trump movement who’s donating hundreds of thousands of dollars, or millions of dollars, to this kind of thing – then you [ought to] be worried,” he said.\n\nHead over to Fascism.news for more stories like this.\n\nWatch Fox News anchor Tucker Carlson comment on YouTube’s censorship of those questioning the recent Brazilian elections.\n\nThis video is from the GalacticStorm channel on Brighteon.com.\n\nBiden campaign bragged about rigging Brazilian election against Bolsonaro.\n\nBolsonaro defies odds, forces second round of voting in Brazil’s presidential election.\n\nElection winners in Brazil who are accused of spreading “disinformation” online will now have their wins nullified.", "opengraph": {"title": "Brazilian government under Leftist Lula freezes bank accounts of anti-election fraud protesters", "type": "article", "url": "https://www.mediafactwatch.com/2022-11-22-brazil-freezes-bank-accounts-election-integrity-protesters.html", "site_name": "Media Fact Watch Com", "description": "The Brazilian government froze the bank accounts of several individuals who participated in protests against election fraud. The move appeared to mirror the Canadian government’s retaliatory actions against truckers protesting Ottawa’s vaccine mandates. Brazilian President-elect Luiz Inacio Lula da Silva, more popularly known as Lula, won the country’s Oct. 30 runoff election against his predecessor […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2022/11/Brazil-Country-Flag.jpg"}, "tags": ["big government", "Jair Bolsonaro", "elections", "vote fraud", "Justin Trudeau", "protest", "stolen election", "Canada", "election integrity", "frozen bank account", "police state", "Tyranny", "resist", "fascism", "rigged", "revolt", "Brazil", "Luiz Inacio Lula da Silva", "totalitarianism"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/brazil-protesting-election-results-bank-accounts-frozen/", "http://tyranny.news", "https://reclaimthenet.org/canada-announces-plans-to-freeze-freedom-convoy-protesters-bank-accounts/", "https://naturalnews.com/2022-02-17-canadian-bank-runs-appear-to-be-under-way-trudeau-declares-war-on-citizens.html", "https://www.rebelnews.com/trudeaus_justice_minister_you_should_be_worried_if_you_donated_to_convoy", "https://fascism.news/", "https://www.brighteon.com/0255aa62-02cf-438b-ab02-417c074e419e", "https://www.brighteon.com/channels/galacticstorm", "https://rigged.news/2022-11-03-biden-campaign-bragged-rigging-brazilian-election-bolsonaro.html", "https://liberty.news/2022-10-05-bolsonaro-defies-odds-forces-second-round-voting.html", "https://newstarget.com/2022-02-19-canadian-authorities-arrest-freedom-convoy-organizers.html", "https://banned.news/2022-03-14-government-canceled-credit-card-without-due-process.html", "https://thoughtpolice.news/2022-06-20-election-winners-brazil-disinformation-wins-nullified.html", "https://reclaimthenet.org/brazil-protesting-election-results-bank-accounts-frozen/", "https://reclaimthenet.org/canada-announces-plans-to-freeze-freedom-convoy-protesters-bank-accounts/", "https://www.rebelnews.com/trudeaus_justice_minister_you_should_be_worried_if_you_donated_to_convoy", "https://www.brighteon.com/0255aa62-02cf-438b-ab02-417c074e419e", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2022-11-22-brazil-freezes-bank-accounts-election-integrity-protesters&linkname=Brazilian%20government%20under%20Leftist%20Lula%20freezes%20bank%20accounts%20of%20anti-election%20fraud%20protesters", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}