{"result_id": "195045", "URL": "https://www.mediafactwatch.com/2021-10-06-woman-injured-by-covid-vaccine-pleads-for-help.html", "timestamp": "2023-04-25 16:19:11 CEST+0200", "meta": {"description": "Kristi Dobbs, a 40-year-old dental hygienist from Missouri, said she can no longer work after being injured by Pfizer’s COVID vaccine. She has spent the past nine months pleading with U.S. health agencies to research the neurological injuries she and others are experiencing in hopes of finding a treatment. (Article by Megan Redshaw republished from […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,biological weapon,COVID,Dangerous Medicine,Kristi Dobbs,pandemic,Pfizer,pharmaceutical fraud,side effects,spike protein,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.mediafactwatch.com/2021-10-06-woman-injured-by-covid-vaccine-pleads-for-help.html", "encoding": "UTF-8"}, "image": null, "domain": "www.mediafactwatch.com", "title": "Woman injured by COVID vaccine pleads with health agencies for help, as local news agency kills story after pressure from Pfizer", "cleaned_text": "Woman injured by COVID vaccine pleads with health agencies for help, as local news agency kills story after pressure from Pfizer\n\nKristi Dobbs, a 40-year-old dental hygienist from Missouri, said she can no longer work after being injured by Pfizer’s COVID vaccine. She has spent the past nine months pleading with U.S. health agencies to research the neurological injuries she and others are experiencing in hopes of finding a treatment.\n\nSince getting the vaccine, Dobbs has seen 16 different medical providers. She’s been on 22 different medications to address more than 20 different symptoms — none of which she had prior to getting the vaccine.\n\nDobbs said she and others who developed neurological injuries after getting a COVID vaccine shared their experiences with a reporter, in hope of raising awareness about their experiences.\n\nBut the story never ran because, according to the reporter, a “higher up” at Pfizer pressured the news agency to drop it.\n\nDobbs got her first and only dose of Pfizer’s vaccine on Jan. 18. She immediately experienced an adverse reaction on-site at the hospital clinic where her vaccine was administered.\n\n“I had barely sat down in the monitoring area after the inoculation and felt an odd tingling sensation running down my left arm, where I had just received the jab,” Dobbs wrote. “I immediately had a pre-syncope episode, where I thought I was going to pass out, heart palpitations, increased pulse, increased respirations and a blood pressure spike that was within a stroke-worthy reading.”\n\nDobbs was monitored for an additional 45 minutes. When her blood pressure dropped to a manageable range, she was released.\n\nDobbs said the people monitoring her brushed off her symptoms as a panic attack or hot flash. But she had never been afraid of vaccines, blood draws or needles. “I gave injections in the mouth as a hygienist, so it was no big deal to me,” Dobbs said.\n\nThree days later, Dobbs woke up in the middle of the night and thought her whole bed was shaking, but her husband said he didn’t feel it. She also noticed shaking and trembling in her left hand, but thought maybe it was due to having coffee.\n\nThe next day, Dobbs felt a stabbing pain in her left scapula, and shaking and trembling sensations in both hands. As each day progressed, her symptoms worsened. “By day 10, I was in excruciating pain,” Dobbs said.\n\nOn Jan. 28, Dobbs went to a chiropractor in St. Louis to see what was causing the stabbing pain in her scapula and the radiating pain and tremors in both arms. The chiropractor thought she had a rib out, so he adjusted her.\n\nThe next morning Dobbs woke up with extreme pain and tremors throughout her entire body.\n\n“On January 30, I’m in urgent care with stabbing pain in my left scapula regions, full body tremors, paresthesias from head to toe, swollen lymph nodes, tinnitus, dizziness, headache and an odd internal vibrating sensation.\n\n“Urgent care doctor thinks I am having muscle spasms, and thinks I am stressed because of my mother in law [who was battling cancer] and traveling so much, so he [prescribed] Flexeril and Medrol dose pack.”\n\nOn Feb. 1, Dobbs visited a local chiropractor to see if she could help with the symptoms. As they were catching up, the chiropractor noticed Dobb’s tremors, body shakes and “super high” blood pressure.\n\nThe doctor recommended anti-anxiety medication, ran labs, did a physical exam and sent her on her way. Shortly after, Dobbs experienced issues with heavy legs, and trouble walking and getting up stairs to the point she couldn’t feel pin pricks on her legs.\n\nOn Feb. 5, Dobbs went to the ER because she said she felt like she was dying.\n\n“I had full-body paresthesia, internal tremors/vibrations, essential tremors in my hands, tremors in my arms and legs, fatigue, brain fog, muscle pain and weakness, pelvic pain, irregular menstrual cycles that included heavy bleeding and thick clotting, skin rashes, tinnitus, temperature regulation issues, swollen lymph nodes, loss of appetite, weight loss, dizziness/balance issues, blood pressure regulation issues, neck pain, headaches, heart palpitations, convulsions or pseudo seizure at night and insomnia.”\n\nLike many others who have experienced neurological reactions to COVID vaccines, Dobbs had a CT scan and the results were normal. No other tests were performed.\n\n“Doctors did not dismiss that this was vaccine-related, but they had no clue what to do or how to treat it if it was,” Dobbs said. “I was given another anti-anxiety medication, which did nothing for me, and was referred to a neurologist. In the meantime my vibrations, brain fog and other symptoms intensified.”\n\nDobbs saw a neurologist on Feb. 12, when the nurse practitioner ordered tests, an MRI and blood work. The MRI was normal, and Dobbs was prescribed another medication. Dobbs began searching for answers on her own.\n\n“I was searching for answers on my own, and I came across an article in Neurology Today with a comment at the bottom of the article from a retired gastroenterologist who had been injured by the vaccine, and she left her email address. That was the day I knew I was not alone in this vaccine injury journey. I had found Dr. Danice Hertz. She was in contact with a few others injured as well.”\n\nDobbs said she and others started a private social media group to collaborate because their local doctors did not know what to do and “elite doctors” either don’t know what to do or “were unwilling to help us.”\n\nDobbs said the vaccine injury group grew by 400% in two days and, in under a year, thousands of injured people had found each other. “Soon we all knew we were not alone, yet no one had answers yet,” she said.\n\n“Danice [Hertz] emailed doctors every day for help, Dobbs said, “and it wasn’t until March 9 she got through to Dr. Avindra Nath at the National Institutes of Health (NIH), and I was able to call them and get a telehealth appointment with Dr. Farinaz Safavi.”\n\nDobbs said Safavi was aware of these neurological vaccine reactions — as the NIH was already seeing patients for injuries like these — and recommended a “whole host of new tests run by my hometown doctor, as well as certain procedures she thought could potentially cure me.”\n\nOn April 19, Safavi wrote in an email to Dobbs that information regarding these adverse events would be published soon — and “hopefully, by that time, healthcare providers would have a better idea what to do with these side-effects,” she said.\n\nThe NIH requested blood samples, a complete medical release for history and test results that had already been completed. “I sent all of it,” Dobbs said. “We had very good conversations for the next several weeks, and then by early May … nothing. Still to date I have heard nothing from them.”\n\nDobbs said, “Supposedly she [Dr. Safavi] called the neurologist, but the neurologist said she never called her for recommendations. The immunology allergist never received a call either.”\n\nWhen Dobbs reached out to Safavi again in May, her tune changed. “It’s like they went from ‘we know it’s the vaccine’ to ‘we’re trying to figure it out.'”\n\n“It’s like as soon as they got what they needed, we were just cut off. Even some of the ladies that went to the NIH for treatment — once they were done with treatment with these same doctors — they were essentially cut off when they weren’t getting better.\n\n“Their exact verbiage to us was ‘you need early and swift intervention after a vaccine reaction.’ But here we are months after an adverse reaction and our hometown doctors have no clue what to do.”\n\nSafavi, in an email to Dobbs on May 24, said she believed Dobbs was experiencing an immune-mediated inflammatory response or some other immune-mediated small fiber neuropathy.\n\nAccording to Alexander Chamessian, MD PhD, small-fiber neuropathy is a neurological disorder involving widespread damage to the small-diameter somatic and autonomic unmyelinated C-fibers and/or thinly myelinated A-delta fibers.\n\nPatients often experience pins-and-needles or burning pain sensations. Damage to the autonomic small fibers can cause dysfunction in key systems controlling blood pressure, heart rate and gastrointestinal motility.\n\nDobbs has seen more than 16 different medical providers, including an allergy immunologist, who took blood samples and discovered Dobbs had antiphospholipid antibodies — a group of immune proteins (antibodies) the body mistakenly produces against itself in an autoimmune response to phospholipids.\n\nA dermatologist diagnosed Dobbs with granuloma annulare, an inflammatory skin condition caused by the immune response her body had, which left her with skin lesions.\n\nDobbs also tested positive for blood-clotting factors, had high inflammatory markers and lab values that indicated her immune system was poorly functioning.\n\nOne neurologist believed Dobbs was having an immune inflammatory response to Pfizer’s vaccine, caused by inflamed nerves.\n\nDobbs had an ultrasound of her kidneys, which showed they were not working properly. “My kidneys were holding onto water, but by the time I saw the urologist a month later the hydronephrosis was clear,” she said.\n\n“No one knows what to do for me, or how to treat this vaccine reaction. I have really great doctors here at home, and as they have all said. ‘We don’t really know what to do, but we can try to treat the symptoms.’\n\n“There is no medication or supplement strong enough to ease the pain, or control the constant symptoms that plague me 24/7. There is still no acknowledgement from NIH, CDC [Centers for Disease Control and Prevention], FDA [U.S. Food and Drug Administration], pharmaceutical companies, or any other governmental entity or institute that follows vaccine safety and side effects to date.”\n\nDobbs said once they established their Facebook group, the members knew they needed a better way to convey their ailments so others could easily read and identify them.\n\n“From there, we started our own patient-lead surveys, which gave statistical data that was entered into a spreadsheet,” Dobbs said. “We then had a top epidemiologist review the information and compared the numbers to previous vaccinations and injuries. We were all astonished by the numbers.”\n\nThe survey assessed reports of paresthesia following COVID vaccination from the CDC’s Vaccine Adverse Event Reporting System (VAERS), and compared it to reports of paresthesia following 2009 swine flu monovalent AS03-adjuvanted pandemic vaccine — a vaccine that was associated with disturbances similar to those experienced after COVID vaccines.\n\nAccording to the NIH, paresthesia refers to a burning, numbness, skin-crawling or prickling sensation usually felt in the hands, arms, legs or feet, but can also occur in other parts of the body.\n\nChronic paresthesia is often a symptom of an underlying neurological disease or traumatic nerve damage. Paresthesia can be caused by disorders affecting the central nervous system.\n\nFor the survey, VAERS reports of paresthesia following all COVID vaccines were collected, and the rate of reporting per 100,000 vaccinated people was calculated. The total VAERS reports of paresthesia following COVID vaccines as of June 18 were 13,559, with 5,818 attributed to Pfizer, 4514 to Moderna and 1,317 to Johnson & Johnson.\n\nThe total number of vaccines administered as of June 25, per CDC’s COVID-19 Vaccine Tracker, was 178,491,147. The VAERS rate of paresthesia as an adverse event was 7.6 per every 100,000 people.\n\nThe rate of paresthesia following the 2009 swine flu monovalent AS03-adjuvanted pandemic vaccine was 7.7 per every 100,000 people — and was found to be the third most frequent adverse event following allergic and local reactions associated with the vaccine.\n\nVAERS reports of paresthesia following all vaccines administered between 2006-2016 were also collected and the rate of reporting per 100,000 vaccinated people was calculated. The number of vaccines administered was obtained from Health Resources and Services Administration data and statistics on vaccine rates.\n\nAccording to the survey, there were 7,157 VAERS reports of paresthesia between 2006 and 2016, out of a total of 3,153,876,236 vaccinations administered during the same time period.\n\nThe rate of paresthesia following all vaccines between 2006 and 2016 was 0.2 for every 100,000 people.\n\n“These data suggest the rate of paresthesia following COVID-19 vaccines is the same as the rate calculated in the De Serres paper on paresthesia following the 2009 swine flu pandemic vaccine and is 38 times the rate seen in all vaccines during a 10-year period of time,” wrote Dr. Eileen Natuzzi, surgeon and public health epidemiologist.\n\nParesthesia is an unrecognized adverse event following vaccination with the current COVID vaccines, Natuzzi wrote. The data is observational, but suggests a signal of concern that should be studied in more depth.\n\nSurvey data from 100 participants also showed the following results:\n• 79% of those surveyed experienced tingling, vibrations and shaking\n\nDobbs said she and others knew they needed to tell their stories, without causing “vaccine hesitancy,” to protect others from the same fate — so members of the group started writing and calling anyone who would listen, including reporters, news agencies and members of Congress.\n\n“This is a hard thing to do without being labeled anti-vax, fear-mongering or a misinformation spreader,” Dobbs said. “But there was nowhere else to turn for help. A lot of us are so injured at this time, that the very thought of getting out of bed was exhausting. We had to persevere, so that we could be seen, heard, believed and most of all helped.”\n\nDobbs said they tried the best they could as simple Americans to reach out to those who would hear their stories. Finally, a reporter from a small media company was willing to do a story. Dobbs and others from the group participated in a 2-hour and 40-minute interview.\n\n“The story never went anywhere,” Dobbs said. She said the reporter told them a “higher up” at Pfizer made a call to the station and pressured staff there into not covering any other stories about vaccine adverse reactions.\n\nDobbs said she emailed Dr. Peter Marks, director of the Center for Biologics Evaluation and Research (CBER) at the FDA, but never heard anything from him. She never received a response from Nath at the NIH either.\n\n“I’ve been working my butt off to try and get my story out because I don’t want this to affect other people, but I don’t see how perfect strangers that were living normal lives found each other through social media, and there are thousands and thousands that have been affected, but you hear nothing about these stories. If it’s so safe then how have we found so many people on our own who have been affected by the vaccine?”\n\nDobbs did receive an email response from Dr. Janet Woodcock, director of the FDA, who said she was sorry to hear about her symptoms and that the FDA would look into the situation. “That was April 18,” Dobbs said. “I haven’t heard anything since.”\n\nDobbs also reported her adverse event to Pfizer, which did not follow-up, and filed a report with VAERS.\n\nIn June, Sen. Ron Johnson (R-WI) gave a few of the group members a platform at a press conference for the media to “hear us, see us and believe us,” Dobbs said. But “they wanted nothing to do with us.”\n\n“Their only questions were about who paid for us to get to Wisconsin, and are we going to sue for compensation of injuries. No further questions about lack of medical care, what they could do to help bring awareness, nothing. We did get some other interviews with Newsmax and Fox, but again we were given a small platform for a moment and then hushed again. We move one step forward and get two steps back.”\n\nDobbs said the group has “tried to do their due diligence by reporting to the big pharma regulatory agencies, although the NIH has been fully aware vaccine injuries were occurring since February.”\n\nDobbs said she is working with other researchers — not affiliated with the NIH — who are running totally different blood markers.\n\n“They were initially doing studies on COVID long-haul patients to discover why they were becoming ‘long-haulers’ when they realized people were getting injured by vaccines and experiencing the same symptoms,” Dobbs said.\n\n“The one thing they’re finding that we all have in common is the spike protein in non-classical monocytes,” Dobbs said.\n\nDobbs wants government acknowledgment and accountability for vaccine injuries\n\nDobbs still has many of her symptoms, is not well enough to return to work and has a difficult time caring for her family.\n\n“I was never a conspiracy theorist or anti-medicine, but it should not be this hard to get the truth out in 2021,” Dobbs said. “I am not saying the vaccine needs to be stopped, but it’s not as safe or effective as they’re portraying it is.”\n\nDobbs said she would do anything to make sure others are protected from the same “personal hell” she’s gone through the past nine months, or to save children like Maddie de Garay — a 12-year-old who was paralyzed by Pfizer’s vaccine during the clinical trial.\n\nDobbs was told specifically not to vaccinate any of her children, which puts her in a tough spot with vaccine mandates. “I believe it would kill me if I got another COVID vaccination and I would never put my children through this … ever,” she said.\n\nHowever, this also means they’re in the category of people who are discriminated against because they cannot get vaccinated.\n\n“The moral of the story is that we’ve been injured by the vaccine, we’ve been searching for months for answers and we are unable to get help. We have reached out to the best doctors in the world and they cannot help us.\n\n“So if you can’t get help from the top doctors in the U.S., how can our hometown doctors help us? We never wanted to start this, we only wanted help, and after not getting help you start to get a little angry. When your body fails, you want to know why.\n\n“We have some researchers willing to help us but they are hindered by a lack of information they need to conduct their research, and there are no adverse reaction clinics where we can go to get treated.”\n\nDobbs said these reactions need to be investigated and observed. “Then they need to be researched and education needs to be presented. Action needs to be taken for the correct measures to be issued to protect and compensate those of us who have been affected by the COVID vaccines under clinical trials, and under Emergency Use Authorization. Treatment protocols must be implemented in our medical community to give early and proper treatment to those affected,” she added.\n\nDobbs said she doesn’t want to create vaccine hesitancy, she wants accountability from governing agencies, big pharma and institutes that regulate and roll out vaccines. “The fear-mongering, cancel-culture and misinformation days of those truly injured must stop,” she said.\n\n“I have nothing to gain by giving my testimony of truth to my vaccine injury from the Pfizer COVID-19 vaccine,” Dobbs wrote in an email to The Defender. “I was just a small-town country girl raising my family, and enjoying my life as a family caretaker, mother and wife. But I was completely uprooted from my beautiful, normal, happy life. But, my voice matters! My story matters!”\n\nRead more at: ChildrenHealthDefense.org and VaccineInjuryNews.com.", "opengraph": {"title": "Woman injured by COVID vaccine pleads with health agencies for help, as local news agency kills story after pressure from Pfizer", "type": "article", "url": "https://www.mediafactwatch.com/2021-10-06-woman-injured-by-covid-vaccine-pleads-for-help.html", "site_name": "Media Fact Watch Com", "description": "Kristi Dobbs, a 40-year-old dental hygienist from Missouri, said she can no longer work after being injured by Pfizer’s COVID vaccine. She has spent the past nine months pleading with U.S. health agencies to research the neurological injuries she and others are experiencing in hopes of finding a treatment. (Article by Megan Redshaw republished from […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2021/10/Covid-19-Coronavirus-Pfizer-Vaccine-Vials.jpg"}, "tags": ["pandemic", "big government", "Big Pharma", "COVID", "vaccine injury", "vaccines", "Pfizer", "spike protein", "Kristi Dobbs", "vaccine damage", "side effects", "biological weapon", "pharmaceutical fraud"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\" xml:lang=\"en\">Dr. Hertz said people like her who have been seriously injured by COVID vaccines are being ignored + because health officials won’t research their injuries + potential treatments, they have nowhere to turn.<a href=\"https://twitter.com/hashtag/TheDefender?src=hash&amp;ref_src=twsrc%5Etfw\">#TheDefender</a>: <a href=\"https://t.co/zL66EdwTnD\">https://t.co/zL66EdwTnD</a><a href=\"https://t.co/ahmaX2UiPF\">https://t.co/ahmaX2UiPF</a></p>\n<p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1441155868318310402?ref_src=twsrc%5Etfw\">September 23, 2021</a></p></blockquote>\n<p></p>\n<p>Dobbs said she and others started a private social media group to collaborate because their local doctors did not know what to do and “elite doctors” either don’t know what to do or “were unwilling to help us.”</p>\n<p>Dobbs said the vaccine injury group grew by 400% in two days and, in under a year, thousands of injured people had found each other. “Soon we all knew we were not alone, yet no one had answers yet,” she said.</p>\n<p>“Danice [Hertz] emailed doctors every day for help, Dobbs said, “and it wasn’t until March 9 she got through to Dr. Avindra Nath at the National Institutes of Health (NIH), and I was able to call them and get a telehealth appointment with Dr. Farinaz Safavi.”</p>\n<p>Dobbs said Safavi was aware of these neurological vaccine reactions — as the NIH was already seeing patients for injuries like these — and recommended a “whole host of new tests run by my hometown doctor, as well as certain procedures she thought could potentially cure me.”</p>\n<p><img class=\"\" src=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-NIH-Doctor-Covid-Vaccine-Adverse-Reaction-email_030321-1-155x300.jpeg\" alt=\"Adverse reaction\" width=\"195\" height=\"378\" /></p>\n<p>On April 19, Safavi wrote in an email to Dobbs that information regarding these adverse events would be published soon — and “hopefully, by that time, healthcare providers would have a better idea what to do with these side-effects,” she said.</p>\n<p><img src=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-NIH-Doctor-Covid-Vaccine-Adverse-Reaction-email_041921-191x300.jpeg\" alt=\"Safavi\" /></p>\n<p>The NIH <a href=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-NIH-Doctor-Covid-Vaccine-Adverse-Reaction-email_032221.jpg\">requested blood samples</a>, a complete medical release for history and test results that had already been completed. “I sent all of it,” Dobbs said. “We had very good conversations for the next several weeks, and then by early May … nothing. Still to date I have heard nothing from them.”</p>\n<p>Dobbs said, “Supposedly she [Dr. Safavi] called the neurologist, but the neurologist said she never called her for recommendations. The immunology allergist never received a call either.”</p>\n<p>When Dobbs reached out to Safavi again in May, her tune changed. “It’s like they went from ‘we know it’s the vaccine’ to ‘we’re trying to figure it out.'”</p>\n<p>Dobbs explained:</p>\n<p style=\"padding-left: 30px;\">“It’s like as soon as they got what they needed, we were just cut off. Even some of the ladies that went to the NIH for treatment — once they were done with treatment with these same doctors — they were essentially cut off when they weren’t getting better.</p>\n<p style=\"padding-left: 30px;\">“Their exact verbiage to us was ‘you need early and swift intervention after a vaccine reaction.’ But here we are months after an adverse reaction and our hometown doctors have no clue what to do.”</p>\n<p>Safavi, <a href=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-NIH-Doctor-Covid-Vaccine-Adverse-Reaction-email_Redacted.pdf\">in an email</a> to Dobbs on May 24, said she believed Dobbs was experiencing an immune-mediated inflammatory response or some other immune-mediated small fiber neuropathy.</p>\n<p><img src=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-NIH-Doctor-Covid-Vaccine-Adverse-Reaction-email_032421-1-178x300.jpeg\" alt=\"Kristi Dobbs NIH doctor Covid vaccine adverse reaction\" /></p>\n<p>According to <a href=\"https://neuropathycommons.org/experts/alexander-chamessian-md-phd\" target=\"_blank\" rel=\"noopener\">Alexander Chamessian, MD PhD</a>, small-fiber neuropathy is a <a href=\"https://neuropathycommons.org/neuropathy/causes-neuropathy/autoantibodies-and-small-fiber-neuropathy\" target=\"_blank\" rel=\"noopener\">neurological disorder</a> involving widespread damage to the small-diameter somatic and autonomic unmyelinated C-fibers and/or thinly myelinated A-delta fibers.</p>\n<p>Patients often experience pins-and-needles or burning pain sensations. Damage to the autonomic small fibers can cause dysfunction in key systems controlling blood pressure, heart rate and gastrointestinal motility.</p>\n<p>Dobbs has seen more than 16 different medical providers, including an allergy immunologist, who took blood samples and discovered Dobbs had <a href=\"https://www.labcorp.com/help/patient-test-info/antiphospholipid-antibodies#:~:text=Antiphospholipid%20antibodies%20are%20a%20group,risk%20of%20excessive%20blood%20clotting.\" target=\"_blank\" rel=\"noopener\">antiphospholipid antibodies</a> — a group of immune proteins (antibodies) the body mistakenly produces against itself in an autoimmune response to <a href=\"https://biologydictionary.net/phospholipid/\" target=\"_blank\" rel=\"noopener\">phospholipids</a>.</p>\n<p>A dermatologist diagnosed Dobbs with <a href=\"https://dermnetnz.org/topics/granuloma-annulare\" target=\"_blank\" rel=\"noopener\">granuloma annulare</a>, an inflammatory skin condition caused by the immune response her body had, which left her with skin lesions.</p>\n<p>Dobbs also tested positive for blood-clotting factors, had high inflammatory markers and lab values that indicated her immune system was poorly functioning.</p>\n<p>One neurologist believed Dobbs was having an immune inflammatory response to Pfizer’s vaccine, caused by inflamed nerves.</p>\n<p>Dobbs had an ultrasound of her kidneys, which showed they were not working properly. “My kidneys were holding onto water, but by the time I saw the urologist a month later the <a href=\"https://www.mayoclinic.org/diseases-conditions/hydronephrosis/cdc-20397563\" target=\"_blank\" rel=\"noopener\">hydronephrosis</a> was clear,” she said.</p>\n<p>Dobbs said:</p>\n<p style=\"padding-left: 30px;\">“No one knows what to do for me, or how to treat this vaccine reaction. I have really great doctors here at home, and as they have all said. ‘We don’t really know what to do, but we can try to treat the symptoms.’</p>\n<p style=\"padding-left: 30px;\">“There is no medication or supplement strong enough to ease the pain, or control the constant symptoms that plague me 24/7. There is still no acknowledgement from NIH, CDC [Centers for Disease Control and Prevention], FDA [U.S. Food and Drug Administration], pharmaceutical companies, or any other governmental entity or institute that follows vaccine safety and side effects to date.”</p>\n<p><strong>Group conducts survey that shows signal concerns</strong></p>\n<p>Dobbs said once they established their Facebook group, the members knew they needed a better way to convey their ailments so others could easily read and identify them.</p>\n<p>“From there, we started our own patient-lead surveys, which gave statistical data that was entered into a spreadsheet,” Dobbs said. “We then had a top epidemiologist review the information and compared the numbers to previous vaccinations and injuries. We were all astonished by the numbers.”</p>\n<p>The <a href=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Paresthesia-Post-COVID-19-Vaccine.pdf\">survey</a> assessed reports of paresthesia following COVID vaccination from the CDC’s <a href=\"https://vaers.hhs.gov/\" target=\"_blank\" rel=\"noopener\">Vaccine Adverse Event Reporting System</a> (VAERS), and compared it to reports of paresthesia following 2009 swine flu monovalent AS03-adjuvanted pandemic vaccine — a vaccine that was <a href=\"https://pubmed.ncbi.nlm.nih.gov/26209839/\" target=\"_blank\" rel=\"noopener\">associated with disturbances</a> similar to those experienced after COVID vaccines.</p>\n<p><a href=\"https://www.ninds.nih.gov/Disorders/All-Disorders/Paresthesia-Information-Page\" target=\"_blank\" rel=\"noopener\">According to the NIH</a>, paresthesia refers to a burning, numbness, skin-crawling or prickling sensation usually felt in the hands, arms, legs or feet, but can also occur in other parts of the body.</p>\n<p>Chronic paresthesia is often a symptom of an underlying neurological disease or traumatic nerve damage. Paresthesia can be caused by disorders affecting the central nervous system.</p>\n<p>For the survey, VAERS reports of paresthesia following all COVID vaccines were collected, and the rate of reporting per 100,000 vaccinated people was calculated. The total VAERS reports of paresthesia following COVID vaccines as of June 18 were 13,559, with 5,818 attributed to Pfizer, 4514 to Moderna and 1,317 to Johnson &amp; Johnson.</p>\n<p>The total number of vaccines administered as of June 25, per CDC’s COVID-19 Vaccine Tracker, was 178,491,147. The VAERS rate of paresthesia as an adverse event was 7.6 per every 100,000 people.</p>\n<p>The rate of paresthesia following the 2009 swine flu monovalent AS03-adjuvanted pandemic vaccine was <a href=\"https://pubmed.ncbi.nlm.nih.gov/26209839/\" target=\"_blank\" rel=\"noopener\">7.7 per every 100,000 people</a> — and  was found to be the third most frequent adverse event following allergic and local reactions associated with the vaccine.</p>\n<p>VAERS reports of paresthesia following all vaccines administered between 2006-2016 were also collected and the rate of reporting per 100,000 vaccinated people was calculated. The number of vaccines administered was obtained from Health Resources and Services Administration data and statistics on vaccine rates.</p>\n<p><a href=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Paresthesia-Post-COVID-19-Vaccine.pdf\" target=\"_blank\" rel=\"noopener\">According to the survey</a>, there were 7,157 VAERS reports of paresthesia between 2006 and 2016, out of a total of 3,153,876,236 vaccinations administered during the same time period.</p>\n<p>The rate of paresthesia following all vaccines between 2006 and 2016 was 0.2 for every 100,000 people.</p>\n<p>“These data suggest the rate of paresthesia following COVID-19 vaccines is the same as the rate calculated in the De Serres paper on paresthesia following the 2009 swine flu pandemic vaccine and is 38 times the rate seen in all vaccines during a 10-year period of time,” wrote Dr. Eileen Natuzzi, surgeon and public health epidemiologist.</p>\n<p>Paresthesia is an unrecognized adverse event following vaccination with the current COVID vaccines, Natuzzi wrote. The data is observational, but suggests a signal of concern that should be studied in more depth.</p>\n<p>Survey data from 100 participants also <a href=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Covid-19-Vaccine-Adverse-Reaction-Stats.pdf\">showed the following results</a>:</p>\n<ul>\n<li>79% of those surveyed experienced tingling, vibrations and shaking</li>\n<li>57% had numbness</li>\n<li>53% reported heart issues</li>\n<li>45% experienced muscle weakness and pain</li>\n<li>44% experienced headaches</li>\n<li>43% had fatigue</li>\n<li>42% had stomach issues</li>\n<li>39% reported brain fog</li>\n<li>36% experienced involuntary twitching</li>\n<li>29% had tremors</li>\n<li>27% reported blood pressure issues</li>\n<li>20% reported tinnitus</li>\n</ul>\n<p><strong>Pfizer pressures media outlet to pull vaccine injury story</strong></p>\n<p>Dobbs said she and others knew they needed to tell their stories, without causing “<a href=\"https://childrenshealthdefense.org/defender/rfk-jr-president-biden-vaers/\">vaccine hesitancy</a>,” to protect others from the same fate — so members of the group started writing and calling anyone who would listen, including reporters, news agencies and members of Congress.</p>\n<p>“This is a hard thing to do without being labeled <a href=\"https://childrenshealthdefense.org/news/once-burned-twice-shy-why-anti-vaxxers-are-really-ex-vaxxers/\">anti-vax</a>, fear-mongering or a misinformation spreader,” Dobbs said. “But there was nowhere else to turn for help. A lot of us are so injured at this time, that the very thought of getting out of bed was exhausting. We had to persevere, so that we could be seen, heard, believed and most of all helped.”</p>\n<p>Dobbs said they tried the best they could as simple Americans to reach out to those who would hear their stories. Finally, a reporter from a small media company was willing to do a story. Dobbs and others from the group participated in a 2-hour and 40-minute interview.</p>\n<p>“The story never went anywhere,” Dobbs said. She said the reporter told them a “higher up” at Pfizer made a call to the station and pressured staff there into not covering any other stories about vaccine <a href=\"https://childrenshealthdefense.org/defender/vaers-cdc-covid-vaccine-injuries-deaths-fda-third-pfizer-shot/\">adverse reactions</a>.</p>\n<p><img src=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Pfizer-Exec-Voice-Transcript1-193x300.jpeg\" alt=\"Kristi Dobbs Pfizer exec\" /></p>\n<p>Dobbs said she emailed Dr. Peter Marks, director of the Center for Biologics Evaluation and Research (CBER) at the FDA, but never heard anything from him. She never received a response from Nath at the NIH either.</p>\n<p>She explained:</p>\n<p style=\"padding-left: 30px;\">“I’ve been working my butt off to try and get my story out because I don’t want this to affect other people, but I don’t see how perfect strangers that were living normal lives found each other through social media, and there are thousands and thousands that have been affected, but you hear nothing about these stories. If it’s so safe then how have we found so many people on our own who have been affected by the vaccine?”</p>\n<p>Dobbs did receive an <a href=\"https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Janet-Woodcock-Covid-Vaccine-Adverse-Reaction-email_Redacted.pdf\">email response from Dr. Janet Woodcock</a>, director of the FDA, who said she was sorry to hear about her symptoms and that the FDA would look into the situation. “That was April 18,” Dobbs said. “I haven’t heard anything since.”</p>\n<p>Dobbs also reported her adverse event to Pfizer, which did not follow-up, and filed a report with VAERS.</p>\n<p>In June, <a href=\"https://childrenshealthdefense.org/defender/sen-ron-johnson-questions-fda-pfizer-vaccine-approval/\">Sen. Ron Johnson</a> (R-WI) gave a few of the group members a platform at a <a href=\"https://childrenshealthdefense.org/defender/sen-johnson-ken-ruettgers-press-conference-families-injured-covid-vaccines/\">press conference</a> for the media to “hear us, see us and believe us,” Dobbs said. But “they wanted nothing to do with us.”</p>\n<p>Dobbs said:</p>\n<p style=\"padding-left: 30px;\">“Their only questions were about who paid for us to get to Wisconsin, and are we going to sue for compensation of injuries. No further questions about lack of medical care, what they could do to help bring awareness, nothing. We did get some other interviews with Newsmax and Fox, but again we were given a small platform for a moment and then hushed again. We move one step forward and get two steps back.”</p>\n<p>Dobbs said the group has “tried to do their due diligence by reporting to the <a href=\"https://childrenshealthdefense.org/defender_category/big-pharma/\">big pharma</a> regulatory agencies, although the NIH has been fully aware vaccine injuries were occurring since February.”</p>\n<p>Dobbs said she is working with other researchers — not affiliated with the NIH — who are running totally different blood markers.</p>\n<p>“They were initially doing studies on COVID long-haul patients to discover why they were becoming ‘long-haulers’ when they realized people were getting injured by vaccines and experiencing the same symptoms,” Dobbs said.</p>\n<p>“The one thing they’re finding that we all have in common is the <a href=\"https://childrenshealthdefense.org/defender/covid-vaccine-spike-protein-travels-from-injection-site-organ-damage/\">spike protein</a> in non-classical monocytes,” Dobbs said.</p>\n<p><strong>Dobbs wants government acknowledgment and accountability for vaccine injuries</strong></p>\n<p>Dobbs still has many of her symptoms, is not well enough to return to work and has a difficult time caring for her family.</p>\n<p>“I was never a conspiracy theorist or anti-medicine, but it should not be this hard to get the truth out in 2021,” Dobbs said. “I am not saying the vaccine needs to be stopped, but it’s not as safe or effective as they’re portraying it is.”</p>\n<p>Dobbs said she would do anything to make sure others are protected from the same “personal hell” she’s gone through the past nine months, or to save children like <a href=\"https://childrenshealthdefense.org/defender/sen-johnson-ken-ruettgers-press-conference-families-injured-covid-vaccines/\">Maddie de Garay</a> — a 12-year-old who was paralyzed by Pfizer’s vaccine during the clinical trial.</p>\n<p>Dobbs was told specifically not to vaccinate any of her children, which puts her in a tough spot with <a href=\"https://childrenshealthdefense.org/defender/biden-vaccine-mandates-politicians-fight-back/\">vaccine mandates</a>. “I believe it would kill me if I got another COVID vaccination and I would never put my children through this … ever,” she said.</p>\n<p>However, this also means they’re in the category of people who are discriminated against because they cannot get vaccinated.</p>\n<p>Dobbs said:</p>\n<p style=\"padding-left: 30px;\">“The moral of the story is that we’ve been injured by the vaccine, we’ve been searching for months for answers and we are unable to get help. We have reached out to the best doctors in the world and they cannot help us.</p>\n<p style=\"padding-left: 30px;\">“So if you can’t get help from the top doctors in the U.S., how can our hometown doctors help us? We never wanted to start this, we only wanted help, and after not getting help you start to get a little angry. When your body fails, you want to know why.</p>\n<p style=\"padding-left: 30px;\">“We have some researchers willing to help us but they are hindered by a lack of information they need to conduct their research, and there are no adverse reaction clinics where we can go to get treated.”</p>\n<p>Dobbs said these reactions need to be investigated and observed. “Then they need to be researched and education needs to be presented. Action needs to be taken for the correct measures to be issued to protect and compensate those of us who have been affected by the COVID vaccines under clinical trials, and under <a href=\"https://www.fda.gov/emergency-preparedness-and-response/mcm-legal-regulatory-and-policy-framework/emergency-use-authorization\" target=\"_blank\" rel=\"noopener\">Emergency Use Authorization</a>. Treatment protocols must be implemented in our medical community to give early and proper treatment to those affected,” she added.</p>\n<p>Dobbs said she doesn’t want to create vaccine hesitancy, she wants accountability from governing agencies, big pharma and institutes that regulate and roll out vaccines. “The fear-mongering, cancel-culture and misinformation days of those truly injured must stop,” she said.</p>\n<p>“I have nothing to gain by giving my testimony of truth to my vaccine injury from the Pfizer COVID-19 vaccine,” Dobbs wrote in an <a href=\"https://childrenshealthdefense.org/defender/\">email to The Defender</a>. “I was just a small-town country girl raising my family, and enjoying my life as a family caretaker, mother and wife. But I was completely uprooted from my beautiful, normal, happy life. But, my voice matters! My story matters!”</p>\n<p>Read more at: <a href=\"https://childrenshealthdefense.org/defender/kristi-dobbs-injured-pfizer-covid-vaccine-local-news-agency-kills-story/\">ChildrenHealthDefense.org</a> and <a href=\"http://vaccineinjurynews.com\">VaccineInjuryNews.com</a>.</p>\n</div>&#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n&#13;\n &#13;\n&#13;\n<div class=\"Widget\" id=\"Widget15\" gravityScore=\"5\" gravityNodes=\"1\"><div class=\"Content\" gravityScore=\"9\" gravityNodes=\"1\"><p class=\"Title\">Get Our Free Email Newsletter</p>&#13;\n<p class=\"Description\">Get independent news alerts on natural cures, food lab tests, cannabis medicine, science, robotics, drones, privacy and more.</p>&#13;\n<iframe src=\"/NT-Include-ReaderRegistration-2019-Subscribe-Form-UnderArticle.html\" frameborder=\"0\" scrolling=\"no\" style=\"max-width:250px;overflow: hidden;height:70px;\"></iframe>&#13;\n<div class=\"Small\">  Subscription confirmation required.<a></a><span>  Subscription confirmation required.<a></a><span><a href=\"/privacypolicy\">Your privacy is protected.</a> Subscription confirmation required.</span></span></div>&#13;\n</div>&#13;\n</div>&#13;\n&#13;\n<hr id=\"Marker5\" class=\"Marker\" />&#13;\n<hr id=\"Marker6\" class=\"Marker\" />&#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n</div>&#13;\n</div>&#13;\n&#13;\n &#13;\n&#13;\n<div class=\"Article2\" gravityScore=\"3\" gravityNodes=\"1\"><div class=\"Sticky2\" gravityScore=\"3\" gravityNodes=\"1\"><hr id=\"Marker3\" class=\"Marker\" />&#13;\n&#13;\n&#13;\n<div class=\"Widget\" id=\"Widget15\" gravityScore=\"5\" gravityNodes=\"1\"><div class=\"Content\" gravityScore=\"9\" gravityNodes=\"1\"><p class=\"Title\">Get Our Free Email Newsletter</p>&#13;\n<p class=\"Description\">Get independent news alerts on natural cures, food lab tests, cannabis medicine, science, robotics, drones, privacy and more.</p>&#13;\n<iframe src=\"/NT-Include-ReaderRegistration-2019-Subscribe-Form-RightColumn.html\" frameborder=\"0\" scrolling=\"no\" style=\"max-width:250px;overflow: hidden;height:70px;\"></iframe>&#13;\n<div class=\"Small\">  Subscription confirmation required.<a></a><span>  Subscription confirmation required.<a></a><span><a href=\"/privacypolicy\">Your privacy is protected.</a> Subscription confirmation required.</span></span></div>&#13;\n</div>&#13;\n</div>&#13;\n&#13;\n<div id=\"rp_widget-2\" class=\"widget widget_rp_widget\"><h2><p class=\"SectionHead\">RECENT NEWS &amp; ARTICLES</p></h2><div class=\"PostsSmall\"><div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-19-schiff-doctored-text-messages-between-meadows-jordan.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Adam-Schiff-2.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-19-schiff-doctored-text-messages-between-meadows-jordan.html\">During January 6 hearing, Schiff doctored text messages between Mark Meadows and Rep. Jim Jordan</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-17-shortages-inflation-real-and-getting-exponentially-worse.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Joe-Biden-911-Mask-Smile-Memorial.png\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-17-shortages-inflation-real-and-getting-exponentially-worse.html\">After the Biden regime gives the media their marching orders, they push a ‘boom’ that doesn’t exist</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-15-fact-checks-opinion-pieces-far-left-ideologues.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Fake-News-Fact-Truth-Myth-Rumor-Fiction.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-15-fact-checks-opinion-pieces-far-left-ideologues.html\">Fact checks? More like opinion pieces from far-left ideologues</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-15-brazilian-city-cuts-hospitalizations-mortality-half-ivermectin.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Ivermectin-Newspaper-Clippings.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-15-brazilian-city-cuts-hospitalizations-mortality-half-ivermectin.html\">Brazilian city cuts COVID hospitalizations, mortality in HALF by using ivermectin</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-14-msm-pushing-america-to-brink-of-annihilation.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Tv-Television-Old-Media-Retro-Broadcast-Vintage.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-14-msm-pushing-america-to-brink-of-annihilation.html\">The linchpin in the plot to destroy every man, woman and child in America is the MSM, brainwashing us with propaganda for decades and pushing America to the brink of annihilation</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-14-british-media-hardcore-vaccine-refuseniks-terrorists-deradicalized.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Coronavirus-Syringe-Vaccine-Covid-19.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-14-british-media-hardcore-vaccine-refuseniks-terrorists-deradicalized.html\">British media says “hardcore vaccine refuseniks” are “terrorists” that need to be “deradicalized”</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-13-newsguard-ratings-system-in-favor-of-left.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/NewsGuard-Fakes-Logo.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-13-newsguard-ratings-system-in-favor-of-left.html\">STUDY: NewsGuard ratings system heavily skews in favor of left-wing outlets</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-10-healthy-people-suffer-covid-vaccine-side-effects.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Syringe-Vaccine-Pregnant-Close-Up.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-10-healthy-people-suffer-covid-vaccine-side-effects.html\">Young and healthy people suffer TRAGIC side effects of COVID vaccines</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/maryvillarealdw\">By Mary Villareal</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-10-twitter-poll-disappears-vaccine-mandate-overwhelming-opposition.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Vaccine-Syringe-Shot-Arm.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-10-twitter-poll-disappears-vaccine-mandate-overwhelming-opposition.html\">Popular TV program’s Twitter poll mysteriously disappears after finding huge majority opposes vaccine mandates</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/isabelle\">By Cassie B.</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-09-media-discredit-vaers-covid-vaccine-side-effects.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/T-2017-HRR-Vaccine-industry-desperation-propaganda.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-09-media-discredit-vaers-covid-vaccine-side-effects.html\">Corporate media trying to discredit VAERS reporting of covid vaccine side effects because it’s the only thing they haven’t yet censored</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-08-pfizer-directors-have-links-to-mainstream-media.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Pharma-Big-Addiction-Capsules-Currency-Drugs-Healthcare.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-08-pfizer-directors-have-links-to-mainstream-media.html\">Conflict of interest: Two Pfizer directors have links to mainstream media, Big Tech</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ramontomeydw\">By Ramon Tomey</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-07-wapo-omicron-common-cold-shares-genetic-material.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Coronovirus-Cold-Flu-Virus-Bug-Medical-Mask.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-07-wapo-omicron-common-cold-shares-genetic-material.html\">WaPo admits Omicron strain is really just the common cold, shares genetic material with corona cold viruses</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-06-cuomo-suspension-massive-defeat-for-mainstream-media.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/chris-cuomo-CNN.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-06-cuomo-suspension-massive-defeat-for-mainstream-media.html\">Chris Cuomo suspension from CNN a massive DEFEAT for mainstream media – Brighteon.TV</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/arseniotoledo\">By Arsenio Toledo</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-05-corporate-media-spreads-mass-panic-over-single-case-of-omicron.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Vaccine-Deny-Refuse-Confusion-Syringe-Questions.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-05-corporate-media-spreads-mass-panic-over-single-case-of-omicron.html\">Corporate media spreads mass PANIC now that a single case of “omicron” has been found in California (in a VACCINATED person)</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ljdevon\">By Lance D Johnson</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-03-reuters-chairman-is-pfizer-investor-board-member.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Money-Pharmacy-Medical-Pharma-Banknote-Bill-Business.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-03-reuters-chairman-is-pfizer-investor-board-member.html\">Conflict: Reuters chairman is Pfizer investor and board member</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-02-cnn-biden-covid-jab-mandates-suffering-setbacks.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/CNN-fake-news-network.png\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-02-cnn-biden-covid-jab-mandates-suffering-setbacks.html\">CNN complains that Biden’s covid jab mandates are “suffering setbacks” due to judges putting them on hold</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-12-01-heart-disease-among-soccer-players-a-coincidence.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/12/Soccer-Ball-Grass-Sports.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-12-01-heart-disease-among-soccer-players-a-coincidence.html\">‘Puzzling’ surge in heart disease among soccer players is a ‘coincidence,’ media reports</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-11-30-israeli-vaccine-victims-want-their-lives-back.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/11/Syringes-Flu-Shot-Vaccine.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-11-30-israeli-vaccine-victims-want-their-lives-back.html\">‘We are lab rats’: Israeli vaccine victims want their lives back</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-11-30-media-manufactured-panic-super-mutation-covid-variant.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/11/Coronavirus-Man-Panic-Airplane-Travel.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-11-30-media-manufactured-panic-super-mutation-covid-variant.html\">Mass media’s manufactured panic over new “super mutation” covid variant is STRANDING air passengers on jets</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2021-11-30-variant-hysteria-comes-from-same-institution.html\"><img border=\"0\" src=\"wp-content/uploads/sites/41/2021/11/Coronavirus-Covid-19-Concept-Virus.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2021-11-30-variant-hysteria-comes-from-same-institution.html\">New variant hysteria comes from same institution that popularized lockdowns &amp; previous COVID scares</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n</div></div>&#13;\n</div>&#13;\n</div>&#13;\n&#13;\n &#13;\n &#13;\n</div>&#13;\n</div>&#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n</div>&#13;\n&#13;\n</div>&#13;\n&#13;\n&#13;\n &#13;\n&#13;\n&#13;\n &#13;\n &#13;\n&#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n&#13;\n</div></div></body></html>\n"], "movies": [], "links": ["https://childrenshealthdefense.org/defender/kristi-dobbs-injured-pfizer-covid-vaccine-local-news-agency-kills-story/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.hopkinsmedicine.org/health/conditions-and-diseases/syncope-fainting", "https://childrenshealthdefense.org/defender/sarah-green-16-year-old-neurological-symptoms-pfizer-vaccine/", "https://childrenshealthdefense.org/defender/dr-danice-hertz-injured-pfizer-covid-vaccine/", "https://twitter.com/hashtag/TheDefender?src=hash&ref_src=twsrc%5Etfw", "https://t.co/zL66EdwTnD", "https://t.co/ahmaX2UiPF", "https://twitter.com/RobertKennedyJr/status/1441155868318310402?ref_src=twsrc%5Etfw", "https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-NIH-Doctor-Covid-Vaccine-Adverse-Reaction-email_032221.jpg", "https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-NIH-Doctor-Covid-Vaccine-Adverse-Reaction-email_Redacted.pdf", "https://neuropathycommons.org/experts/alexander-chamessian-md-phd", "https://neuropathycommons.org/neuropathy/causes-neuropathy/autoantibodies-and-small-fiber-neuropathy", "https://www.labcorp.com/help/patient-test-info/antiphospholipid-antibodies#:~:text=Antiphospholipid%20antibodies%20are%20a%20group,risk%20of%20excessive%20blood%20clotting.", "https://biologydictionary.net/phospholipid/", "https://dermnetnz.org/topics/granuloma-annulare", "https://www.mayoclinic.org/diseases-conditions/hydronephrosis/cdc-20397563", "https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Paresthesia-Post-COVID-19-Vaccine.pdf", "https://vaers.hhs.gov/", "https://pubmed.ncbi.nlm.nih.gov/26209839/", "https://www.ninds.nih.gov/Disorders/All-Disorders/Paresthesia-Information-Page", "https://pubmed.ncbi.nlm.nih.gov/26209839/", "https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Paresthesia-Post-COVID-19-Vaccine.pdf", "https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Covid-19-Vaccine-Adverse-Reaction-Stats.pdf", "https://childrenshealthdefense.org/defender/rfk-jr-president-biden-vaers/", "https://childrenshealthdefense.org/news/once-burned-twice-shy-why-anti-vaxxers-are-really-ex-vaxxers/", "https://childrenshealthdefense.org/defender/vaers-cdc-covid-vaccine-injuries-deaths-fda-third-pfizer-shot/", "https://childrenshealthdefense.org/wp-content/uploads/Kristi-Dobbs-Janet-Woodcock-Covid-Vaccine-Adverse-Reaction-email_Redacted.pdf", "https://childrenshealthdefense.org/defender/sen-ron-johnson-questions-fda-pfizer-vaccine-approval/", "https://childrenshealthdefense.org/defender/sen-johnson-ken-ruettgers-press-conference-families-injured-covid-vaccines/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://childrenshealthdefense.org/defender/covid-vaccine-spike-protein-travels-from-injection-site-organ-damage/", "https://childrenshealthdefense.org/defender/sen-johnson-ken-ruettgers-press-conference-families-injured-covid-vaccines/", "https://childrenshealthdefense.org/defender/biden-vaccine-mandates-politicians-fight-back/", "https://www.fda.gov/emergency-preparedness-and-response/mcm-legal-regulatory-and-policy-framework/emergency-use-authorization", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/kristi-dobbs-injured-pfizer-covid-vaccine-local-news-agency-kills-story/", "http://vaccineinjurynews.com"], "authors": [], "publish_date": null}