{"result_id": "195006", "URL": "https://mediafactwatch.com/2023-01-25-game-is-over-and-they-have-lost.html", "timestamp": "2023-04-25 16:18:47 CEST+0200", "meta": {"description": "The Guardian on Jan 15, 2023 published the most perfect piece of new normal nostalgia that ever was or could be: Coronavirus: ‘People aren’t taking this seriously’: experts say US Covid surge is big risk by Melody Schreiber. (Article by Robert Blumen republished from Browstone.org) This piece may be studied as a Platonic Form. Nothing could more perfectly demonstrate the […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,booster,covid-19,deception,disinfo,Government Slaves,Guardian,infections,Journalism,lies,mainstream media,news cartels,outbreak,pandemic,propaganda,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2023-01-25-game-is-over-and-they-have-lost.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "The game is over and they have lost", "cleaned_text": "The game is over and they have lost\n\nThe Guardian on Jan 15, 2023 published the most perfect piece of new normal nostalgia that ever was or could be: Coronavirus: ‘People aren’t taking this seriously’: experts say US Covid surge is big risk by Melody Schreiber.\n\nThis piece may be studied as a Platonic Form. Nothing could more perfectly demonstrate the inability of the covid fear porn publishers to let go of the narrative. If the author didn’t have her own website, I would have attributed the piece to an instance of ChatGPT trained on every Guardian and New York Times article from the past three years.\n\nThe writer employs every single discredited covid trope at least once. I will list a few of the best, here. To cover them all I would have to quote the entire article and that would violate the Fair Use Doctrine. I have chosen a tabular form with a quote alongside the trope that it is derived from:\n\nMy favorite part of the piece is, “Yet because of poor messaging from officials, many people may not even realize the US is experiencing a surge.” I am one of those many people who did not know this. A surge of what? A normal seasonal flu that makes people feel a bit under the weather for a week? A bad cold-vid?\n\nWe can celebrate our return to the old normal when an outbreak of a seasonal virus is of concern to those who are infected or who care for a family member. All of society need not be thrust into a panic over such things. The more normal the world is, the more resources of those who are impacted will have to deal with their troubles. And the better will those who are not directly affected be able to support them.\n\nAs a software engineer I note with some amusement that the variant (or as I like to call them “scariant”) names now have two periods. In a software release version a version with double dot is used for a minor bug fix release, (e.g. 3.0.1). “Minor” means that the release is not important enough for users to upgrade immediately. Perhaps the same thinking should be applied to the way we handle the emergence of new viral variants.\n\nWhen Biden said that the pandemic is over, followed by “If you notice, no one’s wearing masks. Everybody seems to be in pretty good shape,” that may have been his dementia inhibiting the filter that was supposed to kick in before he said something truthful. Biden only said the quiet part out loud: the public has put the panic phase in the rearview. Even Anthony Fauci made the incomprehensible statement that the pandemic isn’t over but we are out of the “pandemic phase.” Every statement like this is more toothpaste for the pandemic dead-enders to put back in the tube.\n\nThe article bemoans the low acceptance rate of the booster vaccinations. We are told that cases are avoidable if patients had sought additional injections. First thing: do we care about cases? Second thing: it is not true that the covid vaccines prevent infection. That could only be so if the failed claim of sterilizing immunity were valid.\n\nVaccine advocates have walked back the earlier claims that one or any number of shots would prevent the recipient from getting infected. It was let out late in 2022 that the clinical trials did not even test for the ability of the drugs to stop transmission. It’s hard to believe that anyone can still say that after so many multiply-vaccinated-and-boosted public figures have gotten covid.\n\nMy friend Kevin Duffy, a professional investor, after seeing the Guardian article, sent me this image. The graph shows the market psychology of a financial bubble and subsequent market crash. I have added the red oval highlighting where Kevin thinks we are now: in the denial phase, after the bubble has burst.\n\nI am also reminded of the Kubler-Ross stages of grief that a patient or a loved one goes through when receiving a terminal diagnosis. The stage in her sequence is denial. The subsequent stages are anger, bargaining, depression and acceptance.\n\nThe same could be said of all of these tropes: Does anyone believe them anymore? This is not news. It is a last-gasp attempt to squeeze more juice out of a dehydrated lemon. These messages were potent fear generators two years ago. But with each use, the charge becomes weaker.\n\nThe script has worn itself out. These tropes are now tired and ineffective. The fear-pushers seem unaware that the message has lost its effect, but do not have anything else to offer. The tell is not that they publish articles like this. It is how much these pieces show that they don’t know that the game is over and they have lost.", "opengraph": {"title": "The game is over and they have lost", "type": "article", "url": "https://www.mediafactwatch.com/2023-01-25-game-is-over-and-they-have-lost.html", "site_name": "Media Fact Watch Com", "description": "The Guardian on Jan 15, 2023 published the most perfect piece of new normal nostalgia that ever was or could be: Coronavirus: ‘People aren’t taking this seriously’: experts say US Covid surge is big risk by Melody Schreiber. (Article by Robert Blumen republished from Browstone.org) This piece may be studied as a Platonic Form. Nothing could more perfectly demonstrate the […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2023/01/Vaccine-Vials-Pattern-Montage.jpg"}, "tags": ["pandemic", "Guardian", "big government", "covid-19", "vaccine wars", "mainstream media", "Journalism", "outbreak", "deception", "Government Slaves", "infections", "vaccines", "disinfo", "lies", "news cartels", "propaganda", "booster"], "tweets": [], "movies": [], "links": ["https://www.theguardian.com/world/2023/jan/15/covid-19-coronavirus-us-surge-complacency", "https://brownstone.org/articles/the-game-is-over-and-they-have-lost/", "https://study.com/learn/lesson/plato-theory-forms-realm-physical.html", "https://melodyandwords.com/about-me/", "https://www.dictionary.com/browse/trope", "https://www.copyright.gov/fair-use/", "https://biobot.io/data/", "https://www.theguardian.com/us-news/2022/sep/19/biden-says-covid-pandemic-is-over-despite-us-daily-death-toll-in-the-hundreds", "https://gis.cdc.gov/grasp/covidnet/covid19_5.html", "https://semver.org/", "https://www.npr.org/sections/health-shots/2022/09/20/1123883468/biden-pandemic-over-complicates-fight", "https://www.nytimes.com/live/2022/04/27/world/covid-19-mandates-vaccine-cases", "https://en.wiktionary.org/wiki/dead-ender", "https://nypost.com/2021/04/02/cdc-walks-back-claim-that-vaccinated-people-cant-carry-covid", "https://apnews.com/article/fact-check-pfizer-transmission-european-parliament-950413863226", "https://en.wikipedia.org/wiki/Five_stages_of_grief", "https://brownstone.org/articles/the-game-is-over-and-they-have-lost/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2023-01-25-game-is-over-and-they-have-lost&linkname=The%20game%20is%20over%20and%20they%20have%20lost", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}