{"result_id": "195044", "URL": "https://mediafactwatch.com/2023-03-16-cbs-wakes-up-to-wuhan-labs-research.html", "timestamp": "2023-04-25 16:19:10 CEST+0200", "meta": {"description": "After initially ignoring congressional hearings on the origins of COVID-19 last week, CBS Mornings warmed up to the increasingly likely theory that the virus originated from a lab leak in Wuhan, China on Monday. They even adopted the Watergate truism of “follow the money” to scrutinize U.S. payments to the lab where they were reportedly conducting risky “gain-of-function research,” […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,big government,CBS,China,conspiracy,covid-19,deception,double billing,gain-of-function,government debt,government funding,infections,money supply,national debt,outbreak,pandemic,real investigations,research,traitors,treason,truth,Wuhan", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2023-03-16-cbs-wakes-up-to-wuhan-labs-research.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "‘Follow the money’: CBS wakes up to Wuhan lab’s ‘high-risk research’", "cleaned_text": "‘Follow the money’: CBS wakes up to Wuhan lab’s ‘high-risk research’\n\nAfter initially ignoring congressional hearings on the origins of COVID-19 last week, CBS Mornings warmed up to the increasingly likely theory that the virus originated from a lab leak in Wuhan, China on Monday. They even adopted the Watergate truism of “follow the money” to scrutinize U.S. payments to the lab where they were reportedly conducting risky “gain-of-function research,” and overbilling the U.S. agencies that were doling out funds hand over fist to the tune of millions of dollars.\n\n“We’ve got new details to share with you today about an investigation into U.S. funding the Chinese research lab in the city at the center of the pandemic,” co-anchor Michelle Miller announced. “It’s raising questions about how closely [past] administrations were following the use of the money.”\n\nCBS investigative correspondent Catherine Herridge spoke with Diane Cutler, a former federal investigator of white-collar crimes hired by Republican Senator Roger Marshall (KS) to dig through billing documents from the National Institutes of Health (NIH) and the U.S. Agency for International Development (USAID).\n\n“My collection is certainly well over 50,000 documents,” Cutler told Herridge. “So, what I found so far is evidence that points to double billing, potential theft of government funds. It is concerning, especially since it involves dangerous pathogens and risky research.”\n\nIn addition to possibly double billing the U.S. for the risky research that possibly spawned the pandemic that killed 1.1 million Americans, Herridge noted it also “included possible medical supplies, equipment, travel, and salaries.”\n\nHerridge also reported that former CDC director Dr. Robert Redfield had testified to Congress that “money from multiple U.S. government agencies supported high-risk virus research in Wuhan.” And getting to the bottom of it was something she spoke with Senator Marshall about in an interview:\n\n“I think there’s 1.1 million reasons that American taxpayers should care,” Marshall declared. “If a plane crashes, we want to find out why the plane crashes. We go to any length to do that. And the hope is we don’t have another plane crash for the same reason.”\n\nHerridge concluded her report by informing viewers that “[s]ources told CBS News that tens of millions of U.S. taxpayer dollars could be involved, and the findings could provide new insight into the Wuhan research.”\n\nShe also noted that her investigative reporting was getting stonewalled by the dubious agencies in question. “Spokesperson for USAID declined to comment, and the NIH press office did not respond to CBS News’s questions,” she reported.\n\nThe transcript is below, click “expand” to read:\n\nMICHELLE MILLER: We’ve got new details to share with you today about an investigation into U.S. funding the Chinese research lab in the city at the center of the pandemic. It’s raising questions about how closely passed administrations were following the use of the money. Senior investigative correspondent Catherine Herridge joins us from Washington with more. Good morning, Catherine. CATHERINE HERRIDGE: Good morning, Michelle. Sources tell CBS news an investigation of this complexity could take at least six months to reach a conclusion about whether U.S. government agencies were billed twice for projects in Wuhan, China. The probe kicked off after new information came to light from Congress. DIANE CUTLER (former federal investigator): We are collecting evidence here and collecting facts. HERRIDGE: Former federal investigator Diane Cutler spent two decades combating white-collar crime and healthcare fraud. During the pandemic, Cutler turned her attention to U.S. government grants that supported coronavirus-related research in China. How many records have you viewed? CUTLER: My collection is certainly well over 50,000 documents. HERRIDGE: Records reviewed by CBS News indicate the U.S. government may have paid twice for projects at the Wuhan labs through the National Institutes of Health and the U.S. Agency for International Development or USAID. CUTLER: So categorized it and drilled down from there. HERRIDGE: This included possible medical supplies, equipment, travel, and salaries. CUTLER: So, what I found so far is evidence that points to double billing, potential theft of government funds. It is concerning, especially since it involves dangerous pathogens and risky research. HERRIDGE: While intelligence agencies can’t agree on how the pandemic that killed more than 1.1 million Americans started, the FBI and now the Energy Department have found an accidental lab leak is plausible. Not potentially through infected animals at a nearby market. At recent congressional hearings into the origins of COVID-19, the former CDC director said money from multiple U.S. government agencies supported high-risk virus research in Wuhan. DR. ROBERT REDFIELD (former CDC director): I think it did not only from NIH but from the State Department, USAID, and from DOD. HERRIDGE: Does following the money get us closer to understanding the origins of COVID-19? SEN. ROGER MARSHALL (R-KS): Following the money always seems to work in investigations. HERRIDGE: Republican Senator Roger Marshall hired Cutler and took her records to USAID’s internal watchdog which opened its own probe. Details of which have not been previously reported. What needs to happen next? MARSHALL: Next we do need this 9/11-style commission. I call it apolitical, nonpolitical, we need to get this outside of Washington, D.C. HERRIDGE: Sources familiar with the grant records did not dispute CBS News’s reporting. In a statement, a spokesperson for the USAID Inspector General declined to comment on the existence of a specific open investigation. Why should U.S. Taxpayers care? MARSHALL: I think there’s 1.1 million reasons that American taxpayers should care. If a plane crashes, we want to find out why the plane crashes. We go to any length to do that. And the hope is we don’t have another plane crash for the same reason. HERRIDGE: Sources told CBS News that tens of millions of U.S. taxpayer dollars could be involved, and the findings could provide new insight into the Wuhan research. Spokesperson for USAID declined to comment, and the NIH press office did not respond to CBS News’s questions. Tony? TONY DOKOUPIL: Following the money, always seems to work. The Senator’s right about that. And you’re very good at it, Catherine. Thank you very much.", "opengraph": {"title": "‘Follow the money’: CBS wakes up to Wuhan lab’s ‘high-risk research’", "type": "article", "url": "https://www.mediafactwatch.com/2023-03-16-cbs-wakes-up-to-wuhan-labs-research.html", "site_name": "Media Fact Watch Com", "description": "After initially ignoring congressional hearings on the origins of COVID-19 last week, CBS Mornings warmed up to the increasingly likely theory that the virus originated from a lab leak in Wuhan, China on Monday. They even adopted the Watergate truism of “follow the money” to scrutinize U.S. payments to the lab where they were reportedly conducting risky “gain-of-function research,” […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2023/03/Coronavirus-China-Sample-Test-Medican-Mask-Science.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "outbreak", "deception", "national debt", "China", "double billing", "government funding", "money supply", "covid-19", "real investigations", "truth", "government debt", "treason", "infections", "gain-of-function", "CBS", "research", "Wuhan", "traitors"], "tweets": [], "movies": [], "links": ["https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2023/03/09/deaf-hearings-cbsnbc-skip-covid-origin-abc-avoids", "https://newsbusters.org/blogs/nb/nicholas-fondacaro/2023/03/13/follow-money-cbs-wakes-wuhan-labs-high-risk-research", "https://newsbusters.org/blogs/nb/nicholas-fondacaro/2023/03/13/follow-money-cbs-wakes-wuhan-labs-high-risk-research", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2023-03-16-cbs-wakes-up-to-wuhan-labs-research&linkname=%E2%80%98Follow%20the%20money%E2%80%99%3A%20CBS%20wakes%20up%20to%20Wuhan%20lab%E2%80%99s%20%E2%80%98high-risk%20research%E2%80%99", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}