{"result_id": "195035", "URL": "https://www.mediafactwatch.com/2021-09-02-nfl-career-over-blood-clots-league-forced-vax.html", "timestamp": "2023-04-25 16:19:05 CEST+0200", "meta": {"description": "The National Football League announced ahead of this year’s preseason that it would pressure all of its players to get the still-new COVID-19 vaccines if they wanted to take part in games this year, and it’s a decision that is already having fallout. One player, New York Jets defensive end Vinny Curry, has likely seen his […]", "lang": "en", "keywords": "2021 season,badhealth,badmedicine,Big Pharma,blood clot,covid vaccine,Dangerous Medicine,defensive end,nfl,pandemic,pharmaceutical fraud,vaccine damage,vaccine injury,vaccine mandates,Vinny Curry", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.mediafactwatch.com/2021-09-02-nfl-career-over-blood-clots-league-forced-vax.html", "encoding": "UTF-8"}, "image": null, "domain": "www.mediafactwatch.com", "title": "NFL career may be over for young defensive end who developed blood clots after being pressured into taking COVID-19 vax", "cleaned_text": "NFL career may be over for young defensive end who developed blood clots after being pressured into taking COVID-19 vax\n\nThe National Football League announced ahead of this year’s preseason that it would pressure all of its players to get the still-new COVID-19 vaccines if they wanted to take part in games this year, and it’s a decision that is already having fallout.\n\nOne player, New York Jets defensive end Vinny Curry, has likely seen his career go bye-bye because after getting the vaccine, he developed life-threatening blood clots as many other people who’ve been vaccinated have.\n\nA 33-year-old NFL defensive end will miss the entire 2021 season and is likely done playing professional football. Mainstream media, however, are completely censoring the reason why.\n\nMr. Vinny Curry received one of the experimental mRNA injections sometime this summer. He did a public service announcement promoting and encouraging people to get the “safe, effective” injections. Mr. Curry also confirmed that he received the shots himself in the PSA. Atlantic Health System in Morristown, New Jersey produced the PSA. It is one of the largest healthcare networks in the state, encompassing six hospitals in 11 New Jersey counties. Atlantic Health posted the PSA on Facebook on August 3.\n\nNot long afterward, Curry had to have his spleen removed because of a “rare blood disorder” that showed up out of no where, and while Jets team doctors claimed initially that Curry would probably be ready to play by the mid-September season opener, that isn’t going to happen.\n\nThe thing to keep in mind is that while you can live without a spleen, the organ filters blood and removes or recycles red blood cells; without it, your liver, kidneys, and other organs have to work harder in order to compensate.\n\n“Last week, Mr. Curry updated everyone via Instagram and Twitter. He said doctors also diagnosed him with blood clots, forcing him to take blood thinners for the foreseeable future,” The COVID Blog noted. “Blood clots are common and known post-injection adverse events.”\n\nBecause of those clots, Curry is now slated to miss the entire 2021 season; and at 33, it isn’t like he has a lot of seasons left to play. In fact, he was likely only going to play four more years but they represent his final opportunity to cash in on a rare opportunity — playing in the most lucrative professional sports league on the planet. Now, it’s very likely his career has been prematurely truncated all because he was forced to take a vaccine for a disease that has a 99.5 percent recovery rate.\n\nAnd of course, the garbage media has refused to connect the dots between the vaccine and his health condition, though it’s known the coronavirus vaccines have been known to cause conditions like pericarditis and blood clots.\n\n“ESPN, Sports Illustrated and NBC Sports are three of the top U.S. sports mainstream media outlets. All of them reported on August 25 that Mr. Curry would miss the entire 2021 season due to blood clots and a ‘rare blood disorder,” The COVID Blog noted further.\n\n“However, none of them mentioned that he received one of the experimental mRNA injections sometime over the summer. Jets Head Coach Robert Saleh said in a July 28 press conference that 81 of the 90 players on the training camp roster had received the experimental injections.”\n\nAccording to the NFL, “Tier 1” employees — coaches, trainers, and others who are in close contact with players — are required to get the jabs if they want to keep their jobs. Players are not required to get the shots, but if they don’t they face several requirements and restrictions such as constant testing and other petulant mandates.\n\nSo far, at least two NFL assistant coaches have been fired because they refused to take the shots; the Buffalo Bills are continually in the the news because many of the team’s players have refused to get them as well.\n\nBut as Curry proves, there is a real danger to getting the jabs, though no one in the NFL’s head office appears to care.", "opengraph": {"title": "NFL career may be over for young defensive end who developed blood clots after being pressured into taking COVID-19 vax", "type": "article", "url": "https://www.mediafactwatch.com/2021-09-02-nfl-career-over-blood-clots-league-forced-vax.html", "site_name": "Media Fact Watch Com", "description": "The National Football League announced ahead of this year’s preseason that it would pressure all of its players to get the still-new COVID-19 vaccines if they wanted to take part in games this year, and it’s a decision that is already having fallout. One player, New York Jets defensive end Vinny Curry, has likely seen his […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2021/09/Football-Field-Night-Lights-Stadium.jpg"}, "tags": ["covid vaccine", "pandemic", "Big Pharma", "2021 season", "defensive end", "vaccine injury", "nfl", "vaccine mandates", "blood clot", "vaccine damage", "Vinny Curry", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://thecovidblog.com/2021/09/01/vinny-curry-career-likely-over-for-new-york-jets-nfl-defensive-end-after-post-injection-blood-clots-rare-blood-disorder/", "http://www.vaccines.news", "https://www.naturalnews.com/2021-06-22-nfl-player-doesnt-like-covid-vaccine.html", "https://thecovidblog.com/2021/09/01/vinny-curry-career-likely-over-for-new-york-jets-nfl-defensive-end-after-post-injection-blood-clots-rare-blood-disorder/", "https://www.naturalnews.com/2021-06-22-nfl-player-doesnt-like-covid-vaccine.html"], "authors": [], "publish_date": null}