{"result_id": "195016", "URL": "https://mediafactwatch.com/2016-04-21-exclusive-hijacked-by-pro-vaccine-troll-dr-david-gorski-wikipedia-circulates-deceitful-entry-on-vaxxed-documentary.html", "timestamp": "2023-04-25 16:18:53 CEST+0200", "meta": {"description": "Wikipedia seems like a good place to get fast information that’s at least somewhat reliable, right? Wrong. The truth is that Wikipedia is nothing more than a trove of disinformation and propaganda peddled by industry gatekeepers, intent on maintaining their ominous facades while upholding the lucrative empires that largely enslave us all, i.e. the pharmaceutical […]", "lang": "en", "keywords": "autism,breast cancer,Censorship,Crittenton Hospital,David Gorski,High Priority,Karmanos Cancer Institute,vaccines,Wikipedia", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2016-04-21-exclusive-hijacked-by-pro-vaccine-troll-dr-david-gorski-wikipedia-circulates-deceitful-entry-on-vaxxed-documentary.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "EXCLUSIVE: Hijacked by pro-vaccine troll Dr. David Gorski, Wikipedia circulates deceitful entry on VAXXED documentary", "cleaned_text": "Wikipedia seems like a good place to get fast information that’s at least somewhat reliable, right? Wrong. The truth is that Wikipedia is nothing more than a trove of disinformation and propaganda peddled by industry gatekeepers, intent on maintaining their ominous facades while upholding the lucrative empires that largely enslave us all, i.e. the pharmaceutical industry and its costly vaccine market.\n\nMost of you have probably heard about the firestorm caused by Andrew Wakefield’s explosive documentary VAXXED, which details decades of scientific fraud covering-up the link between vaccines and the injuries they routinely cause.\n\nWell, Natural News has now learned from trusted sources that Wikipedia’s incredibly biased entry on VAXXED was written by none other than pro-vaccine shill, Dr. David Gorski, notorious for his relentless and callous attacks on vaccine skeptics, alternative medicine, and its supporters.\n\nGorski is a surgical oncologist at the Karmanos Cancer Institute, the same facility where cancer fraudster Dr. Farid Fata leased office space to maim and kill cancer-free people through aggressive chemotherapy and radiation treatments.\n\nFata, who received a 45 year prison sentence, also undertreated cancer patients, laundered money, and defrauded the government out of $23 million in a scheme labeled the biggest case of health fraud ever to be observed in the U.S.\n\nWe suspect Gorski and Fata may have ties that have not yet been uncovered. But we do know that Gorski and his team of skeptics have administrative privileges on Wikipedia and have utilized those controls to attack the natural health field and its supporters.\n\nOur sources say Gorski is using the name “MastCell” to write entries on Wikipedia.\n\n“Wikipedia’s health topics have long been hijacked by vaccine sociopaths and paid pharmaceutical shills. Dr. David Gorski is the top disinfo coordinator for Wikipedia, giving him a platform to reflect his internal psychopathy and pathological hatred for all things holistic and natural,” said Natural News’ Adams, author of Food Forensics, science lab director of CWClabs.com, and creator of Medicine.news.\n\nWikipedia’s entry on VAXXED preferentially gives the floor to the documentary’s attackers, listing five nasty and discrediting reviews calling the film a “hoax,” while accusing it of relying “on tons of random factoids positioned out of context to drive home his [Wakefield] agenda.”\n\nAnother VAXXED “review” featured by Wikipedia, Gorski and his team of skeptics, accuses the documentary of putting “the viewer through a well-trod gauntlet of emotional pleas, context-free statistics … and shadowy conspiracies.”\n\nClearly, Wikipedia’s entry was not written by “tens of thousands of regular editors,” including “casual readers,” as so it claims under its “Overview of editorial structure,” which dishonestly insists it has “mechanisms” for weeding out “bad edits” and “problematic editors.”\n\nIf it were truly written by ordinary citizens, we would be willing to bet that a few not-so-biased (and not-so- hateful) reviews would have made their way onto Wikipedia’s VAXXED entry, especially considering the film sold-out 10 shows before theater doors even opened in California.\n\nLos Angeles alone sold out five shows in about 48 hours. The film is so successful that it’s moving on to several other cities including San Diego and Phoenix; it’s also scheduled to air in Louisiana – with more cities and states to be added soon.\n\nWikipedia’s bashing of VAXXED is yet another attempt by the vaccine industry to censor truthful information it’s so deathly afraid of.\n\n“That Wikipedia still allows deranged people like this to vandalize its web page to destroy independent films only speaks to the total lack of credibility Wikipedia has earned for itself. On topics of health and medicine, Wikipedia isn’t run by volunteers but by angry, anti-science fanatics who are ultimately funded by Big Pharma,” said Adams.\n\nGorski and his band of internet trolls have clearly taken over Wikipedia and are using it as a weapon to defame anyone and anything that opposes vaccines or calls for safer vaccines.\n\nThe most sadistic part about Gorski using Wikipedia to deter people from seeing VAXXED is that he uses the entries to quote himself in a bizarre third party manner. He writes:\n\n“The filmmaker claims that it is a documentary ‘that explores the journeys of parents whose autistic children were plausibly affected by a vaccine,’ however critics consider it propaganda with surgical oncologist David Gorski labeling it a ‘propaganda film by a known scientific fraud.’”\n\nWakefield is NO fraud by the way. Soon, Natural News will publish a report clarifying in detail how he was framed by the vaccine industry.\n\nSo, what is exactly does Gorski have to gain from discrediting the anti-vaxxer movement? Well, we have a few ideas. As Natural News reported Monday, Gorski’s employer, Wayne State University, has a lot to gain from an ALS drug called riluzole that could be used to treat autism, according to Epidemiologist Jake Crosby, adding that Gorski is experimenting with that same drug to treat breast cancer.\n\nIn his Wayne State laboratory, Gorski focuses on the research and development of prescription drugs. However, he’s working not to create new medications, but rather new uses for existing drugs, a process far more lucrative than creating new drugs from scratch.\n\n“The potentially profitable drug Gorski is in the process of conducting a clinical trial for is the ALS drug Riluzole…. Amplifying the conflict further is that the same drug is also being studied for the treatment of autism,” wrote Crosby.", "opengraph": {"title": "EXCLUSIVE: Hijacked by pro-vaccine troll Dr. David Gorski, Wikipedia circulates deceitful entry on VAXXED documentary", "type": "article", "url": "https://www.mediafactwatch.com/2016-04-21-exclusive-hijacked-by-pro-vaccine-troll-dr-david-gorski-wikipedia-circulates-deceitful-entry-on-vaxxed-documentary.html", "site_name": "Media Fact Watch Com", "description": "Wikipedia seems like a good place to get fast information that’s at least somewhat reliable, right? Wrong. The truth is that Wikipedia is nothing more than a trove of disinformation and propaganda peddled by industry gatekeepers, intent on maintaining their ominous facades while upholding the lucrative empires that largely enslave us all, i.e. the pharmaceutical […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2017/05/Wiki.jpg"}, "tags": ["autism", "Crittenton Hospital", "Karmanos Cancer Institute", "breast cancer", "High Priority", "Censorship", "David Gorski", "vaccines", "Wikipedia"], "tweets": [], "movies": [], "links": ["http://www.truthwiki.org/orac-david-h-gorski/", "http://www.naturalnews.com/053341_Dr_Farid_Fata_cancer_fraud_oncology.html", "http://foodforensics.com/", "http://cwclabs.com", "http://medicine.news", "https://en.wikipedia.org/wiki/Vaxxed", "http://www.vaxxedthemovie.com/", "http://www.naturalnews.com/053642_Vaxxed_censored_films_mainstream_media_censorship.html", "http://www.naturalnews.com/053706_David_Gorski_autism_drug_Karmanos_Cancer_Center.html", "https://twitter.com/JakeLCrosby", "http://www.naturalnews.com/053706_David_Gorski_autism_drug_Karmanos_Cancer_Center.html", "http://www.truthwiki.org/orac-david-h-gorski/", "http://www.naturalnews.com/053445_VAXXED_film_Robert_De_Niro_Tribeca_Festival.html", "http://www.ageofautism.com/2010/06/david-gorskis-financial-pharma-ties-what-he-didnt-tell-you.html", "http://www.naturalnews.com/053341_Dr_Farid_Fata_cancer_fraud_oncology.html", "http://www.naturalnews.com/053642_Vaxxed_censored_films_mainstream_media_censorship.html", "http://www.vaxxedthemovie.com/", "https://en.wikipedia.org/wiki/Wikipedia:Editorial_oversight_and_control#Wikipedia.27s_editorial_control_process", "https://en.wikipedia.org/wiki/Vaxxed", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2016-04-21-exclusive-hijacked-by-pro-vaccine-troll-dr-david-gorski-wikipedia-circulates-deceitful-entry-on-vaxxed-documentary&linkname=EXCLUSIVE%3A%20Hijacked%20by%20pro-vaccine%20troll%20Dr.%20David%20Gorski%2C%20Wikipedia%20circulates%20deceitful%20entry%20on%20VAXXED%20documentary", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}