{"result_id": "195011", "URL": "https://www.mediafactwatch.com/2023-04-03-the-10-worst-aftereffects-of-the-plandemic.html", "timestamp": "2023-04-25 16:18:50 CEST+0200", "meta": {"description": "Though the pandemic, also known as the plandemic, is over, the Democrats so desperately want it to continue, and for several major reasons. Election fraud was quite simple, and the mail-in ballots made in China gave Beijing Biden a 50 million vote head start in 2020. Democrats love wearing communist masks also because they show […]", "lang": "en", "keywords": "big government,Big Pharma,Censored Science,clot shots,health freedom,mask litter,medical censorship,pandemic trash,Plandemic,post-pandemic,propaganda,scamdemic,Tyranny,vaccine damage,vaccine death,Vaccine Holocaust", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.mediafactwatch.com/2023-04-03-the-10-worst-aftereffects-of-the-plandemic.html", "encoding": "UTF-8"}, "image": null, "domain": "www.mediafactwatch.com", "title": "The 10 WORST aftereffects of the PLANDEMIC", "cleaned_text": "The 10 WORST aftereffects of the PLANDEMIC\n\nThough the pandemic, also known as the plandemic, is over, the Democrats so desperately want it to continue, and for several major reasons. Election fraud was quite simple, and the mail-in ballots made in China gave Beijing Biden a 50 million vote head start in 2020. Democrats love wearing communist masks also because they show unity for a common cause (bowing down to the system). And so everyone else must see the signs of the misinformation and perpetuated fake-science cult of programming, every day, just about everywhere.\n\nSadly, it’s not just a visual residual toxic effect, but an embedded health disaster for all the vaxxed zombies and the masked communists that walk among us. The aftereffects of the plandemic are real, and the Republic may never be the same again. So without further adieu, here are the 10 worst aftereffects of the scamdemic.\n\n#1. People’s vascular systems are clotted from the COVID clot shots\n\n#2. The world is littered with dirty COVID masks\n\n#3. More people died from the Vaccine Holocaust (PfizerGate & ModernaMadness) than from the Wuhan virus itself\n\n#4. Millions of Americans lost their jobs and medical choice to vaccine mandates\n\n#5. The supply chain of the USA is crippled and possibly permanently\n\n#6. The election got rigged by fake CCP mail-in-ballots and now communists run the country\n\n#7. The CDC, FDA, WHO, and all other 3-and-4-letter pharma-run regulatory agencies became more tyrannically powerful and corrupt\n\n#8. Medical misinformation is everywhere, and censorship of the truth is even stricter\n\n#9. Millions of naïve humans are STILL wearing bacteria-laden, bacteria-breeding Covid masks that make them sick and more susceptible to gain-of-function viruses\n\n#10. The vaxxed millions became dumber, meaner, and more brainwashed than ever\n\nConfused, oxygen-and-nutrient-deprived vaxxed Americans are wandering around in a fog and can’t rationalize the horrific aftereffects of the plandemic\n\nMillions of Americans still think the COVID masks work. They are riddled with misinformation spread by Big Pharma all over the media, social media, and their “dumb” phones. The millions of spike proteins in their vascular system have clogged up their blood vessels so badly they can’t breathe right, think straight, or even use logic to realize their health, livelihood, and human rights have been devastated by the Fauci plandemic.\n\nLiteral communists are running Washington DC and most of America, purposely destroying the supply chain, the agricultural revolution, the fuel supply, the Constitution, and millions of lives with the clot shots.\n\nAll over the streets, neighborhoods, parks, parking lots, offices, schools, playgrounds, oceans, and lakes are nasty, used COVID throwaway masks that will not disintegrate. They’re worse than cigarette butts and single-use plastic bags.\n\nTake a look outside grocery stores, gas stations, and drug stores and you’ll see dozens of dirty masks all over the sidewalks, entrance ways, and parking lots. People just toss them on the ground, and now, hardly a soul picks up litter anymore for fear of catching the gain-of-function virus from touching trash.\n\nPeople think that by getting vaccinated and masking up, they are helping society, but it’s just the opposite. These jabbed up folks have weaker immune systems now, more bacteria trapped in their mouth, throat, and lungs, and less medical rights and privacy than they ever had before. The Vaccine Holocaust is real, just as predicted by the Health Ranger, whether people want to acknowledge it or not. The gas chambers just take a little longer to kill you, and they have a new name – mRNA.\n\nBookmark Censored.news to your favorite websites for truth news that’s been censored from the rest of the media as you read this.", "opengraph": {"title": "The 10 WORST aftereffects of the PLANDEMIC", "type": "article", "url": "https://www.mediafactwatch.com/2023-04-03-the-10-worst-aftereffects-of-the-plandemic.html", "site_name": "Media Fact Watch Com", "description": "Though the pandemic, also known as the plandemic, is over, the Democrats so desperately want it to continue, and for several major reasons. Election fraud was quite simple, and the mail-in ballots made in China gave Beijing Biden a 50 million vote head start in 2020. Democrats love wearing communist masks also because they show […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2023/04/mask-litter-stock-photo.jpg"}, "tags": ["big government", "clot shots", "medical censorship", "Big Pharma", "Plandemic", "post-pandemic", "pandemic trash", "vaccine death", "scamdemic", "vaccine damage", "Vaccine Holocaust", "health freedom", "Censored Science", "propaganda", "mask litter", "Tyranny"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2020-11-13-voter-fraud-is-real-mail-in-ballots.html", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://nationalpost.com/news/canada/gloves-and-masks-become-problem-litter-as-covid-19-prompts-people-to-cover-up", "https://naturalnews.com/2019-07-18-alert-for-humanity-the-perfect-storm-for-a-vaccine-holocaust-is-now-here.html", "https://www.naturalnews.com/2022-11-16-dr-tenpenny-warns-death-tsunami-covid-vaccines.html", "https://www.naturalnews.com/2022-07-28-dna-testing-kits-scam-ethnicity-specific-bioweapons.html", "https://naturalnews.com/2020-11-13-voter-fraud-is-real-mail-in-ballots.html", "https://nationalpost.com/news/canada/gloves-and-masks-become-problem-litter-as-covid-19-prompts-people-to-cover-up", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2023-04-03-the-10-worst-aftereffects-of-the-plandemic&linkname=The%2010%20WORST%20aftereffects%20of%20the%20PLANDEMIC", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}