{"result_id": "195020", "URL": "https://mediafactwatch.com/2022-02-03-mainstream-media-attacks-health-freedom-advocates.html", "timestamp": "2023-04-25 16:18:56 CEST+0200", "meta": {"description": "Del Bigtree, television producer and host of “The Highwire,” is being attacked by the media for comparing Wuhan coronavirus (COVID-19) vaccine mandates to the Holocaust. Instead of worrying, Bigtree is celebrating because the attacks prove that he was right. On Jan. 23, Bigtree spoke to a group of approximately 40,000 people in Washington, D.C. as […]", "lang": "en", "keywords": "badhealth,badmedicine,conspiracy,covid-19,deception,Defeat the Mandates,Del Bigtree,disinfo,Government Slaves,Holocaust,Journalism,lies,mainstream media,news cartels,propaganda,Robert F. Kennedy Jr.,the highwire,traitors,vaccine mandate,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2022-02-03-mainstream-media-attacks-health-freedom-advocates.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "Mainstream media attacks health freedom advocates for comparing vaccine mandates to Holocaust", "cleaned_text": "Del Bigtree, television producer and host of “The Highwire,” is being attacked by the media for comparing Wuhan coronavirus (COVID-19) vaccine mandates to the Holocaust. Instead of worrying, Bigtree is celebrating because the attacks prove that he was right.\n\nOn Jan. 23, Bigtree spoke to a group of approximately 40,000 people in Washington, D.C. as part of the “Defeat the Mandates: An American Homecoming” rally against COVID-19 vaccine mandates.\n\nThe main message of Bigtree’s speech is that the media has refused to accurately cover the concerns of health freedom advocates who are against policies that force people to get vaccinated.\n\n“I want to talk to the television cameras at NBC and MSNBC and Fox and CBS, and I want to say shame on you,” said Bigtree during his speech. “You have a right to tell the truth. We have an oath that we’ve made – just like scientists and doctors made – to tell the truth. And instead, you force a lie upon the United States of America and the world.”\n\nBut mainstream media outlets that covered Bigtree’s speech refused to highlight this. They instead pointed their attention towards Bigtree calling for a “new Nuremberg trial,” one which holds journalists accountable for “the suppression of life-saving information on effective early treatments during the pandemic, which experts say may have led to 500,000 deaths attributed to COVID,” Bigtree said.\n\n“Unlike the Nuremberg trials that only tried those doctors that destroyed the lives of human beings, we are going to come after the press that lied to the world, that worked as a propaganda machine to push this,” he continued. “Your lies could not win. You only got 60 percent of this nation to take the vaccine, and most of them are under duress. That means more than 50 percent of the nation are not listening to you.” (Related: Nuremberg violations: Should government vaxx agents be reclassified as ‘enemy combatants’?)\n\nMainstream media trying to shift focus away from message of “Defeat the Mandates” rally\n\nOther prominent health freedom advocates who spoke at the “Defeat the Mandates” rally were also targeted by the mainstream media, including Robert F. Kennedy, Jr. Instead of focusing on the content of their speeches, the press focused on the fact that they made reasonable comparisons between America’s vaccine policies and the Nazi regime.\n\n“Even in Hitler’s Germany, you could cross the Alps into Switzerland, you can hide in the attic like Anne Frank did,” said Kennedy in his speech during the rally. “Today, the mechanisms are being put in place that will make it so none of us can run, none of us can hide.”\n\nKennedy’s point was that there should be ways for those who do not want to get vaccinated to continue living as normal. The mandates and the restrictions placed upon the unvaccinated are making this situation impossible. He also pointed out the threat vaccine passports posed to privacy and bodily autonomy.\n\nBut mainstream media outlets did not make this clarification and instead quoted Kennedy referencing Anne Frank’s situation without context. In fact, Kennedy was attacked so heavily that he was forced to apologize.\n\n“I apologize for my reference to Anne Frank, especially to families that suffered the Holocaust horrors,” he wrote in a tweet. “My intention was to use examples of past barbarism to show the perils from new technologies of control. To the extent my remarks caused hurt, I am truly and deeply sorry.”\n\nDemocrat Rep calls for quarantine to observe those refusing vaccines.\n\nGerman mayor issues decree allowing antivaxx protesters to be SHOT on sight.\n\nBiden poised to ROUND UP anti-vaccine doctors and force them into insane asylums.\n\nBritish media claim “stealth disease,” not COVID-19 vaccines, could kill nearly 200,000 people in UK over the next five years.\n\nDr. Paul Marik: Hospitals are KILLING COVID-19 patients by refusing to give them life-saving medications.\n\nWatch the Feb. 1 episode of “The Highwire” as Del Bigtree sends a message to the manic mainstream media outlets that covered his speech during the rally.\n\nThis video is from The Highwire with Del Bigtree channel on Brighteon.com.\n\nFor more on mainstream media’s deceit, check out Journalism.news.", "opengraph": {"title": "Mainstream media attacks health freedom advocates for comparing vaccine mandates to Holocaust", "type": "article", "url": "https://www.mediafactwatch.com/2022-02-03-mainstream-media-attacks-health-freedom-advocates.html", "site_name": "Media Fact Watch Com", "description": "Del Bigtree, television producer and host of “The Highwire,” is being attacked by the media for comparing Wuhan coronavirus (COVID-19) vaccine mandates to the Holocaust. Instead of worrying, Bigtree is celebrating because the attacks prove that he was right. On Jan. 23, Bigtree spoke to a group of approximately 40,000 people in Washington, D.C. as […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2022/02/mainstream-media-1.jpg"}, "tags": ["conspiracy", "covid-19", "Robert F. Kennedy Jr.", "mainstream media", "Journalism", "deception", "the highwire", "vaccine mandate", "vaccines", "Del Bigtree", "disinfo", "lies", "news cartels", "Defeat the Mandates", "traitors", "Holocaust", "propaganda", "Government Slaves"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/d4d629e2-a2b5-4fd4-b94f-cea7f1df0c1f", "http://medicalcensorship.com", "https://naturalnews.com/2022-01-31-government-vaxx-agents-reclassified-as-enemy-combatants.html", "https://nypost.com/2022/01/23/rfk-jr-compares-pandemic-mandates-to-nazi-germany/", "https://www.timesofisrael.com/rfk-jr-utilizes-holocaust-analogy-in-speech-to-dc-anti-vaccine-rally/", "https://twitter.com/RobertKennedyJr/status/1485996202097262594", "https://medicaltyranny.com/2022-02-01-democrat-rep-calls-for-quarantine.html", "https://obey.news/2022-02-01-german-mayor-decree-allows-shooting-antivaxx-protesters.html", "https://fascism.news/2022-01-31-biden-round-up-anti-vaccine-doctors-asylums.html", "https://vaccines.news/2022-01-29-british-media-stealth-disease-covid-vaccines.html", "https://medicalviolence.com/2022-01-28-hospitals-deliberately-killing-covid-patients.html", "https://www.brighteon.com/d4d629e2-a2b5-4fd4-b94f-cea7f1df0c1f", "https://www.brighteon.com/channels/highwire", "https://www.brighteon.com/channels/highwire", "https://www.brighteon.com/channels/highwire", "https://journalism.news/", "https://www.brighteon.com/d4d629e2-a2b5-4fd4-b94f-cea7f1df0c1f", "https://nypost.com/2022/01/23/rfk-jr-compares-pandemic-mandates-to-nazi-germany/", "https://www.timesofisrael.com/rfk-jr-utilizes-holocaust-analogy-in-speech-to-dc-anti-vaccine-rally/", "https://twitter.com/RobertKennedyJr/status/1485996202097262594", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2022-02-03-mainstream-media-attacks-health-freedom-advocates&linkname=Mainstream%20media%20attacks%20health%20freedom%20advocates%20for%20comparing%20vaccine%20mandates%20to%20Holocaust", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}