{"result_id": "195017", "URL": "https://mediafactwatch.com/2023-02-27-pharma-controlled-media-blasts-woody-harrelson-vaccine-truth.html", "timestamp": "2023-04-25 16:18:54 CEST+0200", "meta": {"description": "Actor Woody Harrelson (True Detective, Natural Born Killers) went on “Saturday Night Live” for the fifth time in his career. At the end of his monologue, he took a shot at the vaccine manufacturers — comparing them to drug cartels. “So, the movie goes like this,” Harrelson said. “The biggest drug cartels in the world get […]", "lang": "en", "keywords": "accountability,Big Pharma,body autonomy,brainwashing,Child abuse,comedy,discrimination,distrust of authority,drug cartels,fascism,health freedom,hollywood hater,liberals,lockdowns,mass formation psychosis,medical apartheid,Medical Tyranny,medical violence,Mental illness,propaganda,repentance,SNL,vaccine fraud,vaccine mandates,woody harrelson", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2023-02-27-pharma-controlled-media-blasts-woody-harrelson-vaccine-truth.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "Pharma-controlled media blasts Woody Harrelson for telling the truth about vaccines on SNL", "cleaned_text": "Pharma-controlled media blasts Woody Harrelson for telling the truth about vaccines on SNL\n\nActor Woody Harrelson (True Detective, Natural Born Killers) went on “Saturday Night Live” for the fifth time in his career. At the end of his monologue, he took a shot at the vaccine manufacturers — comparing them to drug cartels.\n\n“So, the movie goes like this,” Harrelson said. “The biggest drug cartels in the world get together and buy up all the media and all the politicians and force all the people in the world to stay locked in their homes.”\n\n“And people can only come out if they take the cartel’s drugs and keep taking them over and over,” Harrelson added. “I threw the script away. I mean, who was going to believe that crazy idea? Being forced to do drugs? I do that voluntarily all day long!”\n\nHarrelson comes under fire for calling out the bought-off media and the drug cartels\n\nHarrelson came under fire for his joke about the media and politicians doing the dirty work of the drug cartels (vaccine makers). Harrelson isn’t afraid to speak up about vaccine mandates and lockdowns, even in a Hollywood culture that promoted this hell from day one. Harrelson broke from the Saturday Night Live–approved script and called out the drug cartels that have taken over the media and made puppets out of the politicians.\n\nOf course, the bought-off media was furious at his joke, and pundits were quick to prove the comedian’s point. After the joke went viral, the mainstream media went on full attack mode, resorting to medical Apartheid slurs like “antivaxxer” to describe the actor. Funny enough, shaming people as “antivaxxers” has lost its appeal over the past two years, as the majority of the population has come to question the never-ending hell of covid-19 boosters, mandates, and restrictions. The medial mafia will need to come up with a new word, a new tactic; the shaming of “antivaxxers” has failed.\n\nSome liberals are starting to recognize the hell they inflicted on themselves and their neighbors\n\nWhile full accountability for lockdowns, human rights abuses, and deadly vaccines will take some time to realize, there is a shift of mindset taking place for some of the authoritarian liberals who advocated for lockdowns and forced injections.\n\nOne Twitter user pointed out: “People don’t seem to understand, Woody Harrelson is what liberals used to be.” Hopefully soon, it will be trendy again for liberals to question Big Pharma. While liberals typically tout “my body, my choice,” they unilaterally didn’t stand up for body autonomy rights during the covid-19 scandal. This is because they have always actually been about “your body, my choice.” This is true when it comes to killing innocent babies, when it comes to confusing someone else’s child about their gender and leading them to a life of self-mutilation, or when it comes to abusing someone else’s child with forced masks, forced swabs, and forced injections.\n\nDuring the covid-19 scandal, the Democratic Party and its compliant simps unilaterally fought for lockdowns, segregation, loss of medical privacy, the shredding of the U.S. Constitution, the family separation in hospitals, forced gene-altering vaccines, forced oxygen restriction, school closures, and mass mental illness (social distancing). Many liberally-minded people are starting to come out of that cult, that mass formation psychosis. Still, it’s hard for these types of people to forgive themselves for the pain they inflicted on their own body and mind, for the hell they tried to force onto their neighbors, family, and friends. Many have committed suicide, overdosed on drugs, or died suddenly and unexpectedly from heart complications and blood clots caused by their false savior.\n\nThe drug cartels will not be held accountable for mass murder and abuse of human rights unless those who complied with the brainwashing and terror actually repent, actually turn from their ways, and join the brave ones who have fought courageously against this hell from the beginning.", "opengraph": {"title": "Pharma-controlled media blasts Woody Harrelson for telling the truth about vaccines on SNL", "type": "article", "url": "https://www.mediafactwatch.com/2023-02-27-pharma-controlled-media-blasts-woody-harrelson-vaccine-truth.html", "site_name": "Media Fact Watch Com", "description": "Actor Woody Harrelson (True Detective, Natural Born Killers) went on “Saturday Night Live” for the fifth time in his career. At the end of his monologue, he took a shot at the vaccine manufacturers — comparing them to drug cartels. “So, the movie goes like this,” Harrelson said. “The biggest drug cartels in the world get […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2023/02/Coronavirus-Covid-19-Big-Pharma-Vaccine-Logos.jpg"}, "tags": ["Big Pharma", "body autonomy", "medical violence", "hollywood hater", "discrimination", "Mental illness", "drug cartels", "SNL", "accountability", "Child abuse", "health freedom", "propaganda", "comedy", "liberals", "vaccine mandates", "Medical Tyranny", "vaccine fraud", "woody harrelson", "repentance", "fascism", "medical apartheid", "distrust of authority", "brainwashing", "lockdowns", "mass formation psychosis"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/entertainment/2023/02/26/woody-harrelson-attacked-for-joke-about-vaccine-mandates-big-pharma-on-saturday-night-live/", "https://www.rollingstone.com/tv-movies/tv-movie-recaps/woody-harrelson-snl-monologue-anti-vax-rant-conspiracy-theory-1234686880/", "https://www.latimes.com/entertainment-arts/tv/story/2023-02-26/woody-harrelson-snl-monologue-anti-vax-covid-19", "https://twitter.com/BridgetPhetasy/status/1629714128481976322?s=20", "http://vaccines.news", "https://www.breitbart.com/entertainment/2023/02/26/woody-harrelson-attacked-for-joke-about-vaccine-mandates-big-pharma-on-saturday-night-live/", "https://www.rollingstone.com/tv-movies/tv-movie-recaps/woody-harrelson-snl-monologue-anti-vax-rant-conspiracy-theory-1234686880/", "https://www.latimes.com/entertainment-arts/tv/story/2023-02-26/woody-harrelson-snl-monologue-anti-vax-covid-19", "https://twitter.com/BridgetPhetasy/status/1629714128481976322?s=20", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2023-02-27-pharma-controlled-media-blasts-woody-harrelson-vaccine-truth&linkname=Pharma-controlled%20media%20blasts%20Woody%20Harrelson%20for%20telling%20the%20truth%20about%20vaccines%20on%20SNL", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}