{"result_id": "195041", "URL": "https://mediafactwatch.com/2022-03-08-government-paid-media-companies-advertise-covid-vaccines.html", "timestamp": "2023-04-25 16:19:09 CEST+0200", "meta": {"description": "In response to a FOIA request filed by TheBlaze, HHS revealed that it purchased advertising from major news networks including ABC, CBS, and NBC, as well as cable TV news stations Fox News, CNN, and MSNBC, legacy media publications including the New York Post, the Los Angeles Times, and the Washington Post, digital media companies […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,conspiracy,corruption,COVID,deception,disinfo,fake news,Journalism,mainstream media,mind control,news cartels,pandemic,propaganda,vaccine,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2022-03-08-government-paid-media-companies-advertise-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "Exclusive: The federal government paid hundreds of media companies to advertise the COVID-19 vaccines while those same outlets provided positive coverage of the vaccines", "cleaned_text": "Exclusive: The federal government paid hundreds of media companies to advertise the COVID-19 vaccines while those same outlets provided positive coverage of the vaccines\n\nIn response to a FOIA request filed by TheBlaze, HHS revealed that it purchased advertising from major news networks including ABC, CBS, and NBC, as well as cable TV news stations Fox News, CNN, and MSNBC, legacy media publications including the New York Post, the Los Angeles Times, and the Washington Post, digital media companies like BuzzFeed News and Newsmax, and hundreds of local newspapers and TV stations. These outlets were collectively responsible for publishing countless articles and video segments regarding the vaccine that were nearly uniformly positive about the vaccine in terms of both its efficacy and safety.\n\nHundreds of news organizations were paid by the federal government to advertise for the vaccines as part of a “comprehensive media campaign,” according to documents TheBlaze obtained from the Department of Health and Human Services. The Biden administration purchased ads on TV, radio, in print, and on social media to build vaccine confidence, timing this effort with the increasing availability of the vaccines. The government also relied on earned media featuring “influencers” from “communities hit hard by COVID-19” and “experts” like White House chief medical adviser Dr. Anthony Fauci and other academics to be interviewed and promote vaccination in the news.\n\nThough virtually all of these newsrooms produced stories covering the COVID-19 vaccines, the taxpayer dollars flowing to their companies were not disclosed to audiences in news reports, since common practice dictates that editorial teams operate independently of media advertising departments and news teams felt no need to make the disclosure, as some publications reached for comment explained.\n\nThe Biden administration engaged in a massive campaign to educate the public and promote vaccination as the best way to prevent serious illness or death from COVID-19.\n\nCongress appropriated $1 billion in fiscal year 2021 for the secretary of health to spend on activities to “strengthen vaccine confidence in the United States.” Federal law authorizes HHS to act through the U.S. Centers for Disease Control and Prevention and other agencies to award contracts to public and private entities to “carry out a national, evidence-based campaign to increase awareness and knowledge of the safety and effectiveness of vaccines for the prevention and control of diseases, combat misinformation about vaccines, and disseminate scientific and evidence-based vaccine-related information, with the goal of increasing rates of vaccination across all ages … to reduce and eliminate vaccine-preventable diseases.”\n\nAnyone who has spent time reading the news, watching TV news coverage, or browsing social media in the past year has more than likely been exposed to the government’s advertising. HHS ads posted to YouTube have been viewed millions of times and commercials featuring celebrities like singer Sir Elton John and actor Sir Michael Caine have been the subject of news coverage, such as this feature from NBC News:\n\n“Fear-based vaccine ads” from HHS featuring “survivor” stories from coronavirus patients who were hospitalized in intensive care units were covered by CNN and discussed on ABC’s “The View” when they were unveiled last October.\n\nThough the federal government was paying each of these companies and others for pro-vaccine advertising while news reports covered the same vaccines, many editorial boards say they have firewall policies that prevent advertisers from influencing news coverage.\n\n“Advertisers pay for space to share their messages, as was the case here, and those ads are clearly labeled as such,” explained Shani George, vice president of communications for the Washington Post, in a statement. “The newsroom is completely independent from the advertising department,” she said.\n\nA spokeswoman for the Los Angeles Times gave a similar statement, emphasizing that the “newsroom operates independently from advertising.”\n\nTheBlaze reached out to several other publications that either declined to comment or did not respond before publication.\n\nThe COVID-19 Public Education Campaign by HHS also used earned media outreach — word of mouth marketing — with the goal of having “trusted messengers and influencers” speak to news organizations to “provide factual, timely information and steps people can take to protect themselves, their families, and their communities.”\n\nAs a result of that effort, various government officials have frequently been quoted by reporters covering the COVID-19 pandemic, offering factual information on vaccine efficacy and safety. An October article from BuzzFeed News featuring the “essential facts” about who is eligible for a COVID-19 booster shot, for example, reported pro-vaccine statements from CDC director Rochelle Walensky, FDA official Peter Marks, HHS Secretary Xavier Becerra, and University of California, San Francisco epidemiologist George Rutherford.\n\nThe article stressed how studies show “boosters work” and cited FDA data that suggests getting a booster shot “can reestablish strong protection against the virus.” BuzzFeed News advised everyone age 65 or older, people with health conditions that put them at high risk of severe illness from COVID-19, those like healthcare workers who are at risk from coming into contact with COVID-19 positive people for work, and anyone in areas with high virus transmission to get vaccine boosters, in accordance with guidance from the CDC.\n\nOther publications, such as the Los Angeles Times, featured advice from experts on how readers could convince vaccine-hesitant people in their lives to change their minds. The Washington Post covered “the pro-vaccine messages people want to hear.” Newsmax has reported how the vaccines have “been demonstrated to be safe and effective” and “encouraged citizens, especially those at risk, to get immunized.”\n\nHHS did not immediately respond when asked if the agency used taxpayer dollars to pay for people to be interviewed, or for a PR firm to place them in interviews with news outlets.\n\nSince the COVID-19 vaccines manufactured by Pfizer-BioNTech, Moderna, and Johnson & Johnson were given emergency approval for use in the United States last year, more than 215 million Americans have been fully vaccinated against COVID-19. An estimated 94.6 million people have also received at least one booster dose. About 65% of the U.S. population has now been fully vaccinated against COVID-19, including 75% of U.S. adults and 88.8% of seniors.\n\nHHS has not yet revealed how much advertising money was spent on each media platform.", "opengraph": {"title": "Exclusive: The federal government paid hundreds of media companies to advertise the COVID-19 vaccines while those same outlets provided positive coverage of the vaccines", "type": "article", "url": "https://www.mediafactwatch.com/2022-03-08-government-paid-media-companies-advertise-covid-vaccines.html", "site_name": "Media Fact Watch Com", "description": "In response to a FOIA request filed by TheBlaze, HHS revealed that it purchased advertising from major news networks including ABC, CBS, and NBC, as well as cable TV news stations Fox News, CNN, and MSNBC, legacy media publications including the New York Post, the Los Angeles Times, and the Washington Post, digital media companies […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2022/03/Bribery-Corrupt-Payment-Businessman-Money-Bad-Banknote.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "fake news", "vaccine wars", "mainstream media", "Journalism", "COVID", "vaccine", "deception", "mind control", "disinfo", "corruption", "news cartels", "propaganda"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/O0-PaP4RhFQ\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/O0-PaP4RhFQ"}], "links": ["https://www.theblaze.com/news/review-the-federal-government-paid-media-companies-to-advertise-for-the-vaccines#toggle-gdpr", "https://wecandothis.hhs.gov/resource/we-can-do-campaign-background", "https://www.google.com/url?q=https://www.congress.gov/bill/117th-congress/house-bill/1319/text&sa=D&source=docs&ust=1646332860260625&usg=AOvVaw1AGbdYzEL78m9POfm84Bhq", "https://www.congress.gov/bill/116th-congress/house-bill/133/text", "https://www.youtube.com/watch?v=R55xCAIHS0M&ab_channel=U.S.DepartmentofHealthandHumanServices", "https://www.cnn.com/2021/10/06/health/hhs-vaccination-ads-fear/index.html", "https://www.youtube.com/watch?v=IOpiNvnN1k4&ab_channel=TheView", "https://www.buzzfeednews.com/article/theresatamkins/covid-vaccine-boosters", "https://www.nature.com/articles/s41591-021-01377-8", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "https://www.latimes.com/science/story/2021-05-17/tips-how-to-convince-someone-to-get-vaccinated", "https://www.washingtonpost.com/health/interactive/2021/covid-vaccine-messages/", "https://www.newsmax.com/newsfront/vaccine-mandates-constitution-overreach-privacy/2021/11/07/id/1043635/", "https://www.theblaze.com/news/review-the-federal-government-paid-media-companies-to-advertise-for-the-vaccines#toggle-gdpr", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2022-03-08-government-paid-media-companies-advertise-covid-vaccines&linkname=Exclusive%3A%20The%20federal%20government%20paid%20hundreds%20of%20media%20companies%20to%20advertise%20the%20COVID-19%20vaccines%20while%20those%20same%20outlets%20provided%20positive%20coverage%20of%20the%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}