{"result_id": "195038", "URL": "https://mediafactwatch.com/2020-04-11-fda-ftc-hit-alex-jones-infowars-warnings-coronavirus-silver-speech-tyranny.html", "timestamp": "2023-04-25 16:19:07 CEST+0200", "meta": {"description": "Both the FDA and the FTC are on the warpath, issuing strong warning letters to several companies they say are promoting silver products as treatments or cures for coronavirus (covid-19). In just the last two days, both InfoWars (Free Speech Systems, LLC) and Genesis II Church of Health and Healing have been hit with strong […]", "lang": "en", "keywords": "Alex Jones,Big Pharma,coronavirus,covid-19,FDA,ftc,InfoWars,marketing claims,silver,warning letters", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2020-04-11-fda-ftc-hit-alex-jones-infowars-warnings-coronavirus-silver-speech-tyranny.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "FDA, FTC hit Alex Jones (InfoWars) with warnings over coronavirus claims related to silver products… is it time to challenge the FDA’s speech tyranny?", "cleaned_text": "FDA, FTC hit Alex Jones (InfoWars) with warnings over coronavirus claims related to silver products… is it time to challenge the FDA’s speech tyranny?\n\nBoth the FDA and the FTC are on the warpath, issuing strong warning letters to several companies they say are promoting silver products as treatments or cures for coronavirus (covid-19).\n\nIn just the last two days, both InfoWars (Free Speech Systems, LLC) and Genesis II Church of Health and Healing have been hit with strong warning letters that demand they stop making coronavirus treatment claims for their products. In the case of InfoWars, the products are silver-based consumer health products such as toothpaste and mouthwash. For Genesis II Church of Health, the product is “MMS” (chlorine dioxide).\n\nIn both cases, the FDA has teamed up with the FTC to issue these letters, underscoring the intensity of their effort to try to halt the sales of products that don’t enrich Big Pharma.\n\nHere’s the FDA link for the letter to InfoWars.\n\n And here’s the FDA link for the letter to Genesis II Church of Health and Healing.\n\nThe FDA letter to Alex Jones / Free Speech Systems shows that the FDA has been monitoring InfoWars’ broadcast videos, looking for speech that could be categorized as a “violation” of FDA regulations. For example, they cite a video from March 10th where the FDA claims Alex states the following (which clearly they have edited, possibly out of context):\n\nI’m not going to belabor this, I’m just gonna tell ya, that for just your daily life, and your gums and your teeth and for regular viruses and bacteria, the patented Nano Silver we have, the Pentagon has come out and documented, and homeland security have said this stuff kills the whole SARS corona family, at point blank range. Well of course it does, it kills every virus. But they found that, this is 13 years ago, and the Pentagon uses the product we have. And the product we have in private label is about to be in Walmart . . . the Nano Silver toothpaste in the Superblue with the tea tree and the iodine, that’s the Superblue’s amazing, and we have the whitening toothpaste that has the Nano Silver and a lot more as well . . .they are at infowarsstore.com\n\nThe FDA further warns that it may seize InfoWars products or seek court injunctions against Alex Jones continuing to sell those products.\n\nAs Alex Jones points out in this Banned.video video, many other popular retailers sell the exact same products. The difference, though, is that Alex accompanies the sales of such products with language about the coronavirus that the FDA sees as making “fraudulent claims.” As I mentioned earlier, it’s not illegal to sell silver products, as long as no treatment or cure claims accompany the marketing of those products.\n\nIn the past, we’ve seen the FTC engage in even more draconian measures than what the FDA is now threatening, including seizing all customer databases, seizing office computers, seizing product inventory and even forcing companies to refund all the customers who ever bought the products in question.\n\nNot illegal to sell silver, but FDA claims no retailer can accurately describe silver’s benefits\n\nThese regulatory threats are raising questions of why the FDA and FTC claim the right to suppress truthful free speech when no law passed by Congress has granted the FDA or the FTC power to supersede the First Amendment. If speech about nutritional supplements is truthful, why is it “illegal” under FDA rules which are self-written and subject to no oversight by Congress or the voters?\n\nNotably, it is not illegal to sell silver-based products in the United States, as silver is used in popular bandage products and is well recognized as having antibacterial properties when used topically. It is, however, a violation of the FDA’s slanted interpretation of rules to sell silver products along with claims that they treat covid-19. When that occurs, the FDA says the seller is making “fraudulent” health claims or selling “unapproved drugs,” even when the seller never claimed they were drugs.\n\nRemember: The FDA still claims there is no such thing as a vitamin, mineral, food or nutrient that can prevent or cure any disease. That’s absurd when we all know, for example, that scurvy is a disease of vitamin C deficiency and can be cured with vitamin C. Similarly, a disease known as “rickets” is caused by a vitamin D deficiency and can be cured with vitamin D. Yet such claims are never allowed to be made by those who are marketing such nutritional solutions alongside those truthful claims.\n\nAs we have repeatedly pointed out in our own articles, nothing has yet been clinically tested to treat, prevent or cure Wuhan coronavirus infections or covid-19. No drugs, no vaccines, no herbs, no molecules, no substances, etc. There are many promising candidates for such treatments, including hydroxychloroquine, zinc and various vitamins, which is why we’ve called for urgent studies and clinical trials to be conducted so that we can all find out what works. But so far, nothing has been proven to work.\n\nYet to this day, virtually the entire medical industry and pharma-funded corporate media routinely claim a coronavirus vaccine will be a cure, even when no such vaccine even exists. No clinical trials have been conducted whatsoever, yet the entire establishment repeatedly claims a coronavirus will be safe and effective despite the lack of a single shred of evidence to support such claims.\n\nCNN, which is largely funded by Big Pharma and therefore has direct financial ties to the vaccine industry, hasn’t receive a warning letter from the FDA or FTC to stop making unproven marketing claims about a future coronavirus vaccine. Nor has MCNBC or, for that matter, Dr. Fauci himself. Why isn’t Bill Gates receiving warning letters for making false claims about vaccines that stand to generate a windfall of profits for his various companies and organizations? The answer is that no vaccine exists yet and therefore vaccine propagandists are allowed to make whatever unscientific, unproven claims they wish, without any limits. They are “pre-selling” the coronavirus vaccine with lies and fraudulent claims, yet the FDA is silent. (In truth, the vaccine might actually be more deadly than the coronavirus itself. All attempts at making a SARS vaccine, for example, were a disaster that resulted in mass fatalities of the animal test subjects.)\n\nThe truth is, both the FDA and FTC have no limits on the wild, quack science claims that are routinely made about vaccines, even when such vaccine efforts rake in billions of dollars in grant money and retail profits. Vaccines are never subjected to the same regulatory scrutiny as vitamin C, even though vitamin C is a safe, natural substance while vaccines are artificial concoctions laced with neurotoxins such as MSG, formaldehyde, aluminum and even mercury in certain cases.\n\nWhen it comes to scientific evidence supporting nutritional supplements, there will never be large-scale clinical trials of vitamins, minerals or natural substances such as silver, since those products don’t enrich the Big Pharma drug cartels that essentially control the FDA. The FDA is not a neutral party in all this; they represent the financial interests of the pharmaceutical industry, and they deliberately set very high financial barriers for clinical trials that prohibit smaller companies from being able to fund them.\n\nThe far bigger fraud is Big Pharma and the vaccine industry\n\nWhat’s my take on all this? I think it’s wrong for anyone to state that their products can treat or cure covid-19, given that no such research has been conducted or concluded. At the same time, both the FDA and FTC allow drug makers and vaccine makers to make outrageously false and misleading claims for their own products that are based on cherry-picked, “rigged” science that’s funded and shaped by the drug companies themselves.\n\nFor the FDA and FTC to accuse anyone else of engaging in fraudulent practices, they first need to examine the Big Pharma frauds that are far more dangerous to society (and that literally kill 100,000+ Americans each year).\n\nIf the FDA really wanted to protect the public from dangerous products, it would ban statin drugs or halt the use of dangerous levels of aluminum and mercury in vaccines (especially those given to children). Instead, the priorities of the agency focus on harassing far smaller companies that are selling safe, natural substances that have a long track record of efficacious use.\n\nCan silver products treat or prevent covid-19? We don’t know for certain whether that answer is yes or no, since the clinical trials haven’t been done, but we do know that silver products are incredibly safe when used as directed, and that there isn’t a single known case of a person dying from using silver supplements as directed. That can’t be said about blood pressure medications, diabetes drugs (which cause liver damage) or even over-the-counter acetaminophen (branded as Tylenol, which can cause permanent liver damage in certain circumstances).\n\nThe real problem with fraudulent marketing claims in this country is found in how Big Pharma bankrolls the mainstream media with false and misleading drug ads. And you can bet neither the FDA or the FTC will ever open an investigation into that massive fraud.\n\nThat’s why Trump should issue an executive order banning drug ads to the public. It’s time to stop Big Pharma from buying able to buy off the media and bankroll Big Tech with drug ads.\n\nIn fact, the only reason America is locked down under a quarantine order is because Big Pharma controls the narrative and tells Big Tech to censor anyone talking about nutrition and natural supplements that may, in fact, help halt the spread of this devastating infection. Nutritional deficiencies make people more susceptible to respiratory infections, yet no one is allowed to talk about nutrition vs. the coronavirus without being banned by YouTube, Vimeo, Twitter, Facebook and Google.\n\nAnd that’s because Big Tech has become a Big Pharma gatekeeper that controls all speech, limiting the voices that might impair Big Pharma’s profiteering and indoctrination efforts.\n\nIt looks like Alex Jones is pulling his silver products off the market at this time while his legal team responds to the FDA and FTC. And that’s a shame, because it impairs the ability of the public to acquire substances which may, indeed, have a very practical and very real use in helping America protect public health and get our economy moving again.\n\nDisclaimer: I have previously appeared as a science guest and fill-in host of the InfoWars broadcast. I have no financial ties to InfoWars and have never been paid a single dollar by InfoWars or Alex Jones, and I have no financial ties to the InfoWars Store that sells products. I have used my appearance on the Alex Jones Show to try to educate his audience to wear masks, take care of their health, honor the temporary lockdown orders and use science-backed nutrition to help halt the spread of infectious disease. I strongly disagree with many other guests on the Alex Jones Show who are now insisting that, in their view, the coronavirus is a “hoax” and that all the deaths are being faked. I have publicly denounced once such guest, David Icke, who claims there is no virus that causes covid-19. Nevertheless, I support their right to speak and strongly oppose censorship and regulatory harassment of the independent media.", "opengraph": {"title": "FDA, FTC hit Alex Jones (InfoWars) with warnings over coronavirus claims related to silver products… is it time to challenge the FDA’s speech tyranny?", "type": "article", "url": "https://www.mediafactwatch.com/2020-04-11-fda-ftc-hit-alex-jones-infowars-warnings-coronavirus-silver-speech-tyranny.html", "site_name": "Media Fact Watch Com", "description": "Both the FDA and the FTC are on the warpath, issuing strong warning letters to several companies they say are promoting silver products as treatments or cures for coronavirus (covid-19). In just the last two days, both InfoWars (Free Speech Systems, LLC) and Genesis II Church of Health and Healing have been hit with strong […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2022/05/Mike-Adams-Alex-Jones-special-report-coronavirus-engineered-800.png"}, "tags": ["covid-19", "Big Pharma", "InfoWars", "FDA", "coronavirus", "marketing claims", "Alex Jones", "warning letters", "silver", "ftc"], "tweets": [], "movies": [], "links": ["https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/free-speech-systems-llc-dba-infowarscom-605802-04092020", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-warns-seller-marketing-dangerous-chlorine-dioxide-products-claim", "https://banned.video/watch?id=5e90fcc0320e54001ef8e73e", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2020-04-11-fda-ftc-hit-alex-jones-infowars-warnings-coronavirus-silver-speech-tyranny&linkname=FDA%2C%20FTC%20hit%20Alex%20Jones%20%28InfoWars%29%20with%20warnings%20over%20coronavirus%20claims%20related%20to%20silver%20products%E2%80%A6%20is%20it%20time%20to%20challenge%20the%20FDA%E2%80%99s%20speech%20tyranny%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}