{"result_id": "195047", "URL": "https://mediafactwatch.com/2019-01-12-hypocrisy-ny-times-accuses-netflix-of-cowardice.html", "timestamp": "2023-04-25 16:19:12 CEST+0200", "meta": {"description": "Oh, the hypocrisy of the U.S. mainstream media! Incredibly, some of the industry’s most respected journalists seem blissfully unaware of its double standards. Jim Rutenberg, writing for The New York Times (NYT), recently got on his soapbox good and proper about Netflix’s decision not to air an episode of the comedy show Patriot Act, which […]", "lang": "en", "keywords": "Anti-Cyber Crime Law,Censorship,deception,Fact Check,First Amendment,free speech,hypocrisy,Journalist,Netflix,New York Times,NY Times,Saudi Arabia,speech police,thought control", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2019-01-12-hypocrisy-ny-times-accuses-netflix-of-cowardice.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "NY Times, which censors the truth about vaccines and GMOs, accuses Netflix of “cowardice” for censoring show about Saudi Arabia", "cleaned_text": "NY Times, which censors the truth about vaccines and GMOs, accuses Netflix of “cowardice” for censoring show about Saudi Arabia\n\nOh, the hypocrisy of the U.S. mainstream media! Incredibly, some of the industry’s most respected journalists seem blissfully unaware of its double standards. Jim Rutenberg, writing for The New York Times (NYT), recently got on his soapbox good and proper about Netflix’s decision not to air an episode of the comedy show Patriot Act, which was critical of Saudi Arabia’s Crown Prince Mohammed bin Salman. His concerns about first amendment infringement and freedom of political expression are certainly valid, but people in glass houses shouldn’t throw stones, and the NYT is notorious for its own censorship of issues surrounding vaccines and genetically modified organisms (GMOs).\n\nThe thing about free speech is it doesn’t discriminate. That’s the whole point: It’s not about what one person, organization or government believes; it’s about allowing the free expression of all points of view, even those you don’t agree with. So, while the powers-that-be at the NYT might truly believe that GMOs are safe and everybody should be vaccinated, that doesn’t give them the right to censor articles dealing with those subjects. The Saudi government fervently believed it was in the right when it put pressure on Netflix to pull the controversial Patriot Act episode, too. But that’s because theirs is an authoritarian government that strictly controls what people may view and say. What’s the NYT’s excuse?\n\nWhat’s all the fuss about?\n\nNetflix has been airing the show Patriot Act with Hasan Minhaj since October 2018. The series is described as “no-holds-barred comedy” featuring many well-known comedians.\n\nLate last year, the Saudi government contacted Netflix with a complaint about an episode in which Minhaj criticized Crown Prince Mohammed bin Salman for ordering the death of reporter Jamal Khashoggi, who wrote columns critical of the prince for The Washington Post. In the show, Minhaj also criticized Saudi’s record of war crimes in Yemen.\n\nThe Saudi government referenced Article 6, Paragraph 1 of its Anti-Cyber Crime Law, which notes that the “production, preparation, transmission, or storage of material impinging on public order, religious values, public morals, and privacy, through the information network or computers,” is punishable by up to five years in prison.\n\nNetflix then pulled that episode from its Saudi feed, stating it was doing so in accordance with “a valid legal request.” The episode continued to air in other countries and remained available on YouTube for Saudis who wished to view it. Nonetheless, Netflix certainly did not make any kind of attempt to stand up for free speech in a country where journalists and critics in general are under increased threat from the government. (Related: New York Times retroactively swaps documents to rig climate change article.)\n\nRutenberg was scathing in his denunciation of Netflix and other international media giants:\n\n[E]ach small step for dictatorial crackdowns abetted by American leaders — be they in politics or business — is one giant leap for the forces that are now so successfully stanching free expression and dissent across the world. …\n\nIncreasingly, it seems, profit, expansion and perhaps a wee bit of cowardice are trumping the very principles that made the United States entertainment and news industries what they are — and that made a Netflix possible in the first place. …\n\nThe media behemoths would be wise to remember that their future growth will rely on having the same liberties that fostered their creation. (Related: Censorship is how those in charge control public discourse – and we allow it by not educating ourselves about the facts.)\n\nThese sentiments are certainly valid and international media and entertainment moguls would do well to heed Rutenberg’s remarks. Nonetheless, it’s difficult to take his message seriously when his own publication is guilty of the exact crime for which he is attacking Netflix: Censorship of sensitive subjects to please the government and big business. If you’re going to yell, “free speech” you better make sure your own organization is doing its utmost to protect it.", "opengraph": {"title": "NY Times, which censors the truth about vaccines and GMOs, accuses Netflix of “cowardice” for censoring show about Saudi Arabia", "type": "article", "url": "https://www.mediafactwatch.com/2019-01-12-hypocrisy-ny-times-accuses-netflix-of-cowardice.html", "site_name": "Media Fact Watch Com", "description": "Oh, the hypocrisy of the U.S. mainstream media! Incredibly, some of the industry’s most respected journalists seem blissfully unaware of its double standards. Jim Rutenberg, writing for The New York Times (NYT), recently got on his soapbox good and proper about Netflix’s decision not to air an episode of the comedy show Patriot Act, which […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2019/01/Lips-Black-Censorship-Isolated-Adult-Angry-Attractive.jpg"}, "tags": ["Fact Check", "Journalist", "Netflix", "Anti-Cyber Crime Law", "speech police", "hypocrisy", "Censorship", "deception", "New York Times", "thought control", "First Amendment", "free speech", "NY Times", "Saudi Arabia"], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/2019/01/06/business/media/netflix-saudi-arabia-censorship-hasan-minhaj.html", "https://www.breitbart.com/entertainment/2019/01/07/nyt-slams-netflix-cowardice-for-blocking-patriot-act-episode-in-saudi-arabia/", "https://www.naturalnews.com/2017-08-14-new-york-times-retroactively-swaps-documents-to-rig-climate-change-article.html", "https://www.naturalnews.com/2018-03-31-censorship-is-how-those-in-charge-control-public-discourse.html", "http://censored.news/", "https://www.breitbart.com/entertainment/2019/01/07/nyt-slams-netflix-cowardice-for-blocking-patriot-act-episode-in-saudi-arabia/", "https://www.nytimes.com/2019/01/06/business/media/netflix-saudi-arabia-censorship-hasan-minhaj.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2019-01-12-hypocrisy-ny-times-accuses-netflix-of-cowardice&linkname=NY%20Times%2C%20which%20censors%20the%20truth%20about%20vaccines%20and%20GMOs%2C%20accuses%20Netflix%20of%20%E2%80%9Ccowardice%E2%80%9D%20for%20censoring%20show%20about%20Saudi%20Arabia", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}