{"result_id": "195027", "URL": "https://mediafactwatch.com/2021-08-18-mainstream-media-and-government-purposely-broke-promises-covid.html", "timestamp": "2023-04-25 16:19:00 CEST+0200", "meta": {"description": "Over the past decade, the mainstream media has eradicated almost every real investigative journalist, and now these networks amplify scripted narratives to advance specific agendas. The mainstream media has become an echo chamber of absurdity — a tool of propaganda used to exploit human psychology. This psychological warfare has never been more obvious over the […]", "lang": "en", "keywords": "badhealth,badmedicine,Broken Promises,disinfo,gaslighting,lies,mainstream media,manipulation,mask mandates,Medical Tyranny,narrative,pandemic,population control,propaganda,terror,Vaccine Holocaust,vaccine mandates", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2021-08-18-mainstream-media-and-government-purposely-broke-promises-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "Mainstream media and government PURPOSELY broke promises on vaccines, herd immunity and “getting back to normal” to achieve population control", "cleaned_text": "Mainstream media and government PURPOSELY broke promises on vaccines, herd immunity and “getting back to normal” to achieve population control\n\nOver the past decade, the mainstream media has eradicated almost every real investigative journalist, and now these networks amplify scripted narratives to advance specific agendas. The mainstream media has become an echo chamber of absurdity — a tool of propaganda used to exploit human psychology. This psychological warfare has never been more obvious over the past two years, as lies and human rights abuses are normalized and celebrated.\n\nEvery single promise regarding masks, human restrictions, vaccines, mandates, herd immunity and “getting back to normal” was broken PURPOSELY by the mainstream media and the government experts, because manipulating human thought and behavior is of utmost importance for controlling the population.\n\nIn 2020, governors across the Democratic Party, and a few in the Republican Party, said life would “not go back to normal” until a vaccine was made widely available. This totalitarian threat was hyped by the media, and turned out to be a broken promise. These same government authorities now disregard the science on natural immunity, and think they can MANDATE deadly inoculations, while segregating people and starving those who don’t comply. Just months ago, the abusers and controllers told us, “It’s time to heal,” but now they want to take away basic civil liberties, the right to work, the right to travel and buy groceries. This is exactly how narcissistic abusive relationship work.\n\nAt the beginning of the year, the Biden regime promised “100 days of masking to end covid-19.” Mask mandates were enforced across the country and the government and media mockingly promised “freedom for Americans by July 4th” if they followed all the restrictions. The head of the federal coronavirus task force, Dr. Anthony Fauci, even said two masks are better than one, while demanding that Americans get inoculated with experimental vaccines. These promises of freedom were broken after July 4th, as mask mandates were kept in place at the federal and corporate level and are still being used as a tool to force vaccination. The government and the media even broke their promise to the vaccinated and instructed them to wear masks again, after promising that the vaccines would save their life.\n\nJust months ago, the media said COVID was behind us thanks to the life-saving vaccines. The public health experts and the reporters said the United States would quickly go back to normal as the vaccines were rolled out en masse. The media praised Israel and Great Britain for rolling out vaccine passports and getting most of their population vaccinated. The mainstream headlines celebrated the vaccines for ending the “pandemic.”\n• “Vaccine Rollout Gives U.K. a Rare Win in the Pandemic,” the New York Times wrote on January 29.\n• “When will the pandemic end?” Bloomberg asked on February 4. “The answer can be measured in vaccinations.”\n• “What life is like in countries where Covid-19 vaccination is increasingly a success,” CNN added on February 25.\n\nBut after the mass vaccine rollout, Israel, the UK and a slew of other highly vaccinated countries have seen a new spike in sickness and hospitalization in the fully vaccinated, with new lock downs and vaccine mandates ushered into place. Regardless of this somber reality, the Biden regime has been communicating with the CEOs of major companies, colleges, banks, etc. to implement illegal vaccine mandates on employees across the country. Tyrannical governors are creating discriminatory vaccine passports to segregate the unvaccinated from everyday life. Meanwhile, the media, the FDA and the CDC have been working overtime to change the diagnostic criteria (CT cycles of the PCR tests) for covid-19 only in vaccinated people, to coverup the number of covid cases and adverse events being reported following vaccination. Yet, tens of thousands of people have died from adverse events or from covid after being fully vaccinated, and this may be the most disturbing broken promise of them all.\n\nBroken promises on herd immunity and the end of the “pandemic”\n\nAfter declaring the pandemic over, the media now says the pandemic is roaring back again thanks to the “unvaccinated.” Healthcare professionals who chose not to vaccinate are being threatened, fired or forced to quit, even though hospital bed capacity is supposed to be in dire straights due to the “pandemic of the unvaccinated.”\n\nThis sudden social ostracizing of the unvaccinated is peculiar because it contradicts the narrative from early in the year, which promised the population could reach “herd immunity” by May with the current vaccination rates. On February 20, the New York Times used graphics showing that the US would reach “herd immunity” by May. The article promised that major outbreaks would not occur after May 20, because enough people would be vaccinated, curbing the spread significantly. On that date, more than 135 million Americans had been “fully vaccinated” meeting the 40 percent threshold the Times said was needed to eradicate covid-19. But today, the country is plagued by the “Delta variant” which is counted as part of the “covid-19 pandemic.”\n\nDespite there being no accurate test for covid-19 or the new delta variant, everyone is supposed to just believe we’re living in a pandemic caused by the unvaccinated. This is far from the truth because hundreds of thousands of vaccinated people report hospitalization and sickness post vaccination, and “breakthrough covid cases” are sickening and killing the fully vaccinated. This is why the same lying media and deceptive public health authorities are calling for “booster shots.” They know that everything they have said, recommended and forced is FRAUD, but they continue to blame their failures on the healthy, unmasked, unvaccinated and unafraid people who are immune and fighting for their freedom.", "opengraph": {"title": "Mainstream media and government PURPOSELY broke promises on vaccines, herd immunity and “getting back to normal” to achieve population control", "type": "article", "url": "https://www.mediafactwatch.com/2021-08-18-mainstream-media-and-government-purposely-broke-promises-covid.html", "site_name": "Media Fact Watch Com", "description": "Over the past decade, the mainstream media has eradicated almost every real investigative journalist, and now these networks amplify scripted narratives to advance specific agendas. The mainstream media has become an echo chamber of absurdity — a tool of propaganda used to exploit human psychology. This psychological warfare has never been more obvious over the […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2021/08/mainstream-media.jpg"}, "tags": ["pandemic", "manipulation", "mask mandates", "mainstream media", "narrative", "vaccine mandates", "Medical Tyranny", "terror", "gaslighting", "disinfo", "lies", "Vaccine Holocaust", "Broken Promises", "propaganda", "population control"], "tweets": [], "movies": [], "links": ["https://alexberenson.substack.com/p/gaslighting-a-covid-love-story", "https://www.naturalnews.com/2021-07-29-natural-immunity-to-covid-is-comprehensive-durable.html", "https://time.com/5908983/president-elect-joe-biden-vows-to-usher-in-a-time-to-heal-in-america/", "https://www.naturalnews.com/2021-08-13-la-officials-to-starve-out-unvaccinated-deny-access-grocery-stores.html", "https://www.cnn.com/2021/01/20/health/biden-first-day-health-executive/index.html", "https://apnews.com/article/government-and-politics-joe-biden-lifestyle-coronavirus-pandemic-health-f97e0316c51d2d8362a17d149daedb14", "http://lies.news", "https://www.naturalnews.com/2021-08-11-95-severe-patients-israeli-hospitals-are-vaccinated.html", "https://www.naturalnews.com/2021-05-24-cdc-alters-testing-guidelines-artificially-boost-vaccine-efficacy.html", "https://www.naturalnews.com/2021-07-27-vaers-records-covid-19-adverse-events.html", "http://propaganda.news", "http://immunesystem.news", "https://alexberenson.substack.com/p/gaslighting-a-covid-love-story", "https://www.naturalnews.com/2021-07-29-natural-immunity-to-covid-is-comprehensive-durable.html", "https://time.com/5908983/president-elect-joe-biden-vows-to-usher-in-a-time-to-heal-in-america/", "https://www.naturalnews.com/2021-08-13-la-officials-to-starve-out-unvaccinated-deny-access-grocery-stores.html", "https://www.cnn.com/2021/01/20/health/biden-first-day-health-executive/index.html", "https://apnews.com/article/government-and-politics-joe-biden-lifestyle-coronavirus-pandemic-health-f97e0316c51d2d8362a17d149daedb14", "https://www.naturalnews.com/2021-08-11-95-severe-patients-israeli-hospitals-are-vaccinated.html", "https://www.naturalnews.com/2021-05-24-cdc-alters-testing-guidelines-artificially-boost-vaccine-efficacy.html", "https://www.naturalnews.com/2021-07-27-vaers-records-covid-19-adverse-events.html"], "authors": [], "publish_date": null}