{"result_id": "195018", "URL": "https://mediafactwatch.com/2021-07-27-daily-mail-australia-barclay-crawford-ridicule-antivaxxers.html", "timestamp": "2023-04-25 16:18:54 CEST+0200", "meta": {"description": "A leaked video is circulating on alternative social media that exposes Barclay Crawford, editor for the Daily Mail Australia, as a vaccine propagandist who specifically instructed his staff to ridicule “anti-vaxxers” in their articles. The video – watch below – shows Crawford participating in a virtual meeting with staff members, some of whom he is […]", "lang": "en", "keywords": "anti-vaxxers,badhealth,badscience,Barclay Crawford,biased,Big Pharma,coronavirus,COVID,Daily Mail Australia,Journalism,Media Lies,propaganda,ridicule,rigged,smeared,vaccination,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2021-07-27-daily-mail-australia-barclay-crawford-ridicule-antivaxxers.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "Daily Mail Australia editor Barclay Crawford admits to directing his writing staff to ridicule “anti-vaxxers”", "cleaned_text": "Daily Mail Australia editor Barclay Crawford admits to directing his writing staff to ridicule “anti-vaxxers”\n\nA leaked video is circulating on alternative social media that exposes Barclay Crawford, editor for the Daily Mail Australia, as a vaccine propagandist who specifically instructed his staff to ridicule “anti-vaxxers” in their articles.\n\nThe video – watch below – shows Crawford participating in a virtual meeting with staff members, some of whom he is heard congratulating for demonstrating that they already “got it” – meaning they have been doing a good job pushing pro-Wuhan coronavirus (Covid-19) “vaccination” in the paper.\n\n“You’re all champions,” Crawford is heard saying. “We’ll keep trying to run stories that are, um, call out the ‘anti-vax’ weirdos and, and point out why, why we need to get it and why it’s important, you know, and why we don’t want Australia regressing to some, you know, the reason why we have medicine and medical science is for things like this and it’s amazing, and should be celebrated and not run down.”\n\nWe occasionally cite the original United Kingdom version of the Daily Mail Online, which seems to be a mixed bag when it comes to supporting or rejecting vaccination. Oftentimes, Daily Mail commenters are supportive of medical freedom, which Crawford rejects as “people who should know better.”\n\n“And I know you will see a lot of comments on our stories from people who should know better,” Crawford told his staff.\n\n“It’s extraordinary how many, um, uh, intelligent, um, uh, otherwise well-educated people are, are, are spreading this, this disease, really, out there in the community, so it’s just important we keep on top of it.”\n\nBarclay Crawford is an injection shill delivering messages of death to Daily Mail Australia readers\n\nSince many reputable scientists and doctors are opposed to Fauci Flu shots and increasingly speak out against them, Crawford has a plan for that, too: just dismiss their claims.\n\n“Just remember with these stories to always, if we’re doing something that, that is gearing ‘anti-vaxxer’ views, make sure we’re all, also dismissing them in the stories,” Crawford told his staff, expressing a bit of confusion about his approach.\n\n“Is that the right way to put it, dismissing them? Make sure these stories are, um, rubbishing their ridiculous claims.”\n\nCrawford would likely not allow the publishing of a new paper by former National Institute of Health (NIH) scientist J. Bart Classen, which links Chinese Virus injections to Parkinson’s disease and dementia.\n\nBecause of what his science uncovered, Classen would be classified as just another “weirdo” in Crawford’s book. Unless a person is fully on board with Crawford’s unquestioning injection agenda, he or she is just some cook that deserves ridicule and verbal violence.\n\nShould someone you know send you an article from the Daily Mail Australia suggesting that Wuhan Flu shots are “safe” and “effective,” be sure to remind the person that Crawford is not in the business of honest journalism. Instead, he is just another pro-vax weirdo who worships the needle.\n\nOne of the current top stories at the Daily Mail Australia right now is a fearmongering piece that says right in the title: “Do NOT visit grandma” because old people are supposedly catching the new “delta variant” strain of the Chinese Virus – all thanks to the “unvaccinated,” of course.\n\nWe will not link to the site so as to not drive traffic there, but a number of pro-vax articles litter the Daily Mail Australia this morning as governments around the world gear up to push more Trump Vaccines on the world at “warp speed.” As usual, do not listen to them.\n\nThe latest news about Chinese Virus injection propaganda can be found at ChemicalViolence.com.", "opengraph": {"title": "Daily Mail Australia editor Barclay Crawford admits to directing his writing staff to ridicule “anti-vaxxers”", "type": "article", "url": "https://www.mediafactwatch.com/2021-07-27-daily-mail-australia-barclay-crawford-ridicule-antivaxxers.html", "site_name": "Media Fact Watch Com", "description": "A leaked video is circulating on alternative social media that exposes Barclay Crawford, editor for the Daily Mail Australia, as a vaccine propagandist who specifically instructed his staff to ridicule “anti-vaxxers” in their articles. The video – watch below – shows Crawford participating in a virtual meeting with staff members, some of whom he is […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2021/07/Child-Girl-Vaccine-Injection-Syringe.jpg"}, "tags": ["ridicule", "Big Pharma", "Daily Mail Australia", "Journalism", "COVID", "rigged", "vaccines", "smeared", "coronavirus", "anti-vaxxers", "biased", "Media Lies", "Barclay Crawford", "propaganda", "vaccination"], "tweets": [], "movies": [], "links": ["https://gab.com/BeachMilk/posts/106629591332231565", "https://www.naturalnews.com/2021-07-26-covid-vaccines-cause-parkinsons-dementia-symptoms.html", "http://chemicalviolence.com", "https://gab.com/BeachMilk/posts/106629591332231565", "https://www.naturalnews.com/2021-07-26-covid-vaccines-cause-parkinsons-dementia-symptoms.html"], "authors": [], "publish_date": null}