{"result_id": "195014", "URL": "https://mediafactwatch.com/2021-10-25-evidence-suggests-covid-vaccines-do-not-work.html", "timestamp": "2023-04-25 16:18:52 CEST+0200", "meta": {"description": "More and more evidence is coming out proving that the rushed Wuhan coronavirus (COVID-19) vaccines do not work. A lot of this evidence comes from the Centers for Disease Control and Prevention (CDC), America’s national public health agency and one of the main federal offices that signed off on the vaccines. (Related: Top scientists release study […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,CDC,Centers for Disease Control and Prevention,coercion,coronavirus,coronavirus vaccines,covid-19,government,unvaccinated,Vaccine dangers,Vaccine deaths,vaccine failures,vaccine wars,vaccines,vindication", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2021-10-25-evidence-suggests-covid-vaccines-do-not-work.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "Evidence suggests COVID-19 vaccines DO NOT WORK", "cleaned_text": "More and more evidence is coming out proving that the rushed Wuhan coronavirus (COVID-19) vaccines do not work. A lot of this evidence comes from the Centers for Disease Control and Prevention (CDC), America’s national public health agency and one of the main federal offices that signed off on the vaccines. (Related: Top scientists release study warning against COVID-19 vaccines, demand an immediate end to vaccinations.)\n\nCDC Director Dr. Rochelle Walensky previously admitted that COVID-19 vaccines do not prevent the transmission of the virus.\n\n“What they can’t do anymore is prevent transmission,” says Walensky during a press conference. She tries to distract from this fact by claiming that the vaccines are working “exceptionally well” at preventing people from experiencing severe illness.\n\nThis claim by the CDC goes to show that even the so-called medical experts are finding it difficult to continue justifying the government’s vaccination campaign.\n\n“Mainstream media, the big tech corporations and our government have combined efforts to reward compliance and to shame and marginalize non-compliance,” writes libertarian political commentator Lew Rockwell. “Never has there been such an effort to cajole, manipulate through fear and penalize people to take an experimental medical treatment.”\n\nMost new COVID-19 cases and deaths in America are fully vaccinated\n\nReports are coming out from all over the country that most new COVID-19 cases and deaths are coming from the fully vaccinated.\n\nIn Vermont, 76 percent of COVID-19 deaths reported in September were in the fully vaccinated. The state has continually boasted its high vaccination and low hospitalization and death rates. But this all changed when the data regarding its experience with post-vaccine outbreaks came out in September.\n\nAccording to the data, 33 Vermonters died of COVID-19 in September. Just eight of them were unvaccinated. This data comes from the Vermont Department of Health.\n\nThe same situation is happening in other parts of New England, which has bragged about having some of the highest vaccination rates in the country. In Massachusetts, the head of UMass Memorial Health has admitted that regional hospitals in the state are seeing nearly 20 times more COVID-19 patients than in June, most of them vaccinated.\n\nFully vaccinated people all over the country are succumbing to the coronavirus. This situation has gotten so severe that not even the CDC was able to deny it.\n\nFormer CDC Director Dr. Robert Redfield recently admitted that more than 40 percent of people in Maryland who died due to COVID-19 were fully vaccinated.\n\n“A lot of times people may feel it’s a rare event that fully vaccinated people die,” says Redfield. “I happen to be the senior advisor to Gov. Larry Hogan in the state of Maryland. In the last six to eight weeks, more than 40 percent of people who died in Maryland were fully vaccinated.\n\nRedfield made this comment while responding to questions regarding the recent passing of former Secretary of State Colin Powell. He died of complications from COVID-19 despite being fully vaccinated.\n\nAll this data gathered from health departments and so-called public health experts all over the country prove the claim that there is currently a “pandemic of the unvaccinated” is untrue.\n\n“If the vaccines work to prevent infection, then the vaccinated have nothing to worry about,” writes Rockwell. “If the vaccine does not prevent infection, then the vaccinated remain at some risk, and the unvaccinated would be less likely to choose a vaccine that does not work well.”\n\nLearn more about how the experimental and deadly COVID-19 vaccines fail to protect people against the coronavirus by reading the latest articles at Vaccines.news.", "opengraph": {"title": "Evidence suggests COVID-19 vaccines DO NOT WORK", "type": "article", "url": "https://www.mediafactwatch.com/2021-10-25-evidence-suggests-covid-vaccines-do-not-work.html", "site_name": "Media Fact Watch Com", "description": "More and more evidence is coming out proving that the rushed Wuhan coronavirus (COVID-19) vaccines do not work. A lot of this evidence comes from the Centers for Disease Control and Prevention (CDC), America’s national public health agency and one of the main federal offices that signed off on the vaccines. (Related: Top scientists release study […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2021/10/Coronavirus-Covid-19-Research-Lab-Vaccine-Vial.jpg"}, "tags": ["government", "covid-19", "vaccine wars", "Vaccine deaths", "vindication", "coercion", "vaccine failures", "vaccines", "coronavirus", "Centers for Disease Control and Prevention", "unvaccinated", "Vaccine dangers", "CDC", "coronavirus vaccines"], "tweets": [], "movies": [], "links": ["https://www.sgtreport.com/2021/10/the-unvaccinated-are-looking-smarter-every-week/", "https://www.naturalnews.com/2021-10-19-top-scientists-warn-against-covid-vaccines.html", "https://nationalfile.com/cdc-director-rochelle-walensky-admitted-covid-19-vaccines-cannot-prevent-transmission/", "https://citizenfreepress.com/breaking/vermont-76-of-september-covid-deaths-were-fully-vaccinated/", "https://vermontdailychronicle.com/2021/09/30/76-of-september-covid-19-deaths-are-vaxxed-breakthroughs/", "http://www.umassmemorialhealthcare.org/", "https://townhall.com/tipsheet/katiepavlich/2021/10/19/former-cdc-director-gives-alarming-statistic-on-fully-vaccinated-covid-deaths-n2597628", "https://vaccines.news/", "https://www.sgtreport.com/2021/10/the-unvaccinated-are-looking-smarter-every-week/", "https://nationalfile.com/cdc-director-rochelle-walensky-admitted-covid-19-vaccines-cannot-prevent-transmission/", "https://citizenfreepress.com/breaking/vermont-76-of-september-covid-deaths-were-fully-vaccinated/", "https://vermontdailychronicle.com/2021/09/30/76-of-september-covid-19-deaths-are-vaxxed-breakthroughs/", "https://townhall.com/tipsheet/katiepavlich/2021/10/19/former-cdc-director-gives-alarming-statistic-on-fully-vaccinated-covid-deaths-n2597628"], "authors": [], "publish_date": null}