{"result_id": "195029", "URL": "https://www.mediafactwatch.com/2022-07-14-emails-confirm-cdc-officials-changed-definition-of-vaccine.html", "timestamp": "2023-04-25 16:19:01 CEST+0200", "meta": {"description": "Locking people down in their homes, taking their jobs, and threatening their livelihoods was never enough. To force the population to take part in needless genetic experiments, the Centers for Disease Control (CDC) also had to change the definition of “vaccine” and “vaccinated” to manipulate more individuals to comply with their ill-gotten authority. Newly uncovered […]", "lang": "en", "keywords": "authority,badhealth,big government,CDC,Censored Science,coercion,coersion,Collusion,conspiracy,corruption,deception,define vaccine,fake vaccines,FDA,fraud,hysteria,immunity,immunization,manipulation,medical Holocaust,Medical Tyranny,propaganda,public trust,science fraud,vaccine compliance,vaccine definition,vaccine injury", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.mediafactwatch.com/2022-07-14-emails-confirm-cdc-officials-changed-definition-of-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.mediafactwatch.com", "title": "CDC FRAUD: Emails confirm that CDC officials fraudulently changed the definition of “vaccine” to force needless mRNA injections onto the population", "cleaned_text": "CDC FRAUD: Emails confirm that CDC officials fraudulently changed the definition of “vaccine” to force needless mRNA injections onto the population\n\nLocking people down in their homes, taking their jobs, and threatening their livelihoods was never enough. To force the population to take part in needless genetic experiments, the Centers for Disease Control (CDC) also had to change the definition of “vaccine” and “vaccinated” to manipulate more individuals to comply with their ill-gotten authority. Newly uncovered emails confirm that CDC officials conspired to dumb down the definition of “vaccine” and “vaccination” to force more people to take experimental mRNA injections.\n\nTotalitarian CDC uses deception and fraud to harm population\n\nIn 2021, many Democratic-ran governments told the people that their lives would “not go back to normal” unless they were fully-vaccinated. Reoccurring lockdowns, mask mandates, social distancing propaganda and fraudulent DNA swabs were used as tools of coercion to maximize vaccine compliance. The covid-19 vaccine program was rolled out militarily, targeting specific age groups, as if individual health, body autonomy, natural immunity and the doctor-patient relationship did not matter.\n\nIt didn’t take long for the “vaccinated” to realize that the injections were worthless for providing immunity, mitigating and/or stopping the spread of the target illness. Many people reported that the injections made them sick, too. Tens of thousands were disabled or killed and reported their case to the Vaccine Adverse Events Reporting Systems (VAERS) — with no recourse. Some Pfizer covid-19 vaccine lots were twenty-five times more likely to cause adverse events than other lots of the same vaccine. When the emergency use authorization (EUA) was approved for the mRNA jabs, the FDA concealed important information on adverse events and deaths in the clinical trials. Instead of addressing this medical holocaust, the CDC changed the definition of “vaccine” and “vaccination” to maximize compliance.\n\nCDC officials changed definition of “vaccine” and “vaccination” to manipulate public\n\nBefore the covid-19 scandal, a vaccine was defined as “a product that stimulates a person’s immune system to produce immunity to a specific disease.” In September 2021, the CDC changed the definition because the mRNA jabs were not stopping infection, were not conveying immunity and therefore did not align with the traditional definition of a vaccine.\n\nAfter the CDC definition change, a vaccine is referred to as “a preparation that is used to stimulate the body’s immune response.” Many things can stimulate some form of immune response, especially when those substances are injected, but this artificial augmentation does not automatically demonstrate that an experimental product confers immunity or is a safe and effective immunization.\n\nThe CDC also dumbed down the definition of vaccination. Since 2011, the CDC defined “vaccination” as “an injection that prevents a disease.” After the change, the CDC claimed a vaccination is “the act of introducing a vaccine into the body to produce protection from a specific disease.“ Alex Berenson was one of the first investigative reporters to call out the CDC’s Orwellian definition change for “vaccine” and “vaccination.”\n\nMockingly, CDC officials defended the change of definition, claiming the “slight changes haven’t impacted the overall definition” of vaccines. They claimed the new definition was simpler for the public to understand. This twist of words could more accurately be described as deception and fraud.\n\nCDC officials try to make covid jabs appear safe and effective, but lose public’s trust\n\nCDC official Alycia Downs warned her colleagues on August 25, 2021 that the American people were starting to notice that the experimental mRNA jabs do not meet the CDC’s definition of a vaccine. This internal email was sent out one month before the CDC officially changed the definition of vaccine and vaccination. Downs said the longstanding definition of “vaccine” was “problematic.” She told her colleagues that “people are using it to claim the COVID-19 vaccines [are] not a vaccine based on our own definition.” After the memo was sent, Alycia Downs worked with Allison Michelle Fisher, Cynthia Jorgensen, Valerie Morelli, and Andrew (unnamed) to come up with a new definition for “vaccine” and “vaccination.”\n\nDuring the discussion, the CDC accepted comments from people who were worried that their friends and relatives wouldn’t take the shots. Downs opened up the discussion by asking, “Do you all have recommended updates for the content?” One of the public commenters provided the CDC with a basis to change the definition of “vaccine.”\n\n“Right-wing covid-19 pandemic deniers are using your ‘vaccine’ definition to argue that mRNA vaccines are not vaccines…” the commenter suggested. “This was twisted to claim that the existing covid-19 vaccines were not vaccines because they only prevented severe illness. I think it would be more accurate to say that a vaccine function is “to stimulate an immune response” to be clear that perfect immunity is not what defines a vaccine.”\n\nIt only took one month for the CDC to change the definition and re-establish authority on the topic of vaccination. In this process of fraud and deceit, the CDC lost the public’s trust and revealed the façade of their own perceived authority.", "opengraph": {"title": "CDC FRAUD: Emails confirm that CDC officials fraudulently changed the definition of “vaccine” to force needless mRNA injections onto the population", "type": "article", "url": "https://www.mediafactwatch.com/2022-07-14-emails-confirm-cdc-officials-changed-definition-of-vaccine.html", "site_name": "Media Fact Watch Com", "description": "Locking people down in their homes, taking their jobs, and threatening their livelihoods was never enough. To force the population to take part in needless genetic experiments, the Centers for Disease Control (CDC) also had to change the definition of “vaccine” and “vaccinated” to manipulate more individuals to comply with their ill-gotten authority. Newly uncovered […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2022/07/CDC-Vaccine-Coronavirus-Syringe.jpg"}, "tags": ["conspiracy", "manipulation", "big government", "fraud", "FDA", "deception", "fake vaccines", "corruption", "Censored Science", "public trust", "CDC", "vaccine compliance", "coersion", "propaganda", "immunization", "authority", "Medical Tyranny", "science fraud", "vaccine definition", "medical Holocaust", "hysteria", "define vaccine", "Collusion", "vaccine injury", "coercion", "immunity"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2022/07/orwellian-new-emails-confirm-cdc-officials-scrambled-change-problematic-definition-vaccine-vaccinated-experimental-mrna-jab-not-qualify-old-definition/", "https://www.trialsitenews.com/a/my-affidavit-on-different-formulations-in-pfizer-vaccine-lots-1b9e4ee9", "https://naturalnews.com/2021-12-04-foia-documents-fda-pfizer-covid-vaccines-deaths.html", "https://www.cdc.gov/vaccines/vac-gen/imz-basics.htm", "http://vaccines.news", "http://cdc.news", "https://www.thegatewaypundit.com/2022/07/orwellian-new-emails-confirm-cdc-officials-scrambled-change-problematic-definition-vaccine-vaccinated-experimental-mrna-jab-not-qualify-old-definition/", "https://www.trialsitenews.com/a/my-affidavit-on-different-formulations-in-pfizer-vaccine-lots-1b9e4ee9", "https://naturalnews.com/2021-12-04-foia-documents-fda-pfizer-covid-vaccines-deaths.html", "https://www.cdc.gov/vaccines/vac-gen/imz-basics.htm", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2022-07-14-emails-confirm-cdc-officials-changed-definition-of-vaccine&linkname=CDC%20FRAUD%3A%20Emails%20confirm%20that%20CDC%20officials%20fraudulently%20changed%20the%20definition%20of%20%E2%80%9Cvaccine%E2%80%9D%20to%20force%20needless%20mRNA%20injections%20onto%20the%20population", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}