{"result_id": "195012", "URL": "https://mediafactwatch.com/2022-08-22-esg-meant-to-usher-in-one-world-government.html", "timestamp": "2023-04-25 16:18:51 CEST+0200", "meta": {"description": "James Lindsay, author of “Race Marxism” and other books challenging woke narratives, has taken environmental, social, and governance (ESG) scores into his crosshairs, calling ESG a weapon in the hands of “social justice warriors” to shake down corporations and a tool in the hands of those seeking to impose “one world government.” (Article by Cindy Drukier […]", "lang": "en", "keywords": "Agenda,Alt-Left,badclimate,badscience,Collusion,conspiracy,corporate manipulation,corporation,crime,deception,deep state,globalists,great reset,Liberal Mob,one world government,propaganda,racketeering,risk,scam,social pressure,technocrats", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2022-08-22-esg-meant-to-usher-in-one-world-government.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "ESG is a globalist ‘scam’ meant to usher in ‘One World Government’: James Lindsay", "cleaned_text": "ESG is a globalist ‘scam’ meant to usher in ‘One World Government’: James Lindsay\n\nJames Lindsay, author of “Race Marxism” and other books challenging woke narratives, has taken environmental, social, and governance (ESG) scores into his crosshairs, calling ESG a weapon in the hands of “social justice warriors” to shake down corporations and a tool in the hands of those seeking to impose “one world government.”\n\nLindsay told NTD’s “The Nation Speaks” program in a recent interview that the ESG scoring system was initially conceived as a way for investors to track the likelihood that a corporation would be a good bet for investment over the long term. (ESG stands for Environmental, Social, Governance.)\n\n“In the early 2000s, a few very socially minded socially activist investors got together and thought up this idea that, well, it’s probably the case that companies that are bad at environmental policy, bad with social responsibility, and bad corporate governance are going to be bad bets in long term investment,” he said.\n\nLindsay believes the ESG concept was suspect from the very beginning and it’s unclear whether higher scores translated into good long-term profitability for participating corporations.\n\nWorse still, he argued that, over time, ESG scores have been hijacked and “weaponized” by “social justice warriors.”\n\n“They have the leverage to be able to use this like a … financial gun to the head of any corporation that doesn’t do what it wants them to do,” he said, calling it a “blatant weaponization.”\n\n“In fact, it’s racketeering is what it is, is just criminal racketeering, using what looks like a responsible measurement tool as the mechanism. So nobody’s directly responsible for engaging in what is really a mob shakedown of corporations,” he argued.\n\nLack of transparency in how ESG scores are determined is an open door for abuse, Lindsay further contended.\n\n“You have this ability for a very small number of people who wield a tremendous amount of power over markets, to be able to make those decisions. It’s a return almost to a feudal system … the Lords get to decide what is right and wrong,” he said.\n\nIn fact, ESG scores are much like China’s social credit system but applied at a corporate level, Lindsay argued.\n\n“It’s identical to China’s social credit system, it’s just got a nice name that fits Western … not just Western … values, which is how they sell it to the public or get people to back it and think they’re doing good in the world.”\n\nEven more troubling is Lindsay’s argument that ESG fits into a “broader global agenda” that he said wants to make the West energy poor—to the benefit of countries like China—and as a way of social control.\n\n“They want to implement the exact same control system because they see that it works to control people in China,” adding that, in his view, the “power elite” in the West “often do want to control people.”\n\n“The goal is to make China into one model and the West into its inversion. China is a communist country that runs a fascist market. And the goal is to use corporations to create a fascist market that install communism in the West, that’s your social credit scores, your environmental justice, etc.” Lindsay said.\n\n“And the reason for that is the religion of communism believes that when you take opposites that are arranged like that, and you put them into relationship with one another, the contradictions become manifest and eventually work out into one synthetic whole.”\n\n“And so they would be using that as a tool to try to get toward one world government,” Lindsay said.\n\nInsider Intelligence estimates that, in 2022, there was $41 trillion in ESG assets under management worldwide.\n\nBy 2025, this figure is expected to climb to $50 trillion.", "opengraph": {"title": "ESG is a globalist ‘scam’ meant to usher in ‘One World Government’: James Lindsay", "type": "article", "url": "https://www.mediafactwatch.com/2022-08-22-esg-meant-to-usher-in-one-world-government.html", "site_name": "Media Fact Watch Com", "description": "James Lindsay, author of “Race Marxism” and other books challenging woke narratives, has taken environmental, social, and governance (ESG) scores into his crosshairs, calling ESG a weapon in the hands of “social justice warriors” to shake down corporations and a tool in the hands of those seeking to impose “one world government.” (Article by Cindy Drukier […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2022/08/Lie-Truth-Liar-Scam-Fraud-Back-Behind.jpg"}, "tags": ["conspiracy", "great reset", "deep state", "corporate manipulation", "crime", "deception", "social pressure", "racketeering", "technocrats", "globalists", "propaganda", "Liberal Mob", "Agenda", "Alt-Left", "corporation", "Collusion", "risk", "scam", "one world government"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/t-esg", "https://www.theepochtimes.com/esg-is-a-globalist-scam-meant-to-usher-in-one-world-government-james-lindsay_4617189.html?utm_source=partner&utm_campaign=ZeroHedge", "https://www.theepochtimes.com/c-the-nation-speaks", "https://www.insiderintelligence.com/content/rise-of-esg-investing", "https://www.theepochtimes.com/esg-is-a-globalist-scam-meant-to-usher-in-one-world-government-james-lindsay_4617189.html?utm_source=partner&utm_campaign=ZeroHedge", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2022-08-22-esg-meant-to-usher-in-one-world-government&linkname=ESG%20is%20a%20globalist%20%E2%80%98scam%E2%80%99%20meant%20to%20usher%20in%20%E2%80%98One%20World%20Government%E2%80%99%3A%20James%20Lindsay", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}