{"result_id": "195025", "URL": "https://mediafactwatch.com/2022-04-22-scotland-cardiovascular-incidents-surge-after-covid-vaccines.html", "timestamp": "2023-04-25 16:18:59 CEST+0200", "meta": {"description": "An investigation into publicly available data from Public Health Scotland (PHS) shows that there has been a massive surge in teenagers and young adults suffering heart attacks and other heart complications since the Wuhan coronavirus (COVID-19) vaccines emerged. PHS is the government-owned public health body overseeing healthcare and health policies in Scotland. At the beginning of the […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,covid-19,Dangerous Medicine,disinfo,heart disease,heart health,mainstream media,myocarditis,pandemic,pharmaceutical fraud,propaganda,Public Health Scotland,Scotland,spike protein,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2022-04-22-scotland-cardiovascular-incidents-surge-after-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "Cardiovascular incidents among teens, young adults in Scotland SURGED following distribution of COVID-19 vaccines", "cleaned_text": "Cardiovascular incidents among teens, young adults in Scotland SURGED following distribution of COVID-19 vaccines\n\nAn investigation into publicly available data from Public Health Scotland (PHS) shows that there has been a massive surge in teenagers and young adults suffering heart attacks and other heart complications since the Wuhan coronavirus (COVID-19) vaccines emerged.\n\nPHS is the government-owned public health body overseeing healthcare and health policies in Scotland. At the beginning of the COVID-19 pandemic, PHS began releasing data presenting figures showing the wider impact of COVID-19-related regulations on the health service. (Related: UK government data proves COVID-19 vaccines continue to damage immune systems over time, creating vaccine-induced “AIDS.”)\n\nAn examination of the data conducted by the Daily Expose found that cardiovascular cases among teens and adults between the ages of 15 to 44 have surged since the COVID-19 vaccines were made available to the Scottish public.\n\n“The weekly number of [cardiovascular] cases has been highest among 15 to 44-year-olds since the beginning of the pandemic, but that gap between all other age groups suddenly got much bigger in 2021,” wrote the media outlet.\n\nThe data shows that the number of people aged 15 to 44 who required an ambulance or out-of-hours treatment due to cardiovascular cases per week was consistently higher than the pre-pandemic averages. The spikes in cases got even higher beginning on Jan. 2021, when Scotland started receiving the COVID-19 vaccines.\n\nBetween June 27, 2021 and Feb. 20, the number of people aged 15 to 44 requiring out-of-hours treatment for cardiovascular cases increased by nearly 68 percent compared to the pre-pandemic average.\n\nThe data for people requiring an ambulance due to cardiovascular events only goes as far as November 21, 2021. Between June 27 and November 21, the number of people aged 15 to 44 requiring an ambulance due to a cardiovascular incident increased by 50 percent compared to the pre-pandemic average.\n\nScottish media working overtime to claim heart conditions not caused by COVID-19\n\nMainstream media outlets in Scotland and scientific journals have started releasing more articles attempting to explain the rise in cardiovascular incidents among people in Scotland.\n\nOne small study published in the American Heart Association journal Circulation, for example, claimed that more than two-thirds of people who experience a type of heart attack not caused by blood clots may have undiagnosed heart disease.\n\nThe study’s senior author, Dr. Andrew Chapman of the University of Edinburgh, said his study provides evidence that “underlying heart artery disease” and “heart weakness” are the main reasons why people in Scotland experience certain types of heart attacks, not the COVID-19 vaccines.\n\nMainstream media outlets, like the Herald, whose headquarters is in the Scottish city of Glasglow, are even claiming that people experiencing heart attacks are just dealing with panic attacks. An article published on April 6 has the title: “It’s not a heart attack, it’s panic attack so how can you avoid them?”\n\nThe article proceeded to suggest that people ignore certain symptoms, including shortness of breath, tightness in the chest, tingly fingers or hands, sweating, dizziness and a rapid heartbeat.\n\n“[Scientific and medical advisers] have coerced a demographic of the population into taking an injection they simply did not need, and that has now caused [an] increase in heart attacks, cardiac arrest, myocarditis, stroke … since July 2021,” wrote the Daily Expose. “An increase that is showing no signs of slowing.”\n\nLearn more about how the COVID-19 vaccines affect people’s health at Vaccines.news.\n\nWatch this clip from InfoWars as host Alex Jones talks to Dr. Peter McCullough about a study that proves the COVID-19 vaccines are responsible for a surge in heart injuries in children under the age of 12.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nScotland halts reporting covid jab data in order to cover up skyrocketing deaths.\n\nBLATANT FRAUD: Public Health Scotland scrubs covid case rate data now that it “demonstrates conclusively” that the jabs aren’t working.\n\nScottish data shows that covid case rate is highest among fully vaccinated, lowest among unvaccinated.\n\nPublic Health Scotland data shows 89% of COVID deaths over the past month occurred in the fully vaccinated.\n\nScotland’s coronavirus vaccine passport scheme is an “unmitigated disaster,” says Scottish Hospitality Group.", "opengraph": {"title": "Cardiovascular incidents among teens, young adults in Scotland SURGED following distribution of COVID-19 vaccines", "type": "article", "url": "https://www.mediafactwatch.com/2022-04-22-scotland-cardiovascular-incidents-surge-after-covid-vaccines.html", "site_name": "Media Fact Watch Com", "description": "An investigation into publicly available data from Public Health Scotland (PHS) shows that there has been a massive surge in teenagers and young adults suffering heart attacks and other heart complications since the Wuhan coronavirus (COVID-19) vaccines emerged. PHS is the government-owned public health body overseeing healthcare and health policies in Scotland. At the beginning of the […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2022/04/Nurse-Inject-Child-Girl-Vaccine.jpg"}, "tags": ["pandemic", "vaccine damage", "covid-19", "heart health", "Big Pharma", "Public Health Scotland", "mainstream media", "myocarditis", "vaccine injury", "vaccines", "spike protein", "heart disease", "disinfo", "Scotland", "propaganda", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://dailyexpose.uk/2022/04/21/73-percent-increase-heart-attacks-young-adults-covid-jab-rollout/", "https://www.naturalnews.com/2022-02-13-uk-data-shows-vaccines-damaging-immune-systems.html", "https://medicalxpress.com/news/2022-03-undiagnosed-heart-disease-common-people.html", "https://www.ed.ac.uk/", "https://www.heraldscotland.com/news/20043956.not-heart-attack-panic-attack-can-avoid/?ref=rss", "https://vaccines.news/", "https://www.brighteon.com/78e06075-126d-4262-b7be-b63ff959c792", "https://www.brighteon.com/channels/infowarsnetwork", "https://vaccinedeaths.com/2022-02-23-scotland-halts-reporting-covid-jab-data-cover-up-deaths.html", "https://vaccinedeaths.com/2022-02-22-scotland-scrubs-covid-case-data-jab-failure.html", "https://vaccines.news/2022-01-30-scottish-data-covid-case-rate-highest-fully-vaccinated.html", "https://vaccines.news/2021-11-15-data-89-percent-covid-deaths-occurred-fully-vaccinated.html", "https://pandemic.news/2021-11-02-scotland-coronavirus-vaccine-passport-scheme-unmitigated-disaster.html", "https://dailyexpose.uk/2022/04/21/73-percent-increase-heart-attacks-young-adults-covid-jab-rollout/", "https://medicalxpress.com/news/2022-03-undiagnosed-heart-disease-common-people.html", "https://www.heraldscotland.com/news/20043956.not-heart-attack-panic-attack-can-avoid/?ref=rss", "https://www.brighteon.com/78e06075-126d-4262-b7be-b63ff959c792", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2022-04-22-scotland-cardiovascular-incidents-surge-after-covid-vaccines&linkname=Cardiovascular%20incidents%20among%20teens%2C%20young%20adults%20in%20Scotland%20SURGED%20following%20distribution%20of%20COVID-19%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}