{"result_id": "195026", "URL": "https://www.mediafactwatch.com/2022-09-08-cdc-director-admits-mistake-with-covid-vaccines.html", "timestamp": "2023-04-25 16:18:59 CEST+0200", "meta": {"description": "The Centers for Disease Control and Prevention (CDC) Director Rochelle Walensky recently came out to say that her agency made mistakes with regard to the Wuhan coronavirus (COVID-19) vaccines. “It was clear that the advice from the CDC was erratic, it was inconsistent [and] it was dictatorial. And we know this, because we got to the point of […]", "lang": "en", "keywords": "Alex Jones,badhealth,badmedicine,badscience,Big Pharma,CDC,covid data,covid-19,honest,pandemic,Peter McCullough,pharmaceutical fraud,Rochelle Walensky,science deception,science fraud,truth,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.mediafactwatch.com/2022-09-08-cdc-director-admits-mistake-with-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.mediafactwatch.com", "title": "CDC Director Rochelle Walensky admits her agency made critical mistakes regarding COVID vaccines", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) Director Rochelle Walensky recently came out to say that her agency made mistakes with regard to the Wuhan coronavirus (COVID-19) vaccines.\n\n“It was clear that the advice from the CDC was erratic, it was inconsistent [and] it was dictatorial. And we know this, because we got to the point of wearing masks on airplanes,” Dr. Peter McCullough told InfoWars founder Alex Jones.\n\nJust last month, Walensky admitted the agency’s shortcomings after seeing preliminary findings from the CDC’s COVID-19 response reviews. “To be frank, we are responsible for some pretty dramatic, pretty public mistakes, from testing to data to communications. This is our watershed moment. We must pivot,” she said in a video.\n\nMcCullough noted that the CDC should have never given any advice or guidance on contagion control. After all, this is in the realm of doctors and healthcare workers who look after patients.\n\nThey never should have given guidance or advice on emergency uses of vaccines because while they have established general childhood vaccine schedules, they are out of their league when it comes to pandemics. (Related: CDC sued for hiding COVID vaccine safety data.)\n\nMany people have died because of the COVID-19 vaccines, and now the CDC is saying that it got things wrong. “There’s no review. They’re just greenlighting everything,” McCullough said of the CDC.\n\nThere are three false claims about COVID-19 vaccines. The first is that the vaccines stop the infection; the second is that the vaccines block transmission; and the third is that the vaccines prevent hospitalizations.\n\nAll of them proved false as many vaccinated individuals got infected with, transmitted and died from COVID-19. (Related: CDC admits to deliberately withholding incriminating COVID jab data from the public to minimize “vaccine hesitancy.”)\n\nMcCullough said: “So the idea is that the vaccines never reduced hospitalization and death. There never was a prospective randomized trial with hospitalization and death as a primary endpoint, where that was reduced by the vaccines.”\n\nHe pointed out that the only two interventions that reduced hospitalizations and deaths are natural immunity for having the illness beforehand and then early treatment.\n\n“So those are a series of fraudulent studies that didn’t account for natural immunity in early treatment, claiming that the vaccinated had lower rates of hospitalization and death,” McCullough went on.\n\nAccording to McCullough, those who had been vaccinated are also the ones most fearful of COVID-19. “They were usually the first ones to get early treatment,” he said.\n\nAnd then, there is data coming from different parts of the globe that the fully vaccinated ones are doing far worse with COVID than those who had been unvaccinated.\n\nVisit Vaccines.news for more news about the dangers and adverse effects of COVID-19 vaccines.\n\nWatch the video below and listen to the conversation between Dr. Peter McCullough and Alex Jones as they break down the latest data showing vaccine-related deaths around the world.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nCDC pushing covid “scariants” propaganda to keep America enslaved with FEAR.\n\nCDC is HIDING data showing that covid vaccines are failing miserably in dealing with the Delta variant.\n\nNot convinced that covid “vaccines” cause myocarditis? See the CDC corruption details for yourself in this new JAMA paper.\n\nCDC hides COVID data from the public in order to whitewash dishonest COVID narrative\n\nCDC changes definitions of “vaccine” and “vaccination” to cover up lie about vaccines being 100% effective.", "opengraph": {"title": "CDC Director Rochelle Walensky admits her agency made critical mistakes regarding COVID vaccines", "type": "article", "url": "https://www.mediafactwatch.com/2022-09-08-cdc-director-admits-mistake-with-covid-vaccines.html", "site_name": "Media Fact Watch Com", "description": "The Centers for Disease Control and Prevention (CDC) Director Rochelle Walensky recently came out to say that her agency made mistakes with regard to the Wuhan coronavirus (COVID-19) vaccines. “It was clear that the advice from the CDC was erratic, it was inconsistent [and] it was dictatorial. And we know this, because we got to the point of […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2022/09/Cdc-Sign-Center-For-Disease-Control.jpg"}, "tags": ["pandemic", "covid-19", "vaccine wars", "Big Pharma", "science deception", "science fraud", "vaccines", "pharmaceutical fraud", "truth", "covid data", "Alex Jones", "Peter McCullough", "Rochelle Walensky", "honest", "CDC"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/34c1683b-9be2-4bdb-b0aa-684a46c0f62f", "https://www.science.org/content/article/it-s-incredible-place-cdc-director-rochelle-walensky-how-she-hopes-reform-her-battered", "https://naturalnews.com/2022-01-04-cdc-sued-for-hiding-covid-vaccine-safety-data.html", "https://naturalnews.com/2022-05-23-cdc-withheld-covid-jab-data-vaccine-hesitancy.html", "http://Vaccines.news", "https://www.brighteon.com/cc688aba-f2ac-4ed6-bc01-2b36fbd84416", "https://www.brighteon.com/channels/infowarsnetwork", "https://newstarget.com/2021-05-12-cdc-pushing-covid-scariants-propaganda-america-enslaved.html", "https://vaccines.news/2021-08-05-cdc-hiding-data-covid-vaccines-failing.html", "https://newstarget.com/2022-02-22-covid-vaccines-myocarditis-cdc-corruption-jama-study.html", "https://pandemic.news/2022-02-24-cdc-hides-covid-data-pushes-own-narrative.html", "https://vaccines.news/2021-09-15-cdc-changes-vaccine-vaccinated-definitions.html", "https://www.brighteon.com/cc688aba-f2ac-4ed6-bc01-2b36fbd84416", "https://www.science.org/content/article/it-s-incredible-place-cdc-director-rochelle-walensky-how-she-hopes-reform-her-battered", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmediafactwatch%2F2022-09-08-cdc-director-admits-mistake-with-covid-vaccines&linkname=CDC%20Director%20Rochelle%20Walensky%20admits%20her%20agency%20made%20critical%20mistakes%20regarding%20COVID%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}