{"result_id": "195023", "URL": "https://www.mediafactwatch.com/2021-06-02-horrifying-study-reveals-mrna-vaccine-nanoparticles-are-circulated-throughout-the-entire-body-brain-heart-liver-ovaries-testes.html", "timestamp": "2023-04-25 16:18:57 CEST+0200", "meta": {"description": "Not surprisingly, everything the establishment tells us about covid vaccines has been a calculated lie. One of the biggest and most treacherous lies is that “mRNA vaccine shots stay in the arm and don’t circulate nanoparticles around the body.” Now we know that is a complete lie, as new research conducted in Japan shows that […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Blood clots,LNPs,mRNA,nanoparticles,Pfizer,spike protein,Vaccine deaths,Vaccine injuries", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.mediafactwatch.com/2021-06-02-horrifying-study-reveals-mrna-vaccine-nanoparticles-are-circulated-throughout-the-entire-body-brain-heart-liver-ovaries-testes.html", "encoding": "UTF-8"}, "image": null, "domain": "www.mediafactwatch.com", "title": "Horrifying study reveals mRNA vaccine nanoparticles are circulated throughout the entire body: Brain, heart, liver, ovaries, testes and more", "cleaned_text": "Horrifying study reveals mRNA vaccine nanoparticles are circulated throughout the entire body: Brain, heart, liver, ovaries, testes and more\n\nNot surprisingly, everything the establishment tells us about covid vaccines has been a calculated lie. One of the biggest and most treacherous lies is that “mRNA vaccine shots stay in the arm and don’t circulate nanoparticles around the body.” Now we know that is a complete lie, as new research conducted in Japan shows that Lipid NanoParticles (LNPs) containing the mRNA code are widely circulated around the body after vaccination, reaching the brain, spleen, large intestine, heart, liver, lungs and other organs.\n\nThe study paper, originally written in Japanese and auto-translated into English, can be found at this link on Natural News servers (PDF).\n\nLabeled, “Pfizer confidential,” the study is known as a bio-distribution study that uses luciferase enzymes and radioisotope markers to accurately track the distribution of Pfizer’s mRNA LNPs across the body. The first section is labeled:\n\nThe study reveals how mRNA LNPs are distributed across the body, even affecting ovaries and testes, raising huge questions about fertility in those receiving mRNA vaccine shots. The following chart shows the mass of NLPs (in micrograms) found in each organ following mRNA vaccination. Notice how it attacks the adrenals?\n\nA pro-vaccine doctor named Dr. Byram W. Bridle, PhD. was interviewed by Alex Pierson of the “On Point” podcast. That interview is also mirrored on Brighteon.com and shown here. It is approximately 9 minutes in duration:\n\nIn the interview. Dr. Bridle says the following stunning things. Remember as you read this that Dr. Bridle is 100% pro-vaccine and has no criticism about other vaccines: (emphasis ours)\n\n…the spike protein, on its own, is almost entirely responsible for the damage to the cardiovascular system. If it gets into circulation, indeed, if you inject the purified spike protein into the blood of research animals, they get all kinds of damage to the cardiovascular system, and it can cross the blood-brain barrier, and cause damage to the brain.\n\nThey found the spike protein in circulation, so in the blood of 11 of those 13 healthcare workers that had received the vaccine. What this means is, so we have known for a long time that the spike protein is a pathogenic protein. It is a toxin. It can cause damage in our body if it gets into circulation. Now, we have clear cut evidence that the vaccines that make our bodies or the muscles or the cells in our deltoid muscles, manufacture this protein, not the vaccine itself, plus the protein gets into blood circulation. When in circulation, the spike protein can bind to the receptors that are on our platelets and the cells that line our blood vessels. When that happens, it can do one of two things. It can either cause platelets to clump and that can lead to clotting. That’s exactly why we’ve been seeing clotting disorders associated with these vaccines. It can also lead to bleeding. And of course, the heart’s involved, it’s a key part of the cardiovascular system. That’s why we’re seeing heart problems. The protein, it can also cross the blood brain barrier and cause neurological damage. That’s why also in the fatal cases of blood clots, many times it’s seen in the brain.\n\nIn short, the conclusion is we made a big mistake. We didn’t realize it until now. We saw the spike protein was a great target antigen. We never knew the spike protein, itself, was a toxin and was a pathogenic protein. So, by vaccinating people, we are inadvertently inoculating them with a toxin, and in some people this gets into circulation. And when that happens in some people, it can cause damage, especially with the cardiovascular system. I don’t have time, but many other legitimate questions about the long-term safety there for this vaccine. For example, with accumulating in the ovaries, one of my questions is, “will we be rendering young people infertile, some of them infertile?” So, I’ll stop there.\n\nDr. Bridle is now saying exactly what I have been saying, of course. The spike protein is the toxin, and it is what’s causing blood clots and deaths.\n\nI discuss all this starting at 50:36 in today’s Situation Update podcast, which also covers biosludge pollution, vaccine news and crazy headlines such as gun lotteries to push vaccines in West Virginia.\n\nTomorrow’s Situation Update podcast will discuss the bombshell Fauci emails that broke today, revealing Fauci knew about gain-of-function research, helped fund it, and tried to cover it up.", "opengraph": {"title": "Horrifying study reveals mRNA vaccine nanoparticles are circulated throughout the entire body: Brain, heart, liver, ovaries, testes and more", "type": "article", "url": "https://www.mediafactwatch.com/2021-06-02-horrifying-study-reveals-mrna-vaccine-nanoparticles-are-circulated-throughout-the-entire-body-brain-heart-liver-ovaries-testes.html", "site_name": "Media Fact Watch Com", "description": "Not surprisingly, everything the establishment tells us about covid vaccines has been a calculated lie. One of the biggest and most treacherous lies is that “mRNA vaccine shots stay in the arm and don’t circulate nanoparticles around the body.” Now we know that is a complete lie, as new research conducted in Japan shows that […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2021/06/HRR-2021-06-02-Situation-Update.jpg"}, "tags": ["LNPs", "Vaccine deaths", "nanoparticles", "Blood clots", "Pfizer", "spike protein", "Vaccine injuries", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/files/Pfizer-bio-distribution-confidential-document-translated-to-english.pdf", "https://omny.fm/shows/on-point-with-alex-pierson/new-peer-reviewed-study-on-covid-19-vaccines-sugge", "http://Brighteon.com/3d683a15-fc3d-432d-a057-3313969eb075", "http://Brighteon.com/abfb98c0-717b-4988-b21a-13dee505ce60", "https://www.brighteon.com/channels/hrreport"], "authors": [], "publish_date": null}