{"result_id": "195005", "URL": "https://mediafactwatch.com/2021-09-28-do-not-do-your-own-research-says-cnn.html", "timestamp": "2023-04-25 16:18:46 CEST+0200", "meta": {"description": "“Vaccines save lives.” “Vaccines are safe and effective.” “Vaccines will get us back to normal.” “All eligible Americans must take a vaccine.” Americans have been bombarded with this mantra 24/7 since the experimental gene therapeutics, aka “COVID vaccines,” became available to the general public in April of this year. (Article by Sundance republished from TheNewAmerican.com) […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,CNN,conspiracy,COVID,health freedom,mainstream media,medical censorship,medical fascism,pandemic,pharmaceutical fraud,propaganda,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://mediafactwatch.com/2021-09-28-do-not-do-your-own-research-says-cnn.html", "encoding": "UTF-8"}, "image": null, "domain": "mediafactwatch.com", "title": "CNN: Do NOT “do your own research” on COVID vaccines", "cleaned_text": "CNN: Do NOT “do your own research” on COVID vaccines\n\n“Vaccines save lives.” “Vaccines are safe and effective.” “Vaccines will get us back to normal.” “All eligible Americans must take a vaccine.” Americans have been bombarded with this mantra 24/7 since the experimental gene therapeutics, aka “COVID vaccines,” became available to the general public in April of this year.\n\nAs the vaccination campaign gained steam, it turned out that COVID vaccines are not, in fact, as safe as they were said to be. The Vaccine Adverse Event Reporting System (VAERS) had started filling up with numerous reports on side effects, from mild ones to such serious and life-threatening reactions as blood clotting, hemorrhages, unstoppable bleeding, heart issues, miscarriages, and deaths. While, arguably, not every single event was connected to the vaccine, the trend was truly alarming. In addition to that, the true numbers of adverse effects are likely much higher, since only about 10 percent of all cases are being reported to the system.\n\nAs the media and top officials turned a blind eye to the troubling reports, and Big Tech started to censor all stories of people suffering adverse reactions after being inoculated, many practicing doctors started to speak up and sound the alarm regarding the jabs’ safety. No matter how renowned and prominent, all of them were called “conspiracy theorists” and shut down from most of the public platforms.\n\nFurther, it turns out that the vaccines do not prevent one from getting the virus or transmitting it to others. After reports of breakthrough infections were already appearing on the web for at least a month, President Biden stated on July 21, “You’re not going to get COVID if you have these vaccinations.”\n\nOn July 31, the Centers for Disease Control and Prevention (CDC) contradicted the president’s words in a statement that the viral load vaccinated and unvaccinated people carry when infected is “similar.” The vaccination was still recommended to everyone since it was said to reduce the risk of severe COVID complications.\n\nIn this confusing situation, both federal and some local governments, as well as private businesses, took the vaccination campaign on the offensive, and switched from cajoling people into getting jabbed to coercing them to do so — or face negative consequences, such as losing a job.\n\nStill, the mainstream media shames vaccine-hesitant Americans for not rolling up their sleeves. The latest target of the mainstream-media attack is people’s independent research on vaccines.\n\n“Four little words — ‘do your own research’ — are hurting the US pandemic response,” warned CNN’s Ramishah Maruf, citing chief media correspondent Brian Stelter.\n\nWhile admitting that “it may seem like a reasonable, even positive, attitude,” it is, at the same time, “a favored talking point echoed by many in the right-wing media,” Maruf claims. Presumably, it means that independent research is a tool that the conservative-leaning journalists encourage people to use in order to increase vaccine hesitancy and, therefore, undermine the whole vaccination campaign.\n\nOne may wonder, “Why would it hurt to watch this podcast with mRNA technology inventor Dr. Robert Malone? After all, he seems reputable enough to say something valuable about the jabs that employ technology that he pioneered.”\n\nOne should not do such a thing, CNN explains, first of all, because most people are not smart enough to understand such an information: “Most people simply don’t know how to do their own research, especially when it comes to understanding the complexities of medical science.”\n\nSecondly, in the current media environment, Maruf argues, people often fall victim to the “misleading data that confirms biases.” And she is not wrong, actually. The media bias and political interest was on full display during the presidential campaign of 2020, when Maruf’s own outlet admitted it was engaged in generating public panic over COVID only to hurt Donald Trump’s chances for reelection. On a different occasion, many of the liberal outlets who rooted for Joe Biden stated they “made a mistake” by dismissing the Wuhan lab-leak theory of COVID origin in 2020 because it was supported by Trump. Thus, if the media environment is not a place to look for reliable information, it is because of CNN and its ilk.\n\nMaruf quotes Renee DiResta, research manager at the Stanford Internet Observatory, who laments, “Nobody’s going to the library and looking up authoritative sources to do their own research.” But what if they do? See point number 1 and get a medical degree.\n\nMaruf then quotes Yael Eisenstat, a Future of Democracy fellow at the Berggruen Institute, saying that the media “needs to be more transparent in its reporting, especially when it comes to Covid.” This is because, Maruf claims, there are “subtle differences between understanding scientific research that is still theoretical versus that which has been tested and widely agreed upon.” DiResta adds that “Science is a consensus building process.”\n\nThe latter statement implies that if the “scientists” (or whoever talk on behalf of “science” and are called “experts” on TV) agree that the vaccines are safe, then it must be true. The evidence may change, and if the “scientists” chose to agree on something else, then the previous statement becomes invalid.\n\nThis type of logic is painfully reminiscent of George Orwell’s 1984, where the Party could announce that Oceania had always been at war with Eurasia and allied with East Asia, only to later announce that Oceania had always been at war with East Asia and allied with Eurasia, and the people were expected to believe both claims. In the same vein, the Party could also claim that two plus two equals five, and it would be so, because in that dystopian world, the reality was internal and did not rely on physical evidence. It only existed in the mind of the rulers, who projected it onto the public: “Whatever the Party holds to be the truth, is truth.”\n\nThat is the type of reality the corporate media and their masters are pushing on America. So please, do your own research and see for yourself that 2+2=4.\n\nRead more at: TheNewAmerican.com and VaccineWars.com.", "opengraph": {"title": "CNN: Do NOT “do your own research” on COVID vaccines", "type": "article", "url": "https://www.mediafactwatch.com/2021-09-28-do-not-do-your-own-research-says-cnn.html", "site_name": "Media Fact Watch Com", "description": "“Vaccines save lives.” “Vaccines are safe and effective.” “Vaccines will get us back to normal.” “All eligible Americans must take a vaccine.” Americans have been bombarded with this mantra 24/7 since the experimental gene therapeutics, aka “COVID vaccines,” became available to the general public in April of this year. (Article by Sundance republished from TheNewAmerican.com) […]", "image": "https://www.mediafactwatch.com/wp-content/uploads/sites/41/2021/09/CNN-headquarters-building.png"}, "tags": ["pandemic", "conspiracy", "medical censorship", "medical fascism", "vaccine wars", "Big Pharma", "mainstream media", "COVID", "CNN", "vaccines", "health freedom", "propaganda", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://thenewamerican.com/cnn-do-not-do-your-own-research-on-covid-vaccines-to-avoid-misinformation/", "https://speedtheshift.wordpress.com/2016/02/18/it-is-estimated-that-only-1-10-of-all-vaccine-adverse-reactions-are-ever-reported-to-vaers/", "https://thenewamerican.com/project-veritas-unveils-facebook-censorship-of-posts-promoting-vaccine-hesitancy/", "https://thenewamerican.com/nearly-4000-bay-staters-get-covid-19-after-being-fully-vaccinated/", "https://townhall.com/tipsheet/leahbarkoukis/2021/07/22/biden-claims-you-cant-get-covid-after-vaccine-n2592934", "https://www.cdc.gov/media/releases/2021/s0730-mmwr-covid-19.html", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7032e3.htm", "https://thenewamerican.com/bidens-draconian-covid-executive-orders-are-unconstitutional/", "https://thenewamerican.com/big-business-doubles-down-on-covid-vaccine-mandates/", "https://www.cnn.com/2021/09/19/media/reliable-sources-covid-research/index.html", "https://www.extremelyamerican.com/post/dr-robert-malone-explains-the-connection-between-cytoxic-spike-proteins-the-mrna-vaccine", "https://www.msn.com/en-us/news/us/cnn-technical-director-admits-to-pushing-covid-panic-and-using-death-tracker-to-do-it/ar-BB1fEukM", "https://www.dailymail.co.uk/news/article-9635337/Liberal-media-FINALLY-admits-mistake-dismissing-Wuhan-Lab-leak-theory.html", "https://thenewamerican.com/cnn-do-not-do-your-own-research-on-covid-vaccines-to-avoid-misinformation/", "http://vaccinewars.com"], "authors": [], "publish_date": null}