{"result_id": "196004", "URL": "https://mediaroots.org/american-drug-wars-kevin-booth-on-bill-hicks-addiction-the-green-rush/", "timestamp": "2023-04-25 16:19:16 CEST+0200", "meta": {"description": "Media Roots is a citizen journalism project that reports the news from outside of party lines while providing a collaborative forum for conscious citizens, artists and activists to unite.", "lang": "en", "keywords": "investigative citizen journalism, corporate misconduct, political corruption, media information, news information, media news, california real news, california oakland news, bay area real news, san francisco real news, san francisco media, media reporting, political representation, political news, art representation, media representation, news information", "favicon": "//mediaroots.org/wp-content/themes/twentyeleven/images/favicon.gif", "canonical": "//mediaroots.org/american-drug-wars-kevin-booth-on-bill-hicks-addiction-the-green-rush/", "encoding": "UTF-8"}, "image": null, "domain": "mediaroots.org", "title": "American Drug War Creator on Addiction, Prohibition & the “Green Rush”", "cleaned_text": "As costly as it is ineffective, America’s prohibition on illegal drugs is a contentious subject the corporate media keeps at arm’s length.\n\nDocumentarian Kevin Booth is the director of several films that scrutinise America’s dubious relationship with drugs and suggest that illegal trafficking is embedded in the US economy.\n\nAs arrests are hastily made for the possession of marijuana – which is proven to have countless medical benefits, people are bombarded with advertisements for alcohol and cigarettes. Booth’s films bring attention to the profit holding priority over public health with big pharma and private prisons reaping substantial benefits to the detriment of patients whose lives could be vastly improved by medical marijuana.\n\nBooth has lost close friends and family members to legal drug addiction amongst whom include Bill Hicks, legendary comic whose outrage with the establishment’s hypocrisy on drugs paralleled Booth’s. Their shared worldview fueled them to create Sacred Cow Productions which has since produced a host of eye-opening documentaries including American Drug War 2: Cannabis Destiny and How Weed Won the West.\n\nWith Colorado recently legalising cannabis and Washington close to follow, it’s due time for the US to review its classification of marijuana. Filmmakers like Kevin Booth deserve worldwide recognition, and we were lucky to sit down with him for an interview with Media Roots.\n\nMR: I recently saw a video where you and Bill Hicks are on site covering the Waco massacre in 1993. Is that where your filmmaking career kicked off?\n\nKB: That was in 92. I started shooting in 84. I sold cocaine in order to buy my first video camera all the way back in 1984. In Austin, Texas, they a public access channel which would allow first time filmmakers or people that made videos to able to put videos out that they made up on Austin access which was channel ten on the regular cable vision. If you had basic cable in Austin you would actually get Austin access channel ten. I became a producer for that and that was all the way back in the mid-eighties. Around the same time my band got a record contract with Chrysalis records was actually out of England, they did Jethro Tull who was one of the first bands out of Chrysalis records. I helped do a music video that was on MTV and that’s what really kind got me pushed through into this more seriously. Up until then I thought I was going to be a musician and I just did video as a hobby, and then once I did this help on the music video for MTV I got the bug. I started getting more interested in cameras than I was into guitars. Bill and I did a karate movie called, Ninja Bachelor Party – we started that all the way back in 85. I did a lot of videos before the Waco thing.\n\nMy background was first in music then in comedy and then going into documentaries wasn’t until after Bill died. Alex Jones as a conspiracy guy was just getting started up at the Austin access channel up at the time and like you said I did that video with Bill up at Waco. Alex was just this young guy starting off and he was doing some stuff with Waco, in fact he was trying to raise money to help the Branch Davidians rebuild the church and so I started to travel to Waco with him and started filming him up at Waco. That kind of led me into working on my first real documentary with working together with Alex Jones. I worked on several documentaries with Alex for a while until we kind of had a clash of personalities. I wanted to kind of be able to do my own which what led me to do American Drug War besides other personal reasons.\n\nMR: Talk about your reasons for setting out to make films.\n\nKB: At the time I had lost Bill to legal drugs. There’s no proof but Bill was such a heavy, horrible smoker and abused his body horribly with alcohol and cigarettes then my brother died in 97 from having a seizure from pharmaceutical drugs. He was a schizophrenic and was actually court ordered to take anti schizophrenic medication which gave him a seizure. My mom and dad were both alcoholics, my dad he died of throat cancer from cigarettes that he had smoked when he was way younger and my mom died of liver complications so I kind of looked at it like I had lost all my friends and family to legal drugs of alcohol, tobacco and pharmaceutical. A close friend of mine by the name of Mambo Johnny he went to a prison camp for two years for just growing marijuana and then when he got out of this prison camp he died from complications or some disease he got while he was in this prison. Around the same time George Bush was on TV saying, ‘If you buy drugs then you support terrorism.’ All that together made me think decide to put everything I have together to make a documentary about the drug war.\n\nMR: How has the reaction been to your work?\n\nKB: It’s been really great. When the first one came out on Showtime in 2008 I got probably one hundred emails a week from people sharing their stories of drug addiction or their stories of being arrested and how much they appreciate me shedding light on the topic – pretty much all positive reactions. The very few people that have anything negative to say to me will usually just do it on comments, they don’t ever do it face to face. They’ll hide behind their computer if they have anything mean to say to me.\n\nMR: There’s psychoactive properties of some drugs that would make them dangerous, if not life threatening for some people. Personally, I can understand why drugs like LSD are illegal.\n\nKB: Yeah, Bill had a joke about that, how Art Linklater’s daughter took acid and jumped off a building. His joke was would be like, ‘Well, you don’t see ducks lined up to take elevators. If you thought you could fly take off from the ground first! Don’t blame acid on this fucking dumb ass!’ If you take drugs and run into a wall…No, I get it.\n\nSome people watch these films and they don’t really totally get it. Their knee jerk reaction is to think that I’m just out there promoting drug use and it couldn’t be further from the truth. I’m actually kind of conservative! When I go to some of these pro-legalisation rallies and I have to interact with a lot of these people, I run into a lot of them that say everything should be legal – crystal meth, PCP should be legal ,legal, legal..I have to be honest and say I have a hard time with that. There really does need to be a line.\n\nThe problem always comes in to what should be against the law and I think it should be your actions need to be against the law, not ingesting a chemical. If you’re selling drugs to children then that should be against the law. I wish there was a way for people who wanted to do cocaine responsibly in their home to be able to get legally controlled substances. It’s like when you hear the thing about Phillip Seymour Hoffman dying, right? Most likely what killed him was that he probably got hold of something that was a lot stronger than what he was used to. I think that most of the deaths that are related to illegal drugs have to do with a lack of control. There are more deaths in this country right now from Tylenol than there are from heroin and meth and all these other illegal drugs combined. Of course there’s no deaths from marijuana but when you look at the deaths that happen from illegal drugs it does have to do with the lack of control.\n\nI don’t believe that everybody should be able get everything but I think that if you’re a responsible adult and you want to work through certain channels say you want to be able to take a hit of ecstasy with your wife in the privacy of your own home, have a shared experience maybe you could go to a certain doctor or psychiatrist. They found that it’s really good as a marriage counseling drug. We worked with these people that were doing ecstasy when someone was going to die, like a wife was about to lose a partner they would take ecstasy together and have these amazing experiences before they die. There’s a lot of therapeutic benefits to it all but if someone wants to do it they have to go get it from some scummy person off the streets and that’s what really screws it up. I wish that I could try cocoa leaves for example. I think it would be amazing if I could try chewing on some cocoa leaves like god intended, I mean wouldn’t that be awesome? I’ll never get to do that, all I get to do is do this thing called cocaine that is a powerful chemical derivative that’s very dangerous because you have no idea what people are mixing it with in the jungle to get it across the border. It’s a very cloudy issue.\n\nMR: Has your view on drugs changed since putting out the first film?\n\nKB: My reaction from putting out these movies and the reaction I got is that I’ve probably actually gotten a little conservative with what I think is reasonable. Now that marijuana is legal in Colorado, case in point, I’ve been going to Denver since Colorado has been legalised and I have to be honest it’s a little over board. It’s fun, don’t get me wrong. It’s probably how Chicago was when prohibition ended and people were dancing and drinking in the streets. Now everybody’s ‘Dabbing’ – I don’t know if you know what dabbing is? Everybody’s smoking these big pipes using blow torches and smoking this really powerful form of marijuana extract. Everywhere you go everybody’s is smoking this and when I see that in Denver I go, ‘Oh my god, when the rest of the country sees this it’s really going to hurt the legalisation!’\n\nPeople always have to take things too far, you know what I mean? It’s kind of human nature, it’s the blow back from all the years of it being illegal too that people are always going to take things to the far extremes. I’m all for responsible use, I’m all for people being sober when they drive. Then again I believe that alcohol probably is one of the most horrific drugs out there when it comes to making people act like idiots and do really stupid things, acting violent, driving bad, doing dumb things. I think that alcohol is at the very top of the list as one of the most dangerous drugs out there. It’s just amazing to me that I can go to the grocery store and there are bottles of Jack Daniels and tequila right there! If I drunk that I would lose my mind! There’s just so much hypocrisy.\n\nMR: What do you think would be the immediate effects of nationwide cannabis legalisation?\n\nKB: You can look at what’s going on in Colorado right now. Colorado is having a real boom. I’m getting ready to go to a conference of billionaire investors who are all flocking around Colorado to see how they can get involved in the emerging legal cannabis business. Looking at what’s going on in Colorado around the cannabis industry right now is a little indicator of what could happen across the rest of the country. Now of course I’m not talking about legalising cocaine or any of those things, though wouldn’t it be cool if you could grow poppy plants in your back garden? Of course I’m not advocating that you have some big lab or something like that. Anytime you’ve got people mixing dangerous chemicals, that should be illegal. It should probably be illegal to set up a laboratory of flammable explosive things, you know? I don’t think it should be illegal to grow and consume anything. I guess where I draw the line is at nature. If it grows out of the ground then you should be able to plant it and consume it. If it takes chemistry to do it then yeah, maybe the law should step in.\n\nMR: One fascinating aspect of your films is how deeply embedded the drug market is in American economics, for example the CIA drug running.\n\n\n\nKB: You can look at what’s going on right now. We could flash to Afghanistan and the reason why the military is still there. A lot of people believe we are still there basically protecting the opium and the heroin. Right now there’s huge resurgence. There’s stories on the news that are like, ‘Wow, heroin is really having a big resurgence in America!’ and they never connect the dots like, ‘Oh, yeah! That Afghanistan thing!’ They never connect those dots! Another fascinating thing that no one ever talks about is the banks and the money laundering taking place. Anyone can see for themselves if they go to Google maps – go to the Texas border and type in ‘banks’ and zoom in and look at the Mexican border – it’s fascinating to see all the banks. There are so many banks along the border in these border towns. Not only that, there are so many of these weird foreign banks with these names that you’ve never heard of and it’s all just money laundering. Then again other big mainstream banks get caught doing it being knowingly involved in money laundering for cartels and, you know, no one ever goes to jail. Nothing ever happens to the big guys it’s just all the little people that get sent to jail.\n\nMR: What’s next for you?\n\nKB: After doing Cancer in Kids I need to take a break from the seriousness. I’m moving off and getting back into my comedy roots a little bit. One of the documentary projects I’m working on is kind of showing some of the corruption in the marijuana industry – some of the more high end corruption. There are a lot of big companies that are now coming out of the industry and I don’t know if you realise this but a lot of them are actually being publicly traded. Although a lot of them are really great, some of them in my opinion are fraudulent. People when they think about marijuana they think of hippies, peace and love but some of the people in the marijuana industry are some of the most cutthroat people I’ve ever been around. It’s a whole another level. We’re not talking about just drug dealers any more, we’re talking about an industry that is not quite regulated by the government yet but it has been legitimised by the fact that they’ve legalised it in two states!\n\nSo you’ve got two out of fifty states that have legalised it, so in a way the government has said, ‘Okay, yeah so it’s illegal’, although people are being arrested in these forty eight states. Meanwhile you have not only the good people like rich investors from all over the world. Tokyo, Germany, Switzerland rushing to Colorado to figure out how they can invest in this thing to get in on it early, you also have a lot of scummy, fly by night, get-rich-quick schemer type people. They call it ‘the green rush’ and in my opinion it really is like a modern day gold rush, because so many people have this idea of easy money and dollar signs in their eyes. I’m working on a documentary that’s going to look at that and a lot of its humorous so it’s going to be more of a comical documentary, because in my mind, once you enter into the world of trying to get rich overnight then it’s all fair. I can’t feel sorry for you if get screwed when you’re trying to get rich overnight. It kind of all becomes comedy to me at a certain point with people scamming each other. I’m also working on a scripted show that’s going to based on the same thing. None of them are drop dead serious. It’s more in the vein of comedy.\n\nWritten and transcribed by Aaron Williams, photo by Kayvee Inc.", "opengraph": {"title": "American Drug War Creator on Addiction, Prohibition & the “Green Rush”", "site_name": "MEDIA ROOTS – Reporting From Outside Party Lines", "image": "http://www.mediaroots.org/wp-content/uploads/2013/04/ad2new.jpg", "type": "article", "url": "http://mediaroots.org/american-drug-wars-kevin-booth-on-bill-hicks-addiction-the-green-rush/"}, "tags": ["marijuana", "legalization", "big pharma", "PROPAGANDA", "drug war", "Documentary", "corruption"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "480", "height": "360", "embed_code": "<iframe frameborder=\"0\" height=\"360\" src=\"//www.youtube.com/embed/6CyuBuT_7I4\" width=\"480\"/>", "src": "//www.youtube.com/embed/6CyuBuT_7I4"}], "links": [], "authors": [], "publish_date": "June 9, 2014"}