{"result_id": "196014", "URL": "https://mediaroots.org/drug-firms-drove-swine-flu-pandemic-warning-to-recoup-billions/", "timestamp": "2023-04-25 16:19:24 CEST+0200", "meta": {"description": "Media Roots is a citizen journalism project that reports the news from outside of party lines while providing a collaborative forum for conscious citizens, artists and activists to unite.", "lang": "en", "keywords": "investigative citizen journalism, corporate misconduct, political corruption, media information, news information, media news, california real news, california oakland news, bay area real news, san francisco real news, san francisco media, media reporting, political representation, political news, art representation, media representation, news information", "favicon": "//mediaroots.org/wp-content/themes/twentyeleven/images/favicon.gif", "canonical": "//mediaroots.org/drug-firms-drove-swine-flu-pandemic-warning-to-recoup-billions/", "encoding": "UTF-8"}, "image": null, "domain": "mediaroots.org", "title": "Drug Firms Drove Swine Flu Pandemic Warning to Recoup Billions", "cleaned_text": "DAILY MAIL– Drug companies manipulated the World Health Organisation into downgrading its definition of a pandemic so they could cash in on a swine flu outbreak, it is claimed.\n\nAn inquiry heard yesterday that the WHO allegedly softened its criteria for declaring a H1N1 flu pandemic last spring – just weeks before announcing there was a worldwide outbreak. Critics said the decision was driven by pharmaceutical companies desperate to recoup the billions of pounds they had invested in researching and developing pandemic vaccines after the bird flu scares in 2006 and 2007.\n\nAs a result, millions of people have been vaccinated against a mild illness, and money that could have been used to prevent and treat major killers such as heart disease has been squandered. The claims, which emerged during the first of several Council of Europe hearings into the handling of the swine flu pandemic, were strongly rejected by the WHO.\n\nFollowing the organisation’s declaration of a pandemic, the Department of Health warned of 65,000 deaths, set up a special advice line and website, and suspended normal rules so anti-flu drugs could be given without prescription.\n\nBut with just 250 or so deaths in Britain and 14,000 worldwide, the WHO is being asked to account for its actions. The Government is now trying to off-load millions of jabs it ordered at the height of the scare. Sources say it is even considering giving some doses away for free.\n\nWolfgang Wodarg, former head of health at the Council of Europe, the Strasbourg-based ‘senate’ responsible for the European Court of Human Rights, said vaccine contracts were put in place in 2007, when it was feared the more lethal bird flu virus would mutate into human form.\n\nDrug companies, which spent up to £2.5billion developing a vaccine, then pushed their interests within the WHO, leading to the definition of a pandemic being softened and an outbreak declared.", "opengraph": {"title": "Drug Firms Drove Swine Flu Pandemic Warning to Recoup Billions", "site_name": "MEDIA ROOTS – Reporting From Outside Party Lines", "type": "article", "url": "http://mediaroots.org/drug-firms-drove-swine-flu-pandemic-warning-to-recoup-billions/", "image": "http://www.mediaroots.org/wp-content/uploads/2013/04/ad2new.jpg"}, "tags": ["pharmaceutical industry"], "tweets": [], "movies": [], "links": ["http://www.dailymail.co.uk/news/article-1246370/Drug-firms-drove-swine-flu-pandemic-warning-recoup-billions-spent-research.html", "http://www.dailymail.co.uk/news/article-1246370/Drug-firms-drove-swine-flu-pandemic-warning-recoup-billions-spent-research.html"], "authors": [], "publish_date": "May 3, 2010"}