{"result_id": "196008", "URL": "https://mediaroots.org/media-roots-radio-unlocked-the-smallpox-vax-rollout-begins-hauers-biodefense-ploy-iraq-may-have-the-virus-pt-3/", "timestamp": "2023-04-25 16:19:19 CEST+0200", "meta": {"description": "Media Roots is a citizen journalism project that reports the news from outside of party lines while providing a collaborative forum for conscious citizens, artists and activists to unite.", "lang": "en", "keywords": "investigative citizen journalism, corporate misconduct, political corruption, media information, news information, media news, california real news, california oakland news, bay area real news, san francisco real news, san francisco media, media reporting, political representation, political news, art representation, media representation, news information", "favicon": "//mediaroots.org/wp-content/themes/twentyeleven/images/favicon.gif", "canonical": "//mediaroots.org/media-roots-radio-unlocked-the-smallpox-vax-rollout-begins-hauers-biodefense-ploy-iraq-may-have-the-virus-pt-3/", "encoding": "UTF-8"}, "image": null, "domain": "mediaroots.org", "title": "Media Roots Radio: UNLOCKED: the Smallpox Vax Rollout Begins, Hauer’s Biodefense Ploy, Iraq ‘May Have the Virus’ Pt 3", "cleaned_text": "Robbie Martin continues his series on the George W Bush smallpox bioterror scare, this time laying out the series of events and shining a light on the hyperbolic media coverage that culminated with the official Whitehouse smallpox vaccination rollout plan. A plan which creepily paralelled the buildup to the US invasion of Iraq. When the MSM covered smallpox bioterrorism from 2002-2003, Iraq becomes an increasingly mentioned potential suspect for unleashing this deadly plague. Why do virtually no Americans remember this additional hysterical fear mongering campaign about smallpox from Bush & Cheney? Robbie tries to figure out the answers as he takes you further down the labyrinthine memory hole of the post-9/11 era.\n\nThis is Part 3 of an ongoing Anthrax-adjacent Media Roots Radio series about Smallpox bioterrorism. ICYMI, check out the Wheel of Winter’s Darkness & Smallpox Bioterror Scares Pt 1 & the Smallpox Doomsday Failsafe Scenario, 100s of Tons of Virus ‘Missing’ Pt 2\n\nthe Smallpox Cache : bit.ly/3omWDFm\n\n[ documents compiled by Robbie Martin relevant to the smallpox story ]\n\n2002 CDC Small Pox Vaccination Plan : bit.ly/3J6GE6c\n\n[ the entire series of documents including revisions to the CDC’s smallpox bioterror response plan ]\n\nThanks for listening! If you enjoyed this podcast and would like to listen to the entire series please consider subscribing to Media Roots Radio on Patreon // www.patreon.com/mediarootsradio", "opengraph": {"title": "Media Roots Radio: UNLOCKED: the Smallpox Vax Rollout Begins, Hauer’s Biodefense Ploy, Iraq ‘May Have the Virus’ Pt 3", "site_name": "MEDIA ROOTS – Reporting From Outside Party Lines", "type": "article", "url": "http://mediaroots.org/media-roots-radio-unlocked-the-smallpox-vax-rollout-begins-hauers-biodefense-ploy-iraq-may-have-the-virus-pt-3/", "image": "http://www.mediaroots.org/wp-content/uploads/2013/04/ad2new.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://gate.sc?url=https%3A%2F%2Fbit.ly%2F3rCsuUN&token=d33c5d-1-1659693343540", "https://gate.sc?url=https%3A%2F%2Fbit.ly%2F3omWDFm&token=bc7c75-1-1659693343540", "https://gate.sc?url=https%3A%2F%2Fbit.ly%2F3J6GE6c&token=4c3c67-1-1659693343540", "https://gate.sc?url=http%3A%2F%2Fwww.patreon.com%2Fmediarootsradio&token=a21182-1-1659693343540"], "authors": [], "publish_date": "June 7, 2022"}