{"result_id": "196009", "URL": "https://mediaroots.org/media-roots-radio-pharmaceutical-terrorism-privacy/", "timestamp": "2023-04-25 16:19:19 CEST+0200", "meta": {"description": "Media Roots is a citizen journalism project that reports the news from outside of party lines while providing a collaborative forum for conscious citizens, artists and activists to unite.", "lang": "en", "keywords": "investigative citizen journalism, corporate misconduct, political corruption, media information, news information, media news, california real news, california oakland news, bay area real news, san francisco real news, san francisco media, media reporting, political representation, political news, art representation, media representation, news information", "favicon": "//mediaroots.org/wp-content/themes/twentyeleven/images/favicon.gif", "canonical": "//mediaroots.org/media-roots-radio-pharmaceutical-terrorism-privacy/", "encoding": "UTF-8"}, "image": null, "domain": "mediaroots.org", "title": "Pharmaceuticals, Terrorism & Privacy", "cleaned_text": "MEDIA ROOTS – In this edition of Media Roots radio Robbie and Abby Martin discuss pharmaceutical drugs, the co-opting of the tea party from the neo-conservatives, and go after “liberal” commentators like Jon Stewart and Bill Maher that frame the debate in a destructive way. We also break down the true threat of terrorism, and the importance of privacy in our lives.\n\nThe above timeline is interactive. Scroll through it to find out more about the show’s music and for the links to resources mentioned during the broadcast.\n\nIf you would like to directly download the podcast click the down arrow icon on the right of the soundcloud display. To see a larger version of the timeline with clickable resources go to the soundcloud link below the player. If the link is down, use an alternate backup stream HERE.\n\nListen to last week’s broadcast introducing Robbie and Abby and discussing the Obama administration.\n\nThis Media Roots podcast is the product of many long hours of hard work and love. If you want to encourage our voice, please consider supporting us as we continue to speak from outside party lines. If you donate, we want to thank you with your choice of art from AbbyMartin.org as well as music from RecordLabelRecords.org. Much of the music you hear on our podcasts comes from Robbie’s imprint Record Label Records, and Abby’s art reflects the passion and perspective that lead her to create Media Roots.\n\n$40 donation: One 8×10 art print and one RLR release (You choose! Tell us in the Paypal notes.)\n\n$80 donation: Two 8×10 art prints and two RLR releases (You choose!)\n\n$150 donation: Four 8×10 art prints and four RLR releases (You choose!)\n\nEven the smallest donations are appreciated and help us with our operating costs.\n\nThanks so much for your support!\n\nListen to all previous Media Roots Radio broadcasts here.", "opengraph": {"title": "Pharmaceuticals, Terrorism & Privacy", "site_name": "MEDIA ROOTS – Reporting From Outside Party Lines", "image": "http://www.mediaroots.org/wp-content/uploads/2013/04/ad2new.jpg", "type": "article", "url": "http://mediaroots.org/media-roots-radio-pharmaceutical-terrorism-privacy/"}, "tags": ["constitution", "terrorism", "pharmaceuticals", "media roots radio", "PRIVACY"], "tweets": [], "movies": [], "links": ["https://soundcloud.com/media-roots/media-roots-radio-episode-2", "https://soundcloud.com/media-roots", "http://www.recordlabelrecords.org/mediaroots/mediarootsradioep2.mp3", "media-roots-radio-episode-one.php", "http://www.abbymartin.org/shop.php", "http://recordlabelrecords.org/shop.html", "https://mediaroots.org/category/radio/"], "authors": [], "publish_date": "October 12, 2010"}