{"result_id": "196007", "URL": "https://mediaroots.org/to-vaccinate-or-not-to-vaccinate-can-parents-to-even-question/", "timestamp": "2023-04-25 16:19:18 CEST+0200", "meta": {"description": "Media Roots is a citizen journalism project that reports the news from outside of party lines while providing a collaborative forum for conscious citizens, artists and activists to unite.", "lang": "en", "keywords": "investigative citizen journalism, corporate misconduct, political corruption, media information, news information, media news, california real news, california oakland news, bay area real news, san francisco real news, san francisco media, media reporting, political representation, political news, art representation, media representation, news information", "favicon": "//mediaroots.org/wp-content/themes/twentyeleven/images/favicon.gif", "canonical": "//mediaroots.org/to-vaccinate-or-not-to-vaccinate-can-parents-to-even-question/", "encoding": "UTF-8"}, "image": null, "domain": "mediaroots.org", "title": "Forced Vaccinations: Can Parents Question it?", "cleaned_text": "MEDIA ROOTS – In California, Assembly Bill 2109 is generating more controversy over some parents’ decision to opt-out from certain vaccines for their children. According to the National Vaccine Information Center, an advocacy organization that promotes parental choice over government mandate, AB2109 is a direct threat to parental sovereignty because it would require additional doctor’s visits and required paperwork for those parents opting-out from particular vaccinations for their children.\n\nOver the weekend, actor and comedian Rob Schneider met with News10 out of Sacramento to discuss why he’s against the legislation. Schneider, along with fellow celebrity Jenny McCarthy who co-founded the autism support network Generation Rescue, believe a link between vaccinations and autism exists which is why they would have their children opt-out. However, multiple scientific studies have been conducted to dispel the link. Regardless, Schneider adamantly testifies that parents should become more knowledgeable about the issue by reading The Vaccine Guide by Randall Neustaedter before making their own decision.\n\nControversy over the use of vaccines has existed since the first vaccine was used in the 18th century to prevent the outbreak of small pox. Today, there is no doubt that the vaccine industry is big business. While the pharmaceutical industry spends nearly $200 million per year lobbying the federal government, commercials for vaccines now grace TV screens in certain parts of the United States.\n\nActor and comedian Rob Schneider discusses his view of AB2109 in California.", "opengraph": {"title": "Forced Vaccinations: Can Parents Question it?", "site_name": "MEDIA ROOTS – Reporting From Outside Party Lines", "image": "http://www.mediaroots.org/wp-content/uploads/2013/04/ad2new.jpg", "type": "article", "url": "http://mediaroots.org/to-vaccinate-or-not-to-vaccinate-can-parents-to-even-question/"}, "tags": ["autism", "vaccinations"], "tweets": [], "movies": [], "links": ["http://www.leginfo.ca.gov/pub/11-12/bill/asm/ab_2101-2150/ab_2109_bill_20120620_amended_sen_v97.html", "http://www.kcra.com/news/Legislation-aimed-at-opt-out-parents/-/11797728/15327058/-/km3mmk/-/index.html", "http://nvicadvocacy.org/members/Resources/CAOPPOSEAB2109RestrictingVaccineExemptions.aspx", "http://www.news10.net/video/1709953692001/1/Actor-comedian-Rob-Schneider-talks-about-AB2109", "http://www.generationrescue.org/", "http://www.nytimes.com/2011/08/26/health/26vaccine.html", "https://books.google.com/books/about/The_Vaccine_Guide.html?id=_2ov3jPP53oC", "http://www.drugwatch.com/influence-of-big-pharma.php", "https://www.youtube.com/watch?v=nku0Ed3tfmo"], "authors": [], "publish_date": "July 2, 2012"}