{"result_id": "196017", "URL": "https://mediaroots.org/family-to-receive-1-5m-in-vaccine-autism-court-award/", "timestamp": "2023-04-25 16:19:26 CEST+0200", "meta": {"description": "Media Roots is a citizen journalism project that reports the news from outside of party lines while providing a collaborative forum for conscious citizens, artists and activists to unite.", "lang": "en", "keywords": "investigative citizen journalism, corporate misconduct, political corruption, media information, news information, media news, california real news, california oakland news, bay area real news, san francisco real news, san francisco media, media reporting, political representation, political news, art representation, media representation, news information", "favicon": "//mediaroots.org/wp-content/themes/twentyeleven/images/favicon.gif", "canonical": "//mediaroots.org/family-to-receive-1-5m-in-vaccine-autism-court-award/", "encoding": "UTF-8"}, "image": null, "domain": "mediaroots.org", "title": "Family to Receive $1.5M+ in Vaccine-Autism Court Award", "cleaned_text": "CBS NEWS– The first court award in a vaccine-autism claim is a big one. CBS News has learned the family of Hannah Poling will receive more than $1.5 million dollars for her life care; lost earnings; and pain and suffering for the first year alone.\n\nIn addition to the first year, the family will receive more than $500,000 per year to pay for Hannah’s care. Those familiar with the case believe the compensation could easily amount to $20 million over the child’s lifetime.\n\nHannah was described as normal, happy and precocious in her first 18 months.\n\nThen, in July 2000, she was vaccinated against nine diseases in one doctor’s visit: measles, mumps, rubella, polio, varicella, diphtheria, pertussis, tetanus, and Haemophilus influenzae.\n\nAfterward, her health declined rapidly. She developed high fevers, stopped eating, didn’t respond when spoken to, began showing signs of autism, and began having screaming fits. In 2002, Hannah’s parents filed an autism claim in federal vaccine court. Five years later, the government settled the case before trial and had it sealed. It’s taken more than two years for both sides to agree on how much Hannah will be compensated for her injuries.\n\nContinue reading about Family to Receive $1.5M+ in Vaccine-Autism Court Award.", "opengraph": {"title": "Family to Receive $1.5M+ in Vaccine-Autism Court Award", "site_name": "MEDIA ROOTS – Reporting From Outside Party Lines", "image": "http://www.mediaroots.org/wp-content/uploads/2013/04/ad2new.jpg", "type": "article", "url": "http://mediaroots.org/family-to-receive-1-5m-in-vaccine-autism-court-award/"}, "tags": ["health", "united states"], "tweets": [], "movies": [], "links": ["http://www.cbsnews.com/8301-31727_162-20015982-10391695.html", "http://www.uscfc.uscourts.gov/sites/default/files/CAMPBELLSMITH.%20DOE77082710.pdf", "http://www.cbsnews.com/8301-31727_162-20015982-10391695.html"], "authors": [], "publish_date": "September 22, 2010"}