{"result_id": "196018", "URL": "http://mediaroots.org/gmo-foods-pose-higher-risks-for-children/", "timestamp": "2023-04-25 16:19:27 CEST+0200", "meta": {"description": "Media Roots is a citizen journalism project that reports the news from outside of party lines while providing a collaborative forum for conscious citizens, artists and activists to unite.", "lang": "en", "keywords": "investigative citizen journalism, corporate misconduct, political corruption, media information, news information, media news, california real news, california oakland news, bay area real news, san francisco real news, san francisco media, media reporting, political representation, political news, art representation, media representation, news information", "favicon": "//mediaroots.org/wp-content/themes/twentyeleven/images/favicon.gif", "canonical": "//mediaroots.org/gmo-foods-pose-higher-risks-for-children/", "encoding": "UTF-8"}, "image": null, "domain": "mediaroots.org", "title": "GMO Foods Pose Higher Risks for Children", "cleaned_text": "FOOD CONSUMER– Children face the greatest risk from the potential dangers of GM foods:\n\n*Children are more susceptible to allergies\n\n*Children are more susceptible to problems with milk\n\n*Children are more susceptible to nutritional problems\n\n*Children are in danger from antibiotic resistant diseases\n\nChildren’s bodies develop at a fast pace and are more likely to be influenced and show the effects of genetically modified (GM) foods. That is why independent scientists used young adolescent rats in their GM feeding studies. The rats showed significant health damage after only 10 days, including damaged immune systems and digestive function, smaller brains, livers, and testicles, partial atrophy of the liver, and potentially pre-cancerous cell growth in the intestines.\n\nChildren are more susceptible to allergies\n\nChildren are three to four times more prone to allergies than adults. Infants below two years old are at greatest risk-they have the highest incidence of reactions, especially to new allergens encountered in the diet. Even tiny amounts of allergens can sometimes cause reactions in children. Breast fed infants can be exposed via the mother’s diet, and fetuses may possibly be exposed in the womb. Michael Meacher, the former minister of the environment for the UK, said, “Any baby food containing GM products could lead to a dramatic rise in allergies.” GM corn is particularly problematic for children, as they generally eat a higher percentage of corn in their diet. Further, allergic children often rely on corn protein. Mothers using cornstarch as a talc substitute on their children’s skin might also inadvertently expose them via inhalation.\n\nChildren are more susceptible to problems with milk\n\nMilk and dairy products from cows treated with the genetically engineered bovine growth hormone (rbGH) contain an increased amount of the hormone IGF-1, which is one of the highest risk factors associated with breast and prostate cancer. The Council on Scientific Affairs of the American Medical Association called for more studies to determine if ingesting “higher than normal concentrations of [IGF-1] is safe for children, adolescents, and adults.” Sam Epstein, M.D., Chairman of the Cancer Prevention Coalition and author of eight books, wrote, “rbGH and its digested products could be absorbed from milk into blood, particularly in infants, and produce hormonal and allergic effects.” He described how “cell-stimulating growth factors . . . could induce premature growth and breast stimulation in infants, and possibly promote breast cancer in adults.” Dr. Epstein pointed out that the hormones in cows could promote the production of “steroids and adrenaline-type stressor chemicals . . . likely to contaminate milk and may be harmful, particularly to infants and young children.”\n\nChildren are more susceptible to nutritional problems\n\nA 2002 report by the UK’s Royal Society, said that genetic modification “could lead to unpredicted harmful changes in the nutritional state of foods.” They therefore recommended that potential health effects of GM foods be rigorously researched before being fed to pregnant or breast-feeding women, elderly people, those suffering from chronic disease, and babies. Likewise, according to former minister Meacher, unexpected changes in estrogen levels in GM soy used in infant formula “might affect sexual development in children,” and that “even small nutritional changes could cause bowel obstruction.”\n\nRead more about GMO Foods Pose Higher Risks for Children", "opengraph": {"title": "GMO Foods Pose Higher Risks for Children", "site_name": "MEDIA ROOTS – Reporting From Outside Party Lines", "image": "http://www.mediaroots.org/wp-content/uploads/2013/04/ad2new.jpg", "type": "article", "url": "http://mediaroots.org/gmo-foods-pose-higher-risks-for-children/"}, "tags": ["Pesticides", "Soy", "Genetically Modified Organisms", "Vegetables"], "tweets": [], "movies": [], "links": ["http://responsibletechnology.org/gmo-dangers/higher-risks-for-children", "http://responsibletechnology.org/gmo-dangers/higher-risks-for-children", "http://responsibletechnology.org/gmo-dangers/higher-risks-for-children"], "authors": [], "publish_date": "May 10, 2011"}