{"result_id": "196011", "URL": "https://mediaroots.org/humanely-or-not-eating-and-wearing-animals-is-never-moral/", "timestamp": "2023-04-25 16:19:21 CEST+0200", "meta": {"description": "Media Roots is a citizen journalism project that reports the news from outside of party lines while providing a collaborative forum for conscious citizens, artists and activists to unite.", "lang": "en", "keywords": "investigative citizen journalism, corporate misconduct, political corruption, media information, news information, media news, california real news, california oakland news, bay area real news, san francisco real news, san francisco media, media reporting, political representation, political news, art representation, media representation, news information", "favicon": "//mediaroots.org/wp-content/themes/twentyeleven/images/favicon.gif", "canonical": "//mediaroots.org/humanely-or-not-eating-and-wearing-animals-is-never-moral/", "encoding": "UTF-8"}, "image": null, "domain": "mediaroots.org", "title": "The Case for Vegetarianism You’ve Never Heard Before", "cleaned_text": "When I was in 5th grade, I was obsessed with animals. It was an age where most of my friends were going through the phase of wanting to be either a veterinarian or whale trainer at Sea World (yes, this was before Blackfish).\n\nMy love for animals may have been innocent and ill-informed early on, but it led me to become passionate about animal rights.\n\nOver the years, vegetarianism has stuck with me despite the fact that most of my friends, family, and men I’ve dated eat meat. It certainly hasn’t been easy – but it’s been worth it. People might never stop asking me why I don’t eat meat, but my answer will remain simple and the same: I like animals too much to bring myself to eat them.\n\nYet Gary Francione, a self proclaimed animal abolitionist, has a much more sophisticated argument in favor of vegetarianism. Rather than focusing merely on the treatment of animals, Francione defines “animal abolitionism” as the inability to “justify using animals at all, no matter how humanely we treat them”. He’s structured a moral argument against the alleged necessary use of animal products, particularly with the advent of technology and alternative materials like hemp.\n\nAnd whilst Francione acknowledges that animals are cognitively different than humans, he explains why it still doesn’t justify the consumption and use of animals for our benefit. Francione argues that the cognitive differences don’t matter morally, because animals are sentient.\n\nHe underscores this by posing a scenario comparing two different human beings: one who is brilliant and one who is mentally disabled. Whilst the two humans are “different” from one another, Francione points out that a cognitive difference would not justify, for example, subjecting the disabled individual to a harmful biomedical experiment.\n\nSo why would we do the same to animals?\n\nWell, as Francione points out, animals are little more than helpless resources at the hands of exploitative human beings. But “how can you justify using a sentient being exclusively as a resource?” Francione asks.\n\nEven back in 1884, Henry David Thoreau proposed “… that it is a part of the destiny of the human race, in its gradual improvement, to leave off eating animals…” just as “savage” humans “have left off eating each other”.\n\nWritten by Anya Parampil for Media Roots, Photo by flickr user b3d", "opengraph": {"title": "The Case for Vegetarianism You’ve Never Heard Before", "site_name": "MEDIA ROOTS – Reporting From Outside Party Lines", "type": "article", "url": "http://mediaroots.org/humanely-or-not-eating-and-wearing-animals-is-never-moral/", "image": "http://www.mediaroots.org/wp-content/uploads/2013/04/ad2new.jpg"}, "tags": ["vegetarianism", "consumerism", "abby martin", "veganism", "INTERVIEWS", "food", "philosophy", "breaking the set", "morality"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe frameborder=\"0\" height=\"315\" src=\"//www.youtube.com/embed/QIcRDen6PEU?rel=0\" width=\"560\"/>", "src": "//www.youtube.com/embed/QIcRDen6PEU?rel=0"}], "links": ["http://blackfishmovie.com/"], "authors": [], "publish_date": "June 9, 2014"}