{"result_id": "197013", "URL": "https://www.medicalcensorship.com/2022-08-26-twitter-colluded-cdc-silence-covid-vaccine-questioning.html", "timestamp": "2023-04-25 16:19:40 CEST+0200", "meta": {"description": "It has come to light that tech giant Twitter has been actively colluding with the Centers for Disease Control and Prevention (CDC) and other government agencies to silence free speech. Carol Crawford, the CDC’s chief of digital media, engaged in conversations with Twitter employees about how to deal with “unapproved opinions” concerning the Wuhan coronavirus […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Tech,CDC,censorship,collusion,conspiracy,COVID,deception,deep state,First Amendment,free speech,Medical Tyranny,official narrative,Plandemic,Social media,technocrats,Twitter,tyranny,vaccines,violation", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2022-08-26-twitter-colluded-cdc-silence-covid-vaccine-questioning.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "Social media Gestapo: Twitter engaged in illegal COLLUSION with CDC to silence anyone questioning covid vaccines", "cleaned_text": "Social media Gestapo: Twitter engaged in illegal COLLUSION with CDC to silence anyone questioning covid vaccines\n\nIt has come to light that tech giant Twitter has been actively colluding with the Centers for Disease Control and Prevention (CDC) and other government agencies to silence free speech.\n\nCarol Crawford, the CDC’s chief of digital media, engaged in conversations with Twitter employees about how to deal with “unapproved opinions” concerning the Wuhan coronavirus (Covid-19). Part of that exchange included rhetoric about the “tricky” nature of dealing with it, especially since at the time CEO Jack Dorsey was called to testify before Congress about his platform’s censorship habits.\n\n“We don’t have a censoring department,” Dorsey is quoted as saying, even as his people were actively conversing with the CDC and other public health entities about ways to steamroll the First Amendment. (Related: The only time Twitter opposes censorship is when Twitter is being censored by someone else.)\n\nDoes Twitter have the right to silence whomever it wants?\n\nOnce Dorsey was through lying to Congress about what Twitter does, the social media platform proceeded to de-platform, shadow-ban and permanently remove doctors, scientists and others who dared to defy the official narrative about the plandemic.\n\nAll of a sudden, users with “unapproved opinions” were seeing their tweets deleted or their accounts axed. This prompted numerous lawsuits, including one filed by former New York Times science reporter Alex Berenson.\n\nJust the other day, in fact, a doctor who raised concerns about Pfizer’s covid “vaccine” records was suspended from the platform. This once again shows that Twitter’s censorship brigade – you know, the one Dorsey says does not exist – is alive and well.\n\nThis continued affront to free speech by Twitter has prompted several doctors, including Jayanta Bhattacharya of Stanford University and Martin Kulldorff of Harvard University to file a joint lawsuit with the states of Missouri and Louisiana against Twitter.\n\nThe aforementioned doctor who was suspended from Twitter is Dr. Clare Craig, and Bhattacharya, Kulldorff and the two states are coming to bat for her by arguing that Twitter had no right to silence her and her account.\n\n“Those doctors were the co-authors of the Great Barrington Declaration, which advocated for a more focused Covid response that targeted the most vulnerable population rather than widespread lockdowns and mandates,” writes Jonathan Turley on his blog about Bhattacharya and Kulldorff.\n\n“Many are now questioning the efficacy and cost of the massive lockdown as well as the real value of masks or the rejection of natural immunities as an alternative to vaccination.”\n\nTwitter of course opposes the Great Barrington Declaration, viewing it as dangerous because it suggests that the Wuhan coronavirus (Covid-19) may have been created in a Chinese laboratory and released as a bioweapon.\n\nBecause said research implicates Tony Fauci, who helped fund the illegal gain-of-research that was taking place in Wuhan at the time when the Fauci Flu appeared out of nowhere, Twitter and other Big Tech platforms are trying to keep it hidden away and out of view.\n\n“Fauci and other leading experts now admit that the lab theory is a real possibility, even if they do not agree that it is the best explanation,” Turley further explains. “Social media companies like Facebook declared that the previously banned ‘conspiracy theory’ would now be allowed to be discussed.”\n\n“Indeed, many of the views that the media attacked as conspiracy theories or debunked are now again being seriously considered. That includes claims of adverse responses to the vaccines, natural immunity protection, and the psychological costs from masking or isolation, particularly among children. None of these views are inviolate or beyond question – any more than the official accounts were at the time.”\n\nMore news about Big Tech’s assault on free speech can be found at Censorship.news.", "opengraph": {"title": "Social media Gestapo: Twitter engaged in illegal COLLUSION with CDC to silence anyone questioning covid vaccines", "type": "article", "url": "https://www.medicalcensorship.com/2022-08-26-twitter-colluded-cdc-silence-covid-vaccine-questioning.html", "site_name": "Medical Censorship News", "description": "It has come to light that tech giant Twitter has been actively colluding with the Centers for Disease Control and Prevention (CDC) and other government agencies to silence free speech. Carol Crawford, the CDC’s chief of digital media, engaged in conversations with Twitter employees about how to deal with “unapproved opinions” concerning the Wuhan coronavirus […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2022/08/Twitter-Censorship-Zipper-Mouth.jpg"}, "tags": ["conspiracy", "deep state", "COVID", "deception", "violation", "Twitter", "CDC", "collusion", "technocrats", "First Amendment", "Big Tech", "Medical Tyranny", "Social media", "censorship", "vaccines", "tyranny", "official narrative", "free speech", "Plandemic"], "tweets": [], "movies": [], "links": ["https://jonathanturley.org/2022/08/24/twitters-tricky-timing-problem-lawsuit-reveals-back-cdc-channel-to-coordinate-censorship/", "https://naturalnews.com/2021-01-15-twitter-opposes-censorship-only-when-affects-twitter.html", "http://www.stanford.edu", "http://www.harvard.edu", "http://censorship.news", "https://jonathanturley.org/2022/08/24/twitters-tricky-timing-problem-lawsuit-reveals-back-cdc-channel-to-coordinate-censorship/", "https://naturalnews.com/2021-01-15-twitter-opposes-censorship-only-when-affects-twitter.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2022-08-26-twitter-colluded-cdc-silence-covid-vaccine-questioning.html&linkname=Social%20media%20Gestapo%3A%20Twitter%20engaged%20in%20illegal%20COLLUSION%20with%20CDC%20to%20silence%20anyone%20questioning%20covid%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}