{"result_id": "197007", "URL": "https://www.medicalcensorship.com/2021-06-28-twitter-locks-news-site-following-vaccination-death.html", "timestamp": "2023-04-25 16:19:36 CEST+0200", "meta": {"description": "Twitter locked the account of conservative news website National File after it reported on a tweet about the death of a vaccinated 13-year-old. The social media platform locked the National File‘s Twitter account for a 12-hour period. Twitter later claimed that the move was done “in error” and the website was granted access to its […]", "lang": "en", "keywords": "banned,biased censorship,Big Pharma,Big Tech,BioNTech,censored,censorship,coronavirus vaccine,covid-19 pandemic,Jacob Clynick,National File,Pfizer,Social media,tech giants,Twitter,vaccine death,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2021-06-28-twitter-locks-news-site-following-vaccination-death.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "Twitter locks news site’s account after it reported a vaccinated boy’s death", "cleaned_text": "Twitter locked the account of conservative news website National File after it reported on a tweet about the death of a vaccinated 13-year-old. The social media platform locked the National File‘s Twitter account for a 12-hour period. Twitter later claimed that the move was done “in error” and the website was granted access to its account once more.\n\nAccording to the National File, the temporary restriction stemmed from its report about tweets from a woman named Tami Burages. The woman claimed her 13-year-old nephew Jacob Clynick died after his second dose of the Pfizer/BioNTech Wuhan coronavirus (COVID-19) vaccine.\n\nBurages tweeted that the initial autopsy results on Clynick showed an “enlarged heart … [with] some fluid surrounding it.” She added that her nephew had no known health problems and was not on any medication. “Should any innocent child be a sacrificial lamb in this endeavor? There are moral, ethical and health questions that need to be answered. If Jacob had not received the second shot, we believe he would be alive today,” Burages continued.\n\nLater, a Twitter spokesperson confirmed that the National File lockout was done in error and the website had been allowed to access to its account again. According to the social media site, the temporary 12-hour ban stemmed from the website allegedly violating Twitter rules on “spreading misleading and potentially harmful information related to COVID-19.”\n\nWhile the National File regained access to its account, it noted that Twitter suspended its reporter Jack Hadfield. The news site added that Hadfield was blocked from the social media platform “for celebrating Twitter’s decision to reverse the suspension.”\n\nIn a statement, National File Editor-In-Chief Tom Pappert said: “Twitter’s censorship here is as repugnant as it is ridiculous. We published a report containing direct quotes from a woman who – using Twitter – expressed concern about the death of her 13-year-old nephew … after he received the [Pfizer/BioNTech] COVID-19 vaccine.”\n\nHe added that the social media site headed by Jack Dorsey “is attempting to censor news outlets for the crime of reporting on the concerns of a recently bereaved family member.” Pappert then concluded his statement: “It is very unfortunate that Twitter would attempt to prevent this family from sharing its truth and its concerns about the [Pfizer/BioNTech] COVID-19 vaccine only days after [Clynick’s] untimely and heartbreaking death.”\n\nTwitter in cahoots with Big Pharma with censorship of the truth about COVID-19 vaccines\n\nTwitter’s lockout of the National File following its report of Clynick’s death was not the first time it suppressed voices questioning the COVID-19 narrative. In early June 2021, the platform suspended the Informed Consent Action Network (ICAN) after the organization announced it will publish more emails from top infectious disease expert Dr. Anthony Fauci. Emails from the director of the National Institute of Allergy and Infectious Diseases (NIAID) were made public following a Freedom of Information Act request sent by mainstream media outlets Washington Post and BuzzFeed.\n\nICAN was suspended twice on June 3 after it tweeted that it would drop “3,000 new pages of … Fauci emails” that provided “further insight” on the NIAID director’s actions on COVID-19, vaccine safety and more. Conservative commentator Michelle Malkin posted a screenshot of a message ICAN received on her Twitter account. According to the message, ICAN’s Twitter account had been locked due to its June 3 tweet allegedly flouting the site’s rules on “spreading misleading and potentially harmful information” about the pandemic.\n\nThe next day, Twitter walked back on its suspension of the informed consent advocacy group. National File reached out to the social media site for its comment on ICAN’s ban. Just like in the instance with Burages, a Twitter spokesperson claimed the “enforcement action” on ICAN was done “in error.” They added that the suspension has been reversed, with ICAN having their tweets and account functionality restored.\n\nICAN Founder Del Bigtree told National File: “I’m glad that they’ve done what is correct, but when the kneejerk reaction is to censor simply a factual statement – which is emails are going to be forthcoming – it really makes you have to question what type of infrastructure [Twitter is] working with. How does that mistake get made, and how does it get made twice?”\n\nTwitter’s censorship also extended to progressive Democrats who dared to question COVID-19 vaccines and vaccine passports. Former Clinton administration adviser Dr. Naomi Wolf, who was critical of these two, saw herself being suspended on the social media platform. During an interview with LifeSiteNews, she claimed that Twitter did not provide a reason for her suspension.\n\nWolf said: “Twitter did not inform me why I was suspended. [The] accounts in the news stories that make claims that I was suspended for ‘conspiracy theories’ and ‘anti-vaxx’ [information] are not correct.” On the other hand, Twitter explained that the former campaign aide and lifelong progressive Democrat shared “misinformation about COVID-19 vaccines” that led to her suspension.\n\nShe nevertheless warned: “[This] systematic de-platforming is very terrifying for democracy. [It’s] extremely disturbing to see Twitter … systematically de-platforming conservative voices.”\n\nVisit Censorship.news to read more articles about Big Tech companies suppressing voices that go against the COVID-19 narrative.", "opengraph": {"title": "Twitter locks news site’s account after it reported a vaccinated boy’s death", "type": "article", "url": "https://www.medicalcensorship.com/2021-06-28-twitter-locks-news-site-following-vaccination-death.html", "site_name": "Medical Censorship News", "description": "Twitter locked the account of conservative news website National File after it reported on a tweet about the death of a vaccinated 13-year-old. The social media platform locked the National File‘s Twitter account for a 12-hour period. Twitter later claimed that the move was done “in error” and the website was granted access to its […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2021/06/Censored-Twitter-Lock-Computer-Keyboard.jpg"}, "tags": ["BioNTech", "Big Pharma", "Jacob Clynick", "banned", "biased censorship", "tech giants", "coronavirus vaccine", "National File", "covid-19 pandemic", "Twitter", "Pfizer", "censored", "censorship", "Social media", "vaccine death", "Wuhan coronavirus", "Big Tech"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/twitter-locks-news-sites-account-for-report-on-teen-boy-dying-after-getting-vaccine_3869418.html", "https://nationalfile.com/13-year-old-boy-dies-three-days-after-taking-second-covid-shot/", "https://www.breitbart.com/the-media/2021/06/21/twitter-censors-conservative-news-site-for-story-on-tweet-reporting-coronavirus-vaccine-death/", "https://nationalfile.com/breaking-twitter-suspends-organization-for-announcing-they-will-release-more-fauci-emails/", "https://www.naturalnews.com/2021-06-08-twitter-working-on-new-censorship-shtick.html", "https://nationalfile.com/breaking-twitter-admits-suspending-ican-in-error-restores-their-account-after-national-file-reports/", "https://www.naturalnews.com/2021-06-18-ex-clinton-advisor-banned-from-twitter.html", "https://www.lifesitenews.com/news/exclusive-ex-clinton-advisor-banned-from-twitter-de-platforming-is-terrifying-for-democracy", "https://censorship.news/", "https://techgiants.news", "https://www.theepochtimes.com/twitter-locks-news-sites-account-for-report-on-teen-boy-dying-after-getting-vaccine_3869418.html", "https://nationalfile.com/13-year-old-boy-dies-three-days-after-taking-second-covid-shot/", "https://www.breitbart.com/the-media/2021/06/21/twitter-censors-conservative-news-site-for-story-on-tweet-reporting-coronavirus-vaccine-death/", "https://nationalfile.com/breaking-twitter-suspends-organization-for-announcing-they-will-release-more-fauci-emails/", "https://nationalfile.com/breaking-twitter-admits-suspending-ican-in-error-restores-their-account-after-national-file-reports/", "https://www.lifesitenews.com/news/exclusive-ex-clinton-advisor-banned-from-twitter-de-platforming-is-terrifying-for-democracy"], "authors": [], "publish_date": null}