{"result_id": "197038", "URL": "https://medicalcensorship.com/2022-03-17-one-covid-vaccine-death-is-too-many.html", "timestamp": "2023-04-25 16:19:56 CEST+0200", "meta": {"description": "For Dr. Peter McCullough, one death linked to the Wuhan coronavirus (COVID-19) vaccine is too many. As of March 4, the Vaccine Adverse Event Reporting System (VAERS) has received a total of 25,158 reports of deaths following COVID-19 vaccinations. “One death is too many. One was too many. Under no circumstances, under any circumstances, should […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,CDC,conspiracy,covid-19,Dangerous Medicine,deception,FDA,heart disease,heart health,hydroxychloroquine,medical censorship,myocarditis,Peter McCullough,pharmaceutical fraud,Vaccine deaths,vaccine injury,vaccines,VAERS", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://medicalcensorship.com/2022-03-17-one-covid-vaccine-death-is-too-many.html", "encoding": "UTF-8"}, "image": null, "domain": "medicalcensorship.com", "title": "Dr. Peter McCullough: One COVID vaccine death is too many", "cleaned_text": "Dr. Peter McCullough: One COVID vaccine death is too many\n\nFor Dr. Peter McCullough, one death linked to the Wuhan coronavirus (COVID-19) vaccine is too many. As of March 4, the Vaccine Adverse Event Reporting System (VAERS) has received a total of 25,158 reports of deaths following COVID-19 vaccinations.\n\n“One death is too many. One was too many. Under no circumstances, under any circumstances, should a young person ever receive one of these vaccines, let alone ever be pressured to receive a vaccine, let alone ever be mandated to take a vaccine,” McCullough said at a roundtable discussion hosted by Wisconsin Senator Ron Johnson a few weeks ago.\n\nFor a largely ineffective vaccine that can’t stop infection, transmission or hospitalization, one death associated with it is indeed too many.\n\nMcCullough specifically mentioned the young because they have less to gain from the vaccine and more to lose. Children and young adults are at risk of developing myocarditis following COVID-19 vaccination.\n\nThe condition occurs mostly in young boys. Heart inflammation was not identified as an adverse reaction during the safety trials, but the Food and Drug Administration (FDA) added a warning in June last year stating possible links of Pfizer’s and Moderna’s mRNA vaccines to cases of myocarditis in teenagers and young adults.\n\nMyocarditis is not mild, says McCullough\n\nBig Pharma companies and public health agencies are insisting that cases of myocarditis following vaccination are rare and mild. (Related: COVID vaccines found to increase risk of myocarditis in children by over 13,000 percent.)\n\nSaying that it’s rare is up for debate, but calling it mild is a bit of a stretch.\n\n“I’m telling you as a specialist, myocarditis is not mild. There are papers showing when they do MRI on these individuals with suspected myocarditis, 100 percent are having heart damage,” said McCullough, a renowned cardiologist and highly published medical scientist.\n\nIt is extremely serious as the heart muscle becomes incapable of regenerating. Eventually, myocarditis weakens the heart so the rest of the body doesn’t get enough blood. Clots can then form in the heart, leading to a stroke or heart attack. Other complications of the condition include sudden cardiac death.\n\nThe Joint Committee on Vaccination and Immunization, an independent expert advisory committee that advises the U.K.’s health departments on immunization, recently issued a published advice citing a study conducted by the Centers for Disease Control and Prevention (CDC), which concluded that only two cases of vaccine-related myocarditis have been reported per one million doses of COVID-19 vaccine administered.\n\nThe published advice also stated that in order to prevent 0.5 ICU admissions among children aged five to 11 due to COVID-19, 1.9 million children will need to be vaccinated with two doses of the Pfizer injectable.\n\nBased on those numbers, there will be 15.2 children aged five to 11 who will develop myocarditis per 7.6 million doses – the same number of doses needed to prevent a single ICU admission from that age-group.\n\nEffective COVID treatments suppressed by government to pave way for vaccines\n\nThese vaccines wouldn’t have been needed if effective drugs and treatments against COVID-19 were not suppressed early on by the government. One of those drugs is hydroxychloroquine.\n\n“Early in 2020, Henry Ford [Health System] did a big early treatment study in the hospital with hydroxychloroquine. Thousands of patients consented, producing high-quality data that show hydroxychloroquine is associated with a reduced risk of mortality when used early in the hospital,” McCullough told host Del Bigtree when he appeared as a studio guest in a recent episode of “The HighWire.”\n\n“I previously was a program director at Henry Ford, I had colleagues there. We were communicating and then I got a call from [then-Trump administration’s Assistant to the President] Peter Navarro in the White House in the spring of 2020, saying we are stuck, that there was an emergency use authorization [EUA] put on hydroxychloroquine, effectively restricting it.”\n\nMcCullough explained that hydroxychloroquine is a fully approved drug by the FDA, thus there’s no need for an EUA.\n\nOn June 15, 2020, the FDA revoked the drug’s EUA.\n\n“Based on its ongoing analysis of the EUA and emerging scientific data, the FDA determined that chloroquine and hydroxychloroquine are unlikely to be effective in treating COVID-19 for the authorized uses in the EUA,” the FDA said in a press release at the time.\n\n“Additionally, in light of ongoing serious cardiac adverse events and other potential serious side effects, the known and potential benefits of chloroquine and hydroxychloroquine no longer outweigh the known and potential risks for the authorized use.”\n\nThe FDA was alluding to the paper published by the Lancet linking hydroxychloroquine to “increased frequency of ventricular arrhythmias when used for treatment of COVID-19.” The Lancet has since retracted the publication of the fraudulent paper.\n\nBut the damage has been done. (Related: How a false hydroxychloroquine narrative was created.)\n\nThe FDA’s statement served as a death sentence for the use of chloroquine and hydroxychloroquine as a treatment for COVID-19 and essentially killed tens of thousands of COVID-19 patients around the world.\n\nSlowly but surely, however, the narrative is changing. McCullough noted that hydroxychloroquine is now in the official government recommendations in over 30 countries and endorsed by 50 to 60 non-governmental organizations. “It’s interesting how in the first few months or so of hydroxychloroquine use, all we heard was hydroxychloroquine is dangerous for the heart, right?” he said.\n\nFollow Vaccines.news for more news related to COVID-19 vaccines.\n\nWatch the video below to learn more about the dangers of COVID-19 vaccines.\n\nThis video is from The HighWire with Del Bigtree channel on Brighteon.com.\n\nThe Big Logic: Lack of COVID-19 treatment protocol is reckless, says Dr. Peter McCullough.\n\nDr. Peter McCullough: Covid vaccines are killing babies in the first trimester at an astonishing rate… an “atrocity” to vaccinate expectant mothers.\n\nBreggin, McCullough warn that vaccines are more dangerous than COVID-19 – Brighteon.TV.", "opengraph": {"title": "Dr. Peter McCullough: One COVID vaccine death is too many", "type": "article", "url": "https://www.medicalcensorship.com/2022-03-17-one-covid-vaccine-death-is-too-many.html", "site_name": "Medical Censorship News", "description": "For Dr. Peter McCullough, one death linked to the Wuhan coronavirus (COVID-19) vaccine is too many. As of March 4, the Vaccine Adverse Event Reporting System (VAERS) has received a total of 25,158 reports of deaths following COVID-19 vaccinations. “One death is too many. One was too many. Under no circumstances, under any circumstances, should […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2022/05/Biohazard-Needle-Syringe-Vaccine-Poison.jpg"}, "tags": ["conspiracy", "big government", "covid-19", "heart health", "Big Pharma", "medical censorship", "Vaccine deaths", "VAERS", "FDA", "deception", "myocarditis", "vaccine injury", "vaccines", "pharmaceutical fraud", "heart disease", "Peter McCullough", "hydroxychloroquine", "CDC"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/a1bfbbd6-a764-41eb-a8b4-dec37249cd71", "https://childrenshealthdefense.org/defender/vaers-cdc-seven-year-old-died-cardiac-arrest-pfizer-shot/", "http://vaccineinjurynews.com", "https://naturalnews.com/2022-03-01-covid-vaccines-increase-risk-of-myocarditis-in-children-by-over-13000-percent.html", "http://heartdisease.news", "https://dailyexpose.uk/2022/02/23/800k-kids-missed-school-adverse-reaction-covid-jab/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-revokes-emergency-use-authorization-chloroquine-and", "https://naturalnews.com/2020-08-27-how-a-false-hydroxychloroquine-narrative-was-created.html", "https://vaccines.news/", "https://www.brighteon.com/a1bfbbd6-a764-41eb-a8b4-dec37249cd71", "https://www.brighteon.com/channels/highwire", "https://naturalnews.com/2022-01-16-covid-treatment-protocols-reckless-says-peter-mccullough.html", "https://vaccines.news/2021-12-03-covid-vaccine-induced-diseases-public-health-threat.html", "https://naturalnews.com/2021-07-01-dr-peter-mccullough-covid-vaccines-killing-babies.html", "https://newstarget.com/2022-01-19-vaccines-more-dangerous-than-covid-itself.html", "https://www.brighteon.com/a1bfbbd6-a764-41eb-a8b4-dec37249cd71", "https://childrenshealthdefense.org/defender/vaers-cdc-seven-year-old-died-cardiac-arrest-pfizer-shot/", "https://dailyexpose.uk/2022/02/23/800k-kids-missed-school-adverse-reaction-covid-jab/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-revokes-emergency-use-authorization-chloroquine-and", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2022-03-17-one-covid-vaccine-death-is-too-many.html&linkname=Dr.%20Peter%20McCullough%3A%20One%20COVID%20vaccine%20death%20is%20too%20many", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}