{"result_id": "197010", "URL": "https://www.medicalcensorship.com/2023-01-13-lawsuit-legacy-media-collusion-censorship-covid.html", "timestamp": "2023-04-25 16:19:38 CEST+0200", "meta": {"description": "Independent media outlets, health freedom activists and respected medical professionals have banded together to file a lawsuit against some of the world’s largest legacy media conglomerates over their collusion to silence small competitors critical of Wuhan coronavirus (COVID-19) pandemic and vaccine policies. This first-of-its-kind lawsuit claims that the British Broadcasting Corporation (BBC), the Washington Post, Reuters and the Associated […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Tech,censorship,Charlene Bollinger,covid-19,covid-19 vaccines,fake news,health freedom,independent media,journalism,lawsuit,legacy media,mainstream media,news,news cartels,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2023-01-13-lawsuit-legacy-media-collusion-censorship-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "Major lawsuit filed against legacy media conglomerates for colluding to censor views critical of COVID-19 policies, vaccines", "cleaned_text": "Major lawsuit filed against legacy media conglomerates for colluding to censor views critical of COVID-19 policies, vaccines\n\nIndependent media outlets, health freedom activists and respected medical professionals have banded together to file a lawsuit against some of the world’s largest legacy media conglomerates over their collusion to silence small competitors critical of Wuhan coronavirus (COVID-19) pandemic and vaccine policies.\n\nThis first-of-its-kind lawsuit claims that the British Broadcasting Corporation (BBC), the Washington Post, Reuters and the Associated Press (AP) have violated antitrust laws and the constitutionally-protected First Amendment of smaller publishers. The lawsuit, filed in the U.S. District Court for the Northern District of Texas – Amarillo Division, seeks damages in the millions of dollars. (Related: Lawsuit uncovers bombshell connection between CDC and social media companies to bury COVID-19 truth from public.)\n\nAccording to the lawsuit, these four mainstream media outlets partnered with Big Tech firms to “collectively censor online news” about COVID-19 that did not align with official narratives regarding the pandemic and the vaccines.\n\n“All of us have gained ground in reaching people with the truth – it saves lives, just the truth,” said Charlene Bollinger in an interview on Newsmax. Bollinger, along with her husband Ty, has spent decades educating Americans about alternative medicine. Millions of people reached out to them on social media platforms to read and watch their views on medical matters before being deplatformed.\n\nThe Bollingers were labeled among the “disinformation dozen” by the administration of President Joe Biden and were maligned by the mainstream media for raising relevant questions regarding the COVID-19 vaccines.\n\nLegacy media colluded with Big Tech to keep alternative views on COVID-19 out of social media, the internet\n\nAccording to the lawsuit, by March 2020, the BBC, Washington Post, Reuters and AP had come together to create what is called the “Trusted News Initiative” (TNI) with Big Tech firms, including Twitter, Meta, Microsoft and Google, to exclude smaller and independent media outlets from being able to gain any kind of traction online.\n\nOn Dec. 10 2020, signatories of the TNI agreed to focus their efforts on combating the spread of supposedly “harmful disinformation” regarding the COVID-19 vaccines. According to the lawsuit, this coordinated effort is, by definition, an unlawful “group boycott” intended to damage the ability of smaller publishers to compete or even survive in the free market.\n\n“[Legacy media] were upset because we were taking some of their traffic, some of their viewers [and] people were starting to question them,” said Bollinger. “They didn’t like that, so they said, ‘We’ve got to come together. We’re normally competitors, but let’s form a trusted partnership.'”\n\nCollectively, signatories of the TNI hold 90 percent of the overall social media market, 90 percent of the social networking market, 75 percent of the video hosting market and over 90 percent of the search engine market.\n\n“This lawsuit is about preserving our free speech rights as Americans and holding those involved in violating antitrust laws accountable like the TNI,” said Bollinger. “My husband and I remain steadfast in our commitment to highlighting the well-documented risks of taking the COVID-19 vaccine and the myriad of dangers facing those who were misled by the TNI media partnership.”\n\nLearn more about legacy media outlets in America at NewsCartels.com.\n\nWatch this clip from “Real America” on Newsmax as host Dan Ball interviews Charlene Bollinger regarding the lawsuit against the world’s largest legacy media outlets.\n\nThis video is from the channel The Truth About Cancer on Brighteon.com.\n\nPREBUNKING means mass media and social media will now send out fake news to pre-empt truth news from debunking their lies.\n\nNBC News now admits COVID vaccines may be linked to myocarditis, after YEARS of claiming it was “misinformation.”\n\nNational File founder: Majority of media companies in America only exist to CONTROL and CENSOR news.\n\nVACCINE PIMPS: Biden administration has been paying MSM to push COVID vaccines that are killing and injuring millions.", "opengraph": {"title": "Major lawsuit filed against legacy media conglomerates for colluding to censor views critical of COVID-19 policies, vaccines", "type": "article", "url": "https://www.medicalcensorship.com/2023-01-13-lawsuit-legacy-media-collusion-censorship-covid.html", "site_name": "Medical Censorship News", "description": "Independent media outlets, health freedom activists and respected medical professionals have banded together to file a lawsuit against some of the world’s largest legacy media conglomerates over their collusion to silence small competitors critical of Wuhan coronavirus (COVID-19) pandemic and vaccine policies. This first-of-its-kind lawsuit claims that the British Broadcasting Corporation (BBC), the Washington Post, Reuters and the Associated […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2023/01/Censorship-Censored-Freedom-Tape-Mouth.jpg"}, "tags": ["legacy media", "covid-19", "fake news", "lawsuit", "news", "mainstream media", "independent media", "journalism", "vaccines", "Charlene Bollinger", "censorship", "news cartels", "covid-19 vaccines", "health freedom", "Big Tech"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/690adf85-7b7d-44fd-9a70-02f46038baf0", "https://childrenshealthdefense.org/defender/lawsuit-trusted-news-initiative-antitrust-first-amendment-censoring-covid-content/", "https://www.prnewswire.com/news-releases/alternative-healthcare-activists-file-antitrust-lawsuit-against-legacy-media-for-efforts-to-silence-rivals-from-internet-platforms-301719310.html", "https://naturalnews.com/2022-12-16-lawsuit-uncovers-connection-cdc-and-social-media-bury-covid19-truth.html", "https://newscartels.com/", "https://www.brighteon.com/690adf85-7b7d-44fd-9a70-02f46038baf0", "https://www.brighteon.com/channels/thetruthaboutcancer", "https://www.brighteon.com/channels/thetruthaboutcancer", "https://factcheck.news/2022-12-11-prebunking-mass-media-social-media-fake-news-preempt-truth-news.html", "https://disinfo.news/2022-11-18-nbc-news-now-admits-covid-vaccines-linked-to-myocarditis.html", "https://newscartels.com/2022-11-10-pharma-tech-msm-government-colluded-censor-dissent.html", "https://newsfakes.com/2022-10-28-media-companies-exist-to-control-censor-news.html", "https://newsparody.com/2022-08-24-biden-administration-paying-msm-to-push-vaccines.html", "https://www.brighteon.com/690adf85-7b7d-44fd-9a70-02f46038baf0", "https://childrenshealthdefense.org/defender/lawsuit-trusted-news-initiative-antitrust-first-amendment-censoring-covid-content/", "https://www.prnewswire.com/news-releases/alternative-healthcare-activists-file-antitrust-lawsuit-against-legacy-media-for-efforts-to-silence-rivals-from-internet-platforms-301719310.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2023-01-13-lawsuit-legacy-media-collusion-censorship-covid.html&linkname=Major%20lawsuit%20filed%20against%20legacy%20media%20conglomerates%20for%20colluding%20to%20censor%20views%20critical%20of%20COVID-19%20policies%2C%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}