{"result_id": "197012", "URL": "https://www.medicalcensorship.com/2023-02-28-fda-save-lives-silencing-speech-misinformation-censorship.html", "timestamp": "2023-04-25 16:19:39 CEST+0200", "meta": {"description": "One of the number-one priorities of the Biden regime’s Food and Drug Administration (FDA) is to combat “misinformation” online, which Commissioner Dr. Robert Califf claims is a “leading cause of death” in the United States. Califf cannot back this claim with any data or facts, of course, but those no longer matter. With enough taxpayer […]", "lang": "en", "keywords": "absurd,big government,Big Pharma,censorship,collusion,conspiracy,crybullies,cures,death,deep state,fascism,FDA,insanity,misinformation,natural medicine,outrage,prevention,Robert Califf,save lives,speech,speech police,thought police,tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2023-02-28-fda-save-lives-silencing-speech-misinformation-censorship.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "FDA claims it will “save lives” by silencing speech online, making sure no one is allowed to talk about natural medicine, prevention or cures", "cleaned_text": "FDA claims it will “save lives” by silencing speech online, making sure no one is allowed to talk about natural medicine, prevention or cures\n\nOne of the number-one priorities of the Biden regime’s Food and Drug Administration (FDA) is to combat “misinformation” online, which Commissioner Dr. Robert Califf claims is a “leading cause of death” in the United States.\n\nCaliff cannot back this claim with any data or facts, of course, but those no longer matter. With enough taxpayer cash at his disposal, Califf can steer the FDA in whichever direction he chooses, which apparently means turning the regulatory body into a censorship and snitch operation.\n\nIn a recent interview with The Associated Press (AP), Califf, who previously headed the FDA in 2016 and 2017, partially under both Barack Obama and Donald Trump, pledged that the FDA under his leadership is committed to “save lives” by fighting against the First Amendment online.\n\nEven though almost nobody trusts the FDA anymore after what the agency did throughout the Wuhan coronavirus (Covid-19) scamdemic, Califf is convinced that he has an important job to do “helping the public get the accurate, science-based information they need to use medical products and foods to maintain and improve their health in the face of a tsunami of confusing and misleading information.”\n\nAllowing people to speak freely online about things like pharmaceuticals and vaccines is a threat to public health, Califf argues, because free thought tends to steer people away from Big Pharma’s products.\n\nTo Califf, anything other than full acceptance of all drugs and vaccines is “a leading cause of death in America.” He believes that anything contradictory to full acceptance constitutes “distortions and half-truths.”\n\n“Almost no one should be dying of covid in the U.S. today,” Califf said, adding that anyone who rejects getting “vaccinated” for the Fauci Flu is “dying because they’re misinformed.”\n\nIn addition to “restructuring the agency’s food safety program and more aggressively deploying FDA scientists to explain vaccine decisions in the media,” Califf says the FDA under his leadership is laser-focused on combating “misinformation” in the digital public square.\n\nWhen he first took office last year, Califf swore that he would help usher in changes to the way people are allowed to talk online. He wants to see all skeptical speech disappear from the internet because it causes some people to “eschew interventions that would improve their health.”\n\n“A purely reactive mode is not appropriate, particularly in this new era of social media,” he added.\n\nAt the time, Califf said it would take about a year to see his plans come to fruition. We are now at roughly the one-year mark and Califf’s agenda has been laid bare for the world to see.\n\n“Providing factual info is the key to helping people make the best-informed decisions about their health,” Califf announced in an Aug. 5, 2022, tweet about the progress being made.\n\nBefore working at the FDA, Califf worked at Verily, a life sciences company owned by Alphabet Inc., Google’s parent company. While there, he scoped the internet in search of “misinformation.”\n\nNaturally, Califf would enter the revolving door from industry to regulator by taking the top seat at the FDA, where he is now pushing his anti-free speech agenda while on the taxpayer dole.\n\nCaliff is particularly incensed that some members of the public express “faux outrage and lies” in response to FDA announcements, especially when they center around new vaccines and other drugs that industry players are trying to push on the masses.\n\nThe “average patient,” Califf says, is unable “to separate the truth from the lies,” and thus needs Califf to manage the truth himself.\n\nMore of the latest news about the corrupt FDA can be found at FDA.news.", "opengraph": {"title": "FDA claims it will “save lives” by silencing speech online, making sure no one is allowed to talk about natural medicine, prevention or cures", "type": "article", "url": "https://www.medicalcensorship.com/2023-02-28-fda-save-lives-silencing-speech-misinformation-censorship.html", "site_name": "Medical Censorship News", "description": "One of the number-one priorities of the Biden regime’s Food and Drug Administration (FDA) is to combat “misinformation” online, which Commissioner Dr. Robert Califf claims is a “leading cause of death” in the United States. Califf cannot back this claim with any data or facts, of course, but those no longer matter. With enough taxpayer […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2023/02/fda.png"}, "tags": ["conspiracy", "big government", "Big Pharma", "speech police", "deep state", "crybullies", "FDA", "speech", "collusion", "absurd", "natural medicine", "misinformation", "cures", "prevention", "death", "Robert Califf", "censorship", "outrage", "thought police", "insanity", "fascism", "tyranny", "save lives"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/fda-robert-califf-combat-misinformation/", "https://naturalnews.com/2021-10-22-fda-authorized-vaccine-corporations-employ-former-fda-commissioners.html", "http://fda.news", "https://childrenshealthdefense.org/defender/fda-robert-califf-combat-misinformation/", "https://naturalnews.com/2021-10-22-fda-authorized-vaccine-corporations-employ-former-fda-commissioners.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2023-02-28-fda-save-lives-silencing-speech-misinformation-censorship.html&linkname=FDA%20claims%20it%20will%20%E2%80%9Csave%20lives%E2%80%9D%20by%20silencing%20speech%20online%2C%20making%20sure%20no%20one%20is%20allowed%20to%20talk%20about%20natural%20medicine%2C%20prevention%20or%20cures", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}