{"result_id": "197034", "URL": "https://www.medicalcensorship.com/2022-08-07-big-tech-continue-to-censor-covid-vaccines.html", "timestamp": "2023-04-25 16:19:54 CEST+0200", "meta": {"description": "Big Tech is still trying to control the message, they do not want anyone to find out how deadly the Covid injections are. But German vaccine-injury insurance claims and 1250+ peer-reviewed studies reveal what Big Tech is trying to keep hidden.  To add to Big Tech’s woes, Canadian court documents reveal that travel bans imposed […]", "lang": "en", "keywords": "awakening,Big Tech,censored,censorship,COVID,glitch,obey,revolt,rigged,speech police,uprising,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2022-08-07-big-tech-continue-to-censor-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "COVID “vaccine” news: Big tech continue to censor but people continue to wake up", "cleaned_text": "COVID “vaccine” news: Big tech continue to censor but people continue to wake up\n\nBig Tech is still trying to control the message, they do not want anyone to find out how deadly the Covid injections are. But German vaccine-injury insurance claims and 1250+ peer-reviewed studies reveal what Big Tech is trying to keep hidden. To add to Big Tech’s woes, Canadian court documents reveal that travel bans imposed on the vaccine-free had no scientific basis.\n\nAfrica is waking up to Big Pharma and the “world government.” In the USA, 130 coast guards take legal action against vaccine mandates. Italy makes a resounding U-turn and announces all medical staff who had been suspended for not having a Covid injection can return to work. And some good news out of Israel – Israelis refuse to inject their youngest with expired gene therapy drugs.\n\nGoogle Does Not Want Anyone to Find Out How Deadly the Vaccines Are\n\nWe tried to run a simple two-question survey to find out just how safe or unsafe the vaccines are. Google refused to let us ask the questions.\n\nClearly, they don’t want anyone to know the truth. The only truth they want you to know is what the government tells you.\n\nSocial Media Continues to Try to Control the Message\n\nLast week, YouTube censored a video conversation between Dr. Pierre Kory and Dr. Chris Martenson. The reason they gave was that YouTube doesn’t allow “claims about Covid-19 vaccinations that contradict expert consensus from local health authorities or the World Health Organization.”\n\nOn Thursday, July 21, in the lead-up to World Ivermectin Day, Twitter permanently suspended the World Council for Health from the platform without warning.\n\nStephanie Seneff, a Senior Research Scientist at MIT who published a recent paper with Dr. Peter McCullough looking at whether mRNA vaccines may be causing illness and death, had her account suspended last week as well.\n\nThe list of attendees at this ‘blocked party’ is, truthfully, too hard to keep up with.\n\nGoogle Is a Vaccine Company and They’re Harvesting Your Data\n\nRobert F. Kennedy Jr. said that Google is a vaccine company as its parent company, Alphabet, has a series of subsidiary companies that manufacture vaccines and has partnered with other pharma companies. Google has a $761 partnership with Glaxo.\n\nGoogle is harvesting medical information, including coughs and other information picked up by Siri’s surveillance system, and then they sell it to pharma companies.\n\nRead more: G. Edward Griffiths Need to Know More, 1 August 2022\n\nGermany’s Largest Health Insurer Reveals 1 in 25 Clients Underwent Medical Treatment in 2021 for Covid ‘Vaccine’ Side Effects\n\nThe cesspool of vaccine side effects in Germany is finally completely open. According to the Dutch news site, Blckbx,five months after a WOB* request, it appears that 437,593 of the 11 million insured persons of the country’s largest Health Insurance fund, Techniker Krankenkasse (TK), had to undergo medical treatment in 2021 for Covid vaccine side effects. That is 1 in 25 and an increase of 3000 per cent.\n\n*A WOB (Wet Openbaarheid Bestuur) request is the Dutch equivalent of a Freedom of Information request.\n\nResearching Covid vaccine adverse events can be daunting in part due to a broad myriad of factors. Primarily, the information is incredibly challenging to find. Here, we share an ever-growing list of peer-reviewed studies specific to Covid vaccine adverse events. This list is curated and maintained by our dedicated staff of injured PhDs and medical professionals.\n\nA case study of a 73-year-old Japanese woman who received two doses of the Moderna Covid “vaccine” was published in the Journal of Diabetes Investigation (“JDI”) in January. The Covid injection has been reported to potentially cause or worsen diabetes, the study authors wrote.\n\n“Four weeks after the second vaccination, [the 73-year-old’s] glycaemic control began to deteriorate, and 8 weeks after the second vaccination, the patient was diagnosed with new-onset type 1 diabetes that was strongly positive for autoantibodies and showed a disease-susceptible human leukocyte antigen haplotype, DRB1*04:05:01-DQB1*04:01:01. “Although most of the cases concluded to be the onset or exacerbation of type?2 diabetes occurred early after the first or second vaccination, the diagnosis of type?1 diabetes took a relatively long period (4–8?weeks) after the second vaccination, including the previously reported case as well as the present case. The difference in the duration between the vaccination and the onset of hyperglycaemia could imply multiple and complicated mechanisms for the development of hyperglycaemia associated with the vaccination. “The administration of adjuvants to individuals genetically predisposed to the disease can cause serious adverse effects through activation of autoimmune cascades and pathways, which is called autoimmune/inflammatory syndrome induced by adjuvants (ASIA syndrome). “Although Moderna Covid-19 vaccine does not contain any additional adjuvants, polyethylene glycol lipid conjugates contained in the Covid-19 mRNA vaccines might act as an adjuvant and induce autoimmune responses, and mRNA appears to have self-adjuvant properties. “In recipients with the disease-susceptible haplotypes, one should be cautious about autoimmune responses for several months after the vaccination.”\n\nOn August 13, 2021, the Canadian government announced that anyone who hadn’t been vaccinated against Covid would soon be barred from planes and trains. In many cases, The Backward could no longer travel between provinces or leave the country.\n\nIf you lived in Winnipeg and wanted to visit your mother on her deathbed in London or Hong Kong or, perhaps, Quebec City, you’d better get jabbed—or resign yourself to never seeing your mother again.\n\nThe Canadian Medical Association Journal, in a June 2022 article, observed that “Canada had among the most sustained stringent policies regarding restrictions on internal movement.”\n\nBut recently released court documents—which capture the decision-making behind the travel mandate—indicate that, far from following the science, the prime minister and his Cabinet were focused on politics.\n\nThe court documents are part of a lawsuit filed by two Canadian residents against the government. Until last month, they were under seal.\n\nBoth plaintiffs are business owners. Both have family in Britain. Both have refused the vaccine on the grounds of bodily autonomy. Both were reluctant to identify their businesses out of fear of losing customers.\n\nAfricans Rising Up Against Big Pharma and World Government\n\nAfricans are waking up to the dangerous agendas being pushed by Big Pharma and the one-world-order crowd, South African journalist and Children’s Health Defense Africa Chapter Executive Director Shabnam Palesa Mohamed told The New American in Conversations That Matter.\n\nAfricans were already sceptical of governments, international organizations and corporate colonialists. But the Covid pandemic has super-charged that awakening. Still, globalist institutions are fighting back, working to undermine the sovereignty of African nations.\n\nClick on the image below to watch the video on Rumble.\n\n“Some of the people are not aware of the relationship between the proposed National Health Regulations amendments that the South African government is pushing in line with the attempt to have an African Pandemic Preparedness Treaty which in itself speaks to the proposed global Pandemic Preparedness Treaty,” Sabelo Sibanda explained in the video below.\n\nThese regulations basically declare a scenario where everyone will end up in one of three categories where you are either:\n• deemed to be a case, or\n• you are considered a suspect, or, alternatively\n• you are considered as one who has been in contact with someone who is a case.\n\nOnce you fall into any one of these three categories this is what this means for you:\n• you may not refuse to be medically examined;\n• you may not refuse to be put in quarantine or put in isolation;\n• may not refuse to take whatever medication that the government says you should take.\n\nSouth Africans, you have until 5 August to STOP the amendments to the South African National Health Act Regulations! Protect YOUR rights and freedom by taking action on the links below:\n\nMore than 130 US Coast Guard members filed a class action lawsuit alleging the religious exemptions they filed in response to the Biden administration’s Covid-19 vaccine mandate for military service members were unlawfully denied.\n\nThe lawsuit, filed July 25 in the U.S. District Court for the Southern District of Texas — Galveston Division, also challenges the constitutionality of the mandate.\n\nWith Italy’s Prime Minister Mario Draghi’s removal from office, the globalist-led government’s discriminatory Covid measures imposed on medical staff have ended. The Italian government’s medical agency, the National Federation of Orders of Surgeons and Dentists, has announced that all physicians and medical staff suspended for not having their Covid “vaccines” can return to work.\n\nThe Federation’s resounding U-turn comes without apology or recognition for the pain, harassment, intimidation, coercion, and financial struggles they caused medical professionals.\n\nA stunning 0.048% of the Israeli population, or fewer than 1 in 2000, have accommodated the mRNA mafia’s requests to inject their children with expired gene therapy drugs.\n\nHaving once achieved virtually unanimous compliance in Israel (an effort assisted by heavy-handed government coercion), the mRNA shots now face much quiet and overt resistance in the country. Average citizens just aren’t buying Big Pharma’s sales pitch — despite the insistence from government officials that the shots are absolutely necessary — and the numbers are making that reality clear as day.", "opengraph": {"title": "COVID “vaccine” news: Big tech continue to censor but people continue to wake up", "type": "article", "url": "https://www.medicalcensorship.com/2022-08-07-big-tech-continue-to-censor-covid-vaccines.html", "site_name": "Medical Censorship News", "description": "Big Tech is still trying to control the message, they do not want anyone to find out how deadly the Covid injections are. But German vaccine-injury insurance claims and 1250+ peer-reviewed studies reveal what Big Tech is trying to keep hidden.  To add to Big Tech’s woes, Canadian court documents reveal that travel bans imposed […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2022/08/Censored-Internet-User-Big-Tech.jpg"}, "tags": ["speech police", "rigged", "uprising", "COVID", "revolt", "vaccines", "censorship", "censored", "obey", "awakening", "glitch", "Big Tech"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">4 and 5 of the National Health Act, are particularly juicy…This is the type of predictions that I was called mad for and a “crazy conspiracy theorist”..It will now be a reality.. No ‘told you so’ necessary. <a href=\"https://twitter.com/Jagman4sho?ref_src=twsrc%5Etfw\">@Jagman4sho</a> <a href=\"https://twitter.com/Riddlemethat14?ref_src=twsrc%5Etfw\">@Riddlemethat14</a> <a href=\"https://twitter.com/LightbringerKai?ref_src=twsrc%5Etfw\">@LightbringerKai</a> <a href=\"https://twitter.com/la_revolucion99?ref_src=twsrc%5Etfw\">@la_revolucion99</a> <a href=\"https://t.co/jGL1zUznl3\">pic.twitter.com/jGL1zUznl3</a></p>\n<p>— Mr G #PhalaPhala$Counter (@SeanGoss31) <a href=\"https://twitter.com/SeanGoss31/status/1511292846543978501?ref_src=twsrc%5Etfw\">April 5, 2022</a></p></blockquote>\n<p></p>\n<h3><strong>130 Coast Guard Members Sue Federal Government Over Vaccine Mandates</strong></h3>\n<p class=\"has-text-align-justify\">More than 130 US Coast Guard members filed a class action lawsuit alleging the religious exemptions they filed in response to the Biden administration’s Covid-19 vaccine mandate for military service members were unlawfully denied.</p>\n<p class=\"has-text-align-justify\">The lawsuit, filed July 25 in the U.S. District Court for the Southern District of Texas — Galveston Division, also challenges the constitutionality of the mandate.</p>\n<p class=\"has-text-align-right\">Read more: <a href=\"https://childrenshealthdefense.org/defender/coast-guard-members-sue-federal-government-covid-vaccine-mandates/\">The Defender</a>, 2 August 2022</p>\n<h3><strong>Italy’s Medical Agency Declares ‘Unvaccinated’ Medical Professionals Can Return to Work</strong></h3>\n<p class=\"has-text-align-justify\">With Italy’s Prime Minister Mario Draghi’s removal from office, the globalist-led government’s discriminatory Covid measures imposed on medical staff have ended. The Italian government’s medical agency, the National Federation of Orders of Surgeons and Dentists, has announced that all physicians and medical staff suspended for not having their Covid “vaccines” can return to work.</p>\n<p class=\"has-text-align-justify\">The Federation’s resounding U-turn comes without apology or recognition for the pain, harassment, intimidation, coercion, and financial struggles they caused medical professionals.</p>\n<p class=\"has-text-align-right\">Read more: <a href=\"https://rairfoundation.com/major-reversal-italys-medical-agency-declares-unvaccinated-medical-professionals-can-return-to-work-video/\">RAIR Foundation USA</a>, 2 August 2022</p>\n<h3><strong>Israelis Wholly Reject Pfizer’s Baby and Toddler mRNA Shots Campaign</strong></h3>\n<p class=\"has-text-align-justify\">A stunning 0.048% of the Israeli population, or fewer than 1 in 2000, have accommodated the mRNA mafia’s requests to inject their children with expired gene therapy drugs.</p>\n<p class=\"has-text-align-justify\">Having once achieved virtually unanimous compliance in Israel (an effort assisted by heavy-handed government coercion), the mRNA shots now face much quiet and overt resistance in the country. Average citizens just aren’t buying Big Pharma’s sales pitch — despite the insistence from government officials that the shots are absolutely necessary — and the numbers are making that reality clear as day.</p>\n<p class=\"has-text-align-right\">Read more: <a href=\"https://dossier.substack.com/p/004-compliance-israelis-wholly-reject\">The Dossier</a>, 1 August 2022</p>\n<figure class=\"aligncenter wp-block-post-featured-image\"><img class=\"attachment-post-thumbnail wp-post-image jetpack-lazy-image jetpack-lazy-image--handled\" src=\"https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?ssl=1\" sizes=\"(max-width: 639px) 100vw, 639px\" srcset=\"https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?w=1280&amp;ssl=1 1280w, https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?resize=300%2C169&amp;ssl=1 300w, https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?resize=1024%2C576&amp;ssl=1 1024w, https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?resize=768%2C432&amp;ssl=1 768w, https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?resize=1200%2C675&amp;ssl=1 1200w\" alt=\"\" width=\"502\" height=\"257\" data-attachment-id=\"204813\" data-permalink=\"https://expose-news.com/2022/08/04/big-tech-censors-but-people-are-waking-up/faug4-1/\" data-orig-file=\"https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?fit=1280%2C720&amp;ssl=1\" data-orig-size=\"1280,720\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"FAug4-1\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?fit=300%2C169&amp;ssl=1\" data-large-file=\"https://i0.wp.com/expose-news.com/wp-content/uploads/2022/08/FAug4-1.png?fit=639%2C359&amp;ssl=1\" data-recalc-dims=\"1\" data-lazy-loaded=\"1\" /></figure>\n<p>Read more at: <a href=\"https://expose-news.com/2022/08/04/big-tech-censors-but-people-are-waking-up/\">Expose-News.com</a></p>\n<div class=\"addtoany_share_save_container addtoany_content_bottom\"><div class=\"a2a_kit a2a_kit_size_32 addtoany_list\" data-a2a-url=\"2022-08-07-big-tech-continue-to-censor-covid-vaccines.html\" data-a2a-title=\"COVID “vaccine” news: Big tech continue to censor but people continue to wake up\"><a class=\"a2a_button_google_plus\" href=\"https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2022-08-07-big-tech-continue-to-censor-covid-vaccines.html&amp;linkname=COVID%20%E2%80%9Cvaccine%E2%80%9D%20news%3A%20Big%20tech%20continue%20to%20censor%20but%20people%20continue%20to%20wake%20up\" title=\"Google+\" rel=\"nofollow\" target=\"_blank\"></a><a class=\"a2a_dd addtoany_share_save\" href=\"https://www.addtoany.com/share\"></a></div></div><br /><a target=\"_new\" href=\"https://support.naturalnews.com/Feedback.html\"><font style=\"font-size:18px\">Submit a correction &gt;&gt;</font></a><p></p></div>\n\n \n\n<div class=\"Widget\" id=\"Widget15\" gravityScore=\"5\" gravityNodes=\"1\"><div class=\"Content\" gravityScore=\"9\" gravityNodes=\"1\"><p class=\"Title\">Get Our Free Email Newsletter</p>\n<p class=\"Description\">Get independent news alerts on natural cures, food lab tests, cannabis medicine, science, robotics, drones, privacy and more.</p>\n<iframe src=\"/NT-Include-ReaderRegistration-2019-Subscribe-Form-UnderArticle.html\" frameborder=\"0\" scrolling=\"no\" style=\"max-width:250px;overflow: hidden;height:70px;\"></iframe>\n<div class=\"Small\">  Subscription confirmation required.<a></a><span>  Subscription confirmation required.<a></a><span><a href=\"/privacypolicy\">Your privacy is protected.</a> Subscription confirmation required.</span></span></div>\n</div>\n</div>\n<hr id=\"Marker5\" class=\"Marker\" />\n<hr id=\"Marker6\" class=\"Marker\" />\n\n \n\n</div>\n</div>\n\n<div class=\"Article2\" gravityScore=\"3\" gravityNodes=\"1\"><div class=\"Sticky2\" gravityScore=\"3\" gravityNodes=\"1\"><hr id=\"Marker3\" class=\"Marker\" />\n<div class=\"Widget\" id=\"Widget15\" gravityScore=\"5\" gravityNodes=\"1\"><div class=\"Content\" gravityScore=\"9\" gravityNodes=\"1\"><p class=\"Title\">Get Our Free Email Newsletter</p>\n<p class=\"Description\">Get independent news alerts on natural cures, food lab tests, cannabis medicine, science, robotics, drones, privacy and more.</p>\n<iframe src=\"/NT-Include-ReaderRegistration-2019-Subscribe-Form-RightColumn.html\" frameborder=\"0\" scrolling=\"no\" style=\"max-width:250px;overflow: hidden;height:70px;\"></iframe>\n<div class=\"Small\">  Subscription confirmation required.<a></a><span>  Subscription confirmation required.<a></a><span><a href=\"/privacypolicy\">Your privacy is protected.</a> Subscription confirmation required.</span></span></div>\n</div>\n</div>\n<div id=\"rp_widget-2\" class=\"widget widget_rp_widget\"><h2><p class=\"SectionHead\">RECENT NEWS &amp; ARTICLES</p></h2><div class=\"PostsSmall\"><div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-26-twitter-colluded-cdc-silence-covid-vaccine-questioning.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Twitter-Censorship-Zipper-Mouth.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-26-twitter-colluded-cdc-silence-covid-vaccine-questioning.html\">Social media Gestapo: Twitter engaged in illegal COLLUSION with CDC to silence anyone questioning covid vaccines</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-21-disinformation-un-plan-against-political-resistance.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/United-Nations-Building-Flags.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-21-disinformation-un-plan-against-political-resistance.html\">Steve Quayle: UN’s war against “disinformation” is nefarious plan to take out political resistance</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/bellecarter\">By Belle Carter</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-19-united-nations-penalizes-criticisms-against-elitist-takeover.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Flag_of_the_United_Nations.svg_.png\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-19-united-nations-penalizes-criticisms-against-elitist-takeover.html\">United Nations penalizes criticisms against elitist takeover</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-18-largest-hospital-system-removes-medical-report-vaccine-injury.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Dementia-Frontotemporal-Film-Mri-Anatomy-Atrophy-Brain.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-18-largest-hospital-system-removes-medical-report-vaccine-injury.html\">Largest hospital system REMOVES popular medical report about the rapid progression of Creutzfeldt-Jakob Disease in double-vaccinated patient</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ljdevon\">By Lance D Johnson</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-17-ryan-cole-covid-shots-linked-cancer-rates.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Covid-19-Coronavirus-Vaccine-Vial-Syringe.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-17-ryan-cole-covid-shots-linked-cancer-rates.html\">Dr. Ryan Cole: COVID shots linked to rising CANCER rates</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ramontomeydw\">By Ramon Tomey</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-17-study-young-adults-post-jab-cardiovascular-injuries.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Disease-Heart-Man-3D-Anatomical-Anatomy-Artery.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-17-study-young-adults-post-jab-cardiovascular-injuries.html\">Thailand study of young adults post jab showed nearly 30% with cardiovascular injuries</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-15-doctors-scientists-sue-biden-over-online-censorship.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Joe-Biden-Head-Down.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-15-doctors-scientists-sue-biden-over-online-censorship.html\">Doctors, scientists sue Biden over online censorship of COVID-19 information</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/bellecarter\">By Belle Carter</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-12-israeli-expert-remains-unfazed-despite-tech-censorship.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Censored-Twitter-Lock-Computer-Keyboard.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-12-israeli-expert-remains-unfazed-despite-tech-censorship.html\">Despite Big Tech censorship, Israeli expert who linked monkeypox outbreak to COVID mRNA vaccines remains UNFAZED</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ramontomeydw\">By Ramon Tomey</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-10-israeli-doctor-monkeypox-covid-jabs-censored-twitter.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Censored-Twitter-Tablet-Computer.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-10-israeli-doctor-monkeypox-covid-jabs-censored-twitter.html\">Israeli doctor who linked monkeypox outbreak to covid jabs CENSORED by Twitter</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-09-one-800-over-60-vaccinated-covid-dies.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Senior-Man-Vaccine-Mask-Covid-19-Coronavirus.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-09-one-800-over-60-vaccinated-covid-dies.html\">One out of every 800 people over 60 who gets vaccinated for covid DIES, says scientist</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-08-civil-rights-group-joins-lawsuit-against-big-tech-censorship-covid-data.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Censored-Facebook-Social-Media.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-08-civil-rights-group-joins-lawsuit-against-big-tech-censorship-covid-data.html\">Civil rights group joins growing lawsuit against big tech for collective censorship of COVID data</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-07-big-tech-continue-to-censor-covid-vaccines.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Censored-Internet-User-Big-Tech.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-07-big-tech-continue-to-censor-covid-vaccines.html\">COVID “vaccine” news: Big tech continue to censor but people continue to wake up</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-04-censorship-google-bans-mention-covid-vaccines-survey.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/Google-chrome-logo-666.png\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-04-censorship-google-bans-mention-covid-vaccines-survey.html\">CENSORSHIP: Google bans any mention of covid vaccines from its survey platform</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-01-cia-run-wikipedia-used-as-truth-engine.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/08/AI-computer-NN.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-01-cia-run-wikipedia-used-as-truth-engine.html\">CIA-run Wikipedia used as the “truth engine” to train the censorship AI that will rule the Meta-verse </a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/sdwells\">By S.D. Wells</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-07-31-us-government-colluded-google-twitter-and-facebook-to-censor-truth-vaccines.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/07/CDC-Vaccine-Coronavirus-Syringe.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-07-31-us-government-colluded-google-twitter-and-facebook-to-censor-truth-vaccines.html\">Smoking gun: U.S. government, CDC colluded with Google, Twitter, Facebook to censor important information about experimental covid vaccines</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ljdevon\">By Lance D Johnson</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-07-29-texas-doctor-sues-hospital-covid-jab-criticisms.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/07/Lawsuit-Paperwork-Pen.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-07-29-texas-doctor-sues-hospital-covid-jab-criticisms.html\">Texas doctor sues hospital for punishing her over covid jab criticisms</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ethanh\">By Ethan Huff</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-07-27-ivermectin-reduces-covid-19-mortality-new-study.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/07/Ivermectin-Bottle-Pills.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-07-27-ivermectin-reduces-covid-19-mortality-new-study.html\">Ivermectin reduces covid-19 mortality by 92%, reports new study out of Southern Brazil… this is why the medical establishment SUPPRESSED it</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/ljdevon\">By Lance D Johnson</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-07-26-fauci-has-done-incalculable-damage-throughout-world.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/07/Anthony-Fauci-Roundtable-Red-Cross-National-Headquarters.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-07-26-fauci-has-done-incalculable-damage-throughout-world.html\">Jeffrey Tucker: Fauci has done incalculable damage throughout the world</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/kevinhughes\">By Kevin Hughes</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-07-25-breaking-silence-around-covid-vaccine-injuries.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/07/Vaccine-Syringe-Shot-Arm.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-07-25-breaking-silence-around-covid-vaccine-injuries.html\">Global campaign aims to break silence around COVID vaccine injuries</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>\n</div>\n</div>\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-07-25-ideas-to-fix-a-broken-medical-system.html\"><img border=\"0\" src=\"wp-content/uploads/sites/652/2022/07/Doctor-Patient-Care-Hand-Holding-Health-Insurance.jpg\" /></a>\n</div>\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-07-25-ideas-to-fix-a-broken-medical-system.html\">Ideas for how to fix a broken medical system</a></div>\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/victort1\">By News Editors</a></span></div>\n</div>\n</div>\n</div></div>\n</div>\n</div>\n \n\n</div>\n</div>\n\n\n \n</div>\n</div>\n \n \n \n \n \n \n \n \n \n</div></div></body>\n</html>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "570", "height": "315", "embed_code": "<iframe class=\"youtube-player\" src=\"https://www.youtube.com/embed/eGbZix6pYPc?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" width=\"570\" height=\"315\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe>", "src": "https://www.youtube.com/embed/eGbZix6pYPc?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://expose-news.com/2022/08/04/big-tech-censors-but-people-are-waking-up/", "https://stevekirsch.substack.com/p/google-does-not-want-anyone-to-find", "https://flccc.substack.com/p/banned-camp", "https://needtoknow.news/2022/08/google-is-a-vaccine-company-and-theyre-harvesting-your-data/", "https://www.blckbx.tv/corona/half-miljoen-medische-behandelingen-door-vaccins-bij-%C3%A9%C3%A9n-duits-ziekenfonds", "https://www.tk.de/techniker", "https://rairfoundation.com/germanys-largest-health-insurer-reveals-1-in-25-clients-underwent-medical-treatment-in-2021-for-covid-vaccine-side-effects/", "https://react19.org/1250-covid-vaccine-reports/", "https://onlinelibrary.wiley.com/doi/10.1111/jdi.13757", "https://onlinelibrary.wiley.com/doi/10.1111/jdi.13757", "https://www.cmaj.ca/content/194/25/E870", "https://www.commonsense.news/p/court-documents-reveal-canadas-travel", "https://rumble.com/v1ej7pl-africans-rising-up-against-big-pharma-and-world-government-chd-africas-shab.html", "https://rumble.com/v1ej7pl-africans-rising-up-against-big-pharma-and-world-government-chd-africas-shab.html", "https://www.shiftersvoice.com/campaign2/health-act-amendment2/", "https://yesmovement.org.za/referendum/", "https://twitter.com/Jagman4sho?ref_src=twsrc%5Etfw", "https://twitter.com/Riddlemethat14?ref_src=twsrc%5Etfw", "https://twitter.com/LightbringerKai?ref_src=twsrc%5Etfw", "https://twitter.com/la_revolucion99?ref_src=twsrc%5Etfw", "https://t.co/jGL1zUznl3", "https://twitter.com/SeanGoss31/status/1511292846543978501?ref_src=twsrc%5Etfw", "https://childrenshealthdefense.org/defender/coast-guard-members-sue-federal-government-covid-vaccine-mandates/", "https://rairfoundation.com/major-reversal-italys-medical-agency-declares-unvaccinated-medical-professionals-can-return-to-work-video/", "https://dossier.substack.com/p/004-compliance-israelis-wholly-reject", "https://expose-news.com/2022/08/04/big-tech-censors-but-people-are-waking-up/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2022-08-07-big-tech-continue-to-censor-covid-vaccines.html&linkname=COVID%20%E2%80%9Cvaccine%E2%80%9D%20news%3A%20Big%20tech%20continue%20to%20censor%20but%20people%20continue%20to%20wake%20up", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}