{"result_id": "197043", "URL": "https://www.medicalcensorship.com/2021-10-28-government-campaign-to-force-vaccination-a-psyop.html", "timestamp": "2023-04-25 16:19:59 CEST+0200", "meta": {"description": "Experts are wondering if the American government’s response to the Wuhan coronavirus (COVID-19) pandemic is a psychological operation (PSYOP). David Marks, an investigative reporter writing for the Children’s Health Defense, was one of the first to notice the similarities between the way the federal government is aggressively pushing for vaccinations and PSYOP. According to Marks, the campaign to […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,conspiracy,coronavirus,coronavirus vaccines,covid-19,deception,disinfo,mass hypnosis,medical censorship,Medical Tyranny,mind control,propaganda,psyops,vaccine wars,YouTube", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2021-10-28-government-campaign-to-force-vaccination-a-psyop.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "Investigative reporter says government’s aggressive COVID-19 vaccination campaign is a PSYOP", "cleaned_text": "Investigative reporter says government’s aggressive COVID-19 vaccination campaign is a PSYOP\n\nExperts are wondering if the American government’s response to the Wuhan coronavirus (COVID-19) pandemic is a psychological operation (PSYOP).\n\nDavid Marks, an investigative reporter writing for the Children’s Health Defense, was one of the first to notice the similarities between the way the federal government is aggressively pushing for vaccinations and PSYOP.\n\nAccording to Marks, the campaign to get people to agree to take the experimental and deadly vaccines is “manipulation of citizens on a grander scale than any effort in recent history.” (Related: Government sponsored experiments to craft the best pro-vaccine messages FIVE MONTHS before COVID-19 vaccines became available.)\n\nMarks pointed out that a lot of the messaging regarding the COVID-19 vaccines is painting vaccine skeptics as the enemy of the vaccinated. This is despite the fact that the position of those who are hesitant to take the experimental, rushed and deadly vaccines is “neither the result of mass hypnosis nor cult-like programming, [but] rather an exercise in freedom of speech and choice.”\n\n“A large majority of the unvaccinated have reviewed information and statistics from a range of sources, that either support or contradict government policy,” wrote Marks. “They have made choices based on concerns about efficacy and risks, but are open to engaging in debate.”\n\nIn contrast, the most vocal opponents of vaccine skeptics among the general populace deem the information they have received from the government and mainstream media outlets to be unassailable.\n\n“They are willing to accept a filtered version of data, and staunchly refuse to look at any material that might cause doubt about their decisions or challenge authoritative mandates,” he said. “They refuse to engage in debate.”\n\nYouTube working with the government to censor vaccine skepticism\n\nTo help push the pro-vaccine narrative, the government has enlisted the help of social media networks to censor any skepticism of the COVID-19 vaccines.\n\nThis is most prevalent on YouTube, which announced late last month that it will begin removing all content that questions “any approved medical vaccine,” not just the COVID-19 vaccines.\n\nAccording to Matt Halprin, YouTube’s vice president for trust and safety, this ban will cover any video that questions the effectiveness of vaccines and talks about their side effects.\n\nHalprin claimed in an interview that the company’s previous pronouncement regarding coronavirus-related content on the website was too limited. The previous policy only banned videos that were critical of COVID-19 vaccines.\n\n“We can imagine viewers then potentially extrapolating to COVID-19,” said Halprin. “We wanted to make sure that we’re covering the whole gamut.”\n\nAs of the end of September, YouTube said it has taken down more than one million videos for misinformation related to all aspects of the COVID-19 pandemic.\n\nWorkers continue to get fired for not complying with vaccine mandates\n\nWhile YouTube and other social media networks are focusing on censoring vaccine skepticism on the internet, corporations all over the country are forcing their employees to get vaccinated under threat of unemployment.\n\nThis is the case in the healthcare industry. According to the latest tally by healthcare industry news website Fierce Healthcare, nearly 6,000 healthcare workers have been terminated or resigned from nearly 50 hospitals and health systems all over the country. Additionally, around 6,600 healthcare workers are currently suspended or have yet to report their vaccination status.\n\nIt is expected that hundreds or thousands more healthcare workers will lose their jobs as more hospitals and health systems reach their deadlines for partial or full vaccination.\n\nThe assault on Americans who are skeptical of the vaccines from the government and the private sector is relentless.\n\nOf all the aspects of the response to the COVID-19 pandemic, Marks wrote that the push to force everyone to get vaccinated “is one of the most troubling, and should cause us to consider its probability, provenance and rectification. Learn more about how governments and corporations all over the world are working together to coerce people into getting the deadly COVID-19 vaccines at Vaccines.news.", "opengraph": {"title": "Investigative reporter says government’s aggressive COVID-19 vaccination campaign is a PSYOP", "type": "article", "url": "https://www.medicalcensorship.com/2021-10-28-government-campaign-to-force-vaccination-a-psyop.html", "site_name": "Medical Censorship News", "description": "Experts are wondering if the American government’s response to the Wuhan coronavirus (COVID-19) pandemic is a psychological operation (PSYOP). David Marks, an investigative reporter writing for the Children’s Health Defense, was one of the first to notice the similarities between the way the federal government is aggressively pushing for vaccinations and PSYOP. According to Marks, the campaign to […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2021/11/Mind-control.jpg"}, "tags": ["conspiracy", "big government", "covid-19", "medical censorship", "Big Pharma", "psyops", "vaccine wars", "mass hypnosis", "YouTube", "deception", "Medical Tyranny", "coronavirus", "disinfo", "mind control", "propaganda", "coronavirus vaccines"], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/is-u-s-response-to-covid-pandemic-an-official-government-psychological-operation/", "https://www.naturalnews.com/2021-10-13-experiments-to-craft-best-pro-vaccine-messages.html", "https://www.bloomberg.com/news/articles/2021-09-29/youtube-will-remove-videos-with-misinformation-about-any-vaccine?sref=jB82HHlm", "http://youtubecensorship.com", "https://www.fiercehealthcare.com/hospitals/how-many-employees-have-hospitals-lost-to-vaccine-mandates-numbers-so-far", "https://vaccines.news/", "https://www.wakingtimes.com/is-u-s-response-to-covid-pandemic-an-official-government-psychological-operation/", "https://www.bloomberg.com/news/articles/2021-09-29/youtube-will-remove-videos-with-misinformation-about-any-vaccine?sref=jB82HHlm", "https://www.fiercehealthcare.com/hospitals/how-many-employees-have-hospitals-lost-to-vaccine-mandates-numbers-so-far"], "authors": [], "publish_date": null}