{"result_id": "197027", "URL": "https://medicalcensorship.com/2022-06-23-science-magazine-admits-covid-vaccines-useless-harmful.html", "timestamp": "2023-04-25 16:19:49 CEST+0200", "meta": {"description": "British researchers say that Wuhan coronavirus (Covid-19) “vaccines” do not provide any real protection against the latest “variant” of the disease, which the establishment is calling “Omicron” (Moronic). A new paper published in the magazine Science reveals that both antibody and T-cell protection are nowhere to be found post-injection. Meanwhile, the shots leave behind mystery […]", "lang": "en", "keywords": "badhealth,big government,Censored Science,chemical violence,COVID,Dangerous Medicine,depopulation,great reset,harmful,magazine,mRNA,omicron,Plandemic,propaganda,science,science fraud,useless,vaccine death,vaccine injury,vaccine jihad,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://medicalcensorship.com/2022-06-23-science-magazine-admits-covid-vaccines-useless-harmful.html", "encoding": "UTF-8"}, "image": null, "domain": "medicalcensorship.com", "title": "Science magazine admits covid “vaccines” are useless and harmful", "cleaned_text": "British researchers say that Wuhan coronavirus (Covid-19) “vaccines” do not provide any real protection against the latest “variant” of the disease, which the establishment is calling “Omicron” (Moronic).\n\nA new paper published in the magazine Science reveals that both antibody and T-cell protection are nowhere to be found post-injection. Meanwhile, the shots leave behind mystery substances inside a person’s body, often leading to chronic illness or early death.\n\nAnother thing the paper found is that the “fully vaccinated” are suffering so-called “breakthrough” infections with Moronic, as their T-cell response is now artificially tuned towards earlier variants of the disease such as Delta.\n\n“… when vaccinated but previously uninfected people suffer breakthrough Omicron infections, their T-cell response is biased toward earlier versions of Sars-Cov-2 – not to the Omicron variant that has actually infected them,” writes Alex Berenson on his Substack.\n\n“In other words, the mRNA shots appear to permanently wrongfoot the immune systems of people who receive and bias them toward producing T-cells to attack variants that no longer exist – even though they never were infected with those variants at all.”\n\nNatural immunity that has not been damaged by pharmaceutical shots bears a component called non-specific immunity that targets invading pathogens non-specifically. In the case of covid, this means fighting against the virus generally rather than specifically in terms of variants.\n\nAfter a person gets injected, however, that non-specific immunity becomes altered, and suddenly the body is no longer able to fight off infections as they morph and mutate. (Related: Research out of Columbia University found that Moronic has a “striking” resistance to covid injections.)\n\n“While antibodies are the first line of defense against infection and try to clear the virus from the bloodstream, T-cells are the crucial second line,” Berenson adds. “They attack and destroy infected cells and also work with other parts of the immune system to produce more and better targeted antibodies later.”\n\n“Vaccine advocates have claimed endlessly that mRNA-generated T-cells help keep people from becoming severely ill with Covid even after frontline antibody protection against infection disappears … This study suggests that supposed protection may be a myth, and the low death rates from Omicron are simply a result of Omicron’s general lack of virulence in vaccinated and unvaccinated people alike.”\n\nThe British study further found that another big part of the body’s ability to fight off infections, antibodies, also become damaged by the shots. Post-injection, the immune system is left with the ability to produce only one type of coronavirus antibody, when the reality is that many different antibodies are needed.\n\nThose other antibodies would be produced naturally by the body without the shot. But once synthetic mRNA (messenger RNA) chemicals are dispensed, the immune system is left permanently damaged with no way to fight off illnesses that are constantly changing.\n\nThe study acknowledged this fact, however it was buried in highly technical language, suggesting that it was simply too politically incorrect to state plainly. The study also failed to compare the immune responses of the vaccinated to the unvaccinated, which is problematic, to say the least.\n\n“Unfortunately but unsurprisingly, the scientists did not look at the immune responses of anyone who was not vaccinated – with or without previous infection,” Berenson explains. “Thus the paper offers no direct comparison of the way Omicron may affect antibody and B- and T-cell responses in vaccinated and unvaccinated people.”\n\n“Why didn’t the researchers include unvaccinated people? Maybe because nearly all British adults are vaccinated and most boosted, so the authors wanted to concentrate on the risks Omicron poses to vaccinated people … Or maybe because they worried about what they’d find if they directly compared the two groups.”\n\nThe latest news about the Chinese Virus and its health-destroying injections can be found at ChemicalViolence.com.", "opengraph": {"title": "Science magazine admits covid “vaccines” are useless and harmful", "type": "article", "url": "https://www.medicalcensorship.com/2022-06-23-science-magazine-admits-covid-vaccines-useless-harmful.html", "site_name": "Medical Censorship News", "description": "British researchers say that Wuhan coronavirus (Covid-19) “vaccines” do not provide any real protection against the latest “variant” of the disease, which the establishment is calling “Omicron” (Moronic). A new paper published in the magazine Science reveals that both antibody and T-cell protection are nowhere to be found post-injection. Meanwhile, the shots leave behind mystery […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2022/06/Covid-19-Vaccine-Vial-Close-Up.jpg"}, "tags": ["big government", "great reset", "magazine", "COVID", "vaccine jihad", "Censored Science", "chemical violence", "useless", "propaganda", "science", "depopulation", "omicron", "harmful", "science fraud", "vaccine injury", "vaccines", "vaccine death", "Plandemic", "mRNA"], "tweets": [], "movies": [], "links": ["https://alexberenson.substack.com/p/dont-read-this-if-youre-vaccinated", "http://www.columbia.edu", "http://chemicalviolence.com", "https://alexberenson.substack.com/p/dont-read-this-if-youre-vaccinated", "https://naturalnews.com/2021-12-23-columbia-omicron-has-striking-resistance-covid-vaccines.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2022-06-23-science-magazine-admits-covid-vaccines-useless-harmful.html&linkname=Science%20magazine%20admits%20covid%20%E2%80%9Cvaccines%E2%80%9D%20are%20useless%20and%20harmful", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}