{"result_id": "197008", "URL": "https://medicalcensorship.com/2023-03-07-cdc-hides-medicare-data-covid-vaccine-dangers.html", "timestamp": "2023-04-25 16:19:37 CEST+0200", "meta": {"description": "Zelenko Freedom Foundation (ZFF) Co-Chair Ann Vandersteel blasted the Centers for Disease Control and Prevention (CDC) for hiding Medicare data about the dangers of the Wuhan coronavirus (COVID-19) vaccines. “The CDC has lied to the American people with that fascist public-private partnership,” she said during the Feb. 28 edition of her 30-minute program “Right Now […]", "lang": "en", "keywords": "Ann Vandersteel,Anthony Fauci,badhealth,badmedicine,big government,Big Pharma,Brighteon.tv,CDC,conspiracy,covid-19,Dangerous Medicine,deception,pandemic,pharmaceutical fraud,Right Now,Steve Kirsch,suppressed,vaccine damage,vaccine injury,vaccine safety,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://medicalcensorship.com/2023-03-07-cdc-hides-medicare-data-covid-vaccine-dangers.html", "encoding": "UTF-8"}, "image": null, "domain": "medicalcensorship.com", "title": "Right Now with Ann Vandersteel: CDC is hiding Medicare data about the dangers of COVID-19 vaccines – Brighteon.TV", "cleaned_text": "Right Now with Ann Vandersteel: CDC is hiding Medicare data about the dangers of COVID-19 vaccines – Brighteon.TV\n\nZelenko Freedom Foundation (ZFF) Co-Chair Ann Vandersteel blasted the Centers for Disease Control and Prevention (CDC) for hiding Medicare data about the dangers of the Wuhan coronavirus (COVID-19) vaccines.\n\n“The CDC has lied to the American people with that fascist public-private partnership,” she said during the Feb. 28 edition of her 30-minute program “Right Now with Ann Vandersteel” on Brighteon.TV.\n\nSteve Kirsch, founder of the Vaccine Safety Research Foundation, first exposed this deception from the public health agency. While the CDC has always had access to Medicare records, it never made these publicly available as it clearly showed that the experimental COVID-19 vaccines are dangerous.\n\n“You’ll see why the CDC will never release this data and why the mainstream press is never ever going to ask to see the data; because it would reveal they lied to people and killed over 500,000 Americans by recommending they take an unsafe ‘vaccine,'” he wrote in a post on his Substack.\n\nOn Feb. 25, Kirsch got a copy of over 114,000 records of deaths by vaccination status from the Medicare database, which he authenticated by matching records he had in his possession. It was concluded that the shots were increasing the likelihood of the elderly dying prematurely and the risk of death remains elevated for an unknown period after being injected.\n\n“When there is no data transparency, there is a high chance that the government is lying to you. They had access to this data the entire time and kept it hidden and said nothing,” Kirsch wrote.\n\nThe Zelenko Freedom Foundation co-chair added that the “king of fascism,” Dr. Antony Fauci, just admitted that the entire “science” behind trying to stop COVID-19 with vaccines doesn’t work. She cited remarks made by the infectious disease expert in a Jan. 11, 2023 paper published in Cell Host & Microbe.\n\n“Attempting to control mucosal respiratory viruses with systematically administered non-replicating vaccines has thus far been largely unsuccessful,” Fauci wrote. “It is not surprising that none of the predominantly mucosal respiratory viruses have ever been effectively controlled by vaccines.”\n\nThe former director of the National Institute for Allergy and Infectious Diseases also admitted that both the COVID-19 and influenza vaccines are ineffective due to their “common characteristics.” According to Fauci, both “elicit incomplete and short-lived protection against evolving virus variants that escape population immunity.”\n\n“Should we pay homage to a murderous, lying thug like Dr. Fauci for coming clean on the basis of viruses in immunology?” Vandersteel lamented. She further stated things would have been different if authorities had actually explained the truth they have concealed and based their policies on them. Besides real data, studies have been conducted proving the inefficacy and danger of the vaccine. In fact, leading medical journals such as the New England Journal of Medicine and The Lancet employed editors with such knowledge three years ago.\n\n“What a catastrophic failure for the entire medical establishment, a total abject divorce of their Hippocratic oath to first do no harm. Death, poverty and inequality might have all been avoided and trust may have also been maintained in the institutions with which they work,” Vandersteel said. (Related: ONS confirms 92% of 2022 COVID deaths are among fully vaccinated population.)\n\nWatch the full Feb. 28 episode of “Right Now with Ann Vandersteel” below. Catch new episodes of the program every weeknight at 8-8:30 p.m. on Brighteon.TV.\n\nFauci ADMITS “antibodies” from COVID-19 vaccines actually make the virus stronger.\n\nSteve Kirsch: Data shows COVID-19 vaccine is the MOST DANGEROUS vaccine ever made.\n\nFauci just admitted that entire “science” behind trying to stop covid with vaccines DOESN’T WORK.\n\nSteve Kirsch estimates between 5M and 12M people have been killed by COVID clot shots worldwide (so far).\n\nCAUGHT: UK hospitals certified pneumonia deaths as COVID deaths to create illusion of pandemic.", "opengraph": {"title": "Right Now with Ann Vandersteel: CDC is hiding Medicare data about the dangers of COVID-19 vaccines – Brighteon.TV", "type": "article", "url": "https://www.medicalcensorship.com/2023-03-07-cdc-hides-medicare-data-covid-vaccine-dangers.html", "site_name": "Medical Censorship News", "description": "Zelenko Freedom Foundation (ZFF) Co-Chair Ann Vandersteel blasted the Centers for Disease Control and Prevention (CDC) for hiding Medicare data about the dangers of the Wuhan coronavirus (COVID-19) vaccines. “The CDC has lied to the American people with that fascist public-private partnership,” she said during the Feb. 28 edition of her 30-minute program “Right Now […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2023/03/CDC-Vaccine-Coronavirus-Syringe.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "Big Pharma", "deception", "Anthony Fauci", "CDC", "covid-19", "Right Now", "Brighteon.tv", "vaccine damage", "Steve Kirsch", "vaccine wars", "vaccine safety", "suppressed", "vaccine injury", "vaccines", "Ann Vandersteel", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/6bcf2109-5276-4d0e-8751-d1a3469ce2a7", "https://brighteon.tv", "https://stevekirsch.substack.com/p/game-over-medicare-data-shows-the", "https://stevekirsch.substack.com/p/game-over-medicare-data-shows-the", "https://expose-news.com/2023/02/28/medicare-data-increased-risk-of-dying-after-injection/", "https://www.infowars.com/posts/dr-fauci-comes-clean-on-vaccines-and-respiratory-viruses/", "http://vaccines.news", "https://www.naturalnews.com/2023-03-02-92percent-2022-covid-deaths-from-vaccinated-population.html", "https://www.brighteon.com/6bcf2109-5276-4d0e-8751-d1a3469ce2a7", "https://brighteon.tv/home", "https://immunesystem.news/2021-08-26-fauci-antibodies-covid-vaccines-make-virus-stronger.html", "https://dangerousmedicine.com/2022-11-08-kirsch-covid-vaccine-most-dangerous-ever-made.html", "https://vaccines.news/2023-02-27-fauci-admits-science-covid-vaccines-doesnt-work.html", "https://vaccinedeaths.com/2022-08-17-steve-kirsch-vaccines-killed-between-5m-12m.html", "https://www.pandemic.news/2023-02-28-hospitals-pneumonia-deaths-covid-deaths-pandemic-illusion.html", "https://www.brighteon.com/6bcf2109-5276-4d0e-8751-d1a3469ce2a7", "https://stevekirsch.substack.com/p/game-over-medicare-data-shows-the", "https://expose-news.com/2023/02/28/medicare-data-increased-risk-of-dying-after-injection/", "https://www.infowars.com/posts/dr-fauci-comes-clean-on-vaccines-and-respiratory-viruses/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2023-03-07-cdc-hides-medicare-data-covid-vaccine-dangers.html&linkname=Right%20Now%20with%20Ann%20Vandersteel%3A%20CDC%20is%20hiding%20Medicare%20data%20about%20the%20dangers%20of%20COVID-19%20vaccines%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}