{"result_id": "197045", "URL": "https://medicalcensorship.com/2022-06-24-stanford-ucla-admit-vaccine-risk-outweighs-benefit.html", "timestamp": "2023-04-25 16:20:00 CEST+0200", "meta": {"description": "A pre-print study authored by Peter Doshi from the University of Maryland School of Pharmacy reveals that the risk benefit to getting “vaccinated” for the Wuhan coronavirus (Covid-19) is negative, meaning the shots are far more harmful than potentially beneficial. Entitled, “Serious Adverse Events of Special Interest Following mRNA Vaccination in Randomized Trials,” the paper […]", "lang": "en", "keywords": "badhealth,badmedicine,Censored Science,coercion,collapsifornia,corruption,COVID,fauci flu,genocide,health freedom,Medical Tyranny,negative,negative efficacy,Plandemic,risk benefit,stanford,UCLA,universities,vaccine damage,vaccine jihad,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://medicalcensorship.com/2022-06-24-stanford-ucla-admit-vaccine-risk-outweighs-benefit.html", "encoding": "UTF-8"}, "image": null, "domain": "medicalcensorship.com", "title": "Stanford, UCLA and others admit that risk benefit to covid “vaccines” is NEGATIVE", "cleaned_text": "Stanford, UCLA and others admit that risk benefit to covid “vaccines” is NEGATIVE\n\nA pre-print study authored by Peter Doshi from the University of Maryland School of Pharmacy reveals that the risk benefit to getting “vaccinated” for the Wuhan coronavirus (Covid-19) is negative, meaning the shots are far more harmful than potentially beneficial.\n\nEntitled, “Serious Adverse Events of Special Interest Following mRNA Vaccination in Randomized Trials,” the paper bears the names of many other high-profile academics as well, including Sander Greenland from the University of California Los Angeles and Robert M. Kaplan from Stanford University.\n\nThe paper is currently undergoing peer review, and it will be a doozy to witness what happens next as its findings will technically be considered “misinformation” in the State of California if Assembly Bill 2098 gets passed, which Kirsch personally believes is unlikely.\n\nAB 2098, in case you missed our earlier coverage about this bill, would criminalize doctors who advise or prescribe patients with anything other than the government-approved “treatments” for disease, which in the case of the Fauci Flu means vaccines and only vaccines.\n\nIn a nutshell, the new pre-print article defies the narrative in that it exposes the injections as unsafe and ineffective. Any doctor who relies on its findings as part of his medical practice, however, could lose his medical license in the California if AB 2098 passes.\n\n“That’s how things work in California,” writes Steve Kirsch on his Substack.\n\n“It’s not about ‘follow the science’ anymore. That is not a defense. As a doctor you must ‘follow the herd.’ If you disagree with the masses, even if you are right, kiss your medical license good-bye!!”\n\nOne of the things that makes AB 2098 unpassable, in Kirsch’s opinion, is the fact that its wording makes it impossible for a physician to ever change his opinion on a matter, including vaccine safety.\n\n“Either 100% of the doctors are for it, or 100% will be against it,” Kirsch notes. “There can’t be a middle ground of you get your license revoked so everyone has to stick with the initial narrative.”\n\n“This means the vaccines will always be safe and effective in California even when they aren’t … If that doesn’t enforce conformity, I don’t know what will.”\n\nFortunately for people not in California, such restrictions are not the law of the land – at least not yet. In Tennessee, for instance, there is an effort to stop Chinese Virus injections from going into the arms of anyone under five, period.\n\n“Yesterday, I was joined by @tnhousegop Leadership in requesting that @GovBillLee direct the @TNDeptofHealth to halt any distribution, promotion or recommendation of the Covid vaccine for children under 5,” tweeted Rep. Jason Zachary.\n\nThe Publix supermarket chain, which is based out of Florida, is similarly refusing to inject children under five with the toxic brew – though children over five can still get jabbed at any Publix store if their parents wish.\n\n“I wonder if it has been considered the idea of starting a new medical accreditation board,” wrote someone at Kirsch’s Substack about a possible alternative to the current status quo in places like California.\n\n“Leading physicians such as Dr. Pierre Kory, Dr. Peter McCullough, Dr. Ryan Cole, Dr. Robert Malone and many other heroic doctors could form a new AMA accrediting board licensing physicians and providing a board that does not threaten to revoke licensure based on early treatment for covid or medical freedom [from] vaccines.”\n\n“If the licensing accrediting board for physicians is so corrupt, it may not be redeemable, and worth starting a new according board for physicians.”\n\nThe latest news about the Fauci Flu shot push can be found at ChemicalViolence.com.", "opengraph": {"title": "Stanford, UCLA and others admit that risk benefit to covid “vaccines” is NEGATIVE", "type": "article", "url": "https://www.medicalcensorship.com/2022-06-24-stanford-ucla-admit-vaccine-risk-outweighs-benefit.html", "site_name": "Medical Censorship News", "description": "A pre-print study authored by Peter Doshi from the University of Maryland School of Pharmacy reveals that the risk benefit to getting “vaccinated” for the Wuhan coronavirus (Covid-19) is negative, meaning the shots are far more harmful than potentially beneficial. Entitled, “Serious Adverse Events of Special Interest Following mRNA Vaccination in Randomized Trials,” the paper […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2022/06/Doctor-Mask-Close-Up-Covid-19-Vial-Vaccine.jpg"}, "tags": ["COVID", "vaccine jihad", "stanford", "corruption", "Censored Science", "universities", "risk benefit", "fauci flu", "UCLA", "negative efficacy", "Medical Tyranny", "collapsifornia", "negative", "coercion", "genocide", "vaccines", "health freedom", "Plandemic", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/uh-oh-risk-benefit-of-the-vaccines", "https://www.pharmacy.umaryland.edu/research/faculty/", "http://www.ucla.edu", "http://www.stanford.edu", "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202120220AB2098", "https://naturalnews.com/2022-06-06-california-doctor-pushes-back-medical-misinformation-bill.html", "http://chemicalviolence.com", "https://stevekirsch.substack.com/p/uh-oh-risk-benefit-of-the-vaccines", "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202120220AB2098", "https://naturalnews.com/2022-06-06-california-doctor-pushes-back-medical-misinformation-bill.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2022-06-24-stanford-ucla-admit-vaccine-risk-outweighs-benefit.html&linkname=Stanford%2C%20UCLA%20and%20others%20admit%20that%20risk%20benefit%20to%20covid%20%E2%80%9Cvaccines%E2%80%9D%20is%20NEGATIVE", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}