{"result_id": "197009", "URL": "https://medicalcensorship.com/2022-03-13-facebook-running-vaccine-campaign-with-health-authorities.html", "timestamp": "2023-04-25 16:19:37 CEST+0200", "meta": {"description": "Social media giant Facebook has been running a campaign in collusion with institutions promoting the Wuhan coronavirus (COVID-19) vaccines that have already injured or killed millions. An article named the platform founded by Mark Zuckerberg as part of the Alliance for Advancing Health Online (AAHO). Branded as a “multi-year initiative,” AAHO seeks to “advance public […]", "lang": "en", "keywords": "AAHO,badhealth,badmedicine,Big Tech,censorship,conspiracy,covid-19,Facebook,First Amendment,pandemic,propaganda,rigged,Social media,tech giants,vaccine,vaccine wars,vaccines,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://medicalcensorship.com/2022-03-13-facebook-running-vaccine-campaign-with-health-authorities.html", "encoding": "UTF-8"}, "image": null, "domain": "medicalcensorship.com", "title": "COLLUSION: Facebook running vaccine campaign in collusion with health authorities, Big Pharma", "cleaned_text": "COLLUSION: Facebook running vaccine campaign in collusion with health authorities, Big Pharma\n\nSocial media giant Facebook has been running a campaign in collusion with institutions promoting the Wuhan coronavirus (COVID-19) vaccines that have already injured or killed millions.\n\nAn article named the platform founded by Mark Zuckerberg as part of the Alliance for Advancing Health Online (AAHO). Branded as a “multi-year initiative,” AAHO seeks to “advance public understanding of how social media and behavioral sciences can be leveraged to improve the health of communities around the world.”\n\nSeveral entities are also part of AAHO, including the World Bank, the World Health Organization, pharmaceutical company Merck and the CDC Foundation – the latter being independent from the Centers for Disease Control and Prevention.\n\nA June 2021 press release about the alliance said Facebook and Merck have committed $20 million each to AAHO, which is initially set to address “vaccine hesitancy and vaccine equity” among underserved communities. (Related: Facebook relies on Gates-funded W.H.O. to define ‘vaccine misinformation.’)\n\nSeveral White House staffers received an email in June 2021 about AAHO’s formation. These include senior COVID-19 response adviser Becca Siegel and Department of Health and Human Services Director of Digital Engagement Tericka Lambert. White House Presidential Innovation Fellow Georgeta Dragoiu, who is connected with the White House’s COVID-19 Vaccine Public Education Strategy and Media Campaign, also received the email.\n\nIt is unclear how the White House responded to the email about AAHO. The Epoch Times sent inquiries to the entities involved, such as Facebook’s parent company Meta, the White House press office and the individual recipients. However, it did not receive responses as of writing.\n\nCDC Foundation Communications Director Amy Tolchinsky, meanwhile, released a written statement about its involvement in AAHO. “While we are not involved in its operations, received any funding for our involvement or provided any funding, our association with AAHO – which was publicly announced in June of 2021 – is a way to educate the public about the safety and efficacy of vaccines to a broader audience,” her statement said.\n\nSeveral experts, who were censored by Facebook for refusing to adhere to the medical establishment’s narrative, spoke out against the AAHO, telling the Epoch Times that it is a front for suppressing what authorities consider as misinformation regarding vaccines. Lockdown critic Dr. Jay Bhattacharya said: “[It’s] difficult for me to understand this as anything other than a government propaganda campaign.”\n\nFront Line COVID-19 Critical Care Alliance President Dr. Pierre Kory said there is no “scientifically-supported public health objective for getting people vaccinated.” According to the doctor, who promotes the use of ivermectin as a COVID-19 treatment, he believes Facebook has potentially placed itself in the legal role of “state actor.” Kory added that by promoting vaccines and censoring reports of serious reactions, the social media platform could be held liable for vaccine-related injuries.\n\nMeanwhile, mRNA vaccine technology inventor Dr. Robert Malone said: “If Facebook wants to play doctor, then it has to fulfill the professional and ethical obligations of the profession.” This includes disclosing the potential risks of the COVID-19 vaccines.\n\nHe added that AAHO “poses a direct violation of ethical responsibilities in medicine” – which includes disclosing the dangers of any recommended treatments and any alternative treatment options. A victim of Big Tech censorship himself, Malone was banned from Twitter after raising safety concerns about the shots.\n\nAaron Siri, lawyer for the Informed Consent Action Network, said a tripartite alliance between Big Government, Big Tech and Big Pharma is “by the very least, [a] mammoth campaign” to suppress free speech rights guaranteed by the First Amendment. He told the Epoch Times: “It creates a dangerous precedent when social media outlets are carrying the government’s message while suppressing messaging that’s contrary to what the government is trying to promote.”\n\nWatch the Health Ranger Mike Adams discussing how Facebook promote lies and censors the truth about vaccines.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nFacebook bans all content on vaccine awareness, including facts about vaccine ingredients, vaccine injury and vaccine industry collusion.\n\nFacebook announces medical FASCISM rule: All content that contradicts the corrupt vaccine industry will be BANNED.\n\nAustralian health authority wants to refer “fake vaccine theories” on Facebook to law enforcement.\n\nFederal gov’t telling Facebook to silence those with vaccine safety concerns, says lawsuit.\n\nFind out more stories like this on FacebookCollapse.com.", "opengraph": {"title": "COLLUSION: Facebook running vaccine campaign in collusion with health authorities, Big Pharma", "type": "article", "url": "https://www.medicalcensorship.com/2022-03-13-facebook-running-vaccine-campaign-with-health-authorities.html", "site_name": "Medical Censorship News", "description": "Social media giant Facebook has been running a campaign in collusion with institutions promoting the Wuhan coronavirus (COVID-19) vaccines that have already injured or killed millions. An article named the platform founded by Mark Zuckerberg as part of the Alliance for Advancing Health Online (AAHO). Branded as a “multi-year initiative,” AAHO seeks to “advance public […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2022/04/Facebook-Syringe.jpg"}, "tags": ["pandemic", "conspiracy", "covid-19", "vaccine wars", "AAHO", "tech giants", "rigged", "vaccine", "First Amendment", "Social media", "censorship", "vaccines", "Facebook", "Wuhan coronavirus", "propaganda", "Big Tech"], "tweets": [], "movies": [], "links": ["https://www.wnd.com/2022/03/facebook-funding-covid-vaccine-campaign-cdc-merck/", "https://about.fb.com/news/2021/06/facebook-leading-health-organizations-form-alliance-for-advancing-health-online/", "https://naturalnews.com/2020-06-12-facebook-relies-gates-funded-who-vaccine-misinformation.html", "https://www.theepochtimes.com/facebook-called-out-for-vaccine-marketing-alliance_4312872.html", "https://www.brighteon.com/6013095426001", "https://www.brighteon.com/channels/hrreport", "https://censorship.news/2019-03-08-facebook-bans-all-content-on-vaccine-awareness.html", "https://facebookcollapse.com/2019-03-11-facebook-announces-medical-fascism-corrupt-vaccine-industry.html", "https://vaccines.news/2021-06-03-australia-fake-vaccine-theories-facebook-law-enforcement.html", "https://techgiants.news/2021-05-11-federal-govt-facebook-silence-vaccine-safety-concerns.html", "https://firstamendment.news/2021-05-30-whistleblowers-expose-facebook-plan-censor-vaccine-hesitancy.html", "https://facebookcollapse.com/", "https://www.wnd.com/2022/03/facebook-funding-covid-vaccine-campaign-cdc-merck/", "https://about.fb.com/news/2021/06/facebook-leading-health-organizations-form-alliance-for-advancing-health-online/", "https://www.theepochtimes.com/facebook-called-out-for-vaccine-marketing-alliance_4312872.html", "https://www.brighteon.com/6013095426001", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2022-03-13-facebook-running-vaccine-campaign-with-health-authorities.html&linkname=COLLUSION%3A%20Facebook%20running%20vaccine%20campaign%20in%20collusion%20with%20health%20authorities%2C%20Big%20Pharma", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}