{"result_id": "197035", "URL": "https://www.medicalcensorship.com/2023-01-19-cdc-secret-public-health-tool-vaccine-misinformation.html", "timestamp": "2023-04-25 16:19:54 CEST+0200", "meta": {"description": "On March 7, the U.S. Centers for Disease Control and Prevention (CDC) is scheduled to meet – confidentially – about “developing a public health tool to predict the virality of vaccine misinformation.” A “Notice of Closed Meeting” announced in the United States government’s Federal Register in November 2022 explains that the CDC gathering “will be […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,CDC,censorship,collusion,conspiracy,corruption,deception,disinfo,fascism,FDA,health freedom,hypocrisy,pharmaceutical fraud,propaganda,public health tool,Rule by Secrecy,science deception,thought police,tyranny,vaccine misinformation,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2023-01-19-cdc-secret-public-health-tool-vaccine-misinformation.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "CDC holds secret meeting about new “public health tool” to fight “vaccine misinformation”", "cleaned_text": "CDC holds secret meeting about new “public health tool” to fight “vaccine misinformation”\n\nOn March 7, the U.S. Centers for Disease Control and Prevention (CDC) is scheduled to meet – confidentially – about “developing a public health tool to predict the virality of vaccine misinformation.”\n\nA “Notice of Closed Meeting” announced in the United States government’s Federal Register in November 2022 explains that the CDC gathering “will be closed to the public in accordance with the provisions set forth in sections 552b(c)(4) and 552b(c)(6), Title 5 U.S.C.”\n\nThe reason for the closed meeting also has to do with a decision by the Director of the Strategic Business Initiatives Unit within the Office of the Chief Operating Officer of the Centers for Disease Control (CDC).\n\nDue to ongoing concerns at the federal agency about the spread of “vaccine misinformation,” the CDC plans to come up with new ways to fight back against online free speech. The CDC also plans to address “Disease, Disability, and Injury Prevention and Control,” as well as develop “Collaborative Surveys to Provide Inputs into Vaccine-Related Economic Evaluations.”\n\nThe virtual meeting is scheduled to take place on March 7 from 10:00 a.m. and 5:00 p.m. EST. (Related: The CDC used the same public relations firm as Pfizer and Moderna to push centralized “health communication” during covid.)\n\nThe CDC is an enemy of We the People and our free speech rights\n\nThis upcoming meeting is hardly a surprise considering what has been uncovered in recent weeks from the Twitter Files. We already knew about the Department of Homeland Security (DHS) doing Big Pharma’s dirty work on social media, and now we can see the CDC is in on it, too.\n\nFor years, in fact, federal agencies such as these have been working behind closed doors to stamp out the First Amendment online because free speech is ruining the globalists’ plans for a world takeover.\n\nNot only have they been working against free speech about pharmaceuticals and vaccines, but these same federal agencies also want to stop people from talking about election fraud and Joe Biden’s stealing of the White House from Donald Trump.\n\nOther topics that are off limits include:\n• Addressing Biden’s botched withdrawal of American troops from Afghanistan\n• Questioning the true origin of the Wuhan coronavirus (Covid-19)\n• Expressing skepticism about the safety and effectiveness of childhood vaccines\n\nThe fact that the CDC hid this upcoming secret meeting from the public just goes to show that this agency is an enemy of the American public – and an enemy of the Constitution.\n\n“The unearthed, secret meeting is the latest example of how federal agencies are colluding to combat alleged ‘misinformation,’ despite failing to clearly define what actually qualifies as fact vs. fiction,” reported War Room.\n\n“The CDC already is the marketing arm of Big Pharma,” wrote a commenter about the agency’s deep-seated corruption.\n\n“The drug companies run both the CDC and the FDA,” wrote another about how the Food and Drug Administration is no better.\n\n“Next time you watch television, count the pharmaceutical adverts,” wrote another. “Drug pushin’ is acceptable with a flashy commercial and a catchy tune.”\n\nSomeone else commented that the true job of the U.S. government is to stop corruption and protect the American people – but instead they are part of the racket.\n\n“All branches and players of all federal, state, county and city governments in the U.S. and most countries of the their ‘free world’ are corporations,” noted another about how everything has been privatized, even if it seems to be a public agency on the surface.\n\n“The United States Corporation, wholly owned by the banksters and bleedership, hijacked America in 1871 during our last lawful Congress of Lincoln’s administration. It’s institutionalized fraud on a grand scale. This is fascism.”\n\nThe latest news about the CDC can be found at CDC.news.", "opengraph": {"title": "CDC holds secret meeting about new “public health tool” to fight “vaccine misinformation”", "type": "article", "url": "https://www.medicalcensorship.com/2023-01-19-cdc-secret-public-health-tool-vaccine-misinformation.html", "site_name": "Medical Censorship News", "description": "On March 7, the U.S. Centers for Disease Control and Prevention (CDC) is scheduled to meet – confidentially – about “developing a public health tool to predict the virality of vaccine misinformation.” A “Notice of Closed Meeting” announced in the United States government’s Federal Register in November 2022 explains that the CDC gathering “will be […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2023/01/CDC-Vaccine-Coronavirus-Syringe.jpg"}, "tags": ["conspiracy", "big government", "Big Pharma", "FDA", "deception", "corruption", "CDC", "Rule by Secrecy", "collusion", "science deception", "public health tool", "disinfo", "propaganda", "vaccine wars", "hypocrisy", "censorship", "thought police", "vaccine misinformation", "fascism", "vaccines", "tyranny", "health freedom", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://warroom.org/2023/01/16/cdc-to-hold-secret-meeting-to-censor-misinformation/", "https://naturalnews.com/2022-10-24-cdc-pr-pfizer-moderna-health-communication-scamdemic.html", "http://cdc.news", "https://warroom.org/2023/01/16/cdc-to-hold-secret-meeting-to-censor-misinformation/", "https://naturalnews.com/2022-10-24-cdc-pr-pfizer-moderna-health-communication-scamdemic.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2023-01-19-cdc-secret-public-health-tool-vaccine-misinformation.html&linkname=CDC%20holds%20secret%20meeting%20about%20new%20%E2%80%9Cpublic%20health%20tool%E2%80%9D%20to%20fight%20%E2%80%9Cvaccine%20misinformation%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}