{"result_id": "197026", "URL": "https://www.medicalcensorship.com/2021-08-04-vaccine-propaganda-bot-farm-catapults-big-pharma-lies-social-media.html", "timestamp": "2023-04-25 16:19:48 CEST+0200", "meta": {"description": "Social media algorithms are being used to not only identify and eliminate certain facts and truths, but these AI systems are also being used to promote certain types of propaganda, to brainwash the public into accepting falsehoods as if they are popular messages of truth. To make matters worse, unscrupulous operatives are using vaccine propaganda […]", "lang": "en", "keywords": "algorithms,badhealth,badmedicine,banned,Big Tech,bot farms,censored,censorship,determination,free speech,glitch,lies,mind control,morale,propaganda,psychological war,public opinion,rigged,self-censorship,Social media,submission,suppressed,tech giants,troll farms,vaccine propaganda,vaccine wars,vaccines,Will", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2021-08-04-vaccine-propaganda-bot-farm-catapults-big-pharma-lies-social-media.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "Vaccine propaganda BOT FARM catapults Big Pharma lies across social media while those who tell the truth are silenced", "cleaned_text": "Vaccine propaganda BOT FARM catapults Big Pharma lies across social media while those who tell the truth are silenced\n\nSocial media algorithms are being used to not only identify and eliminate certain facts and truths, but these AI systems are also being used to promote certain types of propaganda, to brainwash the public into accepting falsehoods as if they are popular messages of truth. To make matters worse, unscrupulous operatives are using vaccine propaganda BOT FARMS to catapult Big Pharma’s lies across social media, to instill fear in the public and advocate for more government and corporate control over lives. The latest bot farm was caught spreading lies about the unvaccinated to garner public support for vaccine passports and a system of segregation against healthy, naturally-immune people.\n\nBOT farms disseminate propaganda to gain acceptance for lockdowns, segregation of the unvaccinated\n\nSocial media users are beginning to spot deceptive propaganda and come to realize that these personalized messages are being used en masse to convince the public of specific narratives. These bot farms are being used to guilt and shame the unvaccinated, so they feel compelled to comply. These bot farms demoralize and discourage people from speaking up and taking action, as their civil liberties are threatened. These bot farms give the impression that a lie is a universal truth openly accepted by many people. This manipulation is culling people’s motivation, determination, and silencing their will.\n\nThese bot farms are intended to spread disinformation and make people feel defeated, so they will give up and question their reality. By breaking down the psychology of people, these bot farms stop people from speaking out about their liberties and the issues that matter. When these bot accounts are engaged, they are programmed to vilify the truth and contradict common sense and human reasoning. These fake accounts are there to anger Americans and make them believe that they have no rights, no legal recourse and no expertise to comment on the matter at hand. These bots should NOT be engaged because they are heartlessly programmed to defend an agenda of enslavement, fear and depopulation. (Related: CDC propaganda reaches hilarious new low as VETERINARIAN posts scripted warning about her “hospital” being full of covid patients.)\n\nBOT farms being used to psychologically control the masses and socially ostracize the “unvaccinated”\n\nOne particular message that is making rounds is the lie that ERs and ICUs are getting swamped by unvaccinated people. This message was disseminated across Twitter and made to look like it is coming from a concerned healthcare worker: “I just left the ER. We are officially back to getting rushed by COVID-19. Delta Variant is running rampant and it’s MUCH more transmissible than the original virus. 99% of our ICU admits did NOT receive a vaccine.” This message was NOT sent out by a real healthcare professional working on the front lines. This message is being sent out VERBATIM across several social media accounts, using fake bots. These messages are being used to psychologically subvert the masses and achieve greater levels of compliance.\n\nThese bot farms can be controlled from a single computer, hooked up to multiple phones and social media accounts. These bot farms may include a group of internet trolls who are paid to interfere in public consensus and political decision making. These keyboard armies are paid to spread propaganda and attack critics, brainwashing people into accepting lies, while controlling political discussion and influencing election outcomes and restrictive covid policies. Read more about all this at MedicalFascism.news.", "opengraph": {"title": "Vaccine propaganda BOT FARM catapults Big Pharma lies across social media while those who tell the truth are silenced", "type": "article", "url": "https://www.medicalcensorship.com/2021-08-04-vaccine-propaganda-bot-farm-catapults-big-pharma-lies-social-media.html", "site_name": "Medical Censorship News", "description": "Social media algorithms are being used to not only identify and eliminate certain facts and truths, but these AI systems are also being used to promote certain types of propaganda, to brainwash the public into accepting falsehoods as if they are popular messages of truth. To make matters worse, unscrupulous operatives are using vaccine propaganda […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2021/08/social-media-covid-vaccine-propaganda.jpg"}, "tags": ["vaccine propaganda", "determination", "Will", "censored", "lies", "banned", "algorithms", "submission", "glitch", "propaganda", "Big Tech", "vaccine wars", "tech giants", "psychological war", "self-censorship", "censorship", "Social media", "mind control", "troll farms", "suppressed", "bot farms", "morale", "rigged", "vaccines", "free speech", "public opinion"], "tweets": [], "movies": [], "links": ["https://www.rumormillnews.com/cgi-bin/forum.cgi?read=178697", "https://www.naturalnews.com/2021-08-04-veterinarian-posts-scripted-warning-hospital-full-covid-patients.html", "http://MedicalFascism.news", "https://www.rumormillnews.com/cgi-bin/forum.cgi?read=178697", "https://www.naturalnews.com/2021-08-04-veterinarian-posts-scripted-warning-hospital-full-covid-patients.html"], "authors": [], "publish_date": null}