{"result_id": "197018", "URL": "https://www.medicalcensorship.com/2023-01-13-americans-censored-over-vaccines-must-sue-government.html", "timestamp": "2023-04-25 16:19:43 CEST+0200", "meta": {"description": "Ben Armstrong of the New American magazine exhorted every American censored for sharing information about the Wuhan coronavirus (COVID-19) vaccine to sue the government. “Every American citizen should have a case – because if the government told Twitter or Facebook to censor information that is being shared [and] that you yourself retweeted or put out, […]", "lang": "en", "keywords": "badhealth,badmedicine,banned,Ben Armstrong,Big Tech,censorship,covid-19,Facebook,fox news,pandemic,Social media,The Ben Armstrong Show,The New American,Tucker Carlson,vaccine,vaccine damage,Vaccine deaths,vaccine injury,VAERS,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2023-01-13-americans-censored-over-vaccines-must-sue-government.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "Ben Armstrong urges Americans censored over COVID-19 vaccines to SUE the government", "cleaned_text": "Ben Armstrong urges Americans censored over COVID-19 vaccines to SUE the government\n\nBen Armstrong of the New American magazine exhorted every American censored for sharing information about the Wuhan coronavirus (COVID-19) vaccine to sue the government.\n\n“Every American citizen should have a case – because if the government told Twitter or Facebook to censor information that is being shared [and] that you yourself retweeted or put out, that’s illegal,” he said during the Jan. 10 episode of “The Ben Armstrong Show.”\n\n“Every American that’s been censored should have a lawsuit. They should be able to jump into a lawsuit; there should be an allowance for everyone to sign on.”\n\nAccording to the New American journalist, Americans sharing something negative about the COVID-19 shots on social media will surely be censored or shadow-banned. Even if the information went though, only a few people will be able to see it if it won’t be completely blocked.\n\nHe added that social media companies set up algorithms to look for certain keywords linked to anything negative about the vaccine, and then they’ll censor these posts that go against the “official narrative” at the behest of the Democrats.\n\nArmstrong cites Tucker Carlson’s censorship as an example\n\nArmstrong cited the case of Fox News anchor Tucker Carlson, who was censored by Facebook at the order of the White House over the deadly COVID-19 vaccines. (Related: Tucker Carlson slams US government for hiding the truth about the coronavirus.)\n\nThe National Review shed light on Carlson’s banning, citing email correspondence made public via a lawsuit filed by Louisiana Attorney General (AG) Jeff Landry and his Missouri counterpart, AG Eric Schmitt. It said the “Tucker Carlson Tonight” host’s banning came as a result of a phone call between White House officials and representatives of the social media platform.\n\nFollowing the said phone call, Facebook confirmed to White House Digital Media Director Rob Flaherty that it demoted Carlson’s video about the COVID-19 vaccine to 50 percent, pending a seven-day fact-checking period. The Big Tech firm also promised in April 2021 that Carlson’s video would “continue to be demoted, even though it was not ultimately fact-checked.”\n\nArmstrong then played the said video of Carlson talking about the dangers of the COVID-19 shots on his program.\n\n“It was never really a secret that there were huge problems with the COVID-19 shots, and we knew this because the Biden administration’s own VAERS (Vaccine Adverse Event Reporting System) database indicated that from the beginning,” the Fox News host said.\n\n“A lot of people were being injured, but the media suppressed that news. We tried to point it out more than a year ago not because we have a problem with vaccines or ‘anti-vaxxers,’ but because if you’re going to force people to take something – you probably ought to know what it is and what effects it may have.”\n\nCarlson also revealed in the same video that Flaherty had emailed Facebook about his negative comments on the COVID-19 vaccines. The White House official also pressured the social media platform to follow its censorship policy.\n\n“Tucker could have helped save more lives if he wasn’t censored,” Armstrong concluded. “But the White House tried to make sure that more people died from getting the vaccine by censoring the truth about the vaccines. Just simply the truth that the vaccines weren’t working – as simple as that.”\n\nWatch the Jan. 10 episode of “The Ben Armstrong Show” below where Armstrong talks about Carlson’s censorship over his COVID-19 vaccine comments.\n\nThis video is from The New American channel on Brighteon.com.\n\nBen Armstrong: The federal government lied about COVID and vaccines.\n\nTucker Carlson slams US government for hiding the truth about the coronavirus.\n\nLawsuit uncovers bombshell connection between CDC and social media companies to bury COVID-19 truth from the public.", "opengraph": {"title": "Ben Armstrong urges Americans censored over COVID-19 vaccines to SUE the government", "type": "article", "url": "https://www.medicalcensorship.com/2023-01-13-americans-censored-over-vaccines-must-sue-government.html", "site_name": "Medical Censorship News", "description": "Ben Armstrong of the New American magazine exhorted every American censored for sharing information about the Wuhan coronavirus (COVID-19) vaccine to sue the government. “Every American citizen should have a case – because if the government told Twitter or Facebook to censor information that is being shared [and] that you yourself retweeted or put out, […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2023/01/Censored-Facebook-Social-Media.jpg"}, "tags": ["pandemic", "covid-19", "The New American", "VAERS", "Vaccine deaths", "banned", "vaccine", "vaccine injury", "fox news", "censorship", "Social media", "Facebook", "Wuhan coronavirus", "Tucker Carlson", "Ben Armstrong", "Big Tech", "The Ben Armstrong Show", "vaccine damage"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/d38e59b5-fc79-4eac-9410-ac65f29e8e44", "https://naturalnews.com/2021-07-26-tucker-carlson-slams-government-hiding-truth-coronavirus.html", "https://www.nationalreview.com/news/white-house-pressured-facebook-to-censor-tucker-carlson-anti-vaccine-video/", "https://censorship.news", "http://www.brighteon.com/d38e59b5-fc79-4eac-9410-ac65f29e8e44", "http://www.brighteon.com/channels/thenewamerican", "https://naturalnews.com/2022-08-02-armstrong-government-lied-about-covid-and-vaccines.html", "https://naturalnews.com/2020-09-17-tucker-carlson-criticizes-facebook-censoring-interview-virologist.html", "https://naturalnews.com/2021-07-26-tucker-carlson-slams-government-hiding-truth-coronavirus.html", "https://censorship.news/2022-12-16-lawsuit-uncovers-connection-cdc-and-social-media-bury-covid19-truth.html", "http://www.brighteon.com/d38e59b5-fc79-4eac-9410-ac65f29e8e44", "https://www.nationalreview.com/news/white-house-pressured-facebook-to-censor-tucker-carlson-anti-vaccine-video/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2023-01-13-americans-censored-over-vaccines-must-sue-government.html&linkname=Ben%20Armstrong%20urges%20Americans%20censored%20over%20COVID-19%20vaccines%20to%20SUE%20the%20government", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}