{"result_id": "197025", "URL": "https://medicalcensorship.com/2023-02-16-who-whistleblower-censored-nanotech-graphene-oxide-vaccines.html", "timestamp": "2023-04-25 16:19:48 CEST+0200", "meta": {"description": "A former consultant for the World Health Organization (WHO) turned whistleblower was censored at a Wuhan coronavirus (COVID-19) conference in the Swedish capital Stockholm. Swiss researcher Dr. Astrid Stuckelberger was among the speakers at the “Pandemic Strategies: Lessons and Consequences” conference, held last Jan. 21 and 22 at the Stockholm Waterfront hotel. She was allotted […]", "lang": "en", "keywords": "Ana Mihalcea,Astrid Stuckelberger,badhealth,badmedicine,badscience,conference,covid-19,Glenn Dormer,graphene oxide,medical censorship,nanotechnology,pandemic,Ryan Cole,smeared,Stockholm,vaccine,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://medicalcensorship.com/2023-02-16-who-whistleblower-censored-nanotech-graphene-oxide-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "medicalcensorship.com", "title": "WHO whistleblower was censored mid-presentation for exposing presence of nanotech, graphene oxide in COVID vaccines", "cleaned_text": "WHO whistleblower was censored mid-presentation for exposing presence of nanotech, graphene oxide in COVID vaccines\n\nA former consultant for the World Health Organization (WHO) turned whistleblower was censored at a Wuhan coronavirus (COVID-19) conference in the Swedish capital Stockholm.\n\nSwiss researcher Dr. Astrid Stuckelberger was among the speakers at the “Pandemic Strategies: Lessons and Consequences” conference, held last Jan. 21 and 22 at the Stockholm Waterfront hotel. She was allotted 40 minutes to discuss her presentation on the afternoon of the second day.\n\nHowever, the conference organizers decided to cut off Stuckelberger while she was tw0-thirds in her talks. She had been discussing graphene oxide in the Wuhan coronavirus (COVID-19) vaccines when she was censored. According to Stuckelberger, the censorship occurred when she was about to present the discoveries of nanotechnology and graphene oxide in vaccine vials. (Related: CONFIRMED: Covid “vaccine” vials definitely contain graphene oxide.)\n\nThe former WHO consultant revealed that pathologist Dr. Ryan Cole spearheaded the live efforts to smear her. In a post on her Telegram channel, she disclosed that he “stepped on stage to stop my conference [and] discredit me on nanotech [and] graphene oxide.”\n\nStuckelberger continued: “[They] cut my talk off [after] 15 minutes, even cut my microphone and said it was because of time. But then, they took five minutes to say there was no graphene oxide in the [COVID-19 vaccine] vials. They also tried to censor me during the debate that followed.”\n\nA panel discussion that included Stuckelberger followed the presentation. Cole was in the audience having presented on the morning of Jan. 23.\n\nHowever, the CEO of Cole Diagnostics in Idaho jumped up onto the stage while it was Stuckelberger’s turn to speak. He took over the microphone and declared that he found no evidence of graphene oxide in all the COVID-19 vaccine vials he tested. Stuckelberger then challenged the pathologist’s assertion, retorting that he is not an expert on nanotechnology.\n\nStuckelberger first made waves by disclosing that the globalist-backed WHO aims to use the pandemic to institute worldwide medical tyranny and supersede even sovereign nations when it comes to public health policy. Meanwhile, Cole gained prominence after his revelation that the COVID-19 injections compromise the immune system – triggering diseases such as cancer.\n\nIntegrative medicine practitioner Dr. Ana Mihalcea expounded on the censorship experienced by Stuckelberger at the conference in a Jan. 25 post on her Substack. She quoted a statement by Dr. Glenn Dormer, an attendee who stood up and yelled in defense of the Swiss researcher.\n\n“I was very emotionally touched, and I stood up in the audience … [of] 800 people,” said Dormer. “This woman is risking her life to tell more truth than we have heard in the last two days in this congregation. [Stuckelberger] worked off-script; she started to actually show what the plan is. She said: ‘This is what the WHO was and what it has become, part of this control grid.'”\n\nAccording to Dormer, the front row where the speakers and organizers were seated suddenly had “a very great amount of activity” with “people running back and forth.” He recounted seeing conference organizer Sven Roman speaking to another organizer. At this point, Cole “stood up and basically took the microphone after 40 minutes.”\n\n“They had to have a reason why they had to de-mic her after only 40 [minutes],” Dormer remarked.\n\nFor her part, Mihalcea lamented that many physicians have been affected by the “censorship [that] has been happening,” even in so-called “health freedom groups.” The Washington-based practitioner had been a victim of this in 2022.\n\n“Physicians are not allowed to speak about graphene [oxide] or nanotechnology. If only one point of view is allowed, how are these doctors and scientists in a position to recommend treatments?”\n\nWatch this footage of the exchange between Dr. Astrid Stuckelberger and Dr. Ryan Cole at the Stockholm conference.\n\nThis video is from the Fritjof Persson channel on Brighteon.com.\n\nWHO whistleblower: Globalist puppets seek full control over humanity through deployment of COVID-19 pandemic treaty.\n\nUN whistleblower says World Health Organization is “tip of the spear” for global tyranny.\n\nGraphene oxide used in coronavirus vaccines linked to adverse events, even death.\n\nDr. Ryan Cole explains how the COVID vaccines compromise the immune system.", "opengraph": {"title": "WHO whistleblower was censored mid-presentation for exposing presence of nanotech, graphene oxide in COVID vaccines", "type": "article", "url": "https://www.medicalcensorship.com/2023-02-16-who-whistleblower-censored-nanotech-graphene-oxide-vaccines.html", "site_name": "Medical Censorship News", "description": "A former consultant for the World Health Organization (WHO) turned whistleblower was censored at a Wuhan coronavirus (COVID-19) conference in the Swedish capital Stockholm. Swiss researcher Dr. Astrid Stuckelberger was among the speakers at the “Pandemic Strategies: Lessons and Consequences” conference, held last Jan. 21 and 22 at the Stockholm Waterfront hotel. She was allotted […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2023/02/Vaccine-Vials-Pattern-Montage.jpg"}, "tags": ["conference", "pandemic", "Astrid Stuckelberger", "covid-19", "medical censorship", "Stockholm", "Ana Mihalcea", "vaccine", "nanotechnology", "Ryan Cole", "graphene oxide", "smeared", "Glenn Dormer", "Wuhan coronavirus"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/02/15/who-whistle-blower-shut-down-at-stockholm/", "https://www.naturalnews.com/2022-02-16-covid-vaccine-vials-definitely-contain-graphene-oxide.html", "http://ingredients.news", "https://anamihalceamdphd.substack.com/p/nanotechnology-discussion-at-medical", "https://medicalcensorship.com", "https://www.brighteon.com/4f55ceee-9140-43d4-8e79-697eed8fc1eb", "https://www.brighteon.com/channels/fritjofpersson", "https://globalism.news/2023-01-26-globalists-seek-full-control-covid-pandemic-treaty.html", "https://conspiracy.news/2022-05-04-un-whistleblower-who-tip-spear-global-tyranny.html", "https://vaccinewars.com/2021-08-15-graphene-oxide-in-coronavirus-vaccines-linked-to-death.html", "https://badmedicine.news/2022-01-28-ryan-cole-covid-vaccines-compromise-immune-system.html", "https://vaccines.news/2022-02-20-covid-vaccines-cause-catastrophic-damage-to-organs.html", "https://expose-news.com/2023/02/15/who-whistle-blower-shut-down-at-stockholm/", "https://anamihalceamdphd.substack.com/p/nanotechnology-discussion-at-medical", "https://www.brighteon.com/4f55ceee-9140-43d4-8e79-697eed8fc1eb", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2023-02-16-who-whistleblower-censored-nanotech-graphene-oxide-vaccines.html&linkname=WHO%20whistleblower%20was%20censored%20mid-presentation%20for%20exposing%20presence%20of%20nanotech%2C%20graphene%20oxide%20in%20COVID%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}