{"result_id": "197006", "URL": "https://medicalcensorship.com/2022-01-11-robert-malone-discusses-life-threatening-effects-vaccines.html", "timestamp": "2023-04-25 16:19:35 CEST+0200", "meta": {"description": "Dr. Robert Malone, mRNA inventor and a respected name in virology and immunology, told Stew Peters the life threatening effects of the Wuhan coronavirus (COVID-19) vaccines during the January 4 episode of the “The Stew Peters Show” on Brighteon. TV. Malone said the number one reason for vaccine deaths is blood clots that result to strokes. “Number […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,Big Tech,censorship,covid-19,death rate,deception,Pfizer,pharmaceutical fraud,Robert Malone,vaccine,vaccine damage,Vaccine deaths,vaccine injury", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://medicalcensorship.com/2022-01-11-robert-malone-discusses-life-threatening-effects-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "medicalcensorship.com", "title": "Dr. Robert Malone tells Stew Peters about the life-threatening effects of COVID-19 vaccines – Brighteon.TV", "cleaned_text": "Dr. Robert Malone tells Stew Peters about the life-threatening effects of COVID-19 vaccines – Brighteon.TV\n\nDr. Robert Malone, mRNA inventor and a respected name in virology and immunology, told Stew Peters the life threatening effects of the Wuhan coronavirus (COVID-19) vaccines during the January 4 episode of the “The Stew Peters Show” on Brighteon. TV.\n\nMalone said the number one reason for vaccine deaths is blood clots that result to strokes.\n\n“Number one reason is vaccinated people can have blood clots in all its various forms acute and auto immune. Blood clots, may well be what’s driving the cardiotoxicity and the central nervous system toxicity,” said Malone, who after telling the truth on the COVID mRNA vaccines got himself banned by Twitter and YouTube. (Related: Discussing vaccine dangers on Twitter is now prohibited, so how will people learn the truth about COVID-19 vaccine side effects?)\n\nThe second reason is the “spike protein, which is able to trigger vascular constriction in the small vessels of the body. Spike protein travels all over the body, leading to a variety of issues with the brain – including stroke,” said Malone, explaining that the loss of blood brain barrier integrity associated with the spike protein can also lead to damage to the heart and coagulation system.\n\nAs revealed by autopsy reports on vaccinated individuals, Malone said micro coagulopathy can affect any organ in the body. “We have emerging evidence that alterations in the function of the immune system can lead to cancer. We don’t know how long that persists, but we absolutely know it’s happening,” Malone noted.\n\nMalone is also deeply worried on the effects of the vaccines in the reproductive system of females. He said by getting the vaccines, the menstrual cycle of any girl past the age of puberty is being altered.\n\n“What is fascinating about dysmenorrhea in the alteration of menstruation and its timing and duration is that not only are a huge cohort of women of reproductive age reporting this, but you’re also having postmenopausal women reporting bleeding. What does this amount to? Well, it affects reproductive fertility, for sure,” said Malone, who said the most worrisome to him is what’s happening to the ovary. (Related: Young and healthy people suffer TRAGIC side effects of COVID vaccines.)\n\n“Your daughters are born with all of the eggs they will ever have in their ovary at the time of birth. Okay, that’s why you move through and through menopause is you’ve run out of eggs, okay? And your kids are being vaccinated, particularly these lipid vaccines, which we know from the little bit of data that we were allowed to see from the Pfizer foyer report from Japan, that these lipids go to the ovary,” said Malone.\n\n“These synthetic positively charged fats stick to the ovary for some reason. And we have this whole cascade of phenotypes and characteristics of adverse events that all point to alterations in ovarian biology.”\n\nPeters said Malone got silenced for going against those who hold power. He pointed out that the censorship machine went into overdrive following Malone’s appearance on Joe Rogan’s podcast.\n\n“Dr. Malone just got banned from Twitter 500,000 followers, poof, gone. Why? Because he criticized Pfizer’s vaccine trials, or the lack thereof, and he publicized the harms caused by these shots,” Peters said.\n\nIn particular, Malone is also campaigning hard against vaccinating children, pointing out that children are at zero risk from COVID. “And so it makes zero sense to jab them with shots that we already know has all kinds of side effects we haven’t yet seen,” Malone said.\n\nDuring Rogan’s podcast, Malone described America as being in a state of mass formation psychosis – which means leaders took advantage of America’s collective anxiety and unease to hypnotize people into a perpetually deranged state as COVID obsessives. (Related: Dr. Robert Malone warns of “mass formation psychosis” amid COVID pandemic.)\n\nGoogle, according to Peters, panicked. “If you search mass formation psychosis, Google will tweak its meaning. Google is rapidly tweaking what people would see about that term. Users got articles and videos hostile to Malone as it attempts to debunk him.”\n\nPeters also cited a press conference given by Scott Davison, chief executive officer of the Indiana-based company insurance company One America.\n\nCiting One Americas’ internal numbers, Davison noted that the death rate for Americans between the ages of 18 and 64 has increased 40 percent compared to just a year ago.\n\nDavison stressed that the mortality rate cannot be blamed on COVID-19. “Most of the claims for deaths being filed are not classified as COVID-19 deaths but just about everything like heart attacks and strokes and cancer deaths. Of course, there were also drug overdoses and murder which dramatically rise,” said Davison.\n\nPeters gave another possibility. “I know it. Dr. Malone knows that it rushed out experimental shots, being falsely referred to as safe and effective vaccines and pushed on the entire populace, are causing people to drop dead,” Peters said. He said the U.S. government has inflicted an unprecedented crime against humanity on the American population with its vaccine policy.\n\nMalone said President Joe Biden’s government is manipulating data regarding the huge number of deaths and adverse effects of the vaccines. The truth, according to Malone, will eventually come out.\n\n“And the people that would see it are exactly this cohort of people that insurance actuaries. They have their finger on the pulse of America because it’s their business. There will be a tsunami of new charges. And they’re going to have to up their rates. We’re all going to be paying substantially more for medical and life insurance due to the government’s gross mismanagement,” said Malone, noting that the mortality per million patients in the U.S. is among the worst in the world.\n\n“Under the management of this administration, and the direction of Tony Fauci, we have had a human catastrophe of death and disease and a huge surge in disability claims. This is an ongoing medical catastrophe, the likes of which the world has never seen, and certainly the U.S. insurance industry has never seen. And somebody has got to be held accountable as far as I’m concerned,” said Malone.\n\nWatch the full Jan. 4 episode of “The Stew Peters Show” below. Tune in to “The Stew Peters Show” from Monday to Friday at 8-9 p.m. on Brighteon. TV.\n\nFollow Pandemic.news for more news and information related to the coronavirus pandemic.", "opengraph": {"title": "Dr. Robert Malone tells Stew Peters about the life-threatening effects of COVID-19 vaccines – Brighteon.TV", "type": "article", "url": "https://www.medicalcensorship.com/2022-01-11-robert-malone-discusses-life-threatening-effects-vaccines.html", "site_name": "Medical Censorship News", "description": "Dr. Robert Malone, mRNA inventor and a respected name in virology and immunology, told Stew Peters the life threatening effects of the Wuhan coronavirus (COVID-19) vaccines during the January 4 episode of the “The Stew Peters Show” on Brighteon. TV. Malone said the number one reason for vaccine deaths is blood clots that result to strokes. “Number […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2022/01/Robert-Malone-Joe-Rogan-interview.png"}, "tags": ["death rate", "covid-19", "Robert Malone", "Big Pharma", "Vaccine deaths", "vaccine", "deception", "vaccine injury", "Pfizer", "censorship", "vaccine damage", "Big Tech", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/f7f0739e-2c50-4e84-be45-178c41115f7c", "https://www.brighteon.tv/", "https://www.wakingtimes.com/miscarriages-and-other-tragic-side-effects-of-the-mrna-shots/", "https://naturalnews.com/2020-12-22-vaccine-dangers-twitter-prohibited-covid19-jabs.html", "https://spikeprotein.news", "https://naturalnews.com/2021-12-10-healthy-people-suffer-covid-vaccine-side-effects.html", "https://censorship.news", "https://greatgameindia.com/study-debunks-covid-shots-kids/", "https://naturalnews.com/2021-12-07-robert-malone-warns-of-mass-formation-psychosis.html", "https://pharmaceuticalfraud.com", "https://vaccinedeaths.com", "https://www.brighteon.com/f7f0739e-2c50-4e84-be45-178c41115f7c", "https://www.brighteon.tv/", "https://pandemic.news/", "https://www.brighteon.com/f7f0739e-2c50-4e84-be45-178c41115f7c", "https://www.wakingtimes.com/miscarriages-and-other-tragic-side-effects-of-the-mrna-shots/", "https://greatgameindia.com/study-debunks-covid-shots-kids/"], "authors": [], "publish_date": null}