{"result_id": "197016", "URL": "https://www.medicalcensorship.com/2023-01-19-bbc-buildings-plastered-photos-covid-vaccine-dead.html", "timestamp": "2023-04-25 16:19:42 CEST+0200", "meta": {"description": "On January 7, 2023, three different groups held rallies across the UK to shine a light on the media’s propaganda in the massive cover up of vaccine injuries and deaths. The People’s Resistance, the North Unites, and the Freedom Fighters came together for a rally called: “The Media is the Virus.” In their wake, the […]", "lang": "en", "keywords": "activism,badmedicine,BBC,Blood clots,brain bleed,crimes against humanity,disinfo,heart inflammation,medical malfeasceance,propaganda,seizures,sudden death,traitors,Vaccine deaths,vaccine injury,vaccine mandates,vaccine murder,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2023-01-19-bbc-buildings-plastered-photos-covid-vaccine-dead.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "BBC executives put on notice, buildings get plastered with photos of people who died from the COVID vaccine", "cleaned_text": "BBC executives put on notice, buildings get plastered with photos of people who died from the COVID vaccine\n\nOn January 7, 2023, three different groups held rallies across the UK to shine a light on the media’s propaganda in the massive cover up of vaccine injuries and deaths. The People’s Resistance, the North Unites, and the Freedom Fighters came together for a rally called: “The Media is the Virus.” In their wake, the groups plastered six BBC buildings with photos of people who died from the COVID vaccine. The groups targeted BBC Radio Merseyside, BBC Radio Sheffield, BBC Yorkshire Leeds, BBC Media City Salford, BBC the Mailbox Birmingham, and BBC Barrack Rd, Newcastle. Online, the groups called out the BBC for being “traitors to our country.” They also plastered the buildings with “wanted” signs — targeting those responsible for crimes against humanity.\n\n“All mockingbird media are traitors to everyone’s country and have been for a very long time,” the activist groups wrote on Telegram. “BBC buildings today were given some TRUTH,” the group posted online. “Enough is enough….the media is complicit in the biggest crimes against humanity and need to be held accountable for the deaths and harms caused to our friends and families.”\n\nThe BBC is complicit in silencing stories of vaccine injury and death across social media platforms. The BBC took in at least $23.7 million from the Gates Foundation to parrot vaccine propaganda that has ruined countless lives.\n\nBBC buildings plastered with photos of those murdered by covid-19 vaccines\n\nThe photos represent various young people, who died shortly after receiving the covid-19 vaccines.\n• Joshua Henry was only 13 years old when he died from a brain bleed just hours after receiving his second dose of the Pfizer covid-19 vaccine.\n• Katie Lees was only 34 years old when she died from a blood clot that formed just 13 days after receiving the AstraZeneca covid-19 vaccine. Because these people were within the 14 day window post vaccination, they were still classified as “unvaccinated deaths” in the official hospital and government statistics.\n• Shirel Hilel was only 22 years old when she developed heart inflammation, just two weeks after taking a second dose of the Pfizer covid-19 vaccine. The heart inflammation killed her.\n• Luke Garrett was only 20 when he took the Pfizer covid-19 vaccine. In less than 12 hours after taking the jab, he suffered from a seizure and passed away.\n• Jack Hurn was just 26 years old when he took the AstraZeneca vaccine. Two weeks after the shot, he died of blood clots on his brain.\n• Sean Harman was seventeen years old when he took a Pfizer covid jab. He died four weeks later of “unascertained” causes. An official autopsy found that his heart had become inflamed after getting jabbed. A pathologist confirmed that the “vaccine did kill” Sean.\n• Kassidi Kurill was 39 years young, with no pre-existing health conditions when she took the Moderna covid-19 vaccine. She died within four days of taking her second dose.\n• Stephen Wright was a young 32-year-old who suddenly suffered from blood clots on his brain just ten days after receiving the AstraZeneca vaccine.\n• Simone Scott, age 19, began having complications from the Moderna vaccine and died from a heart transplant just six weeks after receiving the jab.\n• Victor Simoes was only 34 years old when he died of an acute aortic dissection, two weeks after receiving Pfizer’s deadly brew.\n\nWanted posters target BBC executives who pushed deadly jabs onto the population\n\nThe pictures included not only the faces of those murdered by the covid-19 vaccine, but they also included wanted posters of those who promoted covid-19 vaccine lies, propaganda, and unlawful mandates. These wanted posters included Tracey Brabin, Mayor of West Yorkshire; John Robins, West Yorkshire Police Chief; Deborah Turness, CEO of BBC News and Current Affairs.\n\nThe North Unites put a target on BBC propagandists who pushed for vaccine mandates and certain vaccine damage and death. These included Charlotte Moore, Chief Content Officer; Rhodri Talfan Davies, Director of Nations; Gautam Rangarajan, Group Director of Strategy and Performance; Tom Fussell, CEO of BBC Studios; Alan Dickson, Chief Financial Officer, Kerris Bright, Chief Customer Officer; Timothy Davie, Director General; and Marianna Spring, Disinformation Correspondent. These figureheads were responsible for promoting lies, propaganda, and fake news. They have been put on notice for their supportive roles in carrying out these global crimes against humanity.", "opengraph": {"title": "BBC executives put on notice, buildings get plastered with photos of people who died from the COVID vaccine", "type": "article", "url": "https://www.medicalcensorship.com/2023-01-19-bbc-buildings-plastered-photos-covid-vaccine-dead.html", "site_name": "Medical Censorship News", "description": "On January 7, 2023, three different groups held rallies across the UK to shine a light on the media’s propaganda in the massive cover up of vaccine injuries and deaths. The People’s Resistance, the North Unites, and the Freedom Fighters came together for a rally called: “The Media is the Virus.” In their wake, the […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2023/01/BBC-Wanted-1.jpg"}, "tags": ["crimes against humanity", "seizures", "vaccine wars", "activism", "medical malfeasceance", "Vaccine deaths", "BBC", "vaccine murder", "vaccine injury", "Blood clots", "vaccine mandates", "heart inflammation", "vaccines", "sudden death", "disinfo", "traitors", "brain bleed", "propaganda"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2023/01/bbc-virus-least-6-bbc-buildings-across-uk-covered-photos-people-died-covid-vaccine-video/", "https://vaccinedamage.news/", "https://www.thegatewaypundit.com/2023/01/bbc-virus-least-6-bbc-buildings-across-uk-covered-photos-people-died-covid-vaccine-video/", "http://vaccineinjury.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2023-01-19-bbc-buildings-plastered-photos-covid-vaccine-dead.html&linkname=BBC%20executives%20put%20on%20notice%2C%20buildings%20get%20plastered%20with%20photos%20of%20people%20who%20died%20from%20the%20COVID%20vaccine", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}