{"result_id": "197015", "URL": "https://www.medicalcensorship.com/2023-01-12-pfizer-bullied-twitter-censoring-tweets-natural-immunity.html", "timestamp": "2023-04-25 16:19:41 CEST+0200", "meta": {"description": "The reason why former U.S. Food and Drug Administration (FDA) commissioner Dr. Brett Giroir was censored on Twitter for talking about natural immunity to covid is because fellow former FDA commissioner Scott Gottlieb, now a Pfizer board member, pushed Twitter to censor Giroir and many others. Leaked emails obtained as part of the Twitter Files […]", "lang": "en", "keywords": "badhealth,badmedicine,censorship,chemical violence,corruption,COVID,FDA,glitch,gottlieb,health freedom,immune system,Medical Tyranny,medical violence,natural immunity,Pfizer,science deception,Scott Gottlieb,speech police,technocrats,thought police,Twitter Files", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2023-01-12-pfizer-bullied-twitter-censoring-tweets-natural-immunity.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "Leaked emails show Pfizer board member bullied Twitter into censoring tweets about natural immunity, low (zero) covid risk in children", "cleaned_text": "Leaked emails show Pfizer board member bullied Twitter into censoring tweets about natural immunity, low (zero) covid risk in children\n\nThe reason why former U.S. Food and Drug Administration (FDA) commissioner Dr. Brett Giroir was censored on Twitter for talking about natural immunity to covid is because fellow former FDA commissioner Scott Gottlieb, now a Pfizer board member, pushed Twitter to censor Giroir and many others.\n\nLeaked emails obtained as part of the Twitter Files show Gottlieb communicating back and forth with employees of not just Twitter but also YouTube. Gottlieb aggressively demanded swift action against Giroir and others whose tweets threatened to cut into Pfizer’s bottom line in terms of covid “vaccine” sales and uptake.\n\nOn Aug. 27, 2021, Gottlieb told Twitter executive Todd O’Boyle to take immediate action against Giroir for daring to talk about natural immunity. Gottlieb called Giroir’s word’s “corrosive,” presumably in reference to Pfizer’s profit streams.\n\n“Here he draws a sweeping conclusion off a single retrospective study in Israel that hasn’t been peer reviewed,” Gottlieb complained about Giroir in his email to O’Boyle. “But this tweet will end up going viral and driving news coverage.”\n\nGottlieb, who rakes in nearly half a million dollars annually as a Pfizer board member, was really upset that Giroir wrote that post-infection immunity “is superior to vaccine immunity, by A LOT [sic].” Telling the truth like this is bad business for Pfizer, so Gottlieb did what he could to silence Giroir.\n\nHow many lives were ruined or lost because of Gottlieb’s interference?\n\nKeep in mind that Giroir never actually told anyone to not get “vaccinated” for covid. In fact, he wrote in the same “offending” tweet that people who have not been previously infected with the Fauci Flu should still “get vaccinated,” which was still not enough for Gottlieb.\n\nIn order to continue generating tens of billions of dollars in obscene new profits, Pfizer needs everyone to keep getting injected over and over and over again – which some of them will not do if they read messages like Giroir’s pointing to studies showing the superiority of natural immunity.\n\nThe same study that Gottlieb complained was never peer-reviewed, by the way, ended up being peer-reviewed, followed by its eventual publishing in the journal Clinical Infectious Diseases. The paper:\n\n“… demonstrated that natural immunity confers longer lasting and stronger protection against infection, symptomatic disease and hospitalization caused by the Delta variant of SARS-CoV-2, compared to the BNT162b2 two-dose vaccine-induced immunity.”\n\nFollowing Gottlieb’s complaint about Giroir’s post, a Twitter analyst who reviewed it ultimately decided that it did not violate the platform’s “misinformation” rule. Even so, because of Gottlieb’s interference, Twitter ended up slapping a “misinformation” label across it, preventing it from being shared and having wider reach.\n\nTo this day, Giroir stands by his post, claiming that it “was accurate then, and it remains so now.” Gottlieb, meanwhile, also defends his interference, claiming that all he was trying to do was address “false and inflammatory” information that just so happens, by coincidence, to negatively affect his and Pfizer’s income and profit streams.\n\nGottlieb also complained about another similar post from Justin Hart, who warned his followers that covid is a non-issue for children – thus, “vaccinating” them is imprudent and medically useless, Hart’s tweet suggested without actually stating such.\n\n“… sticks and stones may break my bones but a viral pathogen with a child mortality rate of <>0% has cost our children nearly three years of schooling,” Hart wrote, much to the chagrin of Gottlieb.\n\nTo learn more about the dangers and ineffectiveness of covid “vaccines,” be sure to check out ChemicalViolence.com.", "opengraph": {"title": "Leaked emails show Pfizer board member bullied Twitter into censoring tweets about natural immunity, low (zero) covid risk in children", "type": "article", "url": "https://www.medicalcensorship.com/2023-01-12-pfizer-bullied-twitter-censoring-tweets-natural-immunity.html", "site_name": "Medical Censorship News", "description": "The reason why former U.S. Food and Drug Administration (FDA) commissioner Dr. Brett Giroir was censored on Twitter for talking about natural immunity to covid is because fellow former FDA commissioner Scott Gottlieb, now a Pfizer board member, pushed Twitter to censor Giroir and many others. Leaked emails obtained as part of the Twitter Files […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2023/01/Covid-19-Coronavirus-Pfizer-Vaccine-Vials.jpg"}, "tags": ["speech police", "FDA", "COVID", "medical violence", "Pfizer", "corruption", "science deception", "technocrats", "Twitter Files", "immune system", "chemical violence", "glitch", "natural immunity", "Medical Tyranny", "censorship", "thought police", "Scott Gottlieb", "gottlieb", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/pfizer-board-member-pressured-twitter-to-censor-posts-on-natural-immunity-low-covid-risk-to-children-emails_4972280.html", "https://www.naturalnews.com/2023-01-10-covid-money-corrupt-global-financial-system-intact.html", "http://chemicalviolence.com", "https://www.theepochtimes.com/pfizer-board-member-pressured-twitter-to-censor-posts-on-natural-immunity-low-covid-risk-to-children-emails_4972280.html", "https://www.naturalnews.com/2023-01-10-covid-money-corrupt-global-financial-system-intact.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicalcensorshipcom%2F2023-01-12-pfizer-bullied-twitter-censoring-tweets-natural-immunity.html&linkname=Leaked%20emails%20show%20Pfizer%20board%20member%20bullied%20Twitter%20into%20censoring%20tweets%20about%20natural%20immunity%2C%20low%20%28zero%29%20covid%20risk%20in%20children", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}