{"result_id": "197024", "URL": "http://www.medicalcensorship.com/2021-11-30-physician-assistant-told-to-stop-reporting-vaccine-injuries.html", "timestamp": "2023-04-25 16:19:47 CEST+0200", "meta": {"description": "Physician assistant Deborah Conrad said on a podcast that when she saw a flood of COVID-19 vaccine adverse events in the ER where she worked, she was told not to report them to VAERS, the U.S. government’s official Vaccine Adverse Event Reporting System. (Article by Kennedy Hall republished from LifeSiteNews.com) Deborah Conrad is a physician assistant who worked at United Memorial Medical Center in New York […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,conspiracy,COVID,deception,hospitals,medical censorship,Medical Tyranny,New York,pandemic,pharmaceutical fraud,suppressed,traitors,vaccine,Vaccine injuries", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "http://www.medicalcensorship.com/2021-11-30-physician-assistant-told-to-stop-reporting-vaccine-injuries.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "New York physician assistant says she was told to stop reporting COVID shot injuries", "cleaned_text": "New York physician assistant says she was told to stop reporting COVID shot injuries\n\nPhysician assistant Deborah Conrad said on a podcast that when she saw a flood of COVID-19 vaccine adverse events in the ER where she worked, she was told not to report them to VAERS, the U.S. government’s official Vaccine Adverse Event Reporting System.\n\nDeborah Conrad is a physician assistant who worked at United Memorial Medical Center in New York for about 17 years.\n\nConrad appeared on The Sharyl Attkisson Podcast and shared her story of what she went through as the COVID shot was rolled out at the hospital she worked at for over a decade.\n\nConrad said she saw “heart attacks, cardiomyopathies, arrhythmias of the heart, blood clots, [and] pulmonary emboli” in January and February in patients who had taken the shot at the outset of the vaccine roll-out.\n\nIn her role as a physician assistant, Conrad would report the incidents to VAERS. At first, she saw “just a few patients” with what might have been adverse events related to the COVID jab. Then she noticed “all these people coming in,” so she started notifying her “administrative leaders of what was going on.”\n\nShe told the podcast host that the administration “didn’t really feel there was a whole lot to worry about.” Eventually, “the emergency room started catching on” to the rise in post-vaccine patients, and her colleagues started “giving [her] patients to report.”\n\nThe health care veteran brought further concerns to her administration who told her she was “overreporting,” as it was their impression that what looked like vaccine injuries were not in fact caused by the vaccine.\n\nWhile causation is not explicitly confirmed through the VAERS reporting system, neither can it be presumed that all side effects are reported. Indeed, one study in 2010 found that “fewer than 1% of vaccine injuries” are reported to VAERS, suggesting the actual numbers of deaths and injuries are significantly higher.\n\nPodcast host Sharyl Attkisson has a professional history in investigating vaccine-related injuries. She told her guest that “I was assigned to cover vaccine-related issues I knew nothing about, but I went down the rabbit hole at CBS News.” Attkisson expressed that in her experience, she had seen evidence of “cover-ups” in the early 2000s when investigating the relationship between pharmaceutical companies and the government.\n\nConrad said she kept reporting what she saw to her leadership, but “they absolutely refused to do any reporting.”\n\nDeborah Conrad was told that she had to “support the vaccine effort” because “they want vaccines in every arm.” The push to vaccinate the majority of the world’s population in order to prevent serious disease for those who are not at risk to begin with – the CDC reports an infection survival rate of greater than 99.95% for those under age 50 — adds to the skepticism surrounding the increased push for vaccination.\n\nShe also told the host that she called foul on the frequent claim that the vaccines are “100 percent safe and effective.” Pulling from her years of experience in health care, she said “that’s just … ridiculous … because nothing is 100 percent safe and effective.”\n\nWhile Conrad was not officially terminated for her pro-transparency stance when it came to potential vaccine injuries, she said there was an “atmosphere” where every time she “tried to talk about it … [she] would get sort of reprimanded.” Her “direct boss” made things “very uncomfortable.” She eventually had to leave her position because of vaccination mandates put in to effect in New York state.\n\nShe ended the podcast interview by telling listeners that “you don’t necessarily have to rely on a health care worker to do a VAERS report, you can do it yourself for your own potential vaccine side effect.” According to Conrad, any post-vaccination issue that could be vaccine-related can be reported to VAERS, and it does not have to happen within a strict amount of time.", "opengraph": {"title": "New York physician assistant says she was told to stop reporting COVID shot injuries", "type": "article", "url": "https://www.medicalcensorship.com/2021-11-30-physician-assistant-told-to-stop-reporting-vaccine-injuries.html", "site_name": "Medical Censorship News", "description": "Physician assistant Deborah Conrad said on a podcast that when she saw a flood of COVID-19 vaccine adverse events in the ER where she worked, she was told not to report them to VAERS, the U.S. government’s official Vaccine Adverse Event Reporting System. (Article by Kennedy Hall republished from LifeSiteNews.com) Deborah Conrad is a physician assistant who worked at United Memorial Medical Center in New York […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2021/11/Doctor-Mask-Close-Up-Covid-19-Vial-Vaccine.jpg"}, "tags": ["pandemic", "conspiracy", "medical censorship", "hospitals", "Big Pharma", "COVID", "vaccine", "deception", "New York", "Medical Tyranny", "Vaccine injuries", "traitors", "suppressed", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/physician-assistant-says-she-was-told-to-stop-reporting-covid-vaccine-injuries/", "https://sharylattkisson.com/2021/11/physician-assistant-my-bosses-didnt-want-me-to-report-covid-19-vaccine-side-effects-podcast-2/", "https://vaers.hhs.gov/data.html", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://www.lifesitenews.com/news/23-people-dead-in-norway-after-taking-pfizer-covid-vaccine", "https://childrenshealthdefense.org/defender/13-year-old-jacob-clynick-dies-pfizer-vaccine-myocarditis/", "https://www.lifesitenews.com/news/28-year-old-physical-therapist-dies-two-days-after-taking-covid-vaccine", "https://www.lifesitenews.com/news/39-year-old-woman-dies-4-days-after-second-moderna-aaccine-autopsy-ordered", "https://www.lifesitenews.com/news/39-year-old-nurse-aide-dies-within-48-hours-of-receiving-mandated-covid-19-shot", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/planning-scenarios.html", "https://www.lifesitenews.com/news/physician-assistant-says-she-was-told-to-stop-reporting-covid-vaccine-injuries/"], "authors": [], "publish_date": null}