{"result_id": "197046", "URL": "https://www.medicalcensorship.com/2021-04-28-big-tech-colluding-big-pharma-robert-kennedy-vaccine-truth-covid.html", "timestamp": "2023-04-25 16:20:01 CEST+0200", "meta": {"description": "All American institutions are now wholly ‘owned’ by globalist billionaires who have no loyalty to their country or their fellow citizens; only to profits and control at all costs. Big Tech — Google, YouTube, Amazon, Facebook, Twitter — have all gotten so big they literally control the flow of information that Americans can see. Study […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,banned,bias,Big Pharma,Big Tech,brain damage,censored,censorship,collusion,covid-19,danger,death,deception,free speech,glitch,health freedom,informed consent,Johnson & Johnson,NPR,Pfizer,Robert F Kennedy,truth,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.medicalcensorship.com/2021-04-28-big-tech-colluding-big-pharma-robert-kennedy-vaccine-truth-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicalcensorship.com", "title": "Big Tech now colluding with Big Pharma to keep the truth from Americans as Instagram bans Robert F. Kennedy’s vaccine truths", "cleaned_text": "Big Tech now colluding with Big Pharma to keep the truth from Americans as Instagram bans Robert F. Kennedy’s vaccine truths\n\nAll American institutions are now wholly ‘owned’ by globalist billionaires who have no loyalty to their country or their fellow citizens; only to profits and control at all costs.\n\nBig Tech — Google, YouTube, Amazon, Facebook, Twitter — have all gotten so big they literally control the flow of information that Americans can see. Study after study has proven as much, and there is no more eminent researcher in this field than Dr. Robert Epstein.\n\n“Google and similar companies like Facebook are completely unregulated in the United States, so they can do whatever they please,” he said in 2019.\n\n“If they all work together in 2020 to support the same presidential candidate, they can shift upwards of 15 million votes with no one knowing that they have been manipulated and without leaving a paper trail,” he said.\n\nThat’s precisely what they did, but it’s even worse that vote tampering and stealing American elections, if you can imagine. These same companies control the flow of information in a way that makes Communist regimes like China blush.\n\nIn August, before Big Tech helped Joe Biden’s handlers steal the election for him, then-President Donald Trump revealed the truth: Big Tech 100-percent controls what information we see.\n\n“The tech companies are very dishonest about that and about free speech,” Trump told Breitbart News.\n\nHe was right, as vaccine researcher and truth-teller Robert F. Kennedy has discovered. He was recently banned from Instagram after he tried to share revealing information about vaccines and why Americans should not just blindly believe they are universally good for humanity.\n\nNPR, which is partially funded by taxpayers, helped perpetuate the lie about why he was censored:\n\nRobert F. Kennedy Jr. is now blocked from Instagram after he repeatedly undercut trust in vaccines. Kennedy has also spread conspiracy theories about Bill Gates, accusing him of profiteering off vaccines and attempting to take control of the world’s food supply.\n\n“We removed this account for repeatedly sharing debunked claims about the coronavirus or vaccines,” a spokesperson for Facebook, which owns Instagram, told NPR on Thursday.\n\nKennedy has been a prominent voice in the anti-vaccine community for years, speaking out against childhood vaccines and promoting controversial and disproven claims that seek to link vaccines with autism.\n\nFirst of all it isn’t ‘anti-vaccine.’ Kennedy isn’t ‘anti-vaccine’ as much as he is in favor of telling the truth about them and letting Americans decide on their own what they want to do. That is especially important now in the age of the COVID-19 vaccines, one of which (Johnson & Johnson) has been blamed for causing deadly blood clots in several women (but it’s been cleared again for use anyway).\n\nIn addition, the vaccine manufactured by Pfizer was recently linked to brain damage and neurodegenerative disease.\n\nBut for some reason, Kennedy isn’t allowed to tell his followers or anyone else who will listen that there are inherent dangers to these vaccines.\n\nEven Kennedy’s own family has come out against him.\n\n“We love Robert F. Kennedy Jr., but he is part of a misinformation campaign that’s having heartbreaking — and deadly — consequences,” Kathleen Kennedy Townsend, Joseph P. Kennedy II and Maeve Kennedy McKean wrote in an opinion piece for Politico, another left-wing government mouthpiece pushing unquestioning compliance with getting vaccinated.\n\nStill, Kennedy is soldiering on. He is warning people that the Pfizer vaccine in particular, that the new mRNA technology used to create it and some of the first COVID vaccines, is untested and can lead to serious health problems.\n\n“The current RNA based SARS-CoV-2 vaccines were approved in the U.S. using an emergency order without extensive long term safety testing,” a recent report published in the journal Microbiology & Infectious Diseases noted.\n\nThis is a peer-reviewed publication. But Big Tech won’t let Robert F. Kennedy say the same thing.", "opengraph": {"title": "Big Tech now colluding with Big Pharma to keep the truth from Americans as Instagram bans Robert F. Kennedy’s vaccine truths", "type": "article", "url": "https://www.medicalcensorship.com/2021-04-28-big-tech-colluding-big-pharma-robert-kennedy-vaccine-truth-covid.html", "site_name": "Medical Censorship News", "description": "All American institutions are now wholly ‘owned’ by globalist billionaires who have no loyalty to their country or their fellow citizens; only to profits and control at all costs. Big Tech — Google, YouTube, Amazon, Facebook, Twitter — have all gotten so big they literally control the flow of information that Americans can see. Study […]", "image": "https://www.medicalcensorship.com/wp-content/uploads/sites/652/2021/04/kennedy.jpg"}, "tags": ["informed consent", "Big Pharma", "danger", "deception", "Pfizer", "censored", "bias", "covid-19", "collusion", "banned", "NPR", "brain damage", "truth", "glitch", "Big Tech", "vaccine wars", "death", "censorship", "Robert F Kennedy", "Johnson & Johnson", "vaccines", "free speech", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2020-11-25-robert-epstein-shows-evidence-system-was-rigged.html", "https://www.breitbart.com/tech/2020/08/11/exclusive-president-donald-trump-big-tech-100-percent-wants-control-information-americans-see/", "https://www.npr.org/sections/coronavirus-live-updates/2021/02/11/966902737/instagram-bars-robert-f-kennedy-jr-for-spreading-vaccine-misinformation", "https://www.naturalnews.com/2021-04-27-covid19-vaccine-pfizer-brain-damage-neurodegenerative-disease.html", "https://www.politico.com/magazine/story/2019/05/08/robert-kennedy-jr-measles-vaccines-226798", "https://www.naturalnews.com/2021-04-27-covid19-vaccine-pfizer-brain-damage-neurodegenerative-disease.html", "https://www.politico.com/magazine/story/2019/05/08/robert-kennedy-jr-measles-vaccines-226798", "https://www.npr.org/sections/coronavirus-live-updates/2021/02/11/966902737/instagram-bars-robert-f-kennedy-jr-for-spreading-vaccine-misinformation"], "authors": [], "publish_date": null}