{"result_id": "198034", "URL": "https://www.medicaldaily.com/scientists-find-both-covid-19-and-its-vaccination-are-linked-taxing-heart-467738", "timestamp": "2023-04-25 16:20:13 CEST+0200", "meta": {"description": "POTS is a debilitating heart condition in which there is an abnormal increase in heart rate when a person stands.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/scientists-find-both-covid-19-and-its-vaccination-are-linked-taxing-heart-467738", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Scientists Find Both Covid-19 And It's Vaccination Are Linked To A Taxing Heart Condition", "cleaned_text": "A new study has found a connection between a difficult-to-diagnose heart condition and both COVID-19 and COVID-19 vaccination.\n\nThe study, published in the journal Nature Cardiovascular Research, found that COVID-19 vaccination increases the chances of a person getting Postural Orthostatic Tachycardia Syndrome (POTS), but not more than the risk of getting the heart ailment after COVID-19 diagnosis.\n\nPOTS is a debilitating heart condition in which there is an abnormal increase in heart rate when a person stands. The study led by researchers from the Smidt Heart Institute at Cedars-Sinai, found people diagnosed with COVID-19 are five times more likely to develop POTS than after getting vaccinated.\n\n“The main message here is that while we see a potential link between COVID-19 vaccination and POTS, preventing COVID-19 through vaccination is still the best way to reduce your risk of developing POTS,” Alan C. Kwan, first author of the study and a cardiovascular specialist at Cedars-Sinai, said, reported SciTechDaily.\n\nPOTS is a nervous system-related condition that is most prevalent in young women of childbearing age. The cardinal symptom of the disorder is a rapid increase of heartrate by 30 beats per minute, within just 10 minutes of standing.\n\nOther symptoms include fainting, dizziness, and fatigue. Patients with severe disease may also have symptoms such as migraine, increased urination, sweaty extremities, anxiety, and tremor.\n\nFor the study, researchers used data from almost 3,00,000 vaccinated patients treated within the Cedars-Sinai Health System from 2020 to 2022, along with approximately 12,000 Cedars-Sinai patients with COVID-19.\n\n“From this analysis, we found that the odds of developing POTS are higher 90 days after vaccine exposure than the 90 days prior to exposure,” Kwan said, as per the outlet. “We also found that the relative odds of POTS were higher than would be explained by increases in visits to physicians after vaccination or infection.”\n\n“This knowledge identifies a possible—yet still relatively slim—association between COVID-19 vaccination and POTS,” Kwan further said.\n\nHowever, researchers emphasize the need to get vaccinated despite the results.\n\nPreviously understudied, the pandemic has brought the POTS condition to the limelight, according to the researchers.\n\n“In an unexpected but important way, the COVID-19 pandemic brought a great deal of awareness to POTS—both to patients and providers,” Peng-Sheng Chen, an expert on the condition, said. “Given a broader understanding of the disease, many patients can be diagnosed more quickly permitting earlier interventions that can greatly improve their symptoms.”\n\nWhile the research exhibits an ignored trend, researchers caution that more work needs to be done to further understand the phenomenon.\n\n“We recognize as clinicians that side effects from vaccines can vary in type and severity, even if still uncommon overall. We hope that clearer data and improved understanding will eventually enhance medical trust and quality of care as well as communications around vaccines,” said Kwan. “Ultimately, our goal is to optimize vaccine uptake.”", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/scientists-find-both-covid-19-and-its-vaccination-are-linked-taxing-heart-467738", "title": "Scientists Find Both Covid-19 And It's Vaccination Are Linked To A Taxing Heart Condition", "description": "POTS is a debilitating heart condition in which there is an abnormal increase in heart rate when a person stands.", "image": "https://d.medicaldaily.com/en/full/438937/heartache.jpg", "image:alt": "heartache", "image:width": "1280", "image:height": "853", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "POTS", "article:published_time": "2023-01-11T05:14:24-05:00", "article:modified_time": "2023-01-11T05:14:24-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nature.com/articles/s44161-022-00177-8", "https://scitechdaily.com/new-research-links-covid-19-infection-and-vaccination-to-a-debilitating-heart-condition/", "https://www.medicaldaily.com/covid-19-increases-diabetes-risk-study-suggests-467713"], "authors": [], "publish_date": "2023-01-11T05:14:24-05:00"}