{"result_id": "198043", "URL": "https://www.medicaldaily.com/fda-approve-second-bivalent-booster-after-first-dose-showed-strong-protection-469307", "timestamp": "2023-04-25 16:20:16 CEST+0200", "meta": {"description": "The agency is expected to authorize the rollout of the second booster later this spring.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/fda-approve-second-bivalent-booster-after-first-dose-showed-strong-protection-469307", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "FDA To Approve Second Bivalent Booster After First Dose Showed Strong Protection", "cleaned_text": "The U.S. Food and Drug Administration (FDA) will approve the second bivalent booster this spring after the first dose showed promising results in a recent study.\n\nThe Washington Post reported this week that the FDA would announce its decision in the coming weeks to extend the protection afforded by the COVID-19 vaccines and the first bivalent booster dose.\n\nOnce the second booster starts rolling out, people aged 65 and above and those with weak immune systems are urged to get jabbed right away since it would be four months since they received the first bivalent dose.\n\nThe bivalent booster works more efficiently than the monovalent booster, which was rolled out earlier in the pandemic. The updated booster is called bivalent because aside from the original SARS-CoV-2 strain, it also works against the more easily transmissible Omicron variants, per WebMD.\n\nThe first bivalent booster was authorized for rollout last September. Since its effectiveness wanes over time, a second dose is needed to extend its protection against COVID.\n\nA recent study published in the medRxiv preprint server compared the effectiveness and durability of protection provided by the monovalent and bivalent boosters. The researchers found that the updated booster had a higher neutralizing capacity against Omicron and the newer variants in older adults.\n\nHowever, they also found that the monovalent vaccine remarkably provided long-lasting protection against hospitalization that plateaued at six months. Thus, people not at risk of developing severe disease and received the monovalent booster may no longer need additional doses, as pointed out by News-Medical.\n\nStaying up to date with the vaccines is still important even if the number of cases, hospitalizations, and deaths from the virus has significantly lowered. COVID-19 remains a serious health risk for older adults and the immunocompromised, according to experts.\n\nPeople familiar with the FDA's planned approval told Washington Post that the spring booster is the latest effort to provide additional protection to high-risk individuals amid the pandemic. Officials also said older people would be better shielded from serious illness with the booster based on studies.\n\nPer the latest data by the Centers for Disease Control and Prevention (CDC), only about 42% of people 65 and above have received the first bivalent booster.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/fda-approve-second-bivalent-booster-after-first-dose-showed-strong-protection-469307", "title": "FDA To Approve Second Bivalent Booster After First Dose Showed Strong Protection", "description": "The agency is expected to authorize the rollout of the second booster later this spring.", "image": "https://d.medicaldaily.com/en/full/458755/covid-19-vaccination-gloves.jpg", "image:alt": "COVID-19 vaccination - gloves", "image:width": "1024", "image:height": "666", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Covid-19", "article:published_time": "2023-04-07T21:35:37-04:00", "article:modified_time": "2023-04-07T21:35:37-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.washingtonpost.com/health/2023/04/03/covid-booster-shot/", "https://www.webmd.com/vaccines/covid-19-vaccine/news/20230404/fda-to-ok-second-covid-booster-people-65-and-older", "https://www.medrxiv.org/content/10.1101/2023.03.31.23288018v1", "https://www.news-medical.net/amp/news/20230405/Long-term-protection-and-high-efficacy-of-bivalent-BA1-booster-confirmed-in-older-adults.aspx", "/babies-born-brain-damage-after-moms-contract-covid-19-during-pregnancy-469298", "/several-long-covid-patients-have-trouble-sleeping-issue-three-times-likely-blacks-469290", "/nasal-spray-live-coronavirus-blocks-covid-19-replication-nose-throat-469281", "https://covid.cdc.gov/covid-data-tracker/#vaccinations_vacc-people-additional-dose-totalpop"], "authors": [], "publish_date": "2023-04-07T21:35:37-04:00"}