{"result_id": "198042", "URL": "https://www.medicaldaily.com/covid-19-vaccines-killed-13-million-study-claims-468289", "timestamp": "2023-04-25 16:20:15 CEST+0200", "meta": {"description": "Researchers claimed the vaccines caused numerous deaths based on autopsy studies and adverse effects monitoring systems.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/covid-19-vaccines-killed-13-million-study-claims-468289", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "COVID-19 Vaccines Led To 13 Million Deaths Worldwide: Report", "cleaned_text": "The COVID-19 vaccines may have led to millions of fatalities worldwide, a group of researchers from Israel and Australia claimed in a new report.\n\nThe report, titled “Age-stratified COVID-19 vaccine-dose fatality rate for Israel and Australia,” was published by the Correlation Research in the Public Interest earlier this month.\n\nAuthored by Denis G. Rancourt, Jérémie Mercier, Marine Baudin and Joseph Hickey, the study found that the fatality rate of the vaccines increased exponentially with age. The rate was close to 1% in the oldest age group.\n\n“It is now well established from autopsy studies and adverse effect monitoring that the COVID-19 vaccines can cause death. The vaccine-dose fatality rate (vDFR), which is the ratio of vaccine-induced deaths to vaccine doses delivered in a population, has recently been measured by us to be as large as 1% in India and when 'vaccine equity' campaigns were applied in high-poverty states of the USA, and to be 0.05 % in Australia, with data that is not discriminated by age group,” the authors wrote.\n\nAccording to the team, the COVID-19 vaccines caused an estimated global total of 13 million deaths based on their detailed analysis of all-cause mortality and vaccine rollout data at a population level. They also looked into autopsy studies and adverse effects monitoring systems.\n\nThough it was difficult to differentiate the causes of excess mortality amid the pandemic lockdowns, the researchers observed spikes in deaths directly related to vaccine rollout initiatives. The all-cause mortality peaks reportedly happened simultaneously with specific vaccine releases amid the multiple-dose vaccine campaigns, as per the Canadian media outlet Rebel News.\n\n“In all these cases, which we have studied, the vaccine rollouts occur at significantly different times, for different jurisdictions and age groups, yet are always synchronous with the step-wise increases and anomalous peaks in [all-cause mortality],” the team noted.\n\nMore deaths were recorded among elderly people. The team said it might have something to do with how the vaccination programs prioritized the age group during the rollouts. “Prioritizing elderly people for vaccination, in the absence of relevant data, was reckless,” they said.\n\nIn addition to pointing out the fatalities associated with the vaccines, the researchers claimed they (the vaccines) did not save lives. The team even deemed the vaccines highly toxic. The controversial pre-print report was originally hosted on ResearchGate. But the platform removed it, saying it violated its Terms of Service, as per Rebel News.\n\nSince the start of the pandemic, the Centers for Disease Control and Prevention (CDC) and other health authorities have been advocating for vaccines as a means to gain protection from COVID-19 and prevent hospitalization and death due to the virus.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/covid-19-vaccines-killed-13-million-study-claims-468289", "title": "COVID-19 Vaccines Led To 13 Million Deaths Worldwide: Report", "description": "Researchers claimed the vaccines caused numerous deaths based on autopsy studies and adverse effects monitoring systems.", "image": "https://d.medicaldaily.com/en/full/456727/coronavirus-covid-19-laboratory-test-cure-vaccine.jpg", "image:alt": "coronavirus-covid-19-laboratory-test-cure-vaccine", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Claims", "article:published_time": "2023-02-28T20:02:47-05:00", "article:modified_time": "2023-02-28T20:02:47-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://correlation-canada.org/report-age-stratified-covid-19-vaccine-dose-fatality-rate-for-israel-and-australia/", "https://www.rebelnews.com/research_team_estimated_13_million_deaths_worldwide_from_covid_19_vaccines", "https://www.medicaldaily.com/cdcs-new-covid-19-prevention-guide-amid-omicron-sublineages-spread-467891", "/fauci-admits-covid-influenza-vaccines-deficiencies-468270"], "authors": [], "publish_date": "2023-02-28T20:02:47-05:00"}