{"result_id": "198039", "URL": "https://www.medicaldaily.com/new-covid-19-vaccine-warnings-dont-mean-its-unsafe-they-mean-system-report-459968", "timestamp": "2023-04-25 16:20:14 CEST+0200", "meta": {"description": "While the Johnson & Johnson vaccine has been linked to a possible increased risk of certain rare adverse events, the vaccine is still safe to use.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/new-covid-19-vaccine-warnings-dont-mean-its-unsafe-they-mean-system-report-459968", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "New COVID-19 Vaccine Warnings Don’t Mean It’s Unsafe – They Mean The System To Report Side Effects Is Working", "cleaned_text": "While the COVID-19 vaccines currently available in the U.S. have been proved to be safe and effective, recent reports of rare adverse events, or side effects, have raised concerns. On July 12, 2021, the Food and Drug Administration approved an update to the Johnson & Johnson COVID-19 vaccine fact sheet to include an increased risk of the rare nerve condition Guillain-Barré syndrome. This follows previous reports linking the J&J vaccine with a rare blood clot.\n\nWhile reports like these can be scary, they’re a sign that the vaccine safety reporting system is working. They also highlight how the relative risks of rare side effects like these need to be put into context.\n\nAs a pharmacist who has been managing operations for the University of Virginia Health System’s COVID-19 vaccine program for the past seven months, I’ve seen how uncertainty and fear over potential side effects can drive vaccine hesitancy. Understanding how information about adverse events is collected and what it means for vaccine safety may help people make informed decisions about their health.\n\nTracking safety before, during and after approval\n\nThe FDA enforces rigorous testing and approval processes that manufacturers must follow before a new vaccine can be made available to the public. Regardless of whether a vaccine is approved through the typical FDA approval process or an Emergency Use Authorization (EUA), the steps required to test a new drug for safety and effectiveness are the same. An EUA can get a vaccine to the public more quickly by streamlining the regulatory process, but no shortcuts are taken. Every step is taken to ensure the vaccine is both safe and effective.\n\nVaccine clinical trials occur in four sequential phases. In the first three phases, study investigators are the ones who identify, quantify and document safety issues. Phase 1 typically introduces the vaccine to fewer than 100 people over several months under controlled conditions. Typically, the majority of potential adverse events are identified in this stage.\n\nAfter the FDA reviews phase 1 data and deems the vaccine safe enough to be studied further, the vaccine moves on to phases 2 and 3, where it will be given to larger numbers of people over longer periods of time. Here, investigators determine optimal dosage and screen for rare side effects.\n\nIf phase 2 and 3 data meets FDA approval standards, the vaccine will then move on to phase 4 and become available to the public. The vaccine is observed over much larger populations and extended periods of time, and manufacturers are required to regularly check and report potential safety concerns to the FDA.\n\nWhat’s different about this final phase is that the public can also contribute to safety reporting. The Vaccine Adverse Event Reporting System (VAERS) is a national safety monitoring system run by the FDA and Centers for Disease Control and Prevention. While certain types of adverse events, such as injuries during vaccine administration and serious complications, are mandatory for health care providers to report, anyone can submit a report. Recent adverse events associated with the COVID-19 vaccine, including Guillain-Barré and thrombosis for Johnson & Johnson and myocarditis for Pfizer, were identified through VAERS.\n\nSerious adverse event risk from vaccines is small\n\nA rare adverse event may take months or years to identify for a simple reason: It’s rare. For some drugs that are less commonly used, new safety data takes longer to discover because a relatively small number of patients use the drug. For example, though the shingles vaccine Shingrix was approved 2017, it wasn’t until March 2021 after over 3.7 million patients had gotten the shot that the FDA announced a potential increased risk of Guillain-Barré. And it still hasn’t been confirmed that the Shringrix vaccine causes the nerve condition.\n\nFor cases like the COVID-19 vaccine, however, millions of people will receive the drug shortly after it’s released to the public, and new issues or patterns often emerge more quickly.\n\nThis can lead to two problems.\n\nFirst, not every reported adverse event is directly related to the vaccine. For example, many of the tens of millions of people who have received the Pfizer vaccine have likely experienced a sunburn. People might report that they experienced a sunburn to VAERS, but the vaccine has no effect on your skin’s ability to protect against the sun. VAERS is very clear that it “is not designed to determine if a vaccine caused a health problem, but is especially useful for detecting unusual or unexpected patterns of adverse event reporting.” Correlation does not imply causation.\n\nSecond, a plausibly identified adverse event does not necessarily make the vaccine unsafe. According to CDC, there have been 100 preliminary reports of Guillain–Barré out of 12.5 million J&J doses, or 0.008% of people who received the vaccine. Administering one vaccine to a huge sample of people can make it easier to identify a possible connection between the shot and a side effect. But that doesn’t mean the risk of getting that side effect is very likely, or that it outweighs the benefit of getting vaccinated.\n\nThese risks, while real and potentially life-threatening, must be viewed in context with the much larger risk of negative outcomes from the diseases vaccines protect people from. For example, 1%-7% of patients who take cholesterol drugs called statins are likely to experience potentially harmful muscle injury. However, these drugs are still taken by millions of people because they are highly effective at preventing heart disease and stroke. And in the case of Guillain–Barré, about one in 100,000 people, or 0.001%, develop this condition yearly in the U.S. from any cause. By comparison, the U.S. has had more than 33 million cases of COVID-19, and over 600,000 deaths caused by this disease.\n\nIn such extraordinary times as during a pandemic, it’s understandable that people may be hesitant to take on any more risk than they have to. But there are safety nets in place to monitor the COVID-19 vaccines, and they are still working as they should.\n\nThe COVID-19 vaccines are proven to be overwhelmingly safe for most people. More than 40,000 patients participated in J&J’s clinical trials before the company applied for emergency use authorization, mirroring Pfizer’s and Moderna’s study sample sizes. Some 0.4% of participants in the J&J trial experienced serious adverse events unrelated to COVID-19 infection. In contrast, the trial demonstrated that people who get the vaccine are 85% less likely to get severe COVID-19 than those who remain unvaccinated.\n\nThe extremely rare side effects associated with the COVID-19 vaccines were discovered because safety reporting tools were used appropriately. Being aware of the risks of a treatment, however rare, can help people make health decisions that work best for them. However, these risks must be viewed in context. And in the case of the COVID-19 vaccines, they must be weighed against the consequences of remaining unvaccinated and letting the pandemic rage on.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/new-covid-19-vaccine-warnings-dont-mean-its-unsafe-they-mean-system-report-459968", "title": "New COVID-19 Vaccine Warnings Don’t Mean It’s Unsafe – They Mean The System To Report Side Effects Is Working", "description": "While the Johnson & Johnson vaccine has been linked to a possible increased risk of certain rare adverse events, the vaccine is still safe to use.", "image": "https://d.medicaldaily.com/en/full/458135/vaccine.jpg", "image:alt": "Vaccine", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2021-07-20T01:06:40-04:00", "article:modified_time": "2021-07-20T01:06:40-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/safety-of-vaccines.html", "https://www.cancer.gov/publications/dictionaries/cancer-terms/def/adverse-event", "https://www.fda.gov/media/150723/download", "https://www.cdc.gov/campylobacter/guillain-barre.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/JJUpdate.html", "https://www.fda.gov/vaccines-blood-biologics/development-approval-process-cber/vaccine-development-101", "https://www.fda.gov/emergency-preparedness-and-response/mcm-legal-regulatory-and-policy-framework/emergency-use-authorization", "https://www.fda.gov/vaccines-blood-biologics/vaccines/emergency-use-authorization-vaccines-explained", "https://www.fda.gov/patients/drug-development-process/step-3-clinical-research", "https://vaers.hhs.gov/about.html", "https://vaers.hhs.gov/docs/VAERS_Table_of_Reportable_Events_Following_Vaccination.pdf", "https://theconversation.com/rare-neurological-disorder-guillain-barre-syndrome-linked-to-covid-19-141511", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-june-25-2021", "https://www.fda.gov/vaccines-blood-biologics/safety-availability-biologics/fda-requires-warning-about-guillain-barre-syndrome-gbs-be-included-prescribing-information-shingrix", "https://doi.org/10.1038/d41586-021-00880-9", "https://vaers.hhs.gov/about.html", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-july-13-2021", "https://doi.org/10.2165/00002018-200022060-00003", "https://doi.org/10.1002/14651858.CD004816.pub4", "https://www.ninds.nih.gov/Disorders/Patient-Caregiver-Education/Fact-Sheets/Guillain-Barr%C3%A9-Syndrome-Fact-Sheet", "https://covid.cdc.gov/covid-data-tracker/#cases_casesper100klast7days", "https://clinicaltrials.gov/ct2/show/record/NCT04505722", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-conclude-phase-3-study-covid-19-vaccine", "https://www.modernatx.com/covid19vaccine-eua/providers/clinical-trial-data", "https://doi.org/10.1056/NEJMoa2101544", "https://doi.org/10.1056/NEJMoa2101544", "https://theconversation.com/profiles/justin-vesser-1250146", "https://theconversation.com/institutions/university-of-virginia-752", "https://theconversation.com", "https://theconversation.com/new-covid-19-vaccine-warnings-dont-mean-its-unsafe-they-mean-the-system-to-report-side-effects-is-working-164455", "/7-quick-ways-relieve-covid-vaccine-arm-pain-and-swelling-459603"], "authors": [], "publish_date": "2021-07-20T01:06:40-04:00"}