{"result_id": "198038", "URL": "https://www.medicaldaily.com/4-us-approved-vaccines-do-not-contain-these-substances-469390", "timestamp": "2023-04-25 16:20:14 CEST+0200", "meta": {"description": "The CDC said all four vaccines are safe because they do not have components that affect or interact with DNA.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/4-us-approved-vaccines-do-not-contain-these-substances-469390", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "4 US-Approved Vaccines Do Not Contain These Substances", "cleaned_text": "The United States has only approved and authorized four COVID-19 vaccines amid the pandemic. All of them are deemed safe because they do not contain toxic and unhealthy components, as well as substances that affect or interact with DNA.\n\nThe four vaccines approved for use in the U.S. are the mRNA Pfizer-BioNTech and Moderna vaccines, the protein subunit Novavax vaccine and Johnson & Johnson's Janssen viral vector vaccine.\n\nIn its detailed guidance, the U.S. Centers for Disease Control and Prevention (CDC) explained why only the four have been authorized for use in the country. According to the agency, nearly all of the ingredients in the four vaccines are commonly found in many foods, such as fats, sugar and salts. It also noted that none of the vaccines interact with DNA, so they are safe.\n\nThe CDC also listed the substances not found in the approved vaccines, and they are as follows:\n• Antibiotics - such as sulfonamide and others\n• Medicines or therapeutics - such as ivermectin and others\n• Tissues - including aborted fetal cells, gelatin and other materials from animal\n• Food proteins - such as eggs or egg products, gluten, nut products, peanuts, tree nuts and nut byproducts\n• Metals - such as iron, titanium, cobalt, nickel, and rare earth alloys, as well as microelectronics, electrodes, carbon nanotubes and other nanostructures or nanowire semiconductors\n• Latex - even the vial stoppers used in the containers do not have this\n\nThe vaccines are administered as shots in the muscle of the upper arm in children, adolescents and adults. In some cases, the medical professional may inject it into the thigh of young kids.\n\nOnce they enter the body, they trigger an immune response. The body should then discard all of the vaccine ingredients as part of normal body functioning. This is why authorized vaccines are not allowed to contain the aforementioned substances and compounds.\n\nPeople who are up to date with their vaccines have a lower risk of severe illness, hospitalization and death from COVID-19 than unvaccinated people. Being up to date means having one dose of the bivalent booster shots from Moderna and Pfizer-BioNTech, based on the latest Food and Drug Administration (FDA) guidelines.\n\nHowever, reports are claiming the FDA could authorize a second bivalent booster in the coming weeks for spring. The first bivalent booster was launched last September. Since it has already been six months, experts feel the need for people to get boosted to stay protected from COVID-19.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/4-us-approved-vaccines-do-not-contain-these-substances-469390", "title": "4 US-Approved Vaccines Do Not Contain These Substances", "description": "The CDC said all four vaccines are safe because they do not have components that affect or interact with DNA.", "image": "https://d.medicaldaily.com/en/full/464461/picture-illustration-vials-pfizer-biontech.jpg", "image:alt": "picture-illustration-of-vials-with-pfizer-biontech-and", "image:width": "1200", "image:height": "809", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Drugs", "article:tag": "Pfizer", "article:published_time": "2023-04-12T22:02:00-04:00", "article:modified_time": "2023-04-12T22:02:00-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.medicaldaily.com/cdc-endorses-more-traditional-novavax-covid-vaccine-466220", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/overview-COVID-19-vaccines.html#janssen-when-to-consider", "/cdc-recommends-bivalent-booster-people-6-months-older-469318", "/spring-booster-vs-annual-covid-19-shot-us-could-choose-latter-469355", "/inhale-swallow-mapping-out-direction-future-covid-19-vaccines-469365", "https://www.medicaldaily.com/fda-approve-second-bivalent-booster-after-first-dose-showed-strong-protection-469307"], "authors": [], "publish_date": "2023-04-12T22:02:00-04:00"}