{"result_id": "198020", "URL": "https://www.medicaldaily.com/covid-19-vaccine-shot-vs-nasal-spray-which-better-466590", "timestamp": "2023-04-25 16:20:08 CEST+0200", "meta": {"description": "Scientists want a renewed focus on nasal vaccines amid the ongoing COVID-19 pandemic.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/covid-19-vaccine-shot-vs-nasal-spray-which-better-466590", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "COVID-19 Vaccine Shot vs. Nasal Spray: Which Is Better?", "cleaned_text": "Scientists have renewed hopes of nasal vaccines helping halt COVID-19 transmissions amid the ongoing pandemic.\n\nSARS-CoV-2 has been continuously mutating, and its evolutions arm it with better immunity-evading skills, outpacing the mRNA vaccines and injectable boosters in the works.\n\nAs such, scientists are eager to put the spotlight on nasal sprays and the big role they could play in containing the situation and preventing more transmissions.\n\nUnlike jabs, nasal vaccines target the respiratory tract, which is a good thing because this serves as the body’s first line of defense against infection, as per The Guardian.\n\n“Solving this problem of inducing really effective immunity to block transmission is such an important challenge, it really deserves to receive significant attention and energy even though it’s going to take some time and effort,” Dr. Sandy Douglas, one of the people behind the Oxford/AstraZeneca vaccine, was quoted by the outlet as saying.\n\nNasal sprays work differently than COVID-19 jabs. The latter triggers a response in the systemic immune system, while the former targets the site of its administration.\n\nIntramuscular vaccination is incapable of producing mucosal immunity or immunity in the respiratory tract, which is very ideal since it is the body’s first line of defense. Through intranasal vaccination, recipients could benefit from the protection against respiratory infection.\n\n“It’s like having guards behind the castle’s gate versus having guards in front,” Benjamin Goldman-Israelow, an infectious diseases researcher at Yale, told The Guardian.\n\nConsidering how nasal vaccines work, scientists view it as the most realistic way of achieving mucosal immunity and breaking the chain of COVID transmission. At least eight nasal vaccines for COVID-19 are in development, according to The Sydney Morning Herald.\n\nThere are challenges involved in developing nasal spray vaccines, however. For one thing, scientists have less experience with nasal vaccines compared to intramuscular doses due to lack of funding. There is also the possibility of unexpected side effects showing up along the way.\n\n“There are market failures in vaccine development because companies are reluctant to take the risks. They don’t reap the full benefits to society. If they’re going to have to bear the costs and risks without substantial public funding, not enough research happens,” Douglas said.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/covid-19-vaccine-shot-vs-nasal-spray-which-better-466590", "title": "COVID-19 Vaccine Shot vs. Nasal Spray: Which Is Better?", "description": "Scientists want a renewed focus on nasal vaccines amid the ongoing COVID-19 pandemic.", "image": "https://d.medicaldaily.com/en/full/466594/nasal-vaccine.jpg", "image:alt": "nasal vaccine", "image:width": "594", "image:height": "412", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2022-08-22T01:06:10-04:00", "article:modified_time": "2022-08-22T01:10:38-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theguardian.com/world/2022/aug/20/covid-nasal-vaccines-scientists-hope-help-halt-transmission", "https://www.smh.com.au/national/nasal-vaccines-could-snuff-out-covid-but-the-hurdles-are-not-to-be-sneezed-at-20220818-p5bars.html", "/la-offers-free-covid-19-testing-pets-exposed-virus-466569", "/ivermectin-covid-19-not-effective-says-large-study-466551", "/many-omicron-patients-unintentionally-spread-covid-19-variant-study-466545"], "authors": [], "publish_date": "2022-08-22T01:06:10-04:00"}