{"result_id": "198003", "URL": "https://www.medicaldaily.com/last-us-averted-first-anti-fungal-vaccine-horizon-468015", "timestamp": "2023-04-25 16:20:03 CEST+0200", "meta": {"description": "According to researchers, life-threatening fungal infections affect around 13 million people annually across the world and cause more than 1.5 million deaths.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/last-us-averted-first-anti-fungal-vaccine-horizon-468015", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "'The Last Of Us' Averted; First Anti-Fungal Vaccine On The Horizon", "cleaned_text": "For those who have watched the now-famous series “The Last of Us,\" rest assured, scientists are already developing the first anti-fungal vaccine.\n\nIn the study, published in the journal PNAS Nexus, scientists from the University of Georgia (UGA) have created a vaccine against three fungi species that cause the bulk of infections and deaths in humans.\n\nThe three fungi -- Pneumocystis, Aspergillus, and Candida -- often cause opportunistic illness in people. Meaning, these fungus species infect individuals with a weak or compromised immune system. Currently, there are no effective vaccines to protect vulnerable patients from fungal infections.\n\n“Because it targets three different pathogens, the vaccine has the potential to be groundbreaking regarding invasive fungal infections,” said lead author Karen Norris, a professor in the College of Veterinary Medicine at UGA, in a recent statement from the university.\n\nAccording to researchers, life-threatening fungal infections affect around 13 million people annually across the world and cause more than 1.5 million deaths. Of these, the three types of fungus used in the study are estimated to account for over 80% of fungal-related deaths.\n\nMoreover, a previous UGA study involving some of the same authors pegs direct medical costs of fungal infections to around $6.7 billion annually just in the U.S.\n\n“This is an area that has been underdeveloped on the research front for a long time,” Norris said in the statement. “These are very large populations of people who are at risk of invasive fungal infections, and although there have been considerable efforts to develop vaccines, none are yet approved. We believe this is a very strong vaccine candidate.”\n\nThe vaccine works on the principle that the immune system will learn to detect a “pan-fungal” protein shared by these fungi, which, in theory, should strengthen our immunity against all three.\n\nFor the study, researchers tested the efficacy of their vaccine in mice and rhesus macaques. According to Gizmodo, the animals were divided into two groups- vaccinated and non-vaccinated. Next, the immune systems of all test animals were deliberately suppressed and the animals were exposed to the fungi.\n\nThe animals successfully produced antibodies against the pan-fungal protein, the study found. Following analysis, the vaccine was found to be effective at preventing serious infections as well as deaths from fungi. In fact, not a single vaccinated macaque exposed to Pneumocystis fungi developed the severe infection while more than half of the unvaccinated group were infected.\n\nScientists now plan to start a Phase I human trial of their vaccine to assess its safety and immune response.\n\nIn related news, a black fungus outbreak affected thousands of people in India when the country was battling a surge in COVID-19 cases last year.\n\n\"Most researchers consider the major cause of India's CAM (black fungus ) epidemic to be the conjunction of the COVID-19 pandemic and associated corticosteroid treatment with the enormous number of Indians with diabetes mellitus (DM),\" the researchers wrote in a paper published in the mBio, a journal of the American Society for Microbiology. \"However, excess CAM cases were not seen to the same extent in the Western world, where diabetes is prevalent and corticosteroids are also used extensively for COVID-19 treatment.\"", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/last-us-averted-first-anti-fungal-vaccine-horizon-468015", "title": "'The Last Of Us' Averted; First Anti-Fungal Vaccine On The Horizon", "description": "According to researchers, life-threatening fungal infections affect around 13 million people annually across the world and cause more than 1.5 million deaths.", "image": "https://d.medicaldaily.com/en/full/465141/pfizer-vaccine.jpg", "image:alt": "Pfizer vaccine", "image:width": "594", "image:height": "396", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "The Grapevine", "article:tag": "Infection", "article:published_time": "2023-02-08T02:48:35-05:00", "article:modified_time": "2023-02-08T02:48:35-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://academic.oup.com/pnasnexus/article/1/5/pgac248/6798391", "https://news.uga.edu/new-vaccine-targets-fungal-infections/", "https://gaffi.org/why/fungal-disease-frequency/", "https://academic.oup.com/ofid/article/9/1/ofab593/6502318", "https://gizmodo.com/fungi-vaccine-candida-pneumocystis-aspergillus-1850077673", "https://www.medicaldaily.com/what-caused-indias-black-fungus-epidemic-researchers-say-practice-may-be-464914", "https://journals.asm.org/doi/10.1128/mbio.00473-22"], "authors": [], "publish_date": "2023-02-08T02:48:35-05:00"}