{"result_id": "198025", "URL": "https://www.medicaldaily.com/groundbreaking-breast-cancer-vaccine-targets-most-aggressive-lethal-form-468030", "timestamp": "2023-04-25 16:20:10 CEST+0200", "meta": {"description": "A clinical trial has begun to study individuals at high risk of breast cancer.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/groundbreaking-breast-cancer-vaccine-targets-most-aggressive-lethal-form-468030", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Groundbreaking Breast Cancer Vaccine Targets Most Aggressive, Lethal Form Of Disease", "cleaned_text": "Women could soon have a tool to ward off breast cancer as researchers work on a vaccine that could counter the most aggressive and lethal form of the disease.\n\nOn Wednesday, Cleveland Clinic officially announced the next step in its preventive breast cancer vaccine study — a new clinical trial will study cancer-free individuals at high risk of developing breast cancer.\n\nResearchers at the nonprofit medical center aim to prevent triple-negative breast cancer with the vaccine they are making. At this stage, the cancer is already hard to treat. Hence, they want to develop a preventive vaccine that would fend off the highly aggressive disease.\n\n“Triple-negative breast cancer is the form of the disease for which we have the least effective treatments. Long term, we are hoping that this can be a true preventive vaccine that would be administered to cancer-free individuals to prevent them from developing this highly aggressive disease,” lead researcher G. Thomas Budd, M.D., of Cleveland Clinic’s Taussig Cancer Institute, said in a news release.\n\nFor the new phase 1b study, the researchers will examine cancer-free but high-risk volunteers undergoing a prophylactic mastectomy to reduce their risk of the more aggressive form of breast cancer.\n\nThe study, funded by the U.S. Department of Defense and conducted at Cleveland Clinic’s main campus, will evaluate the safety and monitor the participants’ immune response to the vaccine.\n\nApproximately 6-12 patients are needed for the new study, which will run for months and complete by the end of 2023. They will receive three vaccinations two weeks apart. Scientists will monitor them for side effects and immune response.\n\nConducted in collaboration with Anixa Biosciences, Inc., phase 1b follows the ongoing phase 1a study, which commenced in 2021 and is also expected to complete by the end of 2023, according to Fox 8 News.\n\nThe preventive vaccine they are testing is based on pre-clinical research by the late Vincent Tuohy, Ph.D. — an outstanding and passionate scientist who spent decades developing the investigational vaccine.\n\n“It was Dr. Tuohy’s hope that this vaccine would demonstrate the potential of immunization as a new way to control breast cancer, and that a similar approach could someday be applied to other types of malignancy,” said Budd.\n\nHe noted that there is a need for improved treatments for triple-negative breast cancer because this type of cancer no longer responds to hormonal and targeted therapies.\n\nBased on data from the Centers for Disease Control and Prevention (CDC), about 264,000 women are diagnosed with breast cancer each year in the U.S. On the other hand, only 2,400 men are diagnosed with the condition yearly. Meanwhile, about 42,000 women and 500 men die from breast cancer annually in the U.S.\n\nAlthough triple-negative breast cancer only accounts for 12% to 15% of cases, deaths due to it are higher than the other types of breast cancer. Black women are also twice as likely to have this aggressive condition, according to Cleveland Clinic.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/groundbreaking-breast-cancer-vaccine-targets-most-aggressive-lethal-form-468030", "title": "Groundbreaking Breast Cancer Vaccine Targets Most Aggressive, Lethal Form Of Disease", "description": "A clinical trial has begun to study individuals at high risk of breast cancer.", "image": "https://d.medicaldaily.com/en/full/358686/breast-cancer.jpg", "image:alt": "Breast Cancer", "image:width": "2420", "image:height": "1609", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Innovation", "article:published_time": "2023-02-08T23:41:23-05:00", "article:modified_time": "2023-02-08T23:41:23-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://newsroom.clevelandclinic.org/2023/02/08/cleveland-clinic-announces-next-step-in-preventive-breast-cancer-vaccine-study/", "https://fox8.com/news/next-step-in-breast-cancer-vaccine-study-announced-by-cleveland-clinic/", "https://www.cdc.gov/cancer/breast/basic_info/index.htm", "/breast-cancer-patient-months-live-now-cancer-free-after-experimental-drug-465865", "/two-common-gene-mutations-boost-breast-cancer-risk-scientists-find-422526"], "authors": [], "publish_date": "2023-02-08T23:41:23-05:00"}