{"result_id": "198050", "URL": "https://www.medicaldaily.com/how-us-plans-address-monkeypox-vaccine-shortage-466462", "timestamp": "2023-04-25 16:20:18 CEST+0200", "meta": {"description": "Amid the monkeypox vaccine shortage, the FDA is considering dose-sparing to help stretch the limited supply.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/how-us-plans-address-monkeypox-vaccine-shortage-466462", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "How The US Plans To Address Monkeypox Vaccine Shortage", "cleaned_text": "Amid the current monkeypox vaccine shortage, Biden’s administration plans to embrace dose-sparing to stretch the limited supply and target those who are at-risk the most.\n\nAs the ongoing monkeypox outbreak spreads across different countries, health officials and experts have stated that stopping it would require mass vaccinations, which could lead to herd immunity.\n\nBut with limited vaccine supplies and vaccine hesitancy, it wouldn’t be easy.\n\nTo address the first problem, the U.S. Food and Drug Administration (FDA) has stated in a press briefing that it’s considering dose-sparing, which would allow heath care providers to split a one-dose vial of Jynneos into five doses for five individuals. The vaccine would also be administered intradermally or between layers of the skin.\n\n“To help close this gap, we’re considering an approach for the current doses of Jynneos that would allow health care providers to use an existing one-dose vial of the vaccine to administer a total of up to five separate doses,” FDA Commissioner Robert Califf said.\n\nPartly based on a 2015 study funded by the National Institutes of Health, the approach is intended to stretch the limited supply of monkeypox vaccine doses.\n\nA 2018 study published in the journal Vaccines also reported that a fifth dose – or perhaps even a tenth – produced an immune response comparable to that of a full dose.\n\nHowever, Dr. Alexandra Brugler Yonts, an infectious disease specialist at Children’s National Hospital in Washington, D.C., who assisted in the FDA’s review of Jynneos, said that the smaller doses may not be adequate for those with HIV or are immunocompromised.\n\n“Some protection is better than none, but the people being vaccinated should be warned and advised to continue other protective measures to minimize physical or intense close contact with potentially infected individuals,” she said, adding that just like COVID, getting vaccinated is not a free pass to blindly take part in risky behavior.\n\nLast week, the U.S. administration declared monkeypox a public health emergency, although it's still unclear how that would change things in the short term. The latest data from the Centers for Disease Control and Prevention showed more than 7,500 Americans infected with monkeypox.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/how-us-plans-address-monkeypox-vaccine-shortage-466462", "title": "How The US Plans To Address Monkeypox Vaccine Shortage", "description": "Amid the monkeypox vaccine shortage, the FDA is considering dose-sparing to help stretch the limited supply.", "image": "https://d.medicaldaily.com/en/full/451407/vaccine.jpg", "image:alt": "Vaccine", "image:width": "2500", "image:height": "1667", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Conditions", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2022-08-09T02:15:27-04:00", "article:modified_time": "2022-08-09T02:16:44-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.sciencedirect.com/science/article/pii/S0264410X15008762?via%3Dihub", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5874649/", "https://www.cdc.gov/poxvirus/monkeypox/response/2022/us-map.html", "/where-could-monkeypox-spread-next-expert-reveals-shocking-answer-466453"], "authors": [], "publish_date": "2022-08-09T02:15:27-04:00"}