{"result_id": "198008", "URL": "https://www.medicaldaily.com/covid-ba5-booster-delay-466239", "timestamp": "2023-04-25 16:20:05 CEST+0200", "meta": {"description": "Health experts point out why the next COVID-19 booster is taking so long.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/covid-ba5-booster-delay-466239", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "COVID Vaccine For BA.5 Arriving Late; What Is Causing The Delay?", "cleaned_text": "As the COVID-19 virus continues to mutate and infect people across the globe, health experts pointed out why the vaccine for the new variant is taking so long to arrive.\n\nTwo years into the pandemic, it’s become clear that one of its biggest challenges is the constant virus mutation that forces vaccine manufacturers to come up and release new boosters.\n\nThe trouble is, while more than 75% of new U.S. cases have been linked to the current BA.5 omicron variant, the COVID-19 booster shots that will target that and the BA.4 variant won’t be ready until fall. By then, an entirely new coronavirus strain might already be wreaking havoc, according to experts.\n\nThis already happened with the booster for the original BA.1 omicron variant that took a while before reaching vaccine trials, despite the actual variant largely vanishing from the actual population. To that end, health experts are warning that this approach is unsustainable and a stark contrast to how fast the turnaround time was for the original COVID-19 mRNA vaccines two years ago.\n\nDr. Eric Topol, a precision medicine expert and director of the Scripps Research Translational Institute, noted that the country would reach 100% BA.5 in just a matter of weeks. He added that there’s no doubt more mutated variants lie ahead, whether they’re from the same omicron family or a new lineage altogether.\n\n“Should we wait for a BA.5 booster? That will take months, and it should be noted it took more than 7 months for the omicron BA.1 booster to be tested, a delay that is exceedingly long and unacceptable relative to the timing of validation and production of the original vaccines in 10 months during 2020,” Dr. Topol added.\n\nIn theory, the technology behind mRNA vaccines should make it easy to adjust boosters once an emerging Covid strain has been genetically sequenced. In the meantime, the efficacy of the BA.1-based COVID-19 boosters against BA.4 and BA.5 remain questionable.\n\nTo help curb the rising cases, the U.S. Food and Drug Administration has also taken other measures to combat COVID, including authorizing vaccines for infants and approving the Novavax vaccine, a traditional, non-mRNA vaccine similar to a flu shot.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/covid-ba5-booster-delay-466239", "title": "COVID Vaccine For BA.5 Arriving Late; What Is Causing The Delay?", "description": "Health experts point out why the next COVID-19 booster is taking so long.", "image": "https://d.medicaldaily.com/en/full/464717/novavax-vaccine.jpg", "image:alt": "Novavax vaccine", "image:width": "594", "image:height": "396", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2022-07-22T01:23:33-04:00", "article:modified_time": "2022-07-22T01:23:33-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://covid.cdc.gov/covid-data-tracker/#variant-proportions", "https://www.youtube.com/watch?v=eyjjnlEf3UA", "https://erictopol.substack.com/p/the-ba5-story", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-emergency-use-novavax-covid-19-vaccine-adjuvanted", "/cdc-endorses-more-traditional-novavax-covid-vaccine-466220"], "authors": [], "publish_date": "2022-07-22T01:23:33-04:00"}