{"result_id": "198006", "URL": "https://www.medicaldaily.com/polio-new-york-issues-travel-warning-israel-468451", "timestamp": "2023-04-25 16:20:04 CEST+0200", "meta": {"description": "Health officials said travelers heading to Israel should get fully immunized against the virus.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/polio-new-york-issues-travel-warning-israel-468451", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "New York Issues Travel Warning For Israel After Country Detects New Polio Cases", "cleaned_text": "The New York State Department of Health has issued a warning for travelers heading to Israel this spring to be wary of the poliovirus.\n\nOn Friday, the department issued a travel warning after the Jewish nation confirmed recording two new cases of polio infection. Travelers are urged to get fully immunized against polio if they are visiting Israel and other countries where the virus is in circulation.\n\n“In recent days, Israel’s Ministry of Health confirmed four children had tested positive for poliovirus in Northern Israel after one unvaccinated child presented symptoms of paralysis. The other three are currently asymptomatic. Israel has additionally reported widespread detection of poliovirus in wastewater systems,” the department said in a press release.\n\nIsrael already launched a nationwide vaccination campaign following a previous outbreak in February 2022. With the new cases, New York health officials decided to reach out to their Israeli counterparts “to ensure a coordinated response.”\n\n“It is important to note that not everyone who is unvaccinated and infected with polio will show symptoms. Some have mild or flu-like symptoms that can be easily mistaken for another type of virus, and others have no symptoms at all. Still, all infected people can spread the virus and infect others, even without symptoms. The best way individuals can ensure they are protected from polio is by making sure they are up to date with polio immunizations,” the department added.\n\nIsrael is part of the Centers for Disease Control and Prevention (CDC) list of locations with circulating polio. Also included in the list are the United Kingdom, Afghanistan, Pakistan, Canada, Egypt, Indonesia, Yemen, Nigeria and many other central African countries.\n\nPolio is highly contagious and could be life-threatening since it affects the nervous system, causing muscle weakness, paralysis and even death. It spreads from person to person through exposure to fecal matter from an infected individual. Proper handwashing is strongly recommended to prevent infection.\n\nAs a serious condition, patients may struggle long-term once infected. A 4-year-old girl from Jerusalem got infected in 2022, causing her to be paralyzed. Today, she remains hospitalized and undergoes rehabilitation to help her regain full functionality, according to the Israeli news outlet Ynet.\n\nNew York is particularly monitoring the poliovirus after declaring a health emergency due to the virus last September when local health officials detected polio in wastewater samples from the area.\n\nGovernor Kathy Hochul said at the time that New York would be stepping up its polio-fighting efforts amid a possible outbreak. Residents were encouraged to get vaccinated to obtain protection from the virus and prevent the situation from getting worse.\n\n“Polio immunization is safe, effective, and the most fundamental protection individuals can keep themselves and their children healthy and safe,” the New York State Department of Health said in its recent travel advisory.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/polio-new-york-issues-travel-warning-israel-468451", "title": "New York Issues Travel Warning For Israel After Country Detects New Polio Cases", "description": "Health officials said travelers heading to Israel should get fully immunized against the virus.", "image": "https://d.medicaldaily.com/en/full/466440/polio-vaccine.jpg", "image:alt": "polio vaccine", "image:width": "1024", "image:height": "683", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "US/World", "article:tag": "Israel", "article:published_time": "2023-03-12T19:14:19-04:00", "article:modified_time": "2023-03-12T19:14:19-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.health.ny.gov/press/releases/2023/2023-03-10_immunized_against_polio.htm#:~:text=Polio%20is%20a%20highly%20contagious,%2C%20paralysis%2C%20and%20even%20death.", "https://wwwnc.cdc.gov/travel/notices/alert/global-polio", "https://www.ynetnews.com/health_science/article/sjfh6sjjh", "https://www.medicaldaily.com/new-york-declares-poliovirus-emergency-after-detecting-virus-more-wastewater-466769", "/polio-causes-symptoms-and-vaccine-all-facts-you-need-know-466617"], "authors": [], "publish_date": "2023-03-12T19:14:19-04:00"}