{"result_id": "198052", "URL": "https://www.medicaldaily.com/how-really-close-global-vaccine-gap-464953", "timestamp": "2023-04-25 16:20:19 CEST+0200", "meta": {"description": "A combination of vaccine hesitancy and regulatory, infrastructure, and logistical barriers are to blame for low inoculation rates.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/how-really-close-global-vaccine-gap-464953", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "How To Really Close The Global Vaccine Gap", "cleaned_text": "The United States has reportedly lent its support to a multilateral agreement to waive intellectual property rights on COVID-19 vaccines. Proponents of the waiver would have us believe this will get more people vaccinated more quickly. In fact, it will do nothing of the sort.\n\nThe leaked text is purportedly part of a compromise between the U.S., the European Union, India, and South Africa. If it becomes international law, it will strip away the very legal protections that made it possible for U.S. and European companies to develop life-saving vaccines in record time.\n\nThat will leave us ill-prepared for the next pandemic. Worse, an IP waiver does nothing to address the very real barriers to vaccine access in developing countries, which we urgently need to solve if we want to end this pandemic.\n\nThe fact is, the developing world is awash in COVID-19 vaccines. Africa's top public health authority recently asked international groups to temporarily pause vaccine donations, because the continent already has a glut of shots and additional doses would likely expire unused.\n\nThat doesn't mean the pandemic is over, of course. In many countries, case levels are still disturbingly high. And especially in Africa, vaccination rates remain worryingly low -- in some cases, still in the single digits.\n\nBut the problem isn't a lack of vaccines themselves. Rather, a combination of vaccine hesitancy and regulatory, infrastructure, and logistical barriers are to blame for low inoculation rates.\n\nWe can't end the pandemic until we solve these on-the-ground problems.\n\nFor starters, global leaders need to cut through the red tape that's tying up some vaccine shipments. In 2021 alone, drug companies manufactured a staggering 11.2 billion doses, enough to give two shots to every adult on the planet. But many of those doses aren't reaching the patients who need them.\n\nBack in November, Moderna's CEO lamented that his company had 70 million doses sitting in warehouses waiting to be shipped.\n\nThe reason? Recipients in low-income nations hadn't filled out the required customs forms.\n\nMany developing countries also don't have enough trained healthcare workers to administer all the doses they've received -- or refrigerators to store them. The 92 low-income countries receiving free shots from the World Health Organization-backed COVAX program leave 25% of their doses unused, according to Duke University researchers.\n\nIt's not too late for the global community -- both governments, multilateral bodies, and NGOs -- to address these problems. They can draw on lessons learned from U.S. efforts to address vaccine hesitancy, infrastructure, and logistical challenges.\n\nThe World Health Organization and numerous NGOs can target education campaigns to push back on vaccine distrust. Such campaigns should have been in place months ago. The WHO can also help poorer nations improve storage infrastructure. Former FDA chief Scott Gottlieb suggests that WHO officials can take on more of the burden of record-keeping to relieve overwhelmed clinicians.\n\nMeanwhile, the World Trade Organization can make a difference in addressing logistical challenges. Its purpose is to make global commerce as seamless as possible. That includes the transport of vaccines. New rules should limit export restrictions and reduce customs formalities.\n\nUnfortunately, much of WTO leaders' time has been tied up by a petition, filed about 18 months ago by India and South Africa, that calls for waiving intellectual property protections on COVID-19 vaccines and treatments. Those two governments claimed that weakening IP rights would allow developing countries to access vaccines faster.\n\nThat was never true. But now, the debate has led to the four-way compromise announced this week. Biotech companies succeed or fail based on intellectual property rights -- and many would go out of business if the U.S. suddenly dismantles this cornerstone of our economy, as it appears poised to do.\n\nMeanwhile, the compromise agreement to waive vaccine IP distracts from the critical tasks of dismantling actual trade barriers, overcoming vaccine hesitancy, and addressing structural health system issues.\n\nThe world has more than enough vaccines; the challenge is getting them into people's arms. Multilateral organizations need to roll up their sleeves and help break down the actual barriers to vaccination, instead of wasting time on dismantling IP law.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/how-really-close-global-vaccine-gap-464953", "title": "How To Really Close The Global Vaccine Gap", "description": "A combination of vaccine hesitancy and regulatory, infrastructure, and logistical barriers are to blame for low inoculation rates.", "image": "https://d.medicaldaily.com/en/full/458800/quick-rollout-vaccines-britain.jpg", "image:alt": "the-quick-rollout-of-vaccines-in-britain-and", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2022-04-11T05:21:10-04:00", "article:modified_time": "2022-04-11T05:21:10-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["/can-my-child-get-covid-19-vaccines-464949", "/covid-19-vaccine-how-long-does-fda-have-determine-if-more-doses-are-needed-464927"], "authors": [], "publish_date": "2022-04-11T05:21:10-04:00"}