{"result_id": "198009", "URL": "https://www.medicaldaily.com/spring-booster-vs-annual-covid-19-shot-us-could-choose-latter-469355", "timestamp": "2023-04-25 16:20:05 CEST+0200", "meta": {"description": "The FDA appears to be leaning toward having an annual vaccine, like the flu shot.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/spring-booster-vs-annual-covid-19-shot-us-could-choose-latter-469355", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Spring Booster vs. Annual COVID-19 Shot: US Could Choose The Latter", "cleaned_text": "The U.S. has yet to officially announce its decision on what should come after the government authorized the first bivalent booster last September.\n\nIt's been six months since the bivalent booster rolled out, with the promise to protect recipients against the original SARS-CoV-2 strain and the new Omicron variants.\n\nEarlier this month, the Washington Post claimed in a report that the Food and Drug Administration (FDA) would likely approve a second bivalent booster in the coming weeks. Doing so would extend the protection afforded by the initial bivalent doses.\n\nInterestingly, cleveland.com reported Monday that the FDA could opt for an annual shot that would roll out in the fall instead of the spring booster.\n\n\"Even though it's been more than six months since the first bivalent shot, which protects against the Omicron variant, the FDA is so far sticking to its January directive, that most people will be advised to get the latest vaccine annually each fall, like the flu shot,\" the outlet stated in its report.\n\nThe Ohio-based news site even indicated that Americans should not expect the government to follow what Canada and the United Kingdom are doing. Both have started to offer second bivalent boosters for the elderly and the immunocompromised.\n\nIn late March, the World Health Organization (WHO) announced new vaccination guidance, saying only people at high risk of severe illness need additional COVID-19 boosters. The organization also classified healthy children as \"low priority,\" meaning they may no longer need booster shots.\n\nThe U.S. Centers for Disease Control and Prevention (CDC) quickly recognized the WHO's new guidance but said it would still tailor its recommendations for the U.S. population based on its \"evidence-based\" data. This meant the U.S. would still recommend both the primary series and the updated booster for people 6 months and older.\n\nLast year, Dr. Anthony Fauci, the nation's leading infectious disease expert, said booster shots may likely need to be administered once a year as new Covid variants emerge while vaccination protection wanes over time.\n\nThen in January, the FDA shared it wanted the COVID-19 vaccine to follow in the footsteps of the flu vaccine in terms of composition, dispensing and updating. According to the agency, having an up-to-date coronavirus vaccine rolled out yearly would help the whole community amid the global health crisis.\n\nWithout an official announcement about the second bivalent booster in sight, the earlier statements by authorities regarding the annual vaccination rollout hold water, at least for now.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/spring-booster-vs-annual-covid-19-shot-us-could-choose-latter-469355", "title": "Spring Booster vs. Annual COVID-19 Shot: US Could Choose The Latter", "description": "The FDA appears to be leaning toward having an annual vaccine, like the flu shot.", "image": "https://d.medicaldaily.com/en/full/451407/vaccine.jpg", "image:alt": "Vaccine", "image:width": "2500", "image:height": "1667", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Flu shot", "article:published_time": "2023-04-11T02:05:07-04:00", "article:modified_time": "2023-04-11T02:05:07-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.medicaldaily.com/fda-approve-second-bivalent-booster-after-first-dose-showed-strong-protection-469307", "https://www.cleveland.com/metro/2023/04/when-can-you-get-another-covid-19-bivalent-vaccine-the-wake-up-for-monday-april-10-2023.html?outputType=amp", "https://www.medicaldaily.com/who-shares-new-covid-19-vaccination-guidance-high-risk-people-wait-second-bivalent-boosters-469185", "https://www.medicaldaily.com/do-kids-need-another-covid-19-booster-shot-469245", "https://www.medicaldaily.com/heres-what-know-about-cdcs-recommendation-get-flu-covid-shot-466802", "/cdc-recommends-bivalent-booster-people-6-months-older-469318", "/switzerland-no-longer-recommends-covid-19-vaccination-heres-why-469321", "/new-covid-19-vaccine-trial-wants-unvaccinated-children-colorado-join-469278", "https://www.medicaldaily.com/fda-wants-change-how-covid-19-vaccines-are-updated-467823"], "authors": [], "publish_date": "2023-04-11T02:05:07-04:00"}