{"result_id": "198031", "URL": "https://www.medicaldaily.com/what-are-blood-clots-associated-johnson-johnson-covid-19-vaccine-4-questions-459114", "timestamp": "2023-04-25 16:20:12 CEST+0200", "meta": {"description": "A small number of people in the U.S. have developed dangerous blood clots after receiving the Johnson & Johnson vaccine. An expert has explained why this is happening.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/what-are-blood-clots-associated-johnson-johnson-covid-19-vaccine-4-questions-459114", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "What Are The Blood Clots Associated With The Johnson & Johnson COVID-19 Vaccine? 4 Questions Answered", "cleaned_text": "Two vaccines – the Johnson & Johnson vaccine in the U.S. and the AstraZeneca vaccine in Europe – have been linked to an increased chance of a rare type of blood clot. Researchers are investigating what causes these clots and are starting to propose some answers. Dr. Mousumi Som, a professor of medicine at Oklahoma State University, explains what these rare clots are and how they are forming after people get vaccinated.\n\n1. What are the blood clots?\n\nA small number of people in the U.S. have developed dangerous blood clots after receiving the Johnson & Johnson vaccine. The clots have mostly been occurring in people’s brains and, paradoxically, are associated with low platelet counts.\n\nNormally, platelets help a person stop bleeding when they get injured. If you get a cut or have an injury, the body responds by sending platelets which act as a temporary patch. The patch attracts other platelets and they stick together to stop blood loss. Since platelets normally help the clotting process, this combination of low platelets and extreme clotting makes these clots medically unusual.\n\nThese specific types of clots – called cerebral venous sinus thrombosis – although rare, affect around two to five people per million per year and are potentially life-threatening without treatment. Vaccines aren’t normally a trigger for this kind of clot.\n\n2. Who is having these clots?\n\nAs of April 24, 2021, out of the 8 million people vaccinated with the Johnson & Johnson vaccine in the U.S., about 16 people have developed these blood clots. The clots occurred from six to 13 days after immunization, and the majority were in women between the ages of 18 and 48.\n\nOn April 26, 2021, news reports indicated that at least one man had developed a clot. The man is in his 30s and was hospitalized from a clot in his leg about two weeks after receiving the Johnson & Johnson vaccine.\n\nHealth officials in Europe have also reported that the AstraZeneca vaccine – a COVID-19 vaccine authorized and approved in Europe but not in the U.S. – has caused about 200 cases of low-platelet clotting. Importantly, both the Johnson & Johnson vaccine and the AstraZeneca vaccine use a type of harmless virus called an adenovirus to deliver instructions to the human body on how to build an immune response to COVID-19. This is called a viral vector vaccine.\n\nThe fact that the both vaccines use a viral vector and both are associated with blood clots has led many health experts to think that the clotting issues of the two vaccines may share the same mechanism.\n\n3. Why are women getting more clots than men?\n\nAt this point, doctors still don’t know what makes women more susceptible than men, nor what puts a person at risk for these clots. These clots can occur, though rarely, in people who don’t get a vaccine. Scientists know that women are three times more likely to develop this type of clot without receiving the vaccine. Many researchers think this is because of birth control or other hormonal replacements that women take.\n\n4. Why might the vaccines be causing blood clots?\n\nResearchers believe that this specific low-platelet clotting is similar to a reaction some individuals get when they receive a blood thinner called heparin, called heparin-induced thrombocytopenia.\n\nDoctors sometimes use heparin to thin a person’s blood in the case of a heart attack or a blood clot when blood flow needs to be reestablished. But some people experience the opposite reaction, and their blood ends up clotting more instead. This happens because the body triggers an unwanted immune response after receiving heparin.\n\nIn these patients, heparin attaches to a product released from platelets called platelet factor 4. When this happens, the immune system considers the combined platelet factor 4 and heparin a problem, so it creates antibodies in response. These antibodies attach to the heparin and platelet factor 4 complex, and the body – which now thinks it needs to repair an injury – causes more clotting while using up even more platelets. This results in the low platelet count seen in these patients.\n\nWhen doctors have looked at the blood of patients who developed clots after receiving the Johnson & Johnson or AstraZeneca vaccine, it looked very similar to the blood of people who have the low-platelet clotting reaction to heparin. This has led scientists and doctors to believe that the same process might be leading to these clots caused by the two vaccines.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/what-are-blood-clots-associated-johnson-johnson-covid-19-vaccine-4-questions-459114", "title": "What Are The Blood Clots Associated With The Johnson & Johnson COVID-19 Vaccine? 4 Questions Answered", "description": "A small number of people in the U.S. have developed dangerous blood clots after receiving the Johnson & Johnson vaccine. An expert has explained why this is happening.", "image": "https://d.medicaldaily.com/en/full/458800/quick-rollout-vaccines-britain.jpg", "image:alt": "the-quick-rollout-of-vaccines-in-britain-and", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2021-06-03T04:30:46-04:00", "article:modified_time": "2021-06-03T04:30:46-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://scholars.okstate.edu/en/persons/mousumi-som", "https://theconversation.com/johnson-and-johnson-vaccine-suspension-a-doctor-explains-what-this-means-for-you-158923", "https://www.ama-assn.org/delivering-care/public-health/what-doctors-wish-patients-knew-about-johnson-johnson-vaccine", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5767294/", "https://doi.org/10.1161/STROKEAHA.116.013617", "https://n.neurology.org/content/96/15_Supplement/5143", "https://www.businessinsider.com/cdc-johnson-johnson-blood-clot-case-count-rises-to-15-2021-4?op=1", "https://www.scientificamerican.com/article/blood-clots-and-the-johnson-johnson-vaccine-what-we-know-so-far/", "https://apnews.com/article/health-coronavirus-california-7f23281ab23fadaaaba7e79e210f73d1", "https://doi.org/10.1056/NEJMe2106315", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/viralvector.html", "https://emergency.cdc.gov/han/2021/han00442.asp", "https://theconversation.com/is-it-the-adenovirus-vaccine-technology-used-by-astrazeneca-and-johnson-and-johnson-causing-blood-clots-theres-no-evidence-yet-158944", "https://www.hematology.org/covid-19/vaccine-induced-immune-thrombotic-thrombocytopenia", "https://doi.org/10.1161/STROKEAHA.108.543884", "https://doi.org/10.1056/NEJMoa2104840", "https://doi.org/10.1007/s12028-009-9320-y", "https://doi.org/10.1161/CIRCULATIONAHA.106.632653", "https://www.ema.europa.eu/en/news/astrazenecas-covid-19-vaccine-ema-finds-possible-link-very-rare-cases-unusual-blood-clots-low-blood", "https://theconversation.com", "https://theconversation.com/what-are-the-blood-clots-associated-with-the-johnson-and-johnson-covid-19-vaccine-4-questions-answered-159523", "/second-dose-astrazeneca-covid-19-vaccine-faqs-about-blood-clots-safety-risks-459109"], "authors": [], "publish_date": "2021-06-03T04:30:46-04:00"}