{"result_id": "198019", "URL": "https://www.medicaldaily.com/cdc-finds-possible-safety-issue-pfizer-vaccine-467757", "timestamp": "2023-04-25 16:20:08 CEST+0200", "meta": {"description": "The public health agency detected a safety issue with the bivalent boosters but encouraged the public to get boosted anyway.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/cdc-finds-possible-safety-issue-pfizer-vaccine-467757", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "CDC Finds Possible Safety Issue With Pfizer Vaccine", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) reported Friday that it found a possible safety issue with the updated or bivalent vaccines from Pfizer and BioNTech.\n\nIn partnership with the Food and Drug Administration (FDA), the public health agency has been monitoring the transparency and safety of the COVID-19 vaccines. In its latest update, the CDC said its real-time surveillance system Vaccine Safety Datalink (VSD) found statistical criteria that warranted an investigation into the bivalent vaccines.\n\nAccording to the CDC, there appeared to be a safety concern for ischemic stroke in people aged 65 and above who received the updated vaccines from Pfizer-BioNTech. The VSD raised the question of whether the elderly were likely to suffer an ischemic stroke 21 days after receiving the bivalent boosters.\n\nAn ischemic stroke is a condition that occurs when a blood clot blocks an artery to the brain. This is considered the most common type of stroke since a blood clot often forms in arteries damaged by the buildup of plaques, as per the Mayo Clinic.\n\nAround 130 of the 550,000 seniors being monitored by the VSD system after receiving the bivalent vaccines had strokes three weeks after their vaccination, a CDC official said to CNN on condition of anonymity. None of the 130 patients died after the stroke.\n\nThe CDC also maintained that it’s very unlikely for the detected safety signal to represent a true clinical risk since no other safety systems have reported a similar finding. Several studies have also shown no increased risk of ischemic stroke due to the bivalent vaccines.\n\n“These strokes are not a confirmed adverse event at the moment. It’s like a radar system. You’re getting a blip on the radar, and you have to do further investigation to discover whether that airplane is friend or foe,” Dr. William Schaffner, an infectious disease expert at Vanderbilt University and a member of the CDC Advisory Committee on Immunization Practices’ Covid-19 Vaccine Work Group, told CNN.\n\nThe CDC said no change is recommended in the COVID-19 vaccination practice. Everyone aged six months and above is still encouraged to get vaccinated and boosted amid the ongoing coronavirus pandemic.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/cdc-finds-possible-safety-issue-pfizer-vaccine-467757", "title": "CDC Finds Possible Safety Issue With Pfizer Vaccine", "description": "The public health agency detected a safety issue with the bivalent boosters but encouraged the public to get boosted anyway. ", "image": "https://d.medicaldaily.com/en/full/457814/pfizer-biontech-vaccine.jpg", "image:alt": "Pfizer BIontech Vaccine", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2023-01-14T18:39:29-05:00", "article:modified_time": "2023-01-14T18:50:17-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/bivalent-boosters.html", "https://www.mayoclinic.org/diseases-conditions/stroke/symptoms-causes/syc-20350113", "https://edition.cnn.com/2023/01/13/health/pfizer-bivalent-booster-safety-cdc", "https://www.medicaldaily.com/research-uncovers-crucial-covid-19-vaccine-booster-benefit-467628", "/study-sparks-hope-long-covid-sufferers-467744", "/scientists-find-both-covid-19-and-its-vaccination-are-linked-taxing-heart-467738", "/covid-19-increases-diabetes-risk-study-suggests-467713"], "authors": [], "publish_date": "2023-01-14T18:39:29-05:00"}