{"result_id": "198015", "URL": "https://www.medicaldaily.com/new-covid-19-vaccine-trial-wants-unvaccinated-children-colorado-join-469278", "timestamp": "2023-04-25 16:20:07 CEST+0200", "meta": {"description": "Researchers are developing a new vaccine for children aged 6 months to 5 years old.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/new-covid-19-vaccine-trial-wants-unvaccinated-children-colorado-join-469278", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "New COVID-19 Vaccine Trial Wants Unvaccinated Children In Colorado To Join", "cleaned_text": "Moderna is developing a new vaccine for young children amid the ongoing COVID-19 pandemic.\n\nResearchers at the University of Colorado School of Medicine are conducting a new vaccine trial with the end goal of making an updated vaccine for kids 6 months to 5 years old, CBS News reported Tuesday.\n\nModerna previously developed an updated vaccine that includes protection against Omicron and its newer subvariants. Unfortunately, the bivalent booster was only for adults. An updated dose for kids has yet to be made.\n\nThe U.S. Centers for Disease Control and Prevention (CDC) officially recommended the bivalent boosters last September, saying the new doses could restore and ensure the protection of people aged 12 and above from SARS-CoV-2 and its newer, more transmissible variants.\n\nWith the new trial, clinical research nurse Tori Rutherford told the outlet that Moderna would make a bivalent booster for younger children.\n\n\"Anybody who has kids, I have three, anything to keep them healthier, anything to keep them in school, keep them from missing days because they are sick; would be such a gift,\" Rutherford added.\n\nCOVID-19 may no longer be as prominent in the news as before, but experts said the infectious disease remains a big problem for the medical community.\n\n\"Right now, it's quiet, and it's not in the news much, but it hasn't gone away, and I think out of an abundance of caution, we should be prepared for what's coming next, and that's what this vaccine does,\" University of Colorado School of Medicine's professor of pediatrics medicine Dr. Myron Levin told CBS News.\n\n\"There's a fight going on between 'how fast it can mutate and can our immunity keep up with it or not?'\" Levin said after noting that the virus is constantly changing.\n\nResearchers involved in the trial hope families in Colorado whose children have yet to be vaccinated would be willing to participate. Those interested are encouraged to contact the team via email at ModernaRoverStudy@cuanshutz.edu or call the team by phone at 720-777-4496.\n\nOther sites across the U.S. have already started similar trials. Levin and the team are just waiting for families who want to make a difference in the fight against COVID-19.\n\n\"We are ready. We can start as soon as we have people who want to be protected,\" Levin said.\n\nInterestingly, the World Health Organization (WHO) released an updated vaccination guidance last month, classifying healthy children as \"low priority\" for modern vaccines. This meant the age group might no longer need the updated boosters.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/new-covid-19-vaccine-trial-wants-unvaccinated-children-colorado-join-469278", "title": "New COVID-19 Vaccine Trial Wants Unvaccinated Children In Colorado To Join", "description": "Researchers are developing a new vaccine for children aged 6 months to 5 years old.", "image": "https://d.medicaldaily.com/en/full/45008/pfizer-moderna-quadrupling-price-their-covid-vaccine-raises-concerns.jpg", "image:alt": "Pfizer and Moderna Quadrupling Price of Their COVID Vaccine Raises Concerns", "image:width": "2500", "image:height": "1667", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Unvaccinated", "article:published_time": "2023-04-04T21:30:18-04:00", "article:modified_time": "2023-04-04T21:30:18-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cbsnews.com/colorado/news/university-colorado-researchers-trial-covid-vaccine-children/", "https://www.medicaldaily.com/cdc-officially-recommends-covid-19-boosters-omicron-466741", "/infected-immune-cells-brain-could-causing-long-covid-symptoms-469255", "/vaccine-fatigue-why-many-people-refuse-covid-19-booster-shots-469247", "/scientists-develop-sensor-that-can-distinguish-covid-19-flu-seconds-469250", "https://www.medicaldaily.com/do-kids-need-another-covid-19-booster-shot-469245"], "authors": [], "publish_date": "2023-04-04T21:30:18-04:00"}