{"result_id": "198002", "URL": "https://www.medicaldaily.com/who-should-get-vaccinated-against-monkeypox-465812", "timestamp": "2023-04-25 16:20:03 CEST+0200", "meta": {"description": "The U.S. government will roll out 296,000 doses of the monkeypox vaccine amid the outbreak.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/who-should-get-vaccinated-against-monkeypox-465812", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Who Should Get Vaccinated Against Monkeypox?", "cleaned_text": "After the Centers for Disease Control and Prevention (CDC) confirmed that the United States already recorded about 300 monkeypox cases, the U.S. government has decided to roll out vaccines to contain the situation as soon as possible.\n\nThe Biden administration has already confirmed that it will roll out 296,000 doses of the only monkeypox vaccine approved by the Food and Drug Administration (FDA). However, it’s unclear who should be getting the Jynneos vaccine doses amid the outbreak.\n\nLast month, the CDC issued a warning, saying members of the LGBTQ community have a higher risk of contracting the virus. The disease is technically not transmitted sexually, but initial reports on the outbreak found that gays and bisexual people accounted for most of the cases.\n\nSince the virus spreads via contact with body fluids and sores, it can be passed to other people through sexual intercourse, intimate contact and even shared beddings. This prompted the public health agency to issue safer sex guidelines earlier this month.\n\nThe CDC encouraged the public not to kiss and have sex if their partner has monkeypox symptoms or recently developed unexplained rashes or sores. The agency also advised against sharing towels, fetish gear, sex toys and other personal items to avoid the spread of the disease.\n\nHealth officials have warned that the main driver of the growing number of monkeypox cases is making close contact, especially sexual contact. They also singled out the people who should be getting jabbed with the monkeypox vaccine to prevent the outbreak from getting bigger.\n\nPer the CDC recommendations, the following should receive the Jynneos vaccine for monkeypox: people who have had close contact with a monkeypox patient, men who have sex with men, sexually active transgender people, health care workers who have come in contact with the virus and people who have traveled outside of the U.S. to places with confirmed monkeypox activity.\n\nThe World Health Organization (WHO) noted that transgender people and gender-diverse people could be vulnerable in the context of the monkeypox outbreak, so they should get vaccinated. However, the organization pointed out that regardless of sexuality, everyone is at risk of contracting or passing on the virus.\n\nSince its detection outside Africa in May, the virus has already spread to 48 countries and infected over 3,500 people. In a new study published this week, scientists said the rapid transmission of the disease could be a product of the virus’ “accelerated evolution.”", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/who-should-get-vaccinated-against-monkeypox-465812", "title": "Who Should Get Vaccinated Against Monkeypox?", "description": "The U.S. government will roll out 296,000 doses of the monkeypox vaccine amid the outbreak.", "image": "https://d.medicaldaily.com/en/full/458135/vaccine.jpg", "image:alt": "Vaccine", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Conditions", "article:published_time": "2022-06-30T22:24:23-04:00", "article:modified_time": "2022-06-30T22:24:23-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.medicaldaily.com/lgbtq-community-greater-risk-monkeypox-cdc-says-465406", "https://www.medicaldaily.com/cdc-issues-safer-sex-guidelines-amid-monkeypox-outbreak-465730", "https://www.cdc.gov/poxvirus/monkeypox/response/2022/index.html", "https://www.who.int/news/item/25-05-2022-monkeypox--public-health-advice-for-gay--bisexual-and-other-men-who-have-sex-with-men", "https://www.medicaldaily.com/monkeypox-mutating-12-times-faster-expected-scientists-465796", "/monkeypox-high-demand-vaccine-nyc-halts-walk-ins-within-hours-465793"], "authors": [], "publish_date": "2022-06-30T22:24:23-04:00"}