{"result_id": "198021", "URL": "https://www.medicaldaily.com/parents-fear-mmr-vaccines-causes-autism-468354", "timestamp": "2023-04-25 16:20:09 CEST+0200", "meta": {"description": "Parents put off the vaccine for fear that it could lead to autism.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/parents-fear-mmr-vaccines-causes-autism-468354", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Many Parents Believe MMR Vaccine Leads To Autism Causing Vaccination Rates To Lag", "cleaned_text": "Many parents have opted not to let their kids get the MMR (measles, mumps, rubella) vaccine, causing the vaccination rates to lag. Their decision could be responsible for the measles outbreak that hit Columbus, Ohio, late last year.\n\nAmid the outbreak, public health officials found that 80 to 85, or majority of the cases, were unvaccinated children. They sought to get to the bottom of the issue, so they interviewed the parents of the unvaccinated kids, and what they found was shocking.\n\nAfter speaking with the parents, the officials found that most were hesitant to get their kids the vaccine shots out of fear that the immune-boosting formula could lead to autism — a developmental disability affecting the brain.\n\n\"What our team heard from many parents is that they weren't necessarily against vaccines, and their children had other age-appropriate vaccines, but they were specifically putting off the MMR vaccine or waiting as long as they could before they had to get it because of fears it could lead to autism,\" Columbus Public Health director of public affairs & communications Kelli Newman told ABC News.\n\nThe belief that the MMR vaccine could cause autism stemmed from a 1998 study, which allegedly found evidence linking the two. The paper by Andrew Wakefield published in the journal Lancet claimed the vaccine caused a series of events, including intestinal inflammation, entrance into the bloodstream of proteins harmful to the brain and consequent autism development.\n\nHowever, health experts already discredited the study, which got retracted from the journal. But in 2002, Wakefield and his colleagues published another paper examining the relationship between the measles virus and autism. They even tested intestinal biopsy samples from children with and without autism. They found that 75 of 91 children with autism had the measles virus in their intestines compared with only 5 of 70 children without autism.\n\nWhile the findings may seem alarming, experts pointed out the flaws and limitations in both studies. The first study was deemed fraudulent for misrepresenting data, while the other paper failed to report whether the virus found in the biopsy samples was natural measles virus or vaccine virus, according to the Children’s Hospital of Philadelphia.\n\nWakefield eventually lost his medical license following the controversial papers, but the damage was already done. Numerous measles outbreaks have popped up in the U.K. and the U.S. over the last two decades due to the fear of parents that the vaccine could lead to autism.\n\n\"We eliminated measles from the United States in the year 2000, and since then, measles has become back. I think the summary of all that for me is that while it's very easy to scare people, it's hard to unscare them,\" Dr. Paul Offit, the director of the Vaccine Education Center and an attending physician in the division of infectious diseases at the Children's Hospital of Philadelphia, told ABC News.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/parents-fear-mmr-vaccines-causes-autism-468354", "title": "Many Parents Believe MMR Vaccine Leads To Autism Causing Vaccination Rates To Lag", "description": "Parents put off the vaccine for fear that it could lead to autism.", "image": "https://d.medicaldaily.com/en/full/436774/measles.jpg", "image:alt": "Measles", "image:width": "2500", "image:height": "1668", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "US/World", "article:tag": "Autism", "article:published_time": "2023-03-06T19:46:38-05:00", "article:modified_time": "2023-03-06T19:46:38-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://abcnews.go.com/Health/mmr-vaccine-rates-lagging-amid-rise-measles-cases/story?id=97495150", "https://www.chop.edu/centers-programs/vaccine-education-center/vaccines-and-other-conditions/vaccines-autism", "/fewer-kids-get-vaccinated-against-measles-other-viruses-us-cdc-467749"], "authors": [], "publish_date": "2023-03-06T19:46:38-05:00"}