{"result_id": "198041", "URL": "https://www.medicaldaily.com/chinese-mrna-covid-vaccine-approved-first-time-indonesia-466964", "timestamp": "2023-04-25 16:20:15 CEST+0200", "meta": {"description": "The approval comes as somewhat of a surprise as Walvax has yet to publish efficacy readings that would show how well it can reduce the risk of COVID cases and deaths.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/chinese-mrna-covid-vaccine-approved-first-time-indonesia-466964", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "A Chinese MRNA COVID Vaccine Is Approved For The First Time - In Indonesia", "cleaned_text": "ndonesia said it has granted emergency use approval to an mRNA COVID-19 vaccine developed by a Chinese company, becoming the first country, ahead of even China, to do so.\n\nIndonesia's food and drugs agency (BPOM) greenlighted the use of Walvax Biotechnology's mRNA vaccine, which has been in development for more than two years and targets the original strain of the coronavirus.\n\nThe approval comes as somewhat of a surprise as Walvax, which has been conducting large late-stage trials of the vaccine in several countries including Indonesia, Mexico and China, has yet to publish efficacy readings that would show how well it can reduce the risk of COVID cases and deaths.\n\nPenny Lukito, head of the agency, told reporters the vaccine, now known as AWcorna, was 83.58% effective against wild-type coronavirus strains considered common and normal, though she added that its efficacy drops to 71.17% for the highly contagious Omicron variant.\n\nShe did not provide details of the data and did not respond to Reuters queries seeking further comment.\n\nWalvax declined to comment. Share reaction for the Chinese company was muted, with the stock rising just 0.5%.\n\nIndonesia has previously granted emergency use approvals to other Chinese COVID shots before detailed efficacy data became available, though that was earlier on in the pandemic when Western-made products were in short supply.\n\nChina has several mRNA candidates in development but the Walvax vaccine is the only candidate in large late-stage clinical trials.\n\nIt was not immediately clear how widely the newly approved shot will be used in Indonesia, where more than 63% of its population is fully vaccinated. Health experts around the world also recommend using so-called bivalent COVID vaccines, which target both the original strain and the Omicron variant.\n\nIndonesia also uses mRNA COVID vaccines made by Pfizer-BioNTech and Moderna, but the AWcorna shot has a longer shelf life, remaining stable at 2-8 degrees Celsius for at least six months, according to its researchers.\n\nThat could make the vaccine ideal for Indonesia, an archipelago of thousands of islands, and other countries which have poor logistics in remote areas.\n\nBPOM said the vaccine's less stringent storage requirements suited Indonesia, a tropical country, and it could be used as both a primary and a booster shot for adults.\n\nThe vaccine will be locally produced by an Indonesian firm, Etana Biotechnologies.\n\nDicky Budiman, an Indonesian epidemiologist at Australia's Griffith University, said producing AWcorna at home via technology transfer would help the country develop sufficient expertise as it seeks to prepare for new variants and possible shortages of vaccines.\n\n\"It's important and strategic,\" he said.\n\nWalvax co-developed the vaccine with Suzhou Abogen Biosciences and a Chinese military-backed institution.\n\nWalvax and Suzhou Abogen are also separately working on their own mRNA candidates that target coronavirus variants.\n\nFor its part, China has not approved any Western-made COVID shots and its approved vaccine portfolio does not yet include vaccines that specifically target the Omicron variant.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/chinese-mrna-covid-vaccine-approved-first-time-indonesia-466964", "title": "A Chinese MRNA COVID Vaccine Is Approved For The First Time - In Indonesia", "description": "The approval comes as somewhat of a surprise as Walvax has yet to publish efficacy readings that would show how well it can reduce the risk of COVID cases and deaths.", "image": "https://d.medicaldaily.com/en/full/464717/novavax-vaccine.jpg", "image:alt": "Novavax vaccine", "image:width": "594", "image:height": "396", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2022-09-30T05:54:48-04:00", "article:modified_time": "2022-09-30T05:54:48-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["/us-now-among-countries-confirmed-circulating-vaccine-derived-poliovirus-cdc-466801", "/novavax-side-effects-what-you-need-know-about-covid-19-vaccine-466605"], "authors": [], "publish_date": "2022-09-30T05:54:48-04:00"}