{"result_id": "198012", "URL": "https://www.medicaldaily.com/who-considers-approving-new-malaria-vaccine-80-efficacy-oxford-university-469393", "timestamp": "2023-04-25 16:20:06 CEST+0200", "meta": {"description": "The developers called the new vaccine a \"world-changer.\"", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/who-considers-approving-new-malaria-vaccine-80-efficacy-oxford-university-469393", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "WHO Considers Approving New Malaria Vaccine With 80% Efficacy From Oxford University", "cleaned_text": "A new malaria vaccine developed by Britain's Oxford University is making headlines for its efficiency in treating the parasitic infection.\n\nGhana is the first country to approve and authorize the use of the vaccine in children aged 5 to 36 months - the age group with the highest risk of death from malaria.\n\nIn response to Ghana's move, the World Health Organization (WHO) is reportedly considering approving the vaccine, according to the BBC.\n\nThe final trial data on the new malaria vaccine's safety and effectiveness are still not public. However, Ghana's drug regulators have already assessed it and given their approval for its use.\n\nThe R21/Matrix-M vaccine has already shown its capabilities in the preliminary studies in Burkina Faso, where it yielded an efficacy rate of up to 80% when administered in three initial doses and one booster a year later, per the BBC.\n\n\"This marks a culmination of 30 years of malaria vaccine research at Oxford with the design and provision of a high efficacy vaccine that can be supplied at adequate scale to the countries who need it most,\" Oxford University's Jenner Institute Professor Adrian Hill said of Ghana's approval, according to The Times.\n\nHill noted that after showing promise during its initial trial in Burkina Faso, the vaccine is on its way to getting the approval of the WHO, which has been looking for a malaria vaccine with at least 75% efficacy.\n\n\"It is hoped that this crucial step will enable the vaccine to help Ghanian and African children to effectively combat malaria,\" Oxford University said in a statement obtained by New Straits Times.\n\nThe mosquito-borne parasitic disease reportedly killed 627,000 people, mostly African children, in 2020 alone. The international research team hopes their vaccine could help lower or eliminate the deaths due to the disease.\n\n\"We expect R21 to make a major impact on malaria mortality in children in the coming years, and in the longer term [it] will contribute to [the] overall final goal of malaria eradication and elimination,\" Hill told the BBC.\n\nOther African countries are already studying the clinical data on R21's safety and effectiveness.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/who-considers-approving-new-malaria-vaccine-80-efficacy-oxford-university-469393", "title": "WHO Considers Approving New Malaria Vaccine With 80% Efficacy From Oxford University", "description": "The developers called the new vaccine a \"world-changer.\"", "image": "https://d.medicaldaily.com/en/full/433364/malaria.jpg", "image:alt": "Malaria", "image:width": "1280", "image:height": "959", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Drugs", "article:tag": "Who", "article:published_time": "2023-04-12T22:07:46-04:00", "article:modified_time": "2023-04-12T22:07:46-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bbc.com/news/health-65252511.amp", "https://www.thetimes.co.uk/article/oxford-malaria-vaccine-could-save-millions-of-childrens-lives-in-africa-3gflz3jfm", "https://www.nst.com.my/amp/world/world/2023/04/899132/malaria-vaccine-gets-green-light-use-ghana", "/how-does-climate-change-affect-spread-infectious-diseases-466488", "/scientists-discover-new-mosquito-species-spreading-malaria-kenya-468152", "/covid-19-pandemic-could-end-2024-yale-study-465910"], "authors": [], "publish_date": "2023-04-12T22:07:46-04:00"}