{"result_id": "198016", "URL": "https://www.medicaldaily.com/fda-still-undecided-spring-covid-boosters-468523", "timestamp": "2023-04-25 16:20:07 CEST+0200", "meta": {"description": "The federal agency remains mum on second bivalent boosters amid the pandemic.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/fda-still-undecided-spring-covid-boosters-468523", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "FDA Still Undecided On Spring Booster For COVID-19", "cleaned_text": "Spring is fast approaching. If you had the bivalent booster for COVID-19 last fall, it would be the perfect time to get another shot for optimum protection against the disease. Unfortunately, the U.S. Food and Drug Administration (FDA) has yet to decide on the rollout of the second bivalent booster.\n\nSTAT’s Helen Branswell said Thursday that the federal agency has only offered radio silence on the question of spring Covid boosters, sparking frustration among people determined to stay up to date with their vaccines and boosters for various reasons.\n\nMedical professionals and healthcare workers are bombarded with questions about when the next booster dose will become available. Without the FDA’s authorization, they couldn’t give a clear answer to the inquiries.\n\n“I will tell you that patients message me every day about this,” Camille Kotton, Massachusetts General Hospital’s clinical director for transplant and immunocompromised host infectious diseases, recently told STAT.\n\nFamily medicine physician Jamie Loehr, based in Ithaca, New York, admitted to the same outlet that patients who got the first bivalent dose last fall have been asking him for off-label permission slips to secure another bivalent jab.\n\nEarlier this month, the U.K. already recommended a spring booster dose for high-risk groups, saying people over 75, the immunosuppressed and those residing in care homes for older adults should get the updated boosters to lower their Covid risk.\n\nJust like the U.K., Canada has also decided on offering spring booster shots for people at high risk of getting severely ill from the novel coronavirus.\n\nMeanwhile, the U.S. remains undecided on whether people in the country should have another dose of the vaccine. The FDA declined when STAT requested an interview about the issue.\n\n“We continue to closely monitor the emerging data in the United States and globally, and we will base any decision on additional updated boosters upon those data,” the agency said in response.\n\nIn February, experts claimed that though everyone remains at risk of contracting COVID-19 amid the pandemic, young people may no longer need another vaccine dose for extended protection.\n\n“Even if they’re not getting boosted, young, healthy people are not getting super sick from this. We're not seeing it. It's not happening,” Dr. Mangala Narasimhan, the senior vice president at Northwell Health, the largest healthcare provider in New York state, told CNN.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/fda-still-undecided-spring-covid-boosters-468523", "title": "FDA Still Undecided On Spring Booster For COVID-19", "description": "The federal agency remains mum on second bivalent boosters amid the pandemic.", "image": "https://d.medicaldaily.com/en/full/458755/covid-19-vaccination-gloves.jpg", "image:alt": "COVID-19 vaccination - gloves", "image:width": "1024", "image:height": "666", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Boosters", "article:published_time": "2023-03-16T20:47:48-04:00", "article:modified_time": "2023-03-16T20:47:48-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.statnews.com/2023/03/16/fda-offers-radio-silence-on-question-of-spring-covid-boosters-as-other-countries-push-ahead/", "https://www.medicaldaily.com/second-bivalent-covid-booster-rollout-468384", "https://www.medicaldaily.com/young-people-may-not-need-another-covid-19-booster-heres-why-468063", "/covid-19-immunity-cells-could-cure-cancer-new-research-suggests-468460"], "authors": [], "publish_date": "2023-03-16T20:47:48-04:00"}