{"result_id": "198022", "URL": "https://www.medicaldaily.com/how-long-you-sleep-decides-immunity-level-following-vaccination-study-finds-468487", "timestamp": "2023-04-25 16:20:09 CEST+0200", "meta": {"description": "The reduced immune response due to sleep is equivalent to the waning of COVID-19 antibodies, two months following vaccination.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/how-long-you-sleep-decides-immunity-level-following-vaccination-study-finds-468487", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "How Long You Sleep Decides Immunity Level Following Vaccination, Study Finds", "cleaned_text": "No one would have thought that sleep could affect immunity gained from vaccination. However, a new study has claimed just that.\n\nThe study, published in the journal Current Biology, found sleeping for less than six hours wanes the immune response to vaccination, especially in men.\n\nAs per The Guardian, the reduced immune response is equivalent to the waning of COVID-19 antibodies, two months following vaccination.\n\nFor the study, Dr. Karine Spiegel, of the French National Institute of Health and Medicine in Lyon, and her team reviewed the results of seven studies in which people were vaccinated against virus-caused illnesses including influenza and hepatitis A and B.\n\nIn the study, the antibody responses of individuals were compared between those who slept for seven to nine hours per night (the recommended level for healthy adults) and those who slept for less than six hours a night.\n\nFollowing analysis, it was found sleeping for less than six hours accorded less immunity from vaccination in men. However, the effect was not discernible in women on account of fluctuating sex hormone levels, researchers opined.\n\n“We know from immunology studies that sex hormones influence the immune system,” said Spiegel, according to the outlet. “In women, immunity is influenced by the state of the menstrual cycle, the use of contraceptives, and [whether they have gone through menopause], but unfortunately, none of the studies that we summarized had any data about sex hormone levels.”\n\nAfter considering both sexes, the lack of sleep reduced immune response that was on par with the waning of the antibody response to the Pfizer/BioNTech vaccine after two months.\n\n“If similar to the influenza and hepatitis vaccines … then insufficient sleep around the time of COVID-19 vaccination may reduce antibody titers in the same range as the waning of the response to the most commonly administered vaccine over two months,” researchers explained.\n\nMoreover, the effect of insufficient sleep was more pronounced in adults aged between 18 and 60 rather than in older adults.\n\n“Good sleep not only amplifies but may also extend the duration of protection of the vaccine,” said the senior study author Eve Van Cauter, a professor emeritus at the University of Chicago, as per the outlet.\n\n“When you see the variability in the protection provided by the Covid-19 vaccines – people who have pre-existing conditions are less protected, men are less protected than women, and obese people are less protected than people who don’t have obesity. Those are all factors that an individual person has no control over, but you can modify your sleep,” Van Cauter further said.\n\nWhile the results are a good starting point to focus on the aspect of sleep and immunity, it should be noted more research is needed to find out exactly how much sleep is needed before guidelines can be issued, Spiegel emphasized.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/how-long-you-sleep-decides-immunity-level-following-vaccination-study-finds-468487", "title": "How Long You Sleep Decides Immunity Level Following Vaccination, Study Finds", "description": "The reduced immune response due to sleep is equivalent to the waning of COVID-19 antibodies, two months following vaccination.", "image": "https://d.medicaldaily.com/en/full/466900/deep-sleep.png", "image:alt": "Deep Sleep", "image:width": "1198", "image:height": "674", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Vitality", "article:tag": "Sleep", "article:published_time": "2023-03-14T02:53:23-04:00", "article:modified_time": "2023-03-14T02:53:23-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cell.com/current-biology/fulltext/S0960-9822(23)00156-2", "https://www.theguardian.com/lifeandstyle/2023/mar/13/less-than-6-hours-sleep-reduces-vaccination-immune-response", "https://www.medicaldaily.com/covid-19-immunity-cells-could-cure-cancer-new-research-suggests-468460"], "authors": [], "publish_date": "2023-03-14T02:53:23-04:00"}