{"result_id": "198026", "URL": "https://www.medicaldaily.com/pfizers-rsv-vaccine-rare-neurological-condition-important-potential-risk-jab-468259", "timestamp": "2023-04-25 16:20:10 CEST+0200", "meta": {"description": "In this condition, the immune system damages one’s own nerves, which, in turn, causes muscle weakness and even paralysis in some cases.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/pfizers-rsv-vaccine-rare-neurological-condition-important-potential-risk-jab-468259", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Pfizer's RSV Vaccine: Rare Neurological Condition An 'Important Potential Risk' Of The Jab", "cleaned_text": "The first RSV vaccine candidate from Pfizer is under fire from the US Food and Drug Administration (FDA) after a rare neurological syndrome has been identified as a potential risk of getting the jab.\n\nDuring the clinical trial of Pfizer’s RSV vaccine, two people who received the shot were diagnosed with Guillain-Barre syndrome later. As a result, the FDA has asked Pfizer to conduct a safety study if the vaccine is approved, according to documents released Friday.\n\nThe two adults, who suffered from the syndrome, were in their 60s, and belonged to a group of 20,000 volunteers who received the shot in Pfizer’s Phase 3 clinical trial. Interestingly, one person’s illness subsided after three months, while the other one was improving after a period of six months. In contrast, no case of Guillain-Barre was observed in people who didn’t receive the jab, according to CNN.\n\n“Given the temporal association and biological plausibility, FDA agrees with the assessments of the investigators that these events were possibly related to study vaccine. … Therefore, [Guillain-Barre] is being considered an important potential risk,” the FDA said.\n\nGuillain-Barre syndrome is a rare neurological disorder that affects the nerves. In this condition, the immune system damages one’s own nerves. This, in turn, causes muscle weakness and even paralysis in some cases. While most people recover completely, in some, the syndrome can turn fatal or lead to lasting effects.\n\nGuillain-Barre has an incidence rate of 1.5 to 3 cases for 100,000 adults over age 60 in the US, according to the FDA.\n\n“Given the higher than the background rate of GBS observed in the Phase 3 study, FDA will recommend a postmarketing study and enhanced surveillance for further evaluation of GBS and other immune-mediated demyelinating conditions with postmarketing use,” the FDA said.\n\nHowever, in a briefing document submitted for next week’s meetings, Pfizer makes a case that the two incidents have other possible explanations, and assured its shot was a “well-tolerated and safe vaccine, with a benefit-to-risk ratio that is favorable.”\n\nFurthermore, the pharma company said that it will conduct a safety study on Guillain-Barre syndrome if its vaccine gets the green light.\n\nRSV is a virus that causes flu-like illness in people of all ages. According to the US Centers for Disease Control and Prevention, RSV is associated with 177,000 hospitalizations and 14,000 deaths per year among adults 65 or older.\n\nCurrently, no vaccine is approved for immunization against RSV.\n\nAs per the FDA documents, the Pfizer vaccine was 66.7% effective at preventing moderate lower respiratory tract illness with two or more symptoms and 85.7% effective at preventing severe illness.\n\nAnother RSV vaccine candidate, GSK’s jab for older adults, was found to be 83.5% effective at preventing severe lower respiratory tract disease. Here also, the company reported a potential case of Guillain-Barre syndrome among vaccine recipients, but added there was insufficient evidence to confirm a diagnosis.\n\nHowever, the FDA posits, the case is related to the vaccine, and a review of GSK’s safety plan will be conducted by the agency.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/pfizers-rsv-vaccine-rare-neurological-condition-important-potential-risk-jab-468259", "title": "Pfizer's RSV Vaccine: Rare Neurological Condition An 'Important Potential Risk' Of The Jab", "description": "In this condition, the immune system damages one’s own nerves, which, in turn, causes muscle weakness and even paralysis in some cases.", "image": "https://d.medicaldaily.com/en/full/465141/pfizer-vaccine.jpg", "image:alt": "Pfizer vaccine", "image:width": "594", "image:height": "396", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Conditions", "article:tag": "Guillain-Barre syndrome", "article:published_time": "2023-02-27T02:33:08-05:00", "article:modified_time": "2023-02-27T02:33:08-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/media/165623/download", "https://edition.cnn.com/2023/02/24/health/pfizer-rsv-vaccine-guillain-barre", "https://www.fda.gov/media/165625/download", "https://www.medicaldaily.com/worst-bird-flu-outbreak-prompts-scientists-develop-vaccines-468051", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2022-06-22-23/04-rsv-havers-508.pdf", "https://www.gsk.com/en-gb/media/press-releases/gsk-s-older-adult-respiratory-syncytial-virus-rsv-vaccine-candidate/"], "authors": [], "publish_date": "2023-02-27T02:33:08-05:00"}