{"result_id": "198001", "URL": "https://www.medicaldaily.com/kinder-option-oral-covid-vaccine-people-can-drink-works-467824", "timestamp": "2023-04-25 16:20:02 CEST+0200", "meta": {"description": "Mucosal vaccines are accepted as feasible options for countering COVID-19 infections as their target, the mucous membrane, is exactly where the SARS-COV-2 virus enters our bodies.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/kinder-option-oral-covid-vaccine-people-can-drink-works-467824", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "A 'Kinder' Option? An Oral Covid Vaccine That People Can Drink Is In The Works", "cleaned_text": "A COVID-19 vaccine that people can drink to gain immunity against the disease may soon become a reality. Researchers are already working on such an alternative, which might make injections a thing of the past.\n\nThe vaccine, called QYNDR, has completed its phase 1 clinical trial, but requires more funding to conduct advanced trials that could make the vaccine commercially available, CNET reported.\n\n\"The QYNDR vaccine is pronounced 'kinder' because it's a softer way to deliver a vaccine,\" Kyle Flanigan, founder of QYNDR's maker, U.S. Specialty Formulations, said, Business Insider reported.\n\nAfter promising clinical trial results from New Zealand, QYNDR is being touted as a viable option for protection against the many variants of COVID-19 circulating now.\n\n\"It's really challenging to have a vaccine survive making it through your digestive system,\" Flanigan said, according to the outlet. \"We were able to figure out how to get a vaccine past the stomach and into the gut and have it be effective and induce the appropriate response.\"\n\nThese jabs fall in the category of mucosal vaccines that, as the name suggests, enter through our mucous membranes, either through our nose or through our gut (as in the case of QYNDR).\n\nAnother sub-category of mucosal vaccine is the type that enters the body through the lining of the respiratory tract. An example of this is China's inhalable booster vaccine from CanSino Biologics. It was approved for use in China in September. Biologics' CEO Xuefeng Yu told Endpoints News that an inhaled vaccine like CanSino's allows it to be absorbed across a larger surface, making it different from other nasal vaccine options, as per the outlet.\n\nMucosal vaccines are accepted as feasible options for countering COVID-19 infections due to the type of immunity they elicit and also because their target, the mucous membrane, is exactly where the SARS-COV-2 virus enters our bodies.\n\nDr. Amesh Adalja, an infectious disease physician and senior scholar at the Johns Hopkins Center for Health Security, said mucosal vaccines generate \"a different type of immune response, including different antibodies.\"\n\nIn other news, The U.S. Food and Drug Administration (FDA) wants the COVID-19 vaccine to follow in the footsteps of the flu vaccine in terms of composition, dispensing, and updating.\n\n“This simplification of vaccine composition should reduce complexity, decrease vaccine administration errors due to the complexity of the number of different vial presentations, and potentially increase vaccine compliance by allowing clearer communication,” the FDA said in its report.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/kinder-option-oral-covid-vaccine-people-can-drink-works-467824", "title": "A 'Kinder' Option? An Oral Covid Vaccine That People Can Drink Is In The Works", "description": "Mucosal vaccines are accepted as feasible options for countering COVID-19 infections as their target, the mucous membrane, is exactly where the SARS-COV-2 virus enters our bodies.", "image": "https://d.medicaldaily.com/en/full/466440/polio-vaccine.jpg", "image:alt": "polio vaccine", "image:width": "1024", "image:height": "683", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "QYNDR", "article:published_time": "2023-01-24T02:40:04-05:00", "article:modified_time": "2023-01-24T02:40:04-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www-cnet-com.cdn.ampproject.org/v/s/www.cnet.com/google-amp/news/scientists-are-working-on-a-covid-vaccine-you-can-drink/?amp_gsa=1&amp_js_v=a9&usqp=mq331AQKKAFQArABIIACAw%3D%3D", "https://www.businessinsider.in/science/health/news/researchers-are-now-working-on-an-oral-covid-19-vaccine-that-people-can-drink/articleshow/97254773.cms", "https://endpts.com/q-n-a-cansino-inhaled-vaccine-xuefeng-yu/", "https://www.medicaldaily.com/fda-wants-change-how-covid-19-vaccines-are-updated-467823"], "authors": [], "publish_date": "2023-01-24T02:40:04-05:00"}