{"result_id": "198011", "URL": "https://www.medicaldaily.com/inhale-swallow-mapping-out-direction-future-covid-19-vaccines-469365", "timestamp": "2023-04-25 16:20:06 CEST+0200", "meta": {"description": "Scientists have started to acknowledge how people's fear of needles could affect vaccination rates amid the pandemic.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/inhale-swallow-mapping-out-direction-future-covid-19-vaccines-469365", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "To Inhale Or Swallow? Mapping Out The Direction Of Future COVID-19 Vaccines", "cleaned_text": "Trypanophobia is the overwhelming or extreme fear of procedures involving needles in the medical setting. Though not considered one of the major reasons behind vaccine hesitancy, experts have acknowledged its contributory role among people who opt out of the vaccination programs.\n\nAll of the available COVID-19 vaccines in the U.S. thus far are administered intramuscularly. This means people do not have other options than receiving the medical dose via needles. However, scientists are working hard to change that soon by looking into other routes of vaccine administration, particularly the nasal and oral passages.\n\nDr. Theresa Pankhurst, of Wellington's Malaghan Institute of Medical Research, recently explained via New Zealand Herald that the newer vaccines work similarly to the injectables rolled out earlier in the pandemic. They still contain similar biochemical components that stimulate an immune response against SARS-CoV-2. The main difference is the route of administration.\n\nBy administering the vaccine into the mucosal tract via the respiratory or digestive system, scientists expect the preparation to produce a stronger localized response that is ideal to stop the spread of the virus and hamper the infection before it even starts.\n\n\"The aim of giving a mucosal vaccine is to build up a strong immune response against the pathogen throughout the body but, importantly, at the locations in the body where pathogens can invade that is through the mucosal system,\" Pankhurst explained.\n\n\"Vaccines injected into the arm give strong immune responses that circulate around the body, but can be limited in generating protective immune responses in those more vulnerable mucosal sites.\"\n\nNot only will the nasal spray and pill form of the COVID-19 vaccines ensure better protection from the novel coronavirus, but they could also help address the number of people worldwide unwilling to get boosted for fear of needles.\n\nA U.S. study in November 2020 involving 9,000 older adults found that around 1.7% were concerned about receiving the vaccines due to trypanophobia. The findings suggested at the time that though fear of injection was not a dominant reason for vaccine hesitancy, it could be a contributory factor.\n\nWorldwide, several mucosal vaccines for COVID-19 are in the works. More research is needed to ensure their safety and effectiveness before they get released to the public. Pankhurst is one of the researchers working with a team to give mucosal vaccination that extra push to become a reality.\n\nPankhurst and colleagues recently published a study in the scientific journal Cell Reports about harnessing a specific type of immune cell found in the lungs to ensure that the vaccine could induce the right amount of immune response against the virus without damaging the delicate structure of the lungs.\n\nThe concept of inhalable or sprayable vaccines is not new. But compared to injectable vaccines and boosters, they are less common due to some enduring limitations. But it appears the medical community is heading in that direction after a nasal spray with live coronavirus was able to block COVID-19 replication in the nose and throat.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/inhale-swallow-mapping-out-direction-future-covid-19-vaccines-469365", "title": "To Inhale Or Swallow? Mapping Out The Direction Of Future COVID-19 Vaccines", "description": "Scientists have started to acknowledge how people's fear of needles could affect vaccination rates amid the pandemic.", "image": "https://d.medicaldaily.com/en/full/458295/person-receiving-vaccine.jpg", "image:alt": "Person receiving vaccine", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Oral vaccine", "article:published_time": "2023-04-11T21:39:28-04:00", "article:modified_time": "2023-04-11T21:39:28-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nzherald.co.nz/nz/could-your-future-covid-19-vaccine-be-sprayed-or-swallowed/72FS3I5AMRFFNFF4KIA5DPWLFA/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8220023/#:~:text=In%20a%20US%20study%20of,may%20be%20a%20contributory%20factor", "/long-covid-scientists-develop-new-approach-better-understand-mysterious-condition-469326", "/contaminated-surfaces-could-spreading-covid-19-households-469315", "/spring-booster-vs-annual-covid-19-shot-us-could-choose-latter-469355", "https://www.cell.com/cell-reports/fulltext/S2211-1247(23)00321-2?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS2211124723003212%3Fshowall%3Dtrue", "https://www.medicaldaily.com/nasal-spray-live-coronavirus-blocks-covid-19-replication-nose-throat-469281"], "authors": [], "publish_date": "2023-04-11T21:39:28-04:00"}