{"result_id": "198035", "URL": "https://www.medicaldaily.com/controversy-concerns-astrazeneca-vaccine-results-458713", "timestamp": "2023-04-25 16:20:13 CEST+0200", "meta": {"description": "AstraZeneca released two sets of phase III safety trial results for its Covid-19 vaccine, each showing slightly different efficacy rates. The inconsistency has kicked up controversy and confusion,", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/controversy-concerns-astrazeneca-vaccine-results-458713", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Controversy and confusion as AstraZeneca releases results", "cleaned_text": "This week, AstraZeneca released two sets of phase III safety trial results for its Covid-19 vaccine, each showing slightly different efficacy rates. The inconsistency has kicked up controversy and confusion, but experts so far believe there is little impact on safety.\n\nIn AstraZeneca’s first set of data, released March 22nd, its vaccine candidate was shown to be 79% effective overall and 80% effective on adults 65 and older, This report, based on 32,449 trial participants with a 2:1 distribution of vaccine to placebo, had 141 cases of Covid-19. None were severe, despite 20% of subjects being in the 65-and-older age category and 60% overall having comorbidities that increased Covid-19 risk.\n\nLater in the week, another set of data was released. Now, the effectiveness was only 76% overall but had risen to 85% for patients aged 65 and older. 49 more cases were included, bringing the total to 190. Eight of these cases were severe, but they had all received the placebo rather than the vaccine. The new report also mentions 14 more unconfirmed cases that could shift the percentage more as analysis continues.\n\nAs to what happened between the first and second release of data, AstraZeneca released two sets of data so close together, complicated.\n\nAstraZeneca’s initial results raised the eyebrows of those federal officials involved in reviewing AZ’s trial data. The New York Times reported that the trial’s federal medical oversight board sent a private letter to the pharma giant criticizing its report for using an incomplete set of results. Some recent Covid-19 cases had been excluded even after discussion with the board, improving the quoted efficacy rate. Shortly after, the National Institute of Allergy and Infectious Diseases issued a statement on the controversy:\n\n“Late Monday, the Data and Safety Monitoring Board (DSMB) [sent notification] that it was concerned by information released by AstraZeneca on initial data from its COVID-19 vaccine clinical trial … [and] may have included outdated information from that trial, which may have provided an incomplete view of the efficacy data.”\n\nThe board requested up-to-date information, which became the second round of phase III trial results.\n\nIn the company’s press release, Executive Vice President of BioPharmaceuticals R&D Mene Pangalos explained: “The primary analysis is consistent with our previously released interim analysis, and confirms that our COVID-19 vaccine is highly effective in adults, including those aged 65 years and over. We look forward to filing our regulatory submission for Emergency Use Authorization in the US and preparing for the rollout of millions of doses across America.”\n\nThe AZ vaccine made headlines earlier in the month for a different problem. In early March, the Austrian Federal Office for Safety in Health Care (BASG) received reports of two cases of death by blood clot in patients that had received doses from the same batch of AZ vaccine. Countries across Europe temporarily suspended use of the vaccine.\n\nThe European Medicines Agency conducted an investigation into the reports and concluded that most people had no significant risk of blood clots. Clotting was a “very rare” potential reaction in patients with low levels of blood platelets.\n\nIn the wake of the blood clot warnings, the WHO issued its own comment, saying “it is routine for countries to signal potential adverse events following immunization. This does not necessarily mean that the events are linked to vaccination itself, but it is good practice to investigate them.” The WHO believes that “the benefits of the AstraZeneca vaccine outweigh its risks and recommends that vaccinations continue.”\n\nHealth Canada added a warning about the blood clot risk to its guidance, but is still recommending people move forward with using all approved vaccines. No risk of blood clots was listed in the clinical trial results released in the US.\n\nAs for the difference in trial results? There may not be cause for concern. Stephen Evans BA, MSc, FRCP, of the vaccine center at London School of Hygiene and Tropical Medicine, told the Associated Press that any vaccine with over 60% effectiveness could be important adding that, “Results fluctuate as data accumulate ... what counts will be the FDA assessment and that will be done based on scrutiny of the full data and not press releases.”\n\nAccording to its press releases, AstraZeneca plans to apply for FDA Emergency Use Authorization “in the coming weeks.”\n\nSean Marsala is a health writer based in Philadelphia, Pa. Passionate about technology, he can usually be found reading, browsing the internet and exploring virtual worlds.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/controversy-concerns-astrazeneca-vaccine-results-458713", "title": "Controversy and confusion as AstraZeneca releases results", "description": "AstraZeneca released two sets of phase III safety trial results for its Covid-19 vaccine, each showing slightly different efficacy rates. The inconsistency has kicked up controversy and confusion, but experts so far believe there is little impact on safety.", "image": "https://d.medicaldaily.com/en/full/458712/vials-covid-19-vaccine-stickers-attached.jpg", "image:alt": "vials-with-covid-19-vaccine-stickers-attached-and", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Phase III", "article:published_time": "2021-03-25T18:59:03-04:00", "article:modified_time": "2021-03-25T19:00:03-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.astrazeneca.com/content/astraz/media-centre/press-releases/2021/astrazeneca-us-vaccine-trial-met-primary-endpoint.html", "https://www.astrazeneca.com/content/astraz/media-centre/press-releases/2021/azd1222-us-phase-iii-primary-analysis-confirms-safety-and-efficacy.html", "https://www.nytimes.com/2021/03/23/business/astrazeneca-vaccine-questions.html", "https://www.nih.gov/news-events/news-releases/niaid-statement-astrazeneca-vaccine", "https://www.basg.gv.at/en/market-surveillance/official-announcements/detail/zwischenfaelle-nach-impfung-mit-covid-19-impfstoff-von-astrazeneca", "https://www.wsj.com/articles/germany-becomes-latest-european-country-to-suspend-use-of-astrazenecas-covid-19-vaccine-11615820414", "https://www.ema.europa.eu/en/news/covid-19-vaccine-astrazeneca-benefits-still-outweigh-risks-despite-possible-link-rare-blood-clots", "https://www.who.int/news/item/17-03-2021-who-statement-on-astrazeneca-covid-19-vaccine-safety-signals", "https://www.canada.ca/en/health-canada/news/2021/03/health-canada-issues-label-change-and-guidance-on-the-astrazeneca-covid-19-vaccine.html", "https://apnews.com/article/astrazeneca-vaccine-strong-protection-us-rift-466726258e5e546550907f123f67763d"], "authors": [], "publish_date": "2021-03-25T18:59:03-04:00"}