{"result_id": "198030", "URL": "https://www.medicaldaily.com/do-we-need-new-covid-19-vaccine-amid-war-against-delta-variant-461001", "timestamp": "2023-04-25 16:20:12 CEST+0200", "meta": {"description": "Experts weigh in on the need for a new COVID-19 vaccine amid the spike in delta cases in many parts of the world.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/do-we-need-new-covid-19-vaccine-amid-war-against-delta-variant-461001", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Do We Need A New COVID-19 Vaccine Amid The War Against The Delta Variant?", "cleaned_text": "After the delta variant surpassed the other COVID-19 variants in terms of prevalence in many places around the world, there’s been a growing concern on whether or not existing vaccines have what it takes to address the more contagious strain. And now experts are weighing in on the possible need for a new vaccine to tackle the delta variant as the pandemic continues.\n\nCOVID-19 infections have reportedly spiked to the highest levels in six months after the highly transmissible delta variant brought forth a new wave of infections while persistent vaccine refusal continued to plague many parts of the country. As such, the delta variant accounted for large numbers in the recent outbreaks than the other strains of the novel coronavirus, according to the New York Times.\n\nEarlier this month, the Centers for Disease Control and Prevention (CDC) released a report on the delta variant saying that the strain is more contagious (about twice) than the previous variants. Data collected by the public health agency also showed that the delta variant could cause more severe illness than the previous strains in unvaccinated people.\n\nHowever, in the same report, the CDC recognized that even fully vaccinated people could get infected and pass the virus to others, further noting that the newer strain appeared to produce the same amount of virus in the body in both vaccinated and unvaccinated individuals. The agency also maintained that the vaccines in the U.S. are highly effective, even against the delta strain of the coronavirus.\n\nThe efficacy of the vaccines in the U.S. has recently been put under the spotlight due to the delta surge. Synthesized data from different countries apparently suggested that the mRNA vaccines by Moderna and Pfizer-BioNTech are only 50% to 60% effective against the delta strain, The Scripps Research Institute in California professor of molecular medicine Dr. Eric Topol wrote on Twitter last week amid the debate on the efficacy of the vaccines.\n\nIn a follow-up, Topol cited a Mayo Clinic study claiming that Pfizer’s vaccine could only be 42% effective against the newer and more contagious strain of the virus. He also noted that pre-delta, the mRNA vaccines were 95% effective against COVID-19. But things drastically changed since the delta strain started to spread.\n\nMeanwhile, the J&J vaccine is believed to be less protective against the symptomatic illness caused by delta compared to the two-dose mRNA vaccines, Live Science reported Monday, citing studies that examined the vaccine’s ability to elicit neutralizing antibodies. Apparently, the studies found that the J&J vaccine elicits lower levels of these antibodies that block the entry of the novel coronavirus in human cells. However, the science news website said that the J&J vaccine is still capable of preventing severe illness from the delta strain.\n\nDo We Need A New Vaccine?\n\nAmid the delta surge, the CDC reversed its recommendation that vaccinated people no longer need to wear masks after it was found out that those who have been inoculated against the virus could still have viable virus in their noses. The public health agency indicated in its updated guidelines that in order for the vaccinated people to maximize their protection from the delta variant, they should wear masks in indoor public places.\n\nThe delta variant’s ability to infect even fully vaccinated individuals has put emphasis on the need for the scientific community to carefully plan out its next move in the war against COVID-19. This has led some to question whether or not a new vaccine designed to target the delta strain should be created to address the surge. But developing variant-specific vaccines would only be akin to a game of whack-a-mole, according to infectious disease specialist Dr. Krutika Kuppalli.\n\nKuppalli, who is affiliated with the Medical University of South Carolina explained that playing catch-up with delta wouldn’t really yield a positive result in the face of the pandemic. “By the time [a new vaccine] might even be ready then we’re on to the next [variant],” the specialist told Live Science. Apart from the period it would take for a new vaccine to be developed, there is also the issue of the novel coronavirus continuously mutating and churning out newer variants, making the idea of having a delta-specific vaccine not that promising.\n\nScientists are currently more invested in having booster shots as a means to provide a more solid form of protection against the delta variant. They are hopeful that by administering a booster shot of the same vaccine, the antibody levels of fully vaccinated people would reach certain levels that would be protective against the variant of concern. This, of course, has long been considered by vaccine manufacturers. In fact, the U.S. government is already in the process of preparing to roll out boosters in the fall.\n\nThe most important thing for now is to get vaccinated. A report on vaccine efficacy published in the peer-reviewed journal the BMJ said that even though the delta variant is posing a challenge to the vaccines currently used, most people who have been inoculated against COVID-19 developed large amounts of neutralizing antibodies that are enough to keep them protected against the different variants of the coronavirus even when the vaccine-induced antibodies experience a 10-fold drop.\n\n“Like everything in life, this is an ongoing risk assessment. If it is sunny and you’ll be outdoors, you put on sunscreen. If you are in a crowded gathering, potentially with unvaccinated people, you put your mask on and keep social distancing. If you are unvaccinated and eligible for the vaccine, the best thing you can do is to get vaccinated,” said Yale Medicine pediatric infectious disease specialist and vaccinologist Inci Yildirim, MD, PhD.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/do-we-need-new-covid-19-vaccine-amid-war-against-delta-variant-461001", "title": "Do We Need A New COVID-19 Vaccine Amid The War Against The Delta Variant?", "description": "Experts weigh in on the need for a new COVID-19 vaccine amid the spike in delta cases in many parts of the world.", "image": "https://d.medicaldaily.com/en/full/458774/coronavirus-vaccines-produced-pfizer-biontech.jpg", "image:alt": "the-coronavirus-vaccines-produced-by-pfizer-biontech-and", "image:width": "1024", "image:height": "768", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2021-08-17T06:48:21-04:00", "article:modified_time": "2021-08-17T06:48:21-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/article/covid-breakthrough-delta-variant.html", "https://www.cdc.gov/coronavirus/2019-ncov/variants/delta-variant.html", "https://twitter.com/EricTopol/status/1425492860619481098", "https://twitter.com/EricTopol/status/1425583390888136710", "https://www.livescience.com/delta-variant-covid-vaccination.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/diy-cloth-face-coverings.html", "https://www.nytimes.com/2021/08/14/us/covid-vaccine-third-shot-booster.html", "https://www.bmj.com/content/374/bmj.n1960", "https://www.yalemedicine.org/news/5-things-to-know-delta-variant-covid", "/does-administering-covid-19-vaccines-through-nose-make-them-more-effective-460951"], "authors": [], "publish_date": "2021-08-17T06:48:21-04:00"}