{"result_id": "198013", "URL": "https://www.medicaldaily.com/california-no-longer-requires-covid-19-vaccine-children-attending-schools-467973", "timestamp": "2023-04-25 16:20:06 CEST+0200", "meta": {"description": "The state has ended one of its last major restrictions for the COVID-19 pandemic.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/california-no-longer-requires-covid-19-vaccine-children-attending-schools-467973", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "California No Longer Requires COVID-19 Vaccine For Children Attending Schools", "cleaned_text": "Children in California no longer need to get the COVID-19 vaccine to attend schools. The state has officially put an end to this requirement despite the ongoing pandemic.\n\nOn Friday, the Golden State ended one of its last major restrictions by no longer requiring students to get vaccinated before attending their on-campus classes, the Associated Press reported.\n\n“This is long overdue. … A lot of families have been stressed from this decision and worried about it for quite some time,” father of three Jonathan Zachreson told the outlet of the requirement’s termination.\n\n“I wish (the California Department of Public Health) would make a bigger statement publicly or (Gov. Gavin) Newsom would make a public statement … to let families know and school districts know that this is no longer going to be an issue for them,” the Roseville resident, who founded the Reopen California Schools group in response to the coronavirus restrictions, added.\n\nThe policy was first executed by Newsom in 2021 at the height of the pandemic. It required the estimated 6.7 million public and private schoolchildren of California to get jabbed against the virus.\n\n“The state already requires that students are vaccinated against viruses that cause measles, mumps and rubella — there’s no reason why we wouldn’t do the same for COVID-19,” Newsom said at the time. “Vaccines work. It’s why California leads the country in preventing school closures and has the lowest case rates.”\n\nHowever, the health crisis has since receded from public consciousness. Most people have also learned to live with the new normal. In addition, though the risk of catching Covid remains, the availability of multiple vaccines has lessened the fears and concerns over the virus.\n\nThe state’s public health department announced that after the termination of the policy, it was no longer exploring emergency rulemaking to add COVID-19 to the list of required vaccinations in schools. However, it still recommends coronavirus immunization for students and school staff so they can stay safe in their classrooms.\n\nLast month, the U.S. Food and Drug Administration (FDA) proposed a change in how the COVID-19 vaccines should be updated. The federal agency wanted to simplify the process by releasing up-to-date Covid vaccines yearly, just like how the flu vaccine gets rolled out annually.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/california-no-longer-requires-covid-19-vaccine-children-attending-schools-467973", "title": "California No Longer Requires COVID-19 Vaccine For Children Attending Schools", "description": "The state has ended one of its last major restrictions for the COVID-19 pandemic.", "image": "https://d.medicaldaily.com/en/full/464798/children-vaccination.jpg", "image:alt": "children vaccination", "image:width": "594", "image:height": "394", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Coronavirus (COVID-19)", "article:published_time": "2023-02-05T23:52:30-05:00", "article:modified_time": "2023-02-05T23:53:52-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://apnews.com/article/education-gavin-newsom-california-health-covid-a9125939e406d78403d9f728ac12b3de", "https://www.gov.ca.gov/2021/10/01/california-becomes-first-state-in-nation-to-announce-covid-19-vaccine-requirements-for-schools/", "https://www.medicaldaily.com/fda-wants-change-how-covid-19-vaccines-are-updated-467823", "/study-narrows-down-long-covid-symptoms-just-7-467924", "/fda-revokes-emergency-use-authorization-covid-drug-ineffective-against-new-467903"], "authors": [], "publish_date": "2023-02-05T23:52:30-05:00"}