{"result_id": "198005", "URL": "https://www.medicaldaily.com/vaccine-fatigue-why-many-people-refuse-covid-19-booster-shots-469247", "timestamp": "2023-04-25 16:20:04 CEST+0200", "meta": {"description": "Researchers explored why many refuse COVID-19 booster shots despite the ongoing pandemic.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/vaccine-fatigue-why-many-people-refuse-covid-19-booster-shots-469247", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Vaccine Fatigue: Why Many Americans Refuse COVID-19 Booster Shots", "cleaned_text": "Americans may have seemingly reached a state of \"vaccine fatigue,\" causing most of them to refuse the vaccine boosters for continued protection against COVID-19.\n\nWhen the U.S. government rolled out the Covid bivalent booster doses last September, public health experts were hopeful that many would grab the chance to stay protected from the virus and its newer Omicron subvariants.\n\nUnfortunately, official data showed that the first bivalent booster was not as well-received as experts had hoped. Only 27.1% of adults and 18.5% of adolescents received the jabs between November and December 2022.\n\nDespite the poor reception, the government is still highly likely to offer another bivalent booster dose since the protection afforded by the first dose has started to wane. But as of late, the U.S. Food and Drug Administration (FDA) is still undecided on the spring booster for COVID-19.\n\nHowever, Americans may already have vaccine fatigue, which the American Medical Association (AMA) defines as \"unwillingness or inaction toward vaccine information or instruction due to perceived burden or burnout.\"\n\nPer the latest data obtained by AMA, only 15.8% of the U.S. population have received the updated bivalent booster shots despite the spread of the highly transmissible XBB.1.5 Omicron subvariant in the country.\n\nOutside the U.S., other countries are experiencing the same phenomenon. A recent study published in the journal Nature Medicine found that the willingness of people to get vaccinated in Austria and Italy was relatively low.\n\nResearchers surveyed 6,357 people in the two European countries. Respondents were asked to rate their \"readiness to get vaccinated\" on a scale of 0 to 10. The average ratings were 5.8 in Italy and 5.3 in Austria.\n\n\"Respondents in both countries reported high levels of pandemic fatigue and showed low to medium levels of trust in parliament and government,\" the study authors wrote, noting that low trust in medical institutions, governments and vaccinations was common among the respondents.\n\nDr. Norman B. Gaylis, the medical director at the Immunotherapy Center of South Florida and long COVID expert, told Fox News Digital that many people have seemingly lost faith in the vaccines for various reasons.\n\n\"Unfortunately, many people believe that COVID is no longer a serious health threat they should be concerned about,\" he pointed out after stating that many lost their trust amid the conflicting viewpoints and controversies surrounding the protection and adverse effects of the vaccine.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/vaccine-fatigue-why-many-people-refuse-covid-19-booster-shots-469247", "title": "Vaccine Fatigue: Why Many Americans Refuse COVID-19 Booster Shots", "description": "Researchers explored why many refuse COVID-19 booster shots despite the ongoing pandemic.", "image": "https://d.medicaldaily.com/en/full/458295/person-receiving-vaccine.jpg", "image:alt": "Person receiving vaccine", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Vaccine refusal", "article:published_time": "2023-03-31T21:09:46-04:00", "article:modified_time": "2023-03-31T21:11:23-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.medicaldaily.com/us-officials-consider-second-bivalent-booster-despite-first-doses-poor-468887", "https://www.medicaldaily.com/fda-still-undecided-spring-covid-boosters-468523", "https://www.ama-assn.org/delivering-care/public-health/how-physicians-can-address-covid-19-vaccine-booster-fatigue", "https://www.nature.com/articles/s41591-023-02282-y", "/do-kids-need-another-covid-19-booster-shot-469245", "/who-shares-new-covid-19-vaccination-guidance-high-risk-people-wait-second-bivalent-boosters-469185", "/fda-still-undecided-spring-covid-boosters-468523", "https://www.foxnews.com/health/covid-vaccine-fatigue-study-explores-many-refusing-booster-shots"], "authors": [], "publish_date": "2023-03-31T21:09:46-04:00"}