{"result_id": "198027", "URL": "https://www.medicaldaily.com/rapid-mutation-helps-rsv-evade-vaccines-468455", "timestamp": "2023-04-25 16:20:11 CEST+0200", "meta": {"description": "The vaccines are already in the final stages of clinical testing.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/rapid-mutation-helps-rsv-evade-vaccines-468455", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Rapid Mutation Helps RSV Evade Vaccines: Study", "cleaned_text": "Several vaccines for the human respiratory syncytial virus (RSV) are currently in the works. But their efficacy could be challenged by one property of the virus that makes it hard to catch.\n\nA recent study published in the journal Virus Evolution found that RSV is capable of evading vaccines because of its ability to rapidly mutate.\n\nRSV is responsible for lower respiratory tract infections among children. However, little is known about its evolution, variation and distribution due to the scarcity of complete genome data.\n\nThe research team decided to focus on the evolutionary dynamics of the virus to understand its spread and genomic variability. The researchers collected nasopharyngeal samples from hospitalized pediatric patients in Buenos Aires, Argentina, who tested positive for RSV from 2014 to 2017.\n\nThe samples were randomly subsampled for complete genome sequencing, leading to one of the largest collections of RSV genomes from a given location published thus far.\n\nIn the four-year course of the sampling, there had been four consecutive outbreaks. RSV-B dominated during the 2014 to 2016 outbreaks at 60%, but RSV-A took over in 2017 when the latter accounted for 90% of cases.\n\nMany do not see RSV as a serious threat since it is only responsible for mild, cold-like symptoms. However, children below six months and immunocompromised people are at risk of dying when they contract the virus.\n\nPreventive measures need to be implemented to hamper RSV fatalities from happening. But so far, there is still no available vaccine for RSV.\n\nSeveral candidates are in the final stages of clinical testing, with the advisory panel of the U.S. Food and Drug Administration (FDA) already recommending the use of two candidates from Pfizer and GSK in older adults.\n\nBut for Suman Das, Ph.D., an associate professor of Medicine in the Division of Infectious Diseases at Vanderbilt University Medical Center, vaccination may not readily solve the problem caused by RSV.\n\n\"Once the vaccine comes, this is the beginning and not the end. If we have the vaccine, the virus will evolve faster. The same thing happened with COVID-19. We need to understand what kind of mutation is happening, and whether (it) will affect the efficacy of the vaccines,” Das, who worked on the recent study, said in a press release.\n\nSince the virus rapidly mutates, it’s more challenging to design and develop vaccines to stop it from spreading. Das and his colleagues are working on sequencing the RSV genome to better understand the diversity and changes in viral genetic code that lead to the production of different RSV strains.\n\nIn another study published last month in the Journal of Virology, Das and other collaborators noticed increased severity of RSV infection in male babies. They also documented a possible link between RSV and asthma.\n\nThe second study concluded that understanding how different RSV genotypes and host factors contribute to the severity of the disease is crucial for the development of effective vaccines.\n\nFor Das and his colleagues, surveillance and sequencing programs should be carried out to ensure that the vaccines being developed could counter the current strains. Should the ones that will be approved later this year fail to cover the newer strains, they can be updated.\n\n“We need to know where the virus is evolving, and how vaccines are driving evolution. We want to be ahead of the game,” Das said.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/rapid-mutation-helps-rsv-evade-vaccines-468455", "title": "Rapid Mutation Helps RSV Evade Vaccines: Study", "description": "The vaccines are already in the final stages of clinical testing.", "image": "https://d.medicaldaily.com/en/full/448133/rsv.jpg", "image:alt": "RSV", "image:width": "1098", "image:height": "858", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "The Grapevine", "article:tag": "Vaccines", "article:published_time": "2023-03-12T22:00:59-04:00", "article:modified_time": "2023-03-12T22:00:59-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://academic.oup.com/ve/article/9/1/vead006/7003417?login=false", "https://www.nbcnews.com/health/health-news/fda-advisers-recommend-first-rsv-vaccine-rcna72535", "https://medicalxpress.com/news/2023-03-rsv-evade-vaccines-rapid-mutation.html", "https://journals.asm.org/doi/10.1128/jvi.01472-22", "/pfizers-rsv-vaccine-rare-neurological-condition-important-potential-risk-jab-468259"], "authors": [], "publish_date": "2023-03-12T22:00:59-04:00"}