{"result_id": "198036", "URL": "https://www.medicaldaily.com/modernas-cancer-vaccine-shows-promise-against-deadliest-skin-cancer-type-469422", "timestamp": "2023-04-25 16:20:14 CEST+0200", "meta": {"description": "The experimental mRNA vaccine works in combination with Merck's immunotherapy to fight melanoma.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/modernas-cancer-vaccine-shows-promise-against-deadliest-skin-cancer-type-469422", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "Moderna's Cancer Vaccine Shows Promise Against Deadliest Skin Cancer Type", "cleaned_text": "A breakthrough vaccine from Moderna could be the answer to the deadliest skin cancer type after showing promise in clinical trials conducted by scientists.\n\nAt a medical meeting on Saturday, researchers presented their study on an experimental mRNA vaccine by Moderna coupled with Merck's blockbuster immunotherapy Keytruda.\n\nAccording to the team, the combination of the vaccine and the therapy cut the risk of death or recurrence of melanoma by 44% compared to using Keytruda alone.\n\n\"From a general cancer therapeutic standpoint, this is a potential major breakthrough,\" Mass General Cancer's melanoma expert Dr. Ryan Sullivan said in a statement obtained by CNBC.\n\nSullivan and his colleagues observed that the mRNA vaccine worked well with Keytruda, which is designed to rev up the immune system. Their combination helped prolong the time patients have without having a recurrence or death.\n\nThe study findings were presented by Dr. Jeffrey Weber of the NYU Langone Perlmutter Cancer Center at the American Association for Cancer Research meeting in Orlando, Florida, this weekend.\n\nThe presentation highlighted that Moderna's cancer vaccine is custom-built. The scientists developed the dose after a thorough analysis of a patient's tumor following surgical removal.\n\nEach vaccine is designed to train the immune system to recognize and target only the specific mutations in cancer cells. For the midstage trial, the team used the combo in participating men and women with a high risk of their melanoma recurring.\n\nThe experiment was not free from side effects. Most of the patients reported fatigue after receiving the vaccine.\n\nModerna and Merck are now discussing with U.S. regulators about moving forward with a late-stage trial. However, the results of larger trials could take three to four years.\n\nEarlier this month, Moderna's chief medical officer, Dr. Paul Burton, revealed in an exclusive interview with The Guardian that the company could likely offer advanced cancer treatments in as little as five years or by the end of the decade.\n\nBurton said Moderna is working on cancer vaccines using mRNA technology that targets different tumor types. He added that the treatments would save millions of lives.\n\nAside from the Moderna/Merck collaboration, BioNTech and Gritstone Bio have also teamed up to develop competing cancer vaccines that also utilize mRNA technology.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/modernas-cancer-vaccine-shows-promise-against-deadliest-skin-cancer-type-469422", "title": "Moderna's Cancer Vaccine Shows Promise Against Deadliest Skin Cancer Type", "description": "The experimental mRNA vaccine works in combination with Merck's immunotherapy to fight melanoma.", "image": "https://d.medicaldaily.com/en/full/266938/fda-approves-badly-needed-duo-drug-combination-therapy.jpg", "image:alt": "FDA Approves Badly Needed Duo Drug Combination Therapy", "image:width": "2500", "image:height": "1844", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Drugs", "article:tag": "Cancer vaccine", "article:published_time": "2023-04-16T23:05:40-04:00", "article:modified_time": "2023-04-16T23:05:40-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cnbc.com/amp/2023/04/16/moderna-cancer-vaccine-with-mercks-keytruda-delays-return-of-deadly-skin-cancer.html", "https://www.medicaldaily.com/cancer-vaccines-hard-obtain-467981", "/skin-cancer-isnt-limited-skin-7-body-parts-where-it-can-develop-469337", "/cancer-heart-disease-vaccines-when-are-they-arriving-469311", "/man-no-symptoms-diagnosed-bowel-cancer-how-recognize-silent-signs-469399", "https://www.medicaldaily.com/cancer-heart-disease-vaccines-when-are-they-arriving-469311"], "authors": [], "publish_date": "2023-04-16T23:05:40-04:00"}