{"result_id": "198018", "URL": "https://www.medicaldaily.com/who-shares-new-covid-19-vaccination-guidance-high-risk-people-wait-second-bivalent-boosters-469185", "timestamp": "2023-04-25 16:20:08 CEST+0200", "meta": {"description": "The organization recommends boosters for high-risk adults 6-12 months after their previous dose.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/who-shares-new-covid-19-vaccination-guidance-high-risk-people-wait-second-bivalent-boosters-469185", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "WHO Shares New COVID-19 Vaccination Guidance As High-Risk People Wait For Second Bivalent Boosters", "cleaned_text": "The World Health Organization (WHO) announced new vaccination guidance as the world continues to grapple with Omicron and its subvariants.\n\nIn a news release Tuesday, the WHO said its Strategic Advisory Group of Experts on Immunization (SAGE) revised the roadmap for prioritizing the use of the vaccines to reflect the impact of omicron alongside the immunity brought about by infection and vaccination.\n\nSAGE's revision focused on prioritizing the protection of populations at the greatest risk of severe infection and death from SARS-CoV-2, the virus responsible for COVID-19.\n\nBased on the new guidance, the organization will now consider the cost-effectiveness of the vaccination for people at low risk, including healthy children and adults. The roadmap also includes updated recommendations on additional booster shots and the spacing of these boosters.\n\n\"Updated to reflect that much of the population is either vaccinated or previously infected with COVID-19, or both, the revised roadmap reemphasizes the importance of vaccinating those still at risk of severe disease, mostly older adults and those with underlying conditions, including with additional boosters,\" SAGE Chair Dr. Hanna Nohynek said in the news release.\n\n\"Countries should consider their specific context in deciding whether to continue vaccinating low-risk groups, like healthy children and adolescents, while not compromising the routine vaccines that are so crucial for the health and well-being of this age group,\" she added.\n\nWith the updated guidance, healthy children, adolescents and adults may no longer need additional booster shots. Only the high-risk adults will get a booster every 6 to 12 months after their last vaccine shot, as per CBC.ca.\n\nThe revised roadmap seemingly coincided with WHO's statement last September that the COVID-19 pandemic could end soon. During Tuesday's briefing, the organization admitted that the new guidance only reflected the current situation; it did not include a long-term plan for annual boosters.\n\nReacting to the new vaccination guidance, Dr. Todd Ellerin, South Shore Health director of infectious diseases, told WCVB that the changes \"make sense,\" and he hopes the U.S. Centers for Disease Control and Prevention (CDC) would follow them too.\n\n\"I think it makes sense for anyone to likely need an annual booster. But again, if you are a young, healthy child, you could make an argument, especially if you are in a resource-limited setting,\" he explained.\n\nEllerin noted that they are still waiting for a formal announcement from the CDC regarding the second bivalent booster. The U.K. and Canada are already rolling out spring boosters for high-risk people, so he is hopeful the U.S. would follow suit.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/who-shares-new-covid-19-vaccination-guidance-high-risk-people-wait-second-bivalent-boosters-469185", "title": "WHO Shares New COVID-19 Vaccination Guidance As High-Risk People Wait For Second Bivalent Boosters", "description": "The organization recommends boosters for high-risk adults 6-12 months after their previous dose.", "image": "https://d.medicaldaily.com/en/full/464549/medical-worker-prepares-moderna-covid-19.jpg", "image:alt": "a-medical-worker-prepares-a-moderna-covid-19", "image:width": "1024", "image:height": "682", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Cdc", "article:published_time": "2023-03-28T19:48:16-04:00", "article:modified_time": "2023-03-28T20:24:53-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.who.int/news/item/28-03-2023-sage-updates-covid-19-vaccination-guidance", "https://www.cbc.ca/news/health/who-covid-booster-recommendations-omicron-1.6793354", "https://www.youtube.com/watch?v=W3NmFZRevfI", "/covid-during-pregnancy-increases-risk-brain-disorders-male-babies-468913", "/nasal-spray-prevents-all-covid-19-virus-variants-infection-468924", "/who-vulnerable-long-covid-age-gender-bmi-deciding-factors-468908"], "authors": [], "publish_date": "2023-03-28T19:48:16-04:00"}