{"result_id": "198044", "URL": "https://www.medicaldaily.com/cdc-reveals-dos-and-donts-covid-19-vaccinated-458612", "timestamp": "2023-04-25 16:20:16 CEST+0200", "meta": {"description": "The CDC has finally released the guidelines many have been waiting for: what life looks like once you’re vaccinated for the coronavirus. It’s a real mix-- some things change, some stay the same, and", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicaldaily.com/cdc-reveals-dos-and-donts-covid-19-vaccinated-458612", "encoding": "utf-8"}, "image": null, "domain": "www.medicaldaily.com", "title": "CDC’s New Do’s and Don’ts for The Vaccinated", "cleaned_text": "The CDC has finally released the guidelines many have been waiting for: what life looks like once you’re vaccinated for the coronavirus. It’s a real mix-- some things change, some stay the same, and some things we still just don’t know. Here’s an overview.\n\nThe new rules apply only once you’re fully vaccinated-- two weeks after your last dose. That’s the second dose for the Pfizer or Moderna vaccines, or the first for Johnson & Johnson’s.\n\nYou can go in, but ...\n\nIndoor gatherings are no longer totally taboo, but you still need to be careful.\n\nMaskless, face-to-face meetups are only okay if everyone present has been fully vaccinated or is otherwise in low-risk categories. The CDC stresses that even vaccinated people should only go maskless around vaccinated or healthy people and recommends that fully vaccinated people only meet with members of one unvaccinated household at a time.\n\nIf, for instance, you’re visiting family, and other people drop by, then it’s time to fall back to the old standards -- put on a mask and stay 6 feet away until it’s just you and your family again.\n\nBasically, nothing changes in public. You still need to mask up, social distance, and avoid crowds. Even if you’ve been vaccinated, there is a chance of catching the virus -- especially with the new variants spreading.\n\nThe CDC still recommends against travel and to avoid medium and large-sized gatherings, so conventions and concerts are still off the menu, at least for now.\n\nYou might be vaccinated, but you can still get sick. So keep a vigilant eye out for symptoms, especially if you’ve been around someone who has Covid-19. If you have symptoms, get tested and isolate until given the all-clear by a doctor.\n\nYou also can’t ignore the rules set out by stores, restaurants or your workplace. A great many people still haven’t been vaccinated, and businesses are able to set their own safety standards.\n\nThree main questions still haven’t been answered: whether vaccines stop people from spreading the virus, how well the vaccines work against new variants, and how long immunity lasts. All three make it too dangerous for people with high-risk factors to risk exposure.\n\nThe virus is still evolving and public health officials are still learning, so none of these guidelines are set in stone. In fact, they’re likely to change as more answers emerge. Stay tuned for the latest news and guidance.", "opengraph": {"type": "article", "site_name": "Medical Daily", "url": "https://www.medicaldaily.com/cdc-reveals-dos-and-donts-covid-19-vaccinated-458612", "title": "CDC’s New Do’s and Don’ts for The Vaccinated", "description": "The CDC has finally released the guidelines many have been waiting for: what life looks like once you’re vaccinated for the coronavirus. It’s a real mix-- some things change, some stay the same, and some things we still just don’t know. Here’s an overview.", "image": "https://d.medicaldaily.com/en/full/458610/nurse-liliana-ocampo-administers-moderna-covid-19.jpg", "image:alt": "nurse-liliana-ocampo-administers-the-moderna-covid-19", "image:width": "1024", "image:height": "626", "article:publisher": "https://www.facebook.com/MedicalDaily/", "article:section": "Covid-19", "article:tag": "Vaccination", "article:published_time": "2021-03-11T19:26:33-05:00", "article:modified_time": "2021-03-11T19:26:33-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated-guidance.html#anchor_1615134468166"], "authors": [], "publish_date": "2021-03-11T19:26:33-05:00"}