{"result_id": "199009", "URL": "https://medicalkidnap.com/2021/04/06/", "timestamp": "2023-04-25 16:20:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/2021/04/06/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "April 6, 2021 - Medical Kidnap", "cleaned_text": "Plandemic: Plans For ‘Vaccine Passports’ Were In Place 20 Months Before COVID-19 Outbreaks\n\nThe rationale currently being used by government bodies and health agencies to prepare the public for COVID-19 \"Vaccine Passports\" is that they are necessary due to the current COVID-19 \"pandemic,\" and that without such passports life cannot return to normal. Of course anyone who is intelligent enough to turn off their corporate media news long enough to search for the truth in regards to these experimental injections that are illegally being called \"vaccines\" will soon learn that Big Pharma and their corporate media puppets are lying to us. They have no intention at all of letting people \"return to normal,\" as these \"vaccine passports,\" if the people comply and allow rules to be implemented to require these passports to be used to participate in society, will just result in even more loss of privacy and greater government over-reach and loss of liberties to further the tyrannical medical police state. People who have already been vaccinated are being told to continue wearing their masks and practicing social distancing, and every day we are reading more and more reports of fully vaccinated people being tested positive for COVID-19. That is, if they survive the shots, as now thousands have died following experimental COVID injections, and hundreds of thousands have been injured, according to multiple government reporting systems around the world tracking adverse reactions following vaccinations. Paul Anthony Taylor, writing for the Dr. Rath Health Foundation, is reporting that the ‘European Commission’ – the executive body of Europe – first published a proposal for vaccine passports on April 26, 2018, and that there was also a ‘Global Vaccination Summit’ hosted in Brussels, Belgium, on September 12, 2019, for vaccine religious zealots, just 36 days before Event 201. If you think I am being facetious for calling attendees to a Global Vaccination Summit \"religious zealots,\" then take a look at the titles of their three round table presentations that the Summit was based on: In Vaccines We Trust - The Magic Of Science - Vaccines Protecting Everyone, Everywhere. Those are statements of faith, not scientific statements. Anyone choosing to get one of these experimental COVID injections and then proudly carrying your ID card to prove your participation, is participating in a religious cult, not in science. For these religious fanatics, those of us who refuse to participate in their cult are labeled as \"vaccine hesitant,\" and we are the \"unbelievers\" that need to be attacked and silenced. This is the new religious persecution of 2021, and these religious zealots are found in all spheres of our society, including many Christian churches which are now becoming \"vaccine clinics.\"", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2021/04/06/plandemic-plans-for-vaccine-passports-were-in-place-20-months-before-covid-19-outbreaks/"], "authors": [], "publish_date": null}