{"result_id": "199054", "URL": "https://medicalkidnap.com/2020/12/18/", "timestamp": "2023-04-25 16:20:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/2020/12/18/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "December 18, 2020 - Medical Kidnap", "cleaned_text": "Moderna Experimental mRNA Vaccine Issued Emergency Use Authorization by the FDA Illegally\n\nAfter an FDA Advisory Committee voted 20 to 0 with one abstention to issue Moderna emergency use authorization (EUA) for their mRNA experimental COVID vaccine, the FDA took their advice today and issued the EUA. As is the case with the Pfizer mRNA experimental vaccine which received an EUA last week, it is important to understand that this vaccine is NOT approved by the FDA. It is only authorized to be used in emergency situations, and the Health Bureaucrats who make these decisions for everyone have already planned to make COVID an \"emergency pandemic\" that apparently will last for more than a year, if not longer. The Advisory Committee that met on Thursday, much like the same Advisory Committee that met last week to give the go-ahead to the Pfizer experimental mRNA COVID vaccine, is entirely comprised of pharmaceutical industry insiders, such as Paul Offit of The Children’s Hospital of Philadelphia who himself is a patent holder of a vaccine in the CDC Childhood Vaccine schedule, and Paula Annunziato, a top executive for Merck pharmaceutical company, a major producer of vaccines. The sole abstention came from Michael Kurilla, who works for the National Institute of Health. He stated: “I abstained because I am uncomfortable with the language. In the midst of a pandemic and with limited vaccine supply available, a blanket statement for individuals 18 and older is just too broad. I’m not convinced that for all of those age groups that the benefits do outweigh the risks. I want to see it more targeted toward people at high risk of serious and life-threatening COVID-19 disease.” The other concern that was allegedly discussed was the fact that three of the trial participants contracted Bell’s palsy, which causes paralysis in the face. The trial group also saw 13 deaths, 6 in the vaccine group, and 7 in the placebo group. There were only 6 deaths total in the Pfizer trials. Nevertheless, the only thing they were voting on for emergency use authorization, was whether or not the potential benefits of the vaccine out-weighed the risks, and not whether or not people were going to be injured and killed by the vaccine, as that just seems to be an acceptable side effect.", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2020/12/18/moderna-experimental-mrna-vaccine-issued-emergency-use-authorization-by-the-fda-illegally/"], "authors": [], "publish_date": null}