{"result_id": "199021", "URL": "https://medicalkidnap.com/2021/02/26/", "timestamp": "2023-04-25 16:20:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/2021/02/26/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "February 26, 2021 - Medical Kidnap", "cleaned_text": "The CDC has done another data dump today into the Vaccine Adverse Event Reporting System (VAERS), a U.S. Government funded database that tracks injuries and deaths caused by vaccines. The data goes through February 18, 2021, with 19,907 recorded adverse events, including 1,095 deaths following injections of the experimental COVID mRNA shots by Pfizer and Moderna. Besides the recorded 1,095 deaths, there were 4,151 visits to Emergency Room doctors, 403 permanent disabilities, and 2,298 hospitalizations. However, there is nothing to worry about, because \"CDC and FDA physicians review each case report of death as soon as notified and CDC requests medical records to further assess reports. A review of available clinical information including death certificates, autopsy, and medical records revealed no evidence that vaccination contributed to patient deaths.\" The UK Government also has a reporting system for COVID vaccine adverse reactions from the Medicines and Healthcare products Regulatory Agency. The UK Government also has a reporting system for COVID vaccine adverse reactions from the Medicines and Healthcare products Regulatory Agency. Their latest report goes through February 25, 2021. They supply three reports: one from experimental Pfizer COVID vaccine, one from the experimental AstraZeneca COVID vaccine, and one where the \"vaccine brand is unspecified.\" Their latest report goes through February 25, 2021. They supply three reports: one from experimental Pfizer COVID vaccine, one from the experimental AstraZeneca COVID vaccine, and one where the \"vaccine brand is unspecified.\" These reports from the UK show 2,414 Blood disorders, 1,989 Cardiac disorders, 1,245 Ear disorders, 2,263 Eye disorders, 21,340 Gastrointestinal disorders, 65,965 General disorders, and 294 deaths. Nothing to worry about here either, as the UK Medicines and Healthcare products Regulatory Agency concludes: \"The overall safety experience with both vaccines is so far as expected from the clinical trials. Based on current experience, the expected benefits of both COVID-19 vaccines in preventing COVID-19 and its serious complications far outweigh any known side effects.\" Don't you feel better now that the vaccines have finally arrived to save the world?", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2021/02/26/cdc-reports-1095-deaths-following-experimental-covid-vaccines-while-uk-government-reports-294-deaths/"], "authors": [], "publish_date": null}