{"result_id": "199003", "URL": "https://medicalkidnap.com/tag/vaccine-hesitancy/", "timestamp": "2023-04-25 16:20:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/tag/vaccine-hesitancy/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "vaccine hesitancy - Medical Kidnap", "cleaned_text": "Bill Gates’ Plan to Use Invisible Ink to Tattoo Vaccination Status into Children’s Skin\n\nKaren Weintraub, writing for the Scientific American, a pro-Pharma and pro-vaccine publication, has just reported that a group of Massachusetts Institute of Technology researchers have just developed a method of embedding a person's vaccination record directly into their skin using a special dye that is invisible to the naked eye. Not only does this technology embed medical information into a person's skin, it will also make vaccine deliveries into the body much easier, so that medical professionals are not even needed to administer the vaccines. Bill Gates is reportedly the one who requested that this technology be developed, and his Bill and Melinda Gates Foundation funded the project. Since this technology will allow anyone to embed medical information directly into a person's skin that can be simply read with a cell phone and an app, privacy issues are certainly legitimate concerns, and the developers of this technology even acknowledge this. \"Vaccine hesitancy\" is now seen as one of the major threats to public health, and is even labeled as a \"mental illness\" that needs to be cured. In January of this year (2019) the World Health Organization (WHO) ranked “vaccine hesitancy” as one of the top “Ten Threats to Global Health in 2019.” While the WHO is mainly funded by membership countries and purchases and delivers vaccines worldwide through member organizations such as the United Nations Children's Fund (UNICEF), the Bill and Melinda Gates foundation contributes more funding for vaccine research and distribution through the Vaccine Alliance GAVI than any single country or other entity, and may even exceed the funding provided by all of them put together. With funding from one of the richest men of the world, and his alliances with Big Pharma and world governments, is it really a \"conspiracy theory\" to state that they want to have worldwide dominance in forcing the world's population to be vaccinated, even if it is against their will? Do we not already see this in progress here in the U.S. where State legislatures are trying to pass new laws to remove vaccine exemptions and force everyone, particularly children, to be injected with the vaccines that they choose? When does the \"conspiracy theory\" stop being a \"theory\" when the facts support the concerted effort to vaccinate everyone on the face of the earth as real, and is no longer a \"theory\"?", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2019/12/19/bill-gates-plan-to-use-invisible-ink-to-tattoo-vaccination-status-into-childrens-skin/"], "authors": [], "publish_date": null}