{"result_id": "199055", "URL": "https://medicalkidnap.com/2020/12/10/", "timestamp": "2023-04-25 16:20:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/2020/12/10/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "December 10, 2020 - Medical Kidnap", "cleaned_text": "CNN: ‘Don’t Be Alarmed’ if People Start Dying After Taking the Vaccine\n\nIn an article on the COVID vaccine rollout, CNN says that Americans shouldn’t be alarmed if people start dying after taking the vaccine because “deaths may occur that won’t necessarily have anything to do with the vaccine.” The advisory appeared in an article titled ‘Why vaccinate our most frail? Odd vote out shows the dilemma’ in which Dr. Kelly Moore, associate director of the Immunization Action Coalition, cautions that vaccines don’t work as well on the frail and elderly compared to healthy people. “When shots begin to go into arms of residents, Moore said Americans need to understand that deaths may occur that won’t necessarily have anything to do with the vaccine,” states the report. “We would not at all be surprised to see, coincidentally, vaccination happening and then having someone pass away a short time after they receive a vaccine, not because it has anything to do with the vaccination but just because that’s the place where people at the end of their lives reside,” Moore said. She then said Americans shouldn’t be alarmed to see people dying a day or two after receiving the COVID vaccination. “One of the things we want to make sure people understand is that they should not be unnecessarily alarmed if there are reports, once we start vaccinating, of someone or multiple people dying within a day or two of their vaccination who are residents of a long-term care facility. That would be something we would expect, as a normal occurrence, because people die frequently in nursing homes.”", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2020/12/10/cnn-dont-be-alarmed-if-people-start-dying-after-taking-the-vaccine/"], "authors": [], "publish_date": null}