{"result_id": "199043", "URL": "https://medicalkidnap.com/tag/dr-christiane-northrup/", "timestamp": "2023-04-25 16:20:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/tag/dr-christiane-northrup/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "Dr. Christiane Northrup - Medical Kidnap", "cleaned_text": "Vaxxed film director Polly Tomney interviewed Dr. Christiane Northrup a few weeks ago about the new planned COVID vaccines. Dr. Northrup is apparently a target of the Big Tech and Big Pharma censors, as Polly states at the beginning of the interview they had decided NOT to announce this interview in advance in hopes of getting it out to the public more before it was taken down. It is a hard interview to find online, but we found a copy, and we have published the first half of the interview that deals specifically with the COVID vaccines in the pipeline. Please note that there are literally hundreds of new COVID vaccines in the pipeline, and that Dr. Northrup is discussing the \"worst case\" scenarios here, specifically for the new class of DNA COVID vaccines that are being developed with nanotechnology. So while the first vaccines that are distributed may not have all the aspects that Dr. Northrup discusses here (although they may!), everything she discusses is backed up by facts that are easily referenced and verifiable, such as specific patents and technologies that are already being developed. This is part of the transhumanism agenda, which itself is very well documented, including here at Health Impact News. The technology now exists to have complete control over individuals by injecting them with these nano-particles, where they can monitor everyone's activity from what you ate that day, to whom you slept with, everywhere you go, and so much more. And that's if you survive horrible side effects of the vaccine. Doctors like Dr. Northrup and Dr. Igor Shepherd, whom we featured in yesterday's article, are putting their careers and even their lives on the line to get this information out to the public. That's how important this information is!", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2020/12/01/dr-northrup-discusses-worst-case-scenarios-with-new-covid-vaccine-dangers/"], "authors": [], "publish_date": null}