{"result_id": "199031", "URL": "https://medicalkidnap.com/2021/", "timestamp": "2023-04-25 16:20:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/2021/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "2021 - Medical Kidnap", "cleaned_text": "California Nurses Blow Whistle on “Overwhelming” Numbers of Heart Attacks, Clotting, Strokes as Doctors Refuse to Blame Vaccines for Fear of Losing Their Medical License\n\nIn October this year we re-published an article from The Conejo Guardian, a nonprofit independent news publication in Ventura County, California. In that article they reported that the remaining unvaccinated staff in the hospitals were the only ones telling the truth about the volume of people coming into the hospital suffering from side effects of the COVID-19 experimental shots. “They don’t want to report that they’re seeing 80 percent of the people in the ER are vaccinated, but only 40 percent of the county is vaccinated,” one nurse stated. The Conejo Guardian has now published a follow-up article with a couple of nurses, including one vaccinated nurse who has received two doses of the experimental shots but says he will NOT get any of the boosters, and that he and his wife have decided to leave the State of California once their child reaches school age, as they do not believe children should be injected with these shots. These nurses have come forward to report the rise in unexplained heart problems, strokes and blood clotting in local vaccinated patient populations. They also say doctors refuse to consider that these could be adverse reactions to COVID shots. These nurses also report that conditions in the hospitals right now are so bad that they are in \"survival mode,\" as there are not enough staff to handle the influx of these vaccine-injured patients, and they are thrusting new nurses into these situations with very little training, making the situation even worse. So while many of the ethical nurses and hospital staff who refused to get injected with the bioweapon shots have now been fired or have quit, it appears that vaccinated nurses and staff that remain are starting to wake up also, and many of them may soon be leaving the medical system as well as they do not want to get never-ending booster injections and work in these over-crowded workplaces where they can clearly see that the majority of the patients are suffering from the side effects of the shots.", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2021/12/27/california-nurses-blow-whistle-on-overwhelming-numbers-of-heart-attacks-clotting-strokes-as-doctors-refuse-to-blame-vaccines-for-fear-of-losing-their-medical-license/"], "authors": [], "publish_date": null}