{"result_id": "199022", "URL": "https://medicalkidnap.com/tag/covid-vaccine-death/", "timestamp": "2023-04-25 16:20:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/tag/covid-vaccine-death/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "covid vaccine death - Medical Kidnap", "cleaned_text": "Traffic Accidents and Deaths Soar in 2021 Following Roll-out of COVID-19 “Vaccines”\n\nThe National Highway Traffic Safety Administration (NHTSA) recently released its annual study of crashes on U.S. roads for 2021, and found that \"The total number of accidents rose by an astonishing 16%.\" This was \"astonishing\" because: \"That was a year of COVID-19 lockdowns and travel restrictions, when police groups nationwide reported that the smaller number of drivers on America’s roads were acting more recklessly than normal.\" What do analysts say was the cause of this \"astonishing\" increase in traffic accidents in 2021? They say it was due to too many drivers speeding, driving while drunk, and texting too much. COVID-19 injections, of course, are never even considered, because that would be politically incorrect to blame the emergency-use authorized experimental shots for an increase in traffic accidents. However, \"Road Traffic Accident\" is a \"symptom\" tracked following vaccines in the U.S. Government's Vaccine Adverse Events Reporting System (VAERS), so let's see what was reported for 2021, as compared to the previous 10 years following vaccines before the experimental COVID shots were approved. In 2021, there were 356 cases filed in VAERS of Road traffic accidents following COVID-19 shots, including 33 deaths, 21 permanent disabilities, 100 ER visits, and 165 hospitalizations. By contrast, following all FDA-approved vaccines for a 10-year period from 2010 through 2019, before the experimental COVID shots were authorized, there were 70 total cases filed for Road traffic accidents, including 5 deaths, 6 permanent disabilities, 39 trips to the ER, and 19 total hospitalizations during a 10-year period following ALL vaccines. That's an increase of almost 5,000% in Road traffic accidents for 2021, and a 6,500% increase in traffic deaths for 2021, when the COVID-19 experimental shots were being injected into Americans, as compared to all FDA-approved vaccines from the previous 10 years.", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2023/04/10/traffic-accidents-and-deaths-soar-in-2021-following-roll-out-of-covid-19-vaccines/"], "authors": [], "publish_date": null}