{"result_id": "199028", "URL": "https://medicalkidnap.com/tag/ectopic-pregnancy/", "timestamp": "2023-04-25 16:20:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/tag/ectopic-pregnancy/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "ectopic pregnancy - Medical Kidnap", "cleaned_text": "VAERS Data Reveals 50 X More Ectopic Pregnancies Following COVID Shots than Following ALL Vaccines for Past 30 Years\n\nThe carnage of deaths to unborn babies following COVID-19 shots into pregnant women just gets worse the more we investigate it. While we reported on Saturday that the latest data dump into the government's Vaccine Adverse Event Reporting System (VAERS) showed 2,620 fetal deaths, which are more fetal deaths than are reported following ALL vaccines for the past 30 years in VAERS, one \"symptom\" that is tracked in VAERS that I did not account for, is an ectopic pregnancy which also results in a fetal death. WebMD defines \"ectopic pregnancy\": \"Ectopic pregnancy, also called extrauterine pregnancy, is when a fertilized egg grows outside a woman’s uterus, somewhere else in their belly. It can cause life-threatening bleeding and needs medical care right away. In more than 90% of cases, the egg implants in a fallopian tube. This is called a tubal pregnancy. Because a fertilized egg can’t survive outside a uterus, your doctor will need to take it out so you don’t have serious health problems. They’ll use one of two methods: medication or surgery.\" I performed a search in VAERS for ectopic pregnancies following COVID-19 shots for the past 11 months, and there have been 52 cases where a woman received a COVID-19 shot and then was found to have an ectopic pregnancy. Next, I performed the exact same search but excluded COVID-19 \"vaccines\" and it returned a result of 30 cases where a woman received an FDA-approved vaccine and then reported an ectopic pregnancy following ALL vaccines for the past 30+ years, which is about 1 per year. That means that following COVID-19 injections into child-bearing women for the past 11 months has seen a 50 X increase in ectopic pregnancies compared to child-bearing women receiving vaccines for the past 30+ years. And if I and anyone else with Internet access can perform these searches in the government owned data in VAERS, you can be certain that the FDA and CDC can too, and that they are aware of these risks. This is criminal. This is nothing more than barbaric forced sterilization, which was once legal in the U.S., but was later outlawed as part of the eugenics movement that valued certain human beings over others, and is part of Nazism. We are seeing many examples of these fetal deaths being reported, and we have published a lot of those, but here are some more as these reports continue to flood in.", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2021/11/22/vaers-data-reveals-50-x-more-ectopic-pregnancies-following-covid-shots-than-following-all-vaccines-for-past-30-years/"], "authors": [], "publish_date": null}