{"result_id": "199049", "URL": "https://medicalkidnap.com/tag/hpv-vaccine/", "timestamp": "2023-04-25 16:20:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/tag/hpv-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "HPV vaccine - Medical Kidnap", "cleaned_text": "Merck’s Gardasil Vaccine Continues to Kill and Maim Young Girls as Two New Lawsuits are Filed\n\nPrior to 2020 and the COVID Scam, the #1 most-read topic on the Health Impact News network, by far, was the Gardasil HPV vaccine, and the carnage this vaccine has caused in the U.S., and around the world. If you type in \"Gardasil\" into the search feature of Health Impact News, you will get a result of 475 articles we have published on this topic. Just one article, the story of Katie Robinson, as told by her mother and originally published on Sanevax.org, is the most-read article ever published on Health Impact News, having been read by many millions of people and shared over a million times on Facebook. Gardasil is back in the news this week, as Judicial Watch has reported on two new lawsuits filed against Merck by plaintiffs who were young teenage girls when they received the vaccines. Under U.S. law, vaccines approved by the FDA and part of the CDC recommended vaccine schedule for children are covered by the National Vaccine Injury Compensation Program, where the manufacturer of the vaccine cannot be sued. You have to sue the U.S. Government in their special \"Vaccine Court.\" So the lawsuits against Merck, as the manufacturer of the vaccine, are limited to the fraud that was committed in bringing the product to market for FDA approval. And the evidence that Merck committed fraud in bringing Gardasil to market, along with the FDA and CDC committing fraud in approving it, is overwhelming.", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2022/04/01/mercks-gardasil-vaccine-continues-to-kill-and-maim-young-girls-as-two-new-lawsuits-are-filed/"], "authors": [], "publish_date": null}