{"result_id": "199011", "URL": "https://medicalkidnap.com/2021/05/", "timestamp": "2023-04-27 13:56:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/2021/05/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "May, 2021 - Medical Kidnap", "cleaned_text": "Renowned Texas Professor and Doctor: COVID-19 Shots are “Bioweapons thrust upon the Public!”\n\nAuthor John Leake recently interviewed Dr. Peter McCullough in Dallas. YouTube phenom Austen Fletcher, known online as \"Fleccas Talks,\" has done a masterful job in post-production by summarizing the 1 hour and 45 minutes interview down to less than 17 minutes. Dr. McCullough is pro-vaccine, and in the beginning he did administer the COVID-19 shots to some of his patients. But now he states: \"Based on the safety data now, I can no longer recommend it.\" If you have watched any of the previous interviews we have published with Dr. McCullough, you will see that this man appears to be an honest physician who truly wants to help his patients, and therefore has apparently not bought into the whole spirit behind the implementation of the New World Order by the Luciferians who have no regard for human life at all. Dr. McCullough was a leader among the physicians who developed early treatments for whatever COVID-19 is, using simple, older drugs with a long history of safety, and as a result he saved many lives. He was the lead author on a major published study on the use of these older drugs, and when he put up a YouTube video about the study to help people, he was shocked that it was removed. He knew then that something nefarious was happening worldwide. In this most recent interview, one can observe that he is doing his own research now, and he even quotes some people in the alternative media, which shows he is making the effort to get around censorship in the corporate media and Big Tech to learn the truth. This is the first time, to my knowledge, that he referred to the COVID-19 shots as \"bioweapons.\" He also uses the term \"Globalists\": \"This is what Globalists have been waiting for. They've been waiting for a way of marking people. That if you get the vaccine, you're marked in a database. And this can be used for trade, for commerce, for behavior modification - all different purposes.\" He also states: \"Here, in the United States, we have 100 million people vaccinated (with the COVID-19 bioweapon shots so far). This is far and away the most lethal, toxic, biologic agent ever injected into a human body in American history.\" This man is obviously risking his career and life to bring this information to the public.", "opengraph": {}, "tags": ["Headline", "News"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2021/05/31/renowned-texas-professor-and-doctor-covid-19-shots-are-bioweapons-thrust-upon-the-public/"], "authors": [], "publish_date": null}