{"result_id": "199048", "URL": "https://medicalkidnap.com/2021/10/05/", "timestamp": "2023-04-25 16:20:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/2021/10/05/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "October 5, 2021 - Medical Kidnap", "cleaned_text": "BOMBSHELL: Video Emerges Where Fauci and Others Planned for a “Universal mRNA Flu Vaccine” Which Became the “COVID-19 mRNA Vaccine” Because People were not Afraid Enough of the Flu Virus\n\nLast night Alex Jones of Infowars.com did a special broadcast regarding an October, 2019 video that they had just become aware of that was a panel discussion hosted by the Milken Institute discussing the need for a Universal Flu Vaccine. The video clip that they played of this event was a 1 minute and 51 second dialogue between the moderator, Michael Specter, a journalist who is a New Yorker staff writer and also an adjunct professor of bioengineering at Stanford University, Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, and Rick Bright, the director of HHS Biomedical Advanced Research and Development Authority (BARDA). In this short clip, which was extracted from the hour-long panel discussion, Anthony Fauci explains that bringing a new, untested kind of vaccine like an mRNA vaccine, would take at least a decade (\"if everything goes perfectly\") to go through proper trials and be approved by the FDA. He would know, because he had been trying to do it for about a decade already by then (October, 2019), trying to develop an mRNA based vaccine for HIV. But now they were discussing something much bigger than just a vaccine for AIDS patients. They are talking about a \"Universal Flu Vaccine\" that everyone would have to take - a huge market for Big Pharma! Rick Bright, the director of HHS Biomedical Advanced Research and Development Authority (BARDA), then speaks and states that what could happen is that \"an entity of excitement that is completely disruptive and is not beholden to bureaucratic strings and processes\" could change that. I have found the full 1 hour panel discussion and uploaded it to our video channels. In short, this panel discussion focused on what they perceived as the need for a universal flu vaccine, but they admitted that the old way of producing vaccines was not sufficient for their purposes, and that they needed some kind of global event where many people were dying to be able to roll out a new mRNA vaccine to be tested on the public. They all agreed that the annual flu virus was not scary enough to create an event that would convince people to get a universal vaccine. And as we now know today, about 2 years after this event, that \"terrifying virus\" that was introduced was the COVID-19 Sars virus. And so now we know why the flu just \"disappeared\" in the 2020-21 flu season. It was simply replaced by COVID-19, in a worldwide cleverly planned \"pandemic\" to roll out the world's first universal mRNA vaccines. This was always the goal, and previous efforts through various influenzas, AIDS, Ebola, and other \"viruses\" were all unsuccessful in leading to the development of a universal vaccine to inject into the entire world's population.", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2021/10/05/bombshell-video-emerges-where-fauci-and-others-planned-for-a-universal-mrna-flu-vaccine-which-became-the-covid-19-mrna-vaccine-because-people-were-not-afraid-enough-of-the-flu-virus/"], "authors": [], "publish_date": null}