{"result_id": "199038", "URL": "https://medicalkidnap.com/tag/fake-news/", "timestamp": "2023-04-25 16:20:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/7/2014/10/medicalkidnap-fav.png", "canonical": "https://medicalkidnap.com/tag/fake-news/", "encoding": "utf-8"}, "image": null, "domain": "medicalkidnap.com", "title": "fake news - Medical Kidnap", "cleaned_text": "Health Impact News was recently contacted by John Gregory, a medical reporter working for the company NewsGuard, a self-appointed Internet policing group that awards \"nutrition badge\" ratings for websites determining if they are \"reliable\" or not. Mr. Gregory accused me right up front of publishing \"false\" claims, and asked me to comment on a list of articles in our network that he determined were \"false.\" Curiously, one of the articles he chose to exhibit as something published that was \"false\" was one of our articles on the Department of Justice quarterly reports on compensated cases for vaccine injuries and deaths in the U.S. Vaccine Court, submitted every three months to the federal government Advisory Commission on Childhood Vaccines (ACCV) under the U.S. Department of Health and Human Services. The article is reporting what is public information from government sources. When they gave Health Impact News a negative rating, they even gave a negative rating to Created4Health.org, which is not even a news site but a site where I publish my devotional articles based on Bible studies. They also gave a negative rating to MedicalKidnap.com. Mr Gregory accused us of simply taking unverified social media posts from parents who claimed their children were being kidnapped by the state, and asked us if we even bothered to verify their stories. There is strong evidence that NewsGuard is comprised of \"old-school journalists\" who represent corporate interests, and are doing everything they can to squelch free speech on the Internet, especially in social media platforms. Health Impact News provides a free service to the public that often is seldom found elsewhere, and that is especially true with our Medical Kidnapping stories, where we are one of the few places parents can come to and find a platform to tell the world what is happening to America's children who are being kidnapped by the State, and often end up being sexually trafficked. What a shame it would be if the corporate censorship forces get their way. What can you do to fight corporate censorship?", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://medicalkidnap.com/2019/08/27/self-appointed-internet-police-declare-medicalkidnap-com-and-doj-vaccine-court-reports-fake-news/"], "authors": [], "publish_date": null}