{"result_id": "200022", "URL": "https://www.medicalmedium.com/blog/medical-medium-heavy-metal-detox-smoothie", "timestamp": "2023-04-25 16:21:11 CEST+0200", "meta": {"description": "Medical Medium Medical Medium Heavy Metal Detox Smoothie :", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/medical-medium-heavy-metal-detox-smoothie", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Medical Medium Heavy Metal Detox Smoothie", "cleaned_text": "We are all exposed to toxic heavy metals today. Many people also come into this world with toxic heavy metals such as mercury they inherited through their family line. Toxic heavy metals can cause or contribute to countless health symptoms and conditions.\n\nEnjoy this delicious smoothie daily to help safely and effectively remove heavy metals out of your brain and body.\n\nCombine the bananas, blueberries, cilantro, barley grass juice powder, spirulina, and dulse with the juice of one orange in a high-speed blender and blend until smooth. Add up to 1 cup of water if a thinner consistency is desired. Serve and enjoy!\n\nWild blueberries: Draw heavy metals out of your brain tissue, healing and repairing any gaps created by oxidation when the heavy metals are removed. The potent antioxidants in wild blueberries help reverse any oxidative damage left behind by the heavy metal removal.\n\nBarley grass juice extract powder: Has the ability to draw heavy metals out of your spleen, intestinal tract, pancreas, thyroid, and reproductive system. Barley grass juice extract prepares mercury for complete absorption by spirulina.\n\nSpirulina: Draws out heavy metals from your brain, central nervous system, and liver, and soaks up heavy metals extracted by barley grass juice extract powder.\n\nCilantro: Goes deep into hard-to-reach places, extracting metals from yesteryear.\n\nAtlantic dulse: Binds to mercury, lead, aluminum, copper, cadmium, and nickel. Atlantic dulse goes into deep, hidden places of the digestive tract and gut, seeking out mercury, binding to it, and never releasing it until it leaves the body. Atlantic dulse also serves as emergency backup, helping ensure that all the heavy metals that make it as far as the colon actually leave the body.\n\nFind out more about how to heal from hundreds of symptoms and conditions in Medical Medium Liver Rescue\n\nThe information provided on this Site is for general informational purposes only, to include blog postings and any linked material. The information is not intended to be a substitute for professional health or medical advice or treatment, nor should it be relied upon for the diagnosis, prevention, or treatment of any health consideration. Consult with a licensed health care practitioner before altering or discontinuing any medications, treatment or care, or starting any diet, exercise or supplementation program. Neither Anthony William nor Anthony William, Inc. (AWI) is a licensed medical doctor or other formally licensed health care practitioner or provider. The content of this blog and any linked material does not necessarily reflect the opinions of Anthony William, AWI or the principal author, and is not guaranteed to be correct, complete, or up to date.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/m-m-heavy-metal-detox-smoothie.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/medical-medium-heavy-metal-detox-smoothie", "author": "https://www.facebook.com/medicalmedium", "title": "Medical Medium Heavy Metal Detox Smoothie ", "description": "Medical Medium: Medical Medium Heavy Metal Detox Smoothie   - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://wymans.com/product/blueberries/wild-blueberries", "https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/barleygrass-juice", "https://amzn.to/3J6VN8H", "https://wymans.com/product/blueberries/wild-blueberries", "https://vimergy.com/products/barleygrass-juice", "https://vimergy.com/products/usa-grown-spirulina", "https://amzn.to/3J6VN8H", "http://amzn.to/2DjQjE9", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}