{"result_id": "200009", "URL": "https://www.medicalmedium.com/blog/medical-medium-heavy-metal-detox-cleanse", "timestamp": "2023-04-25 16:21:06 CEST+0200", "meta": {"description": "Medical Medium Medical Medium Heavy Metal Detox Cleanse:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/medical-medium-heavy-metal-detox-cleanse", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Medical Medium Heavy Metal Detox Cleanse", "cleaned_text": "The Medical Medium Heavy Metal Detox Cleanse from the New York Times best-selling book, Medical Medium Cleanse to Heal: Healing Plans for Sufferers of Anxiety, Depression, Acne, Eczema, Lyme, Gut Problems, Brain Fog, Weight Issues, Migraines, Bloating, Vertigo, Psoriasis, Cysts, Fatigue, PCOS, Fibroids, UTI, Endometriosis & Autoimmune, removes toxic heavy metals such as mercury, aluminum, and copper from the brain and body. These metals cause or are partly responsible for many symptoms and conditions, including ADHD, autism, eczema, migraines, brain fog, memory issues, anxiety, depression, bipolar disorder, and many more.\n\nWe’re all exposed to metals every day, through sources such as air fresheners, tattoo ink, scented candles, colognes, perfumes, fabric softener, toothpaste, coffee or tea from a coffee shop, tap water, pots and pans at restaurants, aluminum cans, and the air we breathe–just to name a few. It’s impossible to avoid them all in our daily life, let alone those we were born with or those we’ve been exposed to in the past that haven’t left our bodies. Toxic heavy metals don’t just naturally leave the body–they have to be removed with the right combination of foods that grab onto them and draw them out of the body safely and effectively. The Medical Medium Heavy Metal Detox Cleanse in Cleanse To Heal is specifically designed to help us get these pernicious troublemakers out of our bodies. It’s important to read the full details about the cleanse in Cleanse To Heal to ensure you do it correctly.\n\nEvery day for three months, or ideally six months, a year, or longer, you can follow this protocol:\n\n1. Drink 16 to 32oz of lemon or lime water upon waking. Wait at least 15 to 30 minutes, then:\n\n2. Drink 16 to 32oz of celery juice on an empty stomach. Wait at least 15 to 30 minutes, then:\n\n3. Drink the Medical Medium Heavy Metal Detox Smoothie or eat the right amounts of the five heavy metal detox ingredients separately:\n\n2 cups of frozen or fresh wild blueberries or 2 tablespoons powdered wild blueberries or 2 to 4 ounces of wild blueberry juice\n\n4. Snack on apples as desired until lunchtime.\n\n5. For even better results, you have the option to remove the troublemaker foods listed in Chapter 7 of Cleanse To Heal.\n\nEach of these steps are outlined in detail in Cleanse To Heal.\n\nThe information provided on this Site is for general informational purposes only, to include blog postings and any linked material. The information is not intended to be a substitute for professional health or medical advice or treatment, nor should it be relied upon for the diagnosis, prevention, or treatment of any health consideration. Consult with a licensed health care practitioner before altering or discontinuing any medications, treatment or care, or starting any diet, exercise or supplementation program. Neither Anthony William nor Anthony William, Inc. (AWI) is a licensed medical doctor or other formally licensed health care practitioner or provider. The content of this blog and any linked material does not necessarily reflect the opinions of Anthony William, AWI or the principal author, and is not guaranteed to be correct, complete, or up to date.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/medical-medium-heavy-metal-cleanse.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/medical-medium-heavy-metal-detox-cleanse", "author": "https://www.facebook.com/medicalmedium", "title": "Medical Medium Heavy Metal Detox Cleanse", "description": "Medical Medium: Medical Medium Heavy Metal Detox Cleanse  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://amzn.to/38mezp6", "https://amzn.to/38mezp6", "https://www.medicalmedium.com/blog/heavy-metal-detox-smoothie", "https://vimergy.com/products/wild-blueberry", "https://shop.wymans.com/", "https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/barleygrass-juice", "https://amzn.to/2HJKKr3", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}