{"result_id": "200008", "URL": "https://www.medicalmedium.com/blog/heavy-metal-detox-smoothie", "timestamp": "2023-04-25 16:21:05 CEST+0200", "meta": {"description": "Medical Medium Heavy Metal Detox Smoothie:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/heavy-metal-detox-smoothie", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Heavy Metal Detox Smoothie", "cleaned_text": "This smoothie is not only delicious, it's also perfectly designed to include five key ingredients that work together in synergy to pull heavy metals like mercury, lead, aluminum, nickel, copper, and cadmium out of your organs where they accumulate.\n\nToxic heavy metals are virtually everywhere, and are present in things we come in contact with every day, such as aluminum cans and aluminum foil, batteries, metal cookware, old paint, and even the foods we eat. For instance, pesticides and herbicides (which are hard to completely avoid even on a strict organic diet), are a common source of heavy metals. As a result, most of us are carrying around heavy metals that have been with us for almost our whole lives and which have burrowed deep inside our tissues.\n\nUnfortunately, it is these “old” metals, the ones that have been lurking in our system for prolonged periods of time, that pose the greatest threat. For example, over time toxic heavy metals can oxidize, causing damage to surrounding tissue and promoting inflammation. They literally poison our bodies, and can inflict damage on virtually every system and organ, including our brain, liver, digestive system, and other parts of our nervous system. Toxic heavy metals put an immense burden on our immune system, leaving us vulnerable to a variety of illnesses.\n\nWhile toxins of every kind are harmful, heavy metals pose a unique threat. Not only are they damaging in their own right, they are also a form of neurotoxin (a poison that disrupts nerve function and confuses your immune system). Heavy metal neurotoxins can inflame and irritate our central nervous system (especially our brain), causing multiple symptoms such as memory loss, brain fog, fatigue, and depression. Toxic heavy metals can also promote inflammation in the digestive tract, releasing poisons into our gut as well. As if this isn’t bad enough, heavy metals also serve as a source of food for viruses, bacteria, parasites, and other pathogens in our body.\n\nFor example, heavy metals can serve as a feeding ground for Streptococcus A or B, E. coli, C. difficile, H. pylori, and yeast cells. This can create an overgrowth of multiple bacteria in our gut, resulting in a condition known as SIBO (small intestinal bacterial overgrowth), which is characterized by bloating, abdominal pain, diarrhea, constipation (or both), and can lead to nutrient deficiencies. Additionally, when viruses such as Epstein-Barr and shingles feed off toxic heavy metals, this can produce symptoms such as tingling, numbness, fatigue, anxiety, heart palpitations, ringing in the ears, dizziness and vertigo, as well as neck pain, knee pain, foot pain, pain in the back of the head, and a variety of other aches and pains that are often attributed to other causes.\n\nIt's virtually impossible not to take in a certain amount of these toxic heavy metals in our modern era, so it's vitally important to our health that we get them out before they can wreak further havoc on our health. Thankfully, it's relatively simple to remove them from our organs if we consume the right foods to do so. Adding the following all-star team of foods to your diet and being diligent in your efforts to consume them will go a long way toward ridding your body of heavy metals:\n\nSpirulina: This edible blue-green algae draws out heavy metals from your brain, central nervous system, and liver, and soaks up heavy metals extracted by barley grass juice extract powder. Take 2 teaspoons mixed in water, coconut water, or juice.\n\nBarley grass juice powder: prepares the mercury for complete absorption by the spirulina. This nutritive grass has the ability to draw heavy metals out of your spleen, intestinal tract, pancreas, thyroid, and reproductive system. Drink 1-2 teaspoons mixed into coconut water or juice.\n\nCilantro: Goes deep into hard-to-reach places, extracting metals from yesteryear (so it’s great for that mercury inheritance you’re carrying around!). Blend one cup in a smoothie or juice, or add to salad or guacamole.\n\nWild blueberries: Draw heavy metals out of your brain tissue, healing and repairing any gaps created by oxidation when the heavy metals are removed. It is important to use wild blueberries, as they possess unique phytonutrients with special detoxifying capabilities. The potent antioxidants in wild blueberries help reverse any oxidative damage left behind by the heavy metal removal. This is especially important for your brain tissue—in fact, wild blueberries are the most powerful food for halting or in some cases reversing Alzheimer’s and dementia. Eat at least one cup daily. Note: while cultivated blueberries are nutritious, they lack the metal-drawing ability of the wild blueberries. Wild blueberries can be found in the freezer section of most supermarkets.\n\nAtlantic dulse: In addition to mercury, this edible seaweed binds to lead, aluminum, copper, cadmium, and nickel. Unlike other seaweeds, Atlantic dulse is a powerful force for removing mercury on its own. Atlantic dulse goes into deep, hidden places of the digestive tract and gut, seeking out mercury, binding to it, and never releasing it until it leaves the body. Eat two tablespoons of flakes daily, or an equal amount of strips if it’s in whole-leaf form. Note: As it comes from the ocean, if you are concerned about the dulse itself having mercury, be aware that Atlantic sea dulse will not release any mercury it might possess into the body. It holds on to the mercury as it works its way through, and even grabs onto other metals along the way and drives them out as well. Atlantic dulse is a critical part of the team because it can hang out near the finish line (i.e., our colon), waiting for the other foods that have been grabbing on to heavy metals along the way. It serves as emergency backup, helping ensure that all the heavy metals that made it as far as the colon actually leave the body.\n\nToday's smoothie recipe gives you a simple and tasty way to get all of these five foods into your daily diet in just one go. Drink this smoothie daily for optimal benefits.\n• Optional: water or coconut water or fresh orange juice to blend\n\nIn a high speed blender, blend all ingredients until smooth. If a thinner consistency is desired, add up to 1 cup of water. Enjoy\n\nThe information provided on this Site is for general informational purposes only, to include blog postings and any linked material. The information is not intended to be a substitute for professional health or medical advice or treatment, nor should it be relied upon for the diagnosis, prevention, or treatment of any health consideration. Consult with a licensed health care practitioner before altering or discontinuing any medications, treatment or care, or starting any diet, exercise or supplementation program. Neither Anthony William nor Anthony William, Inc. (AWI) is a licensed medical doctor or other formally licensed health care practitioner or provider. The content of this blog and any linked material does not necessarily reflect the opinions of Anthony William, AWI or the principal author, and is not guaranteed to be correct, complete, or up to date.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/heavy-metal-detox-smoothie-recipe.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/heavy-metal-detox-smoothie", "author": "https://www.facebook.com/medicalmedium", "title": "Heavy Metal Detox Smoothie", "description": "Medical Medium: Heavy Metal Detox Smoothie  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": null, "embed_code": "<iframe class=\"embed-responsive-item\" src=\"https://www.youtube.com/embed/-Ze2cUQck74\"/>", "src": "https://www.youtube.com/embed/-Ze2cUQck74"}], "links": ["https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/barleygrass-juice", "https://amzn.to/3J6VN8H", "https://amzn.to/3UTTnz1", "https://vimergy.com/products/barleygrass-juice", "https://vimergy.com/products/barleygrass-juice", "https://vimergy.com/products/usa-grown-spirulina", "https://amzn.to/3J6VN8H", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}