{"result_id": "200021", "URL": "https://www.medicalmedium.com/blog/broccoli-cheese-quesadillas", "timestamp": "2023-04-25 16:21:11 CEST+0200", "meta": {"description": "Medical Medium Broccoli Cheese Quesadillas:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/broccoli-cheese-quesadillas", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Broccoli Cheese Quesadillas", "cleaned_text": "Gooey, cheesy, broccoli cheese quesadillas without the dairy! These yummy quesadillas are low in fat too, which makes them a better choice for healing. You can use the Medical Medium Potato Tortillas recipe or use a brand you like that is grain- and corn-free. These are a great choice for the little ones in your life, too!\n\nPotatoes: Abundant in amino acids that specifically inhibit viral growth. Potatoes are high in glucose that provides substance to the liver, as it’s precisely what the liver relies on to keep strong. It also helps build up glycogen storage, the very resource that protects us against blood sugar problems, weight gain, fatty liver, and dirty blood syndrome.\n• Potato Tortillas (or use another grain-free and corn-free tortilla of choice)\n\nCheese recipe (sub with Nacho Cheese if you wish):\n\nSteam the chopped broccoli until cooked. Place in a medium-sized bowl and add the lemon juice and sea salt (if using). Set aside.\n\nTo make the cheese sauce, place the unsweetened almond milk, arrowroot, onion powder, garlic powder, paprika, turmeric, lemon juice, coconut aminos (if using) and sea salt (if using) in a small saucepan. Stir with a whisk until uniform.\n\nPlace the saucepan on medium-high heat and bring to a boil. Reduce the heat to a simmer and cook, stirring often, until the mixture thickens - about 1-2 minutes. Remove from heat and set aside.\n\nPlace a tortilla on a non-stick skillet and add a layer of cheese sauce. Top with 1/4 cup of steamed broccoli, a sprinkle of red pepper flakes (if using) and another layer of cheese sauce to coat the broccoli. Place another tortilla on top and cook on medium-high heat for 2-3 minutes, until browned on the bottom. Flip and cook for a further 2-3 minutes or until browned. Repeat with rest of tortillas. Cut the quesadillas into 4 pieces, garnish with fresh cilantro and serve immediately.\n\nFor more on the healing properties of dozens of different foods, check out my #1 NY Times best-selling book, Liver Rescue.\n\nThe information provided on this Site is for general informational purposes only, to include blog postings and any linked material. The information is not intended to be a substitute for professional health or medical advice or treatment, nor should it be relied upon for the diagnosis, prevention, or treatment of any health consideration. Consult with a licensed health care practitioner before altering or discontinuing any medications, treatment or care, or starting any diet, exercise or supplementation program. Neither Anthony William nor Anthony William, Inc. (AWI) is a licensed medical doctor or other formally licensed health care practitioner or provider. The content of this blog and any linked material does not necessarily reflect the opinions of Anthony William, AWI or the principal author, and is not guaranteed to be correct, complete, or up to date.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/broccoli-cheese-quesadilla.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/broccoli-cheese-quesadillas", "author": "https://www.facebook.com/medicalmedium", "title": "Broccoli Cheese Quesadillas", "description": "Medical Medium: Broccoli Cheese Quesadillas  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["/blog/potato-tortillas", "/blog/nacho-cheese-fries", "https://geni.us/liver-rescue", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}