{"result_id": "200011", "URL": "https://www.medicalmedium.com/blog/rheumatoid-psoriatic-arthritis", "timestamp": "2023-04-25 16:21:06 CEST+0200", "meta": {"description": "Medical Medium Rheumatoid & Psoriatic Arthritis:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/rheumatoid-psoriatic-arthritis", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Rheumatoid & Psoriatic Arthritis", "cleaned_text": "Have you or someone you love been diagnosed with rheumatoid arthritis (RA) or psoriatic arthritis (PA)? Have you been told that the cause is a mystery or that it’s your body attacking itself? The truth is that there’s a real cause behind these illnesses that medical science and research are unaware of. Once you know the real cause, you can begin to move forward with healing as you will be addressing the root issue.\n\nMost people are told that their rheumatoid and psoriatic arthritis are caused by an antibody that has been created within the body that attacks the joints. This is a misguided theory that not only has never been proven, but has also sadly become law within the medical community. When this antibody was discovered, science and research did not even know what it did, and they still don’t. This means that all of the treatments and prognoses that have been delivered since this theory was put in place have been precariously balancing on an antibody whose function is still a complete mystery, which makes the true cause of RA and PA just as enigmatic as it was when research on these illnesses first began. Additionally, since the current treatments and medications prescribed for patients are based on this erroneous theory, there are so many people who are still suffering from swelling, stiffness, and pain in the joints, as well as the other symptoms that are associated with these diseases.\n\nWhen people first began suffering from mystery illnesses in the 1950s, research and science was compelled to blame hormones. This is because, like so many other times in medical research, all the money was in hormones. There was such a deluge of research being conducted on hormones at the time that pharmaceutical companies were primed and ready to sell their new hormone drugs they had been itching to promote.\n\nHowever, one doctor was not convinced hormones were to blame, so he got funding for more research and dug further. He eventually stumbled upon an antibody, which, he thought, was the ticket. He created a theory that the antibody was the body’s inexplicable weapon against itself, even though the actual reason for the antibody was still completely unknown. This research was so heavily funded that it would have been unacceptable to emerge and explain that they have no idea what the antibody does. Therefore, some sort of conclusion was necessary, some theory that would stick. The reason researchers eventually concluded the body was attacking itself was because it protected the institution of modern medicine. In this theory, the patient is blamed above all else, which in turn prevents any fingers being pointed at medicine. Currently, most funding is going toward gene research, which always concludes that the patient’s genes are to blame and there is nothing to be done. This is just another way to avoid what the real problem is and to place all the blame on the individual who is suffering. I share the truth about these misconceptions in my book, Thyroid Healing.\n\nThe Truth about the Antibody\n\nThis antibody that has become the false posterchild for autoimmune diseases is actually just one of many antibodies that have yet to be discovered by science and research. The most ironic part about the events of the last half century is that everything medical research claims to be true about this antibody is actually the exact opposite. Rather than attacking the body, this antibody has been created by the body to protect itself from an outside intruder. The antibody, while an indicator of something being attacked, is not the one doing the attacking. It is proof of your body doing everything it can to support and safeguard you. It doesn’t go after tissue; it goes after the pathogen.\n\nThe True Cause of RA and PA\n\nWe are currently living in a virus culture. Our world is rampant with pathogens that are causing the diseases so many are mystified by and calling autoimmune. Medical science and research are unaware that Epstein-Barr Virus (EBV) is the cause of so many illnesses, including fibromyalgia, chronic fatigue syndrome, multiple sclerosis, thyroid disorders, lupus, Lyme disease, tinnitus, vertigo, rheumatoid arthritis, and psoriatic arthritis. There are over 60 varieties of EBV, which may come as a shock to anyone who is only nominally familiar with this virus as well as to those who work in the medical field. I cover this virus in-depth in my book Thyroid Healing.\n\nPsoriatic arthritis is created by EBV, which feeds on the heavy metal copper in the liver. Toxic varieties of copper are perfect food for the virus that creates PA. When there is an abundant amount of food that EBV likes, such as copper, the virus becomes stronger and more rampant in the body, attacking the joints and tissues. EBV then creates an internal dermatoxin, which is different to the known external dermatoxin, which then surfaces to the skin. This is when a rash, either of the psoriasis and/or eczema variety, occurs, as well as aches, pains, and inflammation. This process is further explained in my book, Thyroid Healing or Liver Rescue. Medical communities are not aware that this is the true cause of PA, or even that viruses feed on specific foods, metals, and toxins. This is one huge reason why people are not able to receive the answers and help they need to truly heal.\n\nCopper can be absorbed into the system in many ways. Someone could have lived in an old house with ancient pipes made of copper that turned everything green. Or they could have used copper pans that flaked the metal off into the food. Copper is rife in pesticides, which means living near farmland, even 50 miles away, can be conducive to toxic copper exposure. Copper is in all pesticides, rodenticides, herbicides, and fungicides, which means we should avoid spraying both inside and outside the house. Anytime you purchase new linens or fabrics, such as towels, sheets, clothing, underwear, or socks, it would be prudent to wash them twice before using. New linens and clothing are loaded with fungicides, which are full of copper that can seep into the skin, your largest organ. It’s important to note that this toxic heavy metal copper is different to the helpful trace mineral copper which is found in plants.\n\nRheumatoid arthritis is also caused by Epstein-Barr Virus that’s in a late stage (read more about the stages of EBV in my book Thyroid Healing,) except this variety of EBV either does not like to feed on copper as much, or there simply is not an excessive amount of toxic copper in the system. The particular variety of EBV that causes RA much prefers the heavy metal mercury as its food. This specific variety of EBV gets into connective tissue, joints, and ligaments in its fourth stage, causing inflammation that’s evidence of your body trying to hold the invader at bay. Swelling of the knuckles, cervical spine, and the like is an indication that the body is reacting to the virus burrowing deeper and causing permanent damage to nerves and tissue. In its milder forms, this may display itself as mystery aches and pains. In its advanced forms, people experience severe joint swelling and a diagnosis of RA. This information is unknown to medical science and research.\n\nThe Very First Step\n\nThe most important step you can take today toward true healing is way beyond diet or avoiding sprays. You must first know in your heart the true cause of your disease. Your body is not attacking itself. It is the biggest mistake to believe your immune system is not supporting you. When you believe your disease is autoimmune, you are preventing true healing from taking place because you are not giving your body the support it needs as it continues the fight against the pathogen in your body. Knowing your body is not fighting itself but rather a pathogen such as a virus ignites your immune system to become stronger, more focused, and work even harder for you. Additionally, when you know you should be fighting a virus, you can learn the practical steps you can take to give your body as much support as you possibly can.\n\nUnknown to medical research and science, the antibody was created to fight Epstein-Barr Virus; however, your body still needs all the support it can get. The following are some steps to take that can help you to begin recovering from rheumatoid and psoriatic arthritis.\n\nHeavy metals are one of EBV’s favorite foods. And almost all of us unknowingly have toxic heavy metals inside our bodies. These metals make it possible for the virus to continue growing and becoming more prolific. And the more it feeds on metals such as mercury and copper, the more toxic waste matter the virus excretes in the body, which leads to the symptoms of psoriatic and rheumatoid arthritis. To get rid of heavy metals, there are five important heavy metal detox foods to include in your diet daily: barley grass juice extract powder, cilantro, spirulina, wild blueberries, and Atlantic dulse. To learn more about the heavy metal detox foods, check out my article and radio show called Heavy Metal Detox.\n\nWhen healing from RA and PA, it is essential to avoid eating things that happen to be some of EBV’s favorite foods, such as eggs and dairy. Also, it’s best to avoid pork because it burdens the liver to such a degree that it gives viruses an opportunity to proliferate, grow, and inflame the joints and skin. It’s also important to stay away from gluten as well because unknown to all medical communities it also provides fuel for the virus. If you have taken out eggs, dairy, and gluten, and you are still experiencing symptoms after several months, consider removing all grains from your diet, including oats and rice, while you heal. Some people tolerate grains well but for some, grains have to be removed to allow for deeper healing. It’s also helpful to avoid corn, soy, and canola oil. To find out more about why these foods are best removed from the diet if you have a symptom or illness, you can read full explanations in my book, Thyroid Healing.\n\nWhile many have been told to avoid fruit because of its sugar content, this trend is actually another example of misinformation that is only preventing people from taking advantage of the powerful antiviral properties in bananas, dates, apples, melons, mangoes, and all other kinds of fruit. Fruit is the most antioxidant-rich food in the world. Antioxidant should really be synonymous with longevity, as fruit is the best food to prolong life and fight disease. Wild blueberries, blackberries, and cherries are among the most antioxidant-filled foods. You can focus on whichever fruits are most attractive to you. If you have the luxury of a farmers market near you, make it a weekly habit to do your shopping there and explore the numerous varieties of fruit that are available to you: apples, pears, peaches, persimmons, apricots, watermelons, and dates. Different kinds of citrus are also a wonderful addition to your fruit-filled diet. While some people may think oranges, lemon water, or grapefruit cause flare ups in their RA or PA, it only feels that way because the citrus is detoxifying the poisons and viral byproduct in your system. In addition to fruit, be sure to eat plenty of leafy greens, vegetables, and include celery juice daily.\n\nFor more information on other foods to include for these conditions, refer to my books Medical Medium, Life-Changing Foods, and Thyroid Healing. You can also read about many healing foods on my blog. In addition, the 28 Day Healing Cleanse in my book Medical Medium is ideal for these conditions.\n\nFor healing supplements, consider including the following supplements:\n\nZinc sulfate is one of the most important resources to fight EBV. The body uses up supplies and even deep reserves of zinc at a rapid rate—meaning that it’s very common to become zinc-deficient when you have EBV, if you weren’t already. This supplement gives a major boost to the immune system so that EBV cells can be destroyed and suppressed.\n\nL-Lysine inhibiting and reduces an EBV viral load and acts as an anti-inflammatory to the entire body.\n\nCat’s claw is a powerful anti-inflammatory and anti-viral that can be very helpful for rheumatoid and psoriatic arthritis.\n\nTaking a methylfolate supplement that supports methylation issues along with the right B-12 supplement that contains adenosylcobalamin and methylcobalamin is very important for those suffering with rheumatoid and psoriatic arthritis.\n\nGlutathione helps to detoxify the liver, which is where the virus and toxins that cause these conditions can be found.\n\nAlpha Lipoic Acid (ALA) repairs and fortifies areas of the body that have been damaged by the virus.\n\nMullein leaf’s strong anti-viral abilities make it an important supplement to consider.\n\nThe healing information and dietary and supplement guidance shared in my radio show and blog post on psoriasis and eczema would also be helpful to incorporate.\n\nMany people with RA go to an infrared sauna to help with the fatigue and stiffness. This can be a good option for you, just be sure not to have the heat set too high Be conscious about how long you stay in the sauna. Another extremely helpful treatment is gentle massage therapy, one of the oldest modalities since the beginning of time. Healing touch from one person to another can be incredible for RA.\n\nRheumatoid arthritis and psoriatic arthritis are not autoimmune diseases, and this myth is one that needs to rectified immediately so that the millions of people who are suffering can begin to get true answers. When you are given wrong information about your illness, you are essentially given a stop sign. My hope is for you to walk away from this understanding of RA or PA with a renewed hope and green light. Realizing that your body is fighting a virus that is feeding on toxins and metals in your system is the first and most powerful thing you can do. You must let go of the idea that your body is working against you. It is impossible for the body to attack a single cell in our bodies.\n\nWhen you are considering your healing options, it can be overwhelming. Remember to take it slow and at your own pace. Everyone’s path is going to look a little different. Maybe the foods to avoid will take you some time to remove but the supplements will come more easily. Maybe eating fruit will be an easy step but including celery juice is too much for you up front. Do what you can today and keep building on it from here. Never forget that your body is working with you, not against you, and healing is possible.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/rheumatoid-and-psoriatic-arthritis.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/rheumatoid-psoriatic-arthritis", "author": "https://www.facebook.com/medicalmedium", "title": "Rheumatoid & Psoriatic Arthritis", "description": "Medical Medium: Rheumatoid & Psoriatic Arthritis  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["http://amzn.to/2mfPiJ0", "http://amzn.to/2mfPiJ0", "http://amzn.to/2mfPiJ0", "http://amzn.to/2DjQjE9", "http://www.medicalmedium.com/thyroid-healing", "https://vimergy.com/products/barleygrass-juice", "https://vimergy.com/products/usa-grown-spirulina", "http://amzn.to/2b5HoKn", "http://www.medicalmedium.com/blog/heavy-metal-detox", "http://www.medicalmedium.com/thyroid-healing", "http://amzn.to/1VsZ4Qr", "http://amzn.to/1T5KZu7", "http://amzn.to/2mfPiJ0 ", "http://www.medicalmedium.com/medical-medium-blog ", "http://amzn.to/1VsZ4Qr", "https://vimergy.com/products/organic-zinc", "https://vimergy.com/products/l-lysine", "https://vimergy.com/products/cats-claw", "https://vimergy.com/products/5-mthf", "https://vimergy.com/products/b12", "https://vimergy.com/products/glutathione", "http://amzn.to/2miTkzt ", "http://amzn.to/2n1CyU3", "http://www.medicalmedium.com/blog/healing-acne-eczema-psoriasis", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}