{"result_id": "200016", "URL": "https://www.medicalmedium.com/endorsements", "timestamp": "2023-04-25 16:21:09 CEST+0200", "meta": {"description": "Medical Medium", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/endorsements", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Endorsements of Medical Medium, Anthony William", "cleaned_text": "“After years of doctors being unable to diagnose, identify, or pinpoint our child’s gastrointestinal issues, Anthony’s expertise and intuition led us to not only identifying the issue, but more importantly, Anthony’s precise protocols have been the invaluable catalyst in our daughter’s healing, recovery, and her happiness. As parents, there is no greater gift you can pray for than the health of your children, and we are eternally grateful to you, Anthony, for your powerful gifts. Thank you for your time, energy, guidance, and comfort on a journey that wasn’t overnight, and for restoring our daughter and many of our family members’ health, Anthony.” “Celery juice is sweeping the globe. It’s impressive how Anthony has created this movement and restored superior health in countless people around the world.” “Anthony William has been there for my wife at all times to make sure she is as healthy as she could possibly be. I will always thank him and love him for that.\" — Adam Sandler, star of Hustle, Grown Ups, and The Wedding Singer\n\n“Anthony doesn’t offer gimmicks or fads to finding ultimate health. His recommended foods and cleansing programs are simple and delicious and THEY WORK! If you’re done living with pain, fatigue, brain fog, intestinal disorders, and a myriad of other nasty ailments, drop everything and read this (and his other) books. He will quickly bring health and hope back into your life.” “For over 40 years I have been teaching the principles of vital health and alkalinity in my books and seminars. Sage and I are passionate about the cleanse-to-heal approach to nutrition and wellness that naturally supports the body and fortifies our immune system to keep it functioning at its prime. We are so grateful for the dear friendship, guidance, alignment, and insights of Anthony William not only in his teaching and best practices, but also for the way he has personally ushered us through our own health challenges. He is a brother on this path and a gift to this world. His routines have proven results to all who seek to optimize their inner terrain.” “While there is most definitely an element of otherworldly mystery to the work he does, much of what Anthony William shines a spotlight on—particularly around autoimmunedisease—feels inherently right and true. What’s better is that the protocols he recommends are natural, accessible, and easy to do.” — Gwyneth Paltrow, Oscar-winning actress, #1 NYT best-selling author of It’s All Easy, founder and CEO of GOOP.com\n\n“Anthony William is truly dedicated to sharing his knowledge and experience to spread the word of healing to all. His compassion and desire to reach as many people as he can to help them heal themselves is inspiring and empowering. Today, in a world of obsession with prescription medication, it is so refreshing to know that there are alternative options that truly work and can open a new door to health.” — Liv Tyler, star of 9-1-1: Lone Star, Harlots, the Lord of the Rings trilogy, and Empire Records “Anthony's knowledge on the food we consume, the impact it has on our body, and our overall well-being has been a game changer for me!” — Jenna Dewan, star of The Rookie, Soundtrack, World of Dance, Step Up “Anthony is a wonderful person. He identified some long-term health issues for me, he knew what supplements I needed, and I felt better immediately.” — Rashida Jones, Grammy-winning director of Quincy, star of Parks and Recreation and The Office\n\n“Thank God for Anthony’s gift, because it has not only inspired thousands of people to recover their health, but it has also helped my personal journey to recovery as well as guiding my work with my own clients as a Health Coach as I help to teach the ways of plant based whole foods nutrition.” “Anthony’s books are revolutionary yet practical. For anybody frustrated by the current limits of Western medicine, this is definitely worth your time and consideration.” — James Van Der Beek, creator, executive producer, and star of What Would Diplo Do? and star of Pose and Dawson’s Creek, and Kimberly Van Der Beek, public speaker and activist “Anthony’s advanced understanding of the Epstein-Barr virus (medical science is just catching up with what he has been saying for years) has helped many people, including myself, reclaim their lives. He has not only given hope to those of us who have struggled with mystery pain, autoimmune disease, depression, confusion, and the after-effects of Covid, but he has given us the maps we need to reclaim our lives. He is in my opinion a gift to humanity and I recommend that anyone who has been struggling with their health to stop the struggle and immediately pick up his books and follow along.” — Carrie Ann Inaba, Dancing with the Stars, Emmy-nominated television host, executive producer and founder of Carrie Ann Conversations\n\n“We are incredibly grateful for Anthony and his passionate dedication to spreading the word about healing through food. Anthony has a truly special gift. His practices have entirely reshaped our perspectives about food and ultimately our lifestyle. Celery juice alone has completely transformed the way we feel and it will always be a part of our morning routine.” “Anthony is a truly generous person with keen intuition and knowledge about health. I have seen firsthand the transformation he’s made in people’s quality of life.” — Carla Gugino, The Haunting of Bly Manor, Jett, Watchmen, Entourage and Spy Kids “I’ve been following Anthony for a while now and am always floored (but not surprised) at the success stories from people following his protocols . . . I have been on my own path of healing for many years, jumping from doctor to doctor and specialist to specialist. He’s the real deal and I trust him and his vast knowledge of how the thyroid works and the true effects food has on our body. I have directed countless friends, family, and followers to Anthony because I truly believe he possesses knowledge that no doctor out there has. I am a believer and on a true path to healing now and am honored to know him and blessed to know his work. Every endocrinologist needs to read his book on the thyroid!”\n\n“What if someone could simply touch you and tell you what it is that ails you? Welcome to the healing hands of Anthony William—a modern-day alchemist who very well may hold the key to longevity. His lifesaving advice blew into my world like a healing hurricane, and he has left a path of love and light in his wake. He is hands down the ninth wonder of the world.” “Anthony William is changing and saving the lives of people all over the world with his one-of-a-kind gift. His constant dedication and vast amount of highly advanced information have broken the barriers that block so many in the world from receiving desperately needed truths that science and research have not yet discovered. On a personal level, he has helped both my daughters and me, giving us tools to support our health that actually work. Celery juice is now a part of our regular routine!” — Lisa Rinna, star of The Real Housewives of Beverly Hills and Days of Our Lives, New York Times best-selling author, designer of the Lisa Rinna Collection “I am a doctor’s daughter who has always relied on Western medicine to ameliorate even the smallest of woes. Anthony’s insights opened my eyes to the healing benefits of food and how a more holistic approach to health can change your life.” — Jenny Mollen, actress and New York Times best-selling author of I Like You Just the Way I Am\n\n\"Anthony William is one of those rare individuals who uses his gifts to help people rise up to meet their full potential by becoming their own best health advocates . . . I witnessed Anthony’s greatness in action firsthand when I attended one of his thrilling live events. I equate how spot-on his readings were with a singer hitting all the high notes. But beyond the high notes, Anthony’s truly compassionate soul is what left the audience captivated. Anthony William is someone I am now proud to call a friend, and I can tell you that the person you hear on the podcasts and whose words fill the pages of best-selling books is the same person who reaches out to loved ones simply to lend support. This is not an act! Anthony William is the real deal, and the gravity of the information he shares through Spirit is priceless and empowering and much needed in this day and age!\" “I had the pleasure of working with Anthony William when he came to Los Angeles and shared his story on Extra. What a fascinating interview as he left the audience wanting to hear more . . . people went crazy for him! His warm personality and big heart are obvious. Anthony has dedicated his life to helping people through the knowledge he receives from Spirit, and he shares all of that information through his Medical Medium books, which are life changing. Anthony William is one of a kind!” “Anthony William has a remarkable gift! I will always be grateful to him for discovering an underlying cause of several health issues that had bothered me for years. With his kind support, I see improvements every day. I think he is a fabulous resource!”\n\n“I love Anthony William! My daughters Sophia and Laura gave me his book for my birthday, and I couldn’t put it down. The Medical Medium has helped me connect all the dots on my quest to achieve optimal health. Through Anthony’s work, I realized the residual Epstein-Barr left over from a childhood illness was sabotaging my health years later. Medical Medium has transformed my life.” — Catherine Bach, The Dukes of Hazzard, The Young and the Restless “My recovery from a traumatic spinal crisis several years ago had been steady, but I was still experiencing muscle weakness, a tapped-out nervous system, as well as extra weight. A dear friend called me one evening and strongly recommended I read the book Medical Medium by Anthony William. So much of the information in the book resonated with me that I began incorporating some of the ideas, then I sought and was lucky enough to get a consultation. The reading was so spot-on, it has taken my healing to an unimagined, deeper, and richer level of health. My weight has dropped healthily, I can enjoy bike riding and yoga, I’m back in the gym, I have steady energy, and I sleep deeply. Every morning when following my protocols, I smile and say, ‘Whoa, Anthony William! I thank you for your restorative gift . . . Yes!” “The keys to your health that Anthony William provides are priceless.”", "opengraph": {"image": "https://www.medicalmedium.com/banners/praise.jpg", "title": "Endorsements of Medical Medium, Anthony William", "url": "https://www.medicalmedium.com/endorsements", "description": "Read some of the amazing healing testimonies and endorsements...", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Medical Medium at medicalmedium.com", "Medical Medium"], "publish_date": null}