{"result_id": "200010", "URL": "https://www.medicalmedium.com/blog/12-foods-that-help-heal-shingles-virus", "timestamp": "2023-04-25 16:21:06 CEST+0200", "meta": {"description": "Medical Medium 12 Foods That Help Heal Shingles Virus:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/12-foods-that-help-heal-shingles-virus", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "12 Foods That Help Heal Shingles Virus", "cleaned_text": "In the medical world, shingles seems like an open-and-shut case. You’ve got a patient with the textbook rash, nerve pain on the side or back, and that’s all, folks. The truth is that the shingles virus is responsible for millions of people’s mystery symptoms, from rashes that confound dermatologists to neurological symptoms like twitching, tingling, burning, spasms, chronic migraines, headaches, and much more. Varieties of shingles are responsible for Bell’s palsy, frozen shoulder, diabetic nerve pain, colitis, vaginal burning, burning in other areas, TMJ, Lyme disease, sciatic pain, and even misdiagnosed MS.\n\nWhat doctors don’t yet know is that there isn’t merely one type of shingles virus, but over 30 varieties. This matters because different types of shingles cause different symptoms. It also matters because medical communities don’t even recognize the majority of shingles cases as being the result of a virus. For example, any of the more aggressive varieties of shingles can cause Lyme disease symptoms yet doctors currently believe Lyme disease is caused by bacteria. (For more on Lyme disease, see Medical Medium: Secrets Behind Chronic and Mystery Illness and How to Finally Heal.)\n\nTo understand how shingles works in the body, the different types of shingles viruses, and how to heal, check out the chapter on this virus also in Medical Medium.\n\nCertain foods can greatly aid the body in healing from shingles varieties with and without rashes. They can help by, variously, attacking the different strains of the virus, supporting the body in recovery from neurotoxin flare-ups, boosting the immune system, healing nerves and stimulating nerve growth, soothing inflamed skin, and detoxifying the body. Below you will find 12 of the foods that help heal shingles. Include them daily or as often as possible.\n\nCelery juice’s subgroup of sodium that I call “sodium cluster salts” inhibit the growth of shingles (and other pathogens). The sodium cluster salts also attach themselves to the viral neurotoxins that are responsible for so many neurological health issues and carry them out of the body safely so that nerves are less exposed to shingles damaging neurotoxins. The unique form of vitamin C in celery juice fuels the immune system so it can seek out and destroy shingles. These are just a few of the ways celery juice helps. For more on it’s incredible healing properties check out Medical Medium Celery Juice: The Most Powerful Medicine of Our Time Healing Millions Worldwide.\n\nWild blueberries help restore the central nervous system and flush shingles neurotoxins out of the liver. They also help remove toxic heavy metals from the brain and liver, which shingles virus feeds on and then produces neurotoxins which cause many symptoms and conditions. Wild blueberries are a critical part of the Medical Medium Heavy Metal Detox. Wild blueberries smaller than their larger, cultivated cousins and can be found in the freezer section of many grocery stores.\n\nPapaya’s amino acids and enzymes combined create undiscovered subcompound phytochemicals that repel viruses. Its vitamin C content is an antiviral secret weapon and also helps cleanse and rebuild the liver where the shingles virus camps out. Papayas also restore the central nervous system from viral neurotoxin damage, which is critical for shingles-caused symptoms or conditions. Look for the Mexican and Central American papaya variety known as Maradol. These medium-to-large papayas are preferable to Hawaiian varieties, which have suffered GMO contamination.\n\nApples starve out viruses from the intestinal tract and liver. As the pectin from an apple moves through your gut, it collects and rids your body of viruses and other microbes such as bacteria, yeast, and mold. Choose red-skinned apples for the most nutrients.\n\nPears revitalize and feed the liver while cleansing and purging the organ of shingles virus waste matter. Pears restore linings in the gut that have become damaged from the shingles virus. The shingles virus feeds off of milk, cheese, butter, and eggs and then excretes toxic waste that breaks down the intestinal linings over time.\n\nArtichokes help cleanse the liver of neurotoxins and dermatoxins produced by viruses such as the shingles virus. The edible portion of artichoke leaves (technically, bracts) contains alkaloid compounds that send messages to specific parts of your immune system to guard you from invaders such as shingles.\n\nBananas are a powerful antiviral food with incredible anti-inflammatory properties due to their ability to lower viral load. They provide amino acids and the right kind of potassium to rebuild neurotransmitters after they’ve been burnt out by shingles’ neurotoxins. Bananas are a secret weapon in reversing colitis, which is caused by the shingles virus–a truth still unknown to medical research and science.\n\nSweet potato helps cleanse and detox the liver of shingles virus toxic byproduct that builds up over the years and makes the liver stagnant and sluggish. They also help to feed the nerves, which are greatly affected by the shingles virus because shingles virus neurotoxins are highly inflammatory to nerves.\n\nSpinach creates an alkaline environment in the body and provides highly absorbable micronutrients to the nervous system, which is critical because EBV targets the nervous system when it gets to stage four (read all about the stages of EBV in Thyroid Healing). Spinach binds onto and removes the jelly-like EBV waste matter in the liver that can contribute to mystery weight gain, mystery heart flutters and more. Spinach is best eaten raw to receive its benefits.\n\nAsparagus has phytochemicals in the skin and tips of its spears that push back shingles and help stop it from reproducing. Asparagus is also an incredible alkalizer, meaning it helps anyone who has become acidic with a load of troublemakers like shingles and its byproducts return to a healthy state. Asparagus has blood-, lymph-, and liver-purifying properties that make it an ideal food for helping to detoxify viral byproduct sludge.\n\nLettuces (varieties that are leafy and deep green or red) are antiviral. They help cleanse shingles from the liver and lymphatic system and are alkalizing to the body. Lettuces such as romaine contain sedative compounds that relax the nerves and calm the body, which is helpful for anyone with a viral symptom or condition that inflames the nerves.\n\nGreen beans contain anti-inflammatory chlorophyll-based compounds that are beneficial for any symptom or condition caused by shingles.\n\nFor more information on shingles and how you can heal, check out Medical Medium: Secrets Behind Chronic and Mystery Illness and How to Finally Heal.\n\nLearn more about how to heal from the New York Times bestselling book Cleanse To Heal.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/twelve-foods-shingles.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/12-foods-that-help-heal-shingles-virus", "author": "https://www.facebook.com/medicalmedium", "title": "12 Foods That Help Heal Shingles Virus", "description": "Medical Medium: 12 Foods That Help Heal Shingles Virus  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["http://amzn.to/1VsZ4Qr", "https://geni.us/medical-medium-revised", "https://www.medicalmedium.com/blog/healing-your-neurological-system", "https://geni.us/celery-juice", "https://www.medicalmedium.com/blog/medical-medium-heavy-metal-detox", "https://geni.us/thyroid-healing", "http://amzn.to/1VsZ4Qr", "https://geni.us/cleanse-to-heal", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}