{"result_id": "200028", "URL": "https://www.medicalmedium.com/blog/twelve-immune-support-supplements", "timestamp": "2023-04-25 16:21:14 CEST+0200", "meta": {"description": "Medical Medium 12 Immune Support Supplements:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/twelve-immune-support-supplements", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "12 Immune Support Supplements", "cleaned_text": "We are up against more on this planet today than ever before. Every day our immune systems go to war for us, protecting us from a continual onslaught of invaders, including pathogens, toxic heavy metals, chemicals, and other toxins. Our immune systems are focused on keeping us safe, strong, and healthy in the face of all these threats, invasions, and exposures. But with so much to battle, our immune systems need a helping hand to keep fighting the good fight and be able to win. That’s where immune support tools come in. These 12 herbs and supplements are excellent for strengthening the immune system:\n\nVitamin C: Strengthens the entire immune system, especially the killer cells that go after pathogens such as EBV, shingles, and flus. Vitamin C feeds immune cells so they can fight free radical toxins. I prefer buffered forms of Vitamin C, such as Micro-C, as they are gentler on the stomach and better for sensitive people.\n\nZinc as liquid zinc sulfate: Helps the immune system fend off the pathogens behind chronic illnesses, symptoms, and conditions and keeps the immune system strong during times of sickness, stress, poor diet and lifestyle choices, and more. Everyone is deficient in this critical mineral.\n\nB12 with adensolycobalamin and methylcobalamin: Bolsters the immune system and protects you from neurotoxin damage from pathogens.\n\nLemon Balm: Kills off and repels pathogen cells, while also helping to strengthen lymphocytes so the immune system can fight off pathogens.\n\nSpirulina: Strengthens the immune system while also removing toxic heavy metals and stopping pathogen growth, which lightens the burden on the immune system.\n\nCat’s Claw: Kills off pathogens and assists the liver’s personalized immune system, giving it a chance to recoup its strength and restore itself for the next battle.\n\nGoldenseal: Helps destroy and purge pathogens from the body, helping the immune system to win the war on invaders. In most cases, it’s best to use goldenseal for two weeks on, then two weeks off, and repeat this cycle.\n\nLicorice: Most important herb for fighting pathogens and therefore many chronic illnesses, symptoms, and conditions caused by these pathogens. Also restores the adrenals, which eases the burden on the immune system.\n\nL-Lysine: Strengthens the immune system and deters pathogens from proliferating.\n\nChaga Mushroom: Possesses immune-system-enhancing nutrients that revitalize white blood cell count by increasing the production of lymphocytes, monocytes, neutrophils, basophils, and eosinophils, so that your body can battle invaders. Also strengthens red blood cells and bone marrow, balances blood platelets, and staves off cytokine storms.\n\nCurcumin: Anti-inflammatory that helps free the body from being stuck in a reactive state even after an invader such as the flu has left the body.\n\nNettle Leaf: Anti-pathogenic herb that also supports your immune system because it helps bring you back to homeostasis—getting your body balanced again so everything functions better, including your lymphatic system, liver, adrenals, and blood.\n\nConsider bringing these supplements into your self-care regimen regularly. Your immune system will be strengthened and better able to protect you against pathogens and toxins, and during times of stress, emotional hardship, injury, loss, seasonal changes, poor eating or lifestyle habits, or when you’re not able to take the best care of yourself.\n\nFor more information on how to use these supplements, including suggested dosages, you can refer to Cleanse To Heal (51% off today on Amazon!).\n\nThe information provided on this Site is for general informational purposes only, to include blog postings and any linked material. The information is not intended to be a substitute for professional health or medical advice or treatment, nor should it be relied upon for the diagnosis, prevention, or treatment of any health consideration. Consult with a licensed health care practitioner before altering or discontinuing any medications, treatment or care, or starting any diet, exercise or supplementation program. Neither Anthony William nor Anthony William, Inc. (AWI) is a licensed medical doctor or other formally licensed health care practitioner or provider. The content of this blog and any linked material does not necessarily reflect the opinions of Anthony William, AWI or the principal author, and is not guaranteed to be correct, complete, or up to date.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/twelve-immune-support-supplements.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/twelve-immune-support-supplements", "author": "https://www.facebook.com/medicalmedium", "title": "12 Immune Support Supplements", "description": "Medical Medium: 12 Immune Support Supplements  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vimergy.com/products/micro-c", "https://vimergy.com/products/organic-zinc", "https://vimergy.com/products/organic-b12", "https://vimergy.com/products/lemon-balm", "https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/organic-cats-claw", "https://vimergy.com/products/organic-goldenseal", "https://vimergy.com/products/organic-licorice", "https://vimergy.com/products/l-lysine", "https://vimergy.com/products/chaga", "https://vimergy.com/products/curcumin", "https://vimergy.com/products/organic-nettle", "https://amzn.to/2HJKKr3", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}