{"result_id": "200025", "URL": "https://www.medicalmedium.com/mm101/medical-medium-heavy-metal-detox.htm", "timestamp": "2023-04-25 16:21:13 CEST+0200", "meta": {"description": "Medical Medium", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.medicalmedium.com/mm101/medical-medium-heavy-metal-detox.htm", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Heavy Metal Detox 101 | Medical Medium 101", "cleaned_text": "This smoothie is not only delicious, it's also perfectly designed to include five key ingredients that work together in synergy to pull heavy metals like mercury, lead, aluminum, nickel, copper, and cadmium out of your organs where they accumulate. Toxic heavy metals are virtually everywhere, and are present in all kinds of things that we come in contact with every day, such as aluminum cans and aluminum foil, batteries, metal cookware, old paint, and even the foods we eat. For instance, pesticides and herbicides (which are hard to completely avoid even on a strict organic diet), are a common source of toxic heavy metals. As a result, most of us are carrying around heavy metals that have been with us for almost our whole lives and which have burrowed deep inside our tissues. We are also born into this world with heavy metals already inside our livers. You can read more about how this happens in Liver Rescue. Unfortunately, it is these “old” metals, the ones that have been lurking in our system for prolonged periods of time, that pose the greatest threat. For example, over time toxic heavy metals can oxidize, causing damage to surrounding tissue and promoting inflammation. They literally poison our bodies, and can inflict damage on virtually every system and organ, including our brain, liver, digestive system, and other parts of our nervous system. Toxic heavy metals put an immense burden on our immune system, leaving us vulnerable to a variety of illnesses. While toxins of every kind are harmful, heavy metals pose a unique threat. Not only are they damaging in their own right, they are also a form of neurotoxin (a poison that disrupts nerve function and confuses your immune system). Heavy metal neurotoxins can inflame and irritate our central nervous system (especially our brain), causing multiple symptoms such as memory loss, brain fog, fatigue, and depression. Toxic heavy metals can also promote inflammation in the digestive tract, releasing poisons into our gut as well. As if this isn’t bad enough, heavy metals also serve as a source of food for viruses, bacteria, parasites, and other pathogens in our body. For example, heavy metals can serve as a feeding ground for Streptococcus A or B, E. coli, C. difficile, H. pylori, and yeast cells. This can create an overgrowth of multiple bacteria in our gut, resulting in a condition known as SIBO (small intestinal bacterial overgrowth), which is characterized by bloating, abdominal pain, diarrhea, constipation (or both), and can lead to nutrient deficiencies. Additionally, when viruses such as Epstein-Barr and shingles feed off toxic heavy metals, this can produce symptoms such as tingling, numbness, fatigue, anxiety, heart palpitations, ringing in the ears, dizziness, vertigo, eczema, rosacea and psoriasis, as well as neck pain, knee pain, foot pain, pain in the back of the head, and a variety of other aches and pains that are often attributed to other causes. It's virtually impossible not to take in a certain amount of these toxic heavy metals in our modern era, so it's vitally important to our health that we get them out before they can wreak further havoc on our health. Thankfully, it's relatively simple to remove them from our organs if we consume the right foods to do so. Adding the following all-star team of foods to your diet and being diligent in your efforts to consume them every day will go a long way toward ridding your body of heavy metals: Spirulina: This edible blue-green algae draws out heavy metals from your brain, central nervous system, and liver, and soaks up heavy metals extracted by barley grass juice extract powder. Take 2 teaspoons mixed in water, coconut water, juice or the smoothie recipe below daily. Barley grass juice extract: prepares the metals for complete absorption by the spirulina. This nutritive grass has the ability to draw heavy metals out of your spleen, intestinal tract, pancreas, thyroid, and reproductive system. Drink 1-2 teaspoons mixed in water, coconut water, juice or the smoothie recipe below daily. Cilantro: Goes deep into hard-to-reach places, extracting metals from yesteryear (so it’s great for that mercury inheritance you’re carrying around!). Blend one cup in a smoothie (like the one below), juice, or add to salad or guacamole. Wild blueberries: Draw heavy metals out of your brain tissue, healing and repairing any gaps created by oxidation when the heavy metals are removed. It is important to use wild blueberries, as they possess unique phytonutrients with special detoxifying capabilities. The potent antioxidants in wild blueberries help reverse any oxidative damage left behind by the heavy metal removal. This is especially important for your brain tissue—in fact, wild blueberries are the most powerful food for halting or in some cases reversing Alzheimer’s and dementia. Eat at least one cup daily. You can also use wild blueberry powder if you can’t access fresh or frozen wild blueberries, or in addition to them. Note: while cultivated blueberries are nutritious, they lack the metal-drawing ability of the wild blueberries. Wild blueberries can be found in the freezer section of most supermarkets. If you can't access frozen wild blueberries or you're traveling, pure wild blueberry powder is a great option. Atlantic dulse: In addition to mercury, this edible seaweed binds to lead, aluminum, copper, cadmium, and nickel. Unlike other seaweeds, Atlantic dulse is a powerful force for removing mercury on its own. Atlantic dulse goes into deep, hidden places of the digestive tract and gut, seeking out mercury, binding to it, and never releasing it until it leaves the body. Eat two tablespoons of flakes daily, or an equal amount of strips if it’s in whole-leaf form. Note: As it comes from the ocean, if you are concerned about the dulse itself having mercury, be aware that Atlantic sea dulse will not release any mercury it might possess into the body. It holds on to the mercury as it works its way through, and even grabs onto other metals along the way and drives them out as well. Atlantic dulse is a critical part of the team because it can hang out near the finish line (i.e., our colon), waiting for the other foods that have been grabbing on to heavy metals along the way. It serves as emergency backup, helping ensure that all the heavy metals that made it as far as the colon actually leave the body.\n\nIs there a particular time of the day that’s best to drink the Medical Medium Heavy Metal Detox Smoothie? Any time of day is fine, but it’s better to have it earlier rather than later in the day so you fit it in. Many people have it as their breakfast. What if I can’t have bananas? You can use mangoes or papayas. Will this still be effective if I have regular cultivated blueberries? Cultivated blueberries do not have the ability to pull out heavy metals like the wild blueberries do. Wild blueberries are the top superfood on the planet because they have learned to adapt and thrive over thousands of years through droughts, fires, and frosts. In contrast, if you were to stop watering cultivated blueberries they would soon die. This unique strength, resilience and adaptability set wild blueberries apart fro cultivated blueberries and other berries. To find out more about the healing properties of wild blueberries, you can refer to Life-Changing Foods. Will dried wild blueberries have any ability to remove heavy metals? Any dried wild blueberries will have some effect but they will range. For the Heavy Metal Detox you are better off using a high quality additive-free wild blueberry powder. Is it safe to drink if pregnant? Yes it is safe to drink while pregnant. Can I use cilantro essential oil instead of fresh cilantro? No, it’s important that the cilantro be fresh. Can I use any kind of barley grass? Barley grass JUICE powder is different than barley grass powder. It concentrates the nutritional properties and is the easiest way for the body to digest, assimilate, and utilize its nutrients. In addition, the supplement type and quality you choose matters. Not all supplements offer the same benefits. For these very important reasons, I offer a directory on my website of the best forms of each supplement, which you can find here. Is it safe to drink while breastfeeding? Yes, it is safe for you and the baby. Is this one or two servings? Is this smoothie ok for children? Yes it is safe and healthy for children. You can adjust the amounts for your child as you wish. What is a “small handful” of dulse flakes? If using Atlantic dulse in small flake form it’s roughly two tablespoons. How often should I drink the Medical Medium Heavy Metal Detox Smoothie? Is it ok to substitute orange juice with coconut water? Yes, a good quality coconut water is a great substitute. You can also use fresh apple juice. Should the orange juice be fresh or can it be store bought or frozen concentrate? It’s best to juice it fresh yourself. If that’s not possible, try to find a 100% orange juice without any additives or flavors. What if one of the 5 main ingredients (spirulina, barley grass juice powder, cilantro, wild blueberries, and Atlantic dulse) is not available where I live? It’s best to have all 5, but you will still get benefits with 3 or 4 of the main ingredients. In the US and Canada they are widely available in the freezer section of many supermarkets and health food stores. In other countries, there are some suppliers now delivering the frozen wild blueberries depending on the country. You can also get wild blueberry powder. Can I drink this if I am diabetic? Yes. Contrary to popular belief, fruit does not cause diabetes. It is the fat that is blocking the sugar from getting into the cells and creating insulin resistance. Our bodies need healthy carbohydrates to function. Sugar and unhealthy carbohydrates from foods like cakes, cookies, and candy are indeed bad for us and should be avoided. Fresh fruit, sweet potatoes, and potatoes, however, have the critical clean carbohydrates we need. For more information on both type 1 and type 2 diabetes, please see Liver Rescue. I don’t like the taste of cilantro. What can I do? You can try a small amount of cilantro in the smoothie to start. The fruit taste will mask much of the flavor of the cilantro.If you still dislike it, you can have the smoothie with just one tiny sprig of cilantro and slowly increase the quantity over time. Below I explain what’s really happening when someone has an aversion to cilantro. When a person perceives an abrupt, harsh flavor from the cilantro herb, it means that she or he has a higher oxidative rate of heavy metals in her or his system. This doesn’t mean the person possesses a higher level of toxic heavy metals. Rather, the heavy metals (in this case, usually a combination of aluminum, nickel, and/or copper, at whatever level) in her or his body are corroding rapidly. Corrosion means that there’s toxic runoff, which makes its way into a person’s lymphatic system and saliva. The moment cilantro makes contact with the mouth, its phytochemicals start to bind onto any oxidative runoff they encounter—if there’s a lot of this debris in a person’s saliva, it can result in a harsh sensation when eating cilantro. In other words, if someone dislikes cilantro, there’s a good chance she or he really needs it. Can I drink the Medical Medium Heavy Metal Detox Smoothie if I have mercury amalgams in my teeth? Yes, you can. First of all, if it did pull out the mercury it would be fine because the cilantro and other four ingredients in the smoothie would carry it out. But, your saliva doesn't allow the phytochemical compounds that are in cilantro to bind to the mercury on the surface of the teeth. The saliva in your mouth inactivates the compounds in cilantro until it gets to the stomach where it is reactivated. This smoothie is helpful for anyone who has amalgams. Learn more about the hidden healing powers of fruits, vegetables, and herbs in the #1 New York Times Bestselling book Life-Changing Foods. You can also find out more about how to incorporate the Heavy Metal Detox Smoothie into a healing routine in my Bestselling books Thyroid Healing and Liver Rescue.", "opengraph": {"title": "Heavy Metal Detox 101 | Medical Medium 101", "image": "https://www.medicalmedium.com/mm101/og-detox.jpg", "image:alt": "Heavy Metal Detox Smoothie Recipe and Video", "url": "https://www.medicalmedium.com/mm101/medical-medium-heavy-metal-detox.htm", "description": "This smoothie is not only delicious, it's also perfectly designed to include five key ingredients that work together in synergy to pull heavy metals like mercury, lead, aluminum, nickel, copper, and cadmium out of your organs where they accumulate.", "type": "website", "video": "https://player.vimeo.com/video/376737479", "video:url": "https://player.vimeo.com/video/376737479", "video:secure_url": "https://player.vimeo.com/video/376737479", "video:width": "1600", "video:height": "900"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "vimeo", "width": null, "height": null, "embed_code": "<iframe class=\"embed-responsive-item\" src=\"https://player.vimeo.com/video/376758263\"/>", "src": "https://player.vimeo.com/video/376758263"}], "links": ["http://amzn.to/2DjQjE9", "https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/barleygrass-juice", "https://vimergy.com/products/wild-blueberry", "http://amzn.to/2b5HoKn", "https://vimergy.com/products/barleygrass-juice", "https://vimergy.com/products/usa-grown-spirulina", "http://amzn.to/2b5HoKn", "https://www.medicalmedium.com/life-changing-foods", "https://vimergy.com/products/wild-blueberry", "http://www.medicalmedium.com/preferred/supplements", "https://vimergy.com/products/wild-blueberry", "http://amzn.to/2DjQjE9", "http://amzn.to/2mfPiJ0", "http://amzn.to/2DjQjE9", "https://www.medicalmedium.com/medical-medium-101.htm"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}