{"result_id": "200030", "URL": "https://www.medicalmedium.com/blog/tips-for-colds-flu", "timestamp": "2023-04-25 16:21:15 CEST+0200", "meta": {"description": "Medical Medium Tips for Cold & Flu:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/tips-for-colds-flu", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Tips for Cold & Flu", "cleaned_text": "When was the last time you suffered from cold or flu symptoms? Some people contract a flu virus (which, as I explain below, is often mistaken as a cold) every year or multiple times a year. Whether it's a sore throat, sinus infection, bronchitis, or pneumonia, a flu virus can trigger a host of unwanted and even life-threatening symptoms and conditions. Today you'll learn how to help prevent the flu and which supplements, foods, and measures you can take to heal from the flu.\n\nThe rhinoviruses that caused the common cold have been superseded by flu viruses that are much stronger. Today, it's likely someone experiencing cold-like symptoms actually has a mild variety of the flu. Another reason someone may have cold-like symptoms is because their body is doing an incredible job fighting off whatever virus is trying to infiltrate their system. Sneezing, sniffling, or a ticklish throat are usually signs of a flu strain.\n\nFlus are usually most rampant in fall and winter, but there are now waves of flus occurring year-round - even in summer. During these warm months, people still find themselves dealing with signs of a flu virus, including sinus infections, stomach bugs and bronchitis, so it's important to take protective steps year-round.\n\nOne reason for this never-ending flu season is the rise in international travel. When it's winter in one part of the world and flus are rampant, people still hop on planes and travel to places where it's summer, bringing flu viruses along for the ride.\n\nInstead of thinking in terms of seasons, think of flus in terms of cycles. There's typically a new flu on the horizon every six weeks.\n\nEveryone reacts to the flu differently. Some people come down with very high fevers and delirium, while others run low-grade fevers and go about their lives with little disruption. One reason for these varied responses may be the numerous flu varieties people can contract. Different strains provoke different issues. The strength of someone's immune system is another factor.\n\nPeople often mistake sizable mucus buildup in their systems for the stomach flu. In these instances, people are often suffering from a flu that's mostly sinus-related, and their stomach issues are from swallowing so much mucus. As a result, they may experience severe bloating, loss of appetite, and/or mucus-related coughing or vomiting.\n\nFlu viruses create mucus that drains most heavily during the night. Depending on the strain of flu, you may not have a cough initially. But as the mucus drains into the chest and builds up in the lungs, there's a good chance you'll develop one. After a few days, the mucus may begin to break up or additional sinus issues may arise, causing even more mucus to drain into the chest.\n\nWhen that mucus rests too long in the chest, bacteria can begin to grow, leading to bronchitis. You might be told this bacteria is pneumonia bacteria, but that isn't true. Pneumonia bacteria is simply the label medical communities have given the condition, because this bacteria is still a mystery to medical communities.\n\nThe troublesome bacteria is actually one or more of the dozens of varieties of undiscovered streptococcus or chlamydia bacteria. That's what causes the symptoms of bronchitis and pneumonia. Everybody has different varieties of this pneumonia bacteria in their system. The chlamydia bacteria is usually harmless, but it can cause issues if you are severely zinc deficient, consistently making poor food choices, dealing with a lot of stress or not practicing self-care.\n\nNot all sinus infections are related to a flu virus. Oftentimes chronic sinus infections are connected to chronic, low-grade streptococcus infections . If you have this kind of streptococcus infection and contract a flu virus, you might see your sinuses worsen severely for a period of time before returning to the usual level of affliction.\n\nSimilar to sinus infections, sore throats aren't always flu-related. Sore throats can be due to chronic, low-grade streptococcus. Unfortunately, a throat culture can't always accurately determine whether a sore throat is strep-related. A child or young adult with a really severe case of streptococcus may have white spots on the back of the throat or tonsils that can be swabbed and accurately identified as streptococcus.\n\nBut oftentimes, once streptococcus moves out of its early stages, swabbing for a culture doesn't accurately determine if someone has the bacteria. Frequently, chronic streptococcus can get into the lymphatic system and trigger a sore throat. In this case, a throat culture is unlikely to detect streptococcus. You can learn more about streptococcus in Medical Medium Liver Rescue: Answers to Eczema, Psoriasis, Diabetes, Strep, Acne, Gout, Bloating, Gallstones, Adrenal Stress, Fatigue, Fatty Liver, Weight Issues, SIBO & Autoimmune Disease.\n\nEpstein-Barr virus can also cause a sore throat. If you have Epstein-Barr in your body, it can move through the lymphatic system and arise in the throat. This is especially possible if your body is rundown. The virus can cause redness and soreness that typically emerges on only one side of the throat, though it can appear on both sides. Although your throat can be incredibly sore, you won't develop a cough, fever, mucus, or sinusitis.\n\nYou can learn more about Epstein-Barr virus in my books Thyroid Healing and Medical Medium.\n\nIf you suspect you have a flu virus, consider implementing some of these steps to help knock the virus out before it hits hard:\n• Practice good self-care —and especially get adequate sleep—if you notice yourself feeling run down, tired, frazzled or stressed.\n• Keep a bottle of high-quality liquid zinc sulfate on hand at all times. If you have the slightest inkling of symptoms, squirt zinc directly into your throat and let it coat the area. If you're sensitive to zinc, use just a few drops. Read about my zinc shock therapy.\n• Be mindful of your hands, and wash them regularly throughout your day. Shaking hands, pushing shopping carts and opening doors are among the ways your hands come into contact with germs. Keep your fingers and hands away from your eyes and face (where viruses can enter your body) whenever possible.\n• Carry handi-wipes when you're out. (You can use alcohol-based or alcohol-free wipes). When you're at a restaurant, wipe down your hands before your eat. If you're getting on an airplane, wipe down your seat and armrest. You can also wear a face mask.\n• When you're eating out, opt for piping hot dishes instead of raw dishes like salads. The heat from a very hot dish can help kill off a flu virus that might have contaminated your food.\n• Take supplements that build your immune system year-round. This can help prevent illness and speed recovery time if you do get sick. If you're unable to take these supplements year-round, take them ahead of times you know you'll be busy, stressed or traveling and ahead of times you expect you'll have more exposure to the flu. Important immune-strengthening supplements include: liquid zinc sulfate, cat's claw, vitamin C, lemon balm, L-Lysine, B-12 with adenosylcobalamin and methylcobalamin , and spirulina and chaga.\n\nThe foods you put into your body can either help prevent viruses or help feed and support viruses, including flu viruses. Medical research and science still don't know that viruses feed off certain food sources and proliferate. Find out more in Thyroid Healing: The Truth behind Hashimoto's, Graves', Insomnia, Hypothyroidism, Thyroid Nodules & Epstein-Barr . Eliminate these foods to help protect yourself:\n• Dairy products. You might feel fine after eating a piece of cheese or drinking a glass of milk, but these dairy products can silently create chaos by feeding any virus, including a flu virus, Epstein-Barr, cytomegalovirus, any of the HHVs (learn more about the herpes viruses here ); bacteria, such as streptococcus, E. coli or MRSA; and parasites or worms. If you're looking to avoid health issues, including a flu virus, eliminate milk, cheese, butter, kefir, yogurt, ghee, and other dairy products. If you already have the flu, eliminating dairy may reduce your symptoms.\n• Eggs Also feed pathogens. If you're not willing to give up eggs, bring a hearty amount of raw garlic into the meal. Even though the eggs will feed the flu virus, the raw garlic will help combat the bug.\n• Chicken. You may be wondering what's wrong with chicken. The answer has to do with avian influenza.\n\nFlu viruses can feed off birds, and they especially love chicken. Bird flu viruses tend to feed off the bird's adrenal glands and flesh cells, which often leads to dangerous and damaging outcomes.\n\nYou don't have to cut chicken out of your diet if: you really enjoy eating it, you don't struggle with any health issues, and you incorporate an abundance of leafy greens, fruits, and vegetables alongside the poultry. However, if you're doing everything possible to avoid catching the flu, eliminating chicken can help.\n\nIf chicken feeds flu viruses, should you eat the go-to cold-and-flu-meal of chicken soup? The answer is, unfortunately, no. You don't have to scrap the soup altogether though. Remove the chicken and fill the soup with a hearty amount of antiviral and anti-flu foods, including onion, garlic, herbs (thyme, rosemary, and oregano), and veggies (celery, carrots, cabbage, broccoli, cauliflower, zucchini, and bell peppers), and mushrooms. Or, if you really want to keep the chicken in, add even more onion, garlic, herbs, and vegetables to boost the nutritional and antiviral properties. Try this mineral-rich Healing Broth recipe.\n\nAnother reason to avoid chicken has to do with its fat content. Have you ever made chicken soup and left it in the fridge overnight? The next time you went to reheat the soup, you may have noticed a thick film of coagulated fat on top. This fat can draw oxygen out of the blood; slow down the liver; prevent oxygen from reaching the immune system, liver, and heart; and work against the immune system as it tries to fight viruses or bacteria.\n\nSeveral years ago, I was traveling during the height of flu season. Countless people were suffering from coughs, fevers, sinus issues, and more. I was worn out from constant travel and inadequate sleep, and I was feeling run down.\n\nDuring this time, I noticed a tiny tickle arise in my throat. I realized I was coming down with the flu, and Spirit of Compassion instructed me to do “zinc shock therapy.” I immediately squirted four dropperfuls of liquid zinc sulfate directly into my throat. I let the zinc sit in my throat and administered another dose two hours later. A few hours after that, I administered more. The next morning the subtle signs of an emerging sickness were completely gone! This dosage may be too much for some people, but you can still keep this tool in mind or discuss it with your health practitioner or doctor.\n\nThere are many powerful supplements you can use as weapons against a flu virus. Keep these on hand so that if symptoms appear out of nowhere you can address the issue right away:\n\nOlive leaf is a great daily supplement if you have Epstein-Barr-related symptoms or conditions. It's also helpful if you're starting to feel sick with flu-like symptoms (in this case, increase the dose).\n\nEchinacea and goldenseal help fight a flu. If you're battling streptococcus, strep throat, tonsillitis, or strep-related sinus infections, you may also benefit from using these periodically.\n\nLomatium root can help with flu symptoms, bronchitis, pneumonia, sinus problems, fever, and more.\n\nEyebright is amazing at knocking down flus and streptococcus.\n\nMullein leaf is incredible for shingles-related symptoms and conditions. It's also great for fighting the flu, sinus infections, bronchitis, and lung issues.\n\nMicro-C and cat's claw are great to take daily. If you start to feel sick, increase the amount.\n\nRed root can be another helpful supplement.\n\nWhen you buy supplements, look for high-quality capsules or alcohol-free tinctures. The Medical Medium preferred supplements page provides recommendations.\n\nRose hips tea with ample lemon juice added is helpful for flu symptoms, especially sore throats. Many other teas are helpful for flu symptoms too. Remember to add lemon juice for more healing benefits.\n\nIf you want to help your kids stay flu-free, use supplements in smaller doses, and consider working with a practitioner to determine the ideal amount for your child.\n\nThe Healing Broth recipe is great to fight off a flu. Even if you don't have a bug, the healing broth can be nourishing, supportive, and protective.\n\nCheck out the recipe for turmeric-ginger shots in Life-Changing Foods . This immune-boosting tonic is powerful, but it may be too strong for some people. If it's too intense, try making turmeric-ginger tea by steeping chunks of ginger and turmeric in boiling water. Drinking this soothing liquid throughout the day can shorten the length of your flu and protect you from developing bronchitis or pneumonia.\n\nInclude plenty of lemon/lime water; ginger water or tea; celery juice; cucumber juice; raw honey; fresh fruit and vegetable juices such as apple/cucumber juice, orange juice, and green juices; healing broth, and non-caffeinated herbal teas. Sticking to liquids while you have a flu will help you heal as quickly as possible.\n\nYou probably plug in and charge up your phone or computer every day. Next time you plug in your device, ask yourself how you can regularly charge up your immune system as well. The more you use protective tools and strengthen your immune system, the more likely you are to avoid the next nasty flu that cycles through your area.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/tips-for-cold-and-flu.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/tips-for-colds-flu", "author": "https://www.facebook.com/medicalmedium", "title": "Tips for Cold & Flu", "description": "Medical Medium: Tips for Cold & Flu  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vimergy.com/products/organic-zinc", "http://www.medicalmedium.com/blog/streptococcus-revealed", "http://amzn.to/2DjQjE9", "http://amzn.to/2mfPiJ0", "http://amzn.to/1VsZ4Qr", "https://vimergy.com/products/organic-zinc", "https://www.medicalmedium.com/blog/zinc-essential-mineral-for-health", "http://amzn.to/2nXzBn1", "http://amzn.to/2nfRIr1", "https://vimergy.com/products/organic-zinc", "https://vimergy.com/products/cats-claw", "https://vimergy.com/products/micro-c", "https://vimergy.com/products/lemon-balm", "https://vimergy.com/products/l-lysine", "https://vimergy.com/products/b12", "https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/chaga", "http://amzn.to/2mfPiJ0", "http://www.medicalmedium.com/blog/herpes-viruses", "https://www.medicalmedium.com/blog/healing-broth", "https://vimergy.com/products/organic-zinc", "https://vimergy.com/products/organic-olive-leaf", "http://amzn.to/2nGqk2n", "https://vimergy.com/products/organic-goldenseal", "https://vimergy.com/products/elderberry", "http://amzn.to/2n7BTlX", "http://amzn.to/2leL9o1", "https://amzn.to/2BSe5sD", "http://amzn.to/2n1CyU3", "https://amzn.to/36y1Unk", "https://vimergy.com/products/micro-c", "https://vimergy.com/products/cats-claw", "http://amzn.to/2ng2ZYj", "http://www.medicalmedium.com/preferred/supplements", "http://amzn.to/2n1FmAA", "http://www.medicalmedium.com/blog/healing-broth", "http://amzn.to/1SINq5p", "https://www.medicalmedium.com/mm101/medical-medium-lemon-water.htm", "https://www.medicalmedium.com/mm101/medical-medium-ginger-water.htm", "https://amzn.to/2Xz811P", "https://www.medicalmedium.com/mm101/medical-medium-cucumber-juice.htm", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}