{"result_id": "200015", "URL": "https://www.medicalmedium.com/blog/heavy-metal-detox", "timestamp": "2023-04-25 16:21:08 CEST+0200", "meta": {"description": "Medical Medium Heavy Metal Detox:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/heavy-metal-detox", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Heavy Metal Detox", "cleaned_text": "Toxic heavy metals such as mercury, aluminum, copper, cadmium, lead, arsenic, nickel, chrome, alloy, and steel are hidden antagonizers that can find their way into our bodies and wreak havoc. They are one of the Unforgiving Four, which is a group of dangers we are exposed to that threaten our health and well-being. I discuss The Unforgiving Four in-depth in my book Life-Changing Foods: Save Yourself and the Ones You Love with the Hidden Healing Powers of Fruits & Vegetables. If you want to heal from chronic illness and symptoms, removing the heavy metals in your body and brain is an incredible place to start. Below I share some of the symptoms triggered by heavy metals, the history of heavy metals, and a heavy metal detox plan.\n\nHeavy metals can cause ADHD, ADD, autism, depression, OCD, mood disorders, Alzheimer’s, focus, concentration and memory loss issues, and much more. They can also increase any viral or bacterial issues you may be battling. For example, heavy metals can serve as a feeding ground for Streptococcus A or B, E. coli, C. difficile, H. pylori, and yeast cells. This can create an overgrowth of multiple bacteria in our gut, resulting in a condition known as SIBO (small intestinal bacterial overgrowth), which is characterized by bloating, abdominal pain, diarrhea, constipation (or both), and can lead to nutrient deficiencies. Additionally, when viruses such as Epstein-Barr and shingles feed off toxic heavy metals, this can produce symptoms such as tingling, numbness, fatigue, anxiety, heart palpitations, ringing in the ears, dizziness and vertigo, as well as neck pain, knee pain, foot pain, pain in the back of the head, and a variety of other aches and pains that are often attributed to other causes.\n\nIt's virtually impossible not to take in a certain amount of these toxic heavy metals in our modern era, so it's vitally important to our health that we get them out before they can wreak further havoc on our health.\n\nIt may be surprising to learn that toxic heavy metals have been inside of many of us since before we were born. The heavy metals we are born with are passed on through our family line and can be up to a thousand years old. Although mercury was in the earth well before then, it wasn’t until two to three thousand years ago that people started to mine mercury and gather it for various uses. Mercury mining is the reason the mercury inside of us can be up to eighty generations old! As this old mercury has been passed from generation to generation, each succeeding generation grows more intolerant to the toxic heavy metal.\n\nUnfortunately, it is these “old” metals, the ones that have been lurking in our system for prolonged periods of time, that pose the greatest threat. For example, over time toxic heavy metals can oxidize, causing damage to surrounding tissue and promoting inflammation. They literally poison our bodies, and can inflict damage on virtually every system and organ, including our brain, liver, digestive system, and other parts of our nervous system. Toxic heavy metals put an immense burden on our immune system, leaving us vulnerable to a variety of illnesses and are also a form of neurotoxin (a poison that disrupts nerve function and confuses your immune system) which can leave your health in a compromised state.\n\nYou may be wondering where this inherited mercury comes from. One example stems from the trend of mercury elixirs given in conventional medical offices during the seventeen and eighteen hundreds. If you went to a conventional doctor for anything from a stomach ache to a broken leg, you were given a big glass of water mixed with mercury. This tonic was mandatory upon entering a conventional doctors' office regardless of your age or health issue. The effects were devastating, and many patients lost their families, their work, and their sanity. Mercury doesn’t leave our bodies unless we know exactly how to detoxify them the right way, so the toxic mercury elixirs our forefathers and foremothers drank are still affecting new generations. This is only one of the ways people were exposed to this heinous heavy metal. You could knowingly or unknowingly be affected by some of this old, inherited mercury, so it’s important to have the tools to detoxify mercury and other toxic heavy metals from your system.\n\nOver the last thirty years, we’ve grown more intolerant to mercury than ever before, and we are not only dealing with inherited mercury, but new mercury that enters our bodies through environmental exposure. Presently, mercury is falling out of the sky, it’s in our water, in our food, in pesticides, and more. Even if you are skeptical of having inherited mercury, you’ve most likely come into contact with new mercury during your lifetime. Have you ever eaten a can of tuna? Perhaps you’ve had pesticides sprayed inside your home or lived in a heavily sprayed apartment complex. These are just a few ways in which you might have encountered this toxic heavy metal.\n\nMercury gathers together in the body. If you have inherited mercury or been exposed to it in your lifetime, it will find any new mercury you come into contact with and collect together in your system. Unfortunately, mercury becomes more toxic as it builds on itself over time. This occurrence can be seen by the worsening of symptoms throughout someone’s life, such as an increase in OCD, anxiety, depression, or memory loss.\n\nThe reason people experience different heavy metal symptoms at varying levels of severity is because heavy metals reside in unique areas of the brain and body for each individual. One person may have heavy metals in the left temporal lobe while someone else may have a pocket near the pituitary gland. Everybody has different types of metals in their systems as well. These unique blends, which I call alloys, reflect off one another causing even greater issues. For instance, one person may have a little mercury, lead, aluminum, and copper, while someone else may have a high level of mercury and only a little aluminum. This is the reason that depression, anxiety, and other symptoms can look so different for each person. Add in the oxidation of the heavy metals and the strengthening of pathogens that feed off these metals, and it’s easy to see why these metals pose such a big threat to our health and create a vast variety of confusing symptoms that aren't understood by the patient or health practitioner.\n\nWhy We Need These Heavy Metals Out\n\nWhy is a heavy metal detox essential for health and vitality? Because our neurotransmitters are short circuiting, burning out, and being destroyed by the toxic heavy metals that bring about brain fog, confusion, lack of motivation and many other devastating symptoms. If you find your emotions easily takeover or emotional situations often times become too much for you to bear, the electrical impulses in your body are likely running into heavy metals and short circuiting. Hold onto the truth that you are not crazy. You are completely sane and have heavy metals in your system that are triggering these issues. Fortunately, you can halt the corrosion and oxidation of heavy metals, pull these metals from the brain, liver, and other areas of the body where they are causing problems, and heal your neurons, neurotransmitters, and more.\n\nIf you are experiencing any heavy metal-related symptoms, know that it’s not because your body is attacking itself or because you have “bad” genes. You, like most people in the world today, likely have heavy metals in your body that need to come out. There are five critical foods that you can consume daily to pull heavy metals out: cilantro, wild blueberries, Spirulina, Barley Grass Juice Powder, and Atlantic dulse. You can find my preferred brands of these foods here. Check out the Heavy Metal Detox Smoothie, which includes these five foods that work together to grab onto metals and pull them completely out of the body.\n\nHere’s a quick look at some of the properties of these five foods:\n\nSpirulina: This edible blue-green algae draws out heavy metals from your brain, central nervous system, and liver, and soaks up heavy metals extracted by barley grass juice extract powder. Take 2 teaspoons mixed in water, coconut water, or juice.\n\nBarley grass juice powder: prepares the mercury for complete absorption by the spirulina. This nutritive grass has the ability to draw heavy metals out of your spleen, intestinal tract, pancreas, thyroid, and reproductive system. Drink 1-2 teaspoons mixed into coconut water or juice.\n\nCilantro: Goes deep into hard-to-reach places, extracting metals from yesteryear (so it’s great for that mercury inheritance you’re carrying around!). Blend one cup in a smoothie or juice, or add to salad or guacamole.\n\nWild blueberries: Draw heavy metals out of your brain tissue, healing and repairing any gaps created by oxidation when the heavy metals are removed. It is important to use wild blueberries, as they possess unique phytonutrients with special detoxifying capabilities. The potent antioxidants in wild blueberries help reverse any oxidative damage left behind by the heavy metal removal. This is especially important for your brain tissue—in fact, wild blueberries are the most powerful food for halting or in some cases reversing Alzheimer’s and dementia. Eat at least one cup daily. Note: while cultivated blueberries are nutritious, they lack the metal-drawing ability of the wild blueberries. Wild blueberries can be found in the freezer section of most supermarkets.\n\nAtlantic dulse: In addition to mercury, this edible seaweed binds to lead, aluminum, copper, cadmium, and nickel. Unlike other seaweeds, Atlantic dulse is a powerful force for removing mercury on its own. Atlantic dulse goes into deep, hidden places of the digestive tract and gut, seeking out mercury, binding to it, and never releasing it until it leaves the body. Eat two tablespoons of flakes daily, or an equal amount of strips if it’s in whole-leaf form. Note: As it comes from the ocean, if you are concerned about the dulse itself having mercury, be aware that Atlantic sea dulse will not release any mercury it might possess into the body. It holds on to the mercury as it works its way through, and even grabs onto other metals along the way and drives them out as well. Atlantic dulse is a critical part of the team because it can hang out near the finish line (i.e., our colon), waiting for the other foods that have been grabbing on to heavy metals along the way. It serves as emergency backup, helping ensure that all the heavy metals that made it as far as the colon actually leave the body.\n\nAlong with whipping up a daily smoothie, drinking celery juice in the morning is highly beneficial. The mineral salts in the celery juice give extra support to the five heavy metal detox foods by helping to flush metals out of the liver.\n\nWhile you work to detox heavy metals, try eliminating eggs, pork, and any dairy products from your diet. If you love animal products, try to lower your intake of free-range chicken or grass-fed beef to once a day, and if you’re vegetarian or vegan, lower your plant-based fats. These dietary changes will help with the process of drawing heavy metals out of the body. At the same time, fill your body with an abundance of fruits and vegetables so that as you heal you feel nourished and satisfied and gain their healing benefits also!\n\nLike all elements of the Unforgiving Four, it is important that you and your loved ones become aware of the toxic heavy metals and the destruction they can cause. We can’t heal unless we know what’s behind our conditions and symptoms, so this information is truly crucial. If you suffer from any heavy metal-related symptoms, start incorporating the five heavy metal detoxifying foods listed above every day. Anyone can benefit from simply adding in these five foods for all their other nutritional and healing benefits also, so feel free to whip up extra smoothies for your family and friends to support their health even more.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/heavy-metal-detox.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/heavy-metal-detox", "author": "https://www.facebook.com/medicalmedium", "title": "Heavy Metal Detox", "description": "Medical Medium: Heavy Metal Detox  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.medicalmedium.com/life-changing-foods ", "https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/barleygrass-juice", "http://amzn.to/2jr3U6d", "http://www.medicalmedium.com/blog/heavy-metal-detox-smoothie", "https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/barleygrass-juice", "http://amzn.to/2jc8W2V", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}