{"result_id": "200002", "URL": "https://www.medicalmedium.com/blog/turmeric-ginger-shots", "timestamp": "2023-04-25 16:21:03 CEST+0200", "meta": {"description": "Medical Medium Turmeric Ginger Shots:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/turmeric-ginger-shots", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Turmeric Ginger Shots", "cleaned_text": "Turmeric is famous for containing curcumin, a phytochemical with anti-inflammatory properties, turmeric is a particular asset for conditions such as lupus, in which the body can get stuck in a habitual cycle of reaction, even after the invader (in the case of lupus, the Epstein-Barr virus) is no longer present. Sometimes, though, once a cycle gets started, the body needs an ally to come in and break the pattern. Turmeric is ideal for this job, because it contains natural and very beneficial steroidal compounds from the curcumin as well as other aspects of the turmeric that are critical to calm down outsized inflammatory responses to pathogens.\n\nTurmeric is great for anything in the body that’s inflamed and causing pain, from nerves to joints to the brain. Turmeric is the ultimate antidote. At the same time that it attends to inflammation, turmeric’s powerful agents and compounds increase blood supply to areas of the body that need enhanced circulation, which makes this an ideal spice for those who have chronic histamine reactions, or toxic blood due to a sluggish liver or poor circulation. Turmeric’s high level of manganese combined with its curcumin make it great for the cardiovascular system—it lowers bad cholesterol, raises good cholesterol, helps inhibit tumors and cysts, and can prevent virtually any type of cancer, especially skin cancers. Plus, the manganese activates curcumin’s ability to extract toxic heavy metals from your system.\n\nGarlic is one of the world’s oldest medicines and is an incredibly potent spice that can ward off a variety of illnesses and diseases. It has amazingly high levels of vitamins and minerals including vitamin C and B-6 and minerals such as selenium, calcium, copper, and iron. Garlic also contains very strong antibiotic, anti-fungal, anti-cancer, and anti-viral properties. One raw crushed clove of garlic contains the antibiotic equivalent of 100,000 units of penicillin and has been proven to be more effective than both penicillin and tetracycline in suppressing certain types of disease carrying agents. Garlic contains a compound called allicin which has been shown to help significantly lower cholesterol and blood pressure by inhibiting the HMG-CoA reductase enzyme within the liver cells and blocking platelet clot formation in the blood vessels.\n\nGinger is known to greatly aid in digestion and assimilation and is widely regarded to help prevent colds, flu, motion sickness, and vertigo. Ginger can also help to alleviate menstrual cramps, nausea, heartburn, migraines, sore throats, exhaustion, fatigue, and constipation and it is great in providing relief from the stomach flu and food poisoning. Ginger also contains potent anti-inflammatory compounds called gingerols and is a powerful painkiller which makes it especially beneficial for those who suffer with joint, muscle, and nerve pain. Ginger has incredible immune-boosting and germ fighting abilities and has even been shown to help provide protection and relief from E.coli, Staph infections, and Candida albicans.\n\nOranges have been known to help prevent cancer, lower high blood pressure, fight off viral infections, relieve constipation, keep bones and teeth strong, prevent kidney stones and macular degeneration. Oranges are rich in lime and alkaline salts that help to counteract and prevent acidosis in the body. They are also excellent for the digestive tract and help to remove toxic debris from the colon through enhanced peristaltic action. Oranges contain a significant amount of glutathione which is critical for healthy eye and lung function. Oranges are very good for respiratory problems such as asthma or bronchitis and cardiovascular issues such as hypertension and COPD. Oranges act as an internal antiseptic to the body and have the ability to purify and strengthen all the organs in the body.\n\nThese fiery, immune-boosting shots are a tasty variation on the turmeric-ginger serum I mentioned above. A go-to option for the first sign of a cold, these shots will help your body fight back against anything that tries to come against it!\n\nOne at a time, run each ingredient through the juicer, keeping the juices separate. Combine 1 teaspoon turmeric juice, 1 teaspoon ginger juice, 1/4 teaspoon garlic juice, and 1/4 cup orange juice in a small glass. Stir to combine and drink immediately.\n\nNote: the amount of ingredients necessary will vary greatly based on the juicer that is used.\n\nCan I sip the juice, or do I need to drink it in one shot?\n\nYou can drink it however you prefer.\n\nHow many times a week can I drink these shots?\n\nYou can take it daily if you’d like.\n\nCan I keep the juice in the fridge?\n\nIt’s best to drink it immediately after preparing it for the greatest benefits.\n\nNo, contrary to popular belief black pepper is not necessary.\n\nWould turmeric or ginger powder work instead of the fresh root?\n\nFor this recipe they each need to be the fresh root.\n\nWill this work the same way if I blend the ingredients in a blender?\n\nIt won’t have the same therapeutic benefits but it will still have many. If you do blend them, you can then strain the mixture through a fine mesh strainer, cheesecloth or nut milk bag, discard the pulp and drink the juice.\n\nWhat juicer do you recommend?\n\nOmega Juicer is great depending on your budget, but any juicer will work.\n\nDo the ingredients need to be organic?\n\nOrganic ingredients are ideal but you can also use conventional.\n\nCan I use less garlic, turmeric or ginger than the recipe calls for?\n\nYes, you can.\n\nShould I peel the ginger and turmeric?\n\nNo, it’s not necessary to peel them. It’s your choice. Just be sure to wash them well if you don’t peel them.\n\nIs it ok to take this while pregnant or breastfeeding?\n\nYes, it’s fine to take in both cases.\n\nYes, you can exclude the garlic. It won’t have exactly the same healing properties but it will still be incredibly beneficial.\n\nCan I use something other than oranges?\n\nYes, you could try some apple juice if you wish. It won’t taste the same but it will still be very healing.\n\nContrary to some mistaken theories, garlic does not kill productive bacteria in the intestinal tract. It only kills unproductive bacteria, which runs on a positive frequency. Don’t confuse this with the term gram-positive, which doesn’t actually refer to electrical charge. Both gram-positive and gram-negative bacteria that are harmful to humans run on a positive frequency. On the other hand, productive, beneficial bacteria (regardless of whether they’re gram-negative or gram-positive) run on a negative frequency, the same frequency that humans run on. Not to be mistaken for negative, unfavorable energy, this negative charge is a good thing; it’s our source of grounding. Unproductive bacteria, worms and other parasites, fungi, and viruses all run on a positive charge. When they take hold in our systems, they drain our batteries, and we lose our grounding. Then along comes garlic, which has anti-pathogenic properties that are positively charged.\n\nThis like fights like, and garlic rids us of the pathogens that were harming us. Because beneficial bacteria in our guts and other microorganisms that benefit us are negatively charged and grounded, garlic doesn’t wipe them out. While there is a certain abrasive aspect to garlic, it is abrasiveness that’s to your benefit. Rest assured that garlic does not disrupt anything that shouldn’t be disrupted—it does not hurt you. On the contrary, it’s perfect to fight colds, flus, strep throat, pneumonia-causing bacteria, and viral-related cancers.\n\nYou can find more information in the New York Times best-selling book, Medical Medium Cleanse to Heal: Healing Plans for Sufferers of Anxiety, Depression, Acne, Eczema, Lyme, Gut Problems, Brain Fog, Weight Issues, Migraines, Bloating, Vertigo, Psoriasis, Cysts, Fatigue, PCOS, Fibroids, UTI, Endometriosis & Autoimmune.\n\nThe information provided on this Site is for general informational purposes only, to include blog postings and any linked material. The information is not intended to be a substitute for professional health or medical advice or treatment, nor should it be relied upon for the diagnosis, prevention, or treatment of any health consideration. Consult with a licensed health care practitioner before altering or discontinuing any medications, treatment or care, or starting any diet, exercise or supplementation program. Neither Anthony William nor Anthony William, Inc. (AWI) is a licensed medical doctor or other formally licensed health care practitioner or provider. The content of this blog and any linked material does not necessarily reflect the opinions of Anthony William, AWI or the principal author, and is not guaranteed to be correct, complete, or up to date.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/turmeric-ginger-shots-healing-recipe.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/turmeric-ginger-shots", "author": "https://www.facebook.com/medicalmedium", "title": "Turmeric Ginger Shots", "description": "Medical Medium: Turmeric Ginger Shots  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "vimeo", "width": null, "height": null, "embed_code": "<iframe class=\"embed-responsive-item\" src=\"https://player.vimeo.com/video/376737479\"/>", "src": "https://player.vimeo.com/video/376737479"}], "links": ["https://omegajuicers.com/collections/low-speed-horizontal-juicers/products/mm900hds-low-speed-juicer", "https://geni.us/cleanse-to-heal", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}