{"result_id": "200018", "URL": "https://www.medicalmedium.com/blog/pet-health", "timestamp": "2023-04-25 16:21:10 CEST+0200", "meta": {"description": "Medical Medium Pet Health:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/pet-health", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Pet Health", "cleaned_text": "Like humans, our pets can encounter a number of health issues throughout their lives. Whether your pet is dealing with a neurological condition, cancer, a thyroid problem, bad breath, or anything else, there are steps you can take to support them and improve their health.\n\nThere are a number of health issues you have to watch out for as a pet owner. Working with a compassionate, understanding veterinarian is crucial. Some people opt for a holistic vet, while others choose a more conventionally-minded veterinarian. Today many veterinarians seem to be implementing a mix of allopathic and holistic ideas in their practices. Find someone you love and respect.\n\nDr. Jeff Feinman is a brilliant and compassionate holistic veterinarian who offers a number of incredible resources, informative materials and online support on his website holisticactions.com. Consider joining his online Holistic Pet Care Community, where you’ll be part of empowering online meetings.\n\nIf you have a pet in your life, you probably already know in your heart and soul that they make wonderful therapy companions. Whether it’s a dog, cat, bird, horse, rabbit, or other cuddly critter, your pet can help you heal:\n• Pets stimulate your immune system and can play a part in helping heal disease and illness.\n• Your natural killer cells can become more responsive when you’re around your pets.\n• Your platelets are also responsive, and a pet in your life can positively stimulate platelet production if you’re struggling with a low platelet condition.\n• A pet can help your adrenals calm down and balance out.\n\nYes, there are temporary, infrequent moments where you’ll have frustration with your pet. But these stressors are outweighed by the countless moments where your pet brings healing for your adrenals, immune system, and more.\n\nIf you don’t have a pet, but you scratch the back of your neighbor's dog or pet your friend’s cat, you’re still stimulating your immune system. Just touching or briefly cuddling an animal can elicit positive responses in the body.\n\nMany animals develop cysts, tumors, and nodules during their lifetimes. Lipomas, which are fatty tumors, can grow quite large in both cats and dogs. Tiny tentacle-like roots extend out from the tumor in search of food. Consequently, if you feed your animals toxic foods that fuel the lipoma, its roots will draw these foods in and it will keep growing. Taking certain toxic foods out of your pet’s diet can halt the lipoma’s growth.\n\nGMO foods are especially problematic fuel for lipomas and can trigger aggressive growth, so make your pet’s diet GMO-free if possible. If your pet has serious lipoma issues, a grain-free diet is ideal. If you can only afford to feed your pet food that contains some unproductive ingredients, don’t stress yourself out. I know you’re doing the best you possibly can.\n\nAdding these supplements to your pet’s daily routine can help prevent and slow down the growth of lipomas:\n\nIf your pet badly itches and bites their fur out in certain places, they may be suffering from hot spots. Typically hot spots are a reaction to something in the animal’s diet. Try switching your pet’s food to better choices, but know it may take six to eight weeks to notice changes. If you don’t notice any difference after this period of time, try changing your pet’s food a second time. Then reassess, and if you’re still not seeing changes, switch up the diet a third time.\n\nOftentimes, unhealthy food, such as food with fillers or other unproductive ingredients, plays a part in the development of hot spots. Changing up food, even if it’s clean, healthy food, can help break up the hot spot and fur loss cycle. Bringing vitamin C into your pet’s daily protocol can help heal the wounds.\n\nHelping your pet heal from a UTI can be challenging, and chronic UTIs can be especially painful for an animal.\n• Vitamin C is an essential preventative measure that builds your pet’s immune system.\n• Pau d’arco is great for UTI support and helps with teeth problems.\n• A tiny bit of propolis can be helpful for UTIs, teeth issues, and gum infections.\n• Adding small amounts of fresh oregano and parsley into your pet’s food can also help with UTIs.\n\nIf your pet suffers from heart disease or vascular issues, it’s critical to provide him or her with coenzyme Q10 and vitamin C. From here, work with your holistic veterinarian to figure out what particular supplements your pet needs.\n\nHow I Care For My Dogs\n\nBelow I’ll share some things I do to care for my dogs. Hopefully this information provides you with some new ideas and insights, regardless of the kind of pet you own. Talk to your veterinarian about which practices would be best for your pet.\n\nI’ve fed raw meat, vegetables and fruits to every dog I’ve had since childhood. Over thirty years ago, this was considered reckless and dangerous. Fortunately, this particular diet has grown immensely popular in recent years. Now raw food and dehydrated raw food line the shelves of pet stores, and almost all conventional and holistic vets praise this dietary option.\n\nMy dogs have always had good results from eating raw, grass-fed meat. Try your best to avoid factory-farmed meat, and stick with high-quality, grass-fed varieties whenever possible. Instead of purchasing ground meat, opt for a whole, grass-fed selection, which typically contains less bacteria.\n\nIn various Medical Medium resources, I’ve mentioned the seven acids that make up your stomach's hydrochloric acid. This blend is unique to humans. Dogs have their own blend, which is made up of twenty acids, and cats have a similar combination. Science and research have yet to discover the truth about our stomach’s hydrochloric acid blends.\n\nIf your pet is a carnivore, he or she may really enjoy and benefit from raw meaty bones. Marrow bones, which are loaded with minerals that are ideal for dogs, cats, and other carnivorous pets, are particularly incredible. The mineral composition inside these bones can transform the health of your pet. You can always consult your vet if you wish to feed your pets raw meaty bones. It’s important to never feed your pet cooked bones because they can splinter and be hazardous, plus they can’t be digested.\n\nIf you’ve always fed your pet cooked meat and veggies but haven’t ever encountered food-related health issues, you can definitely continue providing your pet with a cooked diet (with the exception of cooked bones). Sweet potatoes can be an especially great cooked vegetable option. If health issues do arise, you may want to try bringing in some raw food.\n\nThere are many high-quality raw food sources today, including:\n• The Honest Kitchen company sells raw, dehydrated cat food and dog food. You simply add a little water and have a tasty, wholesome dish for your pet in no time.\n\nIn addition to the raw meat, I give my dogs homemade meals. Around lunchtime, I make my dogs a mash by throwing an apple and two celery sticks into the food processor for each dog. I often add a little barley grass juice extract powder and a little B-12 with methylcobalamin and adenosylcobalamin as well.\n\nI try to incorporate wild blueberries into my dogs’ diet every day. I often grind a pint of defrosted frozen wild blueberries in their lunchtime mash. Sprinkling a touch of flaxseed meal or chia seed meal into your dog’s food will help protect their immune system (note that too much of either seed may cause bloating).\n\nAround dinnertime, I give my dogs larger-sized, raw, meaty, marrow bones. I let them chew on the bones a bit, rip off some meat, and lick out some of the marrow. After that, I push the rest of the marrow out of the bone with my thumb and give it to them. I try to ensure they don’t crunch too much of the bone because it could be problematic if they accidentally swallowed a large piece.\n\nFruit is incredibly beneficial for your health and your pet’s health. Whether you have a puppy or a full grown dog, try giving your pooch a few different pieces of fruit, such as bananas, papaya, berries, apples, and pears whenever you can.\n\nFruit can help support your pet’s nervous system, help prevent and discontinue the growth of lipomas, and assist in the prevention and reversal of cancers. The antioxidants in fruits will support your animal’s immune system, and just a little fruit each day can do wonders for your pet’s health!\n\nMy dogs eat veggies as well. They also love to munch on celery, which is an herb, and each of them eats around four to five sticks per day. I give them a few veggies after their morning meal of grass-fed beef and again in the afternoon after they devour their marrow bones. Cucumber is another favorite snack of theirs.\n\nIt’s alright for your dog or cat to eat a little grass if they go outside, as long as you don’t spray your yard with dangerous chemicals or live in a community that sprays. You may even want to grow a wheatgrass bed indoors for your cat. Sometimes when dogs and cats feel sick or unwell, they try to eat a large quantity of grass in an attempt to make themselves throw up, but this can actually create a dangerous blockage in your pet’s intestinal tract. Try to prevent too much outside grass consumption. Let your vet know if your pet is overeating grass outside, or seek support online with a resource like Holistic Actions.\n\nAn amazing way to bring greens into your animal’s life is to add a little barley grass juice powder into their food.\n\nIf your only choice is between low-quality, GMO dog food that contains fillers, byproducts, and chemicals versus homemade dog food that contains grains, I’d recommend the grain-containing homemade dog food. You could combine cooked brown rice with a bit of sweet potato, winter squash, broccoli, or celery and make a meal that’s significantly better than store-bought GMO food. However, if you can provide grain-free meal options, that’s ideal. I like keeping my dog’s diet grain-free, but there are some animals that are dependent on grains—it’s important to keep your unique pet in mind when creating a diet plan.\n\nSome people feed their dogs or cats a vegan diet. This type of diet can be beneficial short-term if you’re trying to reverse an illness, but alongside the vegan diet it’s critical to provide wild salmon oil. Because cats and dogs are carnivores, they cannot thrive on a regular vegan diet. You can find the wild salmon oil I recommend on the Medical Medium preferred pet products page.\n\nAddressing any deficiencies your pet may have is essential. Consider:\n• SeaMeal™, a kelp-based supplement that provides your pet with some essential vitamins and minerals.\n• Barley grass juice powder sprinkled into daily meals to help with deficiencies.\n• B-12 with methylcobalamin and adenosylcobalamin can bring a positive shift in your pet’s health, and it’s especially important if your pet is suffering from neurological or nervous system problems. Just a few drops can help, though if your pet is larger, a couple more drops may be beneficial.\n• Vitamin C can support a number of health problems, including neurological and central nervous system issues.\n• A drop or two of high-quality zinc can be helpful for animals, especially those with thyroid disease. Thyroid disease in animals is similar to thyroid disease in humans. I share the true, unknown cause of Hashimoto’s disease, which is Epstein-Barr virus, and other undiscovered truths about thyroid conditions in Thyroid Healing.\n• Glucosamine and chondroitin, though I’ve never seen them provide abundant support for serious joint and arthritis problems in humans, can be highly supportive in animals.\n• MSM also seems to work even more effectively for pets than humans.\n• Rescue Remedy’s alcohol-free tincture for helping to keep pets calm and cool is helpful.\n\nThe Medical Medium preferred pet products page highlights high quality supplements, including the line of alcohol-free, veterinary herbal extracts by Hawaii Pharm.\n\nThere are some foods pets should not eat:\n• Some varieties of avocado, such as those grown in the West Indies and the larger avocado varieties found in Florida, aren’t safe for your pet. (A regular Hass avocado is OK).\n• Macadamia nuts should not be fed to dogs or cats.\n• Chocolate is poisonous to cats and dogs.\n• Tinctures that contain alcohol should be avoided, unless that’s all you have to work with.\n\nOur pets mean so much to us. Some people describe their pet as their baby, child, or best friend. Our animals are some of our closest companions and have been there through the best and worst moments of our lives.\n\nIt’s important to take care of your sweet animals and provide for their health, but it’s also important to support your own health so that your pets have the healthiest, most vibrant parent possible. If you’re struggling with your own health, check out my radio shows, articles, books, and other Medical Medium resources.You and your pet can grow in wellness together.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/pet-health.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/pet-health", "author": "https://www.facebook.com/medicalmedium", "title": "Pet Health", "description": "Medical Medium: Pet Health  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.homevet.com/", "http://www.holisticactions.com/", "http://www.holisticactions.com/", "https://vimergy.com/products/micro-c", "https://vimergy.com/products/organic-olive-leaf", "http://amzn.to/2so86Fd", "https://vimergy.com/products/ester-c", "https://vimergy.com/products/micro-c", "https://vimergy.com/products/organic-olive-leaf", "http://amzn.to/2so86Fd", "https://amzn.to/36y1Unk", "https://www.holisticactions.com", "http://amzn.to/2rqppIH", "https://vimergy.com/products/ester-c", "http://amzn.to/2rG1aa5", "http://amzn.to/2sfopF2", "http://amzn.to/2sf4Pc5", "https://vimergy.com/products/barleygrass-juice", "https://vimergy.com/products/b12", "http://amzn.to/2qC91Wb", "http://amzn.to/2sogMeM", "https://www.holisticactions.com/", "https://vimergy.com/products/barleygrass-juice", "http://amzn.to/2qChdSq", "http://www.medicalmedium.com/preferred/pets", "http://ambayagold.com/pet-health-2/", "https://www.medicalmedium.com/blog/SeaMeal%E2%84%A2", "https://vimergy.com/products/barleygrass-juice", "https://vimergy.com/products/b12", "https://vimergy.com/products/micro-c", "https://vimergy.com/products/organic-zinc", "http://amzn.to/2mfPiJ0", "http://amzn.to/2qCA5R0", "http://amzn.to/2qHvSLn", "https://amzn.to/35MZiBN", "http://amzn.to/2sfwR7m", "http://amzn.to/2sfu0eC", "http://www.medicalmedium.com/preferred/pets", "http://www.medicalmedium.com/radio", "http://www.medicalmedium.com/medical-medium-blog", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}