{"result_id": "200017", "URL": "https://www.medicalmedium.com/frequently-asked-questions", "timestamp": "2023-04-25 16:21:09 CEST+0200", "meta": {"description": "Medical Medium", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/frequently-asked-questions", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Medical Medium Frequently Asked Questions", "cleaned_text": "Does the Medical Medium have a medical background? Anthony William, the Medical Medium since the age of four has been using his gift to see into people’s conditions and tell them and their doctors how to recover their health. Anthony was born with the unique ability to converse with the Spirit of Compassion, who provides him with extraordinarily advanced healing medical information that’s far ahead of its time. One example of this is how Medical Medium published the truth that Epstein Barr causes Multiple Sclerosis many years before Harvard published their paper about Epstein Barr being involved with Multiple Sclerosis. Neither Anthony William nor Anthony William, Inc. is a licensed medical doctor or other formally licensed health care practitioner or provider. Read his NYT #1 Bestselling books for more about the background the Medical Medium. FIND OUT MORE\n\nWhat does a Medical Medium do? Medical Medium refers to Anthony William, the Medical Medium that millions of people rely on for health answers from his #1 New York Times best-selling books. Anthony William, the Medical Medium, provides compassionate, life-altering guidance to help people heal from a vast range of brain and neurological symptoms, diseases, and disorders. Medical Medium books and podcasts have also helped people heal from ailments that have been misdiagnosed or ineffectively treated, or that doctors could not resolve on their own until they had access to the Medical Medium book series. FIND OUT MORE\n\nWhen did Medical Medium come out? Medical Medium was first published on November 10, 2015 and was written by Anthony William. The Revised and Expanded Edition of Medical Medium was published on March 23, 2021. Both editions are published by Hay House and are available in hardcover, audiobook and Kindle formats. More information can be found at medicalmedium.com FIND OUT MORE\n\nWhen was Medical Medium first published? Medical Medium was first published on November 10, 2015 and was written by Anthony William. The Revised and Expanded Edition of Medical Medium was published on March 23, 2021. Both editions are published by Hay House and are available in hardcover, audiobook and Kindle formats. More information can be found at medicalmedium.com FIND OUT MORE\n\nMedical Medium was first published on November 10, 2015 and was written by Anthony William. The Revised and Expanded Edition of Medical Medium was published on March 23, 2021. Both editions are published by Hay House and are available in hardcover, audiobook and Kindle formats. More information can be found at medicalmedium.com FIND OUT MORE\n\nNo, Anthony William the Medical Medium no longer takes appointments. Over decades of helping doctors and their patients find the answers they needed, Anthony found that he could only help so many as his waiting list continued to grow into the millions. For decades Anthony has been asked to put his unique advanced healing information in books so that people all around the world can have access to this advanced resource. Anthony now dedicates much of his time and energy to listening to Spirit of Compassion’s information and placing it into books so that everybody can have an opportunity to heal. FIND OUT MORE", "opengraph": {"title": "Medical Medium Frequently Asked Questions", "image": "https://www.medicalmedium.com/engage-images/anthony-william-medical-medium-portrait.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.medicalmedium.com/medical-medium-about-anthony-william", "https://www.medicalmedium.com/medical-medium-about-anthony-william", "https://www.medicalmedium.com/books", "https://www.medicalmedium.com/books", "https://www.medicalmedium.com/book", "https://www.medicalmedium.com/medical-medium-101.htm", "https://www.medicalmedium.com/books", "https://www.medicalmedium.com/brain-saver-book-medical-medium", "https://www.medicalmedium.com/brain-saver-protocols-cleanses-and-recipes-book", "https://www.medicalmedium.com/celery-juice.htm", "https://www.medicalmedium.com/cleanse-to-heal.htm", "https://www.medicalmedium.com/life-changing-foods", "https://www.medicalmedium.com/liver-rescue", "https://www.medicalmedium.com/book", "https://www.medicalmedium.com/thyroid-healing"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}