{"result_id": "200029", "URL": "https://www.medicalmedium.com/blog/autoimmune-answers", "timestamp": "2023-04-25 16:21:14 CEST+0200", "meta": {"description": "Medical Medium Autoimmune Answers:", "lang": "en", "keywords": "", "favicon": "/banners/favicon/apple-touch-icon-57x57.png", "canonical": "https://www.medicalmedium.com/blog/autoimmune-answers", "encoding": "utf-8"}, "image": null, "domain": "www.medicalmedium.com", "title": "Autoimmune Answers", "cleaned_text": "If you or someone you love have been diagnosed with an autoimmune disease, chances are you’ve been told that your body is attacking itself. Hearing this probably stripped you of hope that you can heal and left you feeling betrayed by your own body. Today there are countless mysterious diseases that have been labeled as autoimmune conditions. But the problem is that the concept of autoimmunity is inherently flawed and this mistaken theory only hurts you and your loved ones in the end. Surprised? When we believe our own bodies are attacking themselves, we are unknowingly hindering our healing process. Our immune systems can weaken in the absence of this truth: Your body never attacks itself. It’s always working for you and loves you unconditionally. It’s never been more critical for you and your loved ones to know and feel this truth in your heart. It will greatly support you and those you care about to heal.\n\nWhen medical science and research do not know what is causing symptoms, such as mysterious rashes, mysterious dizziness, mysterious fatigue, mysterious aches and pains, or mysterious inflammation, it gets labeled as an autoimmune issue. This is a mere theory that was initiated in the 1950s and has since been grandfathered in to modern medicine and collectively agreed upon as law. There was a discovery of an antibody but no one had any idea of what it was or what it was for. There were theories and ideas of what it was, but they were just that: theories. One of those theories was that the antibody was there to destroy healthy cells. This theory came about because researchers didn’t have an answer as to what was causing chronic illnesses and symptoms or even an answer to what the antibody was for. Instead the blame was put on those with chronic illness and our bodies became the scapegoat. Better to blame it on our bodies than to blame it on the medical industry and research and science not having the answers. The theory of autoimmune conditions and diseases became a catch-all explanation for dozens of conditions and symptoms that medical communities don’t yet have answers for. When someone is diagnosed with Hashimoto’s, they are told their body is creating antibodies that are destroying their thyroid tissue. With eczema and psoriasis, you will likely be told your body is attacking your skin. If you have lupus, you will likely be told your body is attacking itself and that’s what creates all the inflammation. This same theory is used for countless other chronic illnesses. This is the best explanation that modern medicine has to offer about mysterious diseases today.\n\nIt’s never been more important for you to know this isn’t accurate because it affects your ability to heal. Not only are you given incorrect information about your health problems, you’re also told your body has turned against you when nothing could be further from the truth. The information I am sharing with you here is meant to free you of the misguided notion that your body would ever attack itself and to reveal the true cause of mysterious diseases that have been labeled autoimmune disorders. In my book Thyroid Healing I cover how and why this autoimmune confusion exists today in great detail, along with other great mistakes that have been made in medical communities that are holding so many back from complete healing.\n\nThe True Cause of Autoimmune Diseases\n\nIf you have an illness that has been labeled as an autoimmune disease, your body truly is attacking something, but it is not attacking itself. As I said, your body is working for you every single day. It works tirelessly for you and is doing the very best it can. When you are sick and have mysterious symptoms, such as fatigue, butterfly rashes, dizziness, tremors, vertigo, aches and pains, digestive trouble, weight loss, insomnia, weight gain, memory loss, numbness, tingling, blood sugar issues, brain fog, mood swings, night sweats, loss of appetite, and many others, it means there is an invader in your body. The same is true if you have lupus, Hashimoto’s, Grave’s, Addison’s, Type 1 Diabetes, colitis, vitiligo, celiac, eczema, Graves’, chronic fatigue syndrome (CFS), myalgic encephalomyelitis (ME), rheumatoid arthritis, fibromyalgia, Lyme disease, multiple sclerosis, parkinson’s, alopecia, or any other disease that is considered to be in the autoimmune category. There is a pathogen invader in your body that it’s working hard to attack and get rid of.\n\nModern medicine has yet to come to this conclusion about mysterious illnesses due to a few reasons. First of all, this theory about the body attacking itself has become law inside the minds of well-intentioned doctors and health professionals who are just doing their best to provide care for their patients. No one is willing to question it because they have come to believe it is the truth, even though there is no evidence backing it.\n\nAnother reason is because there is no incentive to look into these mysterious diseases. When there is already an acceptable answer that seems to fit, there doesn’t appear to be a need to spend more money on research that they assume will get them nowhere.\n\nAnd finally, even if doctors were to seriously look for these pathogens in their patients coming into their offices with a long list of mysterious symptoms, they would come up dry. Most tests the blood lab offers cannot detect the viruses and bacteria that are invading so many people and causing so many conditions and symptoms. Many of the pathogens causing autoimmune labeled illnesses are yet to be discovered and classified; therefore, it would be quite impossible to detect. You can’t find something when you do not know what you are looking for. For example, medical communities believe there is only one Epstein-Barr virus (EBV)—the virus that causes mono—but in truth there are 61 strains of EBV that cause all kinds of different symptoms and illnesses. I revealed this truth in my book Medical Medium. You can read more about EBV and how it creates illnesses, including cancer, in my book Thyroid Healing.\n\nIf the medical industry was willing to put more money into researching pathogens, it would be more likely that answers would be coming out in literature today. Viruses and bacteria would be called by name and accurate tests would be created and administered. However, the most popular answer medicine has at the moment is that the body is attacking itself and as I have shared, this is not the truth. The second most popular answer is that it’s your faulty genes causing disease, which is a theory that’s quickly on the rise and still not the answer. In fact, people are told their body is attacking itself and that their genes are the problem.\n\nThe First Barrier to Destroy\n\nThe biggest barrier obstructing your path to true healing is this belief that the body is attacking itself. It may have been ingrained into you not only by your medical practitioners, but also by what you read on the Internet. You are told there is very little you can do to manage your symptom or condition, and nothing you can do to reverse it. This is a lie and something that should be discarded immediately not that you know the truth.\n\nKnow this: Your body is not attacking itself. I have already said it multiple times in this article, but I must say it over and over until we all understand it deep within our beings. It’s that fundamentally important. Your body is not self-destructive. And your body is not searching out healthy blood cells to harm and kill off. In fact, your body is doing the opposite. Every day your body is working for you. It is on your side. Your immune system cannot do one thing to harm a single cell in your body. It has never been able to do that, and it never will do that. When we know this deep within our being and replace the lie with this truth, something begins to change. That barrier that was once in your way is obliterated, and your path to healing becomes clear and unhampered.\n\nIt may seem like a small switch, but it is in fact very significant. When your mind is aware that it is a pathogen you are going after, a revelation clicks into place and your body begins to work even more efficiently to kill off that virus. Your immune system fires up and kicks into gear to work for you even harder. This is essential to understand. The power of knowing the truth cannot be underestimated, especially when it comes to healing from these diseases that have plagued so many people for so many years. If you know your body is working for you, it works for you even more. Recovery is finally possible when you are armed with real information that is not hiding behind funding agendas and the bureaucracy of the medical world. This simple understanding sends a message to your body to start breaking down the pathogen fast. And when you start robbing food from the pathogen, which I discuss in the section about healing foods, recovery is even faster.\n\nThere are many medical professionals these days that are offering advice on how to manage your autoimmune disease. Some of this advice discusses “triggers” related to your illness but ironically it’s not even the correct triggers. For example, some experts are just beginning to say that EBV is a trigger for thyroid disease. This is because the never before known information that I have released has forced experts to look at EBV as a possible concern, but this has only led these experts to say that EBV could be a trigger. But in fact, EBV is not a trigger, it is the direct cause. This is a critical distinction that must be understood.\n\nThe reason we need to make a distinction between trigger and cause is because when we just manage our illness by avoiding triggers, we are not actively fighting the pathogen and addressing the root cause. And if today’s medical professionals and experts believe that EBV is possibly just a trigger but have no idea how to rid the EBV out of the body, then they’re not helping people to heal. We want to do everything we can to kill off the virus invading our body. When we simply just avoid triggers, for example gluten, the virus that’s really behind your suffering can cause further issues. And obviously, we want to do everything we can to ensure the pathogen does not proliferate and cause more symptoms again. Plus, not all triggers can be avoided. We all eventually lose a loved one for example, and the grief we experience can trigger illness if the cause hasn’t been addressed. Or we’re not choosing the right triggers we can avoid. When we recognize the true cause of our illness, we can start to move toward true and total recovery, which is something I’ve witnessed tens of thousands of people doing over the years with the information I’ve shared, and now many more.\n\nLet’s take a look at some of the illness labeled as autoimmune diseases and conditions.\n\nMedical science and research are unaware that lupus is a viral condition, specifically it is the body reacting to Epstein-Barr’s byproducts and neurotoxins. Medical science and research are completely unaware of this true cause. In fact, lupus is not even diagnosable. It is only visibly diagnosed by inflammation markers. I share more about the undiscovered true cause of lupus in Thyroid Healing.\n\nWith this autoimmune labeled condition, EBV is in the body feeding on high levels of toxic heavy metals. It is not always lesions on the brain that are causing MS symptoms. Many people have spots that show up on brain scans, and they do not have any of the symptoms related to MS. There is so much that is going on in people’s brains: calcifications, crystallizations, dark spots, white spots, heavy metal deposits, MSG deposits, and chemical solvent stains. This does not mean someone has MS. What is actually causing the MS is EBV in addition to the heavy metals—a truth that medical communities are unaware of.\n\nEBV is also the true cause of Hashimoto’s thyroiditis. The thyroid becomes inflamed because the virus has infected it. Your immune system is not going haywire or out to get you. It’s this virus that’s causing the damage and making you feel miserable. Your body just needs the proper support, which I describe in Thyroid Healing, to triumph over the virus.\n\nCeliac is not a genetic disease. It is inflammation in the intestinal lining from streptococcus bacteria. Medical communities believe that celiac is an autoimmune condition and that it’s limited to a sensitivity to gluten. Rather, wheat gluten is one trigger to this inflammation of the intestinal tract by feeding the strep bacteria in there.\n\nType 1 diabetes occurs when there is an injury to your pancreas. If you have type 1 diabetes, at one point some of your pancreatic tissue was injured from a viral condition or toxic bacteria. Your body is not attacking your pancreas.\n\nIn Grave’s disease, a mutated variety of EBV is causing inflammation, which is scarring the thyroid. There are specific unknown varieties of EBV that prompt the thyroid gland to produce more tissue and, as a result, more thyroid hormones. Find out more about Grave’s in Thyroid Healing.\n\nAll versions of hepatitis are viral conditions from the herpetic family, mainly the Epstein-Barr Virus. They are at different stages of what the virus is doing to the liver. Autoimmune hepatitis is a mistake all on its own because medical research doesn’t actually know the true cause of these conditions. They merely see inflammation and antibodies and make the conclusion that the antibodies are going after the liver. However, the immune system is creating these antibodies to help you go after the virus.\n\nMany varieties of mysterious skin rashing is from the shingles virus. Specifically, eczema and psoriasis can be a combination of EBV and shingles, both in the liver, feeding off of high levels of copper and DDT. The reason mysterious skin rashing does not get diagnosed as shingles is because when something does not look like textbook shingles, they would never think to call it that. However, what modern medicine is unaware of is that there are over 31 varieties of the shingles virus that they have yet to discover. Therefore, it would be impossible to diagnose it as such without further research.\n\nEhlers-Danlos syndrome is another example of an illness that has been labeled as autoimmune simply because medical professionals are unaware of the true cause. The truth is that this condition is caused by a virus that’s injuring connective tissue; it’s not genetic.\n\nThe aches, pains, tenderness, fatigue, and stiffness of fibromyalgia are a result of EBV’s neurotoxins creating chronic inflammation of both the central nervous system and nerves throughout the body. Knowing the true cause means that you can begin to implement the steps needed to allow for healing. You can find out more about fibromyalgia and many other autoimmune diseases and condition in Thyroid Healing.\n\nNow that you know that your body is not attacking itself, but rather that it is attacking a pathogen in your body, you can move onto the next step toward healing. The next thing that’s important for you to know is a truth about viruses that science has yet to discover: viruses eat. Modern medicine is still oblivious to the fact that viruses must eat in order to grow and proliferate. Without their favorite foods, viruses will die. Therefore, logically we must know which are their favorite foods and eliminate them from your diet so the virus can exit your system, leaving you free of your symptoms over time.\n\nAs an example, eczema is due to a virus in the liver. And that virus feeds off certain foods, which then creates an internal dermatoxin that leaches out from the liver, goes into the bloodstream, and then surfaces through the skin. When you know this is the real cause, you can take away the foods the virus likes best.\n\nIn my book Thyroid Healing I explain in depth how the Epstein-Barr virus feeds, what it feeds on, and how it excretes when it feeds. For example, EBV feeds on toxic heavy metals, as well as all pesticides, including old ones such as DDT stored in the liver, and certain foods we eat. In the book, I explain the entire process of this particular virus as it feeds, excretes, develops, and continues to feed.\n\nViruses love to feed off of heavy metals, such as mercury, arsenic, cadmium, lead, nickel, alloys, steel, aluminum, and copper, that are in our systems, including in our liver. Heavy metals are not the cause of your autoimmune labeled disease. They simply feed the viruses that are the cause. The good news is you can take active steps to eliminate these metals from your body by eating the five heavy metal detox foods I recommend every day within a 24-hour period. These foods are wild blueberries, spirulina, barley grass juice powder, cilantro, and Atlantic dulse. All five of these foods work together to slowly eliminate the heavy metals. Find out how you can incorporate these foods in Thyroid Healing.\n\nMany people believe chlorella is actually better for you than spirulina, but chlorella simply does not eliminate heavy metals the way spirulina does. Chlorella drops the metals instantly, while spirulina holds onto them and in tandem with the other key foods, effectively aids in the process of removing them from the body.\n\nEggs may be considered the perfect food in some circles, but in reality, they are the perfect food for viruses. They essentially incubate viruses, making them stronger and more aggressive. Stay away from eggs if you have a disease that is labeled as autoimmune, especially lupus and PCOS. Unknown to medical communities, eggs are disastrous for those who have ovarian issues. Eggs feed every single virus and bacteria that create conditions that are thought to be autoimmune diseases.\n\nEven if you are eating cage-free, natural eggs, these still act as food for pathogens. Viruses look for egg material in the body to feed on. They feed on the natural hormones that are in eggs, which act as a steroid for the virus. It does not matter what kind of eggs you get because unfortunately all eggs feed viruses.\n\nIn a very similar way, all dairy products feed viruses. Some doctors are knowledgeable about the allergy concern of eating dairy, but we have to recognize that simply eliminating dairy is not enough. We need to understand why we are eliminating it. It’s critical to stop eating foods like dairy and eggs if you have any symptoms or a chronic illness so that they do not continue to feed the pathogens that are causing your symptoms.\n\nIt is also a good idea to stay away from all corn products and canola oil. These are in almost every packaged food out there, even organic ones, so be mindful of what is in the ingredients list. If it is intimidating to you to avoid these ingredients that seem minor, think of it this way. The more fresh fruits and vegetables you include in our diet, the more apples, sweet potatoes, salads, bananas, and squash, the less room you have in diet for processed foods that likely contain ingredients you are trying to avoid. Think of crowding out your plate with so much good stuff that the packaged foods simply do not have as much space. Also, the more fresh fruits and vegetables you eat, the more you crave them. Keeping this in mind will help you increase your whole foods intake because you know that the more you do it, the easier it will get.\n\nIt’s also helpful to reduce animal protein while you’re healing because, again, we need room for the fruits, leafy greens, and vegetables, the secrets weapons, as I like to call them. If you like to eat animal protein, try not to eat it three times a day. Instead eat it once a day and find other filling options to enjoy. Instead of chicken on your salad, add black beans, avocado, sweet potato, or hummus. Instead of bacon with your toast, bake potato fries with lots of herbs of spices. And when you do eat animal proteins, choose the cleanest meats possible. Wild fish is one of the better choices.\n\nWhen healing from chronic illnesses and symptoms, it’s helpful to minimize added fats in the diet to allow the liver to cleanse and toxins and viruses to be most effectively purged from the body. One easy way to cut down fats is to stay away from or minimize oils, even olive oil and coconut oil. A small drizzle here or there is fine, but do not overdo the oils. The same goes for other fat sources like nuts for example. Eat just a few with lots of fresh veggies versus having a large portion of nuts.\n\nThere are so many amazing powerhouse foods that you can eat in order to give your body an extra boost when fighting off pathogens. The first group we can focus on is cruciferous vegetables. There is a misconception circulating around that cruciferous vegetables, also called brassicas, are harmful because of the goitrogenic compounds in them. We are being told to stay away from kale, broccoli, cauliflower, and brussels sprouts, but this is a misguided and unproductive trend. These foods are actually incredible for anyone with an illness that has been labeled as an autoimmune disease, including thyroid conditions. Cruciferous vegetables cannot harm you. They contain phytochemicals that actually fight the bug you are trying to get rid of. These foods can be some of your greatest allies in your path to healing, and it would be wise to include them, both raw and cooked, on a daily basis.\n\nStraight cucumber juice is something that can be included daily in order to flush out toxins from the body. Straight celery juice is also important to include because its mineral salts clean up the liver, build up hydrochloric acid, and strengthen bile so you can break down bacteria and viruses in the intestinal tract that cause conditions like colitis, celiac, and crohn's disease. I share recipes for these foods and juices in my book Thyroid Healing.\n\nInclude plenty of squash in your diet. There are so many delicious varieties to enjoy, such as butternut, kabocha, spaghetti, and acorn squash. Also, remember to eat lots of fresh herbs like cilantro, rosemary, and thyme. Eat plenty of salads with red leaf lettuce, butter lettuce, arugula, parsley, and radishes. Radishes are a miracle food when fighting off pathogens. Radish greens kill off viruses, and the radishes themselves push poisons out of the body and support the thyroid.\n\nEating plenty of fruit is one of the best ways you can support your healing. If you are afraid of fruit, know that fruit cannot feed candida and fruit sugar isn’t bad for you. It’s the opposite—fruit is the most healing food on earth! So eat plenty of apples, bananas, oranges, and berries. Melons are wonderful for flushing out poisons that the virus creates. Bring in more tropical fruits like papaya, pineapple, and passionfruit if you are able to find them. Eat the fruits that are in season like pears and persimmons in the fall and peaches and plums in the summer. Fruit is an amazing antiviral food that is essential to include when you are fighting a pathogen such as Epstein-Barr virus that is causing your mystery illness. Bananas in particular are great for killing off pathogens in the intestinal tract. If you fear fruit, check out my chapter on Fruit Fear in my book Medical Medium.\n\nAnother power food that is worth seeking out is dandelion greens. These are often sold at farmers markets and health food stores among other greens like kale and collard greens. Dandelion greens are particularly supportive for the liver because they work to push out poisons that are created from a virus or bacteria.\n\nThere are so many wonderful herbal teas to include, as well. Nettle leaf and lemon balm are two particularly powerful ones that fight viruses. There is a phytochemical in lemon balm that helps you go after the virus you want to kill. Many people know that nettle leaf tea is anti-inflammatory, but they do not know why. The reason is because it’s killing the pathogens that are creating the inflammation in the first place. When you are drinking your herbal teas with this knowledge, the properties become that much more powerful.\n\nIn the same way, people are aware that turmeric is anti-inflammatory, but they do not know why. Turmeric has phytochemicals that are poisonous to the bugs that are inflaming people’s joints and backs. This herb is attacking viruses and bacteria.\n\nIncorporating supplements is critical to fighting off the viruses that are causing your autoimmune disease. As I always recommend, talk to your medical practitioner before you begin taking supplements so you can work together to find the right dosages. Bring your doctor this information and work together to fight the virus with these powerful herbs and supplements. Be sure to get the right supplements. I have a list of preferred supplements that you can find on my website.\n\nZinc deficiencies are rampant and can trigger an autoimmune condition. Simply taking zinc can be a huge step toward healing and can be critical for anyone suffering from the symptoms associated with autoimmune diseases. When you take zinc sulfate, it goes directly to where the virus is and starts working on stopping it in its tracks. Additionally, zinc increases your immune system’s ability to fight.\n\nMany people are recommending B12 today, which is good. However, there is still very little talk about the right kind of B12. When fighting a viral condition, it is essential to use a combination of both adenosylcobalamin and methylcobalamin. Including a methylfolate supplement along with this specific B12 is especially helpful.\n\nWhen fighting a viral condition, it’s important to include some vitamin c supplements, particularly the Micro-C. The Micro-C I recommend on my preferred supplements page does not contain any corn, which feeds viruses, unlike other brands.\n\nLicorice is another important one to include because it is antiviral. This supplement can aid your body in knocking down the virus, particularly EBV, that is causing your illness.\n\nL-lysine is a foundational amino acid that hinders and stops herpetic viruses. It is possible to have a very high dosage of l-lysine. but talk to your doctor first to come to an agreement together.\n\nAs you stop believing that your body is attacking itself and start believing in the truth that your body is attacking a pathogen, you will begin to turn the tide. And as you progressively remove the foods that feed viruses and bring in the foods that fight viruses, you will begin building a strong foundation for healing. As you begin to include more antiviral, immune-supporting supplements, you are giving your body that much more power to fight the pathogen that has caused your autoimmune labeled disease.\n\nI do not prefer to use the term autoimmune when speaking about conditions such as Hashimoto’s, celiac, lupus, or any of the other illness I have touched on above. Autoimmune is an incorrect label because your immune system is not attacking itself; your body is not turning on you. I use the term autoimmune because it is what we are all familiar with. It is the easiest way to communicate about these conditions. The real term for these conditions should be ‘viral immune’. Keep in mind that if I did not mention your autoimmune disease, your body is still not attacking itself. It is directly related to an invader in your body that you need to eliminate. It is not a genetic issue that you have no power to fix. This information I have shared today is here to empower you. It is ahead of research and science and is there as a beacon of light for you and your loved ones. You can heal and reverse your symptoms. You can walk without pain. You can wake up with energy. You can get your weight back on, or get it back off. You can watch your skin’s rashes fade away as new, unblemished skin is taking its place. All of these things are possible. All of the healing methods above will work together to get your life back to what it was. The goal is to one day be free of symptoms and free from countless doctor’s visits every week. Just remember to be compassionate with yourself, and take one step today and then another step tomorrow. I support you completely.", "opengraph": {"image": "https://www.medicalmedium.com/blog-images-optimised/autoimmune-answers.jpg", "type": "article", "url": "https://www.medicalmedium.com/blog/autoimmune-answers", "author": "https://www.facebook.com/medicalmedium", "title": "Autoimmune Answers", "description": "Medical Medium: Autoimmune Answers  - now at www.medicalmedium.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://geni.us/thyroid-healing", "https://geni.us/thyroid-healing", "https://geni.us/thyroid-healing", "https://geni.us/thyroid-healing", "https://geni.us/thyroid-healing", "https://geni.us/thyroid-healing", "https://www.medicalmedium.com/blog/wild-blueberries", "https://vimergy.com/products/usa-grown-spirulina", "https://vimergy.com/products/barleygrass-juice", "https://www.medicalmedium.com/blog/cilantro", "https://amzn.to/2vhgjis", "https://geni.us/thyroid-healing", "https://vimergy.com/products/usa-grown-spirulina", "https://geni.us/thyroid-healing", "https://geni.us/medical-medium-revised", "http://amzn.to/2kQMujN", "http://amzn.to/2l7xOdZ", "http://www.medicalmedium.com/preferred/supplements", "https://www.medicalmedium.com/blog/zinc-essential-mineral-for-health", "https://vimergy.com/products/organic-zinc", "https://vimergy.com/products/5-mthf", "https://vimergy.com/products/b12", "https://vimergy.com/products/micro-c", "https://vimergy.com/products/micro-c", "https://vimergy.com/products/organic-licorice", "https://vimergy.com/products/l-lysine", "/medical-medium-blog"], "authors": ["Medical Medium at medicalmedium.com"], "publish_date": null}