{"result_id": "201019", "URL": "https://www.medicine.news/2023-02-23-cdc-aware-covid-vaccines-linked-to-myocarditis.html", "timestamp": "2023-04-25 16:21:28 CEST+0200", "meta": {"description": "Internal emails from the Centers for Disease Control and Prevention (CDC) revealed that the public health agency had already been aware of the links between the Wuhan coronavirus (COVID-19) vaccines and myocarditis (heart muscle inflammation) as early as May 2021. Zachary Stieber of the Epoch Times made this revelation in a Feb. 15 Twitter thread. […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,cardiac inflammation,CDC,corruption,covid-19,Dangerous Medicine,emails,EUA,FOIA request,left cult,lies,myocarditis,pandemic,Pfizer,propaganda,The Epoch Times,transparency,vaccine damage,vaccine injury,vaccines,VAERS,Zachary Stieber", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2023-02-23-cdc-aware-covid-vaccines-linked-to-myocarditis.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "CDC still rolled out COVID-19 shots despite knowing their link to myocarditis as early as May 2021", "cleaned_text": "CDC still rolled out COVID-19 shots despite knowing their link to myocarditis as early as May 2021\n\nInternal emails from the Centers for Disease Control and Prevention (CDC) revealed that the public health agency had already been aware of the links between the Wuhan coronavirus (COVID-19) vaccines and myocarditis (heart muscle inflammation) as early as May 2021.\n\nZachary Stieber of the Epoch Times made this revelation in a Feb. 15 Twitter thread. He shared more than 1,000 pages of emails sent between May 10 to 17, 2021 about myocarditis reports linked to the COVID-19 vaccines. The said correspondences were obtained via a Freedom of Information Act (FOIA) request.\n\nOne email reported around five or six cases of “post-Pfizer vaccine myocarditis in healthy males in the United States.” Another email from Boston physician Dr. Jane Newburger shared “more and more cases of youth who are developing myocarditis … within a short time after the second COVID-19 vaccine [dose].”\n\nA third email from Dr. Angela J.P. Campbell asked for a meeting with CDC officials to clarify their response to these cases, as she did not “have a clear understanding of what is and has been done.”\n\n“As the emails were being sent, the vaccine safety work group for CDC’s advisory panel said there were ‘relatively few reports of myocarditis’ after vaccination and that most cases appear to be mild,” Stieber pointed out.\n\nMoreover, one of the emails from the CDC’s Dr. John Su said the team could not find myocarditis cases in the Vaccine Adverse Event Reporting System (VAERS). “Seemingly, providers aren’t reporting these cases to VAERS,” he pointed out. Su serves as the lead for the CDC’s VAERS team.\n\nA CDC spokesperson denied the allegations put forward in the emails. They told the Epoch Times that an association between myocarditis and mRNA COVID-19 vaccination was not known in April 2021. It is from June 2021 that data began to indicate a potential association between the vaccines and myocarditis.\n\n“VAERS has been monitoring for myocarditis since December 2020,” said a second CDC spokesperson, noting that since the link between the vaccine and the heart illness wasn’t apparent until after April 2021. The CDC only started assembling a team to focus upon reports of myocarditis in May 2021. (Related: CDC study: COVID-19 mRNA shots increase risk of myocarditis by 13,200%.)\n\nVAERS has recorded a total of 34,385 deaths, 192,145 hospitalizations, 18,570 heart attacks and 26,446 myocarditis and pericarditis cases as of Feb. 10.\n\nNevertheless, the public health agency has repeatedly insisted that cases of myocarditis are a “rare risk” for those who received the mRNA shots.\n\n“These rare cases of myocarditis or pericarditis have occurred most frequently in adolescent and young adult males, ages 16 years and older, within seven days after receiving the second dose of an mRNA COVID-19 vaccine (Pfizer-BioNTech and Moderna). There has not been a similar reporting pattern observed after receipt of the Janssen COVID-19 Vaccine (Johnson & Johnson),” the CDC said on its website.\n\nVisit CDC.news for more stories about the public health agency.\n\nWatch this segment from “The HighWire” where Del Bigtree and Jefferey Jaxen discuss Pfizer missing the deadline to submit myocarditis data.\n\nThis video is from the Scriptural Scrutiny channel on Brighteon.com.\n\nStudy finds possible link between Pfizer’s COVID-19 vaccine and myocarditis in children.\n\nCDC admits myocarditis being linked to COVID-19 vaccines is TRUE, not misinformation.\n\nNBC News now admits covid vaccines may be linked to myocarditis, after YEARS of claiming it was “misinformation.”\n\nGOT CLOT SHOT CARDITIS? Myocarditis commercial for CHILDREN conveniently leaves out the most likely cause.\n\nCanadian doctor warns 50% of kids who got myocarditis from COVID-19 vaccines will be DEAD in 5 years.", "opengraph": {"title": "CDC still rolled out COVID-19 shots despite knowing their link to myocarditis as early as May 2021", "type": "article", "url": "https://www.medicine.news/2023-02-23-cdc-aware-covid-vaccines-linked-to-myocarditis.html", "site_name": "Medicine News", "description": "Internal emails from the Centers for Disease Control and Prevention (CDC) revealed that the public health agency had already been aware of the links between the Wuhan coronavirus (COVID-19) vaccines and myocarditis (heart muscle inflammation) as early as May 2021. Zachary Stieber of the Epoch Times made this revelation in a Feb. 15 Twitter thread. […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2023/02/CDC-Vaccine-Coronavirus-Syringe.jpg"}, "tags": ["pandemic", "big government", "The Epoch Times", "Big Pharma", "left cult", "myocarditis", "Pfizer", "lies", "corruption", "CDC", "covid-19", "emails", "VAERS", "EUA", "propaganda", "FOIA request", "transparency", "Zachary Stieber", "cardiac inflammation", "vaccine injury", "vaccines", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/cdc-knew-about-link-between-covid-jab-myocarditis-as-early-as-may-2021-emails-suggest/", "https://www.documentcloud.org/documents/23656227-cdc-emails-chat-messages-on-post-vaccination-myocarditis", "https://www.brighteon.tv", "https://naturalnews.com/2022-11-28-cdc-study-covid-vaccines-increase-myocarditis-risk.html", "https://cdc.news/", "https://www.brighteon.com/eb005dcf-3a89-4ef2-9ddf-cb4b03f1dd1d", "https://www.brighteon.com/channels/robbjerk", "https://naturalnews.com/2022-11-10-study-pfizer-covid-vaccine-myocarditis-in-children.html", "https://heart.news/2022-09-20-cdc-admits-myocarditis-linked-covid-vaccines-true.html", "https://vaccines.news/2022-11-18-nbc-news-now-admits-covid-vaccines-linked-to-myocarditis.html", "https://vaccinedamage.news/2022-10-18-myocarditis-commercial-conveniently-leaves-out-most-likely-cause.html", "https://vaccineinjurynews.com/2022-10-24-half-kids-myocarditis-from-vaccines-dead-5years.html", "https://www.lifesitenews.com/news/cdc-knew-about-link-between-covid-jab-myocarditis-as-early-as-may-2021-emails-suggest/", "https://www.documentcloud.org/documents/23656227-cdc-emails-chat-messages-on-post-vaccination-myocarditis", "https://www.brighteon.com/eb005dcf-3a89-4ef2-9ddf-cb4b03f1dd1d", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2023-02-23-cdc-aware-covid-vaccines-linked-to-myocarditis.html&linkname=CDC%20still%20rolled%20out%20COVID-19%20shots%20despite%20knowing%20their%20link%20to%20myocarditis%20as%20early%20as%20May%202021", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}