{"result_id": "201001", "URL": "https://www.medicine.news/2023-02-28-german-study-mrna-damages-heart-killed-parkinsons-patient.html", "timestamp": "2023-04-25 16:21:15 CEST+0200", "meta": {"description": "New, mind-blowing research about the Covid so-called “vaccinations” has been published recently in medical journals. Sadly, mRNA “technology,” not Covid, is destroying people’s hearts and brains, and it’s being documented in medical journals for all the “pro-science” pro-vaxxers to ingest. Recently, a patient died a few weeks after getting his third mRNA stab. Right after […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,brain damaged,brain health,Dangerous Medicine,heart disease,heart health,mRNA,mRNA danger,mRNA vaccine,pandemic,pharmaceutical fraud,research,spike protein,Suppressed,toxic jab,vaccine damage,vaccine death,vaccine injury,vaccine violence,vaccine wars,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2023-02-28-german-study-mrna-damages-heart-killed-parkinsons-patient.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "DEATH BY mRNA: German study documents heart damage, death of Parkinson’s patient caused by covid jab", "cleaned_text": "DEATH BY mRNA: German study documents heart damage, death of Parkinson’s patient caused by covid jab\n\nNew, mind-blowing research about the Covid so-called “vaccinations” has been published recently in medical journals. Sadly, mRNA “technology,” not Covid, is destroying people’s hearts and brains, and it’s being documented in medical journals for all the “pro-science” pro-vaxxers to ingest.\n\nRecently, a patient died a few weeks after getting his third mRNA stab. Right after the toxic spike protein injections, his Parkinson’s symptoms got exponentially worse quickly, and it was all down hill from there. The pathology report confirms his clinical history with NO documentation of ever having the Fauci Flu, a.ka. Covid-19, per the autopsy. This is a case of vaccine-induced death that Big Pharma, Big Media, and the Vaccine Industrial Complex do NOT want anyone reading about, discussing, or re-publishing in the news.\n\n“We can say definitively that this damage was caused by vaccine,” says John Campbell, Ph.D. and health educator with 2.68 million YouTube subscribers\n\nResearchers ran an autopsy on a 76-year-old man with Parkinson’s disease who died just weeks after receiving his 3rd mRNA Covid jab. Researchers processed tissues in the man’s body with formalin, and stained them with eosin and hemotoxylin for examination. The first Covid jab the patient got was the AstraZeneca injection, then he got two Pfizer jabs the same year, in 2021. After the second jab, his family noticed major changes in his behavior, as he became much more lethargic, anxious, and did not want to be touched. Then he became very withdrawn, so they gave him a third jab, and then he died.\n\nThe autopsy revealed inflammation in the heart and brain. He suffered myocarditis that was not caused by natural infection, but by the spike proteins. He also suffered acute brain damage completely unrelated to his Parkinson’s diagnosis, according to three kinds of pathological findings, including neuronal death. Guess what they found in the frontal lobe of his brain? Spike proteins.\n\nSpike proteins in the brain and vascular system of Covid jabbed victims now showing up in autopsies as main cause of strokes and heart attacks\n\nScientists and doctors who still deny that Covid jabs are causing deaths need to take a close look at these findings, as detailed photographs reveal the patient’s spike-protein-contaminated and compromised tissue. The vaccines caused the brain damage. Period. Look at the case report. Follow the science.\n\nThe patient also suffered generalized swelling of the heart. Then the vaccine-induced brain damage caused him to have seizures, which in turn caused him to go unconscious, and he ended up breathing in his own vomit and finally dying from that, according to the pathologists. Here’s how it went down in the pathologist’s own words:\n\n“The vaccine circulating around the body will come into contact with the blood vessels. So the lipo-nanoparticles containing the mRNA will go into the blood vessels. And it’s the blood vessels’ cells themselves that will express the spike protein.” In other words, the spike protein caused a massive inflammatory response in the different parts of the brain, causing death in those sections.\n\nBritish and American medical scientists refuse to conduct autopsies to search for spike proteins like this. The medical industries are obviously suppressing this research to protect the vaccine industry in general and what many are referring to as a “Vaccine Holocaust” with these mRNA injections.\n\nDr. Robert Lowry, a Texas-based neurologist, is on the record saying that autopsies should be conducted on every young person who dies suddenly and unexpectedly, and here’s what he expressed about the spike protein jabs: “They don’t prevent disease, and the immediate and long-term risk of serious injury from them is greater than that of having the actual disease. Natural immunity to corona viruses is far better and longer lasting than anything these vaccines provide.”\n\nBookmark Vaccines.news to your favorite independent websites for updates on experimental gene therapy injections the CDC and fake news claim are “safe and effective” when they’re really dangerous and health-damaging.", "opengraph": {"title": "DEATH BY mRNA: German study documents heart damage, death of Parkinson’s patient caused by covid jab", "type": "article", "url": "https://www.medicine.news/2023-02-28-german-study-mrna-damages-heart-killed-parkinsons-patient.html", "site_name": "Medicine News", "description": "New, mind-blowing research about the Covid so-called “vaccinations” has been published recently in medical journals. Sadly, mRNA “technology,” not Covid, is destroying people’s hearts and brains, and it’s being documented in medical journals for all the “pro-science” pro-vaxxers to ingest. Recently, a patient died a few weeks after getting his third mRNA stab. Right after […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2023/02/Syringe-Vaccine-Senior-Man.jpg"}, "tags": ["pandemic", "Big Pharma", "biological weapon", "brain health", "spike protein", "mRNA vaccine", "vaccine wars", "heart health", "mRNA danger", "Suppressed", "pharmaceutical fraud", "heart disease", "toxic jab", "research", "vaccine violence", "vaccine injury", "brain damaged", "vaccines", "vaccine death", "mRNA", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/hard-evidence-in-new-study-brain-heart-damage-caused-by-mrna-vaccine_5074383.html?utm_content=buffer20184&utm_medium=Social&utm_source=linkedin&utm_campaign=etlinkedin", "https://realnewsaggregator.com/real-news/2023/02/24/hard-evidence-in-new-study-brain-heart-damage-caused-by-mrna-vaccine/", "https://www.brighteon.tv", "https://www.theepochtimes.com/health/do-mrna-vaccines-have-a-polyethylene-glycol-problem_4948405.html", "https://jennifermargulis.substack.com/p/we-should-be-doing-autopsies-on-every", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.theepochtimes.com/health/hard-evidence-in-new-study-brain-heart-damage-caused-by-mrna-vaccine_5074383.html?utm_content=buffer20184&utm_medium=Social&utm_source=linkedin&utm_campaign=etlinkedin", "https://realnewsaggregator.com/real-news/2023/02/24/hard-evidence-in-new-study-brain-heart-damage-caused-by-mrna-vaccine/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2023-02-28-german-study-mrna-damages-heart-killed-parkinsons-patient.html&linkname=DEATH%20BY%20mRNA%3A%20German%20study%20documents%20heart%20damage%2C%20death%20of%20Parkinson%E2%80%99s%20patient%20caused%20by%20covid%20jab", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}