{"result_id": "201035", "URL": "https://www.medicine.news/2022-02-02-german-analysis-finds-covid-vaccine-death-rate-higher-than-reported.html", "timestamp": "2023-04-25 16:21:37 CEST+0200", "meta": {"description": "A shocking new analysis from a German researcher using data from several countries reveals that there have been “thousands” more “daily deaths” from COVID-19 vaccines than governments around the world are admitting, even as those same regimes continue to demand as many people as possible continue to get vaccinated. The analysis, from University of Regensberg Prof. […]", "lang": "en", "keywords": "Austria,badhealth,badmedicine,covid vaccines,covid-19,depopulation,genocide,Germany,Israel,research,studies,Study,unvaccinated,vaccine,vaccine death,Vaccine deaths,Vaccine Holocaust,vaccine mandates,vaccine wars,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2022-02-02-german-analysis-finds-covid-vaccine-death-rate-higher-than-reported.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "Stunning German analysis finds that COVID-19 vaccine death rates are FAR higher than previously reported", "cleaned_text": "Stunning German analysis finds that COVID-19 vaccine death rates are FAR higher than previously reported\n\nA shocking new analysis from a German researcher using data from several countries reveals that there have been “thousands” more “daily deaths” from COVID-19 vaccines than governments around the world are admitting, even as those same regimes continue to demand as many people as possible continue to get vaccinated.\n\nThe analysis, from University of Regensberg Prof. Christof Kuhbandner, has revealed what he has described as an “extremely alarming situation” involving “thousands” of people who “are dying of the vaccine daily without us even being aware of it,” according to a published report.\n\nThe mortality data, which was gathered from Austria, Germany, Israel and Britain, was compiled in an Austrian report broadcast by servus.tv after Kuhbandner “happened to come across a recent preprint study in the journal ResearchGate, where the authors examined the UK ONS vaccine mortality surveillance report,” the report noted further.\n\nAt first glance, the analysis noted, the ‘all-cause mortality’ rates appear to be far lower in vaccinated people than those who have not taken the vaccine. But after Kuhbandner and other researchers conducted a closer examination, they discovered “fundamental inconsistencies and anomalies in the data,” the report noted, showing that there has been “systemic miscategorization of deaths between the different categories of unvaccinated and vaccinated,” among other factors.\n\nFor example, for the calendar weeks spanning 1-38 in 2021, shortly after COVID-19 vaccines became available to the general public around the world, there were strong peaks in non-COVID mortality for unvaccinated people in the 60-69 and 70-79-year-old age groups, while mortality rates among those who got the jab “stayed steady,” the report continues.\n\n“Prof. Kuhbandner noted something very unusual was going on and examined the trend for the 80+ age group as well. The following are the plots for all three age groups. The peaks and deaths were offset,” the report added.\n\nIn previous years, each of the 60-69, 70-79 and 80+ groups have mortality peaks at the same time during the year (including 2020 when all suffered the April Covid peak at the same time). Yet in 2021 each age group has non-Covid mortality peaks for the unvaccinated, at a different time, namely the time that vaccination rollout programmes for those cohorts reach a peak.”\n\nThe vaccines were rolled out in phases, in other words, going first to the oldest people (80+ years old) because they were adjudged to be the most vulnerable, before then being offered to people in the 70-79-year-old group, then 60-69 years old and so forth.\n\n“The death peaks then followed the vaccination stages,” the report said, adding the question: “So why would people NOT getting the vaccine be the ones dying in huge numbers, and not those getting the vaccine?”\n\nThat’s because in Europe, the report adds, those who became “vaccinated” were not designated as such until 14 days after the last of a two-dose regimen, so any deaths that occurred beforehand were counted as “unvaccinated” deaths.\n\nIf a patient died less than 14 days later, they were counted as “unvaccinated,” and that’s how vaccine-related deaths are actually being hidden, the report states.\n\n“As Figures 5-7 above show, thousands of deaths occurred shortly after the vaccines had been administered, and many among them were likely linked to the vaccine itself. If this is the case globally, and not just in Britain, then the number of vaccine deaths may be profound. The nightmare appears to be true, Prof Kuhbandner shows,” the report states.\n\nThere were similar death patterns in Germany, according to Kuhbandner.\n\n“These deaths appear to be directly the result of vaccinations. It’s just too coincidental to be dismissed,” the report continues.\n\nIn his interview with servus.tv, the professor said, “When you express this in numbers, it translates to 700 more deaths a day, on average. It would be like two commercial planes full of people crashing every day.”\n\n“If it turns out that there’s a causal effect with the vaccinations, then we are dealing with an extremely alarming situation,” Kuhbandner added, noting that he found similar results in all of the examined countries including Israel.\n\n“Then we have a case here where thousands of people are dying of the vaccine daily without us even being aware of it,” he added.", "opengraph": {"title": "Stunning German analysis finds that COVID-19 vaccine death rates are FAR higher than previously reported", "type": "article", "url": "https://www.medicine.news/2022-02-02-german-analysis-finds-covid-vaccine-death-rate-higher-than-reported.html", "site_name": "Medicine News", "description": "A shocking new analysis from a German researcher using data from several countries reveals that there have been “thousands” more “daily deaths” from COVID-19 vaccines than governments around the world are admitting, even as those same regimes continue to demand as many people as possible continue to get vaccinated. The analysis, from University of Regensberg Prof. […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/02/Death-Dead-Morgue-Toe-Tag-Feet.jpg"}, "tags": ["covid vaccines", "covid-19", "vaccine wars", "Vaccine deaths", "research", "vaccine", "vaccine death", "Israel", "genocide", "vaccine mandates", "depopulation", "vaccines", "Study", "Vaccine Holocaust", "unvaccinated", "Austria", "studies", "Germany"], "tweets": [], "movies": [], "links": ["https://msyc1.wordpress.com/2022/01/26/analysis-by-german-prof-thousands-of-hidden-deaths-daily-may-be-greatest-medical-debacle-in-human-history/", "https://www.brighteon.tv", "https://pandemic.news/2022-01-26-israel-now-1-in-covid-cases-per-capita-proof-draconian-measures-worthless.html", "http://www.vaccines.news", "https://msyc1.wordpress.com/2022/01/26/analysis-by-german-prof-thousands-of-hidden-deaths-daily-may-be-greatest-medical-debacle-in-human-history/", "https://pandemic.news/2022-01-26-israel-now-1-in-covid-cases-per-capita-proof-draconian-measures-worthless.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-02-02-german-analysis-finds-covid-vaccine-death-rate-higher-than-reported.html&linkname=Stunning%20German%20analysis%20finds%20that%20COVID-19%20vaccine%20death%20rates%20are%20FAR%20higher%20than%20previously%20reported", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}