{"result_id": "201025", "URL": "https://medicine.news/2022-08-26-actuarial-data-trail-of-death-covid-vaccine-mandates.html", "timestamp": "2023-04-25 16:21:31 CEST+0200", "meta": {"description": "Affirming what ex-Blackrock executive Edward Dowd has been saying about excess deaths and Wuhan coronavirus (Covid-19) “vaccines,” the Society of Actuaries Research Institute (SARI) has released a new report indicting jab mandates as a major killer of millennials last fall. Excess deaths among people aged 25-44 – also known as the working-age population – soared […]", "lang": "en", "keywords": "actuary,badhealth,badmedicine,Censored Science,chemical violence,Collapse,compliance,COVID,Data,death,democide,depopulation,health freedom,liberal narrative,Long-COVID,mandates,medical violence,Plandemic,propaganda,research,science deception,science fraud,Tyranny,vaccine,Vaccine deaths,vaccine wars", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://medicine.news/2022-08-26-actuarial-data-trail-of-death-covid-vaccine-mandates.html", "encoding": "UTF-8"}, "image": null, "domain": "medicine.news", "title": "Trail of death: Latest actuarial data connects excess deaths to covid vaccine mandates", "cleaned_text": "Affirming what ex-Blackrock executive Edward Dowd has been saying about excess deaths and Wuhan coronavirus (Covid-19) “vaccines,” the Society of Actuaries Research Institute (SARI) has released a new report indicting jab mandates as a major killer of millennials last fall.\n\nExcess deaths among people aged 25-44 – also known as the working-age population – soared roughly a year ago as Operation Warp Speed reached its peak. Some 61,000 millennials died as a result of being forcibly jabbed, a phenomenon that Dowd likens to another Vietnam War.\n\n“This is what we call democide: death by government,” Dowd told Steve Bannon on his “War Room” program.\n\nDowd also appeared with Alex Jones on his show to talk about this same issue – be sure to watch below:\n\nData from the U.S. Centers for Disease Control and Prevention (CDC) also affirms that an 84 percent increase in excess mortality was recorded among the millennial cohort last fall – though the agency, like SARI, does not place blame on Chinese Virus injections.\n\nThe only explanation is the shots, though, because no other factors changed that year to explain why tens of thousands of otherwise healthy young people simply dropped dead after getting injected for the Fauci Flu.\n\nGovernment blames “long covid” and suicide for tens of thousands of excess deaths among young people\n\nDowd is convinced that these excess deaths are a consequence of the mass injection campaign. He believes every news outlet should be talking about this, and yet very few actually are.\n\n“This should be [on the] front page of The Wall Street Journal, The New York Times, The Washington Post,” he says. “It should be on Fox, CBC, NBC, ABC. This needs to stop!”\n\nThe mandates for young people, as you may recall, started right around the time of the new school year back in the fall of 2021. And that was right when the excess deaths started pouring in.\n\n“The numbers are there,” Dowd says. “So we showed the millennial-age group saw a rate of change [of] 84 percent excess mortality in the third quarter of 2021. And boom, there’s the Society of Actuaries confirming my work and my partner’s work. There it is.”\n\nAmazingly, the official story still claims that all of these excess deaths are due to things like suicide, so-called “long covid,” drug overdoses, missed cancer diagnoses, and more – pretty much every excuse they can come up with to deflect from the truth.\n\nDowd is not fooled by it, and nor are we. It is clear that the shots are the primary, if not sole, cause of this massive loss of life among the young.\n\n“You can’t say to me that simultaneously, everyone decided to commit suicide, overdose on drugs, or miss their cancer screening treatments,” Dowd says. “It makes no sense for that age group. That’s number one.”\n\n“Secondarily, my hedge fund partners and I are working on some data from the UK that’s going to basically show a linkage between ages 1 through 14 of actual all-cause mortality coming down during 2020 and 2021 before that age group got vaccinated – and then mysteriously as soon as the vaccines get rolled out – the cumulative deaths start rising. And you can’t say that ages 1 through 14 are overdosing on drugs, missing their cancer-screening treatments, or committing suicide.”\n\nThe truth is becoming clearer by the day, which means the days of the “death merchants,” as Dowd calls them, are numbered. The evidence is truly overwhelming, and there is no covering up the truth – at least not forever.\n\nThe latest Chinese Virus injection news, including the latest data on injuries and deaths, can be found at ChemicalViolence.com.", "opengraph": {"title": "Trail of death: Latest actuarial data connects excess deaths to covid vaccine mandates", "type": "article", "url": "https://www.medicine.news/2022-08-26-actuarial-data-trail-of-death-covid-vaccine-mandates.html", "site_name": "Medicine News", "description": "Affirming what ex-Blackrock executive Edward Dowd has been saying about excess deaths and Wuhan coronavirus (Covid-19) “vaccines,” the Society of Actuaries Research Institute (SARI) has released a new report indicting jab mandates as a major killer of millennials last fall. Excess deaths among people aged 25-44 – also known as the working-age population – soared […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/08/Toe-Tag-Dead-Death-Morgue.jpg"}, "tags": ["compliance", "COVID", "medical violence", "Long-COVID", "Censored Science", "science deception", "Data", "vaccine", "chemical violence", "propaganda", "democide", "vaccine wars", "mandates", "death", "depopulation", "liberal narrative", "science fraud", "Tyranny", "Vaccine deaths", "research", "Collapse", "actuary", "health freedom", "Plandemic"], "tweets": [], "movies": [], "links": ["https://thevigilantfox.substack.com/p/smoking-gun-new-actuarial-report", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://thevigilantfox.substack.com/p/smoking-gun-new-actuarial-report", "https://www.brighteon.com/50156b5c-570a-4e7c-b952-9949ccfbd7d6", "https://www.soa.org/resources/experience-studies/2022/group-life-covid-19-mortality/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-08-26-actuarial-data-trail-of-death-covid-vaccine-mandates.html&linkname=Trail%20of%20death%3A%20Latest%20actuarial%20data%20connects%20excess%20deaths%20to%20covid%20vaccine%20mandates", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}