{"result_id": "201006", "URL": "https://medicine.news/2023-03-27-children-paralyzed-from-gates-funded-polio-vaccine.html", "timestamp": "2023-04-25 16:21:18 CEST+0200", "meta": {"description": "Seven children were paralyzed by vaccine-derived polio linked to the new nOPV2 polio vaccine developed by the Bill & Melinda Gates Foundation, according to health officials in the Democratic Republic of the Congo and Burundi and the Global Polio Eradication Initiative (GPEI), which on Thursday announced the news. (Article by Brenda Baletti, Ph.D. republished from […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,bill gates,CDC,Dangerous Medicine,outbreak,pharmaceutical fraud,polio vaccine danger,science deception,Suppressed,vaccine damage,vaccine gone wrong,vaccine injury,vaccine wars,vaccines,WHO,World Health Organization", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://medicine.news/2023-03-27-children-paralyzed-from-gates-funded-polio-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "medicine.news", "title": "7 children paralyzed by polio virus derived from new Gates-funded polio vaccine", "cleaned_text": "7 children paralyzed by polio virus derived from new Gates-funded polio vaccine\n\nSeven children were paralyzed by vaccine-derived polio linked to the new nOPV2 polio vaccine developed by the Bill & Melinda Gates Foundation, according to health officials in the Democratic Republic of the Congo and Burundi and the Global Polio Eradication Initiative (GPEI), which on Thursday announced the news.\n\nSeven children were paralyzed by vaccine-derived polio linked to the new nOPV2 polio vaccine developed by the Bill & Melinda Gates Foundation, according to health officials in the Democratic Republic of the Congo and Burundi and the Global Polio Eradication Initiative (GPEI), which on Thursday announced the news.\n\nThe Bill & Melinda Gates Foundation, a GPEI partner, funded the development and clinical trials for the nOPV2 vaccine.\n\nBurundi declared a national emergency after confirming eight cases of the virus and five samples from environmental surveillance of wastewater, the World Health Organization (WHO) said in a statement.\n\nThe country plans to implement a polio vaccination campaign in the coming weeks, aiming to vaccinate all eligible children, ages 0 to 7, against the virus.\n\nBurundi health authorities also plan to work with the WHO and GPEI to do risk assessments to determine the extent of the outbreak of the vaccine-derived virus.\n\nAnd they are increasing polio surveillance, with WHO employees collecting additional water samples and possibly opening new environmental surveillance sites.\n\n“We are disappointed,” said Dr. Ananda Bandyopadhyay, deputy director for technology, research and analytics on the Gates Foundation polio team. “Any such outbreak is disappointing,” he said, according to a Stat News report.\n\nVaccine-derived polio outbreaks are not a surprise with the nOPV2 vaccine, GPEI said. “While detection of these outbreaks is a tragedy for the families and communities affected, it is not unexpected with wider use of the vaccine,” it said on its website.\n\nThe oral vaccines, administered in much of Africa, the Middle East and parts of Asia, contain a live-but-weakened form of the polio virus modified to minimize its ability to paralyze.\n\nChildren vaccinated with the live oral vaccines shed the virus in their stool, which eventually ends up in sewage wastewater. Particularly in places where sanitation is poor, the virus can move from child to child, which, GPEI said, is actually the point.\n\nThe viruses can move from person to person and “actually help protect the community” it says on its website.\n\nHowever, as it continues to circulate over the course of 12 to 18 months, the attenuated virus in the live oral vaccine strains can revert to virulence, circulate, infect and paralyze “in places with low immunization rates.”\n\nThese viruses are called circulating vaccine-derived poliovirus, or cVDPV.\n\nAfghanistan and Pakistan now report more cases of paralysis from vaccine-derived polio than from the wild virus, and there have been several outbreaks of vaccine-derived infections across Africa, with more than 1,000 children paralyzed in 2020 alone, according to a study in the BMJ.\n\nIn 2022, 800 children developed paralytic polio from the vaccines.\n\nThe oral polio vaccines (OPV) used in much of the developing world are different from those given in the U.S. and some western countries, which use the inactivated (dead) polio vaccine (IPV) developed by Dr. Jonas Salk and first used in 1955, when polio became a global concern.\n\nAccording to the WHO, it’s only in “very rare cases,” that the administration of OPV results in vaccine-derived paralytic polio.\n\nIn addition to causing vaccine-associated paralytic polio, vaccine strains have the capacity to cause disease of the nervous system and to transmit from person to person, resulting in infectious poliomyelitis, The Defender reported.\n\nThe U.S. stopped using OPV in 2000 because it caused paralytic polio.\n\nAlbert Sabin developed the OPV in 1962. The ease of administering the oral vaccine made it the “ideal candidate for mass vaccination campaigns,” according to the WHO. It also stops virus transmission, which the IPV vaccine does not.\n\nAs GPEI’s global campaign to eradicate polio, begun in 1988, has progressed, the use of the oral vaccine has created many incidents of the spread of the vaccine-derived viruses.\n\nOf the three original strains of wild polio, types 2 and 3 were declared eradicated and only type 1 has not. The portion of the Sabin vaccines targeting type 2 viruses triggers the vast majority of vaccine-derived polio cases.\n\nThis problem and the fact that type 2 polio hasn’t been seen since 1999, led the polio program to stop using trivalent vaccines (targeting three types of polio) in all 155 countries administering OPV vaccines 2016, replacing them with bivalent OPVs.\n\nBut that decision, called “the switch,” made children more susceptible to vaccine-derived polio viruses — and the numbers of children infected with those viruses began to grow.\n\nGPEI responded by creating a new monovalent OPV vaccine that targets type 2 polio viruses and administering them in places where the virus is circulating.\n\nInstead of resolving the problem, the number of type 2 vaccine-derived outbreaks in Africa almost tripled from 2018 to 2019, and fear of outbreaks around the world grew because so many children were not immune to type 2 polio.\n\nSimultaneously, GPEI/Gates rushed to develop new OPVs that would make the virus less prone to the mutations that created problems, The Defender reported.\n\nThe new nOPV2 vaccine that caused the recent outbreaks was granted Emergency Use Listing by the WHO in November 2020, and the Strategic Advisory Group of Experts on Immunization (SAGE) recommended Gates’ nOPV2 become the “vaccine of choice” for responding to type 2 polio outbreaks caused by OPV.\n\nBut the nOPV2 also now is associated with vaccine-related polio outbreaks.\n\nVaccines nOPV for types 1 and 3 poliovirus, called nOPV1 and nOPV3, are in clinical trials, according to EPGI.\n\nIn an email to The Defender, Dr. Brian Hooker, Ph.D., P.E., Children’s Health Defense chief scientific officer and professor of biology at Simpson University said:\n\n“It is tragic but not unexpected that the use of live virus Sabin vaccines would cause the spread of vaccine-derived polio given the propensity of these viruses to back-mutate into their paralytic form.\n\n“It is even more alarming that the paralytic form is now circulating among the population of the Congo’s and Burundi’s children.”\n\nGPEI said 600 million doses of the new vaccine were administered in 28 countries since March 2021, and reiterated that the vaccine was “safe and effective.”\n\nThe Gates Foundation is the topmost funder of polio initiatives worldwide. In April 2013, Bill Gates said that eradicating polio was his “top priority,” — even though there had only been 19 cases worldwide that entire year at that point.\n\nSince Gates made that commitment, billions of dollars worldwide have been poured into the cause.\n\nThe Gates Foundation is one of several partners in the GPEI public-private partnership that also includes the WHO, UNICEF, the United Nations Children’s Fund, the Centers for Disease Control and Prevention, Gavi and Rotary International.\n\nThe Gates Foundation, in addition to funding the nPOV2 vaccine, GPEI and the WHO, also funds Rotary International, UNICEF, Gavi and the CDC Foundation.\n\n“In essence, the Gates Foundation funded the creation, development and clinical trials for the new nPOV2 polio vaccine, funds the organizations that administered millions of doses to be given under EUL without any long-term data, funds the organizations implementing its roll-out and surveillance and funds the entity monitoring adverse events associated with nPOV2’s use.\n\n“The Gates Foundation is also a funder of NPR and NPR’s blog, which have published numerous articles on VDPV2 and paved the way for Gates’ nPOV2 vaccine as the solution.”\n\nCritics, including sociologist Linsey McGoey and many scientists working in low-income settings have noted that as money is lavished on polio, millions of children are left vulnerable to a slew of often deadly, preventable diseases.\n\nThat’s because Gates funding not only funnels money into this single issue — or whatever single issue the foundation is interested in at any given time — but the terms of its grants often require commitments of funding, personnel and other resources from recipient nations.\n\nAs a result, the continued focus on polio is disproportionate to the need, diverting resources from other health issues and diseases, according to Robert Fortner, freelance science journalist, writing in the BMJ.\n\nFor example, Dr. Oliver Razum, an epidemiologist at the University of Bielefeld, Germany pointed to India, where the “sheer number of [Gates-funded polio] doses that had to be distributed,” twice a year, literally left no space in refrigerators for other vaccines against diseases such as measles.\n\nFortner also reported that polio funds from the Gates Foundation have led to local “brain drains,” with doctors, researchers and practitioners moved into eradication and away from local and locally funded health priorities.\n\nEven The Lancet published a similar critique of Gates back in 2009.\n\nDr. Richard Horton, editor-in-chief wrote in an editorial that, “Grants made by the Foundation do not reflect the burden of disease endured by those in deepest poverty,” and there is an “alarmingly poor correlation between the Foundation’s funding and childhood disease priorities.”\n\n“Important health programmes are being distorted by large grants from the Gates Foundation,” Horton said, adding, “There is also a serious anxiety about the transparency of the Foundation’s operation.”\n\nIn the wake of the Gates Foundation’s role in the COVID-19 epidemic, many more people express similar concerns today.", "opengraph": {"title": "7 children paralyzed by polio virus derived from new Gates-funded polio vaccine", "type": "article", "url": "https://www.medicine.news/2023-03-27-children-paralyzed-from-gates-funded-polio-vaccine.html", "site_name": "Medicine News", "description": "Seven children were paralyzed by vaccine-derived polio linked to the new nOPV2 polio vaccine developed by the Bill & Melinda Gates Foundation, according to health officials in the Democratic Republic of the Congo and Burundi and the Global Polio Eradication Initiative (GPEI), which on Thursday announced the news. (Article by Brenda Baletti, Ph.D. republished from […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2023/03/Polio-Acute-Antibiotic-Antibody-Antiserum-Bacteria-Bacterial.jpg"}, "tags": ["vaccine wars", "Big Pharma", "science deception", "outbreak", "polio vaccine danger", "Suppressed", "vaccine injury", "World Health Organization", "bill gates", "vaccines", "vaccine gone wrong", "vaccine damage", "WHO", "CDC", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/polio-vaccine-gates-funded/", "https://polioeradication.org/news-post/gpei-statement-on-cvdpv2-detections-in-burundi-and-democratic-republic-of-the-congo/", "https://www.gatesfoundation.org/ideas/media-center/press-releases/2022/10/world-health-summit-gates-foundation-commits-over-one-billion-to-end-polio", "https://polioeradication.org/wp-content/uploads/2020/10/nOPV2-FAQ_EN_Oct-2020.pdf", "https://www.afro.who.int/countries/burundi/news/burundi-declares-outbreak-circulating-poliovirus-type-2", "https://www.gatesfoundation.org/about/leadership/ananda-bandyopadhyay", "https://www.statnews.com/2023/03/16/polio-cases-derived-from-new-oral-vaccine-reported-for-first-time/?utm_campaign=rss", "https://www.brighteon.tv", "https://polioeradication.org/polio-today/polio-prevention/the-virus/vaccine-derived-polio-viruses/", "https://www.bmj.com/content/374/bmj.n1818.long", "https://www.who.int/teams/health-product-policy-and-standards/standards-and-specifications/vaccines-quality/poliomyelitis#:~:text=IPV%20has%20been%20used%20successfully,in%20protection%20against%20paralytic%20poliomyelitis.", "https://www.who.int/teams/health-product-policy-and-standards/standards-and-specifications/vaccines-quality/poliomyelitis#:~:text=IPV%20has%20been%20used%20successfully,in%20protection%20against%20paralytic%20poliomyelitis.", "https://childrenshealthdefense.org/defender/who-gates-polio-vaccine-united-kingdom/", "https://www.cdc.gov/vaccines/vpd/polio/hcp/vaccine-derived-poliovirus-faq.html#:~:text=Because%20OPV%20has%20not%20been,polioviruses%20and%20vaccine%2Dderived%20polioviruses.", "https://www.who.int/news-room/spotlight/history-of-vaccination/history-of-polio-vaccination", "https://www.gatesfoundation.org/our-work/programs/global-development/polio", "https://www.statnews.com/2019/10/21/decades-long-campaign-type-3-polioviruses-eradicated/", "https://www.statnews.com/2019/09/13/the-switch-polio-eradication-quandary/", "https://www.science.org/content/article/polio-eradication-program-faces-hard-choices-endgame-strategy-fails", "https://childrenshealthdefense.org/defender/polio-vaccines-resurgence/", "https://www.who.int/news/item/13-11-2020-first-ever-vaccine-listed-under-who-emergency-use", "https://polioeradication.org/wp-content/uploads/2020/10/nOPV2-FAQ_EN_Oct-2020.pdf", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/authors/brian-hooker-ph-d-p-e/", "https://childrenshealthdefense.org/", "https://www.proquest.com/openview/870484af1c81e8d816e87b2aa3d64edc/1?pq-origsite=gscholar&cbl=2043523", "https://www.rotary.org/en/rotary-and-gates-foundation-extend-funding-match-polio-eradication#:~:text=The%20partnership%20between%20Rotary%20and,the%20Bill%20%26%20Melinda%20Gates%20Foundation.", "https://www.gatesfoundation.org/ideas/media-center/press-releases/1999/11/maternal-and-neonatal-tetanus#:~:text=NEW%20YORK%20%2D%2D%20The%20U.S.,the%20Bill%20%26%20Melinda%20Gates%20Foundation.", "https://www.gavi.org/investing-gavi/funding/donor-profiles/bill-melinda-gates-foundation", "https://www.gatesfoundation.org/about/committed-grants/2020/02/inv005725", "https://childrenshealthdefense.org/defender/who-gates-polio-vaccine-united-kingdom/", "https://polioeradication.org/wp-content/uploads/2022/06/nOPV2-requirements-overview-for-countries-.pdf", "https://www.gatesfoundation.org/ideas/media-center/press-releases/1999/11/maternal-and-neonatal-tetanus#:~:text=NEW%20YORK%20%2D%2D%20The%20U.S.,the%20Bill%20%26%20Melinda%20Gates%20Foundation.", "https://www.who.int/news/item/13-11-2020-first-ever-vaccine-listed-under-who-emergency-use", "https://www.gatesfoundation.org/ideas/media-center/press-releases/1999/11/maternal-and-neonatal-tetanus#:~:text=NEW%20YORK%20%2D%2D%20The%20U.S.,the%20Bill%20%26%20Melinda%20Gates%20Foundation.", "https://www.who.int/teams/regulation-prequalification/regulation-and-safety/pharmacovigilance/vaccine-safety-net/vsn-members/global-advisory-committee-on-vaccine-safety", "https://www.npr.org/sections/goatsandsoda/2022/04/26/1092867458/vaccine-derived-polio-is-on-the-rise-a-new-vaccine-aims-to-stop-the-spread", "https://www.amazon.com/Such-Thing-Free-Gift-Philanthropy/dp/1784786233", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(09)60571-7/fulltext", "https://migrationhealthresearch.iom.int/users/oliver-razum", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(09)60885-0/fulltext", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/bill-gates-red-meat-witch-hunt-exposed/", "https://childrenshealthdefense.org/defender/polio-vaccine-gates-funded/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2023-03-27-children-paralyzed-from-gates-funded-polio-vaccine.html&linkname=7%20children%20paralyzed%20by%20polio%20virus%20derived%20from%20new%20Gates-funded%20polio%20vaccine", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}