{"result_id": "201026", "URL": "https://www.medicine.news/2022-06-09-sudden-vaccines-deaths-are-now-so-common-theyve-assigned-a-syndrome-name-for-it-sudden-adult-death-syndrome-sads.html", "timestamp": "2023-04-25 16:21:32 CEST+0200", "meta": {"description": "The murderous medical regime knows that covid vaccines are killing healthy young people at an alarming rate, so they’ve suddenly assigned a medical label for the phenomenon in order to distract people from the truth. Now, healthy young people who suddenly die without any medical explanation are said to have died from Sudden Adult Death […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,biological weapons,biowar,clot shots,SADS,spike protein,sudden adult death syndrome,sudden death,Vaccine deaths,Vaccine injuries,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2022-06-09-sudden-vaccines-deaths-are-now-so-common-theyve-assigned-a-syndrome-name-for-it-sudden-adult-death-syndrome-sads.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "Sudden vaccine deaths are now so common they’ve assigned a SYNDROME name for it: Sudden Adult Death Syndrome (SADS)", "cleaned_text": "Sudden vaccine deaths are now so common they’ve assigned a SYNDROME name for it: Sudden Adult Death Syndrome (SADS)\n\nThe murderous medical regime knows that covid vaccines are killing healthy young people at an alarming rate, so they’ve suddenly assigned a medical label for the phenomenon in order to distract people from the truth. Now, healthy young people who suddenly die without any medical explanation are said to have died from Sudden Adult Death Syndrome (SADS) rather than from vaccines.\n\nWhile SADS has existed in medical terminology long before covid, doctors and the media are now using this syndrome label in a new way: To try to explain away vaccine deaths. From what we can tell so far, there are no such “sudden deaths” in unvaccinated young adults. So far, this seems to be happening solely among those who have been vaccinated.\n\nThe UK Daily Mail has published an article detailing this new so-called “syndrome” which is of course just a convenient label to mask the true underlying cause of these sudden deaths. The title of their article is, “Healthy young people are dying suddenly and unexpectedly from a mysterious syndrome – as doctors seek answers through a new national register,” and it says that everyone under the age of 40, “…may potentially be at risk of having Sudden Adult Death Syndrome (SADS).”\n\nAll people under the age of 40 are now supposed to “get their hearts checked,” while oblivious doctors claim to be searching for the “genetic cause” behind SADS.\n\nNever before in the history of medicine have doctors and the media urged young people to “get their hearts checked.” This is only happening after the global push for covid vaccines which hijack the body’s cells and force them to create spike protein particles that cause blood clots.\n\nYou can’t make this up. The medical negligence, incompetence and even maliciousness behind all this is mind-boggling. Medical doctors who function as Big Pharma shills inject young people with gene therapy cocktails containing experimental mRNA sequences that produce spike proteins in the blood, contributing the artificial clotting. In some people, the clots build slowly over time, meaning many people are walking around with partially-formed blood clots in their circulatory system.\n\nBecause mRNA injections alter DNA and get incorporated into the genetic code — source: researchers from Harvard University and the Massachusetts Institute of Technology (MIT) — some of the body’s cells continue to produce these pro-clotting spike proteins indefinitely. These clotting factors contribute to additional clot formation in the body, resulting in diminished cardiovascular function and — importantly — a reduction of blood flow to the brain, which results in a loss of higher cognitive capabilities. (This is likely why so many vaccinated people have become brain damaged / cognitively retarded and have plunged into animalistic rage emotional processing of the world around them.)\n\nAt some point, one or more of the clots in the body completely shuts off the blood circulation necessary to maintain consciousness. At this point, the person loses consciousness and dies. Often this happens when they are driving, flying an airplane or even sleeping at night. This is why so many pilots are dying on the flight deck, for example, which is a major cause contributing to the current nationwide shortage of commercial airline pilots.\n\nA doctor named Dr. Elizabeth Paratz — who claims to be wondering “what genes cause this” syndrome — says that 90 percent of these spontaneous deaths occur outside the hospital. (Source: UK Daily Mail)\n\nAustralia is now launching a “SADS registry” to try to solve the mystery of why seemingly healthy adults are spontaneously dying. They are doing this while pushing more mRNA injections onto those very people, apparently oblivious to the fact that mRNA injections are “clot shots.”\n\nIt is widely known in the biosciences that viral genetic code is readily and automatically incorporated into human DNA\n\nmRNA injections aren’t even technically vaccines. They are “gene therapy” experimental medicines that alter not just cellular protein synthesis but are even incorporated into human DNA via reverse transcription. It turns out that a significant percentage of human DNA was acquired via this very process over many thousands of generations, where genetic material circulating in the environment is incorporated into human chromosomes. This phenomenon is widely known even in the conventional scientific community.\n\n“Non-retroviral RNA virus sequences have been detected in the genomes of many vertebrate species, including humans,” said biomedical researcher Liguo Zhang from MIT’s Whitehead Institute. (Source: MIT.edu)\n\nZhang even ran an experiment to test if SATS-CoV-2 viral fragments might incorporate themselves into human DNA:\n\nWith this in mind, Zhang and Jaenisch began to design experiments to test whether this viral integration could be happening with the novel coronavirus. With the help of Jaenisch lab postdoc Alexsia Richards, the researchers infected human cells with coronavirus in the lab and then sequenced the DNA from infected cells two days later to see whether it contained traces of the virus’ genetic material.\n\nIn all samples, they found fragments of viral genetic material…\n\nIn other words, parts of the SARS-CoV-2 were incorporated into the DNA of human cells. Another researcher explains:\n\n“There’s a very clear footprint for LINE1 integration,” Jaenisch says. “At the junction of the viral sequence to the cellular DNA, it makes a 20 base pair duplication.\n\nAnyone claiming spike protein genetic code can’t be incorporated into DNA is flatly ignorant of the state of modern genetic science.\n\nSpike protein mRNA becomes human DNA which turns the body into a clotting factory\n\nAs the above experiment shows, when the body is injected with genetic material, some of that material can be incorporated into the chromosomes of living cells. Although this is an oversimplification of the mechanisms in play, the overall result is the same: The body becomes a factory for spike proteins, producing them far beyond the intended time window during which an mRNA vaccine might be expected to function.\n\nIn other words, the vaccinated person becomes a walking spike protein factory that can never be turned off. From that point, they become a spike protein shedding machine while increasingly dumping self-synthesized spike proteins into their own circulating blood.\n\nOver time, this forms blood clots. When those clots complete their blockage or large arteries, blood can no longer reach the brain. When the brain has no blood supply, brain death occurs, and the death of the body quickly follows.\n\nThis is now being called “Sudden Adult Death Syndrome” even though it’s clearly caused by vaccine-induced blood clots.\n\nHere’s a photo of a blood clot taken from a covid patient. It shows the clotting power of the spike protein, which is also present in covid vaccines:\n\nBillions of people on our planet are now at risk of blood clot-induced sudden death, all by design: Vaccine Depopulation Syndrome\n\nIn summary, the murderous medical regime first injects billions of people with a biological weapon that might kill them, then they pretend to be shocked and surprised when so many healthy young adults start dying for no apparent medical reason. Do these medical monsters have no humanity (or scientific credibility) remaining at all?\n\nAlthough this syndrome is called SADS, what’s really sad is that it was all done on purpose in order to achieve global depopulation. If anything, these deaths should be labeled, “Vaccine Depopulation Syndrome” deaths. But of course the media and the medial tyrants are working triple time to cover all this up, and they know that dead vaccine victims don’t talk, so they can’t tell the living humans to save themselves by avoiding these deadly jabs.\n\nGet full details on this story and much more in today’s Situation Update podcast, which also covers economic survival strategies for surviving the total collapse of fiat currencies around the world:\n\nDiscover more information-packaged podcasts each day, along with special reports, interviews and emergency updates, at:\n\nJoin the free NaturalNews.com email newsletter to stay alerted about new, upcoming audiobooks that you can download for free.\n\nDownload my current audiobooks — including Ghost World, Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:\n\nDownload my new audiobook, “Resilient Prepping” at ResilientPrepping.com", "opengraph": {"title": "Sudden vaccine deaths are now so common they’ve assigned a SYNDROME name for it: Sudden Adult Death Syndrome (SADS)", "type": "article", "url": "https://www.medicine.news/2022-06-09-sudden-vaccines-deaths-are-now-so-common-theyve-assigned-a-syndrome-name-for-it-sudden-adult-death-syndrome-sads.html", "site_name": "Medicine News", "description": "The murderous medical regime knows that covid vaccines are killing healthy young people at an alarming rate, so they’ve suddenly assigned a medical label for the phenomenon in order to distract people from the truth. Now, healthy young people who suddenly die without any medical explanation are said to have died from Sudden Adult Death […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/06/HRR-2022-06-09-Situation-Update-VIDEO.jpg"}, "tags": ["clot shots", "sudden adult death syndrome", "biowar", "Vaccine deaths", "SADS", "vaccines", "spike protein", "Vaccine injuries", "sudden death", "biological weapons"], "tweets": [], "movies": [], "links": ["http://vaccines.news", "https://www.dailymail.co.uk/news/article-10895067/Doctors-trying-determine-young-people-suddenly-dying.html", "http://spikeprotein.news", "https://www.brighteon.tv", "https://medicine.news/2021-04-12-mrna-injections-permanently-alter-human-dna.html", "https://childrenshealthdefense.org/defender/science-mrna-vaccines-alter-dna/", "https://www.dailymail.co.uk/news/article-10895067/Doctors-trying-determine-young-people-suddenly-dying.html", "https://wi.mit.edu/news/new-research-reveals-why-some-patients-may-test-positive-covid-19-long-after-recovery", "http://Brighteon.com/35995936-dd2b-4546-962f-2e5d9e0f0ba6", "https://www.brighteon.com/channels/hrreport", "http://Brighteon.social/@HealthRanger", "https://t.me/RealHealthRanger", "https://truthsocial.com/@healthranger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.naturalnews.com/readerregistration.html", "https://audiobooks.naturalnews.com/", "http://ResilientPrepping.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-06-09-sudden-vaccines-deaths-are-now-so-common-theyve-assigned-a-syndrome-name-for-it-sudden-adult-death-syndrome-sads.html&linkname=Sudden%20vaccine%20deaths%20are%20now%20so%20common%20they%E2%80%99ve%20assigned%20a%20SYNDROME%20name%20for%20it%3A%20Sudden%20Adult%20Death%20Syndrome%20%28SADS%29", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}