{"result_id": "201004", "URL": "https://www.medicine.news/2023-04-04-man-needs-heart-transplant-after-covid-booster.html", "timestamp": "2023-04-25 16:21:17 CEST+0200", "meta": {"description": "A Dutch-Canadian father who got injected thrice with the Wuhan coronavirus (COVID-19) vaccines now needs a heart transplant following severe heart failure. Alex van Kooten, 52, was extremely healthy and fit prior to his vaccination. The Netherlands-born van Kooten immigrated to Canada with his parents at the age of nine. He later relocated to Aruba […]", "lang": "en", "keywords": "Alex van Kooten,badhealth,badmedicine,booster,calcified artery,covid-19,heart inflammation,heart issues,heart transplant,medical martial law,Medical Tyranny,pandemic,vaccine,vaccine damage,vaccine injury,vaccine mandate,vaccine wars,Wuhan coronavirus", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2023-04-04-man-needs-heart-transplant-after-covid-booster.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "Dutch-Canadian man now needs HEART TRANSPLANT after COVID booster", "cleaned_text": "Dutch-Canadian man now needs HEART TRANSPLANT after COVID booster\n\nA Dutch-Canadian father who got injected thrice with the Wuhan coronavirus (COVID-19) vaccines now needs a heart transplant following severe heart failure.\n\nAlex van Kooten, 52, was extremely healthy and fit prior to his vaccination. The Netherlands-born van Kooten immigrated to Canada with his parents at the age of nine. He later relocated to Aruba in 2017 with his wife to manage property.\n\nHowever, the two wanted to visit their adult children in Canada after two years – which coincided with the COVID-19 pandemic. Canada had a vaccine mandate for travelers in place at the time, so van Kooten complied with this by getting his first dose of the Pfizer-BioNTech vaccine in March 2021. He took his second dose in May of the same year, before leaving for a trip to his country of birth. (Related: Canadian government sued over discriminatory air travel vaccine mandate.)\n\nBut shortly after arriving, van Kooten experienced heart palpitations and shortness of breath – a surprising development given that he had been an avid hiker in Aruba. His electrocardiogram (EKG) came back clean and palpitations lasted for almost six months, with a physician advising him that symptoms may all be stress-related.\n\nVan Kooten and his wife were able to visit Canada in August 2021 before flying back to Aruba in December of that year. He then took a booster in March 2022 with the intent of visiting the Netherlands and Canada a month later. But upon arriving at his first stop, he ended up at the ICU of the University Medical Center Groningen.\n\nVan Kooten “living on borrowed time” because of the injections\n\nDays after taking the booster shot, van Kooten became unable to lie down “without gasping for air and was barely able to walk 20 feet.” He also started gaining weight, which doctors later discovered was caused by water retention. Gaslighting by doctors he visited only contributed to van Kooten’s suffering, claiming that he needed “psychiatric help.”\n\nSpecialists later found that van Kooten had heart inflammation so severe his aortic valve had completely calcified to a degree “normally associated with having major heart issues for years.” An unsuccessful surgery left him with a left ventricular assist device (LVAD) in place of his heart to transport blood throughout his body. Van Kooten is also on the waiting list for a heart transplant.\n\n“My heart basically stands still,” he told Vision Times. “My [heart’s] left side does not work at all, and there’s the [LVAD] pump that does the work.”\n\nDoctors have not officially linked his case with a vaccine adverse reaction. Van Kooten’s ordeal had already drained him of health, energy and financial resources. Worse, the Dutch government has not been helpful.\n\nThe 52-year-old had reservations about both the vaccines and the risk of serious illness from COVID-19 for people as healthy as he was. “Not knowing when you could resume a normal life – you feel pressured in doing so [getting vaccinated],” van Kooten said.\n\n“I’m living on borrowed time. I’m living on a life support system, and definitely with the feeling that I’ve been left behind and the government really doesn’t care. Doesn’t matter that they messed up my life with the vaccines. I’ve just got to wait like everybody else as if I have a heart issue that wasn’t from, in my opinion, a forced vaccine in order to participate in society.”\n\nWatch Stew Peters and Sucharit Bhakdi discuss Princess Bajrakitiyabha of Thailand suffering a heart attack after her COVID-19 vaccination below.\n\nThis video is from Diane Sosen’s channel on Brighteon.com.\n\nG20 globalists push mandatory vaccine passports for all international travel despite fading COVID plandemic.", "opengraph": {"title": "Dutch-Canadian man now needs HEART TRANSPLANT after COVID booster", "type": "article", "url": "https://www.medicine.news/2023-04-04-man-needs-heart-transplant-after-covid-booster.html", "site_name": "Medicine News", "description": "A Dutch-Canadian father who got injected thrice with the Wuhan coronavirus (COVID-19) vaccines now needs a heart transplant following severe heart failure. Alex van Kooten, 52, was extremely healthy and fit prior to his vaccination. The Netherlands-born van Kooten immigrated to Canada with his parents at the age of nine. He later relocated to Aruba […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2023/04/Coronavirus-Covid-19-Booster-Vaccine-Vials.jpg"}, "tags": ["pandemic", "covid-19", "vaccine wars", "vaccine", "heart issues", "vaccine injury", "Alex van Kooten", "vaccine mandate", "Medical Tyranny", "heart inflammation", "heart transplant", "calcified artery", "vaccine damage", "Wuhan coronavirus", "medical martial law", "booster"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/dutch-canadian-develops-heart-failure-after-taking-covid-booster-to-comply-with-travel-mandates/", "https://naturalnews.com/2022-02-14-canadian-government-sued-over-travel-vaccine-mandate.html", "https://www.brighteon.tv", "https://www.visiontimes.com/2023/03/08/dutch-canadian-develops-heart-failure-after-booster.html", "https://vaccineinjurynews.com", "https://www.brighteon.com/9e26139d-6407-45a2-8839-c1147ec61573", "https://www.brighteon.com/channels/dianesosen", "https://naturalnews.com/2022-11-21-g20-globalists-push-mandatory-vaccine-passports-all-international-travel.html", "https://pandemic.news/2022-08-04-canada-vaccine-passport-to-face-privacy-probe.html", "https://vaccines.news/2022-01-18-canada-expands-vaccine-mandate-violates-human-rights.html", "https://www.lifesitenews.com/news/dutch-canadian-develops-heart-failure-after-taking-covid-booster-to-comply-with-travel-mandates/", "https://www.visiontimes.com/2023/03/08/dutch-canadian-develops-heart-failure-after-booster.html", "https://www.brighteon.com/9e26139d-6407-45a2-8839-c1147ec61573", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2023-04-04-man-needs-heart-transplant-after-covid-booster.html&linkname=Dutch-Canadian%20man%20now%20needs%20HEART%20TRANSPLANT%20after%20COVID%20booster", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}