{"result_id": "201022", "URL": "https://www.medicine.news/2022-08-10-canadian-doctor-13-colleagues-dead-covid-vaccine.html", "timestamp": "2023-04-25 16:21:29 CEST+0200", "meta": {"description": "A Canadian doctor sounded the alarm over the Wuhan coronavirus (COVID-19) vaccine after 13 physicians died following the shot’s rollout. Alberta-based physician and cancer researcher Dr. William Makis made this warning as he predicted “many more deaths to come” because of the COVID-19 vaccines. “I’ve now tracked 13 Canadian doctors ‘sudden deaths.’ This is the […]", "lang": "en", "keywords": "badhealth,badmedicine,brainwashed,Canada,covid-19,Dangerous Medicine,doctors,obey,pandemic,Steve Kirsch,vaccine,vaccine damage,vaccine death,vaccine wars,William Makis,Wuhan coronavirus", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2022-08-10-canadian-doctor-13-colleagues-dead-covid-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "Canadian doctor: 13 physicians DEAD since COVID clot shot rollout", "cleaned_text": "A Canadian doctor sounded the alarm over the Wuhan coronavirus (COVID-19) vaccine after 13 physicians died following the shot’s rollout.\n\nAlberta-based physician and cancer researcher Dr. William Makis made this warning as he predicted “many more deaths to come” because of the COVID-19 vaccines.\n\n“I’ve now tracked 13 Canadian doctors ‘sudden deaths.’ This is the most complete data set I’ve seen anywhere by far,” he said.\n\nAccording to Makis, three doctors died while exercising – two while swimming and one while running.\n\nTwo of the three doctors who passed away during physical activity were very high-level athletes. Dr. Candace Nayman, 27, was a triathlete while Dr. Paul Hannam, 50, was an Olympic sailor.\n\nThree of the 13 doctors, meanwhile, died unexpectedly ‘in their sleep.’\n\nTwo doctors died from aggressive cancers that had arisen within the past year. Dr. Jakub Sawicki developed stage four gastric cancer 11 months after vaccination, while Dr. Lorne Segall developed stage four lung cancer a year after being injected.\n\nDespite the varied circumstances of their deaths, Makis pointed out that all 13 doctors were injected with at least three COVID-19 vaccine doses “due to illegal vaccine mandates.”\n\n“Remember: These are young, healthy individuals who are always first in line to get jabbed. [The] vast majority of doctors will get their fourth and fifth jabs this summer and fall. Sadly, I expect many more deaths to come.”\n\nAccording to LifeSiteNews, the 13 doctors who died due to the COVID-19 vaccines were between the ages of 27 and 62. Middle-aged men comprised the largest demographic, the outlet added. (Related: Eighty percent of those DYING from “covid” in Canada are fully jabbed.)\n\nWhile the vaccine deaths began in November 2021, seven of the fatalities occurred in July 2022 – shortly after the fourth COVID-19 vaccine dose became widely available across Canada.\n\nMany more doctors died of the COVID shots, but did not receive coverage\n\nEntrepreneur Steve Kirsch touched on the issue of the 13 Canadian physicians who died due to the vaccines in an Aug. 7 Substack post.\n\nHe referenced the earlier group of doctors Makis cited in his Gettr post, but added two additional fatalities who died in March and August, respectively.\n\nDr. Bradley James Harris died on March 14, with Kirsch saying the physician’s passing “went unnoticed.” An obituary for Harris described him as having “an incredible zest for life, meeting new people and sharing stories.” Outside of medical practice, the late doctor had “a deep interest in craft beer and the science of brewing.”\n\nDr. Vincent Chi Wai Mak, meanwhile, died on Aug. 3. Mak, who has his roots in Hong Kong, emigrated to Canada in 1988. An obituary for the late doctor described him as “a man of many passions and talents” – including singing and playing the keyboard and guitar.\n\nKirsch lamented that despite these vaccine deaths, Canadian doctors “will keep believing the ‘safe and effective’ narrative because that’s what they are trained to do – trust the authorities.”\n\n“My doctor friends in Canada simply cannot believe how brainwashed [their] colleagues are. Zero deaths in 30 years, now all of a sudden – [several] deaths in nine months, each happening shortly after their shots,” he said.\n\n“The Canadian [doctors] will continue to ignore the [statistics], believe the ‘fact checkers’ and line up for the shots. It will get worse in the next round.”\n\nAccording to the entrepreneur, the sheer number of vaccine deaths among physicians is simply too high in that category alone. The doctors all dying shortly after their vaccination meant it was most likely that the COVID-19 shot itself killed them by either “accelerating their existing medical condition, creating a new medical condition or [triggering a] mysterious sudden death.”\n\n“While it could be that one or maybe two of the deaths were just coincidences, odds are that the rest were not. This sort of pattern has not happened before.”\n\nVaccineDeaths.com has more stories about fatalities connected to the COVID-19 vaccines.\n\nWatch this video of a vaccinated individual in China suddenly collapsing and dying at a train station.\n\nThis video is from the Puretrauma357 channel on Brighteon.com.\n\nVaccinated population accounts for 92% of COVID-19 deaths in Canada.\n\nCDC data reveal 84% increase in death of millennials after vaccine mandate.\n\nThe Vaccine Death Report reveals that MILLIONS of people have died from covid vaccines.\n\nDEATH SHOTS: Canadian data show that COVID “vaccines” INCREASE the risk of death from covid.\n\nStunning German analysis finds that COVID-19 vaccine death rates are FAR higher than previously reported.", "opengraph": {"title": "Canadian doctor: 13 physicians DEAD since COVID clot shot rollout", "type": "article", "url": "https://www.medicine.news/2022-08-10-canadian-doctor-13-colleagues-dead-covid-vaccine.html", "site_name": "Medicine News", "description": "A Canadian doctor sounded the alarm over the Wuhan coronavirus (COVID-19) vaccine after 13 physicians died following the shot’s rollout. Alberta-based physician and cancer researcher Dr. William Makis made this warning as he predicted “many more deaths to come” because of the COVID-19 vaccines. “I’ve now tracked 13 Canadian doctors ‘sudden deaths.’ This is the […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/08/Vaccine-Vial-Bottles-Covid-19.jpg"}, "tags": ["pandemic", "covid-19", "vaccine wars", "vaccine", "vaccine death", "Canada", "William Makis", "doctors", "obey", "vaccine damage", "brainwashed", "Wuhan coronavirus", "Steve Kirsch"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/canadian-doctor-sounds-alarm-over-13-sudden-deaths-among-physicians-since-covid-jab-rollout/", "https://naturalnews.com/2022-06-18-deaths-covid-canada-fully-vaccinated.html", "https://www.brighteon.tv", "https://stevekirsch.substack.com/p/fourteen-young-canadian-docs-die", "https://www.comoxvalleyrecord.com/obituaries/dr-bradley-james-harris/", "https://mountpleasantgroup.permavita.com/site/DrVincentChiWaiMak.html", "https://obey.news", "https://vaccinedeaths.com/", "https://www.brighteon.com/d2257648-0db7-497d-9a0a-ab8f02d3c8d3", "https://www.brighteon.com/channels/puretrauma357", "https://pandemic.news/2022-07-22-vaccinated-population-92percent-covid-deaths-in-canada.html", "https://vaccinedeaths.com/2022-03-17-data-reveals-increased-millennial-deaths-vaccine-mandate.html", "https://vaccinedeaths.com/2021-09-30-vaccine-death-report-millions-died-covid-vaccines.html", "https://vaccinedeaths.com/2022-07-17-canadian-data-covid-vaccines-increase-death-risk.html", "https://vaccinedeaths.com/2022-02-02-german-analysis-finds-covid-vaccine-death-rate-higher-than-reported.html", "https://www.lifesitenews.com/news/canadian-doctor-sounds-alarm-over-13-sudden-deaths-among-physicians-since-covid-jab-rollout/", "https://gettr.com/post/p1kwmea0caa", "https://stevekirsch.substack.com/p/fourteen-young-canadian-docs-die", "https://www.comoxvalleyrecord.com/obituaries/dr-bradley-james-harris/", "https://mountpleasantgroup.permavita.com/site/DrVincentChiWaiMak.html", "https://www.brighteon.com/d2257648-0db7-497d-9a0a-ab8f02d3c8d3", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-08-10-canadian-doctor-13-colleagues-dead-covid-vaccine.html&linkname=Canadian%20doctor%3A%2013%20physicians%20DEAD%20since%20COVID%20clot%20shot%20rollout", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}