{"result_id": "201021", "URL": "https://www.medicine.news/2022-09-27-european-children-appalling-increase-excess-deaths-covid-vaccine.html", "timestamp": "2023-04-25 16:21:29 CEST+0200", "meta": {"description": "In May of 2021, the European Medicines Agency (EMA) extended emergency use authorization for the Pfizer covid-19 vaccine for children ages 12 to 15. It didn’t take long for European governments to push the vaccine onto children as young as five. By August 30, 2022, European children had suffered through an appalling 755 percent increase […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,Censored Science,childhood mortality,coercion,corruption,death by Pfizer,Europe Medicines Agency,excess deaths,mass murder,medical violence,mortality statistics,pharmaceutical fraud,public health threat,Vaccine deaths,vaccine wars,vaccines,WHO", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2022-09-27-european-children-appalling-increase-excess-deaths-covid-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "European children suffer appalling 755% increase in excess death after COVID VACCINE approval", "cleaned_text": "In May of 2021, the European Medicines Agency (EMA) extended emergency use authorization for the Pfizer covid-19 vaccine for children ages 12 to 15. It didn’t take long for European governments to push the vaccine onto children as young as five.\n\nBy August 30, 2022, European children had suffered through an appalling 755 percent increase in excess death. This excess in childhood mortality was not observed in 2020, during a time when governments and school systems sought to inundate children with fear, lockdowns, social isolation and forced masking. These actions were conducted under the pretense of “protecting the lives of children.” However, these totalitarian mind controls and behavioral abuses were used to coerce parents and their children to comply with an experiment – an experiment that has caused mass suffering and death.\n\nChildhood mortality spikes across Europe, leading to massive investigation and probable cover-up\n\nThe European Union’s official statistics department is now conducting a Europe-wide investigation into this excess death in children. This has led to some new revelations. The organization in charge of publishing mortality data, the European Mortality Monitoring Projects (EuroMOMO), altered the baseline by which excess deaths are measured, obviously in an attempt to coverup these historic crimes against children. The alteration in the baseline was reported in week 36, right after the investigation was announced. This abrupt action artificially reduced the number of excess deaths in children, making it appear as though nothing serious ever happened to children over the past fifteen months.\n\nWhen the baseline is restored, the excess in childhood mortality for children ages 1 to 14 increases to 755 percent and also increases by 630 percent for all age groups. The average excess deaths among children aged 0 to 14 from week 22, 2017 to week 37, 2021 was 169.65. From week 22, 2021 to week 37, 2022, the number of excess deaths spikes to 1,224!\n\nAccording to statistics from 2020, deaths among children were well BELOW normal. Strangely enough, there were 408 fewer deaths among children than expected in 2020, when compared to previous years.\n\nThese trends continued throughout 2021, up until week 22, which is when the EMA rolled out covid vaccination for children ages 12-15. Excess mortality was recorded every week from that point forward, skyrocketing beyond the baseline normal. By 2022, up to three needless doses of covid vaccine have been made available to children 12 and over. Children as young as five have also been introduced to the two-dose Pfizer jab. As new doses of covid vaccine are pushed onto children, European governments are creating a new baseline normal of excess mortality in children.\n\nThe covid vaccine program appears to be the greatest threat to public health\n\nThe EUROMOMO system reports mortality across 29 European countries on a weekly basis. The system is supported by a network of organizations that have a vested interest in promoting vaccination. These include the European Centre for Disease Prevention and Control (ECDC) and the World Health Organization (WHO). After all, the EUROMOMO system was setup to “detect and measure excess deaths related to seasonal influenza, pandemics and other public health threats,” and vaccination campaigns were supposed to be the answer to these stated public health threats.\n\nThe WHO’s insistence to snuff out “vaccine hesitancy” caused many people to succumb to manipulation, coercion and physical destruction of their mind, livelihood and physical health — an attack so violent, it has breached parental rights and preyed upon the lives of an entire generation of children. The public’s blind faith in vaccination has resulted in excess mortality across the board, as children are made victims. It appears as if the covid fear campaigns were disingenuous all along, and the vaccine program was the greatest threat.", "opengraph": {"title": "European children suffer appalling 755% increase in excess death after COVID VACCINE approval", "type": "article", "url": "https://www.medicine.news/2022-09-27-european-children-appalling-increase-excess-deaths-covid-vaccine.html", "site_name": "Medicine News", "description": "In May of 2021, the European Medicines Agency (EMA) extended emergency use authorization for the Pfizer covid-19 vaccine for children ages 12 to 15. It didn’t take long for European governments to push the vaccine onto children as young as five. By August 30, 2022, European children had suffered through an appalling 755 percent increase […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/09/Doctor-Girl-Child-Vaccine-Flu-Shot-Syringe.jpg"}, "tags": ["Europe Medicines Agency", "childhood mortality", "excess deaths", "vaccine wars", "Big Pharma", "Vaccine deaths", "mass murder", "mortality statistics", "medical violence", "coercion", "death by Pfizer", "vaccines", "corruption", "WHO", "public health threat", "Censored Science", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/09/25/755percent-increase-deaths-children-europe/", "https://expose-news.com/2022/09/18/eu-forced-investigate-17x-increase-excess-deaths-children/", "https://www.brighteon.tv", "http://vaccinedeaths.com", "https://www.euromomo.eu/graphs-and-maps", "http://vaccines.news", "https://www.naturalnews.com/2022-09-26-cdc-is-sacrificing-kids-for-big-pharma.html", "https://expose-news.com/2022/09/25/755percent-increase-deaths-children-europe/", "https://expose-news.com/2022/09/18/eu-forced-investigate-17x-increase-excess-deaths-children/", "https://www.euromomo.eu/graphs-and-maps", "https://www.naturalnews.com/2022-09-26-cdc-is-sacrificing-kids-for-big-pharma.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-09-27-european-children-appalling-increase-excess-deaths-covid-vaccine.html&linkname=European%20children%20suffer%20appalling%20755%25%20increase%20in%20excess%20death%20after%20COVID%20VACCINE%20approval", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}