{"result_id": "201036", "URL": "https://www.medicine.news/2023-03-26-video-footage-fauci-going-door-to-door-promoting-black-genocide.html", "timestamp": "2023-04-25 16:21:38 CEST+0200", "meta": {"description": "“The Science” himself — Dr. Anthony Fauci — is praised and worshiped in a new PBS documentary series: “American Masters.” In one of the segments, Fauci is lauded for going door-to-door to combat so-called “vaccine hesitancy.” The footage shows Fauci traveling with Washington D.C. Mayor Muriel Bowser. The two figures go door-to-door to target “vaccine hesitant” […]", "lang": "en", "keywords": "bad science,badhealth,badmedicine,coercion,demonic,depopulation,Dr Fauci,ethnic cleansing,evil,false savior,Fauci,Fear,fear propaganda,genocide,government lies,harmful mandates,human rights abuses,manipulation,medical experimentation,medical fraud,misinformation,money laundering,Suppressed,suppressed treatments,Twisted,vaccine incentives,Vaccine injuries,vaccine wars,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2023-03-26-video-footage-fauci-going-door-to-door-promoting-black-genocide.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "Video footage released of Fauci going door to door promoting BLACK GENOCIDE via deadly vaccines", "cleaned_text": "Video footage released of Fauci going door to door promoting BLACK GENOCIDE via deadly vaccines\n\n“The Science” himself — Dr. Anthony Fauci — is praised and worshiped in a new PBS documentary series: “American Masters.” In one of the segments, Fauci is lauded for going door-to-door to combat so-called “vaccine hesitancy.” The footage shows Fauci traveling with Washington D.C. Mayor Muriel Bowser. The two figures go door-to-door to target “vaccine hesitant” African Americans. The footage shows the two political figures getting praised at times, but other residents of “the wards” wanted nothing to do with the government’s fear, coercion, and deadly experimentation.\n\nIn the documentary, Fauci and Bowser targeted southeast D.C. — a historically Black community with low vaccination rates. “So, this is Anacostia, a historic African American neighborhood.” Fauci began. “In New York, they have neighborhoods. Here, they have wards. This is ward 8. It’s the typical social determinants of health, where they don’t get good medical care; they have a high degree of HIV, high degree of covid-19, the lowest level of vaccination. They’re sort of the disenfranchised group that we got to reach out to. So, the mayor is now with me, and gonna congratulate the people in the community who are going out to the community to get people vaccinated.”\n\nFauci and Bowser greeted residents on their doorstep and implored them to get the covid-19 jabs. They did not provide any level of informed consent. Some people were giddy to see Fauci, and they let him know that they were already vaccinated, blowing kisses and posing for selfies. But Fauci and Bowser were also rejected…\n\nResidents reject Fauci and Mayor Bowser right to their faces\n\nEven though Fauci was the Chief Medical Advisor to the President of the United States; even though he had a lock-down-loving mayor at his side, some individuals strongly rejected his plea to get them vaccinated.\n\nOne woman stepped out on her front porch with her children and said she is not vaccinated. Mayor Bowser quipped that “she should be to protect her children from COVID.” Fauci piped in, “We gotta get you vaccinated… if you were to get infected, you could pass it on to them.” Fauci continued on with the big lie, that the woman would be “protecting” her family and stopping the spread of the virus if she just got vaccinated.\n\nDuring the encounter, another woman stepped in and pushed back against Fauci’s claims. She said she heard that the vaccine doesn’t cure COVID and “it doesn’t stop you from getting it.” Fauci pushed back with more lies, “On the very very very rare chance that you do get [Covid], even if you’re vaccinated, it’s a very – you don’t even feel sick.”\n\nIn another incident, Fauci and Bowser begin pushing the COVID vaccine from the bottom steps of a man’s porch. The man spoke out, saying, “The people in America are not settled with the information that’s been given to us right now. So, I’m not going to be lining up taking a shot or a vaccination for something that wasn’t clear in the first place.”\n\nThe man reiterated, “And then you all create a shot in miraculous time,” questioning the timeline of the vaccine’s development. “It takes years to create vaccinations,” he said. “Nine months is definitely not enough for nobody to be taking no vaccination that you all came up with,” he added.\n\nBowser clapped back, blaming the man for spreading a virus (that he wasn’t infected with). “The only reason I’m talking to you right now, as close as we are, is that I’ve been vaccinated. If thousands of people like you don’t get vaccinated, you’re going to let this virus continue to percolate in this country and in this world.” Of course, he’s supposed to feel guilty for a false accusation that he is killing other people and causing them to social distance. But he didn’t take the blame.\n\n“When you start talking about paying people to get vaccinated, when you start talking about incentivizing things to get people vaccinated, it’s something else going on with that,” he added. “Y’all’s campaign is about fear. It’s about inciting fear in people. Y’all attack people with fear.”\n\nFauci, Bowser, and their team of government thugs left the scene in a hurry. The documentary is historical evidence of Fauci’s participation in mass murder, genocidal vaccine programs that depended upon illegal gain-of-function (bioweapons) research, predatory vaccine development, suppressed antiviral treatments, harmful mandates and dangerous hospital protocol, diagnostic medical fraud, fear propaganda, money laundering, child abuse, censorship, segregation, various human rights abuses, and millions of direct harms caused by illegal medical experimentation.", "opengraph": {"title": "Video footage released of Fauci going door to door promoting BLACK GENOCIDE via deadly vaccines", "type": "article", "url": "https://www.medicine.news/2023-03-26-video-footage-fauci-going-door-to-door-promoting-black-genocide.html", "site_name": "Medicine News", "description": "“The Science” himself — Dr. Anthony Fauci — is praised and worshiped in a new PBS documentary series: “American Masters.” In one of the segments, Fauci is lauded for going door-to-door to combat so-called “vaccine hesitancy.” The footage shows Fauci traveling with Washington D.C. Mayor Muriel Bowser. The two figures go door-to-door to target “vaccine hesitant” […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2023/03/Anthony-Fauci-Roundtable-Red-Cross-National-Headquarters.jpg"}, "tags": ["money laundering", "manipulation", "medical experimentation", "medical fraud", "human rights abuses", "false savior", "vaccine incentives", "Vaccine injuries", "harmful mandates", "government lies", "demonic", "fear propaganda", "misinformation", "Fear", "vaccine wars", "Fauci", "Suppressed", "depopulation", "Dr Fauci", "evil", "coercion", "genocide", "Twisted", "vaccines", "suppressed treatments", "ethnic cleansing"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/new-fauci-documentary-shows-him-lying-to-black-residents-about-covid-vaccine-effectiveness-captures-him-being-humiliated-when-they-set-the-record-straight-video/", "https://www.brighteon.com/ca45b722-7f63-435a-8bac-a68c6a906d5d", "https://www.pbs.org/video/dr-fauci-visits-dc-battle-vaccine-hesistancy-nvc620/?continuousplayautoplay=true", "https://www.brighteon.tv", "http://censorship.news", "https://naturalnews.com/2022-03-28-fauci-greatest-mass-murderer-in-world-history.html", "https://openvaers.com/", "https://100percentfedup.com/new-fauci-documentary-shows-him-lying-to-black-residents-about-covid-vaccine-effectiveness-captures-him-being-humiliated-when-they-set-the-record-straight-video/", "https://www.brighteon.com/ca45b722-7f63-435a-8bac-a68c6a906d5d", "https://www.pbs.org/video/dr-fauci-visits-dc-battle-vaccine-hesistancy-nvc620/?continuousplayautoplay=true", "https://thehighwire.com/videos/breaking-news-ican-obtains-cdc-v-safe-data/", "https://naturalnews.com/2022-03-28-fauci-greatest-mass-murderer-in-world-history.html", "https://openvaers.com/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2023-03-26-video-footage-fauci-going-door-to-door-promoting-black-genocide.html&linkname=Video%20footage%20released%20of%20Fauci%20going%20door%20to%20door%20promoting%20BLACK%20GENOCIDE%20via%20deadly%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}