{"result_id": "201005", "URL": "https://www.medicine.news/2022-11-08-kirsch-covid-vaccine-most-dangerous-ever-made.html", "timestamp": "2023-04-25 16:21:18 CEST+0200", "meta": {"description": "Tech entrepreneur, philanthropist and Wuhan coronavirus (COVID-19) vaccine expert and researcher Steve Kirsch has compiled all publicly available data on the vaccine to prove that it is the most dangerous vaccine in recorded history. In Kirsch’s personal Substack blog, he laid out some of “the most compelling pieces of evidence” he could gather proving the […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,big government,Big Pharma,biological weapon,conspiracy,covid-19,covid-19 vaccines,Dangerous Medicine,deception,pandemic,pharmaceutical fraud,spike protein,Steve Kirsch,vaccine damage,Vaccine dangers,Vaccine deaths,vaccine injury,vaccine wars,vaccines,VAERS", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2022-11-08-kirsch-covid-vaccine-most-dangerous-ever-made.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "Steve Kirsch: Data shows COVID-19 vaccine is the MOST DANGEROUS vaccine ever made", "cleaned_text": "Steve Kirsch: Data shows COVID-19 vaccine is the MOST DANGEROUS vaccine ever made\n\nTech entrepreneur, philanthropist and Wuhan coronavirus (COVID-19) vaccine expert and researcher Steve Kirsch has compiled all publicly available data on the vaccine to prove that it is the most dangerous vaccine in recorded history.\n\nIn Kirsch’s personal Substack blog, he laid out some of “the most compelling pieces of evidence” he could gather proving the dangers of getting vaccinated against COVID-19. While by no means an exhaustive list, it provides the key pieces of data that are impossible for scientists to properly explain if the COVID-19 vaccines actually are safe and effective. (Related: Panel of experts: More and more young people are dying because of COVID-19 vaccines.)\n\nThe most compelling piece of evidence by far is data from the Vaccine Adverse Event Reporting System (VAERS), a United States government program for reporting vaccine safety issues co-managed by the Food and Drug Administration (FDA) and the Centers for Disease Control and Prevention (CDC).\n\nAccording to VAERS, an estimated hundreds of thousands of Americans have been killed by the COVID-19 vaccines, with several million more injured.\n\nGraphs showing the number of vaccine-related deaths submitted to VAERS show a massive jump in 2021 as soon as the COVID-19 vaccines start being distributed in the United States. The CDC is claiming that VAERS is overreported but cites no evidence. Kirsch’s own investigation suggests that VAERS could be underreported by a factor of 5.4 times.\n\n“This is a clear message that the CDC is not monitoring safety events. We were lied to. They said they were watching the safety signals like a hawk. They forgot to mention the hawk had a blindfold on,” wrote Kirsch. “If these [deaths and injuries] weren’t caused by the vaccine, what caused them? Why are there more adverse events reported for these vaccines than for all other vaccines in history combined? Nobody can answer that question.”\n\nGovernments around the world trying to hide certain types of COVID-19 vaccine data\n\nThe convenient disappearance of certain types of data from all over the world further proves how dangerous the COVID-19 vaccine is.\n\nIn the United States, the FDA is withholding autopsy reports from people who died within hours or days after getting vaccinated.\n\nIf the COVID-19 vaccines were not the cause of these deaths, Kirsch noted that there would be no reason for the FDA to block autopsy reports from going public.\n\nIn Canada, the number one cause of death is listed as “unexplained.” This so-called “unknown cause” is one of the top causes of death in most Canadian provinces and territories, and it is the number one killer in the province of Alberta.\n\nIn Israel, a confidential meeting between officials from the Ministry of Health and top Israeli scientists claims that the main reason scientists and Big Pharma never notified Israeli officials about the safety issues from the vaccines is because of budget and staffing issues.\n\n“Apparently, they had millions of dollars to promote the vaccines as safe and effective, but they forgot to budget for the possibility they were wrong,” wrote Kirsch.\n\nIn the conclusion of his article laying out all of the evidence, Kirsch asked: “Are the vaccines ‘safe and effective’ as claimed?’\n\n“To answer this, science requires that we look at all the available data and see whether the data is more consistent with the hypothesis of ‘safe and effective’ or ‘not safe and effective,'” he wrote. “All the data that I and my colleagues have seen end up being placed in the ‘not’ bucket. We are open to being shown we got it wrong on the hundreds of pieces of evidence we have examined, but nobody is willing to discuss the data with us to resolve the issue, not even for one million dollars.”\n\nWatch this short clip of Steve Kirsch explaining how Medicare data shows that the COVID-19 vaccine is killing massive numbers of people.\n\nThis video is from the Free4Eva Media channel on Brighteon.com.\n\nHOLOCAUST OF THE UNBORN: Babies are DYING because their mothers got “vaccinated” for COVID.\n\nCNN scrambling to cover for COVID vaccine-induced deaths across America, now blaming alcohol abuse for 1 out of every 5 deaths in demographic age group of 20 to 49.\n\nNOT the virus: Deaths among teens and 20-somethings soar following COVID “vaccine” release.\n\nStudy finds 84% increase in incidence of cardiac-related DEATH among men under 40 following mRNA vaccination.", "opengraph": {"title": "Steve Kirsch: Data shows COVID-19 vaccine is the MOST DANGEROUS vaccine ever made", "type": "article", "url": "https://www.medicine.news/2022-11-08-kirsch-covid-vaccine-most-dangerous-ever-made.html", "site_name": "Medicine News", "description": "Tech entrepreneur, philanthropist and Wuhan coronavirus (COVID-19) vaccine expert and researcher Steve Kirsch has compiled all publicly available data on the vaccine to prove that it is the most dangerous vaccine in recorded history. In Kirsch’s personal Substack blog, he laid out some of “the most compelling pieces of evidence” he could gather proving the […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/11/Dead-Body-Corpse-Floor.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "covid-19", "vaccine wars", "Big Pharma", "VAERS", "Vaccine deaths", "Steve Kirsch", "deception", "vaccine injury", "vaccines", "spike protein", "vaccine damage", "Vaccine dangers", "covid-19 vaccines", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/video-steve-kirsch-data-showing-covid-vax-most-dangerous-vax-ever-made-ignored-cdc-et-al/5798214", "https://stevekirsch.substack.com/p/the-evidence", "https://www.naturalnews.com/2022-10-28-experts-more-young-people-dying-covid-vaccines.html", "http://vaccineholocaust.org", "https://www.brighteon.tv", "http://vaccines.news", "https://www.brighteon.com/4fc962ad-496e-4af0-8ae2-118d2c436ba0", "https://www.brighteon.com/channels/free4eva", "https://www.brighteon.com/channels/free4eva", "https://www.naturalnews.com/2022-11-07-covid-virus-has-dozens-of-animal-venoms.html", "https://vaccinedeaths.com/2022-11-06-unborn-babies-dying-mothers-fathers-vaccinated-covid.html", "https://vaccinedamage.news/2022-11-06-cnn-scrambling-to-cover-for-covid-vaccine-induced-deaths-blaming-alcohol.html", "https://vaccines.news/2022-11-01-deaths-young-soar-following-covid-vaccine-rollout.html", "https://www.vaccinedeaths.com/2022-10-13-men-cardiac-related-death-after-mrna-vaccination.html", "https://www.globalresearch.ca/video-steve-kirsch-data-showing-covid-vax-most-dangerous-vax-ever-made-ignored-cdc-et-al/5798214", "https://stevekirsch.substack.com/p/the-evidence", "https://www.brighteon.com/4fc962ad-496e-4af0-8ae2-118d2c436ba0", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-11-08-kirsch-covid-vaccine-most-dangerous-ever-made.html&linkname=Steve%20Kirsch%3A%20Data%20shows%20COVID-19%20vaccine%20is%20the%20MOST%20DANGEROUS%20vaccine%20ever%20made", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}