{"result_id": "201031", "URL": "https://www.medicine.news/2022-05-11-natural-substances-neutralize-covid-vaccine-spike-proteins.html", "timestamp": "2023-04-25 16:21:35 CEST+0200", "meta": {"description": "It is estimated that more than 4.5 billion people worldwide have now been “vaccinated” for the Wuhan coronavirus (Covid-19). Many of them now suffer from “long” covid, however, which could be due to the persistent damage caused by the spike proteins contained in (viral vector) and produced by (mRNA) the jabs. Also known as the […]", "lang": "en", "keywords": "alternative medicine,COVID,goodhealth,goodmedicine,herbal medicine,Herbs,ivermectin,NAC,natural cures,natural medicine,remedies,spike proteins,supplements,vaccine", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://www.medicine.news/2022-05-11-natural-substances-neutralize-covid-vaccine-spike-proteins.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "These natural substances NEUTRALIZE covid vaccine spike proteins", "cleaned_text": "It is estimated that more than 4.5 billion people worldwide have now been “vaccinated” for the Wuhan coronavirus (Covid-19). Many of them now suffer from “long” covid, however, which could be due to the persistent damage caused by the spike proteins contained in (viral vector) and produced by (mRNA) the jabs.\n\nAlso known as the S protein, covid jab spike proteins do a whole lot more harm than just bind to the body’s ACE (angiotensin-converting enzyme) receptors, allowing the virus to invade cells. It turns out that covid jab spike proteins interact with many other cellular tissues, including in the lungs, mitochondria and cardiovascular system.\n\nThis assault causes all kinds of health damage to the many intricate and complex systems of the body. And in the case of messenger RNA injections (Pfizer-BioNTech and Moderna), the spike proteins continue to be manufactured inside the body long after the initial jabs.\n\nWe now know for a fact that jab spike proteins:\n• Damage the lung cells (including the pulmonary alveoli and pulmonary endothelial cells)\n• Damage the mitochondria and DNA structures\n• Damage cardiovascular cells\n• Increase the risk of blood clots\n• Damage brain cells\n• Promote inflammation\n• Suppress immunity\n• Increase the risk of cancer\n\nA 2021 paper published in the bioRxiv preprint repository found that spike proteins cause the Type 1 catalytic receptors in the kidneys to increase in kidney cell tissue, making the kidneys more susceptible to the Fauci Flu.\n\nSpike proteins also cause cells in the small intestine to stimulate large amounts of L-SIGN (liver / lymph node-specific intracellular adhesion molecules-3 grabbing non-integrin) receptors, which defend against pathogens. The problem with this is that after a large number of adhesions occur, the small intestine becomes more susceptible to viral infection.\n\nSimilarly, spike proteins trigger an increase in DC-SIGN (Dendritic Cell-Specific Intercellular adhesion molecule-3-Grabbing Non-integrin) receptors in the lungs, which can trigger inflammatory symptoms in the lungs.\n\n“In addition, spike proteins can cause different degrees of oxidation of the organs, leading to more cells’ premature deaths and putting the body in a hyperoxidized state, which may further increase the risk of cancer,” reports The Epoch Times.\n\nAnother study published in the Journal of the American Heart Association (JAHA) found that spike proteins negatively impact lung functionality by causing the pulmonary alveolar cell walls to thicken and solidify. They also inhibit the pulmonary cell mitochondria, which is where energy is produced.\n\nProlonged covid symptoms could actually be the spike proteins damaging mitochondria and blocking their energy production. The result is a cascade of abnormalities and health problems that vary from person to person.\n\nPerhaps the biggest fear is cardiovascular damage, the risk of which is greatly increased by the presence of spike proteins. The risk of blood clots increases massively following exposure to them, hence why many “fully vaccinated” people are developing conditions like myocarditis and pericarditis.\n\nHere’s how to protect yourself against spike protein damage\n\nIf you or someone you know got “vaccinated” for the Wuhan coronavirus (Covid-19) and now regret it, all hope is not lost. The following vitamins and herbs have been scientifically shown to help neutralize spike proteins and the damage they inflict on the body.\n\nThe World Council for Health (WCH) recommends the following immune-boosting compounds, which may help to expel vaccine spike proteins while improving the symptoms they cause:\n\nN-acetyl cysteine (NAC) is a powerful anti-inflammatory that further helps protect the body against spike protein damage.\n\nConsuming a low-histamine diet will also help to prevent the immune system from overreacting and harming the body more, a situation known as a cytokine storm.\n\nCommon medications that can help improve symptoms include:\n\nAspirin helps to thin the blood, reducing the risk of thrombus and the ever-dreaded Fauci Flu shot blood clots that many people are suffering.\n\nAntihistamines, in a similar way to NAC, prevent over-activation of the immune system while the others help to minimize inflammation.\n\nIvermectin, by the way, is a powerful remedy for a variety of health conditions, including cancer. For many, it also rids the body of the Fauci Flu.\n\nIn the plant kingdom, the following substances are spike protein inhibitors:\n\nNeem is another spike protein inhibitor, as is ivermectin.\n\nAs for spike protein neutralizers, the following herbs and substances show incredible promise in remediating the damage caused by the injections:\n\n“Some of these ingredients, such as the shikimic acid contained in pine needles, have antioxidant properties that can reduce oxidized free radicals in the body and provide a detoxifying effect,” reports The Epoch Times.\n\nMore of the latest news about the Wuhan coronavirus (Covid-19) can be found at Pandemic.news.", "opengraph": {"title": "These natural substances NEUTRALIZE covid vaccine spike proteins", "type": "article", "url": "https://www.medicine.news/2022-05-11-natural-substances-neutralize-covid-vaccine-spike-proteins.html", "site_name": "Medicine News", "description": "It is estimated that more than 4.5 billion people worldwide have now been “vaccinated” for the Wuhan coronavirus (Covid-19). Many of them now suffer from “long” covid, however, which could be due to the persistent damage caused by the spike proteins contained in (viral vector) and produced by (mRNA) the jabs. Also known as the […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/05/pine-needle-tea-covid-vaccines-suramin-shikimic-acid.png"}, "tags": ["alternative medicine", "COVID", "spike proteins", "vaccine", "NAC", "natural medicine", "ivermectin", "Herbs", "remedies", "supplements", "natural cures", "herbal medicine"], "tweets": [], "movies": [], "links": ["https://www.brighteon.tv", "https://www.theepochtimes.com/how-to-remove-harmful-spike-protein-from-your-body_4454443.html", "http://pandemic.news", "https://www.theepochtimes.com/how-to-remove-harmful-spike-protein-from-your-body_4454443.html", "https://naturalnews.com/2022-04-15-ivermectin-cancer-cure-nine-studies-conclude.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-05-11-natural-substances-neutralize-covid-vaccine-spike-proteins.html&linkname=These%20natural%20substances%20NEUTRALIZE%20covid%20vaccine%20spike%20proteins", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}