{"result_id": "201039", "URL": "https://medicine.news/2022-11-10-big-pharma-racing-first-approved-rsv-vaccine.html", "timestamp": "2023-04-25 16:21:39 CEST+0200", "meta": {"description": "As more and more public health officials and institutions assert claims of rising numbers of respiratory syncytial virus (RSV) cases, Big Pharma companies Pfizer and GlaxoSmithKline (GSK) are racing to be the first to get an RSV vaccine approved. Dozens of hospitals, health departments and public health officials all over the country have put out […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,children's health,conspiracy,corruption,Dangerous Medicine,deception,GlaxoSmithKline,infant's health,infections,outbreak,pandemic,Pfizer,propaganda,respiratory syncytial virus,rsv,vaccine development,vaccine wars,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://medicine.news/2022-11-10-big-pharma-racing-first-approved-rsv-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "medicine.news", "title": "Big Pharma companies racing to be the first to launch an approved RSV vaccine", "cleaned_text": "Big Pharma companies racing to be the first to launch an approved RSV vaccine\n\nAs more and more public health officials and institutions assert claims of rising numbers of respiratory syncytial virus (RSV) cases, Big Pharma companies Pfizer and GlaxoSmithKline (GSK) are racing to be the first to get an RSV vaccine approved.\n\nDozens of hospitals, health departments and public health officials all over the country have put out easily disprovable statements claiming a rise in RSV cases. (Related: Fauci, mainstream media claim “triple threat” of viruses coming this winter.)\n\nThese claims are supported by the Centers for Disease Control and Prevention (CDC) and prominent health officials like Dr. Anthony Fauci, who have been sounding the alarm for a looming “tripledemic” of RSV, influenza and the Wuhan coronavirus (COVID-19).\n\nIn Southern California, the health department for Orange County declared a local health emergency over an alleged rise in the number of pediatric RSV cases. Dr. Regina Chinsio-Kwong, the county’s health officer, claimed in a press release that the declaration was issued due to “rapidly spreading virus infections causing record numbers of pediatric hospitalizations and daily emergency room visits.”\n\nBut Rita Barnett-Rose, a California-based attorney, noted that there is no evidence to support any official claims coming out of Orange County, especially from hospitals claiming they are overextended.\n\nBarnett-Rose said hospitals in the county are overextended not due to a high number of admissions, but due to low staffing caused by the firing of unvaccinated employees.\n\nThis claim is supported by local reporters and healthcare workers who pointed out that there were not enough pediatricians and other kinds of medical professionals in the county, leading to county health officials looking oversees for more health workers.\n\nPerhaps of bigger concern is the current Big Pharma race between GSK and Pfizer to get their in-development RSV vaccines approved. Either company could see the first-ever approvals for an RSV vaccine by mid-to-late 2023.\n\nGSK already has a priority review and a May 3 approval action date for its RSV vaccine, which is targeted toward older adults. Pfizer isn’t far behind with its RSV vaccine that targets pregnant women with an eye toward protecting their children as soon as they are born.\n\nCompetition between the two Big Pharma companies is increasing, as can be seen from statements made by their top executives during their third-quarter earnings calls.\n\nGSK CEO Emma Walmsley said the company “intends to be competitive” with its late-stage RSV vaccine, which it has “very high confidence” in. The company feels that it can easily out-compete Pfizer in this new market.\n\nPfizer Chief Scientific Officer Dr. Mikael Dolsten noted that the efficacy of both vaccines look somewhat similar, but “if you look at our tolerability, [it] was among the best vaccines you ever can see.”\n\nGSK was hoping to market its vaccine for both infants and people aged 60 and older, but safety concerns during vaccine trials forced it to scrap these plans and opt instead for the vaccine to just be targeted toward adults.\n\nMeanwhile, Pfizer is hoping to go to the Food and Drug Administration (FDA) to get approval for its maternal-use RSV vaccine to be extended to all adults by year’s end. The company claims that phase 3 trials in infants showed very positive results, strongly suggesting that the vaccine could also be given to children under five.\n\nOther prominent Big Pharma players are also looking at getting into the RSV vaccine market but are further back in their respective vaccine development cycles.\n\nModerna has an mRNA candidate that has just entered phase 3 testing. AstraZeneca and Sanofi are working together to develop a long-acting antibody designed to supposedly protect all infants against RSV from birth through their first RSV season with a single dose. AstraZeneca and Sanofi are expected to file an application to the FDA by the end of the year.\n\nWatch this clip from “The HighWire” with Del Bigtree and co-host Jefferey Jaxen as they discuss how the RSV being seen outside its normal seasonal window is leaving more questions than answers.\n\nThis video is from the High Hopes channel on Brighteon.com.\n\nFirst RSV emergency declared as Pfizer and GSK race to get vaccines approved.\n\nOperation Warp Speed unleashed a new era of science fraud – untested mRNA jabs now fast-tracked for RSV, flu, heart disease and endless COVID variants.\n\nTHE NEXT VAX: Big Pharma pushing to release ANOTHER mRNA “vaccine,” this one for RSV (respiratory syncytial virus).\n\nJABBED UNTIL DEATH: Endless mRNA jabs are now planned for multiple vaccine types, including influenza, HIV, RSV, Pneumococcal, Zika and many more.", "opengraph": {"title": "Big Pharma companies racing to be the first to launch an approved RSV vaccine", "type": "article", "url": "https://www.medicine.news/2022-11-10-big-pharma-racing-first-approved-rsv-vaccine.html", "site_name": "Medicine News", "description": "As more and more public health officials and institutions assert claims of rising numbers of respiratory syncytial virus (RSV) cases, Big Pharma companies Pfizer and GlaxoSmithKline (GSK) are racing to be the first to get an RSV vaccine approved. Dozens of hospitals, health departments and public health officials all over the country have put out […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/11/Vaccine-Child-Injection-Kid-Needle-Pediatric-Adult.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "vaccine wars", "Big Pharma", "respiratory syncytial virus", "rsv", "outbreak", "GlaxoSmithKline", "deception", "infant's health", "infections", "vaccines", "Pfizer", "vaccine development", "children's health", "corruption", "propaganda"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/rsv-emergency-vaccine-race-pfizer-gsk/", "https://www.fiercepharma.com/marketing/pfizer-gsk-prep-battle-they-look-create-worlds-first-ever-rsv-vaccine-market", "https://naturalnews.com/2022-10-25-fauci-media-claim-triple-threat-viruses-winter.html", "http://outbreak.news", "https://www.brighteon.tv", "http://bigpharmanews.com", "https://www.brighteon.com/b8ee8c94-ed9f-429a-8ae3-6d60450720b6", "https://www.brighteon.com/channels/jrd2015", "https://www.brighteon.com/channels/jrd2015", "https://naturalnews.com/2022-11-09-first-rsv-emergency-declared-pfizer-gsk-race-vaccines.html", "https://vaccines.news/2022-11-07-untested-mrna-jabs-now-fast-tracked.html", "https://vaccines.news/2022-09-02-pharma-mrna-vaccine-rsv-respiratory-syncytial-virus.html", "https://outbreak.news/2022-08-19-endless-mrna-jabs-planned-for-multiple-diseases.html", "https://childrenshealthdefense.org/defender/rsv-emergency-vaccine-race-pfizer-gsk/", "https://www.fiercepharma.com/marketing/pfizer-gsk-prep-battle-they-look-create-worlds-first-ever-rsv-vaccine-market", "https://www.brighteon.com/b8ee8c94-ed9f-429a-8ae3-6d60450720b6", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-11-10-big-pharma-racing-first-approved-rsv-vaccine.html&linkname=Big%20Pharma%20companies%20racing%20to%20be%20the%20first%20to%20launch%20an%20approved%20RSV%20vaccine", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}