{"result_id": "201012", "URL": "https://medicine.news/2022-08-25-vaccinated-blood-is-tainted-blood-study-finds.html", "timestamp": "2023-04-25 16:21:23 CEST+0200", "meta": {"description": "New research out of Italy proposes that everyone who has been “fully vaccinated” for the Wuhan coronavirus (Covid-19) now has tainted blood marked by mystery particles of various sizes and shapes. Published in the International Journal of Vaccine Theory, Practice, and Research (IJVTPR), the study, which began in March 2021, looked at blood samples from […]", "lang": "en", "keywords": "badhealth,badmedicine,blood,Censored Science,chemical violence,clot,conspiracy,COVID,Dangerous Medicine,deception,depopulation,discoveries,foreign particles,genocide,medical violence,pandemic,Plandemic,research,tainted,vaccine damage,Vaccine deaths,vaccine injury,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "https://medicine.news/2022-08-25-vaccinated-blood-is-tainted-blood-study-finds.html", "encoding": "UTF-8"}, "image": null, "domain": "medicine.news", "title": "Vaccinated blood is tainted blood, study finds", "cleaned_text": "New research out of Italy proposes that everyone who has been “fully vaccinated” for the Wuhan coronavirus (Covid-19) now has tainted blood marked by mystery particles of various sizes and shapes.\n\nPublished in the International Journal of Vaccine Theory, Practice, and Research (IJVTPR), the study, which began in March 2021, looked at blood samples from 1,006 patients who got jabbed, and who subsequently developed various disorders.\n\nAll of the patients received the mRNA (messenger RNA) injection from Pfizer and BioNTech, which supposedly contain the least amount of actual spike protein from SARS-CoV-2 – though we know these mRNA shots cause the body to manufacture its own spike protein. (Related: Remember when Pfizer tried to rebrand its shot to make it more attractive to potential recipients?)\n\nPfizer’s covid shots contain an array of foreign components that the Italian researchers described as “metallic objects.” One of them is believed to be graphene, a conductive metal used in radio frequency electronics.\n\nOf the 1,006 cases analyzed, a mere 58 of them, or 5.77 percent, showed normal hematology upon microscopic analysis – meaning the blood was healthy. The other 94.23 percent of samples were discovered to be loaded with foreign objects “of unclear origin.”\n\n“Aggregation of erythrocytes were highlighted and exogenous point-like and self-luminescent particles in the dark-field were detected,” the paper explains. “The luminescence of those particles was markedly higher than that of oxygenated red blood cell walls.”\n\n“The 948 cases, showed tubular / fibrous formations and frequently also crystalline and lamellar formations with extremely complex but consistently similar morphologies across all of the patients with abnormal blood samples.”\n\nEveryone who got shot with Pfizer now has foreign, “transitioned” blood\n\nThe work replicates that of a team of Korean doctors that earlier analyzed a much larger sampling of jabbed blood and made similar discoveries. In short, these are anything but traditional “vaccines,” and are arguably not vaccines at all.\n\n“What seems plain enough is that metallic particles resembling graphene oxide and possibly other metallic compounds, like those discovered by Gatti and Montanari (Montanari & Gatti, 2016; Gatti & Montanari, 2012, 2017, 2018), have been included in the cocktail of whatever the manufacturers have seen fit to put in the so-called mRNA ‘vaccines,'” the paper continues.\n\n“In our experience as clinicians, these mRNA injections are very unlike traditional ‘vaccines’ and their manufacturers need, in our opinions, to come clean about what is in the injections and why it is there.”\n\nInterestingly, the study uses the word “transition” to describe the state of a person’s blood before and after the injections. Before the transition, the blood looked and had “perfect normalcy … with accompanying haemolysis,” while after the transition there was “visible packing and stacking of red blood cells in conjunction with the formation of gigantic conglomerate foreign structures, some of them appearing as graphene-family super-structures.”\n\nCalling this change “unprecedented,” the researchers conclude that transitioned blood, meaning vaccinated blood, “is incompatible with normal blood flow, especially at the level of the capillaries.”\n\n“There seems to be nothing good about these jabs,” wrote a commenter about the study’s findings. “Stay well naturally.”\n\n“First they pushed the jabs, now they are REALLY pushing the bugs,” wrote another, skeptical about the new pro-cricket-eating campaign. “What’s the chemical composition of a cricket? Can eating bugs ‘feed’ the clots?”\n\n“COVID-5G all along – I told you!” remarked another about how the jabbed are now walking frequency transmission “towers.”\n\n“The metal components are probably self-assembling into some sort of Bluetooth transmitter and receiver,” added another, speculating as to the nature of this transition that the fully vaxxed are going through.\n\nMore news coverage about the devastating impact of covid injections on human blood can be found at VaccineInjuryNews.com.", "opengraph": {"title": "Vaccinated blood is tainted blood, study finds", "type": "article", "url": "https://www.medicine.news/2022-08-25-vaccinated-blood-is-tainted-blood-study-finds.html", "site_name": "Medicine News", "description": "New research out of Italy proposes that everyone who has been “fully vaccinated” for the Wuhan coronavirus (Covid-19) now has tainted blood marked by mystery particles of various sizes and shapes. Published in the International Journal of Vaccine Theory, Practice, and Research (IJVTPR), the study, which began in March 2021, looked at blood samples from […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2022/08/The-dark-field-blood-examinations-3.jpg"}, "tags": ["blood", "conspiracy", "pandemic", "foreign particles", "Plandemic", "COVID", "tainted", "deception", "medical violence", "Censored Science", "chemical violence", "clot", "depopulation", "Vaccine deaths", "research", "vaccine injury", "genocide", "vaccines", "discoveries", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/08/24/study-reveals-vaccinated-have-blood-abonormalities/", "https://naturalnews.com/2021-07-07-moderna-rebrands-mrna-spikevax-spike-protein-factories.html", "https://naturalnews.com/2022-08-21-graphene-radio-frequency-electronics-biological.html", "https://www.brighteon.tv", "http://VaccineInjuryNews.com", "https://expose-news.com/2022/08/24/study-reveals-vaccinated-have-blood-abonormalities/", "https://naturalnews.com/2021-07-07-moderna-rebrands-mrna-spikevax-spike-protein-factories.html", "https://naturalnews.com/2022-08-21-graphene-radio-frequency-electronics-biological.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2022-08-25-vaccinated-blood-is-tainted-blood-study-finds.html&linkname=Vaccinated%20blood%20is%20tainted%20blood%2C%20study%20finds", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}