{"result_id": "201013", "URL": "http://www.medicine.news/2023-04-06-damaged-patients-suing-astrazeneca-covid-jab-injuries.html", "timestamp": "2023-04-25 16:21:24 CEST+0200", "meta": {"description": "It has been known for quite some time now that the viral vector-based Wuhan coronavirus (Covid-19) “vaccine” from drug giant AstraZeneca, known as Vaxzevria, causes a “rare” blood-clotting condition as well as abnormally low platelet levels. And now, those who took the shots are suing the company for harming them. Dozens of patients and their […]", "lang": "en", "keywords": "AstraZeneca,badhealth,badmedicine,Big Pharma,COVID,Dangerous Medicine,freedom,injuries,lawsuit,Liberty,medical violence,outrage,pharmaceutical fraud,vaccine,vaccine damage,vaccine death,vaccine injury,vaccine wars,vaccines,Vaxzevria", "favicon": "wp-content/themes/ScienceTheme/images/Medicine-fav.png", "canonical": "http://www.medicine.news/2023-04-06-damaged-patients-suing-astrazeneca-covid-jab-injuries.html", "encoding": "UTF-8"}, "image": null, "domain": "www.medicine.news", "title": "Damaged patients are suing AstraZeneca over covid jab injuries", "cleaned_text": "It has been known for quite some time now that the viral vector-based Wuhan coronavirus (Covid-19) “vaccine” from drug giant AstraZeneca, known as Vaxzevria, causes a “rare” blood-clotting condition as well as abnormally low platelet levels. And now, those who took the shots are suing the company for harming them.\n\nDozens of patients and their families have filed lawsuits against AstraZeneca, their lawyers having recently sent the company pre-action protocol letters. Around 75 claimants – so far – have either personally suffered catastrophic blood clot injuries, or they lost relatives to the deadly drug injection.\n\nIn 2021, the Medicines and Healthcare products Regulatory Agency (MHRA) confirmed that Vaxzevria does, in fact, trigger the deadly health condition, known formally as thrombotic thrombocytopenia. And those who got the shots and suffered this outcome are seeking restitution.\n\nWere you injured by a covid “vaccine?” You might want to contact a lawyer\n\nThe claimants are taking a dual-pronged approach to obtain compensation from AstraZeneca for their injuries. One prong includes taking legal action under the Consumer Protection Act of 1987, while the other involves claiming payment under the government-run Vaccine Damage Payment Scheme (VDPS).\n\nAll of this is in Europe, by the way, where the AstraZeneca jab was initially licensed and used. AstraZeneca’s covid shot was never licensed for use in the United States, which only offered the messenger RNA (mRNA) shots from Pfizer, BioNTech, and Moderna, as well as a viral vector-based vaccines from Janssen (Johnson & Johnson).\n\nAccording to Great Game India, the AstraZeneca lawsuits seeking payment from VDPS are limited to £120,000 (about $150,000) per claim, and they must show proof that they suffered a severe disability.\n\nSuch claims do not preclude any separate claims filed for personal injuries through the court, which are completely separate. Plaintiffs in these legal cases are reportedly pursuing both avenues as recompense for their injuries.\n\n“Those taking action under the Consumer Protection Act must show that the vaccine was not as safe as the public were entitled to expect,” Great Game India reported.\n\nAccording to Peter Todd, a consultant solicitor with Scott-Moncrieff & Associates and one of the two lawyers handling the claims, the technology that AstraZeneca used in its covid injection was “risky” from the start.\n\nTodd told The British Medical Journal (The BMJ) that complications from this risky technology include things like stroke, heart failure, and even leg amputations due to injection-induced blood clots.\n\nContradicting statements he previously made, Germany’s health minister also admitted in a recent interview with the German state media outlet ZDF that covid jabs can, in fact, cause “permanent disabilities” like the kinds plaintiffs are reporting in their cases.\n\nWhile all of this is taking place in Europe where the AstraZeneca jab was licensed for use, it does not mean that the same protocol cannot also be used here in the United States to pursue justice against Pfizer, BioNTech, Moderna, and Janssen.\n\nIf you or someone you know was injured or killed by covid jabs from these four companies, perhaps it would be in your best interest to contact a lawyer to see if you, too, can pursue justice for harm caused by these companies’ deadly covid drugs.\n\n“The pharmaceutical companies can be sued if it is proven that in the disseminating these ‘vaccines’ that they intended to harm people,” one commenter wrote about the matter.\n\n“They are NOT exempt in this case. What has been proven through the release of papers by the CDC itself, is that these companies knew how dangerous these toxic injections were and went ahead and released them to the public anyway. The pharmaceutical companies that manufactured these vaccines are done!”\n\nAs the injury and death tolls from Fauci Flu shots increase, we will keep you informed about the latest at ChemicalViolence.com.", "opengraph": {"title": "Damaged patients are suing AstraZeneca over covid jab injuries", "type": "article", "url": "https://www.medicine.news/2023-04-06-damaged-patients-suing-astrazeneca-covid-jab-injuries.html", "site_name": "Medicine News", "description": "It has been known for quite some time now that the viral vector-based Wuhan coronavirus (Covid-19) “vaccine” from drug giant AstraZeneca, known as Vaxzevria, causes a “rare” blood-clotting condition as well as abnormally low platelet levels. And now, those who took the shots are suing the company for harming them. Dozens of patients and their […]", "image": "https://www.medicine.news/wp-content/uploads/sites/25/2023/04/Coronavirus-Covid-19-AstraZeneca-Vacccine-Syringe-Vial.jpg"}, "tags": ["vaccine wars", "lawsuit", "Liberty", "Big Pharma", "AstraZeneca", "COVID", "vaccine", "medical violence", "vaccine death", "vaccine injury", "injuries", "vaccines", "outrage", "Vaxzevria", "vaccine damage", "freedom", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://greatgameindia.com/patients-launch-legal-action-against-astrazeneca-over-its-covid-19-vaccine/", "https://naturalnews.com/2021-03-16-italy-poised-prosecute-astrazeneca-deadly-coronavirus-vaccines.html", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://greatgameindia.com/patients-launch-legal-action-against-astrazeneca-over-its-covid-19-vaccine/", "https://naturalnews.com/2021-03-16-italy-poised-prosecute-astrazeneca-deadly-coronavirus-vaccines.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fmedicine%2F2023-04-06-damaged-patients-suing-astrazeneca-covid-jab-injuries.html&linkname=Damaged%20patients%20are%20suing%20AstraZeneca%20over%20covid%20jab%20injuries", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}