{"result_id": "203002", "URL": "https://www.mindbodygreen.com/articles/how-immunologist-uses-fungi-to-fight-cold-and-flu", "timestamp": "2023-04-25 16:22:08 CEST+0200", "meta": {"description": "Some mushrooms can help prevent and treat the common cold and flu virus. Here are 4 an immunologist recommends to boost your immune system naturally.", "lang": "en", "keywords": "functional nutrition,immunity", "favicon": "/favicon-32x32.png?v=dcf4783cc7d913f902ccda11fc00dea5", "canonical": "https://www.mindbodygreen.com/articles/how-immunologist-uses-fungi-to-fight-cold-and-flu", "encoding": "utf-8"}, "image": null, "domain": "www.mindbodygreen.com", "title": "4 Mushrooms An Immunologist Uses To Fight The Cold & Flu | mindbodygreen", "cleaned_text": "This delicious edible mushroom is one of my favorites not only because it's so tasty, but because it has some broad-ranging health properties. In a Japanese study, maitake mushroom extract was found to significantly inhibit the influenza A virus from replicating, and it stimulated the production of antiviral cytokines such as TNF-alpha. Interestingly, it was made even more powerful2 when combined with shiitake mushroom extract. Both shiitake and maitake are edible mushrooms that can easily be added to our diet, but they can also be found in tincture and dried capsule form.\n\nShiitake mushrooms are an Asian culinary staple and easy to find in supermarkets. Whole shiitake, as well as its purified fractions, have been shown to have antiviral activities3 against the hepatitis C virus, herpes simplex virus, and human immunodeficiency virus as well as influenza. When specifically studied on influenza, shiitake was found to inhibit the growth of the virus3 by preventing the entry and uncoating process of viral infection. Researchers also tested an intranasal vaccine3 of shiitake extract, which increased the survival of flu-infected mice. The best way to get the benefits of shiitake is to eat them, but they can also be found in medicinal mushroom blends in tinctures and dried products.\n\nAnother antiviral powerhouse fungus is the woody, and therefore inedible, reishi mushroom. Reishi has been recognized as a medicinal mushroom for thousands of years. Reishi has the ability to combat many viruses, such as herpes, Epstein-Barr, and hepatitis. It has also been found to be effective in killing influenza A virus4 , which causes many outbreaks of flu throughout the season, including the very virulent and dangerous H1N1 strain5 of flu. Substances called triterpenes are one of the main beneficial compounds in reishi alongside the beta-glucans. Triterpenes are very bitter-tasting, making reishi rather inedible. But just because you can't throw it in your stir-fry doesn't mean that you should avoid it. You can typically find reishi in capsule, powder, and tincture form.\n\nAlthough cordyceps mushrooms are technically not a mushroom but a parasitic fungus6 , they have been touted as a \"cure-all\" in many ancient cultures. Cordyceps are known for being antifungal and antibacterial, as well as improving fatigue and libido. Originally cordyceps were only grown in the high altitude Himalayan mountains as a fungus that invaded certain caterpillars. However, they are now cultivated in the United States using different techniques. The anti-influenza effect of cordyceps6 extract is thought to be driven by increased natural killer cell activity along with other virus-killing cytokines. In addition, cordyceps have been shown to improve lung health7 by decreasing inflammation in both chronic asthma and other lung diseases. It has been shown to improve exercise tolerance8 in athletes when used both acutely and chronically. This may be because they increase blood flow, enhancing oxygen use and acting as an antioxidant. So they are great to use both when sick or just when working out. Because cordyceps is not grown for culinary purposes, you will find them in pills, tinctures, and powders.\n\nOne caveat of medicinal mushrooms, as with all supplements, is that quality and efficacy can vary across products. When evaluating a mushroom product, make sure that it is organically grown and verified. In addition, if it's a tincture, tea, powder, or capsule, ask if the company does any third-party testing for purity, and make sure that they do not use any fillers. This will allow for the best quality, safety, and efficacy.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://shop.mindbodygreen.com/products/probiotic?itc_content=39781", "https://shop.mindbodygreen.com/products/probiotic?itc_content=39781", "https://shop.mindbodygreen.com/products/probiotic?itc_content=39781", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6176074/", "#citations", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6176074/", "#citations", "https://www.worldscientific.com/doi/abs/10.1142/s0192415x08006508", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4202470/", "#citations", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5992414/", "#citations", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5992414/", "#citations", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5992414/", "#citations", "https://www.mindbodygreen.com/articles/reishi-mushrooms-6-awesome-health-benefits", "https://www.ncbi.nlm.nih.gov/pubmed/10624872", "#citations", "https://www.nature.com/articles/srep13194", "#citations", "https://www.ingentaconnect.com/content/ben/mrmc/2004/00000004/00000008/art00008", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3121254/", "#citations", "https://www.mushroom-revival.com/cordyceps-militaris-production/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3121254/", "#citations", "https://www.hindawi.com/journals/ecam/2016/6134593/", "#citations", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5236007/", "#citations", "https://www.mindbodygreen.com/coaching"], "authors": ["https://www.facebook.com/modaycenter215/"], "publish_date": null}