{"result_id": "203005", "URL": "https://www.mindbodygreen.com/articles/excerpt-from-eat-to-beat-disease-the-best-foods-for-your-immune-system", "timestamp": "2023-04-25 16:22:10 CEST+0200", "meta": {"description": "An excerpt from \"Eat to Beat Disease,\" by Dr. William W. Li, including the best foods for boosting immune health.", "lang": "en", "keywords": "immunity,Herbs", "favicon": "/favicon-32x32.png?v=dcf4783cc7d913f902ccda11fc00dea5", "canonical": "https://www.mindbodygreen.com/articles/excerpt-from-eat-to-beat-disease-the-best-foods-for-your-immune-system", "encoding": "utf-8"}, "image": null, "domain": "www.mindbodygreen.com", "title": "Eat to Beat Disease: A Food List For Immunity | mindbodygreen", "cleaned_text": "The white button mushroom, one of the most common of all edible mushrooms, is eaten raw in salads or cooked with a wide variety of ingredients across world cuisines. White button mushrooms are a good source of bioactives, including beta-glucan, an immune-stimulating dietary fiber. Researchers at the University of Western Sydney in Australia studied 20 healthy volunteers who were assigned to eat either a normal diet or a normal diet plus white button mushrooms. The mushroom-eating participants ate 100 grams of blanched mushrooms per day, roughly equivalent to 1.3 cups of mushrooms for one week. As a test of whether the mushrooms affected immune function, the researchers measured the levels of two antibodies (IgA and IgG) in the subjects' saliva. More antibodies are produced in the saliva after immune activation. The researchers found a steady increase in IgA levels in the participants, with a 55 percent increase after one week of mushroom consumption and a continued rise to 58 percent above baseline levels up to two weeks after finishing the mushrooms. Eating the mushrooms activated the gut, which stimulated the immune system to produce the antibodies. The antibodies then circulated to the mucus membranes, where they were secreted in saliva. A number of other studies in the lab using extracts from other culinary mushrooms like shiitake, maitake, enoki, chanterelle, and oyster mushrooms showed that they, too, can activate immune defenses. In addition to their culinary value, some of the most popular edible mushrooms have immune-boosting benefits.\n\nGarlic is renowned as both an ingredient and a health remedy. Ancient Greeks used garlic to strengthen athletes and soldiers and as a component of healing tonics. Fresh garlic has a strong, pungent smell valued for cooking, but when it is aged, garlic becomes almost odorless. Aged garlic is found as a dietary supplement and retains potent bioactives, such as apigenin, that can influence the immune system. Researchers at the University of Florida in Gainesville studied the effect of aged garlic on the immune systems of 120 healthy men and women in their mid-20s and early 30s during the cold and flu season. Two groups received either an aged garlic extract or a placebo for 90 days and had their blood drawn for analysis of immune response. The subjects were instructed to keep a daily illness diary to log any symptoms of being sick, such as runny nose, head congestion, sore throat, cough, fever, or body aches, and to record if they became ill enough to miss school or work. At the end of the study, the group who consumed aged garlic extract had significantly more immune T-cells and natural killer (NK) cells circulating in their bloodstream than the group taking the placebo. Remarkably, the T-cells resulting from the aged garlic were supercharged and could replicate themselves eight times faster than in people taking the placebo. The NK cells, too, were enhanced by garlic. They were 30 percent more activated than similar cells in people on the placebo. The illness diaries showed that people taking the garlic extract reported 20 percent fewer cold and flu symptoms, 60 percent fewer incidents of feeling sick enough to cancel regular activities, and 58 percent fewer missed days of work. This study showed a nice correlation between aged garlic, enhanced immune cell activity, and less illness. Another study by researchers at the Kyoto Prefecture University of Medicine in Japan recruited patients who had inoperable cancer. When they were given aged garlic for six months, the activity of their circulating NK cells increased. This opens the door to research on whether aged garlic could help augment the cancer-fighting immune responses in patients receiving immunotherapy.\n\nDelicious for salads, broccoli sprouts are three- to four-day-old plant tendrils that have a mild, nutty taste. Remember that broccoli contains sulforaphanes, which are potent bioactives. Sulforaphanes activate the immune system, and, remarkably, broccoli sprouts contain up to 100 times more sulforaphane than regular full-grown broccoli. You can really taste the broccoli flavor when you chew them thoroughly. The chewing is important because it ruptures the plant cell walls to release an enzyme called myrosinase. This enzyme is important because it converts the sulforaphane, which is naturally inactive in the plant, to its active form in your mouth. Activated sulforaphane can affect the cells in your body. Researchers at the University of North Carolina at Chapel Hill, Stanford University, and the University Children's Hospital Basel in Switzerland studied the impact of eating broccoli sprouts on the immune system by conducting a clinical trial involving the flu vaccine. They wanted to know if the sprouts could help the body boost its response after vaccination. The scientists enrolled 29 healthy volunteers in their late 20s and gave them either 2 cups of broccoli sprouts blended into a shake or a placebo shake to drink each day for four days. The volunteers received a nasal spray flu vaccine on the second day after starting to drink the shake. The vaccine delivered a live but weakened flu virus into the mucus membrane in the nose. The results showed that volunteers who drank the broccoli sprout shake had 22 times more NK T-cells in their blood compared to those who drank the placebo shake. Their NK cells also had more killing power. The proof in the pudding was that broccoli sprout shake drinkers also had less flu virus remaining in the cells of their nose, showing that their body cleared the invaders more effectively. Eating broccoli sprouts can boost your immune defenses against the flu virus.\n\nExtra-virgin olive oil is a critical component of the Mediterranean diet, and the bioactives it contains, such as hydroxytyrosol, oleocanthal, and oleic acid, can enhance your immune system. Researchers at Tufts University, the University of Massachusetts, and the Institute for Food Science and Technology and Nutrition in Spain designed a clinical study to see if replacing the oil (butter and corn oil) found in the typical American diet with extra-virgin olive oil would improve a person's immune response. The researchers selected 41 overweight or obese volunteers from the Boston area, all over the age of 65. The subjects ate a typical American diet: high in saturated fat and refined and processed grains, and low in dietary fiber. The researchers gave all the subjects a bottle of oil and spread. One group received extra-virgin olive oil from Spain in liquid and spreadable form. The other group received a mix of corn and soybean oil and a butter spread. For three months, the participants continued to eat a typical American diet but used only their assigned oil and spread. Both groups consumed on average about 3 tablespoons of oil per day. Blood analysis showed that the immune T-cells in the olive oil group increased their ability to become activated and expand in number by 53 percent. The same immune cells in the group eating corn-soy oil and butter had no change. Olive oil also helps reduce the body's reaction to allergens. The bioactive hydroxytyrosol found in extra-virgin olive oil helps immune cells make interleukin-10, which calms inflammation. These combined effects show that substituting extra-virgin olive oil for other cooking oils used in a typical American diet can have both immune-boosting and anti-inflammatory health benefits. Importantly, not all olive oils contain the same amount of hydroxy-tyrosol. A study from the Instituto de la Grasa in Spain compared the polyphenols found in four types of Spanish extra-virgin olive oils made from olive monovarietals (Arbequina, Hojiblanca, Manzanilla, Picual). The highest levels of hydroxytyrosol were present in the oil made from Picual olives.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.mindbodygreen.com/articles/why-i-take-medicinal-mushrooms-for-immune-support-during-the-winter", "https://www.mindbodygreen.com/articles/garlics-healing-properties"], "authors": ["https://www.mindbodygreen.com/wc/william-w-li-m-d"], "publish_date": null}