{"result_id": "204020", "URL": "https://modernalternativemama.com/2018/03/27/should-i-vaccinate-9-myths-about-vaccination/", "timestamp": "2023-04-25 16:22:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2018/03/27/should-i-vaccinate-9-myths-about-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "Should I Vaccinate? 9 Myths About Vaccination", "cleaned_text": "Honestly, I made my decision more than 10 years ago. I’ve kept up on the current research because I feel passionately about the issue, but I’ve never wavered. None of my 6 children have been vaccinated…and they never will be. (They’re also healthy; the worst we’ve dealt with has been the chicken pox, and that wasn’t that bad.)\n\nAnyway, parents today continue to debate it. Should I vaccinate? Should I get just some vaccines? If so, which ones and when?\n\nUnfortunately, there’s a lot more pressure and propaganda today, that makes it much harder to decide — or even seek out the truth. (Did you know when I was pregnant in 2007, flu shots weren’t universally recommended for pregnant women, and Tdap shots simply weren’t given? My very, very mainstream OB brought these up exactly zero times, and when I asked about a flu shot, said “Well, I always recommend flu shots, but really it’s up to you.” And she did not that take attitude on very many things….)\n\nSo how are you supposed to separate fact from fiction? What’s the real science say? Let’s take a look at some “facts” that are commonly passed around, and how true they are (or not).\n\nIt’s not my goal to come across as 100% “anti-vaccine,” although for my own family, I am. Frankly, I’m tired of the manipulation and fearmongering. My goal here is to stick to the facts and provide a balanced point of view. All my sources will be cited, so don’t feel like you need to take my word for it — do click through and read them for yourself.\n\nI’ll be addressing things the mainstream often brings up, point by point, so that you have an easy way of evaluating what’s true and what isn’t…and why. This will make it easier to combat the fear, and make a fact-based decision.\n\nIf, at the end, you still have questions, you can check my Vaccine Posts page to see if the answers are there, or just leave me a comment and ask.\n\nIt’s worth noting I’m not a doctor or medical professional and I’m not telling you what to do. I’m just a concerned parent, doing my research — as everyone should.\n\nSo! Here we go.\n\n#1: These diseases are super deadly; get vaccinated or die!\n\nThis is kind of a horrible lie, because it leaves parents guessing what “deadly” really means. Are the diseases “deadly” in the sense that they can kill you? Yes, they are. Are they deadly in the sense that they’re likely to kill you? No, they’re not.\n\nPrior to the vaccine, measles killed roughly 1 in every 1000 reported cases, and about 1 in 8000 total cases. (Around 500,000 people actually came in to the doctor with measles annually, but since almost everyone got measles then, about 4 million actually had it each year.) (source)\n\nAs for pertussis (whooping cough), in 2016, there were approximately 18,000 cases. There were 7 deaths, for a rate of about 1 in 3000 cases. 6 of those deaths were in babies under a year. Of the 16,000 cases in people over a year old, there was only one death. The report does not say, but typically, the immunocompromised are more likely to die. Healthy children over a year almost never die of pertussis. (source)\n\nWhat about mumps? The CDC calls death from mumps “exceedingly rare.” (source) Up to 10% of adolescent or adult men will get orchitis (swelling of the testes), but sterility is extremely rare. Fewer than 1% of women will experience swelling of breasts or ovaries. Other serious complications also occur at less than 1%. No deaths have occurred from mumps in many years. Mumps is generally so mild that it isn’t even a reportable illness.\n\nHow about chicken pox? Well, from this study, “…varicella was considered a benign disease…” and “Although serious clinical consequences from primary VZV infection were relatively uncommon, the societal cost, such as days of lost work, attributable to varicella were estimated to be over $1.5 billion annually, providing much of the rationale for universal varicella vaccination.” In other words, complications and deaths from chicken pox were quite rare, but the ‘lost productivity’ led them to create the vaccine anyway. The death rate was about 1 in 40,000 pre-vaccine, and most of those were adults or children who are immunocompromised.\n\nThen there’s flu. First, please read the CDC’s definition of “flu deaths” and how they calculate the numbers. Note that they include any death where flu may have play any role, and not where flu was the primary cause. This means if someone is already extremely sick, and then they get the flu and die, it would be labeled a “flu death.” Also, note how inaccurate their numbers really are. All of this confounds our understanding of how “deadly” the flu really is.\n\nLots of people are concerned about polio…so what’s the deal there? According to the CDC, when polio is symptomatic, it kills 1 in 1000…on the high side. On the low side, it’s 1 in 50,000. However, it’s assumed that many are asymptomatic. (source)\n\nIt’s important to note that these numbers are from the pre-vaccine era, so it’s not that we’re seeing vaccines as a “victim of their own success.” These are the real death rates we’d see if we stopped vaccinating — although possibly less since medical science has advanced since the early to mid 1900s.\n\nIn other words…none of these diseases are really all that deadly.\n\nThis is rather silly…. Children are only contagious if they have run across a disease. They are not born carrying all the diseases.\n\nMost people are concerned because some diseases are contagious even if you are not symptomatic (or not yet), and they are worried that an unvaccinated child could be sick or getting sick.\n\nUnfortunately, sharing illnesses in this manner is a fact of life, and can happen to anyone, vaccinated or not. See point #4 that explains that “antivaxxers aren’t bringing the diseases back,” and point #1 for why these disease aren’t that serious anyway.\n\nPlease also note: contrary to popular belief, measles is not contagious until a person displays symptoms. From the CDC: “Measles virus is shed from the nasopharynx beginning with the prodrome until 3–4 days after rash onset.” ‘Prodrome’ means when symptoms like fever, cough, and weakness begin, but before the rash starts. If you have flu-like symptoms, stay home, and you will not spread anything!\n\n#3: Herd immunity! We must protect the young, the old, and the weak\n\nIt sounds great! We should protect those who cannot protect themselves! And, I agree…we should protect them, by staying home when we’re sick. That would go a long way.\n\nBut this idea of herd immunity — that vaccines don’t work unless everyone’s getting them. It’s just not true. Look at the point below, which explains that vaccination rates haven’t changed substantially in the last 25 years, yet diseases have increased. Herd immunity had nothing to do with why people were “protected.”\n\nIt’s also worth noting that when it comes to herd immunity, the theory is that the entire population has to be covered at high rates. In 2014, most adults had coverage rates of 9 – 45%. (source) The adult population doesn’t and never has had “herd immunity” level coverage.\n\nEssentially, it’s a nice theory, but there’s no evidence that we’ve ever had anything approaching “herd immunity” coverage rates in the general population, or that fluctuating vaccination rates have anything to do with disease rates.\n\n#4: Antivaxxers are the reason these diseases are coming back\n\nNot really. If you take a look at this graph, pertussis cases have been on the rise since 1990, when they switched to using an acellular vaccine instead of whole-cell pertussis. It just isn’t as effective — but the whole-cell version was causing too many negative reactions. Besides, according to this study, vaccine refusal has nothing to do with pertussis cases.\n\nIn 2000, 94% of 2-year-olds had 3 DTaP shots. (source) In 2005, it’s 95%. (source) In 2010, it’s 94%. (source) In 2014, the most recent year available, it’s 94%. (source) So…there’s no appreciable difference in vaccination rates, which means there’s no association between lower vaccination rates (not happening) and increasing cases of pertussis.\n\nWhen we look at the MMR, we find a similar pattern. In 2000, 89% of 2-year-olds had an MMR (source), in 2005 it’s 90% (source), in 2010 it’s 89% (source), and in 2014 it’s 89% (source). Again, no appreciable difference in vaccination rates. So if measles was “eliminated” in 2000 and is making a resurgence now, it’s not because of a change in vaccination rates.\n\nJust for fun, I looked at the vaccination coverage rates from 1995, when many of us were kids. MMR in 2-year-olds was 87%, and 3 DTaPs was 92%. (source) Both were lower than today’s kids…so no. “Anti-vaxxers” are not bringing diseases back.\n\nWhat steady vaccine coverage rates, and increasing disease rates actually points to is vaccine failure. Researchers already know that the MMR coverage isn’t lasting, and have suggested adding a third at college age. If something doesn’t work…why would we want to use it more?\n\nFor example, recent mumps outbreaks on college campuses have been nearly 100% fully vaccinated students. (In this study, 98%.) In fact, several students who received a third MMR still got mumps.\n\nThis has nothing at all to do with “anti-vaxxers.” And pointing the finger is an attempt to take attention away from the failure of the vaccine program.\n\nAccording to the data shared in the previous points, vaccines do seem to temporarily reduce rates of infection in some populations. But, the effect doesn’t last (in an individual or at a population level) and, despite high levels of vaccine coverage, vaccines begin to fail and diseases come back.\n\nA 1991 study theorized that protection from measles might last about 15 years (this was a fairly small study). It also noted that a second dose didn’t create additional immunity — which is why adding a third is ridiculous. In the 60s and 70s, a single dose was assumed to be life long! We now know it may not even last the 15 years.\n\nAdditionally, in a 2013 study, it was discovered that maternal antibodies passed to babies lasted about half as long if the mothers had been vaccinated, vs. having had wild disease. This places babies at increased risk when they’re most vulnerable to infection.\n\nEssentially, vaccine-induced immunity is inferior and, in the long run, doesn’t really work.\n\n#6: The vaccine-autism link has been thoroughly debunked and that doctor lost his license/is in jail\n\nThis is my favorite story! It’s like a giant game of telephone; it’s been passed around so many times that most don’t even know the truth.\n\n“That doctor” is Dr. Andrew Wakefield, a gastroenterologist who lived in England. He now lives in the US. He did lose his medical license, but is not and has never been to jail. Many of the allegations against him are and were false. You can read more about him HERE.\n\nThe original paper in question was about the diagnosis of colitis in children with autism — not about vaccines. It was parents who reported they thought there was an association between the MMR and their children’s health issues. Dr. Wakefield concluded that there may be a link, but that further research was needed to understand it. He recommended splitting the vaccine into three separate ones and giving them a year apart, instead of using the combo shot, until the matter could be resolved. He did not recommend against using vaccines.\n\nSo, in the last 20 years, has the vaccine-autism connection been thoroughly studied?\n\nThis 2015 study looks only at receiving or not receiving the MMR vaccine — but not at any other vaccine. Children could be fully vaccinated except for the MMR. This 2001 study looks at only the MMR, and doesn’t even publish results — only says “we’re going to study this.” This study looks at only the MMR again. A survey-based study (not robust) concluded there was no association between health outcomes and vaccination status. Other surveys have found differently.\n\nOn the other hand…\n• A 2011 study says that there is a relationship between vaccines and autism.\n• A 2009 study concludes that “overuse of vaccines” causes autism.\n• A 2013 study says that vaccines may trigger an underlying mitochondrial dysfunction and lead to autism.\n• A 2002 study shows an “inappropriate response” to MMR may cause autism.\n• A 2007 study shows that prenatal mercury exposure may cause autism.\n• A 2011 study shows that aluminum in vaccines may cause autism.\n\nBasically…it hasn’t been thoroughly studied. We have a lot of questions still to ask. We need a comprehensive study of vaccinated vs. unvaccinated on total health outcomes in a developed country. (All we have are tiny studies from third-world countries or survey-based studies in developed countries.) There’s certainly enough data to warrant caution and further study!\n\n#7: Getting lots of vaccines at once is fine; babies run across more antigens just by playing\n\nThis is missing the point; no one is concerned about the number of antigens. In fact, they’re a lot lower today than they used to. Previous versions of vaccines are no longer used because the antigen load was high enough to cause the disease it was supposed to prevent, in some cases.\n\n#8: Vaccines contain less formaldehyde than a pear and less aluminum than breastmilk\n\nThis may be true. The government says it is. (source) We’re not that concerned about formaldehyde in trace amounts, as it isn’t lethal until around 12g, far more than is in a vaccine — although a few hundred milligrams or less could cause some soreness or side effects. (source)\n\nHowever, aluminum is very concerning. Ingestion is not the same as injection. A 2016 study suggests more safety tests are needed. A 2009 study points to aluminum causing brain damage. A 2015 study shows that injected aluminum persists in the brain.\n\nFurther, a 1999 study suggests a causal relationship between gelatin-containing vaccines and the development of gelatin allergy.\n\nAnd, a 2014 study shows that vaccines cultured in human fetal tissue contain “unacceptably high levels of DNA contamination.” Didn’t know that vaccines are cultured in human fetal tissue? Some are. They’re called “human diploid cells.” (source)\n\nWhile we’re not concerned with all the ingredients in the vaccines, there are some seriously concerning ones. We shouldn’t avoid or dismiss these concerns so quickly.\n\n#9: Vaccines boost the immune system overall; without them, a child can never be fully healthy\n\nSorry, but vaccines aren’t designed to work that way. They’re only designed to help prevent the person from becoming sick with specific illnesses. They aren’t overall immune boosters, and they can’t prevent diseases other than the one(s) they were designed to prevent.\n\nThe human immune system is meant to develop without vaccines. In fact, vaccines can change the way the immune system develops, and not necessarily in beneficial ways. (source) Vaccines may also increase the risk of autoimmune diseases. (source, source)\n\nThis is by no means an exhaustive look at all the research available surrounding vaccines. There is so much more to this topic. But, it’s enough to get you started if you’re new to researching it, and certainly enough to show that there isn’t a simple answer to the question. It’s not “vaccines are safe and effective, the end.”\n\nI hope you’ll take the time to read through all the sources I linked and continue researching until all your questions have been answered. This is an incredibly important decision, so don’t take it lightly!\n\nHow do you respond to “should I vaccinate?”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://modernalternativemama.com/vaccine-education/", "https://academic.oup.com/jid/article/189/Supplement_1/S1/820569", "https://www.cdc.gov/pertussis/downloads/pertuss-surv-report-2016.pdf", "https://www.cdc.gov/mumps/hcp.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2806663/", "https://www.cdc.gov/flu/about/disease/us_flu-related_deaths.htm", "https://www.cdc.gov/vaccines/pubs/surv-manual/chpt12-polio.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4474890/", "https://www.cdc.gov/vaccines/pubs/pinkbook/meas.html", "https://www.cdc.gov/mmwr/volumes/65/ss/ss6501a1.htm", "https://www.cdc.gov/pertussis/images/incidence-graph.png", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4056554/", "https://www.cdc.gov/vaccines/imz-managers/coverage/nis/child/tables/9900/24months_iap.pdf", "https://www2a.cdc.gov/nip/coverage/nis/nis_iap.asp?fmt=v&rpt=tab09_24mo_iap&qtr=Q1/2005-Q4/2005", "https://www2a.cdc.gov/nip/coverage/nis/nis_iap3.asp?fmt=v&rpt=tab09_24mo_iap&qtr=Q1/2010-Q4/2010", "https://www.cdc.gov/vaccines/imz-managers/coverage/nis/child/tables/14/tab09_24mo_iap_2014.pdf", "https://ftp.cdc.gov/pub/vaccines_nis/00/24months_iap.pdf", "https://www2a.cdc.gov/nip/coverage/nis/nis_iap.asp?fmt=v&rpt=tab09_24mo_iap&qtr=Q1/2005-Q4/2005", "https://www2a.cdc.gov/nip/coverage/nis/nis_iap3.asp?fmt=v&rpt=tab09_24mo_iap&qtr=Q1/2010-Q4/2010", "https://www.cdc.gov/vaccines/imz-managers/coverage/nis/child/tables/14/tab09_24mo_iap_2014.pdf", "https://www.cdc.gov/vaccines/imz-managers/coverage/nis/child/tables/95/tab9-24months_iap.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/28877026", "https://www.ncbi.nlm.nih.gov/pubmed/1934235", "https://academic.oup.com/jid/article/208/1/10/796786", "http://vaxxedthemovie.com/andrew-wakefield-biography/", "https://www.ncbi.nlm.nih.gov/pubmed/25898051", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC29106/", "http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0003140", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3057555/", "https://www.ncbi.nlm.nih.gov/pubmed/21623535", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3364648/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3697751/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3774468/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3878266/", "https://www.ncbi.nlm.nih.gov/pubmed/11339848", "https://www.ncbi.nlm.nih.gov/pubmed/12145534", "https://www.ncbi.nlm.nih.gov/pubmed/12933322", "https://www.ncbi.nlm.nih.gov/pubmed/17454560", "https://www.ncbi.nlm.nih.gov/pubmed/17674242", "https://www.ncbi.nlm.nih.gov/pubmed/21058170", "https://www.ncbi.nlm.nih.gov/pubmed/21993250", "https://www.ncbi.nlm.nih.gov/pubmed/22099159", "https://www.ncbi.nlm.nih.gov/pubmed/24995277", "https://www.vaccines.gov/basics/vaccine_ingredients/index.html", "https://www.ncbi.nlm.nih.gov/pubmed/19999605", "https://www.ncbi.nlm.nih.gov/pubmed/26948677", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2819810/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4318414/", "https://www.ncbi.nlm.nih.gov/pubmed/9949325", "https://www.ncbi.nlm.nih.gov/pubmed/26103708", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/b/excipient-table-2.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/12417433", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5607155/", "https://www.ncbi.nlm.nih.gov/pubmed/26031899"], "authors": [], "publish_date": null}