{"result_id": "204018", "URL": "https://modernalternativemama.com/2012/04/04/risk-benefit-analysis-diphtheria-tetanus-pertussis/", "timestamp": "2023-04-25 16:22:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2012/04/04/risk-benefit-analysis-diphtheria-tetanus-pertussis/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "Risk-Benefit Analysis: Diphtheria, Tetanus, Pertussis", "cleaned_text": "Welcome! This is the ninth post in my vaccine series. Today we are talking about Diphtheria, Tetanus, Pertussis, and their related vaccines. If you missed any part of this series, catch up with these posts: 10 Bad Reasons Not to Vaccinate, Why “Science” Should Be Carefully Evaluated, What is Herd Immunity All About, How the Immune System Works, Ingredients in Vaccines Part 1, Ingredients in Vaccines, Part 2, or Risk-Benefit Analysis: MMR.\n\nIt’s time for more risk-benefit analysis! Besides the MMR, the next vaccine that causes the most controversy for parents is the DTaP. It has the reputation of causing a high number of reactions. Today we’re going to look at each disease and figure out what it’s really like, and how that compares to the risks from the vaccine.\n\nDiphtheria’s a little mysterious. Most of us have never seen a case (doctors included) and don’t have any idea what diptheria even is. Let’s dive in and find out.\n\nDiphtheria is a highly contagious bacterial illness in the throat. It is often mistaken for tonsillitis or strep throat initially, but it lasts longer and may be more serious. There are a number of home remedies and homeopathic treatments available for it, as well as anti-toxin and antibiotics from mainstream medicine.\n\nThe Normal Course of Illness\n\nFirst, it appears like a cold, with runny nose and sore throat. Fatigue and loss of appetite are also common. Then, a membrane grows in the affected area (often the throat, but may be any mucous membrane). This membrane often starts on the tonsils, but may cover the throat. It produces a toxin, which, when absorbed into the body, can cause coma and death. (Home remedies note that fresh pineapple juice can neutralize the toxin and so can chewing raw garlic.) If the person does not swallow much toxin, then the illness is usually over after about 2 weeks. If they have, then complications can occur.\n\nInfections in the groin or ears or skin are also possible, but very rare.\n\nWHO states that most diptheria infections are asymptomatic or are very mild.\n\nThe most common complications are myocarditis (inflammation in the heart) and neuritis (inflammation of the nerves). Neuritis can cause some types of paralysis, but this is usually temporary. Myocarditis can cause heart failure and if it occurs early in the disease, is often fatal.\n\nSome people also get ear infections or pneumonia as secondary infections due to diphtheria.\n\nOverall, the death rate is about 5 – 10%. It may be as high as 20% for children under 5.\n\nDiphtheria is included in the DTaP vaccine. Protection is supposed to last for 10 years, and boosting through either exposure to natural infection or booster vaccines is necessary. Doses are recommended at 2, 4, and 6 months; then 4 – 6 years, and every 10 years after. It is supposed to be 97% effective. Another study says 95% after 3 doses.\n\nMinor reactions — like redness, swelling, and other “injection site” reactions — are common, occurring in up to 50% of those vaccinated. WHO states that this vaccine is “very safe.”\n\nVAERS tells a different story. Reactions include death, intussusception (death of intestines), seizures, severe headache, chest pain, inconsolable crying (which may indicate brain injury, if high-pitched), high fever, swelling/redness, vomiting, hives, severe diarrhea, permanent brain damage, and more. There were 3,169 adverse events reported in 2011 (remember this is thought to represent just 1 – 10% of the total number; meaning there were probably closer to 31,690 adverse events, possibly more). About 10% were characterized as “serious” by the VAERS system.\n\nFrankly, diphtheria scares me a little. It can be very serious and has a fairly high death rate. There is no known benefit to getting diphtheria. There are home remedies, as well as anti-toxins available if diptheria is contracted (which is rare these days). However, the DTaP scares me a lot more. There appears to be anywhere from 3000 to over 10,000 adverse events reported to VAERS each year, and many of these appear to be very serious — high-pitched screaming indicative of brain damage; seizures, vomiting, high fevers, and death. Although diphtheria is serious, it appears that the risk from the vaccine is much greater.\n\nTetanus scares parents. Even those who are committed to remaining vaccine-free often hesitate when it comes to tetanus, especially those who intend to homestead — since it’s known for occurring more often on farms. But what is it, really, where does it come from, and what are the true risks?\n\nTetanus is an anaerobic disease that grows in a deep puncture wound (it cannot grow in the presence of oxygen). It is a toxin-related disorder that can cause “lock jaw” and possibly death. It is more common on farms and occurs usually with serious puncture wounds, because it is found in animal feces or soil bacteria. Most people are offered a tetanus shot if they get a serious cut. Tetanus is unique because it is one of the few diseases we vaccinate for that is not communicable. It can, however, be serious if left untreated, and it is difficult to treat once it has set in. This is because although the bacteria itself is easily killed by exposure to oxygen or heat, the spores it produces are extremely difficult to kill. The spores are also one of the most toxic substances known to man; only a few nanograms (a billionth of a gram) can kill.\n\n73% of cases occurred from wounds, but it is possible to get tetanus from elective surgery, abortion, pregnancy, dental surgery, or drug use also (in the U.S.)\n\nWorldwide, the vast majority of cases occur in mothers and newborns following birth in an unsterile environment, especially using dirty instruments to cut the umbilical cord.\n\nThe Normal Course of Illness\n\nWhen a person gets a deep cut, the bacteria from manure or soil gets into the wound (if it is present). There is an incubation of 3 – 21 days before symptoms set in; the shorter the incubation, the more likely the case is to be fatal (shorter incubation is indicative of an injury closer to the central nervous system). If the environment the bacteria is in is anaerobic (no oxygen), the spores begin to germinate and spread throughout the body, acting on various parts of the central nervous system. This can lead to seizures and uncontrollable muscle twitches.\n\nAbout 20% of cases will be “local” tetanus, where only one small area of the body is affected, leading to muscle twitches in that area. This type may take weeks to resolve, but is fatal in only 1% of cases.\n\nMost cases (around 80%) are “generalized” tetanus, and symptoms start with stiffness in the jaw, followed by the neck, and working down the body. Stiffness and muscle twitches last for 3 – 4 weeks, and complete recovery may take months.\n\nNatural tetanus infection does not result in immunity to tetanus.\n\nDepending on which muscles are involved, breathing may become difficult. An irregular heartbeat may occur. Bones may break due to the recurrent muscle spasms. Aspiration pneumonia may occur in serious, long-term cases. Hospital-acquired infections are likely. About 20% of cases are fatal, and 20% of those are directly attributable to the tetanus toxin (rather than other complications). The death rate from tetanus alone, therefore, is about 1%.\n\nWith antibiotic treatment, muscle relaxers, and general support, less than 10% of patients die, according to this source.\n\nTetanus can only prevented by “passive immunity” — exposure to a tetanus toxoid. There are homeopathic treatments available that may accomplish a similar treatment with less toxic results.\n\nTetanus can be obtained in a single vaccine, but is usually combined with diphtheria (DT or dT — the lowercase ‘d’ indicating a low-dose diphtheria), or DTP or DTaP (also with pertussis). Five doses are on the recommended childhood schedule currently — 2, 4, 6 months; 4 – 6 years; 12 – 15 years. It is then recommended every 10 years thereafter (DT is used in people over 7 years; DTaP is used in younger patients). Efficacy is supposed to be 80 – 100%.\n\nSince natural infection doesn’t provide immunity, an explanation is required for the vaccine use. Small amounts of tetanus toxoid are injected into the body several times in order to help the body produce natural anti-toxin without being overwhelmed by actual tetanus spores.\n\nThis vaccine is known to cross the placenta during pregnancy.\n\nThis vaccine is typically offered as a DT or DTaP, which means all the side effects listed for the diphtheria vaccine apply — death, intussusception (death of intestines), seizures, severe headache, chest pain, inconsolable crying (which may indicate brain injury, if high-pitched), high fever, swelling/redness, vomiting, hives, severe diarrhea, permanent brain damage, and more. 42 deaths were attributed to one of these vaccines in 2011 alone.\n\nAlthough this isn’t research-based, I personally know of people who experienced faintness, dizziness, nausea, extreme localized pain, red/hot spot at the injection site, prolonged crying, and more due to a DTaP or DT shot, which is in line with what the VAERS database shows.\n\nThe DTaP remains extremely dangerous. So is tetanus. Proper wound care is essential when dealing with potential tetanus exposure. All wounds (including shallow ones, if they occur on a farm or other high-risk area) should be washed carefully and disinfected with hydrogen peroxide. Hydrogen peroxide contains oxygen, and can kill any tetanus bacteria on contact. Wounds should be allowed to bleed freely, also, which helps them to clean out any bacteria. Dressings should be changed as needed, and items like manuka honey or hazelwood (I’ve only just heard of this and know very little about it) or bentonite clay may be used to help clean any wound that looks like it may be getting infected. Seek medical care to obtain the toxoid if needed. All in all, diligence in hygiene and proper wound care should prevent tetanus in the modern world.\n\nPertussis is probably the most talked-about “vaccine preventable” illness around. A small number of babies do die from it most years, and we’ve seen a resurgence in cases over the last several years. Many vaccine proponents blame those who are opting out of shots for this increase. There’s a huge campaign for all babies and children to get vaccinated against this, as well as for adult caregivers to get a booster for it. What is it really, and why is it so scary?\n\nPertussis is a very contagious respiratory illness that results in extreme coughing fits, and which may be dangerous to small babies. It is interesting to note that when there was no pertussis vaccination, babies under 1 year almost never got it because they were protected by their mother’s antibodies (because she likely had had it as a child). These days, since mothers are vaccinated and do not pass antibodies to their babies, young babies who are at serious risk are getting sick. Pertussis is also mutating, which lowers the apparent efficacy of the vaccine.\n\nThe Normal Course of Illness\n\nPertussis begins as a normal respiratory illness — cough, runny nose, etc. It progresses after a couple weeks to a serious cough (not in all cases) in which the person coughs so hard and for so long that they make a “whoop” sound as they breathe in. People, especially small children, may vomit after these coughing fits, cry, or possibly even lose consciousness. It is possible for people to turn blue. This occurs because of the difficulty in coughing up very thick mucus.\n\nIt depends on the severity, and children under a year are most vulnerable. Adults may not actually “whoop” because of their larger lung capacity, which means they may not even realize that they have whooping cough at all. Coughing is usually worse at night than during the day. Whooping cough can last for several weeks, and coughing spells can persist even for a few months afterwards.\n\nIn older children and adults, pertussis is often not recognized, because the course is atypical (no extremely severe coughing, ‘whooping,’ etc.).\n\nImmunity after pertussis infection is not considered permanent.\n\nAbout 20% of people are hospitalized for pertussis. In about 5% of cases, pneumonia occurs (nearly 12% in young babies). In just under 1%, seizures can occur. About 0.1% suffer encephalopathy, and about 0.2% die from it. 92% of deaths are in babies 3 months or younger.\n\nHernias and rectal prolapse from severe coughing episodes also occur. Difficulty sleeping (since coughing is worse at night), urinary incontinence, and rib fracture, though rare, are also possible.\n\nLess serious complications include ear infection, loss of appetite, and dehydration.\n\nPertussis vaccination is included in the DTaP and DTP (the former being acellular, the latter being whole-cell and typically more dangerous). 5 doses are recommended throughout the childhood years. Strains and development vary widely between types and brands, and efficacy of the vaccine can vary from 46% to 92% in one study.\n\nProtection wanes after 4 – 12 years. About 21% of adults with prolonged coughing, in one study, actually had pertussis.\n\nUp to 50% of children will experience fever, redness, soreness at the injection site and other minor reactions. Less than 1% will experience seizures and prolonged crying. Local reactions increase with the number of doses and with a child’s age, and are more likely with whole-cell pertussis (which is why it is not recommended in older children).\n\nThe reactions noted above for the DTaP are valid for this vaccine too: death, intussusception (death of intestines), seizures, severe headache, chest pain, inconsolable crying (which may indicate brain injury, if high-pitched), high fever, swelling/redness, vomiting, hives, severe diarrhea, permanent brain damage, and more.\n\nPertussis is most dangerous in babies under three months. Special care should be taken to protect young babies from infection, especially during the winter months. Babies should be breastfed if at all possible and kept away from sick people. Any baby suspected of having pertussis should be taken to a health professional immediately.\n\nIn older babies and children, pertussis is extremely annoying but not really dangerous (long-term). The rate of deaths and increasingly severe reactions to the DTaP in this age group far outweighs the danger from pertussis itself. A focus on healthy eating and a healthy lifestyle, as well as home remedies and/or seeking the care of a homeopathic or naturopathic doctor can help to overcome pertussis infection.\n\nAgain, that was a lot! These risk-benefit analysis posts take quite awhile to research and put together. I would encourage anyone who has not done so to take a look at all the sources cited, including doing your own search through the VAERS database. It is certainly enlightening. Clinical trials cited in the CDC and WHO papers are usually very limited (6 weeks or fewer of data, and only a few thousand at most in sample size), while VAERS looks at a population at large. It is more accurate to look at VAERS, even if all the reactions cannot be fully attributed to a particular vaccine. (There are limitations to both methods, which is why I cite both.)\n\nNext week we’re talking about Hib, flu, and varicella (chicken pox). Don’t miss it!\n\nAre you worried about diphtheria, tetanus, pertussis or the DTaP vaccine?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://modernalternativemama.com/blog/2012/02/15/10-bad-reasons-not-to-vaccinate/", "https://modernalternativemama.com/blog/2012/02/22/why-science-should-be-carefully-evaluated/", "https://modernalternativemama.com/blog/2012/02/29/what-is-herd-immunity-all-about/", "https://modernalternativemama.com/blog/2012/03/07/how-the-immune-system-works/", "https://modernalternativemama.com/blog/2012/03/14/ingredients-in-vaccines/", "https://modernalternativemama.com/blog/2012/03/21/ingredients-in-vaccines-part-2/", "https://modernalternativemama.com/blog/2012/03/28/risk-benefit-analysis-m-m-and-r/", "http://www.cdc.gov/vaccines/pubs/pinkbook/dip.html", "http://www.who.int/wer/2006/wer8103.pdf", "http://www.who.int/wer/2006/wer8103.pdf", "http://www.cdc.gov/vaccines/pubs/pinkbook/dip.html", "http://www.who.int/wer/2006/wer8103.pdf", "http://www.who.int/wer/2006/wer8103.pdf", "http://web.archive.org/web/20120629020822/http://wonder.cdc.gov:80/controller/datarequest/D8;jsessionid=6E4BA614D5BA964E1A5C08A5C657DFA7", "http://www.cdc.gov/vaccines/pubs/pinkbook/tetanus.html", "http://www.cdc.gov/vaccines/pubs/pinkbook/tetanus.html", "http://www.who.int/immunization/wer8120tetanus_May06_position_paper.pdf", "http://web.archive.org/web/20141017215609/http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001640/", "http://www.myhomeopathic.com/html/info_disease/tetanus-symptoms-treatment-cure.asp?DTitle=Tetanus", "http://www.who.int/immunization/wer8120tetanus_May06_position_paper.pdf", "http://www.cdc.gov/vaccines/pubs/pinkbook/tetanus.html", "http://www.who.int/immunization/wer8120tetanus_May06_position_paper.pdf", "http://www.who.int/wer/2010/wer8540.pdf", "http://www.cdc.gov/vaccines/pubs/pinkbook/pert.html", "http://www.who.int/wer/2010/wer8540.pdf", "http://www.who.int/wer/2010/wer8540.pdf", "http://www.who.int/wer/2010/wer8540.pdf"], "authors": [], "publish_date": null}