{"result_id": "204036", "URL": "https://modernalternativemama.com/2015/07/28/12-mainstream-vaccine-lies-you-probably-believe/", "timestamp": "2023-04-25 16:22:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2015/07/28/12-mainstream-vaccine-lies-you-probably-believe/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "12 Mainstream Vaccine Lies You Probably Believe", "cleaned_text": "I know — uh-oh, I said the v word. It’s probably the most controversial topic out there right now, and it can lead to seriously vicious attacks. So before we even get started, I ask you, please remember that whatever ‘side’ you’re on, there are real people on the other side of the screen. It is possible to discuss this topic without getting nasty. And I’m not going to publish comments that swear, insult others, or are unnecessary and don’t further the discussion. If you wouldn’t say it to someone’s face, don’t say it here. Differing opinions are welcome; nastiness is not.\n\nThe argument over vaccines really has gotten ridiculous lately and there are a ton of myths that are flying around. The theory of vaccination and the immune system are both incredibly complex. It’s not, and never was, a cut-and-dried issue. Lately, people want you to think it is. They’re so sure that vaccines are perfectly amazing and have no side effects (or hardly any) that we should actually mandate them for everyone.\n\nBut we can’t do that. Vaccines, like any other medical procedure, must remain a choice. That’s especially true because of all these lies that circulate. Let’s just dive in…because this is so important.\n\n12 Mainstream Vaccine Lies You Probably Believe\n\n1. If you’re vaccinated, you can’t catch the diseases\n\nSorry, but no.\n\nNo matter what, vaccines are not 100% effective. Some people will fail to develop any “protection” at all. Some will find that protection wanes after only a short time. In fact, the pertussis vaccine (DTaP and Tdap) are among the least effective vaccines, with any protection fading in a matter of months (this study explains waning protection). There’s also no evidence (and can be no evidence) that the disease would be milder if you were vaccinated first.\n\nOne study showed that a single dose of DTaP was only 55% effective — and only at preventing hospitalization, not the infection itself. And even then, only very temporarily.\n\nThe bottom line is, you actually can catch the disease, even if you’ve been vaccinated.\n\nIf vaccines work as advertised, then you may come across an illness and not catch it — that’s kind of the whole point. However, you can still become a carrier of that illness, and you can still pass it on to others. An article by Suzanne Humphries, M.D., explains that you’re actually more likely to be a carrier if you’re vaccinated. And, a study shows that DTaP is not preventing transmission and infection. That’s the real reason why we’re seeing outbreaks of disease right now — that, and vaccine failure (see point 1).\n\n3. Titres mean that you’re immune to the disease\n\nNot exactly. Titres prove exposure to a disease and are a side effect of the immune system doing its job to rid the body of a threat. But, they wane after natural infection, over time. They wane after vaccination, too, but usually start lower and wane faster. It’s generally assumed that there are other signs that correlate with protection and that some of these correlations aren’t even understood (but must exist because the immune system is redundant — that is, it has many parts that do the same thing, in case one fails). This article explains it.\n\nWhile our medical knowledge 50 or 60 years ago was clearly more limited, we have made great advances now. We’re now able to treat many illnesses with simple, non-invasive means. Vitamin A supplementation is used to prevent complications of measles. Mullein is an herb that’s excellent at treating pertussis (along with vitamin C) and other illnesses. We know so much more now. And alternative medicine often has an answer!\n\nPlus, if you’re concerned about polio, read up on that.\n\n5. The formaldehyde, aluminum, etc. in the vaccines is similar to amounts found in food, etc. and is not a concern\n\nWell — technically, the amounts are similar, or the amounts in foods are even greater. But, ingested aluminum (etc.) is not the same as injected! One study shows that aluminum adjuvants in vaccines are correlated strongly with the development of autism. This study links autoimmune disorders to aluminum adjuvants in vaccines (and cautions against the ever-increasing vaccine schedule). This study suggests that the relationship between aluminum adjuvants in vaccines and autism is probably causal (ie. vaccines cause autism).\n\nBottom line, aluminum is a major concern when it’s injected via vaccines, and is associated strongly with serious and permanent damage.\n\n6. The antigens in vaccines are low and children run across more in daily life\n\nThe antigens in vaccines have been reduced because older versions of vaccines were causing significant reactions. Vaccines bypass the normal immune system defenses — the mucus membranes (stomach, nose, throat) and are injected, which is why large amounts of antigens caused a serious reaction. It’s worth noting that the antigens children run across in daily life do not bypass those initial immune defenses.\n\nThey replaced the higher levels of antigens with the adjuvants to stimulate a reaction without so many antigens. But as we saw in the point above, those are quite dangerous.\n\nThe actual number of antigens found in vaccines has never been a primary concern of those who question vaccine safety. Alluding to this is a red herring.\n\nUnfortunately, this might be the biggest lie of all.\n\nThousands of children have been injured and even killed by vaccines. I personally know dozens of mothers who have vaccine-injured children. Even some who, themselves, were injured. It’s not nearly as rare as we’re led to believe.\n\nWe do not have solid data, however, because vaccine advocates dismiss almost all reactions as “coincidence.” When a child gets a round of shots and develops a high fever hours later, the mother is usually told that “s/he must have been exposed to something a few days ago; some children will just get sick after shots but the shots do not cause it.” This is a lie.\n\nIf we studied vaccines more closely and took reports of reactions more seriously, we’d have a better idea of the true rate of reactions. Currently, we don’t know, but based on the number of people unofficially reporting damage, it’s significant. And, although this sounds sort of “conspiracy theorist,” the government has a good reason not to do these studies and to keep denying that these reactions occur.\n\n8. Vaccine companies are liable if reactions do occur\n\nThis may surprise you, but no. They are not.\n\nIn 1986, Congress signed an act that removed vaccine manufacturers’ liability for any vaccine injuries. There were so many lawsuits that the companies threatened to stop making vaccines. So, Congress gave them legal immunity.\n\nIf you are injured by a vaccine, first you must report it. Then, there is a special court system set up. Most cases are dismissed — the vast majority. The few that make it through the entire (long, expensive) process will get a payout from the government. There is a tax on every vaccine dose to pay for this system.\n\nThere is a way to sue vaccine manufacturers after this process, but it’s incredibly difficult and basically, no one does it. For all intents and purposes, manufacturers are not liable for their products. This means they have no incentive to make them safer. They have even less incentive now that some states are forcing all kids to be fully vaccinated to receive an education! They know people will use them!\n\n9. The dose of the vaccine varies depending on age, weight, etc.\n\nVaccines are typically one dose. Occasionally there are two dose options, for certain shots (like high-dose vs. regular flu shot), but generally, there is one. That means that the same amount of antigens, aluminum, etc. are going into a 10-lb. baby and a 200-lb. man. Babies and young children, whose bodies do not metabolize drugs like adults’ bodies do, are treated exactly the same when it comes to vaccination.\n\nNot even a little bit.\n\nWith the mounting evidence of potential harm from vaccines, the wisest course of action would be to develop new methods to screen children for anything that would increase their risk of harm (auto-immunity in the family, certain genetic mutations, etc.). Also, to delay vaccination, to spread them out, to carefully document any reactions to particular vaccines in each child, to do an individual risk-benefit analysis and decide which one(s) are worth getting for a particular child and which ones are not. It would be wise to practice individualized medicine, as well as to give fewer vaccines overall — reserving the practice for the truly important ones.\n\nInstead, certain medical professionals and lawmakers are racing to develop more and more and more vaccines, get them all in early and at once, and mandate the whole thing. This just makes no sense at all. There are vaccines in development now for autism, social anxiety, ear infections, and just about everything you can think of. It seems to me that vaccines ought to be reserved for truly serious illnesses, where we don’t have less-invasive treatments available.\n\n11. The diseases we vaccinate for are incredibly dangerous\n\nMost of these diseases were normal childhood illnesses and were a very uncomfortable week or two, but were not dangerous for healthy children. Read more about measles, a risk-benefit analysis, and pertussis. It’s not to say that there aren’t a small number of children who were seriously ill or died in the past, but medical knowledge has advanced quite a bit since that time, and we still haven’t answered the question which is truly safer for our children long-term, the vaccines or the illnesses. That’s important.\n\n12. There is a clear scientific consensus on vaccines, and doctors recommend them because they fully believe in them.\n\nAs we can tell from all the information above — which is not shared in the mainstream, but which many doctors and researchers believe and share through alternative means — there is not.\n\nMoms and dads, this is not an easy decision. There is not a clear answer. There is vast disagreement in the scientific community. In fact, many doctors recommend getting vaccines because they are required to do so by their professional organizations. They may or may not make the same choices personally, or believe it is best, but they could lose their licenses to practice if they spoke out against vaccines. Even so, I have met many doctors who question vaccines (or some vaccines) or outright reject them. The answer you get face-to-face is very different than a public answer.\n\nUnfortunately, there are many more vaccine lies than this, but I tried to focus on the ones that are less commonly discussed. Many people simply argue vaccines and autism, herd immunity, and not much else. I have no interest in getting into a fight with anyone over issues that can’t be informed by science.\n\nAnd by the way, for those who will argue with this post, if you are going to state that the science I relied on is wrong, you need to be prepared with your own peer-reviewed information. Newspaper articles do not count. Saying it exists and not sharing it does not count. Saying that your science is right and my science is wrong will be ignored (and not published). Acknowledge it’s a complex issue and we’ll discuss it rationally.\n\nAnd please, please, please do not refuse to click on the many links I shared, say that I have no evidence. Or insist that the science is clear, vaccines are safe and effective, and all medical professionals agree. That’s demonstrably false and I’ll delete it. I’m not going to waste my time or yours on that.\n\nIf this information was new to you and you have questions, please ask!\n\nPsst! My brand-new book, “Natural Remedies for Kids,” came out in August, 2015! Order your book here.\n\nWhat vaccine lies have you heard?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.ncbi.nlm.nih.gov/pubmed/22970945", "http://www.ncbi.nlm.nih.gov/pubmed/24515514", "http://pathwaystofamilywellness.org/Informed-Choice/vaccination.html", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3896208/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2897268/", "https://modernalternativemama.com/2012/01/25/is-polio-a-threat/", "http://www.ncbi.nlm.nih.gov/pubmed/23609067", "http://www.ncbi.nlm.nih.gov/pubmed/22235057", "http://www.ncbi.nlm.nih.gov/pubmed/22099159", "http://modernalternativemama.com/wp-content/uploads/2015/07/12-Mainstream-Vaccine-Lies-You-Probably-Believe-MAM-Pinterest-3.jpg", "https://modernalternativemama.com/2014/03/14/measles-outbreak-is-measles-really-so-scary/", "https://modernalternativemama.com/2014/10/03/safer-vaccines-illnesses/", "https://modernalternativemama.com/2012/09/28/why-we-still-dont-vaccinate-fear-is-a-powerful-motivator/", "https://modernalternativemama.com/natural-remedies-kids/", "http://qbookshop.com/products/213584/9781592336739/Natural-Remedies-for-Kids.html"], "authors": [], "publish_date": null}