{"result_id": "204007", "URL": "https://modernalternativemama.com/store/a-practical-guide-to-childrens-health/", "timestamp": "2023-04-25 16:22:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/store/a-practical-guide-to-childrens-health/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "A Practical Guide to Children’s Health", "cleaned_text": "Get an excerpt from the book FREE! Just enter your email address below.\n\nDisclaimer: This book was not written by a medical professional. It is not medical advice. Everything within this book is intended for informational purposes only and is not intended to diagnose, treat, or cure anything. If you have a concern about your child’s health, please seek advice from a medical professional.\n\nIn today’s world, muddling through all the conflicting health information is difficult. Parents are told opposing things all the time:\n• Vaccines are necessary — vaccines are poison\n\n…and on and on it goes.\n\nThe average parent doesn’t have the time to sort through all of these conflicting messages — they’re too busy simply trying to raise their children as best they can! They’re left with having to pick a source or two to trust and their own instincts.\n\nSometimes, though, they really need or want to know more. What then?\n\nA Practical Guide to Children’s Health was born because of this confusion. I was in that boat myself 5 years ago when my first was a baby. I read and read and became more confused, until after a few years and thousands of hours of reading, what I was seeing began to make sense. I began blogging, continued reading, and at the end of 2012, finally began to write this book.\n\nIt’s taken me those five years, thousands of hours of research in books and medical journals, and lots of trial and error to figure out what works for my family. Many parents don’t have that kind of time to devote to such research. What they need is a “cheat sheet” on the major issues, so that they can skim through what’s out there and figure out what works best for them.\n\nA Practical Guide to Children’s Health doesn’t tell you what you *must* do. Each section explains the current controversy (if any) and all the major issues, then offers potential solutions. In many sections, I share what our family has decided, although I make it clear that is just what works for us (and this is valuable because I share our thought process).\n\nThe book is well supported by research, with over 300 primary sources, largely from medical journals. It has a foreword written by Dr. Tyson Perez, DC. All of the sources in the PDF versions of the book are clickable, so that parents who desire to do more research on their own and simply use this as a “jumping off” point may do so. This book is valuable even for more experienced “natural health” families because of the depth of the research available. It would take families hundreds of hours to search for all of these sources themselves (as it did for me); instead, they can simply click through the long list of resources as desired!\n\nFor parents looking for a no-nonsense, well-researched guide to children’s health, this is it.\n• How to Use This Book\n• Why Nutrition is So Important\n• What if I Have a Picky Eater?\n• Ingredients to Avoid at the Store\n• Getting Kids Involved in the Kitchen\n• What Does It Mean to be “Healthy?”\n• When to Call the Doctor\n• Do You Need Organic Beds and Bedding?\n• Personal Care Products: Which to Use and Why\n• Does Your Child Really Need a Bath?\n• TV and Media Use in Children\n\nWhat Others are Saying\n\nWhat a great read! In this book, Kate presents the facts on many childhood health concerns, from illness to diet/lifestyle. As a registered pediatric nurse, I enjoyed reading this well-written manual full of practical advice and alternatives to Western medicine and health care. It was refreshing to read about childhood illness from the viewpoint of a well-studied mother (after all, who knows their child better?), with research-based facts to back up the information given. I strongly recommend this book to all parents who want to save time, stress, money, and unnecessary trips to healthcare facilities by being empowered to prevent and treat minor childhood illness.\n\nA Practical Guide to Children’s Health is a must-have book for every family. Kate covers everything from nutrition and health to exercise and schooling options. I wish all my friends and family with children would buy this book. I am excited to have it as part of my collection. I will be referencing this book again and again.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://modernalternativemama.com/wp-content/uploads/2013/03/childrens-health-cover2.jpg", "https://www.amazon.com/Practical-Guide-Childrens-Health/dp/1483924505"], "authors": [], "publish_date": null}