{"result_id": "204044", "URL": "https://modernalternativemama.com/2016/03/18/10-signs-of-vaccine-reaction-and-damage/", "timestamp": "2023-04-25 16:23:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2016/03/18/10-signs-of-vaccine-reaction-and-damage/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "10 Signs of a Vaccine Reaction", "cleaned_text": "Vaccines are one of the most controversial topics today. The CDC Schedule now requires over 70 vaccine doses by the age of 18.(S)\n\nFor us, the debate is over: vaccines contain toxins and can damage your child’s health.\n\nBefore we get too far into this issue, let’s talk about how many are really injured by vaccines. Your pediatrician and his handy marketing piece, the Vaccine Information Statement (VIS), will tell you that reactions are “one in a million! Very rare!”\n\nThe Vaccine Adverse Reporting System (VAERS) is where reactions can be documented, however, there are no requirements for doctors or medical staff to report any injuries or deaths to this system.(S) It is all voluntary, and many medical staff do not know how to submit a report there either. There is also not a requirement to follow up to any injuries reported.\n\nThe CDC does recognize the system has flaws.(S) According to studies, less than 1% of adverse events are likely reported to VAERS. (S) 48,439 reports were filed in 2019, and in 2022 there have been 201,302 reports so far (at the time of this posting in October). (S)\n\nTimes that by 10 or 100. One in a million? Didn’t think so.\n\nEven if you believe you’ve never seen a vaccine reaction, you probably truly have. You just didn’t realize (and your doctor wouldn’t admit) that’s what you were seeing! Here we will go over the most common reactions. These may be considered “normal” by how often they occur, but are by no means “normal” to a child’s health – especially when your child swells up, seizes, or dies.\n\nVaccine reactions can occur anywhere from immediately following vaccination to a month or more post vaccination. Research shows us the most critical days are days 5-7 and 14-16 post vaccination, where serious reactions are most likely to occur.(S)\n\nHigh-pitched crying and discomfort, such as arching the back when laid down, is a clear indication of encephalitis, brain inflammation, which is a common vaccine reaction. Large amounts of bacteria, viruses, and toxins create a hyper-immune response, prompting severe, sometimes deadly, inflammation in the brain.\n\nIf your child will not sleep, seems uncomfortable, and cries incessantly post vaccination, take them to the emergency room immediately. These symptoms may occur right away or up to 21+ days later.\n\nSevere inflammation at the injection site can be a sign of an allergic reaction or other hyper-immune reaction. Review the vaccine insert to try to determine what allergic reaction (peanut, milk, egg, yeast, etc) may have been created/triggered. If your doctor cannot explain what reaction occurred, then you should consider a different approach to prevent any further damage. Supporting the immune system to create longer lasting immunity is a great approach!\n\nRead the vaccine insert before vaccinating to be sure the doctor is using the correct method of injection.(S) Injecting in the incorrect method can deliver a serious reaction. These inserts can be downloaded from the FDA link here. If you have trouble accessing these, you can ask your healthcare provider for a copy of the insert – they will usually say no and only show you their facility’s summary of common reactions. These are called “Vaccine Information Statements.”\n\nTell me when in normal, daily life would you intentionally expose several bacteria and viruses that are deemed concerning at one time and directly into your child’s body? Nope, never. In fact, you would probably be charged for child abuse! When your child receives this many immune threats at once – accompanied by other toxins – their immune systems go into overdrive.\n\nThis can produce a very high fever, and if the fever moves up or down in temperature fast enough, a febrile seizure. Head to the emergency room, and demand a review of your child’s health if a febrile seizure or fever lasting over 3 days is seen post vaccination.\n\nA rash is simply a toxin leaving your body through your skin. A rash post-vaccination can be caused by the virus vaccinated against (measles or chickenpox, for example), or an allergic reaction producing eczema. (S)\n\nIf your child develops a rash, monitor the child for the symptoms of the vaccinated virus or bacteria. Also consider eliminating any possible allergies created by the vaccine. Your child may detox adjuvants such as mercury based thimerosal or aluminum from the vaccine out through the skin. (S)\n\nVaccines were designed to sensitize your immune system to specific viruses and bacteria. Although the goal is similar – activating the immune system – the process does not work the same with muscular/blood injection versus the normal means of the mouth, nose, and eyes. These encounter your immune system process through different interfaces like the gut. With vaccines, it goes straight into the blood and lymphatic system. In general, the immune system does not retain as long an immunity to vaccine exposure as it does with natural exposure throughout the body.\n\nWhen you vaccinate, you are surely sensitizing your child to not only the bacteria and virus, but also the food and chemical additives in the vaccine, which include milk proteins, other human and animal proteins, eggs, peanuts, latex, yeast, palms, and much more.(S)(S) If your vaccinated child develops eczema, allergies, or asthma, then you need to consider stopping vaccination to not worsen the allergy or cause other autoimmune reactions.(S)\n\nIf your child’s breathing post vaccination is delayed or slowed, it is cause to make a trip to the emergency room and check for allergic response or brain damage. If you vaccinate, a breathing monitor may be helpful. It can be used overnight for at least a month. Breathing difficulties are listed as a possible side effect of many vaccines, for example here in the Pertussis Pinkbook page.\n\nAnaphylactic shock can also be a vaccine reaction. This is where your airways (or other body systems) go into shock from an allergic response. If your child has responded in this way to vaccines, it is time to stop, and review the possible allergies created. (S)\n\n#7 Loss of Facial and Eye Symmetry and Itching/Numbness in Extremities\n\nWhen your immune system responds to a threat, it produces more white blood cells. Your white blood cells are substantially larger than your red. This becomes an issue when your immune system is kicked into overdrive delivering large quantities of white blood cells to your smallest blood vessels, your capillaries. (S)\n\nThe smallest of these vessels are located in your hands, feet, nose and brain, particularly by the area which controls speech. When too many white blood cells are released, they cannot squeeze through the blood and oxygen supply is limited for a period of time. This can cause a stroke in the brain, and can be seen by loss of facial asymmetry (one side of the face looks different than the other) and loss of muscle tone around the eyes, cheeks, and mouth. (S).\n\nYou would also feel this, if happening in your extremities rather than your brain, as tingling, burning, or numbing. Your child may not be able to articulate this to you, but if you see them generally uncomfortable, struggling with using those parts, or pulling at the parts, I would consider a possible reaction and a trip to the emergency room.\n\nAnother condition, similar in symptoms, is Guillain-Barre Syndrome. This is when the immune system mistakenly begins attacking the nervous system. (S) While controversial to some (for example those profiting from or those creating policy for vaccines), this has been associated with vaccines, even the newest injections. (S)\n\nAs noted above, vaccines are designed to sensitize your system to a bacteria or virus. Theoretically, every time you vaccinate, you get that bacterial or viral illness. If your child falls ill post vaccination, bring them back to your pediatrician and demand that the child be examined for the illness against which they were vaccinated. It’s likely that your doctor will ignore your requests and be adamant that the vaccine cannot cause the disease.\n\nVaccine-strain illnesses, just like the wild strains, can be serious for some people, especially the immunocompromised. Some doctors may not take the symptoms/reactions seriously. If your doctor refuses, take your child to another doctor or to an emergency room. Also, be sure to report the reaction to VAERs.\n\nSince your child will be receiving the bacteria or viral illness vaccinated against, as well as a load of other toxins and allergenic substances, their bodies will try to detox these substances post vaccination. This is a vaccine reaction. If your child exhibits vomiting or diarrhea for a day or more post vaccination, have your doctor or an emergency room evaluate the child for the diseases against which they were vaccinated (and treat them for dehydration and the disease).\n\nA normally functioning child does not regress (lose speech, lose eye contact and social interaction) for no reason. Heavy metal toxicity, loss of oxygen to critical areas of the brain, and a body in constant hyper-immune response leads to a child who cannot function and develop.\n\nIf you notice your child losing abilities once mastered, exhibiting attention or aggression issues, or withdrawing from social interaction, you are likely viewing a vaccine reaction. The good news is that there are many natural ways to detox and heal vaccine damage.\n\nCheck out these free resources if this has happened to your child, and explore how you can detox heavy metals and vaccine damages:\n\nIf your child has had a vaccine reaction, it’s never too late to research vaccines and choose to build natural immunity and a healthy lifestyle instead. You should also look into detoxing from the vaccine. If you still choose to vaccinate, consider a delayed schedule and using a breathing monitor.\n\nIf you suspect damage, do not take “this could not be from the vaccine you had 3 days ago” from your doctor. Your child deserves better than a denial of clear symptoms because of pride and profit fears. Find a doctor who is willing to help you, consider finding a chiropractor, naturopath, biomedical, or functional doctor.\n\nHave you (or a loved one) had a vaccine reaction?\n\nDisclaimer from Danielle: I am not a doctor (yet), but you should find one you trust that understands, listens and treats you how you’d like. Do not tolerate medical bullying. Please make your medical decisions with research, a trusted physician, and common sense.\n\nGeneral Disclaimer: This is not intended to be medical advice nor is it meant to treat, cure, diagnose, or prevent any disease.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://wellyouwellness.wordpress.com/", "https://linktr.ee/rustinalilies2love", "https://www.cdc.gov/vaccines/schedules/downloads/child/0-18yrs-child-combined-schedule.pdf", "https://vaers.hhs.gov/index.html", "https://vaers.hhs.gov/data/dataguide.html", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://vaers.hhs.gov/data/datasets.html", "http://www.whale.to/v/scheibner.html", "https://www.fda.gov/vaccines-blood-biologics/vaccines/vaccines-licensed-use-united-states", "https://www.fda.gov/vaccines-blood-biologics/vaccines/vaccines-licensed-use-united-states", "https://www.immunize.org/technically-speaking/20181120.asp", "https://www.fda.gov/vaccines-blood-biologics/vaccines/vaccines-licensed-use-united-states", "https://www.immunize.org/catg.d/p2027.pdf", "https://pubmed.ncbi.nlm.nih.gov/14690341/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3312275/", "https://www.fda.gov/vaccines-blood-biologics/safety-availability-biologics/common-ingredients-us-licensed-vaccines", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6602527/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7129276/", "http://modernalternativemama.com/wp-content/uploads/2016/03/10-Signs-of-Reaction-2880-×-3240-px.png", "https://www.cdc.gov/vaccines/pubs/pinkbook/pert.html#vaccine-safety", "https://www.cdc.gov/vaccines/pubs/pinkbook/pert.html#contraindications-precautions-vaccination", "https://www.sciencedirect.com/science/article/abs/pii/0026286280900837", "https://bmcneurol.biomedcentral.com/articles/10.1186/s12883-021-02495-z#:~:text=Conclusions,occurrence%20in%20the%20elderly%20population", "https://www.ninds.nih.gov/guillain-barre-syndrome-fact-sheet", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8405530/", "https://vaers.hhs.gov/", "http://modernalternativemama.com/wp-content/uploads/2016/03/Add-a-heading-1.png", "https://www.earthley.com/product/vaccine-detox-protocol-2020/", "https://www.earthley.com/product/the-shedding-tool-guide/", "https://www.earthley.com/product-category/detox"], "authors": [], "publish_date": null}