{"result_id": "204021", "URL": "https://modernalternativemama.com/2018/07/25/how-to-get-a-vaccine-exemption-and-why-you-should/", "timestamp": "2023-04-25 16:22:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2018/07/25/how-to-get-a-vaccine-exemption-and-why-you-should/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "How to Get a Vaccine Exemption (And Why You Should)", "cleaned_text": "You know the dangers of vaccines but aren’t sure how to go about it legally. You need to read this post, know your options, and get an exemption.\n\nDebates on vaccines are for another time, this article is for those of you who know you don’t want to vaccinate, but need to know how to go about it. If you need to learn more about vaccines, go here.\n\nSo you know the dangers of vaccines but need to know how to keep them legally away from your little bundle of joy?\n\nMost states only have laws regarding vaccination requirements for school or daycare entry. If you are planning to homeschool, you will still want to follow the law, but know that you have less regulation to deal with. There are three types of vaccination exemption available in the United States: philosophical (18 states), religious (all but three states), and medical (every state).\n\nThere are five states that do not have a religious exemption: California, New York, Maine, Mississippi, and West Virginia. If you live here and moving is an option, consider it. If not, read on below on how to still avoid vaccinating in these states.\n\nThere are some states that have vaccine requirements for employment, such as in a healthcare setting. These will typically have an exemption available and defy equal employment opportunity guidelines if not allowed.\n\nSixteen states have philosophical vaccine exemptions, based on a parent’s philosophical viewpoint. If you live in one of these states, this is definitely your best bet as you don’t need a religious affiliation or a physician to sign off.\n\nAll but five states have religious exemptions. Use a religious exemption if your state does not have a philosophical exemptions or you have sincere religious beliefs against injecting animal DNA, aborted fetal DNA, or injecting the human body in general. Some states require you to prove your religious affiliation or get a clergy signature.\n\nA form may be required, or you may need to write your own religious exemption letter. When writing the letter, be as vague as possible so that any particular tenets you list cannot be argued. Check with your local groups or NVIC if you need more assistance.\n\nChristian scientists exempt from vaccination for this reason. If you need assistance, asking a local congregation is a good idea.\n\nEvery state has medical exemptions, but they are easier to come by in some states than in others. In many states, a medical exemption is only written for children who have already had a severe adverse effect from vaccines (gee, thanks!). For that reason, you will likely want to seek a religious, or philosophical exemption if available to you.\n\nIn other states, such as Illinois, a law was passed in 2016 allowing a physician to determine a child’s need for a medical exemption based on their own professional opinion. Many opt to test for genetic mutations, such as MTHFR, which impair a person’s ability to detoxify the harmful ingredients in vaccines.\n\nIf You Are in a State with Only a Medical Exemption\n\nThis means you are in California, West Virginia, or Mississippi and cannot move. In this case, your best bet in homeschooling, which is way better and easier than you may be thinking. There are entire curriculum and even online schools, as well as homeschool cooperatives where a number of teachers teach your homeschooled child. There are so many homeschooling resources, you do not have to worry you will be doing it alone.\n\nThough there is a medical exemption in these states, that typically means your child must suffer a severe reaction to vaccines before being allowed to obtain one. If you qualify for the medical exemption in any state, be sure to get it as it’s the “strongest” exemption.\n\nWhat Are Your Next Steps?\n\nAs soon as you plan to enroll or your child reaches the age of school enrollment, file a vaccine exemption. Even if you homeschool, it’s a good idea to keep applicable state exemptions on file with the school administrator, which may be the mother or father. Check the NVIC.org web site for vaccine laws in your area, and search Facebook and social media for “informed consent” or “vaccine rights” groups in your state. If you cannot locate them, NVIC normally can direct you to their information.\n\nWhen you file your exemption with a daycare or school, I suggest you include a copy of the state law. Surprisingly, even school nurses and administrators are not familiar with the law, and may try to tell you they don’t accept exemptions or yours isn’t valid. And don’t ask “if” they allow the exemption – they have to by law! Be confident and well versed in the law, and let them know you are following the law with your exemption, and expect them to also. Period.\n\nYou have the right to vaccine exemptions, so exercise your freedom with confidence.\n\nHave you had problems getting a vaccine exemption?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wellyouwellness.com/", "https://modernalternativemama.com/vaccine-guide/", "https://www.nvic.org/vaccine-laws/state-vaccine-requirements.aspx", "https://www.nvic.org/vaccine-laws/state-vaccine-requirements.aspx", "https://modernalternativemama.com/2016/07/20/selenium-miracle-healer/brazil-nut-638972_1920-2/", "https://www.nvic.org/vaccine-laws/state-vaccine-requirements.aspx"], "authors": [], "publish_date": null}