{"result_id": "204030", "URL": "https://modernalternativemama.com/2012/03/28/risk-benefit-analysis-m-m-and-r/", "timestamp": "2023-04-25 16:22:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2012/03/28/risk-benefit-analysis-m-m-and-r/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "Risk-Benefit Analysis: Measles, Mumps, Rubella and the MMR Vaccine", "cleaned_text": "Welcome! This is the eighth post in my vaccine series. Today we are talking about measles, mumps, rubella and the MMR vaccine. If you have missed any part of this series, catch up with these posts: 10 Bad Reasons Not to Vaccinate, Why “Science” Should Be Carefully Evaluated, What is Herd Immunity All About, How the Immune System Works, Ingredients in Vaccines Part 1 or Ingredients in Vaccines, Part 2\n\nIt’s time to get to the nitty-gritty of this series! We’ve been laying groundwork for understanding vaccines and the body. Now we’re going to dive in and take a specific look at each disease and each vaccines. This is really the most important part — does the benefit of the vaccine outweigh the risk? Is the disease as scary as we’re told it is?\n\nMeasles scares a lot of parents these days. They’re worried about high fevers (of course, parents worry about fevers in general, which they usually shouldn’t) and complications like encephalitis or death. Let’s take a look at this disease more carefully: what is it really like?\n\nMeasles is an infectious disease that is spread by direct contact with those who have it. The virus can’t live on surfaces for more than two hours, and is “rapidly inactivated” by heat, light, or acidic pH. Prior to vaccination, about 90% of people would get it during childhood. The illness is accompanied by fever and spots\n\nNormal course of the disease\n\nMeasles incubates in the body for about a week after exposure (3 – 14 days). A fever comes first, rising higher and higher, to top out at 103 – 105 normally (this level is not dangerous and if untreated, should kill the illness quickly). A rash appears at the top of the body and moves down over a period of days. Measles lasts about a week. Most people will also experience loss of appetite, diarrhea and soreness in the lymph nodes (throat area).\n\nIn most cases the illness is gone in just over a week and there are no complications.\n\nIn up to 30% of cases, there are some type of complications. This is more likely to happen in children under 5 or adults over 20. Most “complications” are not serious — diarrhea (8%) is the most common “complication,” followed by ear infections (7%) and pneumonia (6%). Pneumonia is the most common cause of death from measles.\n\nEncephalitis (fever, vomiting, meningeal irritation, headache, stiff neck) occurs in about 0.1% of cases, or about 1 in 1000 (in all countries; in developed countries, this number is only 1 in 10,000 to 1 in 100,000). About 15% of those who develop encephalitis will die from it (about 1 in 7000 cases of measles using the ‘worldwide’ number, or as little as 1 in 700,000 using the developed countries number). Worldwide (including developing countries), the number with serious complications is about 1 in 1000 to 1 in 100,000 (depending on the complications).\n\nOn average, about 0.2% of people will die from measles (1 in 500). WHO states that deaths in developed countries are “rare,” but may reach as high as 10% in developing nations.\n\nMeasles is more severe and complications are more likely in those who are malnourished, especially those who are deficient in vitamin A. Vitamin A supplementation has shown a strong protective effect in those with severe measles (against complications like pneumonia or encephalitis).\n\nMeasles vaccine is recommended in two doses: at 12 – 15 months of age, and again at 4 – 6 years (or when a child enters school). MMR vaccination in children under 6 months of age is relatively ineffective and not recommended. It is often stated, but not definitively known if measles vaccine provide life-long protection. One source says the vaccine lasts for around 11 years before protection likely begins to wane. Estimates of protection range from 87 – 100%. However, experts note that one of the reasons for continued natural protection to a given illness is because the person is continually “re-exposed” by being around others who are currently infected, providing a “booster” effect. They question whether or not vaccines can provide lifelong immunity without boosters. Ultimately how much protection is really afforded is uncertain.\n\nAccording to the VAERS database, there were over 2000 vaccine reactions attributed to measles alone or MMR vaccine in 2011 (this was on the low side; there were years with double or triple the number of reactions, especially in the early 2000s). About 10% of these were classified as “serious.” Estimates are that between 1 and 10% of the total number of reactions are reported each year. (Click the second link to scroll through the vaccine reactions, which range from low fever and redness to miscarriage — in adults, high fevers, hives, inflamed joints, measles, encephalitis, and more.) As reported, this is about 1 in 15,000 who have a serious reaction (but could be as many as 1 in 150, if reporting is only at 1%. This is unlikely since serious side effects are more likely to be reported than non-serious side effects. It is likely it is greater than 1 in 15,000 though).\n\nMerck’s MMR II was responsible for most of the vaccine reactions. The package insert specifically notes that it should not be used on pregnant women, and that women who are vaccinated should not become pregnant for at least three months (the VAERS database indicates it has been used on pregnant women).\n\nThe vaccine may cause a number of different side effects (see pages 7 and 8 of the package insert, linked above, for the full list) including encephalopathy, diabetes, thyrombocytopenia, diarrhea, vomiting, irritability, headache, anaphylaxis, arthritis (occurring rarely in children but in up to 26% of adults), seizures, Guillaine-Barre syndrome, rash, pneumonia, ear infections, death. The frequency of any of these reactions is not noted in the package insert; it only says “rarely.” Other sources and studies also do not list the frequency of side effects.\n\nSerious complications from the vaccine are slightly more likely than complications from measles, especially in a developed country with access to clean water, excellent nutrition, and medical care. Vitamin A supplementation is strongly correlated with reduced complications, and measles in and of itself is an acute, non-serious disease.\n\nIs mumps really a scary, terrifying illness? Most of us don’t know what mumps is really about anymore, and are so worried about the possibility of this “unknown” disease.\n\nMumps is an acute viral illness that causes swelling in the salivary glands (which leads to characteristic “chipmunk cheeks”) and possibly other areas of the body. It is spread through saliva or other bodily fluids from a person who is infected. It is less contagious than measles, about as contagious as the flu. 20% of cases are asymptomatic, and 40 – 50% are minor and similar to other respiratory illnesses. Only 30 – 40% of cases actually develop the characteristic swelling.\n\nNormal course of the disease\n\nThe incubation period after exposure is 2 – 3 weeks. Early symptoms are low fever, loss of appetite, fatigue, and headache. This progresses to swelling (often felt initially as an earache) after a few days, and symptoms resolve within a week.\n\nAbout 15% of patients may end up with meningitis (stiff neck and headache), but these cases usually resolve in a week or so without complication. Encephalitis is also possible, but occurs in only 1 in 50,000 cases.\n\nIn adult women, ovarian inflammation may occur in up to 5% of cases, but this has not been linked to infertility or any permanent damage. If a woman is pregnant and in her first trimester, there is a 25% chance of miscarriage. If she does not miscarry, there is no chance of fetal abnormality (none ever reported).\n\nIn adult/teen men, swelling of the testes occurs in up to 20%. Only 20% of these will have any sort of damage; complete sterility or permanent damage is rare.\n\nHearing loss occurs in about 1 in 20,000 cases and is usually only in one ear, but is also usually permanent.\n\nDeath is very rare, but happens occasionally (about 1 per year, or fewer than 1 in 10,000 cases worldwide; likely less in developed countries).\n\nMumps is included in the MMR vaccine. Single mumps vaccines are not currently available. Effectiveness, according to the CDC, is 77 – 91% after one dose; another study (from CDC) suggests two doses confers 88% protection. According to the WHO, effectiveness ranges from 69 – 96%.\n\nVaccination is recommended twice; once at 12 months+, and again at 4 – 6 years.\n\nMumps outbreaks have been reported in highly vaccinated community, suggesting vaccine failure is a possibility.\n\nThere is no single mumps vaccine; only the MMR. Therefore the information above for the measles/MMR is valid here too:\n\nMerck’s MMR II was responsible for most of the vaccine reactions. The package insert specifically notes that it should not be used on pregnant women, and that women who are vaccinated should not become pregnant for at least three months (the VAERS database indicates it has been used on pregnant women).\n\nThe vaccine may cause a number of different side effects (see pages 7 and 8 of the package insert, linked above, for the full list) including encephalopathy, diabetes, thyrombocytopenia, diarrhea, vomiting, irritability, headache, anaphylaxis, arthritis (occurring rarely in children but in up to 26% of adults), seizures, Guillaine-Barre syndrome, rash, pneumonia, ear infections, death. The frequency of any of these reactions is not noted in the package insert; it only says “rarely.” Other sources and studies also do not list the frequency of side effects.\n\nAdditionally, according to the WHO, low-grade fever, headache, swelling of the salivary glands, and swelling in the ears is possible (sounds just like mumps…). Meningitis has been reported anywhere from 1 in 400 to 1 in 500,000 in different studies (it seems less likely with the strain of vaccine that is used commonly in the U.S.).\n\nInterestingly, there is a lot less fear in these reports than in the measles reports. Mumps is described repeatedly by both CDC and WHO (and other minor sources) as “a mild childhood disease.” WHO even notes that controlling mumps is a much lower priority than either measles or rubella. (The entire attitude is interesting — a total lack of scary statistics; a very brief look at the illness with the attitude like “do whatever you want” because they know that mumps is simply not that serious.) Serious complications from mumps are incredibly rare — so rare that there are not even really statistics on them. Given the risk of the MMR vaccine, it doesn’t seem worth it compared to the risk of mumps (negligible).\n\nGerman measles, as it’s called…but is it really as “bad” as measles? Some have heard it is mostly only dangerous to pregnant women. Let’s see what it’s all about.\n\nRubella is a very mild viral illness that, at least in children, is often not very apparent. The concern is mostly for pregnant women, whose babies may get congenital rubella syndrome if they are exposed at a certain point in pregnancy.\n\nNormal course of the disease\n\nIt consists of low-grade fever and general tiredness, followed by a mild red rash that starts at the face and works its way down. It lasts only for a few days, and then it’s gone. In some cases, the eyes will be infected (like pink eye), although this is more common in adults.\n\nIn adults, arthritis usually accompanies it (this is temporary).\n\nThe most important complication is congenital rubella syndrome, or CRS. This affects between 1 in 10,000 to 1 250 babies, depending on whether or not rubella is epidemic (this is without vaccination). CRS can lead to miscarriage, deafness, heart defects, blindness, facial deformities. Children are also at risk for developmental delays, including learning disabilities and autism.\n\nRubella can also lead to encephalitis (1 in 10,000; up to 1 in 6000 worldwide), deafness (1 in 6,667), and mental retardation (1 in 1,000,000).\n\nThis vaccine is made with the use of human diploid cells, i.e. aborted fetal tissue. The vaccine is supposed to confer 95 – 100% protection after one dose (given around 12 months).\n\nThe vaccine has a long list of side effects, including: diabetes, fever, fainting, fatigue, diarrhea, vomiting, nausea, headache, dizziness, encephalitis, Guillain-Barre, seizures, ear infections, and more.\n\nMyalgia (muscle pain), swelling of the lymph nodes, irritability, headache, low fever, and tingling of the skin are commonly reported.\n\nA few studies have been conducted that showed a potential link between the MMR and autism (see point #7). It bears further research, which is not currently being done.\n\nRubella in children is an incredibly mild illness with almost no risk of complications. If vaccination is considered, it should be chosen for adult women who may become pregnant and are not naturally immune to rubella. This is the only vulnerable population.\n\nWhew, that was a lot to work through! I hope it was all helpful to you. I tried to break down the numbers as much as I could so that we were working with apples to apples (1 in xxxx vs. 1 in xxx, rather than 1 in xxxx vs. 5 in xxxx). It was a bit tricky because a lot of vaccine data didn’t mention the frequency of side effects, nor provide links to the data from which they drew their information. The VAERS database continues to be a good source of information on how frequently vaccine reactions are occurring in the population, keeping in mind that there is a lot of underreporting.\n\nIf you have any questions, please feel free to let me know!\n\nAre you worried about measles, mumps, rubella and the MMR vaccine? Did you or do you plan to get the MMR?\n\n**This post has been entered in Monday Mania.**", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://modernalternativemama.com/blog/2012/02/15/10-bad-reasons-not-to-vaccinate/", "https://modernalternativemama.com/blog/2012/02/22/why-science-should-be-carefully-evaluated/", "https://modernalternativemama.com/blog/2012/02/29/what-is-herd-immunity-all-about/", "https://modernalternativemama.com/blog/2012/03/07/how-the-immune-system-works/", "https://modernalternativemama.com/blog/2012/03/14/ingredients-in-vaccines/", "https://modernalternativemama.com/blog/2012/03/21/ingredients-in-vaccines-part-2/", "http://www.cdc.gov/vaccines/pubs/pinkbook/meas.html", "http://thinktwice.com/measles.htm", "http://www.who.int/wer/2009/wer8435.pdf", "http://www.who.int/wer/2009/wer8435.pdf", "http://www.who.int/wer/2009/wer8435.pdf", "http://www.worldhealth.net/news/bromelain_pineapple_enzyme/", "http://stason.org/TULARC/child-parent/vaccinations/3c-4-How-long-does-the-measles-vaccine-last.html", "http://www.who.int/wer/2009/wer8435.pdf", "http://web.archive.org/web/20130814134632/http://wonder.cdc.gov:80/controller/datarequest/D8", "http://web.archive.org/web/20121108042012/http://wonder.cdc.gov/controller/datarequest/D8;jsessionid=04118A268A5CCA542482546D2E53BA43", "http://www.merck.com/product/usa/pi_circulars/m/mmr_ii/mmr_ii_pi.pdf", "http://www.cdc.gov/vaccines/pubs/pinkbook/mumps.html", "http://www.who.int/immunization/wer8207mumps_Feb07_position_paper.pdf", "http://www.who.int/immunization/wer8207mumps_Feb07_position_paper.pdf", "http://www.who.int/immunization/wer8207mumps_Feb07_position_paper.pdf", "http://www.cdc.gov/vaccines/pubs/pinkbook/mumps.html", "http://www.who.int/immunization/wer8207mumps_Feb07_position_paper.pdf", "http://www.who.int/immunization/wer8207mumps_Feb07_position_paper.pdf", "http://www.who.int/immunization/wer8207mumps_Feb07_position_paper.pdf", "http://www.who.int/wer/2011/wer8629.pdf", "http://www.who.int/wer/2011/wer8629.pdf", "http://www.drugs.com/sfx/m-m-r-ii-vaccine-side-effects.html", "http://www.who.int/wer/2011/wer8629.pdf", "http://fourteenstudies.org/ourstudies.html", "http://www.thehealthyhomeeconomist.com/monday-mania-422012/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+TheHealthyHomeEconomist+%28The+Healthy+Home+Economist%29"], "authors": [], "publish_date": null}