{"result_id": "204008", "URL": "https://modernalternativemama.com/2012/02/22/why-science-should-be-carefully-evaluated/", "timestamp": "2023-04-25 16:22:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2012/02/22/why-science-should-be-carefully-evaluated/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "Why Science Should Be Carefully Evaluated", "cleaned_text": "Welcome to my series on vaccines! This is the third post in the series. If you haven’t yet, go back and read Let’s Get Serious and Bad Reasons Not to Vaccinate.\n\nWhy Science Should Be Carefully Evaluated\n\nBefore we go any further, it’s important that we talk about science. What it means, how it’s done, and why we ought to be cautious. Finding evidence in a peer-reviewed medical journal is not a guarantee that the information is accurate and valid. (And neither is information from alternative sources, either — we need to be skeptical across the board.)\n\nMany of us already in the “anti-vax” camp have heard of so many poorly done studies and so many financial ties and other issues that we already don’t trust any study that comes out. We pick it apart and dismiss medical science as a whole — or at least most of it. This isn’t helpful right now. Instead, we need to evaluate studies individually to see if they have merit, without bias. We need to look at how and why science is done, so that we can clearly evaluate which studies should be trusted and why.\n\nDo not ever trust a source that states a fact without being able to back up that fact. It does not matter if the source is www.quackmedicine.com or www.cdc.gov. Really. (I don’t have any idea if that first site exists, I’m just making stuff up.)\n\nFor example, if an alternative site says “Up to 50% of people are damaged by their vaccines!” but does not cite any study or other proof, do not believe them.\n\nIf the WHO says, “We think that immunity occurs in 99% of people and lasts a lifetime,” and they don’t cite any study or source, do not believe them either. This is a common tactic on official “fact sheets,” citing statistics without any studies to back them up. These are accepted by the community at large as facts because it is coming from an official source. But it makes no difference if they don’t have any research to prove it.\n\nBottom line: disregard any statistic that cannot be traced back to a reliable study.\n\nThere are a number of different types of studies. The “gold standard” in science is the double-blind, placebo controlled study. If such a study were conducted on vaccines, it would look like this:\n\nTwo large groups of people would go in to “get vaccinated.” (A few thousand, at least.) Approximately half would be offered the actual vaccine, and half would be offered saline solution. Neither the scientists nor the participants would have any idea who got what. They would be tracked for at least six months to note if there were any immediate or delayed reactions that definitely or potentially were attributed to the vaccine. Rates of diseases in both groups would also be tested, as would antibodies/titres to the specific illness in question. This would allow researchers to know how effective each vaccines was, what the side effects really looked like, and do a cost/benefit analysis of the vaccine.\n\nNo such study of vaccines exists, however. (Think about that for a moment.)\n\nOther types of studies include case studies, blind studies (where scientists know who gets what but participants don’t), and studies that are not placebo-controlled. The vast majority of vaccine safety studies are tested like this:\n\nA group of a few hundred people take the vaccine — sometimes there is a small “placebo” group, but they are often given a previously licensed version, and this is what is compared — and they are followed for 2 – 6 weeks to look for any reactions.\n\nNot all studies are conducted this way. But it’s important to know how they are conducted. Here are some questions to ask about each study you come across (and which I’ll be asking as I continue to research):\n• What was the sample size of the group? (Larger is better)\n• How long was the group followed? (Longer is better)\n• Was the experiment double-blind, blind, or did everyone know what they were getting? (Double-blind is best)\n• Was the experiment placebo-controlled? (ideally, yes)\n• If so, what was the placebo? (Sometimes placebos can in and of themselves cause reactions in the body)\n• What was the study’s main question? Was it worded in such a way that it could bias the results?\n• Were the sample groups equal in number? Or was one or more group(s) significantly larger or smaller? (Affects the statistical significance of the results)\n• How were the test subjects selected? What was the criteria? Is this representative of the population that will eventually use this drug/vaccine?\n• Was any data excluded from the final data set? Why? (Sometimes unusually severe reactions are excluded as anomalies, and later found to be related to the drug/vaccine once it’s tested on a much larger group — often, the public.)\n• Do the conclusions match the actual results? (Sometimes they actually don’t, so read the original text of the study)\n• If a true placebo was used, was the actual drug/vaccine statistically significantly more effective than the placebo?\n• Are there other published studies that back up this study’s results? Are there other studies that contradict this study’s results? How valid are these studies, by the measures above?\n\nWhen examining these questions, it’s easy to see there are many ways that a study could be poorly designed — and thus, not a good measure of safety or efficacy for anything.\n\nA study which has a small number of total participants, a very small number who receive a placebo, no true placebo, is not a double-blind study, selects only the healthiest and most robust test subjects, excludes severe reactions because of “coincidence” and whose conclusion is a bit more optimistic than study data would suggest is not a valid study. Obviously this example is where just about everything is done wrong, and that’s not usually the case.\n\nIt’s important to examine each study, though, to see how valid it really is. A study that is poorly done is not evidence, even if it passes the peer-review process and is published.\n\nSometimes, surveys are done as studies. These are usually simple sets of questions that researchers ask parents — like, “Did your receive this vaccine? Did s/he have a reaction to it?”\n\nThese are actually great for preliminary research. They can raise red flags in areas and point to where researchers should begin looking more deeply. If several parents are reporting a reaction to a particular vaccine, especially if those reactions are similar in nature, then this would bear more serious, well-designed research.\n\nThis type of research can also note general trends. A large survey-study was done recently comparing the health of vaccinated and unvaccinated children. The overall trends showed that unvaccinated children tended to have lower rates of asthma, autism, allergies, ADHD, etc. It bears further research, but is very interesting to note.\n\nOf course, there are several problems with this type of research too:\n• Parental recall isn’t perfect, and important information may be missed, or possibly exaggerated (not necessarily on purpose)\n• Study questions can be designed poorly in order to get a particular response\n• Sample sizes are often small, due to low response rate\n• Controlling for variables is difficult to impossible (diet, income, ethnicity, etc.)\n\nResearch like this can’t be relied on as “the” answer to anything. It should, however, be used in its proper context: to note trends to know what to study more thoroughly.\n\nI would be remiss not to mention this issue. Most studies on vaccines are conducted by the pharmaceutical companies. It’s simply the nature of the business — they have paid the researchers to develop these drugs, and they pay to have the testing done. It is a required step of approval, it’s done frequently on a number of different potential products, and it doesn’t make financial sense to have trials conducted by independent labs. Thus, pharmaceutical companies fund their own research.\n\nWhile this is financially practical, it can and does lead to corruption in certain studies.\n\nWhen looking at any study, it’s important to ask the following:\n• Who paid for this study?\n• Who authored this study? Was this person the actual researcher, or a ghost writer?\n• Does this study’s results differ strongly from studies funded differently? (This happens)\n\nThere have been cases where research was poorly conducted by a ghost writer, and a “major” researcher’s name was slapped on the study. Make sure this is not the case.\n\nThere have also been cases where certain researchers specifically fudged the numbers to make things look better than they were, and eventually became notorious for doing so. Were any of these researchers involved in the current study?\n\nBottom line, science is done by people. People make mistakes. People can design studies poorly (even by accident). They can mix up results. They can interpret results a bit too “hopefully.” People are biased.\n\nResearchers generally believe, in their hearts, that medical interventions are good and save lives — which they can, if properly used. But researchers can become blinded by all of the different interventions surrounding them and become too “adjusted” to their use, and recommend them too frequently. They can overlook side effects too easily because they earnestly believe in the benefits.\n\nThe same is true, of course, of anything in natural health. People can believe that “if it’s natural, it’s safe,” and use any product in any dose at any time (and this is not safe). They can get caught up in always refusing conventional treatment because they are so into all things “natural.”\n\nIt is so important to remember this happens on both sides, and so to take the advice of any single source lightly. The important thing to notice is trends that show up over time, from a variety of sources.\n\nIt’s also important to note that people have individual body chemistry, and that even if something appeared to help some, it may not help you. People are not carbon copies. They are unique individuals with unique needs, and “one size” does not fit all.\n\nFinally, avoid those who are spouting dogma on either side. Those who believe that vaccines always are beneficial are as bad as those who say anyone who chooses a vaccine is crazy. Those “science lovers” who call the rest of the world “science deniers” have made science into their own religion, and it’s not healthy. Science is imperfect and inexact because that is the nature of people and the world at large. When scientists believe in science above all else — it is religion. Science should be done, but should be interpreted and evaluated with a little common sense.\n\nIn general, if someone refuses to believe that vaccines are a decision to weigh carefully, and that you are intelligent enough to do your own research — ignore.\n\nDo you think science should be carefully evaluated?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://modernalternativemama.com/blog/2012/02/08/the-vaccine-debate-lets-get-serious/", "https://modernalternativemama.com/blog/2012/02/15/10-bad-reasons-not-to-vaccinate/"], "authors": [], "publish_date": null}