{"result_id": "204038", "URL": "https://modernalternativemama.com/2014/10/03/safer-vaccines-illnesses/", "timestamp": "2023-04-25 16:22:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2014/10/03/safer-vaccines-illnesses/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "Which Is Safer: Vaccines or Illnesses?", "cleaned_text": "After my recent post, “15 Things We Need to Stop Saying in the Vaccine Debate,” there was a respectful response written by Erich of Grounded Parents, entitled “11 Things I’m Going to Keep Saying in the Vaccine Debate…and 4 We Shouldn’t.”\n\nErich agrees that it should be a parents’ choice and that we should have a respectful discussion. He does believe that the science is in favor of vaccination and challenged me to reply and defend my position. My original article wasn’t sourced (although I have a whole bunch that are right here), so I agree — we need some science here. And given that it’s Vaccine Injury Awareness Month, this seems like a good time to respond.\n\nWell, Erich, I’m always up for respectful debate. And I appreciate your stance on parental rights and freedom.\n\nI would like to ask one thing (and I haven’t seen you do this, nor do I think you would, based on your article): no personal stories. That means no scary tales about children dying of pertussis, nor of children dying of DTaP. That’s not evidence (as I’m sure you know). It’s frustrating to me to share studies and have ill-informed vaccine advocates come back with “But this baby died of pertussis because of people like you!” Sigh. Like I said, I don’t think that’s your style, but I’m going to say it for everyone who’s reading, too.\n\nSo let’s have a conversation about this.\n\nThe Crux of the Matter\n\nWhen I first read the piece, I considered responding point by point. But the more I thought about it, the more I realized that we need to just jump to the heart of the matter.\n\nThe argument that people ought to vaccinate — whether you believe in convincing them via education, or forcing them via government — is predicated on the idea that vaccination is orders of magnitude safer than potential complications of a disease.\n\nSo, we’ll look at it this way: getting a vaccine, or getting a disease. (For now, we’ll ignore that at the present moment, children are unlikely to get most of these diseases. That’s not relevant, and it might not be true if we stopped vaccinating.)\n\nWhat we need to examine now is three main things:\n• How dangerous are these diseases — really?\n• How dangerous are these vaccines — really?\n• Are there any benefits to any of the diseases?\n\nWe’ll assume there is benefit to vaccines automatically. The other three questions need to be answered, though, more thoroughly than they have been.\n\nYou see, Erich, based on present, obvious scientific data (that is, data that directly relates to childhood vaccinations), I agree — vaccines appear to be far safer than the diseases. However, I do not believe that the scientific evidence we currently have is adequate. I’m going to point to some related research that calls into question what we believe about vaccine safety, and note some areas of research that we ought to be looking into.\n\nIt really comes down to this: do you believe the direct research about vaccines? Or do you look at the related research and wonder if there’s more to the story?\n\nHow Dangerous Are These Diseases, Really?\n\nThe statistics on how dangerous these diseases are vary widely depending on where you read them. We can’t possibly discuss all of the diseases here, so let’s use measles, one of the few we’re most commonly seeing now, as our example. We’ll similarly use the MMR as our comparison vaccine.\n\nLooking at the CDC’s fact sheet on measles complications, we see that:\n\nI think that point is kind of fear-mongering, Erich, how about you? I’m not surprised that ear infections can occur in 10% of cases, but we both know that the vast majority of ear infections won’t result in permanent hearing loss. But that isn’t made clear here. Parents are left believing that hearing loss is likely.\n\nThe same fact sheet also notes that pneumonia can occur (they bury the frequency — 5% — in the following paragraph, but they do state it’s a common cause of death — more fearmongering), and diarrhea occurs in 8% of cases. Encephalitis is said to occur in “about” 1 in 1000 cases. And death is supposed to occur in 1 – 2 out of 1000 people who catch the measles.\n\nThis is followed by this paragraph:\n\nCan we just agree, Erich, that outcomes in a first-world country and outcomes in a third-world country are not the same? We have the data to show that. Heck, this CDC page shows that. In a developed country, we should expect to see 1 – 2 deaths in 1000; in a third-world country we might see as many as 1 in 4. Those are vastly different numbers. Many people try to argue that we ought to vaccinate in the U.S. because of the scary outcomes in Africa, but this is comparing apples to oranges. This paragraph actually doesn’t even belong in this CDC report, in my opinion, because it skews the “scariness” of the disease for U.S. parents. From here on out, I’m going to ignore “global data” because it makes this argument messier.\n\nLet’s take a look at the CDC’s Pink Book instead. For those unfamiliar, it’s a manual meant for health professionals, not the public, and it tends to present more factual and less emotional information.\n\nFirst, I note that the Pink Book states that measles is contagious starting with the prodromal phase, but not before. In the prodromal phase, people will experience fever and cough. The rash onsets 2 -4 days later. This is actually a key point, because one of the arguments for universal vaccination is that people can spread illnesses before they know they’re contagious. In this case, that’s unlikely. People who have fevers and flu-like symptoms are probably not going to be out and about — or at least, they shouldn’t be. (Which goes back to people needing to stay home when they’re sick. Period. That protects others without risk to you.)\n\nIn the Pink Book, we learn that the complication rates are based on cases that occurred between 1985 and 1992. There were several measles outbreaks in those years (surprise! It’s not all recently occurring because of “anti-vaxxers”), but I’m not sure that’s very accurate data. What we’ve seen with other statistics is that the people who are likely to get measles are the people who are already more susceptible to illness (those who can’t be vaccinated, for example) and so they’re more likely to suffer from complications than a general population group would be.\n\nLet’s take a look at the complication rates in the 2010 – 2011 European outbreak. There were about 30,000 cases each year in Europe, so this is a good sample size. It’s also recent data. There were 27 cases of encephalitis in 2011, which is roughly consistent with the CDC’s 1 in 1000 figure. There were 8 deaths, which is far below the CDC’s figure of 2 in 1000. The European data shows roughly 1 in 3000 death rate.\n\nSo, we can assume that 2 in 1000 is probably the highest death rate that we’d see in any large-scale outbreak — but it’s not the average. Understanding that changes the risk profile somewhat.\n\nBut there’s more. We can assume that not all cases of measles are going to be reported. And the ones that are reported are likely to be the more serious ones (the ones needing medical attention). Measles, being less common now, is more likely to be reported than it used to be. But back in the 1950s, there were an average of 4 million cases a year, but only around 540,000 were actually reported. That’s only about 12.5% of the total cases.\n\nWe’ll assume that the percent of cases that are reported is much higher now. Let’s suppose it’s 70% (although we have no real way of knowing). So, if there were 30,000 reported cases in Europe and that’s about 70% of the actual total, then there may have been around 43,000 total cases. There were 8 deaths, which is then 0.00019% likelihood — or about 1 in 5000.\n\nBut as I said — we don’t know. All we know is that it’s likely that not all cases are reported, and that the ones that are reported are more likely to be serious. We also don’t know how many people may have been exposed and not come down with the measles (suggesting immunity — whether natural or vaccine-induced). This study suggests that about 90% of people will get the measles if exposed, but not all.\n\nErich, I think you’d agree that this changes the risk picture of the disease quite sharply. If we’re looking at a small outbreak in a susceptible and medically fragile population, we might see the level of risk that the CDC reports. In a larger outbreak in a general population, though, the actual risk is much lower. 2 in 1000 death rate vs. 1 in 5000 death rate is extremely different.\n\nI wish that we had more information in this area so that we could be more sure of the actual risk. We can’t be, though. But there’s clearly data to suggest that the risk isn’t as high as we’ve been led to believe.\n\nHow Dangerous Are These Vaccines, Really?\n\nDespite all this risk business surrounding measles, none of that would matter if the vaccine was extremely safe. I mean, even if our children are only risking a 1 in 5000 chance of death — supposing they catch measles in the first place — why would we allow that, if there were another way?\n\nBut we know that vaccines aren’t without risks. What we need to understand is, how serious are those risks?\n\nWe know — everyone acknowledges — that vaccines commonly produce minor side effects, like low fevers, redness or swelling at the injection site, and possibly some pain or sleepiness. For most, this wears off in a day or two. This isn’t really a concern, any more than an uncomplicated case of measles is a concern. Temporary discomfort is not what we’re really worried about here (are you with me on that, Erich?).\n\nLet’s pull up the package insert for the MMR to get a feel for the complications and frequency that they list.\n\nFor most reactions, the insert doesn’t list frequency. It only lists potential adverse reactions. It does note that arthralgia (joint point) occurs is 0 – 3% of children, and 12 – 26% of adults (I think adults might think more carefully about receiving this vaccine!).\n\nSome of the adverse events listed include:\n\nThis is not an exhaustive list and you should know that I chose the more serious reactions to include, for the most part. (Primarily because no one is surprised by a minor ear infections, redness, swelling, or other minor side effects.) No frequencies are listed but we would expect that the more serious the adverse event, the less frequently it would occur. It is estimated on this package insert that atypical measles will occur in 6 – 22 out of 1 million vaccinated individuals.\n\nLet’s keep looking to see if we can find better data on how frequently serious side effects actually occur. Next, we’ll turn to VAERS, the Vaccine Adverse Event Reporting System. They keep a database of adverse events that are reported to occur after vaccination. These are not independently verified or studied and cannot be proven to be linked to the vaccine, but are reported because they usually occur shortly after vaccination and are likely linked.\n\nSomething we need to note very quickly:\n\nVAERS admits that most vaccine reactions are not reported. Serious reactions are reported more frequently than minor reactions. But we don’t know what percentage of serious reactions are actually reported.\n\nAccording to the VAERS database, there were 54 serious reactions from the MMR in 2013. That includes death, permanent disability, and life threatening. (It doesn’t include hospitalization or emergency room visits.) The CDC says that about 10 million doses are given per year.\n\nLet’s assume that half of all serious reactions are reported (I’ll talk more about that in a minute). So that’s 108 serious reactions out of 10 million doses, or about 1 in a million very serious reactions (death or permanent disability). This is probably why most people claim it is a “one in a million” chance, but as you’ll see in a minute, Erich, this isn’t really so accurate.\n\nIf we extend the VAERS data to include any reaction that requires an emergency room visit or hospitalization, then we come up with a number of 908 adverse events (this still does not include adverse reactions classified as non-serious). If we assume that, say, 30% of those were reported, then we can estimate about 2700 “serious” reactions. That is or about 2.7 out of 10,000.\n\nThis is all assuming we have accurate numbers on vaccine reactions, which most sources say we don’t. The CDC itself says that underreporting is an important issue, and they don’t even begin to guess how bad the problem is.\n\nIf we take a look at the so-called “Vaccine Court,” a special system that allows parents to bring their case before U.S. judges to see if they can get compensated, there are 64 cases that have actually been heard and ruled on so far in 2014 (I don’t know how many were related to the MMR specifically). We also see that, in 2013, there were almost 1000 cases brought, over 600 of which were dismissed. In 2012, it was almost 2700 cases brought, and fewer than 300 were compensated!\n\nWe can probably assume that most of the cases brought were caused by vaccines, or at least correlated with them — what parent would go through the hassle of this legal process if they weren’t sure that their child’s issue was caused by a vaccine? And we can assume that these are more serious reactions, too, because if they were minor, parents wouldn’t be seeking compensation.\n\nWe can also assume that probably only a fraction of parents who believe their child was injured by a vaccine ever go through this process. I’ve talked to many families who say their child was vaccine-injured who never even considered this, because of the time and upheaval involved in doing so. Let’s say 10% of families ever go through this process — if that’s true, assuming an average of 1000 court cases per year, then perhaps 10,000 children are seriously injured by vaccines per year. (Remember that these numbers are based on all vaccines, not just the MMR.)\n\nI know we’re wading into shaky waters here. Talking to families? Assumptions of percentages of underreporting? Correlation doesn’t equal causation?\n\nWe just don’t have better data than this, unfortunately.\n\nI believe that a lot of children are vaccine-injured and it’s been dismissed. There are all kinds of cases out there of babies who received vaccines and died within 12 hours, and whose death was ruled as SIDS. There are stories of parents whose children are screaming in a high-pitched manner and banging their heads into the walls (indicative of encephalitis) but when they call the doctor, they’re told it’s “normal.” But it isn’t.\n\nLet’s just suppose that 3000 children per year are injured by the MMR (1/3 of the 10,000 number of children injured by all vaccines, and slightly more than the 2700 number that was true if 30% of serious events were reported to VAERS). That seems reasonable, doesn’t it, Erich? Based on the information that we have? That’s 3 out 10,000. That’s as high as the estimate of measles deaths. Really, slightly higher.\n\nThis muddies the waters a lot, Erich. It seems that vaccines and measles are about equally safe, although measles might have a slight edge. Plus, we don’t actually have good statistics on vaccine injuries — we truly, honestly do not, which is incredibly sad for the families afflicted by vaccine injuries — so it might even be a worse picture than this.\n\nWe also need to consider that we’re not arguing here for stopping vaccination all together, we’re only arguing for choice. It’s possible that if we stopped vaccinating children who were at specific risk of vaccine injury, we would see the safety profile of the vaccine go up. And, since a lot of people will continue to vaccinate regardless, we still have to think about those thousands of children who are dying or being permanently disabled by vaccines each year. Is that acceptable, so that a handful might not die of measles? I don’t think it is. (Which is why it needs to be a personal choice.) The parents who want to protect their children through vaccination should; and the parents who want to opt out, should — and there’s clearly data showing that either choice is viable.\n\nThat’s what I have right now. I wish we had better statistics. I wish we knew for sure about the overall health outcomes of vaccinated vs. unvaccinated. I wish a lot of things. But mostly I wish parents on the fence had access to all of this information, and the right to make the choice they feel is best without any harassment.\n\nHow do you feel about vaccines vs. illness? Which worries you more?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://modernalternativemama.com/wp-content/uploads/2014/10/vaccines-or-illnesses.jpg", "https://modernalternativemama.com/blog/2014/09/02/15-things-need-stop-saying-vaccine-debate/", "http://groundedparents.com/2014/09/10/11-things-vaccine-debate/", "https://modernalternativemama.com/vaccine-posts/", "http://www.cdc.gov/measles/about/complications.html", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/meas.pdf", "http://ecdc.europa.eu/en/publications/publications/sur_emmo_european-monthly-measles-monitoring-february-2012.pdf", "http://jid.oxfordjournals.org/content/189/Supplement_1/S1.full", "http://jid.oxfordjournals.org/content/189/Supplement_1/S1.full", "http://www.merck.com/product/usa/pi_circulars/m/mmr_ii/mmr_ii_pi.pdf", "http://www.cdc.gov/vaccines/vac-gen/shortages/mmr-faq-12-17-08.htm", "http://www.hrsa.gov/vaccinecompensation/statisticsreports.html"], "authors": [], "publish_date": null}