{"result_id": "204033", "URL": "https://modernalternativemama.com/2012/03/14/ingredients-in-vaccines/", "timestamp": "2023-04-25 16:22:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2012/03/14/ingredients-in-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "Ingredients in Vaccines, Part 1", "cleaned_text": "This is the sixth post in my series on vaccines. You may have missed Getting Serious, 10 Bad Reasons Not to Vaccinate, Why “Science” Should Be Carefully Evaluated, What is Herd Immunity All About, or How the Immune System Works.\n\nNow, it’s actually time to talk about vaccines. Imagine that. It took six posts for me to actually address vaccines directly! Before we look at any vaccine specifically, though, we’re going to talk about the ingredients that are common to many or all of them.\n\nI find it amusing because I hear this story a lot from parents who don’t vaccinate: “I went to the doctor’s office and he was pressuring me to vaccinate. I said no and listed some of the ingredients in vaccines as to why I wouldn’t. He scoffed at me and said that those things are not in vaccines. I asked to see the package inserts, which he had to search around for (they were not readily available), and when we checked — I was right.”\n\nThis just goes to show that what’s in vaccines is not necessarily common knowledge…even, in some cases, for those who should know. (Yes, I know that some doctors are well-informed and cautious — but not all. Always ask.)\n\nLet’s take a look at some of the ingredients that are found in vaccines, which vaccines they’re in, and why they’re there. You can find the original chart here.\n\nThis ingredient is used as a growth medium and is found in flu vaccine and rabies vaccine.\n\nThis ingredient is a growth medium and is found in measles, MMR, mumps, rubella, rabies, MMRV. Human albumin is a blood product which transports hormones, fatty acids, and other compounds. There are occasionally recalls of potentially contaminated products.\n\nThis ingredient is a growth medium and is found in Hepatitis A, MMR, MMRV, measles, mumps, rotavirus, rubella, vaccinia, varicella. This is a bovine blood product and in rare cases could be contaminated with bovine spongiform encephalopathy (“mad cow”) though no reports of this condition resulting from vaccines exists.\n\nThis ingredient is a heavy metal that is used as an adjuvant (a substance to boost the vaccine’s efficacy and cause a greater immune response). It is found in anthrax, DTaP, DTaP-Hep B-IPV, Td, Hep A, Hep A – Hep B, Hep B, Tdap.\n\nThis ingredient is a heavy metal that is used as an adjuvant (a substance to boost the vaccine’s efficacy and cause a greater immune response). It is found in Hib, Hib-Hep B, Hep A, Hep B, HPV.\n\nThis ingredient is a heavy metal that is used as an adjuvant (a substance to boost the vaccine’s efficacy and cause a greater immune response). It is found in DTaP, Hep A – Hep B, Pneumococcal, rabies, Td, Tdap.\n\nThis ingredient is a heavy metal that is used as an adjuvant (a substance to boost the vaccine’s efficacy and cause a greater immune response). It is found in DTaP, DTaP-Hib, DT.\n\nAluminum may not be cleared efficiently from the body of premature babies or those with fragile or underdeveloped immune systems and have been implicated in contributing to and possibly causing neurological disorders. The aluminum load of the recommended shot series is between 295 and 1225 mcg at once. The CDC currently recommends that fragile individuals not receive more than 25 mcg of injected aluminum at once. Injected aluminum is not the same as that which is consumed from food; about 1% of consumed aluminum will make it to the bloodstream, vs. all of the injected aluminum. Aluminum is not needed by the body, and some research shows that exposure may result in learning disabilities and other cognitive effects. It may also impact mitochondrial functions (remember the Hannah Poling case?).\n\nThis ingredient is a component of the growth medium (amino acids are the building blocks of proteins) and is found in anthrax, Hep A – Hep B, Hep A, rotavirus, Td and typhoid.\n\nThis ingredient is used for protein fractionation (creating amino acids from proteins), and is in Hib and DTaP-Hib. It is also used as a soil fertilizer in conventional agriculture.\n\nThis ingredient is an antibacterial agent, and it is found in rabies vaccine. It is an extremely potent anti-fungal drug that comes with many warnings and can cause cardiac arrest and death.\n\nThis ingredient is an antioxidant (vitamin C) and is found in typhoid oral vaccine.\n\nThis is an ingredient in the growth medium, and it is found in the flu vaccine. It has estrogenic activities especially in the presence of yeast.\n\nThis is a viral inactivator and it’s found in the flu shot and rabies vaccine. It is a highly toxic chemical that has been shown to cause cancer of the liver, stomach and skin in animals, and anyone coming into contact with it internally needs immediate medical attention.\n\nThis is a preservative and it’s found in the anthrax vaccine. It is an anti-microbial agent that is used in several types of topical medications.\n\nThis is an antacid, found in rotavirus vaccine.\n\nThis is a nutrient for the growth medium, and is found in the rotavirus vaccine.\n\nThis is an antibacterial agent, and it’s found in vaccinia and rabies vaccines. It’s an antibiotic in the tetracycline family and is commonly used in veterinary medicine.\n\nThis is a nutrient for the growth medium, and it’s found in rotavirus.\n\nThis is a nutrient for the growth medium, and it’s found in rotavirus.\n\nThis is considered “manufacturing residue,” and it’s found in Hep A.\n\nThis is a growth medium, and it’s used in rotavirus vaccine. It comes in a variety of formulations which may contain high glucose to no glucose, phenol red coloring or not, L-glutamine or not, and other variations.\n\nThis is a preservative, and it’s found in rabies and varicella (chicken pox) vaccines. This compound binds with metals, especially zinc, and may result in deficiency.\n\nThis is a residue (from growth medium) and is found in flu vaccine and yellow fever vaccine. It’s a problem for allergic individuals.\n\nThis is a nutrient for the growth medium and is found in rotavirus vaccine.\n\nThis is an antimicrobial, toxin inactivator and stabilizer. It is in anthrax, DTaP, DTaP-Hib-IPV, DTaP-Hib, Td, DT, Hep A, Hep A-Hep B, Hib, Hib-Hep B, flu, IPV, Tdap. It is a known carcinogen (causes cancer), and has been linked to nasal cancer and leukemia, among others.\n\nThis is used as a stabilizer in freeze-drying and a solvent. It is in DTaP, DTaP-Hib, Hep B, HPV, measles, mumps, rubella, MMR, MMRV, rabies, typhoid oral, varicella (chicken pox), zoster (shingles), yellow fever.\n\nThis is an antibacterial agent that is found in flu vaccine. May cause damage to kidneys or nerves.\n\nThis is a nutrient for growth medium, used in the rotavirus vaccine.\n\nThis is a nutrient for growth medium, used in the rotavirus vaccine.\n\nThis is a “toxin detoxifier” and is found in DTaP, DTaP-Hib-IPV, and Tdap. It is a chemical with many uses, and has been linked to allergic dermatitis, nasal congestion, allergies, and asthma.\n\nThis is a protein stabilizer and is found in DT and Td vaccines. It is an amino acid.\n\nThis is a stabilizer found in the HPV vaccine. It is an amino acid.\n\nThis is used to adjust the pH balance of vaccines. It is found in DTaP and DT. It is highly corrosive, but also naturally occurring in the body.\n\nThis is used in the growth medium, and it’s found in the flu vaccine. Long term use or large doses has been associated with hyperglycemia and Cushing’s syndrome.\n\nThis is a stabilizer in freeze-drying and a filling ingredient. It’s found in Hib, meningoccoccal, and typhoid oral.\n\nThis is a lubricant for capsule filling, and it’s found in the typhoid oral vaccine.\n\nThis is a nutrient in the growth medium, and is found in the rotavirus vaccine.\n\nThis is a stabilizer, and it’s used in flu vaccine, MMRV, varicella (chicken pox) and zoster (shingles). MSG is a neurotoxin, known to cause brain damage and endocrine disorders.\n\nThis is a manufacturing residue, and it’s found in Hep A, Hep A – Hep B, MMRV, rabies, IPV and varicella. This is lung tissue from an aborted fetus (14-week fetus aborted in 1966), used as a way to culture the vaccines.\n\nThis is an antibacterial agent, and it’s found in DTaP-IPV-Hep B, Hep A-Hep B, flu, measles, mumps, rubella, MMR, MMRV, IPV, rabies, varicella, zoster. It is a broad spectrum antibiotic that can cause kidney or nerve damage.\n\n…and that’s only half of the ingredients in vaccines!\n\nNext week we’ll address the other half. For now, click some of those links and read a little more about what’s in vaccines (and see if it maybe makes sense why injecting some of these chemicals in tiny babies might have something to do with the current epidemic of diseases, especially in fragile individuals).\n\nWere you surprised by any of the ingredients in vaccines?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://modernalternativemama.com/blog/2012/02/08/the-vaccine-debate-lets-get-serious/", "https://modernalternativemama.com/blog/2012/02/15/10-bad-reasons-not-to-vaccinate/", "https://modernalternativemama.com/blog/2012/02/22/why-science-should-be-carefully-evaluated/", "https://modernalternativemama.com/blog/2012/02/29/what-is-herd-immunity-all-about/", "https://modernalternativemama.com/blog/2012/03/07/how-the-immune-system-works/", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-1.pdf", "http://en.wikipedia.org/wiki/Human_serum_albumin", "http://www.fda.gov/BiologicsBloodVaccines/SafetyAvailability/Recalls/ucm071404.htm", "http://www.vaccinetruth.org/bovine_serum.htm", "http://www.novaccine.com/vaccine-ingredients/results.asp?sc=91", "http://www.cdc.gov/vaccines/vac-gen/additives.htm", "http://www.ncbi.nlm.nih.gov/pubmed/19568732", "http://www.blisstree.com/2008/03/06/mental-health-well-being/the-case-of-hannah-poling/", "http://en.wikipedia.org/wiki/Ammonium_sulfate", "http://www.drugs.com/pro/amphotericin-b.html", "http://www.bdbiosciences.com/documents/Bacto_Peptone.pdf", "http://www.cdc.gov/niosh/npg/npgd0528.html", "http://en.wikipedia.org/wiki/Benzethonium_chloride", "http://www.invitrogen.com/site/us/en/home/Products-and-Services/Applications/Cell-Culture/Mammalian-Cell-Culture/Classical_Media/dmem.html", "http://www.epa.gov/opprd001/inerts/edta.pdf", "http://www.drugs.com/mtm/gentamicin.html", "http://www.cdc.gov/niosh/topics/glutaraldehyde/", "http://www.drugs.com/pro/hydrocortisone.html", "http://www.truthinlabeling.org/Dang.html", "http://web.archive.org/web/20150423164030/http://www.cogforlife.org:80/mrc-5.htm", "http://www.drugs.com/mtm/neomycin.html"], "authors": [], "publish_date": null}