{"result_id": "204005", "URL": "https://modernalternativemama.com/2012/05/16/responses-to-vaccine-pushers/", "timestamp": "2023-04-25 16:22:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2012/05/16/responses-to-vaccine-pushers/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "Responses to Vaccine Pushers", "cleaned_text": "Welcome! This is the fifteenth post in my vaccine series. Today we are going to talk about responses to vaccine pushers. If you have missed any of this series on vaccines, get caught up with these posts: 10 Bad Reasons Not to Vaccinate, Why “Science” Should Be Carefully Evaluated, What is Herd Immunity All About, How the Immune System Works, Ingredients in Vaccines Part 1, Ingredients in Vaccines, Part 2, Risk-Benefit Analysis: MMR, Risk-Benefit Analysis: DTaP, Risk-Benefit Analysis: Chicken Pox, Hib, Flu, Risk-Benefit Analysis: Pneumoccocal, Meningococcal and HPV, Risk-Benefit Analysis: Hep A, B and Rotavirus, What About Alternative Schedules? or How to Protect Unvaccinated Kids.\n\nIt’s unfortunate, but much of this debate is completely unreasonable. That is, people get riled up and rely on scare tactics, anger and fear instead of facts; and they don’t believe that people have the right to make their own decisions. This leads to some pretty scary and sometimes hostile statements from “vaccine pushers” that can be difficult, in the heat of the moment, to respond to. Today we’ll talk about some of the most common excuses given by these pushers and responses you can use.\n\nThere are people who do choose to vaccinate, in part or in full, who believe that it is an individual decision for each family to make. Vaccinating works for them.\n\nI am not talking about these families.\n\nA vaccine pusher is someone who believes that everyone ought to vaccinate, with every vaccine currently recommended, on the CDC schedule, with no choice. If any new vaccines are added, they ought to get those too, without questions. Families should not have a choice, and those who try to do anything other than the CDC schedule are abusing or neglecting their children and their duty to society, and should be at a minimum, publicly ridiculed; and at a maximum, have their children removed from their home and forcibly vaccinated. They champion laws that would limit exemptions to extreme medical cases and other lack-of-choice legislature.\n\nI have words for those who believe this:\n\nYou have absolutely no right to talk to anyone that way, ever. You have no leg to stand on with this argument. You have the right to decide for yourself and your family alone. You do not have the right to compel others to accept the risk of vaccination or any other medical treatment. I have nothing but disgust and contempt for those who believe they can and should force their beliefs on others in this manner. I really cannot express the depth of my contempt for people who push vaccination on others.\n\nFor most families, when they have newly arrived at a decision to forego or delay vaccination, they are worried. They are researching fervently, hoping to solidify their choice and stop their fear that “something might happen.” They are worried about what could happen if they do vaccinate, and if they don’t.\n\nIt is these people that vaccine pushers target. There are people like me, who, after extensive research, stand very firm in their decision not to vaccinate their children, and no amount of scare tactics will sway them. They show disgust and contempt for people like me and try to stir up anger and use peer pressure, but they don’t target me directly. The people who are still fearful, though — these are the people they target.\n\nEvery terrible story that comes out in the media — “This one child died or almost died of a vaccine-preventable disease! We all need to remember little Suzy’s story next time we think that vaccines aren’t important! — are scare tactics, plain and simple. And they have no place in this very important debate, and I mentioned in my first post in this series.\n\nHowever, that doesn’t mean it will stop happening.\n\nVaccine pushers know that fear is a powerful motivator, and they use it to their advantage. They use these stories and sometimes manipulated statistics (or even outright lies, in some cases) to try to scare parents into vaccinating.\n\nLet’s look at some of the most common claims now, and take the fear out of them. As well as giving you something to say in response!\n\nClaim: “If you don’t vaccinate, you’re putting my child at risk.”\n\nResponse: “It is your job to protect your child, and my job to protect mine. Vaccines come with risks that I’m not comfortable taking.”\n\nI really don’t like this ‘collectivist’ reasoning anyway. We are all individuals who, in the majority of cases, need to protect ourselves, and then worry about our contributions to society. We do have responsibilities to others but not to the extent to place ourselves at risk if we are uncomfortable doing so. If you have a new baby, stay home or wear that baby close to your body. If you have a medically fragile child, it isn’t only “vaccine preventable” diseases that could harm him/her, it’s any form of illness, and you must take proper precautions all the time.\n\nExpecting others to be aware of all your needs and take extreme measures to protect you is wrong. Now, as I said in a previous post, I believe that staying home when you are ill is a social responsibility, and being extra careful about going near newborns or people you know are medically fragile if you even think you might be getting sick or have been exposed is a good idea. That, you can and should do, because it presents very little burden to you. Feel free to point this out.\n\nClaim: “Don’t you know your child is going to die?”\n\nResponse: “These diseases are extremely uncommon today, and even if my child does get them, I know enough about the signs and symptoms to seek medical care if needed. The serious complications are extremely rare, fewer than 1 in 10,000 in many cases.”\n\nThere’s a whole lot more you could say about this if pressed. People like to mention the very rare complications but they act as if everyone who catches the disease will end up with these complications, which is simply untrue. See my risk-benefit analysis posts for specifics on how often these complications actually occur in various diseases.\n\nClaim: “You just don’t know how dangerous these diseases are. If you did, you’d vaccinate.”\n\nResponse: “These diseases were actually not dangerous in the vast majority of cases. There will always be complications for a few, but this is not the majority.”\n\nAgain, see the risk-benefit analysis posts for specific statistics on just how rare these complications are. I’d argue that many people who vaccinate, especially vaccine pushers, are actually far more terrified of the diseases than they actually need to be. And if they come back and say “What if it happened to your child,” you can simply respond, “What if my child had a bad vaccine reaction? Speculating gets us nowhere. There is risk to anything.”\n\nClaim: “How will you feel when these diseases become epidemic again? Pertussis cases are already rising. It’s your fault.”\n\nResponse: “The majority of these cases are occurring in fully vaccinated individuals due to vaccine failure. If you want to blame me, our conversation is over.”\n\nDon’t take that ‘it’s your fault’ junk. Don’t even discuss it, don’t argue with it, don’t deal with it at all. If someone wants to name call or be rude, then there’s no point in debating them.\n\nClaim: “Child services ought to/will come and take your child(ren) away if you don’t vaccinate.”\n\nResponse: “In many states, it is actually considered a false report and illegal for CPS to get involved simply because a family does not vaccinate.”\n\nLook up your state’s laws, as some are stricter than others. The National Vaccine Information Center is a good place to look. This does happen, sadly, in a few states, and I suggest securing a legal waiver as soon as possible (even before your children are school age) and finding a lawyer or joining the Homeschool Legal Defense (HSLD) if you are in a state with stricter laws. This will help to protect you. And as for ‘ought’ to take your children…end the conversation immediately. Don’t go there.\n\nClaim: “Well, you can’t put them in public school, and you shouldn’t take them to any other public places either.”\n\nResponse: “All states allow for unvaccinated children to attend public school with some form of waiver. As long as my children are not sick, there is no reason they should not be in public.”\n\nTwo states have only a medical waiver, but the rest have religious and/or philosophical, which allows your child(ren) to attend public school unvaccinated. The National Vaccine Information Center can tell you your state’s laws. As for the silly idea that unvaccinated children shouldn’t be allowed in public, there’s no issue if they are not sick! If they are or if you know, for example, that your child has just been exposed to chicken pox, keep them home. But unvaccinated children are not walking disease-carriers. You may also choose to say, “Recently vaccinated children can shed viruses and make other children ill, yet they aren’t told to stay clear of public spaces. Perhaps they should be.” Of course that’s a bit argumentative….\n\nClaim: “You are an anti-science whack job with a tinfoil hat. Everyone knows vaccines are the greatest public health breakthrough.”\n\nThere is no response needed to this. It is an absolutely ridiculous and enraging idea but there is no logic behind it. Anyone who says this doesn’t actually understand or care to understand your position and you shouldn’t waste your breath arguing. Anyone who talks like this and thinks it’s appropriate is lower than low. Insults are never appropriate and are a sign of a complete lack of an argument and no ability to use complex reasoning.\n\nClaim: “You know that anti-vaccination is just a conspiracy theory, right? There’s no actual science behind it.”\n\nResponse: “There is quite a bit of science to support the idea that vaccinations may be harmful. Please check out the CDC’s Pink Book and read the vaccine package inserts. I’d be happy to point you towards other accepted medical sources as well.”\n\nAssuming that the person saying this actually believes it and isn’t trying to be deliberately inflammatory, point them towards the science.\n\nClaim: “Anti-vaccinators are dangerous, because they spread lies.”\n\nResponse: “I am not anti-vaccine. I am for choice. If others would like to vaccinate, they may choose to do so. Please take a look at the science.”\n\nThe first part is important: most people who are against vaccinations are against them for their own family. They do not try to tell others what they ‘should’ do. They aim to educate gently to help people come to their own decisions. Pro-vaccinators, on the other hand, are anti-choice, which is why they have no leg to stand on. You can also point them towards plenty of scientific sources that clearly state the potential dangers of vaccines, but most people who call you a liar are not actually interested in what the science really says.\n\nSome people will say these things out of sheer ignorance, because they have heard them repeated frequently in the media. Some will say them in confusion, looking for confirmation or answers. Engage them, answer them, speak to them gently. Point them towards the CDC’s Pink Book, the WHO disease position papers, and the vaccine package inserts to begin their research. Honest questions should be answered, and answered respectfully!\n\nOthers, the true “pushers,” will say these just to be inflammatory and rude. Don’t engage them. It’s hard, but just walk away. They are stuck in their indefensible position and there’s nothing that you can say to change their minds. Ignore, avoid, do not debate them. I refuse to do so anymore because it is not worth my time, stress, or frustration. Usually these are not people who can actually do anything about your ability to make a choice, so there is no point.\n\nThe most important part is that if you do talk about vaccines, do it calmly and rationally. Point people towards studies. Use common sense. Don’t get angry or frustrated or make broad statements that you can’t back up with data. This position, despite being the only correct one (that people should have a choice, not that people shouldn’t vaccinate), is extremely difficult to defend these days because of all the vitriol being spewed by the mainstream. It’s not helped when people make broad, emotional statements that lack science.\n\nBe patient, persistent, and always point back to the data. The small minority of voices will grow in strength if they are calm and have data on their sides. That should be our point always — what the science actually shows. We’re accused of being anti-science and that isn’t true, of course; we need to constantly be reminding everyone of that!\n\nNext week will be the series wrap-up. Three months later and we’re finally done! If you have any additional questions about vaccines that have not been answered by this series, please leave them for me and I’ll do my best to address them next week.\n\nWhat types of comments do you hear from ‘vaccine pushers?’ How do you handle it?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://modernalternativemama.com/link/vaccine/", "https://modernalternativemama.com/blog/2012/02/15/10-bad-reasons-not-to-vaccinate/", "https://modernalternativemama.com/blog/2012/02/22/why-science-should-be-carefully-evaluated/", "https://modernalternativemama.com/blog/2012/02/29/what-is-herd-immunity-all-about/", "https://modernalternativemama.com/blog/2012/03/07/how-the-immune-system-works/", "https://modernalternativemama.com/blog/2012/03/14/ingredients-in-vaccines/", "https://modernalternativemama.com/blog/2012/03/21/ingredients-in-vaccines-part-2/", "https://modernalternativemama.com/blog/2012/03/28/risk-benefit-analysis-m-m-and-r/", "https://modernalternativemama.com/blog/2012/04/04/risk-benefit-analysis-diphtheria-tetanus-pertussis/", "https://modernalternativemama.com/blog/2012/04/11/risk-benefit-analysis-chicken-pox-hib-flu/", "https://modernalternativemama.com/blog/2012/04/18/risk-benefit-analysis-pneumoccocal-hpv-meningococcal/", "https://modernalternativemama.com/blog/2012/04/25/risk-benefit-analysis-hep-a-b-and-rotavirus/", "https://modernalternativemama.com/blog/2012/05/02/what-about-alternative-schedules/", "https://modernalternativemama.com/blog/2012/05/09/how-to-protect-unvaccinated-kids/", "http://www.nvic.org", "http://modernalternativemama.com/wp-content/uploads/2012/05/Responses-to-Vaccine-Pushers-2-1.png", "http://www.nvic.org"], "authors": [], "publish_date": null}