{"result_id": "204003", "URL": "https://modernalternativemama.com/2016/03/26/vaccines-cause-autism-thats-not-point/", "timestamp": "2023-04-25 16:22:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2016/03/26/vaccines-cause-autism-thats-not-point/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "Vaccines DO Cause Autism, But That’s Not the Point", "cleaned_text": "When I was a young, first-time parent, I wanted to take the best care of my son I could. I did everything right; I did what I was told. I had him vaccinated on time, every time.\n\nBack then, I didn’t know how to spot the signs that his body wasn’t handling vaccinations well. From a chronic runny nose and allergies, to abnormal digestive symptoms, to persistent eczema, his body was in a constant state of inflammation, but I didn’t know it meant his immune system was malfunctioning. (Read 10 Signs of Vaccine Reaction and Damage.)\n\nI didn’t know it meant he might not be a good candidate for vaccinations. (Read Vaccine Contraindications: Six People Who Should Not Be Vaccinated.)\n\nFast forward a few years and many vaccinations later, and he was teetering on the brink of autism.\n\nHe had difficulty potty training and smeared feces everywhere, often. Friends thought it was funny; I thought it was awful to clean up. Still I didn’t see how alarming the symptoms were.\n\nHe was delayed in speech and had trouble communicating. “That’s normal for boys,” everyone said.\n\nHe shoved other kids down instead of playing with them. I needed to discipline him better, friends and family thought.\n\nHe had meltdowns in despair and anger when things weren’t going his way and became inflexible about silly things like the color of his cup and which shoes he wanted to wear. Ok, I would just have to do things his way, all the time, I decided.\n\nExcept one day I woke up, and realized something was really amiss and I couldn’t live like that anymore. Something had to give.\n\nVaccines DO cause autism, but that’s not really the point\n\nDid the countless vaccines he received before the age of four (when I learned the truth about vaccines and how dangerous they really are) cause his autistic behaviors? I don’t know. I’ll never really know how much damage they did.\n\nIf you’re still in the camp insisting that vaccines can’t and don’t cause autism, you can stop reading now because I’m not up for a debate. That’s not what this post is about.\n\nSince the CDC whistleblower scandal, it can no longer be denied: vaccines DO cause autism. But that’s not the point.\n\nIt has been suggested that autism is a blessing… something to be celebrated. There are those who say “God created him this way.” (Read: The ONE Thing We Need to Stop Saying About Autism.)\n\nNo. No; autism is not a blessing. No. God did not create my son this way. He wasn’t born this way and these are not normal behaviors.\n\nI got lucky. We stopped vaccinating and began to reverse his symptoms before they got any worse, but there are millions of parents who have children with full-blown autism, and it doesn’t look like these romanticized ideals of savant children who are piano prodigies and artistic geniuses.\n\nSure, those autism success stories exist. It’s pretty cool that because of the unique way an autistic person’s brain works that they can create some truly exceptional art.\n\nBut those success stories are the exception, not the rule.\n\nWhat does autism really look like?\n• Inability to toilet train and feces smearing, even into late childhood, teenage years, and, in severe cases, adulthood.\n• Lack of emotional expression. Imagine your child never hugging you or saying he loves you.\n• Poor social interactions and lack of friendships and meaningful relationships.\n• Hurting others with no remorse or understanding.\n\nShould I keep going?\n\nChildren with autism grow up to be adults with autism, who are nine times more likely to commit suicide than those without autism.\n\nMany of those with autism die before the age of 40.\n\nThose with autism are 40 times more likely to die prematurely than the general population. (source)\n\n“I’d rather have a child with autism than have a child die from a vaccine-preventable disease.”\n\nThis is perhaps one of the most insulting and ignorant things a person can say, and would most likely not come out of the mouth of a parent who actually lives with a child with autism, particularly one who can link their child’s symptoms back to vaccines.\n\n1. The odds of a child dying from a vaccine preventable (and I use that term lightly) disease are really rather quite low. Read Which is Safer: Vaccines or Illnesses? You may find that the fear tactics so many of us have bought into don’t actually hold as much water as you think.\n\n2. This idea allows us to believe that kids with autism are just a little “quirky,” and that autism isn’t really that big of a deal.\n\nLet’s just assume that your child is not going to die from one of these vaccine preventable diseases. The odds, however, of your child being diagnosed with autism? It was estimated to be 1 in 45 in 2014. 1 in 45. Let that sink in.\n\nThat’s up from 1 in 68 just a couple of years prior. The number is growing at a lightning speed.\n\nThat’s millions of parents raising a child with exceptional difficulties: learning disabilities, social problems, and the physical symptoms that go along with it.\n\nMillions of parents without any answers.\n\nWhether or not vaccines cause autism, suggesting that autism is not that big of a deal and that vaccines are worth the risk would be a mistake.\n\nRisking my child’s health because you perceive it will protect yours would be a mistake.\n\nNot my child. Not anymore.\n\nHow do you feel about the idea that autism is a blessing or “not a big deal?”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.thefamilythathealstogether.com", "https://modernalternativemama.com/2016/03/18/10-signs-of-vaccine-reaction-and-damage/", "http://www.thefamilythathealstogether.com/vaccine-contraindications-six-people-not-vaccinated/", "http://www.thefamilythathealstogether.com/one-thing-need-stop-saying-autism/", "http://www.sciencemag.org/sites/default/files/documents/AUTISTICA%20REPORT%20-%20Personal%20Tragedies,%20Public%20Crisis.pdf", "https://modernalternativemama.com/2014/10/03/safer-vaccines-illnesses/"], "authors": [], "publish_date": null}