{"result_id": "204026", "URL": "https://modernalternativemama.com/2012/02/29/what-is-herd-immunity-all-about/", "timestamp": "2023-04-25 16:22:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://modernalternativemama.com/wp-content/themes/mam-16/images/favicon.ico", "canonical": "https://modernalternativemama.com/2012/02/29/what-is-herd-immunity-all-about/", "encoding": "UTF-8"}, "image": null, "domain": "modernalternativemama.com", "title": "What is Herd Immunity All About?", "cleaned_text": "This is the fourth post in my vaccine series. If you’re new here, you may want to go back and read Getting Serious, 10 Bad Reasons Not to Vaccinate, and Why Science Should Be Carefully Evaluated.\n\nI have been just waiting to write this post. Oh, I am so excited. In fact, I’m even jumping the gun a week (I need to talk about how the immune system works, but that has been such a huge endeavor to research that I just didn’t have time to finish it up this week).\n\nWhy am I so excited?\n\nWhen pro-vaccine and anti-vaccine people (ahem, anti-choice and pro-choice, really, since the pro-vaccine people often — not always — think that everyone should vaccinate without exception) get into a fight, they can go back and forth for awhile. They can disagree on if vaccines really saved lives or if it was nutrition and sanitation. They can disagree on if vaccines are at all responsible for the epidemic of degenerative and chronic illness around us. But where they always end up is herd immunity.\n\n“If you don’t vaccinate your child, you are putting those who are too young or otherwise can’t be vaccinated at risk, because 95% of the population must be vaccinated to keep these disease at bay. You’re selfish for not vaccinating.”\n\nFrom that point on — at least partially because insulting someone is a really poor debate tactic — it’s useless to continue talking. Those who believe that have their minds made up and aren’t budging. But of course, those who are against vaccines don’t tend to believe in herd immunity anyway.\n\nSo what is this concept and why does it create such a fuss?\n\nWhat Herd Immunity Is (Or So We’re Told)\n\nThe theory of herd immunity goes like this: there are babies and those who are medically fragile (immune compromised, elderly) who cannot be vaccinated. In order to protect them from illness, 95% of the rest of the population must be vaccinated in order to hold all the diseases at bay. If we do not achieve high enough vaccination rates, these diseases will come back with a vengeance and start killing tons of people again, starting with cancer kids and babies.\n\nThat sounds pretty scary, right? And of course as rates have fallen in some areas, there have been some “outbreaks” (usually consisting of 100 or less people, sometimes less than a dozen), which vaccine proponents blame on non-vaccinators for upsetting the delicate balance of herd immunity. Do they have a point? Are all these “silly refusers” causing diseases to come back and kill people?\n\nWhere Herd Immunity Came From\n\nIn 1933, a researcher named Hedrich was studying disease patterns. He happened to note that when 68% of people in a given community had become immune to a particular disease (measles, in this case) either through natural resistance or having had the disease, that illness would disappear from the community. Basically, over 2/3 of people had to be resistant, and then the other 1/3 would not get sick because the disease could not get a foot hold in that community anymore.\n\nThis theory is absolutely true and applies to any sort of natural infection to which most people become immune after having had it. But notice that the required percentage is 68%. Not 95%.\n\nThe number “95%” appears to come from observational studies in various communities or countries at large. At varying rates from 75 – 95%, different diseases became “controlled.” It is likely these varied depending on virulence of the disease, whether or not people could be asymptomatic carriers, how quickly and easily it spreads, and whether or not people could become reinfected with the same illness more than once. Different diseases required different rates. Pertussis appeared to require 95% (there are asymptomatic carriers, it spreads very easily, people can get it more than once, and many older children and adults don’t have a severe form and never realize they even have it, nor get tested — meaning they can be spreading it without knowing). Diptheria appears to require 85%.\n\nRather than get complicated and tell everyone that different disease require different rates, researchers went with the highest required number — 95% — and told everyone that this is the coverage we need on all vaccines in order to prevent diseases from spreading.\n\nSomething we should notice here is that when we are discussing natural infection, 68% is good enough. When we are discussing vaccines, 85 – 95% seems to be typical. This is likely due to the fact that vaccines just don’t work the same way as natural infection. Some people don’t develop any protection. Protection wanes over time (after 2 – 1o years, depending on the vaccine). Strains can mutate, but the vaccine strain is always the same. Therefore, higher coverage rates are necessary to achieve the same end.\n\nDoes Herd Immunity Really Hold Up?\n\nDepends on who you talk to.\n\nOne source notes that as vaccine coverage rates rise in one population, it provides some protection to the rest, even if they are not vaccinated. (For example, meninigitis rates dropped in the population as a whole when babies were vaccinated.) Remember that observational/survey type studies are not necessarily highly reliable, though — they note trends that ought to be further researched, but cannot “prove” anything.\n\nOther sources, however, have noted the following: vaccines’ protection wanes over time, so that 2 – 10 years post-vaccination, a person is not covered. On illnesses like measles, the majority of the population over age 20, at least those not old enough to have had natural measles infection (50 – 60 years or older) are now “unprotected.” This means that a large percentage of the population as a whole is really unprotected. Yet, we haven’t seen a resurgence of measles in the population. This same logic applies to other vaccines which are “highly covered” in those under 18 only. The population as a whole does not reach anywhere near 95% (or even 50%, in some cases), yet we don’t see huge outbreaks.\n\nEven with pertussis, up to 36% of adults with a bad cough actually have pertussis and don’t know it (thus can spread it — see source linked in the first paragraph of this section). We’re well under 50% coverage on that vaccine and outbreaks aren’t huge. What we are seeing, however, is that people who are most vulnerable (elderly whose protection has waned, babies too young to be vaccinated) are now catching pertussis, when this used to not be the case. When parents were immune to something naturally, meaning life-long, then they passed this immunity to their babies at birth and boosted it via breastfeeding. When parents aren’t immune, or don’t breastfeed, this breaks down the system and leaves babies vulnerable.\n\nWhat all this really means is that if a bunch of people are vaccinated, it seems to provide some general protection to those around them, but herd immunity doesn’t seem to be required to keep diseases at bay. If it were, then we would have quickly seen a resurgence of disease, or we would never have seen disease rates drop in the first place, given that the older generations aren’t vaccinated for most of the same things babies are today (those born prior to 1990 only got about 6 different shots). There’s much more at play here than herd immunity.\n\nWhy Use Herd Immunity as a Reason?\n\nResearchers strongly believe that high coverage rates are necessary to beat disease back, based on their population studies. It appears to be true — but there is no placebo-controlled study to prove this is what is going on.\n\nIt’s also used, unfortunately, as a guilt tactic — “You don’t want little Timmy with cancer to die from measles because you were too selfish to vaccinate, do you?” As always, these types of emotion-inducing comments should be ignored.\n\nLooking out for public health and inspiring people to be “good citizens” is usually pretty effective. Coupled with scary stories about illnesses that occur when you don’t vaccinate, most of the public doesn’t look further than this.\n\nYes, herd immunity exists (and, in relation to natural infection, is important). But it’s not all there is to it. When vaccines are administered, disease rates are lower. But vulnerable populations are much more susceptible, and death rates (as a percentage of those who catch the disease) are actually higher.\n\nSupposing vaccines function the way they say — that they prevent infection or make it less serious, there are still several more questions to answer.\n• What about these vulnerable populations — why are they more likely to get sick now?\n• Does immunity really last? And does it transfer to the next generation?\n• Are the side effects/potential damage from the vaccines greater than the protection they afford?\n• Is there any benefit to getting a disease naturally and acquiring natural immunity vs. vaccine-induced immunity?\n• Epidemics seem to come in “cycles” — does this still occur when vaccine coverage is high? Do vaccines have any effect on this cycle?\n\nPlease note this last section is just my thoughts and not medical advice or research.\n\nI believe we’ve built a bit of a “house of cards” here. Yes, vaccines appear to reduce disease rates in the general population, and it appears that the more people who are vaccinated, the more disease rates are reduced. However, it also appears that those who catch the disease anyway have a more virulent illness and are more likely to suffer from complications or death. Vulnerable populations are also more likely to become ill — perhaps because they are the only ones to which the disease can spread.\n\nIf we vaccinate people more and more and more, we might be able to keep the diseases at bay — for awhile. But at what cost? How much of what’s happening to the population in terms of degenerative and chronic illness is related to our high intervention rates? I would guess a lot (and not entirely due to vaccines, but due to several types of “intervention” in our environment). Is it really worth it? We will look at a risk-benefit analysis of each of the vaccines over the next several weeks, using the VAERS database as well as whatever studies I can get my hands on. This is a murky topic, to be sure, because there is not a lot of clear, unbiased research.\n\nNext week we talk about how the immune system functions. It gets very technical and a little bit crazy (it’s pretty crazy-making researching it…I’m about halfway through, as of this writing). Stick with me though…once we get past this background stuff, we’ll be into the risk-benefit analysis of each vaccine, which I know many are looking forward to!\n\nDo you believe in herd immunity? Why or why not?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://modernalternativemama.com/blog/2012/02/08/the-vaccine-debate-lets-get-serious/", "https://modernalternativemama.com/blog/2012/02/15/10-bad-reasons-not-to-vaccinate/", "https://modernalternativemama.com/blog/2012/02/22/why-science-should-be-carefully-evaluated/", "http://www.sciencebasedmedicine.org/index.php/herd-immunity/", "http://www.sciencebasedmedicine.org/index.php/herd-immunity/", "http://www.vaccinationcouncil.org/2012/02/18/the-deadly-impossibility-of-herd-immunity-through-vaccination-by-dr-russell-blaylock/", "https://modernalternativemama.com/2011/2/8/vaccines-how-long-does-immunity-last/", "http://web.archive.org/web/20120321203340/http://www.vacfacts.info:80/herdimmunity.html"], "authors": [], "publish_date": null}