{"result_id": "205016", "URL": "https://nationalfile.com/exclusive-bidens-military-puts-west-point-cadets-in-solitary-confinement-if-they-refuse-covid-vaccine/", "timestamp": "2023-04-25 16:23:46 CEST+0200", "meta": {"description": "Cadets at West Point who refuse to take the COVID vaccine are being put in isolation, with more stringent restrictions than those who tested positive", "lang": "en", "keywords": "", "favicon": "https://nationalfile.com/wp-content/uploads/2019/08/cropped-National-Logo-32x32.jpg", "canonical": "https://nationalfile.com/exclusive-bidens-military-puts-west-point-cadets-in-solitary-confinement-if-they-refuse-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "nationalfile.com", "title": "EXCLUSIVE: Biden's Military Puts West Point Cadets in Solitary Confinement If They Refuse COVID Vaccine", "cleaned_text": "UPDATE: The West Point U.S. Military Academy Public Affairs Office issued a statement regarding the claim on June 15, 2021. COVID-19 vaccination was not required for military personnel at the time, though it was strongly encouraged.\n\n“The COVID-19 vaccine is encouraged, not mandatory. West Point is focused on maximizing training opportunities and building cohesive teams for all cadets, regardless of vaccination status. Since vaccinated cadets may still carry and spread COVID to the unvaccinated, West Point continues to follow Centers for Disease Control, Department of Defense, and Department of the Army guidance for COVID mitigation protocols. Though they train together and are fully integrated in all activities, unvaccinated cadets are currently being housed separately from vaccinated cadets to minimize transmission risk and are provided with equal or better living conditions. The academy’s risk mitigation plan for summer military training was developed under the guidance of medical advisors, experience from last year’s academy summer training experiences, and is aligned with the measures used in other military training exercises across the Army.”\n\nRegarding the claim of solitary confinement, West Point stated that unvaccinated troops were allowed outside for one hour a day during their mandatory quarantine period upon returning to campus.\n\n“Unvaccinated cadets are required to spend seven days in restriction of movement if they arrive from off the installation, but they are not required to spend 23 hours of the day in their room. During restricted movement cadets are allowed to come and go for exercise outdoors as many times per day as they would like; indoor exercise facilities are provided; and they have access to take-out food delivery and delivery is provided from the Post Exchange. During the restriction of movement period, they are not allowed into public buildings or residential areas on post. West Point is focused on maximizing training opportunities and building cohesive teams for all cadets, regardless of vaccination status. Since vaccinated cadets may still carry and spread COVID to the unvaccinated, West Point continues to follow Centers for Disease Control, Department of Defense, and Department of the Army guidance for COVID mitigation protocols. Vaccines are currently available through Emergency Use Authorization and while highly encouraged, vaccination is not mandatory. Correspondingly, vaccinations, testing, isolation, and quarantine remain the best options available to maintain a healthy environment for our cadets and West Point community.”\n\nMilitary cadets at West Point Academy who refuse to take one of the controversial COVID vaccines are being put in solitary confinement, with more stringent restrictions than those who tested positive for the virus.\n\nAt West Point Military Academy, a number of cadets are currently rebelling against the push from the Biden administration and military higher-ups to take one of the controversial COVID-19 vaccines. 700 cadets who initially refused the vaccine were brought together into a meeting room, and were briefed as to the benefits of the vaccine. The number of cadets has now dwindled significantly after allegations of daily pressure by “senior officials” at the school, and rumors of reductions of leave. Some cadets relented and received the vaccine, while many left West Point due to the pressure.\n\nThose who still refuse to take the vaccine are forced to wear masks everywhere, marking them out from everybody else who is vaccinated. A number of parents of those holdouts have now organized legal counsel on behalf of their children, with CDMedia reporting that they are “banding together to fight this perceived criminal behavior by those in power over their children.\n\nAn anonymous whistleblower, whose identity National File is protecting, gave a breakdown of the current restrictions that West Point cadets who refuse to take the COVID vaccine have to face. For those cadets returning for summer programs, they will have their two week leave shortened to one, as they have to spend 7 days in a quarantine that amounts to serious solitary confinement. The cadets are locked up for 23 hours each day in one room, and are only allowed out for one hour to walk or run outside.\n\nCrucially, these cadets are not tested for COVID-19 before they are put into self-isolation. In fact, they are only tested at the end of the period. If they test negative, they will be released to their training programs. In a letter sent to the cadets deemed “high risk,” there was no detail as to what would happen if the cadet tested positive instead, in terms of whether they would be forced to endure another week or more of the solitary confinement. National File contacted West Point for details on this program via phone and email, but did not receive a response by the time of publication.\n\nThe new regime could not accurately be described as self-isolation or quarantine, as such programs already existed at West Point for cadets returning after the summer and Christmas breaks this academic year who tested positive. For those cadets, before the vaccination program kicked into high gear, they would be restricted at some points, but could also work out in the outside gyms, and leave their accommodation to go and order food, albeit being ordered to stay away from cadets who were not infected. These luxuries are not afforded to the cadets who refuse to take the vaccine, even though they may not have the virus.\n\nWest Point allegedly plans to round up all the cadets who are refusing the vaccine and transfer them into all one company or platoon based on how many they’re are. At the time of writing, around 50 cadets have not backed down. The whistleblower said this would likely be better for them, as they would not be around other troops who derogatorily shout at them, calling them “anti-vaxxers,” and instead would be with those who stand with them. “They’re being treated like criminals,” the whistleblower added. “They’re trying to protect other people’s rights and their rights are being compromised.”\n\nNational File reported last year on two successive suicides from the Colorado Springs Air Force, with students expressing to the academy that the deaths may have been linked to depression springing from the then extremely strict social distancing policies and punishments for violating the six-foot distance protocols. Following the deaths, looser restrictions were enacted.", "opengraph": {"locale": "en_US", "type": "article", "title": "EXCLUSIVE: Biden's Military Puts West Point Cadets in Solitary Confinement If They Refuse COVID Vaccine", "description": "Cadets at West Point who refuse to take the COVID vaccine are being put in isolation, with more stringent restrictions than those who tested positive", "url": "https://nationalfile.com/exclusive-bidens-military-puts-west-point-cadets-in-solitary-confinement-if-they-refuse-covid-vaccine/", "site_name": "National File", "article:publisher": "https://facebook.com/nationalfile", "article:published_time": "2021-06-09T23:08:15+00:00", "article:modified_time": "2022-12-08T10:24:24+00:00", "image": "https://nationalfile.com/wp-content/uploads/2021/06/West-Point-Solitary-Confinement-COVID-Vaccine.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg"}, "tags": ["Coronavirus", "West Point", "COVID", "Military", "Vaccines", "Vaccination"], "tweets": [], "movies": [], "links": ["http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://leadstories.com/hoax-alert/2021/06/fact-check-exclusive-bidens-military-does-not-put-west-point-cadets-in-solitary-confinement-if-they-refuse-covid-19-vaccine.html", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/cia-visits-paraguay-ahead-of-wef-election-coup/", "https://nationalfile.com/video-pro-trans-militants-shut-down-montana-legislature-in-their-latest-attack-on-democracy/", "https://nationalfile.com/video-neil-cavuto-shuts-down-rfk-jr-when-he-calls-for-peace-in-ukraine/", "#", "#", "https://creativedestructionmedia.com/investigations/2021/06/02/vaccine-scandal-rocks-west-point/", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/two-air-force-cadet-suicides-leads-to-looser-social-distancing-protocols/", "https://nationalfile.com/tag/coronavirus/", "https://nationalfile.com/tag/covid/", "https://nationalfile.com/tag/military/", "https://nationalfile.com/tag/vaccination/", "https://nationalfile.com/tag/vaccines/", "https://nationalfile.com/tag/west-point/"], "authors": ["National File News"], "publish_date": "2021-06-09T23:08:15+00:00"}