{"result_id": "205003", "URL": "https://nationalfile.com/desantis-asks-why-people-are-dying-suddenly-goes-after-pharma-with-nations-first-covid-grand-jury/", "timestamp": "2023-04-25 16:23:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://nationalfile.com/wp-content/uploads/2019/08/cropped-National-Logo-32x32.jpg", "canonical": "https://nationalfile.com/desantis-asks-why-people-are-dying-suddenly-goes-after-pharma-with-nations-first-covid-grand-jury/", "encoding": "UTF-8"}, "image": null, "domain": "nationalfile.com", "title": "DeSantis Petitions Florida Supreme Court to Empanel Grand Jury to Investigate Vaccine Adverse Effects", "cleaned_text": "Governor Ron DeSantis announced on Tuesday that he has petitioned the Florida Supreme Court for a statewide grand jury on COVID-19 Vaccines. The Florida governor stated that he wanted to find out why so many people had died suddenly or been injured after getting the COVID vaccine and hosted a panel of doctors who heard testimony from Florida residents.\n\nDeSantis made the presentation while standing in front of a collage of screens of people who represent those who have died or who have been injured from what medical professionals say is adverse reactions or vaccine injuries from the COVID-19 vaccine.\n\nThe Florida governor was joined by Florida Surgeon General Dr. Joseph Ladapo and a slate of world-renowned physicians, researchers, and public health experts to discuss adverse effects of the mRNA COVID-19 vaccines. He also announced new, aggressive actions to hold the federal government and pharmaceutical industry accountable.\n\nOne new initiative announced by DeSantis was the formation of the Public Health Integrity Committee. The Committee will be overseen by the surgeon general in order to assess federal public health recommendations and guidance to ensure that Florida’s public health policies are tailored for the state’s communities and priorities.\n\nThe panel formally called on the state supreme court to impanel a grand jury to investigate whether pharmaceutical companies criminally misled Floridians about the side effects of vaccines.\n\nThe Biden Administration and pharmaceutical corporations continue to push widespread distribution of mRNA vaccines on the public, including children as young as 6-months-old. The administration has yet to alter its messaging despite overwhelming evidence that the vaccines do not stop the spread of COVID-19, or growing fears over adverse effects.\n\nDuring Tuesday’s roundtable, Governor DeSantis and health experts discussed data covering serious adverse events. These risks include coagulation disorders, acute cardiac injuries, Bell’s palsy, encephalitis, appendicitis, and shingles.\n\n“Health care professionals should always communicate the risks of a medical intervention to their patients in a manner that is clinically appropriate and meets standards of ethical practice. President Biden and Big Pharma have completely prevented that from happening – it is wrong,” said Surgeon General Dr. Joseph Ladapo. “With these new actions, we will shed light on the forces that have obscured truthful communication about the COVID-19 vaccines.”\n\nThe Surgeon General will oversee the Public Health Integrity Committee, which consists of expert researchers charged with assessing federal decisions, recommendations, and guidance related to public health and health care. The Surgeon General would then receive input from the committee to ensure public health policies are tailored for Florida’s communities and aligned with state priorities.\n\nIn addition to the committee, the proposed grand jury will investigate whether citizens were misled on vaccine side effects.\n\nDespite this, the COVID-19 vaccines produced by Pfizer and Moderna have received FDA approval for pediatric and adult patients and continue to be marketed as safe and effective, even though the vaccines do not prevent transmission and adverse events have been minimized and disregarded by the Biden Administration and pharmaceutical executives.\n\nTo further investigate the issue in the state, Dr. Ladapo will conduct research through the University of Florida to assess sudden deaths of individuals in good health who received a COVID-19 vaccine. The Department of Health will also utilize disease surveillance and vital statistics to assess such deaths.\n\n“This has been a tremendously difficult time for everybody, but we are near the tail end of it and it is time to start taking stock of what went wrong and make reforms so this doesn’t happen again,” said Dr. Jay Bhattacharya, of Stanford University Medical School. “I think the centrally important issue that caused the problems is that we silenced qualified people from expressing their thinking, and as a result the decision making at the top of the country was absolutely abysmal.”\n\n“When you have censorship, the kinds of suppression of voices that is essentially a social credit system demeaning people who disagree with the CDC, you’re going to get bad decisions that don’t get checked. I am looking forward to working in coming years to reform American public health so that when there is another pandemic we do a much better job than we did during this one,” he continued.\n\n“Our group’s research has revealed that vaccines can affect the risk of non-targeted infections,” said Dr. Christine Benn, M.D., Ph.D., Chair of Health Sciences, Department of Clinical Research, University of Southern Denmark. “The new COVID-19 vaccines have not yet been investigated for their potential effects on the risk of other infections.”\n\n“Our study took a magnifying glass to the original Pfizer and Moderna clinical trials that got the vaccines on the market in late 2020. In the original trials, mRNA vaccines increased serious adverse events at a rate considerably higher than initially realized,” said Dr. Joseph Fraiman, M.D., Emergency Medicine Physician, Thibodaux Regional Medical Center. “Our peer-reviewed study — which was published this August in one of the field’s leading journals — indicates that the mRNA COVID vaccines should be urgently re-evaluated. I believe unless further studies can clearly demonstrate a favorable harm benefit profile, mRNA vaccine use should not be recommended in healthy adults and children. Independent of what our federal agencies recommend it is their ethical duty to inform the public of these results to allow for informed consent from those who chose to take COVID vaccines.”\n\nRELATED: Study: COVID-19 Vaccination Poses Elevated Risk of Myocarditis Death Across All Age Groups", "opengraph": {"locale": "en_US", "type": "article", "title": "DeSantis Petitions Florida Supreme Court to Empanel Grand Jury to Investigate Vaccine Adverse Effects", "description": "Governor Ron DeSantis announced on Tuesday that he has petitioned the Florida Supreme Court for a statewide grand jury on COVID-19 Vaccines. The Florida governor stated that he wanted to find out why so many people had died suddenly or been injured after getting the COVID vaccine and hosted a panel of doctors who heard […]", "url": "https://nationalfile.com/desantis-asks-why-people-are-dying-suddenly-goes-after-pharma-with-nations-first-covid-grand-jury/", "site_name": "National File", "article:publisher": "https://facebook.com/nationalfile", "article:published_time": "2022-12-13T23:31:48+00:00", "article:modified_time": "2022-12-13T23:32:49+00:00", "image": "https://nationalfile.com/wp-content/uploads/2022/12/Screenshot-2022-12-13-174030.jpg", "image:width": "778", "image:height": "313", "image:type": "image/jpeg"}, "tags": ["Florida", "FDA", "Moderna", "vaccine injuries", "COVID-19", "Pfizer", "COVID-19 Vaccines", "Ron DeSantis", "CDC"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Twitter 1.0’s blacklisting of <a href=\"https://twitter.com/DrJBhattacharya?ref_src=twsrc%5Etfw\">@DrJBhattacharya</a>, which was uncovered in the Twitter Files, is proof that Big Tech and the medical establishment targeted scientific dissenters to control the narrative around COVID-19. <a href=\"https://t.co/PY5OjBhxnv\">pic.twitter.com/PY5OjBhxnv</a></p>\n<p>— Ron DeSantis (@GovRonDeSantis) <a href=\"https://twitter.com/GovRonDeSantis/status/1602699495220736000?ref_src=twsrc%5Etfw\">December 13, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Florida will hold the medical establishment accountable by:<br/>• Creating a grand jury to investigate mRNA shots &amp; Big Pharma<br/>• Investigating cardiac-related deaths tied to the mRNA vaccine<br/>• Forming a Public Health Integrity Committee to oversee the medical establishment</p>\n<p>— Ron DeSantis (@GovRonDeSantis) <a href=\"https://twitter.com/GovRonDeSantis/status/1602763432788635651?ref_src=twsrc%5Etfw\">December 13, 2022</a></p></blockquote>\n"], "movies": [], "links": ["http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/desantis-becomes-shaken-when-asked-about-his-failing-poll-numbers-vs-trump/", "https://nationalfile.com/breaking-cnn-fires-don-lemon/", "https://nationalfile.com/breaking-fox-news-tucker-carlson-part-ways/", "#", "#", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://www.cnbc.com/2022/12/13/desantis-seeks-grand-jury-investigation-of-covid-19-vaccines.html", "https://twitter.com/DrJBhattacharya?ref_src=twsrc%5Etfw", "https://t.co/PY5OjBhxnv", "https://twitter.com/GovRonDeSantis/status/1602699495220736000?ref_src=twsrc%5Etfw", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://twitter.com/GovRonDeSantis/status/1602763432788635651?ref_src=twsrc%5Etfw", "https://nationalfile.com/study-covid-19-vaccination-poses-elevated-risk-of-myocarditis-death-across-all-age-groups/", "https://nationalfile.com/tag/cdc/", "https://nationalfile.com/tag/covid-19/", "https://nationalfile.com/tag/covid-19-vaccines/", "https://nationalfile.com/tag/fda/", "https://nationalfile.com/tag/florida/", "https://nationalfile.com/tag/moderna/", "https://nationalfile.com/tag/pfizer/", "https://nationalfile.com/tag/ron-desantis/", "https://nationalfile.com/tag/vaccine-injuries/"], "authors": ["Kari Donovan"], "publish_date": "2022-12-13T23:31:48+00:00"}