{"result_id": "205018", "URL": "https://nationalfile.com/review-covid-19-vaccines-may-lead-to-prion-linked-brain-degeneration-similar-to-mad-cow-disease/", "timestamp": "2023-04-25 16:23:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://nationalfile.com/wp-content/uploads/2019/08/cropped-National-Logo-32x32.jpg", "canonical": "https://nationalfile.com/review-covid-19-vaccines-may-lead-to-prion-linked-brain-degeneration-similar-to-mad-cow-disease/", "encoding": "UTF-8"}, "image": null, "domain": "nationalfile.com", "title": "REVIEW: COVID-19 Vaccines May Lead To Prion-Linked Brain Degeneration Similar To Mad Cow Disease", "cleaned_text": "Last Updated on May 12, 2021\n\nA new review of possible unintended consequences of COVID-19 vaccines suggests that the controversial mRNA vaccines – Moderna and Pfizer – may lead to unexpected neurological conditions similar to Mad Cow Disease.\n\nThe review by Stephanie Seneff, who works at the Computer Science and Artificial Intelligence Laboratory at MIT, and Dr. Nigh, who specializes in Naturopathic Oncologogy at Immerson Health in Portland, Oregon, was released this week in the International Journal of Vaccine Theory, Practice, and Research, and devotes a considerable space to discussing the research of Dr. J. Bart Classen, who first published a research paper on the possibility of prion-linked brain degeneration caused by the COVID-19 vaccine last month, and expands on his research.\n\nThe researchers explain that “researchers have identified a signature motif linked to susceptibility to misfolding into toxic oligomers, called the glycine zipper motif. It is characterized by a pattern of two glycine residues spaced by three intervening amino acids, represented as GxxxG. The bovine prion linked to MADCOW has a spectacular sequence of ten GxxxGs in a row,” and notes that “the SARS-CoV-2 spike protein is a transmembrane protein, and that it contains five GxxxG motifs in its sequence” and, thus, “it becomes extremely plausible that it could behave as a prion”.\n\n“Recall that the mRNA vaccines are designed with an altered sequence that replaces two adjacent amino acids in the fusion domain with a pair of prolines,” the authors continue. “This is done intentionally in order to force the protein to remain in its open state and make it harder for it to fuse with the membrane. This seems to us like a dangerous step towards misfolding potentially leading to prion disease.”\n\nPrions were first described as the method by which Mad Cow Disease causes brain degeneration due to misfolding proteins in the body. The CDC notes that “prion diseases are usually rapidly progressive and always fatal.” Mad Cow Disease “progressively attacks the brain but can remain dormant for decades,” per the BBC.\n\n“Pfizer claims the RNA fragments ‘likely… will not result in expressed proteins’ due to their assumed rapid degradation in the cell,” the researchers note. They add, “While we are not asserting that non-spike proteins generated from fragmented RNA would be misfolded or otherwise pathological, we believe they would at least contribute to cellular stress that promotes prion-associated conformational changes in the spike protein that is present.”\n\nWhen Classen previously published his research, fact checkers were quick to point to public statements from Pfizer that dismissed concerns of brain prions as a result of their vaccine. It may be worth noting that “the most expensive settlement that Pfizer has paid was over $2.3 billion paid as a fine to resolve civil and criminal penalties for illegal marketing of four medications including Bextra, Geodon, Zyvox, and Lyrics.”", "opengraph": {"locale": "en_US", "type": "article", "title": "REVIEW: COVID-19 Vaccines May Lead To Prion-Linked Brain Degeneration Similar To Mad Cow Disease", "description": "Researchers published a review that sounds the alarm about potential unintended COVID-19 vaccine side effects", "url": "https://nationalfile.com/review-covid-19-vaccines-may-lead-to-prion-linked-brain-degeneration-similar-to-mad-cow-disease/", "site_name": "National File", "article:publisher": "https://facebook.com/nationalfile", "article:published_time": "2021-05-12T17:24:02+00:00", "image": "https://nationalfile.com/wp-content/uploads/2021/05/Mad-Cow-Disease-COVID-Vaccines.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg"}, "tags": ["Mad Cow Disease", "Moderna", "mrna", "Pfizer", "COVID-19 Vaccines"], "tweets": [], "movies": [], "links": ["http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://ijvtpr.com/index.php/IJVTPR/article/view/23", "https://nationalfile.com/report-pfizer-vaccine-confirmed-to-cause-neurodegenerative-diseases/", "https://nationalfile.com/cia-visits-paraguay-ahead-of-wef-election-coup/", "https://nationalfile.com/video-pro-trans-militants-shut-down-montana-legislature-in-their-latest-attack-on-democracy/", "https://nationalfile.com/video-neil-cavuto-shuts-down-rfk-jr-when-he-calls-for-peace-in-ukraine/", "#", "#", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://ijvtpr.com/index.php/IJVTPR/article/view/23/29", "https://www.bbc.com/news/uk-45906585", "https://www.drugdangers.com/manufacturers/pfizer/", "https://nationalfile.com/tag/covid-19-vaccines/", "https://nationalfile.com/tag/mad-cow-disease/", "https://nationalfile.com/tag/moderna/", "https://nationalfile.com/tag/mrna/", "https://nationalfile.com/tag/pfizer/"], "authors": ["Archive"], "publish_date": "2021-05-12T17:24:02+00:00"}