{"result_id": "205001", "URL": "https://nationalfile.com/jen-kiggans-blocked-vaccine-freedom-volunteered-to-jab-virginians/", "timestamp": "2023-04-25 16:23:18 CEST+0200", "meta": {"description": "GOP Congressional candidate Jen Kiggans helped Democrats block a vaccine freedom bill in the Virginia State Senate.", "lang": "en", "keywords": "", "favicon": "https://nationalfile.com/wp-content/uploads/2019/08/cropped-National-Logo-32x32.jpg", "canonical": "https://nationalfile.com/jen-kiggans-blocked-vaccine-freedom-volunteered-to-jab-virginians/", "encoding": "UTF-8"}, "image": null, "domain": "nationalfile.com", "title": "Jen Kiggans Blocked Vaccine Freedom, Volunteered to Jab Virginians", "cleaned_text": "Last Updated on May 15, 2022\n\nGOP Congressional candidate Jen Kiggans helped Democrats block a vaccine freedom bill in the Virginia State Senate that would have saved the jobs of public employees who refused the experimental treatment as governments at all levels waged a public pressure campaign on the American people. Kiggans, who touts her experience as a nurse on the campaign trail, also volunteered to jab Virginians for the Northam Administration as the problematic COVID-19 vaccine was rolled.\n\nPrimary Day in Virginia’s 2nd Congressional District, where Kiggans is running for the GOP nomination, is set for June 21st. In a GOP field of four candidates, the contest has largely whittled down to a battle between Kiggans and her front-running opponent Jarome Bell. Like in other GOP races around the country this year, the race has become a fight between the America First and establishment wings of the Republican Party and its voters.\n\nWhile Bell recently appeared alongside President Trump at Mar-A-Lago and is endorsed by General Flynn, Jen Kiggans is backed by Kevin McCarthy, who she has promised to support for Speaker of the House. In a recent radio appearance on The John Fredericks Show, Kiggans even refused to back a Trump 2024 run against Joe Biden for President and was blasted by the host for refusing to say Trump’s name in another appearance on the show.\n\nThough she ran for State Senate as a hardline conservative, Kiggans quickly took a giant leap to the left after assuming office, casting the deciding vote in Virginia’s ratification of the abortion-on-demand ERA, and voting with Democrats to open girls’ restrooms up to men. Kiggans, who frequently touts her nursing experience on the campaign trail, also helped the Northam Administration distribute the lethal COVID-19 vaccine to Virginians. To help the Northam Administration get the experimental vaccine to as many people as possible, Kiggans voted for Democrat legislation lowering the standards applied to medical practitioners, allowing for more volunteers to inject Virginians.\n\nShe celebrated her volunteer vaccine distribution in a Facebook post made in September of last year, even including a photograph of herself shooting up a patient with the COVID jab at one of the Northam Administration’s vaccines clinics. Kiggans said she had her entire family vaccinated and encouraged others to do the same.\n\n“As a nurse practitioner, I routinely encourage my patients to be vaccinated…For the flue, for shingles, for pneumonia, & now for COVID19,” Kiggans wrote in a Facebook post. “I have had my two Pfizer vaccines as has my husband, my four children, my siblings, and parents. I have volunteered to give the COVID vaccine on multiple occasions with the VDH Medical Reserve Corps and loved being a part of the effort to vaccinate Virginians.”\n\nKiggans went on in the post to claim that she’s against governments mandating COVID vaccines or “any vaccine” among their citizens but neglected to mention helping Democrats in the State Senate block legislation that would have protected the jobs of Virginians who refused the experimental COVID injection.\n\n“That being said, I believe that the government mandating citizens to get any vaccine is outrageous and unconstitutional,” Kiggans wrote in the Facebook post. “Furthermore, fining businesses and punishing workers who do not comply is an egregious overreach of government and an infringement on our liberties. Big government is never the answer.”\n\nKiggans previously abstained from a vote on Senate Bill 1449, which was introduced by conservative State Senator Amanda Chase and would have protected unvaxxed Virginians by barring “discrimination based on a person’s vaccination status with respect to any COVID-19 vaccine in numerous employment contexts.”\n\nSenator Chase described Kiggans’ refusal to support her pro-medical freedom legislation at Jarome Bell’s Virginia Beach Rally to Right the Ship as his midterm race against Kiggans kicked off, calling on voters to send Bell, not Kiggans, to Washington. Chase also described how Kiggans walked off the Senate floor instead of opposing a Democrat effort to censure Chase over her support for the election integrity movement.", "opengraph": {"locale": "en_US", "type": "article", "title": "Jen Kiggans Blocked Vaccine Freedom, Volunteered to Jab Virginians", "description": "GOP Congressional candidate Jen Kiggans helped Democrats block a vaccine freedom bill in the Virginia State Senate.", "url": "https://nationalfile.com/jen-kiggans-blocked-vaccine-freedom-volunteered-to-jab-virginians/", "site_name": "National File", "article:publisher": "https://facebook.com/nationalfile", "article:published_time": "2022-05-15T13:58:49+00:00", "image": "https://nationalfile.com/wp-content/uploads/2022/05/C0F77199-0F37-48EA-B927-A51367EFF0BB.jpeg", "image:width": "750", "image:height": "372", "image:type": "image/jpeg"}, "tags": ["COVID Vaccine", "VA-2", "Jen Kiggans", "COVID-19", "Vaccine Mandate", "Jarome Bell"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Virginia State Senator Amanda Chase ripped Jen Kiggans for siding w/ Dems against <a href=\"https://twitter.com/hashtag/freespeech?src=hash&amp;ref_src=twsrc%5Etfw\">#freespeech</a>, medical freedom when re-enforcing her endorsment of <a href=\"https://twitter.com/JaromeBellVA?ref_src=twsrc%5Etfw\">@JaromeBellVA</a> in <a href=\"https://twitter.com/hashtag/VA2?src=hash&amp;ref_src=twsrc%5Etfw\">#VA2</a> – Kiggans walked off Senate floor, abstained from vote when Dems + GOPe censured Chase for standing with Trump! <a href=\"https://t.co/Z9xL5j5GIB\">pic.twitter.com/Z9xL5j5GIB</a></p>\n<p>— Frankie Stockes – Reporter (@stockes76) <a href=\"https://twitter.com/stockes76/status/1426138052796235778?ref_src=twsrc%5Etfw\">August 13, 2021</a></p></blockquote>\n"], "movies": [], "links": ["http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/cia-visits-paraguay-ahead-of-wef-election-coup/", "https://nationalfile.com/video-pro-trans-militants-shut-down-montana-legislature-in-their-latest-attack-on-democracy/", "https://nationalfile.com/video-neil-cavuto-shuts-down-rfk-jr-when-he-calls-for-peace-in-ukraine/", "#", "#", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/virginia-republican-jen-kiggans-wont-back-trump-in-2024-got-mocked-for-consultant-driven-answers-in-new-interview/", "https://nationalfile.com/virginia-rino-jen-kiggans-voted-with-dems-on-transgender-bathrooms-now-shes-trying-to-ride-red-wave-to-washington/", "https://m.facebook.com/Jen4VA/photos/a.677486952683323/1308372769594735/?type=3", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/virginia-house-candidate-kiggans-abstained-from-vote-to-block-counties-from-discriminating-against-non-vaxxed-employees/", "https://twitter.com/hashtag/freespeech?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/JaromeBellVA?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/VA2?src=hash&ref_src=twsrc%5Etfw", "https://t.co/Z9xL5j5GIB", "https://twitter.com/stockes76/status/1426138052796235778?ref_src=twsrc%5Etfw", "https://nationalfile.com/tag/covid-vaccine/", "https://nationalfile.com/tag/covid-19/", "https://nationalfile.com/tag/jarome-bell/", "https://nationalfile.com/tag/jen-kiggans/", "https://nationalfile.com/tag/va-2/", "https://nationalfile.com/tag/vaccine-mandate/"], "authors": ["Frankie Stockes"], "publish_date": "2022-05-15T13:58:49+00:00"}