{"result_id": "205013", "URL": "https://nationalfile.com/covid-boosters-increase-risk-of-immune-system-disorder-and-should-be-discontinued-japanese-surgeon-says/", "timestamp": "2023-04-25 16:23:41 CEST+0200", "meta": {"description": "Dr. Kenji Yamamoto, a Japanese cardiovascular surgeon, has penned a letter to the peer-reviewed journal Virology calling for an end to the COVID-19 vaccine booster program in the country.", "lang": "en", "keywords": "", "favicon": "https://nationalfile.com/wp-content/uploads/2019/08/cropped-National-Logo-32x32.jpg", "canonical": "https://nationalfile.com/covid-boosters-increase-risk-of-immune-system-disorder-and-should-be-discontinued-japanese-surgeon-says/", "encoding": "UTF-8"}, "image": null, "domain": "nationalfile.com", "title": "Japanese Surgeon Calls for End to COVID Vaccine Booster Program in Letter to Prominent Medical Journal", "cleaned_text": "Dr. Kenji Yamamoto, a Japanese cardiovascular surgeon, has penned a letter to the peer-reviewed journal that calls for an end to the COVID-19 vaccine booster program in the country. “As a safety measure, further booster vaccinations should be discontinued,” Yamamoto wrote. The highly regarded surgeon cited the fact that COVID-19 vaccines have been linked to vaccine-induced immune thrombotic thrombocytopenia, which has been fatal in a number of patients.\n\nYamamoto works at Okamura Memorial Hospital in Shizuoka, Japan, according to . In the letter he explains that he and his colleagues have “encountered cases of infections that are difficult to control,” including some that occurred after open-heart surgery and were still not under control after several weeks of treatment with multiple antibiotics.\n\nAccording to Yamamoto, affected patients showed signs of being immunocompromised. For some patients, vaccine-induced side effects proved fatal, the letter explains. In addition, Yamamoto believes the COVID-19 mRNA vaccine has suppressed the immune systems of a number of patients.\n\nThe Japanese surgeon’s move is highly irregular, as doctors don’t often submit opinions that fly in the face of the medical status quo.\n\nIn his letter to , Yamamoto cited a Swedish study that reported that eight to nine months after vaccination with two doses, the vaccinated subjects were more likely to contract COVID-19 than their unvaccinated controls. This study also hinted at possible immune-suppression effects as a result of COVID-19 vaccines.\n\nVaccine-induced immune disruption is further supported by Israeli and Indian studies that demonstrated an increased likelihood of shingles following COVID vaccination. The Israeli study reported a risk ratio of 1.43, meaning that vaccination raised the risk of developing shingles by 43 percent.\n\nAt the hospital where Dr. Yamamoto works, patients are screened for Heparin-induced thrombocytopenia antibodies prior to surgeries. Heparin is a drug commonly used to prevent clotting, including during open-heart surgery.\n\nPeople exposed to Heparin sometimes develop antibodies that attack their own platelets, which reduces the available number. The platelets can then clump together as clots, an outcome the drug is supposed to guard against.\n\nYamamoto became alarmed due to the fact that his hospital has seen an unusually high number of positive tests for heparin-induced thrombocytopenia (HIT) antibodies since COVID vaccination began, The Epoch Times reported.\n\nAccording to a September 2021 letter published in the journal Thrombosis, Heparin exposure is not the only contributing factor to HIT. The letter found that COVID-19 vaccination can cause heparin-induced thrombocytopenia as well. When this condition follows COVID vaccination, however, it is known as vaccine-induced thrombotic thrombocytopenia (VITT).\n\nVITT is one of the few adverse events that vaccine compensation review boards in various acknowledged to be caused by COVID-19 vaccines. While government officials have stressed that the condition is “rare,” a large number of individuals who developed it have died.\n\nAccording to Yamamoto, Okamura Memorial Hospital in Shizuoka, Japan has seen several waves of VITT cases since COVID-19 vaccination began.\n\nDue to the increased likelihood of thrombosis, as well as a spike in infections due to suppressed immune function, are two main reasons Yamamoto argues that doctors must record vaccination status prior to performing surgeries. In addition, he has called for the booster program to be halted outright.\n\nRELATED: NBA All-Star Andrew Wiggins Says He Regrets Taking COVID Vaccine Despite Championship Win", "opengraph": {"locale": "en_US", "type": "article", "title": "Japanese Surgeon Calls for End to COVID Vaccine Booster Program in Letter to Prominent Medical Journal", "description": "Dr. Kenji Yamamoto, a Japanese cardiovascular surgeon, has penned a letter to the peer-reviewed journal Virology calling for an end to the COVID-19 vaccine booster program in the country.", "url": "https://nationalfile.com/covid-boosters-increase-risk-of-immune-system-disorder-and-should-be-discontinued-japanese-surgeon-says/", "site_name": "National File", "article:publisher": "https://facebook.com/nationalfile", "article:published_time": "2022-08-05T18:41:01+00:00", "image": "https://nationalfile.com/wp-content/uploads/2022/03/FDA-Fourth-COVID-19-Shot.jpg", "image:width": "1200", "image:height": "675", "image:type": "image/jpeg"}, "tags": ["COVID-19 Vaccines", "Japan", "COVID-19", "vaccine injuries"], "tweets": [], "movies": [], "links": ["http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/cia-visits-paraguay-ahead-of-wef-election-coup/", "https://nationalfile.com/video-pro-trans-militants-shut-down-montana-legislature-in-their-latest-attack-on-democracy/", "https://nationalfile.com/video-neil-cavuto-shuts-down-rfk-jr-when-he-calls-for-peace-in-ukraine/", "#", "#", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8816388/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8427535/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8597588/", "https://ashpublications.org/blood/article/129/21/2864/36268/Heparin-induced-thrombocytopenia", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8443895/", "https://www.theepochtimes.com/covid-vaccine-injuries-quietly-being-compensated-around-the-world-are-you-eligible_4632576.html", "https://nationalfile.com/nba-all-star-andrew-wiggins-says-he-regrets-taking-covid-vaccine-despite-championship-win/", "https://nationalfile.com/tag/covid-19/", "https://nationalfile.com/tag/covid-19-vaccines/", "https://nationalfile.com/tag/japan/", "https://nationalfile.com/tag/vaccine-injuries/"], "authors": ["Cullen McCue"], "publish_date": "2022-08-05T18:41:01+00:00"}