{"result_id": "205033", "URL": "https://nationalfile.com/exclusive-home-of-biden-think-tank-profits-from-covid-vaccines-and-had-staff-shakeup-over-accounting-of-china-money/", "timestamp": "2023-04-25 16:24:22 CEST+0200", "meta": {"description": "Joe Biden's office at his think tank, the Penn Biden Center at the University of Pennsylvania, reportedly housed numerous classified documents.", "lang": "en", "keywords": "", "favicon": "https://nationalfile.com/wp-content/uploads/2019/08/cropped-National-Logo-32x32.jpg", "canonical": "https://nationalfile.com/exclusive-home-of-biden-think-tank-profits-from-covid-vaccines-and-had-staff-shakeup-over-accounting-of-china-money/", "encoding": "UTF-8"}, "image": null, "domain": "nationalfile.com", "title": "EXCLUSIVE: Home of Biden Think Tank Profits From COVID Vaccines And Had Staff Shakeup Over Accounting of CHINA Money", "cleaned_text": "Joe Biden’s office at his think tank, the Penn Biden Center at the University of Pennsylvania, reportedly housed numerous classified documents. The scandal has sparked a review from the Biden regime’s own Department of Justice. Approximately ten classified documents are in question, and were found prior to the midterm elections by Joe Biden lawyers, according to a CBS report. NATIONAL FILE has reported shocking details about vaccine sale profits and an internal staff shakeup at the University of Pennsylvania related to foreign money including money specifically intended to increase Chinese enrollment at the university.\n\nUniversity of Pennsylvania financial documents obtained by NATIONAL FILE show that the UPenn fund that bankrolls Joe Biden’s think tank the Penn Biden Center makes money in “milestone payments” from the sale of Pfizer-BioNTech vaccines and from FDA approvals of the injections. The University of Pennsylvania, which paid Joe Biden prior to his presidential run, was accepting big money from donors apparently to carve out spaces for foreign students at UPenn including from Communist China, and NATIONAL FILE can confirm that internal controversy and a staff shakeup occurred when staff questioned how international funds were being spent. With Joe Biden able to return to the Penn Biden Center after his presidency, Biden puts himself in a position to personally profit from the vaccines he is pushing.\n\nUnder the watch of UPenn president Amy Gutmann, massive amounts of money have flowed into the university’s funds apparently to import students from around the world including from Communist China and the “People’s Republic of China” with administrator notes including “MAKE SURE STUDENT IS FROM CHINA…” Amy Gutmann, the UPenn president who oversaw the establishment of Joe Biden’s think tank the Penn Biden Center in 2018, is now Biden’s Ambassador to Germany. There were arguments in the UPenn administration about where the Chinese-oriented money and other foreign money was going. Some insiders questioned how funds for international students were being managed without transparency, and the arguments led to a staff overhaul. The controversy stemmed from funds set aside for international students.\n\nUPenn’s China links are numerous, as evidenced by its Center for the Study of Contemporary China and the Penn Wharton China Center. In 2019, UPenn’s foreign donations spiked approximately 389 percent.\n\nThe Penn Biden Center is housed on the UPenn campus and in Washington, D.C. pulling funds directly from the general funds of the University of Pennsylvania, and Joe Biden or his surrogates can return to the Penn Biden Center after his presidency. Joe Biden’s think tank was previously managed by his current Secretary of State Tony Blinken. One donation specified “$25k each” in payment to UPenn in exchange for “Students from the People’s Republic of China admitted…”\n\nDocuments obtained by NATIONAL FILE show that the University of Pennsylvania, which hosts and funds Joe Biden’s think tank called the Penn Biden Center, directly profits from the sale of Pfizer-BioNTech and Moderna Coronavirus vaccines. The University gets more money if more vaccines are sold. The University of Pennsylvania also gets “milestone payments” when the Biden administration’s Food and Drug Administration (FDA) approves a Pfizer-BioNTech vaccine, which represents a massive conflict of interest for Biden. BioNTech pays the University of Pennsylvania Board of Trustees directly, and the university is protected from civil liability if people try to sue for “bodily injury” or “death” caused by BioNTech vaccines.\n\nBioNTech signed a licensing agreement in 2018 with the University of Pennsylvania, which directly funds the Penn Biden Center for Diplomacy and Global Engagement. Even though Coronavirus had not yet leaked out of the Wuhan Institute of Virology when the deal was made, the 2018 agreement ensured massive payments for the University of Pennsylvania if its technology ended up getting used in new mRNA-based vaccines. Well, UPenn’s technology did end up getting used in the mRNA-based Coronavirus vaccine produced by Pfizer and BioNTech, and the deal has led to massive revenue for the university. Joe Biden, who was working for the University of Pennsylvania when the deal was made, received more than $900,000 from the University of Pennsylvania in the two years before he ran for president in this past election.\n\nThe University of Pennsylvania also houses the pro-vaccine website FactCheck.org. University of Pennsylvania president Amy Gutmann is now Biden’s nominee for Ambassador to Germany. The Biden administration’s FDA has speedily approved or authorized Pfizer-BioNTech vaccines including for children — all while the Penn Biden Center’s parent university enjoys massive profits from vaccine sales and FDA approval. And the Pfizer-connected FDA even knew about numerous adverse events for children related to the Pfizer-BioNTech vaccine, but allowed children to be injected with it anyway. Now, the direct financial relationship between these vaccines and Joe Biden’s think tank must be exposed.\n\nUniversity of Pennsylvania Profits From Pfizer-BioNTech And Moderna Vaccines\n\nNATIONAL FILE’s source explained to us that “UPenn earns massive payments (actual terms confidential, likely in the billions)” from Pfizer/BioNTech and Moderna vaccines.\n\nThe University of Pennsylvania admitted in December 2020 that “The Pfizer/BioNTech and Moderna COVID-19 mRNA vaccines both use licensed University of Pennsylvania technology. As a result of these licensing relationships, Penn, Dr. Weissman and Dr. Kariko have received and may continue to receive significant financial benefits in the future based on the sale of these products. BioNTech provides funding for Dr. Weissman’s research into the development of additional infectious disease vaccines.” It turns out that Dr. Katalin Kariko is both an adjunct professor at UPenn’s Perelman School of Medicine and also a BioNTech vice president.\n\nOn November 5, 2018, BioNTech stated: “BioNTech AG, a rapidly growing biotechnology company focused on the development of immunotherapies for the precise and individualized treatment of cancer and prevention of infectious diseases and the University of Pennsylvania (Penn), Philadelphia, USA, today announced that they have entered into a strategic research collaboration. The goal of the exclusive, multi-year partnership is to develop novel nucleoside-modified mRNA vaccine candidates for the prevention and treatment of various infectious diseases. Under the terms of the agreement, BioNTech and the lab of Drew Weissman, MD, PhD, at Penn will exchange their in-depth knowledge and experience in mRNA research and development to advance the discovery of novel vaccine candidates. Penn will be responsible for a dedicated preclinical research program from discovery through to the completion of IND-enabling studies in up to ten infectious disease indications. BioNTech will be eligible to receive an exclusive worldwide license to further develop and commercialize product candidates arising from the research collaboration. If proprietary Penn technology is part of a new mRNA-based vaccine, the university will be eligible to receive additional milestone payments and royalties from BioNTech. Detailed financial terms were not disclosed.”\n\nDrew Weissmann’s work led directly to the Coronavirus vaccines including the Pfizer/BioNTech injection. In December 2020, Penn Medicine stated: “The scientific team whose 2005 messenger RNA biology discovery at the University of Pennsylvania helped pave the way for the COVID-19 vaccines from Pfizer/BioNTech and Moderna received their first dose of the Pfizer/BioNTech vaccine together on Friday, Dec. 18 at Penn, more than 20 years after they began their basic science collaboration. Drew Weissman, MD, PhD, a professor of Infectious Diseases in Penn’s Perelman School of Medicine, and Katalin Karikó, PhD, an adjunct associate professor at Penn and a senior vice president at BioNTech, together discovered that exchanging one of the four building blocks of messenger ribonucleic acid (mRNA) molecules could greatly increase its therapeutic potential. They shared their perspectives as longtime researchers in the field who are comfortable taking the vaccines themselves, and called on the public to trust the decades of scientific research that has led to these important vaccines now being deployed in the global fight against the virus, encouraging others to get vaccinated when it becomes available to them.”\n\nHERE IS THE Securities and Exchange Commission (SEC) LICENSING AGREEMENT BETWEEN BIONTECH AND THE TRUSTEES OF THE UNIVERSITY OF PENNSYLVANIA DATED OCTOBER 9, 2018: The agreement states that “All payments to Penn hereunder shall be made by deposit of USD in the requisite amount to the “The Trustees of the University of Pennsylvania…”\n\nAccording to the SEC Licensing Agreement, BioNTech pays the University of Pennsylvania with “milestone payments” for each vaccine approval application that gets approved by the Food and Drug Administration (FDA) or another regulatory agency, up to the first three approvals.\n\nLook at these “Development Milestones” that the University of Pennsylvania gets paid for, and keep in mind that the term “BLA,” according to this agreement, is defined as “an application submitted to a Regulatory Authority for marketing approval of a product, including (a) a Biologics License Application or New Drug Application submitted to the FDA, (b) a Marketing Authorization Application (“MAA”) in the European Union, (c) any equivalent or comparable application, registration or certification in any other country or region, or (d) any successor applications or procedures, supplements or amendments that may be submitted with respect to the foregoing.”\n\nThe BLA process appears to be very lucrative for the University of Pennsylvania. For example, when the FDA approved the Pfizer-BioNTech “COMIRNATY” Coronavirus vaccine in August 2021, the FDA granted “BLA APPROVAL” to the injection.\n\nBioNTech pays the University of Pennsylvania “Commercial Milestone Payments” corresponding to worldwide vaccine sales, meaning that the University of Pennsylvania makes more money if Pfizer-BioNTech sells more vaccines:\n\nThe University of Pennsylvania scored civil legal immunity for itself in its deal with BioNTech, including from any cases of “bodily injury” or “death” that might be associated with the vaccine. According to the SEC Licensing Agreement: “Licensee shall defend, indemnify and hold Penn and its respective trustees, officers, faculty, students, employees, contractors and agents (the “Penn Indemnitees”) harmless from and against any and all liability, damage, loss, cost or expense (including reasonable attorneys’ fees), including, without limitation, bodily injury, risk of bodily injury, death and property damage to the extent arising out of Third Party claims or suits related to: the gross negligence, recklessness or wrongful intentional acts or omissions of Licensee, its Affiliates or Sublicensees and its or their respective directors, officers, employees and agents, in connection with Licensee’s performance of its obligations or exercise of its rights under this Agreement…any violation of Law by Licensee or its Affiliates or Sublicensees…”\n\nJoe Biden’s Penn Biden Center is hosted and reportedly funded by the University of Pennsylvania\n\nIn 2017, University of Pennsylvania president Amy Gutmann announced the launch of the Penn Biden Center for Diplomacy and Global Engagement, with Joe Biden taking over as the head of the Penn Biden Center and also assuming a role as a professor at the University of Pennsylvania. The University of Pennsylvania stated that “The Center will be located in Washington, D.C. Biden will also have an office on the Penn campus in Philadelphia…The Penn Biden Center promises significant impact for both Penn’s teaching and research missions. As Presidential Practice Professor, Biden will hold joint appointments in the Annenberg School for Communication and the School of Arts and Sciences, with a secondary affiliation in the Wharton School.”\n\nJoe Biden made more than $900,000 from the University of Pennsylvania between 2017 and 2019 for very little work. Biden confirmed his leave of absence from the University of Pennsylvania in April 2019 when he kicked off his presidential campaign. The liberal reported that “The center basically functioned as a foreign-policy think tank for Biden’s inner circle. It gave Penn a foothold in Washington…”\n\nUniversity of Pennsylvania professor and vice provost of global initiatives Zeke Emanuel, a key architect of Obamacare when he served in the Obama administration, publicly welcomed Biden to UPenn. Tony Blinken, who now serves as Joe Biden’s Secretary of State, was the Penn Biden Center’s managing director before he ran the Biden State Department. The Penn Biden Center’s current leadership team includes Obama administration alum Caroline Tess, and its business manager is a longtime employee of the University of Pennsylvania. Recent Penn Biden Center officials Ariana Berengaut and Colin Kahl, who pushed pro-vaccine propaganda in the early period of the Coronavirus pandemic, have both worked for either Joe Biden or for the Obama-Biden administration and Kahl is now Biden’s Under Secretary of Defense for Policy. Michael Carpenter, the recent Penn Biden Center managing director who pushes hawkish talking points against Russia, is now working as an ambassador in the Biden administration.\n\nAccording to Politico: “The Penn Biden Center does not fundraise. The University of Pennsylvania uses general funds to operate the center and has no plans to solicit money for it in the future, according to a university spokesperson.”\n\nWhen the Penn Biden Center opened in February 2018, Joe Biden was at the launch ceremony in Washington, D.C. with University of Pennsylvania president Amy Gutmann. The Penn Biden Center brags that “The Penn Biden Center officially opened our doors on February 8, 2018, with an event featuring the President of the University of Pennsylvania, Dr. Amy Gutmann, and a discussion on global affairs between Joe Biden and distinguished journalist and Penn alumna, Andrea Mitchell. The center welcomed guests from Penn and across the worlds of government and foreign policy, including former Secretary of State John Kerry, former National Security Advisor Susan Rice, Attorneys General Eric Holder and Loretta Lynch, and current and former members of the U.S. Congress.”\n\nNATIONAL FILE’s source told us: “Even in FactCheck.Org’s seemingly extensive “A Guide to Pfizer-BioNTech’s COVID-19 Vaccine,” they omit info about their host university’s contributions to mRNA and payments from BioNTech specifically. There is no mention at all of UPenn’s mRNA licensing agreements.”\n\nFactCheck.org, which claims to be “nonpartisan,” states the following on its website: “FactCheck.org is a project of the Annenberg Public Policy Center of the University of Pennsylvania. The APPC was established by publisher and philanthropist Walter Annenberg to create a community of scholars within the University of Pennsylvania that would address public policy issues at the local, state and federal levels.”\n\nThe Annenberg Public Policy Center, which owns FactCheck.org, is based on the University of Pennsylvania campus in Philadelphia and also in Washington, D.C. and is funded with an endowment from the Annenberg Foundation, which partners with the Bill and Melinda Gates Foundation. The Annenberg Foundation is FactCheck.org’s top funder according to its most recent financial disclosure. FactCheck.org also takes funding from Facebook and Google and the Robert Wood Johnson Foundation but claims that its donors “have no control over our editorial decisions.”\n\nFactCheck.org has an extremely close working relationship with its host university. FactCheck.org states that “FactCheck.org receives in-kind support from the Annenberg Public Policy Center including some infrastructure costs as well as supervisory, technical, and administrative support from APPC faculty and staff. We do not attempt to assign a dollar value to these in-kind services, which are funded from the APPC’s own resources.” Kathleen Hall Jamieson, the director of the Annenberg Public Policy Center and the co-founder of FactCheck.org, is a University of Pennsylvania professor. FactCheck.org’s director emeritus Brooks Jackson gave birth to FactCheck.org shortly after joining the Annenberg Public Policy Center. FactCheck.org also states that “Credit card donations may be made through our “Donate” page, which is managed on our behalf by the University of Pennsylvania.” The University of Pennsylvania runs a donation fund for FactCheck.org.", "opengraph": {"locale": "en_US", "type": "article", "title": "EXCLUSIVE: Home of Biden Think Tank Profits From COVID Vaccines And Had Staff Shakeup Over Accounting of CHINA Money", "description": "Joe Biden's office at his think tank, the Penn Biden Center at the University of Pennsylvania, reportedly housed numerous classified documents.", "url": "https://nationalfile.com/exclusive-home-of-biden-think-tank-profits-from-covid-vaccines-and-had-staff-shakeup-over-accounting-of-china-money/", "site_name": "National File", "article:publisher": "https://facebook.com/nationalfile", "article:published_time": "2023-01-10T16:52:25+00:00", "article:modified_time": "2023-01-10T18:15:43+00:00", "image": "https://nationalfile.com/wp-content/uploads/2022/02/bidenandpennpresident.jpg", "image:width": "1800", "image:height": "1200", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/cia-visits-paraguay-ahead-of-wef-election-coup/", "https://nationalfile.com/video-pro-trans-militants-shut-down-montana-legislature-in-their-latest-attack-on-democracy/", "https://nationalfile.com/video-neil-cavuto-shuts-down-rfk-jr-when-he-calls-for-peace-in-ukraine/", "#", "#", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://cscc.sas.upenn.edu/", "https://pwcc.upenn.edu/", "https://www.thedp.com/article/2021/04/foreign-donations-penn-analysis-china", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/fda-committee-members-reviewing-pfizer-vaccine-for-children-have-worked-for-pfizer-have-big-pfizer-connections/", "https://nationalfile.com/fda-knew-about-numerous-adverse-events-for-children-related-to-pfizer-vaccine-approved-it-anyway/", "https://www.pennmedicine.org/news/news-releases/2020/december/penn-mrna-biology-pioneers-receive-covid19-vaccine-enabled-by-their-foundational-research", "https://biontech.de/sites/default/files/2019-08/20181104_20181105_BioNTech-and-the-University-of-Pennsylvania.pdf", "https://www.sec.gov/Archives/edgar/data/0001776985/000119312519241112/d635330dex1019.htm", "https://www.fda.gov/media/151710/download", "https://penntoday.upenn.edu/spotlights/vice-president-joe-biden-lead-penn-biden-center-diplomacy-and-global-engagement", "https://www.inquirer.com/news/joe-biden-penn-salary-lectures-20190712.html", "https://prospect.org/politics/penn-biden-centers-revolving-door/", "https://global.upenn.edu/penn-biden-center/leadership", "https://global.upenn.edu/penn-biden-center/person/rose-garrity", "https://warontherocks.com/2020/04/aftershocks-the-coronavirus-pandemic-and-the-new-world-disorder/", "https://global.upenn.edu/penn-biden-center/news/managing-director-dr-michael-carpenter-speaks-bbc-about-us-russia-relations", "https://www.politico.com/news/2021/01/18/biden-ties-ethics-quandary-for-his-administration-460126", "https://www.factcheck.org/2020/12/a-guide-to-pfizer-biontechs-covid-19-vaccine/", "https://www.annenbergpublicpolicycenter.org/about/", "https://www.interaction.org/our-partners/", "https://www.factcheck.org/our-funding/", "https://www.annenbergpublicpolicycenter.org/people/kathleen-hall-jamieson/", "https://www.factcheck.org/our-staff/", "https://giving.aws.cloud.upenn.edu/fund?fastStart=simpleForm&program=ANS&fund=602014", "https://nationalfile.com/classified-documents-from-bidens-vice-presidency-found-in-office-building/", "https://nationalfile.com/exclusive-fauci-funded-monkeypox-vaccine-maker-paid-bidens-host-university-for-clinical-trial-of-monkeypox-vaccine/"], "authors": ["Patrick Howley"], "publish_date": "2023-01-10T16:52:25+00:00"}