{"result_id": "205036", "URL": "https://nationalfile.com/peer-reviewed-study-94-percent-of-vaccinated-patients-with-subsequent-health-issues-have-abnormal-blood/", "timestamp": "2023-04-25 16:24:27 CEST+0200", "meta": {"description": "Physicians in Italy evaluated the blood of patients who had received at least one dose of an mRNA COVID-19 vaccine and found \"foreign matter\" long after vaccination, a new study shows.", "lang": "en", "keywords": "", "favicon": "https://nationalfile.com/wp-content/uploads/2019/08/cropped-National-Logo-32x32.jpg", "canonical": "https://nationalfile.com/peer-reviewed-study-94-percent-of-vaccinated-patients-with-subsequent-health-issues-have-abnormal-blood/", "encoding": "UTF-8"}, "image": null, "domain": "nationalfile.com", "title": "Peer Reviewed Study: 94 Percent of Vaccinated Patients With Subsequent Health Issues Have Abnormal Blood", "cleaned_text": "Physicians in Italy evaluated the blood of 1,006 patients who had received at least one dose of an mRNA COVID-19 vaccine and found “foreign matter” long after vaccination, according to a new study. Their results were published in the International Journal of Vaccine Theory, Practice, and Research in August 2022, the reported.\n\nThe three surgeons who conducted the study — Franco Giovannini, M.D., Riccardo Benzi Cipelli, M.D., and Giampaolo Pisano, M.D.— examined freshly drawn blood of over 1,000 patients using direct observation under microscopes in order to evaluate the blood.\n\nIn the study, Italian doctors used optical microscopy, or regular light microscopes, to examine the blood. According to the , light microscopy provides a direct image of what is under the lens. This is not the case with electron microscopy. With optical microscopy, doctors are able to better understand a patient’s health by examining blood cell shape, as well as whether they are aggregated (clumped together), in order to make determinations.\n\nIn their 60-page, peer-reviewed study, the Italian physicians detailed case studies based on their observations.\n\nOf the 1006 patients, 426 were men and 580 were women. 141 subjects received just one dose of an mRNA COVID-19 vaccine, 453 received two doses, and 412 had received a booster shot (three doses in total) at the time of the blood draw. The patients ranged in age from 15 to 85, with an average age of 49.\n\nAll 1,006 patients were seeking medical treatment because they were not feeling well, presenting with a wide variety of health issues. On average, the patients whose blood was examined had been vaccinated about one month prior.\n\nOf the 1,006 patients, just five percent — or 58 individuals — had blood that looked normal and healthy.\n\nThe doctors were able to examine the blood of 12 of the patients before they had received any COVID-19 vaccine injections. At that time, prior to vaccination, all 12 of those patients were found to have normal, healthy blood, the researchers reported.\n\nSide-by-side pictures of a patient’s blood before and after vaccination revealed stark differences. Prior to vaccination, the red blood cells are separate from each other and are round, while the blood drawn after vaccination revealed red blood cells that are deformed. Furthermore, the cluster in coagulation around visible “foreign material” that was not present before.\n\nThe foreign material appeared to collect into structures, at times forming crystals, while other times forming long tubes or fibers, researchers reported.\n\nTwo shapes repeatedly noticed by the Italian doctors were “crystal-like chunks and tube-like lengths.”\n\nThe researchers could not confirm that what they were seeing was graphene, though they did point out that graphene can aggregate into shapes similar to those they observed. If graphene was indeed assembling into structures within the bloodstream, it could be a cause of clotting.\n\nGraphene is a form of carbon that occurs when the atoms are arranged in hexagons, making a flat crystal, like a sheet. In this form, carbon behaves chemically like a metallic compound.\n\nGraphene has been used in nasal-delivery flu vaccines, though it has not been listed as an ingredient in Pfizer and Moderna’s mRNA vaccinations. The researchers were unable to test for graphene, and while they could not determine the cause of the abnormal blood observations, they felt their findings needed to be shared with the medical community.\n\nRELATED: Japanese Surgeon Calls for End to COVID Vaccine Booster Program in Letter to Prominent Medical Journal", "opengraph": {"locale": "en_US", "type": "article", "title": "Peer Reviewed Study: 94 Percent of Vaccinated Patients With Subsequent Health Issues Have Abnormal Blood", "description": "Physicians in Italy evaluated the blood of patients who had received at least one dose of an mRNA COVID-19 vaccine and found \"foreign matter\" long after vaccination, a new study shows.", "url": "https://nationalfile.com/peer-reviewed-study-94-percent-of-vaccinated-patients-with-subsequent-health-issues-have-abnormal-blood/", "site_name": "National File", "article:publisher": "https://facebook.com/nationalfile", "article:published_time": "2022-10-05T22:33:20+00:00", "image": "https://nationalfile.com/wp-content/uploads/2022/04/Pfizer-Booster-Vaccine-Kids.jpg", "image:width": "1024", "image:height": "693", "image:type": "image/jpeg"}, "tags": ["Moderna", "vaccine injuries", "mrna", "COVID-19", "Pfizer", "COVID-19 Vaccines"], "tweets": [], "movies": [], "links": ["http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://www.theepochtimes.com/italian-study-blood-patients-after-mrna-shot_4708049.html?utm_source=ai&utm_medium=search", "https://nationalfile.com/cia-visits-paraguay-ahead-of-wef-election-coup/", "https://nationalfile.com/video-pro-trans-militants-shut-down-montana-legislature-in-their-latest-attack-on-democracy/", "https://nationalfile.com/video-neil-cavuto-shuts-down-rfk-jr-when-he-calls-for-peace-in-ukraine/", "#", "#", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://portal.ct.gov/Coronavirus/Covid-19-Knowledge-Base/Vaccine-Ingredients", "https://nationalfile.com/covid-boosters-increase-risk-of-immune-system-disorder-and-should-be-discontinued-japanese-surgeon-says/", "https://nationalfile.com/tag/covid-19/", "https://nationalfile.com/tag/covid-19-vaccines/", "https://nationalfile.com/tag/moderna/", "https://nationalfile.com/tag/mrna/", "https://nationalfile.com/tag/pfizer/", "https://nationalfile.com/tag/vaccine-injuries/"], "authors": ["Cullen McCue"], "publish_date": "2022-10-05T22:33:20+00:00"}