{"result_id": "205034", "URL": "https://nationalfile.com/duke-university-refuses-kidney-transplant-to-dying-girl-for-refusing-covid-vaccine/", "timestamp": "2023-04-25 16:24:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://nationalfile.com/wp-content/uploads/2019/08/cropped-National-Logo-32x32.jpg", "canonical": "https://nationalfile.com/duke-university-refuses-kidney-transplant-to-dying-girl-for-refusing-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "nationalfile.com", "title": "Duke University Refuses Kidney Transplant To Dying Girl For Refusing COVID Vaccine", "cleaned_text": "Two Christian parents, Chrissy and Lee Hicks, both North Carolina Army veterans, have 11 children, including a 14-year-old girl, Yulia, who is a rescued orphan from Ukraine. Yulia has been shuffled around the US and transferred between caretakers several times and has been finally adopted by the Hicks, who feel a strong determination and sense of duty to give their daughter some stability and justice in life. Despite coming this far, Yulia is now being denied a critical organ transplant due to her vaccination status.\n\nTragically, Yulia’s health has been slipping due to a genetic kidney disorder. The Hicks family has sought help and had been embraced and encouraged by Durham Duke medical staff for being a serious-minded family that cared well for Yulia and who followed all medical procedures and guidelines given to them, getting Yulia closer to the transplant process.\n\nBut on November 29, something went wrong for the family.\n\n“To think that a committee can determine someone’s life is terrifying. This is, without a doubt, medical tyranny. What has become of the medical community? How does the refusal of a shot that is known to cause many health issues AND does NOT stop the spread of a disease deny a 14-year lifesaving therapy? How does that happen in America? Today we are sad. Tomorrow is a new day, and God is there with an answer for us,” Chrissy Hicks posted on Yulia’s website.\n\nThe question on their minds is, what if they get the lifesaving surgery for Yulia, and she has complications from the vaccine? Chrissy Hicks shared her concerns with National File.\n\nUp to the late November phone call between the Hicks and the Duke medical staff, the Hicks family believed the vaccination for Yulia was an option and that they could opt out and still get the surgery.\n\nLee Hicks wrote about the timeline of events that got them to the phone call.\n\n” Oct 7, we had an 8-hour appt at Duke to talk to many doctors. Dr. Chambers was the biggest one pushing the vaccine. Dr. Chang said he highly recommended it, but it was not mandatory and that families had gotten transplants without it.\n\nThen we got an email from Catherine Thomas, a wellness coordinator, on Nov 9, stating what vaccines Yulia needed.\n\nThe First email was what they recommended. Then in a second email, the verbiage changed to what she must have or what was required. Yulia was presented to the committee on 10 Nov and denied because of a lack of the vaccine.\n\nDuring the uncomfortable conference call, the staff made it clear that without the vaccination, Yulia would not be considered for surgery. After skirting the issue, one medical staff answered decidedly when asked if the shot was a requirement, saying ‘yes’.\n\nDuring the 15 min phone call, both of the Hicks parents wondered if what they were being told was the official hospital policy because between the members on the conference call that day, there was a great deal of confusion as to why the shot was being required of them or if it was, based on conflicting statements by the medical experts.\n\nThe Hicks family provided National File with a recording of the call:\n\n“We can’t require you to do anything, but we can deny you because you are not following our recommendations,” Catherine Thomas told Chrissy Hicks.\n\nDuring the call, Chambers insisted that the COVID vaccine would boost Yulia’s health even while admitting that the vaccine does not prevent anyone from getting COVID.\n\n“We do not have medical freedom or religious freedom anymore,” Chrissy Hicks told National File in reaction to the conference call conversation. She provided the full 15 min phone call to us.\n\nChrissy spoke further with National File and told her story of finding and adopting Yulia, about her faith in God, her medical background, and her fears -and then dealing with Duke, stopping a few times, feeling overwhelmed with emotion.\n\n“I feel the same about this for my daughter Yulia as I do any of my 8 biological children or other adopted children. Yulia is my child, and I am afraid that the COVID shot will kill her. I have done the research and I have a medical background. I know there will be a lot of blowback on me for bringing this to the public, but I feel very strongly about it,” she said.\n\nThe Duke medical team says that they are following the newest CDC guidelines that say children over two years old need to be vaccinated.\n\nChrissy told National File that there has been no follow-up from Duke after the call and that they are walking in their faith.\n\n“Whoever receives one such child in my name welcomes me.”\n\nDeuteronomy 14:29 says, “And the Levite, because he has no portion or inheritance with you, and the sojourner, the fatherless, and the widow, who are within your towns, shall come and eat and be filled, that the LORD your God may bless you in all the work of your hands that you do.”\n\nThe Hicks have prioritized Yulia’s life, and health needs out of their faith in God. The medical field is not respecting their rights as parents to choose for their child.\n\nMedical research is not convincing Chrissy that she should choose the vaccine for Yulia.\n\nShe told National File: “I have the right to choose and I don’t want to put her at risk. Children are dying unexpectedly and it is scary. Yulia is already compromised. Where does it end for the medical community to force things on us? Yulia has done everything they have asked her to do for months and we did it perfectly, and now they are telling us no, we can’t go further. They are telling her no, and that seems like a great injustice. As her Mom, that is so upsetting to me, because I feel we were called to be together and I want to give her a good life.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Duke University Refuses Kidney Transplant To Dying Girl For Refusing COVID Vaccine", "description": "Two Christian parents, Chrissy and Lee Hicks, both North Carolina Army veterans, have 11 children, including a 14-year-old girl, Yulia, who is a rescued orphan from Ukraine.  Yulia has been shuffled around the US and transferred between caretakers several times and has been finally adopted by the Hicks, who feel a strong determination and sense […]", "url": "https://nationalfile.com/duke-university-refuses-kidney-transplant-to-dying-girl-for-refusing-covid-vaccine/", "site_name": "National File", "article:publisher": "https://facebook.com/nationalfile", "article:published_time": "2022-12-05T19:15:00+00:00", "article:modified_time": "2022-12-06T01:35:09+00:00", "image": "https://nationalfile.com/wp-content/uploads/2022/12/20221205_203157-1.jpg", "image:width": "990", "image:height": "710", "image:type": "image/jpeg"}, "tags": ["North Carolina", "COVID-19 Vaccines", "Duke University"], "tweets": [], "movies": [], "links": ["http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/desantis-becomes-shaken-when-asked-about-his-failing-poll-numbers-vs-trump/", "https://nationalfile.com/breaking-cnn-fires-don-lemon/", "https://nationalfile.com/breaking-fox-news-tucker-carlson-part-ways/", "#", "#", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://christinehicks66.wixsite.com/kidney-for-yulia-gra/post/denied-transplant", "http://www.protectingwealthkit-display.com/yahoo-020723/?sfcid=7014T000000QMmf&ls=001-Display-National-File&cn=855-481-3169&utm_source=National-File&utm_medium=Display&utm_campaign=7014T000000QMmf", "https://nationalfile.com/gofundme-shuts-down-fundraiser-for-8-year-old-suspected-vaccine-injury-victim/", "https://nationalfile.com/tag/covid-19-vaccines/", "https://nationalfile.com/tag/duke-university/", "https://nationalfile.com/tag/north-carolina/"], "authors": ["Kari Donovan"], "publish_date": "2022-12-05T19:15:00+00:00"}