{"result_id": "206027", "URL": "https://nationalsecurity.news/2022-11-30-covid-vaccines-risk-potential-recruits-not-taking.html", "timestamp": "2023-04-25 16:25:11 CEST+0200", "meta": {"description": "Soldiers in the Army National Guard are leaving at a fast rate amid recruitment struggles, causing massive staffing problems. Cpl. Rolando Martin, a national guardsman, was discharged from the Army after 17 years of service for not submitting to the Wuhan coronavirus (COVID-19) vaccine mandate, similar to others whose requests for a religious exemption didn’t […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,conspiracy,covid-19,Dangerous Medicine,deception,dod,freedom,health freedom,Liberty,medical fascism,Medical Tyranny,military,military weapons,national security,Pentagon,vaccine,vaccine mandate,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2022-11-30-covid-vaccines-risk-potential-recruits-not-taking.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "Getting COVID-19 vaccines is a risk potential recruits are not willing to take, says ex-serviceman", "cleaned_text": "Getting COVID-19 vaccines is a risk potential recruits are not willing to take, says ex-serviceman\n\nSoldiers in the Army National Guard are leaving at a fast rate amid recruitment struggles, causing massive staffing problems.\n\nCpl. Rolando Martin, a national guardsman, was discharged from the Army after 17 years of service for not submitting to the Wuhan coronavirus (COVID-19) vaccine mandate, similar to others whose requests for a religious exemption didn’t get approved.\n\nMartin, who is now with the Florida National Guard, said he is aware of people not joining the military because they would have to get vaccinated for COVID-19 and it’s a risk they’re not willing to take.\n\n“Even though Governor DeSantis is in charge, [the Florida National Guard] is financed by the federal government, so they still have to follow everything the active duty does,” Martin said and pointed out that recruiting and retention shortfalls will be sure to continue, not only within active-duty service but in the Army Reserves and National Guard as well.\n\nMartin volunteered for an assignment to help out at the southern border earlier this year. Since he has experience in counter-drug operations, he thought he would be a good fit. “However, as soon as I submitted my paperwork, my platoon sergeant said I wouldn’t be approved because I’m not vaccinated,” he said.\n\nHe was disappointed that he missed out on opportunities for training as well as a promotion to sergeant just because he refused to take the vaccine. “And now, the constant push to take the vaccine gives me anxiety,” he further stated.\n\nMartin also revealed how possible Army recruits are hearing how people are being treated “like second-class citizens” for not taking the vaccine. He attributed this to the “horrible top leadership.”\n\n“This is not the military I joined … the culture of the military is changing rapidly. It’s very unfortunate that we’re going to lose all these people due to the ridiculousness of a vaccine that everybody knows does nothing, yet the DOD keeps pushing it,” he said.\n\nMeanwhile, Maj. Gen. Rich Baldwin, chief of staff of the Army National Guard, told the Associated Press that current challenges to staffing are the worst he’s seen in the past two decades. According to records, more than 7,500 have retired or left the Guard this past fiscal year. (Related: Mike Adams and Dr. Pete Chambers blast Pentagon for weakening military with vaccine mandates, wokeism.)\n\nFredis Kindelan, who was an Army warrant officer for 15 years, resigned from the service in May because he doubted the efficacy and legality of the vaccines.\n\n“I couldn’t in good faith follow the orders of leaders who would not stand up against an unlawful order,” Kindelan told the Epoch Times. “The shots that have been made available to the service member population are exclusively under the emergency use authorization (EUA).”\n\nKindelan was a recruiter for the Army from 2014 to 2017. “Serving in the Army was honorable and prestigious but today’s Army is not what it used to be. And this is reflected in recruitment shortfalls and retention rates,” he said. “Recent recruits are leaving the Army after a shorter-than-desirable timeline.”\n\nHe cited Secretary of Defense Lloyd Austin’s August 2021 directive and argued that it only applies to vaccines that have full approval from the Food and Drug Administration (FDA). He insisted that the soldiers have the right to refuse a product under EUA.\n\n“After exercising the right to refuse the EUA product, I and many others were discriminated against for expressing medical concerns with a product that hadn’t been clinically tested to FDA standards,” he said.\n\nNow the military is struggling to meet training quotas, recruiting numbers and retention numbers. He added that commanders have become so competitive with their fellow commanders that they are more than often drafting fraudulent unit statistics, so they can report to their superiors that they’ve met training obligations.\n\n“Commanders and their senior leaders in the latter part of their service with 10 or more years are so committed to securing their next promotion and retirement pension that they’ve compromised overall readiness and the sustainment of the organization,” he noted. “This cultural behavior leaves little room to preserve a healthy future generation of quality freedom fighters.”\n\nCheck out NationalSecurity.news for more stories like this.\n\nWatch the video below where a whistleblower exposes how the military hides increasing vaccine injuries.\n\nThis video is from the Prisoner channel on Brighteon.com.\n\nMilitary servicemen call for an end to the Pentagon’s vaccine mandate.\n\nCanada’s military to discharge unvaccinated soldiers despite withdrawal of vaccine mandates.\n\nSen. Johnson pushes FDA, CDC and Pentagon for answers about covid vaccine confusion at military bases.", "opengraph": {"title": "Getting COVID-19 vaccines is a risk potential recruits are not willing to take, says ex-serviceman", "type": "article", "url": "https://www.nationalsecurity.news/2022-11-30-covid-vaccines-risk-potential-recruits-not-taking.html", "site_name": "National Security", "description": "Soldiers in the Army National Guard are leaving at a fast rate amid recruitment struggles, causing massive staffing problems. Cpl. Rolando Martin, a national guardsman, was discharged from the Army after 17 years of service for not submitting to the Wuhan coronavirus (COVID-19) vaccine mandate, similar to others whose requests for a religious exemption didn’t […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/11/Soliders-War-Military-1.jpg"}, "tags": ["conspiracy", "big government", "covid-19", "Liberty", "medical fascism", "vaccine wars", "national security", "dod", "vaccine", "deception", "vaccine mandate", "Medical Tyranny", "military weapons", "Pentagon", "freedom", "health freedom", "military"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/militarys-vaccine-mandate-turning-off-potential-new-applicants-amid-recruitment-struggles-former-army-recruiter_4888503.html", "http://medicaltyranny.com", "https://apnews.com/article/health-middle-east-covid-government-and-politics-987f5dbc245858f372eaeeb3edc018bd", "https://naturalnews.com/2022-11-18-adams-chambers-blast-pentagon-for-weakening-military.html", "https://nationalsecurity.news/", "https://www.brighteon.com/5728168f-715d-4263-8d5c-66178af0da10", "https://www.brighteon.com/channels/theprisoner", "https://naturalnews.com/2022-11-10-military-digital-tool-deny-covid-vaccine-exemptions.html", "https://vaccines.news/2022-10-31-military-servicemen-call-end-to-vaccine-mandate.html", "https://pandemic.news/2022-10-20-canada-military-to-discharge-unvaccinated-soldiers.html", "https://fda.news/2022-08-30-johnson-fda-cdc-pentagon-covid-vaccine-military.html", "https://www.theepochtimes.com/militarys-vaccine-mandate-turning-off-potential-new-applicants-amid-recruitment-struggles-former-army-recruiter_4888503.html", "https://apnews.com/article/health-middle-east-covid-government-and-politics-987f5dbc245858f372eaeeb3edc018bd", "https://www.brighteon.com/5728168f-715d-4263-8d5c-66178af0da10", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-11-30-covid-vaccines-risk-potential-recruits-not-taking&linkname=Getting%20COVID-19%20vaccines%20is%20a%20risk%20potential%20recruits%20are%20not%20willing%20to%20take%2C%20says%20ex-serviceman", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}