{"result_id": "206014", "URL": "https://www.nationalsecurity.news/2023-04-04-police-union-exec-involved-fentanyl-charged-doj.html", "timestamp": "2023-04-25 16:25:02 CEST+0200", "meta": {"description": "An executive of a police union in San Jose, California who was reportedly involved in fentanyl deals was charged by the Department of Justice (DOJ). San Jose Police Officers’ Association (SJPOA) Executive Director Joanne Marian Segovia, 64, was charged by the DOJ for allegedly running a drug ring from her home. The agency accused her of […]", "lang": "en", "keywords": "addiction,badhealth,badmedicine,big government,California,corruption,crime,Dangerous Medicine,Department of Justice,drug addiction,drug trafficking,Fentanyl,harmful medicine,Joanne Marian Segovia,Opioids,San Jose Police Department,San Jose Police Officers' Association,valerylfentanyl", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.nationalsecurity.news/2023-04-04-police-union-exec-involved-fentanyl-charged-doj.html", "encoding": "UTF-8"}, "image": null, "domain": "www.nationalsecurity.news", "title": "Police union executive involved in FENTANYL deals slapped with federal charges", "cleaned_text": "An executive of a police union in San Jose, California who was reportedly involved in fentanyl deals was charged by the Department of Justice (DOJ).\n\nSan Jose Police Officers’ Association (SJPOA) Executive Director Joanne Marian Segovia, 64, was charged by the DOJ for allegedly running a drug ring from her home. The agency accused her of using her office computer and SJPOA’s United Parcel Service (UPS) account to illegally order valerylfentanyl – a synthetic form of fentanyl – and other controlled substances. Authorities said Segovia faces a maximum sentence of 20 years in federal prison if convicted.\n\nAccording to the 13-page complaint against Segovia penned by Homeland Security Investigations (HSI) special agent David Vargas, she allegedly received at least 61 packages at her San Jose home. The packages which came from various countries such as China, Canada and India were delivered between October 2015 and January of this year.\n\nAgents first interviewed Segovia on Feb. 1, where she said she “worked for the police department” and that her orders were “supplements.” But upon inspection, the parcels contained various drugs including deadly synthetic opioids and tapentadol, which is normally used to treat severe pain from diabetes-induced nerve damage. (Related: DEA: Fentanyl-laced fake prescription pills now contain potentially LETHAL dose of synthetic opioid.)\n\nThe report also mentioned that Segovia allegedly continued to order the drugs even after the February interview with federal agents. The SJPOA executive director was eventually arrested after investigators seized a parcel in Kentucky that was addressed to her.\n\nIn an exclusive interview with NBC Bay Area, SJPOA President Sean Pritchard described Segovia as the “grandma” of the police union. He also expressed disappointment over Segovia’s links to fentanyl.\n\n“This is not the person we’ve known, the person who has worked with fallen officers’ families, organized fundraisers for officers’ kids – just not who we’ve known over a decade,” said Pritchard. He continued that the police union executive acted alone, telling the outlet: “No indication, zero, that anyone else is involved. No sworn officers. No civilian employees.”\n\nHer neighbors at San Jose were also shocked by the allegations, as per a report by the New York Post.\n\n“This is a complete surprise. There was nothing unusual going on there,” said neighbor Michael Galloway. “She’s more the kind of person you would imagine who would have chocolate chip cookies or something ready for the kids, like a typical grandma.”\n\nAnthony Mata, chief of the San Jose Police Department (SJPD), decried the “disheartening” news of Segovia’s drug links. He said in a statement: “I have become aware of the investigation and charges by an outside agency of a civilian employee of the SJPOA. This news … comes as a shock to me and the leaders and membership of the [police union].” Mata also assured stakeholders that Segovia “was never employed in any capacity” by the SJPD.\n\nSan Jose Mayor Matt Mahan also denounced the “incredibly disturbing allegation” regarding Segovia. “No one is above the law, regardless of who their employer is,” he said, also thanking U.S. Attorney Ismail Ramsey and his colleagues at the DOJ “for aggressively pursuing the sources of fentanyl coming into our communities and holding drug dealers accountable.”\n\nWatch this documentary that tackles the fentanyl crisis in the United States.\n\nThis video is from the Little Blue Bird channel on Brighteon.com.\n\nAlex Jones: FENTANYL crisis victimizes both young and old.\n\nMontana AG calls on Biden to classify fentanyl as a WEAPON OF MASS DESTRUCTION.\n\nSan Francisco homeless people PAID by Biden Regime over $800 in cash and food stamps to be druggie street urchins who deal fentanyl to minors.\n\nAnother risk of fentanyl may be an attraction to junkies – it causes amnesia.", "opengraph": {"title": "Police union executive involved in FENTANYL deals slapped with federal charges", "type": "article", "url": "https://www.nationalsecurity.news/2023-04-04-police-union-exec-involved-fentanyl-charged-doj.html", "site_name": "National Security", "description": "An executive of a police union in San Jose, California who was reportedly involved in fentanyl deals was charged by the Department of Justice (DOJ). San Jose Police Officers’ Association (SJPOA) Executive Director Joanne Marian Segovia, 64, was charged by the DOJ for allegedly running a drug ring from her home. The agency accused her of […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2023/04/Syringe-Drugs-Addict.jpg"}, "tags": ["big government", "drug addiction", "Department of Justice", "Fentanyl", "Joanne Marian Segovia", "San Jose Police Department", "harmful medicine", "crime", "San Jose Police Officers' Association", "Opioids", "drug trafficking", "valerylfentanyl", "addiction", "corruption", "California"], "tweets": [], "movies": [], "links": ["https://nypost.com/2023/03/30/san-jose-police-association-office-manager-arrested-for-importing-fentanyl/", "https://naturalnews.com/2022-11-30-fake-prescription-pills-contain-lethal-dose-opioid.html", "https://www.nbcbayarea.com/news/local/san-jose-police-union-opioids-drugs/3194097/", "https://nypost.com/2023/03/31/fentanyl-dealing-grandma-joanne-segovias-neighbors-shocked/", "https://www.kron4.com/news/bay-area/executive-director-of-the-san-jose-police-officers-association-charged-with-importing-fentanyl/", "https://opioids.news", "https://www.brighteon.com/b3ccd2f3-7067-462a-b1e8-d080de8979bb", "https://www.brighteon.com/channels/yidbuster", "https://www.naturalnews.com/2023-03-28-alex-jones-fentanyl-victimizes-young-and-old.html", "https://opioids.news/2022-09-22-montana-attorney-general-fentanyl-weapon-mass-destruction.html", "https://naturalnews.com/2022-09-18-san-francisco-homeless-people-paid-by-biden-regime.html", "https://addiction.news/2018-02-18-fentanyl-junkies-amnesia.html", "https://nypost.com/2023/03/30/san-jose-police-association-office-manager-arrested-for-importing-fentanyl/", "https://www.nbcbayarea.com/news/local/san-jose-police-union-opioids-drugs/3194097/", "https://nypost.com/2023/03/31/fentanyl-dealing-grandma-joanne-segovias-neighbors-shocked/", "https://www.kron4.com/news/bay-area/executive-director-of-the-san-jose-police-officers-association-charged-with-importing-fentanyl/", "https://www.brighteon.com/b3ccd2f3-7067-462a-b1e8-d080de8979bb", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2023-04-04-police-union-exec-involved-fentanyl-charged-doj&linkname=Police%20union%20executive%20involved%20in%20FENTANYL%20deals%20slapped%20with%20federal%20charges", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}