{"result_id": "206025", "URL": "https://nationalsecurity.news/2023-04-05-cdc-epidemic-intelligence-service-fell-ill-east-palestine.html", "timestamp": "2023-04-25 16:25:09 CEST+0200", "meta": {"description": "New details are coming out on the environmental and human health disaster that took place in East Palestine, Ohio, in February 2023. The Centers for Disease Control (CDC) deployed seven Epidemic Intelligence Service members to East Palestine, Ohio in the aftermath of a “controlled burn” of vinyl chloride from five derailed tanker cars. The agency […]", "lang": "en", "keywords": "acute exposure,acute toxicity,badhealth,badpollution,big government,carcinogens,CDC,chaos,coverup,Department of Transportation,dioxins,East Palestine,environment,Environmental Catastrophe,EPA,Government Failure,human health hazard,Mark DeWine,national security,Ohio government,panic,poison,toxic chemicals,toxins,Vinyl chloride", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2023-04-05-cdc-epidemic-intelligence-service-fell-ill-east-palestine.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "CDC finally admits all seven members of their Epidemic Intelligence Service fell ill while conducting chemical surveys in East Palestine Ohio", "cleaned_text": "CDC finally admits all seven members of their Epidemic Intelligence Service fell ill while conducting chemical surveys in East Palestine Ohio\n\nNew details are coming out on the environmental and human health disaster that took place in East Palestine, Ohio, in February 2023. The Centers for Disease Control (CDC) deployed seven Epidemic Intelligence Service members to East Palestine, Ohio in the aftermath of a “controlled burn” of vinyl chloride from five derailed tanker cars. The agency did not initially report on the health status of these individuals, even though their health status provides important evidence and insight into the toxicity of the disaster. While failing to initially report the truth, the CDC did recently admit that all seven investigators fell ill while conducting surveys in East Palestine, Ohio. There’s no doubt that the East Palestine community was acutely poisoned during the “controlled burn.”\n\nGovernment and public health officials continue to fail us all\n\nAfter refusing to properly secure and transport 1.1 million pounds of vinyl chloride to an incinerator site, the Department of Transportation and the Environmental Protection Agency purposely allowed Norfolk Southern Railroad to drill holes in their derailed tanker cars and burn toxic vinyl chloride in pits. The government of Ohio approved a “controlled burn” on site, with no concern for the acute and long-term toxic exposures to the residents of East Palestine and the surrounding communities.\n\nThe “controlled burn” of vinyl chloride released untold levels of carcinogens into the community and the surrounding environment. The burn left a toxic plume of black smoke that contained an unknown level of dioxins, one of the most toxic substances known to man. The derailment also unleashed untold amounts of ethyl acrylate and isobutylene, two other well-known carcinogens.\n\nResidents of East Palestine, Ohio were acutely poisoned by the government’s “controlled burn” of vinyl chloride\n\nNow the government is releasing new details about seven government workers who fell ill in the aftermath of the burn. A team of seven government investigators with the Epidemic Intelligence Service got sick after conducting surveys in the community. In the aftermath of the disaster, the investigators went door-to-door to survey the residents of East Palestine. All seven investigators fell ill that afternoon with sore throats, headaches, coughing, and nausea. The group completed their work from a hotel, where their symptoms quickly resolved over 24 hours.\n\n“Symptoms resolved for most team members later the same afternoon, and everyone resumed work on survey data collection within 24 hours. Impacted team members have not reported ongoing health effects,” a CDC spokesperson said.\n\n“It adds confirmation that the symptoms reported by East Palestine residents are real and are associated?with environmental exposures from the derailment and chemical fire,” said David Michaels, an epidemiologist and professor at the George Washington University School of Public Health. Two contractors who worked with the EPA also reported acute health symptoms after experiencing “strong odors.”\n\nThis quick onset of symptoms in a cluster of government workers clearly show that the residents of East Palestine were poisoned in some form. In a new state survey, the Ohio Department of Health found that half of respondents experienced acute health effects after the “controlled burn.” A total of 168 After Chemical Exposure (ACE) community surveys were completed. The most commonly reported symptoms were headache (125), anxiety (108), coughing (103), fatigue (97), and irritation, pain or burning skin (88). These symptoms point to more carcinogenic exposures that could be taking place at the cellular level.\n\nRight now, Ohio governor Mike DeWine approved a complete overhaul of the railroad track at the crash site. Approximately 2,000 feet of railroad track will be removed to allow for a more thorough excavation of the contaminated soil. The cleanup project is set to complete by April 30th. Meanwhile, the EPA maintains that the surrounding air and water are safe, despite great public outcry.", "opengraph": {"title": "CDC finally admits all seven members of their Epidemic Intelligence Service fell ill while conducting chemical surveys in East Palestine Ohio", "type": "article", "url": "https://www.nationalsecurity.news/2023-04-05-cdc-epidemic-intelligence-service-fell-ill-east-palestine.html", "site_name": "National Security", "description": "New details are coming out on the environmental and human health disaster that took place in East Palestine, Ohio, in February 2023. The Centers for Disease Control (CDC) deployed seven Epidemic Intelligence Service members to East Palestine, Ohio in the aftermath of a “controlled burn” of vinyl chloride from five derailed tanker cars. The agency […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2023/04/East-palestine-toxic-dioxin-cloud.png"}, "tags": ["big government", "national security", "coverup", "EPA", "Government Failure", "toxins", "human health hazard", "panic", "CDC", "chaos", "acute exposure", "poison", "environment", "toxic chemicals", "Ohio government", "Department of Transportation", "East Palestine", "Environmental Catastrophe", "dioxins", "Mark DeWine", "carcinogens", "acute toxicity", "Vinyl chloride"], "tweets": [], "movies": [], "links": ["https://news.yahoo.com/cdc-team-got-sick-while-181833527.html", "http://dioxins.news", "https://www.cdc.gov/eis/index.html", "https://www.cnn.com/2023/03/31/health/ohio-train-derailment-cdc-team-symptoms/index.html", "https://www.wkyc.com/article/news/special-reports/train-derailment/ohio-department-health-headaches-anxiety-top-symptoms-reported-east-palestine-residents-after-derailment/95-a9fb9975-317d-44c0-b6e2-8e974d8dde5d", "http://pollution.news", "https://news.yahoo.com/cdc-team-got-sick-while-181833527.html", "https://www.cdc.gov/eis/index.html", "https://www.cnn.com/2023/03/31/health/ohio-train-derailment-cdc-team-symptoms/index.html", "https://www.wkyc.com/article/news/special-reports/train-derailment/ohio-department-health-headaches-anxiety-top-symptoms-reported-east-palestine-residents-after-derailment/95-a9fb9975-317d-44c0-b6e2-8e974d8dde5d", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2023-04-05-cdc-epidemic-intelligence-service-fell-ill-east-palestine&linkname=CDC%20finally%20admits%20all%20seven%20members%20of%20their%20Epidemic%20Intelligence%20Service%20fell%20ill%20while%20conducting%20chemical%20surveys%20in%20East%20Palestine%20Ohio", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}