{"result_id": "206023", "URL": "https://nationalsecurity.news/2022-10-28-army-falls-short-of-2022-recruitment-goal.html", "timestamp": "2023-04-25 16:25:08 CEST+0200", "meta": {"description": "The United States Army missed its recruitment goal for the 2022 fiscal year by 25 percent, or 15,000 new soldiers. This comes as the Army already cut its projection for how many new people it could bring into the military. The military’s recruiting shortfall is occurring despite the fact that a recent Gallup survey noted […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Christine Wormuth,enlistment,health freedom,medical fascism,medical martial law,Medical Tyranny,military,military recruitment,national security,United States Armed Forces,United States Army,vaccine mandate", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2022-10-28-army-falls-short-of-2022-recruitment-goal.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "Vaccine mandate adverse effect: Army falls 25% short of 2022 recruitment goal", "cleaned_text": "The United States Army missed its recruitment goal for the 2022 fiscal year by 25 percent, or 15,000 new soldiers. This comes as the Army already cut its projection for how many new people it could bring into the military.\n\nThe military’s recruiting shortfall is occurring despite the fact that a recent Gallup survey noted that 64 percent of Americans have confidence in the nation’s military. The Army is only projected to recruit around 10,000 people this year, and the number of new recruits for 2023 could decline even further. (Related: U.S. Army recommends soldiers suffering under #Bidenflation apply for food stamps – while Congress spends tens of billions on foreign aid.)\n\nThe Army is also set to lose tens of thousands of national guard and reserve soldiers who have refused to get vaccinated against Wuhan coronavirus (COVID-19). Roughly 40,000 National Guard and 22,000 Reserve soldiers have already been cut off from their military benefits for not complying with the vaccine mandate, according to the Army.\n\nThat same vaccine mandate could also be the main reason why thousands of young Americans were opting not to join the armed forces.\n\nMeanwhile, U.S. Army Secretary Christine Wormuth noted that the Army is spending more than ever before on new technologies to replace its aging military infrastructure. But all of this new military tech will be worthless, especially when compared to other major military powers like China, if the Army can’t recruit enough people to be trained on how to handle the new tech.\n\n“We can develop all of the most high-tech weapons systems like we are working on right now, but if we don’t have the kinds of talented, motivated individuals to use those weapons systems, we won’t be able to do what we need to do,” said Wormuth.\n\nNumber of openings in military keeps increasing\n\nThe Army, the largest branch of the U.S. Armed Forces, has a current workforce of around 466,000 people. Given the poor state of the economy and the labor market, where the gap between the number of job openings and job seekers remains wide, the Army is having difficulty retaining its people and finding new recruits.\n\n“We’re competing for talent just like all of the folks in industry are, and the job market is hot right now,” said Wormuth. “Wages have gone up a lot, and that’s great for Americans, but it’s making it harder for us in the Army to compete.”\n\nWormuth noted that all other branches of the military are having trouble recruiting, and she noted that a variety of factors other than the economy are affecting enlistment. A lot of people who do want to sign up are turned away due to learning losses due to the shutdown of schools and the decline in fitness standards among American youth.\n\n“Only about 23 percent of kids between 16 and 21 are able to meet our standards, and some of that, frankly, is reflective of the problem that we have in our country with obesity,” said Wormuth. She added that behavioral health and misconduct are also factors.\n\nPerhaps more worryingly for the secretary is the decreasing “propensity to serve,” or the inclination among the population to serve their country by joining the military. Wormuth regarded this to be a “really hard problem.”\n\n“Right now, only nine percent of young Americans say that they’re interested in joining the military,” she said, noting that declining propensity to serve is one of the military’s long-term challenges.\n\n“That’s going to take time to change, but a lot of it I think is about getting out there and doing a better job of talking to young Americans about what the Army can do for them, and the incredible breadth of skills that they can have access to in the Army,” said Wormuth. “We have over 178 military occupational specialties in the Army and it’s not just infantry.”\n\n“We’ve got data scientists, nurses, doctors, lawyers, paralegals, and I think we’ve got to do a better job of explaining that to young Americans and their parents.”\n\nWatch this clip from “Wake Up America” on Newsmax as hosts Carl Higbie and Amanda Brilhante discuss why all branches of the military are seeing massive recruiting shortfalls.\n\nThis is from the News Clips channel on Brighteon.com.\n\nU.S. military degrading rapidly under Biden, Dem-controlled Congress… now rated “weak” even as global threats are rising.\n\nWoke U.S. military failing to recruit because nobody wants to defend American degeneracy.\n\nActive-duty serviceman blames “woke” policies for Army’s worst recruiting year in nearly five decades.\n\nNavy offering up to $65,000 to pay off student loans of recruits as enlistment figures continue to decline.\n\nAmericans are refusing to join the military despite generous enlistment incentives.", "opengraph": {"title": "Vaccine mandate adverse effect: Army falls 25% short of 2022 recruitment goal", "type": "article", "url": "https://www.nationalsecurity.news/2022-10-28-army-falls-short-of-2022-recruitment-goal.html", "site_name": "National Security", "description": "The United States Army missed its recruitment goal for the 2022 fiscal year by 25 percent, or 15,000 new soldiers. This comes as the Army already cut its projection for how many new people it could bring into the military. The military’s recruiting shortfall is occurring despite the fact that a recent Gallup survey noted […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/10/army.png"}, "tags": ["United States Armed Forces", "big government", "medical fascism", "national security", "United States Army", "vaccine mandate", "Medical Tyranny", "Christine Wormuth", "enlistment", "military recruitment", "health freedom", "medical martial law", "military"], "tweets": [], "movies": [], "links": ["https://www.nbcnews.com/video/military-fights-to-increase-recruiting-as-outdated-perceptions-about-going-off-to-war-remain-151525957895?playlist=mmlsnnd_bestofnbc-nnd", "https://www.nbcnews.com/video/military-fights-to-increase-recruiting-as-outdated-perceptions-about-going-off-to-war-remain-151525957895?playlist=mmlsnnd_bestofnbc-nnd", "https://naturalnews.com/2022-09-13-us-army-recommends-soldiers-suffering-bidenflation-apply-food-stamps-congress-spends-billions.html", "http://medicaltyranny.com", "https://nationalsecurity.news", "https://www.brighteon.com/85da887c-aa52-4c8b-a632-9bf2d209a3e9", "https://www.brighteon.com/channels/newsclipsnow", "https://www.brighteon.com/channels/newsclipsnow", "https://nationalsecurity.news/2022-10-20-u-s-military-degrading-rapidly-under-biden-dem-congress.html", "https://politicalcorrectness.news/2022-08-19-military-failing-recruit-nobody-wants-american-degeneracy.html", "https://wokies.news/2022-08-18-serviceman-blames-woke-policies-worst-recruiting-year.html", "https://nationalsecurity.news/2022-08-09-navy-offering-to-pay-student-loans-recruits.html", "https://collapse.news/2022-07-08-americans-now-refusing-to-join-military.html", "https://www.cnbc.com/2022/10/26/us-army-struggles-to-find-recruits-its-needs-to-win-fight-of-future.html", "https://www.nbcnews.com/video/military-fights-to-increase-recruiting-as-outdated-perceptions-about-going-off-to-war-remain-151525957895?playlist=mmlsnnd_bestofnbc-nnd", "https://www.brighteon.com/85da887c-aa52-4c8b-a632-9bf2d209a3e9", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-10-28-army-falls-short-of-2022-recruitment-goal&linkname=Vaccine%20mandate%20adverse%20effect%3A%20Army%20falls%2025%25%20short%20of%202022%20recruitment%20goal", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}