{"result_id": "206021", "URL": "https://nationalsecurity.news/2022-07-25-military-vaccine-mandate-soldiers-disobey-illegal-orders.html", "timestamp": "2023-04-25 16:25:07 CEST+0200", "meta": {"description": "The Wuhan coronavirus (COVID-19) vaccine mandate for members of the United States Armed Forces is a ploy to get rid of anybody who would refuse to carry out unconstitutional or illegal orders. This is according to Scott Kesterson, host of “BardsFM,” who made the claim on the July 21 episode of his show on Brighteon.TV. “The […]", "lang": "en", "keywords": "Army Reserve,badhealth,badmedicine,BardsFM,big government,Brighteon.tv,conspiracy,covid-19,deep state,health freedom,medical fascism,medical martial law,Medical Tyranny,military vaccine mandate,National Guard,national security,pandemic,Scott Kesterson,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2022-07-25-military-vaccine-mandate-soldiers-disobey-illegal-orders.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "Scott Kesterson: Military COVID-19 vaccine mandate a ploy to get rid of soldiers who would disobey illegal orders – Brighteon.TV", "cleaned_text": "Scott Kesterson: Military COVID-19 vaccine mandate a ploy to get rid of soldiers who would disobey illegal orders – Brighteon.TV\n\nThe Wuhan coronavirus (COVID-19) vaccine mandate for members of the United States Armed Forces is a ploy to get rid of anybody who would refuse to carry out unconstitutional or illegal orders.\n\nThis is according to Scott Kesterson, host of “BardsFM,” who made the claim on the July 21 episode of his show on Brighteon.TV.\n\n“The military’s primary objective right now is getting rid of those that would object to illegal orders,” said Kesterson. “The function of the vax guarantees that those core people that refuse to listen to orders and have proclaimed that the … mandatory vaccinations were illegal orders, the military wants them out.”\n\n“Those should be our heroes, they should be our new leadership in the military, but that’s not what the military sees,” he continued. Kesterson added that the American Deep State has essentially purged the military because it wants soldiers to take an active role in cracking down on dissent.\n\nKesterson noted that the military’s powers are being increased at a steady pace. The military is already working with Homeland Security in several ways, including surveilling Americans on the internet, and Democrats in the House of Representatives are suggesting blocking Congress from the oversight of the military and National Guard when they are deployed domestically. (Related: FBI using counterterrorism resources on parents who oppose school mask mandates.)\n\nAs the economy collapses and as the federal government expands its powers under the guise of so-called climate change, the possibility of the entire military being used to enforce this future “is becoming increasingly real,” Kesterson added.\n\nTens of thousands of soldiers to be purged from the Army and National Guard\n\nBased on recent data from the U.S. Army, as many as 40,000 National Guardsmen and 22,000 Army Reserve soldiers have refused to take COVID-19 vaccines.\n\nWhile these reservists and guardsmen have not been officially discharged from either the military or the National Guard, the U.S. Army has cut them off from their military benefits, making staying extremely difficult.\n\n“Soldiers who refuse the vaccination order without an approved or pending exemption request are subject to adverse administrative actions, including flags, bars to service and official reprimands,” said an Army spokesperson in a statement.\n\nActive service members who refused to be vaccinated have already been disciplined, court-martialed or discharged. Others were even forced to pay back scholarships, education and other privileges they availed of using their status as active members of the military.\n\nThe announcement noted that this represented 13 percent of the Army National Guard and 12 percent of the Army Reserve. In six states alone, between 20 to 30 percent of Army guardsmen are unvaccinated and at risk of dismissal. In 43 other states, over 10 percent of Guard troops remain unvaccinated.\n\nFurthermore, another 3,000 Army reservists and Army National Guard members who filed for religious exemption requests did not have their requests granted.\n\n“We are losing many of our best warriors with real combat and leadership experience from the Iraq and Afghanistan theaters of war, which cannot be replaced,” warned Jonathan Hullihan, an attorney who served as a Navy JAG officer for over 13 years. “If military leadership fails to portray a candid and accurate threat to the Biden Administration that these actions directly threaten the United States’ national security, Congress must intervene.”\n\nWatch this July 21 episode of “BardsFM” as host Scott Kesterson goes into detail regarding the COVID-19 vaccine mandates in America.\n\n“BardsFM” with Scott Kesterson airs every Sunday at 6-7 p.m., Thursday at 5-6 p.m. and Saturday at 4-5 p.m. on Brighteon.TV.\n\nVaccine mandates, military vaccine injuries continue to threaten national security by killing our soldiers.\n\nHouse Republicans introduce bill to reinstate military service members discharged for not complying with COVID-19 vaccine mandate.\n\nHouse Republicans calling for ban on using taxpayer funds for implementing military vaccine mandate.\n\nOur nation’s security is at risk due to Biden’s illegal military vaccine mandate, experts warn.", "opengraph": {"title": "Scott Kesterson: Military COVID-19 vaccine mandate a ploy to get rid of soldiers who would disobey illegal orders – Brighteon.TV", "type": "article", "url": "https://www.nationalsecurity.news/2022-07-25-military-vaccine-mandate-soldiers-disobey-illegal-orders.html", "site_name": "National Security", "description": "The Wuhan coronavirus (COVID-19) vaccine mandate for members of the United States Armed Forces is a ploy to get rid of anybody who would refuse to carry out unconstitutional or illegal orders. This is according to Scott Kesterson, host of “BardsFM,” who made the claim on the July 21 episode of his show on Brighteon.TV. “The […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/07/Troops-National-Guard-US-Capitol-3.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "covid-19", "medical fascism", "Scott Kesterson", "vaccine wars", "deep state", "military vaccine mandate", "national security", "Brighteon.tv", "Army Reserve", "Medical Tyranny", "vaccines", "health freedom", "medical martial law", "National Guard", "BardsFM"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/d3041e41-4fef-41e1-84b0-893f6fd21a5b", "https://www.brighteon.tv/", "https://deepstate.news/", "https://www.washingtontimes.com/news/2022/jul/11/adam-schiff-wants-pentagon-rule-would-block-congre/", "https://www.naturalnews.com/2022-05-16-fbi-using-counterterrorism-resources-on-parents.html", "https://www.thecentersquare.com/national/more-than-60-000-army-soldiers-losing-pay-benefits-over-vaccine-mandate/article_809f3b3c-0371-11ed-8ca2-4bb1b7a118fe.html", "https://abcnews.go.com/Health/wireStory/army-guard-troops-risk-dismissal-vaccine-deadline-looms-85692341", "https://nationalsecurity.news/", "https://www.brighteon.com/d3041e41-4fef-41e1-84b0-893f6fd21a5b", "https://www.brighteon.tv/", "https://medicaltyranny.com/2022-05-09-military-vaccine-injuries-threaten-national-security.html", "https://medicalmartiallaw.com/2022-02-16-house-republicans-bill-reinstate-military-service.html", "https://medicalfascism.news/2022-02-04-republicans-ban-taxpayer-military-vaccine-mandate.html", "https://medicalextremism.com/2022-01-26-nations-security-risk-military-vaccine-mandate.html", "https://www.brighteon.com/d3041e41-4fef-41e1-84b0-893f6fd21a5b", "https://www.washingtontimes.com/news/2022/jul/11/adam-schiff-wants-pentagon-rule-would-block-congre/", "https://www.thecentersquare.com/national/more-than-60-000-army-soldiers-losing-pay-benefits-over-vaccine-mandate/article_809f3b3c-0371-11ed-8ca2-4bb1b7a118fe.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-07-25-military-vaccine-mandate-soldiers-disobey-illegal-orders&linkname=Scott%20Kesterson%3A%20Military%20COVID-19%20vaccine%20mandate%20a%20ploy%20to%20get%20rid%20of%20soldiers%20who%20would%20disobey%20illegal%20orders%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}