{"result_id": "206010", "URL": "https://www.nationalsecurity.news/2023-04-04-political-correctness-hindered-efforts-tackle-asian-grooming-gangs.html", "timestamp": "2023-04-25 16:25:00 CEST+0200", "meta": {"description": "Victims and whistleblowers of grooming gangs, largely made up of British-Pakistani men, have often been ignored by authorities due to political correctness, claimed Prime Minister Rishi Sunak as he announced fresh plans to tackle the long-standing issue. (Article by Thomas Brooke republished from RMX.news) Fresh measures including a new police task force will be created, and […]", "lang": "en", "keywords": "big government,Child abuse,child trafficking,crime,culture wars,ethnic groups,evil,gang,grooming,identity politics,left cult,national security,police state,political correctness,race relations,race war,Rishi Sunak,social justice", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.nationalsecurity.news/2023-04-04-political-correctness-hindered-efforts-tackle-asian-grooming-gangs.html", "encoding": "UTF-8"}, "image": null, "domain": "www.nationalsecurity.news", "title": "Political correctness has hindered efforts to tackle Asian grooming gangs, claims British PM", "cleaned_text": "Victims and whistleblowers of grooming gangs, largely made up of British-Pakistani men, have often been ignored by authorities due to political correctness, claimed Prime Minister Rishi Sunak as he announced fresh plans to tackle the long-standing issue.\n\nFresh measures including a new police task force will be created, and regional police forces will be ordered to improve the recording and analysis of ethnicity data.\n\n“The safety of women and girls is paramount,” said Sunak ahead of Monday’s announcement. “For too long, political correctness has stopped us from weeding out vile criminals who prey on children and young women. We will stop at nothing to stamp out these dangerous gangs.”\n\nA government spokesperson said the plans would help ensure suspects “cannot hide behind cultural sensitivities as a way to evade justice.”\n\nThe police-led task force will be supported by the National Crime Agency and will comprise officers experienced in grooming gang investigations; the officers will work with data analysts to identify perpetrators who may have previously slipped through the net.\n\nHome Secretary Suella Braverman said on Sunday that a culture of political correctness and a fear of being accused of racism or bigotry had resulted in systemic abuse of predominantly White children by British-Pakistani grooming gangs. She insisted that “thousands of children” have had their “childhoods robbed and devastated” by adult men who are “still running wild.”\n\nWhen confronted by a report published by her own department in 2020, which disputed the government’s claim that the vast majority of grooming gangs are made up of Asian males, Braverman cited several previous reports on the problem.\n\nThe first was the 2014 report detailing the findings of an independent inquiry into child sexual exploitation in the northern English town of Rotherham, which concluded that “by far the majority of the perpetrators were described as ‘Asian’ by victims, yet councilors did not engage directly with the Pakistani-heritage community to discuss how best they could jointly address the issue.”\n\n“Several staff described their nervousness about identifying the ethnic origins of perpetrators for fear of being thought racist, and others remembered clear directions from their managers not to do so,” the report stated.\n\nThe second was a 2015 report by Louise Carey, which stated how “anxiety around the ethnicity of perpetrators in Rotherham and other high profile cases may have further discouraged a focus on perpetrators.”\n\n“There have been several reports since about the predominance of certain ethnic groups — and I say, British Pakistani males — who hold cultural values totally at odds with British values, who see women in a demeaned and illegitimate way and who pursue an outdated and frankly heinous approach in terms of the way they behave,” Braverman told Sky News on Sunday\n\n“We’ve got to stamp that out with criminal law and proper safeguarding, and we’re only going to do that if as a society we face up to the facts and truth of what’s going on,” she added.", "opengraph": {"title": "Political correctness has hindered efforts to tackle Asian grooming gangs, claims British PM", "type": "article", "url": "https://www.nationalsecurity.news/2023-04-04-political-correctness-hindered-efforts-tackle-asian-grooming-gangs.html", "site_name": "National Security", "description": "Victims and whistleblowers of grooming gangs, largely made up of British-Pakistani men, have often been ignored by authorities due to political correctness, claimed Prime Minister Rishi Sunak as he announced fresh plans to tackle the long-standing issue. (Article by Thomas Brooke republished from RMX.news) Fresh measures including a new police task force will be created, and […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2023/04/Toddler-Boy-Stripped-Shirt-Sad.jpg"}, "tags": ["political correctness", "big government", "evil", "race war", "Rishi Sunak", "culture wars", "left cult", "crime", "national security", "race relations", "ethnic groups", "identity politics", "social justice", "child trafficking", "police state", "Child abuse", "grooming", "gang"], "tweets": [], "movies": [], "links": ["https://rmx.news/article/political-correctness-has-hindered-efforts-to-tackle-asian-grooming-gangs-claims-british-pm/", "http://content.govdelivery.com/attachments/UKLGIU/2014/09/11/file_attachments/323357/Child%2BSexual%2BExploitation%2Bin%2BRotherham%2B-%2BAlexis%2BJay%2Breport.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/418394/Louise_Casey_report_into_CSE_template_format__4_.pdf", "https://rmx.news/article/political-correctness-has-hindered-efforts-to-tackle-asian-grooming-gangs-claims-british-pm/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2023-04-04-political-correctness-hindered-efforts-tackle-asian-grooming-gangs&linkname=Political%20correctness%20has%20hindered%20efforts%20to%20tackle%20Asian%20grooming%20gangs%2C%20claims%20British%20PM", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}