{"result_id": "206033", "URL": "https://nationalsecurity.news/2022-07-18-fuel-prices-triple-eu-mulls-rationing-gas.html", "timestamp": "2023-04-25 16:25:15 CEST+0200", "meta": {"description": "The European Union (EU) is going down in flames as its fuel taps from Russia run dry. Issues related to the war in Ukraine have resulted in no more gas flowing through the Nord Stream 1 (NS1) pipeline and soon-to-be tripled gas prices across Europe. To avoid what will inevitably become a widespread catastrophe for […]", "lang": "en", "keywords": "big government,chaos,Collapse,economy,energy shortage,energy supply,Europe,European Union,fuel rationing,fuel supply,Germany,inflation,national security,NATO,panic,power,power grid,rationing,scarcirty,shortages,World War III", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2022-07-18-fuel-prices-triple-eu-mulls-rationing-gas.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "As fuel prices poised to TRIPLE, EU mulls rationing gas across bloc", "cleaned_text": "As fuel prices poised to TRIPLE, EU mulls rationing gas across bloc\n\nThe European Union (EU) is going down in flames as its fuel taps from Russia run dry.\n\nIssues related to the war in Ukraine have resulted in no more gas flowing through the Nord Stream 1 (NS1) pipeline and soon-to-be tripled gas prices across Europe.\n\nTo avoid what will inevitably become a widespread catastrophe for the European economy, EU officials are reportedly discussing fuel rationing as the next step in their standoff against Russian President Vladimir Putin, who quite frankly appears to be winning on every front.\n\nShould the NS1 pipeline never get turned back on due to issues with a key engine turbine component that is still stuck in Canada due to sanctions, Western Europe faces a total loss of energy in the coming months.\n\nUp until now, the public was simply hearing about these problems on the news. Now, however, the consequences of failed political leadership are turning into sky-high gas prices and now the potential for forced rationing.\n\nA recent poll found that more than 60 percent of German citizens fear there will not be enough gas to go around this winter, especially since some people will be stocking up and hoarding what they can before prices triple come 2023.\n\nGermans are starting “to sweat” as they realize there will be no gas available for heat this winter\n\nDraft EU measures propose limiting the heating of public and commercial buildings to 19 degrees Celsius, or around 66 degrees Fahrenheit, which is cold enough to require the use of extra layers of clothing indoors.\n\nPrivate households are also being encouraged to lower their thermostats by one degree, a proposal that was also made back in February right after Russia invaded Ukraine.\n\n“Acting now can reduce the effects of a sudden supply disruption by a third,” the draft proposal states, adding that “everyone can now save gas.”\n\nThe more people comply with the proposal voluntarily, the document goes on to state, “the less the need for mandatory restrictions for the industry.”\n\nDespite efforts to prioritize the use of gas for hospitals and households, reports explain that individual member states will still have the option to siphon gas away towards other uses if they so choose.\n\nIt will be a feeding frenzy, in other words, of European countries fighting and vying for every drop of gas they can get their hands on before it all runs out.\n\nWhat has been initially just a possibility of gas shortages this winter is quickly becoming a sure reality the longer the standoff between NATO and Russia goes. And it is clear that Germany and its allies are on the side that will suffer, not Russia.\n\nA poll by Der Spiegel found that 63 percent of the German population now fears a shortage of gas for heat this winter. Among women, that percentage is even higher at around 67 percent.\n\nWhat is more, there is widespread concern that even if enough gas is available to service everyone, it will be too expensive for many to even use it.\n\n“By 2023, gas customers will have to expect the installments to triple, at least,” said Germany’s Federal Network Agency head Klaus Müller.\n\nAs reality sets in, some in the German government are finally conceding that they may have to work with Russia rather than continue to hold an offensive stance against the country – especially since that stance is all hot air as Germany and NATO have no actual bargaining chips in this game of political poker.\n\n“The unspoken realization is that the renewable energy fantasy is exposed for its frailty and uselessness in replacing a fossil fuel-based economy,” noted a commenter at Breitbart News.\n\nThe latest news about the gas situation in Europe can be found at FuelRationing.news.", "opengraph": {"title": "As fuel prices poised to TRIPLE, EU mulls rationing gas across bloc", "type": "article", "url": "https://www.nationalsecurity.news/2022-07-18-fuel-prices-triple-eu-mulls-rationing-gas.html", "site_name": "National Security", "description": "The European Union (EU) is going down in flames as its fuel taps from Russia run dry. Issues related to the war in Ukraine have resulted in no more gas flowing through the Nord Stream 1 (NS1) pipeline and soon-to-be tripled gas prices across Europe. To avoid what will inevitably become a widespread catastrophe for […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/07/Fuel-Oil-Barrels-Gas.jpg"}, "tags": ["big government", "fuel supply", "national security", "scarcirty", "panic", "chaos", "shortages", "energy supply", "rationing", "power grid", "Germany", "World War III", "European Union", "economy", "power", "NATO", "Europe", "energy shortage", "fuel rationing", "Collapse", "inflation"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/europe/2022/07/15/eu-mulling-rationing-gas-across-bloc-as-public-told-to-expect-prices-to-triple/", "https://naturalnews.com/2022-07-12-germany-france-total-cutoff-russian-gas-collapse.html", "http://fuelrationing.news", "https://www.breitbart.com/europe/2022/07/15/eu-mulling-rationing-gas-across-bloc-as-public-told-to-expect-prices-to-triple/", "https://naturalnews.com/2022-07-12-germany-france-total-cutoff-russian-gas-collapse.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-07-18-fuel-prices-triple-eu-mulls-rationing-gas&linkname=As%20fuel%20prices%20poised%20to%20TRIPLE%2C%20EU%20mulls%20rationing%20gas%20across%20bloc", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}