{"result_id": "206038", "URL": "https://www.nationalsecurity.news/2022-08-18-ducey-plugs-border-wall-holes-shipping-containers.html", "timestamp": "2023-04-25 16:25:18 CEST+0200", "meta": {"description": "Arizona Gov. Doug Ducey, fed up with the Biden administration’s inaction over the border crisis, took matters into his own hands. The Republican leader used shipping containers to plug gaps in the border wall, in a bid to prevent the continued intrusion of illegal immigrants into the border state. Through an executive order, Ducey ordered 60 double-stacked […]", "lang": "en", "keywords": "Arizona,big government,border crisis,border gaps,border security,Border Wall,Doug Ducey,Illegal aliens,illegal immigrants,illegal immigration,invasion usa,national security,Open Borders,shipping containers,Yuma", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.nationalsecurity.news/2022-08-18-ducey-plugs-border-wall-holes-shipping-containers.html", "encoding": "UTF-8"}, "image": null, "domain": "www.nationalsecurity.news", "title": "Arizona Gov. Doug Ducey plugs holes in border wall with shipping containers", "cleaned_text": "Arizona Gov. Doug Ducey, fed up with the Biden administration’s inaction over the border crisis, took matters into his own hands. The Republican leader used shipping containers to plug gaps in the border wall, in a bid to prevent the continued intrusion of illegal immigrants into the border state.\n\nThrough an executive order, Ducey ordered 60 double-stacked shipping containers to fortify border wall gaps. The containers were erected at the city of Yuma, which is the state’s main entry point for illegal aliens entering the United States.\n\nA news release stated that the stacked shipping containers weigh 8,800 pounds and stand 22 feet high. The containers would be linked together, welded shut and reinforced with razor wire at the top. Contractors of the $6 million project began work on Aug. 12 and completely plugged a 1,000-foot gap in the border wall by Aug. 14.\n\n“Arizona has had enough,” said the governor of the Grand Canyon State. “We can’t wait any longer. The Biden administration’s lack of urgency on border security is a dereliction of duty. For the last two years, Arizona has made every attempt to work with Washington to address the crisis on our border.”\n\nHowever, the shipping containers used to plug the border wall gaps did not last long.\n\nA stack of two shipping containers was found collapsed on a nearby dirt road in Gadsden, Arizona. Journalist Claudia Ramos first broke the news on Aug. 15, thanks to a photo she shared on Twitter.\n\nBut this did not deter the GOP governor, who ordered that similar works be commenced on two other sites farther north. The sites located near the Morelos Dam call for 2,000 feet of open space to be fenced off so that illegals would not be able to enter.\n\nWith President Joe Biden refusing to listen to the pleas of Ducey and other governors, time is of the essence for the Arizona chief executive. Ducey is determined not to let more illegal aliens enter and further drain the Grand Canyon State’s coffers.\n\nYuma Mayor Doug Nicholls expressed agreement with the bold steps Ducey is taking to address illegal immigrants, such as closing off gaps in the border wall. After all, he was forced to declare an emergency in the city back in Dec. 9, 2021. The declaration stemmed from an invasion of illegal aliens that Yuma can ill afford to take care of.\n\nAccording to Yuma County Sheriff Leon Wilmot, the local 911 dispatch center was inundated with calls on Dec. 9 from illegal aliens asking for transport, food and clothing. Nicholls later attested to this, saying that Yuma – home to almost 100,000 residents – does not have sufficient resources to handle illegal border crossers numbering by the thousands. (Related: Report: Arizona follows Texas lead and starts busing illegal immigrants to Washington, D.C.)\n\n“The surge of migrants the federal government has allowed to trek over the border has the grave potential to greatly impact and strain our community,” Nicholls said on Aug. 12 in a press release. “Washington must send a clear message that this is not the way to immigrate to our country.”\n\n“National security starts with border security,” he said in a press release. “Biden’s border crisis deteriorates daily, while the White House is silent. Border communities like Yuma bear the burden of a broken border while narcotics poison our youth, human smuggling rises and mass amounts of migrants wear on our nonprofits.”\n\nYuma has three big holes in its part of the border wall, totaling about seven miles. Ducey intends to seal them all for the safety of both border agents and residents, with or without assistance from Washington.\n\nBorderSecurity.news has more on Arizona and other states plugging gaps in the border wall.\n\nWatch this news report about Arizona Gov. Doug Ducey’s use of shipping containers to plug holes in the border wall.\n\nThis video is from the GalacticStorm channel on Brighteon.com.\n\nGovernors in Arizona, Texas bypass corrupt Biden regime and request law enforcement help from other states to combat illegal immigration, drug trafficking.\n\nINSANE video: Migrants push children under water, through razor wire to get into U.S. – and STILL Democrats say ‘there’s no crisis on the border.’\n\nDemocrats who support open borders now complain when Texas, Arizona send illegal migrants to their cities.", "opengraph": {"title": "Arizona Gov. Doug Ducey plugs holes in border wall with shipping containers", "type": "article", "url": "https://www.nationalsecurity.news/2022-08-18-ducey-plugs-border-wall-holes-shipping-containers.html", "site_name": "National Security", "description": "Arizona Gov. Doug Ducey, fed up with the Biden administration’s inaction over the border crisis, took matters into his own hands. The Republican leader used shipping containers to plug gaps in the border wall, in a bid to prevent the continued intrusion of illegal immigrants into the border state. Through an executive order, Ducey ordered 60 double-stacked […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/08/Shipping-Containers.jpg"}, "tags": ["big government", "Open Borders", "Arizona", "national security", "border security", "shipping containers", "Yuma", "border crisis", "illegal immigrants", "Illegal aliens", "illegal immigration", "invasion usa", "Border Wall", "Doug Ducey", "border gaps"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/arizona-has-had-enough-starts-stacking-shipping-containers-in-border-wall-gaps_4661360.html", "https://www.msn.com/en-us/news/world/gov-duceys-shipping-container-barrier-along-border-toppled-just-1-day-after-completion/ar-AA10JOnU", "http://joebiden.news", "https://naturalnews.com/2022-05-18-arizona-starts-busing-illegal-immigrants-to-washington.html", "https://bordersecurity.news/", "https://www.brighteon.com/586ba846-982f-4f2b-a55a-dba2e085f33c", "https://www.brighteon.com/channels/galacticstorm", "https://www.brighteon.com/channels/galacticstorm", "https://invasionusa.news/2021-06-16-governors-arizona-texas-bypass-biden-regime-law-enforcement-help-states.html", "https://migrants.news/2019-04-04-migrants-push-children-under-water-through-razor-wire.html", "https://invasionusa.news/2022-07-31-democrats-supporting-open-borders-complain-illegal-migrants.html", "https://www.theepochtimes.com/arizona-has-had-enough-starts-stacking-shipping-containers-in-border-wall-gaps_4661360.html", "https://www.msn.com/en-us/news/world/gov-duceys-shipping-container-barrier-along-border-toppled-just-1-day-after-completion/ar-AA10JOnU", "https://www.brighteon.com/586ba846-982f-4f2b-a55a-dba2e085f33c", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-08-18-ducey-plugs-border-wall-holes-shipping-containers&linkname=Arizona%20Gov.%20Doug%20Ducey%20plugs%20holes%20in%20border%20wall%20with%20shipping%20containers", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}