{"result_id": "206008", "URL": "https://nationalsecurity.news/2023-04-05-political-correctness-preventing-uk-stop-grooming-gangs.html", "timestamp": "2023-04-25 16:24:59 CEST+0200", "meta": {"description": "British Prime Minister Rishi Sunak recently claimed that concerns over political correctness have hampered efforts to root out grooming gangs because these gangs are mostly made up of British-Pakistani men. Sunak, a practicing Hindu of Indian Punjabi descent, made this claim as he announced the creation of a new police task force to help crack […]", "lang": "en", "keywords": "big government,Britain,British Pakistanis,Child abuse,child trafficking,crime,criminals,culture wars,groomers,grooming gangs,identity politics,left cult,national security,political correctness,race relations,race war,Rishi Sunak,social justice,Suella Braverman,United Kingdom", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2023-04-05-political-correctness-preventing-uk-stop-grooming-gangs.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "British PM: Political correctness is preventing efforts to stop grooming gangs in the UK", "cleaned_text": "British PM: Political correctness is preventing efforts to stop grooming gangs in the UK\n\nBritish Prime Minister Rishi Sunak recently claimed that concerns over political correctness have hampered efforts to root out grooming gangs because these gangs are mostly made up of British-Pakistani men.\n\nSunak, a practicing Hindu of Indian Punjabi descent, made this claim as he announced the creation of a new police task force to help crack down grooming gangs in the United Kingdom.\n\n“The safety of women and girls is paramount,” said Sunak. “For too long, political correctness has stopped us from weeding out vile criminals who prey on children and young women. We will stop at nothing to stamp out these dangerous gangs.” (Related: Great Britain becomes Great REPLACEMENT as forced Islamization reaches point of no return.)\n\nA government spokesperson added that Sunak’s government will make sure that suspects of grooming, whatever their race, “cannot hide behind cultural sensitivities as a way to evade justice.”\n\nSunak’s statement comes just one day after British Home Secretary Suella Braverman, a practicing Buddhist of Tamil and Goan Indian descent, made a series of media interviews criticizing the culture of silence surrounding British-Pakistani-majority male gangs that are involved in child sexual abuse due to the fear of being called racist or politically incorrect.\n\nBraverman warned that this culture of political correctness and the fear of being accused of racism or bigotry had resulted in systemic abuse of predominantly White children by British-Pakistani grooming gangs growing unchallenged. She insisted that “thousands of children” have had their “childhoods robbed and devastated” by adult men who are “still running wild.”\n\n“Vulnerable White girls living in troubled circumstances have been abused, drugged, raped and exploited,” said Braverman.\n\n“There have been several reports … about the predominance of certain ethnic groups – and I say, British Pakistani males – who hold cultural values totally at odds with British values, who see women in a demeaned and illegitimate way and who pursue an outdated and, frankly, heinous approach in terms of the way they behave,” she added. “We’ve got to stamp that out with criminal law and proper safeguarding, and we’re only going to do that if as a society we face up to the facts and truth of what’s going on.”\n\nSunak supported Braverman’s point, saying it isn’t right that cases of victims and whistleblowers coming forward were “often ignored” by social workers, local politicians and local police officers because of “cultural sensitivity and political correctness.” He noted that it is not right to ignore certain cases due to the ethnicity of the alleged perpetrators.\n\n“All forms of child sexual exploitation carried out by whoever are horrific and wrong. These crimes are horrific and that is why the actions we are announcing today are right and they have been welcomed by people, and I have been speaking to survivors today and others involved,” said Sunak. “They will make a big difference in helping us root out the evil perpetrated by grooming gangs.”\n\nSunak to create new task force against grooming gangs\n\nAccording to the new plan crafted by Sunak’s government, a new task force made up of specialist officers supported by the National Crime Agency will be sent to help regional police forces with their investigation into cases of child sexual exploitation. These same local police forces, supported by the specialist officers, will also be ordered to improve the recording and analysis of ethnicity data.\n\nThe specialists who will be assigned to this new task force will be composed of officers who are experienced in investigations into grooming gangs. The officers will be working with data analysts to identify perpetrators who may have previously slipped through the net, possibly due to their ethnic backgrounds.\n\nThe government noted that better recording and analysis of ethnicity data will prevent abusers from evading justice due to “cultural sensitivities.”\n\nSunak also vowed that the members and leaders of these grooming gangs will receive the toughest sentences possible with the introduction of proposed legislation to help crack down on child abuse.\n\nWatch this clip from GB News as human rights activist Yasmine Mohammed discusses how people refuse to discuss the spread of grooming gangs in the U.K. due to fears of being called Islamophobic.\n\nThis video is from the PureTrauma357 channel on Brighteon.com.\n\nChristian nurse in Britain suspended from course after saying “being white doesn’t make you racist.”\n\nORWELLIAN: Publisher updating Roald Dahl’s British literary classics to “woke” versions in new eBook releases.\n\nChildren’s director “accused of raping dozens of boys” found dead at home on Christmas eve.\n\nUK state-run health system demands written explanation whenever white candidates are hired over ethnic “minorities.”\n\nFrance in shock: 4 Algerian migrants arrested for brutal rape and murder of 12-year-old Paris girl found stuffed in a suitcase with throat slashed.", "opengraph": {"title": "British PM: Political correctness is preventing efforts to stop grooming gangs in the UK", "type": "article", "url": "https://www.nationalsecurity.news/2023-04-05-political-correctness-preventing-uk-stop-grooming-gangs.html", "site_name": "National Security", "description": "British Prime Minister Rishi Sunak recently claimed that concerns over political correctness have hampered efforts to root out grooming gangs because these gangs are mostly made up of British-Pakistani men. Sunak, a practicing Hindu of Indian Punjabi descent, made this claim as he announced the creation of a new police task force to help crack […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2023/04/Sad-Girl-Homeless-Abuse-Depressed.jpg"}, "tags": ["big government", "British Pakistanis", "Rishi Sunak", "race war", "United Kingdom", "national security", "left cult", "crime", "criminals", "identity politics", "culture wars", "groomers", "grooming gangs", "Child abuse", "social justice", "race relations", "child trafficking", "political correctness", "Britain", "Suella Braverman"], "tweets": [], "movies": [], "links": ["https://rmx.news/article/political-correctness-has-hindered-efforts-to-tackle-asian-grooming-gangs-claims-british-pm/", "https://www.wionews.com/world/explained-uk-pm-sunaks-task-force-for-grooming-gang-crackdown-will-not-adhere-to-political-correctness-578650", "https://www.naturalnews.com/2022-12-24-great-britain-great-replacement-islamization.html", "http://politicalcorrectness.news", "https://www.bbc.com/news/uk-65160429", "https://www.dailymail.co.uk/news/article-11932867/Rishi-Sunak-tells-police-ignore-ethnicity-grooming-gangs.html", "http://groomers.news", "https://www.brighteon.com/c69f4233-8666-4baf-bfb0-ad6f3f497ad1", "https://www.brighteon.com/channels/puretrauma357", "https://www.brighteon.com/channels/puretrauma357", "https://racerelations.news/2023-02-28-christian-nurse-in-britain-suspended-being-white-doesnt-make-you-racist.html", "https://politicalcorrectness.news/2023-02-28-publisher-updating-roald-dahls-british-literary-classics-woke.html", "https://www.naturalnews.com/2023-01-01-childrens-director-accused-of-raping-dozens-of-boys.html", "https://racewar.news/2022-12-30-uk-nhs-written-explanation-white-hires-ethnic.html", "https://violence.news/2022-10-19-algerian-migrants-brutal-rape-murder-paris-girl.html", "https://rmx.news/article/political-correctness-has-hindered-efforts-to-tackle-asian-grooming-gangs-claims-british-pm/", "https://www.wionews.com/world/explained-uk-pm-sunaks-task-force-for-grooming-gang-crackdown-will-not-adhere-to-political-correctness-578650", "https://www.bbc.com/news/uk-65160429", "https://www.dailymail.co.uk/news/article-11932867/Rishi-Sunak-tells-police-ignore-ethnicity-grooming-gangs.html", "https://www.brighteon.com/c69f4233-8666-4baf-bfb0-ad6f3f497ad1", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2023-04-05-political-correctness-preventing-uk-stop-grooming-gangs&linkname=British%20PM%3A%20Political%20correctness%20is%20preventing%20efforts%20to%20stop%20grooming%20gangs%20in%20the%20UK", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}