{"result_id": "206006", "URL": "https://www.nationalsecurity.news/2023-03-30-marxist-fails-to-shutter-south-african-economy.html", "timestamp": "2023-04-25 16:24:57 CEST+0200", "meta": {"description": "South Africans nervously waited for the controversial “national shutdown” organized last March 20 by the radical Marxist Economic Freedom Fighters (EFF). Fortunately, reports confirmed that the opposition party’s attempt to shutter the economy fell way short, with demonstrations attracting limited interest and most major towns and transport links continuing to operate “business as usual.” There were […]", "lang": "en", "keywords": "African National Congress,big government,chaos,Collapse,conspiracy,Cyril Ramaphosa,democracy,disruption,Economic Freedom Fighters,economic riot,economy,failure,fascism,Marxism,national security,propaganda,protest,Resist,revolt,South Africa,Tyranny,uprising", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.nationalsecurity.news/2023-03-30-marxist-fails-to-shutter-south-african-economy.html", "encoding": "UTF-8"}, "image": null, "domain": "www.nationalsecurity.news", "title": "Marxist group FAILS to shutter South African economy", "cleaned_text": "South Africans nervously waited for the controversial “national shutdown” organized last March 20 by the radical Marxist Economic Freedom Fighters (EFF).\n\nFortunately, reports confirmed that the opposition party’s attempt to shutter the economy fell way short, with demonstrations attracting limited interest and most major towns and transport links continuing to operate “business as usual.”\n\nThere were only sporadic disruptions, including some road closures and some stores shutting their doors, mainly in the city centers where marches were held. The EFF’s protest is to complain against the ruling African National Congress (ANC), South African President Cyril Ramaphosa, the rolling blackouts and the total collapse of the power grid.\n\nOverall, the rally “was a resounding failure,” according to Gerhard Papenfus, chief executive officer of the National Employers Association of South Africa. “Seventy-six percent of businesses remained open; 70 percent of these businesses experienced less than 10 percent absenteeism,” Papenfus said in an email.\n\nThe local law enforcers maintained a strong presence as the authorities sought to prevent a repeat of the riots and looting that followed the arrest of former President Jacob Zuma in 2021.\n\nIn a video message prior to the “shutdown,” EFF leader Julius Malema called on the public to “stand up, let’s go and fight, don’t be cowards.” “The streets are calling, we all have to occupy all the streets of South Africa. Wherever you are, make your voice be heard,” Malema said, adding that Ramaphosa and the ANC are corrupt.\n\nMeanwhile, the Democratic Alliance (DA), the country’s second-largest party, asked the court for an urgent injunction to stop the “absurd” and “illegal” shutdown, with DA Member of Parliament (MP) Andrew Whitfield saying that the plan was a “very clear and present threat to the economy, the safety and rights of citizens as well as to public and private infrastructure.”\n\nThe EFF has been accused of inciting violence against white farmers through its use of the “Kill the Boer” song at its rallies. (Related: Unrest surges in South Africa, which is rapidly becoming a failed state.)\n\nRamaphosa: Forcing people to protest is abuse of human rights\n\nOn March 21, Ramaphosa took a swipe at the EFF during an event in the Northern Cape to mark Human Rights Day over the group’s attempts to coerce the citizens into participating in protests against his leadership the previous day, calling its action an abuse of human rights.\n\n“Even though others would want to diminish this democracy, even though others would want to abuse the rights of others, intimidate them, compel them to participate in protests, compel them to participate in days when they should not go to work, I am happy that the majority of South Africans did not heed the call,” he said.\n\nAbout 400 people joined the march, while several thousand others dressed in red EFF t-shirts and berets gathered at Church Square in Pretoria’s city center where they were addressed by Malema before marching to the president’s office. “We are not going to do anything. We just walk nicely and raise our concerns,” Malema said.\n\nThe government maintained that the demonstration was a flop as most businesses had opened in defiance of the call to close down.\n\nAccording to Reuters, more than 550 protesters had been arrested during the protest on charges of public violence, intimidation, damage to critical infrastructure and theft.\n\nMarxism.news has more stories related to Marxist ideologies and movements worldwide.\n\nWatch the video below that talks about the brewing civil war conditions in South Africa as the electric grid collapses.\n\nThis video is from the TNTVNEWS channel on Brighteon.com.\n\nSituation spiraling out of control in South Africa as supply chains collapse, unrest turns violent, claiming dozens of lives.\n\nWhat’s happening now in Marxist/Communist South Africa is a dire warning of what’s coming to America as leftists, liars, looters and loonies run country into the ground.\n\nSouth Africans protest against coronavirus vaccine trials that exploit black lives – but will leftists care?\n\nMedical police state: South Africa to mandate tests, vaccination, indefinite quarantine in the name of health.", "opengraph": {"title": "Marxist group FAILS to shutter South African economy", "type": "article", "url": "https://www.nationalsecurity.news/2023-03-30-marxist-fails-to-shutter-south-african-economy.html", "site_name": "National Security", "description": "South Africans nervously waited for the controversial “national shutdown” organized last March 20 by the radical Marxist Economic Freedom Fighters (EFF). Fortunately, reports confirmed that the opposition party’s attempt to shutter the economy fell way short, with demonstrations attracting limited interest and most major towns and transport links continuing to operate “business as usual.” There were […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2023/03/Protest-Worship-Revolution-Vote-Angry-Hand-Man.jpg"}, "tags": ["conspiracy", "big government", "national security", "Resist", "uprising", "disruption", "chaos", "South Africa", "protest", "failure", "propaganda", "democracy", "Cyril Ramaphosa", "Marxism", "Economic Freedom Fighters", "economy", "Tyranny", "fascism", "economic riot", "Collapse", "revolt", "African National Congress"], "tweets": [], "movies": [], "links": ["https://www.news.com.au/finance/economy/world-economy/widespread-violence-south-africa-braces-for-day-of-chaos-as-marxist-party-demands-national-shutdown/news-story/1f24a7bdf26c27186144d57409b0b100", "https://www.bloomberg.com/news/articles/2023-03-20/south-african-police-arrest-87-protesters-ahead-of-eff-national-shutdown?sref=jB82HHlm", "http://chaos.news", "https://naturalnews.com/2021-07-16-unrest-surges-south-africa-rapidly-failing-state.html", "https://mg.co.za/news/2023-03-21-ramaphosa-says-the-eff-abused-rights-by-compelling-people-to-protest/", "https://www.reuters.com/world/africa/south-african-authorities-arrest-87-ahead-anti-government-protest-2023-03-20/", "http://Marxism.news", "https://www.brighteon.com/5a9da0af-24e9-47b9-b802-0e59bb623c58", "https://www.brighteon.com/channels/tntvnews", "https://naturalnews.com/2021-07-13-south-africa-supply-chains-collapse-unrest-claims-dozens-of-lives.html", "https://communism.news/2020-12-04-south-africa-dire-warning-coming-to-america.html", "https://vaccines.news/2020-07-05-south-africans-protest-coronavirus-vaccine-trials-black-lives.html", "https://pandemic.news/2022-08-10-south-africa-to-mandate-tests-vaccinations-quarantine.html", "https://www.news.com.au/finance/economy/world-economy/widespread-violence-south-africa-braces-for-day-of-chaos-as-marxist-party-demands-national-shutdown/news-story/1f24a7bdf26c27186144d57409b0b100", "https://www.bloomberg.com/news/articles/2023-03-20/south-african-police-arrest-87-protesters-ahead-of-eff-national-shutdown?sref=jB82HHlm", "https://mg.co.za/news/2023-03-21-ramaphosa-says-the-eff-abused-rights-by-compelling-people-to-protest/", "https://www.reuters.com/world/africa/south-african-authorities-arrest-87-ahead-anti-government-protest-2023-03-20/", "https://www.brighteon.com/5a9da0af-24e9-47b9-b802-0e59bb623c58", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2023-03-30-marxist-fails-to-shutter-south-african-economy&linkname=Marxist%20group%20FAILS%20to%20shutter%20South%20African%20economy", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}