{"result_id": "206012", "URL": "https://nationalsecurity.news/2021-10-21-pentagon-faces-class-action-lawsuit-vaccine-mandates.html", "timestamp": "2023-04-25 16:25:01 CEST+0200", "meta": {"description": "Service members from all five branches of the U.S. military, federal employees, and federal civilian contractors have joined in a class-action lawsuit against the Department of Defense over its COVID-19 vaccine mandates. (Article by Mimi Nguyen Ly republished from TheEpochTimes.com) The 24 plaintiffs “face a deadline under the Federal COVID-19 Vaccine Mandate to receive a COVID-19 vaccine […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,covid-19,dod,health freedom,lawsuit,military,pandemic,Pentagon,politics,Resist,revolt,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2021-10-21-pentagon-faces-class-action-lawsuit-vaccine-mandates.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "Pentagon faces class-action lawsuit over vaccine mandates on military, federal employees and contractors", "cleaned_text": "Pentagon faces class-action lawsuit over vaccine mandates on military, federal employees and contractors\n\nService members from all five branches of the U.S. military, federal employees, and federal civilian contractors have joined in a class-action lawsuit against the Department of Defense over its COVID-19 vaccine mandates.\n\nThe 24 plaintiffs “face a deadline under the Federal COVID-19 Vaccine Mandate to receive a COVID-19 vaccine that violates their sincerely held religious beliefs, and have been refused any religious exemption or accommodation,” according to Liberty Counsel, the Christian legal firm that filed the lawsuit.\n\nThe lawsuit (pdf), filed in the U.S. District Court for the Middle District of Florida, lists President Joe Biden, Secretary of Defense Lloyd Austin, and Homeland Security Secretary Alejandro Mayorkas as defendants.\n\nThe plaintiffs are asking the court to issue a temporary restraining order (pdf) to prevent the COVID-19 vaccine mandates from taking effect, and ultimately issue an injunction to prevent the Pentagon from enforcing the Biden administration’s COVID-19 vaccine mandates.\n\nBiden on Sept. 9 issued an executive order requiring almost all federal employees to get a COVID-19 vaccine as a condition of employment. Regular testing isn’t an option. Civilian federal employees and contractors have until Nov. 22 to be fully vaccinated.\n\nAustin issued a memorandum on Aug. 24 saying that all military service members must receive a COVID-19 vaccine, after which all the branches of the military announced various deadlines for its troops to be fully vaccinated, regardless of whether they had previously survived a bout of COVID-19, and threatening suspensions or other disciplinary actions if service members don’t have a pending exemption request or fail to comply.\n\nThe U.S. Navy and Marine Corps have set a Nov. 28 deadline for their active-duty service members; reservists have until Dec. 28. For the Army and the Air Force, the deadlines for active-duty service members are Dec. 15 and Nov. 2, respectively, and deadlines for National Guard and Reserve members are June 30, 2022, and Dec. 2, 2021, respectively. U.S. Coast Guard members have until Nov. 22 to be fully vaccinated.\n\n“Plaintiffs have demonstrated their commitments to the United States Constitution and the Nation’s future comfort, security, and prosperity. This Court should demand that the Nation return the favor. Telling Plaintiffs they must accept or receive a shot they oppose according to their sincerely held religious beliefs, or face court martial, dishonorable discharge, and other life altering disciplinary measures, disgraces the sacrifices these heroes have made,” attorneys wrote in the filing, adding that relief is “needed now” to “prevent the immediate and irreparable injury” imposed by the vaccine mandates.\n\nA Pentagon spokesperson said in an emailed statement, “We do not comment on ongoing litigation.”\n\n“The Biden administration has no authority to require the COVID shots for the military or for federal employees or civilian contractors. Nor can the Biden administration pretend that the federal Religious Freedom Restoration Act and the First Amendment do not apply to its unlawful mandates,” Liberty Counsel Founder and Chairman Mat Staver said in a statement. “The Commander-in-Chief must end this shameful treatment and abuse of our brave military heroes. Forcing the COVID shots without consent or consideration for their sincere religious beliefs is illegal.”\n\nWhite House officials didn’t immediately respond to a request by The Epoch Times for comment.\n\nThe lawsuit notes that many of its 24 plaintiffs have had their requests for religious exemption denied, while other plaintiffs “have been threatened with dishonorable discharge, court martial, termination, or other life-altering disciplinary measures” for seeking such exemptions.\n\n“Some of these Plaintiffs have been informed by their superiors that no religious exemption or accommodation will be given, so there is no point in even making a request,” attorneys said in the filing.\n\nThe suit said that Vice Admiral William Galinis, commander of Naval Sea Systems Command, on Oct. 14 issued a warning to his entire command of more than 85,000 civilian and military personnel, saying, “The Executive Order mandating vaccinations for all federal employees has provided clear direction. We are moving quickly toward a workforce where vaccinations are a condition of employment. Frankly, if you are not vaccinated, you will not work for the U.S. Navy.”\n\nA Navy spokeswoman declined to comment last week when asked whether any religious or medical exemptions had been approved.\n\nThe three currently available COVID-19 vaccines are the one-dose vaccine from Johnson & Johnson, and the two-dose vaccines from Moderna and Pfizer-BioNTech.\n\n“Plaintiffs’ sincerely held religious beliefs preclude them from accepting any one of the three currently available COVID-19 vaccines derived from, produced or manufactured by, tested on, developed with, or otherwise connected to aborted fetal cell lines,” the suit argued, subsequently providing evidence that aborted fetal cell lines were involved in certain stages of development of all three vaccines.\n\n“Plaintiffs’ religious beliefs compel them to not condone, support, justify, or benefit (directly or indirectly) from the taking of innocent human life via abortion, and that to do so is sinning against God,” attorneys wrote.\n\nAttorneys are asking the court to declare that the federal COVID-19 vaccine mandate on the plaintiffs is unlawful because it violates the First Amendment to the U.S. Constitution and the federal Religious Freedom Restoration Act by “imposing a substantial burden on Plaintiffs’ sincerely held religious beliefs.”\n\nAttorneys argued in the suit that no COVID-19 vaccine is available in the United States that has received full licensing and approval from the U.S. Food and Drug Administration, and as such, cannot be mandated.\n\nAustin, in his memo on Aug. 24 (pdf), stated that the mandatory vaccinations “will only use COVID-19 vaccines that receive full licensure from the [FDA] in accordance with FDA-approved labeling and guidance,” attorneys noted, arguing that “additional military documents reveal that the Department of Defense is not following its own directive” and is using vaccines under emergency use authorization [EUA] “because there is no FDA approved vaccine available.”\n\nAustin’s memo came a day after the FDA issued full approval for future Pfizer–BioNTech COVID-19 vaccines, which will bear the Comirnaty label. The latter vaccine wasn’t available in the United States as of Oct. 12, The Epoch Times reported previously.\n\nThe attorneys argued that explicit statutory conditions for an EUA require that people are given “the option to accept or refuse administration” of a given unapproved product that has been authorized for emergency use.\n\nAccording to the lawsuit, “Because all COVID-19 vaccines available in the United States are subject to the EUA Statute restrictions and limitations, all individuals—including military service members, federal employees, and federal civilian contractors—have the explicit right under the EUA Statute to accept or refuse administration of the products.”\n\nAttorneys asked the court to declare the vaccine mandate as unlawful because it violates the EUA provisions of the Federal Food, Drug, and Cosmetic Act “by imposing a mandatory COVID-19 shot upon Plaintiffs without giving the ‘option to accept or refuse’ the EUA product.”", "opengraph": {"title": "Pentagon faces class-action lawsuit over vaccine mandates on military, federal employees and contractors", "type": "article", "url": "https://www.nationalsecurity.news/2021-10-21-pentagon-faces-class-action-lawsuit-vaccine-mandates.html", "site_name": "National Security", "description": "Service members from all five branches of the U.S. military, federal employees, and federal civilian contractors have joined in a class-action lawsuit against the Department of Defense over its COVID-19 vaccine mandates. (Article by Mimi Nguyen Ly republished from TheEpochTimes.com) The 24 plaintiffs “face a deadline under the Federal COVID-19 Vaccine Mandate to receive a COVID-19 vaccine […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2021/10/pentagon-aerial-defense-e1460559589961.jpg"}, "tags": ["pandemic", "big government", "lawsuit", "covid-19", "vaccine wars", "dod", "Resist", "politics", "revolt", "vaccine mandate", "vaccines", "Pentagon", "health freedom", "military"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/t-lawsuit", "https://www.theepochtimes.com/pentagon-faces-class-action-lawsuit-over-vaccine-mandates-on-military-federal-employees-and-contractors_4052993.html", "https://lc.org/PDFs/Attachments2PRsLAs/101521BidenDODVerifiedClassActionComplaintwithExhibits.pdf", "https://lc.org/PDFs/Attachments2PRsLAs/101521BidenDODEmergencyMotionforTROandPIwithMemo.pdf", "https://www.theepochtimes.com/t-pentagon", "https://www.theepochtimes.com/new-biden-executive-order-to-mandate-covid-19-vaccines-for-federal-workers_3989878.html", "https://www.whitehouse.gov/briefing-room/presidential-actions/2021/09/09/executive-order-on-requiring-coronavirus-disease-2019-vaccination-for-federal-employees/", "https://www.theepochtimes.com/us-army-sets-deadlines-for-covid-19-vaccines-threatens-disciplinary-action_3997936.html", "https://www.navy.mil/Press-Office/News-Stories/Article/2761116/navy-supports-mandatory-covid-19-vaccination-for-all-active-duty-and-reserve-sa/", "https://www.army.mil/article/250277/army_announces_implementation_of_mandatory_vaccines_for_soldiers", "https://www.af.mil/News/Article-Display/Article/2765008/daf-announces-mandatory-covid-vaccine-implementation-guidelines-for-airmen-guar/", "https://lc.org/newsroom/details/101521-military-federal-employees-and-civilian-contractors-sue-biden", "https://www.theepochtimes.com/t-vaccine-mandate", "https://media.defense.gov/2021/Aug/25/2002838826/-1/-1/0/MEMORANDUM-FOR-MANDATORY-CORONAVIRUS-DISEASE-2019-VACCINATION-OF-DEPARTMENT-OF-DEFENSE-SERVICE-MEMBERS.PDF", "https://www.theepochtimes.com/us-drug-regulators-approve-pfizers-covid-19-vaccine_3961021.html", "https://www.theepochtimes.com/approved-version-of-pfizers-covid-19-vaccine-still-not-available-in-us_4046513.html", "https://www.law.cornell.edu/uscode/text/21/360bbb-3", "https://www.theepochtimes.com/pentagon-faces-class-action-lawsuit-over-vaccine-mandates-on-military-federal-employees-and-contractors_4052993.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2021-10-21-pentagon-faces-class-action-lawsuit-vaccine-mandates&linkname=Pentagon%20faces%20class-action%20lawsuit%20over%20vaccine%20mandates%20on%20military%2C%20federal%20employees%20and%20contractors", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}