{"result_id": "206013", "URL": "https://nationalsecurity.news/2022-11-10-pentagon-vaccine-mandate-legally-written-illegally-applied.html", "timestamp": "2023-04-25 16:25:02 CEST+0200", "meta": {"description": "Military physician Dr. Sam Sigoloff discussed his fight for health freedom in the military with Health Ranger Mike Adams. The founder of Brighteon.com and Natural News said Sigoloff has worked on granting Wuhan coronavirus (COVID-19) vaccine exemptions to soldiers, using his position in the U.S. Army. Aside from this, Sigoloff has also questioned the safety […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapons,Brighteon Conversations,Comirnaty,conspiracy,covid-19,Dangerous Medicine,deception,Department of Defense,freedom,health freedom,military,national security,pandemic,pharmaceutical fraud,Sam Sigoloff,vaccine mandate,vaccine wars,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2022-11-10-pentagon-vaccine-mandate-legally-written-illegally-applied.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "Dr. Sam Sigoloff tells Mike Adams: Pentagon’s vaccine mandate was legally written but applied in an ILLEGAL manner", "cleaned_text": "Dr. Sam Sigoloff tells Mike Adams: Pentagon’s vaccine mandate was legally written but applied in an ILLEGAL manner\n\nMilitary physician Dr. Sam Sigoloff discussed his fight for health freedom in the military with Health Ranger Mike Adams.\n\nThe founder of Brighteon.com and Natural News said Sigoloff has worked on granting Wuhan coronavirus (COVID-19) vaccine exemptions to soldiers, using his position in the U.S. Army. Aside from this, Sigoloff has also questioned the safety of the vaccine’s ingredients. These unsafe injections are being pushed aggressively on military personnel.\n\nThe military doctor – who moved to Fort Huachuca in Arizona to serve as its medical director – said that while Defense Secretary Lloyd Austin’s COVID-19 vaccine mandate was legally written, it was applied in an illegal manner. (Related: Mike Adams and Dr. Gaston Cornu-Labat talk about health freedom and asserting individual rights against medical tyranny.)\n\nSigoloff also told Adams that following his own research into the COVID-19 vaccines, he found that Comirnaty – the only vaccine allowed by the military – is dangerous. The military doctor explained that the vaccine’s material safety data sheet states it is not validated for human use and that many of its toxicology reports are classified. Lipid nanoparticles in the mRNA vaccines are not validated for use in both humans and animals, he added.\n\n“I want to make it very clear that Comirnaty has never been produced, and there are many reasons for that,” said Sigoloff. “I’ve got a podcast where I talked about how a representative from Pfizer says that it was made in France. If you’ve been told that you took Comirnaty, they lied to you.”\n\nAccording to the Health Ranger, data about Comirnaty is classified because people are not allowed to know what is in the vaccines – yet they have to take it. He added that this is the message the Department of Defense (DOD) wants to send to military personnel.\n\nIn response to Adams’ questions about post-vaccination adverse effects, Sigoloff shared “horrible things” that happened to his patients. In one instance, the breastfed child of a female military member experienced a daily fever for 10 months. The child began suffering from the adverse effect after the mother got vaccinated.\n\nPentagon trying to kill off American soldiers en masse\n\nAccording to the Brighteon.com founder, the evidence is clear that the COVID-19 vaccines – partly a product of gain-of-function research done in Wuhan – are biological weapons.\n\n“That’s what it looks like to me,” he told Sigoloff. “And to most Americans who are aware of this information, it begs the question: Why would the leadership of the military be trying to murder military personnel? Why isn’t the leadership doing everything possible to protect the soldiers rather than subjecting them to these risks from a bioweapon?”\n\nSigoloff agreed, remarking that the DOD is forcing military personnel to get injected with a bioweapon partly or totally developed by China. Adams then recalled a 2000 speech delivered by former People’s Liberation Army (PLA) Gen. Chi Haotian that called for China to use biological weapons against Americans.\n\n“There has been rapid development of modern biological technology, and new bioweapons have been invented one after another. Of course, we have not been idle,” Chi said at the time.\n\n“In the past years, we have seized the opportunity to master weapons of this kind. We are capable of achieving our purpose of ‘cleaning up’ America all of a sudden. If our biological weapons succeed in the surprise attack, the Chinese people will be able to keep their losses at a minimum in the fight against the United States.”\n\nAdams continued that this was not a wild conspiracy theory, but an actual posture well-known among PLA generals.\n\nMoreover, Sigoloff mentioned that he was suspended by the DOD for giving out exemptions to the COVID-19 vaccine. He did not regret his actions, however, explaining that everything he did was well within his right and duty as a doctor and military physician to take care of the patient.\n\nFollow HealthFreedom.news for more news about efforts to push back against the military COVID-19 vaccine mandate.\n\nWatch the video below to featuring the conversation between Mike Adams and Dr. Sam Sigoloff.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nMilitary doctor says she was ordered to cover up wave of covid “vaccine” injuries in servicemen.\n\nCover up: DOD silent after whistleblowers expose COVID ‘vaccine’ injuries in military.\n\nMedical board moves to revoke certification of Dr. Peter McCullough who dared question COVID vaccine narratives.\n\nDave Racer says it’s time for Americans to push back against Biden’s tyrannical COVID-19 mandates – Brighteon.TV.", "opengraph": {"title": "Dr. Sam Sigoloff tells Mike Adams: Pentagon’s vaccine mandate was legally written but applied in an ILLEGAL manner", "type": "article", "url": "https://www.nationalsecurity.news/2022-11-10-pentagon-vaccine-mandate-legally-written-illegally-applied.html", "site_name": "National Security", "description": "Military physician Dr. Sam Sigoloff discussed his fight for health freedom in the military with Health Ranger Mike Adams. The founder of Brighteon.com and Natural News said Sigoloff has worked on granting Wuhan coronavirus (COVID-19) vaccine exemptions to soldiers, using his position in the U.S. Army. Aside from this, Sigoloff has also questioned the safety […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/11/Coronavirus-Covid-19-Pfizer-Vaccine-Syringe-Vial.jpg"}, "tags": ["Comirnaty", "conspiracy", "Brighteon Conversations", "covid-19", "Department of Defense", "pandemic", "Big Pharma", "vaccine wars", "national security", "deception", "Sam Sigoloff", "vaccine mandate", "pharmaceutical fraud", "freedom", "health freedom", "Wuhan coronavirus", "military", "biological weapons"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/09fc1538-e93f-4694-a8cd-126eef42c701", "https://naturalnews.com/2022-05-11-health-freedom-individual-rights-medical-tyranny.html", "http://vaccines.news", "http://jrnyquist.blog/2019/09/11/the-secret-speech-of-general-chi-haotian/", "http://healthfreedom.news", "http://www.brighteon.com/09fc1538-e93f-4694-a8cd-126eef42c701", "http://www.brighteon.com/channels/hrreport", "https://naturalnews.com/2022-03-21-military-doctor-ordered-to-suppress-vaccine-injuries.html", "https://naturalnews.com/2022-02-11-dod-silent-whistleblowers-expose-vaccine-injuries-military.html", "https://healthfreedom.news/2022-11-04-medical-board-revokes-certifications-dr-peter-mccullough.html", "https://naturalnews.com/2021-09-09-sergeants-sue-federal-agencies-over-vaccine-requirements.html", "https://naturalnews.com/2021-09-15-time-to-push-back-against-covid-mandates.html", "https://www.brighteon.com/09fc1538-e93f-4694-a8cd-126eef42c701", "http://jrnyquist.blog/2019/09/11/the-secret-speech-of-general-chi-haotian/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-11-10-pentagon-vaccine-mandate-legally-written-illegally-applied&linkname=Dr.%20Sam%20Sigoloff%20tells%20Mike%20Adams%3A%20Pentagon%E2%80%99s%20vaccine%20mandate%20was%20legally%20written%20but%20applied%20in%20an%20ILLEGAL%20manner", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}