{"result_id": "206011", "URL": "https://nationalsecurity.news/2022-02-04-republicans-ban-taxpayer-military-vaccine-mandate.html", "timestamp": "2023-04-25 16:25:01 CEST+0200", "meta": {"description": "A group of Republican House leaders is calling for a ban on the use of taxpayer funds to implement President Biden’s vaccine mandate for members of the U.S. military. On Tuesday, Representative Darrell Issa of California, a senior member of the House Foreign Affairs Committee, and 14 of his Republican colleagues wrote to the House […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Darrell Issa,democrats,insanity,Joe Biden,Marines,medical fascism,Medical Tyranny,military,national security,pandemic,Republicans,traitors,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2022-02-04-republicans-ban-taxpayer-military-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "House Republicans calling for ban on using taxpayer funds for implementing military vaccine mandate", "cleaned_text": "House Republicans calling for ban on using taxpayer funds for implementing military vaccine mandate\n\nA group of Republican House leaders is calling for a ban on the use of taxpayer funds to implement President Biden’s vaccine mandate for members of the U.S. military.\n\nOn Tuesday, Representative Darrell Issa of California, a senior member of the House Foreign Affairs Committee, and 14 of his Republican colleagues wrote to the House Appropriations Committee requesting that they “prohibit funding for the COVID-19 vaccine mandate for active-duty, reserve and national guard military personnel” as allocated in the budget for fiscal year 2022.\n\nAccording to the coalition, the mandate could force around 50,000 active-duty military members out of service right now, putting the country’s national security in serious danger at a time when potential wars are brewing in the Middle East, Eastern Europe and Asia. Several hundred active-duty military service members have already been forced out of service over their refusal to get vaccinated.\n\nUnfortunately, with Democrats still in control of the House, it appears unlikely that appropriators will stop funding the vaccine mandate.\n\nAll of the vaccine mandates issued by the Biden administration recently have been struck down by federal courts or stopped, except for the one in effect for the military. Lawmakers say that they have received countless calls from service members expressing their concerns about being kicked out of the military due to the mandate.\n\nThe Marines, for example, have so far only granted three religious exemption requests among the thousands that they have received, and many believe the military is not taking the time to properly assess these requests. These denials are ending people’s careers and taking a toll on their families.\n\nThe lawmakers write: “If continued, this mandate will devastate morale and destroy our military readiness and weaken our national security posture. With serious challenges emerging around the world, and an ill-prepared administration at the helm, a purge of this nature is especially troubling.”\n\nLast week, the Washington Free Beacon reported that of 3,428 requests for a religious exemption by Marines, not a single one was granted to active-duty service members who intend to stay in service for longer than six months. A letter from the Navy to Issa confirmed that in all of the religious exemptions that were granted, the service member in question was either about to leave or be merged into an off-duty work program. This has prompted accusations that top Marine brass are essentially forcing active-duty Marines out of service.\n\nA spokesperson for Issa, Jonathan Wilcox, said: “The word is out from military command: Nobody is getting an accommodation. No Marine who wants to serve as a Marine has received religious accommodation unless they’ve got a foot out the door.”\n\nThe Navy has said that it is aware that some Marines are unhappy about their religious exemption requests not being reviewed satisfactorily before being rejected, but they maintain their decisions to deny have been based on health and safety concerns rather than the sincerity of a person’s belief.\n\nRep. Issa told the Free Beacon: “The Biden military vaccine mandate is destroying the morale of our troops, careers of honor, and lives of service. And now we know it has corrupted a part of the military itself through the wholesale denial of legitimate religious accommodations.”\n\nOne chaplain in the U.S. Navy Reserve recently told Fox News Digital that the military is being used by Biden’s administration as a “nice little test group” that is unable to say no to the jab. Speaking anonymously to the outlet, he explained how he now faces possible dismissal after being denied a religious exemption after nearly two decades of service, which would mean missing out on retirement pay and benefits.\n\nUnfortunately, many military service members are in the same position right now, and it’s terrifying to think that we might not be in a position to defend ourselves against our enemies if the many dedicated and well-trained military personnel who don’t want to get the vaccine are terminated.", "opengraph": {"title": "House Republicans calling for ban on using taxpayer funds for implementing military vaccine mandate", "type": "article", "url": "https://www.nationalsecurity.news/2022-02-04-republicans-ban-taxpayer-military-vaccine-mandate.html", "site_name": "National Security", "description": "A group of Republican House leaders is calling for a ban on the use of taxpayer funds to implement President Biden’s vaccine mandate for members of the U.S. military. On Tuesday, Representative Darrell Issa of California, a senior member of the House Foreign Affairs Committee, and 14 of his Republican colleagues wrote to the House […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/02/Military-Soldier-American-Flag-1.jpg"}, "tags": ["Marines", "Joe Biden", "pandemic", "big government", "medical fascism", "vaccine wars", "national security", "Republicans", "Medical Tyranny", "vaccine mandate", "vaccines", "democrats", "traitors", "insanity", "Darrell Issa", "military"], "tweets": [], "movies": [], "links": ["https://freebeacon.com/national-security/republicans-call-for-ban-on-taxpayer-funds-being-used-to-implement-military-vaccine-mandate/", "https://nationalsecurity.news", "https://www.foxnews.com/politics/navy-chaplain-sailors-religious-exemption-covid-19-vaccine-mandate", "https://healthfreedom.news/", "https://freebeacon.com/national-security/republicans-call-for-ban-on-taxpayer-funds-being-used-to-implement-military-vaccine-mandate/", "https://www.foxnews.com/politics/navy-chaplain-sailors-religious-exemption-covid-19-vaccine-mandate", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-02-04-republicans-ban-taxpayer-military-vaccine-mandate&linkname=House%20Republicans%20calling%20for%20ban%20on%20using%20taxpayer%20funds%20for%20implementing%20military%20vaccine%20mandate", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}