{"result_id": "206005", "URL": "https://nationalsecurity.news/2022-04-06-us-national-security-threatened-china-nuclear-arsenal.html", "timestamp": "2023-04-25 16:24:56 CEST+0200", "meta": {"description": "The head of United States Strategic Command is warning American lawmakers about China’s “breathtaking expansion” of its strategic nuclear arsenal. In a prepared written testimony posted on the website of the House Appropriation Subcommittee on Defense, Adm. Charles Richard said that China’s first test of a new type of intercontinental ballistic missile in July 2021 […]", "lang": "en", "keywords": "big government,Charles Richard,China,Dangerous,hypersonic glide vehicle,intercontinental ballistic missile,invasion usa,military,military technology,national security,nuclear,nuclear arsenal,nuclear war,nuclear weapons,weapons technology,World War III", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2022-04-06-us-national-security-threatened-china-nuclear-arsenal.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "US national security at significantly greater risk due to “breathtaking expansion” of Chinese nuclear arsenal", "cleaned_text": "US national security at significantly greater risk due to “breathtaking expansion” of Chinese nuclear arsenal\n\nThe head of United States Strategic Command is warning American lawmakers about China’s “breathtaking expansion” of its strategic nuclear arsenal.\n\nIn a prepared written testimony posted on the website of the House Appropriation Subcommittee on Defense, Adm. Charles Richard said that China’s first test of a new type of intercontinental ballistic missile in July 2021 was a “technological achievement with serious implications for strategic stability.” (Related: China pushes for expansion of its nuclear arsenal, braces for nuclear showdown with US military.)\n\nIn the July test, Beijing used a DF-17 medium-range ballistic missile launcher equipped with a DF-ZF hypersonic glide vehicle. The glide vehicle was launched into low-orbit space before it detached. It then flew 25,000 miles for more than 100 minutes, circling the globe before striking within two dozen miles of its test target.\n\nThe DF-ZF can be used to perform precision strikes anywhere in the world with a conventional payload, like an anti-ship ballistic missile. But it could also be used to deliver nuclear weapons.\n\nThis test, according to Richard, has the distinction of having “the greatest distance and longest flight time of any land attack weapon system of any nation to date.”\n\nRichard explained that the Department of Defense’s plans to ward off potential strikes from rising threats like China and Russia “rest on the assumption that strategic deterrence, and in particular nuclear deterrence, will hold.”\n\nBut with China’s recent massive investments into its nuclear capabilities, it now has the capability – along with Russia – to “unilaterally escalate a conflict to any level of violence, in any domain, worldwide, with any instrument of national power, and at any time,” said Richard. America’s armed forces no longer have “the luxury of assuming the risk is always low, particularly during a crisis.”\n\n“If strategic or nuclear deterrence fails, integrated deterrence and no other plan or capability in the DOD will work as designed,” said Richard.\n\nChina to double its nuclear arsenal by 2027\n\nChina currently has a nuclear warhead stockpile somewhere between 200 to the low 300s. In late 2021, the Pentagon published a report on China’s military power and the department noted that Beijing is planning to accelerate the development and expansion of its strategic nuclear arsenal.\n\nBy 2027, China hopes to double its current warhead stockpile and amass around 700 warheads. By 2030, it wants to nearly triple it and have 1,000 warheads.\n\nThis would more than double the Pentagon’s 2020 estimate regarding the expansion of China’s nuclear capabilities.\n\nThe Pentagon noted that China is also investing in and expanding its ability to deliver nuclear warheads by land, sea and air, and constructing the infrastructure necessary “to support this major expansion of its nuclear forces.”\n\n“Our number-one pacing challenge is the People’s Republic of China,” noted Pentagon spokesperson John Kirby last year.\n\nAt the core of the communist state’s investments are hypersonic weapons that can deliver nuclear payloads anywhere in the world and directed energy weapons technology with global strike capabilities and capable of defeating an enemy nation’s missile defense systems and its anti-satellite, anti-missile and anti-drone capabilities.\n\nBeijing has also provided more funding for the construction of nuclear missile fields in the sparsely populated western regions of China. Each known nuclear missile field has around 120 missile silos, which would give the country a “robust” array of ballistic missiles capable of reaching the continental United States.\n\nOther Chinese advancements in the last year, according to Richard and the Pentagon’s intelligence, include ground-based, large phased array radars and at least one geostationary satellite, both of which are capable of detecting incoming threats to the Chinese state, including ballistic missiles and stealth aircraft.\n\nLearn more about the threat that China poses to America at NationalSecurity.news.\n\nWatch this clip of China parading its medium-range and intercontinental ballistic missile launchers, which pose a significant threat to the United States.\n\nThis video is from the World’s Best channel on Brighteon.com.\n\nU.S. military head says country faces substantial nuclear threat from Russia, China.\n\nUS faces nuclear threats from China, Russia as never before: US Admiral.\n\nHead of U.S. Strategic Command issues dire warning about nuclear war with Russia, China.\n\nWAR ALERT: China setting stage for NUCLEAR WAR with Taiwan, Australia, Japan, India and the USA.\n\nSTRATCOM commander sounds the alarm bell, says nuclear war “very real possibility” with Russia or China.", "opengraph": {"title": "US national security at significantly greater risk due to “breathtaking expansion” of Chinese nuclear arsenal", "type": "article", "url": "https://www.nationalsecurity.news/2022-04-06-us-national-security-threatened-china-nuclear-arsenal.html", "site_name": "National Security", "description": "The head of United States Strategic Command is warning American lawmakers about China’s “breathtaking expansion” of its strategic nuclear arsenal. In a prepared written testimony posted on the website of the House Appropriation Subcommittee on Defense, Adm. Charles Richard said that China’s first test of a new type of intercontinental ballistic missile in July 2021 […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/04/China-America-Flags-War.jpg"}, "tags": ["Charles Richard", "hypersonic glide vehicle", "big government", "nuclear arsenal", "national security", "nuclear weapons", "nuclear war", "intercontinental ballistic missile", "Dangerous", "weapons technology", "World War III", "China", "invasion usa", "nuclear", "military technology", "military"], "tweets": [], "movies": [], "links": ["https://www.bloombergquint.com/politics/u-s-sees-rising-risk-in-breathtaking-china-nuclear-expansion", "http://weaponstechnology.news", "https://naturalnews.com/2021-06-06-china-nuclear-showdown-with-us-military.html", "https://www.armscontrol.org/act/2021-12/news/pentagon-sees-faster-chinese-nuclear-expansion", "https://nuclear.news/", "https://nationalsecurity.news/", "https://www.brighteon.com/77ae8f4b-02ff-4c06-b44c-b71fe3216076", "https://www.brighteon.com/channels/thebestofjapan", "https://www.brighteon.com/channels/thebestofjapan", "https://wwiii.news/2022-03-13-military-says-nuclear-threat-russia-china.html", "https://nationalsecurity.news/2022-03-07-us-faces-nuclear-threats-from-china-russia.html", "https://nuclear.news/2022-03-06-us-strategic-command-issues-dire-warning-nuclear-war-russia-china.html", "https://wwiii.news/2021-10-05-war-alert-china-setting-stage-for-nuclear-war.html", "https://wwiii.news/2021-02-09-stratcom-commander-nuclear-war-russia-china.html", "https://www.bloombergquint.com/politics/u-s-sees-rising-risk-in-breathtaking-china-nuclear-expansion", "https://www.armscontrol.org/act/2021-12/news/pentagon-sees-faster-chinese-nuclear-expansion", "https://www.brighteon.com/77ae8f4b-02ff-4c06-b44c-b71fe3216076", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-04-06-us-national-security-threatened-china-nuclear-arsenal&linkname=US%20national%20security%20at%20significantly%20greater%20risk%20due%20to%20%E2%80%9Cbreathtaking%20expansion%E2%80%9D%20of%20Chinese%20nuclear%20arsenal", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}