{"result_id": "206028", "URL": "https://www.nationalsecurity.news/2022-12-06-g20-roll-out-who-digital-vaccine-passport.html", "timestamp": "2023-04-25 16:25:11 CEST+0200", "meta": {"description": "The Group of 20 (G20) recently announced its plan to roll out the Wuhan coronavirus (COVID-19) digital vaccine passport. This vaccine passport standardized by the World Health Organization (WHO) would be part of pandemic prevention and response among the group’s member countries. The G20 introduced the plan during its November 2022 business meeting in Bali, […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,conspiracy,covid-19,deception,digital ID,digital vaccine passport,freedom,G20,Globalism,globalist elites,health freedom,medical martial law,Medical Tyranny,Orwellian,pandemic,surveillance,total control,vaccine passport,world economic forum,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.nationalsecurity.news/2022-12-06-g20-roll-out-who-digital-vaccine-passport.html", "encoding": "UTF-8"}, "image": null, "domain": "www.nationalsecurity.news", "title": "G20 set to roll out WHO digital vaccine passport as part of its global pandemic response", "cleaned_text": "G20 set to roll out WHO digital vaccine passport as part of its global pandemic response\n\nThe Group of 20 (G20) recently announced its plan to roll out the Wuhan coronavirus (COVID-19) digital vaccine passport. This vaccine passport standardized by the World Health Organization (WHO) would be part of pandemic prevention and response among the group’s member countries.\n\nThe G20 introduced the plan during its November 2022 business meeting in Bali, Indonesia. This will then be introduced during the next World Health Assembly on Dec. 5 to 7 in Geneva, Switzerland as a revision to the international health regulations.\n\n“We support continued international dialogue and collaboration on the establishment of trusted global digital health networks as part of the efforts to strengthen prevention and response to future pandemics, that should capitalize and build on the success of the existing standards and digital COVID-19 certificates,” the declaration included. (Related: G20 declares support for global digital COVID-19 vaccine passport following meeting between Biden and Xi.)\n\nPresident Joe Biden, meanwhile, did not hold back in signing the G20’s pronouncement. His actions were a stark contrast to an earlier promise by former White House COVID-19 Response Coordinator Jeff Zients in April 2021 that the American government will not be supporting “a system that requires Americans to carry a [vaccination] credential.” Zients stepped down as COVID-19 response coordinator a year after the announcement, and was replaced by Dr. Ashish Jha.\n\nDr. Joseph Mercola blasted the plan. “What this means is that when the next pandemic is declared, only those who have this digital health certificate will be allowed to move about freely and travel internationally. And, of course, only those who have been appropriately tested and/or vaccinated will have a valid passport,” he said.\n\nMoreover, Mercola pointed out that mandating vaccine passports worldwide would just be “the gateway to complete totalitarian control because the entire control grid around a person gets tied together by it.”\n\n“When you add all of those ingredients together – vaccine requirements for maintaining a valid passport, a digital identity, a social credit score and programmable Central Bank Digital Currencies (CBDCs) – you end up with a control grid that will eliminate your freedom to live life according to your own desires.”\n\nDigital vaccine passport is a tool for surveillance and control\n\nAccording to the World Economic Forum (WEF), vaccine passports will serve as a form of digital identity.\n\nA digital identity encompasses everything that makes one unique in the digital realm and it is a system that can consolidate all of the most personal data – including websites one visits, online purchases, health records, financial accounts and even one’s connections in social media.\n\nFormer Kentucky Rep. Ron Paul pointed out in a video that the globalist cabal plans to utilize digital vaccine passports “to push total control by substituting truth with their own opinions.” This globalist cabal include the G20, bankers and members of nongovernmental organizations and liberal think tanks under the leadership of WEF Executive Director Klaus Schwab.\n\n“They decide what’s right and wrong; they decide what’s right for everyone. They dictate what’s ‘true’ on any given day, and [whoever] disagrees with them is an ‘enemy of the state,'” said Paul, the father of incumbent Kentucky Sen. Rand Paul.\n\nRenowned feminist author and former Clinton campaign advisor Dr. Naomi Wolf, meanwhile, warned that accepting the digital ID under the guise of vaccine passports will mark the end of liberty in the West.\n\n“I’m CEO of a tech company, I understand what this platform does,” she said. “It’s not about the vaccine, it’s not about the virus, it’s about data. And once this rolls out you don’t have a choice about being part of the system. What people have to understand is that any other functionality can be loaded onto that platform with no problem at all.”\n\nVisit Surveillance.news for more news about the globalists’ efforts to achieve total surveillance and control.\n\nWatch this video about G20’s push for vaccine passports.\n\nThis video is from the Serpent Network channel on Brighteon.com.\n\nKlaus Schwab: ‘God is dead’ and the WEF is ‘acquiring divine powers.’\n\nWHO partners with German telecom company to create global COVID-19 vaccine passport app.\n\nAudio obtained from Event 201 launch announcement in 2019 reveals covid to be a WEF-sponsored war games simulation.", "opengraph": {"title": "G20 set to roll out WHO digital vaccine passport as part of its global pandemic response", "type": "article", "url": "https://www.nationalsecurity.news/2022-12-06-g20-roll-out-who-digital-vaccine-passport.html", "site_name": "National Security", "description": "The Group of 20 (G20) recently announced its plan to roll out the Wuhan coronavirus (COVID-19) digital vaccine passport. This vaccine passport standardized by the World Health Organization (WHO) would be part of pandemic prevention and response among the group’s member countries. The G20 introduced the plan during its November 2022 business meeting in Bali, […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/12/Immunity-Vaccine-Passport-Phone-App.jpg"}, "tags": ["pandemic", "conspiracy", "world economic forum", "digital ID", "deception", "vaccine passport", "covid-19", "G20", "digital vaccine passport", "Wuhan coronavirus", "medical martial law", "total control", "Medical Tyranny", "surveillance", "Orwellian", "freedom", "health freedom", "globalist elites", "Globalism"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/g20-signs-declaration-international-vaccine-passport/5800862", "https://www.b20indonesia2022.org/view-doc-b20/final_communique/AXPIDTWB", "https://naturalnews.com/2022-11-22-g20-global-digital-covid-vaccine-passport-biden-xi.html", "http://medicaltyranny.com", "https://sociable.co/government-and-policy/g20-who-vaccine-passports-digital-identity-b20/", "https://www.realclearpolitics.com/video/2021/03/29/naomi_wolf_mandatory_vaccine_passport_could_lead_to_end_of_human_liberty_in_the_west.html", "https://surveillance.news/", "https://www.brighteon.com/ffa3fe62-5d42-406a-a648-1588a18a602c", "https://www.brighteon.com/channels/easterndmondbk", "https://naturalnews.com/2022-11-28-klaus-schwab-god-is-dead.html", "https://pandemic.news/2022-06-01-who-german-telecom-covid-vaccine-passport-app.html", "https://conspiracy.news/2022-11-04-event-201-audio-reveals-covid-war-simulation.html", "https://medicaltyranny.com/2022-08-04-canada-vaccine-passport-to-face-privacy-probe.html", "https://www.globalresearch.ca/g20-signs-declaration-international-vaccine-passport/5800862", "https://www.b20indonesia2022.org/view-doc-b20/final_communique/AXPIDTWB", "https://sociable.co/government-and-policy/g20-who-vaccine-passports-digital-identity-b20/", "https://www.realclearpolitics.com/video/2021/03/29/naomi_wolf_mandatory_vaccine_passport_could_lead_to_end_of_human_liberty_in_the_west.html", "https://www.brighteon.com/ffa3fe62-5d42-406a-a648-1588a18a602c", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-12-06-g20-roll-out-who-digital-vaccine-passport&linkname=G20%20set%20to%20roll%20out%20WHO%20digital%20vaccine%20passport%20as%20part%20of%20its%20global%20pandemic%20response", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}