{"result_id": "206003", "URL": "https://nationalsecurity.news/2022-03-21-marines-deployed-australia-preparation-war-with-china.html", "timestamp": "2023-04-25 16:24:55 CEST+0200", "meta": {"description": "Members of the U.S. Marine Corps have been deployed to Australia in preparation for China potentially invading Taiwan. The Marines will be helping their counterparts in the Australian Defense Force (ADF) to ensure preparedness for any crisis or conflict in the region. According to 100PercentFedUp.com, a rotational force of approximately 2,200 Marines will be based […]", "lang": "en", "keywords": "AUKUS,Australia,Australia Defense Force,China,China-Taiwan war,invasion,Marines,military national security,national security,nuclear weapons,regional conflict,Taiwan,USMC,world war,WWIII", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2022-03-21-marines-deployed-australia-preparation-war-with-china.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "Thousands of Marines deployed to Australia in preparation for a possible war with CHINA", "cleaned_text": "Thousands of Marines deployed to Australia in preparation for a possible war with CHINA\n\nMembers of the U.S. Marine Corps have been deployed to Australia in preparation for China potentially invading Taiwan. The Marines will be helping their counterparts in the Australian Defense Force (ADF) to ensure preparedness for any crisis or conflict in the region.\n\nAccording to 100PercentFedUp.com, a rotational force of approximately 2,200 Marines will be based in Australia’s Northern Territory until September 2022. One thousand Marines had earlier arrived in Darwin, the Australian state’s capital, to train alongside the ADF. The contingent of Marines forms “part of an ongoing U.S. initiative in the Indo-Pacific region to prepare for a possible Chinese invasion of Taiwan in coming years.”\n\nColonel Marcus Constable, commanding officer of ADF Northern Command, reiterated the importance of the relationship between the U.S. and Australia. “It is a key way we increase regional cooperation with partners in the Indo-Pacific. Together, we conduct a comprehensive range of training activities including humanitarian assistance, security operations and high-end live-fire exercises,” he said.\n\nAustralian Defense Minister Peter Dutton said conflict with China “shouldn’t be discounted,” warning that the communist country may move to invade Taiwan while the world is focused on the Russia-Ukraine conflict. He emphasized that Australian forces would come to the aid of the U.S. should the latter help defend the island nation.\n\n“It would be inconceivable that we wouldn’t support the U.S. in an action if the U.S. chose to take that action. I think we should be very frank and honest about that [and] look at all of the facts and circumstances without pre-committing. [Maybe] there are circumstances where we wouldn’t take up that option, [but] I can’t conceive of those circumstances.”\n\nDutton added: “There are actors within our own region who may see the war in Ukraine as a useful distraction, and indeed an opportunity, to pursue their own actions of aggression or coercion. This threat, of course, chiefly emanates from Beijing, which has its own openly-stated territorial ambitions – and which recently entered a no-limits cooperative partnership with the Kremlin at a time when the rest of the world was pulling away.”\n\nBeijing waiting for the right opportunity to seize Taiwan\n\nIn 2021, Beijing warned through state media that Australia would suffer a “heavy attack” in case the ADF comes to the aid of Taiwan. It also brought up the possibility of nuclear weapons in response to the tripartite AUKUS security pact. Under the AUKUS agreement, the U.S. and U.K. will help Australia procure nuclear-powered submarines in the future.\n\nCanberra did not take Beijing’s threats lightly, however.\n\nThe deployment of Marines to Australia followed a warning by former U.S. President Donald Trump that the mainland could forcibly annex Taiwan. He issued the warning that China is “going to be next” to assert its military might after Russia during a February 2022 interview with Clay Travis and Buck Sexton. (Related: Trump: China will DEFINITELY attack Taiwan following Russia-Ukraine example.)\n\n“China is going to be next. They’re waiting [until] after the [Winter] Olympics. Now the Olympics [has] ended. This would never have happened if we were there. Had I been in office, not even thinkable,” said Trump.\n\n“The Restricted Republic” host Lisa Haven elaborated on Trump’s warning during the February interview held at the former president’s Mar-a-Lago resort in Florida. “Trump is seizing up this opportunity to issue a dire warning to the American people. [This is] a warning that I myself have given quite a few times, and a warning that we should all take to heart and take seriously – because so much is at stake,” she said.\n\nAccording to Haven, Trump strongly believes the Chinese invasion of Taiwan is imminent and “could happen sometime soon.”\n\nVisit NationalSecurity.news for more articles like this.\n\nWatch Lisa Haven of “The Restricted Republic” expounding on Trump’s warning about China and Taiwan below.\n\nThis video is from the Lisa Haven channel on Brighteon.com.\n\nUS would quickly lose against China if they invaded Taiwan.\n\nTop Chinese diplomat: China must make first nuclear strike against US.\n\nChina says it will attack any American forces that come to the defense of Taiwan.\n\nChina preparing for what it claims is a “morally justified” war with US, Taiwan over sovereignty.\n\nTaiwan says it is preparing for war as China continues to provoke conflict with massive incursions of fighters, bombers.", "opengraph": {"title": "Thousands of Marines deployed to Australia in preparation for a possible war with CHINA", "type": "article", "url": "https://www.nationalsecurity.news/2022-03-21-marines-deployed-australia-preparation-war-with-china.html", "site_name": "National Security", "description": "Members of the U.S. Marine Corps have been deployed to Australia in preparation for China potentially invading Taiwan. The Marines will be helping their counterparts in the Australian Defense Force (ADF) to ensure preparedness for any crisis or conflict in the region. According to 100PercentFedUp.com, a rotational force of approximately 2,200 Marines will be based […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/03/352437_US-marines.jpg"}, "tags": ["Marines", "regional conflict", "Australia", "AUKUS", "national security", "nuclear weapons", "Australia Defense Force", "China-Taiwan war", "military national security", "Taiwan", "China", "USMC", "world war", "WWIII", "invasion"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/us-deploying-thousands-of-marines-to-australias-northern-territory-to-prepare-for-possibility-of-war-with-china/", "https://summit.news/2022/03/16/wwiii-biden-sending-thousands-of-marines-to-australia-in-anticipation-of-conflict-with-china/", "https://nypost.com/2022/02/23/donald-trump-says-putins-assault-on-ukraine-will-embolden-china-to-take-taiwan/", "https://naturalnews.com/2022-02-28-china-will-definitely-attack-taiwan-says-trump.html", "https://nationalsecurity.news/", "https://www.brighteon.com/ec616aba-8953-4fec-a29d-678342c1dcc6", "https://www.brighteon.com/channels/lisahaven", "https://wwiii.news/2021-03-18-us-would-lose-to-china-in-taiwan-invasion.html", "https://nuclear.news/2021-09-28-china-must-nuke-us-first-says-diplomat.html", "https://communistchina.news/2021-12-13-china-says-will-attack-american-forces-defense-of-taiwan.html", "https://communistchina.news/2020-10-13-china-morally-justified-war-with-us-taiwan.html", "https://wwiii.news/2021-10-06-taiwan-preparing-for-war-china-provoking-conflict.html", "https://100percentfedup.com/us-deploying-thousands-of-marines-to-australias-northern-territory-to-prepare-for-possibility-of-war-with-china/", "https://summit.news/2022/03/16/wwiii-biden-sending-thousands-of-marines-to-australia-in-anticipation-of-conflict-with-china/", "https://nypost.com/2022/02/23/donald-trump-says-putins-assault-on-ukraine-will-embolden-china-to-take-taiwan/", "https://www.brighteon.com/ec616aba-8953-4fec-a29d-678342c1dcc6", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-03-21-marines-deployed-australia-preparation-war-with-china&linkname=Thousands%20of%20Marines%20deployed%20to%20Australia%20in%20preparation%20for%20a%20possible%20war%20with%20CHINA", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}