{"result_id": "206009", "URL": "https://nationalsecurity.news/2021-12-22-harvard-nanoscientist-connected-wuhan-convicted-crimes-china.html", "timestamp": "2023-04-25 16:24:59 CEST+0200", "meta": {"description": "Harvard University professor Charles Lieber has finally been convicted for taking money from the Chinese Communist Party (CCP) and funneling nanotechnology secrets to Wuhan bioweapons research. According to reports, Lieber lied about his ties to a China-run recruitment program. He also made false statements to authorities, filed false tax returns and failed to report a […]", "lang": "en", "keywords": "badscience,big government,Charles Lieber,China,Collusion,conspiracy,conviction,COVID,deception,espionage,Harvard,nanotechnology,national security,research,research theft,traitors,treason,vaccines,Wuhan University of Technology", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://nationalsecurity.news/2021-12-22-harvard-nanoscientist-connected-wuhan-convicted-crimes-china.html", "encoding": "UTF-8"}, "image": null, "domain": "nationalsecurity.news", "title": "Harvard nanoscientist tied to Wuhan convicted of numerous crimes related to Chinese influence on U.S. research", "cleaned_text": "Harvard nanoscientist tied to Wuhan convicted of numerous crimes related to Chinese influence on U.S. research\n\nHarvard University professor Charles Lieber has finally been convicted for taking money from the Chinese Communist Party (CCP) and funneling nanotechnology secrets to Wuhan bioweapons research.\n\nAccording to reports, Lieber lied about his ties to a China-run recruitment program. He also made false statements to authorities, filed false tax returns and failed to report a Chinese bank account he had.\n\nLieber is also a nanotech expert who was involved in developing neurological interfacing and “payload” carbon nanotubes. There is speculation that his technological expertise was used to engineer the so-called “vaccines” for the Wuhan coronavirus (Covid-19), as well as the 5G technology that links up to them.\n\nIn 2011, Lieber agreed to become a “strategic scientist” at the Wuhan University of Technology (WUT). Through this connection, Lieber participated in a Chinese recruitment drive called the “Thousand Talents Program.”\n\n“Prosecutors say China uses that program to recruit foreign researchers to share their knowledge with the country,” reported Yahoo News. “Participation is not a crime, but prosecutors contend Lieber, 62, lied to authorities inquiring about his involvement.”\n\nWatch the Dec. 22, 2021, episode of the Health Ranger’s Situation Update below to learn more about this saga:\n\nDefense lawyer Marc Mukasey says that prosecutors “mangled” evidence against Lieber and lacked key documents to support their claims. They also allegedly relied too heavily on a “confused” FBI interview with Lieber following his arrest.\n\nDuring the six-day trial and nearly three hours of jury deliberations, Lieber, who currently has cancer, reportedly sat emotionless, even as the verdict was announced.\n\n“We respect the verdict and will keep up the fight,” Mukasey added.\n\nIn January 2020, Lieber was charged as part of a Department of Justice (DoJ) “China Initiative,” which was launched during the Trump administration to counter suspected Chinese economic espionage and research theft.\n\nThe Biden regime has since carried on the China Initiative, though the DoJ is now saying that it is reviewing its approach to the program.\n\nAccording to prosecutors, Lieber lied about his role in the Thousand Talents Program to both the Department of Defense (DoD) and the National Institutes of Health (NIH), which awarded him $15 million in research grants.\n\nDuring his interview with FBI agents immediately following his arrest, Lieber said he was “younger and stupid” at the time when he linked up with the Wuhan university. He says he thought the collaborations would help boost his recognition in the scientific world.\n\nAs part of the setup, Lieber received $50,000 per month from the WUT, along with $158,000 in living expenses. He was paid in cash and the deposits were made to a Chinese bank account that he did not report.\n\nLieber told the FBI that he was paid between $50,000 and $100,000 in cash, and that at one time his Chinese bank account contained $200,000.\n\nHowever, on his 2013 and 2014 income tax returns, Lieber never reported any of this. For a full two years, he failed to report the bank account at all.\n\n“Harvard’s worried about their grads supporting Trump while current employees spy for China?” wrote one commenter at Natural News at the time when Lieber was first arrested.\n\n“Hopefully we’ll eventually get to the bottom of the Covid-19 false flag,” wrote another.\n\nOver at Brighteon, a commenter expressed confusion over why the deep state, which is “pushing the plandemic and vaccine on everyone would prosecute one of their own for doing this?” Perhaps Lieber is one of the sacrificial goats in this whole saga?\n\n“I’m a little confused,” wrote yet another. “Didn’t all this start under the Obama administration over in the Research Triangle (North Carolina)?”\n\nMore related news can be found at Pandemic.news.", "opengraph": {"title": "Harvard nanoscientist tied to Wuhan convicted of numerous crimes related to Chinese influence on U.S. research", "type": "article", "url": "https://www.nationalsecurity.news/2021-12-22-harvard-nanoscientist-connected-wuhan-convicted-crimes-china.html", "site_name": "National Security", "description": "Harvard University professor Charles Lieber has finally been convicted for taking money from the Chinese Communist Party (CCP) and funneling nanotechnology secrets to Wuhan bioweapons research. According to reports, Lieber lied about his ties to a China-run recruitment program. He also made false statements to authorities, filed false tax returns and failed to report a […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2021/12/wuhan-virology-hazmat-suits.png"}, "tags": ["conspiracy", "big government", "national security", "research", "treason", "COVID", "nanotechnology", "deception", "Collusion", "research theft", "China", "Charles Lieber", "conviction", "vaccines", "traitors", "espionage", "Harvard", "Wuhan University of Technology"], "tweets": [], "movies": [], "links": ["http://www.harvard.edu", "https://news.yahoo.com/harvard-professor-lied-china-ties-175552206.html", "http://english.whut.edu.cn/", "https://naturalnews.com/2021-01-19-harvard-charles-lieber-arrested-treason-communist-china.html", "https://www.brighteon.com/37bd11cd-701d-4d52-96c3-eeba54d9914b", "http://pandemic.news", "https://news.yahoo.com/harvard-professor-lied-china-ties-175552206.html", "https://naturalnews.com/2021-01-19-harvard-charles-lieber-arrested-treason-communist-china.html", "https://www.brighteon.com/37bd11cd-701d-4d52-96c3-eeba54d9914b", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2021-12-22-harvard-nanoscientist-connected-wuhan-convicted-crimes-china&linkname=Harvard%20nanoscientist%20tied%20to%20Wuhan%20convicted%20of%20numerous%20crimes%20related%20to%20Chinese%20influence%20on%20U.S.%20research", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}