{"result_id": "206024", "URL": "https://www.nationalsecurity.news/2023-04-04-demon-ai-synthetic-biotechnology-superhuman-biology.html", "timestamp": "2023-04-25 16:25:09 CEST+0200", "meta": {"description": "A high-profile artificial intelligence (AI) researcher is warning that unless all advanced AI systems and associated programs are immediately shut down, humanity will eventually become extinct at the hands of the life-destroying robots they are unleashing. Eliezer Yudkowsky, co-founder of the Machine Intelligence Research Institute (MIRI), wrote an op-ed for TIME magazine this week explaining […]", "lang": "en", "keywords": "AI,artificial intelligence,big government,biotech,computing,cyber war,Dangerous,dangerous tech,demonic,future science,future tech,genetic lunacy,genocide,Glitch,information technology,insanity,inventions,national security,robotics,robots,superhuman,synthetic biology", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.nationalsecurity.news/2023-04-04-demon-ai-synthetic-biotechnology-superhuman-biology.html", "encoding": "UTF-8"}, "image": null, "domain": "www.nationalsecurity.news", "title": "3D WORLD ALERT: Demon-possessed AI learning how to use synthetic biotechnology to construct its own “superhuman” biological systems", "cleaned_text": "3D WORLD ALERT: Demon-possessed AI learning how to use synthetic biotechnology to construct its own “superhuman” biological systems\n\nA high-profile artificial intelligence (AI) researcher is warning that unless all advanced AI systems and associated programs are immediately shut down, humanity will eventually become extinct at the hands of the life-destroying robots they are unleashing.\n\nEliezer Yudkowsky, co-founder of the Machine Intelligence Research Institute (MIRI), wrote an op-ed for TIME magazine this week explaining the risks involved with the creation of these synthetic life forms. He wrote that:\n\n“The most likely result of building a superhumanly smart AI, under anything remotely like the current circumstances, is that literally everyone on Earth will die.”\n\nThis is a serious warning that others are now echoing as they come to the stark realization that the agenda will not stop with GPT-4 “chatbots” and other seemingly innocuous AI programs. The truth is that these AI systems are becoming possessed by demons with an anti-human agenda, and thus must be stopped immediately before it is too late.\n\nAI systems can already be “emailed DNA” to turn into “artificial life forms,” Yudkowsky says\n\nLike Musk, Yudkowsky wants all AI labs to immediately cease, for at least the next six months, all AI training programs that are more powerful than GPT-4. He also commented on the petition, stating that it is “asking for too little to solve” the problems posed by the rapid and uncontrolled development of AI systems.\n\nThese AI systems do “not care for us nor for sentient life in general,” Yudkowsky argues, adding that in order to survive an encounter with one, a person would need “precision and preparation and new scientific insights” that, generally speaking, humanity lacks.\n\n“A sufficiently intelligent AI won’t stay confined to computers for long,” he added, further explaining that it is already possible to email DNA strands to a laboratory that can manufacture proteins for AI “to build artificial life forms or bootstrap straight to postbiological molecular manufacturing.”\n\nIt is the stuff of the Terminator movie franchise but in real life, in other words. And it is happening faster than many people realize as the media distracts everyone with just about every other topic under the sun.\n\n“There can be no exceptions, including for governments or militaries,” Yudkowsky says about how all AI systems need to be stopped immediately.\n\n“If intelligence says that a country outside the agreement is building a GPU (graphics processing unit) cluster, be less scared of a shooting conflict between nations than of the moratorium being violated; be willing to destroy a rogue datacenter by airstrike.”\n\nHow to get every country of the world on board with stopping AI could prove challenging, though. Is it even possible to regulate such a thing, especially when it is taking place in private in the remotest areas of the world outside the control or even the knowledge of law enforcement?\n\nYudkowsky sees AI as such a threat that he thinks it should be made “explicit in international diplomacy that preventing AI extinction scenarios is considered a priority above preventing a full nuclear exchange.”\n\nIn the comments, someone joked that “first it was aliens, then it was a zombie apocalypse, and now it’s terminator robots,” the implication being that perhaps Yudkowsky and his ilk are overblowing the AI threat.\n\n“It has been a well acknowledged and accepted fact that technological, and biological products have been already developed and operating within the military complex for many years before any public awareness!” suggested another. “Are these bio artificial intelligence human form androids already among us?”\n\nWill the world be taken over by demon-possessed AI robots? Learn more at Robots.news.", "opengraph": {"title": "3D WORLD ALERT: Demon-possessed AI learning how to use synthetic biotechnology to construct its own “superhuman” biological systems", "type": "article", "url": "https://www.nationalsecurity.news/2023-04-04-demon-ai-synthetic-biotechnology-superhuman-biology.html", "site_name": "National Security", "description": "A high-profile artificial intelligence (AI) researcher is warning that unless all advanced AI systems and associated programs are immediately shut down, humanity will eventually become extinct at the hands of the life-destroying robots they are unleashing. Eliezer Yudkowsky, co-founder of the Machine Intelligence Research Institute (MIRI), wrote an op-ed for TIME magazine this week explaining […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2023/04/Demons-Hell-Damned-Souls.jpg"}, "tags": ["AI", "big government", "national security", "inventions", "robots", "demonic", "future tech", "robotics", "synthetic biology", "biotech", "genetic lunacy", "cyber war", "future science", "superhuman", "information technology", "computing", "Dangerous", "insanity", "Glitch", "artificial intelligence", "dangerous tech", "genocide"], "tweets": [], "movies": [], "links": ["https://www.rt.com/news/573972-ai-danger-nuclear-yudkowsky/", "https://www.naturalnews.com/2023-04-03-elon-musk-petition-major-ai-developments-paused.html", "http://Robots.news", "https://www.rt.com/news/573972-ai-danger-nuclear-yudkowsky/", "https://www.naturalnews.com/2023-04-03-elon-musk-petition-major-ai-developments-paused.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2023-04-04-demon-ai-synthetic-biotechnology-superhuman-biology&linkname=3D%20WORLD%20ALERT%3A%20Demon-possessed%20AI%20learning%20how%20to%20use%20synthetic%20biotechnology%20to%20construct%20its%20own%20%E2%80%9Csuperhuman%E2%80%9D%20biological%20systems", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}