{"result_id": "206004", "URL": "https://www.nationalsecurity.news/2022-08-11-china-convinced-must-hit-us-before-attacking-taiwan.html", "timestamp": "2023-04-25 16:24:56 CEST+0200", "meta": {"description": "A leading national security expert believes China has devised a shocking plan to take Taiwan by force that would first involve a massive strike against the United States in the vein of Japan’s Dec. 7, 1941 surprise attack. According to Prof. Oriana Skylar Mastro, a fellow at Stanford University, China has decided it must hit the […]", "lang": "en", "keywords": "chaos,China,communist China,dementia president,Joe Biden,national security,panic,Pearl Harbor,politics,sneak attack,surprise attack,Taiwan,United States,WWIII,Xi Jinping", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.nationalsecurity.news/2022-08-11-china-convinced-must-hit-us-before-attacking-taiwan.html", "encoding": "UTF-8"}, "image": null, "domain": "www.nationalsecurity.news", "title": "Expert says China convinced it must hit US in ‘Pearl Harbor-like’ quick strike before attacking Taiwan", "cleaned_text": "Expert says China convinced it must hit US in ‘Pearl Harbor-like’ quick strike before attacking Taiwan\n\nA leading national security expert believes China has devised a shocking plan to take Taiwan by force that would first involve a massive strike against the United States in the vein of Japan’s Dec. 7, 1941 surprise attack.\n\nAccording to Prof. Oriana Skylar Mastro, a fellow at Stanford University, China has decided it must hit the U.S. “hard and early” in order to severely cripple America and either stunt or prevent any response ahead of launching an invasion of Taiwan.\n\nIn an interview with The Sun, Mastro said that China increasingly views war with the United States as being unpreventable and even necessary in order to capture Taiwan and bring the ‘renegade province’ under Beijing’s Communist control.\n\nThe warning comes on the heels of a visit to Taiwan by House Speaker Nancy Pelosi (D-Calif.), which highly angered the ChiCom regime leading President Xi Jinping to order snap military exercises involving dozens of aircraft sorties and the firing of missiles in the direction of Taiwan.\n\nMastro told The Sun Online these types of blockade war games are set to become more commonplace as the threat of war increasingly looms.\n\nShe explained that Beijing now believes it also has to fight the US if it is to fulfill its long cherished goal of invading Taiwan and “reuniting” with the mainland.\n\nMastro believes the most likely way such a conflict would play out is with a Pearl Harbor-style attack on US forces in the region.\n\nAny such surprise attack, which would likely infuriate most Americans despite our current political divide, would be designed to destroy as much offensive American military capability in the Indo-Pacific Region as possible in order to deter operations aimed at stopping or shunting China’s Taiwan invasion.\n\nThe Stanford University expert also surmised that China would launch such an attack as a means of stopping a wider war, as Japan thought when the imperial government attacked Pearl Harbor — an attack that merely drew the U.S. immediately into World War II after remaining neutral despite Hitler’s assaults on Europe.\n\n“It’s about hitting hard and early so we can get boots on the island before the United States can launch a response,” Mastro told The Sun Online.\n\n“My argument is that the more people like Pelosi try to make the US commitment clear, then the more certain the Chinese are of our commitment — and the more likely a Pearl Harbor-style attack is,” she added.\n\nFor decades, the U.S. has maintained a policy of “strategic ambiguity” over whether it would support Taiwan militarily should China invade. But the bumbling idiot in the White House, Joe Biden, responded unequivocally “yes” when asked earlier this year if the U.S. would come to Taiwan’s aid if the island democracy fell under attack by Beijing.\n\n“Pelosi is a vocal supporter of Taiwan — and her trip to the island earlier this week made her the most senior US politician to visit Taiwan in a quarter of a century, which infuriated China,” The Sun reported. “During her trip the Speaker of the House of Representatives voiced America’s support for Taiwan and seemed to have called Beijing’s bluff after it hinted it might shoot down her plane.”\n\nFollowing Pelosi’s visit, China launched massive military exercises and now has essentially placed a naval blockade around Taiwan.\n\nAs for Mastro, earlier this year she estimated that the U.S. could lose a war with China in a week as the Pentagon struggled to get forces into position to aid Taiwan following a Chinese sneak attack that would no doubt target U.S. Navy aircraft carriers as well as troops in South Korea, Japan and on Guam.\n\nBut any attack by China on U.S. forces will surely draw a heavy response — perhaps from a coalition of nations aligned with the U.S. because they cannot afford to leave the world to the Communist Chinese.", "opengraph": {"title": "Expert says China convinced it must hit US in ‘Pearl Harbor-like’ quick strike before attacking Taiwan", "type": "article", "url": "https://www.nationalsecurity.news/2022-08-11-china-convinced-must-hit-us-before-attacking-taiwan.html", "site_name": "National Security", "description": "A leading national security expert believes China has devised a shocking plan to take Taiwan by force that would first involve a massive strike against the United States in the vein of Japan’s Dec. 7, 1941 surprise attack. According to Prof. Oriana Skylar Mastro, a fellow at Stanford University, China has decided it must hit the […]", "image": "https://www.nationalsecurity.news/wp-content/uploads/sites/23/2022/08/pearl_harbor.jpg"}, "tags": ["Joe Biden", "chaos", "sneak attack", "surprise attack", "national security", "communist China", "politics", "United States", "dementia president", "Pearl Harbor", "Taiwan", "WWIII", "China", "panic", "Xi Jinping"], "tweets": [], "movies": [], "links": ["https://www.the-sun.com/news/5935484/china-pearl-harbor-attack-taiwan/", "https://naturalnews.com/2022-08-06-taiwan-chip-giant-warns-global-supply-devastation.html", "http://www.wwiii.news", "https://www.the-sun.com/news/5935484/china-pearl-harbor-attack-taiwan/", "https://naturalnews.com/2022-08-06-taiwan-chip-giant-warns-global-supply-devastation.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnationalsecurity%2F2022-08-11-china-convinced-must-hit-us-before-attacking-taiwan&linkname=Expert%20says%20China%20convinced%20it%20must%20hit%20US%20in%20%E2%80%98Pearl%20Harbor-like%E2%80%99%20quick%20strike%20before%20attacking%20Taiwan", "https://www.addtoany.com/share", "http://store.naturalnews.com/Ranger-Bucket--Organic-Emergency-Storable-Food-Supply_p_860.html?a_aid=JD&a_bid=d9ca75ec", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}