{"result_id": "209009", "URL": "https://naturalcures.com/cure/tetanus/", "timestamp": "2023-04-25 16:25:39 CEST+0200", "meta": {"description": "Find all Natural Cures for Natural Cures For Tetanus only on NaturalCures.com - the world's #1 resource of natural health cures and remedies, including Natural Cures For Tetanus . Become a member now!", "lang": "en", "keywords": "", "favicon": "https://naturalcures.com/wp-content/uploads/2017/07/cropped-Favicon-32x32.png", "canonical": "https://naturalcures.com/cure/tetanus/", "encoding": "UTF-8"}, "image": null, "domain": "naturalcures.com", "title": "Natural Cures for Natural Cures For Tetanus", "cleaned_text": "Tetanus is caused by the Clostridium tetani bacterium. Clostridium tetani spores can live for a long time outside the body and are widespread in the environment. They are commonly found in the manure of animals such as horses and cows, and in contaminated soil.\n\nAfter they enter the body, the tetanus bacteria quickly multiply and release tetanospasmin. This is a type of poison known as a neurotoxin. If tetanospasmin enters the bloodstream, it can spread around the body, causing the symptoms of tetanus to develop.\n\nNeurotoxins block the nerve signals that are sent from the brain to the spinal cord and then on to the muscles. This causes the muscle spasms and muscle stiffness associated with tetanus.\n\nOne of the most common ways that tetanus bacteria can enter the body is through a cut or a puncture wound, such as the type of wound you would get after stepping on a nail. Even minor puncture wounds, such as piercing your skin with the thorn of a rose, could allow the bacteria to enter your body.\n\nTetanus bacteria thrive and breed in places where there is little or no oxygen. This is why the infection often occurs in deep cuts and wounds. To help prevent a tetanus infection developing, always ensure that cuts and wounds are thoroughly cleaned.\n\nAs well as entering the body through cuts and wounds, the tetanus bacteria can also enter through:\n• lacerations – tears or splits in the skin caused by blunt trauma such as a blow to the skin, or a sharp object such as a knife or broken glass\n• abrasions – wounds that are caused by friction damage, such as the type of wound you would get after falling off a bike and scraping your knee\n• body piercings and tattoos (if un-sterilised equipment is used)\n\nSome groups of people, such as travellers and people who inject drugs, may be at an increased risk of developing tetanus.\n\nIf you are travelling abroad, make sure your vaccinations are up to dateDepending on where you are travelling, you may need additional doses of certain vaccinations.\n\nIf you are travelling to a remote area where medical services may not be easily accessible, and you had your last tetanus vaccine more than 10 years ago, you need to have a booster dose (even if you have already had the full five doses). This is done as a precaution, in case you get a wound that is vulnerable to a tetanus infection and you cannot get suitable medical care.\n\nPeople who inject illegal drugs such as heroin or methamphetamine have an increased risk of developing tetanus. Drug dealers often mix these types of drugs with a chemical called quinine. Quinine can be contaminated by the tetanus bacteria.\n\nFor example, in England during 2003 and 2004, an outbreak of 20 cases of tetanus was linked to a contaminated batch of heroin.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Natural Cures for Natural Cures For Tetanus - NaturalCures.com", "description": "Find all Natural Cures for Natural Cures For Tetanus only on NaturalCures.com - the world's #1 resource of natural health cures and remedies, including Natural Cures For Tetanus . Become a member now!", "url": "https://naturalcures.com/cure/tetanus/", "site_name": "NaturalCures.com", "article:modified_time": "2021-04-20T08:46:18+00:00", "image": "https://naturalcures.com/wp-content/uploads/2019/03/shutterstock_241044940.jpg", "image:width": "1920", "image:height": "1280", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}