{"result_id": "209006", "URL": "https://naturalcures.com/cure/idiopathic-thrombocytopenic-purpura/", "timestamp": "2023-04-25 16:25:33 CEST+0200", "meta": {"description": "Find all Natural Cures for Idiopathic Thrombocytopenic Purpura only on NaturalCures.com - the world's #1 resource of natural health cures and remedies, including Idiopathic Thrombocytopenic Purpura . Become a member now!", "lang": "en", "keywords": "", "favicon": "https://naturalcures.com/wp-content/uploads/2017/07/cropped-Favicon-32x32.png", "canonical": "https://naturalcures.com/cure/idiopathic-thrombocytopenic-purpura/", "encoding": "UTF-8"}, "image": null, "domain": "naturalcures.com", "title": "Idiopathic Thrombocytopenic Purpura | Natural cures", "cleaned_text": "In a survey PDSA conducted in 2001, 40 percent of respondents with ITP reported improvement in their condition by following either a macrobiotic diet or Dr. Peter D’Adamo’s “Eat Right for Your Type” diet. To incorporate aspects of these diets into your regimen, PDSA suggests going slowly and consulting first with a health practitioner.\n\nRecommendations include eating fresh, whole, organic foods; reducing consumption of red meat, sugar and dairy; boosting intake of healthy fats; eating foods rich in vitamin K — which promotes coagulation — such as kale, collard greens and sea vegetables; and avoiding alcohol and foods and beverages containing quinine, which can lower platelet counts.\n\nSome foods and beverages thin the blood, so you may consider limiting them until your platelet count returns to the normal range. According to Dr. Richard Brouse, founder of the Health Education Corp., natural blood-thinners include foods containing salicylates, such as the spices curry, ginger, cinnamon and turmeric, and fruits such as cherries, grapes and prunes; foods high in omega-3 fatty acids, such as flaxseed, salmon, anchovies, tuna and herring; and foods in the onion and garlic family. Red wine is also a known blood thinner.\n\nIt is important to not add further toxicity to your system so try to adhere to the following:\n• Do not consume any artificial sweeteners, such as Splenda, NutraSweet or Aspartame\n• Do not consume high fructose corn syrup or mono-sodium glutamate.\n• Do not drink any carbonated beverages.\n• Eliminate conventional dairy products. The best dairy products are raw, unpasteurised and homogenised dairy from grass fed cows. If this is unavailable, then buy organic dairy.\n• Avoid conventional beef. The best beef is organic grass fed beef.\n\nwww.grasslandbeef.com The second best is organic meat; this includes beef, veal, lamb, chicken and turkey.\n\nBelow is a selection of supplements that have some potential to improve your platelet count and/or symptoms. Everyone is different, plus manufacturing conditions, brands, vitamin types, and dosages vary.\n\nFolic acid is a water-soluble vitamin needed for numerous body functions including DNA repair and rapid cell division and growth, including blood cells. Folic acid deficiency may cause thrombocytopenia (Easton 1984, Mant 1979). In a study of 14 ITP patients given high doses of folic acid, 64% had a complete or partial response and the others showed some transient improvement (Schulz 2003). However, if someone has a low level of vitamin B12, high doses of folic acid may cause anemia and cognitive impairment (Selhub J, 2007).\n\nVitamin C is an anti-inflammatory nutrient that is important for healing wounds, maintaining the integrity of capillaries, and absorbing iron from food. Since ITP is associated with inflammation (Imbach 2011) and reducing bleeding symptoms is important, it is plausible that taking vitamin C could help ITP patients. Of all the vitamins and supplements, vitamin C has been the most studied in ITP. However, clinical results have been mixed, with very positive initial results (Brox 1988), but disappointing research results over time (Jubelirer 1993).\n\nVitamin D is a nutrient needed for healthy nerves, muscles, bones, and immune system.According to a Japanese study, vitamin D plays a valuable role in the function of hematopoietic stem cells, cells in the bone marrow that give rise to red blood cells, white blood cells, and platelets (Kawamori 2010). Since low levels of vitamin D have been associated with autoimmune diseases (Toubi 2010) and vitamin D can alter regulatory T-cells (a type of white blood cell), some researchers speculate it could be used to treat autoimmune diseases (Prietl 2010). Note that ITP is a T-cell mediated disease (Semple 2010).\n\nVitamin K is essential for your blood to clot and for healthy bones. However its anti-inflammatory properties are less well known (Aoganghua 2011). In a large study, people with higher vitamin K levels had lower levels of 14 markers of inflammation, some of which are linked to chronic disease (Shea 2008). You can get vitamin K from leafy greens such as kale, collards, and spinach, plus meat, eggs, and dairy products.\n• Take Vitamin D3 50,000-100,000 International Units a day for periods of 4 weeks at a time.\n• Wholefood supplements are the best way of ensuring your nutritional needs are met. The best we know on the market is Kevin Trudeau’s “KT Daily” product. You can find more details here.\n\nWhat non-prescription and prescription drugs are you taking? Your non-prescription and prescription are partially the reason that you have this illness or disease – you need to get off these medications but do so only under the guidance of a licensed health care practitioner.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Idiopathic Thrombocytopenic Purpura | Natural cures", "description": "Find all Natural Cures for Idiopathic Thrombocytopenic Purpura only on NaturalCures.com - the world's #1 resource of natural health cures and remedies, including Idiopathic Thrombocytopenic Purpura . Become a member now!", "url": "https://naturalcures.com/cure/idiopathic-thrombocytopenic-purpura/", "site_name": "NaturalCures.com", "article:modified_time": "2022-01-15T09:04:38+00:00", "image": "https://naturalcures.com/wp-content/uploads/2019/03/shutterstock_241044940.jpg", "image:width": "1920", "image:height": "1280", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.grasslandbeef.com/StoreFront.bok?affld=104400", "https://amzn.to/1o1oV6Z", "https://kevintrudeaudailylifesessentials.com/", "https://amzn.to/1QUpGrC", "https://amzn.to/1QUpoB2", "https://amzn.to/1SH1KM0", "https://amzn.to/1KEddZN"], "authors": [], "publish_date": null}