{"result_id": "209014", "URL": "https://naturalcures.com/aids-virus-or-drug-induced/", "timestamp": "2023-04-25 16:25:46 CEST+0200", "meta": {"description": "AIDS: Virus or Drug Induced?, two dozen scientists, scholars and journalists have investigated the status quo of AIDS research. Most of them have questioned", "lang": "en", "keywords": "", "favicon": "https://naturalcures.com/wp-content/uploads/2017/07/cropped-Favicon-32x32.png", "canonical": "https://naturalcures.com/aids-virus-or-drug-induced/", "encoding": "UTF-8"}, "image": null, "domain": "naturalcures.com", "title": "AIDS: Virus or Drug Induced", "cleaned_text": "Description: Despite enormous efforts, over 100,000 papers and over $22 billion spent by the US taxpayer alone, the HIV-AIDS hypothesis has failed to produce any public health benefits, no vaccine, no effective drug, no prevention, no cure, not a single life saved. Is the science system to be blamed? Has science failed to reveal the truth about AIDS?\n\n In AIDS: Virus or Drug Induced?, two dozen scientists, scholars and journalists have investigated the status quo of AIDS research. Most of them have questioned the HIV-AIDS hypothesis before, but have since been censored, and sociologically excluded from AIDS research, politics and journalism. Here they are united for the first time to put on trial the HIV-AIDS hypothesis.\n\n There are those who acquit HIV entirely. Others who make a case for HIV as a necessary, but not a sufficient cause of AIDS. And one medical scientist who, together with the huge AIDS literature, defends the hypothesis that HIV is sufficient to cause AIDS.\n\nThe book convincingly reveals that the scientific method could very well find a solution to AIDS, but only if ideas can be exchanged freely and if the HIV monopoly can be broken. AIDS: Virus or Drug Induced? illustrates that the solution to AIDS could be as close as one of several, very testable and very affordable alternatives to the to the unproductive HIV-AIDS hypothesis.", "opengraph": {"locale": "en_GB", "type": "article", "title": "AIDS: Virus or Drug Induced NaturalCures.com", "description": "AIDS: Virus or Drug Induced?, two dozen scientists, scholars and journalists have investigated the status quo of AIDS research. Most of them have questioned", "url": "https://naturalcures.com/aids-virus-or-drug-induced/", "site_name": "NaturalCures.com", "article:published_time": "2020-02-10T01:01:26+00:00", "article:modified_time": "2022-06-20T06:47:40+00:00", "image": "https://naturalcures.com/wp-content/uploads/2019/03/shutterstock_241044940.jpg", "image:width": "1920", "image:height": "1280", "image:type": "image/jpeg"}, "tags": ["AIDS"], "tweets": [], "movies": [], "links": ["https://www.amazon.com/exec/obidos/ASIN/0792339614/naturalcure06-20"], "authors": ["Dev"], "publish_date": "2020-02-10T01:01:26+00:00"}