{"result_id": "209004", "URL": "https://naturalcures.com/cure/rubella/", "timestamp": "2023-04-25 16:25:30 CEST+0200", "meta": {"description": "Find all Natural Cures for Rubella only on NaturalCures.com - the world's #1 resource of natural health cures and remedies, including Rubella . Become a member now!", "lang": "en", "keywords": "", "favicon": "https://naturalcures.com/wp-content/uploads/2017/07/cropped-Favicon-32x32.png", "canonical": "https://naturalcures.com/cure/rubella/", "encoding": "UTF-8"}, "image": null, "domain": "naturalcures.com", "title": "Natural Cures for Rubella", "cleaned_text": "A viral infection that used to be common in children, rubella (also known as German measles) is usually a mild infection.\n\nThe only instance that rubella becomes a serious concern is if a pregnant woman catches the infection during the first 16 weeks of her pregnancy, as the virus can disrupt a baby’s development and case a range of health problems, including:\n• Eye problems, such as cataracts (cloudy patches on the lens of the eye)\n\nHistorically children have been vaccinated with the combined MMR (Measles, Mumps, Rubella) injection but there has been much controversy over its health risks and side-effects – particularly with its links to autism.\n\nThe suggestion that there is a link between MMR and autism has been one of the biggest health controversies of recent years.Dr Andrew Wakefield was the lead author of the controversial study, which suggested there may be a link between MMR and autism and bowel disease. In the early 1990s, he was working as a senior lecturer at the Royal Free Medical School in north London. He had published a number of studies which he suggested showed a link between measles and Crohn’s disease, a form of inflammatory bowel disease. By the mid-1990s, Dr Wakefield had started to consider whether there was a link between the three-in-one MMR vaccine and autism and bowel disease. His study focused on tests carried out on 12 children who had been referred to the Royal Free Hospital in Hampstead for gastrointestinal problems. At the same time, Dr Wakefield was paid to carry out another study to find out if parents who claim their children were damaged by the MMR vaccine had a case. Some children were involved in both studies. He was to advise parents against having their children vaccinated with the 3 in 1 shot. His comments and the subsequent media furore led to a sharp drop in the number of children vaccinated against these diseases. In 2001, Dr Wakefield resigned from his £50,000 a year NHS post, after 14 years in the job.\n\nSpeaking at the time, he said: “I have been asked to go because my research results are unpopular.” Dr Wakefield has since worked for the International Child Development Resource Center. The centre, based in Florida, is associated with the Good News Doctor Foundation, a Christian ministry. He has also continued to see patients at the Thoughtful House, a centre for autistic children in Texas, where he is currently the executive director.\n\nDr Wakefield remains adamant that the scientific results of his 1998 study are still valid.\n\nIn a statement, he said: “The clinical and pathological findings in these children stand as reported.” He also welcomed the decision by the General Medical Council to examine how he carried out his research.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Natural Cures for Rubella - NaturalCures.com", "description": "Find all Natural Cures for Rubella only on NaturalCures.com - the world's #1 resource of natural health cures and remedies, including Rubella . Become a member now!", "url": "https://naturalcures.com/cure/rubella/", "site_name": "NaturalCures.com", "article:modified_time": "2018-06-29T00:05:01+00:00", "image": "https://176.32.230.250/naturalcures.com/wp-content/uploads/2017/07/syringe-2-small-200x216.jpg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}