{"result_id": "209008", "URL": "https://naturalcures.com/vaccine-are-they-really-safe-and-effective/", "timestamp": "2023-04-25 16:25:37 CEST+0200", "meta": {"description": "Vaccines: Are They Really Safe and Effective? (the new, completely updated and revised edition, 2008) is a fully documented guide to immunizations. It inclu", "lang": "en", "keywords": "", "favicon": "https://naturalcures.com/wp-content/uploads/2017/07/cropped-Favicon-32x32.png", "canonical": "https://naturalcures.com/vaccine-are-they-really-safe-and-effective/", "encoding": "UTF-8"}, "image": null, "domain": "naturalcures.com", "title": "Vaccines | Natural Cures – Natural Remedies and Health Advice", "cleaned_text": "Description: Vaccines: Are They Really Safe and Effective? (the new, completely updated and revised edition, 2008) is a fully documented guide to immunizations. It includes 30 charts and graphs plus nearly 1,000 citations so that all of the information may be confirmed.\n\nThis bestselling vaccine handbook (more than 150,000 copies sold) evaluates each vaccine for safety, efficacy, and long-term effects. It contains some of the most comprehensive, up-to-date, uncensored data available — information that many doctors don’t even know. It includes recent studies, numerous case histories detailing vaccine-induced damage to children, and pinpoints for parents exact conditions that may put their own children at high risk. It includes information on vaccine ingredients, natural versus artificial immunity, and provides data documenting correlations between MMR and autism, polio vaccines and cancer, the hepatitis B vaccine and multiple sclerosis, the Hib vaccine and diabetes, and much, much more. In addition, it outlines current vaccine laws and offers parental options to “mandatory” shots.\n\nHere are some highlights from this landmark book:\n\nPolio vaccines were contaminated with cancer-causing monkey viruses and administered to more than 100 million people. Sixty-two studies from 30 laboratories around the world have linked these tainted vaccines to dramatic increases in brain tumors, bone cancers, lung cancers and leukemia (pp. 20-22).\n\nDuring the 1980s and 1990s, more than half of all measles cases in the United States occurred in people who were adequately vaccinated (p. 29).\n\nSurveys in medical journals indicate that up to 87 percent of pediatricians and family practitioners do not believe the hepatitis B vaccine is needed by their newborn patients (p. 51).\n\nA recent study in the Journal of the American Medical Association has linked the chickenpox vaccine to serious adverse events, including neurological disorders, immune system damage, and death (p. 54).\n\nA recent study in the British Medical Journal has linked the Haemophilus Influenzae Type B (Hib) vaccine to rising diabetes rates (p. 58).\n\nThe new HPV (“cervical cancer” vaccine) for young women has been linked to serious and life-threatening disabilities, including Guillain-Barre syndrome (paralysis), seizures, heart disturbances, menstrual irregularities, genital warts and vaginal lesions (pp. 69-71).\n\nAccording to the FDA, thousands of children are damaged or killed by vaccines every year. Families of vaccine-damaged children were recently compensated more than $1 BILLION (p. 102).\n\nParents, educators, and health professionals have very few sources of information permitting them to make informed choices regarding vaccines. But concerned parents are pleading for answers to their many questions. Doctors only tell them one side of the story; there is another side. Vaccines: Are They Really Safe and Effective? tells the other side and helps all concerned people to make wise and responsible decisions.\n\nIncludes information on ALL recommended childhood shots PLUS smallpox, shingles, HPV and flu.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Vaccines | Natural Cures – Natural Remedies and Health Advice", "description": "Vaccines: Are They Really Safe and Effective? (the new, completely updated and revised edition, 2008) is a fully documented guide to immunizations. It inclu", "url": "https://naturalcures.com/vaccine-are-they-really-safe-and-effective/", "site_name": "NaturalCures.com", "article:published_time": "2020-03-27T07:09:08+00:00", "article:modified_time": "2022-06-20T06:51:14+00:00", "image": "https://naturalcures.com/wp-content/uploads/2019/03/shutterstock_241044940.jpg", "image:width": "1920", "image:height": "1280", "image:type": "image/jpeg"}, "tags": ["vaccines"], "tweets": [], "movies": [], "links": ["https://www.amazon.com/exec/obidos/ASIN/1881217302/naturalcure06-20"], "authors": ["Dev"], "publish_date": "2020-03-27T07:09:08+00:00"}