{"result_id": "210015", "URL": "https://www.naturalhealth365.com/covid-19-vaccine-announcement-3636.html", "timestamp": "2023-04-25 16:26:18 CEST+0200", "meta": {"description": "(NaturalHealth365) The COVID-19 vaccine is being touted as the \"only way\" to be back to normal. But, here is some underreported news to see.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-19-vaccine-announcement-3636.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID-19 Vaccine News Announcement", "cleaned_text": "(NaturalHealth365) Will a COVID-19 vaccine return us to a sense of “normalcy,” quelling the global pandemic and putting an end to one of the worst years in human history? Or, is it destined to be just another rabbit hole in which roll-out and distribution are a logistical nightmare, negative side effects more common than initially predicted, and where pharma giants make huge profits from free-riding on research carried out by the public sector?\n\nEven worse, thought of by many people, this “solution” could very well be part of a depopulation agenda by the global elite. Whatever you think, there is one simple problem being overlooked – that we’ll point out today…\n\nAccording to researchers and environmental health scientists, a successful COVID-19 vaccine could be hindered by the widespread contamination of PFAS chemicals found in everyday products. These man-made chemicals, or forever chemicals, have been used in industry and consumer products worldwide since the 1950s and exist in everything from non-stick pans and waterproof clothes to pizza boxes and fast-food wrappers.\n\n“Forever chemicals” are inside 99% percent of Americans and can influence the results of a COVID-19 vaccine\n\nOnce hailed as a miracle of modern chemistry, PFAS are now a public scourge and national health crisis, having been linked to liver damage, decreased fertility, and cancer. Scientists are now warning that PFAS might reduce the effectiveness of certain administered vaccines.\n\nCurrently, it’s uncertain if PFAS contamination will disrupt the messenger RNA genetic material in the Pfizer COVID-19 vaccine. However, research has shown that children exposed to PFAS had significantly reduced antibody concentrations after given tetanus and diphtheria vaccinations. (Why does this matter? Keep reading…)\n\nHow confident should we be in a vaccine? Take this news with a grain of salt\n\nIn a recent press conference, the German company BioNTech and the U.S. pharmaceutical giant Pfizer said that their jointly developed COVID-19 vaccine outperformed expectations in phase 3, proving 90% effective. BioNTech’s CEO even went so far as to say that the vaccine will “bash the virus over the head.”\n\nOn the surface … this may appear to be positive news. As COVID-19 numbers spike, grim milestones are met (over 250,000 dead in the U.S.) and new lockdowns and restrictions enforced around the world, many people are desperate to see – and believe in – “the light at the end of the tunnel.”\n\nBut the idea that forever chemicals might hinder the effectiveness of a COVID-19 vaccine casts a (huge) long shadow, and one can’t help but wonder if two “miracles of modern chemistry” will result in a terrible outcome.\n\nIn critic and essayist Elisa Gabbert’s book on disaster, The Unreality of Memory and other essays, she writes: “My research into past disasters – the plagues and the almost nuclear wars – was often oddly comforting. We’re still here, after all. But I can only take so much comfort in the past. This point in history does feel different, like we’re nearing an event horizon.”\n\nWhat if that event horizon isn’t COVID-19 but the inability to develop a fully effective pharmaceutical “solution” because of the PFAS chemicals we’ve polluted our bodies with? This is exactly the reason why we – at NaturalHealth365 – promote (so strongly) the importance of supporting a strong immune system.\n\nThe point is simple: a strong immune system is your best defense against bacterial and viral infections.\n\nFor more SHOCKING information about PFAS, listen to this highly-informative NaturalHealth365 podcast with Jonathan Landsman and environmental attorney, Robert Bilott.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Vaccine News Announcement | NaturalHealth365", "description": "(NaturalHealth365) The COVID-19 vaccine is being touted as the \"only way\" to be back to normal. But, here is some underreported news to see.", "url": "https://www.naturalhealth365.com/covid-19-vaccine-announcement-3636.html", "site_name": "NaturalHealth365", "article:published_time": "2020-11-24T06:11:59+00:00", "article:modified_time": "2020-11-23T13:03:31+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/11/covid-19-vaccine-bottles-scaled.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://www.naturalhealth365.com/", "https://www.theguardian.com/world/2020/nov/17/chemicals-found-in-everyday-products-could-hinder-covid-19-vaccine", "https://www.naturalhealth365.com/forever-chemicals-pfas-ewg-3507.html", "https://www.naturalhealth365.com/podcasts/toxic-water-robert-bilott-3469.html", "https://www.theguardian.com/world/2020/nov/17/chemicals-found-in-everyday-products-could-hinder-covid-19-vaccine"], "authors": ["Damon Hines, staff writer"], "publish_date": "2020-11-24T06:11:59+00:00"}