{"result_id": "210002", "URL": "https://www.naturalhealth365.com/video-covid-19-injections-3983.html", "timestamp": "2023-04-25 16:25:50 CEST+0200", "meta": {"description": "(NaturalHealth365) Jonathan Landsman interviews Dr. Stephanie Seneff to shine a light on the dangers of the COVID jab. Watch the video now.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/video-covid-19-injections-3983.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Video Exposes COVID Shot Dangers and Solutions", "cleaned_text": "(NaturalHealth365) It is painfully apparent to the entire world that we live in unprecedented times. Watching the so-called “new normal” unfold in front of our eyes often feels like a bad movie depicting a devastating dystopia. With the relentless push to inject millions with experimental gene therapy, one must wonder, when does the insanity end? Dr. Robert Malone, the inventor of the mRNA technology used in the Moderna and Pfizer COVID injections, says, “the government is not being transparent about the risks.”\n\nAdmittedly, transparency has not been the name of the game from the very moment the U.S. Food and Drug Administration (FDA) gave Emergency Use Authorization (EUA) to these unproven products. We have seen a coordinated effort from the government, BIG Pharma, BIG Tech, and BIG Media to silence anyone and anything that challenges the narrative. But the truth must come out. (And, it is!)\n\nMust see VIDEO: Mandating these unapproved jabs “should be criminal,” according to well-respected scientist\n\nIn one of the most important videos of the year, we bring you another fascinating interview with Stephanie Seneff, PhD – Senior Research Scientist at the MIT and author of Toxic Legacy – exposing the inconceivable harm the COVID-19 injections inflict on humanity. Don’t miss this interview where Jonathan Landsman of NaturalHealth365 asks the tough questions. Can you trust “the science?” Is there a “safest” shot? Find answers to these questions plus much more!\n\nVaxxed or unvaxxed, it is critical to take charge of your health\n\nAs Dr. Seneff points out, NOW is the best time to live a healthy lifestyle. Empower yourself with knowledge about health and nutrition. Whether you are jabbed or unjabbed, start by making small changes to create a healthier you. The solutions can be found here:\n• Be sure to eat organic foods as often as possible to reduce your exposure to the toxic effects of glyphosate, which is poisoning our food supply\n• Get out into the sunlight and get grounded by walking barefoot\n• Eliminate processed foods and load up on wholesome fruits and vegetables\n\nDid you watch the interview? Tell us what you think!", "opengraph": {"locale": "en_US", "type": "article", "title": "Video Exposes COVID Shot Dangers and Solutions | NaturalHealth365", "description": "(NaturalHealth365) Jonathan Landsman interviews Dr. Stephanie Seneff to shine a light on the dangers of the COVID jab. Watch the video now.", "url": "https://www.naturalhealth365.com/video-covid-19-injections-3983.html", "site_name": "NaturalHealth365", "article:published_time": "2021-09-24T05:11:00+00:00", "article:modified_time": "2021-09-23T11:14:17+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2021/09/iStock-1299711088.jpg", "image:width": "1253", "image:height": "837", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://stephanieseneff.net/", "https://www.naturalhealth365.com/ban-glyphosate-3708.html", "https://rumble.com/vmselv-covid-shot-dangers-solutions-exposed.html"], "authors": ["Edit Lang, staff writer"], "publish_date": "2021-09-24T05:11:00+00:00"}