{"result_id": "210035", "URL": "https://www.naturalhealth365.com/uk-government-side-effects-3640.html", "timestamp": "2023-04-25 16:27:00 CEST+0200", "meta": {"description": "(NaturalHealth365) Many people are very concerned about the partnership being formed by Bill Gates and the UK governement.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/uk-government-side-effects-3640.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "UK Government Partners with Bill Gates", "cleaned_text": "(NaturalHealth365) As many predicted when the coronavirus pandemic first began nearly one year ago, pharmaceutical companies including Moderna and Pfizer have wasted no time using the global crisis as an opportunity to manufacture a COVID-19 vaccine and tout it as a drug that will be required to get things back to normal (forget about simply “flattening the curve”). But, the race to create a vaccine is raising more and more concerns, especially within the UK and United States of America.\n\nFor example: Will the vaccine be mandatory? What is the prevalence and severity of vaccine side effects? And, can we really trust government “health” agencies – that seem more and more controlled by Bill Gates and other global interests – to provide truthful information?\n\nRecent meetings between major pharmaceutical reps, major vaccine proponent Bill Gates, and the United Kingdom’s Prime Minister suggest that answering these questions seems far less important than launching a massive plan to make widespread vaccinations easier to enforce – all in the name of future “pandemic preparedness,” of course.\n\nThe Prime Minister of United Kingdom cozying up to Bill Gates, Big Pharma and greenlighting mass military-induced COVID-19 vaccination strategy\n\nBoris Johnson, the UK Prime Minister who was hospitalized in April 2020 after reportedly falling ill with COVID-19, recently held a virtual meeting with tech-billionaire-turned-vaccine “expert” Bill Gates and 10 Big Pharma CEOs. According to the UK government, the meeting was designed to promote a “huge collaborative effort to boost innovation and manufacturing for coronavirus vaccines, treatments and diagnostics” following reports of positive results from recent COVID vaccine trials out of pharmaceutical company Pfizer.\n\nThe major pharma giant claims that early trials of their drug proved over 90 percent effective against COVID-19. Already, the UK goverment has signed up to receive 40 million doses of the rapidly produced (and still uncertain) vaccine.\n\nDuring the meeting, Johnson et al discussed a major globalized plan developed by the Bill and Melinda Gates Foundation to “prevent future pandemics.” Critics claim it’s a thinly-veiled attempt to promote mass vaccination programs.\n\nThe plan, praised by PM Johnson, calls for:\n• A network of “zoonotic disease research hubs” (zoonotic diseases are ones which can be transmitted from animals to humans)\n• Massive data-sharing networks and protocols to stand in as a “pandemic early warning system”\n• Increased resource allocation for the manufacturing of vaccines and treatments\n\nSuch measures would ultimately extend beyond the UK and guide what Johnson applauds as a “global endeavor” to improve access to vaccines and protect pharmaceutical companies’ supply chains for continued vaccine development.\n\nHere’s who will be getting the COVID-19 vaccine in the United Kingdom, according to “advisory committee”\n\nIn the meantime, the Prime Minister is reportedly preparing his military to help implement the mass vaccination of Brits once a drug becomes widely available. Vaccination “centers” will apparently be set up at shopping centers, sports arenas, and other community centers.\n\nJohnson and his administration plan to get as many Brits as possible vaccinated with the future drug, and starting in the following order, as recommended by an independent advisory committee known as the Joint Committee on Vaccination and Immunization:\n• Adults over 80 and all staff members of the United Kingdom National Health Service (NHS)\n• Adults over 75, then over 70, then over 65, and so on until age 50 (priority given to high-risk populations within any age group)\n\nSome UK parliament members have even proposed that Brits should be required to have papers or “certificates” proving they’ve received a vaccine in order to travel and move freely … and it’s exactly this type of backward-thinking, Big Brother precedent that is making many people, from Britain and elsewhere, fearful for their own bodily autonomy.", "opengraph": {"locale": "en_US", "type": "article", "title": "UK Government Partners with Bill Gates | NaturalHealth365", "description": "(NaturalHealth365) Many people are very concerned about the partnership being formed by Bill Gates and the UK governement.", "url": "https://www.naturalhealth365.com/uk-government-side-effects-3640.html", "site_name": "NaturalHealth365", "article:published_time": "2020-11-28T06:11:52+00:00", "article:modified_time": "2020-11-27T13:27:45+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/11/uk-policy-scaled.jpg", "image:width": "1024", "image:height": "596", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.rt.com/uk/506443-boris-gates-pharma-vaccines-military/", "https://www.naturalhealth365.com/anthony-fauci-covid-19-3375.html", "https://www.rt.com/uk/506443-boris-gates-pharma-vaccines-military/", "https://www.rt.com/uk/502054-coronavirus-vaccination-mandatory-travel/", "https://www.gov.uk/government/news/pm-hails-herculean-effort-of-life-science-companies-to-defeat-coronavirus"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-11-28T06:11:52+00:00"}