{"result_id": "210048", "URL": "https://www.naturalhealth365.com/covid-jab-adverse-event-3985.html", "timestamp": "2023-04-25 16:27:30 CEST+0200", "meta": {"description": "(NaturalHealth365) Hospitalist Physician's Assistant blows the whistle on hospital's disregard for COVID jab-related adverse events.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-jab-adverse-event-3985.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID Jab-Related Adverse Event Cover-Up", "cleaned_text": "(NaturalHealth365) According to the U.S. Centers for Disease Control and Prevention (CDC), healthcare providers are required to report certain adverse events (AEs) that occur after COVID-19 injections to the Vaccine Adverse Event Reporting System (VAERS). What adverse events, you might ask? Severe AEs, such as death, inpatient hospitalization, and persistent or significant incapacity, are examples of post-jab injuries that doctors must report.\n\nApparently, the term “required” has become synonymous with “optional” – at least for COVID injection-related adverse events – as the obligation to report such injuries accurately is systematically ignored. Meanwhile, health authorities relentlessly push these experimental and unproven gene therapies on the entire population, continuously repeating the unsubstantiated claim that these injections are “safe and effective.”\n\nBrave Physician’s Assistant speaks out: “These potentially injured patients deserve to be heard”\n\nIn an exclusive bombshell interview with Highwire, Deborah Conrad, a Hospitalist Physician’s Assistant, blows the lid off what is happening in U.S. hospitals behind closed doors. Recorded phone conversations and emails shine a light on the truth that’s been hidden from the American public – hospitals disregard their obligation to report COVID jab-related adverse events.\n\nMind-boggling reality: Healthcare providers receive no education about what to do when a patient has a problem\n\nMrs. Conrad points out that while healthcare providers get plenty of education about combating jab hesitancy and pushing the shots, they do not receive information about reporting adverse events to the VAERS database. Shockingly enough, they are not told what to do when these jab-injured patients show up in the Emergency Room.\n\nWhy are COVID jab-related side effects not getting reported to VAERS?\n\nWhat do you think? If these experimental, mandated injections are as “safe and effective” as the government claims they are, why are they hiding the adverse events? Are BIG Pharma, BIG Media, and the government conspiring to hide post-jab injuries to advance the jab agenda and reduce jab hesitancy?\n\nTell us what you think. We want to hear from you.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID Jab-Related Adverse Event Cover-Up | NaturalHealth365", "description": "(NaturalHealth365) Hospitalist Physician's Assistant blows the whistle on hospital's disregard for COVID jab-related adverse events.", "url": "https://www.naturalhealth365.com/covid-jab-adverse-event-3985.html", "site_name": "NaturalHealth365", "article:published_time": "2021-09-26T05:11:56+00:00", "article:modified_time": "2021-09-25T12:27:49+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2021/09/iStock-1281932201.jpg", "image:width": "1254", "image:height": "836", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.naturalhealth365.com/vaers-data-released-3912.html", "https://www.cdc.gov/vaccinesafety/hcproviders/reportingadverseevents.html", "https://rumble.com/vmncez-these-patients-deserve-to-be-heard-vaers-whistleblower.html"], "authors": ["Edit Lang, staff writer"], "publish_date": "2021-09-26T05:11:56+00:00"}