{"result_id": "210021", "URL": "https://www.naturalhealth365.com/covid-vaccine-patent-3555.html", "timestamp": "2023-04-25 16:26:30 CEST+0200", "meta": {"description": "(NaturalHealth365) The COVID vaccine patent - owned by Moderna - is under a serious investigation. This report reveals the details.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-vaccine-patent-3555.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Vaccine Patent Under Serious Investigation", "cleaned_text": "(NaturalHealth365) Remember Event 201? This was the “mock” coronavirus pandemic partially funded by the Bill and Melinda Gates Foundation in October 2019, just two months before the real coronavirus pandemic began in China. During the (incredibly eerie) mock exercise, experts predicted 65 million people would perish in this simulated pandemic.\n\nWell, it seems this wasn’t the only prediction made in relation to the coronavirus global outbreak. A recent investigative journalist is reporting on some shocking news from major vaccination manufacturer Moderna, a U.S. government-funded frontrunner in the race to create a COVID vaccine.\n\nWATCH: Startling investigation reveal top COVID vaccine manufacturer hinted at deliberate release of SARS coronavirus MONTHS before pandemic began\n\nIn a breaking 14-minute video from ISE Media, investigative journalist Ben Swann discusses some shocking predictions regarding SARS-CoV-2, the virus responsible for the global COVID-19 pandemic. The news comes from Moderna, a pharmaceutical and biotechnology company working closely with the National Institutes of Health (NIH) to create a COVID vaccine.\n\nWatch for yourself below:\n\nHere are a few of the main talking points to keep in mind:\n• In March 2019 (nine months before the SARS-CoV-2 outbreak), Moderna filed an amendment to their vaccine patent application so it would include coronavirus as a target of their vaccine; the amendment also cited concerns for a “deliberate release” of a SARS coronavirus in the near future as a reason to get approval for their patent\n• The company had been attempting to submit this same vaccine patent (only without mention of coronavirus) for many years prior to this and was continually rejected by the U.S. patent office – indeed, the U.S. Patent office sent a final rejection notice to Moderna in December 2019\n• But once the pandemic got underway, there was a complete reversal – Moderna was eventually issued a patent in May 2020 for technology related to the development of a COVID vaccine, after being fast-tracked by governmental and political support\n\nIt’s tremendously odd that Moderna amended a previously rejected vaccine application specifically to include the fact that one of the targets of their vaccine would be a coronavirus, just months before the coronavirus pandemic began – let alone their mention of a potential “deliberate release” of a SARS coronavirus in the same amendment.\n\nBut, that’s not even the only concerning issues.\n\nBiotech company fast-tracked by NIH and Fauci-run NIAID to get patent approval for COVID vaccine technology – even though this patent is already owned by another company\n\nWell before May 2020, Moderna began working on their COVID vaccine after getting bankrolled by the National Institute of Allergy and Infectious Diseases (NIAID), a division of the NIH and notoriously led by Dr. Anthony Fauci. This is despite the fact that Moderna failed to procure legal rights to the patented technology they were using.\n\nIndeed, the patent seems to be already owned by another company – meaning Moderna may not be allowed to release the vaccine they’ve been so furiously working on because of patent infringement.\n\nWhy rush to allow Moderna to procure this patent and develop this vaccine – especially without going though the proper legal and financial disclosure channels, as discussed in the video? Is Fauci and the NIAID really that brazenly determined to be the (handsomely-rewarded) winners in the race for a COVID vaccine?\n\nAnd why would top Moderna executives sell millions of dollars of their own stock in the company despite the fact that Moderna’s value continues to skyrocket?\n\nWe can’t predict what sort of fallout will happen as a result of this bizarre news. We simply hope to support these few media outlets who are still attempting to uncover the hidden stories (and truth!)", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Patent Under Serious Investigation | NaturalHealth365", "description": "(NaturalHealth365) The COVID vaccine patent - owned by Moderna - is under a serious investigation. This report reveals the details.", "url": "https://www.naturalhealth365.com/covid-vaccine-patent-3555.html", "site_name": "NaturalHealth365", "article:published_time": "2020-09-14T05:11:32+00:00", "article:modified_time": "2020-09-13T12:23:49+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/09/vaccine-patent-scaled.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.centerforhealthsecurity.org/event201/scenario.html", "http://ise.media/video/exclusive-covid-vaccine-patent-warned-of-deliberate-coronavirus-release-31.html", "https://ise.media", "https://www.naturalhealth365.com/anthony-fauci-coronavirus-3385.html", "https://www.centerforhealthsecurity.org/event201/scenario.html", "https://www.citizen.org/article/the-nih-vaccine/", "https://www.nih.gov/news-events/news-releases/nih-moderna-investigational-covid-19-vaccine-shows-promise-mouse-studies"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-09-14T05:11:32+00:00"}