{"result_id": "210037", "URL": "https://www.naturalhealth365.com/covid-19-artificial-intelligence-3634.html", "timestamp": "2023-04-25 16:27:05 CEST+0200", "meta": {"description": "(NaturalHealth365) The COVID-19 vaccination program is expected to produce a lot of \"adverse drug reactions.\" And, AI will track it all.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-19-artificial-intelligence-3634.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID-19 Adverse Drug Reactions Are Expected", "cleaned_text": "(NaturalHealth365) A startling document published online has revealed that an executive governmental agency in Britain is preparing to use artificial intelligence (AI) to monitor the fallout after a future massive COVID-19 vaccine rollout. No doubt, there are many people – living in the United States – that wonder if the U.S. is next?!\n\nThe document, called “Supplies – 506291-2020,” is a bid for a contract worth £1.5 million (nearly $2 million USD). UK officials are hoping the procurement of advanced software will help them keep track of everyone who becomes injured or killed due to the coronavirus vaccine … but we’re supposed to believe there’s nothing to worry about?\n\nOn the surface, we’re being told that early trials suggest these vaccines are safe and “95% effective.” Yet, at the same time (behind the scenes) these so-called experts are getting ready to track with AI the massive amount of injuries and deaths.\n\n“Direct threat to patient life and public health:” Chilling bid from British government agency prepares for the worst after a COVID-19 vaccine rollout by using … AI?\n\nSupplies – 506291-2020 was officially dispatched back in mid-October by the Medicines and Healthcare Products Regulatory Agency. MHRA is an executive agency in the UK and sponsored in part by the Department of Health and Social Care that “regulates medicines, medical devices and blood components for transfusion.”\n\nIn the contract, MHRA clearly states that they expect a “high volume” of adverse drug reactions (ADRs) in response to the upcoming COVID-19 vaccine. When you read the contract, you’ll notice that these UK government officials use the same worried language that millions of concerned consumers have been using regarding the widespread dissemination of this rapidly produced drug.\n\nThey cite “reasons of extreme urgency” for their desire to obtain a vaccine-specific AI tool, and that the software will be “strictly necessary” especially given the likelihood of “events unforeseeable.”\n\n“It is not possible,” MHRA says of their current system, “to handle the volume of ADRs that will be generated by a Covid-19 vaccine. Therefore, if the MHRA does not implement the AI tool, it will be unable to process these ADRs effectively. This will hinder its ability to rapidly identify any potential safety issues with the Covid-19 vaccine and represents a direct threat to patient life and public health.”\n\nIf the coronavirus vaccine is so “effective” … why are public health experts trying to convince us we’ll need two shots for it to work?\n\nIt’s taken under a year for officials to go from “let’s flatten the curve” to “let’s shut down the economy” to “we need a vaccine” to “we’ll still need to socially distance and wear masks even after the vaccine.” And the media is wasting no time in trying to placate the public and have us believe this rapidly produced drug is the world’s savior.\n\nIt’s “95% effective,” big pharma bigwig Moderna claims. Nevermind that there’s no proof that the vaccine will actually provide long-term immunity. Nevermind that, according to one official from the Yale Institute for Global Health, many people will likely require more than one dose.\n\nMultiple doses, multiple rounds of known and anticipated side effects: fatigue, fever, muscle pain, and flu-like symptoms that can last for days – and that doesn’t even include the potential for serious effects that have already occurred in trials, including a life-altering condition called transverse myelitis.\n\nLet’s not let mainstream media pull the wool over our eyes on this one. After all, there are plenty of other vaccines causing death and destruction to innocent victims to this very day.\n\nJust look at South Korea:\n\nAccording to the CDC, nearly 60 South Koreans have died as of October 2020 after receiving the annual flu shot in their country. Of course, the Korea Disease Control and Prevention Agency (KDCPA) claims there is no proven link between the flu vaccine and these deaths upon autopsy examination … meanwhile, the KDCPA has not suspended its flu vaccination program.\n\nYou likely won’t hear about these concerning correlations in the media. Stay tuned and stay vigilant for more COVID-19 vaccine news as it continues to play out. And, of course, do everything you can to keep your immune system healthy and strong – naturally.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Adverse Drug Reactions Are Expected | NaturalHealth365", "description": "(NaturalHealth365) The COVID-19 vaccination program is expected to produce a lot of \"adverse drug reactions.\" And, AI will track it all.", "url": "https://www.naturalhealth365.com/covid-19-artificial-intelligence-3634.html", "site_name": "NaturalHealth365", "article:published_time": "2020-11-23T06:11:56+00:00", "article:modified_time": "2020-11-22T15:03:10+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/11/covid-19-artificial-intelligence-scaled.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://ted.europa.eu/udl?uri=TED:NOTICE:506291-2020:TEXT:EN:HTML&src=0", "https://www.naturalhealth365.com/dna-damage-covid-vaccine-3505.html", "https://www.naturalhealth365.com/covid-19-vaccine-trial-failure-3573.html", "https://ted.europa.eu/udl?uri=TED:NOTICE:506291-2020:TEXT:EN:HTML&src=0", "https://www.scientificamerican.com/article/nih-very-concerned-about-serious-side-effect-in-coronavirus-vaccine-trial/", "https://khn.org/news/article/time-to-discuss-potentially-unpleasant-side-effects-of-covid-shots-scientists-say-yes/", "https://www.bbc.com/news/health-54902908", "https://www.ninds.nih.gov/Disorders/Patient-Caregiver-Education/Fact-Sheets/Transverse-Myelitis-Fact-Sheet", "https://www.cdc.gov/flu/spotlights/2020-2021/death-south-korea-following-flu-vaccination.htm"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-11-23T06:11:56+00:00"}