{"result_id": "210047", "URL": "https://www.naturalhealth365.com/covid-shots-suppress-immune-system-3536.html", "timestamp": "2023-04-25 16:27:27 CEST+0200", "meta": {"description": "(NaturalHealth365) A team of international researchers claims COVID shots suppress the immune system, may lead to an increase in cancer rates.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-shots-suppress-immune-system-3536.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID Shots Suppress Immune System", "cleaned_text": "(NaturalHealth365) Absent any long-term safety data about the Pfizer and Moderna COVID shots – let alone the conflicting short-term data about the safety and efficacy of these gene therapy-based drugs – people have been expected to “follow the science” when it comes to making personal health decisions during this pandemic … so long as the science “follows” the mainstream narrative.\n\nBut what happens when the “science” deviates? An example: an international team of researchers from institutions including the Massachusetts Institute of Technology (MIT) now claim that mRNA COVID shots suppress the immune system and increase the risk of a wide range of life-altering health problems.\n\nmRNA COVID shots suppress the immune system, poised to accelerate rates of chronic health issues: MIT researcher and colleagues\n\nIn a pre-print paper called “Innate Immune Suppression by SARS-CoV-2 mRNA Vaccinations: The role of G-quadruplexes, exosomes and microRNAs,” co-authors and scientists Dr. Peter McCullough (well-known Texan cardiologist), Dr. Stephanie Seneff (senior research scientist at MIT), Dr. Greg Nigh, ND, LAc (naturopathic doctor based in Portland, OR), and Dr. Anthony Kyriakopoulos (Greek medical and molecular microbiologist), present their hypothesis that the mRNA COVID jabs introduce “genetic modifications” that have a variety of ill effects on the human immune system.\n\nThese effects – which are reportedly quite different from the effects induced by natural infection with SARS-CoV-2 – include disturbances in type 1 interferon signaling. Type 1 interferons are small proteins that play important roles in the innate and adaptive immune responses to viruses and other pathogens. The authors state that if mRNA COVID jabs impair the function of these type 1 interferons, as their theory suggests, then “this could lead to increased susceptibility to COVID-19 in the two weeks following the first vaccine, before an antibody response has been initiated.”\n\nThey also point to several other studies showing worsening outcomes for people with COVID-19 who have impaired type 1 interferon signaling. This is highly relevant in the context of coercively injecting the masses, given that it is now well-established that these shots do NOT effectively stop viral transmission.\n\nIn other words, for the person who has an mRNA dose or two (or three) on board, their immune system could be less equipped to fight off the virus, at least for a window of time. And this might even be the least of the problems associated with these novel COVID drugs.\n\nResearchers offer plausible explanation of why COVID shots associated with alarming new cancer diagnoses\n\nThe authors state that the COVID mRNA jabs also induce immune cells to release “large quantities of exosomes containing spike protein along with critical microRNAs.” These exosomes, which are small, membrane-bound vesicles, are then taken up by cells and tissues throughout the entire body. The authors say this can impact several critical cellular functions, including protein synthesis and “cancer surveillance.”\n\nCancer, in particular, is an interesting adverse effect to discuss. We typically think of cancers as developing slowly over time. Can we expect to see an increased incidence of cancer post-jab already?\n\nYes, the researchers say, if these mRNA jabs “are leading to widespread dysregulation of oncogene controls, cell cycle regulation, and apoptosis,” as they hypothesize. And if their hypothesis is correct, “then [U.S. Food and Drug Administration’s Vaccine Adverse Event Reporting System (VAERS)] reports should reflect an increase in reports of cancer, relative to the other vaccines.”\n\nIt turns out this is precisely what VAERS shows. In Table 1 of their paper, the authors list the number of VAERS reports (generally made within the first weeks to a month after a shot is administered) of new cancer diagnoses associated with COVID shots versus all other shots. Incredibly, the VAERS data shows an overall 2:1 ratio of new cancer diagnoses post-COVID jab compared to all other shots administered in the past 31 years. Certain cancers, including ovarian cancer, hepatic cancer, and B-cell lymphoma, have ratios as high as 3.4:1, 5:1, and 6.3:1 (respectively).\n\nOverall, the authors offer a grim prediction based on their analysis: the immune and cellular disturbances induced by the COVID jabs are poised to have a direct causal link to health conditions including, but not limited to:\n\nThey conclude: “It is imperative that worldwide administration of the mRNA vaccinations be stopped immediately until further studies are conducted to determine the extent of the potential pathological consequences.”", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID Shots Suppress Immune System | NaturalHealth365", "description": "(NaturalHealth365) A team of international researchers claims COVID shots suppress the immune system, may lead to an increase in cancer rates.", "url": "https://www.naturalhealth365.com/covid-shots-suppress-immune-system-3536.html", "site_name": "NaturalHealth365", "article:published_time": "2022-02-04T06:11:47+00:00", "article:modified_time": "2022-02-03T10:44:13+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/02/iStock-1284804931.jpg", "image:width": "1254", "image:height": "836", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "http://www.researchgate.net/publication/357994624_Innate_Immune_Suppression_by_SARS-CoV-2_mRNA_Vaccinations_The_role_of_G-quadruplexes_exosomes_and_microRNAs", "https://www.naturalhealth365.com/review-article-reveals-mrna-covid-jab-consequences-3493.html", "https://www.naturalhealth365.com/breast-cancer-risk-3927.html", "https://www.researchgate.net/publication/357994624_Innate_Immune_Suppression_by_SARS-CoV-2_mRNA_Vaccinations_The_role_of_G-quadruplexes_exosomes_and_microRNAs", "https://www.authorea.com/users/455597/articles/552937-innate-immune-suppression-by-sars-cov-2-mrna-vaccinations-the-role-of-g-quadruplexes-exosomes-and-micrornas", "https://www.nature.com/articles/nri3787", "https://www.science.org/doi/10.1126/science.aau6977"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-02-04T06:11:47+00:00"}