{"result_id": "210046", "URL": "https://www.naturalhealth365.com/pfizer-data-reveals-smoking-gun-evidence-of-covid-jab-failure.html", "timestamp": "2023-04-25 16:27:25 CEST+0200", "meta": {"description": "(NaturalHealth365) Did Pfizer data reveal a 400% increased risk of death post-jab? If so, shouldn't the American people be informed about it?", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/pfizer-data-reveals-smoking-gun-evidence-of-covid-jab-failure.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Pfizer Data Reveals COVID Jab Failure", "cleaned_text": "(NaturalHealth365) When a COVID-19 breakthrough infection was still considered a rare phenomenon, government officials, mainstream media, Big Pharma, and MD influencers backing the mRNA jabs quickly and defiantly shut down anyone who said breakthrough cases were evidence of vax failure.\n\nOnce it became clear, however, that breakthrough infections were not only not rare but were even associated with serious illness, hospitalization, and death (the government’s and Pharma’s three favorite bogeymen in their campaign to mass-vaccinate the world), the official messaging seemed to pivot. Officials took advantage of these sick vaxxed individuals by using them as proof of the necessity of booster doses – it’s not that the jabs don’t work, they insisted, it’s just that we all need MORE of them. (Which all really starts to bleed into the transhumanist realm, doesn’t it? Suggesting that our bodies, as they are, aren’t good enough to function safely in this world – that we need lifelong dependency on pharmacology to survive and move freely in society; a disturbing message that astute observers realize is becoming increasingly normalized.)\n\nBut if breakthrough cases aren’t enough to suggest that these vaccines aren’t as “safe and effective” as we were told, it turns out that one may only need to look back at Pfizer’s original trial data.\n\nThe Vigilant Fox recently summarized an interview posted to Red Voice Media with Robert F. Kennedy, Jr., in which details about the Pfizer COVID shot trials were analyzed.\n\nReferencing the fact that 21 people in Pfizer’s vaccinated group died of all causes over a 6-month period (compared to 17 people in the placebo group, a 24% difference), RFK notes that about a quarter of the vax-deaths was due to cardiac arrest.\n\n“There were five cardiac arrest deaths in the vaccine group and only one in the placebo group,” RFK explained. “What that means is that if you take that vaccine, you’re [400%] more likely to die from a fatal cardiac arrest over the next six months than if you don’t. What it also means is that for every life they save by preventing a death from COVID, they are killing four people from cardiac arrest.”\n\nThe Pfizer clinical trials also reportedly showed that of the 44,000 total people in their study, one person in the experimental (vax) group died of COVID, and two people died of COVID in the control (placebo) group. While this technically allows Pfizer to say that their vax was “100% effective” at preventing COVID-19 (since 2 is 100% more than 1), this seems far less impressive when taken into context of the total number of trial participants.\n\nIn related news: CDC advisory committee officially recommends COVID jab for the childhood vaccine schedule\n\nHow’s this for another move we all saw coming?\n\nOn Thursday, October 20, 2022, an advisory committee to the U.S. Centers for Disease Control and Prevention (CDC) voted unanimously in favor of adding the COVID-19 injection to the recommended immunization schedule for kids (and adults).\n\nIt’s important to note that this recommendation – which the CDC is expected to sign off on – does not mean the COVID-19 shots are mandated for school entry … not necessarily, anyway. Determining which jabs are required for school attendance is still up to state and local jurisdictions. But it does set an important message and precedent for local stakeholders and pediatricians.\n\nAccording to NBC News, the CDC childhood vaccine schedule also influences insurance providers, as they tend to cover vaxxes included on the schedule. “That will be important next year,” NBC News writes in an October 20 article, “when federal funds to cover Covid vaccines are expected to run out, and the burden will shift to the private market.”\n\nIf you’re deciding when and whether to give your children any vax, check out your state’s exemption laws (you can visit the National Conference of State Legislatures website to start your search).", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer Data Reveals COVID Jab Failure | NaturalHealth365", "description": "(NaturalHealth365) Did Pfizer data reveal a 400% increased risk of death post-jab? If so, shouldn't the American people be informed about it?", "url": "https://www.naturalhealth365.com/pfizer-data-reveals-smoking-gun-evidence-of-covid-jab-failure.html", "site_name": "NaturalHealth365", "article:published_time": "2022-10-24T05:11:55+00:00", "article:modified_time": "2022-10-23T05:01:24+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/10/iStock-1287814413.jpeg", "image:width": "1254", "image:height": "836", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://vigilantfox.substack.com/p/smoking-gun-the-death-jab-failed?post_id=77700737", "https://www.naturalhealth365.com/athletes-suffer-cardiac-arrests-3479.html", "https://www.naturalhealth365.com/cdc-scrubs-false-claims-from-its-website-about-mrna-covid-shot-spike-proteins.html", "https://vigilantfox.substack.com/p/smoking-gun-the-death-jab-failed?post_id=77700737", "https://childrenshealthdefense.org/vaccinesafety/", "https://www.nbcnews.com/health/health-news/kids-covid-vaccine-cdc-group-says-add-vaccine-routine-immunization-sch-rcna53129", "https://www.ncsl.org/research/health/school-immunization-exemption-state-laws.aspx", "https://www.redvoicemedia.com/video/2022/10/censorship-fauci-the-truth-about-big-pharma-with-robert-f-kennedy-jr-brian-rose-video/ref/8/"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-10-24T05:11:55+00:00"}