{"result_id": "210030", "URL": "https://www.naturalhealth365.com/1-in-5000-covid-shots-result-in-serious-side-effects-german-health-officials-admit.html", "timestamp": "2023-04-25 16:26:48 CEST+0200", "meta": {"description": "(NaturalHealth365) German health officials admit in a tweet that 1 in 5,000 COVID shot causes serious side effects.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/1-in-5000-covid-shots-result-in-serious-side-effects-german-health-officials-admit.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Serious Side Effects Caused By COVID Shots", "cleaned_text": "(NaturalHealth365) Did German officials just admit in a tweet that COVID shots produce far more serious side effects than most public health officials would lead us to believe?\n\nYes – and not only that, they even highlighted a major concern with these mRNA jabs.\n\n1 out of every 5,000 COVID shots cause serious side effects, warn German public health officials\n\n“Severe reactions after vaccination are rare.” So says the U.S. Centers for Disease Control and Prevention (CDC) on a webpage called “Selected Adverse Events Reported after COVID-19 Vaccination.” The CDC goes on to produce an alarming list of serious COVID shot adverse events that have been documented so far, including anaphylaxis, thrombosis with thrombocytopenia syndrome (TTS), Guillain-Barré Syndrome (GBS), inflammatory heart conditions myocarditis and pericarditis, and death.\n\nWhile severe and life-threatening, the data presented by the CDC does suggest these adverse events are indeed rare – anaphylaxis, for instance, has been reported in 5 cases per one million vax doses administered. (Interestingly, the CDC also cites data from the Vaccine Safety Datalink showing that the rate of GBS within three weeks after getting the Johnson & Johnson shot – which does not contain mRNA technology – was 21 times higher than the rate of GBS within three weeks after getting an mRNA shot from either Pfizer or Moderna. 42 days post-J&J dose, the rate of GBS was still 11 times higher than that of Pfizer or Moderna.\n\nIt’s important to consider that adverse effect underreporting is highly likely, given the known historical rates of underreporting to the nation’s passive vax safety surveillance system. It should also be pointed out that these and other serious adverse events can lead to significant stress, financial hardship, and potentially long-term health consequences for jabbed individuals.\n\nAnd on July 20, 2022, the German Federal Ministry of Health posted a stunning tweet, admitting that 1 out of every 5,000 COVID jabs causes “serious” serious side effects.\n\n@PEI-Germany refers to the Paul Ehrlich Institute (PEI), Germany’s federal agency, medical regulatory body, and research institution for vaxxes and biomedicines.\n\nAs pointed out by writer and journalist Alex Berenson on his Substack, this 1 in 5,000 figure is “likely a sharp underestimate, given the fact that side effect reporting systems for drugs and vaccines are largely voluntary.”\n\nBut there’s another important fact about this stunning admission that even further increases the likelihood that the 1 in 5,000 figure is a “sharp underestimate.”\n\nGerman health data suggests that FAR more people are suffering serious health problems after COVID shots than previously acknowledged\n\nThe COVID shot safety data used by the German Federal Ministry of Health to make this announcement came from a PEI safety report on side effects and vax complications occurring between December 27, 2020, and March 31, 2022. This report actually found that the rate of serious adverse reactions was 0.2 per 1,000 doses … meaning that 1 in 5,000 DOSES of COVID shots results in serious side effects, not 1 in 5,000 COVID shot recipients.\n\nThink about this:\n\n5,000 administered doses of COVID shots could be given to as few as 1,250 to 1,600 people, assuming these individuals each receive three to four doses of the jab.\n\nReaders, what do you think:\n\nDo the potential benefits of COVID shot honestly outweigh the potential risks for most people – and if so, for how long?", "opengraph": {"locale": "en_US", "type": "article", "title": "Serious Side Effects Caused By COVID Shots | NaturalHealth365", "description": "(NaturalHealth365) German health officials admit in a tweet that 1 in 5,000 COVID shot causes serious side effects.", "url": "https://www.naturalhealth365.com/1-in-5000-covid-shots-result-in-serious-side-effects-german-health-officials-admit.html", "site_name": "NaturalHealth365", "article:published_time": "2022-08-31T05:11:31+00:00", "article:modified_time": "2022-08-30T20:07:17+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/08/iStock-1286635541.jpeg", "image:width": "1545", "image:height": "679", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://childrenshealthdefense.org/defender/germany-covid-vaccine-side-effects/", "https://www.naturalhealth365.com/irrefutable-evidence-mrna-covid-jab-causes-vascular-and-organ-damage.html", "https://www.naturalhealth365.com/cause-of-covid-jab-side-effects-revealed-3859.html", "https://childrenshealthdefense.org/defender/germany-covid-vaccine-side-effects/", "http://euroweeklynews.com/2022/07/20/severe-adverse-reaction-covid-vaccination-germany/", "https://alexberenson.substack.com/p/the-german-government-admits-hundreds", "https://www.bundesgesundheitsministerium.de/en/", "https://www.pei.de/SharedDocs/Downloads/DE/newsroom/dossiers/sicherheitsberichte/sicherheitsbericht-27-12-20-bis-31-03-22.pdf?__blob=publicationFile&v=5"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-08-31T05:11:31+00:00"}