{"result_id": "210041", "URL": "https://www.naturalhealth365.com/concerns-raised-mrna-technology-3881.html", "timestamp": "2023-04-25 16:27:15 CEST+0200", "meta": {"description": "(NaturalHealth365) Inventor of mRNA technology expresses serious concerns over safety of Pfizer and Moderna COVID jabs. Here's the facts.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/concerns-raised-mrna-technology-3881.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Concerns Raised Over Safety Of Multiple COVID Jabs", "cleaned_text": "(NaturalHealth365) On June 24, following a recent safety panel meeting of the U.S. Centers for Disease Control and Prevention (CDC), the U.S. Food and Drug Administration (FDA) admitted to a “likely association” between heart inflammation in young adults and adolescents following the Pfizer and Moderna COVID injection. Following this announcement, the FDA stated it would add a fact sheet warning about this adverse effect – but insisted that the benefits of getting the shot still outweigh the potential risks.\n\nConcerned medical freedom advocates are comparing the FDA’s decision to keep these investigational drugs on the market – despite over 1,200 documented cases of post-jab heart inflammation – to the FDA’s decision back in April 2021 to put a temporary pause on the J&J shot after (an initial) six cases of a rare blood clotting disorder were reported. Now, even the creator of mRNA technology is expressing serious concerns over the safety of these jabs for younger people.\n\nCENSORED: Interview with mRNA inventor over safety concerns for COVID injection deleted from YouTube\n\nRobert Malone, MD, is the inventor of mRNA injections and is credited as one of the world’s most foremost experts on the experimental technology currently being used by pharmaceutical companies Pfizer and Moderna. Recently, a video featuring Dr. Malone and his thoughts on these products was deleted from YouTube.\n\nThe doctor was later interviewed on June 23 by reporter Tucker Carlson of FOX News. In this interview, Dr. Malone had the chance to reiterate many of his concerns about the FDA’s and CDC’s continued insistence that these injections are worth the risk for young adults.\n\n“The government is not being transparent with us,” Dr. Malone says, citing a lack of “rigorously” tested data assessing the known risks of these injections as one of his main objections to young people getting the shots. “We don’t have the information we need to make a reasonable decision.”\n\nDr. Malone goes on to claim that the CDC has not performed appropriate risk-benefit analyses – suggesting that the government’s claim that the benefits outweigh the risks for this young cohort of Americans is simply not based on science.\n\nRegarding whether the shots are truly indicated in younger Americans, the mRNA expert puts it bluntly: “I can say that the risk-benefit ratio for those 18 and below doesn’t justify [injections], and there’s a pretty good chance that it doesn’t justify [injection] in these very young adults.”\n\nThe swift Big Tech censorship of Dr. Malone and people like him leads to the question: does the propagandized message to “follow the science” only apply to science that supports the pro-jab agenda?\n\nStudents take a stand: Young adults around the U.S. prepare to bring suit against universities mandating experimental injections\n\nAs of this writing, children as young as 12 can be given the unapproved Pfizer shot in the United States. In some states, including South Carolina, Oregon, Washington, and Tennessee, parental consent for this shot is either not required or can be waived by a doctor.\n\nIn his FOX News interview, Dr. Malone points out that “people have the right to decide whether to accept [injections] or not, especially since these are experimental [injections]. This is a fundamental right having to do with clinical research ethics.”\n\nIn this spirit, thousands of college-aged students from around the country are taking a stand against injection mandates from their academic institutions, including coeds at Indiana University.\n\nIt’s unfortunate, given that busy college students have other things they should be spending their energy on other than having to advocate for their medical freedoms.", "opengraph": {"locale": "en_US", "type": "article", "title": "Concerns Raised Over Safety Of Multiple COVID Jabs | NaturalHealth365", "description": "(NaturalHealth365) Inventor of mRNA technology expresses serious concerns over safety of Pfizer and Moderna COVID jabs. Here's the facts.", "url": "https://www.naturalhealth365.com/concerns-raised-mrna-technology-3881.html", "site_name": "NaturalHealth365", "article:published_time": "2021-06-26T05:11:26+00:00", "article:modified_time": "2021-06-25T10:58:03+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2021/06/iStock-1301531637.jpg", "image:width": "1365", "image:height": "768", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://childrenshealthdefense.org/defender/dr-robert-malone-tucker-carlson-mrna-vaccine-technology-risks/", "https://www.naturalhealth365.com/lawyers-sue-israeli-government-3822.html", "https://www.naturalhealth365.com/lawsuit-covid-shot-mandate-3870.html", "https://www.cnbc.com/2021/06/23/cdc-reports-more-than-1200-cases-of-rare-heart-inflammation-after-covid-vaccine-shots.html", "https://www.hopkinsmedicine.org/coronavirus/covid-19-vaccine/jj-vaccine-pause.html", "https://www.yalemedicine.org/news/coronavirus-vaccine-blood-clots", "https://www.reuters.com/business/healthcare-pharmaceuticals/us-panel-review-heart-inflammation-cases-after-pfizer-moderna-vaccines-2021-06-23/", "https://www.foxnews.com/media/tucker-carlson-mrna-vaccine-inventor", "https://www.fda.gov/news-events/press-announcements/fda-and-cdc-lift-recommended-pause-johnson-johnson-janssen-covid-19-vaccine-use-following-thorough", "https://www.kff.org/policy-watch/covid-19-vaccination-and-parental-consent/", "https://childrenshealthdefense.org/defender/dr-robert-malone-tucker-carlson-mrna-vaccine-technology-risks/"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2021-06-26T05:11:26+00:00"}