{"result_id": "210033", "URL": "https://www.naturalhealth365.com/prime-minister-australia-mandatory-policy-3537.html", "timestamp": "2023-04-25 16:26:56 CEST+0200", "meta": {"description": "(NaturalHealth365) The Prime Minister of Australia wants to see mandatory vaccines for COVID-19, as soon as it's available.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/prime-minister-australia-mandatory-policy-3537.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Prime Minister of Australia Wants Mandatory Vaccines", "cleaned_text": "(NaturalHealth365) In the latest Australia COVID news, disturbing reports prove that Prime Minister Scott Morrison is preparing to force a mandatory vaccine onto his citizens – a vaccine he is in the process of securing production rights for.\n\nNow, this part of the world is already under heavy scrutiny thanks to New Zealand’s recent announcement that they are starting to house COVID-19 positive people in so-called “quarantine camps” (hotels) for an undetermined length of time. And the blatant admission from the neighboring Australian government that they will be forcing vaccines onto their citizens has many people even more uneasy.\n\nAustralian Prime Minister securing nation’s right to manufacture coronavirus vaccines, wants them to be mandatory for Australians\n\nAccording to one of Australia’s major news channels, Down Under nation recently outlined a deal with pharmaceutical company AstraZeneca and Oxford University in England. The deal would allow Australia to produce a “promising” new COVID-19 vaccine if clinical trials of the drug prove successful.\n\nThe drug, labeled by some as the “Oxford vaccine”, allegedly mimics the novel coronavirus, SARS-CoV-2, and triggers a person’s immune system to fight against it.\n\nBut on the heels of this announcement, Australian Prime Minister Scott Morrison admitted on a Melbourne radio station that he “would expect [the COVID-19 vaccine] to be as mandatory as you could possibly make it.”\n\nHe added that children would have to receive the vaccination in order to go to school, that exemptions would apply “only” for certain medical reasons, and that the vaccine would be free for all citizens.\n\nAs of August 24, 2020, the nation has just over 500 listed deaths caused by COVID-19, as well as 24,812 laboratory-confirmed in cases. In comparison, at least 217,000 Australians were diagnosed with the seasonal flu in 2019, and 430 people died of it.\n\nAccording to the Australian government, 1,255 people died of the flu just two years earlier, in 2017. (But does anyone remember a media-fueled uproar and a call for forced flu vaccinations then?)\n\nAustralian government says 95 percent of the public will need to get COVID-19 vaccine to eradicate disease … whatever happened to “flattening the curve?”\n\nThe federal government has stated that effectively all Australian citizens (95 percent of them) would have to get the COVID-19 vaccine in order to for the drug to get rid of the pandemic coronvirus. An odd target immunization rate, since not too many months ago the primary goal of interventions were to simply flatten the curve rather than eradicate the disease completely.\n\nThis, of course, is all under the assumption that a COVID-19 vaccines would actually work – a potential issue even pharmaceutical representatives are not willing to hang their hat on yet.\n\nIn an official transcript released by the Australian government on August 19, AstraZeneca country president Liz Chatwin admits during a press conference that “there’s no guarantee that this vaccine will protect against COVID-19. We don’t even know whether how long that protection may last or at what dosage.”\n\nAs it stands now, Australia hasn’t finalized any mandatory vaccine law, nor is there any vaccine available. But many say the writing is on the wall is there.\n\nWill the general public be forced to get a COVID-19 vaccine year after year? Will they simply tack on a yearly mandatory flu vaccine while they’re at it? In a year of unprecedented uncertainty, it seems we’re only asking more and more questions.", "opengraph": {"locale": "en_US", "type": "article", "title": "Prime Minister of Australia Wants Mandatory Vaccines | NaturalHealth365", "description": "(NaturalHealth365) The Prime Minister of Australia wants to see mandatory vaccines for COVID-19, as soon as it's available.", "url": "https://www.naturalhealth365.com/prime-minister-australia-mandatory-policy-3537.html", "site_name": "NaturalHealth365", "article:published_time": "2020-08-31T05:11:15+00:00", "article:modified_time": "2020-09-30T15:18:16+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/08/prime-minister-australia-1-scaled.jpg", "image:width": "1024", "image:height": "680", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.abc.net.au/news/2020-08-19/morrison-coronavirus-covid-19-vaccine-mandatory/12572992", "https://www.naturalhealth365.com/new-zealand-quarantine-3528.html", "https://www.naturalhealth365.com/podcasts/immune-system-3047.html", "https://thehill.com/policy/international/512713-australian-prime-minister-coronavirus-vaccines-should-be-mandatory", "https://www.abs.gov.au/ausstats/abs@.nsf/Lookup/by%20Subject/3303.0~2017~Main%20Features~Deaths%20due%20to%20influenza~5", "https://www.abc.net.au/news/2019-08-18/influenza-spike-may-be-climate-related/11406980", "https://www.news.com.au/lifestyle/health/health-problems/coronavirus-vaccine-should-be-mandatory-pm/news-story/fc7dc9cd495bcc7332487c07731b4c98", "https://www.abc.net.au/news/2020-08-19/morrison-coronavirus-covid-19-vaccine-mandatory/12572992", "https://www.abc.net.au/news/2020-08-18/australia-locks-in-oxford-astrazeneca-coronavirus-vaccine-deal/12571454"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-08-31T05:11:15+00:00"}