{"result_id": "210040", "URL": "https://www.naturalhealth365.com/pfizer-vaccine-injury-lawsuits-3762.html", "timestamp": "2023-04-25 16:27:12 CEST+0200", "meta": {"description": "(NaturalHealth365) In anticipation of numerous vaccine injury lawsuits, COVID vaccine maker demands extreme collateral from countries.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/pfizer-vaccine-injury-lawsuits-3762.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Vaccine Injury Lawsuits Expected By Pfizer", "cleaned_text": "(NaturalHealth365) As of March 11, 2021, an estimated 10 percent of the United States population has been “fully vaccinated” for COVID-19, according to the U.S. Centers for Disease Control and Prevention (CDC). We say “fully vaccinated” because it’s not yet clear how effective a COVID vaccine is, nor is it clear if officials will decide that additional vaccine doses are necessary (the Pfizer CEO certainly seems to think so).\n\nSadly, the Vaccine Adverse Event Reporting System (VAERS) continues to be updated with serious or even fatal reactions following coronavirus vaccinations — some within a matter of minutes or hours following vaccination. And while we don’t have enough data to prove causation yet, it seems telling that Pfizer is working hard to cover its … assets … in the face of what they clearly expect will be numerous vaccine injury lawsuits in the near future.\n\nAn ominous flex from Pfizer? COVID vaccine maker demands extreme guarantees from countries ahead of vaccine injury lawsuits — while Pfizer CEO openly admits he wants people to get COVID vaccine “every year”\n\nIn a February 25, 2021 interview with NBC News, Pfizer CEO Albert Bourla (who owns an estimated $5.68 million in Pfizer stock) made a jaw-dropping statement as he was conditioning the audience to the idea of an up-and-coming third dose for the Pfizer COVID vaccine.\n\n“Every year, you need to go to get your flu vaccine,” Bourla said. “It’s going to be the same with COVID. In a year, you will have to go and get your annual shot for COVID to be protected.”\n\nIt’s far too early to be making such claims, many argue, especially given what Pfizer is reportedly doing now to protect itself against future litigation.\n\nThe notorious pharmaceutical company has allegedly been pressuring countries to put up collateral — in the form of military bases, embassy buildings, bank reserves, and sovereign assets — in order to contend with anticipated COVID lawsuits. At least two countries, Argentina and Brazil, have rejected these demands, which many legal experts say reflect a blatant abuse of power from the Big Pharma giant.\n\nIt’s hardly surprising Pfizer is working so hard to protect its bottom line, given the absolutely unprecedented nature of the current situation. The Pfizer COVID vaccine — which contains brand-new mRNA technology — was developed and authorized for emergency use (NOT approved, as some social media “fact-checkers” claim) in eight months. Prior to this, the quickest vaccine ever developed was for mumps — which took four years.\n\nIf you’re an American and injured by a COVID vaccine, you won’t be able to sue Pfizer for damages (or any other pharmaceutical company, for that matter) until at least 2024 — and maybe not even then.\n\nHere’s the context surrounding vaccines that you need to know (and why 1986 is an important year)\n\nIn March 2020, when U.S. Department of Health and Human Services (HHS) Secretary Alex Azar invoked the Public Readiness and Emergency Preparedness Act (PREP Act), legal protection was automatically granted to all companies distributing investigational vaccines and other unapproved treatments for COVID-19. Due to the PREP Act, people also cannot sue the FDA for authorizing emergency use of these drugs, nor hold employers accountable if they mandate a COVID jab. This protection lasts until 2024.\n\nOf course, Americans aren’t able to sue pharmaceutical companies for damages caused by approved vaccines, either. That’s been the case since 1986 when President Ronald Reagan signed into law the National Childhood Vaccine Injury Act (NCVIA). This law grants immunity to pharmaceutical companies. In other words, you can’t sue Pfizer or other companies for an injury you or a loved one sustain due to one of their vaccines, “unless the company engaged in wrongful or criminal misconduct involving the vaccine,” according to the FDA.\n\nWhat recourse do you have? One option is to submit a claim with the National Vaccine Injury Compensation Program (VICP). It should be noted that the VICP is overseen by the Health Resources and Services Administration, which is a branch of the HHS — a potential conflict of interest, to say the least.\n\nSince 1988, $4.5 billion in compensation have been paid out among 7,874 petitions (out of a total 23,902 petitions filed).\n\nPharmaceutical companies don’t enjoy the same legal protections in certain other countries that they have here in the United States. So, as the vaccine rollout continues and millions of more people line up for the jab, it will be interesting to see how countries will handle the cases of their injured citizens.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Injury Lawsuits Expected By Pfizer | NaturalHealth365", "description": "(NaturalHealth365) In anticipation of numerous vaccine injury lawsuits, COVID vaccine maker demands extreme collateral from countries.", "url": "https://www.naturalhealth365.com/pfizer-vaccine-injury-lawsuits-3762.html", "site_name": "NaturalHealth365", "article:published_time": "2021-03-15T05:11:15+00:00", "article:modified_time": "2021-03-14T09:50:07+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2021/03/iStock-1292158980.jpg", "image:width": "1233", "image:height": "851", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.globalhealthnow.org/2021-02/latin-america-calls-out-pfizers-high-level-bullying", "https://www.naturalhealth365.com/uk-government-side-effects-3640.html", "https://www.naturalhealth365.com/vaccine-injury-2788.html", "https://www.naturalhealth365.com/fda-news-measles-2891.html", "https://www.cnbc.com/2020/12/16/covid-vaccine-side-effects-compensation-lawsuit.html", "https://apnews.com/article/fdcc1171f2e916f6f616bb05802fa5cf", "https://www.globalhealthnow.org/2021-02/latin-america-calls-out-pfizers-high-level-bullying", "https://www.hrsa.gov/sites/default/files/hrsa/vaccine-compensation/data/data-statistics-report.pdf", "https://www.bloomberg.com/graphics/covid-vaccine-tracker-global-distribution/", "https://www.usnews.com/news/health-news/articles/2021-03-11/cdc-10-of-total-us-population-fully-vaccinated-for-coronavirus", "https://www.nbcnews.com/health/health-news/third-pfizer-dose-covid-19-vaccine-maker-studying-booster-shots-n1258775", "https://wallmine.com/people/40271/albert-bourla"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2021-03-15T05:11:15+00:00"}