{"result_id": "210045", "URL": "https://www.naturalhealth365.com/covid-shots-have-caused-far-more-deaths-than-all-other-vaxxes-in-21-years-combined.html", "timestamp": "2023-04-25 16:27:23 CEST+0200", "meta": {"description": "(NaturalHealth365) Official UK government data reveals COVID shots have caused far more deaths than all other vaxxes in 21 years combined.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-shots-have-caused-far-more-deaths-than-all-other-vaxxes-in-21-years-combined.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID Shots More Deadly Than Other Vaxxes", "cleaned_text": "(NaturalHealth365) In just under two years, the mRNA COVID shots have had a shocking impact on the globe. Thousands upon thousands have suffered from vax side effects ranging from heart inflammation to autoimmune issues (according to the U.S. passive surveillance vax safety system VAERS). Meanwhile, we’ve all had to witness informed consent being tossed out the window as individuals have been coerced into taking this hastily-developed, gene-based concoction under threat of job loss and societal ostracization.\n\nOf course, it’s bad enough that these shots don’t even stop transmission of the virus that causes COVID-19, SARS-CoV-2 – a jaw-dropping outcome that mainstream media and Pharma officials have tried to avoid by simply moving the goalposts and claiming that the shots were actually only meant to prevent severe illness and death. But some of the latest COVID shot data from our neighbors in the UK paint a different picture even from that claim.\n\nOfficial data from United Kingdom point to grim reality about COVID shots\n\nThe data shared subsequently comes from the United Kingdom’s official medicine regulator, known as the UK Medicines and Healthcare Products Regulatory Agency, or MHRA. The government agency “regulates medicines, medical devices and blood components for transfusion in the UK,” according to their website. (Chief among their responsibilities is “ensuring that medicines, medical devices and blood components for transfusion meet applicable standards of safety, quality, and efficacy.”)\n\nIn response to a Freedom of Information (FOI) request submitted on August 6, 2021, via email by a gentleman simply referenced as Mr. Anderson, the MHRA recently revealed some alarming COVID shot data to the public. In particular:\n\nOver the past 19 months, COVID-19 shots have been linked to 5.5 times as many deaths as all other vaxxes available in the UK in the past 21 years.\n\n“The MHRA has received a total of 404 UK spontaneous suspected [adverse reaction reports] for any vaccine between 01/01/2001 – 25/08/2021 associated with a fatal outcome,” the agency says in their response, dated September 6 of last year. The agency adds, “Please note this number excludes reports received for the COVID-19 vaccines.”\n\nJust over 400 adverse vaccine reactions associated with a fatal outcome from ALL OTHER shots combined in the previous two decades. Yet, in less than two years, the MHRA has documented the following statistics in their so-called Yellow Card reporting:\n• 808 reported deaths associated with the Pfizer shot\n• 62 reported deaths associated with the Moderna shot\n• 1,294 reported deaths associated with the AstraZeneca shot\n\nWe should note that none of these shots were available prior to December 2020 at the latest. If all these reported deaths are indeed caused by adverse reactions to the COVID shots, then this suggests the COVID jabs are 7,402% more deadly than all other vaccines currently available in the UK.\n\nThe MRHA is compelled to point out in their FOI response that “a reported reaction does not necessarily mean it has been caused by the vaccine, only that the reporter had a suspicion it may have.” A completely valid point. Yet we can only hope that regulators are beginning to pay attention to this alarming data glaring at them right in the face.\n\nMHRA insists vax is “single most effective” method for keeping people safe from COVID-19 … critics ask, at what cost?\n\nThe FOI request poses several questions to the MHRA. The agency’s responses are interesting.\n\nFor example, in response to the question: “What cut off point will the MHRA say a vaccine or drug is unsafe for humans?” the MRHA reassures the reader that “We also work closely with our public health partners in reviewing the effectiveness and impact of the vaccines to ensure the benefits continue to outweigh any possible side effects … All vaccines and medicines have some side effects. These side effects need to be continuously balanced against the expected benefits in preventing illness.”\n\nThey add, “It is important to note that vaccination is the single most effective way to reduce deaths and severe illness from COVID-19.”\n\nThe “single most effective way.” A bold statement that doesn’t seem to take into consideration all the other critical lifestyle factors that are proven to be protective against disease and even shown to reduce the risk of severe illness and death from COVID-19, as noted by Harvard Medical School and others. Healthy diet, daily exercise, smoking cessation, adequate sleep, weight management, etc. – public health officials have failed horribly in encouraging these essential and lifesaving strategies to the public.\n\nJust think about it: we are approaching three years into this COVID debacle. Imagine if our leaders promoted and incentivized healthy lifestyle choices at least as much as they’ve promoted and incentivized the COVID-19 shots.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID Shots More Deadly Than Other Vaxxes | NaturalHealth365", "description": "(NaturalHealth365) Official UK government data reveals COVID shots have caused far more deaths than all other vaxxes in 21 years combined.", "url": "https://www.naturalhealth365.com/covid-shots-have-caused-far-more-deaths-than-all-other-vaxxes-in-21-years-combined.html", "site_name": "NaturalHealth365", "article:published_time": "2022-09-10T05:11:14+00:00", "article:modified_time": "2022-09-10T04:07:51+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/09/iStock-1339494443.jpeg", "image:width": "1253", "image:height": "836", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://expose-news.com/2022/08/05/covid-vaccines-7402-percent-deadlier-than-all-other-vaccines/", "https://www.naturalhealth365.com/babies-and-toddlers-next-pfizer-moderna-receive-eua-for-covid-shot-for-kids-6-month-to-5-years.html", "https://www.naturalhealth365.com/sars-cov-2-gene-sequence-linked-to-moderna-patent-3568.html", "https://expose-news.com/2022/08/05/covid-vaccines-7402-percent-deadlier-than-all-other-vaccines/", "https://expose-news.com/wp-content/uploads/2021/09/FOI-21-907-Response-1.pdf", "https://www.gov.uk/government/organisations/medicines-and-healthcare-products-regulatory-agency/about", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1096452/Vaccine_Analysis_Print_Pfizer_BioNTech_COVID-19_vaccine_27.07.2022.pdf", "https://www.health.harvard.edu/blog/does-exercise-help-protect-against-severe-covid-19-202106092475", "https://www.health.harvard.edu/staying-healthy/harvard-study-healthy-diet-associated-with-lower-covid-19-risk-and-severity"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-09-10T05:11:14+00:00"}