{"result_id": "210006", "URL": "https://www.naturalhealth365.com/heart-inflammation-covid-shot-3853.html", "timestamp": "2023-04-25 16:25:58 CEST+0200", "meta": {"description": "(NaturalHealth365) Teens and adolescents are targeted with the experimental COVID shots. Reports of heart inflammation raise great concerns.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/heart-inflammation-covid-shot-3853.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Heart Inflammation Reports Raise Concerns About Jab", "cleaned_text": "(NaturalHealth365) In recent headlines, COVID shot producer Moderna claims that its experimental drug is “100% effective” in preventing COVID in teens aged 12 to 17.\n\nNow, as parents around the country worry that the shot will be mandated for kids, adolescents, and teens before returning to school in the fall, concerning reports of heart inflammation post-jab are now calling the safety and effectiveness of these drugs into serious question.\n\nDespite media claims of no significant safety concerns, COVID shot currently being investigated for link to heart inflammation among teens, young adults\n\nIn a May 17 statement posted to the CDC’s website, the organization states that they are currently investigating “several presentations” of the inflammatory heart condition known as myocarditis among teens, adolescents, and young adults who recently received the experimental mRNA jab.\n\nThe CDC states that these cases appear to occur mostly in male adolescents and young adults, usually within 4 days after affected individuals receive their second dose of the mRNA shot. While “most” of these presentations are reportedly mild, it is important to note that myocarditis can lead to life-threatening complications in some cases.\n\nMultiple cases of myocarditis phenomenon have been reported to the U.S. Department of Defense, the Vaccine Adverse Event Reporting System (VAERS), and the Vaccine Safety Datalink. Sadly, the potential link between these drugs and myocarditis might not even be unheard of. According to the Children’s Health Defense, a recently leaked report from the Israeli Health Ministry documented 62 cases of myocarditis following the second dose of the Pfizer shot, most of which occurred among men between ages 18 and 30. Two of these cases resulted in death.\n\nThe CDC and public health officials continue to recommend that all Americans over the age of 12 get the COVID shot.\n\nRare but possible: Here are the warning signs of myocarditis to be aware of\n\nMyocarditis means inflammation of the heart muscles. While mild cases or early cases may reveal no warning signs or symptoms, more severe forms of myocarditis can lead to a range of problems. Severe cases may also lead to serious health problems, including heart attack, stroke, abnormal heartbeat, and death.\n\nAccording to Mayo Clinic, you or someone you know may be experiencing myocarditis if you experience:\n• Rapid or abnormal heartbeats (might feel fast, pounding, skipping, or fluttery)\n• Swelling of the legs, ankles, and feet\n\nIn children, myocarditis may also present with breathing difficulties, rapid breathing, fainting, and fever. Call 911 and seek medical attention right away if any of these symptoms suddenly develop.\n\nAs for what can cause this potentially deadly condition (other than the possible connection to the COVID injection), known risk factors for myocarditis include other medications, parasites, bacteria, viruses, radiation, chemical exposure, certain illegal drugs (like cocaine), and in some cases other underlying diseases, especially autoimmune disorders.\n\nMany questions remain unanswered at this point. Are discussions about the ongoing investigations about these experimental drugs happening in walk-in clinics, doctor’s offices, and pharmacies? Are parents considering having their children injected with these experimental drugs aware that officials are still learning (a euphemism for “don’t know”) a lot about these medications? How many more young adults and teens may suffer adverse effects?", "opengraph": {"locale": "en_US", "type": "article", "title": "Heart Inflammation Reports Raise Concerns About Jab | NaturalHealth365", "description": "(NaturalHealth365) Teens and adolescents are targeted with the experimental COVID shots. Reports of heart inflammation raise great concerns.", "url": "https://www.naturalhealth365.com/heart-inflammation-covid-shot-3853.html", "site_name": "NaturalHealth365", "article:published_time": "2021-06-01T05:11:37+00:00", "article:modified_time": "2021-05-31T10:49:27+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2021/06/iStock-182269969.jpg", "image:width": "1271", "image:height": "825", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "http://childrenshealthdefense.org/defender/cdc-investigating-reports-heart-problems-teens-adolescents-covid-vaccine/", "https://www.naturalhealth365.com/low-vitamin-d-cardiovascular-health-3800.html", "https://www.naturalhealth365.com/pfizer-covid-injection-side-effects-3813.html", "https://childrenshealthdefense.org/defender/cdc-investigating-reports-heart-problems-teens-adolescents-covid-vaccine/", "https://www.cnbc.com/2021/05/25/covid-vaccine-moderna-says-shot-is-100percent-effective-in-teens-plans-to-seek-fda-ok-in-june.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/myocarditis.html", "https://www.mayoclinic.org/diseases-conditions/myocarditis/symptoms-causes/syc-20352539", "https://www.cdc.gov/vaccines/acip/work-groups-vast/technical-report-2021-05-17.html"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2021-06-01T05:11:37+00:00"}