{"result_id": "210029", "URL": "https://www.naturalhealth365.com/dozens-of-young-canadian-doctors-die-suddenly-prompting-call-for-an-end-to-covid-vax-mandate.html", "timestamp": "2023-04-25 16:26:46 CEST+0200", "meta": {"description": "(NaturalHealth365) Physician demands end to vax mandate and investigation into the sudden deaths of dozens of Canadian doctors.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/dozens-of-young-canadian-doctors-die-suddenly-prompting-call-for-an-end-to-covid-vax-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Dozens Of Canadian Doctors Die Suddenly", "cleaned_text": "(NaturalHealth365) Sad news out of Canada: there’s been dozens of deaths among practicing doctors in the North American country. In fact, an alarming 80 young doctors have died since the rollout of this so-called “vaccine.”\n\nThe deaths includes five Toronto-area physicians since just this summer. Among them: 27-year-old pediatrics resident Dr. Candace Nayman, 50-year-old emergency physician Dr. Paul Hannam, 49-year-old otolaryngologist Dr. Lorne Segall, 68-year-old neurologist Dr. Stephen McKenzie, and Dr. Jakub Sawicki (believed to be in his mid-30s at the time of his death).\n\nThe hospitals and healthcare systems associated with these and dozens of other young Canadian physicians insist that these deaths had nothing to do with the COVID shots and boosters these doctors were forced to take. And perhaps this is true in at least some cases (the obituaries for Dr. Sawicki, Dr. Segall, and Dr. McKenzie, for example, all state the clinicians passed away due to cancer … more on this in a moment). But another Canadian doctor is urging public health officials to take another look.\n\nIn public letter, physician urges Canadian Medical Association to end “illegal and unscientific” vax mandates for healthcare workers\n\nDr. William Makis is a Nuclear Medicine Physician trained in oncology and radiology whose career associations include McGill University and the University of Alberta.\n\nAccording to Exposé News, Dr. Makis’s medical license was revoked prior to COVID-19 for what he claims was “blowing the whistle regarding the corruption in cancer research.” (Upon further investigation, we found that Dr. Makis was accused of “unprofessional conduct” by the College of Physicians and Surgeons of Alberta for an alleged verbal confrontation between him and an unnamed colleague on April 21, 2017, in which he accused this colleague of lying about him. Reading through the hearing tribunal documents does sound oddly like a “he said, she said” attempt to silence or get rid of anyone who challenges the status quo. We digress but do share this context for the sake of transparency.)\n\nDespite his colorful professional history, Dr. Makis has remained an astute observer of the state of healthcare in Canada, and he recently wrote a letter to the current and former Presidents of the Canadian Medical Association (CMA), Dr. Alika and Dr. Katharine Smart.\n\nThe letter discusses the sudden deaths of “32 young Canadian doctors since rollout of COVID-19 vaccines.”\n\nDr. Makis notes that beginning in December 2020, “CMA has aggressively and unethically promoted the use of experimental COVID-19 Vaccines in populations where risks of serious vaccine injury far outweighed any potential benefits (including children of all ages, teens, pregnant women, healthy adults < age 70).\n\n“CMA also supported illegal and unscientific COVID-19 Vaccine mandates that were forced upon Canada’s 92,000 doctors by corrupt health bureaucrats,” a move Dr. Makis claims was in violation of CMA’s own Code of Ethics. Mincing no words, he accuses Dr. Lafontaine and Dr. Smart of betraying “not only your physician members but the Canadian public that CMA serves.”\n\nDr. Makis goes on to share “photos and information of 32 young Canadian doctors who died suddenly and unexpectedly in the past 16 months, all of whom were double, triple or quadruple COVID-19 vaccinated.”\n\nHe considers each of these cases “highly suspicious for COVID-19 Vaccine Injury” due to the nature of the unexpected deaths, which include:\n• Death due to “sudden onset aggressive cancers” (this was the case for Dr. Sawicki and Dr. Segall, for example—both received their cancer diagnosis no more than a year before passing away)\n\nThat so many young, practicing, and otherwise healthy Canadian doctors are passing away unexpectedly is questionable and tragic. But like others, Dr. Makis also believes it is unethical to overlook these sudden deaths and write them off as “unrelated” to COVID shots, especially since the CMA is forcing healthcare workers to take dose after dose of these drugs during this same time period.\n\nIndeed, Dr. Makis believes that this makes CMA “legally liable” for these deaths, should a causal link be proven, even if Pfizer and Moderna aren’t.\n\n“You cannot stay silent while illegally mandated COVID-19 Vaccines may be killing dozens of young Canadian doctors and putting thousands of doctors at high risk of severe injury and death,” Dr. Makis urges Dr. Smart and Dr. Lafontaine.\n\n“I am urging you to remember your ethics, and Oath and use your platform as Presidents of CMA to publicly call for the immediate termination of all COVID-19 Vaccine mandates in Canada’s healthcare, and call for urgent Investigations and Public Inquiries into what is killing fully COVID-19 vaccinated young Canadian doctors.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Dozens Of Canadian Doctors Die Suddenly | NaturalHealth365", "description": "(NaturalHealth365) Physician demands end to vax mandate and investigation into the sudden deaths of dozens of Canadian doctors.", "url": "https://www.naturalhealth365.com/dozens-of-young-canadian-doctors-die-suddenly-prompting-call-for-an-end-to-covid-vax-mandate.html", "site_name": "NaturalHealth365", "article:published_time": "2022-10-19T05:11:52+00:00", "article:modified_time": "2022-10-18T23:00:59+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/10/iStock-813062006.jpeg", "image:width": "1254", "image:height": "836", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://expose-news.com/2022/09/19/32-canadian-doctors-died-after-vaccination/", "https://www.naturalhealth365.com/triple-vaxxed-take-longer-to-recover-from-covid-infection-than-unjabbed-study-suggests.html", "https://www.naturalhealth365.com/dark-secrets-of-restful-sleep-study-shows-light-exposure-during-sleep-harms-heart-health.html", "https://expose-news.com/2022/09/19/32-canadian-doctors-died-after-vaccination/", "https://www.theglobeandmail.com/canada/article-emergency-physician-showed-strong-leadership-through-pandemic/", "https://www.westernstandard.news/news/doctor-calls-for-canadian-medical-association-to-investigate-physician-deaths/article_66114364-2ba3-11ed-936b-87e70ab60742.html", "https://www.medpagetoday.com/special-reports/features/100098", "https://www.cbc.ca/news/canada/hamilton/candace-nayman-1.6536551", "http://mountpleasantgroup.permavita.com/site/LorneSegall.html", "https://www.legacy.com/ca/obituaries/theglobeandmail/name/stephen-mckenzie-obituary?pid=202518070", "https://search.cpsa.ca/Complaints?fn=023044-000019262482-OT"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-10-19T05:11:52+00:00"}