{"result_id": "210042", "URL": "https://www.naturalhealth365.com/majority-of-covid-deaths-occur-in-fully-vaxxed-3578.html", "timestamp": "2023-04-25 16:27:17 CEST+0200", "meta": {"description": "(NaturalHealth365) According to newly released government data from the U.K., majority of COVID deaths have occurred in the fully vaxxed.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/majority-of-covid-deaths-occur-in-fully-vaxxed-3578.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Majority Of COVID Deaths Occur In Fully Vaxxed", "cleaned_text": "(NaturalHealth365) The mainstream media claim that the COVID shot rollout and mandate were “never about” stopping transmission of SARS-CoV-2 (and only about reducing pressure on hospital systems and preventing deaths) is nothing more than a highly propagandized attempt to gaslight the American public. In reality, government and pharmaceutical leaders were adamant early in the pandemic that pushing these new mRNA jabs onto as many people as possible was the “only” way out. Even President Biden once claimed that a person wouldn’t get COVID if they were jabbed.\n\nAt this point, however, it is painfully clear that this is no longer true. In fact, breakthrough cases are surprisingly common (just imagine if any other “vaccine” in history had such a poor track record). And in the UK, grim data about who is dying with COVID-19 paints an entirely different perspective on the so-called safety and effectiveness of these novel drugs.\n\nNo wonder the media isn’t telling you about this shocking UK COVID deaths data\n\nA recent UK Health Security Agency report reveals that fully vaxxed individuals in the United Kingdom account for 9 out of 10 COVID-19 deaths between January 24 and February 20, 2022. Of these, 4 out of 5 are among triple jabbed folks (i.e., those with two doses and a “booster,” to use the somewhat euphemistic term, since a booster dose is simply an additional dose of the original shot … necessary not because the shots don’t work, officials claim, but only because the shots stop working after about five months … as if that isn’t a red flag).\n\nFully vaxxed individuals are also the overwhelming majority of people hospitalized with a COVID-19 positive diagnosis and simply being diagnosed with COVID-19 during this reporting period. Meanwhile, the number of individuals in England dying with COVID-19 and did not receive any vax is on a clear downward trend.\n\nAs reported by the Daily Expose, UK data reveals that:\n• Deaths among vax-free individuals went from 889 between November 22 and December 19, 2021, to 559 between January 24 and February 20, 2022 .. nearly a 40% decline in overall COVID deaths (or at least, deaths that occurred in people who tested positive for COVID, as we know that false positives are possible)\n• But deaths among the UK’s vaxxed population went from 2,913 between November 22 and December 19, 2021, to 4,302 between January 24 and February 20 22..nearly a 50% INCREASED rate of overall COVID deaths\n\nDoes this sound like a drug you would be willing to take a risk on?\n\nThe drug efficacy drops precipitously after just a few months. There are no long-term safety data. According to The Lancet, the absolute risk reduction of the Pfizer shot is less than one percent (which sounds a lot less impressive than the relative risk reduction that is usually discussed in headlines and sound bites). Reported side effects include heart inflammation, Bell’s palsy, and thrombocytopenia (to name but a few).\n\nAnd in a way, all of this is a moot point. Even if these drugs were 100% safe and effective, many ethicists and other critics would argue that forcing people to take drugs is wrong.\n\nEveryone deserves to make informed medical decisions for themselves and their children. That people have been systematically coerced into taking these drugs will go down as one of the greatest crimes coming out of the novel coronavirus pandemic.", "opengraph": {"locale": "en_US", "type": "article", "title": "Majority Of COVID Deaths Occur In Fully Vaxxed | NaturalHealth365", "description": "(NaturalHealth365) According to newly released government data from the U.K., majority of COVID deaths have occurred in the fully vaxxed.", "url": "https://www.naturalhealth365.com/majority-of-covid-deaths-occur-in-fully-vaxxed-3578.html", "site_name": "NaturalHealth365", "article:published_time": "2022-03-13T06:11:57+00:00", "article:modified_time": "2022-03-12T11:58:49+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/03/iStock-1321699103.jpeg", "image:width": "1254", "image:height": "836", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1057599/Vaccine_surveillance_report_-_week-8.pdf", "https://www.naturalhealth365.com/florida-covid-testing-3490.html", "https://www.naturalhealth365.com/lancet-letter-questions-covid-jab-efficacy-3497.html", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1057599/Vaccine_surveillance_report_-_week-8.pdf", "https://dailyexpose.uk/2022/03/01/russia-distraction-uk-gov-revealed-triple-vaccinated-account-9-in-10-covid-deaths/", "https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/booster-shots-and-third-doses-for-covid19-vaccines-what-you-need-to-know", "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(21)00069-0/fulltext"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-03-13T06:11:57+00:00"}