{"result_id": "210018", "URL": "https://www.naturalhealth365.com/dna-damage-covid-vaccine-3505.html", "timestamp": "2023-04-25 16:26:25 CEST+0200", "meta": {"description": "(NaturalHealth365) The potential COVID vaccine is on a \"fast track\" for approval. Find out how this potentially could pose a serious health risk.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/dna-damage-covid-vaccine-3505.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID Vaccine and Your DNA Examined", "cleaned_text": "(NaturalHealth365) Most of us have seen television drug commercials, complete with a super-sped-up voiceover at the end listing all the possible side effects (which sometimes even include “death”). Have you ever wondered what that drug went through to land 30 seconds of million dollar air time? According to the U.S. Food and Drug Administration (FDA), it’s gone through a lot of research, testing, and gatekeeping … but the potential new COVID vaccine may not have the same rigorous testing done.\n\nThe FDA’s “fast track” approval for COVID vaccine research has been done under the guise of a public health crisis (and supported by legislation like the PREP Act). But the push for a rapidly developed drug has raised many concerns over vaccine safety, including the possibility of vaccine-induced DNA damage, according to some doctors.\n\nInternal medicine doctor warns of potential dangers linked to the COVID vaccine\n\nIn a video recently posted online, Dr. Carrie Madej, an internal medicine specialist, recently shared her professional insights and concerns over the yet-to-be-created COVID vaccine. Scroll down to see the full video, and keep reading to see a few of her main talking points:\n• Human DNA is not fixed: Our genes can be reprogrammed and turned “on” or “off” in order to effect changes in the body – all of which ultimately increases or decreases a person’s state of health, depending on what kind of reprogramming happens.\n• Many things can “reprogram” our genes – including stress, toxins and diet. Something else that can reprogram your genes are laboratory created genetically modified cell lines used in vaccine development.\n• This brings up an ethical dilemma, according to Dr. Madej. After all, if someone can manufacture and give you drug that can literally change your DNA, at one point are you not yourself anymore? Moreover, since genetically modified material can be patented, this raises serious questions over the “patentability” of a human whose DNA has been altered by a patented drug. Can they themselves be considered a “genetically modified organism” that can be patented and owned?\n• This isn’t science fiction: It’s a modern day technology called recombinant DNA, and it’s being proposed for the creation of COVID-19 vaccines. It’s never been used on humans before, however it’s backed by vaccine proponents including GlaxoSmithKline and the Bill and Melinda Gates Foundation.\n• Remember: COVID-19 vaccine research is being fast tracked right now, which calls into question vaccine safety. Plus, public health officials are proposing that the eventual drug gets injected into every man, woman, and child around the world.\n\nAnd that’s just from the first half of the video! Check out the video below for more information:\n\nStay informed, stay curious, and stand up for your family\n\nAs. Dr. Madej mentions in her video, we all have the choice to make our voices heard, share information, and be open-minded yet skeptical, in a healthy way.\n\nRight now, it’s easy to feel confused by the competing voices on COVID-19 vaccines in the media. Many people are reluctant to share their doubts over vaccine safety and legality over fear of being mislabeled or judged.\n\nBut, your health and your family’s health is always what matters most, and taking a stand for that is something you should never feel ashamed about.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID Vaccine and Your DNA Examined | NaturalHealth365", "description": "(NaturalHealth365) The potential COVID vaccine is on a \"fast track\" for approval. Find out how this potentially could pose a serious health risk.", "url": "https://www.naturalhealth365.com/dna-damage-covid-vaccine-3505.html", "site_name": "NaturalHealth365", "article:published_time": "2020-08-05T05:11:28+00:00", "article:modified_time": "2020-09-10T21:56:35+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/09/green-drink-wlogo-scaled.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.fda.gov/drugs/development-approval-process-drugs", "https://www.naturalhealth365.com/crimes-against-humanity-bill-gates-3422.html", "https://www.fda.gov/drugs/development-approval-process-drugs", "https://www.federalregister.gov/documents/2020/03/17/2020-05484/declaration-under-the-public-readiness-and-emergency-preparedness-act-for-medical-countermeasures"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-08-05T05:11:28+00:00"}