{"result_id": "210026", "URL": "https://www.naturalhealth365.com/clinical-trials-covid-vaccine-3559.html", "timestamp": "2023-04-25 16:26:40 CEST+0200", "meta": {"description": "(NaturalHealth365) Most people would be shocked to discover that there are clinical trials designed to see how to manipulate people.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/clinical-trials-covid-vaccine-3559.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Clinical Trials About How to Manipulate People", "cleaned_text": "(NaturalHealth365) There’s a growing seed of doubt over the COVID vaccine, and officials seem eager to snuff it out. One way to do this? They’ve decided to fund clinical trials to figure out how to market the “right message” that will get people to agree to vaccination.\n\nThis is exactly what we’re seeing out of recent research from institutions including Yale University. Brazen researchers are looking for ways to “sell” the idea of a rapidly produced coronavirus vaccine – and they’re pulling on all sorts of psychological strings to get people to acquiesce to the yet-to-be-born pharmaceutical golden child.\n\nTwisted clinical trials: Scientists-turned-marketers are now spending money on finding the best way to manipulate the general public\n\nWe can think of a lot better ways to spend research dollars than this: testing “different messages about vaccinating against COVID-19.”\n\nYet this is exactly what researchers out of Yale University are doing. They’ve randomized 4,000 people into one of 12 groups, with all but two control groups receiving one of 10 carefully crafted messages about the COVID vaccine.\n\nThe goals of the messaging is to convince people to actually get the vaccine once it becomes available.\n\nThese messages range from ones based on personal freedom (“a message about how COVID-19 is limiting people’s personal freedom and by working together to get enough people vaccinated society can preserve its personal freedom”) to guilt (a message that “asks the participant to imagine the guilt they will feel if they don’t get vaccinated and spread the disease”).\n\nThe researchers are even investigating the effects of a message that shames people and calls them out for being cowardly (a “message which describes how firefighters, doctors, and front line medical workers are brave. Those who choose not to get vaccinated against COVID-19 are not brave”).\n\nOf course, the idea that advertisers and marketing experts try to manipulate and persuade the public is nothing new. But it’s concerning to hear that these same psychological tactics are being used when it comes to influencing a person’s decisions about their medical autonomy and bodily freedom.\n\nIn the future, the Yale researchers plan to “compare the reported willingness to get a COVID-19 vaccine at 3 and 6 months of it becoming available” between the 10 experimental groups and 2 control groups.\n\nIn related breaking news: Major pharmaceutical company AstraZeneca suspends leading COVID vaccine trials due to undisclosed illness in one of its participants\n\nIt’s worth noting that not single one of the studied messages from the above study plans to talk about the potential dangers of the COVID vaccine itself once it becomes available, which you’d think is something the public ought to know.\n\nThese potential dangers, by the way, are already coming to light. It was just reported that major pharmaceutical company AstraZeneca voluntarily suspended its leading worldwide COVID vaccine trials due to an “unexplained illness in a study participant,” according to Yahoo! Finance.\n\nThe vaccine being investigated (called AZD1222) is already in late-stage clinical trials in United States, Britain, Brazil and South Africa. It’s not yet confirmed that the participant got sick by the vaccine, but according to Yahoo! Finance, unofficial reports indicate a person who got the experimental vaccine now has transverse myelitis, “an inflammatory syndrome that affects the spinal cord and is often sparked by viral infections.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Clinical Trials About How to Manipulate People | NaturalHealth365", "description": "(NaturalHealth365) Most people would be shocked to discover that there are clinical trials designed to see how to manipulate people.", "url": "https://www.naturalhealth365.com/clinical-trials-covid-vaccine-3559.html", "site_name": "NaturalHealth365", "article:published_time": "2020-09-18T05:11:58+00:00", "article:modified_time": "2020-09-17T11:26:33+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/09/vaccine-clinical-trials-scaled.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://clinicaltrials.gov/ct2/show/study/NCT04460703", "https://www.naturalhealth365.com/covid-trial-on-hold-3556.html", "https://clinicaltrials.gov/ct2/show/study/NCT04460703", "https://childrenshealthdefense.org/news/the-persuasion-game-manipulating-intention-to-get-a-covid-19-vaccine/", "https://finance.yahoo.com/news/astrazeneca-puts-covid-19-vaccine-215143688.html"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-09-18T05:11:58+00:00"}