{"result_id": "210017", "URL": "https://www.naturalhealth365.com/florida-surgeon-general-follows-real-science-warns-against-covid-jab-for-young-people.html", "timestamp": "2023-04-25 16:26:23 CEST+0200", "meta": {"description": "(NaturalHealth365) Florida became the first state in the country to recommend against giving COVID-19 shots to kids ages 5 and older.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/florida-surgeon-general-follows-real-science-warns-against-covid-jab-for-young-people.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Florida SG Warns Against COVID Jabs For Kids", "cleaned_text": "(NaturalHealth365) Frequently the butt of jokes, Florida has stood out during the pandemic as a state that has overwhelmingly respected its citizens’ medical freedom while simultaneously handling its response to the COVID-19 pandemic laudably.\n\nMost recently, the Florida State Surgeon General Dr. Joseph A. Ladapo recommends “against males aged 18 to 39 from receiving mRNA COVID-19 vaccines.” Why? Because “the Florida Department of Health (Department) conducted an analysis through a self-controlled case series, which is a technique originally developed to evaluate vaccine safety. This analysis found that there is an 84% increase in the relative incidence of cardiac-related death among males 18-39 years old within 28 days following mRNA vaccination.”\n\nThis is what an honest (sincere) public health official should be doing … protecting public health.\n\nKeep in mind, this is the same State Surgeon General who helped the state of Florida reached the lowest case rate for COVID-19 in the entire nation – all in a state without mask mandates and egregious lockdowns. And supporters say that leadership like that of the Florida Surgeon General has contributed to these promising public health trends.\n\nThe Florida Surgeon General has an important question to ask doctors\n\nDr. Joseph Ladapo, MD, Ph.D., has had quite a year.\n\nOn September 21, 2021, Lapado, a Nigerian-born American physician and researcher, was appointed as Surgeon General of Florida by Florida Governor Ron DeSantis. At the same time, Dr. Lapado was appointed to the position of associate professor at the University of Florida Health. And from the very beginning of his tenure, Surgeon General Lapado made waves in the headlines.\n\nIn March 2022, for example, Surgeon General Lapado announced that Florida would become the first state in the country that would recommend AGAINST giving COVID-19 shots to kids age 5 and older, parting ways with the U.S. Centers for Disease Control and Prevention (CDC) on the matter.\n\nCiting the lack of sufficient clinical trial data on these shots for kids – and noting that healthy children are among the least likely to experience serious effects from COVID-19, thus would potentially assume greater risks than benefits from getting vaxxed – the Surgeon General had actually petitioned the CDC three months earlier to halt the approval mRNA jab’s approval.\n\nBy the time Surgeon General Lapado announced these recommendations in March, he had already made a name for himself as a conscientious critic of quarantines, face masks, and mask mandates. Earlier this month, the Surgeon General spoke out again about the COVID vax controversy.\n\nIn a September 2 Twitter post, Dr. Lapado wrote: “New study published in #Vaccine shows concerning rate of serious adverse events after mRNA vaccination, but estimates are limited b/c @pfizer & @moderna_tx won’t release patient-level trial data.”\n\nAnd, now as of Oct. 7, 2022, Dr. Lapado is warning 18 – 39 year old males about the COVID injections due to a significant risk of death.\n\nDr. Lapado is asking a very simple question: “Why are doctors blindly following Big Pharma?”\n\nIt’s a legitimate question, especially considering the growing collection of evidence that calls into question the true safety of these gene-based jabs.\n\nCheck out Florida’s official state guidance regarding COVID-19 – how does it compare to your state?\n\nStarting in February of this year, Governor DeSantis and Surgeon General Lapado released a list of updated COVID-19 recommendations for the Sunshine State, many of which were or are at stark odds with the guidelines, restrictions, and mandates found in other states across the nation.\n\n“People want to live freely in Florida, without corporate masking creating a two-tier society and without overbearing isolation for children,” said Governor Ron DeSantis after announcing the updated guidelines for his constituents. “We are empowering health care practitioners to follow science, not Fauci’s status quo.”\n\nPledging to push back on “unscientific” guidelines and urging Florida physicians to “exercise their individual clinical judgment and expertise based on their patients’ needs and preferences,” Governor DeSantis and Surgeon General Lapado announced several public health updates, including:\n• Ensure doctors have a “right to try treatments” and advise health care providers and facilities to reevaluate status quo protocols in favor of science-based treatments that may benefit patients\n• Keep kids in school and reduce isolation by limiting isolation periods for Floridians to 5 days\n\nAnd, as you likely know, the CDC has since relaxed its guidelines, with unvaxxed individuals now having the same guidance as vaxxed individuals. Ultimately, we should all support the concept of informed consent and medical freedom when it comes to how we treat ourselves and our family.", "opengraph": {"locale": "en_US", "type": "article", "title": "Florida SG Warns Against COVID Jabs For Kids | NaturalHealth365", "description": "(NaturalHealth365) Florida became the first state in the country to recommend against giving COVID-19 shots to kids ages 5 and older.", "url": "https://www.naturalhealth365.com/florida-surgeon-general-follows-real-science-warns-against-covid-jab-for-young-people.html", "site_name": "NaturalHealth365", "article:published_time": "2022-10-07T05:11:40+00:00", "article:modified_time": "2022-10-08T12:47:30+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/10/iStock-1145790402.jpeg", "image:width": "1254", "image:height": "836", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://content.govdelivery.com/accounts/FLDOH/bulletins/3312697", "https://www.naturalhealth365.com/fda-gives-green-light-to-pfizer-covid-booster-for-kids-5-to-11-disregards-questionable-efficacy-data.html", "https://www.naturalhealth365.com/commercial-airline-pilots-sue-cdc-over-federal-mask-mandate-calling-it-illegal-and-unconstitutional.html", "https://content.govdelivery.com/accounts/FLDOH/bulletins/3312697", "https://flvoicenews.com/surgeon-general-joseph-ladapo-slams-doctors-for-blindly-following-big-pharma-after-concerning-rate-of-serious-adverse-events-vax-study/", "https://www.sciencedirect.com/science/article/pii/S0264410X22010283", "https://www.flgov.com/wp-content/uploads/2022/02/Buck-the-CDC-Handout.pdf", "https://floridahealthcovid19.gov", "https://www.flgov.com/2021/10/27/florida-reaches-lowest-case-rate-in-the-nation/", "https://www.politico.com/news/2022/03/07/florida-surgeon-general-covid-vaccines-00014702"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-10-07T05:11:40+00:00"}