{"result_id": "210050", "URL": "https://www.naturalhealth365.com/youtube-censorship-who-3597.html", "timestamp": "2023-04-25 16:27:35 CEST+0200", "meta": {"description": "(NaturalHealth365) YouTube has censored over 200,000 videos expressing concerns about the COVID vaccine. What's going on here?", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/youtube-censorship-who-3597.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "YouTube Censors Videos About COVID", "cleaned_text": "(NaturalHealth365) As much of the world waits with bated breath for the development of a coronavirus vaccine – which mainstream media will have us believe is a requirement for any possible “return to normal” in society – video-sharing mega-platform YouTube is taking no chances on spreading alleged misinformation about the controversial drug-in-development.\n\nFor example, Reuters recently announced that YouTube will be banning any videos that contradict consensus about COVID-19 from officials including the World Health Organization (WHO). In case you forgot, this is the same organization which admitted in June that asymptomatic transmission of SARS-CoV-2 “appears to be rare” … before quickly backpedaling (after a firestorm of controversy) and saying it’s simply “unknown” instead.\n\nIt makes you wonder: How can you ban content that goes against the WHO when even the WHO shares inconsistent information?!\n\nYouTube banning content about COVID-19 and vaccines: Nearly a quarter million videos removed from platform since February\n\nIn an October 14 article, Reuters reported that YouTube is removing content “that disputes the existence or transmission of COVID-19, promotes medically unsubstantiated methods of treatment, discourages people from seeking medical care or explicitly disputes health authorities’ guidance on self-isolation or social distancing.”\n\nA spokesman for the video-sharing platform states conspiracy theories regarding the COVID-19 vaccine and other related topics have been proliferating, and that YouTube is wasting no time censoring videos that don’t align with the WHO and other health officials when it comes to the pandemic. Since February, at least 200,000 videos have been removed from the website. The private company also holds private meetings with the WHO – on a weekly basis – to discuss trends and “potentially problematic videos.”\n\nOf course, YouTube has the legal right to censor content on their website – the platform is not recognized as a “public forum” that must guarantee the First Amendment right to free speech, at least according to U.S. courts including the San Francisco’s Ninth Circuit in a February 2019 ruling against conservative non-profit organization PragerU.\n\nBut the COVID-19 censorship leaves many wondering…\n\nWhat is the criteria used to identify “potentially problematic” videos? Surely, there are some videos that contain misinformation. But is it fair to label any video that doesn’t support the status quo as “conspiracy theory?”\n\nIs it fair to assume people are not able to be exposed to a range of ideas and come to their own conclusions? And what about videos and content that share legitimate criticisms over the hasty development of a vaccine? Aren’t people allowed to dissent?\n\nWe’re told that content involving “broad concerns” about the vaccine will not be censored. We’ll just have to see if that actually happens.\n\nMeanwhile … are Dr. Fauci and other health “experts” grooming the public to line up for a COVID-19 vaccine – even if it’s not effective?\n\nAs discussions about the COVID-19 vaccine continue offline and online, questionable admissions are being made by some of the world’s leading officials.\n\nIn a recent Senate committee meeting, Dr. Anthony Fauci waxes poetic about the benefit of a “reasonably effective” vaccine that would work only 75 to 80 pecent of the time. Apparently that’s still good enough to inject into American people.\n\nYet the director of the National Institute of Allergy and Infectious Diseases also stated that a vaccine alone won’t be enough to help us return to normalcy, suggesting that social restrictions are still necessary.\n\nIt’s a bit conflicting, especially when we consider that even the WHO itself recently endorsed a call to end worldwide lockdowns. Stay tuned to NaturalHealth365, as we continue to monitor this developing story.", "opengraph": {"locale": "en_US", "type": "article", "title": "YouTube Censors Videos About COVID | NaturalHealth365", "description": "(NaturalHealth365) YouTube has censored over 200,000 videos expressing concerns about the COVID vaccine. What's going on here?", "url": "https://www.naturalhealth365.com/youtube-censorship-who-3597.html", "site_name": "NaturalHealth365", "article:published_time": "2020-10-21T05:11:03+00:00", "article:modified_time": "2020-10-20T12:17:43+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/10/youtube-scaled.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.reuters.com/article/health-coronavirus-youtube/youtube-bans-coronavirus-vaccine-misinformation-idUSKBN26Z1ZW", "https://www.naturalhealth365.com/who-outbreak-admission-3450.html", "https://www.naturalhealth365.com/anthony-fauci-coronavirus-3385.html", "https://www.naturalhealth365.com/who-covid-lockdowns-3592.html", "https://www.bbc.com/news/technology-51658341", "https://www.reuters.com/article/health-coronavirus-youtube/youtube-bans-coronavirus-vaccine-misinformation-idUSKBN26Z1ZW", "https://www.healthline.com/health-news/fauci-and-other-experts-debate-when-our-covid-19-lives-will-return-to-normal#2"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-10-21T05:11:03+00:00"}