{"result_id": "210039", "URL": "https://www.naturalhealth365.com/covid-19-vaccine-trial-failure-3573.html", "timestamp": "2023-04-25 16:27:10 CEST+0200", "meta": {"description": "(NaturalHealth365) AstraZeneca COVID-19 vaccine trial reports about another victim of neurological problems after receiving the vaccine.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-19-vaccine-trial-failure-3573.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID-19 Vaccine Trial Failure Again", "cleaned_text": "(NaturalHealth365) As COVID-19 vaccine trials continue speeding along, a major pharmaceutical company leading the way is facing heat yet again for subjecting volunteers to these fast-tracked vaccines.\n\nInternal papers from AstraZeneca reveal another victim who has developed a rare and serious condition affecting the nervous system after getting treated with the investigational drug. Of course, AstraZeneca representatives say it’s, “unlikely to be associated with the vaccine.”\n\nBut, this news certainly has many people wondering: how long will these trials continue to be allowed to go on?\n\nDangerous trend: SECOND person suffers a serious health condition during COVID-19 vaccine trial, reports say\n\nIs there an echo in here? Earlier this month, we reported that AstraZeneca paused its UK COVID-19 vaccine trial because a volunteer experienced serious neurological symptoms consistent with a rare inflammatory disease called transverse myelitis. Officials admitted the victim had been injected with the investigational vaccine and not a placebo.\n\nLater, an AstraZeneca spokeswoman said the female participant also happened to have undiagnosed multiple sclerosis, which she claimed had nothing to do with the drug. The phase 3 vaccine trial subsequently resumed.\n\nNow, reports reveal a SECOND female participant has come down with transverse myelitis. She developed symptoms after getting a follow-up dose of the vaccine.\n\nTwo cases of a rare and serious neurological condition occurring in the same drug trial – and yet we’re supposed to believe what AstraZeneca says, that the illnesses were ‘unlikely to be related’ to the vaccine.\n\nMeanwhile, at the CDC: “current best estimate” suggests that death rate of COVID-19 is LESS than the flu!\n\nTell us again why we have to furiously develop a new vaccine and vaccinate the majority of the population before we can get back to “normal” – despite the fact that Dr. Anthony Fauci and the U.S. Centers for Disease Control and Prevention (CDC) keep hinting that the novel coronavirus isn’t as deadly as the media firestorm wants people to think it is?\n\nUpdated on September 10, the CDC presents on their website five of their “COVID-19 Pandemic Planning Scenarios.” The CDC claims these aren’t predictions but rather simply to “advance public health preparedness and planning.” Yet they label the fifth of their scenarios as their “Current Best Estimate” for how COVID-19 is impacting the country.\n\nHere’s what the CDC says is the current BEST estimate about the infection fatality rate (IFR) of COVID-19:\n\nInfection fatality rate refers to the total number of deaths divided by all the people who have the given infection, whether they have symptoms or not. This is in contrast to case fatality rate, which is the total number of deaths divided by the people who have clinical symptoms of the disease.\n\nThose aren’t typos, by the way:\n\nThe CDC’s current best estimate is that the IFR for COVID-19 is 0.005 to 0.054 for some of the most “at risk” age groups. This is a lot lower than the IFR for the seasonal flu!\n\nJust read a section from a paper published in March of this year in the New England Journal of Medicine, co-authored by Dr. Anthony Fauci himself:\n\n“If one assumes that the number of asymptomatic or minimally symptomatic cases [of COVID-19] is several times as high as the number of reported cases, the case fatality rate may be considerably less than 1%. This suggests that the overall clinical consequences of Covid-19 may ultimately be more akin to those of a severe seasonal influenza (which has a case fatality rate of approximately 0.1%) or a pandemic influenza (similar to those in 1957 and 1968) rather than a disease similar to SARS or MERS, which have had case fatality rates of 9 to 10% and 36%, respectively.”\n\nAs other sources have pointed out, Dr. Fauci and colleagues misspoke here: they should have used the terminology “infection fatality rate” rather than case fatality rate. Regardless, the implications are shocking.\n\nAnd sure, lots has changed since March 2020, but even so, the U.S. government’s “current best estimate” is still directly in line with Fauci’s hypothesis … yet here we are: many places still on lockdown and our country being told that only a hastily developed vaccine (for a virus which may be less deadly than the seasonal flu) can save us.\n\nThe question remains: do our current circumstances justify the kind of response being put forth by so-called “health experts?” Or, is there another agenda being played out on the general public?", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Vaccine Trial Failure Again | NaturalHealth365", "description": "(NaturalHealth365) AstraZeneca COVID-19 vaccine trial reports about another victim of neurological problems after receiving the vaccine.", "url": "https://www.naturalhealth365.com/covid-19-vaccine-trial-failure-3573.html", "site_name": "NaturalHealth365", "article:published_time": "2020-09-30T05:11:20+00:00", "article:modified_time": "2020-09-29T11:35:35+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/09/covid-19-failure-scaled.jpg", "image:width": "1024", "image:height": "576", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.rt.com/news/501221-astrazeneca-vaccine-neurological-condition/", "https://www.naturalhealth365.com/covid-trial-on-hold-3556.html", "https://www.rt.com/news/501221-astrazeneca-vaccine-neurological-condition/", "https://www.nejm.org/doi/full/10.1056/nejme2002387", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/planning-scenarios.html#five-scenarios", "https://www.nytimes.com/2020/09/19/health/astrazeneca-vaccine-safety-blueprints.html"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-09-30T05:11:20+00:00"}