{"result_id": "210019", "URL": "https://www.naturalhealth365.com/brazil-covid-vaccine-3557.html", "timestamp": "2023-04-25 16:26:28 CEST+0200", "meta": {"description": "(NaturalHealth365) The President of Brazil has been attacked for his position on mandatory vaccinations. Is all this controversy justified?", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/brazil-covid-vaccine-3557.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Brazil President Attacked for Saying No to Vaccines", "cleaned_text": "(NaturalHealth365) Between the Virginia health commissioner hinting that a COVID-19 vaccine will be mandatory for residents and Massachusetts forcing all students to get a flu shot before the end of 2020, concerned Americans have plenty of reasons to worry about their medical autonomy. But as the president of Brazil recently learned, when you question the public health narrative that a COVID vaccine should be compulsory, you’ll face immediate ridicule.\n\nCriticism aside, the Brazilian president’s words of caution echo the voice of many global citizens who share his doubts, especially given the highly unusual situation that is the coronavirus pandemic. After all, pharmaceutical companies are being greenlighted to produce and test vaccines at lightning-fast pace – leaving many to wonder what sort of vaccine dangers are looming.\n\nPresident of Brazil Bolsonaro: “No one can force anyone to get a vaccine”\n\nIt’s a dangerous precedent to set when anyone who raises concern over vaccine safety is simply written off as irresponsible, conspiratorial, or alarmist. We ask you – how else should pharmaceutical companies be held accountable, but for fair criticism and public discourse?\n\nIt’s equally concerning when people are shamed for questioning the ethical implications of forced vaccination. Yet this is exactly the type of backlash Brazilian president Jair Bolsonaro is facing after making multiple statements questioning the global push to mandate mass immunization with a fast-tracked COVID vaccine.\n\nAfter President Bolsonaro was quoted twice voicing his opinion on forced immunization – telling one supporter “No one can force anyone to get a vaccine” and stating later in a Facebook Live that “nobody can oblige someone to take a vaccine” – critics swiftly condemned the South American leader.\n\nIn a statement, the Brazil Workers’ Party said the president’s words “ignores the importance of the shots to protect the health of the entire population.” Even President Bolsonaro’s own nation’s health council countered with a rather contentious comment, stating that the “right to individual liberty is not absolute to the point of being above the collective well-being,” according to AP News.\n\nInterestingly, AP News reports that a recent international poll indicates fully 88% of Brazilians said they would get immunized against COVID-19 if a vaccine was available. That’s far more than the roughly 50% of Americans who would currently consent to a COVID vaccine according to Science magazine, and it also brings up a critical and nuanced point made by many experts:\n\nWith so much apparent support for a COVID vaccine in countries like Brazil, why impose a vaccine mandate anyway? The public, critics argue, should be free to make their own informed choices for themselves and their families – whether that’s to get a vaccine or not – and not by force from elected officials and under the threat of fines, restricted mobility, or job loss.\n\nA matter of public health: Here are 7 possible vaccine dangers most officials don’t want you to remember\n\nLet’s not forget that the current fast-paced COVID-19 vaccination trials aren’t going as well as some would hope. Just recently, the phase 3 COVID vaccine trial from major Pharma company AstraZeneca was halted due to reports of a severe adverse reaction from one of the participants.\n\nAdverse reactions have also been reported in other clinical trials, including one being done by biotech company Moderna (funded in part by the Fauci-led National Institute of Allergy and Infectious Diseases).\n\nAssuming a COVID vaccine is on the near horizon, people must remain well-aware of the possible health risks historically associated with vaccines. According to the U.S. Centers for Disease Control and Prevention (CDC), these health risks include:\n• Guillain-Barré syndrome, which can cause (sometimes irreversible) paralysis\n• Low platelet count (which can cause unusual bleeding or bruising)\n• A “very remote chance of a vaccine causing a severe allergic reaction, other serious injury, or death” (from the CDC’s website)\n\nWe expect officials to track the incidents of any potential vaccine dangers closely over the coming year as a COVID vaccine becomes available – and potentially mandated. The fewer incidents the better, of course – but for informed consent the public must be made aware of these safety concerns.", "opengraph": {"locale": "en_US", "type": "article", "title": "Brazil President Attacked for Saying No to Vaccines | NaturalHealth365", "description": "(NaturalHealth365) The President of Brazil has been attacked for his position on mandatory vaccinations. Is all this controversy justified?", "url": "https://www.naturalhealth365.com/brazil-covid-vaccine-3557.html", "site_name": "NaturalHealth365", "article:published_time": "2020-09-16T05:11:01+00:00", "article:modified_time": "2020-09-17T14:06:10+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/09/brazil-president-position-on-mandatory-vaccinations-scaled.jpg", "image:width": "1024", "image:height": "666", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.naturalhealth365.com/mandated-vaccine-virginia-3535.html", "https://www.naturalhealth365.com/massachusetts-mandatory-3533.html", "https://apnews.com/76e0d15bff4cf885f29abb953a842253?fbclid=IwAR3YTY6DPYwdjh1Frx2pN0EJDqROZcB4Biyy4h6qYeAUqbSYPxSmcIzqFL4", "https://www.naturalhealth365.com/covid-trial-on-hold-3556.html", "https://www.naturalhealth365.com/videos/reverse-pneumonia-in-3-hours/", "https://www.statnews.com/2020/09/08/astrazeneca-covid-19-vaccine-study-put-on-hold-due-to-suspected-adverse-reaction-in-participant-in-the-u-k/", "https://www.statnews.com/2020/05/26/moderna-vaccine-candidate-trial-participant-severe-reaction/", "https://apnews.com/76e0d15bff4cf885f29abb953a842253?fbclid=IwAR3YTY6DPYwdjh1Frx2pN0EJDqROZcB4Biyy4h6qYeAUqbSYPxSmcIzqFL4", "https://www.cdc.gov/vaccinesafety/concerns/index.html", "https://www.cdc.gov/vaccines/vac-gen/side-effects.htm"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-09-16T05:11:01+00:00"}