{"result_id": "210001", "URL": "https://www.naturalhealth365.com/blood-samples-of-covid-jabbed-contain-strange-crystalline-formations-scientists-reveal.html", "timestamp": "2023-04-25 16:25:48 CEST+0200", "meta": {"description": "(NaturalHealth365) German group of doctors, scientists find undisclosed metals in blood samples of COVID jabbed individuals.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/blood-samples-of-covid-jabbed-contain-strange-crystalline-formations-scientists-reveal.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Undisclosed Metals Found In COVID Shots", "cleaned_text": "(NaturalHealth365) Heavy metals – including aluminum, lead, arsenic, cadmium, mercury, uranium, strontium, and thallium – are found in everything from popular baby foods and tap water to household paints and, yes, vaxxes. Now, new research involving blood samples from vaxxed individuals suggests that COVID shots share at least one thing in common with the dozens of other jabs currently recommended for kids and adults by the U.S. Centers for Disease Control and Prevention (CDC) – they, too, are loaded with toxic contaminants.\n\nIn a report called “Summary of Preliminary Findings,” a multidisciplinary team from Germany puts it bluntly: “The COVID-19 vaccination programmes must be stopped immediately.” Keep reading to learn why they came to this sobering conclusion.\n\nThe German group, called the Working Group for Covid Vaccine Analysis, includes independent physicians, physicists, chemists, microbiologists, pharmacologists, alternative health practitioners, lawyers, psychologists, analysts, and journalists. Their report, published earlier this summer, is described as a “preliminary, continuously evolving presentation of our research and findings on the so-called COVID-19 vaccines, as well as the effects we found on the human body and the blood in particular. The summary is intended for the public interest and to encourage further scientific discussion.”\n\nHere’s just some of what their report entails:\n\nAfter analyzing the COVID jabs from AstraZeneca, Pfizer, and Moderna – and analyzing blood samples from an admittedly small group of COVID vaxxed individuals (48) – the German researchers came to a variety of important conclusions.\n\nFirst, and “without exception,” all samples of COVID vaxxes tested contained substances at levels that are considered toxic “according to medical guidelines.” Substances allegedly found in these shots include cobalt (Co), iron (Fe), chromium (Cr), titanium (Ti), aluminum (Al), calcium (Ca), barium (Ba), cesium (Cs), potassium (K), cerium (Ce), gadolinium (Gd), silicon (Si), and sulfur (S).\n\nThese substances, which were mostly metallic, were seen under microscopic evaluation, despite the fact that they were “not declared by the manufacturers as present in the vaccines,” the researchers say. The researchers add that the presence of these “distinctive and complex structures” cannot be explained by “contamination” during the manufacturing process, implying that the metallic compounds are there intentionally.\n\nAs for the mRNA shots specifically, the researchers also found that the “greater the stability of the envelope of lipid nanoparticles, the more frequent are vaccine side effects.” In other words: more stable lipid nanoparticle components allow for more mRNA gene technology to penetrate human cells, “where the production of spike proteins then takes place.” Their results correspond with emerging data showing that both virus-induced and jab-induced spike proteins are harmful to human health.\n\nFor their research, the Working Group for Covid Vaccine Analysis used a variety of widely accepted modern medical techniques, including Dark Field Microscopy (DFM), Scanning Electron Microscopy (SEM), Energy Dispersive X-ray Spectroscopy (EDX), Mass Spectroscopy (MS), Inductively Coupled Plasma Analysis (ICP), Bright Field Microscopy (BFM), and Live Blood Image Diagnostic.\n\nVaxxed blood exhibits unusual changes, hinting at future long-term health consequences for jabbed individuals, including children\n\nAs for the blood of injected individuals, the German researchers found that “samples of all the people who had been vaccinated showed marked changes.” The researchers found “crystalline formations” and “complex structures similar to those in the vaccines” in blood samples from vaxxed individuals. Notably, these blood changes were evident “even if those people hadn’t at that point displayed any visible reaction to the vaccinations.”\n\nThis last point clearly points to the worrisome possibility of future long-term health effects among jabbed individuals.\n\nIn their report, the Working Group for Covid Vaccine Analysis explains that they are “exploring the hypothesis that arteriosclerosis could be just one of many long-term effects that those vaccinated with the COVID-19 vaccines will have to face. If this hypothesis is confirmed, the consequences would be wide-reaching in terms of both health and socio-economics.”\n\nThe researchers further hypothesize that the obvious changes in the blood induced by the COVID jabs could also “play a causal role” in the development of autoimmune diseases and immune dysfunction, both of which can “lead to organ damage, high blood pressure, heart attacks, neurodegenerative diseases, cancer, and shorten life expectancy … At the very least, each one of our findings should result in the immediate suspension of the COVID-19 vaccination programmes in order to exclude the vaccines from reasonable suspicion.”\n\nIn an effort to ensure that their work is seen, the group has shared their findings publically with at least 4,000 individuals, including the entire Lower House of Parliament in Germany and members of the German media.\n\nIn an article posted to Substack, internal medicine physician Dr. Ana Mihalcea, MD, says she is “horrified” by this data and calls it “transhumanist [artificial intelligence] agenda in full force.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Undisclosed Metals Found In COVID Shots | NaturalHealth365", "description": "(NaturalHealth365) German group of doctors, scientists find undisclosed metals in blood samples of COVID jabbed individuals.", "url": "https://www.naturalhealth365.com/blood-samples-of-covid-jabbed-contain-strange-crystalline-formations-scientists-reveal.html", "site_name": "NaturalHealth365", "article:published_time": "2022-10-03T05:11:10+00:00", "article:modified_time": "2022-10-03T02:26:33+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/10/iStock-1337631912.jpeg", "image:width": "1366", "image:height": "768", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://expose-news.com/2022/08/24/crystalline-objects-blood-vaccinated/", "https://www.naturalhealth365.com/spike-proteins-in-covid-jabs-cause-organ-damage-3993.html", "https://www.naturalhealth365.com/new-study-links-artificial-sweeteners-to-heart-attacks.html", "https://expose-news.com/2022/08/24/crystalline-objects-blood-vaccinated/", "https://www.ewg.org/news-insights/news/3-things-parents-should-know-about-toxic-heavy-metals-baby-foods", "https://www.ewg.org/sites/humantoxome/chemicals/chemical_classes.php?class=Metals", "https://anamihalceamdphd.substack.com/p/alarming-new-report-from-working"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-10-03T05:11:10+00:00"}