{"result_id": "210044", "URL": "https://www.naturalhealth365.com/covid-trial-on-hold-3556.html", "timestamp": "2023-04-25 16:27:20 CEST+0200", "meta": {"description": "(NaturalHealth365) The Astrazene COVID-19 vaccine trial has been put on hold due to serious (negative) reactions. Get the facts here.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-trial-on-hold-3556.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID Vaccine Trial Put On Hold", "cleaned_text": "(NaturalHealth365) While vaccines generally take 15-20 years to get to the market, there’s been a significant push to get a COVID-19 vaccine ready to use to combat the current global pandemic. In fact, we previously reported that vaccines are being rushed to market while skipping procedures like animal testing before being used on humans.\n\nWe already know that most vaccine candidates fail, so testing them on humans without proper safety precautions could result in a solution that’s worse than the virus. Backing up our concerns is recent news announcing that AstraZeneca’s Phase 3 COVID-19 trials were put on hold after a participant in the United Kingdom experienced serious neurological symptoms.\n\nAccording to reports by Stat News, a woman who was a part of the Phase 3 COVID-19 AstraZeneca vaccine trials came down with neurological symptoms that were consistent with transverse myelitis, a very serious and rare spinal inflammatory disorder. AstraZeneca did confirm that this woman had been injected with the vaccine and not a placebo in the trials. In addition, this participant was diagnosed with multiple sclerosis upon further examination, although this diagnosis was deemed to be unrelated to being treated with the COVID-19 vaccine.\n\nWhile sources say the woman is expected to recover from her symptoms, the symptoms were enough to put the Phase 3 trials on hold – at least within the U.K. It remains unclear whether the pause on Phase 3 testing within the U.K. will affect plans for Phase 3 testing within the United States.\n\nAlong with this isolated report of serious neurological symptoms, studies on phase one and two, which were published in the medical journal the Lancet discovered multiple side effects. These side effects include reactions at the injection site, headaches, muscle pain, and fever, although they did subside during the course of the vaccine trials.\n\nThe AstraZeneca vaccine, which is called AZD1222, uses an adenovirus carrying a gene for one of the proteins found in SARS-CoV-2, which is the virus causing COVID-19. Scientists believe the adenovirus will cause the immune system to generate a protective response to SARS-2. While this platform hasn’t been used in any vaccines that have gained approval, it’s been tested in experimental vaccines designed for other viruses, such as the Ebola virus.\n\nThe advenovirus platform is still considered “experimental,” although it did serve as the basis for a COVID-19 vaccine in Russia. Known as Sputnik-V, this new vaccine was rolled out to the public in Russia within the past week.\n\nAccording to a peer-reviewed study, which was published in the Lancet, that looked at early testing of the Sputnik-V vaccine, the Russian vaccine appears to be safe and effective. Naturally, we have our doubts.\n\nIt should be noted that most of these vaccine “trials,” involve relatively “young, healthy people.” One can only imagine what the results of these experimental COVID-19 vaccine trials would be, if they were done with an elderly population. And, that’s not to mention testing this new vaccine on people with diabetes, obesity or on multiple prescription medications for preexisting health issues.\n\nSo, obviously, the jury is still out on what will happen with AstraZeneca’s vaccine moving forward. Feeding into the general public distrust about vaccines, many other vaccine manufacturers remain quite secretive about their “progress.”\n\nEditor’s note: Just a few days after the AstraZeneca trial was suspended – due to a spinal inflammatory response in one participant, the company announced it will resume its work on developing a vaccine. But, AstraZeneca is not disclosing any medical information. Naturally, this leaves many people concerned about what’s really going on here.\n\nStay tuned to NaturalHealth365, as we continue to monitor developments in this story.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID Vaccine Trial Put On Hold | NaturalHealth365", "description": "(NaturalHealth365) The Astrazene COVID-19 vaccine trial has been put on hold due to serious (negative) reactions. Get the facts here.", "url": "https://www.naturalhealth365.com/covid-trial-on-hold-3556.html", "site_name": "NaturalHealth365", "article:published_time": "2020-09-15T05:11:50+00:00", "article:modified_time": "2020-09-16T23:39:46+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/09/astrazeneca-covid-trials-scaled.jpg", "image:width": "1024", "image:height": "677", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://www.naturalhealth365.com/", "https://www.statnews.com/2020/09/09/astrazeneca-covid19-vaccine-trial-hold-patient-report/", "https://www.statnews.com/2020/09/09/astrazeneca-covid19-vaccine-trial-hold-patient-report/", "https://www.rt.com/news/500207-astrazeneca-covid-vaccine-hold/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)31604-4/fulltext", "https://www.naturalhealth365.com/coronavirus-drug-dangers-3398.html"], "authors": ["Joy Jensen, staff writer"], "publish_date": "2020-09-15T05:11:50+00:00"}