{"result_id": "210009", "URL": "https://www.naturalhealth365.com/bill-gates-population-control-3382.html", "timestamp": "2023-04-25 16:26:05 CEST+0200", "meta": {"description": "(NaturalHealth365) More and more people are worried about this \"tattoo ID\" plan of Bill Gates. Find out what the mainstream media is not reporting.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/bill-gates-population-control-3382.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Bill Gates Funds Tattoo Id to Track People", "cleaned_text": "(NaturalHealth365) Should billionaire Bill Gates have a say in what goes into your body, or your children’s bodies? It certainly seems like that’s been his end goal ever since he started going on record about wanting to invent new vaccines as part of his push for population control.\n\nIn the wake of the COVID-19 pandemic, many skeptical consumers are now wondering if the SARS-CoV-2 virus is actually a “blessing” for Bill Gates and his cronies. There’s even a clear paper trail connecting Gates to 2019 research that literally figured out a way to tattoo proof of vaccines onto children’s skin … and no – this is not science fiction.\n\nSuspicion grows: Does Bill Gates, long hopeful that vaccines will help curb population growth, want global citizens to “prove” they get the SARS-CoV-2 vaccine with invisible tattoo?\n\nThe coronavirus scare is the perfect vehicle for Gates to complete his depraved plan of vaccinating everyone on the planet.\n\nWe already have multiple examples of the billionaire publicly stating that he wants vaccines, along with family planning policies and other interventions, to slow population growth and reduce the global population by 10 to 15 percent over the coming decades. (Here’s video proof, in his own words.)\n\nAnd while fact checker websites like Snopes insist that Gates is pouring billions of dollars into vaccines as a way to “improve” people’s lives rather than act as an “agent of death,” many are deeply suspicious about the man’s true intentions … and deeply concerned about what kind of Big Brother dystopia his vision is marching us toward, especially now that he has the widespread fear of COVID-19 to take advantage of.\n\nIn 2019, a study was conducted at the Massachusetts Institute of Technology (MIT). The researchers “codelivered” near-infrared microparticle technology along with a vaccine into the skin of test animals. The near-infrared microparticles are invisible to the naked eye but can be seen with “modified smartphones.” The researchers proudly assert this invisible vaccine tattoo can be used to create an “on-person vaccination record.”\n\nThe study, titled “Biocompatible near-infrared quantum dots delivered to the skin by microneedle patches record vaccination” and published in Science Translational Medicine, was funded by the Bill and Melinda Gates Foundation.\n\nCan you imagine? Having to have your arm “scanned” by someone wielding a handheld device to prove you’ve had a SARS-CoV-2 vaccine just so you can go back to work, get on a plane, or enter a building?\n\nIt’s absolute insanity – and it’s not even the only invasion of privacy officials are drooling over.\n\nImmunity passports? Try vaccine passports – citizens call foul as concerns grow about a conspiratorial bait and switch\n\nThroughout the insanity over the past few months, some experts have floated the idea of so-called “immunity passports” as a way to safely re-open countries and get the economy going again. Also called “risk-free certificates” according to the World Health Organization (WHO), these immunity passports have serious ethical concerns.\n\nJust think about what that world would be like: a world where you are forced to carry papers (let alone have an invisible tattoo!) which allegedly “prove” you’ve recovered from COVID-19 and now have antibodies for SARS-CoV-2 and are therefore “safe” to return to society.\n\nFortunately, even the WHO seems skeptical – at least for now. From their website: “Some governments have suggested that the detection of antibodies to the SARS-CoV-2, the virus that causes COVID-19, could serve as the basis for an ‘immunity passport’ or ‘risk-free certificate’ that would enable individuals to travel or to return to work assuming that they are protected against re-infection. There is currently no evidence that people who have recovered from COVID-19 and have antibodies are protected from a second infection.”\n\nThey go on to add, “As of 24 April 2020, no study has evaluated whether the presence of antibodies to SARS-CoV-2 confers immunity to subsequent infection by this virus in humans. Laboratory tests that detect antibodies to SARS-CoV-2 in people… need further validation to determine their accuracy and reliability.”\n\nOf course, this brings up another major question:\n\nBy “immunity passport,” do these government agencies actually mean “vaccine certificates?” In other words, is the real goal to normalize and implement forced mass vaccination, especially given the apparent unknown viability of antibody testing?\n\nThis gross violation of bodily autonomy and personal rights seems to be having its groundwork laid by officials. On April 15 2020, in an interview with CBS News, director of the National Institute of Allergy and Infectious Diseases Dr. Anthony Fauci admitted that a COVID-19 vaccine is the current “end game” and is the preferred way to achieve a so-called “herd immunity” (when a population is allegedly protected from a disease because a majority of people are immune to it).\n\nThe alternative to creating herd immunity “artificially” as Dr. Fauci says, would be the result of a large percentage of the population contracting SARS-CoV-2 and then recovering from it. Hence the advent of and WHO-supported studies called “serosurveys” which aim to detect antibodies to the novel coronavirus in people … and as we’ve just learned, there are lots of unknowns surrounding this kind of data.\n\nSo, only time will tell if these mass “investigations” into our blood will be worthwhile, or even continue.", "opengraph": {"locale": "en_US", "type": "article", "title": "Bill Gates Funds Tattoo Id to Track People | NaturalHealth365", "description": "(NaturalHealth365) More and more people are worried about this \"tattoo ID\" plan of Bill Gates. Find out what the mainstream media is not reporting.", "url": "https://www.naturalhealth365.com/bill-gates-population-control-3382.html", "site_name": "NaturalHealth365", "article:published_time": "2020-04-27T05:11:30+00:00", "article:modified_time": "2020-09-10T17:17:39+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/09/green-drink-wlogo-scaled.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.naturalhealth365.com/coronavirus-grant-money-3373.html", "https://stm.sciencemag.org/content/11/523/eaay7162", "https://www.brighteon.com/5818100770001", "https://www.naturalhealth365.com/covid-19-fraud-who-cdc-3376.html", "https://www.sciencealert.com/an-invisible-quantum-dot-tattoo-is-being-suggested-to-id-vaccinated-kids", "https://www.sciencemag.org/news/2020/04/unprecedented-nationwide-blood-studies-seek-track-us-coronavirus-spread", "https://www.who.int/news-room/commentaries/detail/immunity-passports-in-the-context-of-covid-19", "https://www.cbsnews.com/news/5-things-to-know-dr-anthony-fauci-reopening-us-economy-coronavirus-covid19-pandemic-2020-04-15/", "https://www.snopes.com/fact-check/bill-gates-vaccinations-depopulation/", "http://transcripts.cnn.com/TRANSCRIPTS/1102/05/hcsg.01.html", "https://www.weforum.org/agenda/2018/09/africas-rapid-population-growth-puts-poverty-progress-at-risk-says-gates/", "https://21stcenturywire.com/2019/12/23/bill-gates-develops-new-id-tattoo-to-check-for-vaccinations/", "https://nerdist.com/article/invisible-tattoos-vaccination-records-tracking/"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-04-27T05:11:30+00:00"}