{"result_id": "210016", "URL": "https://www.naturalhealth365.com/data-show-jab-rollout-linked-to-rise-in-deaths-3520.html", "timestamp": "2023-04-25 16:26:21 CEST+0200", "meta": {"description": "(NaturalHealth365) Analysis of data from 145 countries shows causal relationship between COVID jab rollout and increase in deaths and cases.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/data-show-jab-rollout-linked-to-rise-in-deaths-3520.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Data Show Jab Rollout Linked To Rise In Deaths", "cleaned_text": "(NaturalHealth365) It is alarming to see doctors – who mainstream media outlets eagerly platform – label people like podcaster Joe Rogan as a “menace to public health,” simply for interviewing vetted and experienced experts like virologist Dr. Robert Malone, inventor of mRNA technology. The implication: voicing any questions, facts, or opinions that go against the pandemic narrative is dangerous to others, and that just because someone is an “expert” like Malone doesn’t mean you should trust them (but of course, you should fully trust “experts” that cite CDC-funded studies and parrot the Big Pharma-funded news outlets).\n\nBut what happens when more and more data continue to fly in the face of propaganda? Will all the researchers, podcasters, and journalists talking about this data be canceled and have their rights to free speech trampled? Are we really prepared, as a society, to normalize such widespread censorship?\n\nUniversity of Alberta: Data from 145 countries reveals worrisome link between COVID shot roll out and increased deaths\n\nHere’s one study that’s likely going to be silenced: called “Worldwide Bayesian Causal Impact Analysis of Vaccine Administration on Deaths and Cases Associated with COVID-19: A BigData Analysis of 145 Countries.”\n\nThe study was conducted by Kyle Beattie from the Department of Political Science at the University of Alberta in Canada. Beattie compiled COVID shot data from 145 countries and set out to answer this important question: “Has this public policy treatment produced the desired effect?”\n\nIn the United States, the COVID shot rollout appears to have actually increased the number of COVID-19 cases per million by almost 40%. Introducing COVID shots into the population during an active pandemic has also increased the number of COVID-related deaths per million by 31%.\n\nOther countries have not fared well in the wake of the COVID shot rollout, either, the study indicates. According to Beattie, an estimated 89.84% of the 145 countries included in the analysis experienced an “increase in total deaths per million associated with COVID-19 due directly to the causal impact of [jab] initiation.”\n\nAnd countries like Taiwan, Mongolia, Cambodia, and Thailand, which had the lowest number of COVID-related deaths in 2020, appear to have fared the worst.\n\nAre these mRNA COVID jabs truly just making things worse for the global population?\n\nThe data, Beattie says, “indicate a marked increase in both COVID-19 related cases and death due directly to a vaccine deployment that was originally sold to the public as the ‘key to gain back our freedoms.'”\n\nHe continues: “The effect of vaccines on total cases per million and its low positive association with total vaccinations per hundred signifies a limited impact of vaccines on lowering COVID-19 associated cases. These results should encourage local policy makers to make policy decisions based on data, not narrative, and based on local conditions, not global or national mandates. These results should also encourage policy makers to begin looking for other avenues out of the pandemic aside from mass vaccination campaigns.”\n\nWebsites like Health Feedback claims this study has “flawed reasoning” and fails to properly account for confounding variables that can influence COVID cases and deaths, such as viral variants and “healthcare capacity during the pandemic,” the latter of which has been dramatically impacted by mass firings of unvaxxed healthcare workers as well as a large number of fully jabbed healthcare workers who are out sick with COVID.\n\nBut Beattie stands by his analysis and offers a grim warning to officials: “The statistically significant and overwhelmingly positive causal impact after vaccine deployment on the dependent variables total deaths and total cases per million should be highly worrisome for policy makers.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Data Show Jab Rollout Linked To Rise In Deaths | NaturalHealth365", "description": "(NaturalHealth365) Analysis of data from 145 countries shows causal relationship between COVID jab rollout and increase in deaths and cases.", "url": "https://www.naturalhealth365.com/data-show-jab-rollout-linked-to-rise-in-deaths-3520.html", "site_name": "NaturalHealth365", "article:published_time": "2022-01-21T06:11:50+00:00", "article:modified_time": "2022-01-20T12:20:56+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2022/01/iStock-1287605674.jpg", "image:width": "1365", "image:height": "768", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.researchgate.net/publication/356248984_Worldwide_Bayesian_Causal_Impact_Analysis_of_Vaccine_Administration_on_Deaths_and_Cases_Associated_with_COVID-19_A_BigData_Analysis_of_145_Countries", "https://www.naturalhealth365.com/breakthrough-covid-cases-3922.html", "https://www.naturalhealth365.com/top-immunologist-criticizes-pandemic-management-3513.html", "https://www.rollingstone.com/culture/culture-news/covid-misinformation-joe-rogan-spotify-petition-1282240/", "https://truthpress.news/news/145-country-study-shows-increase-of-transmission-and-death-after-introduction-of-covid-vaccines/", "https://healthfeedback.org/claimreview/scientific-evidence-shows-covid-19-vaccination-reduces-risk-infection-mortality-analysis-cases-deaths-from-145-countries-methodologically-flawed-steve-kirsch/", "https://www.researchgate.net/publication/356248984_Worldwide_Bayesian_Causal_Impact_Analysis_of_Vaccine_Administration_on_Deaths_and_Cases_Associated_with_COVID-19_A_BigData_Analysis_of_145_Countries"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2022-01-21T06:11:50+00:00"}