{"result_id": "210027", "URL": "https://www.naturalhealth365.com/covid-vaccine-risks-3769.html", "timestamp": "2023-04-25 16:26:43 CEST+0200", "meta": {"description": "(NaturalHealth365) We are in the middle of a massive vaccination campaign. But is the COVID vaccine doing more harm than good?", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/covid-vaccine-risks-3769.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID Vaccine Risks May Outweigh The Benefits", "cleaned_text": "(NaturalHealth365) Recently, several countries in Europe made headlines when public officials decided to suspend the rollout of the AstraZeneca COVID vaccine due to concerns over post-vaccination blood clots. The backlash is hardly unexpected, and both mainstream media and the World Health Organization (WHO) have wasted no time in condemning these countries’ precautionary actions and doing some serious PR damage control to quell the “panic” and urge countries like Germany, France, Spain, and Italy to continue administering the shot.\n\nOne might wonder why acting with an abundance of caution over the mass rollout of an unapproved investigational drug is considered unwarranted rather than logically and ethically prudent. Many are also skeptical about why the WHO and other organizations so hastily deny any evidence of COVID vaccine deaths. But perhaps, say some experts, we should be asking another question altogether: are the potential benefits of creating a so-called “vaccine” in the middle of an active pandemic even worth the risks?\n\nHere’s why it makes no sense to accept a “Big pharma solution” in the middle of a pandemic, according to a prominent vaccine developer\n\nIn a March 2021 interview, Dr. Geert Vanden Bossche Ph.D., an internationally recognized vaccine developer and the former head of the Vaccine Development Office at the German Centre for Infection Research, explains his scientific concerns over launching a massive vaccination campaign in the middle of an ongoing pandemic outbreak.\n\nYou can watch the entire (video) interview – below:\n\nFor context, Dr. Bossche points out that currently, there are several “highly infectious” mutated versions of SARS-CoV-2 circulating throughout the world. Examples include B.1.1.7, which emerged from England, and B.1.351, which emerged from South Africa.\n\nThe scientist continues, the problem is that with an active outbreak, variants can evolve so quickly that they may be able to evade a so-called “COVID vaccine,” rendering it less effective. Plus, Dr. Bossche argues, antibodies produced by a COVID vaccine are at risk of out-competing and effectively blocking a person’s innate immune system from working against all future COVID variants.\n\nDr. Bossche projects that this could effectively end the ability of a person’s body to fight off any future infection indefinitely!\n\n“I think we are very close to vaccine resistance right now,” he states plainly.\n\nIn support of Dr. Bossche’s warning: New study reveals that SARS-CoV-2 variants already “resistant” to the COVID vaccine\n\nUnsurprisingly, Dr. Bossche has faced swift criticism from officials and news outlets who espouse the party line of getting as many people vaccinated as quickly as possible, even if that means downplaying or delaying investigations of potential adverse effects or questionable after-vaccine deaths.\n\nThe thing is, evidence already appears to exists that supports the Belgian scientist’s hypothesis.\n\nIn a study published this month in Nature, a team of researchers used blood samples from people inoculated with the Moderna or Pfizer vaccine to assess the ability of antibodies to neutralize variants B.1.351 and B.1.1.7, both of which are now circulating in the United States. Their investigation reveals that vaccine-derived antibodies are less effective at neutralizing the B.1.1.7 variant by 2-fold and less effective at neutralizing the B.1.351 variant by up to 8.5-fold.\n\nIn a press release published by Science Daily, the study’s lead author warns that “if the rampant spread of the virus continues and more critical mutations accumulate, then we may be condemned to chasing after the evolving SARS-CoV-2 continually, as we have long done for influenza virus,” and that the emergence of these variants stand to “threaten the protective efficacy of current vaccines.”\n\nCuriously, the lead author uses his research findings to justify expediting the massive vaccine rollout to an even greater degree and claims that vaccinating as many people as quickly as possible with this experimental drug is necessary to stop the development of additional viral mutations.\n\nLike many, we ask, are public health officials truly weighing the risks versus benefits of this monumental “health” campaign? We’ve often said that the best course of action – for any health concern – is to find ways to better support a healthy immune system. The question remains: when will modern medicine wake up to this truth?", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID Vaccine Risks May Outweigh The Benefits | NaturalHealth365", "description": "(NaturalHealth365) We are in the middle of a massive vaccination campaign. But is the COVID vaccine doing more harm than good?", "url": "https://www.naturalhealth365.com/covid-vaccine-risks-3769.html", "site_name": "NaturalHealth365", "article:published_time": "2021-03-21T05:11:45+00:00", "article:modified_time": "2021-03-26T10:56:55+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2021/03/iStock-1294438458.jpg", "image:width": "1254", "image:height": "836", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://apnews.com/article/germany-suspends-astrazeneca-vaccine-blood-clotting-0ab2c4fe13370c96c873e896387eb92f", "https://www.naturalhealth365.com/exercise-immune-system-3697.html", "https://apnews.com/article/germany-suspends-astrazeneca-vaccine-blood-clotting-0ab2c4fe13370c96c873e896387eb92f", "https://www.sciencedaily.com/releases/2021/03/210308131712.htm", "https://www.reuters.com/article/us-health-coronavirus-who-vaccines-scien/who-scientist-says-no-deaths-linked-to-covid-19-shots-urges-against-panic-idUSKBN2B72DE", "https://www.nature.com/articles/s41586-021-03398-2#citeas", "https://www.cdc.gov/coronavirus/2019-ncov/transmission/variant-cases.html"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2021-03-21T05:11:45+00:00"}