{"result_id": "210038", "URL": "https://www.naturalhealth365.com/france-slows-covid-vaccine-rollout-3751.html", "timestamp": "2023-04-25 16:27:08 CEST+0200", "meta": {"description": "(NaturalHealth365) Healthcare workers of multiple hospitals in France suffer COVID vaccine side effects, slowing vaccine rollout.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/france-slows-covid-vaccine-rollout-3751.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "COVID Vaccine Side Effects Slow Vaccine Rollout", "cleaned_text": "And so, here we are: the experimental COVID-19 vaccine is now being administered to millions of people across the globe, and we are hearing time and again of serious adverse effects that warrant further investigation. And many people – including healthcare providers in select French hospitals – aren’t willing to risk their health by lining up for a jab.\n\nNon merci: French healthcare providers say “No, thank you” to AstraZeneca COVID-19 vaccine due to high rate of side effects\n\nAs was the case in other countries, healthcare workers were in the first wave of people in France to receive the investigational, non-FDA-approved COVID-19 vaccine by AstraZeneca. Anticipating the high rate of COVID vaccine side effects from the drugs, many healthcare facilities (including hundreds here in the United States) employed a “staggered” vaccination schedule to prevent entire departments from getting sick at once.\n\nBut for many hospitals, even that “precaution” didn’t work.\n\nOne report indicates that the university hospital of Brest in Brittany, Western France saw up to 25 percent of its vaccine recipients call out of work due to severe symptoms like headaches, muscle aches, and high fever. Another report notes that the Hygiene and Safety Committee at the hospital in Périgueux, France reported serious adverse effects occurring in up to 70 percent of their recently-vaccinated healthcare workers.\n\nAffected staff members include critical employees like intensive care unit (ICU) nurses and physical therapists. Aside from threatening the staff members’ own comfort and safety, these mass call-outs also led to potentially dangerous staff shortages on ICU and COVID-19 units.\n\nIn other news: FDA authorizes emergency use of Johnson & Johnson COVID-19 vaccine despite lack of evidence that it prevents spread of coronavirus\n\nThe world is taking a big risk on these investigational drugs – drugs that aren’t even proven to work, per the FDA’s own admission.\n\nIn their recent news release detailing the emergency use authorization (EUA) for the Johnson & Johnson COVID-19 vaccine (aka Janssen vaccine), the FDA states, “At this time, data are not available to determine how long the vaccine will provide protection, nor is there evidence that the vaccine prevents transmission of SARS-CoV-2 from person to person.” The same warnings were included in the FDA’s news releases about the Moderna and Pfizer vaccines.\n\nGiven the lack of evidence, it’s no wonder Dr. Anthony Fauci and other public health officials continue to demand that even vaccinated citizens continue to abide by pandemic policies, including social distancing and mask-wearing.\n\nSuch admission from the FDA is doubly concerning given the alarming news that participants from the Pfizer and Moderna clinical trials are dropping out in order to get the vaccine – meaning these studies are no longer truly “placebo-controlled” and that the ability of these trials to accurately assess long-term vaccine safety outcomes is now seriously threatened.\n\nOf course, these (now-jeopardized) trials are already rife with conflicts of interest. In their official disclosure forms provided by the International Committee of Medical Journal Editors, authors of the phase 3 Moderna trial endorse funding from the likes of the National Institutes of Health (NIH), Fauci-run National Institute of Allergy and Infectious Diseases (NIAID), the Gates Foundation, and several pharmaceutical companies – including Moderna itself.\n\nHow far will public officials go with these unproven, mass-administered drugs – and how easily will the public accept continually restrictive policies, including vaccine passports? Time will tell, although in a glimmer of hope more people are asking questions, seeking answers, and speaking out.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID Vaccine Side Effects Slow Vaccine Rollout | NaturalHealth365", "description": "(NaturalHealth365) Healthcare workers of multiple hospitals in France suffer COVID vaccine side effects, slowing vaccine rollout.", "url": "https://www.naturalhealth365.com/france-slows-covid-vaccine-rollout-3751.html", "site_name": "NaturalHealth365", "article:published_time": "2021-03-05T06:11:10+00:00", "article:modified_time": "2021-03-04T11:34:58+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2021/03/iStock-1211115025.jpg", "image:width": "1365", "image:height": "768", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://www.lifesitenews.com/news/france-considers-slowing-vaccine-rollout-for-hospital-staff-with-many-unable-to-work-following-jab", "https://www.naturalhealth365.com/covid-vaccine-side-effects-3746.html", "https://france3-regions.francetvinfo.fr/nouvelle-aquitaine/dordogne/trop-d-effets-indesirables-les-hospitaliers-de-dordogne-ne-veulent-pas-se-faire-vacciner-par-astra-zeneca-1958278.html", "https://www.fda.gov/news-events/press-announcements/fda-takes-additional-action-fight-against-covid-19-issuing-emergency-use-authorization-second-covid", "https://www.lifesitenews.com/news/france-considers-slowing-vaccine-rollout-for-hospital-staff-with-many-unable-to-work-following-jab", "https://www.cdc.gov/vaccines/parents/travel-vaccines.html", "https://www.fda.gov/news-events/press-announcements/fda-issues-emergency-use-authorization-third-covid-19-vaccine", "https://www.nejm.org/doi/full/10.1056/NEJMoa2035389", "https://www.nejm.org/doi/suppl/10.1056/NEJMoa2035389/suppl_file/nejmoa2035389_disclosures.pdf", "https://www.sciencemag.org/news/2020/12/makers-successful-covid-19-vaccine-wrestle-options-many-thousands-who-received-placebos"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2021-03-05T06:11:10+00:00"}