{"result_id": "210023", "URL": "https://www.naturalhealth365.com/protective-effect-3433.html", "timestamp": "2023-04-25 16:26:34 CEST+0200", "meta": {"description": "(NaturalHealth365) New Lancet study raises serious questions about COVID jab efficacy, showing protective effect drops to zero.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/protective-effect-3433.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Protective Effect Of COVID Jab Drops To Zero", "cleaned_text": "(NaturalHealth365) With children ages 5 to 11 now permitted to receive a lower dose version of the Pfizer mRNA COVID shot in the United States, some parents and medical experts continue to express dire concerns over this medical intervention’s risk versus reward ratio.\n\nConcerns are poised to grow as we continue to amass evidence that severely calls into question the true efficacy of this injection.\n\nPfizer injection exhibits “no effectiveness” seven months post jab, according to new Lancet preprint study\n\nA study called “Effectiveness of Covid-19 Vaccination Against Risk of Symptomatic Infection, Hospitalization, and Death Up to 9 Months: A Swedish Total-Population Cohort Study” is currently available from The Lancet as preprint only. This means the study has yet to be peer-reviewed.\n\nThis disclaimer aside, let’s take a look at what this early data indicates:\n\nThe Sweden-based study supports the argument, previously described in other research studies, that high jab rates do not necessarily correlate with low levels of COVID-19 cases. It also sheds a harsh light on just how short-lived the so-called “effectiveness” of these mRNA jabs prevents infection.\n\nIn the study, the authors report a steep decline in the Pfizer shot’s efficacy at preventing severe COVID-19 infections, going from 92% relative risk reduction at day 15 to 30 post-jab to 47% at day 121 to 180. And from seven months on? “[N]o effectiveness could be detected.”\n\nThe dramatic failure of the COVID shot over a relatively short amount of time (far less than one year) was especially problematic for certain groups of people: men, older frail individuals, and people with comorbid conditions. The shot appears to have a negative efficacy against severe outcomes for certain people, suggesting that getting the shot may worsen outcomes in some cases.\n\nThe study concludes that COVID shot “effectiveness against symptomatic COVID-19 infection wanes progressively over time across all subgroups, but at different rates according to the type of vaccine, and faster for men and older frail individuals. The effectiveness against severe illness seems to remain high through 9 months, although not for men, older frail individuals, and individuals with comorbidities.”\n\nThe authors use this evidence as justification for administering a third booster shot.\n\nBooster shots forever? Officials continue to move the goalposts, poised to change the definition of “fully vaxxed”\n\nThe idea that Western society is heading toward a mandatory adult vaccine schedule (participate or be “othered” indefinitely) seems to be more and more of a possibility with every passing week.\n\nIn Australia, for instance, a country with stringent lockdown measures recently opened up Pfizer COVID booster shots to all individuals over the age of 18, provided people are at least six months out from their last COVID shot dose. This is despite an important warning listed by the Australian government on its website: “There is limited data on serious side effects such as myocarditis and pericarditis following a Pfizer booster dose.”\n\nAt this time, booster shots are not mandatory for Australians, although it is unclear whether this will change.\n\nThere are also questions about the long-term implications for indefinite booster shots in the United States, as well, after Rochelle Walensky, director of the U.S. Centers for Disease Control and Prevention (CDC), recently hinted that the definition of “fully vaxxed” might need to change in the coming future.\n\nBut with officials continuing to move the goalposts, will anyone ever be considered “fully vaxxed?”", "opengraph": {"locale": "en_US", "type": "article", "title": "Protective Effect Of COVID Jab Drops To Zero | NaturalHealth365", "description": "(NaturalHealth365) New Lancet study raises serious questions about COVID jab efficacy, showing protective effect drops to zero.", "url": "https://www.naturalhealth365.com/protective-effect-3433.html", "site_name": "NaturalHealth365", "article:published_time": "2021-11-06T05:11:58+00:00", "article:modified_time": "2021-11-05T11:02:11+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2021/11/iStock-1289951048.jpg", "image:width": "1203", "image:height": "871", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://naturalhealth365.com", "https://dailysceptic.org/2021/10/28/new-lancet-study-from-sweden-shows-vaccine-effectiveness-against-infection-dropping-to-zero-and-sharp-decline-against-severe-disease-as-well/", "https://www.naturalhealth365.com/prime-minister-australia-mandatory-policy-3537.html", "https://www.naturalhealth365.com/scientists-question-booster-shot-evidence-3952.html", "https://dailysceptic.org/2021/10/28/new-lancet-study-from-sweden-shows-vaccine-effectiveness-against-infection-dropping-to-zero-and-sharp-decline-against-severe-disease-as-well/", "https://www.axios.com/cdc-fully-covid-vaccinated-definition-update-5c2312d9-64f4-4bb7-a289-04c00889a573.html", "https://www.health.gov.au/initiatives-and-programs/covid-19-vaccines/getting-your-vaccination/booster-doses#who-should-get-a-booster-dose", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2021-11-06T05:11:58+00:00"}