{"result_id": "210003", "URL": "https://www.naturalhealth365.com/bill-gates-vaccine-research-3413.html", "timestamp": "2023-04-25 16:25:53 CEST+0200", "meta": {"description": "(NaturalHealth365) Bill Gates has openly admitted that a newly developed vaccine for our current pandemic could harm thousands of people.", "lang": "en", "keywords": "", "favicon": "https://www.naturalhealth365.com/wp-content/uploads/2019/02/cropped-Natural-Health-365-store-logo-32x32.png", "canonical": "https://www.naturalhealth365.com/bill-gates-vaccine-research-3413.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalhealth365.com", "title": "Bill Gates Reveals Shocking Admission", "cleaned_text": "(NaturalHealth365) It’s hard to imagine any billionaire being reckless with his money. Yet for some reason, Bill Gates says he’s willing to throw billions of dollars at corona (CV) vaccine research even though many people believe it will be a complete waste of time and effort.\n\nIn a recent interview, Gates also let it slip that what CV vaccine researchers are pushing for is poised to harm hundreds of thousands of people – yet he still wants one available in less than a year and a half. All in the name of protecting public health, right?\n\nALL HANDS ON DECK: Bill Gates is pumping billions of dollars into vaccine research to “accelerate” drug development\n\nThe Bill & Melinda Gates Foundation says they want there to be a CV vaccine available to the masses within 12 to 18 months. Not suprisingly, Business Insider reports that Gates is funding the construction of at least seven different factories, each testing a different candidate for a novel CV vaccine.\n\nYet only one or two of these potential vaccine candidates will be selected for further development, while the other candidates – and the factories making them – will be abandoned. This means over 70 percent of his “investment” will be completely wasted.\n\nGates has said he’s willing to take the hit on this since it will accelerate vaccine development. All that hurry and waste just to get a vaccine out on the market ASAP? Let’s stop for a moment to consider the skyrocketing unemployment rates and devastating insolvency that millions of people around the world are now facing because of state and federal responses to CV.\n\nIf Gates wants to use his tremendous resources to support the public good, you’d think there he could find a more efficient and effective way to do so, rather than building useless infrastructure.\n\nJAW-DROPPING: Gates acknowledges even flu shots aren’t effective for older adults and issues an (almost) unbelievable warning\n\nVaccines, of course, are not foolproof nor fully effective even when provided a more appropriate amount of time for research and development.\n\nGates admits as much in a recent interview with CNBC, where he bluntly states that even the seasonal “flu vaccine isn’t that effective” in older people – the exact population of people who are targeted for the vaccine itself.\n\nGates also has some brazen things to say about the CV vaccine currently in the pipeline. View the video below to listen for yourself:\n\nWhy does Bill Gates always have a habit of smiling when he talks about people getting hurt?\n\n“We clearly need a vaccine that works in the upper age range because they’re most at risk,” Gates says. Because of this, he suggests the CV vaccine will need to be made more potent (“you have to amp it up”) in order to work for older people – as well as, we presume, all the younger healthy people who will be told to take it, too. And because of this increase in potency, Gates casually estimates that at least 700,000 people will “suffer” from side effects of whatever vaccine gets created.\n\nWe know the CV vaccine is going to be propagandized as a “necessary” step in protecting the community and especially its most vulnerable people. Yet from the mouth of one of the loudest, most influential, and wealthiest drug pushers out there, we’re now hearing confirmation that widespread health consequences are certain. All this for a drug that will be rapidly made and furiously pushed out onto the market.\n\nTell us again the level of cognitive dissonance required to tout this “solution” as safe and effective.", "opengraph": {"locale": "en_US", "type": "article", "title": "Bill Gates Reveals Shocking Admission | NaturalHealth365", "description": "(NaturalHealth365) Bill Gates has openly admitted that a newly developed vaccine for our current pandemic could harm thousands of people.", "url": "https://www.naturalhealth365.com/bill-gates-vaccine-research-3413.html", "site_name": "NaturalHealth365", "article:published_time": "2020-05-24T05:11:58+00:00", "article:modified_time": "2020-09-10T17:24:53+00:00", "image": "https://www.naturalhealth365.com/wp-content/uploads/2020/09/green-drink-wlogo-scaled.jpg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/rfgB_Hdasns\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/rfgB_Hdasns"}], "links": ["#", "https://naturalhealth365.com", "https://www.gatesfoundation.org/TheOptimist/Articles/coronavirus-vaccine-development-gavi", "https://www.naturalhealth365.com/vaccines-epidemic-2201.html", "https://www.businessinsider.com/bill-gates-factories-7-different-vaccines-to-fight-coronavirus-2020-4", "https://www.businessinsider.com/bill-gates-factories-7-different-vaccines-to-fight-coronavirus-2020-4", "https://bigleaguepolitics.com/bill-gates-says-that-700000-could-suffer-side-effects-from-his-vaccine/"], "authors": ["Sara Middleton, staff writer"], "publish_date": "2020-05-24T05:11:58+00:00"}