{"result_id": "211028", "URL": "https://naturalmedicine.news/2022-01-14-another-study-finds-ingredients-in-cannabis-block-virus-causing-covid-19.html", "timestamp": "2023-04-25 16:27:59 CEST+0200", "meta": {"description": "Researchers have uncovered a potential breakthrough in the non-vaccine-related treatment of COVID-19. According to a new report, two compounds found in cannabis have been found to block the SARS-CoV-2 virus, which leads to COVID-19, from penetrating healthy human cells, the Daily Wire noted. The two hemp compounds, cannabigerolic acid, or CBGA, and cannabidiolic acid, or CBDA, “were identified during […]", "lang": "en", "keywords": "badhealth,badmedicine,Canada,cannabis,cannabis cures,coronavirus,COVID,covid-19,Cures,healing,Herbs,Joints for Jabs,natural health,remedies,research,spike protein,stupid,vaccination,vaccines,Washington,Washington State Liquor and Cannabis Board", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://naturalmedicine.news/2022-01-14-another-study-finds-ingredients-in-cannabis-block-virus-causing-covid-19.html", "encoding": "UTF-8"}, "image": null, "domain": "naturalmedicine.news", "title": "Another study finds that ingredients in cannabis block the virus that causes COVID-19", "cleaned_text": "Another study finds that ingredients in cannabis block the virus that causes COVID-19\n\nResearchers have uncovered a potential breakthrough in the non-vaccine-related treatment of COVID-19.\n\nAccording to a new report, two compounds found in cannabis have been found to block the SARS-CoV-2 virus, which leads to COVID-19, from penetrating healthy human cells, the Daily Wire noted.\n\nThe two hemp compounds, cannabigerolic acid, or CBGA, and cannabidiolic acid, or CBDA, “were identified during a chemical screening effort as having potential to combat coronavirus, researchers from Oregon State University said,” according to a laboratory study published in the Journal of Nature Products, Fortune reported.\n\n“In the study, they bound to spike proteins found on the virus and blocked a step the pathogen uses to infect people,” Fortune added.\n\nThe researchers tested the compounds’ effect against alpha and beta variants of the virus in a laboratory. The study didn’t involve giving the supplements to people or comparing infection rates in those who use the compounds to those who don’t.\n\nHemp is a source of fiber, food and animal feed, and extracts are commonly added to cosmetics, body lotions, dietary supplements and food.\n\n“These compounds can be taken orally and have a long history of safe use in humans,” Richard van Breemen, a researcher with Oregon State’s Global Hemp Innovation Center, noted in a statement. “They have the potential to prevent as well as treat infection by SARS-CoV-2.”\n\nThis latest study comes on the heels of another that found people who contract the omicron variant of the virus have an 83 percent less chance of winding up in an intensive care unit or dying than from the delta strain. Also, the Canadian study said, the risk of death or hospitalization, generally, from omicron is 65 percent less than the delta strain.\n\nThough the findings were seemingly positive, Canadian researchers issued a warning, nonetheless.\n\n“While severity is likely to be reduced, the absolute number of hospitalizations and impact on the healthcare system may nevertheless be significant due to the increased transmissibility of Omicron,” they wrote.\n\n“Nevertheless, Omicron appears to demonstrate lower disease severity for both vaccinated and unvaccinated individuals. While severity is likely to be reduced, the absolute number of hospitalizations and impact on the healthcare system is likely to be significant due to the large number of Omicron infections,” the study said.\n\nThe Canadian findings mirror those from the Centers for Disease Control and Prevention, or CDCE, which found that Americans are being hospitalized 50 percent less amid the spread of the omicron variant in comparison to previous strains which produced record-high hospitalizations a year ago.\n\n“Even though the rate of cases has more than tripled since Omicron emerged around Thanksgiving — earlier this week there were more than 1 million new cases diagnosed on a single day — just 3% of people with the virus are being admitted in hospitals, data from the CDC shows,” the Daily Wire reported.\n\nThe Oregon State University study is not the first to find that cannabis offers protection against the SARS-CoV-2 virus.\n\nIn August 2020, Canadian researchers found similar benefits, according to DW.com.\n\n“The results on COVID-19 came from our studies on arthritis, Crohn’s disease, cancer and others,” Dr. Igor Kovalchuck, a professor of Biological Sciences at the University of Lethbridge, noted in an email to DW.\n\nHe went on to emphasize that the cannabis utilized for the study isn’t the ‘garden variety’ that is used for recreational purposes.\n\n“Our varieties are high in CBD, or balanced CBD/THC, because you can give a higher dose and people will not be impaired due to the psychoactive properties of THC,” Kovalchuck explained.\n\nChris Albertyn, a Research Portfolio Lead at King’s College London and an expert on cannabinoids and dementia, indicated in an interview with DW.com that the Canadian research showed promise.\n\n“In this instance, the current research from Canada has just unveiled a potential therapeutic ‘mechanism of action’ but that would need to be validated and tested in well-designed, robust clinical trials before any meaningful clinical conclusions can be drawn,” he said.\n\nWhatever the case, this now-validated research proves that cannabis is a much safer alternative to vaccines found to contain unexplainable foreign objects.", "opengraph": {"title": "Another study finds that ingredients in cannabis block the virus that causes COVID-19", "type": "article", "url": "https://www.naturalmedicine.news/2022-01-14-another-study-finds-ingredients-in-cannabis-block-virus-causing-covid-19.html", "site_name": "Natural Medicine News", "description": "Researchers have uncovered a potential breakthrough in the non-vaccine-related treatment of COVID-19. According to a new report, two compounds found in cannabis have been found to block the SARS-CoV-2 virus, which leads to COVID-19, from penetrating healthy human cells, the Daily Wire noted. The two hemp compounds, cannabigerolic acid, or CBGA, and cannabidiolic acid, or CBDA, “were identified during […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/01/420-Addiction-Alternative-Background-Bud-Cannabis-Cbd.jpg"}, "tags": ["cannabis cures", "COVID", "vaccination", "Washington State Liquor and Cannabis Board", "covid-19", "healing", "natural health", "spike protein", "coronavirus", "stupid", "Washington", "Canada", "cannabis", "remedies", "Cures", "research", "Joints for Jabs", "Herbs", "vaccines"], "tweets": [], "movies": [], "links": ["https://www.dailywire.com/news/cannabis-prevents-covid-infection-in-lab-study", "https://fortune.com/2022/01/12/cannabis-compounds-stop-covid-virus-infecting-human-cells-lab-study/", "https://www.medrxiv.org/content/10.1101/2021.12.24.21268382v2.full.pdf", "https://www.dw.com/en/coronavirus-the-tide-is-coming-for-medicinal-cannabis/a-53371342", "http://www.cannabiscures.news", "https://www.naturalnews.com/2022-01-12-german-physicians-find-impurities-in-covid-vaccine.html", "https://www.naturalnews.com/2022-01-12-german-physicians-find-impurities-in-covid-vaccine.html", "https://www.dailywire.com/news/cannabis-prevents-covid-infection-in-lab-study", "https://www.dw.com/en/coronavirus-the-tide-is-coming-for-medicinal-cannabis/a-53371342"], "authors": [], "publish_date": null}