{"result_id": "211023", "URL": "https://www.naturalmedicine.news/2022-10-02-covid-vaccination-must-stop-says-renowned-cardiologist.html", "timestamp": "2023-04-25 16:27:55 CEST+0200", "meta": {"description": "A top cardiologist in the United Kingdom is calling for an immediate end to all further administration of Wuhan coronavirus (Covid-19) “vaccines” around the world. Dr. Aseem Malhotra, who has appeared numerous times in the media over the past year and a half to warn against the shots, now says the “evidence is overwhelming” that […]", "lang": "en", "keywords": "Aseem Malhotra,badhealth,badmedicine,Censored Science,COVID,goodhealth,goodmedicine,goodscience,medical violence,myocarditis,new evidence,pharmaceutical fraud,research,science deception,vaccination,vaccine,vaccine damage,Vaccine deaths,Vaccine injuries,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2022-10-02-covid-vaccination-must-stop-says-renowned-cardiologist.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "Covid vaccination must stop, says renowned cardiologist who previously promoted the jab", "cleaned_text": "Covid vaccination must stop, says renowned cardiologist who previously promoted the jab\n\nA top cardiologist in the United Kingdom is calling for an immediate end to all further administration of Wuhan coronavirus (Covid-19) “vaccines” around the world.\n\nDr. Aseem Malhotra, who has appeared numerous times in the media over the past year and a half to warn against the shots, now says the “evidence is overwhelming” that a “pause” on the injections is warranted.\n\nAny alleged benefits associated with the jabs simply do not outweigh the prolific risks, Malhotra revealed in a paper he authored that was published on September 26 in the Journal of Insulin Resistance. That work contains all of the latest evidence against the shots, which Malhotra calls the “smoking gun.”\n\nNow that we know both Pfizer and Moderna lied in their clinical trials, covering up the risk of serious adverse events, there is no question that the only right thing to do is to stop jabbing people straightaway.\n\nThose same Pfizer and Moderna trials, Malhotra revealed, also prove that the injections do not in any way reduce mortality or even severe disease as was claimed at the beginning of Operation Warp Speed. This means the shots are certifiably useless in terms of public health.\n\nNearly 100,000 people need to get “vaccinated” in order to maybe prevent one death from “covid”\n\nAn analysis of safety and effectiveness data in the United Kingdom that was conducted by the Health Advisory & Recovery Team made another important discovery worth noting.\n\nIn order to maybe save one life from “covid,” some 93,000 people or more, aged 18-29, would need to get jabbed. That is a lot of people risking myocarditis or worse, just so one individual might not die from the Fauci Flu.\n\nAccording to Malhotra, all of this and more substantially proves that the shots have absolutely no business getting injected into people’s bodies – and especially the bodies of young, developing children.\n\nMalhotra reportedly received the primary series of Pfizer’s messenger RNA (mRNA) injection back in January 2021. At the time, he was a supporter of the jab, appearing on the “Good Morning Britain” television program to promote it.\n\nAfter Malhotra’s father, Dr. Kailash Chand, suffered a cardiac arrest at his home about six months after receiving his Pfizer injections, Malhotra began to dig deeper into the matter, only to later change his mind about the shots.\n\n“The post-mortem showed two of Chand’s major arteries were severely blocked, even though Malhotra described his father as a fit person who didn’t have any significant heart problems,” reports The Epoch Times.\n\n“Malhotra began reading about post-vaccination issues, including a study abstract in the journal Circulation that identified a higher risk of a heart attack following vaccination with the Pfizer and Moderna vaccines and a study from Nordic countries that identified a higher risk of myocarditis.”\n\nThe Big Pharma-government industrial complex has tried to combat studies like this, claiming that myocarditis risk is much higher from covid than from the injections – but this claim is patently false.\n\n“I’ve always approached medicine and science with uncertainties because things constantly evolve. And the information I had at the time is completely different to the information I have now,” Malhotra told the Times.\n\n“And in fact, it is my duty and responsibility as the information has changed to act on that information. And that’s what I’m doing.”\n\nEven though Malhotra is a board member at the Journal of Insulin Resistance, he says his article went through a thorough independent peer review before publishing. He also has no financial ties to the journal.\n\n“I don’t think that there’s any validity to question the integrity of the piece,” he said. “People can argue I’ve got an intellectual bias. We all have intellectual biases, but there’s certainly no financial bias for me.”\n\nThe latest news about Fauci Flu shots can be found at ChemicalViolence.com.", "opengraph": {"title": "Covid vaccination must stop, says renowned cardiologist who previously promoted the jab", "type": "article", "url": "https://www.naturalmedicine.news/2022-10-02-covid-vaccination-must-stop-says-renowned-cardiologist.html", "site_name": "Natural Medicine News", "description": "A top cardiologist in the United Kingdom is calling for an immediate end to all further administration of Wuhan coronavirus (Covid-19) “vaccines” around the world. Dr. Aseem Malhotra, who has appeared numerous times in the media over the past year and a half to warn against the shots, now says the “evidence is overwhelming” that […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/10/Vaccination-Record-Card-Covid-19.jpg"}, "tags": ["vaccination", "science deception", "Vaccine deaths", "research", "COVID", "vaccine", "Aseem Malhotra", "medical violence", "myocarditis", "vaccine injury", "vaccines", "Vaccine injuries", "vaccine damage", "new evidence", "Censored Science", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/top-pro-vaccine-doctor-calls-for-global-pause-of-messenger-rna-covid-19-vaccines_4754871.html", "https://naturalnews.com/2021-12-03-mrna-vaccines-dramatically-increase-inflammatory-markers.html", "https://insulinresistance.org/index.php/jir/article/view/71/224", "http://chemicalviolence.com", "https://www.theepochtimes.com/top-pro-vaccine-doctor-calls-for-global-pause-of-messenger-rna-covid-19-vaccines_4754871.html", "https://naturalnews.com/2021-12-03-mrna-vaccines-dramatically-increase-inflammatory-markers.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2022-10-02-covid-vaccination-must-stop-says-renowned-cardiologist.html&linkname=Covid%20vaccination%20must%20stop%2C%20says%20renowned%20cardiologist%20who%20previously%20promoted%20the%20jab", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}