{"result_id": "211019", "URL": "https://www.naturalmedicine.news/2020-09-20-why-are-viruses-challenging-to-treat.html", "timestamp": "2023-04-25 16:27:51 CEST+0200", "meta": {"description": "There’s been a lot of talk in recent months about how the coronavirus pandemic will end. Some are putting their hopes on a vaccine, while others believe it would be enough to find an effective treatment for those who are hit with the more severe form of the disease. However, some experts are reminding us […]", "lang": "en", "keywords": "antibodies,coronavirus,covid-19,goodhealth,goodmedicine,goodscience,immunity,infections,influenza pandemic,outbreak,pandemic,vaccine,virus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2020-09-20-why-are-viruses-challenging-to-treat.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "Why are viruses so challenging to treat?", "cleaned_text": "Why are viruses so challenging to treat?\n\nThere’s been a lot of talk in recent months about how the coronavirus pandemic will end. Some are putting their hopes on a vaccine, while others believe it would be enough to find an effective treatment for those who are hit with the more severe form of the disease. However, some experts are reminding us that the real answer may be a lot closer to home because the human body is actually the best virus killer.\n\nUniversity of Southern California professor of medicine Paula Cannon said: “Our immune system is the world’s best drugmaker.” According to Cannon, it doesn’t matter whether you had measles when you were five or COVID-19 when you were 50; your immune system contains a large repository of potential antiviral approaches that protect you.\n\nShe said that antibodies are “biological drugs we make ourselves.” These infection-fighting proteins are made by the body to fight off any foreign invaders. The body can create millions of them, activating the perfect one for a particular virus and then mass producing it. It takes around 14 days for the immune system to conquer a virus, which is why most infections last for around two weeks. By that point, there are usually enough antibodies in the blood to stop the virus and neutralize it.\n\nHowever, once the threat has passed, these antibodies never drop back down to their initial low levels. They instead remain on guard in case the threat returns, at which point they can take care of it swiftly before you even get sick. That explains why you can only get most viruses once and will then be immune to them in the future.\n\nAlthough vaccines attempt to imitate this process, they don’t offer the same level of protection that you get from natural immunity. And treating viruses can also be challenging because viruses cannot survive on their own. This means they have to take over our cells in order to multiply. They become so interwoven with their host (our cells) that it is hard for a therapy to hurt one without damaging the other as well. In the case of SARS-CoV-2, it infects the lungs and airways we depend on to breathe and sustain life. Killing a person to kill the virus is clearly not an acceptable solution.\n\nResearchers at the University of Pittsburgh recently discovered an antibody that neutralizes the virus and could be used to create a drug therapy that works, but such therapies tend to be few and far between in the world of viruses and there is still a lot of work to be done on this particular potential treatment.\n\nDr. Raed Dweik, who is the chair of the Respiratory Institute at the Cleveland Clinic, said that because viruses can be so difficult to treat, prevention is critical. And while some take that to mean a vaccine, the truth is that we already have some effective ways of preventing COVID-19 — namely, washing your hands frequently, practicing social distancing, eating nutritious foods, and wearing a mask every time you are in a public place. All of these preventive measures come without the health dangers posed by a rushed vaccine that is injected into your bloodstream.\n\nThere’s another reason a COVID-19 vaccine isn’t the be-all, end-all that some people would like to believe it is. The unfortunate truth is that there are countless viruses floating around. While COVID-19 is noteworthy for its novelty and the dramatic foothold it has taken around the world, we have every reason to believe it is not the last new virus we will face.\n\n“The science tells us that this virus isn’t unique, it’s one of many that are circulating in animals that may spread to us,” said Dr. Dweik. “There is no reason to think this won’t happen again.”", "opengraph": {"title": "Why are viruses so challenging to treat?", "type": "article", "url": "https://www.naturalmedicine.news/2020-09-20-why-are-viruses-challenging-to-treat.html", "site_name": "Natural Medicine News", "description": "There’s been a lot of talk in recent months about how the coronavirus pandemic will end. Some are putting their hopes on a vaccine, while others believe it would be enough to find an effective treatment for those who are hit with the more severe form of the disease. However, some experts are reminding us […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2020/09/Coronavirus-Covid-19-Isolation-Quarantine.jpg"}, "tags": ["pandemic", "covid-19", "influenza pandemic", "outbreak", "vaccine", "infections", "coronavirus", "virus", "antibodies", "immunity"], "tweets": [], "movies": [], "links": ["https://www.usc.edu/", "https://www.pitt.edu/", "https://triblive.com/local/regional/researchers-isolate-antibody-that-could-prove-crucial-in-covid-19-treatment-and-prevention/", "https://newstarget.com/2020-09-16-fauci-admits-vitamins-c-d-minimize-risk-of-covid19-infection.html", "https://pandemic.news/", "https://www.bloomberg.com/news/articles/2020-09-14/when-will-there-be-a-covid-19-cure-viruses-are-tricky-foes?sref=jB82HHlm", "https://triblive.com/local/regional/researchers-isolate-antibody-that-could-prove-crucial-in-covid-19-treatment-and-prevention/"], "authors": [], "publish_date": null}