{"result_id": "211008", "URL": "https://www.naturalmedicine.news/2022-07-08-bryan-ardis-mark-sherwood-obesity-diabetes-covid.html", "timestamp": "2023-04-25 16:27:45 CEST+0200", "meta": {"description": "Off the bat during his July 6 appearance on Brighteon.TV‘s the “Dr. Ardis Show,” Dr. Mark Sherwood shared that he and his wife are advocating for proper food and nutrition for better health. They also deal with peptides, which is something that few people deal with daily. In their line of work, Sherwood shared that they give […]", "lang": "en", "keywords": "#nutrition,alternative medicine,blood sugar,Brighteon.tv,COVID,diabetes,diabetes cures,diet,Dr. Ardis Show,fight obesity,food cures,food is medicine,functional foods,functional healing,Mark Sherwood,natural health,natural medicine,Naturopathy,venom peptides", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2022-07-08-bryan-ardis-mark-sherwood-obesity-diabetes-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "Dr. Bryan Ardis talks with Dr. Mark Sherwood about obesity, diabetes and COVID – Brighteon.TV", "cleaned_text": "Dr. Bryan Ardis talks with Dr. Mark Sherwood about obesity, diabetes and COVID – Brighteon.TV\n\nOff the bat during his July 6 appearance on Brighteon.TV‘s the “Dr. Ardis Show,” Dr. Mark Sherwood shared that he and his wife are advocating for proper food and nutrition for better health.\n\nThey also deal with peptides, which is something that few people deal with daily. In their line of work, Sherwood shared that they give focus to emotional and spiritual health to lead people to a path of true healing. He said that many times, it is normal for them to see people come in with a disease that gets reversed.\n\nHowever, this isn’t the case for Big Pharma. Some people have revealed that there is an actual biological weapon that governments and large companies have been using – weaponized venom peptides that have been isolated to directly target specifically sick people. They were targeting Type 2 diabetics, and they’ve figured that there are specific venom peptides that target and destroy the bodies of diagnosed diabetics.\n\nSherwood said there are three races in the U.S., who have had the highest population percentage of deaths from the Wuhan coronavirus (COVID-19): Native Americans, Blacks and Hispanics. Coincidentally, these are the same races that have the highest percentage of diabetics.\n\nAn analysis of studies on COVID has found that the most researched and published terms that come in combination with COVID were diabetes and blood glucose. Recently, researchers also discovered that COVID-19 vaccines can cause diabetes. (Related: Researchers discover that COVID-19 vaccines cause Type 1 diabetes.)\n\nWhile people had been talking about COVID killing people, the massive number of deaths in the United States has actually come from self-inflicted wounds. (Related: American Diabetes Association caught pushing recipes containing ingredients that promote diabetes.)\n\nOne in three children is predicted to be a Type 2 diabetic on medication. In considering the whole American population, one in two are either diabetic or insulin resistant. People want to “get fixed,” but the western lifestyle is destroying the country. Most of the American population is either overweight or obese and it’s not okay, Sherwood said.\n\nFunctional healing is the new health restoration process\n\nStatistically, Sherwood said that by 2050, most of the American population may either be overweight or obese. With the human body not changing genetically in most of 10,000 years, it goes without saying that the human body is not designed to exist or prosper the way that humans are treating it now.\n\nSherwood, a naturopathic doctor, has been using “functional healing” to restore health. And the physical wellness that results from a healthy diet can extend to other areas of life. Sherwood also explained that while they are not promoting a plant-based diet, they are promoting a “real food” diet, which focuses on fruits, vegetables, nuts, lean meats and fish that are high in omega-3.\n\n“It’s extremely controversial,” Sherwood said of their approach. However, he and his wife are willing to accept negative criticisms for their approach to serious issues if this means they can get the public’s attention.\n\nLearn more about natural treatments for diabetes at DiabetesCure.news.\n\nWatch the video below and listen to more of Dr. Bryan Ardis’ conversation with Dr. Mark Sherwood about obesity, diabetes and COVID.\n\nCatch “The Dr. Ardis Show” with Dr. Bryan Ardis every Thursday at 10-11 a.m. on Brighteon.TV.\n\nDr. Mark Sherwood tells Clay Clark: Hearing Dr. Fauci’s voice is like having a nightmare with demonic influence – Brighteon.TV.\n\nDoctors Mark and Michele Sherwood: These seven pillars of health are the key to achieving good health – Brighteon.TV.\n\nDrs. Mark and Michele Sherwood: Federal government messes up Americans’ lives by subsidizing inflammatory foods – Brighteon.TV.", "opengraph": {"title": "Dr. Bryan Ardis talks with Dr. Mark Sherwood about obesity, diabetes and COVID – Brighteon.TV", "type": "article", "url": "https://www.naturalmedicine.news/2022-07-08-bryan-ardis-mark-sherwood-obesity-diabetes-covid.html", "site_name": "Natural Medicine News", "description": "Off the bat during his July 6 appearance on Brighteon.TV‘s the “Dr. Ardis Show,” Dr. Mark Sherwood shared that he and his wife are advocating for proper food and nutrition for better health. They also deal with peptides, which is something that few people deal with daily. In their line of work, Sherwood shared that they give […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/07/Diabetes-Highlighted.jpg"}, "tags": ["Dr. Ardis Show", "food is medicine", "alternative medicine", "blood sugar", "COVID", "fight obesity", "#nutrition", "Mark Sherwood", "diet", "diabetes", "natural medicine", "Brighteon.tv", "natural health", "functional foods", "diabetes cures", "food cures", "Naturopathy", "functional healing", "venom peptides"], "tweets": [], "movies": [], "links": ["https://brighteon.tv/home/", "https://www.brighteon.com/5883223f-40be-4611-ae3e-e5a42aa2a9d3", "http://biologicalweapons.news", "https://naturalnews.com/2022-06-30-researchers-covid-vaccines-cause-type-1-diabetes.html", "https://naturalnews.com/2017-07-17-american-diabetes-association-caught-pushing-recipes-containing-ingredients-that-promote-diabetes.html", "https://www.tulsapeople.com/tulsa-people/december-2019/tulsa-clinics-work-helps-create-fork-your-diet/article_25ae6b4a-113d-11ea-9639-5ba0c1c52fec.html", "http://DiabetesCure.news", "https://www.brighteon.com/5883223f-40be-4611-ae3e-e5a42aa2a9d3", "https://www.brighteon.com/channels/brighteontv", "https://naturalnews.com/2022-02-15-hearing-fauci-voice-like-nightmare-demonic-influence.html", "https://newstarget.com/2022-03-01-doctors-tackle-foundational-health-and-stress-management.html", "https://newstarget.com/2022-02-09-people-should-know-seven-pillars-of-health.html", "https://newstarget.com/2022-02-15-government-messing-with-americans-through-inflammatory-foods.html", "https://www.brighteon.com/5883223f-40be-4611-ae3e-e5a42aa2a9d3", "https://www.tulsapeople.com/tulsa-people/december-2019/tulsa-clinics-work-helps-create-fork-your-diet/article_25ae6b4a-113d-11ea-9639-5ba0c1c52fec.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2022-07-08-bryan-ardis-mark-sherwood-obesity-diabetes-covid.html&linkname=Dr.%20Bryan%20Ardis%20talks%20with%20Dr.%20Mark%20Sherwood%20about%20obesity%2C%20diabetes%20and%20COVID%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}