{"result_id": "211037", "URL": "https://naturalmedicine.news/2022-04-05-oriental-penthorum-compounds-promising-treatments-mrsa-infections.html", "timestamp": "2023-04-25 16:28:05 CEST+0200", "meta": {"description": "Methicillin-resistant Staphylococcus aureus (MRSA) remains difficult to treat due to its resistance to antibiotics. With this in mind, Chinese researchers looked into oriental penthorum (Penthorum chinense Pursh), a plant used in Traditional Chinese Medicine, to see whether it could be used to fight MRSA. More commonly known in China as guan huang cao, oriental penthorum is traditionally used by the Miao ethnic […]", "lang": "en", "keywords": "alternative medicine,antibacterial,Chinese medicine,goodhealth,goodmedicine,goodscience,herbal medicine,Herbs,mrsa,natural antibiotics,natural cures,natural medicine,phytonutrients,plant medicine,remedies,research,superbugs,TCM", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://naturalmedicine.news/2022-04-05-oriental-penthorum-compounds-promising-treatments-mrsa-infections.html", "encoding": "UTF-8"}, "image": null, "domain": "naturalmedicine.news", "title": "Compounds in oriental penthorum found to be promising treatments for MRSA infections", "cleaned_text": "Compounds in oriental penthorum found to be promising treatments for MRSA infections\n\nMethicillin-resistant Staphylococcus aureus (MRSA) remains difficult to treat due to its resistance to antibiotics. With this in mind, Chinese researchers looked into oriental penthorum (Penthorum chinense Pursh), a plant used in Traditional Chinese Medicine, to see whether it could be used to fight MRSA.\n\nMore commonly known in China as guan huang cao, oriental penthorum is traditionally used by the Miao ethnic minority as a functional food and folk medicine. The Miao prepare meals with young P. chinense leaflets and drink P. chinense wine to prevent alcohol hangover symptoms.\n\nClinically, P. chinense has also been used to treat hepatic viral diseases, including acute hepatitis viral infection, showing positive effects in such cases.\n\nA prior study had already demonstrated that P. chinense extract could inhibit the growth of certain bacteria, including Pseudomas aeruginosa, Staphylococcus epidermidis and S. aureus in vitro. However, little is known about which compounds from P. chinense exhibit antibacterial activity.\n\nTo address this, researchers from the Zhejiang Chinese Medical University investigated P. chinense to identify which of its components can treat MRSA infection. (Related: Cypress essential oil found to inhibit MRSA.)\n\nThe results of their study were published in the journal BMC Complementary and Alternative Medicine.\n\nTo identify the antibacterial compounds in P. chinense, the researchers dried the plant’s stems and turned them into powder. The powdered stem was then filtered and reflux extracted twice with a 1.5 liter (L) solution of 70 percent ethanol.\n\nTo prepare a pinocembrin-7-O residue-rich fraction from P. chinense (PGF), the crude extract was concentrated in a rotary vacuum evaporator, then fractionally extracted with petroleum ether, ethyl acetate, 1-butanol and water. All of the fractions were vacuum dried, and the concentration of flavonoids was determined through chromogenic reaction. In addition, pinocembrin-7-O residue components were identified using electrospray ionization mass spectrometry (ESI-MS).\n\nTo determine the antibacterial activities of PGF and isolated components, the researchers separately dissolved each in DMSO or ddH O (water-soluble fraction) before using them for susceptibility screening against bacterial strains. Susceptibility was recorded by measuring inhibition zone diameters (IZDs) resulting from growth inhibition. A microbroth dilution method was also used to determine the minimum inhibitory concentrations of PGF and the isolated compounds. Vancomycin was used as a positive control.\n\nThe researchers also conducted a kinetic time-kill experiment using two standard S. aureus strains – ATCC 25923 and ATCC 43300. As with the other tests, bacteria cultured in an equivalent volume of vancomycin was used as a positive control.\n\nCompounds from P. chinense extract can kill S. aureus and MRSA\n\nAfter extraction, the researchers found that PGF and three isolated components, namely, S1, S2 and S3, all demonstrated anti-S. aureus activities. They were also effective against clinically isolated MRSA strains. All four presented an identical MIC against the bacteria.\n\nMeanwhile, the time-kill assay showed that the bacterial S. aureus clones did not survive for 24 hours under PGF and S3 treatment, though the concentrations of each differed.\n\nFinally, they observed that PGF demonstrated post-antibiotic effects (PAE) against S. aureus. The researchers noted, however, that the PAE of PGF on certain strains was concentration-dependent.\n\nBased on these results, the researchers proposed that PGF and S3 from P. chinense were good candidates for the development of a bactericide against S. aureus. That said, they admitted that more research needs to be done and that the mechanisms by which these compounds work still need to be studied.", "opengraph": {"title": "Compounds in oriental penthorum found to be promising treatments for MRSA infections", "type": "article", "url": "https://www.naturalmedicine.news/2022-04-05-oriental-penthorum-compounds-promising-treatments-mrsa-infections.html", "site_name": "Natural Medicine News", "description": "Methicillin-resistant Staphylococcus aureus (MRSA) remains difficult to treat due to its resistance to antibiotics. With this in mind, Chinese researchers looked into oriental penthorum (Penthorum chinense Pursh), a plant used in Traditional Chinese Medicine, to see whether it could be used to fight MRSA. More commonly known in China as guan huang cao, oriental penthorum is traditionally used by the Miao ethnic […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/04/Colony-of-Staphylococcus-aureus-bacteria-causing-skin-infection.jpg"}, "tags": ["plant medicine", "alternative medicine", "research", "Chinese medicine", "natural medicine", "phytonutrients", "TCM", "Herbs", "mrsa", "remedies", "natural antibiotics", "superbugs", "antibacterial", "natural cures", "herbal medicine"], "tweets": [], "movies": [], "links": ["https://en.cnki.com.cn/Article_en/CJFDTotal-ZSFX201308079.htm", "https://www.zcmu.edu.cn/english/", "https://www.naturalnews.com/2019-02-01-cypress-essential-oil-inhibits-mrsa.html", "https://bmccomplementmedtherapies.biomedcentral.com/articles/10.1186/s12906-019-2632-3", "http://naturalantibiotics.news", "https://en.cnki.com.cn/Article_en/CJFDTotal-ZSFX201308079.htm", "https://bmccomplementmedtherapies.biomedcentral.com/articles/10.1186/s12906-019-2632-3", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2022-04-05-oriental-penthorum-compounds-promising-treatments-mrsa-infections.html&linkname=Compounds%20in%20oriental%20penthorum%20found%20to%20be%20promising%20treatments%20for%20MRSA%20infections", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}