{"result_id": "211002", "URL": "https://www.naturalmedicine.news/2021-01-27-medicinal-plants-in-ghana-to-treat-malaria.html", "timestamp": "2023-04-25 16:27:40 CEST+0200", "meta": {"description": "In this study, researchers at the Centre for Scientific Research into Plant Medicine in Ghana documented indigenous knowledge of medicinal plants used to treat malaria to facilitate the discovery of new candidate drugs. Their findings were published in the Journal of Medicinal Plants Research. Medicinal plants are widely used for the treatment of diseases, including malaria, in […]", "lang": "en", "keywords": "alternative medicine,disease treatments,environment,Ghana,goodmedicine,goodscience,herbal medicine,Herbs,Malaria,natural cures,natural medicine,plant conservation,plant medicine,remedies,research", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2021-01-27-medicinal-plants-in-ghana-to-treat-malaria.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "Identification of medicinal plants used in Ghana to treat malaria", "cleaned_text": "Identification of medicinal plants used in Ghana to treat malaria\n\nIn this study, researchers at the Centre for Scientific Research into Plant Medicine in Ghana documented indigenous knowledge of medicinal plants used to treat malaria to facilitate the discovery of new candidate drugs. Their findings were published in the Journal of Medicinal Plants Research.\n• Medicinal plants are widely used for the treatment of diseases, including malaria, in Ghanaian Traditional Medicine.\n• To find new sources of drugs, the researchers collected data about Ghanaian traditional plant medicines from 36 herbalists registered with the Ghana Federation of Traditional and Alternative Medicine (GHAFTRAM).\n• They used a well-structured questionnaire to facilitate data collection. Only answers from willing respondents were documented.\n• The researchers identified 42 different plant species belonging to 27 families as commonly used medicines by GHAFTRAM herbalists for malaria.\n• Among these plants, the use of the leaves was the most reported (41 percent), and all medicinal preparations were decoctions made by boiling plant parts.\n• About 93 percent of the interviewed herbalists collect plants from the wild, with 7 percent of those plants coming from their immediate surroundings (within 100 m of their homes).\n• Major threats to the availability of medicinal plants — as enumerated by the respondents — were farming activities (40 percent), bushfires (33 percent), over-harvesting (14 percent) and drought (13 percent).\n• Most of the herbalists (56 percent) reported uprooting whole plants when collecting medicinal plant parts.\n\nAccording to the researchers, their data suggest a need for conservation and sustainable harvesting strategies to conserve plant wealth in Ghana.\n\nRead the full study at this link.\n\nTonny A-A, Heron RB, Susana OM, Mary-Ann A, Frederick A, Alexis CS, Peter A-AJ, Daniel B, Jerry A-L, Alfred AA. ETHNOBOTANICAL STUDIES OF MEDICINAL PLANTS USED IN TRADITIONAL TREATMENT OF MALARIA BY SOME HERBALISTS IN GHANA. Journal of Medicinal Plants Research. 30 September 2019;13(16):370–383. DOI: 10.5897/jmpr2019.6779", "opengraph": {"title": "Identification of medicinal plants used in Ghana to treat malaria", "type": "article", "url": "https://www.naturalmedicine.news/2021-01-27-medicinal-plants-in-ghana-to-treat-malaria.html", "site_name": "Natural Medicine News", "description": "In this study, researchers at the Centre for Scientific Research into Plant Medicine in Ghana documented indigenous knowledge of medicinal plants used to treat malaria to facilitate the discovery of new candidate drugs. Their findings were published in the Journal of Medicinal Plants Research. Medicinal plants are widely used for the treatment of diseases, including malaria, in […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2021/01/Medicine-Plant-Alchemy-Alternative-Amphora-Ancient-Aroma.jpg"}, "tags": ["natural cures", "plant medicine", "disease treatments", "alternative medicine", "Malaria", "research", "natural medicine", "plant conservation", "Herbs", "environment", "remedies", "Ghana", "herbal medicine"], "tweets": [], "movies": [], "links": ["http://plantmedicine.news", "https://academicjournals.org/journal/JMPR/article-full-text/1DB3E7661842", "https://doi.org/10.5897/JMPR2019.6779"], "authors": [], "publish_date": null}