{"result_id": "211010", "URL": "https://naturalmedicine.news/2022-06-30-cherries-protect-against-heart-disease-diabetes-inflammation.html", "timestamp": "2023-04-25 16:27:46 CEST+0200", "meta": {"description": "Cardiovascular disease is the leading cause of death for both men and women in the United States, claiming more than 610,000 lives annually. Diabetes is another threat to public health, currently affecting 30.3 million Americans. According to the American Diabetes Association, diabetes was listed as an underlying or contributory cause in over 330,000 deaths in 2015. Fortunately, […]", "lang": "en", "keywords": "#nutrition,anthocyanins,anti-inflammatory,cardiovascular health,cherries,diabetes,food is medicine,Fresh,fruits,functional food,goodfood,goodhealth,heart disease,inflammation,natural health,nutrients,organics,prevention,recipes,superfoods", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://naturalmedicine.news/2022-06-30-cherries-protect-against-heart-disease-diabetes-inflammation.html", "encoding": "UTF-8"}, "image": null, "domain": "naturalmedicine.news", "title": "Study: Cherries can help fight heart disease, diabetes and other inflammatory diseases", "cleaned_text": "Study: Cherries can help fight heart disease, diabetes and other inflammatory diseases\n\nCardiovascular disease is the leading cause of death for both men and women in the United States, claiming more than 610,000 lives annually.\n\nDiabetes is another threat to public health, currently affecting 30.3 million Americans. According to the American Diabetes Association, diabetes was listed as an underlying or contributory cause in over 330,000 deaths in 2015.\n\nFortunately, there are superfoods like cherry that can help fight these diseases. In one scientific review, researchers reported that the anti-inflammatory benefits of cherries can help prevent life-threatening conditions like heart disease and diabetes.\n\nCherries are small stone fruits whose color vary from yellow to deep blackish-red. There are two major categories: Tart and sweet cherries, or Prunus cerasus L. and Prunus avium L., respectively. All cherry varieties are packed with nutrients like dietary fiber, vitamins and minerals.\n\nOne cup (154 grams) of sweet, raw, pitted cherries contains 97 calories, two grams of protein, 25 grams of carbs and three grams of fiber.\n\nThe same serving also contains:\n• Vitamin C – 18 percent of the Daily Value (DV)\n• Copper – five percent of the DV\n• Manganese – five percent of the DV\n\nAside from these, cherries contain vitamins B and K, copper, magnesium, manganese and polyphenols.\n\nAccording to research, cherries can help prevent heart disease because they contain high levels of anthocyanins and carotenoids. These natural plant pigments are responsible for the deep, vibrant color of cherries. They also have antioxidant, anti-inflammatory, anti-obesity and anti-diabetic properties.\n\nCherries are also rich in quercetin, an antioxidant flavonoid present in other superfoods like apples, grapes and onions. Quercetin scavenges harmful free radicals to protect healthy cells from oxidative damage.\n\nCherries are commonly used in Ayurveda and Traditional Chinese Medicine to treat arthritis and gout.\n\nAs early as 1950, researchers have discovered that consuming cherries can help reduce symptoms of arthritis and cause greater mobility in the joints. Research has also revealed that the anthocyanins in cherries suppress the production of inflammatory chemicals, such as COX1 and interleukin-18.\n\nIn a 2013 USDA study published in the Journal of Nutrition, researchers found that cherry consumption lowers inflammatory markers and can help reduce the risk of arthritis.\n\nAnother study reported that cherry juice’s anti-inflammatory effects can help improve muscle soreness and speed recovery from vigorous exercise. According to the findings, athletes who were given a tart cherry juice concentrate recovered strength more rapidly than those in the control group.\n\nIn a 2018 review published in the journal Nutrients, researchers analyzed 29 studies that tested both sweet and tart varieties of cherries in a variety of formulations, such as fresh cherries, powdered cherries, cherry concentrates and cherry juice.\n\nThey found that consuming cherries helped reduce known markers of oxidative stress and inflammation. They also found that cherries help relieve exercise-induced muscle soreness, improve arthritis pain and promote more restful sleep.\n\nIn addition, cherries can help reduce blood pressure, blood sugar, harmful VLDL (very low density) cholesterol and triglycerides levels.\n\nThese findings show that consuming cherries regularly can help promote better heart health and fight cardiovascular disease.\n\nCardiovascular disease is often caused by consuming too many toxic fats and processed sugars, the presence of too many environmental toxins in the body, nutritional deficiencies, a lack of antioxidants and not enough exercise.\n\nSeveral clinical studies show that cherry-enriched diets help lower levels of triglycerides, blood sugar and insulin. At the same time, they help increase HDL cholesterol levels, along with the antioxidant capacity of the blood. Researchers have found that a high antioxidant defense system lowers the risk of cardiovascular disease.\n\nStudies also show that drinking cherry juice helps reduce blood pressure. Cherry consumption has also been found to reduce C-reactive protein, an inflammatory marker often linked to a greater risk of cardiovascular disease.\n\nIn a 2006 study from the USDA’s Human Nutrition Research Center at the University of California, Davis, volunteers who consumed at least 45 fresh pitted cherries every day for four weeks had a 24 percent reduction in C-reactive protein, a change linked to a lower risk of cardiovascular disease.\n\nMany studies support the anti-diabetic effect of cherry consumption.\n\nThe anthocyanins in cherries can also help prevent diabetes by reducing insulin resistance and glucose intolerance while boosting insulin secretion. Anthocyanins do this by slowing glucose production, reducing glucose output from your liver and boosting blood sugar uptake.\n\nIn a 2008 study of diabetic women published in the journal Nutrition and Food Science, a research team reported that consuming 40 mL of tart cherry juice daily day for six weeks reduced HbA1C, a measure of blood sugar levels over time.\n\nIn a different study, results revealed that 600 mg of anthocyanins given daily to patients with diabetes for two months had a protective effect on blood vessels and helped prevent retinopathy, a known complication of diabetes.\n\nCherries can also help improve sleep quality. Tart cherries, in particular, are one of the best food sources of melatonin.\n\nMelatonin, or the “sleep hormone,” promotes restful sleep and regular circadian rhythms. It is also a powerful antioxidant that can help reduce oxidative damage and boost your immune health.\n\nIn one study, results showed that 20 volunteers who drank tart cherry juice concentrate for seven days experienced significant increases in melatonin levels, sleep duration and sleep quality compared to a group that consumed a placebo.\n\nCherries are a naturally sweet superfood that’s rich in beneficial compounds. Include cherries in a balanced diet to boost your heart health and fight inflammatory diseases.\n\nWatch the video below to know the seven health benefits of cherries.\n\nThis video is from the Natural News channel on Brighteon.com.\n\nLooking to lose weight? Add some cherries to your diet.", "opengraph": {"title": "Study: Cherries can help fight heart disease, diabetes and other inflammatory diseases", "type": "article", "url": "https://www.naturalmedicine.news/2022-06-30-cherries-protect-against-heart-disease-diabetes-inflammation.html", "site_name": "Natural Medicine News", "description": "Cardiovascular disease is the leading cause of death for both men and women in the United States, claiming more than 610,000 lives annually. Diabetes is another threat to public health, currently affecting 30.3 million Americans. According to the American Diabetes Association, diabetes was listed as an underlying or contributory cause in over 330,000 deaths in 2015. Fortunately, […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/06/Cherry-Fruit-Bunch-Stems.jpg"}, "tags": ["cardiovascular health", "cherries", "food is medicine", "diabetes", "anti-inflammatory", "Fresh", "nutrients", "prevention", "fruits", "inflammation", "functional food", "recipes", "natural health", "organics", "#nutrition", "heart disease", "anthocyanins"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/cardiovascular-disease-cherries-2848.html", "https://www.naturalpedia.com/cherries-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.healthline.com/nutrition/cherries-benefits#TOC_TITLE_HDR_2", "https://www.naturalpedia.com/quercetin-sources-health-benefits-and-uses.html", "http://prevention.news", "http://reverseheartdisease.news", "https://www.naturalpedia.com/cardiovascular-disease-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.ucdavis.edu/", "http://preventdiabetes.news", "https://heart.news/", "https://www.brighteon.com/0a5c5e41-59a4-4b11-928a-a5c9f39da720", "https://www.brighteon.com/channels/naturalnews", "https://naturalnews.com/2019-03-26-reverse-cardiovascular-disease-with-cherries.html", "https://naturalnews.com/2019-01-14-eating-cherries-can-help-prevent-gout-episodes.html", "https://naturalnews.com/2019-04-21-looking-to-lose-weight-add-some-cherries-to-your-diet.html", "https://www.naturalhealth365.com/cardiovascular-disease-cherries-2848.html", "https://www.healthline.com/nutrition/cherries-benefits#TOC_TITLE_HDR_2", "https://www.brighteon.com/0a5c5e41-59a4-4b11-928a-a5c9f39da720", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2022-06-30-cherries-protect-against-heart-disease-diabetes-inflammation.html&linkname=Study%3A%20Cherries%20can%20help%20fight%20heart%20disease%2C%20diabetes%20and%20other%20inflammatory%20diseases", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}