{"result_id": "211049", "URL": "https://www.naturalmedicine.news/2021-04-07-medicinal-plants-from-kenya-potent-anti-cancer-agents.html", "timestamp": "2023-04-25 16:28:13 CEST+0200", "meta": {"description": "Cancer is a life-threatening disease that’s considered to be a global burden. Besides its increasing prevalence, cancer is also the second leading cause of death around the world. According to a report by the World Health Organization (WHO), around 70 percent of cancer-related deaths occur in low- and middle-income countries. About one-third of these deaths are […]", "lang": "en", "keywords": "alternative medicine,anti-cancer,cancer solutions,cancer treatments,chalcone,goodcancer,goodhealth,goodmedicine,goodscience,herbal medicine,Herbs,Kenya,natural cures,natural medicine,phytonutrients,plant medicine,research", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2021-04-07-medicinal-plants-from-kenya-potent-anti-cancer-agents.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "These medicinal plants from Kenya contain potent anti-cancer agents", "cleaned_text": "These medicinal plants from Kenya contain potent anti-cancer agents\n\nCancer is a life-threatening disease that’s considered to be a global burden. Besides its increasing prevalence, cancer is also the second leading cause of death around the world.\n\nAccording to a report by the World Health Organization (WHO), around 70 percent of cancer-related deaths occur in low- and middle-income countries. About one-third of these deaths are linked to dietary and behavioral risks, such as high body mass index, lack of physical activity, tobacco and alcohol use, and low fruit and vegetable intake.\n\nIn less developed countries, liver and stomach cancers are the leading causes of cancer-related deaths among men, while cervical cancer remains the main cause among women. Although chemotherapy is the primary mode of treatment for such cancers, plant-based medicines are still used in rural areas where modern medicines and healthcare services are not as accessible.\n\nAfrica is rich in flora that is traditionally used as medicine. Many of the plants used to make African folk remedies have therapeutic properties that can be used to treat a wide variety of diseases. Phenolic compounds and terpenoids isolated from these plants have also shown selective cytotoxicity against many types of human cancer cells.\n\nIn a recent study, researchers from Kenya, Cameroon and Turkey evaluated the cytotoxicity of 11 naturally occurring compounds on human carcinoma cell lines and normal fibroblasts. These compounds included phenolics like chalcones and flavanones and diterpenoids like clerodane and trachylobane, which have previously been isolated from Kenyan medicinal plants.\n\nThe researchers reported their findings in an article published in the Journal of Ayurveda and Integrative Medicine.\n\nPlant compounds that can stop the proliferation of cancer cells are widely studied today because of their potential to replace chemotherapeutic drugs. Despite the effectiveness of some conventional anti-cancer agents, they often cause unwanted side effects, which make them intolerable for cancer patients in the long run.\n\nNaturally derived agents, on the other hand, cause fewer and relatively milder side effects (if any) while working just as effectively. (Related: Plumbagin, a compound present in carnivorous plants, has anticancer potential.)\n\nIn search of natural anti-cancer agents, the researchers examined the anti-cancer potential of six phenolics (four chalcones and two flavanones) and five terpenoids (three clerodane and two trachylobane diterpenoids) using six human carcinoma cell lines and normal human skin fibroblasts. They evaluated the cytotoxicity of the phytochemicals, as well as their effects on the activation of caspases and the production of reactive oxygen species (ROS). Both events are said to trigger apoptosis or programmed cell death.\n\nThe researchers found that the four chalcones and two trachylobane diterpenoids displayed half-maximal inhibitory concentration (IC50) values below 110 microMolar (uM) when tested on six cancer cell lines. The IC50 values of the most active compounds were between 6.30 uM and 46.23 uM against breast adenocarcinoma (MCF-7) cells and small lung cancer (A549) cells, respectively. In comparison, the IC50 values of doxorubicin, a chemotherapeutic drug, were between 0.07 uM and 1.01 uM against human mesothelioma cells (SPC212) and A549 cells, respectively.\n\nThe researchers also found that the chalcone, 2?,4?-dihydroxy-6?-methoxychalcone, can induce apoptosis in MCF-7 cells. But instead of activating caspases — the enzymes that regulate apoptosis — the compound induces cell death by increasing ROS production and mitochondrial membrane potential (MMP) depletion. The latter is associated with mitochondrial dysfunction, which is enough to trigger apoptosis. The chalcone caused a more than 3-fold increase in ROS production in MCF-7 cells.\n\nBased on these findings, the researchers concluded that chalcones derived from Kenyan medicinal plants can be used to develop novel anti-cancer drugs for the treatment of human carcinomas.", "opengraph": {"title": "These medicinal plants from Kenya contain potent anti-cancer agents", "type": "article", "url": "https://www.naturalmedicine.news/2021-04-07-medicinal-plants-from-kenya-potent-anti-cancer-agents.html", "site_name": "Natural Medicine News", "description": "Cancer is a life-threatening disease that’s considered to be a global burden. Besides its increasing prevalence, cancer is also the second leading cause of death around the world. According to a report by the World Health Organization (WHO), around 70 percent of cancer-related deaths occur in low- and middle-income countries. About one-third of these deaths are […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2021/04/Cancer-Apoptosis-Cell-3D-Animal-Background-Biology.jpg"}, "tags": ["plant medicine", "alternative medicine", "research", "natural medicine", "phytonutrients", "Herbs", "cancer treatments", "Kenya", "natural cures", "chalcone", "herbal medicine"], "tweets": [], "movies": [], "links": ["https://www.who.int/news-room/fact-sheets/detail/cancer", "https://naturalpedia.com/cervical-cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://science.news/2021-02-16-cytotoxicity-phenolic-compounds-human-carcinoma-cells.html", "https://naturalpedia.com/flavanones-sources-health-benefits-and-uses.html", "https://www.naturalnews.com/2019-05-24-plumbagin-in-carnivorous-plants-has-anticancer-potential.html", "https://www.sciencedirect.com/science/article/pii/S0975947617304175?via%3Dihub", "https://naturalpedia.com/breast-cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://naturalpedia.com/mesothelioma-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://link.springer.com/article/10.1023/A:1022945107762", "http://anticancer.news", "https://science.news/2021-02-16-cytotoxicity-phenolic-compounds-human-carcinoma-cells.html", "https://www.who.int/news-room/fact-sheets/detail/cancer", "https://www.sciencedirect.com/science/article/pii/S0975947617304175?via%3Dihub", "https://link.springer.com/article/10.1023/A:1022945107762"], "authors": [], "publish_date": null}