{"result_id": "211033", "URL": "https://www.naturalmedicine.news/2021-09-26-pha-argues-for-early-treatment-to-fight-covid-19.html", "timestamp": "2023-04-25 16:28:02 CEST+0200", "meta": {"description": "A newly formed group of physicians, the Pandemic Health Alliance insists on alternative ways of treating COVID-19. Instead of pointing to the vaccine as the most effective way to prevent death and disease, these medical doctors stress the importance of treating the virus early on, using effective medications such as ivermectin and hydroxychloroquine. (Article by Maike […]", "lang": "en", "keywords": "coronavirus,COVID,goodhealth,goodmedicine,goodscience,health,hydroxychloroquine,ivermectin,pandemic,Pandemic Health Alliance,prevention,treatment,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2021-09-26-pha-argues-for-early-treatment-to-fight-covid-19.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "New doctors’ group Pandemic Health Alliance argues for early treatment to fight COVID-19", "cleaned_text": "New doctors’ group Pandemic Health Alliance argues for early treatment to fight COVID-19\n\nA newly formed group of physicians, the Pandemic Health Alliance insists on alternative ways of treating COVID-19. Instead of pointing to the vaccine as the most effective way to prevent death and disease, these medical doctors stress the importance of treating the virus early on, using effective medications such as ivermectin and hydroxychloroquine.\n\nSpeaking with Steve Bannon, host of “War Room: Pandemic,” Dr. Robert Malone, Dr. Heather Gessling, and Dr. Ryan Cole explained that some 15 physicians met a few days ago in San Juan, Puerto Rico, to discuss their experiences with early treatment and with different early treatment protocols, as well as writing a manifesto. Malone is the president of this new Pandemic Health Alliance. Gessling successfully treated about 1,500 patients with COVID-19, none of whom died. She is the group’s medical director. Cole is the director of research.\n\n“We are here not to discuss the vaccine,” explained Malone, the original inventor of the mRNA technology. Instead they came together to defend “the freedom of physicians to practice.” Doctors are “being prevented from providing early treatments,” he said, referring to pharmacies blocking certain prescriptions. “We are in a situation where the government has seized control of the medical profession and this is causing death,” Malone continued.\n\nGessling later in the show explained that the doctors had “incredible success” with early treatment protocols “that have already been tried and have [been] found to work very well.” She said the world is dealing with a “pandemic of censorship” regarding ivermectin and hydroxychloroquine. “We are being shut down,” Gessling added. “We cannot even tell people what has worked.”\n\nThe Pandemic Health Alliance’s manifesto says the doctors wish to strengthen the doctor-patient-relationship. “The profession of medicine as we know is at a crossroad,” the manifesto reads. “There has been an unprecedented and intentional assault on our ability to care for our patients. Physicians, and all health care providers, must have the freedom to practice the art and science of medicine without fear of retribution, censorship, slander, and disciplinary action to include possible loss of licensure and hospital privileges, loss of insurance contracts and interference from government entities and organizations — all further preventing us from caring for patients in need.”\n\nThe manifesto laments that patients in Europe are being blocked from going to their physicians, unless they take the “high risk, duplicative vaccine.” And this takes place even if patients already acquired natural immunity.\n\nThe manifesto insists that the blocking of early treatments that is taking place right now in the United States is “sentencing high risk patients to death.”\n\nMalone described to Bannon the “unusual situation where the state imposes upon physicians certain treatments.” Cole showed that the current vaccines are not even helping to prevent the spread of the new delta variant: “Delta is spreading very fast, it is a wildfire.”\n\n“With early treatment, you could stop that,” he continued. He also pointed out that examples in India show that one can slow the spread of the delta variant with ivermectin “very effectively.”\n\nDr. Malone explained that ‘this is not an anti-vaccine statement.” “We are learning from physicians and their success in treating patients,” he said, adding that there exist a variety of successful early treatment protocols.\n\nThese physicians stress the fact that those who have received the vaccine still get infected with the delta variant, and that they, too, need early treatment. “We know that both the vaccinated and the unvaccinated wind up being in the hospital,” Malone said.\n\nHe said some of the treatments given in the hospitals, such as remdesivir, “are toxic and ineffective.”\n\nThe original inventor of the mRNA vaccine stated that it is important to try to “reach a broad group of physicians” in the United States.\n\nMalone observed that “we are being blocked” from publishing academic manuscripts focusing on drugs such as ivermectin. He told Bannon that a medical journal recently refused to publish a research paper on ivermectin, even though it had been pre-approved.\n\n“We hear this again and again,” he said. “We are in an unprecedented situation” where “experts are being blocked from presenting their findings.”\n\n“Thousands and thousands of patients are dying unnecessarily,” Malone said.\n\nThe Pandemic Health Alliance’s manifesto states that the physicians want to work as medical experts without interference from the government.\n\nCole pointed out that the vaccine was created for the original Wuhan strain of the coronavirus, but that this particular strain ended by early this year. Accordingly, the current vaccine is no longer up-to-date. “The vaccinated are going to get delta, and here the answer is: Don’t wait until they are at the death’s door, but treat them early,” Cole insisted.\n\n“What is the real science? Natural immunity, early treatment. Do not vaccinate everybody in the middle of a pandemic,” Cole said, adding, “‘Get a shot’ is not the solution.”\n\nMalone commented on President Joe Biden’s decision to force workers at companies with more than 100 employees to get vaccinated or tested regularly: “The government has gone full authoritarian here.”\n\nFor Cole, the current situation is a “1776” moment. “We are a free people, we are not the CCP, the Americans will fight back,” he said. “The emperor has no clothes.”\n\nMalone said “other nations are not taking this one approach that we have been pursuing here in the U.S., they are treating patients.” Therefore, the new Pandemic Health Alliances plans on “opening up channels of communications, so that physicians can speak with one another, see for themselves, what are the experiences, what are the outcomes.” But “unlike the government, we are not telling people what to do,” rather, “we can learn together as a clinical community.”\n\nAt the end of the manifesto, the Pandemic Health Alliance invites other physicians to join them in their effort to protect lives.\n\nClick HERE to read the full manifesto.", "opengraph": {"title": "New doctors’ group Pandemic Health Alliance argues for early treatment to fight COVID-19", "type": "article", "url": "https://www.naturalmedicine.news/2021-09-26-pha-argues-for-early-treatment-to-fight-covid-19.html", "site_name": "Natural Medicine News", "description": "A newly formed group of physicians, the Pandemic Health Alliance insists on alternative ways of treating COVID-19. Instead of pointing to the vaccine as the most effective way to prevent death and disease, these medical doctors stress the importance of treating the virus early on, using effective medications such as ivermectin and hydroxychloroquine. (Article by Maike […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2021/09/Covid-19-Montage-Vaccine-Syringe.jpg"}, "tags": ["pandemic", "health", "prevention", "treatment", "COVID", "vaccine", "ivermectin", "coronavirus", "hydroxychloroquine", "Pandemic Health Alliance"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/new-doctors-group-pandemic-health-alliance-argues-for-early-treatment-to-fight-covid-19/", "https://listen.warroom.org/e/episode-1257-%E2%80%93-from-rome-doctors-against-madness-w-dr-robert-malone-dr-heather-gessling-drryan-cole/", "https://rumble.com/vmgcc1-the-government-has-seized-control-of-the-medical-profession.html", "https://www.globalcovidsummit.org/", "https://rumble.com/vmge1f-we-have-a-pandemic-of-censorship-against-physicians.html", "https://www.globalcovidsummit.org/", "https://www.lifesitenews.com/news/new-doctors-group-pandemic-health-alliance-argues-for-early-treatment-to-fight-covid-19/"], "authors": [], "publish_date": null}