{"result_id": "211042", "URL": "https://www.naturalmedicine.news/2023-02-19-idaho-legislators-introduce-measure-criminalizing-covid-vaccines.html", "timestamp": "2023-04-25 16:28:09 CEST+0200", "meta": {"description": "The GOP-controlled Idaho legislature is taking the most radical step yet in regards to pushing back against the administration of increasingly risky, and some say even deadly, COVID-19 vaccines. As reported by KTVB7, “two Idaho lawmakers have introduced a bill to charge those who administer mRNA vaccines with a misdemeanor.” The House Health & Welfare Committee was […]", "lang": "en", "keywords": "adverse events,Big Pharma,chemical violence,covid vaccine,COVID-19 vaccine,Dangerous Medicine,falsified data,genocide,goodhealth,goodmedicine,health freedom,Idaho,Idaho lawmakers,medcial tyranny,medical violence,Moderna,mRNA,mRNA vaccines,Pfizer,Pfizer-BioNTech,pharma fraud,Republicans,science deception,transhumanism,vaccine ban,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2023-02-19-idaho-legislators-introduce-measure-criminalizing-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "Idaho legislators introduce measure criminalizing COVID vaccines throughout the state", "cleaned_text": "The GOP-controlled Idaho legislature is taking the most radical step yet in regards to pushing back against the administration of increasingly risky, and some say even deadly, COVID-19 vaccines.\n\nAs reported by KTVB7, “two Idaho lawmakers have introduced a bill to charge those who administer mRNA vaccines with a misdemeanor.”\n\nThe House Health & Welfare Committee was presented with HB 154, which was sponsored by Sen. Tammy Nichols, R-Middleton, and Rep. Judy Boyle, R-Midvale, on February 15. The bill prohibits individuals from providing or administering a vaccine that uses messenger ribonucleic acid (mRNA) technology for use in humans or animals within the state.\n\nDuring her presentation to the committee, Nichols explained that the bill would make it a misdemeanor for anyone to provide or administer mRNA vaccines for use in humans or animals in the state of Idaho. Nichols expressed concern about the speed with which the COVID-19 vaccines from Pfizer and Moderna were developed and the lack of liability, informed consent, or data on mRNA vaccines. However, she later clarified that her remarks were specific to the two COVID-19 vaccines.\n\n“I think there is a lot of information that comes out with concerns to blood clots and heart issues,” Nichols noted, per the outlet.\n\nDuring the hearing, Nichols’ statement that the vaccines were fast-tracked was questioned by Rep. Ilana Rubel, D-Boise, even though they clearly were; most vaccines take years to develop but the COVID jabs were rushed into arms in about a year under then-President Donald Trump’s “Operation Warp Speed” program. Rubel said the vaccines allegedly survived testing (which, again, was rushed, and negative results were hidden) and then eventually approved by the FDA.\n\n“There are other shots we could utilize that don’t have mRNA in it,” Nichols added. Messenger RNA (mRNA) vaccines are a type of vaccine that uses a small piece of genetic material called mRNA to stimulate an immune response in the body. The mRNA provides instructions for cells in the body to produce a protein that is found on the surface of a virus or bacteria, which triggers an immune response. This immune response allows the body to build up immunity to the virus or bacteria without actually causing an infection, according to John Hopkins Medicine. The COVID-19 vaccines developed by Pfizer-BioNTech and Moderna are examples of mRNA vaccines. In November 2021, the British Medical Journal published a report alleging data integrity issues with the clinical trials conducted for the COVID-19 vaccine from Pfizer and BioNTech. The report was based on information provided by a whistleblower and corroborated by others involved in the trial. The allegations included falsified data, unblinded patients, inadequately trained vaccinators, and delayed follow-up on adverse events. The whistleblower, a former regional director for Ventavia Research Group, supplied the BMJ with supporting documentation, including audio recordings, emails, and photos. Ventavia was contracted by the pharmaceutical companies to assist with the pivotal phase III trial. The whistleblower claimed that she repeatedly raised concerns about patient safety, data integrity, and poor lab management to superiors. She also reported her concerns to the FDA and was subsequently fired on the same day for being “not a good fit,” which she said was the first time she had been dismissed in her 20-year research career. Among the information provided to the journal by Jackson was a recording of a late September meeting in which she met with two directors of Ventavia to discuss a possible FDA inspection. One executive said to Jackson: “We’re going to get some kind of letter of information at least, when the FDA gets here … I know it.” A senior executive can also be heard in the recording explaining that the company could not quantify the number and types of errors that were being identified. “In my mind, it’s something new every day,” the individual said. “We know that it’s significant.”", "opengraph": {"title": "Idaho legislators introduce measure criminalizing COVID vaccines throughout the state", "type": "article", "url": "https://www.naturalmedicine.news/2023-02-19-idaho-legislators-introduce-measure-criminalizing-covid-vaccines.html", "site_name": "Natural Medicine News", "description": "The GOP-controlled Idaho legislature is taking the most radical step yet in regards to pushing back against the administration of increasingly risky, and some say even deadly, COVID-19 vaccines. As reported by KTVB7, “two Idaho lawmakers have introduced a bill to charge those who administer mRNA vaccines with a misdemeanor.” The House Health & Welfare Committee was […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2023/02/Covid-19-Coronavirus-Pfizer-Syringe-Vaccine-Vial.jpg"}, "tags": ["Idaho lawmakers", "Big Pharma", "pharma fraud", "medical violence", "Pfizer", "Idaho", "science deception", "Republicans", "chemical violence", "vaccine ban", "covid vaccine", "Pfizer-BioNTech", "falsified data", "COVID-19 vaccine", "mRNA vaccines", "medcial tyranny", "Moderna", "adverse events", "genocide", "vaccines", "transhumanism", "health freedom", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.ktvb.com/article/news/local/capitol-watch/idaho-lawmakers-introduce-legislation-to-criminalize-those-who-administer-covid-vaccines-legislature/277-2436a514-e7da-4b31-9762-f9be10300075", "https://naturalnews.com/2021-11-08-pfizer-falsified-covid-vaccine-data-trials.html", "https://naturalnews.com/2021-11-08-pfizer-falsified-covid-vaccine-data-trials.html", "https://www.ktvb.com/article/news/local/capitol-watch/idaho-lawmakers-introduce-legislation-to-criminalize-those-who-administer-covid-vaccines-legislature/277-2436a514-e7da-4b31-9762-f9be10300075", "https://naturalnews.com/2021-11-08-pfizer-falsified-covid-vaccine-data-trials.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2023-02-19-idaho-legislators-introduce-measure-criminalizing-covid-vaccines.html&linkname=Idaho%20legislators%20introduce%20measure%20criminalizing%20COVID%20vaccines%20throughout%20the%20state", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}