{"result_id": "211036", "URL": "https://www.naturalmedicine.news/2022-12-13-nepute-people-suffered-died-info-suppression-censorship.html", "timestamp": "2023-04-25 16:28:05 CEST+0200", "meta": {"description": "St. Louis chiropractor Dr. Eric Nepute believes that many people have died during the Wuhan coronavirus (COVID-19) pandemic because of the suppression and censorship of information. He made this claim during the Dec. 6 episode of the Brighteon.TV program “Lawfare with Tom Renz,” where he filled in for host and Ohio attorney Tom Renz. Nepute […]", "lang": "en", "keywords": "alternative medicine,badhealth,badmedicine,big government,Brighteon.tv,conspiracy,covid-19,Eric Nepute,ftc,health freedom,infections,medical censorship,medical fascism,Medical Tyranny,nutrients,outbreak,pandemic,prevention,supplements,suppressed,vitamin D,zinc", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2022-12-13-nepute-people-suffered-died-info-suppression-censorship.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "Dr. Eric Nepute: People suffered and died due to suppression and censorship of legitimate COVID treatments – Brighteon.TV", "cleaned_text": "Dr. Eric Nepute: People suffered and died due to suppression and censorship of legitimate COVID treatments – Brighteon.TV\n\nSt. Louis chiropractor Dr. Eric Nepute believes that many people have died during the Wuhan coronavirus (COVID-19) pandemic because of the suppression and censorship of information.\n\nHe made this claim during the Dec. 6 episode of the Brighteon.TV program “Lawfare with Tom Renz,” where he filled in for host and Ohio attorney Tom Renz. Nepute made the headlines after the Federal Trade Commission (FTC) slapped a $500 billion fine on him for promoting vitamin D and zinc against COVID-19.\n\nHe accused the federal government of suppressing his First Amendment right by shutting down his ability to talk about the benefits of zinc and vitamin D. Aside from the $500 billion penalty, Nepute said Washington shut down five of his bank accounts and made fraudulent statements against him. (Related: Dr. Eric Nepute facing $500B in FTC fines for promoting VITAMIN D3 and ZINC as COVID-19 treatments.)\n\nCiting remarks by researchers, the chiropractor said vitamin D could have potentially prevented the four million COVID-19 infections in 2020. Moreover, vitamin D could have prevented the death of 116,000 Americans in the same year.\n\n“Four million, that is an insane number,” Nepute said. “They suppressed and censored this information, and people suffered and died because of it.\n\nAccording to the chiropractor, there are 101 medical journal studies promoting the benefits of vitamin D against COVID-19. Meanwhile, over 70 studies show the benefits of zinc against the same disease.\n\n“Researchers have found in these studies that taking the appropriate amounts of zinc can reduce viral load and, in these cases, can actually reduce the death risk of COVID-19 by 40 percent,” he said.\n\n“Now, how many millions of cases of COVID-19 could we have prevented and how many millions of deaths could possibly be prevented globally if this information wasn’t suppressed and censored? How many people died because they lied, and how many people died because they suppressed the truth?”\n\nNepute went on to say that had politicians and doctors espoused the benefits of vitamin D, the high COVID-19 mortality rate among the population would have been prevented. Based on studies, 50 percent of the American population is deficient in vitamin D. This deficiency is bigger in African Americans with 82 percent of them lacking the “sunshine vitamin.”\n\nHe also criticized mainstream doctors, the National Institutes of Health and other authorities for not talking about the benefits of zinc. The mineral was a key pillar in the Zelenko protocol against COVID-19 invented by the late Dr. Vladimir “Zev” Zelenko.\n\n“This is the nail in the coffin. Vitamin D and zinc are game changers. That combination helps people reduce their infections, helps them reduce their viral load, helps their body live happier, healthier and more abundantly. They lied and people died,” Nepute said.\n\nThe host of “Real Talk with Dr. Eric Nepute” also blasted the “pandemic of the unvaccinated” as a lie, since more vaccinated individuals ended up sick and dying from COVID-19. He rebuked the Department of Health and Human Services and local health departments for continuing to lie about the COVID-19 vaccines by advertising on social media, television and radio to encourage people to get vaccinated.\n\nAccording to Nepute, the FTC and the Department of Justice should be going after those who were lying about and profiting from the COVID-19 vaccines, which is a direct violation of the COVID-19 Consumer Protection Act. The federal government and Big Tech colluded to suppress and censor the truth about COVID-19, he added.\n\nNepute concluded with a reminder and a warning – the Constitution is still the law of the land, and the government and its co-conspirators are going to have to pay for what they did.\n\nMedicalCensorship.com has more about the censorship of vitamin D and zinc as COVID-19 treatments.\n\nWatch the Dec. 6 episode of “Lawfare with Tom Renz” with Dr. Eric Nepute filling in below. “Lawfare with Tom Renz” airs every Tuesday at 11:30 a.m.-12 p.m. and Saturday at 12:30-1 p.m. on Brighteon.TV.\n\nStudy: Vitamin D reduces COVID-19 death risk by at least 25%\n\nEat these zinc-rich foods for better immune function amidst the COVID-19 pandemic\n\nFTC takes censorship to a whole new level, charges and fines St. Louis man for questioning vaccines, promoting zinc and vitamin D\n\nBig Tech censorship of vitamin D as covid treatment KILLED 116,000 Americans so far, warns the Health Ranger, who was banned by YouTube, Twitter and Facebook for telling the TRUTH", "opengraph": {"title": "Dr. Eric Nepute: People suffered and died due to suppression and censorship of legitimate COVID treatments – Brighteon.TV", "type": "article", "url": "https://www.naturalmedicine.news/2022-12-13-nepute-people-suffered-died-info-suppression-censorship.html", "site_name": "Natural Medicine News", "description": "St. Louis chiropractor Dr. Eric Nepute believes that many people have died during the Wuhan coronavirus (COVID-19) pandemic because of the suppression and censorship of information. He made this claim during the Dec. 6 episode of the Brighteon.TV program “Lawfare with Tom Renz,” where he filled in for host and Ohio attorney Tom Renz. Nepute […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/12/Business-Man-Censored-Tape-Mouth-Secrets.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "zinc", "alternative medicine", "outbreak", "supplements", "ftc", "covid-19", "Brighteon.tv", "medical censorship", "nutrients", "prevention", "Eric Nepute", "infections", "Medical Tyranny", "suppressed", "medical fascism", "health freedom", "vitamin D"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/81e3ece3-1207-40ce-9286-685bb2e03b7", "https://brighteon.tv", "https://www.theepochtimes.com/missouri-doctor-faces-500-billion-in-ftc-fines-for-promoting-vitamin-d3-during-pandemic_4865164.html", "https://naturalnews.com/2022-11-16-nepute-facing-fines-promoting-vitamin-d3-zinc.html", "https://coronavirusnutrients.com/", "http://medicalcensorship.com/", "http://www.brighteon.com/81e3ece3-1207-40ce-9286-685bb2e03b74", "https://brighteon.tv/", "https://naturalnews.com/2022-11-28-vitamin-d-reduces-covid-death-risk.html", "https://naturalnews.com/2020-05-19-boost-your-immunity-with-zinc-rich-foods.html", "https://naturalnews.com/2021-04-22-ftc-censorship-fines-man-for-questioning-vaccines-promoting-zinc-vitamin-d.html", "https://naturalnews.com/2020-09-24-vitamin-d-offers-significant-protection-from-covid-19.html", "https://censorship.news/2022-11-25-censorship-vitamind-covid-killed-116000-americans.html", "http://www.brighteon.com/81e3ece3-1207-40ce-9286-685bb2e03b74", "https://www.theepochtimes.com/missouri-doctor-faces-500-billion-in-ftc-fines-for-promoting-vitamin-d3-during-pandemic_4865164.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2022-12-13-nepute-people-suffered-died-info-suppression-censorship.html&linkname=Dr.%20Eric%20Nepute%3A%20People%20suffered%20and%20died%20due%20to%20suppression%20and%20censorship%20of%20legitimate%20COVID%20treatments%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}