{"result_id": "211031", "URL": "https://www.naturalmedicine.news/2021-05-09-is-pine-needle-tea-the-answer-to-covid-vaccine-shedding-suramin-shikimic-acid.html", "timestamp": "2023-04-25 16:28:01 CEST+0200", "meta": {"description": "Disclaimer: The information presented in this article and podcast are for informational purposes only. Nothing present here is intended to diagnose or treat any disease, and there are no supplements or products offered for sale in relation to this information. Word is spreading that pine needle tea may offer a solution against covid vaccine “shedding” […]", "lang": "en", "keywords": "Blood clots,COVID,covid vaccines,covid-19,Cures,extraction,Herbs,pandemic,pine needle tea,pine needles,plague,remedies,shikimic acid,spike proteins,star anise,suramin,vaccine shedding,vaccine transmission", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2021-05-09-is-pine-needle-tea-the-answer-to-covid-vaccine-shedding-suramin-shikimic-acid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "Is pine needle tea the answer to covid vaccine shedding / transmission? Learn about suramin, shikimic acid and how to make your own extracts", "cleaned_text": "Is pine needle tea the answer to covid vaccine shedding / transmission? Learn about suramin, shikimic acid and how to make your own extracts\n\nDisclaimer: The information presented in this article and podcast are for informational purposes only. Nothing present here is intended to diagnose or treat any disease, and there are no supplements or products offered for sale in relation to this information.\n\nWord is spreading that pine needle tea may offer a solution against covid vaccine “shedding” or transmission, which appears to be a phenomenon where vaccinated people are spreading harmful particles or substances to others around them. See this article from a WordPress blog site called “Ambassador Love.”\n\nThere is a potential antidote to the current spike protein contagion which is called Suramin. It’s found in many forests around the world, in Pine needles. Suramin has inhibitory effects against components of the coagulation cascade and against the inappropriate replication and modification of RNA and DNA. Excessive coagulation causes blood clots, mini-clots, strokes, and unusually heavy menstrual cycles.\n\nPine needle tea is one of the most potent anti-oxidants there is and it’s known to treat cancer, inflammation, stress and depression, pain and respiratory infections. Pine tea also kills parasites.\n\nBelow, find a full podcast and video that reveals two extraction methods, both of which are simple, low-tech, low-cost methods that can be used almost anywhere.\n\nFresh pine needles from appropriate trees have been used for centuries as sources of vitamin C and other phytochemicals that Native Americans used to treat respiratory infections and other ailments. Vitamin C is a known cure for scurvy, as scurvy is a disease of vitamin C deficiency. Pine needles contain many other substances that appear to reduce platelet aggregation in the blood, potentially preventing blood clots that lead to strokes, heart attacks and pulmonary embolism diagnoses. (See published science sources below.)\n\nPine needles have been used by indigenous populations around the world as both food and medicine for thousands of years. Many people now believe pine needles may be able to offer protection from covid spike proteins — which are engineered bioweapons found in covid vaccines — as well as covid vaccine “shedding” particles, which also appear to be biological weapons designed to achieve global depopulation.\n\nDr. Judy Mikovits asserts that globalists are well aware that pine needle tea is the answer to covid depopulation weapons, and they are secretly using pine needle tea to protect themselves from the very plague they have unleashed upon the world, Mikovitz explains.\n\nDigging into the science behind pine needles and covid\n\nAs a published laboratory scientist, I decided to dig into this question with the help of my laboratory knowledge and experience. Boiling fresh pine needles in order to make a tea is an extraction method that’s commonly used in food science as well as Traditional Chinese Medicine (TCM).\n\nWater acts as a solvent, and through heat and time, some phytochemicals in the pine needles are extracted into the water, making a pine needle tea. (This is how all tea is made.)\n\nAs I poured over the published science research on this topic, I had two primary questions:\n\n1) What molecules are found in pine needles, and what are their functions in relation to halting blood clots or protecting the unvaccinated from covid vaccine shedding?\n\n2) What is the best extraction method to pull these molecules out of pine needles? Is there a low-tech extraction method that almost anyone can use, without needing a laboratory?\n\nThrough research, I found that pine needles not only contain suramin, a large molecule that’s touted for various medicinal effects, but also shikimic acid.\n\nShikimic acid is the basis for Tamiflu, and it’s the molecule found in Chinese Medicine herb Star Anise, that cures plagues\n\nImagine my surprise when I discovered that pine needles contain shikimic acid, the same molecule found in Star Anise herb used in Traditional Chinese Medicine to treat plagues and respiratory illness.\n\nThe Boston Herald published a story in 2010 that revealed researchers were studying extraction techniques to harvest shikimic acid from pine needles in order to provide this raw material to the pharmaceutical industry to manufacture anti-viral, anti-flu, anti-pandemic prescription medicines. From that story:\n\nResearchers at the University of Maine at Orono say they’ve found a new and relatively easy way to extract shikimic acid — a key ingredient in the drug Tamiflu — from pine tree needles.\n\nShikimic acid can be removed from the needles of white pine, red pine and other conifer trees simply by boiling the needles in water, said chemistry professor Ray Fort Jr.\n\nBut the extracted acid could be valuable because Tamiflu is the world’s most widely used antiviral drug for treating swine flu, bird flu and seasonal influenza. The major source of shikimic acid now is the star anise, an unusual star-shaped fruit that grows on small trees native to China.\n\nThe research has been funded from a variety of sources, including the Maine Technology Institute, the U.S. Department of Agriculture, the National Science Foundation and the university’s chemistry department.\n\nOne study published in ResearchGate confirms that shikimic acid offers antiplatelet-aggregating activity, meaning it helps halt blood clots: Content Analysis of Shikimic Acid in the Masson Pine Needles and Antiplatelet-aggregating Activity.\n\nShikimic acid, when separated by HPLC, exhibited a dose-dependent inhibitory effect on platelet aggregation induced by adenosine diphosphate and collagen in rabbits. Because of the relative high content and good antiplatelet-aggregating activity of shikimic acid, the Masson pine needles can be used as a potential source of shikimic acid.\n\n…achieved about a 6% yield of shikimic acid from Masson pine needles, which is possibly the highest extracted yield from any pine species till now (Chen et al. 2014). Since pine needles are inexpensive and readily available in North Asia, North America, and Europe, there is a strong possibility to utilize them as a drug manufacturer against less available star anise species\n\nThat study found that pine needles provide about two-thirds the shikimic acid of star anise herb:\n\nSo we know that pine needles, which are extremely common across North America, China and Europe, provide shikimic acid, a kind of “miracle” molecule that may prove incredibly useful for halting blood clots and defending people from respiratory infections.\n\nFurther research led me to a study that used neural networking research to optimize the extraction conditions in order to carry out a highly efficient extract from pine needles: 17 Optimization of Extraction Conditions of Shikimic Acid in Pine Needles Based on Artificial Neural Network.\n\nThat study offers the following recipe for extraction optimization:\n• Use roughly 75% alcohol (such as vodka) and 25% water\n• Use an ultrasonic cleaning machine with a stainless steel vessel\n• Set the temperature to 65 degrees C.\n• Use 280 mL of extraction solution for every 10 grams of pine needles\n• Use a duration of 25 minutes for the ultrasonic extraction\n\nThis finished “tea” should be filtered through a coffee filter or other paper filter in order to remove large particles. The resulting liquid will contain shikimic acid, suramin, pigments and various terpenes, and will typically show some coloration and have a rather pungent taste.\n\nWatch this video to see how I used an ultrasonic cleaning machine to create a water extract of rosemary herb:\n\nHow to extract shikimic acid using a common espresso machine\n\nThe most exciting finding in this research was discovering a published science paper that describes using a common espresso machine to carry out a highly efficient extraction of shikimic acid from star anise herb.\n\nThat paper is published in Science Direct: Total quantification and extraction of shikimic acid from star anise (llicium verum) using solid-state NMR and cellulose-dissolving aqueous hydroxide solutions.\n\nThe paper was published in Organic Letters in 2015, and also appears as a PDF at the University of Oregon website. (This link may be problematic in some browsers because it contains spaces in the URL).\n\nFrom the abstract of that study:\n\nABSTRACT: A new, practical, rapid, and high-yielding process for the pressurized hot water extraction (PHWE) of multigram\n\n quantities of shikimic acid from star anise (Illicium verum) using an unmodified household espresso machine has been developed.\n\n This operationally simple and inexpensive method enables the efficient and straightforward isolation of shikimic acid and the facile\n\n preparation of a range of its synthetic derivatives.\n\nIn other words, they are taking advantage of the pressurized chamber of an espresso machine to conduct a heat + pressure extraction of shikimic acid from star anise.\n\nIn my experience, the star anise herb can be replaced with ground fresh pine needles (green, not brown) to achieve a similar result, extracting shikimic acid from pine needles. To support efficient extraction, you would want to grind the pine needles first, using a low-cost herb grinder.\n\nI intend to reproduce this result in my own lab, but thought that I should share this publicly as soon as possible due to the deadly threat currently posed to humanity from the weaponized covid vaccines.\n\nThe study authors further confirm that shikimic acid shows efficacy as an antiviral molecule that also inhibits viral replication in the body:\n\nShikimic acid derivatives have also been shown to exhibit useful biological activity. Most notably, the well-known antiviral drug oseltamivir (Tamiflu), which acts as a viral neuraminidase inhibitor, is used to treat seasonal influenza and has been deployed during H1N1 influenza outbreaks.\n\nFurthermore, fluorinated shikimate analogues have been shown to inhibit P. falciparum and have been tested as antimalarial drugs. In addition, shikimic acidderived (?)-zeylenone (3) displays anticancer, antiviral and antibiotic behavior, and triacetylshikimic acid exhibits\n\n anticoagulant and antithrombotic activity.\n\nNotice the key term “anticoagulant” in the sentence above.\n\nThe study, which was carried out in Tasmania, Australia, deliberately sought a low-cost, low-tech method of extracting shikimic acid from common botanicals (pine needles):\n\n[This method is a] low cost, rapid, pressurized hot water extraction (PHWE)… the first example of the laboratory use of a simple\n\n espresso machine to facilitate the extraction of natural products (other than caffeine) from plant material.\n\nWe sought to specifically utilize relatively cheap, unsophisticated, and commercially available equipment to achieve the extraction of multigram quantities of star anise.21 Consequently, given that the pump in an espresso machine enables the continuous flow of water at temperatures up to 96 °C and at pressures of typically 9 bar, we believed that such a system would be suitable for our purposes.\n\nIndeed, this idea is pure genius in its simplicity. And the study authors were able to extract and then purify shikimic acid crystals through a relatively simple process.\n\nThis may mean the “cure” for covid is freely available and grows across many continents\n\nThe upshot of all this is that a possible “cure” for covid — or at least a defense against covid shedding / transmission — appears to be already provided by Mother Nature and is readily available across multiple continents.\n\nWithout having to rely on patented, controlled pharmaceuticals and weaponized vaccines that are clearly designed to spread disease and achieve global depopulation through mass death, people who want to survive the covid vaccine holocaust can simply harvest and process pine needles using espresso machines, and they can potentially make their own anti-plague medicine.\n\nNaturally, we would like to see more research on all this — and please heed the safety precautions below — but it’s clear the science & medicine establishment has lost all credibility or interest in protecting humanity and is now deliberately working to exterminate billions of human beings. Thus, waiting for that industry to study common medicinal plants is a fool’s errand. There will never be funding available for such research, as these findings don’t enhance Big Pharma’s vaccine and drug profits.\n\nYet for those who are able to access the correct types of pine needles — and who aren’t pregnant or expecting to be pregnant, see below — this simple, natural remedy may ultimately prove to be a “miracle” treatment that saves lives from both covid and covid vaccines.\n\nFor the record, we don’t sell pine needles or pine needle extracts, so regulators looking to ban this article will have to go harass someone else. We offer this information as-is, without warranty, in the interests of “emergency authorization publication” for the benefit of humanity and with the intention of saving lives from the deadly vaccine.\n\nListen to my full podcast here to learn even more about this exciting topic and possible remedy against covid vaccines:\n\nBefore you consume any tea or extract made from plants, be sure you know what plants you’re using. Not all pine trees are suitable, and some conifers — such as yew trees — are toxic.\n\nCattle have been widely known to experience spontaneous abortions when consuming fresh pine needles as a food source, so anyone expecting to become pregnant (or already pregnant) should obviously avoid consuming pine needle tea, just as a precaution.\n\nThe entire “woke” science morons in America and around the world have forgotten that only women can get pregnant, so this particular precaution obviously does not apply to men. If you think men can get pregnant, you may have already suffered cognitive damage from covid vaccines and should seek immediate medical care.\n\nNorfolk Island Pine and Ponderosa Pine trees are also believed to cause spontaneous abortions and should likely be avoided. We don’t know the full composition of various pine species, so we cannot in good conscience tell anyone to drink any tea made from pine needles. Should you choose to do so, exercise common sense and all necessary precaution, and work with a qualified naturopath to design an herbal strategy that’s compatible with your own biology and particular health goals.\n\nAlso be aware pine needle tea may interact in unexpected ways with prescription medications, most of which are toxic all by themselves.\n\nWe are going to confirm this extraction process using an espresso machine and a single quad mass spec instrument at CWC Labs\n\nThe good news in all this is that it appears everyday people can harvest shikimic acid from pine needles using a common espresso machine. Or, for a more thorough extraction of a broad spectrum of terpenes, people can use an ultrasonic clear to achieve such extractions (see my video above).\n\nAs a public service, I am now in the process of initiating a laboratory project in my private lab to reproduce this shikimic acid extraction method, but using pine needles instead of star anise herb:\n• We are purchasing shikimic acid standards and researching an HPLC / Mass spec method for quantitation of shikimic acid.\n• We are purchasing a simple herb grinder and a clean, new espresso machine to test the extraction.\n• When completed, we plan to release a video from our lab, showing you the results of our extraction attempts.\n\nWe are likely going to be using loblobby pine needles, as that’s what’s common in the central Texas area. I do not know the shikimic acid content of loblobby pines.\n\nStay tuned to NaturalNews.com and my Brighteon.com channel for more updates on this hugely important topic for humanity:\n\nAnd thank you for all your support that allows us the funding necessary to pursue this research for humanity.", "opengraph": {"title": "Is pine needle tea the answer to covid vaccine shedding / transmission? Learn about suramin, shikimic acid and how to make your own extracts", "type": "article", "url": "https://www.naturalmedicine.news/2021-05-09-is-pine-needle-tea-the-answer-to-covid-vaccine-shedding-suramin-shikimic-acid.html", "site_name": "Natural Medicine News", "description": "Disclaimer: The information presented in this article and podcast are for informational purposes only. Nothing present here is intended to diagnose or treat any disease, and there are no supplements or products offered for sale in relation to this information. Word is spreading that pine needle tea may offer a solution against covid vaccine “shedding” […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/05/pine-needle-tea-covid-vaccines-suramin-shikimic-acid.png"}, "tags": ["extraction", "pandemic", "covid vaccines", "covid-19", "pine needle tea", "pine needles", "COVID", "spike proteins", "plague", "star anise", "Blood clots", "Herbs", "remedies", "shikimic acid", "suramin", "Cures", "vaccine transmission", "vaccine shedding"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2021-05-07-salk-institute-reveals-the-covid-spike-protein-causing-deadly-blood-clots.html", "https://ambassadorlove.wordpress.com/2021/05/06/pine-tea-possible-antidote-for-spike-protein-transmission/", "http://archive.boston.com/news/local/massachusetts/articles/2010/11/07/maine_pine_needles_yield_valuable_tamiflu_material/", "https://www.researchgate.net/publication/277348748_Content_Analysis_of_Shikimic_Acid_in_the_Masson_Pine_Needles_and_Antiplatelet-aggregating_Activity", "https://onlinelibrary.wiley.com/doi/epdf/10.1002/ceat.200700413", "https://www.sciencedirect.com/science/article/abs/pii/S2352554116300493", "https://pages.uoregon.edu/chendon/coffee_literature/2015 Org. Lett., Shikimic acid extraction from anise using espresso machine.pdf", "http://Brighteon.com/7c129e86-7e2b-47a7-bc74-dd19621e4042", "https://www.brighteon.com/channels/hrreport", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2021-05-09-is-pine-needle-tea-the-answer-to-covid-vaccine-shedding-suramin-shikimic-acid.html&linkname=Is%20pine%20needle%20tea%20the%20answer%20to%20covid%20vaccine%20shedding%20%2F%20transmission%3F%20Learn%20about%20suramin%2C%20shikimic%20acid%20and%20how%20to%20make%20your%20own%20extracts", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}