{"result_id": "211007", "URL": "https://naturalmedicine.news/2019-02-23-natural-treatments-are-catching-on-people-prefer-healthy-lifestyle.html", "timestamp": "2023-04-25 16:27:43 CEST+0200", "meta": {"description": "When it comes to addressing health problems, there are two general paths you can take: the conventional medical approach or the natural route. In the past, many people believed natural treatments couldn’t possibly be as effective as the medications prescribed by doctors, but that attitude appears to be shifting as more and more research highlights […]", "lang": "en", "keywords": "Dangerous Medicine,diabetes,diet,exercise,goodhealth,goodmedicine,healthy lifestyle,healthy living,lifestyle,natural health,natural medicine,natural remedies,Naturopathy,pre-diabetes,prevention,Type 2 Diabetes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://naturalmedicine.news/2019-02-23-natural-treatments-are-catching-on-people-prefer-healthy-lifestyle.html", "encoding": "UTF-8"}, "image": null, "domain": "naturalmedicine.news", "title": "Natural treatments are catching on: 81% of people prefer a healthy lifestyle over drugs, according to study", "cleaned_text": "Natural treatments are catching on: 81% of people prefer a healthy lifestyle over drugs, according to study\n\nWhen it comes to addressing health problems, there are two general paths you can take: the conventional medical approach or the natural route. In the past, many people believed natural treatments couldn’t possibly be as effective as the medications prescribed by doctors, but that attitude appears to be shifting as more and more research highlights the efficacy and safety of these treatments. In fact, a new survey has found that an overwhelming majority of people prefer a healthy lifestyle over drugs when it comes to diabetes management.\n\nIn a Liva Healthcare poll of people with type 2 diabetes, 81 percent of respondents said they would rather improve their diet and exercise before turning to prescription medications. Doctors agree, although not to quite the same extent; 54 percent said they’d rather treat the condition with lifestyle changes like regular exercise and weight loss. Of course, there’s a financial incentive for prescribing drugs that may explain the smaller margin, but the preference toward natural still exists.\n\nNHS Consultant Cardiologist and Evidence-Based Medicine Professor Dr. Aseem Malhotra said that type 2 diabetes management is “upside down” right now and that expensive blood glucose management drugs are failing to get to the disease’s root cause.\n\nHe also pointed out the many side effects of diabetes medication, which he says can have an impact on a person’s quality of life while doing nothing to prolong their lifespan.\n\nWhen it comes to natural treatments, he says the results speak for themselves: “The good news is that, with my patients, I have found that the condition is reversible in up to 60% of patients. The best results come within a year of pure dietary changes that specifically cut out added sugar and processed carbohydrate foods.”\n\nIt isn’t surprising that diet and exercise can be so effective in fighting diabetes when you consider the fact that poor diet and low activity are often factors in people developing the disease in the first place. The Third National Health and Nutrition Examination Survey carried out by the U.S. government found that among those with type 2 diabetes, 69 percent did not exercise regularly or at all, 62 percent consumed five servings of vegetables and fruits per day or less, and 82 percent were obese or overweight.\n\nMoreover, natural treatments and lifestyle changes have proven their value in staving off the disease. Prediabetics who engaged in 150 minutes per week or more of a physical activity with the intensity of brisk walking noted a 58 percent lower risk of going on to develop diabetes, which is more than twice the 31 percent risk reduction noted by those taking metformin.\n\nA study published in Diabetes Care found that taking 1,500 milligrams of curcumin daily over nine months was 100 percent effective in preventing prediabetics from later developing full-blown type 2 diabetes, while 16.4 percent of those in a placebo group developed it.\n\nThere’s also the fact that healthy lifestyle choices can help people with diabetes live longer. Adults with diabetes are four times more likely to die of heart disease than non-diabetics, but a study published in the Journal of the American College of Cardiology found that exercising regularly, reducing alcohol consumption, avoiding smoking and eating a high-quality diet were associated with a 50 percent reduction in the risk of cardiovascular and coronary heart disease and a 66 percent lower risk of dying from cardiovascular disease or stroke among diabetics.\n\nThere really is no good reason not to make healthy lifestyle changes if you’re diabetic or you have pre-diabetes. Even if you are taking medication, the life-extending benefits are simply too good to pass up.", "opengraph": {"title": "Natural treatments are catching on: 81% of people prefer a healthy lifestyle over drugs, according to study", "type": "article", "url": "https://www.naturalmedicine.news/2019-02-23-natural-treatments-are-catching-on-people-prefer-healthy-lifestyle.html", "site_name": "Natural Medicine News", "description": "When it comes to addressing health problems, there are two general paths you can take: the conventional medical approach or the natural route. In the past, many people believed natural treatments couldn’t possibly be as effective as the medications prescribed by doctors, but that attitude appears to be shifting as more and more research highlights […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/05/Age-Woman-Diet-Eating-Fruit-Mid-Middle.jpg"}, "tags": ["lifestyle", "diet", "diabetes", "natural remedies", "prevention", "exercise", "healthy lifestyle", "natural medicine", "natural health", "healthy living", "Type 2 Diabetes", "pre-diabetes", "Naturopathy"], "tweets": [], "movies": [], "links": ["https://www.diabetes.co.uk/news/2018/dec/report-shows-people-with-type-2-diabetes-favour-lifestyle-changes-over-medication-90164779.html", "http://science.naturalnews.com/diabetes.html", "https://www.mindbodygreen.com/0-8178/why-a-natural-approach-to-treating-type-2-diabetes-beats-medicine.html", "https://www.naturalnews.com/2018-05-16-turmeric-is-an-ideal-drug-alternative-for-treating-type-2-diabetes.html", "http://www.onlinejacc.org/content/71/25/2867", "http://diabetessciencenews.com/", "https://www.diabetes.co.uk/news/2018/dec/report-shows-people-with-type-2-diabetes-favour-lifestyle-changes-over-medication-90164779.html", "https://www.naturalnews.com/2018-05-16-turmeric-is-an-ideal-drug-alternative-for-treating-type-2-diabetes.html", "https://www.mindbodygreen.com/0-8178/why-a-natural-approach-to-treating-type-2-diabetes-beats-medicine.html", "http://www.onlinejacc.org/content/71/25/2867", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2019-02-23-natural-treatments-are-catching-on-people-prefer-healthy-lifestyle.html&linkname=Natural%20treatments%20are%20catching%20on%3A%2081%25%20of%20people%20prefer%20a%20healthy%20lifestyle%20over%20drugs%2C%20according%20to%20study", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}