{"result_id": "211014", "URL": "https://www.naturalmedicine.news/2021-11-23-200-million-americans-may-want-to-consider-covid-19-vaccine-detox.html", "timestamp": "2023-04-25 16:27:49 CEST+0200", "meta": {"description": "In order to maintain proper mitochondrial health, supply the body with appropriate nutrients, boost the immune system and keep the blood from clotting, over 200 million Americans may want to consider the advice of Dr. Gerald H. Smith, who may be able to assist with a natural detoxification regimen for all these foreign toxins the […]", "lang": "en", "keywords": "#nutrition,Cordyceps,covid detox,covid vaccine detox,curcumin,Cures,detox,Dr. Gerald Smith,Glutathione,goodhealth,integrative medicine,natural health,remedies,spike protein,Vaccine Detox,vax detox", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.naturalmedicine.news/2021-11-23-200-million-americans-may-want-to-consider-covid-19-vaccine-detox.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalmedicine.news", "title": "VAX DETOX: 200 Million Americans may want to consider pursuing a Covid-19 vaccine detoxification program while avoiding all boosters like the plague", "cleaned_text": "VAX DETOX: 200 Million Americans may want to consider pursuing a Covid-19 vaccine detoxification program while avoiding all boosters like the plague\n\nIn order to maintain proper mitochondrial health, supply the body with appropriate nutrients, boost the immune system and keep the blood from clotting, over 200 million Americans may want to consider the advice of Dr. Gerald H. Smith, who may be able to assist with a natural detoxification regimen for all these foreign toxins the Covid jabs are spreading throughout the body.\n\nThe author of the Covid-19 vaccine detoxification regimen, Dr. Gerald H. Smith, is certified by the World Organization for Natural Medicine to practice natural medicine globally, and he’s also a certified dental practitioner. His broad base of post-graduate training in natural medicine and dentistry helps him integrate an array of vital health care specialties.\n\nUsing enzymes to destroy and clean out the vaccine-induced pathogens\n\nCovid vaccines are preventing your body from “taking out the trash.” Your body is failing at being a constant janitorial “staff” and the trash is piling up. Rotting. Cancer breeds here. This is like being constipated day after day after day. The Covid vaccines pollute the entire vascular system with toxic prions that look like virus particles. They are foreign to your body. How will you get them out, and in time to recover?\n\nFor starters, certain enzymes (orally taken) work to help break down the fibrin that can cause lung scars, which may help breathing return to normal. Doctors around the world have been prescribing systemic enzyme therapy to treat fibrosis since the 1970s. Enzymes are also efficient in treating pain and inflammation associated with vaccine injuries and/or musculoskeletal disorders. Reducing inflammation is the first order of business for the severely and chronically-inflamed vaccinated masses right now, many of whom are suffering from thousands of microscopic blood clots that are not showing up on mainstream diagnostic tests (besides elevated heart beat and high blood pressure).\n\nSystemic enzymes can also dissolve the lipid coating that surrounds the spike protein, dissolving foreign (toxic) protein in your blood and tissues, all while destroying bacteria and preventing blood clotting.\n\nAuthor of Cancer Deconstructed and Remove the ‘Splinters’ and Watch the Body Heal is President of the International Center for Nutritional Research\n\nDr. Gerald Smith is really stepping forward to help people who have already been Covid vaccinated and are feeling the repercussions of having billions of toxic spike proteins floating around in their blood. Dr. Smith understands the power of nutrition, and how to help people cleanse their blood using natural remedies, including glutathione, curcumin, magnesium, enzymes, vitamin E, maca, zinc, medicinal mushrooms, and the list goes on.\n\nGlutathione helps the liver detoxify, a cleaning process that’s supposed to happen about every 3 minutes. The glutathione is anti-inflammatory, and chelates heavy metals, pulling them out of the body, thus reducing cell damage to the liver.\n\nCurcumin works as an anti-oxidant and increases a brain-derived protein (BDNF) that plays a major role in keeping neurons (nerve cells) healthy. To assist the immune system in removing foreign proteins, Dr. Smith recommends a combination formula (proprietary formula) that includes thymus, calcium, vitamin A and C. Add in some cordyceps (sinesis) to help prevent the rapid replication of mutated (cancer) cells in DNA while increasing cellular energy levels (ATP) and oxygen utilization in cells.\n\nTop that off with the corcyceps sinesis benefits of boosting the immune system against infections, boosting white blood cell count (which the Covid vaccines are lowering systematically more with each booster), and strengthening the kidneys.\n\nThere’s a lot more great information about detoxifying from the Covid spike-poison jabs and some guidelines for people who may be on blood thinners or other specific medications. Check with your naturopathic physician on everything. Want the best in truth news on your internet dial? Tune to FoodSupply.news and find out how to avoid this population reduction scheme (via vaccine) by stocking up on organic, nutritious food and emergency supplies for the winter. And remember, avoid the Covid booster shots like the plague, because they are one.", "opengraph": {"title": "VAX DETOX: 200 Million Americans may want to consider pursuing a Covid-19 vaccine detoxification program while avoiding all boosters like the plague", "type": "article", "url": "https://www.naturalmedicine.news/2021-11-23-200-million-americans-may-want-to-consider-covid-19-vaccine-detox.html", "site_name": "Natural Medicine News", "description": "In order to maintain proper mitochondrial health, supply the body with appropriate nutrients, boost the immune system and keep the blood from clotting, over 200 million Americans may want to consider the advice of Dr. Gerald H. Smith, who may be able to assist with a natural detoxification regimen for all these foreign toxins the […]", "image": "https://www.naturalmedicine.news/wp-content/uploads/sites/320/2022/04/Kidney-Transplant-Cancer-Renal-Anatomy-Background-Disease.jpg"}, "tags": ["detox", "vax detox", "covid detox", "curcumin", "integrative medicine", "natural health", "Glutathione", "remedies", "covid vaccine detox", "#nutrition", "Dr. Gerald Smith", "spike protein", "Cures", "Cordyceps", "Vaccine Detox"], "tweets": [], "movies": [], "links": ["https://icnr.com/about/", "https://icnr.com/alternative-medicine/how-to-detox-and-antidote-covid-19-vaccine/", "https://icnr.com/alternative-medicine/how-to-detox-and-antidote-covid-19-vaccine/", "http://www.foodsupply.news/2021-11-18-food-shortage-engineered-to-control-people.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "http://www.truthwiki.org/cdc-centers-for-disease-control-and-prevention/", "https://www.naturalnews.com/2021-10-03-cdc-hospitals-fully-vaccinated-deaths-unvaccinated.html", "https://www.zerohedge.com/covid-19/joe-rogan-crushes-cnn-over-ivermectin-horse-paste-propaganda-gets-gupta-concede", "http://www.foodsupply.news/2021-11-18-food-shortage-engineered-to-control-people.html", "https://icnr.com/alternative-medicine/how-to-detox-and-antidote-covid-19-vaccine/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalmedicinenews%2F2021-11-23-200-million-americans-may-want-to-consider-covid-19-vaccine-detox.html&linkname=VAX%20DETOX%3A%20200%20Million%20Americans%20may%20want%20to%20consider%20pursuing%20a%20Covid-19%20vaccine%20detoxification%20program%20while%20avoiding%20all%20boosters%20like%20the%20plague", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}