{"result_id": "212046", "URL": "https://www.naturalnews.com/2021-08-17-cdc-is-the-new-big-tobacco-except-pushing-covid-vaccines.html", "timestamp": "2023-04-25 16:29:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "abortion,bad science,big pharma,biological agents and warfare,cancer industry,flu shots,harmful medicine,vaccines,bad doctors,badhealth,badmedicine,big tobacco,covid death,covid vaccines,deaths,doctors lie,public health,smoking,vaccine death,vaccine industry,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2021-08-17-cdc-is-the-new-big-tobacco-except-pushing-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "The CDC is the new Big Tobacco, except they're pushing mass death in a needle, via Covid vaccines, with thousands of doctors \"endorsing\" it all", "cleaned_text": "(Natural News) Remember the “War on Big Tobacco?” That started in the 1960s, just 30 years after doctors and scientists discovered and knew that smoking causes lung cancer. Smoking kills about 500,000 Americans per year, and that’s about 1,300 deaths per day caused by those dreaded “cancer sticks.” On average, for each pack of cigarettes a smoker smokes in a day, they lose 10 years of life. On the record, over 20,000 American doctors endorsed smoking, long after science knew cigarettes were a direct cause of lung cancer, as research revealed way back in 1935. Remembering the old ads in JAMA, “Doctors smoke camels more than any other cigarette.”\n\nNow, all those same “authorities” are declaring vaccines to be safe, even though science has already revealed they are causing trillions of miniscule blood clots with all these spike proteins floating around in the veins and capillaries, causing myocarditis, loss of motor skills and critical vascular damage. Instead of SMOKING killing everyone, it’s now spike proteins. The CDC is the new Big Tobacco in a needle.\n\nEven the PR and advertising companies are the same, with new names, but the same old players spinning the same ole’ verbiage: “Safe and effective.” Yes, and all those doctors said cigarettes were good for digestion. They swore by their favorite brands on TV commercials, giving deadly cigarettes their full endorsement.\n\nWhat if Congress, back then, had granted Big Tobacco full immunity from all lawsuits, like they just did for the entire vaccine industry?\n\nCurrently, if you get the dirty, dangerous Covid jab (or jabs) and you suffer direct health consequences from it, like blood clots, heart attack or permanent blindness, you cannot sue the maker. No court of law in the USA will take that case. You must go to a secretive “vaccine court,” where the vaccine industry appoints its own “judges” to determine if you should get any compensation for your loss, whether that’s injury or death by vaccine. That goes for you, your children and a baby in the womb that dies from the Covid jabs, which science now reveals causes 4 out of every 5 pregnancies to terminate by spontaneous abortion. Consider this very carefully.\n\nWhat would have been the result if Big Tobacco received 100 percent legal immunity from Congress, and ran the science journals, and every doctor in the country was pushing cigarettes, and if you didn’t smoke, you couldn’t get on an airplane? Smoking cigarettes, inhaling secondhand smoke and Covid masks all damage your breathing, and you can’t smoke on a plane. Both cigarettes and Covid masks cause bacterial infections of the mouth, throat and lungs, infections that can be highly contagious from people coughing, touching the same surfaces, or sharing food/beverages.\n\nThat would mean all of the unhealthy people, who smoke cigarettes, would get a “smoking passport” for traveling, and for going to live events, and everyone else would be barred and banned. Imagine that, “Can I see your smoking passport sir and ma’am?”\n\nCigarettes kill half-a-million Americans each year, and Covid vaccines have already killed over 17,000 Americans and Europeans while injuring nearly 2 million\n\nDo you still trust medical doctors to steer you right, after the Big Tobacco debacle? They perpetuated that deadly myth for over 30 years, that cigarettes were good for digestion and safe for even doctors to smoke. That went on from 1935 well into the 1960s. What a massive con of a marketing campaign then, to fool people into slowly killing themselves for industry profits, just like the vaccine marketing campaign now, the Ministry of Propaganda. Have you seen the Nazi-style t-shirts, caps, bumper stickers, lapel pins and propaganda posters everywhere?\n\nDid you know that smoking accounts for eight out of 10 COPD-related deaths? That’s chronic obstructive pulmonary disease, and symptoms include poor circulation, just like for the Covid vaccine victims. Other symptoms include frequent coughing and frequent infections, just like for the Covid-vaccinated sheeple. COPD is a progressive condition that gets steadily worse, like when you have trillions of tiny spike proteins clogging your capillaries in your lungs, heart and brain. Over time, the body becomes less able to take in enough oxygen, ultimately resulting in a painful death.\n\nJust like Big Tobacco, the current Covid vaccine manufacturers have their own long rap sheet of criminal convictions, offenses and dangerous products that force them to settle lawsuits in the millions and billions. This includes Moderna, Johnson & Johnson and Pfizer. Plus, the CDC themselves have a long rap sheet of maiming and murdering humans in the name of “medicine” and “inoculation.”\n\nRemember, if someone you know is pro-vaccine right now, that also means they are anti-science, because if they would look at the science, they would clearly see that vaccines are not safe or effective, but rather dangerous and defective. Tune your internet frequency to Pandemic.news for updates on these vaccine-induced crimes against humanity, plus the inside scoop on the upcoming vaccine Holocaust.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "The CDC is the new Big Tobacco, except they're pushing mass death in a needle, via Covid vaccines, with thousands of doctors \"endorsing\" it all", "url": "https://www.naturalnews.com/2021-08-17-cdc-is-the-new-big-tobacco-except-pushing-covid-vaccines.html", "type": "article", "article:published_time": "2021-08-17T11:12:09+00:00", "article:modified_time": "2021-08-17T11:12:09+00:00", "updated_time": "2021-08-17T11:12:09+00:00", "article:section": "vaccines", "description": "Remember the \"War on Big Tobacco?\" That started in the 1960s, just 30 years after doctors and scientists discovered and knew that smoking causes lung cancer. Smoking kills about 500,000 Americans per year, and that's about 1,300 deaths per day caused by those dreaded \"cancer stic", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2021/08/Vaccine-Vial-Bottles-Covid-19.jpg"}, "tags": ["covid vaccines", "vaccine wars", "smoking", "badhealth", "covid death", "doctors lie", "Public Health", "bad doctors", "vaccine industry", "vaccine injury", "badmedicine", "vaccines", "vaccine death", "deaths", "Big Tobacco"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://www.naturalnews.com/2021-07-01-depopulation-alert-shocking-new-study-reveals-covid-vaccine-terminates-4-out-of-5-pregnancies-via-spontaneous-abortions.html", "https://www.brighteon.tv", "https://www.naturalnews.com/2021-08-09-segregation-vaccine-passports-becoming-reality-usa.html", "https://www.naturalnews.com/2021-05-14-goebbels-style-ministry-of-propaganda-tactics-on-display.html", "https://www.naturalnews.com/2021-07-01-report-majority-now-dying-with-covid-are-vaccinated.html", "https://www.naturalnews.com/2021-07-18-dead-injured-adverse-reactions-covid-19-shots.html", "https://www.naturalnews.com/2021-07-27-medical-bombshell-blood-doctor-releases-findings-showing-modernas-mrna-covid-vaccines-change-red-blood-cells.html", "https://www.naturalnews.com/2021-06-06-jj-long-history-of-crimes-fines-violations-medical-products.html", "https://www.naturalnews.com/2021-06-17-nearly-1000-expired-pfizerbiontech-covid19-vaccines-administered-nyc-event.html", "https://www.naturalnews.com/2021-04-13-cdc-corrupt-history-pushing-mass-hysteria-dirty-vaccines.html", "https://www.naturalnews.com/2021-08-08-hhs-documents-admit-the-cdc-has-never-isolated-any-covid-19-virus-global-hoax.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2021-06-01-zelenko-covid-vaccine-mandates-children-human-experimentation.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2021-07-04-vaccinated-speeding-up-evolution-of-variants-spreading-them.html", "http://www.truthwiki.org/cdc-centers-for-disease-control-and-prevention/", "https://www.naturalnews.com/2021-06-06-jj-long-history-of-crimes-fines-violations-medical-products.html", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2021-08-17-cdc-is-the-new-big-tobacco-except-pushing-covid-vaccines.html&linkname=The%20CDC%20is%20the%20new%20Big%20Tobacco%2C%20except%20they%E2%80%99re%20pushing%20mass%20death%20in%20a%20needle%2C%20via%20Covid%20vaccines%2C%20with%20thousands%20of%20doctors%20%E2%80%9Cendorsing%E2%80%9D%20it%20all", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2021-08-17T11:12:09+00:00"}