{"result_id": "212050", "URL": "https://www.naturalnews.com/2021-12-23-pfizer-buys-company-that-makes-heart-medication.html", "timestamp": "2023-04-25 16:29:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "cardiovascular disease,children's health,coronavirus,current events,health,heart attack,infectious diseases,vaccines,vaccines,badhealth,badmedicine,big pharma,biological weapon,brighteon,conspiracy,coronavirus,coronavirus vaccines,covid-19,dangerous medicine,deception,heart disease,heart health,mrna vaccines,pandemic,pfizer,pharmaceutical fraud,spike protein", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2021-12-23-pfizer-buys-company-that-makes-heart-medication.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Pfizer buys pharmaceutical company that makes heart medication to solve the problem caused by mRNA vaccines", "cleaned_text": "(Natural News) Big Pharma company Pfizer recently bought another pharmaceutical company specializing in producing heart medication. Coincidentally, some of these heart medications can counteract the heart problems caused by Pfizer’s Wuhan coronavirus (COVID-19) mRNA vaccine.\n\nPfizer recently signed an agreement with Arena Pharmaceuticals to purchase the company. Arena is a clinical-stage biopharmaceutical firm based in San Diego that specializes in developing immuno-inflammatory treatments. At the time of its acquisition, Arena was also expanding its capabilities “to study cardiovascular conditions like acute heart failure and microvascular obstruction.”\n\nArena’s current portfolio indicates that it has several development-stage pharmaceuticals developed for gastroenterological, dermatological and – most importantly for Pfizer – cardiological use.\n\nPfizer will acquire millions of outstanding shares for Arena for the price of $100 per share, more than double the company’s stock price of $49.94 when the market closed on Friday, Dec. 17. Since the announcement of the acquisition, Arena’s stock price has soared to $95.95 per share.\n\nTo fund the acquisition of Arena, Pfizer is dipping into the nearly $28 billion in cash it has received from the sale of its mRNA COVID-19 vaccine. The boards of directors of both companies have unanimously approved the transaction although Pfizer’s acquisition still has to be cleared by regulators.\n\n“Pfizer’s capabilities will accelerate our mission to deliver our important medicines to patients,” said Arena President and Chief Executive Officer Amit Munshi. “We believe this transaction represents the best next step for both patients and shareholders.”\n\nIf Arena terminates the acquisition deal, it will owe Pfizer a termination fee of $350 million.\n\n“The proposed acquisition of Arena complements our capabilities and expertise in inflammation and immunology, a Pfizer innovation engine developing potential therapies for patients with debilitating immuno-inflammatory diseases with a need for more effective treatment options,” said Mike Gladstone, global president and general manager of Pfizer’s immunology and inflammation department. (Related: After a history of medical ethics violations, Pfizer is using the COVID-19 pandemic to carry out yet more crimes against humanity.)\n\nArena has devoted a lot of the company’s resources towards etrasimod, a drug that has demonstrated a favorable risk-benefit profile in studies for patients with ulcerative colitis.\n\nBut Arena is also developing two drugs that are targeted towards solving cardiovascular concerns. This may be more important for Pfizer as more and more people experience heart complications due to the company’s vaccine.\n\nThe first of these two is temanogrel, which is currently in Phase II trials. Temanogrel is expected to be used for the treatment of microvascular obstructions and Raynaud’s phenomenon, a problem that causes decreased blood flow due to spasms of blood vessels.\n\nThe second is APD418, which is also currently in Phase II trials. APD418 is intended for people who experience acute heart failure. The description of the drug on the company’s website claims that APD418 will improve cardiac contractility, or the ability of the heart to contract, with minimal negative effects on heart rate and blood pressure.\n\nAside from drug development, Arena Pharmaceuticals has an existing partnership with United Therapeutics, a biotechnology company with headquarters in Maryland and North Carolina, that has focused a lot of its research efforts on pulmonary arterial hypertension, another cardiovascular complication linked to Pfizer’s COVID vaccine.\n\nPfizer gearing up to sell a cure for a condition caused by its vaccine\n\nOne of the most widespread adverse effects caused by Pfizer’s vaccine, especially among young men, is myocarditis. While mainstream media outlets have focused on Moderna’s mRNA COVID-19 vaccine and its links to myocarditis, Pfizer’s vaccine has also caused this potentially deadly heart condition.\n\n“It’s almost like they come in with a problem, they get a reaction, and they come in [with a] solution and pretend to be heroes,” commented Josh Sigurdson, host of “World Alternative Media.”\n\nSigurdson also pointed out how convenient it was that Arena gets bought out around the time Pfizer starts facing serious scrutiny and controversy around the world because of the effect the company’s COVID-19 vaccine on people’s hearts.\n\nHe mentioned the fact that Taiwan has stopped administering the second dose of Pfizer’s vaccine for children aged 12 to 17 after a staggering number of people developed heart complications after vaccination.\n\nSigurdson also mentioned the fact that many athletes have died while playing after they got vaccinated with the Pfizer jab. These include athletes dying during soccer, basketball and football games and during track and field tournaments.\n\nThe ongoing mass vaccination push is now targeting children, who are at especially high risk of developing debilitating and potentially long-term heart conditions if they get the vaccine. “[The vaccine] could dramatically lower their lifespan,” Sigurdson said.\n\n“And keep in mind that this has been exposed many times, and people just seem to ignore it. And they still come through with the mandates for child vaccination anyway. It’s absolutely evil, it’s insane. It’s a war on humanity, my friends, and we must defend our children.”\n\nWatch the full Dec. 9 episode of “World Alternative Media” with host Josh Sigurdson on Brighteon.com to learn more about the developing story surrounding Pfizer and its acquisition of Arena Pharmaceuticals.\n\nThis video is from the World Alternative Media channel on Brighteon.com.\n\nBigPharmaNews.com has more news on Big Pharma companies like Pfizer and Moderna.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Pfizer buys pharmaceutical company that makes heart medication to solve the problem caused by mRNA vaccines", "url": "https://www.naturalnews.com/2021-12-23-pfizer-buys-company-that-makes-heart-medication.html", "type": "article", "article:published_time": "2021-12-23T08:25:17+00:00", "article:modified_time": "2021-12-23T08:25:17+00:00", "updated_time": "2021-12-23T08:25:17+00:00", "article:section": "vaccines", "description": "Big Pharma company Pfizer recently bought another pharmaceutical company specializing in producing heart medication. Coincidentally, some of these heart medications can counteract the heart problems caused by Pfizer's Wuhan coronavirus (COVID-19) mRNA vaccine.\r\n\r\nPfizer recently signed an agree", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2021/12/Business-Meeting-Agreement-Deal.jpg"}, "tags": ["pandemic", "conspiracy", "covid-19", "heart health", "Big Pharma", "Brighteon", "mRNA vaccines", "badhealth", "deception", "badmedicine", "Dangerous Medicine", "Pfizer", "coronavirus", "heart disease", "pharmaceutical fraud", "spike protein", "biological weapon", "coronavirus vaccines"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://www.brighteon.com/4b322733-e3e5-4173-bbc0-0348d890d0b2", "https://www.outsourcing-pharma.com/Article/2021/12/13/Pfizer-buys-immuno-inflammatory-firm-Arena-for-6.7b", "https://www.biospace.com/article/pfizer-to-acquire-arena-pharmaceuticals-and-lead-asset-etrasimod-in-6-7-billion-deal/", "https://www.jpost.com/business-and-innovation/all-news/pfizer-to-buy-arena-pharmaceuticals-in-67-billion-deal-688793", "https://www.brighteon.tv", "https://www.naturalnews.com/2021-12-08-pfizer-committing-more-crimes-against-humanity.html", "http://vaccineinjurynews.com", "https://realnewsaggregator.com/news/2021/12/20/pfizer-is-buying-a-cardiovascular-biopharma-company-for-6-7bn/", "http://vaccines.news", "https://www.brighteon.com/4b322733-e3e5-4173-bbc0-0348d890d0b2", "https://www.brighteon.com/channels/worldalternativemedia", "https://bigpharmanews.com/", "https://www.brighteon.com/4b322733-e3e5-4173-bbc0-0348d890d0b2", "https://www.outsourcing-pharma.com/Article/2021/12/13/Pfizer-buys-immuno-inflammatory-firm-Arena-for-6.7b", "https://www.biospace.com/article/pfizer-to-acquire-arena-pharmaceuticals-and-lead-asset-etrasimod-in-6-7-billion-deal/", "https://www.jpost.com/business-and-innovation/all-news/pfizer-to-buy-arena-pharmaceuticals-in-67-billion-deal-688793", "https://realnewsaggregator.com/news/2021/12/20/pfizer-is-buying-a-cardiovascular-biopharma-company-for-6-7bn/", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2021-12-23-pfizer-buys-company-that-makes-heart-medication.html&linkname=Pfizer%20buys%20pharmaceutical%20company%20that%20makes%20heart%20medication%20to%20solve%20the%20problem%20caused%20by%20mRNA%20vaccines", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2021-12-23T08:25:17+00:00"}