{"result_id": "212049", "URL": "https://www.naturalnews.com/2023-04-13-cdc-silence-vaccine-hesitancy-social-behavior-change.html", "timestamp": "2023-04-25 16:29:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,conspiracy,coronavirus,corruption,current events,deception,fascism,government,harmful medicine,health,infectious diseases,politics,totalitarianism,vaccines,badhealth,badmedicine,badscience,big government,cdc,censorship,computing,conspiracy,cyber war,dangerous medicine,glitch,pgp,public good projects,shots heard,suppressed,team halo,united nations verified,vaccine confidence project,vaccine damage,vaccine hesitancy,vaccine skeptics,vaccine wars,vaccines", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-04-13-cdc-silence-vaccine-hesitancy-social-behavior-change.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "CDC hopes to silence vaccine \"hesitancy\" by partnering with \"social and behavior change\" brainwashing initiative", "cleaned_text": "(Natural News) A trashy-looking drug dealer from Columbia, S.C., who worked as a Walmart pharmacist in Biloxi, Miss., before going on maternity leave and proudly quitting on the day after it ended in the hopes of not having “to pay back your leave benefits and be able to be paid out for PTO” (personal time off) has apparently made it a big part of her life’s purpose to harass good and honest doctors online in order to destroy their careers and lives.\n\nThe pharmacist’s social media name is “Savannah,” and she has been busy lately targeting Stanford University-educated Dr. Mary Talley Bowden, an ear, nose, and throat doctor with impeccable credentials, for helping to save people’s lives with ivermectin. Bowden is also an outspoken skeptic concerning the safety and effectiveness of vaccines, which is another reason why she landed in Savannah’s crosshairs.\n\nWith the help of another online troll named Dr. Danielle Jones, an OBGYN who posts under the handle of @MamaDoctorJones on YouTube, TikTok, and Twitter, put out a defamatory video about Bowden accusing her of “grifting,” rejecting science, and profiting from those who questioned the so-called “vaccine” for the Wuhan coronavirus (Covid-19). Savannah helped out by further reporting Bowden to the Texas Medical Board.\n\nBowden used to work at Houston Methodist Hospital but was fired for helping patients rather than drugging them up with experimental mRNA (messenger RNA) chemicals. She continues to face hateful harassment from the likes of Savannah and her followers, who are hellbent on destroying her life for defying their herd stupidity.\n\n“Because she has so many followers, when she makes a video about you, you get an army of people coming after you,” Bowden said about Jones and her ilk. “A lot of fake people [writing] reviews. That’s one of the biggest things. You can’t get them removed. I’ve tried to get them removed, and I can prove that they’re not my patients.”\n\nDid you know your tax dollars are being used to fund these online harassment and bullying campaigns?\n\nIt turns out that Savannah and Jones are just two of many online trolls whose views align with those of the Centers for Disease Control and Prevention (CDC), which is trying to stop all vaccine “hesitancy” and skepticism by unleashing angry mobs of these kinds of people online.\n\nSavannah is part of a group called Shots Heard that describes itself as “a rapid-response digital cavalry dedicated to protecting the online safety of health care providers and practices.” The group is part of The Public Good Projects, or PGP, which says it is a “public health nonprofit specializing in large-scale media monitoring programs, social and behavior change interventions, and cross-sector initiatives.”\n\nOne of PGP’s other initiatives is called the Public Health Communications Collaborative, or PHCC, which is part of the CDC Foundation, a non-profit arm of the CDC established by Congress. The goal of all this is to “decrease misinformation and increase vaccine demand worldwide” using social media influencers like Savannah and Jones to get the job done.\n\nThe rabbit hole goes deep concerning all the tentacles of this web of harassment and bullying that exist, and who is behind them. What we know for sure is that Congress is responsible for all this, as it is using American taxpayer dollars to help fund the destruction of good and honest doctors who actually save lives rather than collect a paycheck in exchange for mass-drugging the public with experimental drugs.\n\n“Being monitored on social media is nothing new to communists,” one commenter wrote about all this.\n\nThe latest news about the corrupt activity of the CDC can be found at CDC.news.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "CDC hopes to silence vaccine \"hesitancy\" by partnering with \"social and behavior change\" brainwashing initiative", "url": "https://www.naturalnews.com/2023-04-13-cdc-silence-vaccine-hesitancy-social-behavior-change.html", "type": "article", "article:published_time": "2023-04-13T08:52:05+00:00", "article:modified_time": "2023-04-13T12:24:51+00:00", "updated_time": "2023-04-13T12:24:51+00:00", "article:section": "Vaccines", "description": "A trashy-looking drug dealer from Columbia, S.C., who worked as a Walmart pharmacist in Biloxi, Miss., before going on maternity leave and proudly quitting on the day after it ended in the hopes of not having \"to pay back your leave benefits and be able to be paid out for PTO\" (personal ti", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/04/CDC-Vaccine-Coronavirus-Syringe.jpg"}, "tags": ["conspiracy", "vaccine skeptics", "big government", "Shots Heard", "United Nations Verified", "badhealth", "Public Good Projects", "PGP", "CDC", "Team Halo", "vaccine hesitancy", "cyber war", "vaccine wars", "Suppressed", "computing", "Vaccine Confidence Project", "Glitch", "Dangerous Medicine", "Censorship", "badmedicine", "vaccines", "badscience", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://www.theepochtimes.com/cdc-partners-with-social-and-behavior-change-initiative-to-silence-vaccine-hesitancy_5175172.html", "http://www.stanford.edu", "https://www.brighteon.tv", "https://naturalnews.com/2021-05-26-project-veritas-facebook-global-censorship-vaccine-hesitancy.html", "http://cdc.news", "https://www.theepochtimes.com/cdc-partners-with-social-and-behavior-change-initiative-to-silence-vaccine-hesitancy_5175172.html", "https://naturalnews.com/2021-05-26-project-veritas-facebook-global-censorship-vaccine-hesitancy.html", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-04-13-cdc-silence-vaccine-hesitancy-social-behavior-change.html&linkname=CDC%20hopes%20to%20silence%20vaccine%20%E2%80%9Chesitancy%E2%80%9D%20by%20partnering%20with%20%E2%80%9Csocial%20and%20behavior%20change%E2%80%9D%20brainwashing%20initiative", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-04-13T08:52:05+00:00"}