{"result_id": "212041", "URL": "https://www.naturalnews.com/2023-03-28-uk-pushing-covid-booster-shots-self-harm.html", "timestamp": "2023-04-25 16:28:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,biological agents and warfare,coronavirus,corruption,current events,depopulation,drugs,fascism,genocide,government,harmful medicine,heavy metals & toxic elements,mainstream media,medicine,pharmaceutical drug addiction,politics,scientific dictatorship,totalitarianism,toxic chemicals,vaccines,badhealth,big government,big pharma,booster,corruption,covid,health freedom,medical tyranny,medical violence,pharmaceutical fraud,self-harm,suppressed,uk,vaccine", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-03-28-uk-pushing-covid-booster-shots-self-harm.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "UK still pushing covid booster shots in expensive, state-sponsored self-harm initiative", "cleaned_text": "(Natural News) There appears to be no end to the Wuhan coronavirus (Covid-19) “vaccine” and “booster” campaigns in the United Kingdom, where the public is still being pushed to take shot after shot after shot despite prolific evidence that the injections are deadly.\n\nThe campaign is so aggressive and unrelenting that Member of Parliament Andrew Bridgen gave a speech before said parliament blasting the gene-based injections as both unsafe and ineffective – a position that quickly got his speech banned from the Google-owned YouTube platform.\n\nHaving previously delivered a similar speech on December 13 of last year, Bridgen delivered yet another this past week that stunned the world. It was so popular, in fact, that outcry from the public ultimately convinced YouTube to reinstate it – you can watch it below:\n\nThere is nothing safe or effective about covid “vaccines”\n\nIn the opening of his latest speech, Bridgen referenced statements he made in his earlier one from back in December about the vicious reaction it provoked from the corporate media and the fourth estate.\n\n“I highlighted to the minister the scale of harms that the experimental vaccines have caused and continue to cause,” Bridgen said.\n\n“In giving that speech to an almost empty chamber, on this most important of issues – quite literally life and death – two things happened to me immediately. First, I was cancelled by the mainstream media … not one media organization wanted to talk about the issue of serious harms or deaths occurring as a result of the mRNA vaccines.”\n\n“Secondly, in the wake of that speech, something far more important has happened. I was contacted by thousands of people offering their support and received many hundreds and hundreds of emails from all around the globe recounting to me their own stories of the harms caused in the wake of their or their loved ones’ covid vaccination.”\n\nEven though the media is pretending as though nothing is wrong and everything is just fine, Bridgen says the general public is wide awake concerning the dangers of the injections, and want to know more about what real science has to say as opposed to the pseudoscience being blasted by the establishment.\n\nPeople want to know, Bridgen explained, why governments both there and abroad are refusing to address the growing number of injuries and deaths being reported in connection to the shots – why all the secrecy, they would like to know?\n\n“Today, I once again ask the Minister why more is not being done, both in the United Kingdom and globally, to investigate and publicize the clear and well-documented adverse effects of covid-19 vaccines – vaccines that have made big pharma billions, and also vaccines that have resulted in completely unprecedented levels of yellow card reports,” Bridgen said.\n\n“The government’s own data in this respect is damning.”\n\nBridgen then cited “real-world data from Florida” showing that mRNA (messenger RNA) shots are causing disproportionately more harm compared to any other vaccine currently on the market. This, he says, corroborates with the UK’s own warning signals from its yellow card system which are producing similarly disproportionate rates of injury and death from the jabs.\n\nThe latest news about injuries and deaths caused by Chinese Virus shots can be found at ChemicalViolence.com.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "UK still pushing covid booster shots in expensive, state-sponsored self-harm initiative", "url": "https://www.naturalnews.com/2023-03-28-uk-pushing-covid-booster-shots-self-harm.html", "type": "article", "article:published_time": "2023-03-28T11:27:42+00:00", "article:modified_time": "2023-03-28T11:34:21+00:00", "updated_time": "2023-03-28T11:34:21+00:00", "article:section": "Vaccines", "description": "There appears to be no end to the Wuhan coronavirus (Covid-19) \"vaccine\" and \"booster\" campaigns in the United Kingdom, where the public is still being pushed to take shot after shot after shot despite prolific evidence that the injections are deadly.\r\n\r\nThe campaign is so aggres", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/03/Coronavirus-Vaccine-Bandaids-Booster-Shot.jpg"}, "tags": ["big government", "Big Pharma", "badhealth", "COVID", "medical violence", "Suppressed", "vaccine", "Medical Tyranny", "pharmaceutical fraud", "self-harm", "corruption", "health freedom", "UK", "booster"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Pleased to see that after such a large public outcry my speech has been reinstated on YouTube.</p>\n<p>Power does rest with the people, a salutary lesson for our self appointed masters.<a href=\"https://t.co/Ke8mj4jek4\">https://t.co/Ke8mj4jek4</a></p>\n<p>— Andrew Bridgen (@ABridgen) <a href=\"https://twitter.com/ABridgen/status/1637109145118601216?ref_src=twsrc%5Etfw\">March 18, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://www.naturalnews.com", "https://expose-news.com/2023/03/19/vaccines-are-engaging-in-state-sponsored-self-harm/", "https://t.co/Ke8mj4jek4", "https://twitter.com/ABridgen/status/1637109145118601216?ref_src=twsrc%5Etfw", "https://naturalnews.com/2022-03-30-uk-nhs-launches-fifth-covid-jab.html", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://expose-news.com/2023/03/19/vaccines-are-engaging-in-state-sponsored-self-harm/", "https://naturalnews.com/2022-03-30-uk-nhs-launches-fifth-covid-jab.html", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-03-28-uk-pushing-covid-booster-shots-self-harm.html&linkname=UK%20still%20pushing%20covid%20booster%20shots%20in%20expensive%2C%20state-sponsored%20self-harm%20initiative", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-03-28T11:27:42+00:00"}