{"result_id": "212042", "URL": "https://www.naturalnews.com/2022-01-10-data-countries-covid-vaccines-associated-sickness-death.html", "timestamp": "2023-04-25 16:28:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "coronavirus,depopulation,government,harmful medicine,health,infectious diseases,lies,medicine,propaganda,vaccines,badhealth,badmedicine,boosters,covid-19 pandemic,depopulation,genocide,herd immunity,mandates,medical tyranny,totalitarianism,vaccine,vaccine damage,vaccine deaths,vaccine injury,vaccine mandate", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2022-01-10-data-countries-covid-vaccines-associated-sickness-death.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Bombshell data from 145 countries show that covid vaccines INCREASE covid-19 associated sickness and death", "cleaned_text": "(Natural News) The most coercive vaccine program in the history of the world has yielded terrifying results across 145 different countries. Data from these heavily-vaccinated countries show that covid vaccines increase both the total COVID-19 case load per million and the total number of deaths associated with COVID-19. This statistical trend of depopulation occurred in approximately 88% of the countries studied. This increase in cases and deaths is a direct result of the causal impact of the vaccine rollout.\n\nThese findings are derived from an independent analysis, titled, “Worldwide Bayesian Causal Impact Analysis of Vaccine Administration on Deaths and Cases Associated with COVID-19: A Big Data Analysis of 145 Countries.” The source data is collected from Our World in Data and analyzed by Kyle Beattie. This independent analysis has been ignored by the CDC, the FDA and the NIH since October of 2021. As a result, the intent of these government agencies is becoming clearer by the day.\n\nVaccine mandate did not lead to herd immunity, caused spike in covid-19 cases and deaths instead\n\nThe vaccine was sold to the public as the “key to getting back our freedoms.” Lock downs, restrictions, mandates and other threats to civil liberties and individual rights were used by totalitarian governments to coerce maximum compliance with this medical experiment. The pharmaceutical companies, the politicians, Big Tech and the corporate media promised that these new mRNA vaccines would reduce symptoms across the population and thereby reduce the number of covid cases and deaths associated with severe acute respiratory syndrome. However, after a year of pushing vaccines on the public through unlawful mandates, the opposite is proving true.\n\nThis statistical analysis used standard computing procedures to determine the causal effect of vaccine administration on two dependent variables that have been measured throughout the covid-19 scandal. The results of the analysis were troubling. The statistical analysis found that causal impacts of the vaccine on covid-19 cases range from -46% to +12240%, with an average causal impact of +260.88%. Additionally, causal impacts of the vaccine on covid-19 associated deaths range from -19% to +19015%, with an average causal impact of +463.13%. At the worst end of the spectrum, 80% of the COVID deaths in the UK in December 2021 were in fully vaccinated people.\n\nThis uptick in covid-19 cases and deaths comes even after the CDC ordered laboratories to use PCR tests with lower cycle thresholds for people who are vaccinated. The CDC even called on laboratories to stop reporting covid-19 cases in the vaccinated. But covid-19 testing programs continued, regardless, and covid-19 began to describe various mild to severe illnesses in both the vaccinated and unvaccinated, with different variants cropping up in the population.\n\nWith their mandates and false narratives, governments routinely violate the Nuremberg code, causing DEMOCIDE\n\nEven though there is enough vaccine coverage for herd immunity to be realized, (if the vaccines neutralized the threat), “fully vaccinated” and “boosted” people continue to suffer from enhanced respiratory disease, cardiovascular issues, and other vaccine injuries. In the US, covid-19 vaccines are associated with a 38% increase in cases (per million) and a 31% increase in deaths associated with covid-19 (per million). Governments have forced a false vaccine narrative onto the population, repeatedly violating the Nuremberg Code and forcing democide onto families across the country.\n\nAs this medical experiment continues to fail, totalitarian governments continue to use mandates and threats to punish the very people who refuse to accept LIES, coercion, immune depletion, cardiovascular injury and potential DEATH. Instead of forcing a pharmaceutical narrative onto the public, policy makers must look objectively at the cold hard data and warn the public about the disastrous effects of the first three rounds of the covid-19 vaccine experiment.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Bombshell data from 145 countries show that covid vaccines INCREASE covid-19 associated sickness and death", "url": "https://www.naturalnews.com/2022-01-10-data-countries-covid-vaccines-associated-sickness-death.html", "type": "article", "article:published_time": "2022-01-10T21:41:45+00:00", "article:modified_time": "2022-01-11T00:10:05+00:00", "updated_time": "2022-01-11T00:10:05+00:00", "article:section": "Vaccines", "description": "The most coercive vaccine program in the history of the world has yielded terrifying results across 145 different countries. Data from these heavily-vaccinated countries show that covid vaccines increase both the total COVID-19 case load per million and the total number of deaths associated with COV", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2022/01/Coronavirus-Syringe-Vaccine-Covid-19.jpg"}, "tags": ["herd immunity", "mandates", "Vaccine deaths", "badhealth", "vaccine", "vaccine injury", "covid-19 pandemic", "genocide", "vaccine mandate", "depopulation", "badmedicine", "Medical Tyranny", "boosters", "totalitarianism", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://stevekirsch.substack.com/p/new-big-data-study-of-145-countries", "https://vector-news.github.io/editorials/CausalAnalysisReport_html.html", "https://www.brighteon.tv", "https://dailyexpose.uk/2022/01/08/bbc-forgot-to-tell-you-4-in-5-covid-deaths-triple-vaccinated/", "https://naturalnews.com/2021-05-24-cdc-alters-testing-guidelines-artificially-boost-vaccine-efficacy.html", "http://depopulation.news", "https://stevekirsch.substack.com/p/new-big-data-study-of-145-countries", "https://vector-news.github.io/editorials/CausalAnalysisReport_html.html", "https://dailyexpose.uk/2022/01/08/bbc-forgot-to-tell-you-4-in-5-covid-deaths-triple-vaccinated/", "https://naturalnews.com/2021-05-24-cdc-alters-testing-guidelines-artificially-boost-vaccine-efficacy.html", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2022-01-10-data-countries-covid-vaccines-associated-sickness-death.html&linkname=Bombshell%20data%20from%20145%20countries%20show%20that%20covid%20vaccines%20INCREASE%20covid-19%20associated%20sickness%20and%20death", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2022-01-10T21:41:45+00:00"}