{"result_id": "212017", "URL": "https://www.naturalnews.com/2023-02-12-cdc-self-destructing-adding-failed-covid-jabs-to-childhood-vaccine-schedule.html", "timestamp": "2023-04-25 16:28:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "children's health,corruption,fundamental rights,government,harmful medicine,health,health freedom,human rights,liberty,vaccines,badhealth,badmedicine,badscience,body autonomy,cdc,child murder,children's health,evil,genocide,health freedom,immunity,medical exemption,medical violence,parental rights,parents bill of rights,pediatricians,philosophical exemption,religious exemption,twisted,vaccine liability,vaccine violence", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-02-12-cdc-self-destructing-adding-failed-covid-jabs-to-childhood-vaccine-schedule.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "CDC in SELF-DESTRUCT mode after adding failed covid jabs to the childhood vaccine schedule", "cleaned_text": "(Natural News) The U.S. Centers for Disease Control (CDC) continues to reject a growing body of scientific and real-world evidence suggesting that all covid-19 vaccine programs need to be shut down immediately. Not only has the CDC failed to provide adequate informed consent about these new mRNA jabs, but they also continue to push for babies to receive the jabs, against logical epidemiology and medical common sense.\n\nThe CDC just added the covid-19 vaccines to the routine immunization schedule for both adults and children, despite evidence showing that the “vaccines” harm immunity and pose new health risks to the population. By adding the covid-19 jabs to the already bloated and misguided immunization schedule, the CDC is causing more families and individuals to question the necessity, safety, and efficacy of the vaccines that are already on that schedule.\n\nCDC approves three covid jabs for babies, in addition to the 37 doses of vaccine routinely given before 18 months\n\nAccording to the CDC, infants who are just six months old should be injected with the first dose of either the Pfizer or Moderna mRNA covid-19 jab. Before the child turns 15 months old, they are scheduled to receive another two doses. This is in conjunction with the other 37 doses of vaccine that are routinely given before a child turns 18 months of age. Most pediatricians in the United States blindly follow the CDC’s vaccine schedule, because the survival of their pediatric practice depends on the revenue generated from the vaccines and the chronic health conditions that are provably higher in heavily-vaccinated children.\n\nChildren ages six months to 11 years are prioritized for the same covid-19 vaccine protocol, which includes up to three doses at the moment. Adolescents ages 12 to 18 are also eligible for the Novavax covid-19 vaccines. Adults 19 and over are also recommended to get two or three doses of the covid-19 vaccine. The CDC has not added a fourth and fifth booster to the schedule, both of which were approved and recommended previously by the FDA and CDC.\n\nParental rights and all exemptions must be honored for all vaccines across the US\n\nBy adding the covid-19 vaccines to the childhood vaccine schedule, the CDC allows for state legislators to make the jabs mandatory for public school attendance. Over the past decade, state legislators have moved aggressively to quash parental rights, subjecting parents and their children to illogical vaccine mandates for school attendance. The most common legislative tactic is to remove philosophical, religious, and medical exemptions to vaccines. By removing vaccine exemptions from statutory law, legislators threaten the very existence of parental rights and body autonomy rights, subjecting millions of children to needless vaccines that may do more harm than good. This is why vaccine manufacturers invest so much time and money lobbying state legislators to remove the exemptions: it guarantees billions of dollars in profits — a sick cycle of abuse that sometimes destroys the lives of unsuspecting families.\n\nHowever, this time around, more lawyers are prepared to sue any state that requires covid-19 vaccination for public school attendance. More public officials have vowed not to implement covid-19 vaccine requirements, but they must take it a step further and address the parental rights aspect of the law, to honor all exemptions invoked for any and all vaccines.\n\nBecause at any moment, parents could be one election away from being subjected to a new batch of public health officials who would love to implement covid-19 vaccine requirements against the parents’ will. This is why it is imperative that parental rights for all vaccines (and all philosophical, scientific, religious, and medical objections) be codified into law as part of a superior Parent’s Bill of Rights. Parents and their children’s health must be protected long term.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "CDC in SELF-DESTRUCT mode after adding failed covid jabs to the childhood vaccine schedule", "url": "https://www.naturalnews.com/2023-02-12-cdc-self-destructing-adding-failed-covid-jabs-to-childhood-vaccine-schedule.html", "type": "article", "article:published_time": "2023-02-12T12:21:17+00:00", "article:modified_time": "2023-02-12T12:21:17+00:00", "updated_time": "2023-02-12T12:21:17+00:00", "article:section": "Vaccines", "description": "The U.S. Centers for Disease Control (CDC) continues to reject a growing body of scientific and real-world evidence suggesting that all covid-19 vaccine programs need to be shut down immediately. Not only has the CDC failed to provide adequate informed consent about these new mRNA jabs, but they als", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/02/Newborn-Baby-Girl-Parents-Hospital.jpg"}, "tags": ["body autonomy", "badhealth", "vaccine liability", "medical violence", "child murder", "medical exemption", "CDC", "pediatricians", "Parental rights", "Parents Bill of Rights", "religious exemption", "children's health", "philosophical exemption", "evil", "vaccine violence", "genocide", "Twisted", "badmedicine", "health freedom", "badscience", "immunity"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://expose-news.com/2023/01/08/triple-jabbed-35x-likely-hospitaised-study/?fbclid=IwAR2foZiabNyarul6lkhLOpNuFC9F9XWbPD79YDkGQtRe5V_Bg9jFWjfH8Do", "https://www.theepochtimes.com/cdc-adds-covid-19-vaccines-to-child-immunization-schedule_5048320.html", "https://icandecide.org/v-safe-data/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://ijvtpr.com/index.php/IJVTPR/article/view/21", "https://www.mdpi.com/1660-4601/17/22/8674/htm", "https://www.brighteon.tv", "http://vaccines.news", "https://www.nvic.org/law-policy-state/vaccine-laws", "https://www.theepochtimes.com/cdc-adds-covid-19-vaccines-to-child-immunization-schedule_5048320.html", "https://expose-news.com/2023/01/08/triple-jabbed-35x-likely-hospitaised-study/?fbclid=IwAR2foZiabNyarul6lkhLOpNuFC9F9XWbPD79YDkGQtRe5V_Bg9jFWjfH8Do", "https://icandecide.org/v-safe-data/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://ijvtpr.com/index.php/IJVTPR/article/view/21", "https://www.mdpi.com/1660-4601/17/22/8674/htm", "https://www.nvic.org/law-policy-state/vaccine-laws", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-02-12-cdc-self-destructing-adding-failed-covid-jabs-to-childhood-vaccine-schedule.html&linkname=CDC%20in%20SELF-DESTRUCT%20mode%20after%20adding%20failed%20covid%20jabs%20to%20the%20childhood%20vaccine%20schedule", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-02-12T12:21:17+00:00"}