{"result_id": "212053", "URL": "https://www.naturalnews.com/2023-03-03-autopsies-on-vaxxed-confirm-covid-vaccine-damage.html", "timestamp": "2023-04-25 16:29:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,coronavirus,harmful medicine,health,infectious diseases,medicine,vaccines,vaccines,arne burkhardt,autopsy,badhealth,badmedicine,bannon's war room,covid-19,lipid nanoparticles,naomi wolf,pandemic,report 56,robert chandler,sars-cov-2,spike protein,steve bannon,vaccine,vaccine damage,vaccine deaths,wuhan coronavirus", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-03-03-autopsies-on-vaxxed-confirm-covid-vaccine-damage.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Naomi Wolf: Autopsies on the vaxxed confirm COVID vaccine damage is damaging body organs", "cleaned_text": "(Natural News) Author and Daily Clout CEO Naomi Wolf remarked that autopsies on vaccinated people attest to how the Wuhan coronavirus (COVID-19) vaccine causes catastrophic damage to body organs.\n\n“Report 56, I think, is incontrovertible proof that we are at war because it shows that this injection – which I’ve been saying is a bioweapon is causing catastrophic damage in at least these 30 deceased people who were autopsied,” Wolf told host and former White House Chief Strategist Steve Bannon during a recent episode of “Bannon’s War Room” podcast.\n\nWolf noted the efforts of Dr. Robert Chandler, one of the volunteers gathered by the Daily Clout to go through documents from COVID-19 vaccine maker Pfizer. Chandler focused on the study done by German pathologist Dr. Arne Burkhardt and seven other experts. The eight performed a second autopsy on 30 deceased people injected with the COVID-19 vaccine at the behest of family and friends unsatisfied with the results of the first examinations.\n\nThe youngest person was aged 28, while the oldest was above 90. Wolf noted that these people died both inside and outside of medical facilities.\n\nWolf told Bannon that catastrophic lesions were found throughout the body of these people – most especially in organs such as the brain, heart, kidney, liver, spleen and lungs.\n\n“The deaths had been from seven days to six months after injections. So, they were looking for any sign that the spike protein or other ingredients had been the cause of the deaths. And in the majority of cases, they found [that the] probable cause or likely cause was the vaccine.”\n\nBurkhardt took tissue samples and stained them to see if there were changes in the tissues of vaccinated people who died. Following analysis, they found the SARS-CoV-2 spike protein in the arterial walls and the aorta of the cadavers. Based on this, Wolf said the COVID-19 vaccines possibly damaged the vascular system – aside from causing clots in blood vessels.\n\nShe also presented a slide of a spleen showing the “onion skin” phenomenon seen in some autoimmune diseases and a vaccinated lung damaged from the COVID injection. This was then followed by a report from Burkhardt and his colleagues concluding that lymphocytes were probably causing a rupture in the brain of the deceased.\n\nMoreover, Wolf presented a slide showing unidentified foreign material in the vessels, especially in the spleen vessels which was in five of the cadavers. She said the scientists and pathologists concluded that these are probably lipid nanoparticles (LNPs) coalescing and solidifying.\n\nThey also stated it is likely that in the warmth of the body, the LNPs are solidifying and causing this unidentified material that looked like a hardened industrial fat. According to Wolf, the nanoparticles are transported and stored in subfreezing temperatures, which means they are in liquid form before they solidify in the body or at room temperature. In other words, people are getting from the COVID injection something that goes throughout their body, traverses every organ in their body and then coalesces.\n\n“I just want to conclude by saying this is a bioweapon. It’s a bioweapon. This is not a medical product. This is causing catastrophic damage to 30 cadavers, 70 percent of them have catastrophic damage, and the conclusion of these respected scientists and physicians is that it is vaccine-related,” Wolf said.\n\nFollow VaccineDeaths.com for more news about deaths and injuries caused by the COVID vaccine.\n\nWatch the full conversation between Steve Bannon and Naomi Wolf below.\n\nThis video is from The Willow channel on Brighteon.com.\n\nPost-mortem examinations find massive blood clot biostructures in bodies of the vaccinated.\n\nAutopsy analysis: 93% of post-vaccination deaths are caused by the jabs… “killer lymphocytes” attack organs like the heart and lungs.\n\nStudy finds that 25% of vaccinated people suffer from post-immunization effects, ranging from mild to life-threatening.\n\nSudden Adult Death Syndrome is the new name for vaccine deaths in the medical establishment’s play-pretend reality.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Naomi Wolf: Autopsies on the vaxxed confirm COVID vaccine damage is damaging body organs", "url": "https://www.naturalnews.com/2023-03-03-autopsies-on-vaxxed-confirm-covid-vaccine-damage.html", "type": "article", "article:published_time": "2023-03-03T05:20:16+00:00", "article:modified_time": "2023-03-03T12:28:05+00:00", "updated_time": "2023-03-03T12:28:05+00:00", "article:section": "vaccines", "description": "Author and Daily Clout CEO Naomi Wolf remarked that autopsies on vaccinated people attest to how the Wuhan coronavirus (COVID-19) vaccine causes catastrophic damage to body organs.\r\n\r\n\"Report 56, I think, is incontrovertible proof that we are at war because it shows that this injection – which", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/03/Dead-Morgue-Toe-Tag.jpg"}, "tags": ["pandemic", "Naomi Wolf", "covid-19", "Vaccine deaths", "badhealth", "vaccine", "Arne Burkhardt", "lipid nanoparticles", "autopsy", "badmedicine", "Report 56", "Robert Chandler", "SARS-CoV-2", "spike protein", "vaccine damage", "Wuhan coronavirus", "Bannon's War Room", "Steve Bannon"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "http://www.brighteon.com/6dcea111-e33e-480b-8059-099ff94a1407", "http://warroom.org/2023/02/16/naomi-wolf-autopsies-revealed-catastrophic-lesions-on-many-organs-likely-caused-by-covid-vaccine/", "http://dailyclout.io/report-56-autopsies-reveal-the-medical-atrocities-of-genetic-therapies-being-used-against-a-respiratory-virus/", "https://www.brighteon.tv", "http://vaccinedeaths.com", "https://www.brighteon.com/6dcea111-e33e-480b-8059-099ff94a1407", "https://www.brighteon.com/channels/thewillow", "https://naturalnews.com/2022-06-16-autopsies-find-blood-clot-biostructures-bodies-vaccinated.html", "https://naturalnews.com/2022-01-02-93percent-post-vaccination-deaths-caused-by-jabs.html", "https://naturalnews.com/2021-05-13-25-percent-vaccinated-people-suffer-mild-effects.html", "https://naturalnews.com/2022-06-10-sads-new-name-vaccine-deaths-medical-establishment.html", "https://vaccinedeaths.com/2023-01-30-covid-vaccine-spike-proteins-invade-all-organs.html", "https://www.brighteon.com/6dcea111-e33e-480b-8059-099ff94a1407", "http://warroom.org/2023/02/16/naomi-wolf-autopsies-revealed-catastrophic-lesions-on-many-organs-likely-caused-by-covid-vaccine/", "http://dailyclout.io/report-56-autopsies-reveal-the-medical-atrocities-of-genetic-therapies-being-used-against-a-respiratory-virus/", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-03-03-autopsies-on-vaxxed-confirm-covid-vaccine-damage.html&linkname=Naomi%20Wolf%3A%20Autopsies%20on%20the%20vaxxed%20confirm%20COVID%20vaccine%20damage%20is%20damaging%20body%20organs", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-03-03T05:20:16+00:00"}