{"result_id": "212010", "URL": "https://www.naturalnews.com/2023-04-04-moderna-developing-new-mrna-flu-vaccine.html", "timestamp": "2023-04-25 16:28:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,biological agents and warfare,biotechnology,corruption,government,harmful medicine,health,medicine,scientific dictatorship,vaccines,vaccines,badhealth,badmedicine,bill gates,bird flu,deception,dr fauci,dr. yoshihiro kawaoka,experiments,gain-of-function,medical violence,moderna,niaid,outbreak,pandemic,plague,plandemics,predatory virology,robert redfield,ron fouchier,vaccine safety,weaponized bird flu", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-04-04-moderna-developing-new-mrna-flu-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Moderna developing new mRNA flu vaccine for upcoming avian influenza plandemic", "cleaned_text": "(Natural News) The next plandemic is already underway. Moderna and two other vaccine developers (GlaxoSmithKline & CSL Seqirus) are already preparing human subjects to take a new mRNA flu vaccine for an upcoming avian influenza pandemic. It is important to note that avian influenza (H5N1) has never posed a threat to mankind, but due to more recent gain-of-function virology experiments, the virus now includes hybrid subtypes that can cross from birds to mammals, and potentially from birds to humans. New strains of bird flu have already crossed from birds to wild mammals and the situation is currently being monitored by governments around the world.\n\nShayan Sharif, a professor and associate dean with the Ontario Veterinary College recently warned the virus is ‘gathering momentum’ and becoming more of a human threat. “Various pieces of the puzzle are coming together for this virus to become transmissible among humans, Sharif told Global News. “This particular virus has the potential to become a pandemic virus, and if it does, then we have to be absolutely ready because the fatality rate of this virus could be far greater than what we saw for COVID-19.”\n\nFauci, Gates have already funded bioweapons development for bird flu and Spanish flu hybrids\n\nGain-of-function research on avian influenza has already been funded by Dr. Anthony Fauci from the National Institutes of Allergy and Infectious Disease and by Bill Gates through his philanthropic ventures through the Bill and Melinda Gates Foundation. In fact, it was Fauci’s funding of gain-of-function research for weaponized bird flu that led to the 2012 moratorium on gain-of-function research. At the time, Fauci funded Ron Fouchier, a Dutch virologist. Fouchier’s team created an airborne bird flu strain that was genetically engineered in ferrets and designed for cross-species infection.\n\nFauci and Gates have also funded the work of Dr. Yoshihiro Kawaoka. According to Mercola.com, “Kawaoka mixed bird flu virus with the Spanish flu virus, resulting in a highly lethal respiratory virus with human transmission capability.” Kawaoka also tinkered with mixtures of H5N1 and the 2009 H1N1 (swine flu) virus in a biosafety level 2 lab. He effectively created an airborne hybrid of these viruses, a hybrid that can evade the human immune system.\n\nFormer director for the U.S. Centers for Disease Control and Prevention, Dr. Robert Redfield, knows what is going on and is readying the population for a “great” bird flu pandemic. “I believe the great pandemic is still in the future, and that’s going to be a bird flu pandemic for man,” Redfield said in a March 30, 2022, CenterPoint interview, “It’s going to have significant mortality in the 10-50% range. It’s gonna be trouble.”\n\nModerna and others will have predatory vaccines (bioweapons) prepared before pandemics are announced\n\nPredatory gain-of-function research and vaccine development continues, with no regard to its unethical and potentially evil applications. As such, there will be no double-blind, placebo-controlled studies for upcoming mRNA vaccines. Moderna is already preparing new influenza vaccines that are scheduled for mass distribution before pandemics are announced by governments. These new injections will already be pre-approved by regulators and stockpiled before a pandemic is announced. The injections will be guaranteed emergency use authorization, and all safety and effectiveness will be carried out on populations in real time — an atrocity that was conducted with the covid-19 vaccine rollout. Reuters reports that the new mRNA vaccines “might not require further human trials, even if they have to be tweaked to better match whichever strain does jump to humans.”\n\nThe mRNA vaccines use genetic information from a genetically engineered pathogen of pandemic potential. That genetic information is then delivered to people via injection and transcribed in their cells. Traditional vaccine technology relied on a cumbersome process of growing whole viruses (live or attenuated) in cell cultures. Today, mRNA vaccine experiments can deliver instructions for people to mass produce parts of these bioweapons, forcing their body to respond in unpredictable ways.\n\nRaffael Nachbagauer, executive director of infectious diseases at Moderna said Moderna’s mRNA vaccine research didn’t actually begin with COVID; it began with pandemic flu, and was modified for COVID. Nachbagauer said Moderna is launching a small human trial in the first half of 2023. The trial is for a new mRNA pandemic influenza vaccine that is tailored to the new avian influenza sub-type. He said Moderna could respond ‘very quickly’ in an outbreak scenario – with hundreds of millions of shots delivered within months.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Moderna developing new mRNA flu vaccine for upcoming avian influenza plandemic", "url": "https://www.naturalnews.com/2023-04-04-moderna-developing-new-mrna-flu-vaccine.html", "type": "article", "article:published_time": "2023-04-04T09:00:30+00:00", "article:modified_time": "2023-04-04T10:48:35+00:00", "updated_time": "2023-04-04T10:48:35+00:00", "article:section": "vaccines", "description": "The next plandemic is already underway. Moderna and two other vaccine developers (GlaxoSmithKline & CSL Seqirus) are already preparing human subjects to take a new mRNA flu vaccine for an upcoming avian influenza pandemic. It is important to note that avian influenza (H5N1) has never posed a thr", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/04/flu-bird.jpg"}, "tags": ["pandemic", "outbreak", "badhealth", "deception", "medical violence", "Plague", "experiments", "NIAID", "bird flu", "plandemics", "Robert Redfield", "weaponized bird flu", "Ron Fouchier", "vaccine safety", "bill gates", "gain-of-function", "predatory virology", "Dr Fauci", "Moderna", "badmedicine", "Dr. Yoshihiro Kawaoka"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://articles.mercola.com/sites/articles/archive/2023/04/03/bird-flu-scare-narrative-ramps-up.aspx?v=1680538509", "https://naturalnews.com/2023-03-28-new-bird-flu-passes-to-mammals.html", "http://pandemic.news", "http://influenza.news", "https://www.cidrap.umn.edu/avian-influenza-bird-flu/fouchier-study-reveals-changes-enabling-airborne-spread-h5n1", "https://www.brighteon.tv", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2682078/", "https://winepressnews.com/2023/01/16/former-cdc-director-redfield-warns-the-great-pandemic-of-bird-flu-is-going-to-happen-media-pushes-this-mass-culling-scenario/", "https://www.msn.com/en-us/health/other/vaccine-makers-prep-bird-flu-shot-for-humans-just-in-case-rich-nations-lock-in-supplies/ar-AA18S0RY", "http://vaccines.news", "https://articles.mercola.com/sites/articles/archive/2023/04/03/bird-flu-scare-narrative-ramps-up.aspx?v=1680538509", "https://naturalnews.com/2023-03-28-new-bird-flu-passes-to-mammals.html", "https://www.cidrap.umn.edu/avian-influenza-bird-flu/fouchier-study-reveals-changes-enabling-airborne-spread-h5n1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2682078/", "https://winepressnews.com/2023/01/16/former-cdc-director-redfield-warns-the-great-pandemic-of-bird-flu-is-going-to-happen-media-pushes-this-mass-culling-scenario/", "https://www.msn.com/en-us/health/other/vaccine-makers-prep-bird-flu-shot-for-humans-just-in-case-rich-nations-lock-in-supplies/ar-AA18S0RY", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-04-04-moderna-developing-new-mrna-flu-vaccine.html&linkname=Moderna%20developing%20new%20mRNA%20flu%20vaccine%20for%20upcoming%20avian%20influenza%20plandemic", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-04-04T09:00:30+00:00"}