{"result_id": "212026", "URL": "https://www.naturalnews.com/2023-02-14-cdc-adds-covid-mrna-vaccine-childhood-schedule.html", "timestamp": "2023-04-25 16:28:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,children's health,coronavirus,current events,government,harmful medicine,health,infectious diseases,medicine,vaccines,badhealth,badmedicine,big government,big pharma,biological weapon,cdc,children's health,conspiracy,corruption,covid,dangerous medicine,fda,mrna,pandemic,pharmaceutical fraud,spike protein,traitors,vaccine,vaccine damage,vaccine injury,vaccine schedule,vaccine wars", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-02-14-cdc-adds-covid-mrna-vaccine-childhood-schedule.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "'Tragic': CDC adds original COVID mRNA vaccine to childhood schedule despite known harms", "cleaned_text": "(Natural News) The Centers for Disease Control and Prevention (CDC) on Thursday added COVID-19 vaccination to its routine immunization schedule for children and adults.\n\nAlthough the CDC does not have the authority to set requirements itself, the agency’s immunization schedule provides formal guidance for state and local public health officials who set the rules for which vaccines are required to attend school.\n\nThe schedule also is the basis for vaccine recommendations made by most physicians.\n\n“Given all that we have learned about the dangers and ineffectiveness of COVID-19 shots over the last two years, it is horrifying to see the CDC now recommend this as a routine shot to children,” Mary Holland, Children’s Health Defense (CHD) president and general counsel told The Defender.\n\n“Although it is unsurprising given the agency capture, it is nonetheless tragic,” she added.\n\nThursday’s move formalized the recommendation by the agency’s vaccine advisory committee, which on Oct. 20, 2022, voted unanimously (15-0) to recommend adding COVID-19 vaccines for children as young as 6 months old to the new Child and Adolescent Immunization Schedule.\n\nUnder the new guidelines, the CDC recommends healthy children 6 months to 11 years old receive a primary series of two doses of the mRNA Moderna or Pfizer-BioNTech monovalent COVID-19 vaccine, followed by a booster of the bivalent shot.\n\nIt recommends that healthy people age 12 and older receive two doses of either the Moderna, Pfizer or Novavax vaccine followed by a bivalent booster.\n\nAll COVID-19 vaccines being administered in the U.S. to people under 18 are Emergency Use Authorized (EUA) products. The U.S. Food and Drug Administration (FDA) did grant full approval to Pfizer’s Comirnaty COVID-19 vaccine for ages 12 and older, however, the Comirnaty vaccine is not available in the U.S. — which means all children who get the Pfizer vaccine are getting an EUA product.\n\nIn Wednesday’s congressional hearing on the Biden administration’s response to COVID-19, Rep. Dan Crenshaw (R-Texas) asked CDC Director Dr. Rochelle Walensky, why the CDC broke with its own norms and put an EUA vaccine on the childhood immunization schedule for a disease that poses very little risk to children and for which the vaccine poses many potential side effects without preventing transmission.\n\nData collected by the CDC through its Vaccine Adverse Event Reporting System (VAERS) and a growing number of other sources indicate serious health risks associated with COVID-19 vaccination for children.\n\n“The COVID vaccines have not been shown to be either effective or safe for children,” CHD argued in an amicus brief filed in Louisiana last year. “The benefits to children are minuscule, while the risks — including the risk of potentially fatal heart damage — are ‘known’ and ‘serious,’ as the FDA itself has acknowledged.”\n\nOther changes to the childhood schedule include adding the PVC15 shot, a pneumococcal conjugate vaccine used to help protect against pneumococcal bacteria and only recently approved for children; updated guidance for the flu and hepatitis B vaccines; and new recommendations for the measles, mumps and rubella (MMR) and polio vaccines.\n\nThe CDC now recommends an additional dose of the MMR vaccine in places where there is a mumps outbreak. It also recommends an additional poliovirus vaccine for children and adults if new polio cases emerge.\n\nThis would mean the childhood vaccination schedule would increase the number of recommended injections from 54 to 72 over the course of a person’s childhood, between the ages of 6 months and 18 years, The Defender reported last year.\n\nVaccine makers are not liable for injuries or deaths associated with EUA vaccines but can be held liable for injuries caused by a fully licensed vaccine — unless that vaccine is added to the CDC’s childhood vaccination schedule.\n\nParents of children injured by vaccines listed on the childhood schedule can seek compensation through the taxpayer-funded National Vaccine Injury Compensation Program (NVICP), a no-fault alternative to the traditional legal system for resolving vaccine injury claims.\n\nHowever, the revisions voted on by the ACIP committee last year explicitly state (slide 24) that the pneumococcal polysaccharide vaccine (PPSV23) and COVID-19 vaccines are not covered under the NVICP.\n\nInstead, the COVID-19 vaccines added to the childhood schedule will remain covered by the Countermeasures Injury Compensation Program (CICP). To date, only 19 claims related to COVID-19 filed with the CICP have been found eligible for compensation, though no compensation has yet been paid.\n\nSince it was established in 2010, the CICP only compensated 30 of the nearly 12,000 claims filed.\n\nAre we seeing ‘the beginning of the end of Big Pharma’s reign’?\n\nThe addition of the COVID-19 vaccine to the immunization schedule “helps ‘normalize’ this vaccine and sends a powerful message to both healthcare providers and the general public that everyone ages 6 months and older should stay up to date with recommended COVID-19 vaccines (including a booster, when eligible), just as they would with any other routinely recommended vaccine,” Dr. Neil Murthy and Dr. A. Patricia Wodi said in a statement reported by CNN.\n\nThis “normalization” comes at a time when over 85% of the U.S. population hasn’t been boosted, despite the massive government-sponsored media push.\n\nNationally, only 12% of children ages 6 months to 4 years have received one dose of the vaccine. Only 58% of children ages 12 to 17 and 32% of children ages 5 to 11 have received two doses of the vaccine. Numbers vary widely across states.\n\nHolland commented on the implications of adding this shot to the schedule:\n\nAt Wednesday’s congressional hearing, lawmakers repeatedly raised concerns about how regulatory agencies’ flawed recommendations led to a lack of confidence in public institutions.\n\nRep. Cathy McMorris Rodgers (R-Wash.) said, “There’s serious distrust today with our public health agencies. [Polling indicates] 40% of the public does not trust our public health agencies to handle the next public health emergency.”\n\nWalensky indicated that vaccination rates for all vaccines on the childhood schedule among kindergarten children declined last year, dropping from 95% to 93% over the last two years, amounting to hundreds of thousands of parents opting not to comply with the childhood vaccination schedule.\n\nThe most recent VAERS data on vaccine injuries, updated Feb. 2 for children 6 months to 5 years old who received a COVID-19 vaccine, showed reports of 5,737 adverse events, including 244 cases rated as serious and 14 reported deaths.\n\nFor 5- to 11-year-olds, there were 16,910 reports of adverse events, including 805 rated as serious and 33 reported deaths.\n\nVAERS is the primary government-funded system for reporting adverse vaccine reactions in the U.S. While reports submitted to VAERS require further investigation before a causal relationship can be confirmed, VAERS historically has been shown to report only 1% of actual vaccine adverse events.\n\nAccording to Retsef Levi, Ph.D., with the Massachusetts Institute of Technology, the vaccines “cause unprecedented levels of harm, including the death of young people and children.”\n\nMultiple studies have determined that the vaccines increase the risk of myocarditis and pericarditis, particularly in young men.\n\nAn October 2022 study revealed the CDC was aware of the safety signal for these side effects months before it informed the public.\n\nAt the recent FDA vaccine advisory committee meeting, several committee members also raised concerns about recommending annual bivalent boosters for children given the lack of data.\n\nDr. Archana Chatterjee, Ph.D., committee member and dean of the Chicago Medical School and vice president for medical affairs at Rosalind Franklin University said:\n\nUnder public pressure and facing a series of lawsuits, last week California dropped its plan to mandate COVID-19 vaccination for school children.\n\nAs of Feb. 6, 21 states have legislation or executive orders banning student vaccine mandates, according to the National Academy for State Health Policy, a nonpartisan organization of state health policymakers.\n\nOnly the District of Columbia currently has a vaccine mandate for school children, although it is not set to go into effect until the 2023-2024 school year.\n\nAs of Feb. 12, the U.K. will no longer recommend COVID-19 boosters for healthy people under age 50.\n\nDenmark ended its universal COVID-19 vaccination campaign for healthy individuals in February 2022.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "'Tragic': CDC adds original COVID mRNA vaccine to childhood schedule despite known harms", "url": "https://www.naturalnews.com/2023-02-14-cdc-adds-covid-mrna-vaccine-childhood-schedule.html", "type": "article", "article:published_time": "2023-02-14T05:11:32+00:00", "article:modified_time": "2023-02-14T12:15:46+00:00", "updated_time": "2023-02-14T12:15:46+00:00", "article:section": "Vaccines", "description": "The Centers for Disease Control and Prevention (CDC) on Thursday added COVID-19 vaccination to its routine immunization schedule for children and adults.\r\n\r\n(Article by Brenda Baletti, Ph.D. republished from ChildrensHealthDefense.org)\r\n\r\nAlthough the CDC does not have the authority to set requireme", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/02/cdc.png"}, "tags": ["pandemic", "conspiracy", "big government", "Big Pharma", "FDA", "badhealth", "COVID", "corruption", "biological weapon", "CDC", "vaccine", "vaccine schedule", "spike protein", "vaccine damage", "vaccine wars", "children's health", "Dangerous Medicine", "vaccine injury", "badmedicine", "traitors", "mRNA", "pharmaceutical fraud"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">This reckless action is final proof of the cynicism, corruption + capture of a once exemplary public health agency. ACIP members have demonstrated that fealty to their pharma overlords eclipses any residual concerns they may harbor for child welfare.<a href=\"https://t.co/UkRQBxAvo2\">https://t.co/UkRQBxAvo2</a></p>\n<p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1583243667560538112?ref_src=twsrc%5Etfw\">October 20, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Dr. Rochelle Walensky on Why an Experimental Vaccine was Added to the Childhood Schedule</p>\n<p>“The reason ACIP recommended…getting the COVID-19 vaccine on the pediatric schedule, it was ONLY because it was the only way it could be covered in our ‘Vaccines for Children’ program” <a href=\"https://t.co/k1CVf4cv09\">pic.twitter.com/k1CVf4cv09</a></p>\n<p>— Chief Nerd (@TheChiefNerd) <a href=\"https://twitter.com/TheChiefNerd/status/1623436607356551168?ref_src=twsrc%5Etfw\">February 8, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://www.naturalnews.com", "https://www.cdc.gov/vaccines/schedules/hcp/index.html", "https://childrenshealthdefense.org/defender/cdc-covid-mrna-vaccine-childhood-schedule/", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/", "https://www.reuters.com/world/us/us-cdc-advisers-approve-adding-covid-shots-vaccine-schedules-2022-10-20/", "https://childrenshealthdefense.org/defender/childhood-covid-vaccine-schedule/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://t.co/UkRQBxAvo2", "https://twitter.com/RobertKennedyJr/status/1583243667560538112?ref_src=twsrc%5Etfw", "https://www.cdc.gov/vaccines/covid-19/images/COVID19-vaccination-schedule-most-people.png", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine", "https://childrenshealthdefense.org/defender/childrens-health-defense-sues-fda-pfizer-comirnaty-covid-vaccine/", "https://childrenshealthdefense.org/defender/health-officials-hearing-covid-response/", "https://crenshaw.house.gov/", "https://childrenshealthdefense.org/defender/rochelle-walensky-cdc-false-information-covid-vaccine-safety-monitoring-et/", "https://childrenshealthdefense.org/defender/covid-vaccine-kids-facts/", "https://www.brighteon.tv", "https://t.co/k1CVf4cv09", "https://twitter.com/TheChiefNerd/status/1623436607356551168?ref_src=twsrc%5Etfw", "https://childrenshealthdefense.org/defender/chd-lawsuit-fda-vaers-covid-vaccine-injuries-deaths/", "https://childrenshealthdefense.org/defender/fda-risk-benefit-analysis-covid-vaccines-children/", "https://childrenshealthdefense.org/defender/covid-vaccine-mandate-louisiana-children-chd/", "https://idp.nature.com/authorize?response_type=cookie&client_id=grover&redirect_uri=https%3A%2F%2Fwww.nature.com%2Farticles%2Fd41586-021-01897-w", "https://childrenshealthdefense.org/defender/autopsies-vaccinating-teens-covid-heartbreaking/", "https://www.pharmacypracticenews.com/FDA-Approvals/Article/07-21/FDA-Approves-Vaxneuvance-Pneumonia-Vaccine-Effective-Against-15-Serotypes-/64115", "https://childrenshealthdefense.org/defender/mainstream-media-polio-vaccine-alarmism/", "https://childrenshealthdefense.org/defender/childhood-covid-vaccine-schedule/", "https://childrenshealthdefense.org/defender/prep-act-covid-vaccine-injury-liability/", "https://www.hrsa.gov/vaccine-compensation", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2022-10-19-20/2023-Immunization-Schedule-508.pdf", "https://www.hrsa.gov/cicp/cicp-data", "https://www.cnn.com/2023/02/09/health/vaccine-recommendations-wellness/index.html", "https://childrenshealthdefense.org/defender/wsj-covid-booster-fda/", "https://www.aap.org/en/pages/2019-novel-coronavirus-covid-19-infections/children-and-covid-19-vaccination-trends/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://mcmorris.house.gov/", "https://www.cdc.gov/mmwr/volumes/72/wr/mm7202a2.htm#:~:text=During%20the%202020%E2%80%9321%20school,for%20all%20state%2Drequired%20vaccines", "https://childrenshealthdefense.org/defender/vaers-deaths-covid-vaccines-boosters/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://childrenshealthdefense.org/defender/bill-gates-pfizer-covid-vaccine-profits/", "https://childrenshealthdefense.org/defender/covid-vaccine-induce-myocarditis/", "https://childrenshealthdefense.org/defender/cdc-criminal-neglect-covid-vaccine-myocarditis-young-males/", "https://childrenshealthdefense.org/defender/fda-advisers-bivalent-vaccine/", "https://www.amwa-doc.org/amwaleads2021/archana-chatterjee-md-phd/", "https://childrenshealthdefense.org/defender/california-end-school-covid-vaccine-mandate/", "https://nashp.org/states-address-school-vaccine-mandates-and-mask-mandates/", "https://www.gov.uk/government/news/jcvi-advises-an-autumn-covid-19-vaccine-booster", "https://www.newsweek.com/denmark-aims-end-covid-vaccine-campaign-wont-give-boosters-children-1678389", "https://childrenshealthdefense.org/defender/cdc-covid-mrna-vaccine-childhood-schedule/", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-02-14-cdc-adds-covid-mrna-vaccine-childhood-schedule.html&linkname=%E2%80%98Tragic%E2%80%99%3A%20CDC%20adds%20original%20COVID%20mRNA%20vaccine%20to%20childhood%20schedule%20despite%20known%20harms", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-02-14T05:11:32+00:00"}