{"result_id": "212013", "URL": "https://www.naturalnews.com/2023-04-14-mad-scientists-now-experimenting-with-mrna-bioweapons.html", "timestamp": "2023-04-25 16:28:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "agriculture,bad science,big pharma,biological agents and warfare,food,food safety,harmful medicine,livestock,medicine,poultry,science,toxic foods,toxic ingredients,vaccines,vaccines,animal experimentation,badfood,badhealth,badscience,beef,bioweapons,censored science,chimeric viruses,conspiracy,deception,food experimentation,food safety,food science,food supply,genetic integrity,hacking humans,immune cell hacking,mrna,national science foundation,pork,poultry,research,spike proteins,transparency", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-04-14-mad-scientists-now-experimenting-with-mrna-bioweapons.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Mad scientists are now experimenting with mRNA injections in beef, poultry, pork, and produce... food supply bioweapons?", "cleaned_text": "(Natural News) Scientists across the United States are receiving massive funding to test out novel mRNA vaccine systems on rodents, livestock, and produce. The deleterious nature of the mRNA platform and the deadly failures of its application in human populations has not stopped the US government from funding new mRNA experiments to re-engineer animals, food, and humans. Mad scientists are now experimenting with mRNA injections in beef, poultry, pork, and produce. There are currently no laws to protect the food supply and the human genome from an onslaught of mRNA experiments and the mass production and deployment of biological weapons inside animals and produce.\n\nThe mRNA experimentation continues in cows at Iowa State University\n\nIn fact, the Veterinary Microbiology and Preventive Medicine Department at Iowa State University is testing out an mRNA vaccine system on cows. The stated goal is to induce immunological protection in cows that are prone to RSV infection. The vaccine platform includes a prefusion F mRNA delivered continuously by a vaccine implant. The implant delivers preprogrammed mRNA into the cow’s cells, instructing the cells to produce a pathogenic protein antigen that the cow’s immune cells are trained to attack. The technology will be first carried out in mice, before it is unleashed as a “cost-effective way” to sustain cow populations.\n\nAs of April 5, 2023, the National Cattlemen’s Beef Association heeded, “There are no current mRNA vaccines licensed for use in beef cattle in the United States. Cattle farmers and ranchers do vaccinate cattle to treat and prevent many diseases, but presently none of these vaccines include mRNA technology.” Their Association doesn’t seem concerned that mRNA experiments are headed into the beef supply.\n\nMerck and Genvax are in a race to transfect pork with mRNA injections\n\nThe drug company Merck has wasted no time getting their mRNA products into pork. In fact, pork producers have been using Merck’s Sequivity platform to re-engineer the cells of pigs to express various porcine diseases, including swine flu. This mRNA platform is mass producing toxins in pigs and forcing their immune cells to generate specific responses to the foreign bioweapon proteins. To make matters worse, this mRNA platform has not yielded any specific benefit to pork populations. Sow mortality rates have increased from 11.1% in 2017 to 12.6% in 2021. Suffice to say, the mRNA platform has not fixed the problems in the pork industry and may even hasten the destruction of pork populations long term, as the animals’ immune systems become (weakened) dependent on the programming of the mRNA from season to season.\n\nThe race to pollute the food supply with mRNA bioweapons does not stop there. Genvax Technologies is advancing a self-amplifying mRNA vaccine into livestock populations. The startup has secured $6.5 million in funding from United Animal Health, Johnsonville Ventures, the Iowa Corn Growers Association the Summit Agricultural Group, and the Ag Startup Engine. They have also secured additional grants from the USDA-Agricultural Research Services Plum Island Animal Disease Center and the Foundation for Food and Agriculture Research. This mRNA platform is being promoted as a solution in the fight against existing and emerging threats to the food supply chain. The mRNA will program the swine to produce proteins modeled after African swine fever variants. When a new outbreak is identified, the mRNA platform will be deployed to engineer the livestock’s cells for a mutant-specific immune response. The animals are engineered using a transgene or “gene of interest” that is matched to the dominant variant strain in circulation.\n\nVegetables are no longer sacred, as their genetic integrity is polluted by federally-funded mRNA experiments\n\nThe mRNA platform is also being unleashed through basic vegetables. Researchers from the University of California Irvine and University of California, Riverside have found a way to incorporate mRNA into lettuces, tomatoes and other vegetables. Scientists are creating transgenic, chimeric plants that have DNA that is combined with DNA from viruses and animals. These scientists are pushing mRNA in vegetables, thanks to a $500,000 grant from the National Science Foundation, a funding apparatus of the NIH, whose directors are appointed by the President of the United States.\n\nIn the race to hack humans and control populations, not even the food supply is sacred. Legislatures across the United States must move quickly to protect the future of the food supply, and the genetic integrity of plants, animals, and humans. The impending failures of mRNA experiments and the deleterious consequences of man trying to play God are only a matter of time; inevitable.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Mad scientists are now experimenting with mRNA injections in beef, poultry, pork, and produce... food supply bioweapons?", "url": "https://www.naturalnews.com/2023-04-14-mad-scientists-now-experimenting-with-mrna-bioweapons.html", "type": "article", "article:published_time": "2023-04-14T23:04:36+00:00", "article:modified_time": "2023-04-15T11:24:43+00:00", "updated_time": "2023-04-15T11:24:43+00:00", "article:section": "vaccines", "description": "Scientists across the United States are receiving massive funding to test out novel mRNA vaccine systems on rodents, livestock, and produce. The deleterious nature of the mRNA platform and the deadly failures of its application in human populations has not stopped the US government from funding new", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/04/Cattle.png"}, "tags": ["beef", "badfood", "conspiracy", "food experimentation", "hacking humans", "badhealth", "deception", "food safety", "Censored Science", "bioweapons", "Poultry", "spike proteins", "genetic integrity", "Pork", "National Science Foundation", "transparency", "chimeric viruses", "food science", "animal experimentation", "research", "immune cell hacking", "food supply", "badscience", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://www.theorganicprepper.com/mrna-vaccines-in-meat/", "https://portal.nifa.usda.gov/web/crisprojectpages/1027610-novel-mrna-vaccine-technology-for-prevention-of-bovine-respiratory-syncytial-virus.html", "http://worldagriculture.news", "https://www.brighteon.tv", "https://www.porkbusiness.com/news/industry/genvax-technologies-secures-65-million-advance-novel-vaccine-platform", "https://www.porkbusiness.com/news/hog-production/mortality-continues-challenge-pork-producers", "https://naturalnews.com/2022-03-25-scientists-to-create-chimeric-mrna-vaccines-food.html", "https://www.universityofcalifornia.edu/news/grow-and-eat-your-own-vaccines", "https://www.nsf.gov/", "https://naturalnews.com/2022-05-02-world-economic-forum-believes-people-useless-eaters.html", "http://research.news", "https://www.theorganicprepper.com/mrna-vaccines-in-meat/", "https://portal.nifa.usda.gov/web/crisprojectpages/1027610-novel-mrna-vaccine-technology-for-prevention-of-bovine-respiratory-syncytial-virus.html", "https://www.porkbusiness.com/news/industry/genvax-technologies-secures-65-million-advance-novel-vaccine-platform", "https://www.porkbusiness.com/news/hog-production/mortality-continues-challenge-pork-producers", "https://naturalnews.com/2022-03-25-scientists-to-create-chimeric-mrna-vaccines-food.html", "https://www.universityofcalifornia.edu/news/grow-and-eat-your-own-vaccines", "https://www.nsf.gov/", "https://naturalnews.com/2022-05-02-world-economic-forum-believes-people-useless-eaters.html", "https://www.brighteon.com/3487a782-0332-4202-b6c5-fea80c33ee0b", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-04-14-mad-scientists-now-experimenting-with-mrna-bioweapons.html&linkname=Mad%20scientists%20are%20now%20experimenting%20with%20mRNA%20injections%20in%20beef%2C%20poultry%2C%20pork%2C%20and%20produce%E2%80%A6%20food%20supply%20bioweapons%3F", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-04-14T23:04:36+00:00"}