{"result_id": "212012", "URL": "https://www.naturalnews.com/2023-02-17-scientists-call-for-end-to-covid19-vaccines.html", "timestamp": "2023-04-25 16:28:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,biomedical research,harmful medicine,health,heart attack,medicine,science,toxic chemicals,vaccines,adjuvant,badhealth,badmedicine,badscience,big pharma,blood damage,caesium,cardiotoxin,dangerous medicine,foreign structures,heart attack,inflammation,lipid nanoparticles,peg,pentavalent sodium stibogluconate,pharmaceutical fraud,research,spike proteins,toxic metals,vaccine damage", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-02-17-scientists-call-for-end-to-covid19-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Over 60 scientists call for an end to covid-19 “vaccines” after documenting foreign toxins that damage the blood and impede circulation", "cleaned_text": "(Natural News) The German Working Group for Covid Vaccine Analysis – which includes over 60 scientists, doctors, lawyers, and journalists – published their “Summary of Preliminary Findings” on the toxic substances they are finding in covid-19 vaccine samples and the changes they are seeing in the blood samples taken from vaccinated individuals.\n\nThe scientists “frequently observed an unusually rapid disintegration of the different types of cells in the vaccinated blood” and found concerning rouleaux formations of red blood cells specifically in the vaccinated samples.\n\nBecause of these issues, the Working Group is calling for all covid-19 vaccine programs to end. “In order to avert a direct and imminent danger to human life and public safety, we ask that the Covid-19 vaccination programmes be discontinued immediately,” the Group’s report stated. The report has been sent to all members of the Lower House of Parliament in Germany and is being investigated by scientists and doctors of various disciplines.\n\nThe foreign, complex structures that have been isolated in the vaccine lots have also been found in the blood of vaccinated individuals. The Working Group used artificial intelligence to examine, with precision, differences in the blood of vaccinated and unvaccinated individuals. These toxic substances are having a profound negative impact on the blood of vaccinated individuals, as seen under dark-field microscopy. These inflammatory changes to the blood are taking place regardless of the incidence and severity of the side effects that vaccinated individuals experience. The covid-19 vaccines can cause long term changes in blood composition, without the vaccinated person being aware of these changes.\n\nThe scientists wrote that the foreign objects are not the result of contamination because they are found in different blood samples from various vaccine lots. They warn that the size of the objects can “lead to disruption in the blood circulation in the vessels.”\n\nMuch of the damage is predicated on the stability of the envelope of the lipid nanoparticles. The lipid nano-particles are designed to evade detection and deliver mRNA instructions to the cells. When the nanoparticles remain stable and effectively do their job, the blood damage is more severe and the vaccine side effects are more frequent and pronounced.\n\nThe vaccine’s mRNA is encapsulated in a protective envelope of nano lipids. These nano lipids are made out of multiple layers of polyethylene glycol (PEG). Some people have antibodies to PEG, due to previous exposure to vaccines and pharmaceuticals that contain PEG. This may explain the different reactions to the vaccine. If a person’s immune system recognizes, attacks, and breaks down the PEG, then the mRNA will degrade and not make it to the ribosomes of the cells. If this happens, then the vaccine does not produce the spike proteins, does not cause a further immune response, and does not cause subsequent damage.\n\nResearchers used scanning electron microscopy (“SEM”) and corresponding energy dispersive X-ray spectroscopy (“EDX”) to investigate the different vials of covid-19 vaccines. The analysis found metallic elements in the Pfizer, Moderna, and AstraZeneca vaccines. These metallic elements included caesium, potassium, calcium, barium, cobalt, iron, chromium, titanium, cerium, gadolinium, aluminum, silicon, and sulfur. These elements were not found in the Johnson & Johnson (Janssen), Lubecavax, and Influspit Tetra vaccines.\n\nThe group hypothesized why the caesium was used in the vaccine. “From a medical point of view, caesium has no therapeutic value; on the contrary, one would have to assume that the addition of caesium disturbs the potassium balance and could cause vital cells (e.g., defense cells) to die in order to possibly accelerate the effect of the vaccination or to avoid endangering that effect.”\n\nThe Moderna vaccine also contained antimony, a highly toxic metal that could be used as an antiprotozoal adjuvant, serving an immunosuppressive effect. Notably, the vaccines contain pentavalent sodium stibogluconate. The side effects of this substance mirror the side effects commonly reported after vaccination, including: nausea, vomiting, myalgia, headache, lethargy and ECG changes. Long term side effects of pentavalent sodium stibogluconate administration in the blood also mirror long term side effects of vaccinated individuals, including damage to the liver and heart, pneumonia, blood count damage, and liver dysfunction.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Over 60 scientists call for an end to covid-19 “vaccines” after documenting foreign toxins that damage the blood and impede circulation", "url": "https://www.naturalnews.com/2023-02-17-scientists-call-for-end-to-covid19-vaccines.html", "type": "article", "article:published_time": "2023-02-17T23:07:10+00:00", "article:modified_time": "2023-02-17T23:07:10+00:00", "updated_time": "2023-02-17T23:07:10+00:00", "article:section": "Vaccines", "description": "The German Working Group for Covid Vaccine Analysis – which includes over 60 scientists, doctors, lawyers, and journalists – published their “Summary of Preliminary Findings” on the toxic substances they are finding in covid-19 vaccine samples and the changes they are seeing in the blood samples tak", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/02/covid-jab-analysis-2.png"}, "tags": ["cardiotoxin", "Big Pharma", "badhealth", "Toxic Metals", "lipid nanoparticles", "spike proteins", "heart attack", "vaccine damage", "caesium", "adjuvant", "pentavalent sodium stibogluconate", "PEG", "foreign structures", "Dangerous Medicine", "blood damage", "research", "inflammation", "badmedicine", "badscience", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://expose-news.com/2023/02/15/drs-covid-vaccines-toxic-change-blood/", "http://vaccineinjurynews.com", "https://www.brighteon.tv", "https://anamihalceamdphd.substack.com/api/v1/file/ee2cdead-884d-4ff8-9c09-5888f39345a2.pdf", "https://www.sciencedirect.com/science/article/pii/S0169409X20301083", "http://dangerousmedicine.com", "https://expose-news.com/2023/02/15/drs-covid-vaccines-toxic-change-blood/", "https://www.sciencedirect.com/science/article/pii/S0169409X20301083", "https://anamihalceamdphd.substack.com/api/v1/file/ee2cdead-884d-4ff8-9c09-5888f39345a2.pdf", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-02-17-scientists-call-for-end-to-covid19-vaccines.html&linkname=Over%2060%20scientists%20call%20for%20an%20end%20to%20covid-19%20%E2%80%9Cvaccines%E2%80%9D%20after%20documenting%20foreign%20toxins%20that%20damage%20the%20blood%20and%20impede%20circulation", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-02-17T23:07:10+00:00"}