{"result_id": "212047", "URL": "https://www.naturalnews.com/2023-04-10-cancers-other-diseases-developing-vaccinated-against-covid.html", "timestamp": "2023-04-25 16:29:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,cancer,coronavirus,diseases,harmful medicine,health,infectious diseases,medicine,science,vaccines,badcancer,badhealth,badmedicine,big pharma,biological weapon,cancer causes,cancer criminals,chemical violence,covid-19,dangerous medicine,pandemic,pharmaceutical fraud,spike protein,truth,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-04-10-cancers-other-diseases-developing-vaccinated-against-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Cancers and other diseases are \"rapidly developing\" among people vaccinated against COVID-19, warns expert", "cleaned_text": "(Natural News) There are many recorded cases of vaccine injuries and vaccine deaths during the Wuhan coronavirus (COVID-19) pandemic. An oncologist in the U.K. has written an open letter to the editor-in-chief of the medical journal The BMJ to warn about the harmful effects of coronavirus vaccines that must be “aired and debated immediately,” especially since cancers and other diseases are quickly progressing among vaccinated people.\n\nDr. Angus Dalgleish is a professor of oncology at St. George’s University of London. He sent his letter to Dr. Kamran Abbasi, the editor-in-chief of The BMJ.\n\nDalgleish’s letter was written in support of a colleague’s plea to Abbasi that the journal should make valid informed consent for COVID-19 vaccination a priority.\n\nIn the letter, Dalgleish wrote that the coronavirus doesn’t need a vaccine program since the average age of death from COVID-19 in the U.K. is 82 while the average age of death from all other causes is 81 and below.\n\nDalgleish added that the link with clots, myocarditis, heart attacks and strokes is currently well accepted, along with the link with health issues like myelitis and neuropathy.\n\nMyelitis is inflammation of the spinal cord while neuropathy is characterized by nerve damage that occurs due to different health conditions like diabetes.\n\nDalgleish added that he and his colleagues have already predicted these side effects in their June 2020 article published in the journal QRB Discovery. Their blast analysis also revealed 79 percent homologies to human epitopes, particularly PF4 and myelin.\n\nDalgleish warned that there is another important reason to halt all vaccine programs: He has seen stable disease rapidly progress in individuals after they were forced to get a COVID-19 booster shot.\n\nDalgleish has also witnessed people develop B cell-based disease after getting coronavirus booster shots. When asked, these people told him they felt unwell at least several days to weeks after getting the booster.\n\nAmong Dalgleish’s personal contacts, one developed leukemia and two work colleagues developed non-Hodgkin’s lymphoma.\n\nAn old friend of Dalgleish reported feeling like he has had long COVID-19 since getting a booster shot. He also experienced severe bone pain and was diagnosed with multiple metastases from a rare B-cell disorder.\n\nDalgleish warned that, based on his experience, these cases are not the coincidental anecdotes that other experts may suggest. The same pattern is being reported in other countries like Australia, Germany and the U.S.\n\nThe reports of innate immune suppression after mRNA injection for several weeks also fit, particularly since all of these patients, to date, have melanoma or B-cell-based cancers, which are very susceptible to immune control. All this has been recorded even before the reports of suppressor gene suppression by mRNA in laboratory experiments.\n\nDalgleish warned that his concerns “must be aired and debated immediately.” (Related: HISTORY REPEATS: Pfizer paid out $1.2B after its drug caused thousands of BREAST CANCER cases.)\n\nIn his letter, Dalgleish talked about B cell-based diseases and cancers. According to the British Society for Immunology, B-cells have a crucial role in regulating immune response.\n\nDysregulation of B-cell function may result in adverse effects like:\n\nBoosters also no longer necessary\n\nWhile treating cancer patients at the frontline, Dalgleish was shocked and dismayed by what he saw. He watched his relatives and friends gradually succumb to cancer after getting vaccinated.\n\nDalgleish also witnessed rapidly growing and fulminating cancers, and recurrences among people long cured or in remission from their cancers. In some cases, the cancers have been gone for 25 years or more.\n\nThese cancers are occurring among people who were vaccinated, and Dalgleish thinks COVID-19 booster injections could be triggering these cases.\n\nIn an interview with Dr. Tess Lawrie’s show Tess Talks, Dalgleish discussed what he is witnessing in his close contacts, like his patients, family and friends.\n\nDalgleish also talked about the role of cheap, established and generic medicines in treating cancer, and how these medications are being suppressed. He warned that those who have been in remission for years are now starting to relapse after receiving a coronavirus booster, at the same time asking why this is happening.\n\nThe professor also explained how his previous HIV research informed his understanding that the COVID-19 vaccines were linked to clotting and neurological issues.\n\nFinally, Dalgleish told Lawrie that he and his colleague raised the alarm and submitted their findings to the U.K. Cabinet. Unfortunately, Dalgleish lamented that no appropriate action has been taken despite their warnings.\n\nVisit VaccineHolocaust.org to learn more about the adverse effects of COVID-19 vaccines and booster shots.\n\nWatch the video below to find out why COVID-19 booster shots are more dangerous than the first dose of the vaccine.\n\nThis video is from the Truth or Consequences channel on Brighteon.com.\n\nCDC data reveal that multiple covid jabs can knock up to 24 years off a person’s expected lifespan.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Cancers and other diseases are \"rapidly developing\" among people vaccinated against COVID-19, warns expert", "url": "https://www.naturalnews.com/2023-04-10-cancers-other-diseases-developing-vaccinated-against-covid.html", "type": "article", "article:published_time": "2023-04-10T22:09:02+00:00", "article:modified_time": "2023-04-10T22:09:02+00:00", "updated_time": "2023-04-10T22:09:02+00:00", "article:section": "Vaccines", "description": "There are many recorded cases of vaccine injuries and vaccine deaths during the Wuhan coronavirus (COVID-19) pandemic. An oncologist in the U.K. has written an open letter to the editor-in-chief of the medical journal The BMJ to warn about the harmful effects of coronavirus vaccines that must be &qu", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/04/Vaccine-Vial-Bottles-Covid-19.jpg"}, "tags": ["pandemic", "vaccine damage", "covid-19", "cancer causes", "Big Pharma", "badcancer", "badhealth", "cancer criminals", "vaccine injury", "badmedicine", "pharmaceutical fraud", "spike protein", "truth", "vaccines", "chemical violence", "biological weapon", "Dangerous Medicine"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://expose-news.com/2023/03/27/cancers-are-rapidly-developing-post-covid-vaccination/", "https://www.sgul.ac.uk/", "https://www.naturalpedia.com/myocarditis-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.ninds.nih.gov/health-information/disorders/transverse-myelitis", "https://www.everydayhealth.com/neuropathy/guide/", "https://www.cambridge.org/core/journals/qrb-discovery/article/biovacc19-a-candidate-vaccine-for-covid19-sarscov2-developed-from-analysis-of-its-general-method-of-action-for-infectivity/DBBC0FA6E3763B0067CAAD8F3363E527", "https://www.brighteon.tv", "https://www.naturalpedia.com/leukemia-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.naturalpedia.com/lymphoma-causes-side-effects-and-treatments-at-naturalpedia-com.html", "http://immunesystem.news", "https://www.naturalpedia.com/cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://naturalnews.com/2023-01-19-pfizer-paid-billion-drug-caused-breast-cancer.html", "https://www.naturalpedia.com/hiv-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://cancerscams.com/", "https://vaccineholocaust.org/", "https://www.brighteon.com/247d74a4-62a8-4e1c-9ef8-481ab794f220", "https://www.brighteon.com/channels/triplee495", "https://naturalnews.com/2023-02-06-naomi-wolf-exposed-pfizer-illegal-vaccine-trial-childen.html", "https://naturalnews.com/2023-02-09-cdc-data-covid-vaccines-24-years-aging.html", "https://naturalnews.com/2023-02-09-naomi-wolf-covid-vaccine-war-women-fertility.html", "https://expose-news.com/2023/03/27/cancers-are-rapidly-developing-post-covid-vaccination/", "https://www.ninds.nih.gov/health-information/disorders/transverse-myelitis", "https://www.everydayhealth.com/neuropathy/guide/", "https://www.cambridge.org/core/journals/qrb-discovery/article/biovacc19-a-candidate-vaccine-for-covid19-sarscov2-developed-from-analysis-of-its-general-method-of-action-for-infectivity/DBBC0FA6E3763B0067CAAD8F3363E527", "https://www.brighteon.com/247d74a4-62a8-4e1c-9ef8-481ab794f220", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-04-10-cancers-other-diseases-developing-vaccinated-against-covid.html&linkname=Cancers%20and%20other%20diseases%20are%20%E2%80%9Crapidly%20developing%E2%80%9D%20among%20people%20vaccinated%20against%20COVID-19%2C%20warns%20expert", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-04-10T22:09:02+00:00"}