{"result_id": "212024", "URL": "https://www.naturalnews.com/2022-01-04-10-million-people-per-day-are-set-on-irreversible-countdown-to-vaccine-death.html", "timestamp": "2023-04-25 16:28:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "health ranger,health ranger,badhealth,badmedicine,bioweapons,depopulation,genocide,mass casualty event,vaccine deaths,vaccine wars,vaccines", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2022-01-04-10-million-people-per-day-are-set-on-irreversible-countdown-to-vaccine-death.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "GLOBAL ALERT: An estimated 10 million people PER DAY are set on irreversible countdown to vaccine death that could exterminate BILLIONS if not stopped in the next year", "cleaned_text": "(Natural News) This is a red alert for humanity. We have less time remaining than you might think.\n\nI’ve done some rough math, and it’s beyond alarming. It spells the end of human civilization if we don’t stop the vaccine holocaust in the next 365 days.\n\nAs estimates and projections show below, as long as “clot shot” covid vaccines are being administered around the world, about ten million people each day are being put on an irreversible countdown to vaccine death. For each day that these vaccine shots continue, in other words, roughly ten million people will likely die over the next decade, based on these projections. (See the math below.)\n\nThis explains why Biden and other world leaders don’t care about legal challenges and the rule of law. They know that if they can bully these vaccines into people for just one more year, they will murder over 3.5 billion more human beings from vaccine-induced deaths that kick in over the next decade.\n\nThat’s why we have less time remaining than you might think. And that’s why the vaccine zealots don’t care if they get stopped over the next 2-3 years by court challenges. By then it’s too late for humanity.\n\nEven if we stop all covid vaccines right now, we’re likely to still see between one and two billion deaths over the next decade as vaccine deaths take their toll. (See the numbers below.)\n\nDisclaimer: The numbers presented here are estimates and projections based on early data available now. These estimates may substantially improve or worsen as new data become available. These conclusions are subject to change based on new data as it is released for total mortality, cancer deaths and other factors. These conclusion are not peer-reviewed. Comments and suggestions are welcomed. See below for full details.\n\nBy the way, remember that Reuters “fact checkers” are all compromised because Reuters is the propaganda arm of Pfizer. They share some of the same board members. The job of Reuters is to pump out Pfizer disinformation and label it “facts.” These so-called “facts” are then used to suppress the truth on social media platforms like Facebook. It’s all a grand evil conspiracy involving Pfizer, Reuters, Facebook and a true depopulation agenda to mass murder billions of human beings.\n\nAs Dr. Robert Malone has recently pointed out, we are living through a “mass casualty event” that looks a lot like genocide: (emphasis ours)\n\nIt is starting to look to me like the largest experiment on human beings in recorded history has failed. And, if this rather dry report from a senior Indiana life insurance executive holds true, then Reiner Fuellmich’s “Crimes against Humanity” push for convening new Nuremberg trials starts to look a lot less quixotic and a lot more prophetic.\n\nAT WORST, this report implies that the federal workplace vaccine mandates have driven what appear to be a true crime against humanity. Massive loss of life in (presumably) workers that have been forced to accept a toxic vaccine at higher frequency relative to the general population of Indiana.\n\nThis article reads like a dry description of an avoidable mass casualty event caused by a mandated experimental medical procedure. One for which all opportunities for the victims to have become self-informed about the potential risks have been methodically erased from both the internet and public awareness by an international corrupt cabal operating under the flag of the “Trusted News Initiative”. George Orwell must be spinning in his grave.\n\nLooking at the evidence\n\nThe VAERS system is currently reporting roughly 21,000 post-vaccine deaths in America. A well-documented URF (Under Reporting Factor) in normal times is around 40. This reveals that at least 840,000 Americans have already died from covid vaccines.\n\nYet we also know from credible sources such as attorney Thomas Renz and the Medicare whistleblower that VAERS data is months behind on data entry. The process of entering records into VAERS is being intentionally slowed to prevent these numbers from rapidly growing. Additionally — and critically — nurses are being actively ordered by doctors, hospitals and administrators to avoid submitting VAERS reports related to covid vaccines. This is widely documented in articles like this one from CitizensJournal.us:\n\nAngela, a nurse for more than 25 years, confirms that in her hospital’s emergency room, they say they are seeing more heart problems in young adults, which are never reported to the Vaccine Adverse Event Re­porting System (VAERS) as potential ad­verse reactions to COVID “vaccinations.”\n\nAnother nurse, Jennifer, says ER nurs­es privately say they are seeing “all the clot­ting, bleeding and things you would expect from the vaccine six months later — brain bleeds, heart attacks in younger 50-year-olds. No doctor will admit this is from the vaccine. They won’t make the VAERS re­port.”\n\nWhen Daniel asked fellow nurses and practitioners if they report to VAERS, they looked at him like, “What’s that?”\n\nAll nurses interviewed say they are seeing “ground-glass opacity” results in the CT scans of people’s lungs who recently took the experimental vaccines — and that this is never reported to VAERS.\n\nWe also know from anecdotal evidence that a shocking number of US doctors have no idea what VAERS is. They make no reports whatsoever and aren’t even aware of the existence of this system. This fact, combined with the realization that nurses are being actively ordered to avoid VAERS reporting on covid vaccines, means the URF of 40 is far too low. Given the environment of extreme suppression now leveled against doctors and nurses to try to cover up vaccine injuries, a more legitimate estimate of the URF would be 200.\n\nIf accurate, this would mean that 21,000 VAERS reports actually translated into 4.2 million US deaths from these vaccines so far.\n\nBookmark that thought as we look at other numbers that paint a truly frightening picture.\n\nVaccines kill people in three phases, taking as long as a decade for all the vaccine-induced cancer deaths to play out\n\nAlthough we’ve all seen people literally keel over dead from vaccine-induced heart attacks, most people who are on track to die from covid vaccines don’t die right away. There are three phases of covid vaccine mortality, described in this chart below:\n\nRemember that according to Dr. Ryan Cole, a Mayo Clinic trained, board-certified anatomic pathologist, 62% of patients injected with mRNA vaccines show micro blood clots. Dr. Cole presents this evidence in the following video from the White Coat Summit:\n\nMicro blood clotting is an early sign of vascular damage and heart damage. People receiving covid vaccines are often diagnosed with myocarditis, which has a 56% fatality rate over five years.\n\nA study published by the American Heart Association — then widely censored by Big Tech — found that mRNA covid vaccines greatly increased the risk of vascular inflammation and therefore heart attacks and other vascular events. The risk of heart attack alone increased by 127% in a group of 500 patients, according to this one study.\n\nA new study suggests the mRNA injections produced by both Pfizer and Moderna are raising inflammatory blood markers used to estimate the risk of a person suffering a heart attack.\n\nDr Aseem Malhotra, a consultant cardiologist, points out that in the UK there have been 10,000 excess non-Covid deaths — many of which were due to heart attack and stroke.\n\nA few days after these ominous results came out, a whistleblower and researcher from a different group contacted Dr Aseem Malhotra to say that in imaging studies they have found inflammation in the coronary arteries after vaccination. But they decided not to publish this yet because they are afraid of losing future grant money from the drug industry. The whistleblower was quite upset about this.\n\nDr. Charles Hoffe (Canada) is also reporting substantial increases in blood clotting among mRNA vaccine takers. Via LifeSiteNews:\n\nThe core problem he has seen are microscopic clots in his patients’ tiniest capillaries. He said, “Blood clots occurring at a capillary level. This has never before been seen. This is not a rare disease. This is an absolutely new phenomenon.”\n\nMost importantly, he has emphasized these micro-clots are too small to show up on CT scans, MRI, and other conventional tests, such as angiograms, and can only be detected using the D-dimer blood test, a standard test that indicates whether blood clots are being actively formed somewhere within a person’s vascular system.\n\nUsing the latter, he found that 62 percent of his patients injected with an mRNA shot were positive for clotting, not a small fraction that can be easily dismissed.\n\nThrough simple math, if we take 62 percent of covid vaccinated people who show micro blood clots — leading to myocarditis — and multiply by the known myocarditis 56% fatality rate over five years, this alone would mean that 36% of mRNA vaccine takers will be dead in five years. Granted, this assumes that all the micro blood clot people end up with myocarditis, and that relationship isn’t yet satisfactorily documented. So this 36%, based entirely on heart attack deaths, may be too high by itself.\n\nYet this only begins to tell the story of deaths from other causes such as vaccine-induced cancer. Another fact we now know is that once mRNA vaccines start producing spike protein nanoparticles in a person’s body, some percentage of those spike proteins enter cell nuclei and achieve about a 90% suppression of the NHEJ mechanism, which is the chromosomal repair mechanism that maintains genetic integrity for the body.\n\nSee this Nov. 2, 2021 article – Vaccine spike protein enters cell nuclei, suppresses DNA repair engine of the human body, will unleash explosion of cancer, immunodeficiency, autoimmune disorders and accelerated aging.\n\nThat article cites a critical research paper entitled, “SARS–CoV–2 Spike Impairs DNA Damage Repair and Inhibits V(D)J Recombination In Vitro,” authored by Hui Jiang and Ya-Fang Mei, at the Department of Molecular Biosciences, The Wenner–Gren Institute, Stockholm University, SE-10691 Stockholm, Sweden, and the Department of Clinical Microbiology, Virology, Umeå University, SE-90185 Umeå, Sweden, respectively. You can see an archived PDF of this study at:\n\nIn the conclusion of the paper, authors write, “We found that the spike protein markedly inhibited both BRCA1 and 53BP1 foci formation (Figure 3D–G). Together, these data show that the SARS–CoV–2 full–length spike protein inhibits DNA damage repair by hindering DNA repair protein recruitment.”\n\nThe study finds that the suppression of NHEJ activity exhibits a dose-dependent response to the presence of spike protein. This means that spike proteins in the cells will cause the suppression of chromosomal repair mechanisms, leading to loss of genetic integrity over time.\n\nIn effect, once people are injected with mRNA vaccines, when they are subsequently exposed to even mild sources of ionizing radiation — sunlight, mammography, high-altitude commercial air flights, food plastics chemicals, etc. — their bodies may initiate the growth of new cancer tumors that cannot be suppressed because the NHEJ system is no longer functioning.\n\nIn effect, people will become mutants because they can no longer maintain genetic integrity due to the spike protein suppression of the NHEJ repair mechanism.\n\nWe are already seeing reports of alarming increases in cancers among the vaccinated. For example, as reported from Cancer.news:\n\nWomen recently injected with experimental covid vaccines are showing symptoms of BREAST CANCER\n\nA group of Utah doctors have discovered something terrifying in recent mammogram screenings taken at the Breast Care Centre in Salt Lake City, Utah. Women who were recently injected with experimental COVID vaccines suffer from abnormal inflammation of the lymph nodes in their breasts. According to the Intermountain Healthcare doctors, women who take the covid-19 vaccines are showing symptoms of breast cancer.\n\nDr. Brett Parkinson, MD., warns, “Whenever we see these on a normal screening mammogram, we call those patients back because it can either mean metastatic breast cancer which travels to the lymph nodes or lymphoma or leukemia.” Instead of dealing with the cause of this problem (vaccines), the doctors are now telling women not to get mammograms after vaccination.\n\nAnd from Vaccines.news: Idaho doctor reports “20 times increase” in cancer among those “vaccinated” for covid:\n\nIn a video produced by the Idaho state government’s “Capitol Clarity” project, Cole revealed how he is now seeing a 2,000 percent chronic illness increase in folks who took [the vaccine].\n\n“Since January 1, in the laboratory, I’m seeing a 20-times increase of endometrial cancers over what I see on an annual basis,” Cole stated in the video.\n\n“I’m not exaggerating at all because I look at my numbers year over year, and I’m like ‘Gosh, I’ve never seen this many endometrial cancers before.’”\n\nIn a “normal” year, there are around 600,000 cancer deaths in the United States. With the spike protein suppressing NJEH by 90%, and with doctors already reporting a 2000% increase in one type of cancer (endometrial) from early 2020, it’s clear that cancer deaths are going to substantially increase in the coming years due to covid vaccines.\n\nAdd that data point to the big picture here.\n\nA 40% increase in all cause mortality, says life insurance CEO\n\nProviding an additional clue to all this, we have recently reported on the shocking interview with Scott Davison, CEO of OneAmerica, a life insurance company. Davison reveals that all-cause mortality is up 40% among their life insurance policy holders, which covers a wide range of people, aged 18 – 64. Davison refers to this as, “the highest death rates we have seen in the history of this business – not just at OneAmerica.”\n\nThis observation is based on third quarter data from 2021. The numbers for Q4 will look far worse due to the well documented fact that VE numbers (Vaccine Effectiveness) plummet with each passing week after vaccination, representing a continued destruction of the immune system. As more time goes by, those who took the vaccines have weaker and weaker immune systems, making them more vulnerable to common infections and flu strains that would normally be of little threat. This is confirmed by official government data from the UK as well as independent research such as this study from the Francis Crick Institute in the UK: Pfizer vaccine destroys T cells, weakens the immune system – study:\n\nA study from the Francis Crick Institute in the United Kingdom has found that the Pfizer-BioNTech Wuhan coronavirus (COVID-19) vaccine destroys T cells and weakens the immune system… It found that only 50 percent of the people who received a single dose of the Pfizer vaccine had a quantifiable neutralizing antibody response against the alpha variant of COVID-19. This number decreased even further to just 32 percent and 25 percent for the delta and beta variants, respectively.\n\nA 40% increase in all-cause mortality, if applied across all age groups, means that an additional 3,100 Americans are dying each day. That’s over 90,000 people per month being killed by the vaccine as of Q3, 2021. (The normal pre-covid death rate is around 7,700 per day in the USA.)\n\nWe estimate that by the time Q1, 2022 data are available, we will likely see up to a 60% increase in all cause mortality, leading to an additional 4,600 deaths per day. This alone is nearly 1.7 million deaths per year, or about half a percent of the entire US population.\n\nMy (conservative) prediction is that as post-vaccine cancer deaths take hold, we are going to see, at minimum, a 400% increase in cancer deaths starting in 2022. That’s roughly 2.4 million vaccine-related cancer deaths per year for the foreseeable future, very likely continuing through the next decade.\n\n93% of post-vaccine deaths attributed to the vaccine itself\n\nOne more factor to consider in all this is the astonishing research conducted by Drs. Bhakdi and Burkhardt, commented on by Steve Kirsh at Substack.com.\n\nAlthough the sample size was small (15 autopsies), it showed that 93% of people who died after being vaccinated were, in fact, killed by the vaccine. As Kirsh explains:\n\nThe coroner or the public prosecutor didn’t associate the vaccine as the cause of death in any of the cases. However, further examination revealed that the vaccine was implicated in the deaths of 14 of the 15 cases. The most attacked organ was the heart (in all of the people who died), but other organs were attacked as well. The implications are potentially enormous resulting in millions of deaths. The vaccines should be immediately halted.\n\nImportantly, as Dr. Bhakdi explains on video, these autopsies showed that people were killed by killer lyphocytes attacking their own organs such as the heart and lungs.\n\nIn other words, mRNA covid vaccines caused the body’s own immune system to start growing lymphocyte tissues in places where it doesn’t belong, such as the heart and other organs.\n\nThis shocking finding caused former Pfizer VP Mike Yeadon to write Steve Kirsh and explain, “This is about the worst 15 min (video) I’ve ever seen. Mass covid19 vaccination is leading to mass murder.”\n\nThat video is shown here:\n\nEssentially, what Dr. Bhakdi’s findings reveal is that far more people are now dying from the vaccine than from natural causes. This would imply that the pre-covid daily death rate of 7,700 Americans (that’s per day) is about to be dwarfed by vaccine-induced deaths which will, at some point, emerge as a multiple of 7,700.\n\nIt’s not unreasonable to imagine that over the next few years as cancer tumors and lymphocyte attacks accelerate, we could start to see daily deaths in America exceeding 16,000 or even 30,000 as the post-covid vaccine deaths accelerate.\n\nAt 30,000 deaths per day, by the way, the number of dead in a year reaches nearly 11 million people, or about 3.3% of the total U.S. population expiring in a given year. Over a decade, that’s about a third of the current population. These are projections, of course, but they are rooted in early evidence and observation.\n\nConservatively, one-third of all who received covid vaccines will likely die over the next decade… and another third will be debilitated\n\nBased on the cancer deaths, myocarditis deaths, autoimmune deaths, heart attack deaths and the increased risks of strokes, neurological disorders and organ failure, we can conservatively conclude that roughly:\n• One-third of those who took mRNA covid vaccines will be dead over the next ten years.\n• One-third will be injured or debilitated and unlikely to be capable of participating in society in a meaningful way.\n• One-third will be relatively unaffected.\n\nInterestingly, this appears to coincide with the statistical analysis of covid vaccine lot numbers, where roughly one-third of the lots are associated with heart attacks and deaths, another third are associated with injuries (but not death), and a final third appear to be harmless (suspected to be saline).\n\nAgain, these are rough numbers and there will be disagreement about many of the projections made here, but this is an early snapshot and projection based on what we know so far. Obviously, these conclusions are subject to change as new data appear, and the final number by the end of 2032 could be radically different from these projections (far worse or perhaps far better).\n\n30 million people per day are being vaccinated around the world\n\nNow let’s look at what this means globally if we conclude that roughly one-third of vaccinated people will die over the next decade.\n\nRight now, about 30 million people are being vaccinated each day across the globe, according to OurWorldInData.org.\n\nThat same site says that 58.5% of the world’s population have been vaccinated with at least one dose, and that 9.25 billion doses have been administered (data accessed on 1/4/2022).\n\nIf one-third of vaccinated people are set on a path to die from the vaccine over the next decade, then each day that these vaccines continue, about 10 million people are being sentenced to death.\n\nIf this continues for just one more year — 365 days — this would mean an additional 3.65 billion people will be exterminated by vaccines and die from vaccine-induced fatalities over the next decade or so. That’s roughly half the world’s population, by the way.\n\nIf you’re wondering how more than one-third of the world’s population can be exterminated if only one-third of the vaccine lots are so-called “kill shots,” remember that people are being given multiple injections via “boosters.” Thus, one person can be injected five or six times with mRNA shots, and even if only one-third of those shots are “kill shots,” their chances of escaping the kill shot dwindle rapidly. It’s like playing vaccine roulette.\n\nStatistically speaking, here are the odds of EVADING a kill shot if a person continues to take more injections, given the assumption that one-third of the lots are deadly:\n\nAs you can see, if the governments of the world can coerce people into taking six shots, they can kill over 90% of the world’s population, given that one-third of vaccine lots are kill shots and assuming a 100% kill rate over time.\n\nThus, the only way to stop this vaccine holocaust is to stop the vaccines.\n\nFor each additional day that the depopulation globalists run their vaccine holocaust campaign, they are likely exterminating an additional 10 million people over time.\n\nThat’s a World War II Nazi Holocaust every 14.4 hours, in terms of innocent lives destroyed.\n\nIt also means that nearly 7,000 lives are being destroyed per minute as this vaccine holocaust continues.\n\nThis also means that each day earlier that we stop the holocaust, we potentially save 10 million lives.\n\nHence the urgency of our mission. If we stop the vaccine holocaust right now, we still lose 1.5 billion human beings from vaccine-induced deaths over the next ten years. Importantly, human civilization can probably survive such a hit, as devastating as it might be.\n\nBut if this vaccine holocaust continues for just one more year, globalists could have set into motion the deaths of potentially an additional 3.6 billion people on top of the 1.5 who are already on the death clock countdown. That means we could lose over 5 billion human beings in the next decade, simply stemming from our inability to stop this holocaust in the next 365 days.\n\nThe important question becomes: Can human civilization remain intact if we lose over 50% of the population?\n\nI don’t have the answer to that, but given the complexity of our modern society, it seems likely that a systemic collapse — “great reset” — would be inevitable. It also seems that this is what the globalists are trying to achieve.\n\nNote carefully that no one in government power is suggesting we pause the vaccines, wait a year and see how many people die. No, they prefer to charge ahead at full speed — damn the consequences! — and then blame the unvaccinated for the mass deaths of the vaccinated.\n\nClearly, they are bad faith actors. They are not trying to save lives; they’re working to exterminate them.\n\nFind more details in today’s Situation Update podcast here:\n\nWe post a new podcast each day at:\n\nAlso follow me on:", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "GLOBAL ALERT: An estimated 10 million people PER DAY are set on irreversible countdown to vaccine death that could exterminate BILLIONS if not stopped in the next year", "url": "https://www.naturalnews.com/2022-01-04-10-million-people-per-day-are-set-on-irreversible-countdown-to-vaccine-death.html", "type": "article", "article:published_time": "2022-01-04T21:53:48+00:00", "article:modified_time": "2022-01-04T21:53:48+00:00", "updated_time": "2022-01-04T21:53:48+00:00", "article:section": "Health Ranger", "description": "This is a red alert for humanity. We have less time remaining than you might think.\r\n\r\nI've done some rough math, and it's beyond alarming. It spells the end of human civilization if we don't stop the vaccine holocaust in the next 365 days.\r\n\r\nAs estimates and projections show below,", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2022/01/HRR-2022-01-04-Situation-Update-1.jpg"}, "tags": ["bioweapons", "vaccine wars", "Vaccine deaths", "badhealth", "genocide", "depopulation", "badmedicine", "vaccines", "mass casualty event"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://www.brighteon.tv", "https://rwmalonemd.substack.com/p/what-if-the-largest-experiment-on", "https://www.citizensjournal.us/ventura-county-nurses-blow-the-whistle-on-crisis-in-local-health-care/", "https://www.ahajournals.org/doi/10.1161/circ.144.suppl_1.10712", "https://dailyexpose.uk/2021/12/02/study-finds-covid-vaccines-increase-the-risk-of-heart-attack/", "https://www.lifesitenews.com/opinion/from-shots-to-clots-covid-vaccine-induced-blood-clots/", "https://spikeprotein.news/2021-11-02-science-horror-vaccine-spike-protein-enters-cell-nuclei-suppresses-dna-repair-engine-of-the-human-body-cancer-aging.html", "https://www.naturalnews.com/files/viruses-13-02056-v2.pdf", "https://cancer.news/2021-03-01-women-injected-covid-vaccines-symptoms-breast-cancer.html", "https://vaccines.news/2021-09-14-idaho-doctor-20times-increase-cancer-vaccinated-covid.html", "https://www.naturalnews.com/2022-01-03-life-insurance-companies-sound-death-alert-warnings-over-excess-deaths-covid.html", "https://naturalnews.com/2021-08-22-study-pfizer-vaccine-destroys-t-cells-weakens-immune-system.html", "https://stevekirsch.substack.com/p/bhakdiburkhardt-pathology-results", "http://Brighteon.com/2d124f9e-e8f3-4938-a4ab-f9358d580a52", "https://ourworldindata.org/covid-vaccinations#what-share-of-the-population-has-received-at-least-one-dose-of-the-covid-19-vaccine", "http://Brighteon.com/72f2d8d5-0d32-474f-af5e-85ef8d227475", "https://www.brighteon.com/channels/hrreport", "https://t.me/RealHealthRanger", "http://Brighteon.social/@HealthRanger", "http://Parler.com/user/HealthRanger", "http://GETTR.com/user/healthranger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2022-01-04-10-million-people-per-day-are-set-on-irreversible-countdown-to-vaccine-death.html&linkname=GLOBAL%20ALERT%3A%20An%20estimated%2010%20million%20people%20PER%20DAY%20are%20set%20on%20irreversible%20countdown%20to%20vaccine%20death%20that%20could%20exterminate%20BILLIONS%20if%20not%20stopped%20in%20the%20next%20year", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2022-01-04T21:53:48+00:00"}