{"result_id": "212054", "URL": "https://www.naturalnews.com/2023-04-07-australia-quietly-drops-approval-astrazeneca-covid-vaccine.html", "timestamp": "2023-04-25 16:29:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,coronavirus,harmful medicine,health,infectious diseases,medicine,vaccines,vaccines,approval,astrazeneca,australia,awakening,badhealth,badmedicine,big government,big pharma,blood clots,covid-19,dangerous medicine,low platelet count,pandemic,pharmaceutical fraud,progress,therapeutic goods administration,tts,vaccine,vaccine damage,vaccine injury,wuhan coronavirus", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-04-07-australia-quietly-drops-approval-astrazeneca-covid-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Australia quietly drops approval for AstraZeneca COVID-19 vaccine", "cleaned_text": "(Natural News) Australia has quietly dropped its approval of the Wuhan coronavirus (COVID-19) vaccine made by AstraZeneca.\n\nThe move came in the form of an update to the website of the Australian Department of Health and Aged Care (DHAC). According to the update, AstraZeneca’s COVID-19 injection “is no longer available as an approved vaccine” as of March 20, 2023.\n\nA spokesperson for the DHAC said the phase-out of the vaccine was due to the availability of new options: “This was not a decision based on safety as some people have misrepresented on social media. As expected, first-generation vaccines have been superseded by newer vaccines targeting the strains of the virus now circulating.”\n\nThe spokesperson also clarified that the AstraZeneca vaccine “remains provisionally approved” by the Therapeutic Goods Administration (TGA) – the Australian counterpart of the U.S. Food and Drug Administration. “However, the sponsor made a commercial decision with respect to the supply of AstraZeneca vaccine in Australia,” the spokeperson added. (Related: Australia to SHUT DOWN domestic manufacturing of deadly AstraZeneca vaccine.)\n\nPeople younger than 60 years old were later advised against getting the vaccine. The AstraZeneca COVID-19 injection has been linked to the serious side effect of thrombosis with thrombocytopenia syndrome (TTS) – which involves blood clots combined with low levels of blood platelets. According to a June 2022 report by the TGA, there were eight fatalities confirmed to be from TTS after AstraZeneca vaccination.\n\nAccording to Healthline, the AstraZeneca vaccine makes use of an adenovirus to carry SARS-CoV-2 spike proteins. It can also be kept in a regular refrigerator, unlike the Pfizer and Moderna vaccines that require sub-zero temperatures.\n\nIn 2021, several countries began to suspend their use of the AstraZeneca vaccine due to its links to TTS. Aside from this, studies also found “disappointing results” against new variants of the SARS-CoV-2 pathogen.\n\nSouth Africa led the way in suspending the use of AstraZeneca’s vaccine following a study that revealed the vaccine provides inadequate protection against infection among young people. It later canceled its rollout of the vaccine.\n\nSeveral Nordic countries followed suit – with Norway, Denmark and Iceland suspending the vaccine after more evidence of potential side effects emerges. Other countries in Europe such as Romania, Ireland, Sweden, France, Germany, Italy and Spain also temporarily suspended AstraZeneca’s vaccine for their vaccination programs. The European Medicines Agency – the European Union’s counterpart to the TGA and FDA – also acknowledged TTS as a side effect of the vaccine in April 2021.\n\nFollowing their decision to temporarily suspend the use of the AstraZeneca vaccine in March 2021, Norway and Denmark made the suspension permanent. The Norwegian government ruled to completely stop injecting the vaccine on May 12, 2021, following an expert committee’s broader assessment of the vaccine’s safety.\n\n“The risk of dying after vaccination with the AstraZeneca vaccine would be higher than the risk of dying from the disease, particularly for younger people,” the Norwegian expert committee concluded.\n\nVaccines.news has more stories about the AstraZeneca COVID-19 vaccine.\n\nWatch Jefferey Jaxen and Del Bigtree talk about TTS linked to AstraZeneca’s COVID-19 vaccine on “The HighWire.”\n\nThis video is from The HighWire with Del Bigtree channel on Brighteon.com.\n\nAstraZeneca drops plan to seek US approval for its COVID-19 vaccine.\n\nQueensland pulls AstraZeneca vaccine following more cases of blood clots.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Australia quietly drops approval for AstraZeneca COVID-19 vaccine", "url": "https://www.naturalnews.com/2023-04-07-australia-quietly-drops-approval-astrazeneca-covid-vaccine.html", "type": "article", "article:published_time": "2023-04-07T21:53:23+00:00", "article:modified_time": "2023-04-07T21:53:23+00:00", "updated_time": "2023-04-07T21:53:23+00:00", "article:section": "vaccines", "description": "Australia has quietly dropped its approval of the Wuhan coronavirus (COVID-19) vaccine made by AstraZeneca.\r\n\r\nThe move came in the form of an update to the website of the Australian Department of Health and Aged Care (DHAC). According to the update, AstraZeneca's COVID-19 injection \"is no", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/04/Coronavirus-Covid-19-AstraZeneca-Vacccine-Syringe-Vial.jpg"}, "tags": ["pandemic", "big government", "TTS", "Australia", "approval", "Big Pharma", "badhealth", "Therapeutic Goods Administration", "covid-19", "vaccine", "Blood clots", "Wuhan coronavirus", "pharmaceutical fraud", "Dangerous Medicine", "AstraZeneca", "vaccine injury", "progress", "badmedicine", "low platelet count", "awakening", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://www.theepochtimes.com/australia-discreetly-discontinues-astrazeneca-covid-vaccine_5169831.html", "https://www.naturalnews.com/2021-10-14-australia-shuts-down-manufacturing-astrazeneca-vaccine.html", "https://www.brighteon.tv", "https://www.healthline.com/health/adult-vaccines/astrazeneca-vaccine", "https://vaccines.news/", "https://www.brighteon.com/e60a0f4f-9ad2-4361-8ea2-f0e501cfc2c5", "https://www.brighteon.com/channels/highwire", "https://bigpharmanews.com/2022-11-13-astrazeneca-abandons-plan-us-approval-covid-vaccine.html", "https://health.news/2021-03-16-italy-poised-prosecute-astrazeneca-deadly-coronavirus-vaccines.html", "https://health.news/2021-05-27-queensland-suspends-astrazeneca-vaccine-following-blood-clots.html", "https://pharmaceuticalfraud.com/2021-04-23-denmark-permanently-stops-astrazeneca-coronavirus-vaccine-rollout.html", "https://dangerousmedicine.com/2021-05-10-norwegian-health-experts-recommend-astrazeneca-vaccine-ban.html", "https://www.theepochtimes.com/australia-discreetly-discontinues-astrazeneca-covid-vaccine_5169831.html", "https://www.healthline.com/health/adult-vaccines/astrazeneca-vaccine", "https://www.brighteon.com/e60a0f4f-9ad2-4361-8ea2-f0e501cfc2c5", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-04-07-australia-quietly-drops-approval-astrazeneca-covid-vaccine.html&linkname=Australia%20quietly%20drops%20approval%20for%20AstraZeneca%20COVID-19%20vaccine", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-04-07T21:53:23+00:00"}