{"result_id": "212014", "URL": "https://www.naturalnews.com/2023-03-06-study-millions-health-problems-covid-vaccines.html", "timestamp": "2023-04-25 16:28:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,biological agents and warfare,coronavirus,current events,deception,depopulation,genocide,harmful medicine,health,vaccines,adverse events,badhealth,badmedicine,badscience,big pharma,covid,dangerous medicine,heart disease,heart health,medical violence,mrna,myocarditis,pandemic,pharma fraud,real investigations,research,truth,vaccination,vaccine damage,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-03-06-study-millions-health-problems-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Exhaustive peer-reviewed study says MILLIONS worldwide now suffer from serious health problems caused by covid \"vaccines\"", "cleaned_text": "(Natural News) New research published in the peer-reviewed Nature Cardiovascular Research journal draws attention to the tens of millions of serious new health problems that have emerged worldwide ever since the launch of Operation Warp Speed.\n\nThe advent of Wuhan coronavirus (Covid-19) “vaccines” has triggered a spike in all sorts of deadly diseases afflicting the heart, skin, and brain, the paper reveals. And most of these afflictions persist for at least 90 days post-injection.\n\nFor their research, scientists looked at the same people before and after they were injected to determine how the shots changed their risk of developing new health problems. They found that the average person is 21 percent more likely to receive a new diagnosis in the three months after injection than in the three months prior to injection.\n\n“With almost 240 million American adults jabbed, the rise translates into millions of extra new medical problems found in the months after vaccination, and tens of millions worldwide,” explains Alex Berenson on his Substack.\n\nThe most likely “side effect” of covid jabs seems to be myocarditis (and other heart problems)\n\nIn the three months after injection, a person’s risk of developing hypertension increases by 25 percent, the study further found. With depression, eczema, diabetes, and cellulitis, the risk increases 10-20 percent post-injection compared to pre-injection.\n\nThe worst risk of all is myocarditis, the study explains. Getting injected for covid increases one’s risk of heart inflammation by an astounding 260 percent – especially if you are a man.\n\n“Myocarditis is a known side effect of the mRNAs, so the fact it had a particularly high rate of extra diagnoses provides strong evidence that the signal the researchers found was real,” Berenson writes.\n\nAll in all, the researchers found that among the 284,000 covid-jabbed adults they evaluated, almost 6,000 new and additional health conditions were diagnosed within the 90 days after the needle(s) went into their arms.\n\n“With about 237 million American adults vaccinated, that estimate would translate into about 5 million extra diagnoses for problems like diabetes in the three months following the shots,” Berenson says. “Worldwide, the number could be up to 25 million.”\n\nAs you might expect, the paper has received little attention from the media, and pretty much no attention from the government. That is because its findings contradict the official narrative that covid jabs are “safe and effective.”\n\nAnother study out of Hong Kong similarly identified a sharp increase in autoimmune “flares” after covid injection. New episodes of lupus, rheumatoid arthritis, and various other serious autoimmune diseases are skyrocketing as a result of the shots.\n\nThat study specifically identified mRNA injections as the culprits. Chinese-style inactivated virus jabs did not cause these same effects, demonstrating that the injection types from Moderna and Pfizer-BioNTech are perhaps the most dangerous covid shots available.\n\n“Americans do not have that option, as the United States does not allow the use of Chinese inactivated Covid vaccines,” Berenson notes about how Americans got the worst of the worst “vaccines” while communist China got “safer” ones.\n\nIn the comment section, someone wrote that he suffered a heart blockage within weeks after getting jabbed by Pfizer. He ended up with a stent. His brother-in-law also suffered a heart attack after his third shot while his sister suffered two strokes after hers.\n\n“People we know have developed several allergies when they never had allergies previously,” this person added. “These cannot be explained cynically as merely coincidences.”\n\nWant to keep up with the latest news about Big Pharma’s deadly drug offerings? You can do so at BadMedicine.news.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Exhaustive peer-reviewed study says MILLIONS worldwide now suffer from serious health problems caused by covid \"vaccines\"", "url": "https://www.naturalnews.com/2023-03-06-study-millions-health-problems-covid-vaccines.html", "type": "article", "article:published_time": "2023-03-06T22:49:48+00:00", "article:modified_time": "2023-03-07T00:20:24+00:00", "updated_time": "2023-03-07T00:20:24+00:00", "article:section": "Vaccines", "description": "New research published in the peer-reviewed Nature Cardiovascular Research journal draws attention to the tens of millions of serious new health problems that have emerged worldwide ever since the launch of Operation Warp Speed.\r\n\r\nThe advent of Wuhan coronavirus (Covid-19) \"vaccines\" has", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/03/Pharma-Syringe-Vaccine.jpg"}, "tags": ["pandemic", "Big Pharma", "pharma fraud", "badhealth", "COVID", "medical violence", "myocarditis", "vaccination", "real investigations", "truth", "vaccine wars", "heart health", "heart disease", "Dangerous Medicine", "research", "vaccine injury", "adverse events", "badmedicine", "vaccines", "badscience", "mRNA", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://www.nature.com/articles/s44161-022-00177-8", "https://naturalnews.com/2022-10-13-moderna-injection-repair-heart-muscle-covid-vaccine.html", "https://www.brighteon.tv", "http://badmedicine.news", "https://www.nature.com/articles/s44161-022-00177-8", "https://alexberenson.substack.com/p/urgent-mrnas-jabs-may-have-caused", "https://naturalnews.com/2022-10-13-moderna-injection-repair-heart-muscle-covid-vaccine.html", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-03-06-study-millions-health-problems-covid-vaccines.html&linkname=Exhaustive%20peer-reviewed%20study%20says%20MILLIONS%20worldwide%20now%20suffer%20from%20serious%20health%20problems%20caused%20by%20covid%20%E2%80%9Cvaccines%E2%80%9D", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-03-06T22:49:48+00:00"}