{"result_id": "212023", "URL": "https://www.naturalnews.com/2023-04-12-switzerland-stops-recommending-covid-vaccines-high-immunity.html", "timestamp": "2023-04-25 16:28:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "coronavirus,freedom,harmful medicine,health,health freedom,infectious diseases,liberty,medicine,vaccines,vaccines,awakening,badmedicine,big government,big pharma,covid-19,dangerous medicine,federal office of public health,health freedom,high immunity,immunity levels,liberty,natural immunity,pandemic,pharmaceutical fraud,vaccine wars,vaccines,wuhan coronavirus", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2023-04-12-switzerland-stops-recommending-covid-vaccines-high-immunity.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "Switzerland stops recommending COVID-19 vaccines, citing population's high immunity", "cleaned_text": "(Natural News) Switzerland has stopped recommending the Wuhan coronavirus (COVID-19) vaccines, citing high immunity among the Swiss population.\n\nThe Swiss Federal Office of Public Health (FOPH) and Swiss Federal Commission for Vaccination issued a new set of guidelines regarding Wuhan coronavirus (COVID-19) vaccination. According to the guidelines, the injection is no longer recommended for individuals – including those considered at high risk – for the spring and summer seasons. High-risk individuals who wish to have the vaccine can still get it after a consultation with their doctor.\n\n“In principle, no COVID-19 vaccination is recommended for spring/summer 2023,” the FOPH guidance said. “Nearly everyone in Switzerland has been vaccinated and/or contracted and recovered from COVID-19. Their immune system has, therefore, been exposed to the coronavirus.”\n\nFOPH officials backed their decision to stop recommending vaccines with data pointing to SARS-CoV-2 circulating less this year. They also pointed out that the more recent COVID-19 variants circulating cause milder illness than earlier strains, such as the B16172 delta variant. Nevertheless, the public health agency said the decision will be reevaluated in the fall and winter seasons and recommendations would be adjusted “if a new wave of infection were to emerge.”\n\nThe Epoch Times reported that based on seroprevalence data from mid-2022, more than 98 percent of Swiss people already have antibodies against SARS-CoV-2. These antibodies were obtained from prior infection, vaccination or both.\n\nA March 11 report by Swiss Info mentioned that about 70 percent of Swiss people have been injected with at least one COVID-19 vaccine dose, “a figure that has barely moved over the past year.” The same piece also mentioned that only 11.5 percent of Swiss citizens got a booster dose in the past six months.\n\nThe same report mentioned that the low uptake of COVID-19 boosters prompted the landlocked country to discard excess doses it purchased. “Millions of unused vials that have expired have already been destroyed. It is likely that millions more will end up in the trash this year,” the Swiss Info piece said. (Related: Switzerland to destroy 9M expired doses of Moderna COVID-19 vaccine after consumer demand plummets.)\n\nVaccination liability shifts from the government to doctors\n\nSwiss outlet Report 24 pointed out that under the new FOPH recommendation, doctors can only administer the COVID-19 injections on a case-by-case basis and under certain conditions. Medical Daily expounded on this, saying: “By no longer recommending the vaccines, this would mean that vaccination is not covered by the government anymore.\n\n“Non-high-risk individuals who want to get the [COVID-19] vaccine or the booster would have to pay for it. High-risk people won’t have to pay for the vaccine or booster if a doctor consultation recommended they get one. The vaccine, in this case, would be covered by their health insurance.”\n\nThe FOPH noted that the effectiveness of the COVID-19 vaccines is diminished and short-lived, especially among at-risk individuals, against current SARS-CoV-2 variants. It also noted that the adaptation of mRNA vaccines has not kept pace with the evolution of new COVID-19 strains.\n\nThe FOPH guidance also shifted vaccine-related liabilities. Initial guidelines issued on Nov. 29, 2022, stated that the Swiss government provides compensation to vaccine-injured individuals, but only in cases where public health authorities recommend vaccination.\n\nHowever, the new guidelines now shift the liability for vaccine injuries from the government to individual doctors administering the vaccines. This “should mean their willingness to vaccinate will decrease significantly,” remarked the Report 24 piece.\n\nSwitzerland is not the only European country to stop recommending the COVID-19 vaccines. Back in February, the U.K. stopped recommending boosters for healthy individuals and discontinued free distribution of the primary two-dose COVID-19 injections. Denmark also suspended its national COVID-19 vaccination campaign in April 2022, shifting to a targeted approach.\n\nVisit Vaccines.news for more stories about the COVID-19 injections.\n\nWatch Gabor “Gabe” Zolna discuss Switzerland’s rejection of the AstraZeneca COVID-19 vaccine below.\n\nThis video is from the zolnareport.com channel on Brighteon.com.\n\nWHO declares that healthy children and teenagers do NOT need covid vaccines.\n\nDenmark SUSPENDS COVID vaccination program but plans to resume it after summer.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "Switzerland stops recommending COVID-19 vaccines, citing population's high immunity", "url": "https://www.naturalnews.com/2023-04-12-switzerland-stops-recommending-covid-vaccines-high-immunity.html", "type": "article", "article:published_time": "2023-04-12T07:31:20+00:00", "article:modified_time": "2023-04-12T11:29:04+00:00", "updated_time": "2023-04-12T11:29:04+00:00", "article:section": "vaccines", "description": "Switzerland has stopped recommending the Wuhan coronavirus (COVID-19) vaccines, citing high immunity among the Swiss population.\r\n\r\nThe Swiss Federal Office of Public Health (FOPH) and Swiss Federal Commission for Vaccination issued a new set of guidelines regarding Wuhan coronavirus (COVID-19) vacc", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2023/04/Covid-19-Vaccine-Vial-Close-Up.jpg"}, "tags": ["pandemic", "big government", "covid-19", "Liberty", "Big Pharma", "vaccine wars", "natural immunity", "Federal Office of Public Health", "badmedicine", "pharmaceutical fraud", "vaccines", "awakening", "immunity levels", "health freedom", "Wuhan coronavirus", "high immunity", "Dangerous Medicine"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://childrenshealthdefense.org/defender/switzerland-stops-covid-vaccines-immunity/", "https://www.medicaldaily.com/switzerland-no-longer-recommends-covid-19-vaccination-heres-why-469321", "http://infections.news", "https://www.brighteon.tv", "https://www.swissinfo.ch/eng/sci-tech/covid-vaccine-doses-go-to-waste-in-switzerland-amid-huge-stockpile/48330402", "https://www.naturalnews.com/2022-10-24-switzerland-to-destroy-expired-moderna-vaccine-doses.html", "https://vaccines.news/", "https://www.brighteon.com/7c43cfde-2fd1-4025-bd86-909c5832e626", "https://www.brighteon.com/channels/zolareportcom", "https://vaccines.news/2022-09-18-denmark-bans-covid-vaccines-for-under-50.html", "https://vaccinewars.com/2021-10-08-sweden-denmark-ban-vaccines-for-young-people.html", "https://badmedicine.news/2023-03-31-who-declares-children-teenagers-no-covid-vaccines.html", "https://pandemic.news/2022-02-09-natural-immunity-20-months-after-covid-infection.html", "https://healthfreedom.news/2022-04-28-denmark-puts-covid-vaccination-program-on-hold.html", "https://childrenshealthdefense.org/defender/switzerland-stops-covid-vaccines-immunity/", "https://www.medicaldaily.com/switzerland-no-longer-recommends-covid-19-vaccination-heres-why-469321", "https://www.swissinfo.ch/eng/sci-tech/covid-vaccine-doses-go-to-waste-in-switzerland-amid-huge-stockpile/48330402", "https://www.brighteon.com/7c43cfde-2fd1-4025-bd86-909c5832e626", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2023-04-12-switzerland-stops-recommending-covid-vaccines-high-immunity.html&linkname=Switzerland%20stops%20recommending%20COVID-19%20vaccines%2C%20citing%20population%E2%80%99s%20high%20immunity", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2023-04-12T07:31:20+00:00"}