{"result_id": "212015", "URL": "https://www.naturalnews.com/2022-02-15-covid-injections-spread-autoimmune-disease-media-aids-vaccine.html", "timestamp": "2023-04-25 16:28:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "bad science,big pharma,biological agents and warfare,collapse,conspiracy,coronavirus,corruption,current events,deception,depopulation,diseases,drugs,fascism,genocide,government,harmful medicine,lies,military-industrial complex,mind control programs,propaganda,slavery,vaccines,aids,badhealth,badmedicine,big pharma,covid,depopulation,fauci,genocide,immune system,immunity,outbreak,plandemic,vaccine damage,vaccine deaths,vaccine wars,vaccines,vaids", "favicon": "wp-content/themes/naturalnews-child/images/icon.ico", "canonical": "https://www.naturalnews.com/2022-02-15-covid-injections-spread-autoimmune-disease-media-aids-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalnews.com", "title": "As covid injections spread autoimmune disease and \"VAIDS,\" media pivots to incoming AIDS \"vaccine\" that will only accelerate the vaccine genocide", "cleaned_text": "(Natural News) We now know that Wuhan coronavirus (Covid-19) “vaccines” are spreading vaccine-induced AIDS, or VAIDS, which is convenient timing seeing as how the corporate-controlled media is starting to push a new experimental AIDS “vaccine” on the masses.\n\nIn late January, Moderna announced early-stage clinical trials on a new HIV injection it created based on the same mRNA (messenger RNA) technology used in Fauci Flu shots.\n\nThe biotechnology giant teamed up with a “non-profit” organization called the International AIDS Vaccine Initiative (IAVI) to develop the shot, which is already being administered to volunteers at the George Washington University School of Medicine and Health Sciences in Washington, D.C.\n\n“We are tremendously excited to be advancing this new direction in HIV vaccine design with Moderna’s mRNA platform,” said Dr. Mark Feinberg, president and CEO of IAVI, in a statement.\n\n“The search for an HIV vaccine has been long and challenging, and having new tools in terms of immunogens and platforms could be the key to making rapid progress toward an urgently needed, effective HIV vaccine.”\n\nFake government “doctor” Tony Fauci has long been obsessed with AIDS, and it is said that he has been working for years to try to get a vaccine for it into production. That time appears to be now, just in time for the end of the covid plandemic operation.\n\nUnited Nations claims new HIV “variant” is spreading – is it vaccine-induced AIDS?\n\nWith covid starting to vanish from the headlines, it is now being replaced with fearmongering about the spread of AIDS.\n\nOne headline from the United Nations now claims that a “[f]ast-spreading HIV variant doubles rate of immune system decline.” A Nature article also claims that a “Highly virulent HIV variant found circulating in Europe.”\n\nThere is even a push in the United Kingdom for Brits to get tested for HIV just like everyone was told to get tested for the Fauci Flu. Prince Harry announced that everyone now has a “duty” to get an HIV test for the safety of the public – sound familiar?\n\nThe Sun also urged the public to get HIV tested “as heterosexual diagnoses higher for first time in a decade.”\n\nThis sudden emergence of HIV out of nowhere strangely coincides with the VAIDS phenomenon that mysteriously appeared after large masses of people started getting injected with Fauci Flu shots.\n\nCould it be that HIV and AIDS are on the rise because of the injections? And if so, does this mean that the next plandemic is an AIDS plandemic that will come with more testing, more masking, more tyranny?\n\nIf the jab is confirmed to contain HIV protein inserts that are lowering people’s T-cell counts, then hundreds of millions of people all around the world now have HIV and do not even know it.\n\nA Department of Defense (DoD) whistleblower says that HIV cases are up 590 percent year over year. Are vaccines the cause?\n\n“Asymptomatic HIV infection is the second stage of HIV / AIDS,” reports Strange Sounds. “During this stage, there are no symptoms of HIV infection.”\n\n“This stage is also called chronic HIV infection or clinical latency. During this stage, the virus keeps multiplying in the body and the immune system slowly weakens, but the person has no symptoms.”\n\nIt is certainly within the realm of possibility that every fully vaccinated person who became infected with “covid” and developed “flu-like” symptoms is possibly carrying around HIV. And even if they ultimately “recovered,” this is only temporary until the next time their body starts to run low on T-cells.\n\n“The uptick in HIV news and testing by the media could be a soft disclosure of what’s ahead for those who are vaccinated,” Strange Sounds warns, suggesting that a new HIV / AIDS pill or vaccine is soon to come.\n\nTo keep up with the latest news about the next manufactured plandemic, be sure to check out Pandemic.news.", "opengraph": {"locale": "en_US", "site_name": "NaturalNews.com", "title": "As covid injections spread autoimmune disease and \"VAIDS,\" media pivots to incoming AIDS \"vaccine\" that will only accelerate the vaccine genocide", "url": "https://www.naturalnews.com/2022-02-15-covid-injections-spread-autoimmune-disease-media-aids-vaccine.html", "type": "article", "article:published_time": "2022-02-15T11:14:45+00:00", "article:modified_time": "2022-04-29T13:14:06+00:00", "updated_time": "2022-04-29T13:14:06+00:00", "article:section": "Vaccines", "description": "We now know that Wuhan coronavirus (Covid-19) \"vaccines\" are spreading vaccine-induced AIDS, or VAIDS, which is convenient timing seeing as how the corporate-controlled media is starting to push a new experimental AIDS \"vaccine\" on the masses.\r\n\r\nIn late January, Moderna announce", "image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2022/04/Covid-19-Montage-Vaccine-Syringe.jpg"}, "tags": ["vaccine damage", "vaccine wars", "Big Pharma", "Vaccine deaths", "outbreak", "Fauci", "badhealth", "COVID", "genocide", "badmedicine", "depopulation", "vaccines", "VAIDS", "immune system", "Plandemic", "AIDs", "immunity"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com", "https://naturalnews.com/2021-12-10-vaccine-induced-vaids-rising-mass-covid-vaccination.html", "https://strangesounds.org/2022/02/the-msm-prepares-the-public-for-incoming-aids-outbreak-covid-vaccine-link.html", "https://strangesounds.org/2022/01/moderna-launches-clinical-trial-for-hiv-mrna-vaccine-like-in-covid-shot.html", "https://www.gwu.edu/", "https://www.brighteon.tv", "http://pandemic.news", "https://naturalnews.com/2021-12-10-vaccine-induced-vaids-rising-mass-covid-vaccination.html", "https://strangesounds.org/2022/02/the-msm-prepares-the-public-for-incoming-aids-outbreak-covid-vaccine-link.html", "https://strangesounds.org/2022/01/moderna-launches-clinical-trial-for-hiv-mrna-vaccine-like-in-covid-shot.html", "https://www.addtoany.com/add_to/google_plus?linkurl=https://www.naturalnews.com/2022-02-15-covid-injections-spread-autoimmune-disease-media-aids-vaccine.html&linkname=As%20covid%20injections%20spread%20autoimmune%20disease%20and%20%E2%80%9CVAIDS%2C%E2%80%9D%20media%20pivots%20to%20incoming%20AIDS%20%E2%80%9Cvaccine%E2%80%9D%20that%20will%20only%20accelerate%20the%20vaccine%20genocide", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2022-02-15T11:14:45+00:00"}