{"result_id": "213030", "URL": "https://naturalnewsblogs.com/dont-let-schools-propagandize-your-kids/", "timestamp": "2023-04-25 16:30:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/dont-let-schools-propagandize-your-kids/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Don't Let Schools Propagandize Your Kids", "cleaned_text": "The following is a letter I wrote to my child’s school upon finding out some of the ideas they were trying to force upon her and her classmates as it relates to vaccines:\n\nWith the school year nearing its end my daughter recently brought home quite a sizeable pile of papers which have accumulated over the course of the year. Reading through them I became extremely dismayed when I came across a printout of a Washington Post article titled, ‘Measles Spreading Across U.S. to Record High.’\n\n\n\nThe packet was essentially a propaganda sheet that could’ve been written by the pharmaceutical lobby itself. What made it so offensive was that it wasn’t just an article but in fact a sales pitch which attempted to sell our children on the ‘pressing need’ for receiving the MMR vaccine.\n\n\n\nIn my opinion, it is entirely irresponsible for a school to attempt to propagandize the minds of our children through scare tactics and fear-mongering promoted by a billion dollar industry. The companies which create and promote these vaccines are literally criminal corporations with appalling records of human rights violations. It is unfortunate that this needs to be explained to those who are ostensibly tasked with teaching our children, but apparently it does.\n\n\n\nThe overall theme of the article was that the safety of vaccines, specifically the controversial MMR shot, has been settled. Nothing is further from the truth. If this were the case the FDA would not have ordered the placement of over 100 dangerous ‘side effects’ to be listed on the insert to the vaccine, ranging in severity from rashes, vomiting, fever and diabetes to Guillain-Barre Syndrome (GBS), febrile convulsions, seizures and death. These are all listed on the vaccine manufacturers websites as well. They are not hard to find. \n\n\n\nIf the science were truly settled then why did Harvard Medical School MD John Abramson, author of the book Overdosed America: The Broken Promise of American Medicine say in response to a question he was asked about mandatory vaccination “the bottom line is that I think, what the science is, is incomplete. There is no question about it. And the politics of it, as the way it’s done, as a legal matter, and the inability of people who are injured by vaccines to sue for compensation, preventing plaintiffs’ lawyers from getting to the scientific data, it’s big problems.”\n\n\n\nDoes this sound like a procedure that is uniquely benevolent to all children posing zero risk to anybody? Shouldn’t even the possibility of just one child suffering just one of these ‘side-effects’ make you think twice before attempting to impress upon young minds with corporate propaganda? One is left to wonder whether measles (really more of an infection than a disease) is even enough of an issue to roll the dice and risk such damaging side-effects. Once-upon-a-time all that was needed to cure the measles was a week off from school and some nutritious food, and the immune system was better off because of it.\n\n\n\nHealth decisions such as these should be of little business to the school. However, if education were truly the objective here then why was no counterweight offered? Why were the children not furnished with work done by such notable people as Robert Kennedy Jr., CDC whistleblower Bill Thompson, Dr. Andrew Wakefield or the Harvard immunologist and Rockefeller University graduate Tetyana Obukhanych to see if their side of the story sounds more or less credible to them? This is the fundamental difference between education and indoctrination; education allows all sides to be heard and allows people to draw their own conclusions.\n\n\n\nAs I have already stated the 4 main companies responsible for the creation and promotion of childhood vaccines are convicted criminals. Since 2009 these four companies (Merck, GlaxoSmithKline, Pfizer and Sanofi) have collectively paid 35 billion dollars in criminal penalties, damages and fines for defrauding regulators, falsifying science, bribing doctors and lying to the public. But because of a little piece of legislation known as the ‘Vaccine Protection Act’, alluded to earlier by Dr. John Abramson, parents are unable to sue the manufacturers in the event that their child suffers from one of the ‘side effects’ that are listed on the insert to the vaccine itself! To add further insult to quite literal injury, these companies are entirely exempt from performing safety tests on their products. This is unprecedented for ‘health products’ and has already proven to be disastrous. \n\n\n\nIt is now a known fact that the drug Vioxx which was created by Merck (the foremost company behind the MMR vaccine) killed at least 120,000 people before it was finally taken off the shelf. It is also known that Merck knew the drug caused heart attacks but prevented that information from being made public. These are the very same people dictating to us what we should be injecting our children with, and it is their nonobjective propaganda you are poisoning our children’s minds with. Perhaps the students could have been given a printout of a CBS News article titled, ‘Merck Created Hit List to ”Destroy” “Neutralize” or “Discredit” Dissenting Doctors’ to help them form an opinion of the companies that are behind the campaign for compulsory vaccination; a campaign that is entirely at variance with the Nuremberg Code. \n\n\n\nA little bit of critical thinking is required here, something that is in short supply in the unyielding fields of public education.\n\n\n\nIt can easily be proven that the pharmaceutical cartel holds massive sway over our media. These unscrupulous companies pay billions of dollars a year in advertising revenue to the television stations. It is for this reason that we are constantly bombarded with drug ads of all make and model, all of which spend the duration of the commercial listing off the plethora of serious ‘side effects’ while images of vibrant smiling faces pass by on the screen. \n\n\n\nRecently I saw a big measles scare piece put out by Lester Holt on NBC. The general tone of it was not one of unbiased investigation but rather one of fear-mongering and over-the-top sensationalism. Immediately I smelled a rat. The first thing I did was look to see who were the main financial contributors to his show and wouldn’t ya know it…Merck – the criminal manufacturer of the MMR vaccine – topped the list. The whole piece was just one big advertisement for Merck and their MMR shot. Nothing objective about it. I wonder if anyone at the school performed this simple line of investigation as it pertains to Jeff Bezos’ Washington Post before subjecting our youth to such Soviet style propaganda? Certainly his Amazon.com enterprise has just recently purged numerous books and videos by credible doctors, scientists and researchers that don’t toe the pharmaceutical lobby’s line on this matter.\n\n\n\nUpon learning of this level of control by corporate interests an observant mind is left to question whether or not the ‘great measles scare’ of 2019 is really all it’s made out to be. \n\n\n\nSurely the corporations telling us that it is have much to gain financially but I myself have yet to so much as meet a person who knows somebody who has a distant relative who has contracted measles. I do, however, know many people whose kids suffer from seizures, food allergies, learning disabilities, Asperger’s, autism, etc.\n\nForgive me for being skeptical but wasn’t it only a few years ago we were all going to be ravaged by Ebola, yellow fever, swine or bird flu? All of these ‘incidents’ were hyped up as a crisis almost without parallel in known human history and hordes of unquestioning people rushed off to receive their inoculations, doing their part, they believed, in helping to forestall this end times scenario. Children at school were presumably given the same sort of literature impressing them with the dire need to be immunized from these modern day bubonic plagues. And then what happened?? Ah…Nothing! In each case the whole matter seemingly just disappeared overnight hardly ever to be mentioned again! These diseases weren’t ‘vaccinated out of existence’ in a mere matter of weeks. It was all just a big hoax cooked up by the same people who own the media and profit handsomely by hawking their wares every time one of these ‘outbreaks’ occurs. Those of us who took the time to examine the actual statistics concerning any of these alleged outbreaks learned that they were nowhere near the magnitude of what we were told they were. Wake up! Are we really so dense as to believe a system which realizes massive profits by keeping us sick is suddenly interested in making us well?? The maxim ‘A patient cured is a customer lost’ is a binding code to these crooks who have time and time again been exposed as unethical liars and murderous villains and yet are somehow transmuted into being guardians of humanity’s health and well-being in the literature thoughtlessly peddled at your school.\n\n\n\nIn closing let me just state what should be the obvious. Not every kid is the same. Each child is a unique expression of creation who share some similarities but have many differences as well. Nothing is so beneficial as to be good for everybody. So although peanut oil is a great thing for many people, if someone is allergic to peanuts they are going to have serious problems. I would not expect you to promote information put out by the ‘peanut lobby’ – if indeed such an organization exited – suggesting kids get injected with peanut oil without also adding the potential dangers for those who could possibly be adversely affected by them. So it should be with vaccines. There is without question a number of children whose bodies will not process the mercury, aluminum, formaldehyde and aborted human tissues as well as others. If this wasn’t the case then why the need for the hundred plus warnings listed on the vaccine insert itself placed there by the FDA? \n\n\n\nThe increasing push to make vaccinations compulsory should worry anyone with even a modicum of sanity still intact. When we can no longer choose what gets injected directly into our bodies or the bodies of our children then what freedom is left? I would suggest in the future you desist in trying to mold the minds of our youth into accepting such a controversial procedure which should be handled on a child to child basis and is the business of nobody but the family and their doctor.​", "opengraph": {"locale": "en_US", "type": "article", "title": "Don't Let Schools Propagandize Your Kids", "description": "The following is a letter I wrote to my child’s school upon finding out some of the ideas they were trying to force upon her and her classmates as it relates to vaccines: With the school year nearing its end my daughter recently brought home quite a sizeable pile of papers which have accumulated over …", "url": "https://naturalnewsblogs.com/dont-let-schools-propagandize-your-kids/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:section": "Health", "article:published_time": "2019-06-13T20:18:58+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Girl-School-Education-Elementary.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Girl-School-Education-Elementary.jpg", "image:width": "650", "image:height": "366"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/profile.php?id=100014922008478", "https://naturalnewsblogs.com/author/naturalterraist/", "https://naturalnewsblogs.com/author/naturalterraist/"], "authors": [], "publish_date": "2019-06-13T20:18:58+00:00"}