{"result_id": "213024", "URL": "https://naturalnewsblogs.com/vaccination-blessing-of-science-or-deception-and-harm/", "timestamp": "2023-04-25 16:29:59 CEST+0200", "meta": {"description": "Vaccination is seen by some as one of the greatest gifts of modern medical science, which has eradicated many deadly diseases. Others see it as a curse.", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/vaccination-blessing-of-science-or-deception-and-harm/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Vaccination: Blessing or Curse?", "cleaned_text": "Parents of school age children who are required to get vaccinations to attend school, parents of newborn babies that are routinely vaccinated in the first days of life, and parents of children in poor African and Asian countries on National Immunization Day, about to be accosted by swarms of dedicated vaccine field workers, all these parents and others face a hard choice they cannot avoid making. The choice is not just an intellectual or philosophical one. In many cases they are betting their children’s lives, and their own, that they will make the correct choice. Perhaps you or someone you know is among them.\n\nThe story of vaccination, as told by today’s conventional science, often starts with the account of Edward Jenner and the disease called smallpox. The 2011 short documentary “Edward Jenner,” and the 2012 History Channel presentation on smallpox are examples of how Jenner is seen as a global hero because his discovery led to the eradication of smallpox through the miracle of vaccination.\n\nAccording to Dr. Sherry Tenpenny , Jenner was actually not the first to discover the idea of vaccination for smallpox, but he is the best known and considered by most in the medical field to be the “father of vaccination.” However, Jenner was not born until 1749, and 31 years before that an English aristocrat named Lady Mary Wortley was the first to bring the practice to Europe. When Jenner was 50 years old, in 1796, he observed that English milkmaids who worked in contact with cows that had cowpox did not seem to get smallpox themselves. In his famous experiment to test this theory, he injected cowpox infection from the milkmaids into an 8-year old boy named James Phipps. Two months later, he injected James with smallpox. James did not develop a full-blown smallpox case, and the theory was “proven,” though as Dr. Tenpenny points out, many possible reasons could account for the fact that James did not get cowpox, including his own normal immune system. However, an industry was born from this experience, and the term used to describe what Jenner did with his injections comes from the Latin word for cow, “vacca.” Initially the vaccination was done with a series of cuts and smearing of the infectious material on an adult. Eight days later, the resulting blisters were harvested and the material injected into children. The vaccination side effects of gangrene, smallpox infection, extreme disfigurement and death, as well as the spread of syphillis from the cows, were ignored “for the good of the whole,” and Jenner became famous, going on to save the world from the dreaded smallpox. And as we know, the world has lived happily ever after since then, at least in the sense that we now have vaccines to rely on to prevent smallpox and so many other diseases.\n\nBut Dr Tenpenny goes on to explain, complete with graphic details, how smallpox was essentially eradicated by sanitation and hygiene before “vaccination” had even begun. And that smallpox broke out in numerous epidemics as a result of vaccination itself, which turned out to be an effective way to actually spread, rather than prevent, the disease. How could this be, when Dr. Jenner himself had scientifically tested his discovery and promoted it as both a safe and effective preventive of smallpox?\n\nDr. Rima Laibow (2005) fills in some important details of the story that makes it much easier to understand what really happened. For example, she points out that “Dr. Jenner” was actually a village apothecary who purchased a University of Edinburgh medical degree for fifteen pounds. His experiment consisted of convincing a young milkmaid named Sarah Nelmes to let him collect pus from a fresh lesion on her finger and inject it into 8-year old James Phipps, in order to make him immune from small pox. Seventeen days later when James did not develop smallpox, Jenner declared his famous phrase that “protection was complete.” However, Dr. Laibow goes on to explain that the early campaign to sell the inoculation to others ran into some serious public relations problems as customers started getting both smallpox and syphilis form the procedure. So he switched to injecting material from infected horse hoofs instead, which he called “horse grease.” John Baker, the first child so inoculated, died before getting the smallpox injection, but Jenner injected the horse grease into six more children anyway, and then went immediately to London to publish the success story without waiting to see the results, apparently excited and feeling the call of immanent fame and fortune. This, explains Dr. Laibow, was the original great announcement of the new available scientific tool to defeat smallpox, and was actually referring to the miracle of horse grease. The horse grease version was short lived because the results were even worse than with cowpox, and so Jenner switched back to the original materials by popular demand. This version of the procedure has changed in modern times in that the original infectious materials are harvested from calves, who are killed in the process, and then cultured in egg materials instead of in adult humans, before being injected into children. This is how the scientific process has progressed up to present day.\n\nBear in mind that the lethal problems inherent in the original smallpox vaccination were before the advent of “adjuvants.” Adjuvants are materials added to modern vaccines to intensify the immune reaction of the body so that less of the essential antigen (the infectious material itself) can be used per dose and the immune system is still intensely activated to supposedly produce the desired immunity. Adjuvants in use today for vaccines include poisonous substances like aluminum and mercury and many others. But before taking a careful look at these other vaccine ingredients and their effects on the body, let’s go back to smallpox for a moment, because it gives us a rare chance to consider the safety and effectiveness of vaccines before extra ingredients were routinely added that could make them much more dangerous, as they are today.\n\nSuccess For A Few, Disaster For Others\n\nInvestigative reporter Clint Richardson (2011) decided to take a deep look into the vaccine issue to see for himself how safe vaccines were, and if it was true that they really wiped out diseases like smallpox and deserved worldwide acclaim and universal use. He was so impressed with the importance of what he found that he named his video documentary, “Lethal Injection, the Story of Vaccination.” In it, he details the plagues and epidemics that have been started by vaccination campaigns. Then he goes on to chronicle the disastrous effects of other vaccination programs right up modern use in our world today. His conclusion is that vaccination has been wildly successful in its two primary purposes: slow, time-delayed population and fertility reduction, and massive generation of profits for those at the top of companies that make and sell vaccinations (now also partnered with government agencies). From the point of view of those getting injected and suffering the immune suppressive and other devastating side effects, often including paralysis and death, vaccination has been other than successful.\n\nBut Vaccination Wiped Out Smallpox. Right?\n\nAnd in terms of the official success, whereby diseases like smallpox are totally eradicated by vaccination, Dr. Laibow (2005) explains that even though sanitation and hygiene (not vaccination) radically reduced smallpox occurrence, the disease was certainly never eradicated. However, since complete eradication of smallpox and credit to vaccination was required for the public image of the vaccine industry, the World Health Organization, as always working for the betterment of humankind, declared smallpox completely eradicated in 1980, and renamed the remaining smallpox cases as either “cowpox” or “monkey pox.” One great benefit of this kind of eradication is that there can not possibly be any recurrence of the disease, only more cow pox or monkey pox, which of course are not relevant.\n\nSmallpox is not the only vaccination that has gained world renown for the total eradication of a disease. After her lecture covered the history of the fraudulent smallpox vaccine, Dr. Tenpenny (2013) proceeded to talk about what happened with the world-renowned polio vaccine, credited with the eradication of paralytic polio. She explained that the vaccine was well known to spread “unavoidable” cases of paralysis among a certain percentage of children vaccinated with it. She talked about “National Immunity Day,” a project in which huge numbers of medical workers would sweep over large sections of Africa and Southeast Asia, giving the vaccines to children wherever they went. Typically in one such sweep, 800 children would become paralyzed for life, but this was understood as necessary for the greater good.\n\nDr. Laibow (2013), in a private conversation with this writer, explained how polio vaccination was originally created. She has serious doubts whether polio was actually caused by a virus at all, and suspects other causes such as widespread use of DDT.\n\nDr. Tenpenny also reminded us that most cases of polio were not serious or lasting. About 2% of all cases involved paralysis, and about 2% of those were serious and permanent, possibly resulting in death, even though the American media fear campaign made people think of polio as a source of practically universal paralysis, especially for children.\n\nDr. Laibow talking about the creation of the polio vaccine, gave this outlined procedure:\n\n“The vaccine was built on the mushed up brains of monkeys which had developed an ascending paralysis after the mushed up brains of other monkies were injected into their brains. Then the brains of the second set of monkies were mused up and injected into another set of monkies. Then their brains were “cultured” in green monkey kidney cells and the resultant virus-laden mess was made into the vaccines” [and injected into millions of children].\n\nDoes this sound like advanced science to you? Are we starting to recognize a pattern here? I would suggest that what makes it so incredibly difficult for most of us to grasp what is clearly going on is our programming since birth to hold science and scientists in absolute awe and deep respect. The idea that scientists, or for that matter doctors, could ever engage in activities such as the intentional atrocities being described here is generally beyond our capacity to imagine.\n\nTo better understand how this pattern of intentional harm has been carried out over an extended period of time since the beginning of the practice of vaccination, it is highly recommended to watch Richardson’s documentary on vaccination, or at least that section that outlines the history of vaccination up to present day, which starts at about the 52 minute mark into the movie. Over and over again we see how vaccines, beginning with smallpox, were a clear major cause of the disease they pretended to prevent. Repeatedly they were banned after causing epidemics, then they were re-started by governments and medical organizations in spite of the evidence against them and the incalculable human suffering and death they had caused. In contrast, when measures have been suggested that actually cure or prevent disease but do not help the overall medical business and the drug business financially by providing permanent customers, they are severely attacked. For example, in 1848, Richardson gives the case of Dr. Sammelweiss of the University of Vienna. Dr Sammelweiss cut infant deaths of the time by requiring that doctors simply wash their hands. Instead of being celebrated and praised for his discovery, he was fired. This is far from an isolated incident.\n\nA New Name For Polio\n\nDr. Laibow (2013) goes on to explain that the polio vaccination, which CDC now says is the main continuing cause of polio, is causing large numbers of cases of paralysis in countries where it is being administered, such as in India. However, the disease in these cases has been renamed to “accute flaccid paralysis,” so that polio can remain officially eradicated, like smallpox.\n\nBut the polio vaccine has more problems than just helping to spread polio. The Salk polio vaccine started being administrated in the 1950’s, but in 1972, Dr. Berneice Eddy discovered an additional problem. She had found that the vaccine contained a virus from the monkies on which it was cultured, called “SV 40” (simian virus #40). This virus caused cancer. She had confirmed it in her own animal studies, and this was after millions of children had been injected and media had made the vaccine practically a national celebration. This was in addition to innumerable and mostly unnamed viruses that also existed in the vaccine, due to the extremely unhygienic source of the material, as is the case with other vaccines as well. Dr. Eddy predicted a massive epidemic of cancer decades later, due to the vaccine. She was proven correct, but lost her funding, her lab, and her career.\n\nThe list of other disastrous vaccines goes on and on. Dr. Tenpenny (2013) gives the measles vaccine as one example. She said the vaccine started to be used in 1963, when measles had almost disappeared, and is now given usually in combination with mumps and rubella vaccines. She details some of the disastrous effects of the vaccine, either alone or in this combination. She also talks about the clear connection between certain vaccines and the skyrocketing rates of autism which paralleled vaccine use. Not only MMR vaccines but also hepatitis B vaccine, which she points out is absurd and criminal to administer to newborn babies, is directly connected to the incidence of autism. In 1994, there was a chance to confirm this, when there was a pause in the administration of hepatitis B vaccine, and the autism numbers immediately went down, only to rise again with the resumption of the vaccine.\n\nDr. Gary Null, in his video documentary The Toxic Truth (2011), discusses the deception and crime of giving ANY vaccine to pregnant women, and supports the movement of nurses and other health care workers not to be forced to take the flu shot under penalties of losing their jobs. He explains that the flu shots of various kinds have been clearly shown to spread the flu, as well as to cause harm to unborn babies and radically increase stillbirths, a statistic also confirmed by Richardson (2011).\n\nAlso discussed is one of the main reasons modern vaccinations are so much more deadly than the early experiments by Jenner and others, and that is the presence of additional ingredients called “adjuvants.” These are items added to the vaccine mix, as mentioned above in this article, that cause a more severe immune reaction without having to use as much of the actual disease causing organism that may be in limited supply. Often adjuvants are extremely damaging to the immune system and to many other systems of the body. They are often highly toxic. Dr. Null talks about aluminum as one example, which has been shown to easily find its way into the brain, causing neurological problems.\n\nDr. Russell Blaylock (2011), famous neurosurgeon, concurs. He goes in detail into the brain damage and damage to other organ systems caused by aluminum in vaccinations. Mercury, one of the most deadly substances found on Earth, has also been chosen to use as in vaccines, and is routinely injected into children and even infants and pregnant women, as for example in the flu shot. Like aluminum, mercury can also enter the brain after injection.\n\nThese toxic issues become very personal when translated into real life scenarios, such as young girls paralyzed or killed by HPV shots, women who lose their babies after getting the flu shot, Indian children paralyzed by polio vaccines, American children and children of other countries who have seizures right after getting MMR shots and then quickly become autistic, and the list goes on and on. Christina England (2013) is an investigative journalist who has done extensive work documenting vaccine injury and related crimes of drug companies and government agencies.\n\nCrimes We Would Rather Not See\n\nIt is an interesting point of agreement between these various investigators and experts, that the damage done by vaccines and the subsequent ongoing coverup and denial is not an accident. Instead, it clearly represents intentional criminal activity among those most of us cannot bring ourselves to suspect of wrongdoing. We have learned since early childhood that government and health care leaders are our trusted friends, who work tirelessly for our benefit and well being. They would never mislead or hurt us.\n\nCourage To See The Truth\n\nAnd so we are left with a decision to make, from which will follow others. That first decision is, are we able and willing to look at what is happening to us, our children and our elders at the hands of government, medicine and health care with open eyes, or is the truth so painful and difficult that it is worth it to us to go on enduring the damage in order to avoid seeing the truth. At our deeper levels, we know that running from what is true is always a very bad plan. It is based on fear, something we eventually have to grow beyond. The stakes in every area of our lives are too high to waste any more time remaining intentionally blind. There is no guarantee that even with our best efforts we will succeed in making our world into the place we would like it to be. But we do know for a fact that if we don’t even let ourselves see the issues we have to deal with, then our chances of success are zero.\n\nWhat makes it so hard to see the reality of this situation is that we know subconsciously that it will lead unavoidably to many other connected realizations, and it will leave a great responsibility on us, for action. We have a medical system, a health care system, that is clearly not designed for our benefit. Null et. al. (2011) show with statistical precision that the number one cause of death in the U.S. today is the medical/health care system. None of the major diseases comes close. We have to ask ourselves, is this an accident?\n\nPrior to 1910 in America, there was a wide variety of health care approaches available, and the free market dictated that those with the most effective methods of healing, which did not cause harm, were going to get the most business. That all changed in 1910. In that year, the Rockefeller and Carnegie foundations moved forward with their plans to bring all of American health care under the monopolistic control of allopathic, drug-centered medicine. It was a brilliant business model. The idea was that if the medicine itself and other “therapies” actually caused more disease, and if competitors were driven out with the help of a partnership with government, business would go on increasing indefinitely as the population got sicker. This has been achieved, and tools like vaccines fit right into the strategy. Anyone in doubt need only look at the package insert with vaccines, and read the list of other (“side”) effects, often including death. What is even more amazing than the success of this plan is the incredible fact that most people still think health care is designed to help them become healthy. In addition, the doctors and other personnel who give the shots are taught that they are “safe and effective.” It is most convenient for most doctors to stop after learning that mantra (along with the others they learn for other drugs) and never really learn the truth about vaccines (or other toxic drugs), as then they would have to make tough and conscious ethical decisions, with their incomes in the balance. So they stay unconscious, like most of us do as victims of this system. Most doctors don’t even know what they are vaccine ingredients injecting into their patients, they only know the mantra (“safe and effective”). They are certainly guilty of negligent laziness that can cost lives. But those above them, at the top of the industry, from what I have uncovered in my own research, are not unconscious and they are not lazy. They are devotees of eugenics, and they intend to use the medical system as just one more tool of population reduction, which is set to accelerate in the near future via a number of means, health care being just one.\n\nI am not suggesting hating those involved in the system, as my own feeling is that they are, to various degrees, suffering from their own mental programming. Be thankful you are not in their shoes. It is a bad experience when you realize a system like this has been hurting you and your family, and that you have to take defensive action. But it is a worse feeling by far if you wake up eventually and find you have been one of those inflicting the damage, and they will one day have that experience. No, I am suggesting you follow your highest potential and do not get sucked into hatred, even hatred of evil as you see it. Hatred of evil is still hatred, and it is a slippery slope from there into just hatred and the dark energy that keeps it alive. It is a subtle point, but very important if you want to stay clear and strong, and be part of the solution. Love and wish well for everyone unconditionally, and the energy of destruction and hatred will stop with you. You will become powerful, with deep insight, able to do what you need to do in order to protect yourself and others, but without losing your center. You will remain focused on the beauty you are fighting for, instead of on the energy of fighting itself. I am not saying do not fight when you have to, as innocent lives, including yours may need protecting, and the right to defend yourself and others is inviolable. I am saying do not lose your self in the process.\n\nSome may remember the great allegory of the Star Wars trilogy, in which the dark Emperor wants Luke to fight to the death against his fallen father, Darth Vader, who has become a mass murderer and personification of evil. The Emperor is obviously enjoying the action as Luke’s anger builds and he is about to fight and try to kill his evil father in a final battle to the death. But then Luke comes back to his deeper self, and refuses to go on, saying he will never kill his father. In the end, this leads to the redemption of Darth Vader and the end of the evil Empire. So I am suggesting to all of us, expose the truth, defend yourself and others against attack, medical or otherwise, spread awareness to others, even to those within the system, as their defection can help bring that system to an end. But don’t loose track of why any of this even matters. We are the remnant that must remember love, beauty, the purity that still shines in the faces of the children everywhere, steady and strong even as we stand in the midst of chaos. If we take the children’s purity, and combine it with our own wisdom and strategic action, we will have a power that nothing can withstand. Those who wish our destruction work overtime to convince us that we are of different races, different classes, different religions. They want us to think we have to mistrust each other, to be ready to fight each other, to blame each other for whatever is happening in our world, to report each other to our overlords. But we don’t have to fall for that. We have brilliance within that they have tried to keep us from ever discovering. And with all our superficial differences that make us unique, we are all one family, and for those that can understand on an even deeper level, one being. If we come together and care about each other as much as ourselves, our enslavement to the systems that are destroying us now will end.\n\nIn the next article I will offer some real alternatives to the immunity and health that vaccination pretended to offer us, so we can take our health more confidently into our own hands.\n\nBlaylock, R. (2011). How Vaccines Hurt You. Downloaded 10-20-13 from http://www.youtube.com/watch?v=jCNDc_a-a8Q\n\nEngland, C. (2013). Sanofi-Pasteur Plays Santa and Pays for Children to Take Part in Vaccine Trials. Downloaded 10-20-13 from http://vactruth.com/tag/christina-england/\n\nLaibow, R. (2005). The Syringe of Death. Downloaded 10-20-13 from http://www.healthfreedomusa.org/docs/Syringe_of_death.pdf\n\nLaibow, R. (2013). Conversation with the writer of this article.\n\nNull, G. et. a. (2011). Death By Medicine. Downloaded 10-20-13 from http://www.webdc.com/pdfs/deathbymedicine.pdf\n\nRichardson, C. (2011). Lethal Injection, The Story of Vaccination. Downloaded 10-20-13 from", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccination: Blessing or Curse?", "description": "Vaccination is seen by some as one of the greatest gifts of modern medical science, which has eradicated many deadly diseases. Others see it as a curse.", "url": "https://naturalnewsblogs.com/vaccination-blessing-of-science-or-deception-and-harm/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:tag": "WHO", "article:section": "Child Care", "article:published_time": "2013-10-21T14:40:11+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccine-Insanity.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccine-Insanity.jpg", "image:width": "650", "image:height": "366"}, "tags": ["government", "measles", "flu shot", "aluminum", "CDC", "history of vaccination", "health", "flu", "healing", "gary null", "Hepatitis B", "disease", "Chemicals", "drugs", "childhood vaccines", "russell blaylock", "smallpox", "immunization", "shots", "adjuvants", "science", "eradication", "Rockefeller", "clint richardson", "doctors", "Toxins", "Star Wars", "WHO", "cancer", "children", "mercury", "epidemics", "christina england", "vaccines", "edward jenner", "polio", "rima laibow", "immunity"], "tweets": [], "movies": [], "links": ["https://naturalnewsblogs.com/author/wolfsaver22/", "https://naturalnewsblogs.com/author/wolfsaver22/"], "authors": [], "publish_date": "2013-10-21T14:40:11+00:00"}