{"result_id": "213027", "URL": "https://naturalnewsblogs.com/immunize-measles-without-vaccinations/", "timestamp": "2023-04-25 16:30:04 CEST+0200", "meta": {"description": "You do not have to vaccinate against measles. Heal Measles naturally without vaccines. Bodies natural immunity to measles is covered here. Fight measles.", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/immunize-measles-without-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "How to immunize against measles, without vaccinations...", "cleaned_text": "Are you looking for an alternative to the measles vaccine? Here are steps to aid the body in its natural defenses.\n\nIf you have listened to any media outlet in the last few weeks, you would be well aware of the measles outbreak that occurred at Disneyland. We have been told that we should all be scared of this deadly disease, and should immediately rush to the doctor to get our shots, in panic.\n\nHowever, rewind 50 years, and measles was viewed in a far different light, considered to be simply a relatively benign disease that was just part of childhood.\n\nIn fact, parents used to hold ‘measle parties’, where their children would be exposed to other children with the illness, in order to catch it while they were young.\n\nThis way, it would be likely to be less serious than if it were caught as an adult.\n\nOur grandparents’ generation learnt ways of coping with this illness that effectively shortened its severity and length by doing a few natural steps.\n\nMeasles can be quite severe\n\nMeasles is a highly-contagious viral illness that causes a fever along with a skin rash. Occasionally it can lead to serious complications that can include pneumonia and brain inflammation. Rubeola, not to be confused with Rubella (German Measles), is another name for this disease. Measles is the fifth-highest cause of illness and death in children worldwide, however, in developed countries such as Australia, it is quite rare. Even before the MMR vaccine was introduced, good nutrition and sanitation had seen a drastic reduction of incidents of measles.\n\nThe symptoms of measles may include:\n• General discomfort, illness or not feeling yourself.\n• Bluish or red spots can appear inside the mouth\n• The most well-known symptom of measles is the skin eruptions that take the form of a red, blotchy rash, which begin on the face and hairline and then spread to other parts of the body.\n\nSymptoms of measles begin to appear after about 10 days of the exposure. At first it will resemble the common cold with a fever, runny nose, cough and sore throat. About 3 to 4 days later, the infamous rash will break out.\n\nWhy you don’t need to be afraid of the measles\n\nMeasles used to be a common illness occurring in most households. In 2000 it had been declared eradicated in the United States, according to the World Health Organization. In 1963, before the vaccination, the chance of death from measles was very low, at an astonishing .000237%.\n\nIn fact, some believe that contracting childhood diseases such as measles can actually be BENEFICIAL to the immune system: they get the body’s immune system into gear, so to speak, priming it and helping it mature.\n\nContracting measles, as well as resulting in a life-long immunity to the disease itself, has been shown to provide permanent immunity to degenerative bone and cartilage diseases, along with certain tumours. Research also indicates that asthma and other allergies, such as dustmites, have effectively been prevented by contracting the natural measles disease. Shouldn’t we be looking into this, and conducting further research on the implications it holds, rather than trying to eradicate the disease?\n\nThe media does not tell you that measles had been on the decline anyway, before the vaccine was introduced.\n\nOnce someone has been infected by measles, they usually have life-long immunity from any subsequent infections.\n\nHowever, have you ever wondered why measles appears, and what is the best way to deal with it is?\n\nIt is important to keep the infected person isolated for at least the five days following the initial appearance of the rash, but they should be in bed as long as the fever persists or while the signs of cough or lung infection are still evident.\n\nKeep the eyes protected from light by either darkening the room, wearing dark glasses or turning the bed away from the incoming light. This is because the eyes turn red and are very sensitive to the light while the body is fighting measles.\n\nFollow these simple steps to heal measles naturally in 5 days or less\n\nDo not suppress your natural defenses\n\nMainstream doctors treat measles by suppressing the patient’s fever, using medication, as well as prescribing antibiotics.\n\nHowever, research has shown that this only encourages the growth of the germs, and helps them to develop a resistance to the medications used, which, in turn, can lead to the disease increasing in severity.\n\nWhat to do if you know you have been in contact with the measles\n\n\n\nIf the person knows he has been in contact with a carrier of measles, he can immediately start taking Echinacea. This will allow his immune system to be on a heightened state of alert during the incubation period. Then, when the tenth day arrives and the symptoms of the illness begin to appear, your immune system will be strong to start its battle against the virus.\n\nIf you get caught by surprise\n\nIf, however, measles takes you by surprise, and the symptoms begin to appear before you even knew you had been infected, the best way to arm yourself is to take copious amounts of Echinacea at the first signs. 30ml of tincture or 8 -10 cups of tea the first day is not overdoing it in this type of situation. Take half that amount for the remainder of the days.\n\nAfter the symptoms have appeared, a tea made as follows is given: 1 tsp of pleurisy root and ¼ tsp of ginger steeped in a pint of boiling water. This can be sweetened with honey for the little ones. If the person is a nervous one, a tsp of lady’s slipper, catnip or skullcap can be added to the above. 2 tbsp should be given every hour, more or less depending on age of the patient. Peppermint or catnip given separately is good as well.\n\nFresh air must be available\n\nMake sure there is good ventilation in the room. Keep a window open for fresh air, but ensure the patient’s eyes are not exposed to the light, by keeping the blinds down.\n\nMake sure plenty of clean, fresh water is taken. Distilled water is preferred, as it is an ‘empty’ water and therefore soaks up toxins better. All food should be stopped and only fresh vegetable and fruit juices, as much as the patient desires, should be consumed. However, a minimum of 2 litres of liquid a day should be consumed. 4 litres is ideal\n\nDon’t overlook the power of this part of the routine\n\nRather than using over-the-counter medications to lower the accompanying fever, the best way of helping the body is to build an ‘artificial fever’ (after all the fever is there for a reason!) Doing this causes the germs to multiply quickly, and therefore allow healing to take place as quickly as possible.\n\nAlthough it goes against much of what we are taught today by mainstream medicine, we should learn to view germs as our helpers. They live on toxins, mucous and other impurities in our body, and when they eat these, they help to eliminate them from our system, leaving us cleaner. Think of them as little garbage men, picking up all the rubbish we have left behind in our body. Once they have cleaned it all up, they leave, as they have nothing else to live on, and we heal. Ever wondered why we often feel really new and fresh after healing from a fever?\n\nIf we don’t let the immune system do its job, by interfering with medications to kill the germs that are cleaning up our bodies, we are interfering with nature. Not only are we left with all the toxins and impurities that the germs would have eliminated from our bodies, but we are also left with the dead germs inside us.\n\nThis can lead to a range of health problems, as the heart has to work harder to try and pump the sludge through our body.\n\nA fever is good, but never a dry one\n\nIt is important to know how to work with a fever. Moisture must be used in increasing the fever as quickly as possible, and allowing the germs to help our body as efficiently as they can.\n\nIf the fever is high, a catnip tea enema can be used. Use a ratio of one teaspoon of catnip herb for each cup of boiling (and preferably distilled) water. Pour the boiling water over the catnip, and steep for 15 to 20 minutes. After the mixture has cooled, strain off the herbs.\n\nEnema is not the enemy\n\nInsert the cooled tea into the rectum and leave it there as long as possible. This helps loose faecal matter to be removed, leaving the bowels cleaned.\n\nAfter using the tea enema, place the child into a tub of water, as hot as they can tolerate. Be sure to keep the temperature as hot as the child will allow, and for as long as the child can tolerate. While in the bath, giving the child yarrow or red raspberry leaf tea will help to induce a sweat, bringing the toxins to the skin’s surface, and thus shortening the length of the illness. They should take in at least 4-5 cups of the tea.\n\nAfter the child has been in the bath for as long as possible, assist him getting out, and apply a sponge with cold water to the skin. Without drying off the child (with the exception of the head and hair) completely, put on fresh pyjamas, and send him to bed. Be sure to use only natural fibres such as pure cotton or wool, in order to allow the skin to breath. The dampness ensures that the toxins continue to come to the surface of the skin, which in turn generates an artificial fever, and dries the clothes overnight.\n\nIn the morning, use a sponge dipped in a mixture of equal parts warm apple cider vinegar and distilled water to wipe down the child. Change his pyjamas and bed sheets, and, after letting him feed on some fruit or vegetable juice, allow him to return to bed. Do not allow the child to return to his usual activities until feeling energetic enough. In the meantime, feed the child juice, ripe fruit, plenty of distilled water, and slippery elm gruel.\n\nBe alert but not alarmed\n\nListening to the media hype is enough to put anyone into a panic about measles. However, changing our views of measles in line with those of our grandparents can help us realise that, not only is it not a disease to be feared, if treated right, but it can also bring with it a range of health benefits that are seldom discussed.\n\nStephen Mocko is a natural herbalist and healer, as well as the founder of Eureka Wellness, a health and wellness center in Melbourne, Australia, which highlights the importance of a raw diet with juicing, exercise, and clean water and air, as well as herbal supplementations. Eureka Wellness works with patients whom the doctors have dismissed as incurable. Stephen’s specialty is with diseases such as cancer, and helping patients to take control of their health once again.", "opengraph": {"locale": "en_US", "type": "article", "title": "How to immunize against measles, without vaccinations...", "description": "You do not have to vaccinate against measles. Heal Measles naturally without vaccines. Bodies natural immunity to measles is covered here. Fight measles.", "url": "https://naturalnewsblogs.com/immunize-measles-without-vaccinations/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:author": "www.facebook.com/eurekawellness", "article:tag": "Vaccinations", "article:section": "Health", "article:published_time": "2015-02-12T20:46:08+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Patient-Sick-Measles-Chick-Pocks-Red-Marks-Spots.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Patient-Sick-Measles-Chick-Pocks-Red-Marks-Spots.jpg", "image:width": "650", "image:height": "366"}, "tags": ["herbs", "Vaccinations", "measles", "Remedies", "immunity"], "tweets": [], "movies": [], "links": ["http://vaxtruth.org/2012/01/measles-perspective/", "http://vaxtruth.org/2012/01/measles-perspective/", "http://www.vaccinationcouncil.org/2013/01/29/measles-vaccines-part-ii-benefits-of-contracting-measles-by-dr-viera-scheibner-phd/", "http://www.betterhealth.vic.gov.au", "http://eurekawellness.com.au/", "http://eurekawellness.com.au/shop", "https://naturalnewsblogs.com/author/eureka_wellness/", "https://naturalnewsblogs.com/author/eureka_wellness/"], "authors": [], "publish_date": "2015-02-12T20:46:08+00:00"}