{"result_id": "213020", "URL": "https://naturalnewsblogs.com/a-closer-look-at-the-covid-vaccine-rollout/", "timestamp": "2023-04-25 16:29:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/a-closer-look-at-the-covid-vaccine-rollout/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "A Closer Look at the COVID Vaccine Rollout", "cleaned_text": "We’re almost a full year into ’14 days to flatten the curve’ but good news has finally arrived. The vaccines are here so life can return to normal! Right? Er, well…not exactly. Actually it seems the ever-elusive goal posts have moved yet again.\n\n\n\nFar from returning to normal we’re now being instructed by various ‘health authorities’ to wear two or even three facemasks in public! Scientific insight of this magnitude is why people like Fauci get paid the big bucks. Yep, no doubt we are on the cutting edge of human evolution.\n\n\n\nSpeaking of which, what about those Messianic vaccines we’ve been hearing so much about?\n\n\n\nWell for starters, ‘vaccine’ is somewhat of a misnomer in this case as both Pfizer and Moderna admit their shots don’t prevent contracting or transmitting COVID-19 (two necessary criteria for categorizing vaccines as such). Remarkably, this type of testing wasn’t even performed in their ‘Warp Speed’ clinical studies. Instead, the ‘vaccines’ were rushed through in just 8 months, bypassing critical animal trials and Phase 3 human testing along the way. By the FDA’s own definition, these ‘vaccines’ (actually gene therapy agents) are still considered experimental, thus assigning We the People the rank of guinea pig in their live trial. This certainly won’t soothe the jangled nerves of those who are familiar with Pfizer’s appalling legal history, which includes paying $2.3 billion to settle criminal and civil liabilities for illegal promotion of their products. \n\n\n\nEven people associated with Pfizer harbor serious doubts about this reckless rollout.\n\n\n\nIn October, Dr. Mike Yeadon, Pfizer’s former VP & Chief Scientist for Allergy & Respiratory, wrote: “There is absolutely no need for vaccines to extinguish the pandemic. I’ve never heard such nonsense talked about vaccines. You do not vaccinate people who aren’t at risk from a disease. You also don’t set about planning to vaccinate millions of fit and healthy people with a vaccine that hasn’t been extensively tested on human subjects.”\n\n\n\nAccording to the CDC’s own Vaccine Adverse Event Reporting System (VAERS), there have been 12,697 post-vax adverse events reported from December 14, 2020 to February 4, 2021 – including 653 deaths (the youngest being just 23 years old). \n\n\n\nVAERS is America’s main system for reporting adverse vaccine reactions. Reports submitted to VAERS require further investigation before confirmation can be made that the reported reaction was caused by the vaccine but there can be little doubt that in many of the cases there is direct causality. At the Nuestra Señora del Rosario nursing home in Spain, 46 residents died within a month after receiving their first dose, with an additional 28 subsequently testing positive for COVID. In Basingstoke, England, 22 of 72 nursing home residents died following vaccination. Similar death clusters have occurred in Norway, Germany [1] and New York. This can’t be a coincidence. I myself know of three young people who have gone into anaphylactic shock and wound up in the hospital immediately after getting the shot.\n\nWhy is this surprising? People have negative reactions to all kinds of things, which is why we see so many lawsuits involving drugs which the FDA once certified as safe and effective.[2] It’s likely all of the recalled drugs seen on T.V. commercials underwent considerably more rigorous safety tests than the COVID vaccines, and yet they are now acknowledged to have caused serious health problems for millions of people. Fortunately for the vaccine manufacturers, they can’t be held liable for damages arising from vaccine-related injuries or death, thanks to 42 USC 300aa-22. [3]\n\n\n\nWe should always keep an inquiring mind and not be dissuaded by anyone from asking questions. After all, if someone hadn’t questioned the ‘established science’ of the day, we might still be spraying our children with DDT and anyone who suggested a corollary with increasing childhood cancers would be dismissed as mad.\n\n[1] In Germany, the vaccine rollout is being conducted by the Paul Ehrlich Institute, named after a man who built his career on solving the ”population problem.” His 1977 book Ecoscience, co-authored by John Holdren – science czar during the Obama administration – put forth proposals to mass-sterilize the population by medicating the food and water supplies. The authors also suggested mandatory abortions and bodily implants that would prevent pregnancy.\n\n[2] From Robert Kennedy Jr.: Manufacturers’ U.S. Food and Drug Administration (FDA)-required product inserts on the 16 vaccines the Centers for Disease and Prevention (CDC) recommends for children list some 400 ways that vaccines can kill or injure people. These include heart attacks, myocardial infarction, strokes, seizures, tachycardia, a long list of allergies and allergic reactions, encephalopathy, anaphylaxis, arteritis, autoimmune injuries, blood clots, brain swelling, systemic inflammation, sudden death and many, many others.\n\n[3] The National Vaccine Injury Compensation Program (Vaccine Court) was setup in the 1980’s to adjudicate claims filed by people who’ve been injured by vaccines and to provide them with compensation. It is notoriously difficult to win a case and be awarded compensation because the government more often than not decides that something other than the vaccine caused the injury. Even so, to date the Vaccine Court has paid $4.5 billion for vaccine injuries.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Closer Look at the COVID Vaccine Rollout", "description": "We’re almost a full year into ’14 days to flatten the curve’ but good news has finally arrived. The vaccines are here so life can return to normal! Right? Er, well…not exactly. Actually it seems the ever-elusive goal posts have moved yet again. Far from returning to normal we’re now being instructed by various ‘health …", "url": "https://naturalnewsblogs.com/a-closer-look-at-the-covid-vaccine-rollout/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:section": "Health", "article:published_time": "2021-02-23T18:32:54+00:00", "article:modified_time": "2021-02-23T18:34:28+00:00", "updated_time": "2021-02-23T18:34:28+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Nurse-Gloves-Syringe-Needle-Vaccine.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Nurse-Gloves-Syringe-Needle-Vaccine.jpg", "image:width": "650", "image:height": "365"}, "tags": [], "tweets": [], "movies": [], "links": ["https://naturalnewsblogs.com/twilight-zone-2020/", "https://www.youtube.com/watch?fbclid=IwAR2paSOitIEkgrhSI7vGrqQyH1vEyDqjutoYofBV91WHdKiv__DdTZvwLpk&v=Oza1j2_WqBk&feature=youtu.be", "https://www.northamerica-news.com/health/pfizer-the-criminal-organization-that-wants-to-vaccinate-you/", "https://www.risingsunyoga.com/articles/former-pfizer-vp-lsquo-no-need-for-vaccines-rsquo", "https://www.lifesitenews.com/news/46-residents-in-spanish-nursing-home-die-after-receiving-covid-19-vaccine", "https://uscode.house.gov/view.xhtml?req=granuleid:USC-prelim-title42-section300aa-22&num=0&edition=prelim#:~:text=(1)%20No%20vaccine%20manufacturer%20shall,was%20properly%20prepared%20and%20was", "https://www.amazon.com/gp/product/0716700298?pf_rd_r=N9GQ2E7W9G5TK1571TDG&pf_rd_p=5ae2c7f8-e0c6-4f35-9071-dc3240e894a8&pd_rd_r=78b8b71f-d007-4e2d-8a62-d4a2790bc66c&pd_rd_w=ShfEE&pd_rd_wg=LCy75&ref_=pd_gw_unk", "https://childrenshealthdefense.org/defender/national-media-vaccine-misinformation-hank-aaron/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://www.fda.gov/vaccines-blood-biologics/vaccines/vaccines-licensed-use-united-states", "https://www.facebook.com/profile.php?id=100014922008478", "https://naturalnewsblogs.com/author/naturalterraist/", "https://naturalnewsblogs.com/author/naturalterraist/"], "authors": [], "publish_date": "2021-02-23T18:32:54+00:00"}