{"result_id": "213040", "URL": "https://naturalnewsblogs.com/how-to-protect-yourself-if-you-get-a-vaccine-2/", "timestamp": "2023-04-25 16:30:26 CEST+0200", "meta": {"description": "How to Protect Your Body from the Harms of a Vaccine If You Do Get Vaccinated", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/how-to-protect-yourself-if-you-get-a-vaccine-2/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "How to Protect Yourself If You Get a Vaccine", "cleaned_text": "There’s a large body of evidence that vaccines are responsible for a number of serious health risks, including long-term weakened immunity, organ damage, infertility, and neurological disorders like autism. Given the variety of hazardous contents in the majority of vaccines—lead, mercury, aluminum, and formaldehyde, among others—it’s understandable to consider alternatives to vaccines, of which there are many, especially given the dismal history of success vaccines have had in having their intended effect.\n\nHowever, if for whatever reason, from school pressure or local enforcement, to travel immunization restrictions, to mere uncertainty about the vaccine controversy, you or a loved one must or decide to receive a vaccine, it’s important to take measures to ensure you’re as protected as possible from the potential damaging side effects, especially the more serious ones like various forms of mental incapacitation, which pharmaceutical drug companies and the FDA now openly acknowledge are possible for a minority of people.\n\nThe components of vaccines for the purposes of bodily protection can be divided into two parts—the heavy metals like mercury, and the chemical adjuvants—the formaldehyde, other chemical preservatives, and the remaining miscellaneous synthetic additives that make up the contents of the typical vaccine. I don’t include the live virus itself, since the weakened virus itself is usually the purpose of a vaccine, though that in itself can, especially among those with weak immune systems, pose serious risks as well.\n\nThe first component, heavy metals, must be fully dealt with. Almost every single vaccine contains one or more heavy metals, the most common being aluminum and the most notorious being mercury, which is labeled under the name thimerosal. These metals are highly toxic, and damaging to anyone, even in small amounts. Moreover, our bodies are unable to excrete them properly on their own, so they can last for years in our bodies wreaking havoc over time, before resulting in serious degenerative diseases like Alzheimer’s, since heavy metals have a tendency to concentrate in the brain.\n\nOn a more immediate basis, while some develop overt physical symptoms, others can develop mental and emotional problems that can easily be wrongly attributed to typical psychiatric issues, or simply accepted for years as a personality issue to overcome, but which actually can never be overcome unless the cause of the problems, the metals, are removed. High levels of aluminum, for example, can cause feelings of apprehension, anxiety, uneasiness, inferiority, embarrassment and even shame, not merely as intensified momentary experiences, but as a generally continuous subtle or even overt emotional climate.\n\nThe way to counteract this heavy metal component is to consume substances that remove heavy metals from the body before and especially after any vaccine. Doing so is referred to as heavy metal chelation. The most effective chelators I’ve found, through personal experience and scientifically-validated studies, are EDTA (calcium disodium ethylene diamine tetra-acetic acid), chlorella, cilantro, garlic, N-Acetyl Cysteine, and a homeopathic solution called CH-77. Not all of these are created equal—chlorella, for instance, has a more difficult time crossing the blood-brain barrier and thus removing metals from the brain region. And for cilantro and garlic to have a strong enough effect, you need to juice a lot of them to intake them in sufficient quantity. From personal experience, I found the CH-77 to be by far the most powerful chelator—I had never thought homeopathic solutions could do much more than treat temporary symptoms until I used that to remove heavy metals. An alternative to orally-based chelation is to IV chelation therapy, which uses an IV drip to direct EDTA into the body directly.\n\nChelating your body prior to vaccination is important because it can lower the heavy metal load, allowing your body some room to deal with the direct infusion of metals from the vaccine itself. Chelating your body after is especially important though, and an intensive chelation therapy, orally or through IV, or both, should be done for at least a month if not longer afterwards.\n\nThe second major component, the various chemical preservatives and additives, can be addressed as well. While there is no way to fully combat these toxic substances, their effects can be mitigated to an extent. According to Dr. Archie Kalorinos in his book Every Second Child, children in Australian Aboriginal communities were often discreetly used by pharmaceutical companies as experimental subjects for vaccines. He documented that “in some Aboriginal communities…every second child given a vaccination died of crib death, but when fed high doses of vitamin C before and after vaccinations, not a single child died.”\n\nWhile these vaccines no doubt differed in their exact contents from other vaccines, they almost certainly had varying amounts of the two major components that make up virtually all vaccines. Given their weaker, undeveloped immune systems, these Aboriginal babies responded tragically in a much more egregious way than the average adult would. However, the fact that vitamin C supplementation alone before and after vaccination meant the difference between life and death, so much so that half the babies who did not receive vitamin C died, while every single baby who did receive it lived, at the very least gives evidentiary reason to believe it is prudent to supplement with vitamin C if we or one of our loved ones were to get a vaccine.\n\nDr. Kotsanis went on to refine his treatment for those who receive vaccines by additionally recommending L-glutamine, vitamin B6, probiotics, and aloe vera juice, along with plenty of purified water, as the most essential forms of protection that in his experience can make a considerable difference. In terms of specific dosages, for very young children, he recommends taking 500mg of L-glutamine, 500mg of vitamin C, and 50mg of vitamin B6 daily for six weeks prior to and following any vaccination. In addition to that, he recommends taking probiotics two times per day and two ounces of aloe vera juice in divided doses two to three times per day, for 12 to 13 weeks prior to and following vaccination. For adults, he recommends at least three to five times those dosages, though dosages can vary depending on body weight. My own inclination would be to lean on the larger dosage side.\n\nMore than anything, it’s important to make informed decisions, and if you or someone you know must get a vaccine, it can only help to take precautionary measures.", "opengraph": {"locale": "en_US", "type": "article", "title": "How to Protect Yourself If You Get a Vaccine", "description": "How to Protect Your Body from the Harms of a Vaccine If You Do Get Vaccinated", "url": "https://naturalnewsblogs.com/how-to-protect-yourself-if-you-get-a-vaccine-2/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:tag": "vaccines", "article:section": "Child Care", "article:published_time": "2013-12-03T00:12:47+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccine-Vial-Containers.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccine-Vial-Containers.jpg", "image:width": "650", "image:height": "366"}, "tags": ["autism", "mercury", "heavy metals", "chelation", "travel", "vaccines", "Child Care", "vaccination"], "tweets": [], "movies": [], "links": ["http://www.naturalnewsblogs.com/proof-big-pharma-wants-you-to-be-sick/", "http://www.naturalnewsblogs.com/vaccine-facts-youre-not-supposed-to-know-2/", "http://www.naturalnewsblogs.com/how-to-detoxify-your-body-the-real-way-2/", "http://home.earthlink.net/~joannefstruve/_wsn/page3.html", "http://www.naturalnews.com/025595_vaccinations_vaccines.html", "https://en.wikipedia.org/wiki/List_of_vaccine_ingredients", "https://naturalnewsblogs.com/author/jcho710/", "https://naturalnewsblogs.com/author/jcho710/"], "authors": [], "publish_date": "2013-12-03T00:12:47+00:00"}