{"result_id": "213002", "URL": "https://naturalnewsblogs.com/vaccine-facts-youre-not-supposed-to-know-2/", "timestamp": "2023-04-25 16:29:17 CEST+0200", "meta": {"description": "Vaccine Facts and Expert Opinions the Mainstream Media Doesn't Want You to Know", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/vaccine-facts-youre-not-supposed-to-know-2/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Vaccine Facts You're Not Supposed to Know", "cleaned_text": "With the onset of winter has come a greater push by proponents of Western medicine and pharmaceutical companies to vaccinate yourselves and your children to deter disease. The mainstream media does little to highlight the potential dangers of vaccines, and this lack of sufficient information prevents people from making properly informed decisions. While the media tends now to acknowledge the presence of harmful additives like aluminum and formaldehyde, it fails to adequately to discuss the very real dangers and side effects associated with them, let alone address the lack of positive historical correlation between vaccine use and good health.\n\nThe following is a list of quotes from leading health experts and historical facts about vaccines left out of the mainstream spotlight. These were compiled through the research of Natural News editor Mike Adams, in articles cited at the bottom, and I edited them down to the most potent information. The first section comprises insights from leading health experts, and the second section covers a brief history of actual results of vaccinated populations over time.\n\nAnyone considering taking a vaccine or allowing his or her children to be vaccinated should at least look over this information for a less mainstream-tinted look at what vaccines can do to their bodies.\n\nRecent evidence indicates that routine childhood vaccinations contribute to the emergence of chronic allergic problems such as eczema, ear infections, and asthma. While this contention is controversial, a growing number of scientists and physicians maintain that most standard vaccinations permanently disturb the developing immune system, setting the stage for hypersensitive reactions to foods and other common substances. In fact, childhood illnesses such as measles, mumps, and whooping cough may actually reduce the risk of allergy, says Konrad Kail, N.D.\n\n – Alternative Medicine the Definitive Guide, Second Edition by Larry Trivieri, Jr.\n\nScientific evidence links vaccinations to chronic fatigue, autoimmune disorders, aids, learning disabilities, and other health problems.\n\n Viera Scheibner notes that the annual death rate in Europe prior to 1940 from diphtheria was “negligible (less than 300 deaths per million).” After this date, when mass vaccinations against the disease were begun, “unprecedented” diphtheria epidemics followed in “fully vaccinated subjects.” Mass vaccinations against tetanus and whooping cough also began in many countries in the 1940s, and were followed by outbreaks of the “so-called provocation poliomyelitis.\n\n – Conscious Health: A Complete Guide to Wellness Through Natural Means by Ron Garner\n\nCompelling evidence is available that the development of the immune system after contracting the usual childhood diseases matures and renders it capable to fight infection in the future. The use of multiple vaccines, which prevents natural immunity, promotes the development of allergies and asthma. A New Zealand study disclosed that 23% of vaccinated children develop asthma compared to zero in unvaccinated children.\n\n Cancer was a very rare illness in the 1890’s.\n\n – A Physician’s Guide To Natural Health Products That Work by James A. Howenstine, MD\n\nRubella Vaccine: Does not confer lifelong immunity as a natural mild infection does; 80% of army recruits in one study contracted rubella four months after vaccinations against it. Smallpox and Tetanus vaccinations have been linked to A.I.D.S.. Swine Flu Vaccinations: The misnomer for a man-made plague that causes severe paralysisandheartfailure, which immediately killed 1600 persons vaccinated in 1976; cross-reacts for spinal cord paralysis/Guillaine-Barre syndrome; and may cause death years later from cancer or heart failure.\n\n – Anti-Aging Manual: The Encyclopedia of Natural Health by Joseph E. Mario\n\nA little baby is born and immediately given a set of vaccinations. These vaccinations are drugs. They are poisons. They are diseased chemicals. You are injecting the little baby with viruses, drugs, chemicals, and disease. The baby’s immune system begins to act in a totally unnatural way and becomes very susceptible to bacteria. Virtually every child, then, gets infections, primarily an ear infection. These infections were caused by the vaccines themselves. The doctor then prescribes more drugs in the form of antibiotics.\n\n – Natural Cures They Don’t Want You to Know About by Kevin Trudeau\n\nThe belief that vaccinations, like flu shots, have eliminated death from infectious disease in the twentieth century is widespread. In fact, much of the reduction in death from infectious disease is due to public-health measures, including improved nutrition and sanitation. And vaccinations are not without potential danger. We still don’t know the potential long-term effects of vaccination.\n\n – Before You Take that Pill: Why the Drug Industry May Be Bad for Your Health by J. Douglas Bremner\n\nMultiple vaccinations, especially in newborns, are another major source of childhood mercury exposure because of the mercury-containing thimerosal preservative. Over twenty-two vaccinations are now recommended for children before the age of two! Effects of exposure can vary from subtle to major malformations but even minor degrees of maldevelopment can have unacceptable consequences.\n\n – Health and Nutrition Secrets by Russell L. Blaylock, M.D.\n\nIt has been hypothesized by researchers at Duke University in North Carolina that the particular combination of pesticides, such as organophosphates and carbamates, along with the solvents and toxic metals and other chemicals in the anthrax and botulism vaccinations soldiers were injected with, could have brought about more nerve damage than any one of these substances could have done individually.\n\n – Toxic Overload: A Doctor’s Plan for Combating the Illnesses Caused by Chemicals in Our Foods, Our Homes, and Our Medicine Cabinets by Dr. Paula Baillie-Hamilton\n\nDPT may cause Sudden Infant Death Syndrome (SIDS) – 85% in 1 -6 months, same as the 2-4-6-month DPT vaccinations risk; the death rate increases eighttimes within 3 days of injection; in one study 70% of SIDS deaths occurred within 3 weeks of DPT vaccinations (give 1 gram Vitamin C to counter); causes reported adverse reactions in 100 per 1000 vaccinations (10%).\n\n – Anti-Aging Manual: The Encyclopedia of Natural Health by Joseph E. Mario\n\nStudies indicate that autism may be the result of adverse reactions to childhood vaccinations. Dr. Alan Cohen, an environmental physician from Connecticut, notes that high levels of autism and attention deficit disorder (ADD) did not occur until the mandatory use of childhood vaccinations, and suggests that there may be a connection between certain vaccines and the onset of these conditions.\n\n – The Complete Encyclopedia of Natural Healing: A Comprehensive A-Z Listing of Common and Chronic Illnesses and Their Proven Natural Treatments by Gary Null, Ph.D.\n\nVaccination Damage: Despite the refusal of the conventional health establishment to investigate the long-term effects of childhood vaccinations, independent research reports have increasingly been made public. These link vaccination rates to the epidemic of childhood asthma, as well as to crib death, shaken baby syndrome, hyperactivity, attention deficit disorder, autism, and juvenile diabetes. Since the 1990s, there has been a tenfold or 1000-percent increase in autism, an increase which has been linked by some researchers to the organic mercury preservative commonly found in baby vaccines.\n\n – The Natural Way to Heal: 65 Ways to Create Superior Health by Walter Last\n\nAs for vaccinations, parents should insist that their children receive only vaccines without thimerosal. Manufacturers are slow in producing mercury-free vaccines, but as a parent you should insist they be free of this toxic metal. The practice of inoculating the elderly every year against the latest flu viruses is ludicrous. Recently the CDC recommended lowering the age for yearly flu shots from age sixty-five to fifty-five and some pediatricians are now recommending flu shots for small children.\n\n – Health and Nutrition Secrets by Russell L. Blaylock, M.D.\n\nSome scientists have attributed the onset of chronic fatigue to the administration of vaccinations. Several members of the scientific community have reinforced this argument against vaccinations by establishing a correlation between Gulf War syndrome, which is predominantly characterized by chronic fatigue, and the vaccination program carried out by the military during the Persian Gulf War.\n\n – The Complete Encyclopedia of Natural Healing: A Comprehensive A-Z Listing of Common and Chronic Illnesses and Their Proven Natural Treatments by Gary Null, Ph.D.\n\nThe effect of all this is a high incidence of crib deaths in bottle-fed babies, which sometimes occur shortly after immunizations. Vaccinations can further drain the already dangerously low levels of vitamin C. Archie Kalokerinos, M.D., in Every Second Child, relates that in some Aboriginal communities of Australia every second child given a vaccination died of crib death, but when fed high doses of vitamin C before and after vaccinations, not a single child died.\n\n – The Natural Way to Heal: 65 Ways to Create Superior Health by Walter Last\n\nFew are aware that the success rate for flu vaccinations in the elderly is less than 50 percent, and that each vaccine contains the dubious bonus of mercury and aluminum doses that persist in the nervous system for decades.\n\n – Health and Nutrition Secrets by Russell L. Blaylock, M.D.\n\nAnd let me remind you that flu vaccinations are not innocuous. There is conjecture that the mercury and aluminum (metals that are known to have neurotoxic effects) in vaccine shots are associated with long-term adverse consequences. These vaccines can also overstimulate the immune system in ways that are not fully understood. For that reason, I recommend that only people with COPD get flu shots.\n\n – Before You Take that Pill: Why the Drug Industry May Be Bad for Your Health by J. Douglas Bremner\n\nGetting vaccinated is one of the worst things you could do to yourself, your children, and your loved ones. Vaccinations do not prevent illness, they cause illness. The mercury in the vaccines cause autism, brain damage, and disease. The vaccines themselves cause the body to be in an unnatural state and set you up for major disease. In the Natural Cures book I give you several other books that I recommend to discuss vaccines. They are: A Shot in the Dark, by Harris L. Coulter and Barbara Loe Fisher; Vaccines: Are They Really Safe & Effective?, by Neil Z.\n\n – More Natural Cures Revealed: Previously Censored Brand Name Products That Cure Disease by Kevin Trudeau\n\nThrough vaccinations you may gain protection from certain infections, but at the expense of having lost enough useful susceptibility on superficial levels to produce a symptomatic reaction, says Vithoulkas. In other words, you may be immune to the flu, but you’ll get cancer instead. Disease, says homeopathy is not alien to us, but a necessary elaborative and refining process of our organic being. If we cut off the disease’s mode of expression, which uses the body tissue as a medium, this drives it ever deeper into our organism in search of a venue for expression.\n\n – Physician: Medicine and the Unsuspected Battle for Human Freedom by Richard Leviton\n\nEven though all of the children who received the pertussis vaccine received other vaccinations, the researchers felt that the statistical evidence focused on pertussis. Among the children who did not receive the pertussis vaccine, most had received some other vaccination. Of the ninety-one subjects who received no vaccines, only one had asthma, compared to three with asthma in the 112 who had other vaccinations.\n\n – Encyclopedia of Natural Medicine, Revised Second Edition by Michael T. Murray, N.D., Joseph E. Pizzorno, N.D.\n\nResearchers from the American Food and Drug Administration discovered that vaccinations, particularly the hepatitis B shot, could cause hair loss. They estimate that 50,000 Americans suffer hair loss (alopecia) after immunization every year. The report was published by the Journal of the American Medical Association in 1997.\n\n It is nearly impossible to estimate the damage and suffering that has been created and will occur in the future as a result of inadequate information about the dangers of modern immunization programs.\n\n – Timeless Secrets of Health & Rejuvenation: Unleash The Natural Healing Power That Lies Dormant Within You by Andreas Moritz\n• In 1871-2, England, with 98% of the population aged between 2 and 50 vaccinated against smallpox, it experienced its worst ever smallpox outbreak with 45,000 deaths. During the same period in Germany, with a vaccination rate of 96%, there were over 125,000 deaths from smallpox. (http://www.soilandhealth.org/02/0201hyglibca…)\n\n The Hadwen Documents\n• In Germany, compulsory mass vaccination against diphtheria commenced in 1940 and by 1945 diphtheria cases were up from 40,000 to 250,000. (Don’t Get Stuck, Hannah Allen)\n• In the USA in 1960, two virologists discovered that both polio vaccines were contaminated with the SV 40 virus which causes cancer in animals as well as changes in human cell tissue cultures. Millions of children had been injected with these vaccines. (Med Jnl of Australia 17/3/1973 p555)\n• In 1967, Ghana was declared measles free by the World Health Organisation after 96% of its population was vaccinated. In 1972, Ghana experienced one of its worst measles outbreaks with its highest ever mortality rate. (Dr H Albonico, MMR Vaccine Campaign in Switzerland, March 1990)\n• In 1977, Dr. Jonas Salk who developed the first polio vaccine, testified along with other scientists, that mass inoculation against polio was the cause of most polio cases throughout the USA since 1961. (Science 4/4/77 “Abstracts” )\n• In the UK between 1970 and 1990, over 200,000 cases of whooping cough occurred in fully vaccinated children. (Community Disease Surveillance Centre, UK)\n• In the 1970’s a tuberculosis vaccine trial in India involving 260,000 people revealed that more cases of TB occurred in the vaccinated than the unvaccinated. (The Lancet 12/1/80 p73)\n• In 1978, a survey of 30 States in the US revealed that more than half of the children who contracted measles had been adequately vaccinated. (The People’s Doctor, Dr R Mendelsohn)\n• The February 1981 issue of the Journal of the American Medical Association found that 90% of obstetricians and 66% of pediatricians refused to take the rubella vaccine.\n• In 1979, Sweden abandoned the whooping cough vaccine due to its ineffectiveness. Out of 5,140 cases in 1978, it was found that 84% had been vaccinated three times! (BMJ 283:696-697, 1981)\n• In the USA, the cost of a single DPT shot had risen from 11 cents in 1982 to $11.40 in 1987. The manufacturers of the vaccine were putting aside $8 per shot to cover legal costs and damages they were paying out to parents of brain damaged children and children who died after vaccination. (The Vine, Issue 7, January 1994, Nambour, Qld)\n• In Oman between 1988 and 1989, a polio outbreak occurred amongst thousands of fully vaccinated children. The region with the highest attack rate had the highest vaccine coverage. The region with the lowest attack rate had the lowest vaccine coverage. (The Lancet, 21/9/91)\n• In 1990, a UK survey involving 598 doctors revealed that over 50% of them refused to have the Hepatitis B vaccine despite belonging to the high risk group urged to be vaccinated. (British Med Jnl, 27/1/1990)\n• In the USA, from July 1990 to November 1993, the US Food and Drug Administration counted a total of 54,072 adverse reactions following vaccination. The FDA admitted that this number represented only 10% of the real total, because most doctors were refusing to report vaccine injuries. In other words, adverse reactions for this period exceeded half a million! (National Vaccine Information Centre, March 2, 1994)\n• In 1990, the Journal of the American Medical Association had an article on measles which stated ” Although more than 95% of school-aged children in the US are vaccinated against measles, large measles outbreaks continue to occur in schools and most cases in this setting occur among previously vaccinated children.” (JAMA, 21/11/90)\n• In the New England Journal of Medicine July 1994 issue a study found that over 80% of children under 5 years of age who had contracted whooping cough had been fully vaccinated.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Facts You're Not Supposed to Know", "description": "Vaccine Facts and Expert Opinions the Mainstream Media Doesn't Want You to Know", "url": "https://naturalnewsblogs.com/vaccine-facts-youre-not-supposed-to-know-2/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:tag": "vaccines", "article:section": "Chemicals", "article:published_time": "2013-11-29T21:25:04+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccines-Needle-Virus-Sci.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccines-Needle-Virus-Sci.jpg", "image:width": "650", "image:height": "366"}, "tags": ["autism", "Vaccinations", "vaccine", "vaccines", "vaccination"], "tweets": [], "movies": [], "links": ["http://www.naturalnews.com/vaccinations.html", "http://www.naturalnews.com/book_Alternative_Medicine_the_Definitive_Guide.html", "http://www.naturalnews.com/book_Conscious_Health.html", "http://www.naturalnews.com/natural.html", "http://www.naturalnews.com/book_A_Physician", "http://www.naturalnews.com/book_Anti-Aging_Manual.html", "http://www.naturalnews.com/book_Natural_Cures_They_Dont_Want_You_to_Know_About.html", "http://www.naturalnews.com/book_Before_You_Take_That_Pill.html", "http://www.naturalnews.com/book_Health_And_Nutrition_Secrets.html", "http://www.naturalnews.com/book_Toxic_Overload.html", "http://www.naturalnews.com/book_Anti-Aging_Manual.html", "http://www.naturalnews.com/book_The_Complete_Encyclopedia_of_Natural_Healing.html", "http://www.naturalnews.com/vaccination.html", "http://www.naturalnews.com/book_The_Natural_Way_to_Heal.html", "http://www.naturalnews.com/book_Health_And_Nutrition_Secrets.html", "http://www.naturalnews.com/book_The_Complete_Encyclopedia_of_Natural_Healing.html", "http://www.naturalnews.com/book_The_Natural_Way_to_Heal.html", "http://www.naturalnews.com/book_Health_And_Nutrition_Secrets.html", "http://www.naturalnews.com/book_Before_You_Take_That_Pill.html", "http://www.naturalnews.com/book_More_Natural_Cures_Revealed.html", "http://www.naturalnews.com/book_Physician.html", "http://www.naturalnews.com/book_Encyclopedia_of_Natural_Medicine.html", "http://www.naturalnews.com/book_Timeless_Secrets_of_Health_and_Rejuvenation.html", "http://www.soilandhealth.org/02/0201hyglibcat/020119hadwin/020119hadwin.toc.html", "http://www.naturalnews.com/vaccine.html", "http://www.naturalnews.com/5.html", "http://www.naturalnews.com/vaccination.html", "http://www.naturalnews.com/025595_vaccinations_vaccines.html", "http://www.naturalnews.com/026940_vaccine_vaccines_children.html", "https://naturalnewsblogs.com/author/jcho710/", "https://naturalnewsblogs.com/author/jcho710/"], "authors": [], "publish_date": "2013-11-29T21:25:04+00:00"}