{"result_id": "213005", "URL": "https://naturalnewsblogs.com/hepatitis-b-vaccines-infants-helpful-harmful/", "timestamp": "2023-04-25 16:29:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/hepatitis-b-vaccines-infants-helpful-harmful/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Hepatitis B Vaccines in Infants: Helpful or Harmful?", "cleaned_text": "The fight over the effectiveness of vaccines and their safety is a heated debate. Unfortunately, most of society views it as a black or white issue. While it’s hard to decide which vaccines actually work to protect people from the diseases they were created to eradicate, a few have proven unnecessary, even harmful. Take the hepatitis B vaccination that’s been recommended by federal health officials since 1991 for all infants and children. Currently, the hepatitis B vaccine is mandated by 47 states for children to attend school or a daycare, despite over whelming evidence that the side effects of this vaccine far outweigh its benefits.\n\nThe government recommends a total of three hepatitis B shots as part of every child’s vaccination schedule. The first shot is administered at the hospital within 12 hours of the infants birth in the nursery. Is this a necessary vaccine that prevents a well-known childhood disease? Not likely. In fact, hepatitis B is usually transmitted through the blood, most commonly during unprotected sex with multiple partners or through the sharing of needles by intravenous drug users.\n\nAccording to an article from Dr. Jane Orient from the Association of American Physicians and Surgeons (AAPS) testified to Congress:\n\n“With hepatitis B vaccine, the case for mandatory immunization with few exemptions is far less persuasive than with smallpox or polio vaccines, which protected against highly lethal or disabling, relatively common, and easily transmissible diseases”\n\n“For most children, the risk of a serious vaccine reaction may be 100 times greater than the risk of hepatitis B.”\n\nAnother reason that clouds the vaccine’s safety is that very few people report their infants vaccination history upon death. In most cases an infants death is immediately listed as “SIDS,” or labeled as unknown.\n\nPossible serious symptoms an infant might experience post-Hepatitis B vaccination include:\n• Hives, rashes, or swelling of the body\n• Noticeable changes in mental, physical or emotional behavior\n\n.: Basically, there are two ways an infant could contract hepatitis B. The most common is through a mother who is infected with the virus during her pregnancy. She may pass it onto her infant during childbirth. However, the mother can get tested for the virus during her pregnancy to rule out possible infection before delivery.\n\nSecondly, an infant could be at risk of infection after receiving a blood transfusion that came from blood infected with hepatitis B. All blood products in the United States go through a thorough screening for the hepatitis B virus and other pathogens prior to use, but still blood transfusions are not 100 percent safe.\n\nAn article on tackles the effectiveness of preventing the virus from developing in infants treated with the hepaptis B vaccine. It goes onto speak about the difficulty scientists have in quantifying the effects of the vaccine. One point mentioned whether antibody production indeed occurs after the receiving the vaccine, and if so, for how long. It’s not likely to carry children into their teen years, at a time when they’re more likely to need it.\n\nAnother startling point brought up in the same article came from a paper published in the Journal of Viral Hepatitis. This trial studied 259 pregnant women with hepatitis B by looking at the presence of viral DNA, and viral antigens which show that the person is infected.\n\nEach infant born from the study group of women received the hepatitis B vaccines at 0,6,10, and 14 weeks. This particular study found that even though babies born to mothers with hepatitis B received the recombinant HBV vaccine, 42% went on to develop the HBV infection later in childhood. The virus is just suppressed in many cases.\n\nMost vaccine’s carry some form of animal embryo as well as aluminum. The hepatitis B vaccines are made from transformed Chinese hamster ovary cells, that’s combined with a hepatitis B surface antigen rendered insoluble by adding aluminum salt.\n\nhas a great article that breaks down the FDA’s recommendations about how much aluminum is safe for infants and adults with a compromised defense system. They felt that premature babies and any patient with impaired kidney function shouldn’t receive more than 10 to 25 micrograms of injected aluminum at any one time. So, how much aluminum is in each vaccine hepatitis B vaccine? 250 micrograms! That’s 10 X the recommended dose. So, a newborn will get a Hepatitis B injection containing 250 micrograms of aluminum the day of birth. Within the first six months, the child will receive two more doses. Most children continue to get added aluminum from other vaccines such a DTaP that administered throughout the first two years of life.\n\nWhat does this build-up of aluminum do to the body?\n\nActivates microglia in the brain, which is strongly linked to Alzheimer’s, Parkinson’s disease and autoimmune disorders.\n\nLead to a development of multiple sclerosis later in life.", "opengraph": {"locale": "en_US", "type": "article", "title": "Hepatitis B Vaccines in Infants: Helpful or Harmful?", "description": "The fight over the effectiveness of vaccines and their safety is a heated debate. Unfortunately, most of society views it as a black or white issue. While it’s hard to decide which vaccines actually work to protect people from the diseases they were created to eradicate, a few have proven unnecessary, even harmful. Take the …", "url": "https://naturalnewsblogs.com/hepatitis-b-vaccines-infants-helpful-harmful/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:author": "https://www.facebook.com/profile.php?id=100009295933522", "article:tag": "vaccine safety", "article:section": "Vaccines", "article:published_time": "2017-04-28T15:11:21+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Baby-Doctor-Inject-Vaccine-Syringe.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Baby-Doctor-Inject-Vaccine-Syringe.jpg", "image:width": "650", "image:height": "366"}, "tags": ["childhood vaccines", "hepatitis b vaccine", "vaccine safety"], "tweets": [], "movies": [], "links": ["http://www.vaccineinfo.net/issues/vaccinemandates/aaps_opposes_mandates.shtml", "http://www.aapsonline.org/testimony/hepbcom.htm", "http://kellybroganmd.com/hepatitis-b-vaccine-for-your-newborn/", "https://www.askdrsears.com/topics/health-concerns/vaccines/hepatitis-b-vaccine-and-disease-do-newborns-need-vaccine-sexually-transmitted", "https://www.askdrsears.com/topics/health-concerns/vaccines/vaccine-faqs", "https://www.ncbi.nlm.nih.gov/pubmed/11130287", "http://www.mdpi.com/1099-4300/14/11/2227", "/cdn-cgi/l/email-protection#aec3cbc2c7ddddcf80c3ccc3cbcac7cfeec9c3cfc7c280cdc1c3", "https://www.instagram.com/melicita72/", "https://www.linkedin.com/in/melissa-bill-58688913/", "https://naturalnewsblogs.com/author/meli72/", "https://naturalnewsblogs.com/author/meli72/"], "authors": [], "publish_date": "2017-04-28T15:11:21+00:00"}