{"result_id": "213011", "URL": "https://naturalnewsblogs.com/hope-or-hype-part-1-how-effective-is-the-covid-vaccine/", "timestamp": "2023-04-25 16:29:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/hope-or-hype-part-1-how-effective-is-the-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "HOPE OR HYPE: Part 1: How Effective is the Covid Vaccine?", "cleaned_text": "“Help is on the way.” – U.S. Surgeon General Jerome M. Adams\n\n“This is a day we’ve been waiting and praying for.” New York Mayo Bill deBlasio\n\n“This is the light at the end of the tunnel.” New York Governor Andrew Cuomo\n\nSo our rulers have greeted the rollout of Pfizer’s Covid-19 vaccine. And in a nation that has been battered by months of lockdowns, riots, business failures, job losses, evictions, depression, and a whole host of associated social evils, these words may sound like music to our ears. But does the reality live up to the hype?\n\nThe new vaccine, the product of a joint effort by Biontech and industry behemoth Pfizer, consists of a segment of viral mRNA encapsulated in a membrane. When these capsules are taken up by the cells, the mRNA directs the synthesis of a viral protein which normally serves to enable the virus to gain entry into your body’s cells. These proteins trigger the body’s immune system to manufacture antibodies which bind to the proteins and inactivate them, hopefully rendering the virus unable to carry out its dirty work. The vaccine is administered in the form of two injections, separated by twenty-one days each.\n\nThis new vaccine, we are told, is ninety-five percent effective. But what does it even mean to say that?\n\nThe study’s primary endpoint was covid infection of any intensity. A cough plus a positive antibody test is enough to qualify. And at the three-month mark, there were 162 test-positive in the placebo arm of the trial, versus eight in the vaccine arm.\n\nBut there were nearly 40,000 participants total in the trial, split equally between the vaccine arm and the placebo arm. Put another way, the vaccine gave recipients approximately a one in 120 reduction in their chances of being infected. When you put it in those terms, it doesn’t seem nearly as impressive – especially in the light of the fact that for most folks, the recovery rate for this virus is well in excess of 99.9%.\n\nAnd what happens at six months, or nine, or twelve? Does the immunity conferred by the vaccine last? Nobody knows – and if Pfizer has its way, we may never know. Last month, Nature reported that Pfizer had already sent a letter to trial participants informing them that the company was exploring ways to allow them to cross over from the placebo arm to the treatment arm. If this plan is carried out, then valuable information about the vaccine’s long-term effectiveness – or lack of same – will be lost.\n\nMoreover, it is an open question as to whether Pfizer can be trusted to give us accurate information regarding the safety and effectiveness of its nostrums. On Wednesday 2 September 2009, the United States Department of Justice announced that the drugmaker had agreed to pay out $2.3 billion in order to settle claims of illegal marketing of four of its products – Bextra, Geodon, Lyrica, and Zyvox. This was the largest health care fraud settlement in history, although it has since been eclipsed by the $3 billion paid out by GlaxoSmithKline in 2012.\n\nIn 2013, in the wake of a report by the Institute for Safe Medication Practices that Pfizer’s stop-smoking drug Chantix had a higher proportion of violence case reports than any other drug, the company paid out over $273 million to settle over 2,000 lawsuits filed on behalf of people claiming to have been harmed by Chantix. Five years ago, patient safety advocate Kim Witczak testified before an FDA panel, lamenting that “Twenty-two million pages of documents and dozens of key depositions may be forever lost without some sort of intervention.”\n\nOn 10 December, Witczak testified before the FDA advisory committee which voted to give emergency approval to the Pfizer vaccine. She herself has personal experience with the less helpful aspects of Pfizer’s wares. On 6 August 2003, her husband Woody hung himself from the rafters of their garage after taking Pfizer’s blockbuster drug Zoloft, which he had been prescribed for insomnia. He had no previous history of suicidality or depression.\n\nSo can we count of Pfizer to play nice this time?\n\nNext: Part 2: How Safe is the Covid Vaccine?", "opengraph": {"locale": "en_US", "type": "article", "title": "HOPE OR HYPE: Part 1: How Effective is the Covid Vaccine?", "description": "“Help is on the way.” – U.S. Surgeon General Jerome M. Adams             “This is a day we’ve been waiting and praying for.” New York Mayo Bill deBlasio             “This is the light at the end of the tunnel.” New York Governor Andrew Cuomo             So our rulers have greeted the rollout of Pfizer’s Covid-19 …", "url": "https://naturalnewsblogs.com/hope-or-hype-part-1-how-effective-is-the-covid-vaccine/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:section": "Health", "article:published_time": "2021-02-17T18:20:27+00:00", "article:modified_time": "2021-02-17T18:20:28+00:00", "updated_time": "2021-02-17T18:20:28+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Close-Up-Vaccine-Syringe.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Close-Up-Vaccine-Syringe.jpg", "image:width": "650", "image:height": "365"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.washingtonpost.com/nation/2020/12/14/coronavirus-covid-live-updates-us/", "https://www.nydailynews.com/news/politics/new-york-elections-government/ny-covid-vaccine-de-blasio-20201214-bvx44baxnzabvlfdbvczpexcri-story.html", "https://www.latimes.com/world-nation/story/2020-12-14/us-set-for-first-covid-19-shots-as-shipments-begin-arriving", "https://www.bloomberg.com/news/articles/2020-08-11/small-firms-die-quietly-leaving-thousands-of-failures-uncounted", "https://www.pewsocialtrends.org/2020/09/24/economic-fallout-from-covid-19-continues-to-hit-lower-income-americans-the-hardest/#:~:text=Fully%2015%25%20of%20adults%20report,they%20are%20currently%20not%20employed.", "https://www.wsj.com/articles/u-s-poised-for-wave-of-evictions-in-january-as-federal-ban-expires-11607855401", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2770146", "https://www.nejm.org/doi/full/10.1056/NEJMoa2034577", "https://www.nature.com/articles/d41586-020-03219-y", "https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history", "https://www.justice.gov/opa/pr/glaxosmithkline-plead-guilty-and-pay-3-billion-resolve-fraud-allegations-and-failure-report", "https://doi.org.1371/journal.pone.0015337", "https://canadafreepress.com/article/unnecessary-public-alarm", "https://www.dailymail.co.uk/news/article-9039119/FDA-commissioner-suggests-Pfizer-vaccine-not-approved-today.html", "http://psychrights.org/research/digest/AntiDepressants/FDA2-2-2004Hearing.htm", "https://naturalnewsblogs.com/author/patrickhahn/", "https://naturalnewsblogs.com/author/patrickhahn/"], "authors": [], "publish_date": "2021-02-17T18:20:27+00:00"}