{"result_id": "213001", "URL": "https://naturalnewsblogs.com/the-vaccine-debate-a-nurses-point-of-view/", "timestamp": "2023-04-25 16:29:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/the-vaccine-debate-a-nurses-point-of-view/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "The Vaccine Debate- A Nurse's Point of View", "cleaned_text": "With school back in session and flu season lurking right around the corner, vaccinations are a very touchy subject. A baby today receives more vaccines by 6 months than her mother did by the time she graduated high school. As an ex-vaccination nurse I feel it’s my duty to educate as many moms as I can before the pressure of flu season hits. I have given thousands of vaccines and have decided I no longer want any involvement in the business. I used to get annoyed by the granola moms who wanted to read each ingredient and ask 100 questions. I’ll now apologize and explain why. The ingredients, the post marketing surveillance, and the vaccination schedule, which has never been tested in humans or animals, are the main reasons I walked away from my high paying job.\n\nEach vaccine comes with a package insert. The inserts are in such small font most people can’t even read them. You can find any package insert online, but they are usually 10-13 pages per vaccine. The Vaccine Information Statement, VIS, is recommended to be given to parents or individuals before administration. It lists basic information about the disease and common side effects of the vaccine. Most people have so much anxiety over basic information in the VIS that after reading the first paragraph they are “just ready to get it over with.” They don’t even know yet about all the information in the insert, like the ingredients.\n\nUnder the description section of the package insert the ingredient list usually includes sugar, bovine serum, formaldehyde, aluminum, MSG, thimerosal (mercury), and aborted fetal tissue. Let’s talk about the most innocent first, sugar. We know sugar increases metabolic diseases, insulin resistance, diabetes, and obesity, but what about gmo sugar?\n\nSorbitol is used in many vaccines and is derived from the largest genetically modified crop in the United States, corn. I won’t go into detail about the organ damage, animal deaths, and sterility caused from eating GMO’s, but according to a Mom’s Across America report, GMO corn contains a staggering 200 times the amount of formaldehyde that is toxic to animals! This is what’s in the sugar being used for vaccines. Now remember vaccines are grown in eggs with bovine cow serum, both contain growth hormones and antibiotics, unless they decided to go organic.\n\nFormaldehyde is a known carcinogen yet the package insert admits vaccines are “not tested or evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.” Formaldehyde is a “pickling” chemical used to preserve cadavers. It’s highly toxic to the nervous system, causing blindness, brain damage and seizures. The U.S. Department of Health and Human Services openly admits that formaldehyde causes cancer. You can see this yourself on the National Toxicology Program website, featuring its 12th Report on Carcinogens. The Formaldehyde Fact Sheet states that “formaldehyde causes myeloid leukemia, and rare cancers including sinonasal and nasopharyngeal cancer.”\n\nAluminum poisoning can lead to short and long term central nervous system damage, such as memory impairments, autism, epilepsy, mental retardation, and dementia. Research shows that just 4ppm of aluminum can cause the blood to coagulate. Aluminum consumption can also be associated with the development of bone disorders, including stress fractures, Alzheimer’s Disease, and has been documented to inhibit learning.\n\nMSG is a neurotoxic chemical called an “excitotoxin.” It causes brain neurons to be overexcited to the point of death. MSG is toxic even when consumed in foods, where it causes migraine headaches and endocrine system damage.\n\nThimerosal is a methyl mercury compound that causes severe, permanent nervous system damage. Mercury is highly toxic to the brain and should never be touched, swallowed or injected at any dose. There is no safe dose of mercury! Even the CDC readily admits vaccines still contain thimerosal. In addition, National Toxicology Programs admits in its own documents that: Vaccinations “…may produce small but measurable increases in blood levels of mercury.” “Thimerosal was found to cross the blood-brain and placenta barriers.” The “…hazards of thimerosal include neurotoxicity and nephrotoxicity.” (This means brain and kidney toxicity.) “…similar toxicological profiles between ethylmercury and methylmercury raise the possibility that neurotoxicity may also occur at low doses of thimerosal.” “… there are no existing guidelines for safe exposure to ethylmercury, the metabolite of thimerosal.”\n\nAborted fetal tissue is listed in the ingredient list and in the first reference in the MMR package insert. Unfortunately there are several vaccines which use this ingredient.\n\n 1. Plotkin, S.A.; Cornfeld, D.; Ingalls, T.H.: Studies of immunization with living rubella virus: Trials in children with a strain cultured from an aborted fetus, Am. J. Dis. Child.110:381-389, 1965.\n\nNow there are preservative free vaccines out there, however they are not actually completely preservative free. For example the preservative free flu injection still contains mercury, just a smaller amount.\n\nIt’s now recommended to receive 39 vaccine doses before 7th grade. Most kids get measles, mumps, rubella, tetanus, diphtheria, pertussis, chicken pox, hepatitis b, and sometimes more in one day, yet there are zero studies proving this is safe! No testing has ever been done on more than a few vaccines given at one time.\n\nThe package insert for MMR states it was administered simultaneously with Varicella (Chicken Pox) and PedVaxHIB (Meningitis). It also admits there is limited data and concurrent administration with Polio and TDAP (Tetanus, Diptheria, and Pertussis) is not recommended. However the ACIP, Advisory Committee on Immunization Practices, says it’s fine to get multiple vaccines at the same time and is recommending a vaccine schedule that has never been proven safe in animals or humans.\n\nFrom the MMR insert…”Post marketing surveillance of M-M-R and M-M-R II over 25 years (1971 to 1996) indicates that serious adverse events such as encephalitis and encephalopathy continue to be rarely reported.”17\n\n17. Unpublished data from the files of Merck Research Laboratories.\n\nFirst of all why should we trust unpublished data from the manufacturer who is profiting from the sales of their own vaccine? More importantly why is there no information regarding the last 17 years? Over the past 30 years the vaccine schedule has tripled and autism has grown from 1 in 10,000 to 1 in 50.\n\nWorking as a triage nurse almost every hour calls come in regarding vaccine reactions and I can’t help but wonder how many of them will die. I’ve seen countless patients vomit and pass out immediately after vaccine administration. We always said it was just a vaso-vagal response, but was it really? Their blood pressure comes up eventually and after awhile they leave. They made it to their car, but who really knows what happened after that. Thus far 83 families have been compensated for developing autism spectrum disorders after vaccine administration. In 1986 the National Childhood Vaccine Injury Act was passed by congress as a result of pharmaceutical lobbying. It shields drug companies from liabilities and deaths that the government admits are unavoidably unsafe. Vaccines have their own special court where you won’t hear the outcomes in mainstream media. Pharmaceutical companies do not have to participate in the proceedings at all, taxpayers pay for all damages and the findings never have to be disclosed.\n\nI’ve been wined and dined on numerous occasions by two of the top vaccine manufacturers in the industry, Merck and GSK. Merck has been involved in numerous criminal scandals and class-action lawsuits in recent years, including fraudulently marketing its deadly drug Vioxx; lying about the true efficacy of its mumps vaccine and engaging in scientific fraud (a charge brought by its own scientists); and hiding critical side effects associated with its osteoporosis drug Fosamax, just to name a few of the most publicized.\n\nEven more shocking, in 2009, it was revealed that Merck actually had a hit list of doctors to be “neutralized” or discredited for voicing critical opinions about the pain killer Vioxx—a drug that indeed ended up killing more than 60,000 people before it was pulled from the market. In 2011, the company ended up pleading guilty to a criminal charge over the fraudulent marketing and sales of this deadly drug.\n\nThen there’s GSK, whose leadership among corporate criminals is illustrious indeed. Not only was GSK found guilty in the largest health fraud settlement in US history just last year, for which they were fined $3 billion. A couple of months ago, Chinese authorities accused the company of bribery and illegal marketing schemes. Chinese police claim to possess evidence showing that bribery has been a “core part” of GSK China’s business model since 2007.\n\nDoctors and government officials are said to have received perks such as travel, cash, and sexual favors that when combined, amounted to nearly $5 billion, according to some reports. The company allegedly used travel agencies as middlemen to carry out these illegal acts. Four Chinese GSK executives have so far been detained on charges of cash and sexual bribery.\n\nGSK also spent more than 10 years covering up information that proved they knew about the serious health dangers of their blockbuster diabetes drug Avandia, as it would adversely affect sales.\n\nNow the lead HPV vaccine scientist has come forward so she can sleep at night. She wants everyone to know that the vaccine does not reduce cervical cancer which is exactly what it’s marketed for. Also it was never tested on kids under 15, but it’s marketed to children 8 years and older.\n\nIf we can’t trust them with prescription drugs, how can we trust these same manufacturers who are protected from any legal matters, by injecting toxic potions into newborns to prevent diseases they say still exist? Just because your doctor says you should, doesn’t mean they vaccinate themselves or their own children. Doctors aren’t even the ones administering vaccines, do you think they’re reading the ingredient lists?\n\nAs more people learn the truth about the drug companies, including that their primary motive is money, not your health, the sooner we will begin to see real positive change in health care.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Vaccine Debate- A Nurse's Point of View", "description": "With school back in session and flu season lurking right around the corner, vaccinations are a very touchy subject. A baby today receives more vaccines by 6 months than her mother did by the time she graduated high school.  As an ex-vaccination nurse I feel it’s my duty to educate as many moms as I …", "url": "https://naturalnewsblogs.com/the-vaccine-debate-a-nurses-point-of-view/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:tag": "vaccines", "article:section": "Chemicals", "article:published_time": "2013-09-13T23:39:32+00:00", "article:modified_time": "2013-09-14T14:36:11+00:00", "updated_time": "2013-09-14T14:36:11+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Doctor-Girl-Child-Vaccine-Flu-Shot-Syringe.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Doctor-Girl-Child-Vaccine-Flu-Shot-Syringe.jpg", "image:width": "650", "image:height": "366"}, "tags": ["autism", "hpv", "mmr", "mercury", "formaldehyde", "vaccines", "msg", "flu shot", "aluminum"], "tweets": [], "movies": [], "links": ["https://naturalnewsblogs.com/author/emwaddy/", "https://naturalnewsblogs.com/author/emwaddy/"], "authors": [], "publish_date": "2013-09-13T23:39:32+00:00"}