{"result_id": "213008", "URL": "https://naturalnewsblogs.com/disease-vaccinations-and-lies/", "timestamp": "2023-04-25 16:29:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/disease-vaccinations-and-lies/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Disease, Vaccinations, and Lies", "cleaned_text": "There are two peer pressure and official guilt trips used on parents who refuse vaccinations for their children. The first is absurd enough to be laughable. It’s the parental tactic of not letting children who weren’t vaccinated around their vaccinated children. Excuse me, if your kids were vaccinated, they’re immune, right?\n\nCould be they’re not. As a matter of fact, children vaccinated with certain vaccines containing live viruses, such as the oral polio vaccine (OPV), have spread the live viruses through viral shedding to infect others with a virus that mutates and becomes worse.\n\nAnd here’s the second guilt trip, impeding herd immunity by not getting their kids vaccinated. This is getting so bad that vaccine industry bought pompous politicians and other vaccine advocates are promoting legislative actions toward vaccine resisting parents.\n\nThe vaccine industry insists that their goal is to create herd immunity by vaccinating at least 90% of a given population. That’s a lot of vaccinating for a lot of Big Pharma revenue maker for sure.\n\nHerd immunity depicts a scenario where everyone within that given population is immune to the disease vaccinated against. But vaccines don’t confer immunity, and they are dangerous.\n\nA 2012 study led by Dr. David Witt, an infectious disease specialist at the San Rafael, California Kaiser Permanente Medical Center concluded that pertussis, (whooping cough) occurs more among vaccinated children than children not vaccinated for pertussis. The DtaP pertussis vaccine currently used has the more dangerous DTP vaccine. Pertussis episodes have risen despite increased pertussis vaccinations.\n\nThe DTP (diphtheria, tetanus, pertussis) vaccine has had a very high infant mortality rate, too high to hide evidently. That’s why it was replaced with the DtaP vaccine for pertussis around 1996. Though not as often, brain inflammation still occurs from the DtaP vaccine, and it’s not effective for preventing pertussis.\n\nIn 2010, a mumps outbreak occurred among 1000 children in upper New Jersey and lower New York state. Almost 80% of them had been vaccinated with MMR (measles, mumps & rubella) vaccine.\n\nThroughout the 1980s, official agencies reported several outbreaks of measles occurring among children who had been vaccinated in various locations including an Illinois junior high and high school, a Massachusetts high school, a region in France, and a rural area near Helisinki, Finland.\n\nBoth USA schools had over 90% vaccinated against measles. That’s the herd immunity mark for a given population. The bogus herd immunity claim serves to create more revenue while blaming parents who refuse vaccinations for endangering humanity.\n\nMeanwhile, despite the fact that no more than five percent of vaccine adverse events get reported to the “voluntary” FDA’s vaccine adverse event reporting system (VAERS), there are many serious adverse events and vaccine injury deaths reported that aren’t publicized. Others adverse events seep through the cracks to vaccination concerned internet sites.\n\nBrief Historical Summary of the Vaccination Fraud\n\nYou might be thinking hey, what about polio and smallpox? Wasn’t herd immunity created with vaccinations against those diseases? Several outspoken doctors, including Dr. Joseph Mercola, Dr. Russell Blaylock, and Dr. Suzanne Humphries, have graphically illustrated that those diseases were on the way out when the vaccines were introduced.\n\nApparently abundant food, improved sanitation, and good plumbing has had more to do with herd immunity than vaccinations.\n\nYet polio like paralysis events that continues to occur, especially among those vaccinated against polio. They are simply given different names now. They are actually vaccine adverse events from the vaccines that manifest with seizures and paralysis, very polio like but given very different names.\n\nThough unreported by the mainstream media, many Pakistani, Indian, and African children are becoming paralyzed now from a campaign, supported largely by Bill Gates, to heavily dispense oral polio vaccines to third world countries.\n\nThe oral vaccine was so bad with its adverse effects and polio viral shedding that it was banned in the USA and a handful of other nations. But hey, let’s sell those those lots to UNICEF type agencies and Bill Gates to “contribute” to third world countries or bribe government officials to buy them directly. They’re overpopulated anyway. That’s not the type of industry to trust and support.\n\nThe concept of vaccinating with pathogenic material to immunize began in 1796, when British apothecary (pharmacist) Edward Jenner inserted cowpox pus under the skin of an eight year old boy. Jenner based his experiment on an unsubstantiated rumor that anyone who had experienced cowpox would be immune to smallpox.\n\nOver the next couple of years, Jenner vaccinated others with cowpox to immunize them against smallpox. Without any actual proof of efficacy and safety, Jenner impressed mad-hatter King George III enough with a bogus immunization guarantee that he was awarded the equivalent of today’s half-million dollars.\n\nThus, Jenner was the first medical professional to administer diseased matter as medication to a healthy person and receive a substantial financial award. He was also the first to constantly denounce vaccination detractors successfully to protect both his large public purse and ego.\n\nToday, vaccine developers create patents that enable them to receive royalties after they’ve been funded for their research. But many health professionals throughout the 19th Century knew that there had been several cases of smallpox among those with cowpox histories. So even Jenner’s premise was flawed.\n\nEngland’s post vaccination incidents of smallpox rose steadily from five percent in the beginning to 95% by 1895. There was even a serious epidemic around 1872, one year after smallpox vaccinations were decreed mandatory in the UK. The mortality rate among smallpox victims also shot up five fold around that time.\n\nDespite intelligent arguments with obvious facts and figures disproving efficacy and proving harm from toxic materials and viruses contained in vaccines, the inoculation for immunization mythology has been maintained since then.\n\nThe media has been complicit with the vaccine industry and Big Pharma by protecting the public from the truth and attacking reasonable dissenters viciously. Meanwhile the vaccine industry’s annual revenue has become $25 billion. MDs often receive bonuses for administering them while pediatricians are granted the sales rights to those they administer.\n\nThe pro-vaccination tactics of suppressing scientific data from concerned professionals has become more mafia like. Sincere medical professionals who register health concerns over vaccines are severely punished professionally and slandered, causing others to remain silent while children and adults are damaged from vaccinations.\n\nDo your research online and don’t get duped by pro-vaccination propaganda and pressure for you or your children.", "opengraph": {"locale": "en_US", "type": "article", "title": "Disease, Vaccinations, and Lies", "description": "There are two peer pressure and official guilt trips used on parents who refuse vaccinations for their children. The first is absurd enough to be laughable. It’s the parental tactic of not letting children who weren’t vaccinated around their vaccinated children. Excuse me, if your kids were vaccinated, they’re immune, right? Could be they’re not. …", "url": "https://naturalnewsblogs.com/disease-vaccinations-and-lies/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:author": "www.facebook.com/paul.fassa", "article:tag": "vaccine history", "article:section": "Health", "article:published_time": "2013-09-19T19:38:45+00:00", "article:modified_time": "2013-09-20T05:20:08+00:00", "updated_time": "2013-09-20T05:20:08+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Baby-Doctor-Inject-Vaccine-Syringe.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Baby-Doctor-Inject-Vaccine-Syringe.jpg", "image:width": "650", "image:height": "366"}, "tags": ["Vaccinations", "adverse effects", "vaccine history", "disease", "lies"], "tweets": [], "movies": [], "links": ["https://naturalnewsblogs.com/author/truthseeker/", "https://naturalnewsblogs.com/author/truthseeker/"], "authors": [], "publish_date": "2013-09-19T19:38:45+00:00"}