{"result_id": "213015", "URL": "https://naturalnewsblogs.com/the-polio-vaccine-rollout-the-40000-injured-kids-the-secret-contamination-with-cancer-causing-monkey-viruses-and-the-surge-in-cancer-cases-30-years-later/", "timestamp": "2023-04-25 16:29:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/the-polio-vaccine-rollout-the-40000-injured-kids-the-secret-contamination-with-cancer-causing-monkey-viruses-and-the-surge-in-cancer-cases-30-years-later/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "The Polio vaccine rollout--the 40,000 injured kids, the secret contamination with cancer-causing monkey viruses, and the surge in cancer cases 30 years later", "cleaned_text": "The Polio Vaccine, like all others, came about because of public demand for it. Public demand comes down to one word: Fear. Rightfully so, because people who don’t understand the nature of viruses want to rush “science” to find a “cure”. The same is true for cancer. Rushing a vaccine is never a good idea; the long-term consequences can never be determined in short-term trials. The same mistakes hold true today.\n\nAfter years of watching loved ones slowly succumb to the terrifying struggle to walk and breathe, followed by destruction of the brain-the word polio struck fear into the heart of every American. At the height of the “epidemic” in the early 1950s, over 58,000 Americans became crippled or died—most were children. Stadium sized hospital wards were full of “iron lung” machines for those who became too weak to breathe on their own. (historyofvaccines.org resource below)\n\nPresident Franklin Roosevelt (himself crippled with polio before entering the White House), as well as the most powerful political forces at the time, supported a national scientific effort to create a vaccine. One of Roosevelt’s friends organized The March of Dimes—an organization that collected millions of dollars of dimes from grade school children to help finance the research effort.\n\nJonas Salk postulated that if you grew the poliovirus in the lab, killed it, and then injected it into healthy children—the dead viruses would not be able to reproduce, so no harm would come to the children. Their immune systems would detect the presence of the virus, mount a strong defense and would produce a supply of antibodies in the process. Then –the child’s fully primed immune system would be ready to repel any live poliovirus that attacked them in the future. His trials in 1953 and ’54 were successful. Newspaper headlines excitedly proclaimed, “SALK’S VACCINE WORKS!”— “POLIO VACCINE IS SAFE, EFFECTIVE AND POTENT”.\n\nFive laboratories began producing the vaccine with a process designed by Salk. The excitement was palpable.\n\n“The results of years of research, millions of dollars of investment, and the fate of thousands of crippled children were ready for the most publicized and anticipated event in in the history of medicine.” Dr. Mary’s Monkey\n\n“On April 12, 1955, the tenth anniversary of Roosevelt’s death, Francis announced that Salk’s vaccine was effective and potent in preventing polio. Within just two hours, the US Public Health Service issued a production license and the foundation prepared for a national immunization program. The conference had been live-broadcasted to physicians all over the country who had gathered in movie theaters to watch the announcement, millions of Americans received the news over the radio, spontaneously putting down their work in celebration of the news.” (ourworldindata.org resource below)\n\nWhat didn’t make the news was what happened right before the “most anticipated event in the history of medicine”.\n\nAt the last minute, a brilliant government scientist working in bacteriology at the National Institutes of Health was given the order to safety-test the vaccine. When Bernice Eddy, M.D., PhD. injected the polio vaccine into her monkeys, they fell paralyzed in their cages. Eddy knew immediately that the virus in the vaccine was not dead as Salk had proclaimed, but was alive and ready to replicate. This had to be reported.\n\nEddy sent pictures of the paralyzed monkeys to her bosses at NIH and warned them of the upcoming tragedy if the vaccine proceeded as planned. Several prominent doctors from around the country joined those in NIH management to use their reputations to proceed forward with the vaccine. One of these was Dr. Alton Ochsner. Ochsner was very influential and had friends in high places. He was also a stockholder in one of the laboratories that produced the polio vaccine. To show the country his trust in the vaccine, he inoculated his own grandchildren with it. The mass inoculation proceeded on schedule, despite Dr. Bernice Eddy’s warning.\n\nWithin days, 40,000 children developed polio—some were crippled and some died. Dr. Ochsner’s grandson died. His granddaughter contracted polio but survived. A huge lawsuit followed. The Secretary of Health, Education, and Welfare stepped down. The Director of the National Institutes of Health, (Dr. Eddy’s boss) resigned. It was the biggest scandal in medical history.\n\n40,000 children developed polio within days of getting the first polio vaccine. But you never read about this in history books. And of course, the whistle blower was punished for doing the right thing. But Bernice Eddy was far from finished.\n\nBernice Eddy was removed from polio research and demoted to the influenza section. Eventually, a second vaccine was released that was created by Albert Sabin that used a weakened live virus instead of a dead one. It appeared to work.\n\nIn 1957, Bernice Eddy and her lunch partner Sarah Stewart, both working at NIH, discovered the “polyoma virus”, which produced several types of cancer in a variety of small animals. Polyoma proved that viruses caused some cancers. By 1959, Eddy, who was still officially assigned to the flu vaccine project, worried that something much worse than polio was going on with the vaccines. The vaccine manufacturers had been growing their polioviruses on monkey kidneys. When they removed the poliovirus from monkey kidneys, they also removed an unknown number of other monkey viruses. As time went on, more and more viruses were found. Confronted with mounting evidence that some monkey viruses caused cancer, Eddy began to wonder if they had inoculated an entire generation of Americans with cancer causing monkey viruses. This time, she kept her research secret, until the proof was undeniable.\n\nIn October of 1960, Bernice Eddy gave a talk to the New York Cancer Society and without any warning to her NIH superiors, announced that she had examined the monkey kidney cells in which the poliovirus was grown, and found that they were indeed infected with cancer-causing viruses. This was essentially a forewarning of a cancer epidemic in America, considering how many people had been inoculated.\n\nNeedless to say, her bosses at NIH were not happy. The last thing they needed the public to hear was that a cancer epidemic caused by monkey viruses were in the polio vaccine. This time, they destroyed Bernice Eddy professionally. They removed her from the lab, destroyed her animals, served a gag order on her, prohibiting her from attending professional conferences, and delaying the publication of her scientific papers. That still did not stop her. And she wasn’t the only one who knew the truth.\n\nFunny how some things never change. I bet the America’s Frontline Doctors can relate to Dr. Eddy. And instead of transparency and truth—the top government scientists feared there might be a problem involving contamination of the polio vaccine long before they acted upon it. But they had already inoculated millions of children. So they instead classified it as National Security and kept it secret. Dr. Ochsner was asked to look into the matter.\n\nDrs. Ben Sweet and M.R. Hilleman, pharmaceutical researchers for the Merck Institute for Therapeutic Research, were credited in 1960 for discovering SV-40, a monkey virus that infected almost all rhesus monkeys, whose kidneys were used to grow the poliovirus. Hilleman and Sweet found SV-40 in all three types of Albert Sabin’s live oral polio vaccine. They also noted the possibility that it might cause cancer especially when administered to human babies. The contaminated vaccines with SV-40 were injected into unsuspecting, trusting children until 1963. (thinktwice.com in resources)\n\nResearch continued to uncover terrifying information. The SV-40 cancer-causing virus was not only found in the oral polio vaccine, but also in the injectable form as well. SV-40 apparently survived the formaldehyde that Salk used to kill the virus. This means that between 1954 and 1963, 30 million to 100 million Americans and possibly another 100 million more throughout the world were injected with cancer causing SV-40 through mass vaccination.\n\nForty-one years later, investigative journalists Debbie Bookchin and Jim Schumacher documented this public health disaster:\n\n“Between 1997 and early 2003, say Bookchin and Schumacher, more than 25 published studies found SV40 in human mesotheliomas; 16 others found the virus in brain and bone cancers, lymphomas, and other cancers and in kidneys and peripheral blood. As of 2003, SV40 had been found in human tumours in 18 developed countries. Bookchin and Schumacher claim that the rates of SV40-positive tumours seem highest in countries that used the greatest amount of contaminated Salk polio vaccine, including the UK, USA, and Italy.” (The Lancet resource below)\n\nNIH first refused to stop the initial rollout of the polio virus that gave 40,000 children polio; then kept secret the contamination of millions of polio vaccines with SV-40 causing cancer, to show up many years later when no one would connect it to a vaccine. Destroyed the careers of respected scientists who knew the truth and dared to speak it. Sounds like a page out of 2020, doesn’t it?\n\nWhat secrets lie ahead for those who participated in the “experimental covid injection’?\n\nTime will tell, but the government will not.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Polio vaccine rollout--the 40,000 injured kids, the secret contamination with cancer-causing monkey viruses, and the surge in cancer cases 30 years later", "description": "The Polio Vaccine, like all others, came about because of public demand for it. Public demand comes down to one word: Fear. Rightfully so, because people who don’t understand the nature of viruses want to rush “science” to find a “cure”. The same is true for cancer. Rushing a vaccine is never a good idea; …", "url": "https://naturalnewsblogs.com/the-polio-vaccine-rollout-the-40000-injured-kids-the-secret-contamination-with-cancer-causing-monkey-viruses-and-the-surge-in-cancer-cases-30-years-later/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:author": "www.facebook.com/thomasinacopenhaver", "article:tag": "vaccine safety", "article:section": "Vaccines", "article:published_time": "2021-03-22T16:32:58+00:00", "article:modified_time": "2021-03-22T16:32:59+00:00", "updated_time": "2021-03-22T16:32:59+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Close-Up-Vaccine-Syringe1.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Close-Up-Vaccine-Syringe1.jpg", "image:width": "650", "image:height": "365"}, "tags": ["vaccine research", "vaccine dangers", "vaccine safety", "polio", "polio vaccine", "polio paralysis", "vaccine deaths"], "tweets": [], "movies": [], "links": ["https://www.marchofdimes.org/mission/a-history-of-the-march-of-dimes.aspx", "https://www.goodreads.com/book/show/10255.Dr_Mary_s_Monkey", "https://www.reddit.com/r/todayilearned/comments/1fnvuo/til_dr_bernice_eddy_warned_the_nih_that_the_polio/", "https://doctormarysmonkey.com/More/Gambit/DrO.pdf", "https://www.americasfrontlinedoctors.com/", "https://www.who.int/bulletin/archives/78%282%29195.pdf", "https://www.historyofvaccines.org/timeline#EVT_100871", "https://ourworldindata.org/polio", "https://www.thelancet.com/journals/lancet/article/PIIS0140-67360416746-9/fulltext", "http://thinktwice.com/", "//instagram.com/tcopenaturopath", "//twitter.com/tcopenaturopath", "https://naturalnewsblogs.com/author/naturopathicdoctor/", "https://naturalnewsblogs.com/author/naturopathicdoctor/"], "authors": [], "publish_date": "2021-03-22T16:32:58+00:00"}