{"result_id": "213023", "URL": "https://naturalnewsblogs.com/the-war-on-medical-freedom/", "timestamp": "2023-04-25 16:29:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/the-war-on-medical-freedom/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "The War on Medical Freedom", "cleaned_text": "There was a time in American history when scientists were touting the health benefits of certain cigarettes. Medical reports claimed that smoking Chesterfield cigarettes had “no adverse effects,” “Philip Morris are scientifically proved far less irritating to the nose and throat,” and “Smoking Camels restores and increases [the flow of digestive fluids].” \n\n\n\nOne advertisement promoted Dr. Batty’s asthma cigarettes, which, “Effectively treats: asthma, hay fever, foul breath, all disease of the throat, head colds, canker sours [sic], bronchial irritations.”\n\n\n\nYou—especially if you’re a smoker—might be thinking So what? Who cares? They got it wrong.\n\n\n\nBut imagine if based on that spurious medical information, government agents made a concerted effort to get everyone smoking. Imagine that they launched initiatives backed by the cigarette companies and other lobbyists in unrelated industries to promote 100 percent smokers by an arbitrary year.\n\n\n\nAlso imagine that certain legislators were using their bully pulpit to intimidate private companies who offered links to websites and books that contradicted the suspect medical consensus on cigarettes. Imagine full-scale censorship of anti-smoking literature.\n\n\n\nImagine the people threatening to take children away from parents if they didn’t get their kids smoking by the age of 13.\n\n\n\nThat would be insane right? Well that’s the Twilight Zone world in which we live with respect to another class of drug: vaccines.\n\n\n\nHealthyPeople 2020 is an initiative designed to increase immunization rates and reduce preventable infectious diseases by the year 2020.\n\n\n\nAs a result of this arbitrary goal, US lawmakers like California Representative Adam Schiff are pushing major companies like Facebook, Google, and Amazon to censor information raising several questions about First Amendment rights to free speech. \n\n\n\nAs a result of Schiff’s bullying, Amazon has pulled so-called anti-vaxxer documentaries from its Prime streaming catalog and Facebook, Google, and Pinterest have all initiated filtering search results on vaccine-related topics.\n\n\n\nAnd yet, many people don’t have a problem with this as it’s supposedly for the greater good. When China forced Google to filter search results, it was oppression, but when progressive Adam Schiff does it, it’s for the good of public health\n\nWrong. It’s government-backed censorship either way. If you want to know who the villains throughout history were, take a look at the ones burning books.\n\n\n\nThat’s basically what Rep. Schiff is doing with vaccine risk awareness information. People like Vaxxed producer Del Bigtree have made a serious impact shaping the conversation about vaccines and Schiff is the schoolyard bully tasked with making sure no one associates with him. \n\n\n\nIn his open letter to Amazon CEO Jeff Bezos, Schiff calls the reasonable and scientifically-backed documentaries, “misinformation.” He’s basically calling the producers liars and therefore a threat to public health that need to be shut up. But as George RR Martin had one of his characters say, “When you tear out a man’s tongue, you are not proving him a liar. You are only telling the world that you fear what he might say.” \n\n\n\nSo what exactly is Schiff and company so afraid Bigtree and others might say? Or more pointedly, what exactly is Schiff and company so afraid that everyone else might learn?\n\nAfter following the industry for years and reading much of the pertinent literature, it’s clear that they are afraid that people might learn the truth: that vaccines in general protect against some minor infectious diseases but also pose a serious risk to some people and moderate risk to most people in developing neurological and autoimmune disease.\n\n\n\nPeople will parrot back that the science has been settled and that vaccines don’t cause autism and several other backless talking points. As Schiff wrote:\n\n\n\n“The scientific and medical communities are in overwhelming consensus that vaccines are both effective and safe. There is no evidence to suggest that vaccines cause life-threatening or disabling diseases, and the dissemination of unfounded and debunked theories about the dangers of vaccinations pose a great risk to public health.”\n\n\n\nBut the science has unequivocally not been settled. In fact, it’s only just now being done. No safety study used to approve specific vaccines for the CDC schedule has used the gold standard of medical science: an inert placebo control group. They compared new vaccines against old vaccines or a collection of adjuvants, not saline, which would be the standard. In addition, they only tracked adverse events for a few days after injection, ignoring the injury that has shown up for millions of vaccinees months and years after initial injection.\n\n\n\nThese studies do not prove that vaccines are safe\n\nAnd while no legitimate science has been done to prove the safety of vaccines, there has been an increasing amount of epidemiological and biological research done showing vaccines aren’t safe. The biological studies show a causal relationship between certain vaccines and long-term neurological and autoimmune diseases and the epidemiological Mawson study shows an increase of more than four times the risk of autism, ADHD, learning disabilities, and allergic rhinitis in children who received some or all the CDC recommended vaccine schedule over completely unvaccinated children.\n\n\n\nThe science is clearly not settled. And if it were at this point, it would be settled in the opposite camp from the people claiming the science is settled. The experts were wrong with cigarettes (and dozens of other FDA-approved drugs) and they’re wrong on vaccines.\n\n\n\nSchiff and the vaccine manufacturers don’t want you to have the freedom to read this article. They don’t want you to investigate yourself. They want you to stick a needle in your arm and several needles in your child’s arm without considering the risks for yourself. \n\n\n\nThe first step is to censor the dissent, which is actively happening. Next will be forced injection. \n\n\n\nYou can think vaccination is a great boon to public health all you want, but the moment you start advocating mandated injections is when you cross over to medical fascist. This is a war on science and free speech and most of all a war on medical freedom. Whose side are you on?", "opengraph": {"locale": "en_US", "type": "article", "title": "The War on Medical Freedom", "description": "There was a time in American history when scientists were touting the health benefits of certain cigarettes. Medical reports claimed that smoking Chesterfield cigarettes had “no adverse effects,” “Philip Morris are scientifically proved far less irritating to the nose and throat,” and “Smoking Camels restores and increases [the flow of digestive fluids].” One advertisement promoted …", "url": "https://naturalnewsblogs.com/the-war-on-medical-freedom/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:author": "https://www.facebook.com/paleofamily/", "article:tag": "Vaccinations", "article:section": "Parental Rights", "article:published_time": "2019-03-26T18:37:46+00:00", "article:modified_time": "2019-03-26T18:37:47+00:00", "updated_time": "2019-03-26T18:37:47+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Enlightenment-Freedom-Happy.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Enlightenment-Freedom-Happy.jpg", "image:width": "650", "image:height": "366"}, "tags": ["Vaccinations", "Tobacco", "Adam Schiff", "medical freedom", "Del Bigtree"], "tweets": [], "movies": [], "links": ["https://www.healthypeople.gov/2020/topics-objectives/topic/immunization-and-infectious-diseases", "https://schiff.house.gov/imo/media/doc/Vaccine%20Letter_Zuckerberg.pdf", "http://vaxxedthemovie.com/", "https://paleofam.com/2019/03/rep-adam-schiffs-open-letter-to-jeff-bezos/", "http://icandecide.org/wp-content/uploads/whitepapers/ICAN%20Reply%20-%20December%2031%2C%202018.pdf", "https://vaers.hhs.gov/data/datasets.html", "https://paleofam.com/2017/05/vaccinated-children-more-likely-to-have-chronic-disease/", "https://paleofam.com/2018/12/are-aluminum-adjuvants-safe-in-vaccines/", "https://beinglibertarian.com/no-vaccines-should-never-be-mandatory/", "//jsbmorse", "//jsbmorse", "https://www.youtube.com/channel/UC1fT5BjycWvjP7seYLv91Iw", "https://naturalnewsblogs.com/author/jsbmorse/", "https://naturalnewsblogs.com/author/jsbmorse/", "https://paleofam.com", "http://godsofruin.com/", "http://code-interactive.com/ad-in"], "authors": [], "publish_date": "2019-03-26T18:37:46+00:00"}