{"result_id": "213039", "URL": "https://naturalnewsblogs.com/inaccurate-misleading-vaccine-data-agnotology-admitted-industry-insider/", "timestamp": "2023-04-25 16:30:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/inaccurate-misleading-vaccine-data-agnotology-admitted-industry-insider/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Inaccurate And Misleading Vaccine Data (Agnotology) As Admitted To By Industry Insider", "cleaned_text": "Agnotology is the term for ‘ignorance induced by the publication of inaccurate or misleading scientific data’\n\nSometimes, along comes a quote that it’s impossible to cruise on past without being stopped dead in your tracks by it. The following is just such a quote;\n\n“It is simply no longer possible to believe much of the clinical research that is published or to rely on the judgement of trusted physicians or authoritative medical guidelines. I take no pleasure in this conclusion, which I reached slowly and reluctantly over my two decades as an editor of the New England Journal of Medicine.” – Dr. Marcia Angell, a physician and long-time editor-in-chief of the New England Medical Journal\n\nThe Inaccurate And Misleading Scientific Data\n\n Despite governments duty of care to their public, we still find ourselves in a situation of agnotology with regards to vaccines.\n\nThis is such a huge mess we are in with regards to the lack of unbiased scientific evidence to back up vaccine safety claims. Let’s dive right in. Firstly, let’s get the ‘Are there aborted babies in vaccines?’ question out of the way. Yes, there are in fact cells from aborted foetuses in vaccines. Grown in labs, sometimes for many decades, called ‘cell lines’ At the moment the cell lines used are; WI-38, MRC-5, HEK293 and WALVAX 2. These nonsensical names are inaccurate and misleading, actually representing an aborted baby each and the many aborted babies that were sorted through, autopsy wise, for just the right aborted human flesh for each cell line.\n\nIn the case of WI-38, this is a diploid human cell culture line made of fibroblasts derived from lung tissue of an aborted caucasian female fetus. Henry Plotkin isolated the rubella virus from the kidney of a human fetus electively aborted during the mid-1960s. Plotkin then grew that rubella virus in Hayflick’s cell substrate, WI-38, which was also derived from aborted foetal tissue. Therefore, the rubella vaccine needed two aborted foetuses to be created.\n\nThe Medical Research Council cell strain 5 (MRC-5) is a diploid human cell culture line derived from lung tissue of a 14 week old aborted caucasian male fetus.\n\nThe agnotology with regard to cell lines/aborted baby cells contaminating vaccines, lies in the complete non-reporting of such details to the public AND in the language used ie cell lines instead of aborted human. If the more descriptive term was used then many more people would be asking questions.\n\nHuman embryonic kidney cells 293 (HEK 293) are a human cell line derived from human embryonic kidney cells grown in tissue culture. The story of how the WALVAX 2 human cell line came into being is probably the most disgusting. The aborting doctor, so as to deliver an intact aborted human specimen to the vaccine researcher, used a method of abortion not normally used. What the doctors did in aborting this 3-month old female foetus (whose tissue was eventually chosen as the best producer of diploid cell lines out of the 9 aborted foetuses that were investigated for this cell line) was that they used the water bag method of abortion.\n\nAnother Shocker Quote\n\n In scientific jargon, the term ‘Clinical equipoise’ means that there is genuine uncertainty in the expert medical community over whether a treatment will be beneficial or not. So consider the following quote with that definition in mind;\n\n“With regard to clinical equipoise in practice, there is evidence that industry-funded studies disproportionately favour the industry product, suggesting unfavourable conditions for clinical equipoise. In contrast, a series of studies of national cancer institute funded trials suggests an outcome pattern consistent with clinical equipoise.” Quotes like those make me wonder if ANY scientific data can be trusted!\n\nAngell M. ‘Drug companies and doctors: A story of corruption.’ January 15, 2009. The New York Review of Books.\n\n https://en.wikipedia.org/wiki/Clinical_equipoise", "opengraph": {"locale": "en_US", "type": "article", "title": "Inaccurate And Misleading Vaccine Data (Agnotology) As Admitted To By Industry Insider", "description": "Agnotology is the term for ‘ignorance induced by the publication of inaccurate or misleading scientific data’ Sometimes, along comes a quote that it’s impossible to cruise on past without being stopped dead in your tracks by it. The following is just such a quote; “It is simply no longer possible to believe much of the …", "url": "https://naturalnewsblogs.com/inaccurate-misleading-vaccine-data-agnotology-admitted-industry-insider/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:author": "https://www.facebook.com/detoxnaturalliving/", "article:tag": "vaccine safety", "article:section": "Vaccines", "article:published_time": "2017-12-20T21:20:41+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccine-Vile-Syringe-Shot.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccine-Vile-Syringe-Shot.jpg", "image:width": "650", "image:height": "366"}, "tags": ["clinical equipoise", "vaccine", "agnotology in vaccines", "vaccine safety"], "tweets": [], "movies": [], "links": ["https://www.naturalnewsblogs.com/gardasil-hepatitis-b-vaccines-associated-new-autoimmune-disease-asia/", "https://www.facebook.com/detoxnaturalliving/", "https://twitter.com/pixieforest19", "https://naturalnewsblogs.com/author/pixieforest1/", "https://naturalnewsblogs.com/author/pixieforest1/", "https://www.ourgoldenlife.com"], "authors": [], "publish_date": "2017-12-20T21:20:41+00:00"}