{"result_id": "213007", "URL": "https://naturalnewsblogs.com/world-leaders-cleverly-call-all-covid-vaccines-that-are-not-rna-altering-unsafe/", "timestamp": "2023-04-25 16:29:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/world-leaders-cleverly-call-all-covid-vaccines-that-are-not-rna-altering-unsafe/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "World Leaders Cleverly Call All Covid Vaccines That Are Not RNA Altering \"Unsafe\"", "cleaned_text": "As most Natural News readers know by now, the “mainstream” media is a propaganda arm of the CIA. As such, as spies, their native language is Lies. Generally speaking, whatever the major news networks are telling you is the Exact Opposite of the Truth. The number of lies from them about “covid” are too high to count. We know that “covid” is being highly exaggerated to usher in Martial Law under the guise of “health and safety”. We know that there is something highly nefarious about pushing experimental RNA vaccines on every person on the planet, which have had Zero long-term health studies about their consequences. Seeing how the “mainstream” media is pushing vaccines every day nonstop, why in the world would they ever say anything bad about them? Hence this brief discussion about America’s recall of the Johnson & Johnson covid vaccine and Europe’s recall of the AstraZeneca covid vaccine.\n\nAccording to America’s own CDC website, about 2,000 people, so far, have died immediately after receiving Pfizer’s or Moderna’s experimental RNA altering vaccine. If you read the small fine print on this CDC web page, it says that only 1% of such fatalities are even reported. This means that, according to America’s own “Centers for Disease Control and Prevention”, 200,000 Americans have died immediately after receiving a covid RNA vaccine. The first question is, why aren’t these RNA vaccines, which have been reported by our own government to have killed 200,000 people, being recalled? The second question is, if the powers-that-be so desperately want every person on the planet to fall for their covid vaccine scam, why would they ever say anything bad about any covid vaccine?\n\nThe simple fact is, the reason why the wicked leaders who run the world are badmouthing and recalling these particular covid vaccines is because they are NOT RNA altering vaccines, therefore, they want to steer people into taking the RNA ones instead. Seeing how hundreds of censored doctors say that the covid tests being used are showing false positives 90% of the time, and that covid is only one third as deadly as the seasonal flu, we can surmise that real deaths from covid are about one tenth of what is being reported by the national propaganda machine known as the “evening news“, which has repeatedly been caught falsely labeling cancer and flu deaths as “covid”. This means that the RNA vaccines have killed 4 Times more people than covid has!\n\nThe truth is, Johnson & Johnson’s and AstraZeneca’s vaccines are being banned worldwide because they are NOT RNA altering vaccines. They are instead like a traditional flu vaccine, that inserts an allegedly harmless part of the virus to train your immune system in advance to fight the more harmful strain, should it arrive. An RNA altering vaccine, on the other hand, permanently alters your RNA, which is an important precursor to your DNA, by turning your cells into covid antibody factories, which could actually spread the disease rather than prevent it, and over time, eventually alter your DNA. As there have been Zero long-term health studies about the consequences of RNA vaccines, to say that this is not possible, is not scientific at all. Once your DNA is changed, as well as once your RNA is changed, which they admit the RNA vaccine does, the results are Irreversible. Pretty bold for a vaccine that has Never been used on humans before.\n\nLastly, this also means that the “alternative” media has been manipulated, again, into unknowingly doing the bidding of the CIA’s mainstream media. Because the alternative media is so anti-vaccine, they are being misled into joining the world-leader-liars into badmouthing the only two comparatively safe covid vaccines. Watch out my fellow “alternative” media journalists. 25% of the population follows us now, so the CIA has to seriously take us into account. The CIA often contrives completely false “leaks” and “scoops” to lead alternative journalists astray, down the same path of deception as the other 75%.\n\nWhat a sad wicked world that we live in, one in which the less harmful vaccine is called “un-safe”, while the more harmful vaccine is called is called “safe”. Therefore, this means that there is a secretive reason why the powers-that-be want to Irreversibly Alter the RNA or DNA of Every Person on the planet. Use your imagination as to why they are doing this . . . if you dare. In the meantime, pray that God saves us all before it is too late.\n\nBart Sibrel is an award winning filmmaker, writer, and investigative journalist, who has been producing television programs, documentaries, music videos, TV commercials, and stage plays for over thirty-five years, starting at the age of eighteen, hosting his own Television Talk Show. Sibrel has owned five video production companies, been employed by two of the three major networks, worked as a television news reporter, produced videos shown on ABC, NBC, CBS, CNN, TLC, USA, BET, and has appeared as a seasoned actor on the stage and screen over five hundred times. Articles featuring Sibrel's films have been published in Time Magazine, The New York Times, The Washington Post, and USA Today. His awards from the American Motion Picture Society include Best Cinematography, Best Editing, and Top Ten Director.", "opengraph": {"locale": "en_US", "type": "article", "title": "World Leaders Cleverly Call All Covid Vaccines That Are Not RNA Altering \"Unsafe\"", "description": "As most Natural News readers know by now, the “mainstream” media is a propaganda arm of the CIA. As such, as spies, their native language is Lies. Generally speaking, whatever the major news networks are telling you is the Exact Opposite of the Truth. The number of lies from them about “covid” are too high …", "url": "https://naturalnewsblogs.com/world-leaders-cleverly-call-all-covid-vaccines-that-are-not-rna-altering-unsafe/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:section": "Vaccines", "article:published_time": "2021-04-27T14:18:15+00:00", "article:modified_time": "2021-04-27T14:18:16+00:00", "updated_time": "2021-04-27T14:18:16+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Nurse-Gloves-Syringe-Needle-Vaccine.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Nurse-Gloves-Syringe-Needle-Vaccine.jpg", "image:width": "650", "image:height": "365"}, "tags": [], "tweets": [], "movies": [], "links": ["/cdn-cgi/l/email-protection#cdafacbfb9bea4afbfa8a18db4aca5a2a2e3aea2a0", "https://www.youtube.com/user/BartSibrel1", "https://naturalnewsblogs.com/author/bartsibrel/", "https://naturalnewsblogs.com/author/bartsibrel/"], "authors": [], "publish_date": "2021-04-27T14:18:15+00:00"}