{"result_id": "213033", "URL": "https://naturalnewsblogs.com/tetanus-naturally/", "timestamp": "2023-04-25 16:30:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/tetanus-naturally/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Tetanus Naturally", "cleaned_text": "Since the weather is warm and many people are taking to the outdoors and getting their hands in the dirt I felt it important to address Tetanus.\n\nThe medical arena states that everyone should be immunized against Tetanus every 10 years. Thus the “Tetanus Shot” is indeed an immunization. Now all Tetanus shots I know of contain the Peruses vaccination as well. It is a combined vaccine. I might touch upon Peruses in another article but my main focus he is the reality of Tetanus, otherwise known as Lockjaw.\n\nThe medical society claims Tetanus is fatal if contracted and so push the Tetanus vaccine strongly. They use fear to promote the vaccine and use ignorance against the public. Who knows what kind of kick backs the doctors get for injecting clients with the Tetanus vaccine, but they sure are not pushing it for our health…\n\nI have been exposed to the soil, rust and all manner of environmental toxins and hazards all my life. Much of my work has always placed me in direct contact with such elements. I have been cut, stabbed and torn by knives, swords, nails, metal, wire, glass and so on. Dirt and rust contaminated many of the sharp implements. Not only have I not had a Tetanus shot in over 25 years but I have never contracted the feared Tetanus either.\n\nIs Tetanus even real? Yes of course it is. Is it dangerous? Yes, if it is not treated it can be deadly. However, do we need Tetanus vaccines? In my opinion- no. Remember I am not a doctor.\n\nSo really, what is Tetanus? Tetanus is actually an anaerobic bacteria. This means it only grows and thrives in low oxygen environments. That is key number 1. The next item of interest is that it is found in soil that has been contaminated by animal scat/feces. So we see that Tetanus has limitations and thus weaknesses. It needs a very specific environment and select conditions in which to live. With that stated how do we protect against the Tetanus bacteria? Well, not with a shot filled with poisons!\n\nWhen I was young and getting Tetanus shots they also contained the mercury filled Thimerosal. It contains almost 50% mercury! However, I guess they think they made the vaccines safer by omitting that ingredient these days. Of course they replaced Thimerosal with Aluminum Potassium Sulfate instead…yea, OK that’s much better!! NOT! So what about injecting people with cancer forming and nerve damaging Formaldehyde? How is that safe?\n\nWe can clearly see the dangers of the Tetanus vaccine. Just research any of those ingredients and read the dangers for yourself. So what to do about Tetanus in a safe way?\n\nFirst things first, if you get a cut, laceration or puncture wound you need to clean it thoroughly. The best way to do this use some kind of strong liquid to soak it in that kills bacteria. Iodine works great and is safe. After that soaking the wound in sea salt water (sea salt bath specific to the wound location) twice a day for a solid 7 days will draw out all toxins deep in the tissues. Internally you would want to start taking the following supplements:\n• Grapefruit Seed Extract- 15 drops in water or juice 3 times per day for 2 weeks\n• Food Grade Hydrogen Peroxide- in water for a solid two weeks (follow instructions)\n\nKeep the wound aerated as much as possible without getting it dirty again. Remember that the Tetanus bacteria die in oxygen. The above not only help your body kill bacteria’s but also oxygenate your blood which in turns kills all non-beneficial bacteria living in your body.\n\nUse what is safe and natural to your bodies needs and avoid the poisons the medical establishment tries to push down your throat using fear as their marketing tool. Do your research and increase your awareness and wisdom banks. If you need assistance with one of the most important aspects of life- Self Awareness then take a look at our Self Awareness dvd set. If you want more details on self care and keeping yourself healthy in a natural way then take a look at our Self Healing dvd set as well as our free digital book called Keeping Yourself Healthy Naturally in all Seasons.\n\nTo your health ~ White Wolf Von Atzingen ~ Ways Of The Wild Institute", "opengraph": {"locale": "en_US", "type": "article", "title": "Tetanus Naturally", "description": "Since the weather is warm  and many people are taking to the outdoors and getting their hands in the dirt I felt it important to address Tetanus. The medical arena states that everyone should be immunized against Tetanus every 10 years. Thus the “Tetanus Shot” is indeed an immunization. Now all Tetanus shots I know of …", "url": "https://naturalnewsblogs.com/tetanus-naturally/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:tag": "what is tetanus", "article:section": "Herbal Medicine", "article:published_time": "2013-08-17T22:24:52+00:00", "article:modified_time": "2013-08-17T22:25:14+00:00", "updated_time": "2013-08-17T22:25:14+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Injury-Scar-Wound-Band-Aid-Hand-Blood.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Injury-Scar-Wound-Band-Aid-Hand-Blood.jpg", "image:width": "650", "image:height": "366"}, "tags": ["tetanus healing", "how to cure tetanus", "what is tetanus", "healing from tetanus", "tetanus vaccine", "natural healing from tetanus"], "tweets": [], "movies": [], "links": ["http://store.waysofthewildinstitute.com/self-awareness-dvd-set/", "http://store.waysofthewildinstitute.com/self-healing-dvd-set/", "http://www.smashwords.com/books/view/217100", "https://naturalnewsblogs.com/author/wildwhitewolf/", "https://naturalnewsblogs.com/author/wildwhitewolf/"], "authors": [], "publish_date": "2013-08-17T22:24:52+00:00"}