{"result_id": "213025", "URL": "https://naturalnewsblogs.com/gardasil-hepatitis-b-vaccines-associated-new-autoimmune-disease-asia/", "timestamp": "2023-04-25 16:30:01 CEST+0200", "meta": {"description": "ASIA has been associated with many of the currently prescribed vaccines such as Guardasil and the HepB vaccine.", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/gardasil-hepatitis-b-vaccines-associated-new-autoimmune-disease-asia/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Gardasil and Hepatitis B vaccines associated with new autoimmune disease ASIA", "cleaned_text": "Remember when the narrative regarding vaccine safety was deliberately focused on Thimerosal an ethylmercury preservative and nothing else? Well, let’s dismiss mercury for the moment because we have a bigger problem on hand.\n\nThat’s because, in 2011, Shoenfeld et al. shocked the research world with their landmark publication that described a new, probably anthropogenic (caused by humans) disease called autoimmune/inflammatory syndrome induced by adjuvants (ASIA). It’s also known as Shoenfeld Syndrome, named after Dr. Y. Shoenfeld, the discoverer of this strange disease.[1] This syndrome assembles a spectrum of immune-mediated diseases triggered by an adjuvant stimulus. The chronic exposure to an adjuvant apparently triggers this disease. The adjuvants can be highly variable, including silicone, environmental molds, and aluminum salts in vaccines.\n\nThe disease’s major clinical criteria are: myalgia, myositis, muscle weakness, arthralgia and/or arthritis, chronic fatigue, unrefreshing sleep or sleep disturbances, neurological manifestations (especially associated with demyelination similar to MS), cognitive impairment and memory loss, pyrexia, and dry mouth, after exposure to external stimuli such as adjuvants, infections, vaccines, and silicone.[2]\n\nThere is now a growing fear that aluminum, a common vaccine adjuvant, is a cause of numerous chronic debilitating diseases such as a new syndrome coined in 2010 by a French myopathologist called macrophagic myofasciitis (MMF). Recently, muscle biopsy at injection sites of vaccinated patients suffering from a constellation of symptoms such as severe fatigue, muscle/joint aches, and memory loss revealed nanoparticles of aluminum contained within the cytoplasm of macrophages. Macrophages are a major immune cell type typically seen in inflammatory conditions. I don’t expand on it here, but nanomaterials present a novel and dangerous threat to our health. Therefore, nanoaluminum, in vaccines, may be particularly dangerous.\n\nIn the same journal mentioned above (Shoenfeld et al., 2011), researchers Shoenfeld and Agmon-Levin have reviewed the current data supporting a common denominator in four seemingly unrelated conditions: siliconosis from breast implants, Gulf War syndrome (GWS), macrophagic myofasciitis (MMF), and post-vaccination induced autoimmunity. All of these share a common denominator: the presence of an adjuvant that chronically stimulates the immune system. Furthermore, these four diseases share a similar complex of signs and symptoms — the ones mentioned above for ASIA — that further support a common denominator.\n\nIn my research over the last five years regarding vaccine harms and with the subsequent publication of my book in 2016, I have discovered that the assumed-to-be safe adjuvant aluminum is probably as toxic as ethylmercury, the type found in vaccines. The list of vaccines that contain aluminum are many. ASIA has been associated with many of the currently prescribed vaccines such as Gardasil and the HepB vaccine.\n\nAccording to the CDC’s website:\n\nThe adjuvant aluminum is present in U.S. childhood vaccines that prevent hepatitis A, hepatitis B, diphtheria-tetanus-pertussis (DTaP, Tdap) Haemophilus influenzae type b (Hib), human papillomavirus (HPV) and pneumococcus infection…. Seasonal influenza vaccines used in the United States do not contain adjuvants. [Emphasis mine](http://www.cdc.gov/vaccinesafety/concerns/adjuvants.html) 06/06/2013.\n\nBut wait, dear reader, there’s much more to it. In the coming weeks, I’ll be revealing the profoundly toxic effects of this supposedly safe adulterant in vaccines. I will also cover shocking evidence of ‘aluminum accumulators’ in our everyday herbs. Our exposure to aluminum has been steadily increasing since the 1950s. Impressive evidence is mounting that aluminum may contribute/cause dementia, neurodevelopmental disorders, and autoimmunity to name just a few.\n\n[1] Shoenfeld et al. ‘“ASIA” – autoimmune/inflammatory syndrome induced by adjuvants,’ Journal of Autoimmunity, Volume 36, Issue 1, Pages: 4-8, DOI: 10.1016/j.jaut.2010.07.003 FEB 2011", "opengraph": {"locale": "en_US", "type": "article", "title": "Gardasil and Hepatitis B vaccines associated with new autoimmune disease ASIA", "description": "ASIA has been associated with many of the currently prescribed vaccines such as Guardasil and the HepB vaccine.", "url": "https://naturalnewsblogs.com/gardasil-hepatitis-b-vaccines-associated-new-autoimmune-disease-asia/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:tag": "vaccines", "article:section": "Vaccines", "article:published_time": "2017-04-03T18:29:32+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Mercury-Metal-Vaccine-Shot-Syringe.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Mercury-Metal-Vaccine-Shot-Syringe.jpg", "image:width": "650", "image:height": "366"}, "tags": ["asia", "vaccines", "Shoenfeld syndrome", "autoimmunity", "autoimmune syndrome"], "tweets": [], "movies": [], "links": ["#_ftn1", "#_ftn2", "#_ftn1", "#_ftnref1", "https://www.cdc.gov/vaccinesafety/concerns/adjuvants.html", "#_ftnref1", "#_ftnref2", "https://naturalnewsblogs.com/author/cjrmd1/", "https://naturalnewsblogs.com/author/cjrmd1/", "/cdn-cgi/l/email-protection"], "authors": [], "publish_date": "2017-04-03T18:29:32+00:00"}