{"result_id": "213017", "URL": "https://naturalnewsblogs.com/ev-d68-virus-delivered-polio-vaccine-nine-children-ev-d68-develop-polio-like-paralysis/", "timestamp": "2023-04-25 16:29:47 CEST+0200", "meta": {"description": "IS THE EV-D68 VIRUS BEING DELIVERED THROUGH THE POLIO VACCINE?", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/ev-d68-virus-delivered-polio-vaccine-nine-children-ev-d68-develop-polio-like-paralysis/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "IS THE EV-D68 VIRUS BEING DELIVERED THROUGH THE POLIO VACCINE? - NINE CHILDREN WITH EV-D68 DEVELOP \"POLIO-LIKE\" PARALYSIS", "cleaned_text": "Friends, on September 9th, I posted a blog inquiring as to whether the dark ones might be using vaccines to spread the EV-D68 virus to American children. No sooner did I ask that question that my friend, Patrick Jordan, helped me uncover a PATENT for something called the “Picornavirus.” Interestingly, in that patent, HEV 68 is directly mentioned. You can read more about this here:\n\nNext, I discovered an article claiming that children who were never vaccinated are immune to the EV-D68 virus. This definitely falls into the category of “things that make you go hmmmmmm.”\n\nToday I found evidence to indicate that they are likely delivering the EV-D68 virus through the polio vaccine. Several children with the EV-D68 virus have mysteriously developed “polio-like” paralysis.\n\nDid you know that the polio vaccine CAUSED 47,000 cases of polio paralysis in 2011 alone!!!\n\n“…You only have to look to oral polio vaccine to understand the dangers of the vaccine model. In 2011, the Indian Journal of Medical Ethics published a study revealing that vaccine strain polio is twice as lethal as wild-type, and has been identified to cause over 47,000 cases of polio-associated paralysis in 2011 alone…”\n\nIt seems crystal clear that VACCINES ARE BIOLOGICAL WEAPONS. Please protect yourself and your children. DO NOT VACCINATE.\n\nSource Article:\n\n Unvaccinated Children Appear To Be Immune To The Mysterious Virus Currently Spreading In The Midwest\n\n http://www.thesleuthjournal.com/unvaccinated-children-appear-immune-mysterious-virus-currently-spreading-midwest/\n\nNEW YORK — Health officials are investigating nine cases of muscle weakness or paralysis in Colorado children and whether the culprit might be a virus causing severe respiratory illness across the country. The Centers for Disease Control and Prevention on Friday sent doctors an alert about the polio-like cases and said the germ – enterovirus 68 – was detected in four out of eight of the sick children who had a certain medical test. The status of the ninth case is unclear. The virus can cause paralysis but other germs can, too. Health officials don’t know whether the virus caused any of the children’s arm and leg weaknesses or whether it’s just a germ they coincidentally picked up. “That’s why we want more information,” and for doctors to report similar cases, said the CDC’s Dr. Jane Seward. The cases occurred within the last two months. All nine children are being treated at Children’s Hospital Colorado in Aurora, and most are from the Denver area. All had fever and respiratory illness about two weeks before developing varying degrees of limb weakness. None seems to have a weak immune system or other conditions that might predispose them to severe illness, but the cases are still being investigated, Seward said. Investigators don’t think it’s polio – eight of the nine children are up to date on polio vaccinations. The cases come amid an unusual wave of severe respiratory illness from enterovirus 68. The germ is not new – it was first identified in 1962 and has caused clusters of illness before, including in Georgia and Pennsylvania in 2009 and Arizona in 2010. Because it’s not routinely tested for, it’s possible the bug spread in previous years but was never distinguished from colds caused by other germs. This year, the virus has gotten more attention because it has been linked to hundreds of severe illnesses. Beginning last month, a flood of sick children began to hit hospitals in Kansas City, Missouri, and Chicago – kids with trouble breathing, some needing oxygen or more extreme care such as a breathing machine. Many – but not all – had asthma before the infection. The CDC has been testing a limited number of specimens from very sick children around the country, and as of Thursday reported 277 people in 40 states and the District of Columbia with enterovirus 68. So far no deaths have been attributed to the virus, but Seward said 15 still are being investigated. Health officials know enterovirus can cause paralysis. Published reports count at least two U.S. children who were paralyzed and died and were found to have the virus in their spinal fluid. One was a New Hampshire 5-year-old who died in 2008. Details are scant on the second case, which happened many years earlier. Earlier this year, Stanford University researchers said they had identified polio-like illnesses in about 20 California children over about 18 months. Two tested positive for enterovirus 68. CDC officials say it’s still not clear if the virus was a factor in those cases. Paralysis is a rare complication of enterovirus 68 infection, but with so many more cases of enterovirus being reported this year, it may not be surprising to see that problem, said Dr. Larry Wolk, chief medical officer of the Colorado Department of Public Health and Environment. The CDC is asking doctors to report patients 21 or younger who developed limb weakness since August 1 and who have had an MRI exam that showed abnormalities in the nerve tissue in the spinal cord. Seward said a test that showed the germ in a patient’s spinal fluid would be good evidence that the virus was causing paralysis. Unfortunately, lab tests of spinal fluid often fail to identify bugs like enterovirus 68, even if they’re present, she added.\n\nPaul Offit says you can safely administer 10,000 vaccines to infants at once. But he also profits from the patent he holds for the Rotateq vaccine. What’s wrong with this picture? Dr. Paul Offit is a pediatrician who co-invented a rotavirus vaccine (trade name Rotateq), who once stated in interview that a child can be administered 100,000 vaccines safely at once (later revised to 10,000). A professor of Pediatrics at the University of Pennsylvania, he is the darling of the mainstream media and a widely cited self-appointed ‘vaccine safety expert,’ despite the glaring conflict of interest implied by such a designation. Unfortunately for Dr. Offit (not so affectionately named Dr. Profit), a 2010 study published in Journal of Virology revealed that his multi-million dollar grossing patent on the Rotateq vaccine contains a live simian retrovirus (with a 96% match of certainty) that has likely infected millions of children over the past few years with a virus that causes great harm. Retrovirus infections are permanent, and can carry on indefinitely into future generations. In other words, once they are inserted into the human genome they can not be removed. View the entire PDF here. Moreover, a 2014 study published in Advances in Virology found Dr. Offit’s vaccine contains a “a baboon endogenous virus strain M7…likely due to the monkey cell line in which RotaTeq was produced from.” View the entire PDF here. In order to grasp the dire significance of these findings, you might want to familiarize yourself with the history of adventitious viruses in so-called attenuated or live vaccines. These contain the actual disease vector they are supposed to prevent. While considered “weakened,” their process of manufacture often make them more adaptable to the host within which they are injected. Many rounds of passage through human and animal cells often makes these vaccines far more dangerous than the natural ‘wild-type’ infections that we encounter naturally. You only have to look to oral polio vaccine to understand the dangers of the vaccine model. In 2011, the Indian Journal of Medical Ethics published a study revealing that vaccine strain polio is twice as lethal as wild-type, and has been identified to cause over 47,000 cases of polio-associated paralysis in 2011 alone. This was the vaccine launched by the Dali Lama himself, who apparently has no clue as to the harm caused by these interventions. The theory is that by infecting healthy bodies with them you generate an immune response – validated by elevated antibody titers, regardless of their affinity to the pathogen – that results (in theory) in increased protection. Regardless of the justification for using monkey cells for vaccine production, monkey retroviruses contaminate the vaccines nonetheless. By unintentionally infecting healthy infants with these viruses you are making them sick. Retroviruses use reverse transcriptase – a viral enzyme – to insert pathogenic genetic information into healthy cells, effectively converting them into virus-manufacturing factories. And no matter what your medical philosophy is, monkey viruses have no justifiable place in a healthy human body. For context, consider the deleterious role of a previous monkey virus – simian virus 40 (SV40) – in the polio vaccination campaigns. This ‘hidden’ cancer-causing virus infected millions of unsuspecting polio vaccine recipients during the initial polio eradication campaigns. Not only is it cancer-causing, but it is passed down transgenerationally. Merck’s senior vaccine scientist confessed in interview as to the damage these SV-40 contaminated vaccines did to millions of unsuspecting victims, including causing cancer. These vaccines did untold damage to the following infected generations, leaving a legacy of untold pain and suffering in millions of offspring whose parents unwittingly succumbed to one of the most dangerous biological experiments in human history. Watch this video to learn the horrific truth about the unintended, adverse effects of polio vaccination. Retroviruses are just as serious. HIV for instance, is a retrovirus whose phylogenetic lineage also comes from a monkey virus: simian immunodeficiency virus (SIV). Offit’s Rotateq vaccine should be pulled from the market, considering it contains live viruses that are capable of infecting the bodies of those within which they are injected. For information on the exploding epidemic caused by hidden viruses in vaccines, read Judy Mikovits’ incredible new book “Plague: One Scientist’s Intrepid Search for the Truth About Human Retroviruses and Chronic Fatigue Syndrome, Autism and Other Diseases.” It’s a must read! The significance of these findings cannot be underestimated. Rotavirus infections are a natural rite of passage for the developing immune system. In developed nations, where nutrition, hygiene and sanitation are up to par, infection from childhood pathogens normally proceed without morbidity or mortality – lest the infant/child is already immunocompromised. In fact, rotavirus challenges result in lasting immunity and provide the justification ultimately for the vaccinology model, which draws from the normal (arguably millions of years old) experience of overcoming infection, constructing a model of vaccine-induced immunity upon this natural fact. Paul Offit, the patent holder of the Rotateq vaccine is morally obligated to call for an immediate halt of the use of his vaccine in infants and children. Unless he wishes to be responsible for the harms associated with injecting them with live monkey viruses, he must step forward now to ask for a review of the safety of these vaccines. Failing to do so makes him culpable in the harm of millions of children that he personally profits from infecting with retroviruses. Enough is enough. The facts are clearly available for anyone with an ‘evidence-based’ bent to ascertain. The credibility of the entire vaccination schedule is on the line. Dr. Offit is likely uneducated about the iatrogenic risks associated with this pharmaceutical product, but new research clearly shows that the unintended, adverse effects may outweight the purported benefits. It is time to take a closer look at what if any benefit vaccines have, given their clearly documented risks.\n\nJeanice Barcelo is a birth activist, whistle blower, and someone who is concerned with all things that limit or undermine human potential and human love. She is an outspoken leader in the movement to get birth out of the hospitals and back into the home. She is also extremely concerned about things like vaccines, GMO foods, chemtrails, nuclear power and radiation, child abuse, pornography, animal abuse, technologically-managed pregnancy and childbirth, and the satanic takeover of our planet. Her use of the word “satanic” has nothing to do with her being a fundamentalist Christian, and everything to do with her awareness that there are people in very high positions of power who worship evil and who will stop at nothing to create chaos, suffering, deprivation, and destruction of our host planet and all of life. It is time for humanity to wake up and reclaim its power. And it is time for us to take our planet back and to re-establish human love as the primary purpose for existence. Everything she posts in this blog is dedicated to that end. For more info about Jeanice, please visit my website at http://BirthofaNewEarth.com or her blogger blog at http://BirthofaNewEarth.blogspot.com.\n\nHello and welcome to my blog! My name is Jeanice Barcelo and I am a birth activist, a whistle blower, and someone who is concerned with all things that limit or undermine human potential and human love. I am an outspoken leader in the movement to get birth out of the hospitals and back into the home. I am also extremely concerned about things like vaccines, GMO foods, chemtrails, nuclear power and radiation, child abuse, pornography, animal abuse, technologically-managed pregnancy and childbirth, and the satanic takeover of our planet. My use of the word \"satanic\" has nothing to do with me being a fundamentalist Christian, and everything to do with my awareness that there are people in very high positions of power who worship evil and who will stop at nothing to create chaos, suffering, deprivation, and destruction of our host planet and all of life. It is time for humanity to wake up and reclaim its power. And it is time for us to take our planet back and to re-establish human love as the primary purpose for existence. This blog is dedicated to that end. For more info about me, please visit my website at http://BirthofaNewEarth.com", "opengraph": {"locale": "en_US", "type": "article", "title": "IS THE EV-D68 VIRUS BEING DELIVERED THROUGH THE POLIO VACCINE? - NINE CHILDREN WITH EV-D68 DEVELOP \"POLIO-LIKE\" PARALYSIS", "description": "IS THE EV-D68 VIRUS BEING DELIVERED THROUGH THE POLIO VACCINE?", "url": "https://naturalnewsblogs.com/ev-d68-virus-delivered-polio-vaccine-nine-children-ev-d68-develop-polio-like-paralysis/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:tag": "virus", "article:section": "Medicine", "article:published_time": "2014-09-29T17:40:45+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Baby-Doctor-Inject-Vaccine-Syringe.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Baby-Doctor-Inject-Vaccine-Syringe.jpg", "image:width": "650", "image:height": "366"}, "tags": ["vaccine-induced diseases", "Vaccinations", "EV-D68", "virus", "vaccines", "polio vaccine", "polio paralysis", "childhood vaccines", "D68", "biological weapons"], "tweets": [], "movies": [], "links": ["http://vaccinefraud.com", "https://birthofanewearth.blogspot.com/2014/09/have-they-injected-ev-d68-virus-into.html", "http://www.cbsnews.com/news/virus-investigated-after-colorado-kids-develop-paralysis", "http://www.cbsnews.com/news/virus-investigated-after-colorado-kids-develop-paralysis", "http://www.greenmedinfo.com/blog/breaking-news-millions-children-infected-vaccine-safety-experts-rotateq-vaccine", "http://www.thesleuthjournal.com/unvaccinated-children-appear-immune-mysterious-virus-currently-spreading-midwest/", "http://www.inquisitr.com/1464195/mysterious-ev-d68-vaccinated-children-could-be-more-vulnerable/", "http://www.cbsnews.com/news/virus-investigated-after-colorado-kids-develop-paralysis/", "http://www.greenmedinfo.com/blog/breaking-news-millions-children-infected-vaccine-safety-experts-rotateq-vaccine", "http://BirthofaNewEarth.com", "https://BirthofaNewEarth.blogspot.com", "https://naturalnewsblogs.com/author/birthofanewearth/", "https://naturalnewsblogs.com/author/birthofanewearth/"], "authors": [], "publish_date": "2014-09-29T17:40:45+00:00"}