{"result_id": "213041", "URL": "https://naturalnewsblogs.com/the-covid-vaccine-how-can-you-give-informed-consent-if-youre-not-informed/", "timestamp": "2023-04-25 16:30:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/the-covid-vaccine-how-can-you-give-informed-consent-if-youre-not-informed/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "The Covid “Vaccine”—how can you give informed consent if you’re not informed?", "cleaned_text": "People who have gotten the covid “vaccine” presumably did so with informed consent. But how “informed” were they really? Were they told it wasn’t really a “vaccine”? Were they told they are part of a human experiment? Were they told that the only way the “emergency use authorization” could be given is if there are no other treatments available? Were the real risks explained?\n\nIt should be clear now why Hydroxychloroquine and Ivermectin were summarily discredited and anyone promoting them removed from any media source.\n\nThe Nuremberg Trials came to be, after World War II ended and the victorious Allied powers held trials against Nazi war criminals who perpetuated horrific experiments on unwilling prisoners of war. From these trials came a set of 10 ethical principles for human experimentation.\n\nThe ten elements of the code:\n• The results of any experiment must be for the greater good of society\n• Human experiments should be based on previous animal experimentation\n• Experiments should be conducted by avoiding physical/mental suffering and injury\n• No experiments should be conducted if it is believed to cause death/disability\n• The risks should never exceed the benefits\n• Adequate facilities should be used to protect subjects\n• Experiments should be conducted only by qualified scientists\n• Subjects should be able to end their participation at any time\n• The scientist in charge must be prepared to terminate the experiment when injury, disability, or death is likely to occur\n\nSince these are not yet approved vaccines and are considered “experimental” the Nuremberg Code should apply.\n\nCurrently there are 200+ vaccines in development. Some of those approved vaccines are: Pfizer-BioNTech BNT162b2, Moderna mRNA-1273, AstraZeneca AZD1222, Novavax NVX-CoV2372, and the Johnson and Johnson /Janssen Ad26.COV2S.\n\nVaccines were developed from the same principle as homeopathy. Homeopathic remedies work by stimulating the body’s natural healing ability.\n\nIn the case of vaccines—the virus is diluted and diluted until such a small amount of the virus remains that when introduced into the body, triggers the immune system to produce antibodies against it. Because the virus is so diluted, vaccine makers add adjuvants to improve the immune system response. Adjuvants like polysorbate 80 open the tight junctions of the blood brain barrier—allowing things like mercury and aluminum to flow right in. With the covid vaccine, instead of taking the whole virus, they only take one small part of the virus called the spike protein. From that spike protein, they are only taking the genetic code of the virus and this is called the messenger RNA (mRNA).\n\nIn previous vaccines, the whole virus was used. The body generates antibodies against the outer coating of the whole virus molecule. In this vaccine with just a piece of viral genetic code (the spike protein)—instead of the body creating antibodies that eat up and destroy the mRNA, the vaccine creates what are called non-neutralizing antibodies. These antibodies bind specifically to the virus, but do NOT stop it from being infectious.\n\nWhen your body makes these non-neutralizing antibodies, they attach to the spike protein and can travel to your lungs where they also attach to the alveoli (air sacs) and begin to break them down. Because the spike protein also attacks your macrophages, the inflammatory response continues but doesn’t stop. Here’s why.\n\nMacrophages are a type of white blood cell that literally engulf and eat any foreign substance, virus or bacteria that show up in your body and shouldn’t be in there. Macrophage means “big eater.” There are two types of macrophages. Type one are the first responders that rush in to clean up a cut, or bacterial or viral infection—and eat them up. Type one’s are relentlessly aggressive and pro-inflammatory. Type two macrophages decide when enough is enough—the foreign invader is neutralized and the debris (used white blood cells, dead cells, etc.) from the battle needs cleaned up and eliminated. Type twos are anti-inflammatory. Type one and type two work as a team. The antibody that is created in response to the spike protein—the one in the mRNA vaccines—\n\nThis means that the body is in a constant state of high inflammation, which causes a cytokine storm due to pro-inflammatory type one macrophages continuing out of control. Cytokine storms result from the sudden acute increase in circulating pro-inflammatory cytokines. Cytokine storms lead to irreversible tissue damage. This is what kills you. Not the virus, but your body’s over reaction to the virus. Some people have an immediate reaction and die from anaphylactic shock.\n\nThe antibody to the spike protein can destroy your lungs. The antibody to the spike protein is going to kill type two macrophages. When you take the mRNA vaccine, these antibodies may be dormant until another corona virus shows up. It could be the common cold—and all these mechanisms will be reactivated. The constant over-production of these pro-inflammatory antibodies can cause autoimmune conditions to develop later in life, because the antibodies will attack your own cells that contain the spike protein.\n\nModerna is a biotech company. They have never made medicine or vaccines before for humans. The mRNA in the Moderna vaccine is synthetic. When the body sees anything unnatural, foreign, or synthetic—it immediately destroys it. Since this would obviously nullify the purpose of a vaccine, the vaccine makers enveloped the mRNA code in “nano lipid particles” designed to protect it from being disintegrated immediately.\n\nThe AstraZeneca vaccine and the Johnson and Johnson vaccine use recombinant DNA or “Chimeric” DNA. Chimera is a single organism made up of cells from two or more individuals. It contains two sets of DNA. So the AstraZeneca vaccine has DNA from a chimpanzee and DNA from a human. “ChAdOxl” was chosen by Oxford University as the most suitable technology for covid vaccines because it generates a really strong immune response from just one dose. So a relatively benign adenovirus from chimpanzees is altered to carry the SARS-2 spike protein into the body which, again, stimulates the immune system to produce antibodies. The human DNA is from MRC-5 (Medical Research Council cell strain 5) originally developed from the lung tissue of a 14-week-old aborted male fetus.\n\nThe Novavax vaccine delivers the actual spike protein (bioengineered from moth cells) into the body to stimulate an immune response. It contains an adjuvant (a saponin from the Chilean soapbark tree) that increases the immune response. Technically it is considered to be an “adjuvanted recombinant protein nanoparticle”.\n\nIt’s very difficult to ascertain the truth about these experimental injections. Most people have no idea how the mRNA vaccines work, or that chimpanzee DNA is being injected into their body along with DNA from aborted fetal lungs.\n\nIgnorance is no excuse. People are rejoicing over the fact that they are now “safe”. But that isn’t true because people who have been vaccinated are still getting covid. You just won’t hear about it. Hydroxychloroquine and Ivermectin have been safely and effectively used for decades and are approved. You just won’t hear about it. People have died after taking these vaccines. You just won’t hear about it. Do you really want chimpanzee DNA and aborted fetal tissue injected into your body?\n\nPerhaps you should go back and reread the Nuremberg Code for human experimental treatments.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Covid “Vaccine”—how can you give informed consent if you’re not informed?", "description": "People who have gotten the covid “vaccine” presumably did so with informed consent. But how “informed” were they really?  Were they told it wasn’t really a “vaccine”? Were they told they are part of a human experiment? Were they told that the only way the “emergency use authorization” could be given is if there are …", "url": "https://naturalnewsblogs.com/the-covid-vaccine-how-can-you-give-informed-consent-if-youre-not-informed/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:author": "www.facebook.com/thomasinacopenhaver", "article:tag": "vaccines", "article:section": "Vaccines", "article:published_time": "2021-04-09T14:41:44+00:00", "article:modified_time": "2021-04-09T14:42:50+00:00", "updated_time": "2021-04-09T14:42:50+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccine-Syringe-Hand-Medical-HPV.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Vaccine-Syringe-Hand-Medical-HPV.jpg", "image:width": "650", "image:height": "366"}, "tags": ["vaccines", "covid-19", "Nuremberg trials", "macrophage"], "tweets": [], "movies": [], "links": ["https://www.massdevice.com/the-nuremberg-code-and-its-impact-on-clinical-research/", "https://www.webmd.com/balance/what-is-homeopathy#:~:text=Homeopathy%20is%20a%20medical%20system,these%20stimulate%20the%20healing%20process.", "https://www.virology.ws/2009/07/24/virus-neutralization-by-antibodies/", "https://www.cusabio.com/c-20938.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7365923/", "https://www.nature.com/articles/s41578-021-00281-4#:~:text=Lipid%20nanoparticles%20are%20spherical%20vesicles,lipids%2C%20such%20as%20liposomes).", "https://fullfact.org/online/AstraZeneca-vaccine-foetal-cells-chimpanzee-virus/", "https://www.novavax.com/covid-19-coronavirus-vaccine-candidate-updates", "https://www.youtube.com/watch?v=8o4x4OlnX54", "https://www.webmd.com/balance/what-is-homeopathy#:~:text=Homeopathy%20is%20a%20medical%20system,these%20stimulate%20the%20healing%20process.", "https://www.virology.ws/2009/07/24/virus-neutralization-by-antibodies/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7365923/", "https://www.cusabio.com/c-20938.html", "https://www.nature.com/articles/s41578-021-00281-4#:~:text=Lipid%20nanoparticles%20are%20spherical%20vesicles,lipids%2C%20such%20as%20liposomes).", "https://fullfact.org/online/AstraZeneca-vaccine-foetal-cells-chimpanzee-virus/", "https://www.novavax.com/covid-19-coronavirus-vaccine-candidate-updates", "//instagram.com/tcopenaturopath", "//twitter.com/tcopenaturopath", "https://naturalnewsblogs.com/author/naturopathicdoctor/", "https://naturalnewsblogs.com/author/naturopathicdoctor/"], "authors": [], "publish_date": "2021-04-09T14:41:44+00:00"}