{"result_id": "213036", "URL": "https://naturalnewsblogs.com/zika-virus-brazil-raises-mosquito-vaccine-questions/", "timestamp": "2023-04-25 16:30:20 CEST+0200", "meta": {"description": "The Zika virus outbreak in in Brazil causes brain defect called microcephaly may not be the Zika virus", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/zika-virus-brazil-raises-mosquito-vaccine-questions/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Zika virus in Brazil raises mosquito and vaccine questions", "cleaned_text": "The Zika virus outbreak in Brazil has been blamed on mosquito bites, but the real cause of the children born with a brain defect called microcephaly may not be the Zika virus. The Zika virus is transmitted by mosquitoes. However, sources report that only a FEW of the infants born with this condition had ANY evidence of the Zika virus in their brains. Brazil had fewer than 150 cases of microcephaly in the all of 2014, but there have been more than 3,500 reported cases since October 2015. At the same time, in 2015, Brazil instituted a mandatory vaccine policy for pregnant women. Could vaccines be causing the brain defect in infants in Brazil?\n\n“The link with Zika has not been confirmed. But some babies who died had the virus in their brain and it has been detected in placenta and amniotic fluid too.”\n\nAre vaccines a cause of the microcephaly brain deformity occurring in Brazil?\n\nIt has been shown that vaccine injection can cross the blood brain barrier in utero, if the blood brain barrier has not been fully formed. In Brazil, mandatory vaccination of expectant mothers was instituted in early 2015. Brazil’s Minister of Health required a new TDAP vaccines be given to all expectant mothers. TDAP is a new type of DPT vaccine, which contains vaccines for diphtheria, pertussis and tetanus. Pertussis vaccines have been given to pregnant women in England since 2012 and have not been known to cause risk to the pregnancies or the infants.\n\nThe Tdap vaccine is a reduced-dose acellular pertussis vaccine that also includes tetanus and diphtheria vaccines. Since 2011, The Tdap shot has been recommended by the Center for Disease Control (CDC) for women at 20 weeks of gestation. The FDA classifies the Tdap as a Class C drug, which means that is it NOT SAFE to be given during pregnancy, and there have been no test to see if the Tdap is safe for pregnant women. Research is underway at Vanderbilt University, where the hope is that vaccinating the pregnant mothers will pass along the immunity in utero to the children but this research has not yet been published.\n\nWhat the World Health Organization says about the Zika virus\n\nOn Jan 21, 2016, the World Health Organization (WHO) stated “The Brazilian authorities believe the increase (in brain deformities) is caused by an outbreak of Zika virus.” The WHO has previously stated, “Zika is generally mild and only causes symptoms in one in five people”. On Jan 28, 2016, the WHO director general Dr Margaret Chan declared that Zika has escalated “from a mild threat to one of alarming proportions”. WHO has established a Zika “emergency team” because there has been what is called an “explosive” spread of the virus.\n\nWhat are symptoms of the Zika virus?\n\nMost people who have the Zika virus have little or no symptoms. Some people experience a fever or get a rash. Other symptoms include headaches, joint pain, or eye redness (conjunctivitis).\n\nThe carriers of the Zika virus are a mosquito with the scientific name of Aedes aegypti and Aedes albopictus. The same mosquito also spreads dengue fever and chikungunya fever. These mosquitoes are active in the daytime, unlike the mosquitoes that spread malaria which are only active at night. The mosquito bites a person who is infected with the virus and then spreads the infection when they bite another person.\n\nCould GMO mosquitoes be causing the outbreak of Zika virus?\n\nBeginning in 2011, the British biotech company Oxitec has released GMO mosquitoes in Brazil. This strain of Aedes mosquitoes has been genetically modified to help eliminate dengue fever, which is spread by the Aedes mosquito. Up to 2 million GMO mosquitoes are produced each week in the Brazilian factory.\n\nConclusion:\n\n There is not yet a sure link between the Zika virus and brain deformities seen in Brazil. This link needs to be further established. Research on the efficacy of the Tdap vaccine also needs to be quickly published and brought to light. Further information about the GMO mosquitoes also needs further elucidation.\n\nMelanie Grimes, CCH, is a writer, health educator and homeopath. She is a member of the Association of Health Care Journalists. She has taught at Bastyr University and lectured internationally. Follow her blog at MelanieGrimes.com. To order professional quality vitamins, visit her online vitamin shop at https://www.healthwavehq.com/welcome/mgrimes.", "opengraph": {"locale": "en_US", "type": "article", "title": "Zika virus in Brazil raises mosquito and vaccine questions", "description": "The Zika virus outbreak in in Brazil causes brain defect called microcephaly may not be the Zika virus", "url": "https://naturalnewsblogs.com/zika-virus-brazil-raises-mosquito-vaccine-questions/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:author": "https://www.facebook.com/wellnessheal", "article:tag": "Zika virus", "article:section": "Health", "article:published_time": "2016-01-29T16:59:21+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Mosquito-Bite-Skin.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Mosquito-Bite-Skin.jpg", "image:width": "650", "image:height": "366"}, "tags": ["Dengue", "DPT", "birth defects", "FDA", "pregnacy", "vaccine", "DPT vaccine", "Zika virus", "Zika", "GMO", "GMO mosquito", "Zika fever", "mosquito", "WHO", "pertussis vaccine", "microcephaly", "vaccination"], "tweets": [], "movies": [], "links": ["https://www.healthwavehq.com/welcome/mgrimes", "http://www.bbc.com/news/health-35427493", "http://www.bbc.com/news/health-35370848", "https://vaccinesbytheoutliers.wordpress.com/2015/10/08/injecting-vaccines-before-a-childs-blood-brain-barrier-is-fully-developed/", "https://naturalnewsblogs.com/author/melaniegrimes/", "https://naturalnewsblogs.com/author/melaniegrimes/"], "authors": [], "publish_date": "2016-01-29T16:59:21+00:00"}