{"result_id": "213029", "URL": "https://naturalnewsblogs.com/hope-or-hype-part-3-can-we-trust-pfizer-to-police-itself/", "timestamp": "2023-04-25 16:30:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/hope-or-hype-part-3-can-we-trust-pfizer-to-police-itself/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "HOPE Or HYPE: Part 3: Can We Trust Pfizer to Police Itself?", "cleaned_text": "A number of concerns have bene raised about the safety and efficacy of the Pfizer vaccine for the coronavirus, to wit:\n• No data that show the vaccine prevents hospitalizations, ICU cases, or deaths\n• No data that show the vaccine prevents transmission of the disease\n• No access to the patient-level data\n• No data at all beyond the three-month endpoint\n\nMoreover, the trial protocol contains instructions which could be interpreted as subtly admonishing clinicians to break the blind and systematically undercount cases in the treatment arm.\n\nNew data that have become available have done little to allay any of these concerns.\n\nWriting in the 4 January issue of the BMJ, Peter Doshi, Professor of Pharmaceutical health Services Research at the University of Maryland, notes that the FDA report on the Pfizer vaccine stated that while there were only eight cases of confirmed Covid-19 infection in the treatment arm (as opposed to 162 in the placebo arm), the number of suspected covid cases in the treatment arm was 1,594, as opposed to 1,816 in the placebo group. The relative reduction in risk of Covid-19 symptoms amounts to a paltry nineteen percent. Even if we remove cases that occurred within seven days after vaccination (which should eliminate the majority of ones due to vaccine reactogenicity), the relative reduction in risk still amounts to only twenty-nine percent. This is a far cry from the FDA minimum standard of fifty percent efficacy –and even farther from the ninety-five percent figure trumpeted by Pfizer.\n\nFor some reason, Pfizer’s 31 December paper in the New England Journal of Medicine didn’t get around to mentioning any of this.\n\nIn fairness, it should be pointed out that some of these cases of suspected Covid-19 may be due to some other pathogen. But Dr. Doshi asks a pointed question: why should that even matter? If “suspected” and “confirmed” cases of Covid-19 follow a similar clinical course, then perhaps suspected + confirmed cases is a more meaningful clinical endpoint that just confirmed cases.\n\nDr. Doshi’s article raised other concerns as well. Pfizer’s covid vaccine is meant to be administered in two doses, twenty-one days apart. 371 patients were excluded from the efficacy analysis for “important protocol deviations on or prior to 7 days after Dose 2.” Of these, sixty were from the placebo arm of the trial, whereas 311 were from the treatment arm.\n\nWhy were five times as many patients excluded from the treatment arm? No one who is in a position to know is saying anything.\n\nIn addition, without access to the patient-level data, we can’t know how much stock to put into even the primary endpoint of the trial – confirmed covid-19 cases. The primary event adjudication committee for the Pfizer vaccine trials consisted of three Pfizer employees. In other words, Pfizer is asking us to take Pfizer’s word regarding the efficacy of its product. Given that company’s previous track record, which includes a $2.3 billion fine to settle claims of illegal marketing of its wares, that is cold comfort.", "opengraph": {"locale": "en_US", "type": "article", "title": "HOPE Or HYPE: Part 3: Can We Trust Pfizer to Police Itself?", "description": "A number of concerns have bene raised about the safety and efficacy of the Pfizer vaccine for the coronavirus, to wit: No data that show the vaccine prevents hospitalizations, ICU cases, or deaths No data that show the vaccine prevents transmission of the disease No access to the patient-level data No data at all beyond …", "url": "https://naturalnewsblogs.com/hope-or-hype-part-3-can-we-trust-pfizer-to-police-itself/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:section": "Health", "article:published_time": "2021-02-17T18:23:39+00:00", "article:modified_time": "2021-02-17T18:23:40+00:00", "updated_time": "2021-02-17T18:23:40+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Baby-Vaccine.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/07/Baby-Vaccine.jpg", "image:width": "650", "image:height": "365"}, "tags": [], "tweets": [], "movies": [], "links": ["https://pfe-pfizercom-d8-prod.s3.amazonaws.com/2020-09/C4591001_Clinical_Protocol.pdf", "https://blogs.bmj.com/bmj/2021/01/04/peter-doshi-pfizer-and-modernas-95-effective-vaccines-we-need-more-details-and-the-raw-data/", "https://www.fda.gov/media/139638/download", "https://www.nejm.org/doi/full/10.1056/NEJMoa2034577", "https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history", "https://naturalnewsblogs.com/author/patrickhahn/", "https://naturalnewsblogs.com/author/patrickhahn/"], "authors": [], "publish_date": "2021-02-17T18:23:39+00:00"}