{"result_id": "213009", "URL": "https://naturalnewsblogs.com/vaccine-bs/", "timestamp": "2023-04-25 16:29:29 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "https://naturalnewsblogs.com/wp-content/themes/NaturalNews101/images/NaturalNews.ico", "canonical": "https://naturalnewsblogs.com/vaccine-bs/", "encoding": "UTF-8"}, "image": null, "domain": "naturalnewsblogs.com", "title": "Vaccine BS", "cleaned_text": "A couple of years ago, Andrew Baker of Food Freedom news wrote an article entitled, The Vaccine Hoax is Over. Documents from UK Reveal 30 years of Cover-up.\n\nYet, two or so years later vaccines are still pushed like crazy.\n\nAnyway, in his article, it was pointed out that under the Freedom of Information Act filed by a doctor (imagine that, a hooker with a conscience) revealed 30 years of secret official documents showing that government experts have known that vaccines do not work, that they cause the diseases they are supposed to prevent, that they are a hazard to kids, that these government “experts” colluded to lie to the public, worked to prevent safety studies, and these are the same vaccines that are mandated to the kids in the U.S.\n\nBasically, all parents have a choice – give your kid a shot at life or give him or her a steady dose of heavy metals, viral diseases, fecal material, DNA fragments from other species (GMOs anyone?), formaldehyde, thimerisol, and polysorbate 80, which is a sterilizing agent. But, then again, why do we need grandchildren?\n\nBut don’t forget that vaccines are touted as miracles of modern medicine!\n\nBack to the story – so this doctor filed under the Freedom of Information Act in the US with the CDC (Centers for Deceit, Control and Procrastination). He had an autistic son and wanted information about what the CDC knew about the dangers of vaccines. The CDC had to respond within 20 days. Being very patient, the doctor, after waiting 7 years for a reply, went to court (and you thought the word “Procrastination” was a joke), where the CDC argued that they do not have to comply. The judge told the CDC to f&@koff and ordered them to turn over the documents on September 30, 2011.\n\nOn October 26, 2011, there was an editorial in the Denver Post that expressed shock that the Obama Administration, after promising to be ‘transparent”, among other broken promises, was in the process of changing the Freedom of Information Act to allow government agencies like the CDC to say that some documents were “non-existent”. Shades of Eric Holder way back then!\n\nIt has become apparent that the CDC is nothing more that a hooker for big business. They have covered-up the fluoride scam for years knowing full well that kids are taking in 3 to 4 times more fluoride by body weight as adults and the numbers harmed by dental fluorosis, those needing kidney dialysis, and those that developed diabetes and thyroid problems, numbered in the millions.\n\nWhat we have here is a government agency acting for the betterment of Corporations and against the health of the people. Fluoride was the tip of the iceberg. There are laws on the books in every U.S. state that permits the government to use the military to force unknown, untested vaccines, drugs, chemicals, and so-called “medical” treatments on the entire country if it declares a pandemic emergency.\n\nIn 2009, after the CDC declared the H1N1 “pandemic”, they refused to respond to a Freedom of Information Act filed by CBS News and also tried to block their investigation, so they could succeed in covering up one of the biggest medical scandals ever, yet making believe there actually was an alleged pandemic. Oh yeah, guess who the CDC put in the front of the line to consume the untested vaccine containing the sterilizing agent polysorbate 80? Pregnant women!\n\nBack in 1918-19, it was aspirin that killed people and not a pandemic flu. Yet, 20 – 50 million people died and it was blamed on the flu. That started the BigPharma regime, with Monsanto holding on to its coattails.\n\nIn order to get pandemic laws on the books in every state and worldwide, President Bush was used to foster another myth that pandemic flu could kill millions upon millions. This opened the door for the CDC to create sheer panic over the H1N1 and push BigPharma’s deadly vaccines of the public, killing thousands of unborn kids and more. And still the CDC will not release that data and yet continues to push the same vaccine.\n\nAnd the Obama administration, in its utmost desire to not bite the hand that feeds them, declares that CDC documents are non-existent, thereby proving its claim of transparency totally worthless.\n\nThere are solutions that may take some time to bring to fruition, but they are there.\n\n1. Take the info from the UK FOIA’s exposing the 30 years of vaccine lies and the refusal of the CDC to provide any information on its knowledge of those lies, and the Obama Administration’s efforts to hide the CDC’s awareness of those lies, to your state legislatures and demand the immediate nullification of the CDC vaccine schedule and the pandemic laws.\n\n2. Inform every veteran, every active duty military person, law enforcement people, DHS agents and\n\n medical personnel you know, of the vaccine hoax as their families are threatened as well.\n\nThe problem is that these people may be clueless about being pawns for BigPharma relegating them to being agents of death for their country.\n\nThanks to the Freedom of Information Act, we absolutely know that vaccines are not a miracle of modern medicine. Any medical or government authority that insists that vaccines prevent diseases is either ignorant or a blatant hooker for BigPharma.\n\nLast but certainly not least, how do we get rid of all those toxins in our bodies and the bodies of our kids that have rendered them ill or autistic? The essential missing mineral, organic sulfur. That’s how.\n\nWhen I was a kid, if I were told that I'd be writing a book about diet and nutrition when I was older, let alone having been doing a health related radio show for over 36 years, I would've thought that whoever told me that was out of their mind. Living in Newark, New Jersey, my parents and I consumed anything and everything that had a face or a mother except for dead, rotting, pig bodies, although we did eat bacon (as if all the other decomposing flesh bodies were somehow miraculously clean). Going through high school and college it was no different. In fact, my dietary change did not come until I was in my 30's. \n\n \n\n Just to put things in perspective, after I graduated from Weequahic High School and before going to Seton Hall University, I had a part-time job working for a butcher. I was the delivery guy and occasionally had to go to the slaughterhouse to pick up products for the store. Needless to say, I had no consciousness nor awareness, as change never came then despite the horrors I witnessed on an almost daily basis. \n\n \n\n After graduating with a degree in accounting from Seton Hall, I eventually got married and moved to a town called Livingston. Livingston was basically a yuppie community where everyone was judged by the neighborhood they lived in and their income. To say it was a \"plastic\" community would be an understatement.\n\n \n\n Livingston and the shallowness finally got to me. I told my wife I was fed up and wanted to move. She made it clear she had to be near her friends and New York City. I finally got my act together and split for Colorado.\n\n \n\n I was living with a lady in Aspen at the end of 1974, when one day she said, \" let's become vegetarians\". I have no idea what possessed me to say it, but I said, \"okay\"! At that point I went to the freezer and took out about $100 worth of frozen, dead body parts and gave them to a welfare mother who lived behind us. Well, everything was great for about a week or so, and then the chick split with another guy.\n\n \n\n So here I was, a vegetarian for a couple weeks, not really knowing what to do, how to cook, or basically how to prepare anything. For about a month, I was getting by on carrot sticks, celery sticks, and yogurt. Fortunately, when I went vegan in 1990, it was a simple and natural progression. Anyway, as I walked around Aspen town, I noticed a little vegetarian restaurant called, \"The Little Kitchen\".\n\n \n\n Let me back up just a little bit. It was April of 1975, the snow was melting and the runoff of Ajax Mountain filled the streets full of knee-deep mud. Now, Aspen was great to ski in, but was a bummer to walk in when the snow was melting. \n\n \n\n I was ready to call it quits and I needed a warmer place. I'll elaborate on that in a minute. \n\n \n\n But right now, back to \"The Little Kitchen\". Knowing that I was going to leave Aspen and basically a new vegetarian, I needed help. So, I cruised into the restaurant and told them my plight and asked them if they would teach me how to cook. I told them in return I would wash dishes and empty their trash. They then asked me what I did for a living and I told them I was an accountant. \n\n \n\n The owner said to me, \"Let's make a deal. You do our tax return and we'll feed you as well\". So for the next couple of weeks I was doing their tax return, washing their dishes, emptying the trash, and learning as much as I could.\n\n \n\n But, like I said, the mud was getting to me. So I picked up a travel book written by a guy named Foder. The name of the book was, \"Hawaii\". Looking through the book I noticed that in Lahaina, on Maui, there was a little vegetarian restaurant called,\" Mr. Natural's\". I decided right then and there that I would go to Lahaina and work at \"Mr. Natural's.\" To make a long story short, that's exactly what happened.\n\n \n\n So, I'm working at \"Mr. Natural's\" and learning everything I can about my new dietary lifestyle - it was great. Every afternoon we would close for lunch at about 1 PM and go to the Sheraton Hotel in Ka'anapali and play volleyball, while somebody stayed behind to prepare dinner.\n\n \n\n Since I was the new guy, and didn't really know how to cook, I never thought that I would be asked to stay behind to cook dinner. Well, one afternoon, that's exactly what happened; it was my turn. That posed a problem for me because I was at the point where I finally knew how to boil water.\n\n \n\n I was desperate, clueless and basically up the creek without a paddle. Fortunately, there was a friend of mine sitting in the gazebo at the restaurant and I asked him if he knew how to cook. He said the only thing he knew how to cook was enchiladas. He said that his enchiladas were bean-less and dairy-less. I told him that I had no idea what an enchilada was or what he was talking about, but I needed him to show me because it was my turn to do the evening meal.\n\n \n\n Well, the guys came back from playing volleyball and I'm asked what was for dinner. I told them enchiladas; the owner wasn't thrilled. I told him that mine were bean-less and dairy-less. When he tried the enchilada he said it was incredible. Being the humble guy that I was, I smiled and said, \"You expected anything less\"? It apparently was so good that it was the only item on the menu that we served twice a week. In fact, after about a week, we were selling five dozen every night we had them on the menu and people would walk around Lahaina broadcasting, 'enchilada's at \"Natural's\" tonight'. I never had to cook anything else.\n\n \n\n A year later the restaurant closed, and somehow I gravitated to a little health food store in Wailuku. I never told anyone I was an accountant and basically relegated myself to being the truck driver. The guys who were running the health food store had friends in similar businesses and farms on many of the islands. I told them that if they could organize and form one company they could probably lock in the State. That's when they found out I was an accountant and \"Down to Earth\" was born. \"Down to Earth\" became the largest natural food store chain in the islands, and I was their Chief Financial Officer and co-manager of their biggest store for 13 years.\n\n \n\n In 1981, I started to do a weekly radio show to try and expose people to a vegetarian diet and get them away from killing innocent creatures. I still do that show today. I pay for my own airtime and have no sponsors to not compromise my honesty. One bit of a hassle was the fact that I was forced to get a Masters Degree in Nutrition to shut up all the MD's that would call in asking for my credentials.\n\n \n\n My doing this radio show enabled me, through endless research, to see the corruption that existed within the big food industries, the big pharmaceutical companies, the biotech industries and the government agencies. This information, unconscionable as it is, enabled me to realize how broken our health system is. This will be covered more in depth in the Introduction and throughout the book and when you finish the book you will see this clearly and it will hopefully inspire you to make changes. \n\n \n\n I left Down to Earth in 1989, got nationally certified as a sports injury massage therapist and started traveling the world with a bunch of guys that were making a martial arts movie. After doing that for about four years I finally made it back to Honolulu and got a job as a massage therapist at the Honolulu Club, one of Hawaii's premier fitness clubs. It was there I met the love of my life who I have been with since 1998. She made me an offer I couldn't refuse. She said,\" If you want to be with me you've got to stop working on naked women\". So, I went back into accounting and was the Chief Financial Officer of a large construction company for many years.\n\n \n\n Going back to my Newark days when I was an infant, I had no idea what a \"chicken\" or \"egg\" or \"fish\" or \"pig\" or \"cow\" was. My dietary blueprint was thrust upon me by my parents as theirs was thrust upon them by their parents. It was by the grace of God that I was able to put things in their proper perspective and improve my health and elevate my consciousness.\n\n \n\n The road that I started walking down in 1975 has finally led me to the point of writing my book, “A Sane Diet For An Insane World”. Hopefully, the information contained herein will be enlightening, motivating, and inspiring to encourage you to make different choices. Doing what we do out of conditioning is not always the best course to follow. I am hoping that by the grace of the many friends and personalities I have encountered along my path, you will have a better perspective of what road is the best road for you to travel on, not only for your health but your consciousness as well.\n\n \n\n Last but not least: after being vaccinated as a kid I developed asthma, which plagued me all of my life. In 2007 I got exposed to the organic sulfur crystals, which got rid of my asthma in 3 days and has not come back in over 10 years. That, being the tip of the iceberg, has helped people reverse stage 4 cancers, autism, joint pain, blood pressure problems, migraine headaches, erectile dysfunction, gingivitis, and more. Also, because of the detoxification effects by the release of oxygen that permeates and heals all the cells in the body, it removes parasites, radiation, fluoride, free radicals, and all the other crap that is thrust upon us in the environment by Big Business.\n\n \n\n For more, please view www.healthtalkhawaii.com and www.asanediet.com. \n\n \n\n Namaste!", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine BS", "description": "A couple of years ago, Andrew Baker of Food Freedom news wrote an article entitled, The Vaccine Hoax is Over. Documents from UK Reveal 30 years of Cover-up. Yet, two or so years later vaccines are still pushed like crazy. Anyway, in his article, it was pointed out that under the Freedom of Information Act …", "url": "https://naturalnewsblogs.com/vaccine-bs/", "site_name": "NaturalNewsBlogs", "article:publisher": "https://www.facebook.com/HealthRanger", "article:section": "Health", "article:published_time": "2018-09-11T19:45:21+00:00", "image": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Close-Up-Syringe-Vaccines.jpg", "image:secure_url": "https://naturalnewsblogs.com/wp-content/uploads/2013/06/Close-Up-Syringe-Vaccines.jpg", "image:width": "650", "image:height": "366"}, "tags": [], "tweets": [], "movies": [], "links": ["https://naturalnewsblogs.com/author/hesh-goldstein/", "https://naturalnewsblogs.com/author/hesh-goldstein/"], "authors": [], "publish_date": "2018-09-11T19:45:21+00:00"}