{"result_id": "215018", "URL": "https://www.naturalpedia.com/black-death-causes-side-effects-and-treatments-at-naturalpedia-com.html", "timestamp": "2023-04-25 16:31:12 CEST+0200", "meta": {"description": "Black Death, also called the plague, is an infectious disease caused by the bacteria known as Yersinia pestis. It has a ...", "lang": "en", "keywords": "Black Death", "favicon": "https://www.naturalpedia.com/images/icon.ico", "canonical": "https://www.naturalpedia.com/black-death-causes-side-effects-and-treatments-at-naturalpedia-com.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalpedia.com", "title": "Black Death – causes, side effects and treatments at NaturalPedia.com", "cleaned_text": "Black Death, also called the plague, is an infectious disease caused by the bacteria known as . It has a high fatality rate, and Black Death has been around for centuries.\n\nIn the Middle Ages, the plague was known as the “Black Death.” It caused the death of 60 percent of Europe’s population during a pandemic, or an epidemic of human disease that has spread through a large geographic area.\n\nBlack Death spreads through fleas that have fed on infected animals (e.g. rats, ground squirrels, mice, etc.). There are three forms of Black Death in humans: bubonic plague, septicemic plague, and pneumonic plague.\n\nThere is no commercially available vaccine against Black Death, and it can be found in low levels in animals in the southwestern U.S.\n\nThe signs and symptoms of Black Death associated with its three forms are:\n• Bubonic plague – Bacteria infiltrates the lymph nodes and causes buboes, or “enlarged, painful, tender lymph nodes.” Other symptoms are fever, chills, headaches, and weakness.\n• Septicemic plague – Plague bacteria enters the bloodstream. This can occur on its own, or it may develop from bubonic plague. Symptoms include fever, chills, weakness, abdominal pain, and shock. There can be bleeding and tissue death, especially in the fingers and toes. These dying tissues may turn black, hence the name Black Death.\n• Pneumonic plague – While symptoms of other types of plague may be observed, the “characteristic clinical picture of pneumonia is present.” The plague bacteria spreads to the lungs or infects the lungs directly when infected droplets in the air are inhaled. Pneumonic plague is the only form of plague that can be transmitted from person to person. Symptoms may include shortness of breath, chest pain, fever, and cough with watery or bloody mucus production.\n\nIn bubonic plague, the bacteria can travel through the lymphatic system, which will cause more inflamed lymph nodes, especially in the groin, armpits, and neck. Occasionally, plague can spread to the central nervous system and cause meningitis, or an inflammation of the membranes around the brain and spinal cord.\n\nFood items or nutrients that may prevent Black Death\n\nThe following foods or nutrients can help prevent Black Death:\n• Garlic – Garlic contains the chemical allicin. It also has antiviral, antibacterial, and anti-fungal properties.\n• Oregano oil – Oregano helps get rid of the bacteria that causes the plague.\n• Ginger – Aside from its anti-bacterial properties, ginger increases your immune system and counters many allergic reactions.\n\nIf healthcare professionals suspect that a patient has the plague, they will wear proper protective gear (e.g. goggles, gloves, gowns, and masks) before dealing with them.\n• Patients will be isolated so they can’t infect others.\n• Patients who may need help breathing are given oxygen.\n• They are kept away from others for two to three days after antibiotic treatment starts or once the infection is cleared.\n• Some patients may experience some degree of septic shock (low blood pressure), and specialists will closely monitor this in an intensive care unit.\n• Antibiotics must be given early in the infection to maximize the chance of the antibiotics killing bacteria. These antibiotics might include streptomycin sulfate combined with tetracycline and other antibiotics.\n\nWhere to learn more\n• Cause of deadliest plagues in history discovered\n• Official: Fleas in Arizona testing positive for plague\n• This child caught the plague while camping at Yosemite National Park\n• True history: U.S. dropped bubonic plague on North Korea as a weapon of mass destruction\n\nBlack Death, also called the plague, is an infectious disease caused by the bacteria known as . It has a high fatality rate, and has been around for centuries.\n\nThere is no commercially available vaccine against Black Death, and it can be found in low levels in animals in the southwestern U.S.", "opengraph": {"title": "Black Death – causes, side effects and treatments at NaturalPedia.com", "type": "article", "url": "http://www.naturalpedia.com/black-death-causes-side-effects-and-treatments-at-naturalpedia-com.html", "site_name": "Natural Pedia Com", "description": "Black Death, also called the plague, is an infectious disease caused by the bacteria known as Yersinia pestis. It has a ...", "image": "http://www.naturalpedia.com/wp-content/uploads/sites/292/2018/01/squirrel-on-tree.jpg"}, "tags": ["Black Death"], "tweets": [], "movies": [], "links": ["https://www.medicinenet.com/plague_facts/article.htm", "https://www.everydayhealth.com/bubonic-plague/guide/symptoms-treatment/", "https://www.livealittlelonger.com/proven-natural-cure-for-bubonic-plague/", "https://www.emedicinehealth.com/plague/page4_em.htm#what_is_the_treatment_for_plague", "https://www.naturalnews.com/043818_Black_Death_plague_history.html", "https://www.naturalnews.com/039755_garlic_bubonic_plague_antibiotics.html", "https://www.naturalnews.com/047229_bubonic_plague_fleas_Arizona.html", "https://www.naturalnews.com/052869_plague_Yosemite_National_Park_infection.html", "https://www.naturalnews.com/051303_germ_warfare_Korean_War_government_coverup.html", "https://www.medicinenet.com/plague_facts/article.htm", "https://www.everydayhealth.com/bubonic-plague/guide/symptoms-treatment/", "https://www.livealittlelonger.com/proven-natural-cure-for-bubonic-plague/", "https://www.emedicinehealth.com/plague/page4_em.htm#what_is_the_treatment_for_plague", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fnaturalpedia%2Fblack-death-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Black%20Death%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fnaturalpedia%2Fblack-death-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Black%20Death%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalpedia%2Fblack-death-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Black%20Death%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/share"], "authors": ["Zoey Sky", "Rhonda Johansson", "Ralph Flores", "Frances Bloomfield"], "publish_date": "2019-02-15T17:45:55+00:00"}