{"result_id": "215013", "URL": "https://www.naturalpedia.com/ammonium-sulfate-sources-health-risks.html", "timestamp": "2023-04-25 16:31:09 CEST+0200", "meta": {"description": "Ammonium sulfate with the molecular formula of (NH4)2SO4, is an inorganic salt that is commonly used in fertilizers and in ...", "lang": "en", "keywords": "ammonium sulfate", "favicon": "https://www.naturalpedia.com/images/icon.ico", "canonical": "https://www.naturalpedia.com/ammonium-sulfate-sources-health-risks.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalpedia.com", "title": "Ammonium sulfate sources, health risks", "cleaned_text": "Ammonium sulfate with the molecular formula of (NH an inorganic salt that is commonly used in fertilizers and in the food industry. This chemical compound comes from the heated reaction of ammonia and sulfuric acid. It is a crystal-like solid that has no odor, has a little salty taste, and is predominantly useful because of its high solubility properties. It ranges in color from white to beige. The size of the crystal is controlled by changing reaction conditions, then dried, and screened to the desired final particle size.\n\nAnother option of the production process involves gypsum, in which thoroughly separated gypsum is set in an ammonium carbonate solution that precipitates as a solid. As a result, it produces ammonium sulfate.\n\nThe chemical compound is most commonly used as an artificial fertilizer for alkaline soils. The damp soil releases ammonium ion when it is applied into damp soil. The reaction creates a small amount of acid that reduces the pH balance of the soil. Moreover, it produces nitrogen, which helps in the growth of plants. Ammonium sulfate is also used as an herbicide as it will burn the leaves of plants that will either kill them outright or weaken them for easy removal.\n\nAmmonium sulfate is also used in producing printed circuit boards. It is likewise used in flame retardant products due to its properties that reduces the combustion temperature and increases the production of residues.\n\nThe chemical is also widely used in dough as a dough conditioner, surfactant, or dough strengthener. Ammonium sulfate works by supplying extra nitrogen for the yeast to consume, which in turn enhances the product’s consistency, volume, crumb, and shelf life. It is also used as an additive as it helps in controlling the pH of flours and baked products. In addition, ammonium sulfate can form ammonium metal sulfates or double salts when it reacts with metal sulfates and slowly evaporates to yield the remaining salt particles.\n\nLastly, it is used in the purification process in the development of vaccines, like the Diphtheria, Tetanus, and Pertussis (DTaP) vaccine.\n\nHarmful effects that can be caused by ammonium sulfate\n\nAmmonium sulfate can cause several harmful effects to the body, such as irritations of the skin and eye when in contact. If inhaled, it can cause severe irritation or inflammation in the respiratory tract. It can also cause irritation in the gastrointestinal tract such as nausea, vomiting, and diarrhea, when ingested in large quantities.\n\nThe body organs that can be harmed by ammonium sulfate are minimal and are mostly due to contact with the chemical compound. It can be harmful to the digestive system if swallowed. It can cause skin corrosion or irritation when in contact. The particles of the chemical that can come in contact in the eyes may also cause eye irritation. If inhaled, its particles may harm the respiratory system as it can be toxic and irritate the respiratory tract. Other symptoms and hazardous effects of ammonium sulfate include nausea, headache, and shortness of breath.\n\nWhere to learn more\n• Dangerous, experimental pneumonia vaccine injected into 2-month old babies and adults after major surgery; contains multiple strains of pneumonia plus aluminum\n• 10 Shocking Facts about McDonald’s You Need to Know\n• Ten horrifying ingredients that prove McDonald’s is not fit for consumption\n• Are You Being Poisoned On a Daily Basis?\n• Why McDonald’s Happy Meal hamburgers won’t decompose – the real story behind the story\n\nAmmonium sulfate is an inorganic salt that comes from the heated reaction of ammonia and sulfuric acid. It is a white to beige crystal that has no aroma and tastes slightly salty. It is used in fertilizers, baking, and in the production of printed circuit boards, flame retardant products, and vaccines. The chemical compound can cause irritations in the skin, eye, gastrointestinal tract and respiratory tract.", "opengraph": {"title": "Ammonium sulfate sources, health risks", "type": "article", "url": "http://www.naturalpedia.com/ammonium-sulfate-sources-health-risks.html", "site_name": "Natural Pedia Com", "description": "Ammonium sulfate with the molecular formula of (NH4)2SO4, is an inorganic salt that is commonly used in fertilizers and in ...", "image": "http://www.naturalpedia.com/wp-content/uploads/sites/292/2017/10/Ammonium-sulfate-1.jpg"}, "tags": ["ammonium sulfate"], "tweets": [], "movies": [], "links": ["http://bakerpedia.com/ingredients/ammonium-sulfate/", "http://www.aluminumsulfate.net/Ammonium-Sulfate.html", "http://www.sciencelab.com/msds.php?msdsId=9927078", "https://pubchem.ncbi.nlm.nih.gov/compound/ammonium_sulfate#section=Safety-and-Hazards", "https://beta-static.fishersci.com/content/dam/fishersci/en_US/documents/programs/education/regulatory-documents/sds/chemicals/chemicals-a/S25176A.pdf", "https://www.naturalnews.com/054161_pneumonia_vaccine_damaging_side_effects_Prevnar.html", "https://www.naturalnewsblogs.com/10-shocking-facts-mcdonalds-need-know/", "https://www.naturalnews.com/2017-01-13-10-horrifying-ingredients-that-prove-mcdonalds-is-not-fit-for-consumption.html", "https://www.naturalnewsblogs.com/poisoned-daily-basis/", "https://www.naturalnews.com/030074_Happy_Meal_decompose.html", "http://bakerpedia.com/ingredients/ammonium-sulfate/", "http://www.aluminumsulfate.net/Ammonium-Sulfate.html", "http://www.sciencelab.com/msds.php?msdsId=9927078", "https://pubchem.ncbi.nlm.nih.gov/compound/ammonium_sulfate#section=Safety-and-Hazards", "https://beta-static.fishersci.com/content/dam/fishersci/en_US/documents/programs/education/regulatory-documents/sds/chemicals/chemicals-a/S25176A.pdf", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fnaturalpedia%2Fammonium-sulfate-sources-health-risks.html&linkname=Ammonium%20sulfate%20sources%2C%20health%20risks", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fnaturalpedia%2Fammonium-sulfate-sources-health-risks.html&linkname=Ammonium%20sulfate%20sources%2C%20health%20risks", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalpedia%2Fammonium-sulfate-sources-health-risks.html&linkname=Ammonium%20sulfate%20sources%2C%20health%20risks", "https://www.addtoany.com/share"], "authors": ["Zoey Sky", "Rhonda Johansson", "Ralph Flores", "Frances Bloomfield"], "publish_date": "2019-02-15T17:45:55+00:00"}