{"result_id": "215039", "URL": "https://www.naturalpedia.com/acute-inflammatory-demyelinating-polyneuropathy-causes-side-effects-and-treatments-at-naturalpedia-com.html", "timestamp": "2023-04-25 16:31:28 CEST+0200", "meta": {"description": "Acute inflammatory demyelinating polyneuropathy (AIDP), which is also called Guillain-Barré syndrome (GBS), starts its attack on the body by causing ...", "lang": "en", "keywords": "acute inflammatory demyelinating polyneuropathy", "favicon": "https://www.naturalpedia.com/images/icon.ico", "canonical": "https://www.naturalpedia.com/acute-inflammatory-demyelinating-polyneuropathy-causes-side-effects-and-treatments-at-naturalpedia-com.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalpedia.com", "title": "Acute inflammatory demyelinating polyneuropathy – causes, side effects and treatments at NaturalPedia.com", "cleaned_text": "Acute inflammatory demyelinating polyneuropathy (AIDP), which is also called (GBS), starts its attack on the body by causing a tingling sensation in the legs, toes, and feet. It can affect anyone; the good news is, cases of AIDP are extremely rare, afflicting only around one person in 100,000.\n\nAIDP normally strikes a person who who has had a recent case of respiratory or gastrointestinal infection. Sometimes, a surgery of any kind can trigger the syndrome. In recent years, some countries all over the world have reported a boom in cases of AIDP after the outbreak of the Zika virus.\n\nSymptoms of the disease can over the course of hours, days, or weeks after the first clinical manifestations have been identified. Most people who are afflicted with the disease become thoroughly weak within the first two weeks after the symptoms are observed, and by the third week of the illness 90 percent of all the patients are at their weakest.\n\nNo one knows what causes AIDP; what is evident is that when you have this disease, your immune system begins to attack your own body, which should not have happened in the first place, as the immune system should attack only foreign material and invading organisms.\n• None Muscle weakness in your legs that moves to your upper body and gets worse over time;\n• None Difficulty moving your eyes or face, talking, chewing, or swallowing;\n\nAcute inflammatory demyelinating polyneuropathy is bad for the muscular system. The weakness or the pain that one begins to feel when they suddenly get hit by AIDP can multiply thricefold, until such time when certain muscles can no longer be used, and the person becomes paralyzed.\n\nAcute inflammatory demyelinating polyneuropathy is bad for the respiratory system. There can come a time when the paralysis brought about by this disease gets to be so bad that it interferes with one’s breathing.\n\nAcute inflammatory demyelinating polyneuropathy is bad for the cardiovascular system. Heart rate and blood pressure is affected when you have the disease.\n\nAcute inflammatory demyelinating polyneuropathy is bad for the nervous system. Having this disease will make your own immune system attack the myelin sheath that envelops the axons of many peripheral nerves, or even the axons themselves, which are long, thin extensions of the nerve cells that carry nerve signals throughout the body.\n\nThe brain can also get less sensory signals from the rest of the body, thereby making it unable to feel textures, heat, pain, and other sensations. The brain can also get inappropriate signals, inducing a “crawling-skin” or painful sensation. Having the longest signal distances, the legs and the arms are the most vulnerable to interruption. This is why muscle weakness and tingling sensations usually manifest first in the hands and feet and progress upwards.\n\nWhen AIDP is preceded by a bacterial or viral infection, scientists explain that it is possible that the virus that the virus altered the nature of cells in the nervous system so that the immune system is tricked into believing that they are foreign cells.\n\nFood items or nutrients that may prevent acute inflammatory demyelinating polyneuropathy\n\n, kava, and yohimbe bark extract can be used to\n• None Intravenous immunoglobulin – a treatment cultivated from donated blood that can help manage your immune system;\n• None Plasma exhange (plasmapheresis) – a machine is used to filter your blood to take away the harmful substances that are wreaking havoc on your nerves; and\n• None Treatments to lessen symptoms and support body functions, such as pain relievers, a machine that helps you breathe, and/or a feeding tube.\n\nWhere to learn more\n• None Zika virus the new health care Boogeyman, now being blamed for vaccine injuries and Guillain-Barré Syndrome\n• None Vaccine-induced GBS more common than we’re all being told\n• None Did Stephen Hawking just admit that certain vaccines are a threat to mankind?\n\nAcute inflammatory demyelinating polyneuropathy normally strikes a person who who has had a recent case of respiratory or gastrointestinal infection.\n\nAcute inflammatory demyelinating polyneuropathy is bad for the muscular, respiratory, cardiovascular, and nervous systems.\n\nHerbs such as ashwagandha, belladonna, cowhage, dong quai, ginseng, kava, and yohimbe bark extract can be used to reduce the symptoms of AIDP.", "opengraph": {"title": "Acute inflammatory demyelinating polyneuropathy – causes, side effects and treatments at NaturalPedia.com", "type": "article", "url": "http://www.naturalpedia.com/acute-inflammatory-demyelinating-polyneuropathy-causes-side-effects-and-treatments-at-naturalpedia-com.html", "site_name": "Natural Pedia Com", "description": "Acute inflammatory demyelinating polyneuropathy (AIDP), which is also called Guillain-Barré syndrome (GBS), starts its attack on the body by causing ...", "image": "http://www.naturalpedia.com/wp-content/uploads/sites/292/2017/12/Woman-Fitness-Exercise-Back-Pain-Soreness-Stiff-Muscles.jpg"}, "tags": ["acute inflammatory demyelinating polyneuropathy"], "tweets": [], "movies": [], "links": ["https://www.ninds.nih.gov/Disorders/Patient-Caregiver-Education/Fact-Sheets/Guillain-Barr%C3%A9-Syndrome-Fact-Sheet", "https://www.healthline.com/health/guillain-barre-syndrome#symptoms", "https://naturalpedia.com/ginseng-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "http://www.lindbergnutrition.com/ns/DisplayMonograph.asp?StoreID=1c7a08050b8f4419bffba945004ca5d1&DocID=condition-guillainbarre", "https://www.nhs.uk/conditions/guillain-barre-syndrome/", "https://www.naturalnews.com/042770_Guillain-Barre_syndrome_H1N1_vaccines_toxic_effects.html", "https://www.naturalnews.com/053175_Zika_virus_Guillain-Barre_Syndrome_flu_vaccine.html", "https://www.naturalnews.com/027473_Guillain-Barre_Syndrome_swine_flu_vaccine.html", "https://www.naturalnews.com/055398_vaccines_Guillain-Barre_syndrome_adverse_events.html", "https://www.naturalnews.com/055539_genetically_modified_viruses_vaccines_Stephen_Hawking.html", "https://www.ninds.nih.gov/Disorders/Patient-Caregiver-Education/Fact-Sheets/Guillain-Barr%C3%A9-Syndrome-Fact-Sheet", "https://www.healthline.com/health/guillain-barre-syndrome#symptoms", "https://www.nhs.uk/conditions/guillain-barre-syndrome/", "http://www.lindbergnutrition.com/ns/DisplayMonograph.asp?StoreID=1c7a08050b8f4419bffba945004ca5d1&DocID=condition-guillainbarre", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fnaturalpedia%2Facute-inflammatory-demyelinating-polyneuropathy-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Acute%20inflammatory%20demyelinating%20polyneuropathy%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fnaturalpedia%2Facute-inflammatory-demyelinating-polyneuropathy-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Acute%20inflammatory%20demyelinating%20polyneuropathy%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalpedia%2Facute-inflammatory-demyelinating-polyneuropathy-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Acute%20inflammatory%20demyelinating%20polyneuropathy%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/share"], "authors": ["Zoey Sky", "Rhonda Johansson", "Ralph Flores", "Frances Bloomfield"], "publish_date": "2019-02-15T17:45:55+00:00"}