{"result_id": "215009", "URL": "https://www.naturalpedia.com/swine-flu-causes-side-effects-and-treatments-at-naturalpedia-com.html", "timestamp": "2023-04-25 16:31:06 CEST+0200", "meta": {"description": "Swine flu is a disease of pigs that can be transmitted to humans in rare cases. It is a highly ...", "lang": "en", "keywords": "swine flu", "favicon": "https://www.naturalpedia.com/images/icon.ico", "canonical": "https://www.naturalpedia.com/swine-flu-causes-side-effects-and-treatments-at-naturalpedia-com.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalpedia.com", "title": "Swine Flu – causes, side effects and treatments at NaturalPedia.com", "cleaned_text": "Swine flu is a disease of pigs that can be transmitted to humans in rare cases. It is a highly contagious respiratory disease caused by one of the many influenza A viruses. The disease is spread among pigs by direct and indirect contact, aerosols, and from pigs that are infected but do not have symptoms. Most commonly, swine flu is the H1N1 influenza subtype. Nevertheless, swine flu viruses can sometimes come from other subtypes, such as H1N2, H3N1, and H3N2.\n\nIn 2009, there was an outbreak of swine flu that infected humans. The swine flu virus was an H1N1 subtype. Although it developed in swine, the 2009 pandemic virus was not entirely derived from swine. The virus contains a combination of flu genes from bird, swine, and human flu types. The pandemic was declared over in August 2010 by the World Health Organization (WHO).\n\nSwine flu was common in children five years and older and young adults when it first emerged. The greatest risk of getting the virus is spending time in an area with a large number of people who are infected with swine flu. Some people are at higher risk of becoming seriously ill if they get infected with swine flu. These groups include adults over age 65, children below five years old, young adults and children below 19 years old who are receiving long-term aspirin therapy, people with a weakened immune system, pregnant women, and people with chronic illnesses.\n\nThe signs of swine flu include chills, fever, coughing, sore throat, runny or stuffy nose, body aches, fatigue, diarrhea, and nausea and vomiting. In some cases, swine flu can cause complications, such as worsening of chronic conditions, pneumonia, neurological signs and symptoms, and respiratory failure.\n\nThe body systems harmed by swine flu include the respiratory and immune systems.\n\nList of foods or nutrients that prevent swine flu\n\nFoods that prevent swine flu include basil, giloi, camphor, garlic, milk with turmeric, and aloe vera.\n\nHerbal remedies for swine flu symptoms include the following:\n• To relieve lung congestion, inhale steam made from basil leaves added to water.\n• For nasal congestion relief, sore throat, and other cold-related symptoms of swine flu, mix a tablespoon of honey to half tablespoon of cinnamon powder.\n• For relieving cough and cold, sore throat, and headaches, drink lemon tea.\n• Black elderberry has been found to be very promising in treating swine flu disease.\n• Herbs such as Echinacea and herbal combinations like Triphala get rid of the swine flu symptoms completely.\n\nWhere to learn more\n• Where are all the dead bodies from swine flu? CDC’s new estimates of half a million dead prove too comedic to ignore\n• Formerly healthy, energetic boy still suffers from extreme narcolepsy two years after getting swine flu vaccine\n• Finnish government to cover lifetime of medical costs for children permanently injured by swine flu vaccine\n\nSwine flu is a disease of pigs that can be transmitted to humans in rare cases.\n\nSwine flu is a highly contagious respiratory disease caused by one of the many influenza A viruses.\n\nSwine flu causes chills, fever, coughing, sore throat, runny or stuffy nose, body aches, fatigue, diarrhea, and nausea and vomiting.\n\nFoods that prevent swine flu include basil, giloi, camphor, garlic, milk with turmeric, and aloe vera. Swine flu treatments include basil, honey and cinnamon powder, garlic, lemon tea, black elderberry, echinacea, and Triphala.", "opengraph": {"title": "Swine Flu – causes, side effects and treatments at NaturalPedia.com", "type": "article", "url": "http://www.naturalpedia.com/swine-flu-causes-side-effects-and-treatments-at-naturalpedia-com.html", "site_name": "Natural Pedia Com", "description": "Swine flu is a disease of pigs that can be transmitted to humans in rare cases. It is a highly ...", "image": "http://www.naturalpedia.com/wp-content/uploads/sites/292/2018/06/Swine-Flu-Headline-News.jpg"}, "tags": ["swine flu"], "tweets": [], "movies": [], "links": ["https://www.medicalnewstoday.com/articles/147720.php", "https://www.healthline.com/health/swine-flu", "https://www.healthline.com/health/swine-flu#risk-factors", "https://www.healthline.com/health/swine-flu#symptoms", "https://www.onlymyhealth.com/what-complications-associated-swine-flu-12977602061", "https://timesofindia.indiatimes.com/10-home-remedies-to-avoid-swine-flu/articleshow/4888598.cms", "https://www.onlymyhealth.com/herbal-remedies-swine-flu-1303106676", "https://www.naturalnews.com/036317_CDC_Swine_Flu_death_estimates.html", "https://www.naturalnews.com/035501_vaccines_narcolepsy_children.html", "https://www.naturalnews.com/034441_swine_flu_vaccine_narcolepsy_side_effects.html", "https://www.naturalnews.com/033962_vaccines_permanent_damage.html", "https://www.naturalnews.com/036316_swine_flu_death_estimates_CDC.html", "https://www.medicalnewstoday.com/articles/147720.php", "https://www.healthline.com/health/swine-flu", "https://www.healthline.com/health/swine-flu#risk-factors", "https://www.healthline.com/health/swine-flu#symptoms", "https://timesofindia.indiatimes.com/10-home-remedies-to-avoid-swine-flu/articleshow/4888598.cms", "https://www.onlymyhealth.com/herbal-remedies-swine-flu-1303106676", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fnaturalpedia%2Fswine-flu-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Swine%20Flu%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fnaturalpedia%2Fswine-flu-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Swine%20Flu%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalpedia%2Fswine-flu-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Swine%20Flu%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/share"], "authors": ["Zoey Sky", "Rhonda Johansson", "Ralph Flores", "Frances Bloomfield"], "publish_date": "2019-02-15T17:45:55+00:00"}