{"result_id": "215026", "URL": "https://www.naturalpedia.com/regional-enteritis-causes-side-effects-and-treatments-at-naturalpedia-com.html", "timestamp": "2023-04-25 16:31:19 CEST+0200", "meta": {"description": "Regional enteritis refers to a chronic inflammatory disease of the intestine. While the disease usually involves the small and large intestines, ...", "lang": "en", "keywords": "Regional enteritis", "favicon": "https://www.naturalpedia.com/images/icon.ico", "canonical": "https://www.naturalpedia.com/regional-enteritis-causes-side-effects-and-treatments-at-naturalpedia-com.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalpedia.com", "title": "Regional enteritis – causes, side effects and treatments at NaturalPedia.com", "cleaned_text": "Regional enteritis refers to a chronic inflammatory disease of the intestine. While the disease usually involves the small and large intestines, it can occur anywhere in the digestive system (e.g., anywhere from the mouth to the anus).\n\nIn the early stages, regional enteritis causes small and scattered erosions or shallow crater-like areas called aphthous ulcers in the inner surface of the bowel. As the disease progresses, the ulcers will deepen and grow larger. This causes scarring and stiffness of the bowel while the bowel also becomes narrower. The bowels will eventually become too narrow and have obstructions.\n\nDeep ulcers may cause puncture holes in the bowel wall that can result in an infection in the peritoneum/abdominal cavity (peritonitis) and in adjacent organs.\n• Terminal ileitis – Involves the end of the small intestine or the terminal ileum.\n• Crohn’s enterocolitis/ileocolitis – Involves both the small intestine and the large intestine.\n\nRegional enteritis is also called Crohn’s disease or granulomatous enteritis. The disease was named after Burrill Crohn, who identified the disease in 1932.\n\nWithout treatment, the signs of regional enteritis may be constant. The side effects may also recur after several weeks or months. The recurrence of the disease’s side effects is known as a flare-up or relapse while the periods between the flare-ups are called remission.\n\nChildren with regional enteritis may develop more slowly than usual.\n\nThe common side effects of regional enteritis usually include:\n• Stomachaches and cramps (usually in the lower-right part of the stomach)\n\nOther side effects of the disease include:\n• Patches of painful, red, and swollen skin (usually on the legs)\n• Age – The disease usually develops in people aged 15 to 30.\n• Genetics – Risk of developing the disease increases if you have a family member diagnosed with regional enteritis.\n• Smoking – Smokers are at risk of developing regional enteritis.\n• Surgery – The disease is more common in patients who’ve had their appendix removed.\n\nRegional enteritis may cause the following complications:\n• Cancer – Patients with the disease are at risk of developing cancer of the colon.\n• Fistulas – A fistula occurs when inflammation forms a channel between two parts of the body, such as between a part of the small intestine and a part of the colon. When a patient has a fistula, the contents of their gut may then leak into the other organs.\n• Osteoporosis – Called the “thinning” of the bones, the increased risk for osteoporosis is due to the poor absorption of food that occurs in some people with severe forms of the disease.\n• Perforations – These are small holes that form in the wall of the gut. The contents of the gut may then leak out and cause an infection or an abscess inside the abdomen. A perforation can be severe and life-threatening.\n• Strictures – The narrowing of part of the gastrointestinal tract/gut, a stricture occurs when scar tissue forms in the wall of an inflamed part of the gut. A stricture may prevent food from passing through (called an obstruction). This may cause pain and vomiting.\n\nFood items or nutrients that may prevent regional enteritis\n\nThe following foods or nutrients can help prevent regional enteritis or address its side effects:\n• Almond milk – Almond milk contains calcium, and vitamin D and E, but without cholesterol or saturated fat. Check the label and buy almond milk without added sweeteners\n• Eggs – Eggs are a good source of protein that’s easy to digest.\n• Oatmeal – Oatmeal has soluble fiber that can absorb water and passes more slowly through the digestive tract.\n• Papaya – Papaya, along with fruits like banana, cantaloupe, and mango, is full of nutrients and easy to digest.\n• Salmon – Salmon, like most seafood, is a good source of lean protein. It also contains omega-3 fatty acids. Other sources include shrimp and white fish like flounder and tilapia.\n• Vegetable soups – Serve pureed vegetables full of nutrients like butternut squash, carrots, parsnips, and pumpkins.\n\nTreatment for regional enteritis includes medications for inflammation or surgery.\n\nMild cases of the disease often resolve themselves after several days and patients don’t need medical treatment. However, individuals with diarrhea must replenish their fluids.\n\nChildren and young adults can also follow a liquid diet/enteral nutrition to help manage the symptoms of the disease. A liquid diet includes special drinks that have all the nutrients you need, instead of a solid diet, for several weeks.\n\nWhere to learn more\n• Being a “vaccine heretic” against the church of big pharma; Co-opting scientific research\n• Junk food, antibiotics cause Crohn’s disease rates to triple among young persons\n\nRegional enteritis refers to a chronic inflammatory disease of the intestine.\n\nThe common signs of regional enteritis usually include bloody stools, diarrhea, and fatigue.\n\nRegional enteritis may cause complications like cancer, fistulas, osteoporosis, perforations, and strictures.\n\nTreatment for regional enteritis includes medications for inflammation or surgery.\n\nMild cases of the disease often resolve themselves after several days and patients don’t need medical treatment.", "opengraph": {"title": "Regional enteritis – causes, side effects and treatments at NaturalPedia.com", "type": "article", "url": "http://www.naturalpedia.com/regional-enteritis-causes-side-effects-and-treatments-at-naturalpedia-com.html", "site_name": "Natural Pedia Com", "description": "Regional enteritis refers to a chronic inflammatory disease of the intestine. While the disease usually involves the small and large intestines, ...", "image": "http://www.naturalpedia.com/wp-content/uploads/sites/292/2018/06/Large-intestine.jpg"}, "tags": ["Regional enteritis"], "tweets": [], "movies": [], "links": ["https://www.medicinenet.com/script/main/art.asp?articlekey=5280", "https://www.nhs.uk/conditions/crohns-disease/symptoms/", "https://patient.info/health/inflammatory-bowel-disease/crohns-disease#nav-5", "http://www.health.com/health/gallery/0,,20559874,00.html#rice-2", "https://www.healthline.com/health/enteritis#treatment", "https://www.naturalnews.com/032341_Crohns_disease_prevention.html", "https://www.naturalnews.com/2017-12-01-being-a-vaccine-heretic-against-the-church-of-big-pharma-co-opting-scientific-research.html", "https://www.naturalnews.com/026935_disease_hypnotherapy_Crohns.html", "https://www.naturalnews.com/045881_Crohns_disease_junk_food_antibiotics.html", "https://www.naturalnews.com/025279_disease_Crohns_symptoms.html", "https://www.medicinenet.com/script/main/art.asp?articlekey=5280", "https://www.nhs.uk/conditions/crohns-disease/symptoms/", "https://patient.info/health/inflammatory-bowel-disease/crohns-disease#nav-5", "http://www.health.com/health/gallery/0,,20559874,00.html#rice-2", "https://www.healthline.com/health/enteritis#treatment", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fnaturalpedia%2Fregional-enteritis-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Regional%20enteritis%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fnaturalpedia%2Fregional-enteritis-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Regional%20enteritis%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalpedia%2Fregional-enteritis-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Regional%20enteritis%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/share"], "authors": ["Zoey Sky", "Rhonda Johansson", "Ralph Flores", "Frances Bloomfield"], "publish_date": "2019-02-15T17:45:55+00:00"}