{"result_id": "215005", "URL": "https://www.naturalpedia.com/dengue-causes-side-effects-and-treatments-at-naturalpedia-com.html", "timestamp": "2023-04-25 16:31:03 CEST+0200", "meta": {"description": "Dengue, otherwise known as breakbone fever, is a mosquito-borne viral infection that can potentially lead to dangerous complications. The dengue ...", "lang": "en", "keywords": "dengue", "favicon": "https://www.naturalpedia.com/images/icon.ico", "canonical": "https://www.naturalpedia.com/dengue-causes-side-effects-and-treatments-at-naturalpedia-com.html", "encoding": "UTF-8"}, "image": null, "domain": "www.naturalpedia.com", "title": "Dengue – causes, side effects and treatments at NaturalPedia.com", "cleaned_text": "Dengue, otherwise known as breakbone fever, is a mosquito-borne viral infection that can potentially lead to dangerous complications. The dengue virus is mostly found in tropical and subtropical climates but international travel has increased the range at which the vector is spread. It is estimated that half of the world’s population is now at risk of contracting dengue.\n\nSevere dengue can be fatal in children, especially those that already have a weakened immune system. The (WHO) have stated that the dengue virus is the leading cause of serious illness and death in children in Southeast Asian and Latin American countries.\n\nDiagnosed early, however, dengue can be treated fairly easily – with some patients needing to be confined at the hospital for a few days.\n\nPatients with dengue will have high fever accompanied by at least two of the following symptoms:\n\nPatients who experience any of the following symptoms should immediately go to their nearest hospital.\n• None Red spots or patches on the skin\n\nDengue fever can last for two to seven days, with its associated symptoms generally lasting longer even after treatment. It is important that patients are given plenty of fluids and are made to bed-rest for at least one week.\n\nTake note that dengue can trigger dengue shock syndrome, especially if the patient is not given enough water to compensate all the fluid lost through vomiting, diarrhea, and sweating. The syndrome can cause excessive bleeding and even death.\n\nDengue affects the entire body. The virus can cause internal bleeding prompted by the severe loss of fluids in the body. Remember that the human body is composed mostly of water. As with a sponge, once it loses vital fluids, the entire system will begin to shut down. This manifests itself in severe abdominal and muscle pain, accompanied by excruciating headaches.\n\nFood items or nutrients that may prevent dengue\n\nDengue is spread through several species of the genus, – a common mosquito found in tropical climates. Preventing dengue, therefore, is focused on practicing good hygiene and avoiding areas that are populated by the mosquito.\n\nThat said, once you notice dengue symptoms, there are some herbal remedies you can try to alleviate some of the pain.\n• None Papaya leaf juice – This is considered to be one of the best home remedies for dengue. The organic compounds in papaya enhance the blood cells in the body, while injecting great amounts of vitamin C in the system. This helps stimulate the immune system, allowing it to remove toxins.\n• None Neem juice – Neem leaves increase the blood platelet count as well as the white blood cells. The leaf also enhances the immune system.\n• None Coriander leaf juice – Coriander contains cineole and linoleic acid, two compounds that have anti-arthritic and anti-rheumatic properties. The leaves are also rich sources of vitamin C.\n\nThere is no specific medicine for dengue. Patients are typically told to drink plenty of water and get lots of rest. If their blood count is low, a blood transfusion may be done. To relieve pain, patients are suggested to take analgesics rather than ibuprofen, as the latter can complicate symptoms.\n\nWhere to learn more\n• None Dengue fever strikes Japan for first time since 1945\n• None Dengue fever outbreak spreads in Japan – just in time for GM mosquitoes and experimental vaccines\n• None Dengue vaccine does NOT protect against the disease but actually puts you at HIGHER RISK of contracting it\n• None Researchers openly admit dengue vaccine would cause 7-fold spike in infections\n\nDengue is an infection spread by mosquitoes.\n\nThose infected experience flu-like symptoms that can trigger shock.\n\nPatients are told to drink plenty of fluids and get lots of bed rest.", "opengraph": {"title": "Dengue – causes, side effects and treatments at NaturalPedia.com", "type": "article", "url": "http://www.naturalpedia.com/dengue-causes-side-effects-and-treatments-at-naturalpedia-com.html", "site_name": "Natural Pedia Com", "description": "Dengue, otherwise known as breakbone fever, is a mosquito-borne viral infection that can potentially lead to dangerous complications. The dengue ...", "image": "http://www.naturalpedia.com/wp-content/uploads/sites/292/2018/03/mosquito1.png"}, "tags": ["dengue"], "tweets": [], "movies": [], "links": ["https://www.britannica.com/science/dengue", "https://medlineplus.gov/dengue.html", "http://www.who.int/mediacentre/factsheets/fs117/en/", "https://www.cdc.gov/dengue/symptoms/index.html", "https://www.cdc.gov/dengue/symptoms/index.html", "https://www.cdc.gov/dengue/symptoms/index.html", "http://www.onlymyhealth.com/health-slideshow/5-complications-of-dengue-fever-1444393079.html", "https://www.livealittlelonger.com/home-remedies-for-dengue-fever-treatment/", "https://www.naturalnews.com/046763_dengue_fever_Japan_disease_outbreak.html", "https://www.naturalnews.com/046877_dengue_fever_GM_mosquitoes_experimental_vaccines.html", "https://www.naturalnews.com/2017-12-18-dengue-vaccine-does-not-protect-against-the-disease-but-actually-puts-you-at-higher-risk-for-contracting-it.html", "https://www.naturalnews.com/046867_dengue_fever_vaccine_GM_mosquitoes.html", "https://www.britannica.com/science/dengue", "https://medlineplus.gov/dengue.html", "http://www.who.int/mediacentre/factsheets/fs117/en/", "https://www.cdc.gov/dengue/symptoms/index.html", "http://www.onlymyhealth.com/health-slideshow/5-complications-of-dengue-fever-1444393079.html", "https://www.livealittlelonger.com/home-remedies-for-dengue-fever-treatment/", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fnaturalpedia%2Fdengue-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Dengue%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fnaturalpedia%2Fdengue-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Dengue%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalpedia%2Fdengue-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Dengue%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/share"], "authors": ["Zoey Sky", "Rhonda Johansson", "Ralph Flores", "Frances Bloomfield"], "publish_date": "2019-02-15T17:45:55+00:00"}