{"result_id": "215001", "URL": "https://naturalpedia.com/herpes-zoster-causes-side-effects-and-treatments-at-naturalpedia-com.html", "timestamp": "2023-04-25 16:30:58 CEST+0200", "meta": {"description": "Herpes zoster, also called shingles, is a viral disease caused by the varicella-zoster virus. This is the same virus that ...", "lang": "en", "keywords": "herpes zoster", "favicon": "https://www.naturalpedia.com/images/icon.ico", "canonical": "https://naturalpedia.com/herpes-zoster-causes-side-effects-and-treatments-at-naturalpedia-com.html", "encoding": "UTF-8"}, "image": null, "domain": "naturalpedia.com", "title": "Herpes Zoster – causes, side effects and treatments at", "cleaned_text": "Herpes zoster, also called shingles, is a viral disease caused by the varicella-zoster virus. This is the same virus that also causes chickenpox.\n\nThe varicella-zoster virus may remain in the nervous system even years after the chickenpox infection is over before it reactivates as herpes zoster. The infection usually clears up after two to three weeks. An individual will rarely get infected with herpes zoster more than once.\n\nHowever, according to the (CDC), about one in three people in the U.S will have herpes zoster in their lifetime.\n\nThe initial side effects of herpes zoster often include pain and a burning sensation. The pain is commonly felt on one side of the body in small patches followed by a red rash.\n• A rash on the face and ears\n• A rash that spreads from the spine to the torso\n\nSome patients experience side effects aside from pain and rash. These may include:\n• Having diseases that weaken the immune system (e.g. AIDS, cancer, or HIV)\n• Taking drugs that weaken the immune system (e.g. steroids or medications prescribed following an organ transplant)\n\nHerpes zoster may cause the following complications:\n• Eye complications – When a rash or blister forms near the eye, it can result in vision loss.\n• Postherpetic neuralgia (PHN) – The most common complication of herpes zoster, PHN causes severe pain in the areas where patients have had the rash, even after it clears up. While the pain caused by PHN can be serious and debilitating, it often resolves after several weeks or months. In some cases, patients may experience pain due to PHN for many years, which can negatively affect daily life.\n\nFood items or nutrients that may prevent herpes zoster\n\nThe following foods or nutrients can help prevent herpes zoster:\n• Fruits and vegetables — Fruits and vegetables are full of essential micronutrients that your body requires to build and maintain immunity.\n• Garlic — Garlic is rich in antioxidants. It’s also a natural antibiotic. Additionally, garlic can help blisters heal faster.\n• Lysine — Lysine, an amino acid, can inhibit the multiplication of the herpes zoster virus. Foods rich in lysine include beans, dairy products, fish, and red meat.\n• Seaweed — Seaweed can help prevent the herpes zoster virus from spreading to the nerves, which can prevent shingles.\n• Vitamin B-6 — This nutrient is good for the nerves. Sources include bananas, nuts, and potatoes.\n• Water — Staying hydrated can help your body flush out the impurities from your system.\n\nWhile there’s no cure for herpes zoster, prescribed medication can ease symptoms and hasten the patient’s recovery.\n• Capsaicin (Zostrix) — Help reduce the risk of PHN.\n\nWhere to learn more\n• Shingles vaccine made with pig gelatin, MSG and residual components of human DNA from an aborted fetus. Why?\n• Thousands damaged by shingles vaccine are trying to sue Merck\n• Wipe out shingles FAST with easy-to-use homeopathic remedies – relieve pain, eliminate burning, itching and infection\n\nHerpes zoster, also called shingles, is a viral disease caused by the varicella-zoster virus. This is the same virus that also causes chickenpox. The varicella-zoster virus may remain in the nervous system even years after the chickenpox infection is over before it reactivates as herpes zoster.\n\nThe initial side effects of herpes zoster often include pain and burning. The pain is commonly felt on one side of the body in small patches followed by a red rash.\n\nHerpes zoster rash characteristics may include fluid-filled blisters that burst easily, itching, a rash on the face and ears, a rash that spreads from the spine to the torso, and red patches.\n\nHerpes zoster may cause complications like blindness, brain inflammation/encephalitis, death, eye complications, hearing problems, or pneumonia.\n\nFruits and vegetables, garlic, lysine, seaweed, vitamin B6, water, and whole grain foods can help prevent herpes zoster.\n\nWhile there’s no cure for herpes zoster, medication may be prescribed to ease symptoms and hasten the patient’s recovery.", "opengraph": {"title": "Herpes Zoster – causes, side effects and treatments at NaturalPedia.com", "type": "article", "url": "http://www.naturalpedia.com/herpes-zoster-causes-side-effects-and-treatments-at-naturalpedia-com.html", "site_name": "Natural Pedia Com", "description": "Herpes zoster, also called shingles, is a viral disease caused by the varicella-zoster virus. This is the same virus that ...", "image": "http://www.naturalpedia.com/wp-content/uploads/sites/292/2018/03/Scratch-Itch-Skin.jpg"}, "tags": ["herpes zoster"], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/shingles/about/complications.html", "http://www.diethealthclub.com/health-issues-and-diet/shingles-diet.html", "https://www.naturalnews.com/050505_shingles_vaccine_toxic_ingredients_immunization_dangers.html", "https://www.naturalnews.com/2017-12-21-shingles-vaccines-scientifically-proven-to-cause-chicken-pox-outbreaks.html", "https://www.naturalnews.com/2017-04-27-thousands-of-people-damaged-by-zostavax-shingles-vaccine-now-attempting-to-sue-merck.html", "https://www.naturalnews.com/036940_chickenpox_shingles_vaccines.html", "https://www.naturalnews.com/039071_shingles_homeopathic_remedies_pain_relief.html", "https://www.cdc.gov/shingles/about/complications.html", "http://www.diethealthclub.com/health-issues-and-diet/shingles-diet.html", "https://www.healthline.com/health/shingles", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fnaturalpedia%2Fherpes-zoster-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Herpes%20Zoster%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fnaturalpedia%2Fherpes-zoster-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Herpes%20Zoster%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalpedia%2Fherpes-zoster-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Herpes%20Zoster%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/share"], "authors": ["Zoey Sky", "Rhonda Johansson", "Ralph Flores", "Frances Bloomfield"], "publish_date": "2019-02-15T17:45:55+00:00"}