{"result_id": "215024", "URL": "https://naturalpedia.com/flu-causes-side-effects-and-treatments-at-naturalpedia-com.html", "timestamp": "2023-04-25 16:31:17 CEST+0200", "meta": {"description": "The flu, or influenza, is a contagious respiratory disease caused by any of the flu viruses. These viruses travel through ...", "lang": "en", "keywords": "Flu", "favicon": "https://www.naturalpedia.com/images/icon.ico", "canonical": "https://naturalpedia.com/flu-causes-side-effects-and-treatments-at-naturalpedia-com.html", "encoding": "UTF-8"}, "image": null, "domain": "naturalpedia.com", "title": "Flu – causes, side effects and treatments at", "cleaned_text": "The flu, or influenza, is a contagious respiratory disease caused by any of the flu viruses. These viruses travel through the air and enter a person’s body through their mouth or nose.\n\nThere are three known types of flu viruses:\n• Type A flu virus: These viruses affect humans and animals, with wild birds being the most common hosts. Type A flu viruses can be further divided into sub-types, according to the differences in their surface proteins. Of the flu viruses, these are most dangerous and the ones frequently responsible for large flu outbreaks.\n• Type B flu virus: Less common than type A flu viruses, type B flu viruses are found almost exclusively in humans. These viruses typically don’t cause epidemics nor are their symptoms as severe as type A flu viruses. However, they can still cause a great deal of harm.\n• Type C flu virus: Compared to type A and B flu viruses, type C flu viruses are much milder. People generally don’t become sick when infected with a type C flu virus.\n\nKnown symptoms and risk factors of the flu\n\nCertain groups of people are more susceptible to contracting a flu virus. As per , these are:\n• Infants and children below the age of five\n• People with diseases affecting their brain, lung, heart, kidney, liver, or blood\n• People who have metabolic syndrome, diabetes, or asthma\n\nAdditionally, living or working in a congested area with close contact can place one at high risk of the flu. Hospitals, schools, college dormitories, and office buildings are examples of such areas.\n\nA person who has caught the flu will feel any or all of the following symptoms:\n\nAs a progressive illness, there are some cases where the symptoms become more severe. Those who experience any of these symptoms should seek medical care immediately:\n\nThe flu primarily harms the respiratory system, namely the nose, throat, and lungs. Though often confused for the common cold due to the similarity of their symptoms, the flu is more dangerous as it can develop into a serious complication impacting other organs and organ systems. Some of these complications are:\n\nFood items or nutrients that may prevent the flu\n\nPeople whose immune systems are weak are at high risk of acquiring the flu. As such, one way to prevent it is by eating foods and loading up on nutrients that boost the immune system. These foods and nutrients are:\n• Echinacea: An herb most associated with cold symptoms, echinacea is ideal for the flu too. It can strengthen the immune system to make fighting off infection much easier.\n• Garlic: The robust antimicrobial properties of garlic are all thanks to a compound known as allicin. Because of allicin, garlic can both prevent the flu and reduce the severity of its symptoms.\n• Ginger: Not only can ginger stimulate the immune system, it’s also a muscle relaxant, making it powerful enough to lessen coughing spasms. Moreover, ginger contains chemicals that target flu- and cold-inducing viruses.\n• Selenium: This mineral, commonly found in Brazil nuts, plays an important role in immune system.\n• Honey: In general, honey is great for people with the flu because it soothes the throat and helps fight infection. Depending on the flowers used, honey can have incredibly high antioxidant levels as well.\n• Vitamin C: This potent antioxidant enhances the defenses of the immune system. Vitamin C is abundant in citrus fruits, but vegetables such as red bell peppers, broccoli, and sweet potatoes have high amounts of this vitamin as well.\n• Vitamin D: Just like vitamin C, vitamin D is good for the immune system. A few minutes under direct sunlight is the best way to obtain vitamin D. People who live in cooler climates are encouraged to turn to fatty fish or mushrooms for their vitamin D doses.\n• Yogurt: The probiotics found in yogurt can help strengthen the gut and the immune system.\n\nMajority of people can recover from the flu without having to resort to medical care or drugs; the most they’ve done is to rest at home and avoid coming into contact with other people. Antiviral medication may be prescribed in some cases. However, people who are in the high-risk group (which consists of children, senior citizens, pregnant women, and people with compromised immune systems) should be monitored closely for any signs of the flu.\n\nLuckily, the flu is a preventable condition. Practicing good hygiene (e.g., washing hands with soap and water, avoiding touching the eyes, nose and mouth) and cleanliness (e.g., wiping down surfaces with disinfectant and covering sneezes and coughs) are effective ways of avoiding the flu. Taking extra steps to improve the immune system, such as through daily exercise and getting adequate amounts of sleep every night, is recommended as well.\n\nWhere to learn more\n• Economic and political forces are driving the flu vaccine hysteria – not sound medical science\n• Flu vaccines revealed as the greatest quackery ever pushed in the history of medicine\n• Influenza Vaccine Facts They Don’t Want You to Know!\n• Protect yourself from flu season with these natural cold remedies\n\nThe flu is a respiratory illness that’s often confused with the cold. A person who has come down with the flu will exhibit symptoms like chills, high-grade fever, and breathing difficulty. These symptoms can worsen in vulnerable people, and may even lead to more serious complications.\n\nThe flu is a preventable disease that usually goes away on its own after rest. To avoid the flu, one should adhere to good hygiene and cleanliness habits, and try to stay in the best possible shape through diet, exercise, and sleep.", "opengraph": {"title": "Flu – causes, side effects and treatments at NaturalPedia.com", "type": "article", "url": "http://www.naturalpedia.com/flu-causes-side-effects-and-treatments-at-naturalpedia-com.html", "site_name": "Natural Pedia Com", "description": "The flu, or influenza, is a contagious respiratory disease caused by any of the flu viruses. These viruses travel through ...", "image": "http://www.naturalpedia.com/wp-content/uploads/sites/292/2018/03/Sick-Child-Flu-Face-Mask-Teddy-Bear-Sad.jpg"}, "tags": ["Flu"], "tweets": [], "movies": [], "links": ["https://www.medicinenet.com/influenza/article.htm#flu_influenza_conventional_h1n1_h3n2_and_bird_flu_[h5n1]_facts", "https://www.healthline.com/health/flu-risk-factors", "https://www.healthline.com/health/cold-flu/early-flu-symptoms", "https://www.rd.com/health/beauty/natural-remedies-for-cold-and-flu/", "https://www.naturalpedia.com/echinacea-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.naturalpedia.com/garlic-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.naturalpedia.com/ginger-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.naturalpedia.com/honey-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.rodalewellness.com/living-well/cold-flu-remedies?slide=1", "https://www.naturalpedia.com/yogurt-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.cdc.gov/flu/takingcare.htm", "https://www.naturalnews.com/2018-02-21-economic-and-political-forces-are-driving-the-flu-vaccine-hysteria-not-sound-medical-science.html", "https://www.naturalnewsblogs.com/flu-shots-for-all/", "https://www.naturalnews.com/027239_vaccine_flu_vaccines.html", "https://www.naturalnewsblogs.com/influenza-vaccine-facts-they-dont-want-you-to-know/", "https://www.naturalnews.com/056193_flu_season_natural_remedies_Big_Pharma.html", "https://www.medicinenet.com/influenza/article.htm#flu_influenza_conventional_h1n1_h3n2_and_bird_flu_[h5n1]_facts", "https://www.healthline.com/health/flu-risk-factors", "https://www.healthline.com/health/cold-flu/early-flu-symptoms", "https://www.rd.com/health/beauty/natural-remedies-for-cold-and-flu/", "https://www.rodalewellness.com/living-well/cold-flu-remedies?slide=1", "https://www.cdc.gov/flu/takingcare.htm", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fnaturalpedia%2Fflu-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Flu%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fnaturalpedia%2Fflu-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Flu%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fnaturalpedia%2Fflu-causes-side-effects-and-treatments-at-naturalpedia-com.html&linkname=Flu%20%E2%80%93%20causes%2C%20side%20effects%20and%20treatments%20at%20NaturalPedia.com", "https://www.addtoany.com/share"], "authors": ["Zoey Sky", "Rhonda Johansson", "Ralph Flores", "Frances Bloomfield"], "publish_date": "2019-02-15T17:45:55+00:00"}