{"result_id": "216016", "URL": "https://naturalsociety.com/genetically-modified-cows-to-create-human-breast-milk/", "timestamp": "2023-04-25 16:31:47 CEST+0200", "meta": {"description": "Human genes have successfully been inserted into genetically modified cows that now allow them to produce 'human' milk. Weird!", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/genetically-modified-cows-to-create-human-breast-milk/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Genetically Modified Cows Created to Produce 'Human Breast Milk'", "cleaned_text": "It appears genetically modified babies, lab monkeys, genetically modified mosquitoes, and even human-hybrids are not enough for some geneticists who continue to modify the very genetic coding of nature more and more each day. In the latest creation unleashed by scientists, human genes have successfully been inserted into genetically modified cows that now allow them to produce ‘human’ milk — milk that has the very same properties as human breast milk.\n\nThis human-cow hybrid milk is now being lined up as an alternative milk formula for babies, with scientists envisioning ‘herds of genetically modified cows’ to ultimately provide the human breast milk needed to feed newborns. The announcement is reminiscent of Monsanto’s genetically modified bovine growth hormone known as rBGH. Now banned in over 27 countries (but still sold widely in the United States), the synthetic hormone is created using molecules and DNA sequences that are a result of molecular cloning. A large amount of peer-reviewed research has identified rBGH as a risk factor for both breast and gastrointestinal cancer, yet many US ‘officials’ and ‘scientists’ continue to claim it is safe. Remember, it is banned in over 27 other nations for legitimate health concerns.\n\nAccording to the lead researcher Professor Ning Li, this modified human milk is set to hit the dinner table within 10 years or so:\n\nIt sounds like a science fiction novel in which morality and reason is but a thing of the past – human milk from genetically modified cows – however, it is actually a daunting reality. You see in the past, after it came out that ‘underground’ labs were actually creating human-hybrid chimeras using the genetic imprint of humans to breed disturbing and horrific ‘creatures’, scientists began to speak out over the serious ethical and moral implications. There is also a great concern of preserving the ‘genetic integrity’ of not only human beings and living animals, but the environment as well.\n\nAs one spokesperson for the Royal Society for the Protection of Animals notes, cloned animals have in the past demonstrated serious health conditions that have alarmed researchers. So why are these scientists ready to roll out this genetically modified ‘human breast milk’ into grocery stores nationwide? She said:\n\nAn example of such a genetic threat can be examined with the introduction of genetically modified salmon. Pushed by the USDA and major biotech corporations, AquAdvantage salmon (the modified brand), was just moments away from approval when Congress blocked the FDA from approving the salmon for consumption due to serious health and environmental concerns.\n\nThe fact of the matter is that not only does research exist showing that consuming genetically modified food products is hazardous to your health, but they threaten nature as a whole. Both the genetically modified babies and salmon, if unleashed to the public, can effectively change the very genetic structure of future generations — changes that can cause serious long-term consequences that we do not even fully understand.\n\nThe question is how long will scientists continue to endanger public health and the welfare of all living creatures involved with rampant genetic modification of nature before the consequences present themselves in such a manner that invokes serious repercussions.", "opengraph": {"locale": "en_US", "type": "article", "title": "Genetically Modified Cows Created to Produce 'Human Breast Milk'", "description": "Human genes have successfully been inserted into genetically modified cows that now allow them to produce 'human' milk. Weird!", "url": "https://naturalsociety.com/genetically-modified-cows-to-create-human-breast-milk/", "site_name": "Natural Society", "article:tag": "milk", "article:section": "Featured", "article:published_time": "2012-07-10T06:53:56+00:00", "image": "https://naturalsociety.com/app/uploads/2021/02/fallback-featured.png", "image:secure_url": "https://naturalsociety.com/app/uploads/2021/02/fallback-featured.png", "image:width": "730", "image:height": "288", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://naturalsociety.com/worlds-first-genetically-modified-babies-created-in-us/", "https://naturalsociety.com/genetically-modified-mosquitoes-unleashed-concerns-grow/", "http://www.ncbi.nlm.nih.gov/pubmed/8932606", "https://naturalsociety.com/genetic-hybrid-human-animal-experiments-lead-to-call-for-new-rules/", "http://www.dailymail.co.uk/news/article-2004315/Congress-bans-FDA-approving-genetically-modified-fish.html", "http://www.telegraph.co.uk/earth/agriculture/geneticmodification/8423536/Genetically-modified-cows-produce-human-milk.html"], "authors": ["Natural Society"], "publish_date": "2012-07-10T06:53:56+00:00"}