{"result_id": "216010", "URL": "https://naturalsociety.com/mainstream-media-to-begin-bird-flu-scare-regarding-bird-fish-deaths/", "timestamp": "2023-04-25 16:31:38 CEST+0200", "meta": {"description": "Mainstream media may soon start declaring that the countless bird deaths may be the result of a bird flu epidemic.", "lang": "en", "keywords": "", "favicon": "https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/mainstream-media-to-begin-bird-flu-scare-regarding-bird-fish-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Mainstream Media to Begin Bird Flu Scare Regarding Bird and Fish Deaths", "cleaned_text": "With countless fish and bird deaths mounting across the globe, the reason for their death is still mostly unknown. While it could be anything from government testing to some form of disease, the mainstream media may soon start declaring that it may be the result a bird flu epidemic. With the New York Times reporting that Japan is on high alert regarding the possibility of an outbreak, it seems that the media may have already begun hyping a new ‘bird flu epidemic’ that mirrors the fabricated swine flu ‘pandemic’.\n\nIf there was indeed a resurgence of what is considered “traditional” bird flu, or an entirely new strain, there would be cause for concern. It depends, however, on the type of stain. When people use the term “bird flu” they are usually referring to the H1N5 virus. The H1N5 virus has created global concern due to the fact that it has claimed at least 300 humans throughout Azerbaijan, Cambodia, China, Egypt, Indonesia, Iraq, Laos, Nigeria, Pakistan, Thailand, Turkey, and Vietnam. This is due to its highly pathogenic nature, and prevalence in poultry-rich areas. The H5N1 virus is indeed a threat, however it seems as though the mainstream media may be fabricating a bird flu pandemic with little solid evidence.\n\nThe swine flu “pandemic” proved to be an over-hyped period in time in which the real threat was the H1N1 vaccination. With government officials recently admitting that the H1N1 vaccine “may” cause a deadly nerve disease known as Guillain-Barre syndrome, the dangers of the H1N1 vaccination have become more apparent. So much so that a study from Consumer Reports found that 30% of respondents questioned were unsure if they were going to receive this year’s vaccine, and an additional 30% said they definitely not be getting the shot. Given that the media begins over-hyping a bird flu outbreak, similar vaccines may be developed. Rushed out with minimal testing and loaded with fillers, these vaccines could lead to similar or worse side effects in those who are scared enough to take them.\n\nLooking at history, it is easy to see that the swine flu vaccine was arguably more dangerous than the swine flu itself. Scientists have even identified swine flu as relatively mild, even stating that it is “not that bad” of a virus. In 2009 we saw pigs begin to die from a mysterious disease. Reporters were first unsure as to why the pigs were dying, with some claiming that it was not a big deal. As soon as the findings came that it could be swine flu, or H1N1, the media went wild. We are seeing the same thing with the countless bird and fish deaths. The media is in the initial phase of confusion at this point, with articles in publications like the New York Times carrying stories regarding bird flu outbreaks.\n\nWith most people in the dark regarding the reason behind the mysterious animal deaths, it is quite simple to push rumors as facts. Just as with the swine flu outbreak, citizens look to their government for answers. The difference now, however, is that the public has learned from their past mistakes. If the government is to rush out a hastily-concocted vaccination, the public will most likely reject it. While the threat of bird could possibly be a serious one (though as previously stated, there is a 90% chance it is simply hype), studies have shown that vitamin D is far more powerful than vaccinations when it comes to flu prevention. As more animals continue to die globally, more information will be available to analyze and make solid conclusions.", "opengraph": {"locale": "en_US", "type": "article", "title": "Mainstream Media to Begin Bird Flu Scare Regarding Bird and Fish Deaths", "description": "Mainstream media may soon start declaring that the countless bird deaths may be the result of a bird flu epidemic.", "url": "https://naturalsociety.com/mainstream-media-to-begin-bird-flu-scare-regarding-bird-fish-deaths/", "site_name": "Natural Society", "article:tag": "viruses", "article:section": "Political Health", "article:published_time": "2011-01-05T21:04:39+00:00", "article:modified_time": "2023-04-23T04:50:46+00:00", "updated_time": "2023-04-23T00:50:46-04:00", "image": "https://naturalsociety.com/app/uploads/2011/01/media-camera-news-anchor-woman-735-350-031922.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2011/01/media-camera-news-anchor-woman-735-350-031922.jpg", "image:width": "735", "image:height": "350", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/2011/01/04/health/04global.html?_r=4", "https://www.usatoday.com/yourlife/health/medical/coldflu/2010-10-28-flu28_st_N.htm?csp=34news", "https://articles.latimes.com/2009/apr/30/science/sci-swine-reality30", "https://www.nytimes.com/2011/01/04/health/04global.html?_r=4"], "authors": ["Natural Society"], "publish_date": "2011-01-05T21:04:39+00:00"}