{"result_id": "216015", "URL": "https://naturalsociety.com/7-habits-super-immunity/", "timestamp": "2023-04-25 16:31:46 CEST+0200", "meta": {"description": "There are indeed ways to have super immunity. Here are 7 ways to help create a super-healthy immune system to fend off illness and disease.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/7-habits-super-immunity/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "7 Habits for Super-Immunity & Fending Off Disease", "cleaned_text": "The ability of an organism to resist a specific infection or toxin by the action of antibodies or sensitized white blood cells is what creates our ‘immunity.’ Our immune systems take a beating trying to fight against natural and industrial waste and poor-quality food and water that causes illness. T-cells, made by the immune system, are the foremost soldiers of our immune system, and our gut flora is like the headquarters sending out ‘troops’ to keep the home front protected. There are ways to have ‘super’ immunity; however, if we look into the phenomenon of the immune system more closely.\n\nAs the National Institute of Allergy and Infectious Diseases states:\n\nFree radicals can signal T cells to get busy getting rid of inflammation, another big cause of disease, but they can be over-zealous in doing so, especially in cases of chronic inflammation.\n\nIf the immune system becomes overly strained, it starts to attack itself instead of foreign invaders. It can literally become its own worst enemy. This is often how auto-immune diseases begin. B-cells can’t communicate properly with T cells any longer. The goods news is that we can help the immune system do its job, without becoming over-active simply by changing our diet, and altering a few lifestyle habits.\n\nHere are 7 ways to help create a super-healthy immune system:\n• 1. Food is medicine. You can practically double your immune system’s ability to fight disease with the way you eat – Try eating more leafy greens, fruits and vegetables. Organic fruits and vegetables are choke-full of important immune-boosting antioxidants. Dr. Joel Fuhrman believes you can stay healthy forever, just by changing your nutrition. He believes that you should eat only foods that are high in nutrition. He includes onions, beans, and lots of veggies and fruits. He suggests you should base your meals on phytonutrient-rich foods. Without carotenoids and leafy greens that help boost gut flora, your immune system becomes exhausted.Fuhrman states: “The quality of a diet can be judged base on three simple criteria. Levels of micronutrients (vitamins, minerals, phytochemicals) per calorie. Amounts of macronutrients (fat, carbohydrate, protein) to meet individual needs, without excessive calories that may lead to weight gain or health compromise.Avoidance of potentially toxic substances (such as trans fats) and limited amounts of other potentially harmful substances (such as sodium).”\n• 2. Eating foods high on the ORAC chart also helps to boost immunity – These are foods that fight free radicals in the body, one of the main reasons disease develops and the body turns acid instead of maintaining its alkaline balance. Free radicals are an uncharged molecule that can wreck havoc on the body. They congest our cells and cause us to age faster and be more prone to disease. High ORAC foods include many herbs, like sumac, cloves, and oregano have high ORAC values. So do bran, sorghum, cinnamon, turmeric, Szechuan pepper, and vanilla beans.\n• 3. Stop eating fast-food – Slow-absorbing food is better for your immune system. When you eat ‘fast’ food devoid of nutrients, it makes your digestive system work extra hard to digest something that gives your body no benefit. Many slow-absorbing foods have both fiber and protein, or one or the other, along with important nutrients which also keep your glucose levels from spiking . There is a great documentary, Fast Food Nation, that explains why fast-food makes us sick, tired, and fat.\n• 4. Support healthy gut flora – Eating refined sugar erodes gut flora, while eating fermented foods like Kim Chi or can help create healthy gut flora. Dark chocolate has also been shown to provide ‘food’ for healthy gut bacteria. Leafy greens help to create healthy gut flora too. Obviously, taking a probiotic supplement can help as well, since this replaces ‘bad’ bacteria with ‘good’ bacteria, making it harder for the ‘bad guys’ to hang around in your intestinal tract.\n• 5. Get More Sleep – Your body can’t fight free radicals and restore itself if it barely has enough energy to carry out functions like pumping your heart or making sure you breathe. Dr. Fikrig and his colleagues at the Yale School of Medicine has found that our circadian rhythms (sleep and wake cycles) actually govern our immunity. Disturbed sleep patterns means compromised immunity. Make sure when you sleep, you stay asleep, soundly for 7-9 hours nightly. Sleeping even removes toxic waste form the brain\n• 6. Eat more mushrooms, onions and seeds – Aside from eating your fruit and vegetables, mushrooms, onions, and seeds all have their own immune-boosting produce spores and then grow from the hypha of fungi concealed in soil or wood. They are proverbial for rapid growth. They also help to break down things, both in the forest, and in our bodies that shouldn’t be there. This is why many mushrooms are hailed as super-foods and life-enhancers in Chinese medicine. Onions are anti-microbial, anti-viral, and immune boosting wonders, and seeds are like miniature plants, packed with a storehouse of all the nutrients they will need to grow big and strong, so they do the same for you. Sprouted seeds are even better. For example, sprouted broccoli seeds have 50 times as eating the broccoli plant itself.\n• 7. Take a Daily Walk – Exercise is one of the most important ways to promote a good immune response in the body . You don’t need to over-do it. Intense workouts can actually cause more stress on the body and depress the immune system. Especially if you are already under the weather, keep it light. For the best immune boosting benefits, make walking, running, swimming, jump-roping, or other sports, a daily activity.\n• 8. Use herbs and supplements instead of vaccines and pharmaceuticals – There are literally hundreds of herbs that help boost the immune system and fight off disease. These include things like moringa, olive leaf, astragalus, cloves, oregano, and more. Kathy Abascale lists Herbs & Influenza: How Herbs Used in the 1918 Flu Pandemic Can Be Effective Today that can naturally lessen flu symptoms, including herbs that treat Swine Flu. Conversely, vaccines and pharmaceuticals ( especially antibiotics ) can dampen your natural immune response, and kill healthy gut flora that are your ‘ ’ when it comes to fighting disease.", "opengraph": {"locale": "en_US", "type": "article", "title": "7 Habits for Super-Immunity & Fending Off Disease", "description": "There are indeed ways to have super immunity. Here are 7 ways to help create a super-healthy immune system to fend off illness and disease.", "url": "https://naturalsociety.com/7-habits-super-immunity/", "site_name": "Natural Society", "article:tag": "walking", "article:section": "General Health", "article:published_time": "2014-06-03T04:01:59+00:00", "article:modified_time": "2021-11-09T01:49:59+00:00", "updated_time": "2021-11-08T20:49:59-05:00", "image": "https://naturalsociety.com/app/uploads/2014/05/spices_food_immunity.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2014/05/spices_food_immunity.jpg", "image:width": "575", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.niaid.nih.gov/topics/immunesystem/immunecells/pages/tcells.aspx", "http://www.ncbi.nlm.nih.gov/pubmed/21936801", "http://emedicine.medscape.com/article/888372-overview", "https://naturalsociety.com/8-natural-antibiotics-immune-system-ditch-pharmaceuticals/", "http://www.webmd.com/diet/phytonutrients-faq", "http://healthyeating.sfgate.com/slow-glucose-absorption-6661.html", "http://www.eurekalert.org/pub_releases/2012-02/cp-ccg021012.php", "https://naturalsociety.com/study-reveals-sleep-crucial-detoxify-brain/", "https://naturalsociety.com/broccoli-sprouts-50-times-anti-cancer-properties-broccoli/", "http://www.nlm.nih.gov/medlineplus/ency/article/007165.htm", "http://articles.mercola.com/sites/articles/archive/2003/06/18/antibiotics-bacteria.aspx"], "authors": ["Christina Sarich"], "publish_date": "2014-06-03T04:01:59+00:00"}