{"result_id": "216007", "URL": "https://naturalsociety.com/in-congress-new-bill-requires-mandatory-childhood-vaccine-schedule/", "timestamp": "2023-04-25 16:31:35 CEST+0200", "meta": {"description": "The U.S. Congress may make mandatory childhood vaccination schedules currently prescribed by the CDC mandatory - so all children MUST be vaccinated.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/in-congress-new-bill-requires-mandatory-childhood-vaccine-schedule/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "In Congress: New Bill Requires Mandatory Childhood Vaccine Schedule", "cleaned_text": "The U.S. Congress is now entertaining legislation which will make mandatory childhood vaccination schedules currently prescribed by the CDC. The way of enforcing this new and stricter regime is by tying compliance directly to federal funding.\n\n“REQUIREMENT.—For a State or a political subdivision or other public entity of a State to be eligible to receive a grant under this section, the applicant shall demonstrate to the Secretary’s satisfaction that, subject to paragraphs (2) and (3), the State requires each student enrolled in one of the State’s public elementary schools or public secondary schools to be vaccinated in accordance with the recommendations of the Advisory Committee on Immunization Practices.”\n\nShould this legislation pass, it will make it virtually impossible for parents to opt out their children from the aggressive childhood schedules, regardless of the reason. Up until now, there have been exemptions granted for a variety of good reasons. Religious and philosophical exemptions are chief among those which have produced an immediate release for those children attending public school.\n\nWhat is particularly puzzling is that children are reacting to the ingredients in vaccines with greater frequency. Nevertheless, doctors rarely if ever test their pediatric patients for allergies, sensitivities, or intolerances to the various proven toxins and contaminants put in vaccines.\n\nIt would seem reasonable that the undeveloped and fragile bodies of newborn infants and young children would prompt the medical authorities to err on the side of caution. In fact, there is always a rush to vaccinate in spite of the complete lack of qualifying each baby or young child as a candidate for these potentially illness-causing vaccines. Family histories alone would provide a good starting point in trying to determine the likelihood of an adverse reaction.\n\nDo you think there should be mandatory vaccinations, or do you think parents should have the choice to vaccinate their children – or at least decide to opt out of certain vaccinations while allowing others?", "opengraph": {"locale": "en_US", "type": "article", "title": "In Congress: New Bill Requires Mandatory Childhood Vaccine Schedule", "description": "The U.S. Congress may make mandatory childhood vaccination schedules currently prescribed by the CDC mandatory - so all children MUST be vaccinated.", "url": "https://naturalsociety.com/in-congress-new-bill-requires-mandatory-childhood-vaccine-schedule/", "site_name": "Natural Society", "article:tag": "vaccines", "article:section": "Featured", "article:published_time": "2015-05-17T05:30:44+00:00", "article:modified_time": "2023-04-10T01:18:50+00:00", "updated_time": "2023-04-09T21:18:50-04:00", "image": "https://naturalsociety.com/app/uploads/2015/05/vaccine_jab_doctor_735_350.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2015/05/vaccine_jab_doctor_735_350.jpg", "image:width": "735", "image:height": "350", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.congress.gov/bill/114th-congress/house-bill/2232/text", "https://naturalsociety.com/california-parents-voice-resounding-no-to-forced-vaccines/", "https://www.congress.gov/bill/114th-congress/house-bill/2232/text"], "authors": ["Robert Harrington"], "publish_date": "2015-05-17T05:30:44+00:00"}