{"result_id": "216022", "URL": "https://naturalsociety.com/u-s-supreme-court-upholds-mandatory-vaccinations/", "timestamp": "2023-04-25 16:31:52 CEST+0200", "meta": {"description": "A New York court determined that vaccines be mandatory long ago, and recently refused the plea of a plaintiff who tried to overturn the archaic decision.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/u-s-supreme-court-upholds-mandatory-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "U.S. Supreme Court Upholds Mandatory Vaccinations", "cleaned_text": "If you were a parent who has researched vaccine dangers compulsively as a means to protect your child from questionable adjuvants and known neurotoxins, what would you do if a US Supreme Court told you that you had no ‘right’ to refuse vaccines for your child? Well, a New York court made such a determination long ago, and recently refused the plea of a plaintiff who tried to overturn the archaic decision.\n\nIn Jacobson [v. Massachusetts], all children who attend New York pubic schools can be ‘forced’ to be vaccinated, according to a 2nd circuit court of law. The law was determined in 1905 but was recently challenged by Dina Check, the plaintiff who decided that her Catholic religion gave her a right to determine whether or not her child should be vaccinated.\n\nWhile religious leanings are a fine reason to refuse a vaccination – the court also determined against her in the case because there was ‘strong evidence’ that her refusal vaccines were due to her fear of them being harmful, and not due to her religious beliefs.\n\nUnfortunately, it’s true that vaccines can potentially cause unwanted problems, as outlined even by the CDC’s Vaccine Adverse Event reports. Vaccine could lead to reproductive health damage, hampered child development, and other neurological disorders. This is no less abhorrent than the teenage girl who was recently told by a court of law that she HAD to get chemotherapy for her cancer treatment. Really? How can the nations of the free make such an enforcement on its citizens?\n\nRead: How to Avoid Mandatory Vaccinations Through Exemption\n\n17-year old Cassandra has Hodgkin’s Lymphoma, but she says she doesn’t want chemotherapy because though she has had few side effects with her first few treatments:\n\n“That doesn’t mean as the chemo continues things don’t get worse, but I’m more concerned about the long-term side effects, and also the fact that I don’t want these drugs in my body, but they are and it disgusts me. “Everyone including myself should have the given right to say what you do or don’t want to be done to their body.”\n\nWhether you believe in these types of medical intervention or not, your rights are being stripped from you. There are currently 58 bills in 24 different states that would limit your rights when it comes to vaccines, and in some cases, you would be forced or face jail time or have your children taken from you by Child Protective Services.\n\nThis should also cause a moment of reflection since the US has an extremely high infant mortality rate (and we start vaccinating our babies before they even reach 12 months old). Furthermore, U.S. law protects vaccine manufacturers from any liability due to faulty vaccines – not the people who suffer from them. I hope Dina Check appeals, and so does the 17-year old Hodgkin’s patient.\n\nYour health is your right.", "opengraph": {"locale": "en_US", "type": "article", "title": "U.S. Supreme Court Upholds Mandatory Vaccinations", "description": "A New York court determined that vaccines be mandatory long ago, and recently refused the plea of a plaintiff who tried to overturn the archaic decision.", "url": "https://naturalsociety.com/u-s-supreme-court-upholds-mandatory-vaccinations/", "site_name": "Natural Society", "article:tag": "vaccines", "article:section": "Featured", "article:published_time": "2015-01-13T07:43:41+00:00", "article:modified_time": "2021-10-11T03:34:11+00:00", "updated_time": "2021-10-10T23:34:11-04:00", "image": "https://naturalsociety.com/app/uploads/2015/01/vaccine_vial_735_3501.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2015/01/vaccine_vial_735_3501.jpg", "image:width": "735", "image:height": "350", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.courthousenews.com/2015/01/08/mandatory-vaccinations-in-ny-upheld-by-2nd-cir.htm", "http://abcnews.go.com/Health/connecticut-teenager-explains-doesnt-chemotherapy-treatment/story?id=28151107", "https://naturalsociety.com/how-to-avoid-mandatory-vaccinations-through-exemption/", "http://healthimpactnews.com/2014/fighting-forced-vaccination-in-america-in-2014-58-bills-in-24-states-threatening-right-to-refuse-vaccines/", "http://www.nvic.org/nvic-vaccine-news/march-2011/no-pharma-liability--no-vaccine-mandates-.aspx"], "authors": ["Christina Sarich"], "publish_date": "2015-01-13T07:43:41+00:00"}