{"result_id": "216021", "URL": "https://naturalsociety.com/safety-group-blows-lid-on-secret-virus-hidden-in-gmo-crops/", "timestamp": "2023-04-25 16:31:51 CEST+0200", "meta": {"description": "A new report has discovered a hidden viral gene deep within genetically modified crops that actually physically mutates other crops and poses serious risks.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/safety-group-blows-lid-on-secret-virus-hidden-in-gmo-crops/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Safety Group Blows Lid on 'Secret Virus' Hidden in GMO Crops", "cleaned_text": "Yet another disturbing reason has emerged as to why you should be avoiding health-devastating genetically modified organisms, and it may be one of the most concerning yet. We know that GMO consumption has been linked to a host of serious conditions, but one thing we are not so sure about is the recent discovery of a hidden viral gene deep within genetically modified crops.\n\nFor years, GMOs have been consumed knowingly and unknowingly around the globe, with Monsanto and the United States government claiming that the altered franken crops are perfectly safe despite very limited (or virtually none in some cases) initial testing and scientists speaking out against the dangers.\n\nOne such danger that has actually not been spoken about has been revealed in a recent report by a safety watchdog group known as the European Food Safety Authority (EFSA).\n\nIn the EFSA report, which can be read online, you can find (within the scientific wording) that researchers discovered a previously unknown viral gene that is known as ‘Gene VI’. What’s concerning is that not only is the rogue gene found in the most prominent GMO crops and about 63% of GMO traits approved for use (54 out of 86 to be precise), but it can actually disrupt the very biological functions within living organisms.\n\nPopular GMO crops such as Roundup-Ready soybeans, NK603, and MON810 corn were found to contain the gene that induces physical mutations. NK603 maize, of course, was also recently linked to the development of mass tumors in rats.\n\nAccording to Independent Science News, Gene VI also inhibits RNA silencing. As you may know, RNA silencing has been pinpointed as vital for the proper functioning of gene expression when it comes to RNA. Perhaps more topically, it is a defense mechanism against viruses in plants and animals alike. On the contrary, many viruses have developed genes that disable this protective process. Independent Science News reports that the Gene VI is one such gene.\n\nOverall, there is a degree of knowledge on Gene VI. What we do know going by information within the report is that the gene:\n• Inhibits the natural defense of the cellular system\n\nAll of which are very significant effects that should be studied in depth by an independent team of scientists after GMO products are taken off the market pending further research on the entire array of associated diseases. And that does not even include the effects we are unaware of.\n\nThis is yet another incident in which Monsanto and other biotech companies are getting away with an offense against the citizens of the world with (most likely) no action taken by the United States government.\n\nWhat we have seen, however, is nations like Russia, Poland, Hungary, and Peru taking a stand against Monsanto in direct opposition to their disregard for public safety. Russia, in fact, banned Monsanto’s GMO corn variety after it was linked to mass tumors in rats.\n\nAs more and more dirty secrets come out from the GMO industry at large, it gives further reason and more support to remove GMOs as a whole from the food supply.", "opengraph": {"locale": "en_US", "type": "article", "title": "Safety Group Blows Lid on 'Secret Virus' Hidden in GMO Crops", "description": "A new report has discovered a hidden viral gene deep within genetically modified crops that actually physically mutates other crops and poses serious risks.", "url": "https://naturalsociety.com/safety-group-blows-lid-on-secret-virus-hidden-in-gmo-crops/", "site_name": "Natural Society", "article:tag": "GMO Crops", "article:section": "Featured", "article:published_time": "2013-02-07T07:17:16+00:00", "article:modified_time": "2022-02-16T16:29:52+00:00", "updated_time": "2022-02-16T11:29:52-05:00", "image": "https://naturalsociety.com/app/uploads/2013/02/gmotomatoinject.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2013/02/gmotomatoinject.jpg", "image:width": "575", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.landesbioscience.com/journals/gmcrops/2012GMC0020R.pdf", "https://dx.doi.org/10.1016/j.fct.2012.08.005", "https://naturalsociety.com/gmo-study-rats-fed-lifetime-of-gm-develop-mass-tumors-die-early/", "http://independentsciencenews.org/commentaries/regulators-discover-a-hidden-viral-gene-in-commercial-gmo-crops/", "https://rt.com/business/news/russia-monsanto-corn-ban-005/"], "authors": ["Natural Society"], "publish_date": "2013-02-07T07:17:16+00:00"}