{"result_id": "216014", "URL": "https://tv.naturalsociety.com/vaccine-inventor-genetic-engineer-jokes-depopulation/", "timestamp": "2023-04-25 16:31:46 CEST+0200", "meta": {"description": "Edible vaccine supporter Dr. Charles Arntzen recently joked about reducing the population with a genetically engineered virus, only it is all real.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://tv.naturalsociety.com/vaccine-inventor-genetic-engineer-jokes-depopulation/", "encoding": "UTF-8"}, "image": null, "domain": "tv.naturalsociety.com", "title": "Vaccine Inventor & Genetic Engineer Jokes About Depopulation", "cleaned_text": "Edible vaccine supporter and head of the Biodesign Institute for Infectious Diseases and Vaccinology, Dr. Charles Arntzen has recently responded to questions about the issue of overpopulation with the following sardonic remarks, “Has anybody seen? That’s the answer! Go out and use genetic engineering to create a better virus [to wipe out the population]”.\n\nAccording to the Institute for which Dr. Arntzen works,\n\n“Infectious disease causes 35 percent of deaths worldwide, and is the world’s biggest killer of children and young adults. Our researchers are focused on basic bacterial and viral infectious disease processes as well as the design and use of vaccines and protein therapeutics to combat infectious diseases. These include newly emerging pathogens and potential biological warfare agents. We are devising new and effective ways of producing advanced vaccines and therapeutics, methods include the use of recombinant attenuated bacteria and viruses as well as genetically modified plants, and transferring this technology to the developing world to help fight diseases. Accomplishing our goals requires the creation and evaluation of novel bio-manufacturing systems for cost-effective production of vaccines and therapeutics and the development and implementation of new strategies for translation of this research into health benefits for the developing world.”\n\nIt seems the professor isn’t joking about using germ warfare to wipe out over 25% of the population, as he joked during an Arizona State University Biotech department discussion that took place this past February. This is similar to how some biotechs support GMOs role in causing infertility. In one email we received, a ‘biotech scientist’ known as ‘Ed’ explains how he thinks it’s ‘awesome’ that GMOs are contributing to infertility, as he believes the world is overpopulated.\n\nWhen Arntzen was asked if he felt the world population of over 8 billion people deserved to be fed or if population reduction was a more intelligent pursuit, he laughed off the question with sarcastic remarks. Artzen, not surprisingly, was one of the first scientists to pursue an edible vaccine that would take the place of injections with funding from the Boyce Thompson Institute in 1996 under funding from the Rockefeller Foundation. He believed that “children of developing countries may not be the only beneficiaries of this technology.”\n\nIt seems the eugenics claims made by non-GMO activists are not an exaggeration. The scientists are being funded to come up with the technology to carry out a Malthusian prerogative.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Inventor & Genetic Engineer Jokes About Depopulation", "description": "Edible vaccine supporter Dr. Charles Arntzen recently joked about reducing the population with a genetically engineered virus, only it is all real.", "url": "https://tv.naturalsociety.com/vaccine-inventor-genetic-engineer-jokes-depopulation/", "site_name": "NaturalSociety TV", "article:published_time": "2013-08-22T07:14:15+00:00", "article:modified_time": "2023-04-19T17:35:34+00:00", "image": "https://tv.naturalsociety.com/wp-content/uploads/2013/08/hqdefault.jpg", "image:width": "480", "image:height": "360", "image:type": "image/jpeg"}, "tags": ["vaccine", "vaccination"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "660", "height": "365", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/stGT6NcxVRQ\" width=\"660\" height=\"365\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/stGT6NcxVRQ"}], "links": ["#", "#", "#", "#", "https://www.biodesign.asu.edu/research/research-centers/infectious-diseases-and-vaccinology", "https://naturalsociety.com/biotech-scientist-its-awesome-that-gmos-cause-infertility-death/", "https://www.oldthinkernews.com/2009/06/edible-vaccines-and-flying-syringes/", "https://tv.naturalsociety.com/lead-developer-hpv-vaccine-admits-useless-dangerous/", "https://tv.naturalsociety.com/ben-jerrys-gmo-free-2014-company-says/", "https://tv.naturalsociety.com/new-csiro-gmo-wheat-can-silence-human-genes-causes-early-death/", "https://tv.naturalsociety.com/14-year-old-rachel-parent-blasts-tv-host-gmo-foods-remark/"], "authors": ["Christina Sarich"], "publish_date": "2013-08-22T07:14:15+00:00"}