{"result_id": "216034", "URL": "https://naturalsociety.com/australia-enforces-15k-penalty-for-parents-who-dont-vaccinate/", "timestamp": "2023-04-25 16:31:59 CEST+0200", "meta": {"description": "Those who refuse to vaccinate their kids in Australia will be denied as much as $11,000 in childcare rebates and welfare under new rules by the government.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/australia-enforces-15k-penalty-for-parents-who-dont-vaccinate/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Australia Enforces $11K Tax Penalty for Parents who Don’t Vaccinate", "cleaned_text": "Prime Minister Tony Abbott and Social Services Minister Scott Morrison of Australia just announced a shocking and historic reform affecting parents who are concerned about vaccinating their children. Those who refuse to vaccinate their kids will be denied as much as $11,000 in childcare rebates and welfare under new rules by the Federal Government.\n\nAussies are calling it ‘no jab, no pay,’ and it is a sinister overreach of government into personal medical choice.\n\nPreviously, parents could refuse vaccination through a ‘conscientious objector’ loophole. Parents will still be able to resist immunizing their children on medical and religious grounds without financial penalty, but the removal of the “conscientious objector’ clause means that parents won’t simply be able point to point to the medical uncertainty that vaccines are safe as a reason to refuse them for their children.\n\nAside from some faulty logic behind vaccines, such as a baby getting a Hep B vaccine when Hep B is only contracted through needle sharing and sexual contact, companies charged with making vaccines were accused of withholding evidence that they caused unsavory side effects.\n\nNevermind a ‘conscientious’ refusal by parents who aren’t sold on the complete safety of vaccines. Now if they fail to immunize their children in Australia, they will no longer be paid either (or all of) the following:\n\nIn a family with two children, this could amount to as much as $30,000.\n\nAustralia currently boasts childhood vaccination rates of over 90% for under 5’s, but the number of vaccine refusers is growing steadily.\n\nIf vaccines protect children from disease, what difference does it make if they are exposed to children who aren’t vaccinated?\n\nWhy do those who choose to vaccinate have more rights than those who chose not to?\n\nCurrently, parents must immunize their children in order to access childcare subsidy payments and FTB supplements. Until now, they could have simply signed a form saying that they had discussed the issue with a general practitioner and had decided to forgo the vaccinations for “personal philosophical, religious.’ The parents of more than 24,000 children have refused vaccines with this clause in the past decade.\n\nExisting exemptions on medical or religious grounds will continue, but this will only be honored where the parent is affiliated with the religious group and the governing body had formally registered objection approved by the Government.\n\nThis means that whether or not you subject your child – your infant of only a few days old, in many cases – to possibly damaging vaccines is now the choice of the government, not the parent.\n\nAnd this isn’t just happening in Australia. The U.S. is looking at similar legislation. The U.S. is also trying to pass legislation that would absolve Pharmaceutical companies from having to pay vaccine injury cases, even though the government just had to pay compensation to 80 flu vaccine injuries and deaths very recently.\n\nIn another case, GlaxoSmithKline made headlines after having to settle a major lawsuit that brought up their payouts to over $9.1 billion since 2003. This time, it is due to GSK’s product Pandemrix, which has caused narcolepsy in many individuals.\n\nFurthermore, a U.S. citizen, by law, cannot sue a pharmaceutical company for damages resulting from vaccines. Congress gave them total legal immunity in 1986, and that law was upheld by the U.S. Supreme Court in 2011.\n\nThere is a special “vaccine court” called the National Vaccine Injury Compensation Program that is funded through a tax on vaccines. If you are injured or killed by a vaccine, you must hire an attorney and fight tax-funded government attorneys to seek damages, since you can’t sue Big Pharma directly.\n\nMore than 117 cases have been settled by pharmaceutical companies in just the last six months, yet mainstream media reports none of these cases, no injuries, and no possible dangers associated with vaccines.\n\nWhen a former CDC scientist, Dr. William Thompson decided to come clean about the dangers of vaccines, the mainstream media treated the occasion with a total blackout. (You can watch him talk about in this video, though.)\n\nBut yes – by all means, government-enforced vaccinations with no recourse for damages that they cause – this makes a load of sense. The people of the world have been deliberately deceived about vaccines, and if nothing else, the choice to vaccinate should remain.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australia Enforces $11K Tax Penalty for Parents who Don’t Vaccinate", "description": "Those who refuse to vaccinate their kids in Australia will be denied as much as $11,000 in childcare rebates and welfare under new rules by the government.", "url": "https://naturalsociety.com/australia-enforces-15k-penalty-for-parents-who-dont-vaccinate/", "site_name": "Natural Society", "article:tag": "vaccines", "article:section": "Featured", "article:published_time": "2015-04-18T05:25:57+00:00", "article:modified_time": "2021-10-18T23:18:39+00:00", "updated_time": "2021-10-18T19:18:39-04:00", "image": "https://naturalsociety.com/app/uploads/2015/04/vaccine_red_glove_735_350.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2015/04/vaccine_red_glove_735_350.jpg", "image:width": "735", "image:height": "350", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.heraldsun.com.au/news/parents-who-shun-vaccinations-to-lose-up-to-15k-a-year-in-rebates/story-fni0fiyv-1227299962186", "http://demanjo.com/news/business/1223948/australia-to-withhold-payments-from-parents-against-vaccine.html", "http://articles.mercola.com/sites/articles/archive/2012/07/10/merck-lying-about-vaccine-effectiveness.aspx", "https://naturalsociety.com/immunize-child-lose-childcare-benefits-parents/", "http://fas.org/sgp/crs/misc/RS21414.pdf", "http://vaccineimpact.com/2014/government-pays-compensation-to-80-flu-vaccine-injuries-and-deaths-in-3-month-period/", "https://naturalsociety.com/brain-damaged-victims-of-swine-flu-vaccine-win-63-million-lawsuit", "http://healthimpactnews.com/2015/march-2015-settlements-in-vaccine-court-117-vaccine-injuries-and-deaths/", "<iframe%20width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/gg2M7nphmFw\" frameborder=\"0\" allowfullscreen></iframe>"], "authors": ["Christina Sarich"], "publish_date": "2015-04-18T05:25:57+00:00"}