{"result_id": "216012", "URL": "https://naturalsociety.com/gagging-the-nation-government-and-corporate-trolls-on-the-internet/", "timestamp": "2023-04-25 16:31:44 CEST+0200", "meta": {"description": "I’ve always suspected that some people were being paid by mega-companies like Monsanto to try to defame and attack activists. Now I have proof.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/gagging-the-nation-government-and-corporate-trolls-on-the-internet/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Gagging the Nation: Government and Corporate Trolls on the Internet", "cleaned_text": "I’ve personally been affected by the vitriolic and absurd comments of paid shills on the Internet, as have many individuals trying to report ‘truth’ as they see it. I’ve always suspected there were people being paid by mega-companies like Monsanto to try to defame my words. Now I have proof.\n\nIn documents released by Edward Snowden and Glen Greenwald, there is now proof that Western governments have been trying to wreak havoc on the lives of people who dare to expose corporate crimes and government infiltration by Big Biotech, Big Banks, Big Pharma, and the ‘unseen hand’ that is ruining the world.\n\nNot only do they dare to try to limit free speech, but in an attempt to control money and power (and thus people), they also try to defame and discredit anyone who blows the whistle on their insalubrious and greed-driven misdeeds.\n\nUtilizing a UK intelligence outfit known as the Government Communications Headquarters, through a secret unit known as the Joint Threat Research Intelligence Group, paid trolls and shills systematically try to “to control, infiltrate, manipulate, and warp online discourse.”\n\nThat means some individuals get a pay check to talk about how great glyphosate and Bt toxins are, and individuals on other sites I’ve personally been to try to discredit me by calling me an ‘idiot yoga teacher.’ Funny how a little digging would evidence that not only am I college educated, but I’ve also taught yoga for over fifteen years, and that this practice deeply informs my knowledge, and interest in natural health.\n\nRead: Monsanto and Others Caught Paying Internet Trolls to Attack Activists\n\nI used to even argue with these trolls online until I wised up and realized not to engage with them whatsoever. It isn’t just my or any other person’s integrity at stake, though. As Greenwald recently posted, the entire Internet’s authenticity is at stake – much like the MSM:\n\n“By publishing these stories one by one, our NBC reporting highlighted some of the key, discrete revelations: the monitoring of YouTube and Blogger, the targeting of Anonymous with the very same DDoS attacks they accuse “hacktivists” of using, the use of “honey traps” (luring people into compromising situations using sex) and destructive viruses. But, here, I want to focus and elaborate on the overarching point revealed by all of these documents: namely, that these agencies are attempting to control, infiltrate, manipulate, and warp online discourse, and in doing so, are compromising the integrity of the internet itself.”\n\nLuckily, I haven’t been wooed into a honey trap or defamed publicly. So far, I’ve only had to learn to ignore venomous rants below my articles that are obviously meant to obfuscate the sentient points I make. You can’t conceal truth for long though. Many people had a hunch that these trolls were trying to mind-boggle the masses. You’ll find such arguments right here on Natural Society.\n\nGreenwald and Snowden say that these agencies and their work-for-hire contractors are willing to sink to disgusting lows to control public view. They include two primary tactics:\n\n“(1) to inject all sorts of false material onto the internet in order to destroy the reputation of its targets; and (2) to use social sciences and other techniques to manipulate online discourse and activism to generate outcomes it considers desirable. To see how extremist these programs are, just consider the tactics they boast of using to achieve those ends: “false flag operations” (posting material to the internet and falsely attributing it to someone else), fake victim blog posts (pretending to be a victim of the individual whose reputation they want to destroy), and posting “negative information” on various forums.”\n\nRemember this the next time some shill says the economy is recovering or that GMOs are good for us, that pharmaceutical drugs and vaccines don’t cause any harm, or that eating clean food and pristine water won’t help prevent most disease. It’s an information war, and your opinion counts.", "opengraph": {"locale": "en_US", "type": "article", "title": "Gagging the Nation: Government and Corporate Trolls on the Internet", "description": "I’ve always suspected that some people were being paid by mega-companies like Monsanto to try to defame and attack activists. Now I have proof.", "url": "https://naturalsociety.com/gagging-the-nation-government-and-corporate-trolls-on-the-internet/", "site_name": "Natural Society", "article:tag": "Latest Stories", "article:section": "Featured", "article:published_time": "2015-07-05T06:22:49+00:00", "article:modified_time": "2021-10-20T22:45:05+00:00", "updated_time": "2021-10-20T18:45:05-04:00", "image": "https://naturalsociety.com/app/uploads/2015/07/INTERNET-TROLLS-618-735-258.png", "image:secure_url": "https://naturalsociety.com/app/uploads/2015/07/INTERNET-TROLLS-618-735-258.png", "image:width": "735", "image:height": "258", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["http://investmentwatchblog.com/yes-there-are-paid-government-trolls-on-social-media-blogs-forums-and-websites/", "https://naturalsociety.com/monsanto-and-others-caught-paying-internet-trolls-to-attack-activists/"], "authors": ["Christina Sarich"], "publish_date": "2015-07-05T06:22:49+00:00"}