{"result_id": "216006", "URL": "https://naturalsociety.com/43-drug-reactions-vaccine-related-groundbreaking-new-study/", "timestamp": "2023-04-25 16:31:34 CEST+0200", "meta": {"description": "A new study testing the safety of common pharmaceuticals revealed that nearly half of all adverse drug reactions in Shanghai were caused by vaccines.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/43-drug-reactions-vaccine-related-groundbreaking-new-study/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Groundbreaking New Study: 42% of Drug Reactions are Vaccine Related", "cleaned_text": "A pioneering new drug study testing the safety of many common pharmaceutical drugs has revealed that almost half of all adverse drug reactions reported in Shanghai, from anaphylaxis to death, were caused by vaccines.\n\nThe study is published in an all access journal called PLos, titled, “Adverse Drug Reactions of Spontaneous Reports in Shanghai Pediatric Population,” and within it Chinese pediatric populations were studied via spontaneous reports gathered from physicians (52.03%), pharmacists (24.27%) and other health care practitioners (15.46%), with only 2.52% coming from ‘consumers.’\n\nThis is a significant study for those who are anxious to dismiss vaccine dangers as just consumer confusion or merely anecdotal reports from those who are without real facts. Since many are wary to give weight to any reports that are not from a clinical setting, it is difficult to argue with this particular study’s findings.\n\nThis is also one of the first-ever studies conducted on the topic of vaccines in China.\n\nThe results were reported as such:\n\n“A male overrepresentation was observed regarding the total number of reports. The most frequently reported group of drugs were vaccines (42.15%). Skin rash and fever were the commonest symptoms reported in the total pediatric dataset. The proportion of children that suffered from a serious ADR was 2.16% and that for drug related deaths was 0.34%. And we found that the multiple drug exposure experienced a high proportion of serious ADRs compared with the single drug use (χ215.99, P<0.0001). Sixty-five percent of ADRs were for children less than 6 years of age. And more than half of reports were from doctors.”\n\nRead: If Publicized, this Study Would be a Vaccination Schedule Bombshell\n\nThe study quotes the World Health Organization (WHO) for its definition of an adverse drug reaction (ADRs) as ‘events related to a medication that are noxious, unintended and occur at normal doses used in humans for prophylaxis, diagnosis or therapy of disease, or for modification of physiological function.’ The WHO does not include deliberate or excessive consumption (overdose) in their definition of an ADR.\n\nThe study found that ADRs are so globally problematic that they are in fact one of the leading causes of morbidity in many countries. A 1998 report published in JAMA found that 106,000 Americans die every year from correctly prescribed medications. These are not deaths from overdoses or misuse of drugs – another prevalent problem which is seldom discussed in the scientific community. Furthermore, the study finds that the younger an individual, the more at risk they become for harm due to vaccines and ADRs.\n\nAlso at higher risk are males compared to females:\n\nThe Young Are More at Risk to ADRs: “When the data were assessed in terms of age groups, almost two thirds of ADRs were reported for children from birth to 5 years of age (65.01%) and 39.46% concerned children aging 2 months-2 years.” Furthermore, “The highest proportion (6.58%) of serious reports was reported for newborn (0–1 month).”\n\nMales Were More Prone than Females to ADR Dangers: A total of 1790 ADRs (40.41%) and 2640 ADRs (59.59%) were reported for female and male patients, respectively.\n\nOf note in the study – children under five are the most often vaccinated!\n\nThe study expands on this fact further:\n\nChinese vaccine schedules are similar to American schedules, often subjecting young children, prior to the full development of their immune systems, to a ‘polypharmacy’ approach, exposing their little bodies and minds to a cornucopia of combined toxins. The total affect of these toxins cannot be minimized. Their interactions are at least part of the reason for such high incidence of ADRs as well as death, not just their singular use. There is no way that small, developing bodies are ready for more than 12 different strains of vaccines before they even leave kindergarten.\n\nThis study extrapolates the dangers linked to vaccines further:\n\n“With the seemingly constant flow of new therapeutic agents and new treatment indications for existing medications, polypharmacy is increasingly common. Drug-drug interactions (DDI) occur when two or more drugs are taken in combination and one drug influences the effects of another drug. This may subsequently cause a change in the pharmacodynamic or pharmacokinetic parameters which may lead to lack of efficacy, or to an increase in the number of reported adverse drug reactions. The association between multiple drug exposure and the incidence of ADRs has been studied, consistently showing an exponentially increased risk with the increase of the number of drugs taken. When assessing the severity of the reported ADRs, our study confirmed that multiple drug exposure experienced a high proportion compared with the single drug use. This finding indicate that in order to minimize the risk of serious ADRs, HCPs should pay particular attention to children who are prescribed two drugs or more.”\n\nDr. Dr. Kelly Brogan, MD, agrees that vaccine schedules are harmful, if not likely fatal, with the US having one of the highest infant mortality rates of over 33 developed countries in the world:\n\nThis study is monumental, in that it proves the onslaught of vaccines we give our children is not exactly a medical miracle as it has been touted.\n\nThe autoimmunity generating properties of vaccines, and other chronic health issues associated with the presence of ‘hidden’ pathogenic viruses in the live and attenuated vaccines most commonly used in China and the underdeveloped or developing world, will become more curious to researchers with eyes to see how ‘preventative’ vaccines really are.", "opengraph": {"locale": "en_US", "type": "article", "title": "Groundbreaking New Study: 42% of Drug Reactions are Vaccine Related", "description": "A new study testing the safety of common pharmaceuticals revealed that nearly half of all adverse drug reactions in Shanghai were caused by vaccines.", "url": "https://naturalsociety.com/43-drug-reactions-vaccine-related-groundbreaking-new-study/", "site_name": "Natural Society", "article:tag": "vaccines", "article:section": "Featured", "article:published_time": "2014-04-14T04:46:30+00:00", "article:modified_time": "2021-11-03T22:07:12+00:00", "updated_time": "2021-11-03T18:07:12-04:00", "image": "https://naturalsociety.com/app/uploads/2014/04/vaccine_china_drug_reactions.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2014/04/vaccine_china_drug_reactions.jpg", "image:width": "575", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3933652/", "http://www.greenmedinfo.com/blog/42-drug-reactions-are-vaccine-related-groundbreaking-chinese-study-finds", "https://naturalsociety.com/publicized-study-vaccination-schedule-bombshell/", "http://www.ncbi.nlm.nih.gov/pubmed/9555760", "http://www.havingababyinchina.com/reference/vaccine-schedule-china/", "https://www.cdc.gov/vaccines/schedules/hcp/child-adolescent.html#printable", "https://naturalsociety.com/suppressed-study-shows-vaccine-dangers-autoimmune-diseases/", "http://kellybroganmd.com/", "http://www.greenmedinfo.com/blog/hidden-connection-behind-viruses-vaccines-and-cancer"], "authors": ["Christina Sarich"], "publish_date": "2014-04-14T04:46:30+00:00"}