{"result_id": "216028", "URL": "https://naturalsociety.com/30-jump-autism-rate-begs-chemical-reform/", "timestamp": "2023-04-25 16:31:56 CEST+0200", "meta": {"description": "Researchers agree that environmental exposure to a number of toxins creates a stew of gene-altering mechanisms in the body, increasing the risk of autism.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/30-jump-autism-rate-begs-chemical-reform/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Autism Rates Jump 30% in 2 Years, Begs for Toxic Chemical Reform", "cleaned_text": "It isn’t just children with symptoms on the Autism Spectrum. Many older individuals also struggle with intellectual disability and emotional outbursts, as well as difficulty suppressing urges. Autism Spectrum Disorder (ASD) can cause lifelong challenges, and the Centers for Disease Control and Prevention (CDC) released a telling bit of data. Autism rates have risen 30% in the last 2 years, with 1 in 68 children now suffering from ASD, part of the continuing, perplexing rise in the syndrome.\n\nThough the study was conducted in 2010, the CDC released Prevalence of Autism Spectrum Disorder Among Children Aged 8 Years — Autism and Developmental Disabilities Monitoring Network, 11 Sites, United States, 2010, in late March of this year. In just the past two years, the likelihood that a child will be diagnosed with ASD has increased an incredible 30%.\n\nThere are numerous possible causes of autism – among them are the health of an older father’s DNA, vaccines, and of course, environmental toxins such as pesticides and herbicides, or even household chemicals that can cause a disruption in gene development.\n\nScientific American recently published an article describing this issue. The lead scientist of the study, Irva Hertz-Picciotto, an epidemiology professor at University of California, stated:\n\nOver 3000 new cases of autism were reported just last year. Scientists essentially have had to unravel the mystery of what could be causing these increases, and there are just a few factors that have changed since the 1990s when Autism cases started to spike. Some have argued that the trend is artificial, due in part to more frequent diagnoses, not actual changes in the number of those with ASD. However, Hertz-Picciotto and Lora Delwiche analyzed 17 years of state data that tracks developmental disabilities, and used birth records and Census Bureau data to calculate the rate of autism and age of diagnosis.\n\nUnless, of course, individuals are exposed to an onslaught of herbicides, pesticides, and corporate chemicals including aluminum, barium, thimerosal (mercury), BPAs, etc. As chemical exposures have greatly increased, this can lead to de novo genetic mutations. These mutations arise spontaneously in the parents’ reproductive cells due to events such as random errors in DNA replication or environmental exposures that alter DNA.\n\nWhile we don’t know exactly what causes autism, the huge jump in cases begs for better pesticide and chemical reform. Researchers agree that environmental exposure to a number of toxins creates a ‘stew’ of gene-altering mechanisms in the body, increasing the risk of autism.\n\nEnvironmental exposure to chemicals can play a huge role in autism, yet most remain untested. Currently, there are more than 3000 high-production volume chemicals being used in our world today, and pregnant women are exposed to them daily. It is no wonder that autism rates are skyrocketing. Congress needs to act immediately to address the toxic dangers in our environment. An entire generation of individuals’ health is at stake.", "opengraph": {"locale": "en_US", "type": "article", "title": "Autism Rates Jump 30% in 2 Years, Begs for Toxic Chemical Reform", "description": "Researchers agree that environmental exposure to a number of toxins creates a stew of gene-altering mechanisms in the body, increasing the risk of autism.", "url": "https://naturalsociety.com/30-jump-autism-rate-begs-chemical-reform/", "site_name": "Natural Society", "article:tag": "toxins", "article:section": "General Health", "article:published_time": "2014-04-13T18:44:47+00:00", "article:modified_time": "2021-11-03T22:19:24+00:00", "updated_time": "2021-11-03T18:19:24-04:00", "image": "https://naturalsociety.com/app/uploads/2014/04/kid_child_autism.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2014/04/kid_child_autism.jpg", "image:width": "575", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/mmwr/preview/mmwrhtml/ss6302a1.htm?s_cid=ss6302a1_w", "http://www.scientificamerican.com/article/autism-rise-driven-by-environment/", "https://naturalsociety.com/harvard-says-adhd-autism-caused-fluoridated-water/", "http://www.autismspeaks.org/science/science-news/top-ten-lists/2012/hundreds-tiny-mutations-linked-autism", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3114825/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3404662/", "http://ecowatch.com/2014/04/09/autism-rates-greater-urgency-toxic-chemical-reform/"], "authors": ["Christina Sarich"], "publish_date": "2014-04-13T18:44:47+00:00"}