{"result_id": "216037", "URL": "https://naturalsociety.com/ebola-outbreak-caused-new-strain-never-seen/", "timestamp": "2023-04-25 16:32:01 CEST+0200", "meta": {"description": "Virologists say that the current Ebola strain appears to be far worse than any strain seen previously. So where did it come from?", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/ebola-outbreak-caused-new-strain-never-seen/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Ebola Outbreak Caused By New Strain Never Before Seen", "cleaned_text": "The Ebola virus has caused fear of outbreaks in the US amid its devastation of Africa. Turns out, the virus is a totally different, potentially more lethal strain than any other Ebola virus seen before, according to noted infectious disease experts.\n\nVirologists are saying that the current Ebola strain appears to be far worse than any previous strain and it is not one that scientists have seen previously. So where did it come from?\n\nDr. Michael Osterholm, the head of the Center for Infection Disease Research and Policy at the University of Minnesota, reported that top Ebola virologist Gary Kobinger said that “the current Ebola strain appears to be far worse than any previous strain” and that “the current strain could more easily be spread through aerosols than those previously identified.”\n\nOsterholm, exposing comments for the world that he previously made at a speech at Johns Hopkins Bloomberg School of Public Health, (in a video clip that can be seen below), said:\n\n“Gary Kobinger and colleagues at Winnipeg — the Canadian National Lab — actually took one of the [Ebola] strains from Guinea and put it into macaques [monkeys in early September – What they saw was remarkable. It was unlike any of the Ebola viruses they’ve seen in monkeys. It was much, much more severe; the pathology in the lungs was remarkable, and, as Gary said — who is one of the most prominent Ebola virologists in the world — Maybe this is a different virus.”\n\nOsterholm doesn’t want to cause undue panic, but rather, wants to motivate policymakers to come up with a “Plan B” should the virus at some point mutate and become airborne, like the common influenza virus. Especially since flu season is just around the corner, and the US is expecting record low temperatures again this winter.\n\nNIH: Vaccinate the Whole Country with an Experimental Ebola Vaccine\n\nAnother top virologist, Peter Jahrling, chief scientist at the National Institute of Allergy and Infectious Diseases, also has concern because:\n\nBack in April of this year and only a few months after the outbreak began in West Africa, 30 scientists and researchers published a report in the New England Journal of Medicine stating that the current strain of the virus did not come from Central Africa, but was instead a new strain.\n\nWhen you add to these scientific concerns, the alarm of Paul Craig Roberts, former Reagan Administration Treasury official, and syndicated columnist, who has stated that Obama’s response to the epidemic of sending 4000 troops to a disease-ravaged country is – ‘peculiar’ – one might want to consider the true purpose for the deployment. Could it be to test an experimental vaccine on a new airborne strain of Ebola?", "opengraph": {"locale": "en_US", "type": "article", "title": "Ebola Outbreak Caused By New Strain Never Before Seen", "description": "Virologists say that the current Ebola strain appears to be far worse than any strain seen previously. So where did it come from?", "url": "https://naturalsociety.com/ebola-outbreak-caused-new-strain-never-seen/", "site_name": "Natural Society", "article:tag": "viruses", "article:section": "Featured", "article:published_time": "2014-11-15T07:47:11+00:00", "article:modified_time": "2021-12-13T17:06:10+00:00", "updated_time": "2021-12-13T12:06:10-05:00", "image": "https://naturalsociety.com/app/uploads/2014/11/ebola_dark_735.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2014/11/ebola_dark_735.jpg", "image:width": "735", "image:height": "460", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"//www.youtube.com/embed/UkMKUa0sxBQ\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/UkMKUa0sxBQ"}], "links": ["https://naturalsociety.com/nih-united-states-experimental-ebola-vaccine/", "http://www.vox.com/2014/10/13/6959087/ebola-outbreak-virus-mutated-airborne", "http://www.ncbi.nlm.nih.gov/pubmed/24738640", "http://uk.reuters.com/article/2014/04/17/us-guinea-ebola-idUKBREA3G11W20140417"], "authors": ["Christina Sarich"], "publish_date": "2014-11-15T07:47:11+00:00"}