{"result_id": "216005", "URL": "https://naturalsociety.com/md-vitamin-c-whooping-cough-treatment-ignored/", "timestamp": "2023-04-25 16:31:34 CEST+0200", "meta": {"description": "Dr. Suzanne Humphreys, MD. is sounding some alarms regarding whooping cough treatment. “Why is nobody mentioning vitamin C in whooping cough?”", "lang": "en", "keywords": "", "favicon": "https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/md-vitamin-c-whooping-cough-treatment-ignored/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Doctor Wonders Why Vitamin C for Whooping Cough Treatment is Ignored", "cleaned_text": "A doctor whom I greatly admire because she didn’t just step out of the medical monopoly matrix, she jumped out of it – Dr. Suzanne Humphreys, MD. is sounding some alarms regarding whooping cough treatment. She is now a homeopath and holistic health counselor and in the wake of a rash of whooping cough incidents, she raised the question, “Why is nobody mentioning vitamin C in whooping cough”?\n\nDr. Humphries covers a history of vitamin C used to rapidly heal whooping cough, a history that was not uncommon before the rash of antibiotics and vaccines popped in.\n\nEven low dose vitamin C shortened the duration and intensity of pertussis in all the examples Dr. Humphries cited, as well as with her own cases of administering vitamin C for whooping cough treatment.\n\nMainstream medicine prefers to use antibiotics, however, which all have nasty side effects, and can destroy the probiotic intestinal bacteria needed for digestion and immunity. The destruction of this intestinal flora can result in obesity, mental illness, and diabetes. And antibiotics used for whooping cough treatment can lead to Clostridium difficile or C. diff, which produces inflammatory colitis type symptoms for months. If not halted by other antibiotics or treated in another way , it can lead to death. Of course the antibiotics lead to even more damage in a different form.\n\nBut there is one more intervention for treating the C-diff before death relieves the patient of his or her misery: Fecal transplants. Yes, human poop from a donor is filtered, mixed into a saline solution, and fed orally through a tube into the stomach. It seems that if you develop protracted c-diff from the antibiotic given for pertussis, you you just be guided to a to poop transplants.\n\nThis is getting disgusting and desperate, considering the simple vitamin C solutions available. Despite all the attempts to deny its efficacy by mainstream allopathic medicine, high dose vitamin C works wonders for pertussis.\n\nIf the bowel tolerance is too limiting, IV (intravenous) mega-dose C is even more magical. It works wonders for a myriad of infectious diseases, as well as cancer and radiation poisoning. But thanks to the AMA and FDA, et al, such treatments are difficult to find and not covered by most insurance carriers.\n\nCountering the financial and accessibility limitations for mega-dose IV vitamin C, a new form of oral vitamin C has been developed that is accessible and affordable while matching the efficacy of IV C. It’s a liposomal encapsulated vitamin C called Lypo-Spheric C. You can even make your own liposomal C at home.", "opengraph": {"locale": "en_US", "type": "article", "title": "Doctor Wonders Why Vitamin C for Whooping Cough Treatment is Ignored", "description": "Dr. Suzanne Humphreys, MD. is sounding some alarms regarding whooping cough treatment. “Why is nobody mentioning vitamin C in whooping cough?”", "url": "https://naturalsociety.com/md-vitamin-c-whooping-cough-treatment-ignored/", "site_name": "Natural Society", "article:tag": "Whooping Cough", "article:section": "General Health", "article:published_time": "2012-09-24T09:17:41+00:00", "article:modified_time": "2021-08-27T00:23:05+00:00", "updated_time": "2021-08-26T20:23:05-04:00", "image": "https://naturalsociety.com/app/uploads/2021/02/fallback-featured.png", "image:secure_url": "https://naturalsociety.com/app/uploads/2021/02/fallback-featured.png", "image:width": "730", "image:height": "288", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.livonlabs.com/", "https://www.quantumbalancing.com/liposomalC.htm", "https://www.greenmedinfo.com/blog/why-nobody-studying-vitamin-c-whooping-cough?utm_source=www.GreenMedInfo.com&utm_campaign=0d48924900-Greenmedinfo&utm_medium=email", "https://www.greenmedinfo.com/blog/why-whooping-cough-vaccine-does-not-work-advertised", "https://drsuzanne.net/", "https://www.beyondconformity.org.nz/_blog/Hilary%27s_Desk/post/Whooping_cough_What_is_it_that_they_don%27t_get_about_fail/"], "authors": ["Paul Fassa"], "publish_date": "2012-09-24T09:17:41+00:00"}