{"result_id": "216023", "URL": "https://naturalsociety.com/theyre-telling-natural-ways-fight-ebola/", "timestamp": "2023-04-25 16:31:52 CEST+0200", "meta": {"description": "The CDC and mainline medical establishment are ignoring these 4 key natural ways that show promise in inhibiting and even treating Ebola.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/theyre-telling-natural-ways-fight-ebola/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "What They're Not Telling You: 4 Natural Ways to Fight Ebola", "cleaned_text": "Amid the mainstream media hype surrounding Ebola, it may come as major shock to discover that for quite some time there have been major scientific breakthroughs regarding the numerous ways in which we may be able to diminish or even halt the virus at a base level.\n\nWhat’s even more powerful and of note, however, is the substances by which scientists were able to exhibit these effects. Numerous plant compounds, which also come with a host of additional medicinal benefits outside of their role in the fight against the Ebola virus, have been documented to have extreme promise in the deterrence of yet another virus epidemic.\n\nBut as the world waits for Bill & Melinda Gates to unveil their latest Ebola vaccine news to the world, there is simply no mention of these powerful substances that may hold promise (and be extremely inexpensive to get a hold of international) in the fight for our immunity.\n\nDespite the complete lack of attention, such research is not hidden within the confides of University laboratories and libraries. Instead, it is available to the public and simply requires some research within the National Library of Medicine, its user portal PubMed, and a little bit of reading.\n\nAn organic compound found primarily in soy products, genistein has shown much promise when combined with fellow kinase inhibitor tyrphostin AG1478.\n\nA 2011 research paper in the journal Archives of Virology entitled, “Inhibition of Lassa virus and Ebola virus infection in host cells treated with the kinase inhibitors genistein and tyrphostin,” details the pair’s therapeutic role in reducing the severity of hemorrhagic fever.\n\nThe authors, which include researchers from the University of Texas Medical Branch, also reference a previous animal study which shows genistein’s ability to reduce harm from Pichinde ́virus (PICV), an Ebola-like virus that also causes hemorrhagic fever.\n\nWhen administered to hamsters, the following results were reported:\n\nAlthough genistein and tyrophostin individually inhibited the entry of these viruses into the cells, together they were able to interfere with endocytosis (the process by which a cell pulls in a virus) and uncoating proteins (the process by which a virus alters proteins on the surface of the host cell to gain entry) while also producing a synergistic effect.\n\n“In all, these data demonstrate that infection of host cells with the filoviruses MARV and EBOV and the arenavirus LASV is inhibited when cells are pretreated with genistein or tyrphostin AG1478. In both cases, the inhibition was found to be concentration dependent. Although the inhibition of EBOV in cells pre-treated with 100 lM genistein appeared to differ slightly, the addition of increasing concentrations of tyrphostin AG1478 led to a synergistic antiviral effect. In all, these data demonstrate that a kinase inhibitor cocktail consisting of genistein and tyrphostin AG1478 may act as a broad antiviral against EBOV, MARV, and LASV in vitro.”\n\nSources of genistein include ferment soy foods, wherein beneficial microbes cause the biotransformation of the precursor phytocompund genistin into genistein, as well as fava beans, kudzu, coffee, and red clover.\n\nA tree found throughout Western Africa, Garcinia kola has been found to “inhibit the Ebola virus in cell culture at non-toxic concentrations.”\n\nA 1999 report from Maurice Iwu, executive director of the Bio-resources Development and Conservation Programme, notes the vital role of the tree’s seeds in battling the virus.\n\n“Extracts from Garcinia kola seeds were tested against many complex viral diseases. The active compound, now known to be a biflavonoid, was found to be active against a wide range of viruses including the influenza virus. In all cases, the active concentration was less than 10 times the known minimum toxic concentration. Iwu says: “This gives us a very wide window of opportunity for drug development. We will be able to modify the effective compound with less likelihood of introducing unacceptable toxicity.”\n\nThe extract also caught the attention of John Huggins, a virus expert with the US Army Medical Research Institutes of Infective Diseases, who hailed the compound for passing the first stage of testing with “flying colors.”\n\nResearch from the late Dr Robert Cathcart, MD, who had extensive experience treating deadly infections with high dose vitamin C, asserted that the Ebola virus could be “neutralized by massive doses of sodium ascorbate intravenously.”\n\nAccording to Cathcart, symptoms produced by the virus are nearly identical to acute scurvy, a disease that produces bleeding all over the body when levels of vitamin C become depleted.\n\nCoupled with its antiviral properties, regular use of vitamin C can boost the immune system to better prepare the body for harmful pathogens.\n\nA hormone and steroid produced by woman, estradiol was found to exhibit anti-Ebola virus activity in vitro, indicating the relevance of hormonal factors and perhaps gender in susceptibility to the disease.\n\nA 2013 analysis entitled, “A systematic screen of FDA-approved drugs for inhibitors of biological threat agents,” detailed the findings:", "opengraph": {"locale": "en_US", "type": "article", "title": "What They're Not Telling You: 4 Natural Ways to Fight Ebola", "description": "The CDC and mainline medical establishment are ignoring these 4 key natural ways that show promise in inhibiting and even treating Ebola.", "url": "https://naturalsociety.com/theyre-telling-natural-ways-fight-ebola/", "site_name": "Natural Society", "article:tag": "natural", "article:section": "Disease Research", "article:published_time": "2014-10-10T16:14:36+00:00", "article:modified_time": "2022-08-05T20:22:58+00:00", "updated_time": "2022-08-05T16:22:58-04:00", "image": "https://naturalsociety.com/app/uploads/2014/10/ebola_virus_orange_vitamin_c.png", "image:secure_url": "https://naturalsociety.com/app/uploads/2014/10/ebola_virus_orange_vitamin_c.png", "image:width": "575", "image:height": "360", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.ncbi.nlm.nih.gov/pubmed/21947546", "https://naturalsociety.com/nurses-unprepared-handle-ebola-patients/", "http://www.timeshighereducation.co.uk/news/a-folk-remedy-for-killer-ebola/148114.article", "http://vitamincfoundation.org/www.orthomed.com/ebola.htm", "https://naturalsociety.com/ebola-scare-manage-worst-case-scenario-using-vitamin-c/", "http://www.greenmedinfo.com/blog/200-reasons-love-vitamin-c1", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3618516/", "http://www.ncbi.nlm.nih.gov/pubmed/23785035"], "authors": ["Natural Society"], "publish_date": "2014-10-10T16:14:36+00:00"}