{"result_id": "216024", "URL": "https://naturalsociety.com/drug-companies-donated-millions-to-california-lawmakers-prior-to-forced-vaccination-bill/", "timestamp": "2023-04-25 16:31:53 CEST+0200", "meta": {"description": "California lawmakers passed a mandatory vaccine bill (SB277) which removes parental exemptions - making it so parents couldn't refuse or delay vaccines.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/drug-companies-donated-millions-to-california-lawmakers-prior-to-forced-vaccination-bill/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Drug Companies Donated Millions to California Lawmakers Prior to Forced Vaccination Bill", "cleaned_text": "One in 50 children are now autistic. No, you didn’t read that wrong. Despite the fact that a CDC whistleblower recently came forward admitting that the government agency obfuscated evidence linking vaccines to autistic behavior, California lawmakers passed a mandatory vaccine bill (SB277) which removes parental exemptions – making it so parents couldn’t refuse or delay vaccines. Even more damning evidence has surfaced proving that Big Pharma had their hands in the creation of the bill.\n\nThe Sacramento Bee is reporting that State lawmakers behind bill SB277 have ties to the makers of vaccines. Pharmaceutical companies and their trade groups gave current members of the Legislature more than $2 million. Nine of the top 20 recipients of these funds are either members of the Senate health committee, or leaders who could influence the outcome of the bill, as well as push it through to law.\n\nOne senator, in particular, is also a doctor, Richard Pan, who received more than $95,000 in campaign cash. He also just happens to be the man who wrote the bill.\n\nAs if that weren’t bad enough, Big Pharma also donated more than $500,000 to outside campaign spending groups that helped some of these top nine individuals be elected to their current legislative positions.\n\nFurthermore, pharmaceutical companies contributed nearly $3 million in additional cash to the 2013-2014 legislative session lobbying, among these representatives, the state pharmacists’ board, and other agencies – who could also sway the outcome of SB277 – for mandatory vaccines.\n\nDr. or Senator Pan, whichever title you choose, is an ‘industry insider’ with far-reaching influence. He has been a teaching faculty member at UC Davis Children’s Hospital, and served many organizations which determine medical funding.\n\nWhile he has flip-flopped on the vaccine issue in the past, previously introducing a bill which would have required parents to get their doctor’s approval to refuse a vaccine for their child, he recently said that the Disney measles episode, argued by some to be a false flag, was reason enough to promote forced vaccinations ‘for public health.’\n\nThousands of people are now calling for the resignation of Dr. Pan for obvious conflict of interest, and a recall of the bill which caused massive protests in California before legislators voted it into law.\n\nA petition has also been started with the same intent:\n\nThe petition was already delivered on June 9th, and had gained 9000 signatures in just days of its posting. A Voice for Choice stated:\n\n“To the Honorable Governor and Legislature of the State of California, We, the undersigned people of California, are writing in regards to the unquestionably unconstitutional Senate Bills 277 and 792, and Assembly Bill 1117. It shocks the conscience to consider that there are Senators and Assembly Members who deem it within their province to utterly annihilate fundamental rights that all of the members of the California Legislature swore to uphold. A vote in contravention of the knowledge that SB 277, SB 792, and AB 1117 are clearly incomprehensible under both the United States and California constitutional laws, and in cognizance of the fact that despite the fact that vaccines cause demonstrable injuries, and yet under California laws, doctors and manufacturers remain completely immune from liability, is an attestation to the fact that you are mandating a medical procedure for all children, as well as for adults working as preschool and child care workers, without even a glimmer of choice. If you feel comfortable making that decision, knowing full well the potential ramifications of such a vote, then we see no reason why you would not agree to be held personally responsible, both morally and financially, should any subsequent vaccine injuries or deaths occur. We are strongly opposed to SB 277, SB 792, and AB 1117 and demand that you vote against these bills. America is a Constitutional Republic and the Supreme Law of this Republic guarantees under Article IV, Section 4, a republican form of government for every state. In the best interests of the People, businesses and industries of California, and to protect them from economic devastation and bodily harm, the government of California will vote “No” on SB277, SB792, and AB1117. These bills violate the U.S. Constitution, in particular, the 1st, 5th, and 14th Amendments; and the California Constitution, in particular, Article 9; as well as the California Education Code, by which all children are to be afforded a free public education. There is no compelling state interest to deny children in California the right to a public education. And according to the California Department of Public Health, “[v]accination coverage in California is at or near all-time high levels.”\n\nThe document continues to outline how California legislators are going against Constitutional law.\n\nA press conference in Berkeley, California will also be held on Monday, June 22 at 11:00 a.m. to address “the unconstitutional aspects of SB 277 as well as informing about the Consumer Protection Amendment in English, Spanish, and Russian.” Details here.", "opengraph": {"locale": "en_US", "type": "article", "title": "Drug Companies Donated Millions to California Lawmakers Prior to Forced Vaccination Bill", "description": "California lawmakers passed a mandatory vaccine bill (SB277) which removes parental exemptions - making it so parents couldn't refuse or delay vaccines.", "url": "https://naturalsociety.com/drug-companies-donated-millions-to-california-lawmakers-prior-to-forced-vaccination-bill/", "site_name": "Natural Society", "article:tag": "vaccines", "article:section": "Featured", "article:published_time": "2015-06-21T12:36:23+00:00", "article:modified_time": "2021-10-20T16:15:05+00:00", "updated_time": "2021-10-20T12:15:05-04:00", "image": "https://naturalsociety.com/app/uploads/2015/02/vaccine_vial_need_scale_w_735_350.png", "image:secure_url": "https://naturalsociety.com/app/uploads/2015/02/vaccine_vial_need_scale_w_735_350.png", "image:width": "735", "image:height": "350", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/6gilUVOr8co\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/6gilUVOr8co"}], "links": ["http://healthimpactnews.com/2014/cdc-autism-scandal-tsunami-of-anger-is-brewing-and-about-to-explode/", "https://www.sacbee.com/news/politics-government/capitol-alert/article24913978.html", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201520160SB277", "https://naturalsociety.com/california-parents-voice-resounding-no-to-forced-vaccines/", "http://avoiceforchoice.org/petition/", "https://naturalsociety.com/australia-enforces-15k-penalty-for-parents-who-dont-vaccinate/", "https://www.cdph.ca.gov/programs/immunize/Documents/HowisCA(11-14).pdf"], "authors": ["Christina Sarich"], "publish_date": "2015-06-21T12:36:23+00:00"}