{"result_id": "216004", "URL": "https://naturalsociety.com/glaxosmithkline-forced-to-pay-3-billion-over-faking-research/", "timestamp": "2023-04-25 16:31:33 CEST+0200", "meta": {"description": "British pharmaceutical behemoth GlaxoSmithKline, however, made headlines when they pled guilty to three criminal charges.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/glaxosmithkline-forced-to-pay-3-billion-over-faking-research/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "GlaxoSmithKline Forced to Pay $3 Billion Over Faking Research, Bribing Doctors", "cleaned_text": "It’s not often that we get an express and unequivocal admission of criminal behavior from Big Pharma. British pharmaceutical behemoth GlaxoSmithKline, however, made headlines when they pled guilty to three criminal charges. They settled to pay $1 billion in criminal fines and $2 billion in civil fines. This settlement surpasses the $2.3 billion Pfizer agreed to pay in 2009 for inappropriately marketing 13 drugs.\n\n“[This] is unprecedented in both size and scope,” said James Cole, the US Deputy Attorney General.\n\nThe charges against GSK include marketing the antidepressant Paxil to minors when it was only approved for adults. In fact, in 2003, the FDA warned against Paxil administration to teens and youth due to a heightened risk of suicide.\n\nGSK also promoted Wellbutrin for unapproved uses like weight loss and sexual dysfunction. The Justice Department’s criminal information files even state that “GSK sales representatives sometimes referred to Wellbutrin as ‘the happy, horny, skinny pill’ when touting its unapproved uses.”\n\nThe third drug in question, the diabetes drug Avandia, had safety issues that went illegally unreported to the US Food and Drug Administration. GSK pled guilty to these three misdemeanor criminal counts.\n\nSince the late 1990s, GSK has been sending doctors to spas, expensive restaurants, and vacations to Hawaii in order to promote their drugs (such as the three in question). According to US attorney Carmin Ortiz, they even paid millions of dollars for doctors to go on speaking tours and bought them tickets to Madonna concerts.\n\nGlaxo CEO Sir Andrew Witty (who was, ironically, knighted in 2012 for services to the economy and the UK pharmaceutical industry) promised to rectify the problems. “On behalf of GSK, I want to express or regret and reiterate that we have learnt from the mistakes that were made.”\n\nSnaky, corporate types don’t pay for their misdeeds as often as we’d like. (We were happy to report that Monsanto coughed up $93 million to victims of their herbicides earlier this year.) GSK’s unprecedented fines, however, might at least help to spread word to the masses of the indecent behaviors of such companies, and maybe even send a warning that not even Big Pharma is impervious to the justice system.", "opengraph": {"locale": "en_US", "type": "article", "title": "GlaxoSmithKline Forced to Pay $3 Billion Over Faking Research, Bribing Doctors", "description": "British pharmaceutical behemoth GlaxoSmithKline, however, made headlines when they pled guilty to three criminal charges.", "url": "https://naturalsociety.com/glaxosmithkline-forced-to-pay-3-billion-over-faking-research/", "site_name": "Natural Society", "article:tag": "Pharmaceutical Industry", "article:section": "Featured", "article:published_time": "2012-07-03T10:48:52+00:00", "article:modified_time": "2021-02-24T06:19:04+00:00", "updated_time": "2021-02-24T01:19:04-05:00", "image": "https://naturalsociety.com/app/uploads/2021/02/fallback-featured.png", "image:secure_url": "https://naturalsociety.com/app/uploads/2021/02/fallback-featured.png", "image:width": "730", "image:height": "288", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://naturalsociety.com/monsanto-pays-93-million-to-victims-in-settlement/", "http://www.guardian.co.uk/business/2012/jul/02/glaxosmithkline-drug-fraud?newsfeed=true", "http://www.npr.org/blogs/health/2012/07/02/156116607/glaxo-pleads-guilty-to-3-charges-in-sweeping-health-settlement"], "authors": ["Lisa Garber"], "publish_date": "2012-07-03T10:48:52+00:00"}