{"result_id": "216013", "URL": "https://naturalsociety.com/brain-damaged-victims-of-swine-flu-vaccine-win-63-million-lawsuit/", "timestamp": "2023-04-25 16:31:45 CEST+0200", "meta": {"description": "GlaxoSmithKline again has to settle another major lawsuit, bringing the latest total to over $9.1 billion since 2003. This one involves Pandemrix.", "lang": "en", "keywords": "", "favicon": "https://sp-ao.shortpixel.ai/client/to_auto,q_glossy,ret_img,w_32,h_32/https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/brain-damaged-victims-of-swine-flu-vaccine-win-63-million-lawsuit/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Brain-Damaged Victims of Swine Flu Vaccine Win $63 Million Lawsuit", "cleaned_text": "GlaxoSmithKline (GSK) is in the news again making headlines after having to settle another major lawsuit bringing the latest total to over $9.1 billion since 2003. This time, it is due to GSK’s product Pandemrix, which was the swine flu vaccine forced upon the public during the pandemic of 2009 (which is argued by some to have been fake). As the victims are being compensated in the U.K., the same neurological mechanisms that damaged the children in the lawsuit are still potentially at work in the confirmed excitotoxicity that takes place after many vaccine injections.\n\nAccording to the International Business Times U.K. Edition, each of the victims is “expected to receive £1 million each.” Peter Todd, a lawyer who represented many of the claimants, told the Sunday Times (U.K.):\n\nUnfortunately for Peter Todd and the countless other victims, there has been cases like this before. Neurological damage from vaccines is not a rare occurrence. In fact, the U.S. government has paid out $3 billion and counting to families of vaccine-injured children. Most of which were due to direct neurological damage or complications arising from such damage.\n\nAccording to The Global Research Project, the GlaxoSmithKline rap sheet states:\n\n“In recent years, GlaxoSmithKline has become known as the company that pays massive amounts to resolve wide-ranging charges brought by U.S. regulators and prosecutors. These included a $750 million payment relating to the sale of adulterated products from a facility in Puerto Rico and a record $3 billion in connection with charges relating to illegal marketing, suppression of adverse safety research results and overcharging government customers. The company also set a record for the largest tax avoidance settlement with the U.S. Internal Revenue Service.”\n\nIf GlaxoSmithKline wasn’t afforded legal and financial government protection status, they would have went under years ago. However, this corporate zombie still damages populations with little oversight and deep pockets to pay for any legal or ethical challenges that get in the way.\n\nCurrently, GlaxoSmithKline, Merck, and other pharmaceutical houses were influential in the attempted passing of California Senate Bill 277 to remove the “parental opposition” that was slowing their product’s revenue stream. What wasn’t disclosed during the senate hearing, or vote following, was that the bill’s author Richard Pan had financial ties to GlaxoSmithKline and Merck.\n\nIn a fair legal system, this should immediately disqualify the bill and bring serious moral and ethical challenges to Pan’s legitimacy. Fortunately, due to an onslaught of parents and other citizens, SB277 is currently stalled leaving Richard Pan with lots of explaining and little integrity to fall back on.", "opengraph": {"locale": "en_US", "type": "article", "title": "Brain-Damaged Victims of Swine Flu Vaccine Win $63 Million Lawsuit", "description": "GlaxoSmithKline again has to settle another major lawsuit, bringing the latest total to over $9.1 billion since 2003. This one involves Pandemrix.", "url": "https://naturalsociety.com/brain-damaged-victims-of-swine-flu-vaccine-win-63-million-lawsuit/", "site_name": "Natural Society", "article:tag": "vaccines", "article:section": "Featured", "article:published_time": "2015-04-16T06:59:37+00:00", "article:modified_time": "2021-10-19T00:49:03+00:00", "updated_time": "2021-10-18T20:49:03-04:00", "image": "https://naturalsociety.com/app/uploads/2015/04/vaccination-against-swine-flu-now_735_350.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2015/04/vaccination-against-swine-flu-now_735_350.jpg", "image:width": "735", "image:height": "350", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/flu/pandemic-resources/2009-h1n1-pandemic.html", "http://www.ibtimes.co.uk/brain-damaged-uk-victims-swine-flu-vaccine-get-60-million-compensation-1438572", "http://www.corp-research.org/glaxosmithkline", "https://naturalsociety.com/gsk-swine-flu-shot-sparks-another-case-life-threatening-narcolepsy/", "https://www.sacbee.com/news/politics-government/capitol-alert/article24913978.html", "http://www.ibtimes.co.uk/brain-damaged-uk-victims-swine-flu-vaccine-get-60-million-compensation-1438572"], "authors": ["Jefferey Jaxen"], "publish_date": "2015-04-16T06:59:37+00:00"}