{"result_id": "216019", "URL": "https://naturalsociety.com/4-herbs-need-medicine-cabinet/", "timestamp": "2023-04-25 16:31:49 CEST+0200", "meta": {"description": "We have chosen 4 healing herbs everyone should have in their 'medicine' cabinet. These herbs should be the cornerstones of every natural healer’s arsenal.", "lang": "en", "keywords": "", "favicon": "https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/4-herbs-need-medicine-cabinet/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "4 Herbs Everyone Should Have in their ‘Medicine’ Cabinet", "cleaned_text": "There are perhaps hundreds, or at least dozens of medicinal foods and herbs that deserve a place in your kitchen’s herbal medicine cabinet. But for someone who is just getting their feet wet in the world of herbalism and natural healing, collecting numerous herbs can be overwhelming. For that reason, we’ve chosen 4 healing herbs to get you started—herbs that should be the cornerstones of every natural healer’s arsenal.\n\nFrom calming upset stomachs to killing cancer cells, these 4 herbs have been shown time and time again to provide incredible healing powers.\n\nTurmeric has numerous health benefits and is easy to incorporate in your cooking. The spice can reduce inflammation, fight depression, cut heart disease and diabetes risk, and has been researched extensively for its ability to beat cancer. Scientists from around the world have found turmeric to positively impact over 581 different diseases and conditions. It is one of the most well-researched spices on the planet.\n\nWhile we commonly think of turmeric as the yellow spice in curries, you can reap it’s medicinal benefits in other ways as well. Golden milk tea or golden milk is one way people from the Middle East have taken turmeric for ages. Just make sure you know how to optimize turmeric absorption to reap the most benefits.\n\nLike turmeric, ginger is a root. Also like turmeric, the health benefits of ginger are amazing. The herb is particularly good at calming digestion, but can also fight cancer, inflammation, and boost your immune system. Ginger tea is an elixir that can be used for colds, sore throats, and upset stomach. Simply simmer some slivers of ginger in water for 5 minutes, cool slightly and drink. Add a little local honey to supercharge it’s benefits.\n\nIt’s not just for pizza; oregano has healing qualities that go far beyond its culinary allure. It’s loaded with vitamin K and manganese, and is packed-full of antioxidants and phytonutrients. Research has linked this culinary herb with weight loss, digestive health, combating foodborne pathogens and relieving pain.\n\nOregano is anti-bacterial, anti-fungal, and anti-inflammatory. You can grow your own oregano quite easily and then use it fresh or dried, or find oregano oil in health food stores.\n\nAnother culinary herb, basil has many health benefits as well. Its antibacterial properties make it a contender for fighting serious infections including listeria monocytogenes, staphylococcus aureus, and E. coli. The herbs high levels of the flavonoid zeaxanthin make it a great solution for protecting eye health and preventing age-related macular degeneration. Also like oregano, basil is easy to grow. Here are some other holy basil benefits.\n\nStarting a healing kitchen doesn’t have to be overwhelming. These four healing foods are a good place to start.", "opengraph": {"locale": "en_US", "type": "article", "title": "4 Herbs Everyone Should Have in their ‘Medicine’ Cabinet", "description": "We have chosen 4 healing herbs everyone should have in their 'medicine' cabinet. These herbs should be the cornerstones of every natural healer’s arsenal.", "url": "https://naturalsociety.com/4-herbs-need-medicine-cabinet/", "site_name": "Natural Society", "article:tag": "turmeric", "article:section": "Food as Medicine", "article:published_time": "2013-10-28T13:39:25+00:00", "article:modified_time": "2022-01-07T17:39:24+00:00", "updated_time": "2022-01-07T12:39:24-05:00", "image": "https://naturalsociety.com/app/uploads/2013/10/spices_spoons1.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2013/10/spices_spoons1.jpg", "image:width": "575", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ncbi.nlm.nih.gov/pubmed/23832433", "https://jn.nutrition.org/content/141/8/1451", "https://naturalsociety.com/turmeric/", "https://naturalsociety.com/turmeric-absorption-super-benefits-black-pepper/", "https://naturalsociety.com/benefits-of-ginger/", "https://naturalsociety.com/ginger-destroys-cancer-more-effectively-than-cancer-drugs/", "https://naturalsociety.com/oregano-benefits-growing-your-own-medicine/", "https://naturalsociety.com/holy-basil-benefits-growing-your-own-medicine/"], "authors": ["Elizabeth Renter"], "publish_date": "2013-10-28T13:39:25+00:00"}