{"result_id": "216009", "URL": "https://naturalsociety.com/top-10-worst-gmo-foods-list/", "timestamp": "2023-04-25 16:31:36 CEST+0200", "meta": {"description": "GMO foods pose a risk to humans, animals, and the environmental. Here are the top 10 worst GMO foods for your \"do not eat\" GMO foods list.", "lang": "en", "keywords": "", "favicon": "https://naturalsociety.com/app/uploads/2021/01/cropped-green-leaf-logo-symbol-large-white-512-512-9-32x32.png", "canonical": "https://naturalsociety.com/top-10-worst-gmo-foods-list/", "encoding": "UTF-8"}, "image": null, "domain": "naturalsociety.com", "title": "Top 10 Worst GMO Foods for Your GMO Foods List", "cleaned_text": "Genetically modified foods (GMO foods) have been shown to cause harm to humans, animals, and the environment, and despite growing opposition, more and more foods continue to be genetically altered. It’s important to note that steering clear of these foods completely may be difficult, and you should merely try to find other sources than your big chain grocer. If produce is certified USDA-organic, it’s non-GMO (or supposed to be!) Also, seek out local farmers and booths at farmer’s markets where you can be ensured that the crops aren’t GMO. Even better, if you are so inclined: Start organic gardening and grow them yourself. Until then, here are the top 10 worst GMO foods for your “do not eat” GMO foods list.\n\n\n\n One of the most prominent GMO foods, avoiding corn is a no-brainer. If you’ve watched any food documentary, you know corn is highly modified. “As many as half of all U.S. farms growing corn for Monsanto are using genetically modified corn,” and much of it is intended for human consumption. Monsanto’s GMO corn has been tied to numerous health issues, including weight gain and organ disruption.\n\nFound in tofu, vegetarian products, soybean oil, soy flour, and numerous other products, soy is also modified to resist herbicides. As of now, biotech giant Monsanto still has a tight grasp on the soybean market, with approximately 90 percent of soy being genetically engineered to resist Monsanto’s herbicide Roundup. In one single year, 2006, there was 96.7 million pounds of glyphosate sprayed on soybeans alone.\n\nAccording to NaturalNews, genetically-modified sugar beets were introduced to the U.S. market in 2009. Like others, they’ve been modified by Monsanto to resist herbicides. Monsanto has even had USDA and court-related issues with the planting of it’s sugarbeets, being ordered to remove seeds from the soil due to illegal approval.\n\nAspartame is a toxic additive used in numerous food products, and should be avoided for numerous reasons, including the fact that it is created with genetically modified bacteria.\n\nThis one may come as a surprise to all of you tropical-fruit lovers. GMO papayas have been grown in Hawaii for consumption since 1999. Though they can’t be sold to countries in the European Union, they are welcome with open arms in the U.S. and Canada.\n\nOne of the most chemically altered foods in the U.S. diet, canola oil is obtained from rapeseed through a series of chemical actions.\n\nFound in cotton oil, cotton originating in India and China in particular has serious risks.\n\nYour dairy products may contain growth hormones, since as many as one-fifth of all dairy cows in America are pumped with these hormones. In fact, Monasnto’s health-hazardous rBGH has been banned in 27 countries, but is still in most US cows. If you must drink milk, buy organic.\n\n\n\nClosely related, these two squash varieties are modified to resist viruses.\n\nThe dangers of some of these foods are well-known. The Bt toxin being used in GMO corn, for example, was recently detected in the blood of pregnant women and their babies. But perhaps more frightening are the risks that are still unknown. Even while these foods should be on your GMO foods list so that they are avoided, you can buy 100% organic to be safest.\n\nWith little regulation and safety tests performed by the companies doing the genetic modifications themselves, we have no way of knowing for certain what risks these lab-created foods pose to us outside of what we already know.\n\nThe best advice: steer clear of them altogether.", "opengraph": {"locale": "en_US", "type": "article", "title": "Top 10 Worst GMO Foods for Your GMO Foods List", "description": "GMO foods pose a risk to humans, animals, and the environmental. Here are the top 10 worst GMO foods for your \"do not eat\" GMO foods list.", "url": "https://naturalsociety.com/top-10-worst-gmo-foods-list/", "site_name": "Natural Society", "article:tag": "zucchini", "article:section": "General Health", "article:published_time": "2012-07-28T11:50:08+00:00", "article:modified_time": "2021-02-17T01:12:15+00:00", "updated_time": "2021-02-16T20:12:15-05:00", "image": "https://naturalsociety.com/app/uploads/2015/08/corn-crop-gmo-735-250.jpg", "image:secure_url": "https://naturalsociety.com/app/uploads/2015/08/corn-crop-gmo-735-250.jpg", "image:width": "735", "image:height": "250", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://naturalsociety.com/organic-gardening-101-how-to-start-an-organic-garden/", "https://naturalsociety.com/monsantos-gmo-corn-contributing-to-weight-gain-disrupts-organs/", "https://naturalsociety.com/banned-in-27-countries-monsanto-rbgh-dairy-milk-products/", "https://www.naturalnews.com/036063_GMOs_foods_infographics.html"], "authors": ["Elizabeth Renter"], "publish_date": "2012-07-28T11:50:08+00:00"}