{"result_id": "217028", "URL": "https://naturallysavvy.com/general/lisa-oz/", "timestamp": "2023-04-25 16:32:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/general/lisa-oz/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "An Interview with Lisa Oz | Naturally Savvy", "cleaned_text": "In 2008, I had the opportunity to meet Dr. Oz at an event that my company participated in called 'The Healthy Kids Expo'. He was super nice and personally met and took pictures with each person who came to hear him speak (pretty amazing). When it was my turn, I handed him a note on my NaturallySavvy.com letterhead – which at the time was in its infancy – asking him if I could interview his wife, Lisa, for our website. I often listened to her on The Dr. Oz Show show on Oprah Radio and loved her approach and holistic point-of-view. Fast forward three years, and I am happy to say I had the opportunity to interview Lisa Oz for our website this week. She is smart, laid-back and very much like you and me – a mom who wants to make the right choices for her family when it comes to living a healthy lifestyle. I hope you enjoy reading the interview as much as I enjoyed doing it.\n\nAndrea Donsky: Can you tell us how you became a Reiki Master?\n\nLisa Oz: I have always been very curious about different modalities of healing and alternative medicine. So one time I decided to go to a group Reiki session for a woman who had cancer and I thought, at the time, that it was the silliest thing I have ever seen – all those people surrounding her but not touching her.\n\nThe fact that I was even contemptuous of Reiki should have warned me that was where I was heading. In college, I remember thinking that the worst fate for anyone would be to become a housewife in NJ. Fast-forward 20 years later and that’s me!\n\nA little while after that Reiki session, a close friend of mine mentioned she was studying to become a Reiki Master. I really respected this woman so I asked her to tell me more about it. Then a week after I asked her, I was walking down the street and saw a homeless person being harassed by the police. I wished there was something I could do to help him on the spot — even energetically — and I immediately thought of Reiki. It was that afternoon that I signed up for my first Reiki session because I felt that the situation with the homeless man was Divine Intervention.\n\nAndrea Donsky: Now that you are a Reiki Master, do you work in the field or have a private practice?\n\nLisa Oz: Reiki is more of a personal interest for me and not a vocation. I do it all the time on my family and people I care about. It’s been really wild. I don’t completely understand how Reiki works (I’m not sure if many people do), but the results are amazing.\n\nAndrea Donsky: What lead you down that path of living a holistic lifestyle?\n\nLisa Oz: It has been such a big part of my life for so long that it is how I live. My mother is the one who introduced this way of living to our family. I come from a family of six kids and I remember one day my mom brought home a stack of books and we each took one. The book I chose was “Diet for a Small Planet (20th Anniversary Edition) ” and it blew me away. It had such an impact on me, that after reading it, five of us became vegetarian. That was over 30 years ago.\n\nMy mom was always very integrative in terms of how she dealt with us when it came to healthcare. When one of us had an earache, she would soak a cotton ball with garlic and olive oil and leave it in our ear overnight, she used colloidal silver, as well as homeopathic medicine. To be honest, there were more homeopathic remedies in the house I grew up in than conventional medicine. We were raised using all kinds of alternative modalities as kids. It was interesting because my dad was a cardiac surgeon, but he was very intrigued by the alternative. My mom dragged my dad from a conservative science background to a world that is much more open to other ways of healing.\n\nAndrea Donsky: The nice thing is that times are changing and people are becoming more open and accepting of an alternative way of living.\n\nLisa Oz: Yes. I remember telling people in the late 80’s that I was a vegetarian and they thought I was an alien.\n\nAndrea Donsky: How do/did you incorporate healthy eating into your family’s daily life?\n\nLisa Oz: I don’t love breakfast foods and when all four of my kids were living at home, three of the four of them inherited my anti-breakfast gene, so for most of their childhood we would have protein shakes for breakfast and call them ‘magic drinks’. I’d put in flax oil, bananas, protein powder, psyllium, spiriulina – to make them green, and a scoop of vitamin powder.\n\nAndrea Donsky: Can you give us some examples of how you’ve laid the foundation for your kids when it comes to living a naturally healthy lifestyle?\n\nLisa Oz: Our oldest daughter, Daphne, is on a daytime TV show on ABC called ‘The Chew’. Her co-hosts are Mario Batali, Carla Hall, Michael Symon and Clinton Kelly. She is the voice of the health conscious consumer and looks for vegetarian alternatives.\n\nMy second daughter came home from college this weekend and the first thing she said to me was “mom, can you get me my vitamins please?” so after I gave them to her, she said “this many!?!” And I said, “yes, this many!” I have this ongoing dance with my kids. For example, they will ask me if they got their all their essential fatty acids for the day and then they’ll complain about taking them. It’s funny.\n\n[NOTE] Andrea Donsky: I watched Daphne on You Tube and she is completely in line in what we at Naturally Savvy say … to read the labels and avoid the artificial stuff. Way to go Daphne!]\n\nAndrea Donsky: What types of opportunities and challenges do you encounter living with an M.D. since you are very much holistically focused? Do you feel you have influenced Dr. Oz in keeping an open mind when it comes to natural medicine?\n\nLisa Oz [Opportunities]: The amazing thing about Mehmet is that he is open to so many things. He genuinely wants to learn from people when he comes into contact with them and he makes me want to do the same. He is like a sponge. Living an alternative lifestyle is a way of life for us, so I am really happy that people are having access to this type of information. The choices people make, have a huge impact on how they live.\n\nAs for challenges, because I’m not a physician and medically trained, I am an early adapter when it comes to certain things. I am much more distrusting when it comes to industry. Where Mehmet and I really don’t agree is vaccines and GMO’s. I don’t understand why Europe has mandatory GMO labeling but we don’t and I also don’t think just because the healthcare industry says vaccines as safe that they are. I call it: Corporatocracy. Industry does not always have the best interest of its constituents at heart.\n\nAndrea Donsky: Do you have a healthy snack recipe to share with us?\n\nLisa Oz: We love kale. And one of our favorite recipes is to dehydrate kale in the oven sprinkled with some coconut oil and raw shredded coconuts. I love the cookbook: ‘Super Natural Every Day’ by Heidi Swanson. It has some great kale recipes in it.\n\nAndrea Donsky: How do you maintain balance in your life?\n\nLisa Oz: You are assuming I maintain balance (laughs). My life is so busy. I love to do yoga and do it as frequently as I can. But the most important thing I do to maintain balance for both my family and myself, is to establish a connection with my husband and kids regardless of the daily craziness and our busy schedules. I believe it is important to make eye contact with them and to not just be living in the same space. I like to know what’s really going on in everyone’s life. My balance is about having really deep significant relationships with my family and those I love.\n\nLisa’s book —US: Transforming Ourselves and the Relationships that Matter Most is available at Amazon.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "An Interview with Lisa Oz | Naturally Savvy", "description": "In 2008, I had the opportunity to meet Dr. Oz at an event that my company participated in called 'The Healthy Kids Expo'. He was super nice and personally met and took pictures with each person who came to hear him speak (pretty amazing). When it was my turn, I handed him a note on my […]", "url": "https://naturallysavvy.com/general/lisa-oz/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:author": "https://www.facebook.com/NaturallySavvy/", "article:published_time": "2018-11-21T08:25:00+00:00", "article:modified_time": "2019-05-31T19:13:03+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/lisaoz_460.jpg", "image:width": "460", "image:height": "275", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["/privacy-policy", "http://www.amazon.com/gp/product/0345321200/ref=as_li_qf_sp_asin_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0345321200&linkCode=as2&tag=natursavvy-20", "https://nsavvy.wpengine.com/eat/kids-like-green-drinks-too", "http://www.amazon.com/gp/product/1439123926/ref=as_li_qf_sp_asin_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1439123926&linkCode=as2&tag=natursavvy-20", "http://www.flickr.com/photos/shankbone/4593578273/sizes/m/in/photolist-7ZVhMp-bUosp3-3yizDg-eNE8uT-82TQtw-bEsAw-bXmvsq-dFwYxz-aTesM-CQnEv-aG5qw-e7Pcw8-2dC2y-dV15i7-aSswTR-9cBZmn-8ArLMZ-8EEbLo-6nTU97-qvVMN-enDkPW-Dckng-dsWxDY-dsWw5W-3yizTD-6DdMLD-3ynWJo-6DdMKa-6DhVXL-6DhVVU-6DdMJp-5TZHh-ByuSb-ByuSB-ByuSp-5ygfZc-5ykDiG-5bL534-5bQvB5-5bRgxU-5bR6NW-5bR5b9-ecEP8p-ecLu53-ecEM12-ecLsjA-ecEP44-ecLpDs-qvTSm-ecEM58-ecEMan/", "http://www.bluediamond.com/?navid=34"], "authors": ["", "Andrea Donsky, RHN"], "publish_date": "2018-11-21T08:25:00+00:00"}