{"result_id": "217027", "URL": "https://naturallysavvy.com/nest/children-s-vaccinations-part-five-pneumococcal/", "timestamp": "2023-04-25 16:32:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/nest/children-s-vaccinations-part-five-pneumococcal/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Children’s Vaccinations (Part Five): Pneumococcal | Naturally Savvy", "cleaned_text": "The pneumococcal vaccine is another one of several immunizations that is recommended by the Centers for Disease Control and Prevention (CDC) to be given to children beginning at age 2 months. It was designed to help prevent development of pneumococcal disease, which is caused by Streptococcus pneumoniae (aka pneumococcus). These bacteria can spread from person to person via droplets in the air carried by a sneeze or cough.\n\nInfants and young children do not have the ability to develop immunity to the polysaccharide (a sugar) that envelopes the disease-causing bacteria, although children attain this ability as they get older. Thus the vaccine is recommended for the very young. (However, certain other susceptible groups also should be vaccinated; see below.)\n\nPneumococcal disease can cause a variety of illnesses that fall into two categories: invasive and noninvasive. Here’s a brief rundown of these conditions.\n• Non-bacteremic pneumonia is a noninvasive infection of the lower respiratory tract, which means it does not spread organisms to the blood.\n• Bacteremic pneumonia is the invasive form of pneumonia with inflammation affecting one or both lungs and the presence of pneumococcus in the blood.\n• Middle-ear infection (aka otitis media) is a noninvasive infection that involves inflammation of the middle ear, swelling of the eardrum, ear pain, and fluid buildup in the middle ear.\n• Bacterial sepsis, or a bacterial infection of the blood that is invasive and carries a risk of death.\n• Meningitis is inflammation of the membranes called meninges that cover the brain and spinal cord. This invasive condition also can be deadly.\n\nPrior to the introduction of the pneumococcal vaccine in the United States in 2000, there were about 71,000 cases of pneumonia, 17,000 cases of blood infections, and 700 cases of meningitis per year associated with the bacterial infection. Since the vaccine has been used, those numbers have dropped dramatically.\n\nThere are two pneumococcal vaccines used in the United States.\n• Pneumococcal conjugate vaccine (PCV13; Prevnar 13; Wyeth) is the injection recommended by the CDC for all children younger than 5 years old and for adults who have certain risk factors (e.g., HIV or other conditions that compromise the immune system). This vaccine protects against 13 of the more than 90 types of pneumococcal bacteria. These 13 strains are responsible for the most severe infections in children. The recommended vaccination schedule is for injections to be given at age 2, 4, and 6 months and again at 12 to 15 months.\n• Pneumococcal polysaccharide vaccine (PPSV23; Pneumovax; Merck) is typically reserved for children ages 2 years or older who are at high risk of developing pneumococcal disease (i.e., they have sickle cell disease or another disease that compromises the immune system). This vaccine also is recommended for any adults who have asthma or who smoke or for older folks (65 and older). It addresses 23 of the more than 90 strains of pneumococcal bacteria.\n\nPrevnar 13 contains 13 different strains of S. pneumoniaebacteria along with aluminum, sodium chloride, succinic acid, polysorbate 80, and water. Pneumovax contains 23 different strains of S. pneumoniae bacteria and phenol as a preservative.\n• Children who have experienced a life-threatening allergic reaction to a previous dose of this vaccine, to an earlier pneumococcal vaccine called Prevnar (PCV7), or to any vaccine that contains diphtheria toxoid (e.g., DTaP), should not be given PCV13.\n• Children who have had a severe allergy to any component of PCV13 should not be given the injection.\n• If your child is ill on the day he or she is scheduled for vaccination, talk to your doctor about rescheduling the injection.\n• Young children, especially those age 12 to 23 months, who receive both the inactivated flu vaccine and pneumococcal vaccine (PCV13) at the same time may be at an increased risk of seizures associated with fever. Discuss this possibility with your physician. Febrile seizures occur in about 2 percent to 5 percent of all kids, and although they usually are not serious, they can be frightening.\n• Side effects associated with Prevnar 13 include irritability (>70%), tenderness at the injection site (>50%), reduced appetite (>40%), decreased sleep (>40%), fever (>20%), redness at the injection site (>20%), and swelling at the injection site (>20%). Among serious side effects are bronchiolitis, gastroenteritis, and pneumonia, seen in 0.9 percent of treated children.\n• Side effects associated with Pneumovax include soreness or pain at the infection site (60% of individuals), swelling at the injection site (20.3%), headache (17.6%), redness (16.4%), fatigue and muscle weakness (13.2%), and muscle pain (11.9%).\n\nRead more about the DTaP vaccine\n\nIf you have any questions or concerns about the pneumococcal vaccine for your child, talk to your pediatrician. Conduct your own online research regarding the pros and cons of the vaccine. You also can inquire about the vaccination exemptions available in your state.\n\nDeborah Mitchell is the author of \"The Essential Guide to Children's Vaccines \", among other health-related books on Amazon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Children’s Vaccinations (Part Five): Pneumococcal | Naturally Savvy", "description": "The pneumococcal vaccine is another one of several immunizations that is recommended by the Centers for Disease Control and Prevention (CDC) to be given to children beginning at age 2 months. It was designed to help prevent development of pneumococcal disease, which is caused by Streptococcus pneumoniae (aka pneumococcus). These bacteria can spread from person […]", "url": "https://naturallysavvy.com/nest/children-s-vaccinations-part-five-pneumococcal/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-21T08:29:54+00:00", "article:modified_time": "2019-05-19T13:24:50+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/cutebabe.jpg", "image:width": "620", "image:height": "320", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cdc.gov/VACCINES/vpd-vac/pneumo/default.htm", "https://nsavvy.wpengine.com/care/how-to-reduce-the-spread-of-germs", "https://nsavvy.wpengine.com/nest/c-diff-in-children-are-antibiotics-to-blame", "https://nsavvy.wpengine.com/care/reversing-chronic-inflammation-naturally", "https://nsavvy.wpengine.com/nest/preventing-ear-infections-with-proper-nutrition", "https://nsavvy.wpengine.com/care/study-doctors-drastically-overprescribing-antibiotics", "/privacy-policy", "https://nsavvy.wpengine.com/care/5-ways-to-boost-your-immune-system", "https://nsavvy.wpengine.com/eat/5-gnarly-food-preservatives-to-avoid", "https://nsavvy.wpengine.com/live/natural-treatments-for-food-allergies", "http://labeling.pfizer.com/showlabeling.aspx?id=501", "https://nsavvy.wpengine.com/nest/fever-phobia-should-you-treat-your-child-with-over-the-counter-fever-reducer-medications", "http://dailymed.nlm.nih.gov/dailymed/lookup.cfm?setid=bb362a20-6d91-4ae8-bebb-9ee8b2591814", "https://nsavvy.wpengine.com/nest/children-s-vaccinations-part-four-dtap", "http://www.amazon.com/gp/product/1250002192/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1250002192&linkCode=as2&tag=natursavvy-20&linkId=IV6NZERDP5OGATCG", "http://www.amazon.com/Deborah-Mitchell/e/B001HPIZSQ", "https://www.flickr.com/photos/paparutzi/1062532768/in/photolist-2y7xE-kjfvT-daV9Ja-daVbpE-5fCgU3-vX9cw-6smvkX-4DLZGy-9EyTUv-Q7q8a-4DGHti-fxgGtD-ao1kY1-2BTKYu-7med2o-85NCc8-4Uk61t-4wttVC-mt28-6f5XrY-4m49hq-daV9CK-5P9j16-5kDAiL-97NLqf-662rdZ-bKZ9-6stdw2-8hNAWp-8Kx4ve-F4iKm-5TiWqB-3sTpR1-7CpYUd-wz7SK-jXris-6sxp4j-b6NLSi-6GcwmN-4xrhUL-bc4AH-vv8xQ-KMQ4W-6PfPjj-4GvEmn-FMJ9A-4wdmtd-3SjbSX-dWL6yN-MGwcx"], "authors": ["", "Deborah Mitchell"], "publish_date": "2018-11-21T08:29:54+00:00"}