{"result_id": "217020", "URL": "https://naturallysavvy.com/care/the-flu-shot-is-not-as-effective-as-you-think/", "timestamp": "2023-04-25 16:32:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/care/the-flu-shot-is-not-as-effective-as-you-think/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "The Flu Shot Is Not As Effective As You Think | Naturally Savvy", "cleaned_text": "Flu season is in full throttle right now. You may feel healthy as you're reading this but the chances are pretty good that you know someone who is sick at the moment. Now before you're tempted to run out and get a flu shot (particularly if you're 65 years or older), have a look at the latest report from the U.S. Center for Disease Control and Prevention (CDC). The overall vaccine effectiveness (VE) for influenza A and B virus infections was 56 percent during the time observed. The estimates come from the CDC's Morbidity and Mortality Weekly Report (MMWR) which was released on February 22. It's based on 2,697 children and adults enrolled in the U.S. Influenza Vaccine Effectiveness Network from a time period spanning December 3, 2012 through January 19, 2013. Of the 2,697 children and adults observed 1,115 (41 percent) tested positive for a strain of the flu, and 32 percent of them had received the flu vaccine.\n\nThe VE for adults 65 years and older is lower. Concerning treatment for the flu in adults of that age group, the CDC report states \"Antiviral medications should be used as recommended for the treatment of suspected influenza in certain patients, including those aged 65 years and older regardless of their influenza vaccination status.\" Given the fact that the VE among older adults is low enough for the CDC to recommend antivirals, it seems a bit pointless to get a flu shot if you are in that age group.\n\nA flu shot is not the only way to protect yourself from getting the flu. There are natural remedies you can read about here. One of those remedies is to wash your hands frequently. A great way to effectively wash your hands is to wash them long enough to sing the children's song, \"Mary Had a Little Lamb.\" Another simple thing you can do is ask anyone who is sick around you to please cover their mouth when they cough. Go one step further and ask them to wash their hands after they cough. Explain that you're just trying to protect yourself from getting sick as well. And if you happen to become sick, stay home for at least a few days. The CDC recommends that people with influenza-like illnesses stay at home until they have not had a fever for more than 24 hours.\n\nWhat natural remedies do you use when you're sick with the flu? Leave a comment below, and let us know!\n\nAndrea Donsky is a Registered Holistic Nutritionist (R.H.N) and co-founder of NaturallySavvy.com. Andrea has dedicated her life to sharing her passion for living a naturally and healthy lifestyle with the world, while helping to guide others through the confusing maze of 21st century supermarkets and fad diets. She is co-author of Unjunk Your Junk Food and a 'Parent Ambassador' for Healthy Child Healthy World.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Flu Shot Is Not As Effective As You Think | Naturally Savvy", "description": "Flu season is in full throttle right now. You may feel healthy as you're reading this but the chances are pretty good that you know someone who is sick at the moment. Now before you're tempted to run out and get a flu shot (particularly if you're 65 years or older), have a look at […]", "url": "https://naturallysavvy.com/care/the-flu-shot-is-not-as-effective-as-you-think/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:author": "https://www.facebook.com/NaturallySavvy/", "article:published_time": "2018-11-21T06:16:08+00:00", "article:modified_time": "2019-05-31T19:13:09+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/stories-4092143333_427975fc35.jpg", "image:width": "500", "image:height": "350", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cdc.gov/mmwr/preview/mmwrhtml/mm6207a2.htm?s_cid=mm6207a2_w&utm_campaign=Flu%20Shot%20Not%20Effective%20for%20Seniors:%20Hand%20Hygiene%20Best%20Defense02252013&utm_source=press-release", "https://nsavvy.wpengine.com/health-wellness/fighting-back-against-the-flu", "http://www.cdc.gov/h1n1flu/guidance/exclusion.htm", "https://nsavvy.wpengine.com/book/unjunk-your-junk-food", "/privacy-policy"], "authors": ["", "Andrea Donsky, RHN"], "publish_date": "2018-11-21T06:16:08+00:00"}