{"result_id": "217006", "URL": "https://naturallysavvy.com/restore/restoring-gut-health-recovery-from-antibiotics-and-vaccines/", "timestamp": "2023-04-25 16:32:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/restore/restoring-gut-health-recovery-from-antibiotics-and-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Restoring Gut Health: Recovery from Antibiotics and Vaccines | Naturally Savvy", "cleaned_text": "Robert Scott Bell joined Andrea Donsky on Naturally Savvy Radio to discuss Restoring Gut Health: Recovery from Antibiotics and Vaccines. [The following transcript has been edited for print.]\n\nIntroduction: Your organic search is over. Here’s Naturally Savvy with health expert Andrea Donsky.\n\nAndrea: Hello everyone. When I was younger I had many, many digestive issues. At one point in my mid-twenties I couldn’t even eat without experiencing gas, bloating and even pain. So, I really understand what you’re going through if you experience any of the same symptoms that I did. But, luckily there are ways to heal our digestive system.\n\nToday, I am joined by the amazing Robert Scott Bell, a homeopath author and radio show host. We’re going to talk about restoring the digestive health of people who have been damaged by processed foods and modern medicine. Welcome to Naturally Savvy Radio, Robert.\n\nRobert: Andrea, it’s nice to be with you, especially on a topic as important as recovering the integrity of the gut.\n\nAndrea: This is one of my favorite topics, by the way. So, let’s jump right in. Talk about how the gut gets damaged in the first place, and what are some ways we can help to heal it?\n\nRobert: Well, the primary way that it is harmed right from birth are vaccinations. You’ll often see evidence of some of the ingredients within those vaccines. They’ll pop up in the gut or appear in the gut and damage it. Most people are familiar with modern medicine in terms of antibiotics. That’s the largest swamp of destruction that is done to the gut. Albeit, there are times that antibiotics are absolutely necessary, but in reality even one dose if not corrected afterwards, can lead to a lifetime of leaky gut, dysbiosis, candida overgrowth, and more. Those are just two of the most prominent of modern medical interventions that affect the integrity of the gut, but of course there are also additives, preservatives, colorings, flavorings, pesticides, herbicides, fungicides, plasticizers, heavy metals, GMOs, to name just a few.\n\nAndrea: I want to talk a little bit about antibiotics because I think for those who are listening they might think, well I know when I’m given antibiotics I’m supposed to take probiotics after because I know that helps. I’d like us to talk a little bit about how someone who let’s say has been on a lot of antibiotics or is maybe taking one right now, and how we could help them. What are some tips you can give them in terms of helping to heal their gut?\n\nRobert: Yes, this is very important. I do support the use of probiotics. I think it’s very important. Fermented foods are very important. But, if you have a damaged terrain to the extent that antibiotics can do, let’s just imagine your healthy gut flora and the place it lives much like a beautiful rainforest. If that rainforest is decimated by Napalm, it’s not just the microbes that are killed, but the trees, the fauna, the flora, all of it. You try to put the good guys back into that environment; but it’s like the desert. They’re not supposed to live in the desert. We have to restore the rainforest.\n\nSo, my goal is to restore integrity to the actual terrain of the intestinal tract. I’ve utilized a protocol. I’ve written about it extensively in my book Unlock the Power to Heal. But, it really is the difference between retaining a healthy gut flora that you replenish or having it pass right through because it looks up at you and says listen, I don’t live in the desert, where’s the forest I’m designed to live in?\n\nAndrea: I love this analogy! So, let’s say someone is listening right now, and they’re saying: “This all makes sense to me. I get it. But how do I know if my gut is damaged?”\n\nRobert: Well, there are so many symptoms, some more overt than others. I was of a gut-damaged generation. I was the antibiotic kid. I had every allergy known to man – which is really from leaky gut and not the allergen per say, but the leaky gut that causes a hyper immune response and sometimes leads to either auto immunity or immune collapse later on in life. But, for me it was constipation. It was irregularity of bowel movements, but I also had gas and bloating. The classic acid indigestion and heart burn that they used to call. Now they call it gastro esophageal reflux disease, GERD. So, they’re usually not subtle. People know if they have GI disturbance. The body is very good at signaling. Hey, something is up down here. You have to correct it. But, unfortunately we’re trained to drug it and not correct it.\n\nAndrea: Let’s talk a little bit about your protocol. You said you wrote about it in your book but talk a little bit about how you would help someone with gut issues.\n\nRobert: Well, the key for me is to acknowledge that there is inflammation of the epithelial lining. Much like you get a cut, a scape, or a burn, or a wound outside of your body on the skin, that’s epithelial tissue as well. Same thing is happening inside with the damage to the gut. The question is how do we heal it? We can’t put a Band-Aid on it. That’s like a surgical procedure. So, what I’ve utilized and investigated things that reduce tissue inflammation.\n\nOne of the most profound tools is a trace element known as silver. People know colloidal silver, but I use silver hydrosol and that’s a purer more active state. I drive it into the gut with aloe vera juice to help cool the inflammation and heal tissue. Modern medicine, the burn care centers around the world, use a silver base drug to heal epithelial tissue. Why not utilize a safer form within the gut to heal that tissue so then you can replenish the probiotic colonies that have the appropriate place to live? So, it’s a three-times a day protocol, silver and aloe combination, about a tablespoon or two of each. Then you do that on an empty stomach. Drink it down three times a day. You do probiotic replenishment at night. Simple two weeks for candida, four, six or eight weeks when you’re dealing with colitis, Crohn's, irritable bowel, leaky gut, or diverticulitis.\n\nRemember the road to colostomy bags is actually paved by antibiotics and prednisone, and then they start ripping out parts of your gut. I’m not exaggerating. They’re doing this to teenagers. So, this is a very important turnaround for people even if they’re on the road to that right now.\n\nAndrea: My gosh! I’m so happy you brought up prednisone because my dad has ankylosing spondylitis. He’s had it since he was in his twenties and he has been put on prednisone so many times. I’m going to have him listen to this interview. Let’s say he and others want to learn more. Where could people go? Are you practicing one-on-one with people? Do you have a protocol where people can access it online? How could people learn more and really try to help heal themselves?\n\nRobert: Well, I do consult mostly with physicians about their tough cases, but my radio show is on two hours a day, six days a week. You can go to Robertscottbell.com. Those that want the full protocol can read Unlock the Power to Heal or go to Unlockthepowertoheal.com. You can download the e-book there or you can get it on Amazon or Barnes and Noble. But, there are a lot of things I do in answering questions on the air or even if people leave me messages on the air for a lot of people to hear it.\n\nAndrea: That’s amazing. Okay. I want to know a little bit more about the silver hydrosol that you’re talking about. So, I am very familiar with colloidal silver. Is it a form of colloidal silver? What’s the difference?\n\nRobert: Sure. It’s in the family of colloidal silver, but it’s much more pure in that it’s in a pharmaceutical grade purified water base, so there’s no contaminants. There’s no salts or proteins to bind the silver. Then you’re able to put a low concentration, like a ten parts per million, of a nanometer or smaller size active charged particle. So, it has immediate efficiency in the body and the body is able to bind and excrete it by the liver and into the colon. So, you don’t deal with a bio-accumulation. People get concerned about the discoloration due to the wrong form of colloidal silver. I use the form people may have heard of, Sovereign Silver.\n\nAndrea: I’m very familiar with Sovereign Silver. Theo owns that company, right?\n\nRobert: Yes, you know Theo?\n\nRobert: His father developed the technology to put it out there and it’s been a Godsend because it took me two years to recover my gut health before I knew about this protocol. Now I’m able to help people that are worse off than I was, in two months or less which is really quite miraculous. But, I understand the pathways that are being worked here and I know why it works. That’s why I wrote about it.\n\nAndrea: That’s awesome. We work with a company called Lily of the Desert who does aloe vera juice. They have an organic aloe vera juice.\n\nYou’re obviously a wealth of information, and I wanted to have you on the show today because you’re going to be speaking at the Total Health Show in Toronto, Canada from April 8 and 10. Just talk a little bit about that. What you’re going to be speaking about. I know you’re speaking three times during the weekend, so if you could tell our listeners what you’ll be talking about, I’d love for our Canadian listeners to come and hear you speak.\n\nRobert: One topic is what we discussed today. I’m going to talk in depth about the protocol for gut recovery because that’s the seed of the immune system. I’m also going to talk about digestion, endocrine function, and neurological function as well. That’s very important.\n\nAnother thing I’m going to hit on is the vaccine issue, which is of course a great controversy. But, I’m going to talk about folks that have looked into the dangers and maybe they decide they don’t want to do it. What are their options? Are there other things we can do? I will talk about their options.\n\nAndrea: You can learn more about Robert at Robertscottbell.com and Unlockthepowertoheal.com. You can also follow him on Twitter, like we do, @RSBellMedia. Be sure to hear him at the Total Health Show in Toronto, Canada from April 8 to 10.\n\nI’m Andrea Donsky. This is Naturally Savvy Radio on RadioMD. Thanks for listening. Stay well.\n\nListen to the full radio interview here.", "opengraph": {"locale": "en_US", "type": "article", "title": "Restoring Gut Health: Recovery from Antibiotics and Vaccines | Naturally Savvy", "description": "Robert Scott Bell joined Andrea Donsky on Naturally Savvy Radio to discuss Restoring Gut Health: Recovery from Antibiotics and Vaccines. [The following transcript has been edited for print.] Participants:Andrea Donsky, RHN Robert Scott Bell, Homeopath, Author and International Radio Show Host Introduction: Your organic search is over. Here’s Naturally Savvy with health expert Andrea Donsky. Andrea: […]", "url": "https://naturallysavvy.com/restore/restoring-gut-health-recovery-from-antibiotics-and-vaccines/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-21T08:50:29+00:00", "article:modified_time": "2019-06-26T15:47:59+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/FB-Restoring-Gut-Health.png", "image:width": "840", "image:height": "434", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.radiomd.com/show/naturally-savvy", "/privacy-policy", "https://nsavvy.wpengine.com/eat/is-monsanto-s-gm-corn-causing-gluten-intolerance", "https://nsavvy.wpengine.com/restore/10-simple-ways-to-heal-acid-reflux-naturally", "http://www.robertscottbell.com", "http://unlockthepowertoheal.com", "http://www.lilyofthedesert.com", "https://nsavvy.wpengine.com/eat/10-benefits-of-aloe-vera-juice", "http://www.robertscottbell.com", "http://unlockthepowertoheal.com", "http://www.totalhealthshow.com/showInfo/index.cfm?CFID=16009424&CFTOKEN=22020072", "http://radiomd.com/show/naturally-savvy/item/31028-gut-care-recovery-from-vaccines-antibiotics"], "authors": ["", "Lisa Roth Collins, RHN"], "publish_date": "2018-11-21T08:50:29+00:00"}