{"result_id": "217012", "URL": "https://naturallysavvy.com/nest/childhood-vaccinations-part-six-mmr/", "timestamp": "2023-04-25 16:32:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/nest/childhood-vaccinations-part-six-mmr/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Childhood Vaccinations: MMR | Naturally Savvy", "cleaned_text": "NOTE: This article was updated on February 5, 2015, in response to the measles outbreak in the United States that started in December 2014 and has been linked primarily to Disney California Adventure Park. Updated information appears here and in the section entitled “Cautions about MMR Vaccine” regarding the findings of two new studies about side effects. According to the Centers for Disease Control and Prevention, 102 individuals from 14 states were reported to have contracted measles between January 1 to January 30, 2015, and the threat continues. On January 29, 2015, Dr. Anne Schuchat, the assistant surgeon general, explained during a CDC news briefing that “the majority of the adults and children that are reported to us for which we have information did not get vaccinated or don’t know whether they have been vaccinated.”\n\nAs a result of this latest measles episode, state senators in California plan to end the rights of parents to exempt their children from school vaccinations based on personal beliefs, according to a Reuters report. The legislation is being sponsored by Senators Ben Allen and Richard Pan.\n\nPerhaps the most controversial of the childhood vaccinations is the MMR vaccine. The two main reasons the MMR vaccine creates a buzz is because it provides three vaccines in one and because of its reported link with autism. Before we leap into the controversy, however, let’s take a look at the diseases the MMR vaccine was designed to prevent and the available products.\n\nThe MMR vaccine was designed to help prevent measles, mumps, and rubella (German measles). Many young mothers today have never seen a case of these diseases, and that is largely because of the vaccination program in the United States and elsewhere. At one time, children were given an individual shot for each of these diseases. Then in 1971, all three attenuated viruses (live viruses) were combined into one injectable vaccine.\n\nAll three of these viral diseases are spread via droplets from sneezing, coughing, or talking. It is also possible to contract them by touching a contaminated surface with the hands and then touching the mouth or eyes.\n\nMeasles is a highly contagious disease that affected more than half a million people in the United States each year before the measles vaccine was introduced in the 1960s. That number has dropped to several dozen to several hundred per year since then, although about 20 million cases still develop each year around the world.\n\nMeasles is characterized by an itchy red rash, high fever, red eyes, strong cough, and runny nose. Complications may include pneumonia, croup, diarrhea, middle ear infections, and, in rare cases, measles encephalitis (infection of the brain). Infants typically receive immunity from their mothers, but this fades after about age 6 months.\n\nBecause measles is caused by a virus, no medications are available to treat it. However, symptoms can be managed with fluids, rest, and topical products to reduce itching.\n\nMumps is usually associated with a “chipmunk cheek” look because the virus often affects the parotid salivary glands, which are located between the ear and lower jaw, and causes inflammation. Introduction of the mumps vaccine in 1967 dramatically reduced the yearly 200,000 or more cases per year to less than 1,000.\n\nThe mumps virus is typically spread through airborne droplets and can cause symptoms such as high fever, headache, and loss of appetite. In rare cases, mumps can cause swelling and inflammation of the brain (encephalitis), spinal cord and brain lining (meningitis) and other organs. Among males, a rare complication is orchitis, or inflammation of the testicles. Orchitis can result in sterility. The mumps virus also can affect the pancreas in both males and females and has been noted as a possible cause of type 1 diabetes.\n\nSimilar to measles, infants receive immunity to mumps from their mother, and it provides protection for about six months. Again, treatment involves providing relief of symptoms such as plenty of fluids, warm or cold packs for the swollen glands, and nonaspirin medications for fever.\n\nRubella is a viral infection that primarily affects the skin and lymph nodes. The main concern about rubella is that pregnant women can pass it to their unborn children and cause then to develop congenital rubella syndrome, a rare condition that causes permanent nervous system damage in children.\n\nSince introduction of the rubella vaccine, only several dozen cases of rubella occur in the United States each year. Symptoms include mild fever, swollen lymph nodes, and an itchy rash on the face and body. The symptoms typically last only three days, which is why rubella is also known as the “three day measles.”\n\nTeens and adults who get rubella are more likely to experience conjunctivitis, loss of appetite, headache, stuffy or runny nose, and painful swollen joints. Pregnant women who get rubella are at risk of having a miscarriage or stillbirth of delivery a child who has birth defects. Treatment of rubella is largely similar to that for measles and mumps.\n\nAs of 2010, single vaccines for measles, mumps, and rubella were no longer available in the United States. Currently there are only two MMR vaccines available:\n• M-M-R II (Merck) is a live vaccine that does not contain any preservatives. It does contain sorbitol, sucrose, hydrolyzed gelatin, recombinant human albumin (protein), fetal bovine serum, neomycin, sodium phosphate, sodium chloride, and various other ingredients.\n• ProQuad (Merck) is a combination of the three components of the M-M-R II plus varicella (chickenpox). Therefore it contains the same ingredients and no preservatives. Because the MMR and chickenpox vaccines are scheduled for around the same age, some parents elect to give the ProQuad vaccine instead of a separate chickenpox shot. (The chickenpox vaccine will be covered in a subsequent article.)\n\nAccording to the Centers for Disease Control and Prevention (CDC), the MMR vaccine should be given to individuals age 12 months and older:\n• First shot at age 12 to 15 months\n• Second shot (booster) at age 4 to 6 years\n\nIf there is an outbreak of any of these diseases and your child is age 6 to 12 months or 1 to 4 years, your doctor may recommend giving the vaccine. This does not negate the need for the other two shots, however.\n\nWomen of childbearing age should have a blood test to see if they are immune to these diseases. If not, they need to get an MMR vaccination if they are planning to have a baby. However, the vaccination should be taken more than 3 months before getting pregnant as it may harm the baby.\n\nSome children should delay or avoid the MMR vaccine.\n• Children who have an illness that is more serious than a mild cold should postpone the vaccine\n• Children who are severely allergic to gelatin, neomycin, or chicken eggs should not get the vaccine, because these ingredients can cause serious reactions\n• Children who have a compromise immune system should avoid the vaccine\n\nSide effects associated with the MMR vaccine are redness, swelling, or soreness at the injection site, mild rash, swollen lymph glands, mild to moderate fever, and temporary stiffness, swelling, or pain of the joints. In less than 1 child out of 10,000, children experience a severe allergic reaction, coma, or reduced consciousness. High fever occurs in 5 to 15 percent of children.\n\nA new study (February 3, 2015) published in Acta Paediatrics revealed some interesting information about side effects of the MMR vaccine. The double-blind, cross-over study conducted on twin pairs found that the “true frequency of side effects caused by the MMR vaccine was between 0.5 and 4%” and that measles that develop in children even after they have received the vaccine have a case of wild-type or vaccine-associated measles. It is difficult to clinically distinguish between the two.\n\nBecause of the measles outbreak largely associated with Disney California Adventure Park, there has been a renewed effort to encourage adults who have not received the MMR vaccine or who cannot remember if they were vaccinated to either get the vaccine or have a blood test to check for evidence of immunity. Adults who may be concerned about the side effects of getting the injection may be interested in the findings of a new report in the January 30, 2015 issue of Clinical Infectious Diseases regarding the safety of MMR vaccine in adults.\n\nThe authors evaluated reports of adverse events to the Vaccine Adverse Event Reporting System and noted that from January 1, 2003 to July 31, 2013, there were 3,175 reports of adverse events from adults. Five percent (168) were considered to be serious (including 7 deaths), and the most common signs and symptoms were fever (19%), rash (17%), pain (13%), and arthralgia (13%). Overall, the authors said “we did not detect any new or unexpected safety concerns for MMR vaccination in adults.”\n\nRead more about measles and other childhood illnesses\n\nIn 1998, Andrew Wakefield, MBBS, and his team published a report in Lancet that suggested there was a link between the MMR vaccine and autism. Subsequent investigations into Wakefield’s research led to the conclusion that the work was a fraud. Among the naysayers was a report from the CDC in 2004 stating they had found no link between autism and vaccination schedules, including the one for MMR.\n\nThese conclusions did not satisfy everyone. Researcher Helen Ratajczak noted in her 2011 Journal of Immunotoxicology article that she had found evidence linking the vaccine with autism. After extensive investigation, she noted that the “MMR II vaccine is contaminated with human DNA from the cell line” and that “the incidence and prevalence data indicate the timing of introduction of vaccines and changes in the type and increasing number of vaccines given at one time implicate vaccines as a cause of autism.”\n\nNow, in September 2014, a new study funded by the Focus Autism Foundation and published in Translational Neurodegeneration reports that the 2004 study suppressed critical data linking MMR and autism. The study indicates that African-American boys have an increased risk for autism if they receive the MMR vaccine before age 36 months. (The article in Translational Neurodegeneration has been deleted from the website pending investigation.)\n\nIn fact, one of the original authors of the 2004 study, William Thompson, offered a press release in which he admits he and his coauthors “omitted statistically significant information in our 2004 article” and that the “omitted data suggested that African American males who received the MMR vaccine before age 36 months were at increased risk for autism.”\n\nThese and other research support the claims by some parents and health experts that there is a real link between MMR and autism. The search for a definitive answer continues.\n\nOne or both doses of the MMR vaccine is required by nearly every state and the District of Columbia. Parents also can seek an exemption from the MMR vaccine and other vaccines, and these exemptions vary by state. All parents are urged to learn all they can about the pros and cons of the MMR vaccine before having it administered to their child and discussing their concerns with knowledgeable healthcare providers.\n\nDeborah Mitchell is the author of The Essential Guide to Children's Vaccines , among other health-related books on Amazon.\n\nSources\n\n Autism Daily Newscast\n\n Centers for Disease Control and Prevention\n\n Mitchell, Deborah. The Essential Guide to Children’s Vaccines\n\n Ratajczak HV. Theoretical aspects of autism: causes—a review. Journal of Immunotoxicology 2011 Jan-Mar; 8(1): 68-79", "opengraph": {"locale": "en_US", "type": "article", "title": "Childhood Vaccinations: MMR | Naturally Savvy", "description": "NOTE: This article was updated on February 5, 2015, in response to the measles outbreak in the United States that started in December 2014 and has been linked primarily to Disney California Adventure Park. Updated information appears here and in the section entitled “Cautions about MMR Vaccine” regarding the findings of two new studies about […]", "url": "https://naturallysavvy.com/nest/childhood-vaccinations-part-six-mmr/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-21T08:39:47+00:00", "article:modified_time": "2019-05-31T19:13:04+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/needle.jpg", "image:width": "620", "image:height": "320", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cdc.gov/measles/cases-outbreaks.html", "http://www.cdc.gov/media/releases/2015/t0129-measles-in-us.html", "http://www.reuters.com/article/2015/02/04/us-usa-measles-california-idUSKBN0L82NR20150204", "/privacy-policy", "https://nsavvy.wpengine.com/care/how-to-reduce-the-spread-of-germs", "https://nsavvy.wpengine.com/nest/fever-phobia-should-you-treat-your-child-with-over-the-counter-fever-reducer-medications", "https://nsavvy.wpengine.com/blog/omega-3-and-omega-6-balance-inflammation", "https://nsavvy.wpengine.com/care/understanding-headache-pain", "http://www.nvic.org/vaccines-and-diseases/Diabetes/juvenilediabetes.aspx", "https://nsavvy.wpengine.com/care/herbal-lymphatic-system-tonic-recipe", "https://nsavvy.wpengine.com/nest/fever-phobia-should-you-treat-your-child-with-over-the-counter-fever-reducer-medications", "https://nsavvy.wpengine.com/care/4-herbal-remedies-to-soothe-dry-itchy-eyes", "https://nsavvy.wpengine.com/eat/5-gnarly-food-preservatives-to-avoid", "https://nsavvy.wpengine.com/care/herbal-lymphatic-system-tonic-recipe", "http://www.ncbi.nlm.nih.gov/pubmed/25646657", "http://www.ncbi.nlm.nih.gov/pubmed/25637587", "http://www.amazon.com/gp/product/1250002192/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1250002192&linkCode=as2&tag=natursavvy-20&linkId=6PGZBTUVGWIOMVAF", "http://www.amazon.com/Deborah-Mitchell/e/B001HPIZSQ", "http://www.radiomd.com/show/naturally-savvy", "https://www.flickr.com/photos/stevendepolo/3021193208", "https://www.flickr.com/photos/minnellium/3480352546/in/photolist-6MrUs3-9RRXyz-9RRXyx-8V2hL5-7Wp9iW-7Wp9vE-7WkVn6-6htNzF-7WkNfg-7WkSe2-7XsJq1-ctVqjJ-4fJZUG-59nFnH-76W6AT-6ixHyo-guDcgS-guCQN6-guCQM4-guDcu7-7WkRfD-9e9Rsh-apKYx5-7Wp7WQ-7WkQ9r-7ScLXL-cBbQgq-7JcSmt-aq4kh8-aq4kr4-7Wp9J1-8fwvFX-7Wp5uE-7WpaSj-8R2HnJ-7Wp64W-dPzD8e-dPFfTm-7WpacE-7WHGWM-7WmePe-atBhER-dPzDcr-KHfY-guCQPi-guCQHX-guChFj-7ty1gG-aTBJyT-9FVzWV", "http://www.ncbi.nlm.nih.gov/pubmed/21299355"], "authors": ["", "Deborah Mitchell"], "publish_date": "2018-11-21T08:39:47+00:00"}