{"result_id": "217015", "URL": "https://naturallysavvy.com/recipes/can-parents-do-anything-to-prevent-autism/", "timestamp": "2023-04-25 16:32:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/recipes/can-parents-do-anything-to-prevent-autism/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Can Parents Do Anything To Prevent Autism? | Naturally Savvy", "cleaned_text": "With autism statistics sharply on the rise, many parents are asking whether they can do anything to prevent the condition from affecting their unborn or newborn children. While in the past many doctors and experts would have dismissed this possibility, claiming that autism was mainly a genetically predisposed condition, today experts are starting to change their perspective as more and more studies are coming in highlighting information on the possible causes.\n\nThe last decade or so has brought about a clear recognition that a fetus or newborn’s environment can have a significant impact on their ability to develop autism. By “environment” what is meant is all of the things that this still unborn child or newly born child comes into contact with. Most importantly this indicates that negative forces – or often times chemicals or damaging agents – can interfere with normal and healthy brain activity. That being said it is now acknowledged that the things we are exposed to or expose ourselves to make a difference. Therefore with some education and interventions we may be able to take action on those things we can control.\n\nMaximizing Maternal Health Prior to Conception, in Pregnancy and Breastfeeding\n\nIt seems obvious that a mother-to-be should focus on her health before conceiving. However many mothers are not sufficiently educated about what being in good health means. Aside from taking a folic acid supplement there are dozens of steps women of childbearing age should engage in to properly prepare for carrying a baby.\n\nGood nutrition is a given but what does that mean? Is it enough to just lay off the fast foods and eat a reasonable amount of vegetables? Apparently not. Women need to be acutely aware of the chemicals in the foods they eat as well as the quality of the food they eat. GMOs, pesticides, additives, trans fats, growth hormones, heavy metals etc…all of these are potentially dangerous to a developing fetus or growing baby. Women need to educate themselves as much as possible about natural and holistic nutrition.\n\nChemicals are all around us. It is impossible for any pregnant women or baby for that matter to avoid being exposed to chemicals. They are in our water, our air, our food, our clothes and our personal products. However although we can’t control all exposure to chemicals, we can control some. Be vigilant about reading labels and making informed decision about what you bring into your home and put either into or on your body. Perhaps it is time to rethink whether you need all of your personal care products or which ones can be switched out for more natural alternatives.\n\nConsider the materials of the clothes you wear and the bedding you sleep on. Flame retardants are on many items and have been shown to have a negative effect on health.\n\nThe topic of vaccines is a very controversial one that doesn’t often get explored enough since it tends to attract explosive reactions from all sides. However, parents should become educated about what they are exposing their children to in vaccines and then weigh the pros and cons between the risk of disease and the possible risk from vaccines themselves. Everything we put in our bodies has an effect on us and some children are simply more sensitive to certain substances. Parents shouldn’t be condemned or criticized for questioning a practice that may not be right for their particular child.\n\nThere are many approaches to take with this issue. One is that parents may choose to slow down the vaccination schedule, give single shots, or opt out of those they don’t feel are absolutely essential such as chicken pox or the flu vaccine.\n\nMost medications have not been tested for safety during pregnancy. Some medications have the potential to disrupt fetal development. There is currently a growing amount of research showing the damaging effects of many antidepressants on fetal health during pregnancy. If you are currently on medication and want to get pregnant ask lots of questions of your doctor and do your homework.\n\nResearch on children with autism has determined that many have a compromised intestinal system that is more porous and therefore more sensitive to substances such as additives and color, heavy metals and pesticides and even certain foods. There is a growing body of evidence linking brain function to gut function.\n\nTo help foster a healthy intestinal tract in your baby consider the following: breastfeed as long as possible, do not introduce foods until after 6 months, delay the introduction of wheat and dairy, avoid antibiotics, use probiotics, and ensure healthy bowel movements through adequate hydration and healthy nutrition.\n\nThe use of epidurals and other pain medications, pitocin, C-sections, forceps, vacuum, antibiotics, etc…are all interventions that can have a negative impact on your baby. In most cases these steps do not damage a newborn, but again if a child has an increased sensitivity to the effects of the environment then they may be a contributing factor. With autism there may not necessarily be and likely isn’t one cause. In many cases it could actually be the cumulative affect of many insults on the body that lead to its development. However cesarean section is positively correlated with autism.\n\nSupplementation can be key to preparing for pregnancy and growing a healthy baby. A good quality food based multi-vitamin and mineral is key as is folic acid and Omega 3 essential fatty acids. Omega 3’s are particularly important for brain development as the brain is 60% fat and needs fat to be nourished.\n\nThere is some new but preliminary research that shows that having children too closely together can result in the second child having an increased risk of autism. This possible link is attributed to the decline in available maternal nutrients that occurs during the subsequent pregnancy and breastfeeding stage. The second child may not have access to high enough stores of essential nutrients for healthy development, particularly of the brain.\n\nThe ideal time for healthy conception is 2 years between pregnancies. If possible a woman should give her body enough time to recover from the arduous task of growing and delivering and nurturing a baby.\n\nAlthough there are some factors that cannot be controlled, there are other actions that moms-to-be and new parents can take to help protect their precious babies from any potential harms. While there are still no conclusive studies linking any one thing to autism, many of the above mentioned factors have been shown to have an influence or a correlation. By being vigilant about how we care for our own bodies and those of our babies we can at least do everything in our power to see that they get the best possible start in life.", "opengraph": {"locale": "en_US", "type": "article", "title": "Can Parents Do Anything To Prevent Autism? | Naturally Savvy", "description": "With autism statistics sharply on the rise, many parents are asking whether they can do anything to prevent the condition from affecting their unborn or newborn children. While in the past many doctors and experts would have dismissed this possibility, claiming that autism was mainly a genetically predisposed condition, today experts are starting to change […]", "url": "https://naturallysavvy.com/recipes/can-parents-do-anything-to-prevent-autism/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-21T06:27:05+00:00", "article:modified_time": "2019-06-05T18:52:37+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/stories-preventautism250x200.jpg", "image:width": "250", "image:height": "200", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["/privacy-policy"], "authors": ["", "Lilian Presti"], "publish_date": "2018-11-21T06:27:05+00:00"}