{"result_id": "217021", "URL": "https://naturallysavvy.com/care/how-long-do-you-really-need-to-wash-your-hands/", "timestamp": "2023-04-25 16:32:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/care/how-long-do-you-really-need-to-wash-your-hands/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "How Long Do You Really Need to Wash Your Hands? | Naturally Savvy", "cleaned_text": "Handwashing is one of the top strategies you can use to prevent the spread of colds, flu, salmonella and other germs that cause illness. The key to this technique is to do it correctly and for the proper amount of time. Several studies have evaluated compliance with handwashing in the general public and health care facilities. You may be surprised by the results.\n\nIn a study from Michigan State University,1 researchers watched more than 3,700 people after using the bathroom and reported that 95 percent did not wash their hands long enough to kill germs.2\n\nThe average amount of time people spent washing was only six seconds. Even more disturbing was that 7 percent of women and 15 percent of men didn’t wash their hands at all. A recent study of 2,000 people from Britain found similar results after using the bathroom, as 84 percent were not washing their hands long enough to reduce the spread of infection.3\n\nPoor hand hygiene is also an issue in health care. According to the Centers for Disease Control and Prevention (CDC), health care providers wash their hands less than half the time that they should.4 The World Health Organization (WHO) estimates only an average of 40 percent of providers wash their hands when appropriate. Passing germs from patient to provider to patient,5 and poor patient handwashing, may be reasons an estimated 1 in every 4 patients who leave the hospital will have a superbug on their hands.6\n\nHandwashing Is Your First Line of Defense Against Germs\n\nProper handwashing that removes microbes and viruses from your hands is one of the single most important ways of reducing the spread of infection.7 You can infect yourself when you touch your mouth, eyes and nose with fingers contaminated with bacteria, and you may spread those germs to others when you touch them or an inanimate object that they then touch.\n\nA new study released by the British Royal Pharmaceutical Society found that washing your hands for just 20 seconds8 will remove germs and reduce the need for antibiotics.9\n\nInfections triggering a cold, flu or diarrhea may spread when an infected person touches an inanimate object, like a handrail, shopping cart, table tops or toys, thereby transferring the germ. You pick up those germs when you touch the objects. Unwashed hands can transfer germs into your food at restaurants or during food preparation at home. Some bacteria may multiply in food under certain conditions, increasing the likelihood the person eating will get sick.10 Handwashing education has demonstrated a:11\n• 31 percent reduction in the number of people who get diarrhea\n• 58 percent reduction in people who get diarrhea who have a weakened immune system\n• 16 to 21 percent reduction in people who get respiratory illnesses\n\nThe military was able to achieve a higher reduction in numbers of people who suffered from respiratory illness after an experiment with Navy recruits.12 The most common cause of lost duty time in the military is a respiratory illness. In the past, the military had used ultraviolet lights, vaccines and disinfectant vapors to reduce the number of lost hours.\n\nDuring the study period, recruits were ordered to wash their hands five times a day, and the drill instructors received education monthly on the importance of handwashing.13 After two years, the handwashing recruits had 45 percent fewer cases of respiratory illnesses than recruits the year before the program began.\n\nVaccinations and Antibiotics Are Not the Answer\n\nThere are at least 200 different viruses that can cause a cold and several different strains of influenza virus that can cause the flu.14Although it may seem as if the flu is a very bad cold, the two develop after infection from two different types of viruses and trigger two different types of illness. In fact, even when your physician believes you have the influenza virus, you may have rhinovirus that presents like the flu.\n\nThe only way to tell the difference is by taking a culture, which many physicians and patients opt not to do as it doesn’t change the treatment. It does, however, impact the number of deaths the CDC attributes to the flu. Each year, the CDC reports an estimate of 36,000 deaths from the flu.15\n\nHowever, according to the National Vital Statistics Report in 2016, the number of people who actually died from the flu was just over 4,500,16 while the publicly reported number for death attributed to the combination of influenza and pneumonia was just over 55,000, a vastly larger number consisting mostly of people who had died from pneumonia.\n\nMost pneumonia deaths are actually unrelated to the flu. According to the American Lung Association, there are 30 different causes of pneumonia and the flu is only one of them.17 It’s also worth noting that only 10 to 30 percent of flu-like respiratory illnesses at any point in a given flu season are actually caused by influenza type A or B,18 which is what the flu shot is supposed to prevent.\n\nAs mentioned, there are more than 200 types of viruses that cause respiratory flu-like symptoms,19 in addition to illness caused by bacteria,20 but they are not included in the influenza vaccine. So, since most of the flu-like illness in any given flu season is not caused by type A or B influenza, the scientific evidence is simply not there for the government to order every child and adult in America to get the flu shot.\n\nSince the flu and rhinovirus are both caused by viruses, antibiotics are also useless against them.21 Only in cases where individuals who have compromised or weakened immune systems, such as children, the elderly or those with specific chronic illnesses, are antibiotics useful when a secondary bacterial infection may develop. The best and most effective way of preventing colds and the flu is to use effective handwashing techniques.\n\nWhen and How Do You Wash Your Hands?\n\nHandwashing is important before or after different activities. This short video will demonstrate how to wash your hands, and the list below may help you to determine if it might be time to head to the sink for some soap and water.\n• When your hands are visibly soiled\n• After coming in from outside\n• Often during cold and flu season\n• Before sitting down to eat\n• After playing with children or handling children’s toys\n• After handling garbage, using the phone or shaking hands\n• After touching your pet, animal waste, pet food or treats\n• After going to the bathroom or changing a diaper\n• Before and after handling food, being especially careful with raw eggs, meat, seafood and poultry\n• After coming home from the grocery store, school, the mall or church where you may have touched objects\n\nWashing your hands helps to reduce the rising problem with antibiotic resistance as it can prevent respiratory infections and infections causing diarrhea, when antibiotics may be unnecessarily prescribed.22 Preventing the overuse of antibiotics is an important factor in reducing the growing problem of antibiotic resistance. Correctly washing your hands will help to reduce the bacteria living on your hands that may be transferred from person to person. To be truly effective for disease control, consider the following guidelines:\n• Use warm, running water and a mild soap. You do NOT need antibacterial soap, and this has been scientifically verified. Even the U.S. Food and Drug Administration (FDA) has stated,23 “There is currently no evidence that [antibacterial soaps] are any more effective at preventing illness than washing with plain soap and water.”\n• Start with wet hands, add soap and work up a good lather, all the way up to your wrists, scrubbing for at least 15 or 20 seconds (most people only wash for about six seconds). A good way to time this is to sing the “Happy Birthday” song twice.\n• Make sure you cover all surfaces, including the backs of your hands, wrists, between your fingers and around and below your fingernails.\n• Thoroughly dry your hands, ideally using a paper towel. In public places, also use a paper towel to open the door as a protection from germs that the handles may harbor.\n\nToo Much of a Good Thing Is Not Better\n\nHandwashing to prevent spreading germs is a good thing, but overwashing your hands can actually increase your risk of getting sick. When you wash your hands frequently, it removes protective oils on your skin and increases your risk of skin cracks and breaks that let in bacteria. Irritant contact dermatitis is a condition that leads to red, raw and cracked skin that is 4.5 times more likely in health care workers who wash their hands appropriately.24\n\nWashing your hands frequently removes more oils than your skin can produce. Once this happens, it can be challenging to heal.25 Dry, winter air combined with excessive washing at home may lead to the same problem.\n\nThe same issue may occur over your body if you shower more than once daily, especially in the winter months. Another reason you don’t want to wash frequently is that not all bacteria living on your skin is bad bacteria. When you clear your hands completely, you open the door to pathogenic bacteria to take up residence on your hands.26\n\nScientists are attempting to work out what “clean” means, if it doesn’t mean bacteria-free. A group of University of Oregon scientists argues27 that it’s time the medical community rethinks the definition of clean, outside of the necessity for sterile conditions in an operating room. In the past, researchers used jelly-based agar plates to grow bacterial colonies they swabbed from your skin. Today researchers have found that not all bacteria grow on these plates.\n\nUsing DNA sequencing, scientists discovered a vast diversity of bacteria growing on different areas of your body. In fact, the bacteria growing on your elbows is different from that growing on the oily part of your nose or the skin under your arms. If you find yourself becoming anxious about the normal colonies of bacteria living on your skin, it could lead to excessive handwashing that is a symptom of obsessive-compulsive disorder (OCD).28 This is in high contrast to people who leave the bathroom without washing their hands.\n\nFear of germs and dirt, with the compulsion to wash your hands over and over, doesn’t occur overnight and is one of the more common manifestations of OCD. In this case, your behavior is a result of more than a desire for cleanliness. The real purpose of your actions is to reduce your feelings of fear and anxiety. While washing your hands excessively with regular soap may increase your risk for significant skin rashes and cracking, using antibacterial soap is actually worse.\n\nIn this short video, you’ll discover that even research from the FDA shows using antibacterial soap increases the potential for the development of antibiotic-resistant superbugs. Studies have repeatedly demonstrated that regular soap is as effective, if not more so, than antibacterial soaps in preventing the spread of infectious disease.\n\nMost antibacterial soaps contain triclosan that kills all germs except for those that are already antibiotic resistant. This increases the potential for growth of superbugs as they now have less bacterial competition in the same area.\n\nTriclosan was originally introduced as a pesticide in the 1960s, and it is still used in some applications today.29 Dangers from triclosan have been studied and are becoming more widely known. It is an endocrine disruptor, has been associated with early onset of puberty and can accumulate in fat tissue. The chemical has been found in human blood, breast milk and urine samples.\n\nOnce released into wastewater into the environment, the chemical reacts to light and converts into a form of dioxin, another known carcinogen. Triclosan promotes the development and growth of drug-resistant bacteria and is linked to allergies, thyroid dysfunction, weight gain, liver damage30 and an increased inflammatory response.31 Although many recommend hand sanitizer for widespread use, triclosan has been linked with hormone dysregulation in pregnant women and may affect the development of the unborn child.32,33\n\nIt is important to remember that antibacterial soaps are aimed at bacteria, and colds and the flu are caused by viruses. Antibacterial soap is no more effective against viruses than regular soap. The action of using a surfactant agent and friction causes the viruses and bacteria to slip off your hand and not to kill the germs.\n\nThus, regular soap is as effective against spreading infection without the added danger of exposure to triclosan or other chemicals added to antibacterial products. It is also best to avoid alcohol-based sanitizers. These products will significantly reduce bacterial diversity on your skin. Decreasing diversity may increase your potential for carrying a potential pathogen when you eliminate the naturally-occurring protective species. 34\n\nYou may believe a common misconception that if a virus or bacteria enters your body, you will get sick. However, a simple exposure does not determine whether or not you suffer from an illness. Instead, it is the state of your immune system that dictates your body’s response and therefore your likelihood of illness. In one study, 17 people were purposely infected with the flu virus, but only half got sick.35 When researchers tested the participant’s blood, each had an immune response.\n\nIn the patients who became symptomatic, the response indicated both antiviral and an inflammatory response that may have been related to virus-induced oxidative stress.\n\nBut the patients who did not exhibit clinical symptoms had more tightly-regulated cell-mediated responses and an elevated expression of genes that function in an antioxidant response. In other words, half of the group were able to fight off the virus effectively. This means that while handwashing is effective in reducing the spread of germs, you also want to nurture an active immune system.\n\nThere are many factors that influence your immune system over which you have control. Sleep, gut microbiome, sun exposure, grounding, sugar consumption and nutrition are all ways of having a significant impact on the development and support of a strong immune system.", "opengraph": {"locale": "en_US", "type": "article", "title": "How Long Do You Really Need to Wash Your Hands? | Naturally Savvy", "description": "Handwashing is one of the top strategies you can use to prevent the spread of colds, flu, salmonella and other germs that cause illness. The key to this technique is to do it correctly and for the proper amount of time. Several studies have evaluated compliance with handwashing in the general public and health care […]", "url": "https://naturallysavvy.com/care/how-long-do-you-really-need-to-wash-your-hands/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-29T11:53:42+00:00", "article:modified_time": "2019-06-26T15:47:50+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/How-Long-Do-You-Really-Need-to-Wash-Your-Hands.jpg", "image:width": "1021", "image:height": "640", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/6xmM7MoG6SQ\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/6xmM7MoG6SQ"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/EuQP5dmgJh4\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/EuQP5dmgJh4"}], "links": ["https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn1", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn2", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn3", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn4", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn5", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn6", "https://articles.mercola.com/sites/articles/archive/2017/02/06/handwashing-prevent-spread-contagious-disease.aspx", "https://articles.mercola.com/staph-infection/is-staph-infection-contagious.aspx", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn7", "/privacy-policy", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn8", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn9", "https://articles.mercola.com/diarrhea.aspx", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn10", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn11", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn12", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn13", "https://articles.mercola.com/sites/articles/archive/2014/01/06/flu-attack.aspx", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn14", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn15", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn16", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn17", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn18", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn19", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn20", "https://articles.mercola.com/sites/articles/archive/2016/07/05/flumist-vaccine-use.aspx", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn21", "https://articles.mercola.com/sites/articles/archive/2016/07/09/how-antibiotic-resistance-spreads.aspx", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn22", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn23", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn24", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn25", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn26", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn27", "https://articles.mercola.com/sites/articles/archive/2014/10/16/neuroticism-alzheimers-disease-link.aspx", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn28", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn29", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn30", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn31", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn32", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn33", "https://articles.mercola.com/sites/articles/archive/2015/09/29/antibacterial-soap.aspx", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn34", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx#_edn35", "https://articles.mercola.com/sites/articles/archive/2016/12/22/dim-light-exposure-during-sleep-harmful-effects.aspx", "https://articles.mercola.com/sites/articles/archive/2013/01/02/digestive-system-gut-flora.aspx", "https://articles.mercola.com/sites/articles/archive/2017/01/23/how-sun-exposure-improves-immune-function.aspx", "https://articles.mercola.com/sites/articles/archive/2017/02/25/grounding-recharge-immune-system-slow-aging.aspx", "https://articles.mercola.com/sites/articles/archive/2017/06/03/eating-too-much-sugar.aspx", "https://articles.mercola.com/sites/articles/archive/2017/01/23/zinc-immune-system.aspx", "https://articles.mercola.com/sites/articles/archive/2017/10/14/how-long-should-you-wash-your-hands.aspx"], "authors": ["", "Lisa Roth Collins, RHN"], "publish_date": "2018-11-29T11:53:42+00:00"}