{"result_id": "217011", "URL": "https://naturallysavvy.com/eat/5-tips-for-success-on-the-low-fodmap-diet/", "timestamp": "2023-04-25 16:32:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/eat/5-tips-for-success-on-the-low-fodmap-diet/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "5 Tips for Success on the Low-FODMAP Diet | Naturally Savvy", "cleaned_text": "For those following the low-FODMAP diet, I’ve got five essential tips to help you on your way to a more peaceful gut. The low-FODMAP diet is a dietary approach that helps uncover possible triggers without the use of pharmaceutical drugs. If you’re still not familiar with the diet, read more about it here.\n\n1. Get Acquainted with Low- and High-FODMAP Foods\n\nHow well do you know your low- and high-FODMAP foods? Do you know that apples, garlic, onions, mushrooms, milk and honey are high in FODMAPs and blueberries, oranges, eggplant, spinach, Swiss chard, maple syrup, feta cheese, and rice are low in FODMAPs? If you still don’t have a grasp on what’s low and high (and don’t worry, you may not remember them all) I recommend mindfully perusing your low- and high-FODMAP lists from time to time.\n\nPrinting up your lists helps. When I first started the diet, I circled foods that I liked on the low-FODMAP list and other foods that I hadn’t yet tried. This helped me to get creative with new foods and help to plan out my meals. I kept the high-FODMAP foods list handy so I’d be less prone to make any mistakes (and by the way – don’t beat yourself up if you do make a mistake – more on that later in a future post). As you continue to utilize the diet and choose foods to fit your lifestyle, remembering which foods to enjoy and which to avoid becomes second nature.\n\nLow- and high-FODMAP food lists are available online and on apps. You can get a copy of my free, printable low-FODMAP list by clicking here. The information for foods low- and high-FODMAP on my lists comes from research at Monash University on the Monash University Low-FODMAP App. They test and analyze foods for their FODMAP content and are the only source I use.\n\nHave you ever been on a scavenger hunt? You know how it works – you’re usually given a map or hints to help guide you toward finding hidden prizes. So think of your Food and Symptom Diary as your map, the low-FODMAP diet is your scavenger hunt and the prize(s) is when you and your doctor and FODMAPs nutritionist discover your personal triggers for IBS or SIBO. It is pretty rewarding keeping a Food and Symptom Diary, because there are less questions and uncertainties and you may finish all phases of the diet sooner than planned.\n\nRead More: Restoring Gut Health: Recovery From Antibiotics and Vaccines\n• To advise which foods and how much of a food is low or potentially moderate or high in FODMAPs\n• To advise you on healthy serving sizes and help to keep “everything in moderation” so you can never have too much of one food and learn to create a balanced plate at every meal. Eating balanced meals and not overloading the gut with too much of one food is essential especially for those with sensitive guts. Your gut needs a wide variety of nutrients to maintain a good balance of bacteria.\n\nSome foods on the low-FODMAP diet don’t come with a limit for how much you can eat, but others do. For example, iceberg lettuce only has low-FODMAP servings listed, and there aren’t any limits like a moderate or high serving. You could eat iceberg lettuce until your heart’s content but your gut may hate you for it (like bubbling gas from too much of a raw vegetable). Then there are foods that come with moderate or high-FODMAP limits like almonds. A low-FODMAP serving is just 10 nuts but more than 10 or up to 20 or more contain high amounts of the FODMAPs Oilgos-GOS and intake should be avoided.\n\nRead More: Could a Low-FODMAP Diet be the Missing Link for IBS Sufferers\n\nHere are some low-FODMAP foods that can be moderately high in FODMAPs if you have more than the suggested low-FODMAP serving:\n• Avocado: one 1/8 slice of a whole avocado is low; a 1/4 slice is moderate\n• Boysenberry: 5 berries is moderate; there isn’t a low-FODMAP serving for this fruit\n• Chickpeas, canned, rinsed and drained: 1/4 cup is low; 1/2 cup is moderate\n• Sweet potato: 1/2 cup is low; 3/4 cups is moderate; 1 cup is high\n• Wheat pasta: 1/2 cup cooked is low; 2/3 cup is moderate; 1 cup is high\n\nNote: If you know you do not malabsorb the FODMAP present in any of the foods above, you do not need to avoid the moderate to high serving.\n\n“Oh my God I am so hungry and I don’t have anything to eat!” Please don’t make this nail biting, standing-with-the-refrigerator-door-open experience a reality. Planning meals works for everyone. Whether you are a stay at home mom or entrepreneur, or work in the office or on the road, having everything ready will make your life so much easier. The less stressed and 'hangry' you are, the better your gut may feel!\n\nOn your Low-FODMAP Grocery List, circle the low-FODMAP foods you like best and circle some new foods to try.\n• Get calcium and more protein from lactose-free milk and low-FODMAP cheese\n• Get some disease-fighting phytonutrients, vitamins and minerals from low-FODMAP vegetables and herbs to use in salads, omelets, stir fry, sandwiches, soups and more\n• Get more phytonutrients, vitamins and minerals from low-FODMAP fruits to use as snacks, to add to quinoa flakes, smoothies, on top of fish, in salad, in gluten-free pancakes, dessert, or low-FODMAP and gluten-free cereal\n• Don’t forget to pick up olive oil, coconut oil or safflower oil as well as low-FODMAP nut butters, nuts and seeds for vitamins, minerals, omega-3s and healthy fats\n\nCut up veggies and fruit when you bring them home and store in airtight containers in the fridge.\n\nThere are many options for snacks on the low-FODMAP diet. Some you can buy easily at the supermarket, others you can shop for ingredients to then make at home. Having some satisfying snacks on hand is smart because it will keep you from derailing your diet and giving in to high-FODMAP foods. Take a look at this post for 45 Low-FODMAP Snack Ideas.", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Tips for Success on the Low-FODMAP Diet | Naturally Savvy", "description": "For those following the low-FODMAP diet, I’ve got five essential tips to help you on your way to a more peaceful gut. The low-FODMAP diet is a dietary approach that helps uncover possible triggers without the use of pharmaceutical drugs. If you’re still not familiar with the diet, read more about it here. 1. Get […]", "url": "https://naturallysavvy.com/eat/5-tips-for-success-on-the-low-fodmap-diet/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-21T08:54:29+00:00", "article:modified_time": "2019-01-28T18:07:52+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/FB-5-tips-low-fodmap.png", "image:width": "840", "image:height": "434", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/C3bzpcwS7cY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/C3bzpcwS7cY"}], "links": ["https://nsavvy.wpengine.com/eat/could-a-low-fodmap-diet-be-the-missing-link-for-ibs-sufferers", "https://yw244.infusionsoft.com/app/form/d71d8ce18fe13eb49caff3a435775732", "http://www.med.monash.edu.au/cecs/gastro/fodmap/iphone-app.html", "/privacy-policy", "http://www.boncalme.com/booksresources-low-fodmap-digestive-disorder-books/food-symptom-diary/", "https://nsavvy.wpengine.com/restore/restoring-gut-health-recovery-from-antibiotics-and-vaccines", "https://nsavvy.wpengine.com/eat/could-a-low-fodmap-diet-be-the-missing-link-for-ibs-sufferers", "https://nsavvy.wpengine.com/eat/healthy-eating-tips-for-a-busy-lifestyle", "https://nsavvy.wpengine.com/eat/not-just-for-kids-nut-butters-are-protein-rich-and-heart-healthy", "https://nsavvy.wpengine.com/eat/leafy-vegetables-good-for-digestion", "https://nsavvy.wpengine.com/eat/leafy-vegetables-good-for-digestion", "https://nsavvy.wpengine.com/eat/healthy-snacks-for-energy"], "authors": ["", "Colleen Francioli"], "publish_date": "2018-11-21T08:54:29+00:00"}