{"result_id": "217010", "URL": "https://naturallysavvy.com/eat/coping-with-a-healing-crisis-during-a-cleanse/", "timestamp": "2023-04-25 16:32:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/eat/coping-with-a-healing-crisis-during-a-cleanse/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Coping with a Healing Crisis During a Cleanse | Naturally Savvy", "cleaned_text": "Eating a poor diet, overeating, drinking excess alcohol, taking drugs, medications, pollution, cigarette smoke, using commercial body care products such as body lotions, make up, hair spray, and even toothpastes, and many more things we put on or in our bodies all contribute to our toxic load, the chemical build-up that results from months, years, and decades of the body being exposed to toxic residues.\n\nFrom eating a predominantly cooked food diet of processed foods, preserved foods, low quality foods such as refined white sugars, salt, and hydrogenated fats, the body cannot detoxify fast enough. Symptoms of toxicity include low energy, poor mental concentration, weak immunity, and acne, to name a few.\n\nWhen people transition to an 80 percent or more raw living foods diet, the body will start to cleanse and detoxify. Sixty percent of the body toxins can be released within three weeks on a cleansing program. But just as when people give up smoking, alcohol, or even something as addictive as heroin, the body can experience what is called a healing crisis. This reaction can be severe if one is very toxic, or it can be mild if one is reasonably healthy.\n\nA healing crisis occurs when toxins stored in the body's organs and tissues are released at a faster rate than can be properly eliminated. Your body didn't become toxic overnight, and the process of detoxification doesn't happen immediately, or without some uncomfortable side effects, as your body rids itself of the toxins that have been storing there for years. The more toxic your body is, the more severe the detoxification and the more intense the reaction. A cleansing crisis can last minutes or up to two to three days.\n\nGoing from donuts and fried foods to raw foods will likely cause some strong detoxification symptoms. Even a healthy person can become so clean that eventually even residues of old medications that could have stored in the body or vaccinations that can contain heavy metals can eventually be released from the body tissues. This can take months or even years of clean living.\n\nThe best way to get rid of these symptoms is to drink plenty of liquids such as purified water with lemon, fresh juices, herbal teas, and plant digestive enzymes, as these will speed up elimination of the toxins in your system. In severe cases, take liver herbs for two weeks to assist the body (this should also be done annually to help maintain detoxification).\n\nOne of the biggest misconceptions people face with the healing crisis is the belief that they have caught some infection or that an old condition like acne has returned. In actuality, these symptoms are a sign that your body is finally purging itself of the last remnants of the toxins that created the disease or ailment in the first place.\n\nTo feel both physically and emotionally better in the long term, a raw food diet is the way to go. Transitioning slowly by adding more raw living foods to the diet over four to eight weeks will minimize the ill effects of the cleansing process, but some people might prefer to go cold turkey, starting off with a fresh juice cleanse for quick and dramatic results in just one to two weeks.\n• Strong emotions, such as anger, despair, sadness, fear, etc.\n• Get plenty of rest and sleep especially when feeling a severe crisis\n• Use an enema or colonic to provide fast relief\n• A Castor Oil pack on the liver for 20 minutes\n• Exfoliate the skin with a dry skin brush twice daily\n\nMany people also like to consult an experienced raw food coach to help transition with minimal and short cleansing reactions, and accelerate their journey to increased health.\n\nMore on Living Raw Foods from Naturally Savvy", "opengraph": {"locale": "en_US", "type": "article", "title": "Coping with a Healing Crisis During a Cleanse | Naturally Savvy", "description": "Eating a poor diet, overeating, drinking excess alcohol, taking drugs, medications, pollution, cigarette smoke, using commercial body care products such as body lotions, make up, hair spray, and even toothpastes, and many more things we put on or in our bodies all contribute to our toxic load, the chemical build-up that results from months, years, […]", "url": "https://naturallysavvy.com/eat/coping-with-a-healing-crisis-during-a-cleanse/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-21T06:52:28+00:00", "article:modified_time": "2018-11-28T02:49:37+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/Coping-with-a-Healing-Crisis-During-a-Cleanse.jpg", "image:width": "1021", "image:height": "640", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["/privacy-policy", "/eat/raw-sprouted-foods-for-optimal-health/"], "authors": ["", "Wayne Gendel"], "publish_date": "2018-11-21T06:52:28+00:00"}