{"result_id": "217007", "URL": "https://naturallysavvy.com/nest/holistic-pediatric-first-aid-kit/", "timestamp": "2023-04-25 16:32:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/nest/holistic-pediatric-first-aid-kit/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Holistic Pediatric First Aid Kit | Naturally Savvy", "cleaned_text": "Kids don’t come with instruction manuals, so before my first child was born 16 years ago, I had no idea what I was in for.\n\nBut my son quickly initiated me into the world of clinical nursing. As all parents know, bumps, bruises, and scratches are a daily occurrence when you’re dealing with an adventurous youngster. As my toddler discovered his mobility and the world around him there were many spills, tumbles and even the occasional trip to the emergency room for some quick patch-ups.\n\nHow I wish I had been equipped with a first aid kit that included not only the medical supplies I needed to fix his skinned knees, but also the natural remedies that I was just beginning to learn about. For years I searched for such a kit, but to no avail.\n\nInstead, out of necessity, I created my own.\n\nBelow you will find the many components of my holistic pediatric first aid kit. It took some trial and error before I finally came up with the ideal synergy of supplies, but this collection has proven reliable after many years of use; 16 years and four children to be exact.\n\nI encourage you to customize your own kit so that it reflects your own family’s unique needs.\n• Lavender Oil: The pure, unadulterated essential oil of lavender is the most important item to have in your natural first aid kit. There are several different varieties of lavender, the most common being Lavandula vera and Lavandula officinalis. A common favorite — due to its tantalizing fragrance — is Lavendula augustifolia. Whatever the variety, the natural medicinal properties are the same: anti-inflammatory, anti-bacterial and anti-viral. Lavender is also an excellent antidepressant, as its sedative properties help to soothe anger, fear and frustration. It calms the nerves and promotes relaxation. This versatile oil can be used to treat all kinds of cuts, wounds, and especially burns. Lavender is also helpful in cases of nausea, motion sickness, irritated sinuses and headaches. Best of all, it’s safe for all ages.\n• Tea Tree Oil: As with Lavender oil, Tea Tree oil — which is extracted from the branches of the Australian Melaleuca alternifolia tree — has very powerful antiseptic (anti-bacterial/anti-viral) properties. It is also an excellent anti-fungal agent and immunostimulant. This oil is particularly useful in treating cuts, insect bites, herpes and fungal infections. Take caution when applying directly to the skin.\n• Chamomilla: Most often associated with teething, this homeopathic remedy is also very beneficial for treating conditions such as asthma, colic, diarrhea, earache, toothache, insomnia, restlessness, indigestion and anger.\n• Belladonna: Usually, this homeopathic remedy is most often indicated when a child has a high fever that radiates from their flushed, red body. Also used to help combat bedwetting, chickenpox, colic, conjunctivitis, cough, earache, headache and the common cold.\n• Apis Mellifica: Made from crushed bees, this homeopathic remedy is very effective in treating “stinging” sensations, such as those from insects or soothing skin just before or just after receiving vaccinations.\n• Arnica Montana: This one is a parenting must-have. It is available in traditional pellet form and also in creams, salves and ointments. All are recommended. Arnica is usually indicated for any kind of bumps, bruises, or muscle injury/tension/soreness. When pellets are taken immediately after an injury, bruising often does not occur.\n• Calendula cream: There are many products on the market which contain calendula. Salves that have a base of beeswax and/or natural oils such as olive, Vitamin E, and/or jojoba are highly recommended. Calendula is naturally anti-inflammatory and antiseptic. Excellent for scrapes, cuts, rashes, scratches, bumps and bruises.\n• Echinacea/astragalus tincture: Combined, these powerful herbs strengthen and support the immune system. Echinacea is a well-known immunostimulant and is available in many forms. Take caution to only use when needed, however, as prolonged usage can cause the body to create a natural immunity to it. A common recommendation is to use for two-week intervals. Astragalus is an ancient immune tonic used in Traditional Chinese Medicine (TCM). The root can be added to soup broth to increase the nutritional properties, and healing power, of the meal.\n• Garlic oil (with willow, yarrow, mullein, or comfrey extract): Garlic is a known antiseptic and, when blended with the anti-inflammatory and analgesic properties of willow, yarrow, mullein, and/or comfrey, it creates a powerful synergy for treating ear aches and infections. Homemade garlic oil is very easy to produce, inexpensive and just as effective as its store-bought counterpart.\n• Bach Rescue Remedy: is a combination of five different Bach Flower Essences that works on an emotional level to bring balance and tranquility, particularly in times of trauma and intense stress. Many parents find it very helpful to administer a dose just before, and after, vaccinations. It is also helpful in times of unexpected or prolonged separation (separation anxiety).\n• Adhesive bandages (in fun, colorful prints, of course!) for small wounds\n• Needles (and matches to sterilize them with)\n\nAlthough homeopathic remedies are generally considered very safe, it is important to thoroughly research any resource before self-diagnosing. Also, take caution in administering herbal remedies and/or essential oils to infants, and/or pregnant/nursing women. When in doubt, always consult a trusted natural healthcare professional.", "opengraph": {"locale": "en_US", "type": "article", "title": "Holistic Pediatric First Aid Kit | Naturally Savvy", "description": "Kids don’t come with instruction manuals, so before my first child was born 16 years ago, I had no idea what I was in for. But my son quickly initiated me into the world of clinical nursing. As all parents know, bumps, bruises, and scratches are a daily occurrence when you’re dealing with an adventurous […]", "url": "https://naturallysavvy.com/nest/holistic-pediatric-first-aid-kit/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-21T08:20:42+00:00", "article:modified_time": "2019-07-02T21:09:43+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/stories-family-parenting-firstaid250by200.jpg", "image:width": "250", "image:height": "200", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["/privacy-policy", "http://www.rescueremedy.com/", "http://www.rescueremedy.com/"], "authors": ["", "Lisa Roth Collins, RHN"], "publish_date": "2018-11-21T08:20:42+00:00"}