{"result_id": "217029", "URL": "https://naturallysavvy.com/care/n-a-c-could-this-amino-acid-change-your-life/", "timestamp": "2023-04-25 16:32:28 CEST+0200", "meta": {"description": "There are so many health benefits of N‑Acetylcysteine (NAC) or N-A-C. Learn about them all in this comprehensive article.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/care/n-a-c-could-this-amino-acid-change-your-life/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "N-A-C: Could this Amino Acid Change Your Life? | Naturally Savvy", "cleaned_text": "One of the most underestimated and under-utilized natural food supplements I have recommended to my patients over the past 35 years is an amino acid derivative known as N-A-C (N-Acetyl-Cysteine).\n\nWhy underestimated? Well, even naturopaths seldom recommend it and most people who take natural food supplements have never even heard of it.\n\nN-A-C is a form of the essential amino acid cysteine, something used by the body to make glutathione (GSH), one of the body’s most important antioxidants. In fact, all the benefits of N-A-C are due to the fact that it boosts the blood levels of GSH. The major impact of N-A-C is on the immune system, liver protection, detoxification, and cardiovascular health. We all badly need its anti-inflammatory protection.\n\nN-A-C modulates the expression of genes that affect the inflammatory process. It inhibits the expression of pro-inflammatory cytokines, suppresses NF-kappa B and regulates the gene for COX-2 thereby preventing inflammation and pain. These chemicals are involved in hundreds of inflammatory conditions and diseases. In other words, N-A-C is anti-inflammatory and can either blunt or reverse chronic inflammatory conditions.\n\nN-A-C prevents LDL-cholesterol (“bad” cholesterol) from being oxidized and causing inflammatory damage to the blood vessels. N-A-C lowers the levels of homocysteine, which prevents the buildup of plaque in the arteries. The lower the homocysteine, the less likelihood of arterial blockage.\n\nN-A-C is also effective at lowering the blood levels of lipoprotein a (Lp(a)), thought by many scientists to be a more accurate predictor of cardiovascular disease than blood levels of cholesterol. Diet changes and drugs do not lower Lp(a) anywhere as well as N-A-C.\n\nN-A-C also improves insulin resistance and will improve metabolic syndrome, diabetes, and hypoglycemia.\n\nSince GSH has been documented to help numerous neurological conditions such as Parkinson’s Disease, multiple sclerosis, Alzheimer’s, hearing damage, ataxia and ALS (Lou Gehrig's disease), it stands to reason that N-A-C would be helpful because supplementation of it raises the blood levels of GSH.\n\nBecause N-A-C boosts the body’s levels of GSH, it can help to fight viruses. GSH is vital for optimal T and B-lymphocyte function.\n\nOne would think it might be a good idea to supplement the body with GSH, but the major problem here is that GSH is not absorbed intact from the gastrointestinal tract. Oral GSH supplementation is destroyed and inactivated by stomach acid. N-A-C is not.\n\nSupplementation of N-A-C is, therefore, more desirable because the body will make much more GSH than if supplementing GSH orally in any form.\n\nAside from viruses, N-A-C protects the body from numerous pollutants, drugs, microbes and toxic heavy metals like mercury. N-A-C is mucolytic which means that it breaks up heavy and sticky mucous that can build up in conditions such as sinusitis, asthma, bronchitis, pneumonia, and cystic fibrosis. N-A-C is therefore indispensable in any condition that involves excessive mucous.\n\nEvidence exists that N-A-C blocks the progression of most cancers and could be taken with chemotherapy to improve treatment outcomes.\n\nN-A-C protects the body from many different toxins because of its content of sulfhydryl groups that can bind and inactivate herbicides, mercury, cadmium, lead, other toxic heavy metals, drugs like acetaminophen, environmental pollutants, microbes like E. Coli, carbon tertrachloride and aflatoxin. Although not a drug, N-A-C has government approval as a drug to prevent liver damage from acetaminophen (Tylenol) poisoning.\n\nA very common condition that plagues more than 50 million people in North America is a condition known as non-alcoholic fatty liver disease (NAFLD). In this condition, the liver stores excessive amounts of fat mostly due to insulin resistance, metabolic syndrome or diabetes. Liver function tests are usually elevated indicating damage to liver cells and the liver appears grossly fatty on an ultrasound. This condition is benefitted by the strict restriction of simple carbohydrates as well as a vigorous exercise program. Studies also show a significant improvement in liver function tests in those suffering from NAFLD with supplementation of N-A-C. Not only does it protect liver cells but it also helps heal a damaged liver.\n\nN-A-C is mucolytic (dissolves mucous). Many lung and bronchial issues can benefit from high N-A-C supplementation. N-A-C helps reduce the viscosity of mucous so that the body can more easily cough it up. A number of studies also conclude that N-A-C can help to prevent influenza, possible through this mucolytic mechanism.\n\nN-A-C reduces both the frequency and duration of COPD (chronic obstructive pulmonary disease) attacks and may blunt the ravaging clinical course of pulmonary fibrosis, a usually lethal lung disease.\n\nIn my practice, I have had a great deal of success using an N-A-C nasal spray to treat chronic sinus pain and congestion. Combining the spray with high dose oral N-A-C and vitamin C is often more effective than prescription antibiotics for chronic or recurrent sinusitis.\n\nThe bacteria known as H.Pylori has been acknowledged to be the cause of ulcers, gastritis, reflux disorder discomforts and even different types of gastrointestinal cancer. N-A-C supplementation is capable of inactivating H. Pylori and is something worth adding to any resistance to antibiotics H. Pylori infections.\n\nKidney disease is greatly helped by N-A-C supplementation. Even dialysis patients can be helped by as little as 600 mg N-A-C daily to reduce inflammation occurring in chronic kidney disease.\n\nTrichotillomania is a bizarre obsessive-compulsive disorder in which victims pull out their hair for inexplicable reasons causing noticeable hair loss. The usual treatment is anti-depressant drugs or tranquilizers. Studies indicate that N-A-C significantly reduces the compulsive hair pulling.\n\nSchizophrenia, autism, bipolar illness, and other obsessive-compulsive disorders may also be improved with N-A-C.\n\nDue to its antioxidant effects and benefits to the respiratory system, N-A-C improves athletic performance. Specifically, N-A-C reduces muscle fatigue and as proven in double-blind studies, enhances athletic endurance.\n\nIf you can effectively scavenge harmful free radicals it stands to reason that you can prevent premature aging. This phenomenon has indeed been proven in numerous scientific studies.\n\nStudies also indicate that N-A-C may diminish the craving for highly addictive drugs. As such, it may be a useful adjunct in any drug detoxification program.\n\nThere are no accepted ideal dosages for N-A-C. My advice is to start at 600 mg daily and gradually build up to a maximum of 3000 mg daily. Ideally, take with an equivalent amount of vitamin C for maximum free radical scavenging effects.\n\nDespite more than 40 years of clinical use by naturopaths, holistic medical doctors and nutritionists of virtually every stripe, N-A-C has a well-established safety record even at very high dosages over long periods of time (you can take it virtually without worry for months and probably years).\n\nSome people experience nausea when taking N-A-C on an empty stomach but the majority do not experience any side effects if they take it with food.\n\nN-A-C is an important amino acid I have made a part of my practice. Consider discussing it with your health care professional.\n\n[Editor's Note: New Roots Herbals has a high-quality N‑Acetylcysteine (NAC) or check your local health food store.]\n\n1.Chun LJ, Tong MJ, Busuttil RW, Hiatt JR. Acetaminophen hepatotoxicity and acute liver failure. Clin Gastroenterol. 2009 Apr;43(4):342-9.\n\n 2.Simonsen L, Taylor RJ, Viboud C, Miller MA, Jackson LA. Mortality benefits of influenza vaccination in elderly people: an ongoing controversy. Lancet Infect Dis. 2007 Oct;7(10):658-66.\n\n 3.Konturek PC, Konturek SJ, Brzozowski T. Helicobacter pylori infection in gastric cancerogenesis. J Physiol Pharmacol. 2009 Sep;60(3):3-21\n\n 4.Henke MO, Ratjen F. Mucolytics in cystic fibrosis. Paediatr Respir Rev. 2007 Mar;8(1):24-9.\n\n 5.Rogers DF. Mucoactive agents for airway mucus hypersecretory diseases. Respir Care. 2007 Sep;52(9):1176-93; discussion 93-7.\n\n 6.Marchetti A, Rossiter R. Managing acute acetaminophen poisoning with oral versus intravenous N-acetyl cysteine: a provider-perspective cost analysis. J Med Econ. 2009;12(4):384-91.\n\n 7.Saito C, Zwingmann C, Jaeschke H. Novel mechanisms of protection against acetaminophen hepatotoxicity in mice by glutathione and N-acetyl cysteine. Hepatology. Jan;51(1):246-54.\n\n 8.Chun LJ, Tong MJ, Busuttil RW, Hiatt JR. Acetaminophen hepatotoxicity and acute liver failure. J Clin Gastroenterol. 2009 Apr;43(4):342-9.\n\n 9.Atkuri KR, Mantovani JJ, Herzenberg LA. N-Acetyl cysteine—a safe antidote for cysteine/glutathione deficiency. Curr Opin Pharmacol. 2007 Aug;7(4):355-9.\n\n 10.Blesa S, Cortijo J, Mata M, et al. Oral N-acetyl cysteine attenuates the rat pulmonary inflammatory response to antigen. Eur Respir J. 2003 Mar;21(3):394-400.\n\n 11.Majano PL, Medina J, Zubia I, et al. N-Acetyl-cysteine modulates inducible nitric oxide synthase gene expression in human hepatocytes. J Hepatol. 2004 Apr;40(4):632-7.\n\n 12.Siddiqui A, Ancha H, Tedesco D, Lightfoot S, Stewart CA, Harty RF. Antioxidant therapy with N-acetyl cysteine plus mesalamine accelerates mucosal healing in a rodent model of colitis. Dig Dis Sci. 2006 Apr;51(4):698-705.\n\n 13.Geiler J, Michaelis M, Naczk P, et al. N-acetyl-L-cysteine (NAC) inhibits virus replication and expression of pro-inflammatory molecules in A549 cells infected with highly pathogenic H5N1 influenza A virus. Biochem Pharmacol. Feb 1;79(3):413-20.\n\n 14.Jiang XF, Zeng WY, Pu J, Liu YM. Effect of N-acetyl cysteine on lipopolysaccharide stimulating IL-8 expression of human uterine smooth cell. Sichuan Da Xue Xue Bao Yi Xue Ban. 2008 Mar;39(2):235-8.\n\n 15.Kim H, Seo JY, Roh KH, Lim JW, Kim KH. Suppression of NF-kappaB activation and cytokine production by N-acetyl cysteine in pancreatic acinar cells. Free Radic Biol Med. 2000 Oct 1;29(7):674-83.\n\n 16.Chen G, Shi J, Hu Z, Hang C. Inhibitory effect on cerebral inflammatory response following traumatic brain injury in rats: a potential neuroprotective mechanism of N-acetyl cysteine. Mediators Inflamm. 2008;2008:716458.\n\n 17.Origuchi T, Migita K, Nakashima T, et al. Regulation of cyclooxygenase-2 expression in human osteoblastic cells by N-acetyl cysteine. J Lab Clin Med. 2000 Nov;136(5):390-4.\n\n 18.De Flora S, Izzotti A, D’Agostini F, Balansky RM. Mechanisms of N-acetyl cysteine in the prevention of DNA damage and cancer, with special reference to smoking-related end-points. Carcinogenesis. 2001 Jul;22(7):999-1013.\n\n 19.Seo JY, Kim H, Kim KH. Transcriptional regulation by thiol compounds in Helicobacter pylori-induced interleukin-8 production in human gastric epithelial cells. Ann N Y Acad Sci. 2002 Nov;973:541-5.\n\n 20.Kerksick C, Willoughby D. The antioxidant role of glutathione and N-acetyl-cysteine supplements and exercise-induced oxidative stress. J Int Soc Sports Nutr. 2005;2:38-44.\n\n 21.Lin Y, Berg AH, Iyengar P, et al. The hyperglycemia-induced inflammatory response in adipocytes: the role of reactive oxygen species. J Biol Chem. 2005 Feb 11;280(6):4617-26.\n\n 22.Unoki H, Bujo H, Yamagishi S, Takeuchi M, Imaizumi T, Saito Y. Advanced glycation end products attenuate cellular insulin sensitivity by increasing the generation of intracellular reactive oxygen species in adipocytes. Diabetes Res Clin Pract. 2007 May;76(2):236-44.\n\n 23.Dauletbaev N, Fischer P, Aulbach B, et al. A phase II study on safety and efficacy of high-dose N-acetyl cysteine in patients with cystic fibrosis. Eur J Med Res. 2009 Aug 12;14(8):352-8.\n\n 24.Us D. Cytokine storm in avian influenza. Mikrobiyol Bul. 2008 Apr;42(2):365-80.\n\n 25.De Flora S, Grassi C, Carati L. Attenuation of influenza-like symptomatology and improvement of cell-mediated immunity with long-term N-acetyl cysteine treatment. Eur Respir J. 1997 Jul;10(7):1535-41.\n\n 26.Knobil K, Choi AM, Weigand GW, Jacoby DB. Role of oxidants in influenza virus-induced gene expression. Am J Physiol. 1998 Jan;274(1 Pt 1):L134-42.\n\n 27.Kujime K, Hashimoto S, Gon Y, Shimizu K, Horie T. p38 mitogen-activated protein kinase and c-jun-NH2-terminal kinase regulate RANTES production by influenza virus-infected human bronchial epithelial cells. J Immunol. 2000 Mar 15;164(6):3222-8.\n\n 28.Lowy RJ, Dimitrov DS. Characterization of influenza virus-induced death of J774.1 macrophages. Exp Cell Res. 1997 Aug 1;234(2):249-58.\n\n 29.Ungheri D, Pisani C, Sanson G, et al. Protective effect of n-acetyl cysteine in a model of influenza infection in mice. Int J Immunopathol Pharmacol. 2000 Sep-Dec;13(3):123-28.30.McCarty MF, Barroso-Aranda J, Contreras F. Practical strategies for targeting NF-kappaB and NADPH oxidase may improve survival during lethal influenza epidemics. Med Hypotheses. Jan;74(1):18-20.\n\n 31.Garozzo A, Tempera G, Ungheri D, Timpanaro R, Castro A. N-acetyl cysteine synergizes with oseltamivir in protecting mice from lethal influenza infection. Int J Immunopathol Pharmacol. 2007 Apr-Jun;20(2):349-54.\n\n 32.Ghezzi P, Ungheri D. Synergistic combination of N-acetyl cysteine and ribavirin to protect from lethal influenza viral infection in a mouse model. Int J Immunopathol Pharmacol. 2004 Jan-Apr;17(1):99-102.\n\n 33.Jariwalla RJ, Roomi MW, Gangapurkar B, Kalinovsky T, Niedzwiecki A, Rath M. Suppression of influenza A virus nuclear antigen production and neuraminidase activity by a nutrient mixture containing ascorbic acid, green tea extract and amino acids. Biofactors. 2007;31(1):1-15.\n\n 34.Deryabin PG, Lvov DK, Botikov AG, et al. Effects of a nutrient mixture on infectious properties of the highly pathogenic strain of avian influenza virus A/H5N1. Biofactors. 2008;33(2):85-97.\n\n 35.Reichenberger F, Tamm M. N-acetylcystein in the therapy of chronic bronchitis. Pneumologie. 2002 Dec;56(12):793-7.\n\n 36.Sadowska AM, van Overveld FJ, Gorecka D, et al. The interrelationship between markers of inflammation and oxidative stress in chronic obstructive pulmonary disease: modulation by inhaled steroids and antioxidant. Respir Med. 2005 Feb;99(2):241-9.\n\n 37.Stav D, Raz M. Effect of N-acetyl cysteine on air trapping in COPD: a randomized placebo-controlled study. Chest. 2009 Aug;136(2):381-6.\n\n 38.Foschino Barbaro MP, Serviddio G, Resta O, et al. Oxygen therapy at low flow causes oxidative stress in chronic obstructive pulmonary disease: Prevention by N-acetyl cysteine. Free Radic Res. 2005 Oct;39(10):1111-8.\n\n 39.De Benedetto F, Aceto A, Dragani B, et al. Long-term oral n-acetyl cysteine reduces exhaled hydrogen peroxide in stable COPD. Pulm Pharmacol Ther. 2005;18(1):41-7.\n\n 40.van Overveld FJ, Demkow U, Gorecka D, de Backer WA, Zielinski J. New developments in the treatment of COPD: comparing the effects of inhaled corticosteroids and N-acetyl cysteine. J Physiol Pharmacol. 2005 Sep;56 Suppl 4:135-42.\n\n 41.Cai S, Chen P, Zhang C, Chen JB, Wu J. Oral N-acetyl cysteine attenuates pulmonary emphysema and alveolar septal cell apoptosis in smoking-induced COPD in rats. Respirology. 2009 Apr;14(3):354-9.\n\n 42.Meyer A, Buhl R, Magnussen H. The effect of oral N-acetyl cysteine on lung glutathione levels in idiopathic pulmonary fibrosis. Eur Respir J. 1994 Mar;7(3):431-6.\n\n 43.Demedts M, Behr J, Buhl R, et al. High-dose acetylcysteine in idiopathic pulmonary fibrosis. N Engl J Med. 2005 Nov 24;353(21):2229-42.\n\n 44.Tomioka H, Kuwata Y, Imanaka K, et al. A pilot study of aerosolized N-acetyl cysteine for idiopathic pulmonary fibrosis. Respirology. 2005 Sep;10(4):449-55.\n\n 45.Cottin V, Cordier JF. Idiopathic pulmonary fibrosis. Presse Med. 2008 Nov;37(11):1581-90.\n\n 46.Felton VM, Borok Z, Willis BC. N-acetyl cysteine inhibits alveolar epithelial-mesenchymal transition. Am J Physiol Lung Cell Mol Physiol. 2009 Nov;297(5):L805-12.\n\n 47.Peake J, Suzuki K. Neutrophil activation, antioxidant supplements and exercise-induced oxidative stress. Exerc Immunol Rev. 2004;10:129-41.\n\n 48.Quadrilatero J, Hoffman-Goetz L. N-Acetyl-L-cysteine prevents exercise-induced intestinal lymphocyte apoptosis by maintaining intracellular glutathione levels and reducing mitochondrial membrane depolarization. Biochem Biophys Res Commun. 2004 Jul 2;319(3):894-901.\n\n 49.Vassilakopoulos T, Karatza MH, Katsaounou P, Kollintza A, Zakynthinos S, Roussos C. Antioxidants attenuate the plasma cytokine response to exercise in humans. J Appl Physiol. 2003 Mar;94(3):1025-32.\n\n 50.Koechlin C, Couillard A, Simar D, et al. Does oxidative stress alter quadriceps endurance in chronic obstructive pulmonary disease? Am J Respir Crit Care Med. 2004 May 1;169(9):1022-7.\n\n 51.Zembron-Lacny A, Szyszka K, Szygula Z. Effect of cysteine derivatives administration in healthy men exposed to intense resistance exercise by evaluation of pro-antioxidant ratio. J Physiol Sci. 2007 Dec;57(6):343-8.\n\n 52.Aguiar AS, Jr., Tuon T, Soares FS, da Rocha LG, Silveira PC, Pinho RA. The effect of n-acetyl cysteine and deferoxamine on exercise-induced oxidative damage in striatum and hippocampus of mice. Neurochem Res. 2008 May;33(5):729-36.\n\n 53.Quadrilatero J, Hoffman-Goetz L. N-acetyl-l-cysteine protects intestinal lymphocytes from apoptotic death after acute exercise in adrenalectomized mice. Am J Physiol Regul Integr Comp Physiol. 2005 Jun;288(6):R1664-72.\n\n 54.Quadrilatero J, Hoffman-Goetz L. N-acetyl-L-cysteine inhibits exercise-induced lymphocyte apoptotic protein alterations. Med Sci Sports Exerc. 2005 Jan;37(1):53-6.\n\n 55.Kruger K, Frost S, Most E, Volker K, Pallauf J, Mooren FC. Exercise affects tissue lymphocyte apoptosis via redox-sensitive and Fas-dependent signaling pathways. Am J Physiol Regul Integr Comp Physiol. 2009 May;296(5):R1518-27.\n\n 56.Evans JL, Maddux BA, Goldfine ID. The molecular basis for oxidative stress-induced insulin resistance. Antioxid Redox Signal. 2005 Jul-Aug;7(7-8):1040-52.\n\n 57.Anuradha CV. Aminoacid support in the prevention of diabetes and diabetic complications. Curr Protein Pept Sci. 2009 Feb;10(1):8-17.\n\n 58.Guo Q, Mori T, Jiang Y, et al. Methylglyoxal contributes to the development of insulin resistance and salt sensitivity in Sprague-Dawley rats. J Hypertens. 2009 Aug;27(8):1664-71.\n\n 59.Song D, Hutchings S, Pang CC. Chronic N-acetyl cysteine prevents fructose-induced insulin resistance and hypertension in rats. Eur J Pharmacol. 2005 Jan 31;508(1-3):205-10.\n\n 60.Masha A, Manieri C, Dinatale S, Bruno GA, Ghigo E, Martina V. Prolonged treatment with N-acetyl cysteine and L-arginine restores gonadal function in patients with PCO syndrome. J Endocrinol Invest. 2009 Apr 15.\n\n 61.Fulghesu AM, Ciampelli M, Muzj G, et al. N-acetyl-cysteine treatment improves insulin sensitivity in women with polycystic ovary syndrome. Fertil Steril. 2002 Jun;77(6):1128-35.\n\n 62.Guan D, Xu Y, Yang M, Wang H, Wang X, Shen Z. N-acetyl cysteine and penicillamine induce apoptosis via the ER stress response-signaling pathway. Mol Carcinog. 2010 Jan;49(1):68-74.\n\n 63.Li J, Tu HJ, Dai G, et al. N-acetyl cysteine inhibits human signet ring cell gastric cancer cell line (SJ-89) cell growth by inducing apoptosis and DNA synthesis arrest. Eur J Gastroenterol Hepatol. 2007 Sep;19(9):769-74.\n\n 64.Yang J, Su Y, Richmond A. Antioxidants tiron and N-acetyl-L-cysteine differentially mediate apoptosis in melanoma cells via a reactive oxygen species-independent NF-kappaB pathway. Free Radic Biol Med. 2007 May 1;42(9):1369-80.\n\n 65.Krasnowska EK, Pittaluga E, Brunati AM, et al. N-acetyl-l-cysteine fosters inactivation and transfer to endolysosomes of c-Src. Free Radic Biol Med. 2008 Dec 1;45(11):1566-72.\n\n 66.Reliene R, Pollard JM, Sobol Z, Trouiller B, Gatti RA, Schiestl RH. N-acetyl cysteine protects against ionizing radiation-induced DNA damage but not against cell killing in yeast and mammals. Mutat Res. 2009 Jun 1;665(1-2):37-43.\n\n 67.Balansky R, Ganchev G, Iltcheva M, Steele VE, De Flora S. Prevention of cigarette smoke-induced lung tumors in mice by budesonide, phenethyl isothiocyanate, and N-acetyl cysteine. Int J Cancer. 2010 Mar 1;126(5):1047-54.\n\n 68.Nishikawa-Ogawa M, Wanibuchi H, Morimura K, et al. N-acetyl cysteine and S-methylcysteine inhibit MeIQx rat hepatocarcinogenesis in the post-initiation stage. Carcinogenesis. 2006 May;27(5):982-8.\n\n 69.Van Schooten FJ, Besaratinia A, De Flora S, et al. Effects of oral administration of N-acetyl-L-cysteine: a multi-biomarker study in smokers. Cancer Epidemiol Biomarkers Prev. 2002 Feb;11(2):167-75.\n\n 70.Ponz de Leon M, Roncucci L. Chemoprevention of colorectal tumors: role of lactulose and of other agents. Scand J Gastroenterol Suppl. 1997;222:72-5.\n\n 71.Estensen RD, Levy M, Klopp SJ, et al. N-acetyl cysteine suppression of the proliferative index in the colon of patients with previous adenomatous colonic polyps. Cancer Lett. 1999 Dec 1;147(1-2):109-14.\n\n 72.Huynh HQ, Couper RT, Tran CD, Moore L, Kelso R, Butler RN. N-acetyl cysteine, a novel treatment for Helicobacter pylori infection. Dig Dis Sci. 2004 Nov-Dec;49(11-12):1853-61.\n\n 73.Kim MH, Yoo HS, Kim MY, et al. Helicobacter pylori stimulates urokinase plasminogen activator receptor expression and cell invasiveness through reactive oxygen species and NF-kappaB signaling in human gastric carcinoma cells. Int J Mol Med. 2007 Apr;19(4):689-97.\n\n 74.Zala G, Flury R, Wust J, Meyenberger C, Ammann R, Wirth HP. Omeprazole/amoxicillin: improved eradication of Helicobacter pylori in smokers because of N-acetyl cysteine. Schweiz Med Wochenschr. 1994 Aug 9;124(31-32):1391-7.\n\n 75.Gurbuz AK, Ozel AM, Ozturk R, Yildirim S, Yazgan Y, Demirturk L. Effect of N-acetyl cysteine on Helicobacter pylori. South Med J. 2005 Nov;98(11):1095-7.\n\n 76.Palmer LA, Doctor A, Chhabra P, et al. S-nitrosothiols signal hypoxia-mimetic vascular pathology. J Clin Invest. 2007 Sep;117(9):2592-601.\n\n 77.Stenmark KR, Meyrick B, Galie N, Mooi WJ, McMurtry IF. Animal models of pulmonary arterial hypertension: the hope for etiological discovery and pharmacological cure. Am J Physiol Lung Cell Mol Physiol. 2009 Dec;297(6):L1013-32.\n\n 78.Sajkov D, McEvoy RD. Obstructive sleep apnea and pulmonary hypertension. Prog Cardiovasc Dis. 2009 Mar-Apr;51(5):363-70.\n\n 79.Kaldararova M. Why is pulmonary hypertension so frustrating? Bratisl Lek Listy. 2009;110(9):536-43.\n\n 80.Hoshikawa Y, Ono S, Suzuki S, et al. Generation of oxidative stress contributes to the development of pulmonary hypertension induced by hypoxia. J Appl Physiol. 2001 Apr;90(4):1299-306.\n\n 81.Marsden PA. Low-molecular-weight S-nitrosothiols and blood vessel injury. J Clin Invest. 2007 Sep;117(9):2377-80.\n\n 82.Lachmanova V, Hnilickova O, Povysilova V, Hampl V, Herget J. N-acetyl cysteine inhibits hypoxic pulmonary hypertension most effectively in the initial phase of chronic hypoxia. Life Sci. 2005 May 27;77(2):175-82.\n\n 83.Chuang IC, Liu DD, Kao SJ, Chen HI. N-acetyl cysteine attenuates the acute lung injury caused by phorbol myristate acetate in isolated rat lungs. Pulm Pharmacol Ther. 2007;20(6):726-33.\n\n 84.Liu DD, Kao SJ, Chen HI. N-acetyl cysteine attenuates acute lung injury induced by fat embolism. Crit Care Med. 2008 Feb;36(2):565-71.\n\n 85.Hildebrandt W, Alexander S, Bartsch P, Droge W. Effect of N-acetyl-cysteine on the hypoxic ventilatory response and erythropoietin production: linkage between plasma thiol redox state and O(2) chemosensitivity. Blood. 2002 Mar 1;99(5):1552-5.\n\n 86.Iturriaga R, Rey S, Del Rio R, Moya EA, Alcayaga J. Cardioventilatory acclimatization induced by chronic intermittent hypoxia. Adv Exp Med Biol. 2009;648:329-35. Manouchehr Khoshbaten, Akbar Aliasgarzadeh, Koorosh Masnadi, Mohammad K Tarzamani, Sara Farhang,,* Hosain Babaei, Javad Kiani, Maryam Zaare, and Farzad Najafipoor; N-Acetylcysteine Improves Liver Function in Patients with Non-Alcoholic Fatty Liver Disease; Hepat Mon. 2010 Winter; 10(1): 12–16. Published online 2010 March 1.", "opengraph": {"locale": "en_US", "type": "article", "title": "N-A-C: Could this Amino Acid Change Your Life? | Naturally Savvy", "description": "There are so many health benefits of N‑Acetylcysteine (NAC) or N-A-C. Learn about them all in this comprehensive article.", "url": "https://naturallysavvy.com/care/n-a-c-could-this-amino-acid-change-your-life/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2020-03-07T06:00:57+00:00", "article:modified_time": "2020-10-29T21:30:19+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/N-A-C-Could-this-Amino-Acid-Change-Your-Life.jpg", "image:width": "1021", "image:height": "640", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://nsavvy.wpengine.com/Eat/8-immune-system-boosting-foods", "https://nsavvy.wpengine.com/featured/what-chronic-inflammation-really-means-for-your-body/", "/privacy-policy", "https://nsavvy.wpengine.com/Eat/is-tma-the-new-cholesterol", "https://nsavvy.wpengine.com/Care/5-surprising-signs-of-breast-cancer", "https://nsavvy.wpengine.com/Eat/good-carbs-for-athletes", "http://bit.ly/3cs3t4W", "https://nsavvy.wpengine.com/blog/amino-acid-supplementsbenefits-and-hazards/", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Khoshbaten%20M%255Bauth%255D", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Aliasgarzadeh%20A%255Bauth%255D", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Masnadi%20K%255Bauth%255D", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Tarzamani%20MK%255Bauth%255D", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Farhang%20S%255Bauth%255D", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Babaei%20H%255Bauth%255D", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Kiani%20J%255Bauth%255D", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Zaare%20M%255Bauth%255D", "http://www.ncbi.nlm.nih.gov/pubmed/?term=Najafipoor%20F%255Bauth%255D"], "authors": ["", "Dr. Zoltan Rona"], "publish_date": "2020-03-07T06:00:57+00:00"}