{"result_id": "217019", "URL": "https://naturallysavvy.com/general/dr-zoltan-rona-md-msc/", "timestamp": "2023-04-25 16:32:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/general/dr-zoltan-rona-md-msc/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Dr. Zoltan Rona, M.D., M.Sc. | Naturally Savvy", "cleaned_text": "Dr. Zoltan P. Rona is a is a respected medical doctor and has had a private medical practice in Toronto for the past 27 years. He has appeared on radio and TV as well as lectured extensively across The U.S. and Canada. Dr. Rona is one of our well respected bloggers and we are thrilled to be working with him on Naturally Savvy.\n\nDr. Rona has written many books and his more recent books include (Healthy Living Guides Series, Alive Books, 2000):\n\nHis latest book, Vitamin D: The Sunshine Vitamin, is scheduled for release in early 2010.\n\nNaturally Savvy Guide, Andrea Donsky: What is your professional training/education and what are your credentials?\n\nDr. Zoltan Rona: I have published 10 books throughout my career. The latest ones include:Natural Alternatives to Vaccination\n\nI am a graduate of McGill University Medical School (1977) and have a Masters Degree in Biochemistry and Clinical Nutrition from the University of Bridgeport in Connecticut (1984). I am the author of three bestsellers, The Joy of Health (1991), Return to the Joy of Health (1995) and Childhood Illness and The Allergy Connection (1997). I am a co-author with Jeanne Marie Martin of The Complete Candida Yeast Guidebook (1996) and am the medical editor of the Benjamin Franklin Award winning Encyclopedia of Natural Healing (1998). I have had a private medical practice for the past 27 years, and have appeared on radio and TV as well as lectured extensively in the U.S. and Canada.\n\nAndrea Donsky: What made you become interested in practicing medicine from a natural health standpoint as opposed to the traditional medical route?\n\nDr. Zoltan Rona: I got into natural health because of my interest in competitive tennis, trying to improve my results with a better diet and nutritional supplements. At one time I was ranked as a junior and still have a modest ranking in the senior category.When I first started practicing medicine as a conventional MD, I quickly realized that most of what I was doing was just patching things up for people so they can go on with their lives. Unfortunately, since virtually nothing in conventional medicine ever treats the cause of the health problem, the patient continues to have the same problems over and over again without resolution. A typical example of this is middle ear infections in children. The standard thing most MDs still do is prescribe rounds of antibiotics (3 or more courses each year). Then, when that runs its course and the child still has one middle ear infection after another, surgery to put tubes in the ears is the next step. Studies now show that this nonsense can all be avoided by eliminating milk and possibly other food allergies. So, I decided that it would be preferable to look for causes rather than just keep patching things up for people. That led me to recommending diet changes and natural remedies. Once I realized that the results for patients were superior, there was no going back to just the drug and surgery approach for me.\n\nAndrea Donsky: How many books have you published and on what? How can somebody pick up a copy if they would like to buy any of them?\n\nDr. Zoltan Rona: Some of my recent books include:\n\nI am also about to release Vitamin D: The Sunshine Vitamin. All of these books are available from www.Amazon.com.\n\nAndrea Donsky: What advice can you give our visitors about staying healthy (both mind and body)?\n\nDr. Zoltan Rona: My best advice about staying healthy for both mind and body would be to exercise regularly and to use anti-aging nutritional supplements. A healthy body creates a healthy mind. Follow the nutritional guidelines as detailed in the \"Encyclopedia of Natural Healing\". Avoid diet extremes and use a far infrared sauna often to detoxify from all the toxins in air, food and water.\n\nJust about every person over age 40 who consults me about natural remedies has been told by one or more doctors that their physical ailments are just because of “aging”. But nothing is offered as either a remedy or a way of preventing these discomforts.\n\nMy advice at this time is to err on the side of safety and, with few exceptions, avoid anti-aging drugs and hormones. Stick with safe and well-documented natural remedies only. At this time, my anti-aging recommendations are as follows:\n• Coenzyme Q10 (400- 600 mg daily) is an antioxidant with protective effects for the heart and the entire circulatory system. It is made in the body but the liver loses its ability to synthesize Coenzyme Q10 as one gets older. CoQ10 is effective in lowering high blood pressure, clearing periodontal disease, eliminating angina, reversing some cases of congestive heart failure, boosting energy and fighting breast cancer. Animal studies indicate that CoQ10 can increase lifespan by as much as 50% without side effects of any kind. Coenzyme Q10 is important in the functioning of the mitochondria, the organelle of the human cell involved in the production of energy. Without adequate amounts of CoQ10, energy becomes scarce and cells age more rapidly.\n• Acetyl-L-Carnitine (ALC) 1-2 grams before you workout and at bedtime, an L-carnitine derivative which boosts energy and reduces the high catabolic cortisol levels in the blood after intense exercise. ALC enters the blood stream and penetrates cell membranes more effectively than regular L-carnitine. It improves cognitive function in both normally aging individuals and Alzheimer's patients. It strengthens the heart muscle and improves mitochondrial function. Scientists believe that the decline in mitochondrial function may be a cause of aging in humans. ALC prevents this decline and may well be the single most important supplement we can take to maintain and improve overall neurological function.\n• Alpha Lipoic Acid (600 – 1200 mg. daily) is a highly potent antioxidant that counteracts cell damaging free radicals in the mitochondria, thereby preventing aging. Alpha lipoic acid also recycles other antioxidants such as Vitamin E back into their original form after they detoxify free radicals. It can also reduce glycation damage due to excess glucose in the blood, which may be involved in aging, especially the accelerated aging that is common with diabetics.\n• Lycopene (540 ml or approximately two glasses of tomato juice daily) is one of the 600 plant pigments called carotenoids. It is thought to be the best anti-aging carotenoid (twice as potent as beta-carotene) because it is the most efficient quencher of an especially dangerous free radical called singlet oxygen. Lycopene, unlike other antioxidants, is regenerated after quenching singlet oxygen. It can therefore detoxify dangerous molecules without being destroyed. Lycopene levels tend to drop off as we age despite eating the fruits and vegetables (tomatoes, guava, rosehip, watermelon and pink grapefruit) known to contain it. Animal studies indicate that lycopene increases survival and decreases the incidence of both cancer and heart disease. Studies also suggest that daily lycopene intake prevents macular degeneration.\n• Vitamin C (1000 mg or more daily) provides anti-aging effects for practically every cell in the body. Animal studies indicate that regular supplementation can increase lifespan by as much as 20%.\n• Vitamin E (400 IU daily) is the major defender of our cell membranes against oxidative damage and thus aging. Vitamin E works with selenium to boost immune function, reduce the risk of heart attacks in both men and women, and protect us from several types of cancer.\n• Selenium (200 mcg daily) has powerful preventive and therapeutic effects for all types of cancer as well as just about any disease associated with aging including arthritis, diabetes, heart disease and chronic infection.\n• Grapeseed extract (300 mg daily) contains bioflavonoid complexes known as Procyanidolic Oligomers (PCO), which have been reported to be 20 times more potent than vitamin C and 50 times more potent than vitamin E as free radical scavengers (antioxidants). Other names for PCOs include proanthocyanidin, procyanidin, anthocyanidin, Oligomeric Procyanidolic Complexes (OPC) and Pycnogenol. PCO's, like vitamin B complex and vitamin C, are water-soluble and have a long half-life, up to 7 hours after a single dose.\n• Green tea or Camellia sinensis (drink 1 – 3 cups daily providing 240-320 mg of polyphenols) is highly effective anti-aging therapy because it can significantly boost immune function and prevent oxidative damage to all body cells. The Chinese have been using green tea for over 4000 years to increase energy, treat headaches, body aches and pains, digestive problems and depression as well as to prolong life. Green tea contains polyphenols, particularly the catechin called epigallocatechin gallate (EGCG which is thought to be responsible for all its health benefits. While it also contains caffeine, adverse side effects are rare to non-existent.\n• Vitamin B5 (Pantothenic Acid) (1000 mg or more daily) is effective as an anti-aging agent because it is a constituent of coenzyme A which is involved in many chemical reactions essential to life, including the detoxification of many dangerous substances. Animal studies indicate that pantothenic acid supplementation can increase lifespan by as much as 19%.\n• Vitamin B6 (Pyridoxine) (100 mg or more daily) is vital for the metabolism of amino acids tyrosine and phenylalanine and is an essential cofactor (along with vitamin B12 and folic acid) in the body's defense against elevated homocysteine levels linked to arteriosclerosis, heart disease and stroke. Animal studies show that B6 supplementation can increase lifespan by at least 11%.\n\nRegardless of your health status, you can feel very confident in using any or all of these natural anti-aging therapies. While not be as dramatic or flashy as the prescription anti-aging drugs and hormones, I can assure you that there is no concern for long term toxicity or side effects. Also, don’t worry about the need to take numerous pills since several national brand supplement manufacturers have combination products that include the list you see here. If you want to slow down or prevent aging, you can start now with the natural remedies I mentioned above.\n\nAndrea Donsky: How do you maintain balance in your life?\n\nDr. Zoltan Rona: I find exercise to be the most important influence in balancing my life. If it wasn't for tennis, I think I would be much more stressed out. Also, I try to follow my own advice on diet and nutritional supplements.", "opengraph": {"locale": "en_US", "type": "article", "title": "Dr. Zoltan Rona, M.D., M.Sc. | Naturally Savvy", "description": "Dr. Zoltan P. Rona is a is a respected medical doctor and has had a private medical practice in Toronto for the past 27 years. He has appeared on radio and TV as well as lectured extensively across The U.S. and Canada. Dr. Rona is one of our well respected bloggers and we are thrilled […]", "url": "https://naturallysavvy.com/general/dr-zoltan-rona-md-msc/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:author": "https://www.facebook.com/NaturallySavvy/", "article:published_time": "2018-11-21T13:14:51+00:00", "article:modified_time": "2019-07-02T21:13:21+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/stories-blogs-DrRona250x200.jpg", "image:width": "250", "image:height": "200", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.amazon.com/gp/product/1553120094?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120094", "http://www.amazon.com/gp/product/1553120132?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120132", "http://www.amazon.com/gp/product/1553120272?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120272", "http://www.amazon.com/gp/product/1553120191?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120191", "http://www.amazon.com/gp/product/1553120159?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120159", "http://www.amazon.com/gp/product/1553120213?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120213", "http://www.amazon.com/gp/product/155312023X?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=155312023X", "http://www.amazon.com/gp/product/0920470823?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=0920470823", "/privacy-policy", "http://www.amazon.com/gp/product/1553120132?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120132", "http://www.amazon.com/gp/product/1553120272?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120272", "http://www.amazon.com/gp/product/1553120094?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120094", "http://www.amazon.com/gp/product/1553120191?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120191", "http://www.amazon.com/gp/product/1553120159?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120159", "http://www.amazon.com/gp/product/1553120213?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=1553120213", "http://www.amazon.com/gp/product/155312023X?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=155312023X", "http://www.amazon.com/gp/product/0920470823?ie=UTF8&tag=natursavvy-20&linkCode=as2&camp=1789&creative=9325&creativeASIN=0920470823"], "authors": ["", "Andrea Donsky, RHN"], "publish_date": "2018-11-21T13:14:51+00:00"}