{"result_id": "217001", "URL": "https://naturallysavvy.com/care/colostrum-the-miracle-food-you-havent-heard-about/", "timestamp": "2023-04-25 16:32:07 CEST+0200", "meta": {"description": "You may have heard about colostum as baby's first food however, it has health benefits beyond infancy including strenthening the immune system...", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/care/colostrum-the-miracle-food-you-havent-heard-about/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Colostrum, the Miracle Food You Haven't Heard About | Naturally Savvy", "cleaned_text": "It’s the first food Mother Nature intended humans (and other mammals) to feast upon after birth: colostrum. No, you won’t find it on the supermarket shelves in the baby food aisle. The sole natural source is mothers, and thanks to the “magic” of technology and scientific research, it is also available in supplement form.\n\nColostrum is the initial meal provided by all mammals for their newborns. It is a translucent, syrup-like substance produced and expressed by the mother during the first few days following birth and is the only natural source of a wealth of vitamins and minerals, antibodies, immunoglobulins, enzymes, and other important ingredients designed to protect newborns from infection. Colostrum also is credited with prepping the developing immune system to manage its new environment by introducing beneficial bacteria (e.g., Lactobacillus acidophilus and Bifidobacterium) to the digestive system.\n\nIn humans, mothers who breastfeed provide their newborns with this critical first food and immune system supporter. The need for colostrum extends beyond infancy, however, and for children and adults, the source of colostrum is typically from cows (bovine colostrum) in supplement form.\n\nFortunately, bovine colostrum has critical ingredients that are nearly identical to those present in human colostrum. Bovine colostrum is generally well tolerated by humans when taken orally as a supplement to support the immune system and to assist in the enhancement of fat utilization.\n\nWhy do we need colostrum?\n\nThe inhabitants of our microbiome—trillions of microbes—are essential for the regulation of our overall physical, emotional, and mental health. They communicate with each other through a variety of pathways in the body, including the one that runs from the brain to the gut (the gut-brain axis). Therefore, it’s critical that we keep a harmonious balance of these microbes in our gut so we can ward off infections and promote and support the immune system, maintain brain and nerve function, and many other crucial activities.\n\nWhen infants are exposed to colostrum, it helps them develop a healthy microbiome. As we get older, it is our task to help ensure we support and maintain our microbiome through proper nutrition and supplementation, as well as other healthful habits (e.g., sufficient sleep, avoiding toxins, adequate exercise, stress reduction, and so on).\n\nStudies have shown efficacy in preventing influenza and can be useful in high-risk individuals.\n\nIt’s easy for our microbiome to become unbalanced: we eat too much junk food, don’t get enough sleep, experience stress at work, catch a cold or the flu, or any number of other stressors to our system. When the microbes in our gut are out of whack, the gut lining becomes compromised and can allow toxins and microbes from the gut to leak into the bloodstream. That is, the permeability of the gut lining is compromised.\n\nLeaky gut may lead to a wide variety of gastrointestinal and other health problems, including diabetes, multiple sclerosis, and lupus, as well as Alzheimer’s disease, among others. It also can result in poor absorption of essential nutrients, which can result in malnutrition and health problems associated with nutritional deficiencies. Basically, your body can be thrown into distress!\n\nColostrum supplements can come to the rescue. Experts have found that the use of colostrum can restore the lining of a leaky gut. One reason for this ability is that colostrum contains various immunoglobulins, which are substances adept at fighting the bad guys in the gut, such as Escherichia coli, Helicobacter pylori, Campylobacter jejuni, and numerous other microbes and parasites.\n\nColostrum supplements are typically derived from cows (bovine). Research shows that bovine colostrum can restore damage to the gut lining caused by anti-inflammatory drugs such as indomethacin. In one study, for example, researchers reported that use of indomethacin alone caused a threefold increase in gut permeability. When bovine colostrum was taken by healthy volunteers, however, there was no increase in gut permeability. Therefore, colostrum appears to aid in tissue repair and fight inflammation in the gut.\n\nHave you ever suffered from a Candida albicans infection? Colostrum may help. Research has shown that the lactoferrin (an iron-binding protein) in colostrum can penetrate the cell wall of these bacteria, which ultimately results in destroying them.\n\nAnother benefit of colostrum is related to the presence of various growth factors in the product. Growth factors are peptides that help in the production of specific proteins. That means they may stimulate cell regrowth for healthy nerves, cartilage, bones, muscles, and skin. Therefore, colostrum has the potential to help fight aging.\n\nFresh colostrum from cows has a phospholipid coating, which boosts the healthful properties of the supplement. However, when colostrum is processed into a powder or capsule, the coating is lost. Therefore, it is important when shopping for colostrum supplements that you choose one that has had the phospholipid restored so the supplement is soluble and preserved until it reaches the large intestine, where its real work begins in healing the gut and restoring balance to the microbiome.\n\nColostrum supplements are available as capsules, powder, and chewables. Powders are typically absorbed more rapidly and are easily added to smoothies, liquids, and many foods. The body digests capsules more slowly, but they can be easier to transport. Chewables are good for children and for individuals who don’t want to take the other two forms.\n\nGenerally, colostrum is more effective if you take it on an empty stomach; about 30 minutes before or two hours after eating. A general maintenance dose is 1 to 3 grams daily, while anyone who is experiencing occasional significant stress may want to take 10 grams twice a day. Adults who are living with normal stress may take 1 to 5 grams daily, while healthy children usually take 1 to 2 grams daily, although you should check with your pediatrician.\n\nColostrum is Nature’s first food, but it also is available as a supplement for later in life to support immune system function. When looking for colostrum supplements, be sure to choose the liposomal form for optimal absorption and utilization.\n\n[Editor's Note: Symbiotics is a brand that is available on Amazon if you are looking for colostrum supplements.]\n\nAsh M. Colostrum Meets the Microbiome A Tried and True Remedy for Gut Health Takes Centre Stage. 2014 Apr 24\n\nCilieborg MS et al. Bacterial colonization and gut development in preterm neonates. 2012 Mar; 88 (Suppl 1): S41-49\n\nKohler CA et al. The gut-brain axis, including the microbiome, leaky gut and bacterial translocation: mechanisms and pathophysiological role in Alzheimer’s disease. 2016; 22(40): 6152-66\n\nPlayford RJ et al. Bovine colostrum is a health food supplement which prevents NSAID induced gut damage. 1999; 44:653-58.\n\nSamaranayake YH et al. Antifungal effects of lysosozyme and lactoferrin against genetically similar, sequential Candida albicans isolates from a human immunodeficiency virus-infected Southern Chinese cohort. 2001; 39(9):3296-3302.\n\nMaria Rosaria Cesarone, MD et al. Prevention of Influenza Episodes With Colostrum Compared With Vaccination in Healthy and High-Risk Cardiovascular Subjects: The Epidemiologic Study in San Valentino. Clinical and Applied Thrombosis/Hemostasis 2007 Volume: 13 issue: 2, page(s): 130-136", "opengraph": {"locale": "en_US", "type": "article", "title": "Colostrum, the Miracle Food You Haven't Heard About | Naturally Savvy", "description": "You may have heard about colostum as baby's first food however, it has health benefits beyond infancy including strenthening the immune system...", "url": "https://naturallysavvy.com/care/colostrum-the-miracle-food-you-havent-heard-about/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2020-02-02T06:00:40+00:00", "article:modified_time": "2020-10-29T18:53:41+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2020/01/colostrum.jpg", "image:width": "1000", "image:height": "796", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://pubmed.ncbi.nlm.nih.gov/22284985-bacterial-colonization-and-gut-development-in-preterm-neonates/", "https://nsavvy.wpengine.com/blog/reversing-immune-system-impairment-with-colostrum/", "/privacy-policy", "https://nsavvy.wpengine.com/live/meet-your-newest-organ-the-microbiome/", "https://journals.sagepub.com/doi/10.1177/1076029606295957", "https://nsavvy.wpengine.com/nest/babys-immune-system/", "https://pubmed.ncbi.nlm.nih.gov/30081517-retinoic-acid-leaky-gut-and-autoimmune-diseases/?from_term=leaky+gut&from_pos=2", "https://pubmed.ncbi.nlm.nih.gov/27604604-the-gut-brain-axis-including-the-microbiome-leaky-gut-and-bacterial-translocation-mechanisms-and-pathophysiological-role-in-alzheimers-disease/?from_term=leaky+gut&from_page=1&from_pos=6", "https://pubmed.ncbi.nlm.nih.gov/23717570-bovine-colostrum-increases-pore-forming-claudin-2-protein-expression-but-paradoxically-not-ion-permeability-possibly-by-a-change-of-the-intestinal-cytokine-milieu/", "https://www.clinicaleducation.org/resources/reviews/colostrum-meets-the-microbiome-a-tried-and-true-remedy-for-gut-health-takes-center-stage/", "https://pubmed.ncbi.nlm.nih.gov/23084918-intestinal-commensal-microbes-as-immune-modulators/", "https://pubmed.ncbi.nlm.nih.gov/11526166-antifungal-effects-of-lysozyme-and-lactoferrin-against-genetically-similar-sequential-candida-albicans-isolates-from-a-human-immunodeficiency-virus-infected-southern-chinese-cohort/", "https://www.symbiotics.com/frequently-asked-questions/", "https://amzn.to/38WokLb", "https://amzn.to/3d7bQ6f", "https://nsavvy.wpengine.com/eat/8-immune-system-boosting-foods/", "https://pubmed.ncbi.nlm.nih.gov/30081517-retinoic-acid-leaky-gut-and-autoimmune-diseases/?from_term=leaky+gut&from_pos=2", "https://www.clinicaleducation.org/resources/reviews/colostrum-meets-the-microbiome-a-tried-and-true-remedy-for-gut-health-takes-center-stage/", "https://pubmed.ncbi.nlm.nih.gov/22284985-bacterial-colonization-and-gut-development-in-preterm-neonates/", "https://pubmed.ncbi.nlm.nih.gov/23084918-intestinal-commensal-microbes-as-immune-modulators/", "https://pubmed.ncbi.nlm.nih.gov/27604604-the-gut-brain-axis-including-the-microbiome-leaky-gut-and-bacterial-translocation-mechanisms-and-pathophysiological-role-in-alzheimers-disease/?from_term=leaky+gut&from_page=1&from_pos=6", "https://pubmed.ncbi.nlm.nih.gov/23717570-bovine-colostrum-increases-pore-forming-claudin-2-protein-expression-but-paradoxically-not-ion-permeability-possibly-by-a-change-of-the-intestinal-cytokine-milieu/", "https://pubmed.ncbi.nlm.nih.gov/11526166-antifungal-effects-of-lysozyme-and-lactoferrin-against-genetically-similar-sequential-candida-albicans-isolates-from-a-human-immunodeficiency-virus-infected-southern-chinese-cohort/", "https://journals.sagepub.com/doi/10.1177/1076029606295957"], "authors": ["", "Lisa Roth Collins, RHN"], "publish_date": "2020-02-02T06:00:40+00:00"}