{"result_id": "217025", "URL": "https://naturallysavvy.com/care/fixing-your-gut-bacteria-can-help-with-autoimmune-conditions/", "timestamp": "2023-04-25 16:32:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2018/11/Naturally-Savvy-Favicon.png", "canonical": "https://naturallysavvy.com/care/fixing-your-gut-bacteria-can-help-with-autoimmune-conditions/", "encoding": "UTF-8"}, "image": null, "domain": "naturallysavvy.com", "title": "Fixing Your Gut Bacteria Can Help With Autoimmune Conditions | Naturally Savvy", "cleaned_text": "There are trillions of critters in your gastrointestinal tract and they play a key role in your overall health. They are bacteria called microbiota. Some of them are healthy and some are unhealthy.\n\nGut bacteria has been linked to a slew of diseases, including autoimmune conditions. Yale researchers found that bacteria in the small intestines of mice and humans can migrate to other organs and even cause an autoimmune response. Their study, recently published in Science, suggest that there may be promising new treatments for chronic autoimmune conditions such as systemic lupus and autoimmune liver disease.\n\nThe researchers focused on a certain type of bacteria called Enterococcus gallinarum, which they found is able to migrate outside of the gut to the lymph nodes, liver and spleen. They found that in mice, E. gallinarum started producing auto-antibodies and inflammation, which are signs of an autoimmune response. They also found inflammation in cultured liver cells of healthy people, and E. gallinarum in livers of people with an autoimmune condition. In other experiments, researchers discovered they could suppress autoimmunity in mice through a vaccine or an antibiotic targeted to E. gallinarum and stop growth of the bacterium in the tissues.\n\n“When we blocked the pathway leading to inflammation, we could reverse the effect of this bug on autoimmunity,” said senior author Martin Kriegel, M.D. “Treatment with an antibiotic and other approaches such as vaccination are promising ways to improve the lives of patients with autoimmune disease,” he said.\n\nHow you can improve our gut bacteria\n\nThere are ways to improve our gut bacteria. One way is through probiotics, which contain living microorganisms. Studies on gut bacteria found that probiotics not only may restore the composition of the gut microbiome, but may introduce beneficial functions to gut bacteria, which could lead to preventing gut inflammation.\n\nAnother way to improve gut bacteria is by consuming prebiotic foods, which are fiber that serve as food for probiotics. There are a number of prebiotic foods, including:\n\nThey key is to focus on healthy foods such as fiber, according to the Physicians Committee for Responsible Medicine. Aim to at least 40 grams of fiber a day. Avoid foods such as high-fat dairy products, fried foods, sugar, and food additives.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fixing Your Gut Bacteria Can Help With Autoimmune Conditions | Naturally Savvy", "description": "There are trillions of critters in your gastrointestinal tract and they play a key role in your overall health. They are bacteria called microbiota. Some of them are healthy and some are unhealthy. Read about gut bacteria Gut bacteria has been linked to a slew of diseases, including autoimmune conditions. Yale researchers found that bacteria […]", "url": "https://naturallysavvy.com/care/fixing-your-gut-bacteria-can-help-with-autoimmune-conditions/", "site_name": "NaturallySavvy.com", "article:publisher": "https://www.facebook.com/NaturallySavvy", "article:published_time": "2018-11-21T09:35:16+00:00", "article:modified_time": "2019-06-05T18:52:29+00:00", "image": "https://naturallysavvy.com/wp-content/uploads/2018/11/gut_bacteria_autoimmune.jpg", "image:width": "840", "image:height": "557", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://nsavvy.wpengine.com/eat/healthy-intestinal-flora-colonics", "http://science.sciencemag.org/content/359/6380/1156", "https://news.yale.edu/2018/03/08/enemy-within-gut-bacteria-drive-autoimmune-disease", "/privacy-policy", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3539293/", "https://nsavvy.wpengine.com/eat/probiotics-essential-for-good-health", "https://www.pcrm.org/health/health-topics/healthy-gut-prebiotics-and-probiotics"], "authors": ["", "Gina-Marie Cheeseman"], "publish_date": "2018-11-21T09:35:16+00:00"}