{"result_id": "219047", "URL": "https://neonnettle.com/news/11369-bill-gates-accused-of-trying-to-bribe-nigerian-lawmakers-to-pass-health-bill", "timestamp": "2023-04-25 16:34:54 CEST+0200", "meta": {"description": "Neon Nettle - Bill Gates Accused of Trying to Bribe Nigerian Lawmakers to Pass Health Bill - Nigeria's opposition party claims billionaire used bribe to pass infectious disease bill", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/11369-bill-gates-accused-of-trying-to-bribe-nigerian-lawmakers-to-pass-health-bill", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Bill Gates Accused of Trying to Bribe Nigerian Lawmakers to Pass Health Bill", "cleaned_text": "Bill Gates Accused of Trying to Bribe Nigerian Lawmakers to Pass Health Bill\n\nBill Gates has been accused of attempting to bribe lawmakers in Nigeria in order to pass an infectious disease bill, according to reports.\n\nThe billionaire Microsoft co-founder and American philanthropist has denied offering Nigerian lawmakers a $10 million bribe to pass the legislation, Nigeria’s Premium Times reported on Monday.\n\nNigeria’s opposition party, the Coalition of United Political Parties (CUPP), alleges that Gates offered politicians $10 million to secure the “speedy passage” of the health bill.\n\nThe party cites a “human intelligence report” for the information.\n\nThe bill aims to curb the spread of infectious diseases in the country, where the Bill and Melinda Gates Foundation has active interests.\n\nA Nigerian House of Representatives committee is reportedly investigating the alleged bribery.\n\nThe committee listened to a statement from the Bill and Melinda Gates Foundation denying the allegations on Monday, according to Breitbart.\n\n\"The Bill and Melinda Gates Foundation has recently been made aware of an allegation circulating in certain elements of the Nigerian media that the Foundation was involved in a payment purportedly made to the Nigeria House of Representatives,” the Gates Foundation’s Nigeria representative, Paulin Basinga, said.\n\n\"Any such allegations are entirely false and without merit.\n\n\"To be clear, the Foundation has not offered any financial incentives to any member of Nigeria’s legislative branch for the passage of legislation nor has it offered any grants to organizations in Nigeria in connection with the same,” Basinga added.\n\nThe proposed legislation has caused controversy in Nigeria.\n\nCitizens fear the bill allows Nigerian authorities excessive power to enforce measures meant to curb the spread of infectious diseases such as typhoid, cholera, and dengue fever.\n\nThe bill also calls for “compulsory vaccination.”\n\nOn May 11, the Premium Times reported on the bill’s most controversial sections:\n\nSections 46 and 47 of the Bill provide for compulsory vaccination of children and adults with some specified vaccines. Section 15 of the Bill empowers the DG [Director General of the Nigeria Center for Disease Control] to issue a notice to take over a citizen’s property and declare it an isolation center without the consent and permission of the owner. Section 24 empowers an Enforcement Officer to get an order from a Court [magistrate] to destroy a building where infectious disease occurred.\n\nIn 2018, the Bill and Melinda Gates Foundation agreed to pay off Nigeria’s $76 million polio debt, which the country had acquired to combat its national polio epidemic.\n\nThe Foundation approved the debt write-off after Nigeria met certain conditions, including the guarantee of “more than 80 percent vaccination coverage in at least one round [of government-mandated vaccination] each year in very high-risk areas” for polio.", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/bill-gates-accused-bribe-nigerian-lawmakers-health-bill-120520.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Bill Gates Accused of Trying to Bribe Nigerian Lawmakers to Pass Health Bill", "description": "Nigeria's opposition party claims billionaire used bribe to pass infectious disease bill - Bill Gates has been accused of attempting to bribe lawmakers in Nigeria in order to pass an infec... | NEON NETTLE"}, "tags": ["Health", "Bill Gates"], "tweets": [], "movies": [], "links": ["https://www.premiumtimesng.com/news/top-news/393453-infectious-disease-bill-bill-gates-denies-offering-bribe-to-nigerian-lawmakers.html", "https://www.breitbart.com/africa/2020/05/19/nigerian-opposition-party-claims-bill-gates-tried-bribe-politicians-pass-health-bill/", "https://opinion.premiumtimesng.com/2020/05/11/what-nigerians-should-not-know-about-the-control-of-infectious-diseases-bill-2020-by-kingsley-chinda/", "https://www.breitbart.com/news/bill-and-melinda-gates-foundation-to-pay-nigerias-76m-polio-debt/", "../../news/11314-bill-gates-funded-covid-19-tracking-program-shut-down-by-fda", "../../"], "authors": ["Jay Greenberg"], "publish_date": "2020-05-20"}