{"result_id": "219045", "URL": "https://neonnettle.com/news/5954-scientists-create-edible-vaccine-for-honey-bees-to-protect-from-deadly-diseases", "timestamp": "2023-04-25 16:34:48 CEST+0200", "meta": {"description": "Neon Nettle - Scientists Create Edible Vaccine for Honey Bees to Protect from Deadly Diseases - First ever vaccination for insects created at the University of Helsinki in Finland", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/5954-scientists-create-edible-vaccine-for-honey-bees-to-protect-from-deadly-diseases", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Scientists Create Edible Vaccine for Honey Bees to Protect from Deadly Diseases", "cleaned_text": "Scientists Create Edible Vaccine for Honey Bees to Protect from Deadly Diseases\n\nFirst ever vaccination for insects created at the University of Helsinki in Finland\n\nScientists at the University of Helsinki in Finland have created the first-ever vaccine for insects, as they are hoping to save one of the most crucial pollinators in the world: the honey bee.\n\nThe university said in a news release that the new bee vaccine, which is edible, “protects bees from diseases while protecting global food production.”\n\nResearchers said the goal is to protect the bees against American foulbrood, “a bacterial disease caused by the spore-forming Paenibacillus larvae ssp. Larvae.”\n\nThe disease is the “most widespread and destructive of the bee brood diseases,” the university explained.\n\nBloomberg reported the disease can kill “entire colonies” while its “spores can remain viable for more than 50 years.”\n\nAccording to Fox News, to distribute the vaccine, scientists place a sugar patty in the hive, which the queen then eats over the course of about a week.\n\nOnce ingested, the pathogens in the patty are then passed into the queen’s eggs, “where they work as inducers for future immune responses,” the university explained in the statement.\n\nThe vaccine — which is not yet sold commercially, according to Bloomberg — is also significant because it was once not thought possible to develop a vaccine for insects, as these creatures’ immune systems do not contain antibodies.\n\n\"Now we've discovered the mechanism to show that you can actually vaccinate them,\" Dalial Freitak, a University of Helsinki scientist who worked to create the vaccine, said in a statement.\n\n\"You can transfer a signal from one generation to another.\"\n\nHoney bees are important to the U.S. crop production, contributing an estimated $20 billion to its value, according to the American Beekeeping Foundation.\n\nThe species pollinate a variety of crops, including apples, melons, blueberries, and cherries — the latter two are “90 percent dependent on honey bee pollination,” according to the foundation.\n\n“One crop, almonds, depends entirely on the honey bee for pollination at bloom time,” the American Beekeeping Foundation added.\n\nThe honey bee population in North America has been affected by Colony Collapse Disorder (CCD) disease, mites and possibly the use of neonicotinoid pesticides, according to the Harvard University Library.\n\nOn average, beekeepers in the U.S. lost an estimated 40 percent of their managed honey bee colonies from April 2017 to April 2018, according to Bee Informed, a nationwide collaboration of research efforts to better understand the decline of honeybees.\n\n\"We need to help honey bees, absolutely. Even improving their life a little would have a big effect on the global scale,” Freitak said.\n\n\"Of course, the honeybees have many other problems as well: pesticides, habitat loss and so on, but diseases come hand in hand with these life-quality problems.\n\n“If we can help honey bees to be healthier and if we can save even a small part of the bee population with this invention, I think we have done our good deed and saved the world a little bit,\" Freitak added.", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/honey-bee-vaccine-3161218.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Scientists Create Edible Vaccine for Honey Bees to Protect from Deadly Diseases", "description": "First ever vaccination for insects created at the University of Helsinki in Finland - Scientists at the University of Helsinki in Finland have created the first-ever vaccine for insec... | NEON NETTLE"}, "tags": ["Insect", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.helsinki.fi/en/news/society-economy/the-worlds-first-bee-vaccine-improving-sleep-quality-and-other-scientific-innovations-help-to-solve-serious-challenges-at-slush-2018", "https://www.helsinki.fi/en/news/sustainability-news/the-first-ever-insect-vaccine-primebee-helps-bees-stay-healthy", "https://www.bloomberg.com/news/articles/2018-12-06/world-s-first-honey-bee-vaccine-seeks-to-save-dying-pollinators", "https://www.foxnews.com/science/scientists-create-edible-honey-bee-vaccine-to-protect-them-from-deadly-diseases", "https://www.abfnet.org/page/PollinatorFacts", "https://guides.library.harvard.edu/c.php?g=310733&p=2072758", "https://beeinformed.org/results/honey-bee-colony-losses-2017-2018-preliminary-results/"], "authors": ["Jay Greenberg"], "publish_date": "2018-12-26"}