{"result_id": "219048", "URL": "https://neonnettle.com/news/14716--million-maskless-march-planned-in-florida-as-celebration-of-freedom-", "timestamp": "2023-04-25 16:34:57 CEST+0200", "meta": {"description": "Neon Nettle - ‘Million Maskless March’ Planned in Florida as 'Celebration of Freedom' - 'April 10 marks one year of mask tyranny'", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/14716--million-maskless-march-planned-in-florida-as-celebration-of-freedom-", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "‘Million Maskless March’ Planned in Florida as 'Celebration of Freedom'", "cleaned_text": "‘Million Maskless March’ Planned in Florida as 'Celebration of Freedom'\n\nA new anti-mask protest is being planned by a local Floridian who is calling on residents to march on April 10 to “mark that date with a celebration of freedom.”\n\n“You are invited to the Million Maskless March and Mask Burning, Saturday, April 10, 2021, at 3pm at the Corner of A1A and Las Olas in Ft Lauderdale!\"\n\n“April 10 marks one year of mask tyranny in Broward County and we will mark that date with a celebration of freedom!\"\n\n\"It will feature recognition and prizes for those who have faithfully endured this last year, addresses from local leaders and activists, and most importantly (and fun) a mask burning!” Nelson wrote.\n\nNelson adds he now has the backing from authorities.\n\n“The mask burning is in full cooperation with local law enforcement and will be done in a safe and controlled manner,\" he wrote.\n\n\"Following the mask burning we will March north on A1A, make a sharp left at Seabreeze and march back to where we began. The event will be over by 5 pm,” he wrote.\n\n“April is a very busy time for Ft Lauderdale Beach, and this is exactly why this location was chosen,” Nelson wrote. “Our goal is for people to see us and be inspired to join in!”\n\n“Signs are VERY important. Signs with three to six BIG BOLD WORDS are the best. “MASKS ARE SLAVERY. \" “NO MORE MASKS. \" “MASKS OFF CHILDREN. \"\n\n“This is a non-partisan event but ALL political signs and flags are welcome!”\n\nThe news of the event came after Joe Biden demanded that state and local leaders reimpose mask mandates and halt their efforts to return to normal life.\n\nBiden called on governors to pause their plans to reopen their states as he touted his administration’s efforts to combat the COVID-19 pandemic.\n\nThe Biden administration is also working on COVID-19 vaccine passports for Americans to use as proof of vaccination via a scannable code similar to an airline boarding pass.\n\nIn contrast, Florida Gov. Ron DeSantis announced he would issue an executive order banning “vaccine passports” from being used by governments and businesses as proof residents have been vaccinated.\n\nDeSantis convened at the state Capitol to sign into law a bill that would ban COVID-related lawsuits against businesses that have made good-faith efforts to comply with coronavirus guidelines.\n\nThe Republican governor said he would also take the additional step of barring businesses from refusing to serve people who can't prove vaccination.\n\n“We always said we wanted to provide it for all but mandate it for none,” DeSantis said at a press conference.\n\n“And that was something that, while it was advised to take particularly if you’re vulnerable, we were not going to force you to do it.”\n\n“It’s completely unacceptable for either the government or the private sector to impose upon you the requirement that you show proof of vaccine to just simply participate in normal society,” he added.\n\n“You want to go to a movie theater, should you have to show that? No. You want to go to a game, a theme park? No. So we’re not supportive of that.”\n\n“You’re going to do this and what, give all this information to some big corporation? You want the fox to guard the hen house? I mean, give me a break,” the governor said.\n\n“I think this is something that has huge privacy implications. It is not necessary to do.”\n\nPetition to Stop Rollout of 'Vaccine Passports' Goes Viral", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/Million-Maskless-March-Planned-in-Florida-as-Celebration-of-Freedom.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "‘Million Maskless March’ Planned in Florida as 'Celebration of Freedom'", "description": "'April 10 marks one year of mask tyranny' - A new anti-mask protest is being planned by a local Floridian who is calling on residents to marc... | NEON NETTLE"}, "tags": ["Protest", "coronavirus"], "tweets": [], "movies": [], "links": ["https://freeflorida.me/thread/316-million-maskless-march-mask-burning-in-ft-lauderdale/", "../../news/14705-biden-demands-state-leaders-reimpose-mask-mandates-stop-reopening-efforts", "../../news/14690-biden-admin-working-on-scannable-vaccine-passports", "../../news/14711-florida-gov-desantis-to-ban-covid-vaccine-passports-", "../../news/14371-petition-to-stop-rollout-of-vaccine-passports-goes-viral"], "authors": ["Daniel Newton"], "publish_date": "2021-03-31"}