{"result_id": "219022", "URL": "https://neonnettle.com/news/12767-bill-gates-western-taxpayers-must-pay-for-rest-of-the-world-s-covid-vaccinations", "timestamp": "2023-04-25 16:33:40 CEST+0200", "meta": {"description": "Neon Nettle - Bill Gates: Western Taxpayers Must Pay for Rest of the World's COVID Vaccinations - Billionaire argues US and European governments should foot the bill", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/12767-bill-gates-western-taxpayers-must-pay-for-rest-of-the-world-s-covid-vaccinations", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Bill Gates: Western Taxpayers Must Pay for Rest of the World's COVID Vaccinations", "cleaned_text": "Bill Gates: Western Taxpayers Must Pay for Rest of the World's COVID Vaccinations\n\nBillionaire argues US and European governments should foot the bill\n\nBillionaire Bill Gates is calling for taxpayer money from Western nations to be used to fund COVID-19 vaccines in countries around the world.\n\nMicrosoft CEO-turned-coronavirus enthusiast Gates argues that nations in the West must dedicate more government funding for vaccines and distribution networks around the globe.\n\nAccording to Gates, paying for billions of doses of vaccines for poorer countries is the only way we can eradicate COVID-19 in the West and return to our normal lives.\n\nGates, the second richest man in the world, says third world countries don’t have the financial clout to strike deals, such the $2 billion agreement that Washington struck with Pfizer, so the responsibility falls into the lap of the Western taxpaying public.\n\nHoarding supplies of vaccines isn’t just wrong, Gates argues, it’s counterproductive – and we in the West must pay the costs involved in vaccinating everyone, in every country.\n\nBut it’s not just a question of donating supplies, however.\n\nThe Western world and its leading corporations must collaborate with governments to start ramping up supply chains to ensure that the production of billions of doses of the vaccine can be produced quickly once emergency approval has been granted, ZeroHedge reports.\n\nGates laid out his an editorial in the Nikkei Asian Review, the English-language flagship of the Japanese financial publishing and data giant:\n\nBecause we can immunize against the disease, governments will be able to lift social distancing measures. People will stop having to wear masks. The world’s economy will start running again at full speed. But elimination will not happen by itself. To achieve this goal, the world first needs three things: the capacity to produce billions of vaccine doses, the funding to pay for them, and systems to deliver them. Right now, most of the world’s supply of COVID-19 vaccines is slated to go to rich countries. These nations have been making deals with pharmaceutical companies, securing the right to buy billions of doses as soon as they are produced. But what about low- and lower-middle income nations of the world, everywhere from South Sudan to Nicaragua to Myanmar? These nations are home to nearly half of all human beings, and they do not have the purchasing power to make big deals with pharmaceutical companies. As things stand now, these countries will be able to cover, at most, 14% of their people.\n\nTo support his case, Gates cites new modeling from Northeastern projecting that the death toll will be twice as high if vaccines aren't widely distributed in the developing world.\n\nNew modeling from Northeastern University helps illustrate what will happen if vaccine distribution is so unequal. The researchers there analyzed two scenarios. In one, vaccines are given to countries based on their population size. Then there is another scenario that approximates what is happening now: 50 rich countries get the first two billion doses of vaccine. In this scenario, the virus continues to spread unchecked for four months in three quarters of the world. And almost twice as many people die. This would be a huge moral failing. A vaccine can make COVID-19 a preventable disease, and no one should die from a preventable disease simply because the country they live in cannot afford to secure a manufacturing deal. But you do not even have to care about fairness to see the problem with the \"rich-country-only\" scenario.\n\nAs Gates claims: The only way to eliminate the threat of SARS-CoV-2 anywhere, is to eliminate it everywhere.\n\nFortunately, corporations like Pfizer and Gilead are collaborating to ramp up supplies not just of vaccines, but of therapeutics like Gilead's remdesivir.\n\nRemarkable progress has already been made on this front when it comes to therapeutics. Pharmaceutical companies have agreed to expand drugmaking capacity by using each other's factories. remdesivir, for example, was created by Gilead, but extra quantities will now be produced in Pfizer factories. No company had ever allowed its factories to be used by a competitor in this way, and now we are seeing similar cooperation when it comes to vaccines. In addition to the manufacturing capacity to make them, we also need the funding to pay for billions of vaccine doses for poorer nations. This is where the ACT Accelerator can help. It is an initiative supported by organizations like Gavi and the Global Fund. Not many people have heard of them, but they have spent two decades becoming experts in the task of financing vaccines, drugs, diagnostics.\n\nAfter all, trying to \"shame\" developed countries for simply trying to protect their citizens isn't a strategy.\n\nWhile President Trump's \"Operation Warp Speed\" handed billions of dollars to vaccine developers, Gates claims that the UK and Japan, which have both publicly promised to set aside vaccine supplies for poorer nations, should be emulated by other western nations - cough, the US, cough.\n\nBut it's not enough to simply manufacture the vaccines, an endeavor that would likely cost billions upon billions of dollars.\n\nThe west should help the developing world create a network of on-the-ground health-care workers around the world to help administer the vaccines and report any new threats of zoological transmission.\n\nThe United Kingdom is a good model for what other wealthy nations should do. It has donated enough money for the Accelerator to procure, probably, hundreds of millions of vaccine doses for poor countries. So do countries like Japan. The Japanese government was the first advanced economy to announce a public commitment of 17.2 billion yen ($16 million) on Sep. 15 to secure doses for poorer nations. But more are still needed. I hope other nations are as generous. Finally, even when the world has the manufacturing capacity and funding lined up, we will need to strengthen health systems - the workers and infrastructure that can actually deliver vaccines to people around the world. There is a lot of be learned from the ongoing effort to eradicate polio. One of the most famous photos of the polio eradication effort in India was of a line of health workers. They were carrying vaccine coolers over their heads as they waded through waist-deep floodwaters to reach a remote village. Spotting COVID-19 cases in the poorest parts of the world will take a similar network of primary health workers - one that can reach places where even roads cannot. With good diagnostics, these workers can also sound the alarm if another disease jumps from a bat - or bird - to a human.\n\nThere are, in effect, three parts to Gates' plan, as he teases in the headline: vaccines are the only solution (not \"herd immunity\" - God forbid), going \"global\" is the only right way to do it, and - most importantly - more public money is needed to make it happen.\n\nTypically, self-interest and altruism require opposite behaviors, but in this rare case, Gates argues, the altruistic thing is also an act of self-interest, since the only way we can eradicate COVID-19 would be to ensure the entire world is vaccinated, spending public money on vaccines bound for poorer nations makes sense.\n\nIn other words, in eliminating COVID-19, we can also build the system that will help reduce the damage of the next pandemic.\n\nAnd by building a global on-the-ground health-care network, we will be able to detect the next killer virus before it becomes a pandemic.\n\nTo sum up: Americans don't need all those vaccines!\n\nThey're not even going to take them!\n\nMaybe the federal government should turn supplies over to the Gates Foundation and WHO, which are already working on expanding access to vaccines.\n\nWait a second: Didn't Chinese President Xi Jinping say China was going to provide vaccines to the entirety of the developing world as part of its quest to \"atone\" for unleashing the virus in the first place?\n\n[RELATED] Petition to Investigate Bill Gates for 'Crimes Against Humanity' Goes Viral", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/bill-gates-blasts-america-turning-inward-globalism-coronavirus-crisis-126620.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Bill Gates: Western Taxpayers Must Pay for Rest of the World's COVID Vaccinations", "description": "Billionaire argues US and European governments should foot the bill - Billionaire Bill Gates is calling for taxpayer money from Western nations to be used to fund COVI... | NEON NETTLE"}, "tags": ["coronavirus", "Bill Gates"], "tweets": [], "movies": [], "links": ["https://www.ft.com/content/b6367f3c-567f-42d9-af4b-3a931b9f6acc", "https://www.zerohedge.com/geopolitical/bill-gates-west-must-finance-global-vaccine-distribution-network-if-it-wants-defeat", "https://asia.nikkei.com/Opinion/A-three-part-plan-to-eliminate-COVID-19", "../../news/12023-petition-to-investigate-bill-gates-for-crimes-against-humanity-goes-viral"], "authors": ["Jay Greenberg"], "publish_date": "2020-10-02"}