{"result_id": "219018", "URL": "https://neonnettle.com/news/11778-bill-gates-blasts-america-for-rejecting-globalism-amid-coronavirus-crisis", "timestamp": "2023-04-25 16:33:30 CEST+0200", "meta": {"description": "Neon Nettle - Bill Gates Blasts America for Rejecting Globalism Amid Coronavirus Crisis - Billionaire accuses the U.S. of 'turning inward' during global pandemic", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/11778-bill-gates-blasts-america-for-rejecting-globalism-amid-coronavirus-crisis", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Bill Gates Blasts America for Rejecting Globalism Amid Coronavirus Crisis", "cleaned_text": "Billionaire accuses the U.S. of 'turning inward' during global pandemic\n\nBillionaire Bill Gates has blasted America for rejecting globalism amid the coronavirus crisis, accusing the US Government of \"turning inward\" by refusing to cooperate with China and other countries during the pandemic.\n\nMicrosoft founder Gates harshly criticized the Trump Administration's response to COVID-19, claiming that by putting the American people first, the United States has caused a \"vacuum\" in solving the global problem.\n\nGates accused the U.S. Government of being more concerned with \"trying to cast blame\" for the spread of the virus.\n\nThe second richest man in the world slammed the \"inward\" approach the country has taken, instead of collaborating with other countries in eradicating it.\n\nHe added that he believes \"rationality will reappear from someone\" and the U.S. will rejoin the globalist efforts of the World Health Organization (WHO).\n\nPresident Donald Trump recently withdrew America's funding from WHO over concerns about the UN health body's suspicious relationship with the Communist Party of China (CPC).\n\nMelinda Gates seconded Bill's support of WHO's work, later adding that when a vaccine is available, black Americans should be among the first to receive it.\n\nThe billionaire couple donates hundreds of millions of dollars to global health causes through The Bill and Melinda Gates Foundation.\n\nThey have reportedly donated more than $300million to the search for a coronavirus vaccine.\n\n\"One of the reasons we are so involved in this is that you don't want the first vaccines to go to the highest-bidding countries,\" Melinda explained.\n\n\"There are 60 million healthcare workers [around the world].\n\n\"They deserve to get the vaccine first, they're the ones dealing with this on the front lines, trying to keep us all safe.\n\n\"And then you have to start to tier from there, based on the countries and the populations.\n\n\"Here in the United States, it's going to be black people who really should get it first and many indigenous people, as well as people with underlying symptoms, and then elderly people.\"\n\nThe couple was speaking on June 19 at the ninth annual Forbes 400 Summit on Philanthropy that was held virtually for the first time because of the pandemic.\n\n\"Usually, the United States plays a role in global problem-solving, so rather than withdrawing from WHO, they'd be involved, collaborating with other countries, not just trying to cast blame,\" Bill told the summit.\n\n\"It's a tricky situation, where the U.S. sort of turned inward on this one.\n\n'We're trying to stitch different country efforts together.\n\n\"The European leaders are trying to fill that vacuum.\n\n\"[U.S. inaction] erodes the kind of relationship and admiration and self-confidence that people have had in us as a country,\" Gates continued.\n\nHe added that he hoped the U.S. would eventually start acting on a global scale in the same way that it had in fighting polio, smallpox, and malaria.\n\n\"I just say rationality will reappear from someone at some point and the U.S. will re-engage in its generosity and the world body that is charged with pandemic coordination.\"\n\nThe couple said that they had made the decision to throw their support behind WHO despite understanding that it is \"not even close to perfect.\"\n\n\"But it is what the world set up after World War II to deal with things like this pandemic,\" Melinda said.\n\n\"And so it is caught now between the tensions between the United State and China, those geopolitics, but we felt, as philanthropists, it was incredibly important to put our voices behind a partner we know to be true.\"\n\n\"At some point, there needs to be a responsible plan for how the U.S. cooperates with other countries about health things,\" Bill added.\n\n\"WHO is involved in smallpox eradication and the U.S., our relationship with WHO is key there.\n\n\"Polio, we are close, we're down to just a few countries and that's very much WHO - where both our money, U.S. money, other countries give to that.\n\n\"You hope that in terms of protecting people's lives, there eventually is a serious discussion about how the world works together,\" he continued.\n\n\"Congress seems very interested in the U.S. not being so weak, that it's other countries that figure out these global problems.\"\n\nSince stepping down from his role as the top executive at Microsoft, Gates has devoted himself to philanthropy through the Bill and Melinda Gates Foundation.\n\nOne of the organization's main functions is to eradicate the disease in underdeveloped parts of the world.\n\nGates' newfound expertise on infectious diseases has made him a frequent commentator on television during news coverage of the COVID-19 pandemic.\n\nGates said that the pandemic has disrupted his foundation's earlier projects which included eradicating polio and vaccinating children in low-income countries.\n\nThe foundation has so far committed $305million toward research for a coronavirus vaccine.\n\nGates pledged that before the pandemic is over, \"we will end up spending a lot more.\"\n\n[RELATED] Melinda Gates: COVID-19 Vaccine Should Be Used on Black People First", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/bill-gates-blasts-america-turning-inward-globalism-coronavirus-crisis-126620.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Bill Gates Blasts America for Rejecting Globalism Amid Coronavirus Crisis", "description": "Billionaire accuses the U.S. of 'turning inward' during global pandemic - Billionaire Bill Gates has blasted America for rejecting globalism amid the coronavirus crisis, a... | NEON NETTLE"}, "tags": ["China", "Bill Gates"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "620", "height": "340", "embed_code": "<iframe src=\"https://www.youtube.com/embed/hcwMt9bFCCg\" width=\"620\" height=\"340\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/hcwMt9bFCCg"}], "links": ["../../news/11628-melinda-gates-covid-19-vaccine-should-be-used-on-black-people-first", "https://www.dailymail.co.uk/news/article-8462323/Bill-Gates-rips-turning-inward-COVID-crisis.html?ns_mchannel=rss&ito=1490&ns_campaign=1490", "https://www.forbes.com/sites/jenniferwang/2020/06/23/bill-and-melinda-gates-have-sharp-words-for-us-lack-of-leadership-in-fighting-pandemic/#319ca3942e8c", "../../news/11628-melinda-gates-covid-19-vaccine-should-be-used-on-black-people-first"], "authors": ["Jay Greenberg"], "publish_date": "2020-06-26"}