{"result_id": "219025", "URL": "https://neonnettle.com/news/13874-eu-leaders-call-for-standardized-covid-vaccine-passport?utm_source=spotim&utm_medium=spotim_recirculation", "timestamp": "2023-04-25 16:33:49 CEST+0200", "meta": {"description": "Neon Nettle - EU Leaders Call for ‘Standardized’ COVID Vaccine Passport - New certificates would only allow vaccinated people to 'be free to travel'", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/13874-eu-leaders-call-for-standardized-covid-vaccine-passport?utm_source=spotim&utm_medium=spotim_recirculation", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "EU Leaders Call for ‘Standardized’ COVID Vaccine Passport", "cleaned_text": "New certificates would only allow vaccinated people to 'be free to travel'\n\nEuropean Union leaders are calling for a \"standardized\" passport to be introduced that acts as proof of whether the holder has been vaccinated for COVID-19.\n\nThe document will include a certificate that only allows those who have received an up-to-date vaccine to \"be free to travel.\"\n\nMember states are demanding that the COVID passports are rolled out across the EU and made mandatory for anyone wishing to travel within, or in and out, of the bloc.\n\nIn a letter to EU Commission chief Ursula von der Leyen, Greek Prime Minister Kyriakos Mitsotaki argues that only “persons who have been vaccinated should be free to travel.”\n\nWhile it stops short at advocating mandatory vaccination, the letter calls for a “standardized certificate, which will prove that a person has been successfully vaccinated.”\n\nThe letter further urges that “It is urgent to adopt a common understanding on how a vaccination certificate should be structured so as to be accepted in all member states.”\n\nAccording to Summit News, Mitsotakis has pledged to raise the issue during an upcoming EU summit on January 21, declaring that “there is an urgent need for a high-level EU-wide mobilization to move things forward.”\n\nVaccine passports have previously been touted by the EU, with officials suggesting back in April that visa applicants would also be required to be vaccinated.\n\nEU countries including Spain, Estonia, Iceland, and Belgium have all indicated that they are open to some form of vaccine passports, as well as sharing the data across borders.\n\nThis week, it was also revealed that Denmark is the latest country to announce that it is rolling out a \"Covid passport,\" to allow those who have taken the vaccine to engage in society without any restrictions.\n\nHowever, the EU’s data protection chief Wojciech Wiewiórowski recently labeled the idea of an immunity passport “extreme” and has repeatedly said it is alarming, and \"disgusting.\"\n\nThe specter of so-called \"immunity passports\" is looming globally.\n\nHaving left the EU, Britain would not be part of any standardized European scheme, however, it has now confirmed that it is rolling out vaccine passports, despite previous denials that it would do so.\n\nRecently, the government in Ontario, Canada admitted that it is exploring \"immunity passports\" in conjunction with restrictions on travel and access to social venues for the unvaccinated.\n\nLast month, Israel announced that citizens who get the COVID-19 vaccine will be given \"green passports\" that will enable them to attend venues and eat at restaurants.\n\nA litany of other government and travel industry figures in both the US, Britain and beyond have suggested that \"COVID passports\" are coming in order for \"life to get back to normal.\"\n\nAnna Beduschi, an academic from Exeter University, commented on the potential move toward vaccine passports by the EU, noting that it “poses essential questions for the protection of data privacy and human rights.”\n\nBeduschi added that the vaccine passports may “create a new distinction between individuals based on their health status, which can then be used to determine the degree of freedoms and rights they may enjoy.”\n\nA report compiled last year by AI research body the Ada Lovelace Institute said so-called \"immunity\" passports “pose extremely high risks in terms of social cohesion, discrimination, exclusion and vulnerability.”\n\nSam Grant, campaign manager at the civil liberties advocacy group Liberty has warned that “any form of immunity passport risks creating a two-tier system in which some of us have access to freedoms and support while others are shut out.”\n\n“These systems could result in people who don’t have immunity potentially being blocked from essential public services, work or housing – with the most marginalized among us hardest hit,” Grant further warned.\n\n“This has wider implications too because any form of immunity passport could pave the way for a full ID system – an idea which has repeatedly been rejected as incompatible with building a rights-respecting society,” Grant further urged.\n\n[RELATED] Lawyers Suing WHO for 'Crimes Against Humanity' Over COVID Lockdowns", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/eu-leaders-covid-passport-vaccine-115121.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "EU Leaders Call for ‘Standardized’ COVID Vaccine Passport", "description": "New certificates would only allow vaccinated people to 'be free to travel' - European Union leaders are calling for a standardized passport to be introduced that acts as pr... | NEON NETTLE"}, "tags": ["coronavirus", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.schengenvisainfo.com/news/greece-urges-eu-to-create-vaccination-certificate-to-facilitate-travel/", "https://summit.news/2021/01/13/eu-leaders-demand-standardised-vaccine-passport-for-travel/", "https://www.schengenvisainfo.com/news/covid-19-test-results-and-later-on-vaccination-will-be-required-for-schengen-visa-application/", "https://www.politico.eu/article/spain-coronavirus-vaccine-refusal-registry-with-eu-countries/", "https://news.err.ee/1143517/estonia-and-world-health-organization-digitally-sign-cooperation-agreement", "https://www.landlaeknir.is/um-embaettid/greinar/grein/item43709/Certificates-regarding-previous-COVID-19-infection-that-are-accepted-at-the-border-in-Iceland-from-10-December-2020", "https://ec.europa.eu/health/sites/health/files/preparedness_response/docs/ev_20201207_sr_en.pdf", "https://edps.europa.eu/sites/edp/files/publication/20-04-27_edps_qa_fr_senate_en.pdf", "https://www.wsj.com/articles/covid-19-vaccine-passports-could-help-life-return-to-normal-but-experts-urge-caution-11607425135", "https://www.politico.eu/article/coronavirus-covid-vaccine-passports-pose-risk-to-privacy-experts-warn/", "https://www.politico.eu/article/digital-immunity-passport-is-the-lesser-of-two-evils-argues-uk-start-up-founder/", "../../news/12868-lawyers-suing-who-for-crimes-against-humanity-over-covid-lockdowns"], "authors": ["Jay Greenberg"], "publish_date": "2021-01-15"}