{"result_id": "219044", "URL": "https://neonnettle.com/news/19177-us-seizes-russia-flagged-tanker-carrying-iranian-oil-near-greece", "timestamp": "2023-04-25 16:34:45 CEST+0200", "meta": {"description": "Neon Nettle - US Seizes Russia-Flagged Tanker Carrying Iranian Oil Near Greece - The oil was being carried by a Russian-operated ship", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/19177-us-seizes-russia-flagged-tanker-carrying-iranian-oil-near-greece", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "US Seizes Russia-Flagged Tanker Carrying Iranian Oil Near Greece", "cleaned_text": "The oil was being carried by a Russian-operated ship\n\nThe United States has seized an oil tanker near Greece, taking the Iranian oil within to be sent to the US, according to reports.\n\nThe oil was being carried by a Russian-operated ship, which had been flagged for US targeting in February.\n\nThe company renamed the ship the Lana and was Russian flagged.\n\nGreece had impounded the Pegas and its Russian crew last month over the invasion of Ukraine but ultimately released it.\n\nNeither the US nor Russia is commenting. Greece says the US informed them the oil was Iranian, and that the US hired a different ship to take the oil to America. Iran has summoned the Greek charges d’affaires and called the incident a “clear example of piracy.” The US accused the tanker of loading 700,000 Bbls of oil from Iran in August 2021. The tanker mostly sent oil to China.\n\nEarlier in the week, The Maritime Executive detailed that “The story of a shadowy Russian oil tanker took a new turn... as the U.S. Department of Justice seized the oil aboard the vessel and according to reports is in the process of transferring the oil to the United States on a chartered tanker.”\n\n“The vessel was detained nearly seven weeks ago in Greece when authorities thought it was covered by the European Union sanctions on Russian assets.'\n\n\"But IT later held for mechanical deficiencies while watchdog groups announced that it was actually smuggling sanctioned Iranian oil.”\n\n“The Aframax tanker arrived off Greece early in April with reports of a possible mechanical failure and indications that they were looking for assistance to make repairs to continue their voyage.”\n\n“When she anchored south of the Greek island of Evia the 115,520 dwt tanker was being identified as the Russian-flagged Pegas.”\n\nAnd the initial “assumption at the time was that it was laden with a Russian crude oil cargo,” according to the report.\n\nThe seizure of the tanker, and oil, comes amid tensions in the ongoing nuclear talks.\n\nIran believes, and not unfairly, that the oil was just stolen from them, and the US position, while yet to be public, is that the oil is now theirs.\n\nIt’s not a significant precedent, but generally, Iran can’t do much about it, and the US is keen to have the oil.\n\n[READ MORE] EU to Impose Full Embargo on Russian Oil – Prices Set to Soar above $185", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/russia-tanker-pegas-lana-uani-iranian-oil-greece-sanctions-1_TYQy__v1024x512__box_0,69,960,573.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "US Seizes Russia-Flagged Tanker Carrying Iranian Oil Near Greece", "description": "The oil was being carried by a Russian-operated ship - The United States has seized an oil tanker near Greece, taking the Iranian oil within to be sent ... | NEON NETTLE"}, "tags": ["Russia Ukraine", "Putin"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/geopolitical/us-seizes-russia-flagged-tanker-full-iranian-oil-near-greece", "https://www.maritime-executive.com/article/us-seizes-oil-from-shadowy-russian-tanker", "../../news/18878-eu-to-impose-full-embargo-on-russian-oil-prices-set-to-soar-above-185"], "authors": ["Daniel Newton"], "publish_date": "2022-05-27"}