{"result_id": "219029", "URL": "https://neonnettle.com/news/14411-mississippi-ends-mask-mandates-businesses-return-to-normal", "timestamp": "2023-04-25 16:34:01 CEST+0200", "meta": {"description": "Neon Nettle - Mississippi Ends Mask Mandates, Businesses Return to Normal - 'Businesses will be able to operate at full capacity without any state-imposed rules'", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/14411-mississippi-ends-mask-mandates-businesses-return-to-normal", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Mississippi Ends Mask Mandates, Businesses Return to Normal", "cleaned_text": "'Businesses will be able to operate at full capacity without any state-imposed rules'\n\nMississippi's Republican governor has announced he is ending COVID-19 restrictions across his state.\n\nGov. Tate Reeves announced that all mask mandates are being lifted on Wednesday and all businesses will be allowed to return to normal operating.\n\n“Starting tomorrow, we are lifting all of our county mask mandates and businesses will be able to operate at full capacity without any state-imposed rules,” the governor said on Twitter.\n\n“Our hospitalizations and case numbers have plummeted, and the vaccine is being rapidly distributed.\n\n\"It is time!” he declared.\n\n“Executive orders that interfered with peoples’ lives were the worst, but the only possible, intervention for much of the last year,” Reeves said in a statement.\n\n“Now, we are putting our focus towards rapid vaccine distribution.\n\n\"We are getting out of the business of telling people what they can and cannot do.”\n\n“We’ve been among the 4 or 5 most open states throughout this crisis, and we’ve been rewarded for it with more jobs and economic recovery,” Reeves continued.\n\n“That’s not because what we put in place was a light burden.\n\n\"It’s only because the rest of the country was so harsh.\n\n\"That’s good, but we need to recognize that none of these orders, in any state, are anything short of unprecedented.\n\n\"They have to end at the earliest possible moment.\n\n\"This is that moment for Mississippi,” he concluded.\n\nThe announcement from Reeves came shortly after Texas took similar action.\n\nOn Tuesday afternoon, Governor Greg Abbott, also a Republican, announced that he is ending the state’s mask mandate and would allow businesses to return to full capacity starting next week.\n\n“Too many Texans have been sidelined from employment opportunities,” Abbott said.\n\n“Too many small business owners have struggled to pay their bills. This must end.\n\n\"It is now time to open Texas 100%.”\n\n“So today, I’m issuing a new executive order that rescinds most of the earlier executive orders,” Abbott said.\n\n“Effective next Wednesday, all businesses of any type are allowed to open 100%.\n\n\"That includes any type of entity in Texas.\n\n“Today’s announcement does not abandon the safe practices that Texans have mastered over the past year,” Abbott said.\n\n“Instead, it’s a reminder that each person has their own role to play in their own personal safety as well as in the safety of others.\n\n\"It’s a reminder that individual safety is managed every day as a matter of personal responsibility rather than by government mandate.\n\n\"Individual responsibility is a corollary to individual freedom, we can have both.”\n\n“Texans should continue following medical advice on preventing COVID just as they do on other medical issues,” Abbott said.\n\n“That is exactly how Texans were able to deal with infectious diseases in the past, like H1N1.\n\n\"They followed safe practices, and they got medical treatment when it was needed.”", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/mississippi-ends-mask-mandates-businesses-return-normal-13321.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Mississippi Ends Mask Mandates, Businesses Return to Normal", "description": "'Businesses will be able to operate at full capacity without any state-imposed rules' - Mississippis Republican governor has announced he is ending COVID-19 restrictions across his sta... | NEON NETTLE"}, "tags": ["Republicans", "lockdown"], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">Starting tomorrow, we are lifting all of our county mask mandates and businesses will be able to operate at full capacity without any state-imposed rules. Our hospitalizations and case numbers have plummeted, and the vaccine is being rapidly distributed. It is time!</p>&#13;\n— Tate Reeves (@tatereeves) <a href=\"https://twitter.com/tatereeves/status/1366849019935412228?ref_src=twsrc%5Etfw\">March 2, 2021</a></blockquote>     \n    \n"], "movies": [], "links": ["https://twitter.com/tatereeves/status/1366849019935412228?ref_src=twsrc%5Etfw", "../../news/14410-newsom-blasts-gov-abbott-s-decision-to-open-up-texas-absolutely-reckless-", "../../news/14400-gov-whitmer-caught-buying-ex-official-s-silence-with-huge-taxpayer-money-payout"], "authors": ["Jay Greenberg"], "publish_date": "2021-03-03"}