{"result_id": "219001", "URL": "https://neonnettle.com/news/19339-pentagon-defies-putin-us-will-arm-ukraine-for-years-to-come-", "timestamp": "2023-04-25 16:32:36 CEST+0200", "meta": {"description": "Neon Nettle - Pentagon Defies Putin: 'US Will Arm Ukraine for Years to Come' -  Ukraine 'will have a military that will need to defend it'", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/19339-pentagon-defies-putin-us-will-arm-ukraine-for-years-to-come-", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Pentagon Defies Putin: 'US Will Arm Ukraine for Years to Come'", "cleaned_text": "Pentagon Defies Putin: 'US Will Arm Ukraine for Years to Come'\n\nUkraine 'will have a military that will need to defend it'\n\nDeputy Secretary of Defense Kathleen Hicks said the Pentagon is preparing to arm Urkaine for years to come, adding leaders believe the state of Ukraine will survive Russia’s invasion.\n\n\"I think what we can assure ourselves today is that there will be a country called Ukraine,\" Hicks said at the Defense One Tech Summit.\n\n\"It will be a sovereign country and that country will have a military that will need to defend it.\"\n\n\"And so as we look ahead, we’re thinking through what are the kinds of capabilities that the Ukrainians need to protect themselves over the long term,\" she added.\n\nSo far, the US has allocated about $54 billion to spend on Ukraine’s war effort, the majority of which will go towards military assistance.\n\nThe funds are meant to last through the 2022 fiscal year, which ends on September 30 for the federal government.\n\nBut Hicks said the Pentagon is looking to support Ukraine in the long-term, over the next five, 10, and 20 years into the future.\n\n\"We're certainly thinking through the pieces that go into that with all the lessons we have developing out and aiding, advising and assisting… a partner nation, in this case Ukraine,\" he said.\n\n\"I do think we are well equipped to do that,\" she said.\n\n\"So are many of our allies and friends, and we're working together now to decide what's the best pathway forward,\" she said.\n\nShe further described that support would go beyond arms, into permanent training programs:\n\n\"​​We’re trying to think through the kinds of both equipment but also the any kind of longer-term training and defense establishment efforts that they will need,\" she added.\n\nHicks' comments signal that the Biden administration has no plans to reduce tensions with Russia as one of Moscow’s main motivations to invade Ukraine was Kyiv’s alignment with the US and NATO and the military support the Western powers started providing in 2014.\n\nEarlier this year, Russian President Vladimir Putin warned the world of “consequences greater than any of you have faced in history” if any nation tries to interfere with his invasion of Ukraine.\n\n“To anyone who would consider interfering from the outside: if you do, you will face consequences greater than any of you have faced in history.”\n\n“All relevant decisions have been taken. I hope you hear me.”\n\n[READ MORE] General Flynn: Biden Could Cause ‘Hundreds of Millions’ of Deaths over Ukraine", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/pentagon-defies-putin-494.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Pentagon Defies Putin: 'US Will Arm Ukraine for Years to Come'", "description": " Ukraine 'will have a military that will need to defend it' - Deputy Secretary of Defense Kathleen Hicks said the Pentagon is preparing to arm Urkaine for year... | NEON NETTLE"}, "tags": ["Russia Ukraine", "Putin"], "tweets": [], "movies": [], "links": ["../../news/18386-putin-threatens-massive-consequences-to-nations-trying-to-interfere-with-ukraine", "../../news/18114-general-flynn-biden-could-cause-hundreds-of-millions-of-deaths-over-ukraine"], "authors": ["Jack Murphy"], "publish_date": "2022-06-15"}