{"result_id": "219036", "URL": "https://neonnettle.com/news/19070-bill-gates-mark-zuckerberg-jeff-bezos-invested-in-artificial-breast-milk-company", "timestamp": "2023-04-25 16:34:21 CEST+0200", "meta": {"description": "Neon Nettle - Bill Gates, Mark Zuckerberg, Jeff Bezos Invested in Artificial Breast Milk Company - Details of investment emerge amid nationwide baby formula shortage", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/19070-bill-gates-mark-zuckerberg-jeff-bezos-invested-in-artificial-breast-milk-company", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Bill Gates, Mark Zuckerberg, Jeff Bezos Invested in Artificial Breast Milk Company", "cleaned_text": "Multibillionires Bill Gates, Mark Zuckerberg, and Jeff Bezos all invested in a start-up company that produces artificial breast milk, according to reports.\n\nThe billionaires invested in U.S. firm BIOMILQ which creates lab-produced breast milk from cultured human mammary epithelial.\n\nAccording to an article published by The Daily Mail on June 19, 2020, BIOMILQ has received $3.5 million from an investment fund that is co-founded by Gates, Bezos, Zuckerberg, and British billionaire Richard Branson.\n\nRecords show they pumped millions into the company to \"prevent climate change due to gases created in formula manufacturing.\"\n\nThe firm pitches its products as \"a green alternative to baby formula.\"\n\nThe news has emerged while American families are currently struggling amid a nationwide baby formula shortage.\n\n\"It has been estimated that around 10 per cent of the global dairy industry — a major producer of greenhouse gases — is used to manufacture baby formula,\" the Mail reported.\n\n\"The $1 billion (£800 million) fund, Breakthrough Energy Ventures, was established to help prevent the worst effects of climate change arising from carbon emissions.\"\n\nAccording to the company’s website, in 2021, they successfully produced the world’s first cell-cultured human milk outside of the breast.\n\n\"Our team is thrilled to announce that we have produced the world’s first cell-cultured human milk outside of the breast,\" the website states.\n\n\"We find ourselves at the frontier of lactation science, helping to advance the entire field by putting mothers and babies at the forefront.\"\n\nAccording to UC Davis Human Milk Researcher & BIOMILQ Technical Advisor Dr. Jennifer Smilowitz, “human milk is tremendously complex in both composition and structure which has made it impossible to replicate outside of the lactating parent.” Until now. In just 11 months, we have moved the field of lactation science from proof of concept to proof of complexity, producing milk compositions that look more like a symphony than a concerto. We’re a HUGE step closer to empowering parents with another infant feeding option, one that provides much of the nutrition of breastmilk with the practicality of formula. We can now confirm that BIOMILQ’s product has macronutrient profiles that closely match the expected types and proportions of proteins, complex carbohydrates, fatty acids and other bioactive lipids that are known to be abundantly present in breastmilk.\n\nSocial media users have been noting the timing of the discovery, considering the recent news of the baby formula shortage.\n\nCandace Owens tweeted, “Doesn’t Bill Gates just have the best luck?\n\n\"Just like with the COVID vaccine— he makes an investment, and then suddenly there is a pandemic or shortage and everyone must line up for his product.\n\n\"Of course he’s invested in lab produced breast milk!”\n\nAccording to far-left \"fact-checker\" Politifact, “there is no evidence that investments involving Bill Gates and Mark Zuckerberg in artificial breast milk have anything to do with the formula shortage.”\n\n“Neither BIOMILQ nor the fund’s investment in the company have anything to do with the current shortage,” Politifact said in its \"fact check.\"\n\n\"Leila Strickland, BIOMILQ’s co-founder and chief science officer, told CNN on May 3 that the company is still three to five years away from getting a product to market.\n\n\"The shortage is due in part to a February 2022 formula recall by Abbott, a major U.S. manufacturer of baby food, that halted production at its Sturgis, Michigan, plant.\n\n\"It’s also due to supply chain issues associated with the COVID-19 pandemic that were already impacting the infant formula industry.\n\n\"High inflation also appears to have compounded the problem.\"\n\nAmerican families are suffering from the baby formula shortage.\n\nThe largest producer of baby formula was shut down by Joe Biden's administration for 3 months.\n\nBiden's FDA shut down a huge plant that makes baby formula in Michigan.", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/bill-gates-innapropriate-emails-female-microsoft-staffer-1191021.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Bill Gates, Mark Zuckerberg, Jeff Bezos Invested in Artificial Breast Milk Company", "description": "Details of investment emerge amid nationwide baby formula shortage - Multibillionires Bill Gates, Mark Zuckerberg, and Jeff Bezos all invested in a start-up company t... | NEON NETTLE"}, "tags": ["Facebook", "Bill Gates"], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">Doesn’t Bill Gates just have the best luck? Just like with the COVID vaccine— he makes an investment, and then suddenly there is a pandemic or shortage and everyone must line up for his product. <br/><br/>Of course he’s invested in lab produced breast milk! <a href=\"https://t.co/1OzFBFHezy\">https://t.co/1OzFBFHezy</a></p>&#13;\n— Candace Owens (@RealCandaceO) <a href=\"https://twitter.com/RealCandaceO/status/1524561573020327938?ref_src=twsrc%5Etfw\">May 12, 2022</a></blockquote>&#13;\n"], "movies": [], "links": ["https://www.biomilq.com/", "https://www.dailymail.co.uk/sciencetech/article-8439159/Artificial-breast-milk-start-gets-3-5-million-Bill-Gates-founded-investment-fund.html", "https://biomilq.medium.com/biomilq-has-successfully-made-human-milk-ae3649571e69", "https://t.co/1OzFBFHezy", "https://twitter.com/RealCandaceO/status/1524561573020327938?ref_src=twsrc%5Etfw", "https://www.politifact.com/factchecks/2022/may/12/facebook-posts/formula-shortage-isnt-related-bill-gates-mark-zuck/", "https://www.cnn.com/2022/05/03/business/lab-grown-human-milk-biomilq-health-climate-hnk-spc-intl/index.html", "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/abbott-voluntarily-recalls-powder-formulas-manufactured-one-plant", "https://www.nbcnewyork.com/news/national-international/fda-to-allow-closed-abbott-plant-to-release-baby-formula-supply-amid-shortage/3682564/?amp", "https://www.nrcc.org/2022/05/11/biden-baby-formula-crisis/", "../../news/13704-bill-gates-controversial-plan-to-dim-the-sun-quietly-moves-forward"], "authors": ["Jay Greenberg"], "publish_date": "2022-05-16"}