{"result_id": "219049", "URL": "https://neonnettle.com/news/10888-bill-gates-is-spending-billions-building-factories-to-produce-covid-19-vaccine", "timestamp": "2023-04-25 16:35:00 CEST+0200", "meta": {"description": "Neon Nettle - Bill Gates is Spending Billions Building Factories to Produce COVID-19 Vaccine - Microsoft co-founder reveals plans to develop drugs for the coronavirus", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/10888-bill-gates-is-spending-billions-building-factories-to-produce-covid-19-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Bill Gates is Spending Billions Building Factories to Produce COVID-19 Vaccine", "cleaned_text": "Microsoft co-founder reveals plans to develop drugs for the coronavirus\n\nMicrosoft co-founder Bill Gates has revealed he is spending billions of dollars building factories to produce a vaccine for the deadly COVID-19.\n\nGates, the second richest man in the world, says he is pumping mountains of cash into developing drugs to fight the coronavirus.\n\nThe philanthropic billionaire says seven vaccine makers have already secured funding but admits lots more money will need to be spent before a cure is found.\n\nSpeaking during a video interview on The Daily Show with Trevor Noah, Gates revealed his huge investment after answering questions about the Chinese virus that has brought the world to its knees.\n\n\"Even though we'll end up picking at most two of them, we're going to fund factories for all seven.\"\n\n\"(It's) so that we don't waste time in serially saying which vaccine works and then building the factory,\" Gates continued.\n\n\"The only thing that really lets us go back completely to normal and feel good about sitting in stadiums with lots of other people is to create a vaccine and not just take care of our country but take that vaccine out to the global population.\"\n\nThe Bill and Melinda Gates Foundation confirmed they were exploring the use of funding to \"get the process (of building vaccines) moving.\"\n\n\"Many of the current vaccine approaches are novel and have never been scaled for a commercialized product,\" they said.\n\n\"Enhancements of global manufacturing capacity are clearly required given the population-level scale at which a COVID-19 vaccine will need to be given.\"\n\nThe Foundation has already awarded $20million to three institutions in the US and UK to fund clinical trials aiming to study the effectiveness of repurposed drugs in combating coronavirus.\n\nThe recipients are the University of Washington, University of Oxford and La Jolla Institute for Immunology.\n\n\"These grants to leading institutions in their fields will advance our understanding of how existing drugs and antibodies can contribute to addressing the pandemic we're facing around the world,\" said the Foundation's chief executive, Mark Suzman.\n\nSpeaking to Fox News on Sunday, Gates said the pandemic is a \"nightmare scenario\" but that fewer Americans will die than the 240,000 predicted if the government changes the way it tests people.\n\nHe has pushed for a nationwide shutdown, limited domestic travel and administering more targeted testing to stop the overflow of patients at hospitals unable to cope with the surge in numbers.\n\n\"Well, if we do the social distancing properly, we should be able to get out of this with the death number well short of that,\" Gates told Fox News Sunday.\n\n\"This is a nightmare scenario because human-to-human transmittal respiratory viruses can grow exponentially.\n\n\"And you know, if we had kept on going to work, traveling like we were, you know, that curve would never bend until you had the majority of the people infected and then a massive number seeking hospital care and lots of lots of deaths.\"\n\nThe US is predicted to see its worst day in the coronavirus outbreak in 10 days when more than 2,000 people are expected to die.\n\nGates believes that by obtaining test results within 24 hours, the US will be able to quickly identify those an infected person has come into contact with so they can be isolated and slow the spread.\n\nWhile there are strict international travel restrictions, Gates focused on the importance of domestic boundaries too.\n\n\"Well, when you have finite resources you need to allocate them to where there's the most need,\" Gates told host Chris Wallace.\n\n\"Certainly because people move around the country, we have to have the shutdown or else you'll have exponential growth.\n\n\"It will spread back into other parts of the country.\"\n\nThe outbreak was identified in Wuhan, China in November with the first case in the US January.\n\nAs early as February, before any lockdowns, the Bill & Melinda Gates Foundation donated $10 million to help fight the virus.\n\nGates has criticized the government's delay in taking precautions and serious action after the outbreak.\n\n\"Between 2015 and 2020, less than 5 percent of what should have been done was done,\" Gates said.\n\nDuring the interview from Microsoft's Skype service, Gates admitted that he wakes up every morning thinking the pandemic is only the subject of his nightmares.\n\nBut he said compared to a disease like smallpox, COVID-19 \"isn't the worst case.\"\n\n\"The one percent mortality rate when your system is not overloaded… if that was smallpox that would be 30 percent,\" he explained.\n\n\"So this is super, super bad, but we will eventually get a vaccine,\" he said.\n\n\"Even before then, if we do the right things we'll be able to open up significant parts of the economy.\n\n\"Once you're in the crisis you're doing your best to deal with this.\"\n\n\"I'm sure you know, once we get past this, we'll look back, understand what we could have done differently, and make sure that we're not letting it happen again, particularly because it could be even worse in terms of the fatality rate,\" he added.\n\n[RELATED] Bill Gates Warns a Global Pandemic is About to Destroy Humanity", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/bill-gates-billions-build-factories-coronavirus-vaccine-17420.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Bill Gates is Spending Billions Building Factories to Produce COVID-19 Vaccine", "description": "Microsoft co-founder reveals plans to develop drugs for the coronavirus - Microsoft co-founder Bill Gates has revealed he is spending billions of dollars building factorie... | NEON NETTLE"}, "tags": ["China", "coronavirus", "Bill Gates"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "620", "height": "340", "embed_code": "<iframe src=\"https://www.youtube.com/embed/-VcCPAXNgRU\" width=\"620\" height=\"340\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/-VcCPAXNgRU"}], "links": ["https://www.dailymail.co.uk/news/article-8191175/Bill-Gates-reveals-spending-billions-dollars-building-factories-develop-Covid-19-vaccine.html", "../tags/china", "../../news/4283-bill-gates-warns-a-global-pandemic-is-about-to-destroy-humanity"], "authors": ["Jay Greenberg"], "publish_date": "2020-04-07"}