{"result_id": "219039", "URL": "https://neonnettle.com/news/14844-40-marines-refuse-covid-vaccine-amid-calls-to-make-jab-mandatory-for-military", "timestamp": "2023-04-25 16:34:31 CEST+0200", "meta": {"description": "Neon Nettle - 40% Marines Refuse COVID Vaccine Amid Calls to Make Jab Mandatory for Military - New data shows 38.9% of U.S. Marines have refused the vaccination", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/14844-40-marines-refuse-covid-vaccine-amid-calls-to-make-jab-mandatory-for-military", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "40% Marines Refuse COVID Vaccine Amid Calls to Make Jab Mandatory for Military", "cleaned_text": "New data shows 38.9% of U.S. Marines have refused the vaccination\n\nAlmost 40 percent of U.S. Marines are refusing to get COVID-19 vaccines, according to new data.\n\nA CNN report revaled on Saturday that some 75,000 Marines have had one or two doses of a vaccine, while 48,000 have refused - a rejection rate of 38.9 percent.\n\nAccording to a recent NPR poll, the figure is considerably higher than the rate of rejection among the general public, which is around 25 percent.\n\nAs of Thursday, nearly 20 percent of Americans are fully vaccinated.\n\nThe Marines says there are a number of reasons for them choosing not to get the vaccines but they would not pinpoint one.\n\nOfficials previously said that wider spread hesitancy among the armed forces was down to the speed that the vaccines were developed, which has prompted fears over the long-term side effects.\n\n“The Navy and Marine Corps are providing substantial educational information broadly, and working with commands to ensure Marines, Sailors, and beneficiaries have accurate information regarding the safety and efficacy of the vaccines to encourage individuals to get immunized,” Capt. Andrew Wood, a Marines spokesman, told The Hill in a statement.\n\nThe numbers for the data include reserves, active-duty, and Individual Mobilization Augmentee Marines, according to CNN.\n\nWood said the Marines mostly include “young and healthy individuals” and that there are multiple reasons they might decline the vaccine.\n\n“For example, an individual may have deferred until later to allow others to get the vaccine, they may have gotten the vaccine on their own and not through military channels, they could be unavailable for a second dose in the prescribed time period for the vaccines that require two doses, they could expect the vaccine to become mandatory and are waiting until then, or they may be allergic to one of the compounds in the vaccine,” Wood said.\n\nThe military previously estimated that 66 percent would accept the coronavirus vaccine, according to CNN.\n\nWood said any individual who originally declined the vaccine can change their mind and receive it.\n\n“We continue to make the vaccine available to Marines, Sailors, civilians, contractors and authorized beneficiaries based on the prioritization schedule listed in the [Department of Defense] population schema,” Wood said.\n\nSince the vaccines have only emergency use authorization from the Food and Drug Administration (FDA), the military can not require that servicemembers get vaccinated.\n\nCamp Lejeune in North Carolina saw a 57 percent decline rate for the vaccine, the data showed.\n\n“We fully understand that widespread acceptance of the COVID-19 vaccine provides us with the best means to defeat this pandemic,” Wood said.\n\nThe revelation comes as Democratic lawmakers have started a push to make the COVID jab mandatory for all members of the military.\n\nAccording to Dr. Anthony Fauci, US service members who are eligible but opt out of taking the coronavirus vaccine are “inadvertently being part of the problem” of lengthening the pandemic.\n\nWhile the military is currently barred from mandating any of the coronavirus vaccines rolled out in the US, as each has received only emergency FDA approval rather than full authorization, some in Congress have pressed the Joe Biden administration to change that.\n\nIn a letter sent to the White House last month, a group of Democratic lawmakers led by California Rep. Jimmy Panetta argued that unvaccinated soldiers pose a “critical threat to our national security and public health,” calling on the president to issue a waiver overriding the rules – as well as the “informed consent” of the troops.\n\n“Vaccinating every eligible service member will improve readiness and have an immediate and positive impact on the communities in which they serve,” Panetta wrote in the letter, which was co-signed by six House Democrats.\n\n\"Requiring [the Defense Department] to obtain informed consent prior to vaccination is not only harmful to our national security, but contrary to the best interests of service members, their families, communities and colleagues.\"\n\nService members are not permitted to decline other fully approved immunizations.\n\nOther survey data suggests that around 25% of Americans at large are not willing to be vaccinated against the coronavirus.\n\n[RELATED] Bill Gates: 'Final Hurdle' for COVID-19 Vaccine is Ensuring People Take It", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/marine-refuse-covid-vaccine-mandatory-military-111421.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "40% Marines Refuse COVID Vaccine Amid Calls to Make Jab Mandatory for Military", "description": "New data shows 38.9% of U.S. Marines have refused the vaccination - Almost 40 percent of U.S. Marines are refusing to get COVID-19 vaccines, according to n... | NEON NETTLE"}, "tags": ["Military", "Vaccine"], "tweets": [], "movies": [], "links": ["https://thehill.com/policy/national-security/547534-40-percent-of-marines-have-declined-the-coronavirus-vaccine", "https://www.navytimes.com/news/your-navy/2021/03/24/lawmakers-call-on-biden-to-make-covid-vaccines-mandatory-for-the-military/", "https://www.cidrap.umn.edu/news-perspective/2021/03/poll-1-4-americans-will-refuse-covid-19-vaccine", "../../news/11795-bill-gates-final-hurdle-for-covid-19-vaccine-is-ensuring-people-take-it"], "authors": ["Jay Greenberg"], "publish_date": "2021-04-11"}