{"result_id": "219026", "URL": "https://neonnettle.com/news/11548-bill-gates-warns-crazy-anti-vaxxers-are-threatening-covid-19-vaccine-s-success", "timestamp": "2023-04-25 16:33:52 CEST+0200", "meta": {"description": "Neon Nettle - Bill Gates Warns 'Crazy' Anti-Vaxxers Are Threatening COVID-19 Vaccine's Success - Billionaire Microsoft founder says 'craziness' could prevent jab from working", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/11548-bill-gates-warns-crazy-anti-vaxxers-are-threatening-covid-19-vaccine-s-success", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Bill Gates Warns 'Crazy' Anti-Vaxxers Are Threatening COVID-19 Vaccine's Success", "cleaned_text": "Billionaire Microsoft founder says 'craziness' could prevent jab from working\n\nBillionaire Bill Gates has warned that \"crazy\" anti-vaxxers are threatening to jeopardize the success of the coming COVID-19 vaccine.\n\nSpeaking Thursday, Gates, the second-richest man in the world, said those who oppose vaccinations could wreck attempts to develop a coronavirus vaccine if they refuse to take it and reduce the level of herd immunity.\n\nFor the vaccine to work as planned, over 80 percent of people may need to be vaccinated.\n\nMicrosoft co-founder Gates says he fears anti-vaccine \"craziness\" might put people off getting it, however.\n\nGates, who now donates hundreds of millions of dollars to global health causes, describes the prospect as \"worrying.\"\n\nFor a vaccine to be successful at stamping out a virus, enough people must get them to ensure that a vast majority of the population is immune and the disease can no longer spread.\n\nMr. Gates's comments come as vaccine trials on humans are in full swing in the UK and the University of Oxford has announced it will test its candidate in Brazil now.\n\nFalling levels of the virus circulating in Britain, where the outbreak is fading, means it will be increasingly difficult to test the vaccine because there is nothing to test it against.\n\nIn Brazil, however, COVID-19 cases are still rising rapidly and its outbreak is second only to the US, with 555,000 confirmed diagnoses.\n\nThe Bill and Melinda Gates Foundation, which Gates runs with his wife, has donated more than $250million (£200million) to the search for a coronavirus vaccine.\n\nA vaccine is considered to be the only way to stamp out the virus because it is too deadly for countries to leave it to run unchecked.\n\nThe widespread use of a vaccine would build up herd immunity to the virus, meaning that so many people are immune to it that it doesn't have a big enough pool of potential victims to cause a proper outbreak.\n\nThere will always be people who cannot have vaccines - those whose immune systems don't work, such as cancer patients, for example - so high uptake in the healthy population is crucial.\n\nExperts say at least two-thirds of people would need to be immune to COVID-19 to stop another epidemic.\n\nThe higher the uptake of a vaccine, the better it works.\n\nFor measles, the target is to vaccinate 95 percent of the population.\n\nBut anti-vaxxers refuse to have jabs or give them to their children over concerns they may be harmful or used only to make money.\n\nMr. Gates said on BBC Radio 4 Thursday morning: \"It is troubling that in times like that, and accelerated by digital tools, there is so much craziness.\n\n\"Eventually, when we have the vaccine, we will want to develop the herd immunity to have over 80 percent of the population taken.\n\n\"If they have heard that it is a plot or vaccines, in general, are bad, and we don't have people willing to take the vaccine, then that will let the disease continue to kill people.\n\n\"So it is a bit worrying that there is some of that crazy stuff.\"\n\nBill Gates himself has been the subject of numerous conspiracy theories that have been circulating online.\n\nOne theory suggests Gates, who made his fortune as a computer magnate, plans to use a vaccine to implant microchips in people, and that the global pandemic, which has killed almost 400,000 people, is a cover-up.\n\nThe theory is based on a suggestion by Mr. Gates that there would one day be \"digital certificates\" to show who had been vaccinated or had COVID-19 already, like medical records, the BBC reported.\n\nThe Foundation was forced to point out that claims it wanted to track people or use microchips were \"false.\"\n\nGates added on Radio 4: \"I'm kind of surprised that some of that is focused on me.\n\n\"We are just giving money away to get there to be a tool.\n\n\"We just write cheques to pharma companies [and] we happen to have a lot of the smart pharmaceutical expertise in our foundation, and are considered a fair broker between governments and the companies to help pick the best approach.\"\n\nOne of the fastest moving candidates for a vaccine is that being developed by the University of Oxford, which is already in human trials in the UK.\n\nThe vaccine has recruited thousands of people to test the safety of the jab, but testing whether it actually works will become a tall order now that the virus is fading out in Britain.\n\nAs a result, the team is shipping it to Brazil, which is now in the grip of the world's fastest-growing outbreak.\n\nThere have been more than half a million people diagnosed there and more than 30,000 have died.\n\nThe vaccine will be tested on 2,000 people working in healthcare environments between the ages of 18 and 55, said the Federal University of Sao Paulo, which is in charge of the study.\n\nThe president of the university, Soraya Smaili, said the volunteers \"must be health professionals between 18 and 55 years old and be at high risk of infection, for example, cleaning and support staff in units treating COVID-19 patients.\"\n\nProfessor Smaili added the vaccine was being tested in Brazil \"because we are in the acceleration phase of the epidemiological curve.\"\n\nBritain, on the other hand, is coming out the other side of its peak, and case numbers are declining, meaning it will be hard to measure the effects of a vaccine because so few people are getting infected.\n\nThe current best estimate is that around 8,000 people per day are catching the virus, with around 54,000 infected at any given time.\n\nThe university added: \"The results will be fundamental for the vaccine's approval in the United Kingdom, expected late this year.\"\n\nPharmaceutical giant AstraZeneca has agreed to mass-produce Oxford's vaccine and help to distribute it if it becomes successful.", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/bill-gates-crazy-anti-vaxxers-covid-19-vaccine-working-15620.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Bill Gates Warns 'Crazy' Anti-Vaxxers Are Threatening COVID-19 Vaccine's Success", "description": "Billionaire Microsoft founder says 'craziness' could prevent jab from working - Billionaire Bill Gates has warned that crazy anti-vaxxers are threatening to jeopardize the suc... | NEON NETTLE"}, "tags": ["coronavirus", "Bill Gates"], "tweets": [], "movies": [], "links": ["../tags/coronavirus", "https://www.dailymail.co.uk/news/article-8387873/Bill-Gates-warns-anti-vaxxers-stop-Covid-19-jab-working.html", "https://www.bbc.co.uk/news/52847648", "../../news/11314-bill-gates-funded-covid-19-tracking-program-shut-down-by-fda", "../../"], "authors": ["Jay Greenberg"], "publish_date": "2020-06-05"}