{"result_id": "219038", "URL": "https://neonnettle.com/features/1621-vigilante-bikers-rescue-abused-animals-confront-abusive-pet-owners", "timestamp": "2023-04-25 16:34:28 CEST+0200", "meta": {"description": "Neon Nettle - Vigilante Bikers Rescue Abused Animals, Confront Abusive Pet Owners - Biker group known as Rescue Ink is saving desperate animals from abuse", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/features/1621-vigilante-bikers-rescue-abused-animals-confront-abusive-pet-owners", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Vigilante Bikers Rescue Abused Animals, Confront Abusive Pet Owners", "cleaned_text": "Biker group known as Rescue Ink is saving desperate animals from abuse\n\nA group of burly, tattooed bikers is taking action against abusive pet owners and rescuing abused animals from them.\n\nThe bikers, known as Rescue Ink, all share a passion for saving abused animals.\n\nThanks to their intimidating looks and no-nonsense attitudes, they’ve honed their skills to become experts at paying violent, cruel pet owners a visit and “convincing” them to hand over their neglected victims.\n\nMost of the time, the pets get rescued and the bikers get their way.\n\nOf course, Rescue Ink from Long Island, New York, operates fully within the boundaries of the law.\n\nThe group of rescuers started as a legal, non-profit organization before catching the attention of the mainstream media.\n\nAccording to the Epoch Times, some members have had past run-ins with the law; some are bikers, ex-bodybuilders, or powerlifting champs, while others are ex-military, detectives, or lawyers.\n\nWhere once the organization was wholly dependent on donations, they eventually had their own reality TV show.\n\nThe hardcore animal lovers get calls on a daily basis and deal with the most heinous situations first.\n\nThey start by investigating the alleged animal abuse cases.\n\nThey have encountered dog fighting organizers, breeders, a perpetrator who tried to poison homeless cats near his home, and even a serial cat killer from out of state.\n\nIf they come across non-animal-abuse-related criminals, they don’t get involved; they call the police.\n\nAccording to the group, animal abusers are typically insecure, ruthless, and impulsive people, often due to relationship or home problems.\n\nAnd the sadistic behavior only escalates from there; it starts with animals and leads to abuse of children, women, or the elderly.\n\nOnce a perpetrator thinks they can get away with something, they don’t fear punishment.\n\nSometimes, pet owners themselves are facing difficult life situations—and the bikers step in to lend a hand.\n\nThey may pitch in to buy groceries for a household with no food in the cupboards, or they may build a doghouse if need be, or help in some other way.\n\nA pet is a family member, says Joe Panz, the group’s founder, to Guideposts in an interview, and shouldn’t be taken away without just cause.\n\nThere have been cases where a pet owner died, and the pets had to be taken to a shelter.\n\nIn some cases of severe neglect, though, Rescue Ink has no choice but to step in and remove the pet from its neglectful carer.\n\nQuite often, their tattoos and brawny looks get them a lot further than the police ever could.\n\nThey “persuade” abusive owners into giving up the animal.\n\n“Let’s just say an official goes to an abuser’s house, he pulls up in a cop car and, immediately the abuser knows the cop’s limitations, he has certain boundaries,” explains member Anthony Rossano (a.k.a. Big Ant) to People.\n\n“But when we pull up, they don’t know what we’re going to do, they don’t know what we’re capable of doing. So it helps out big time.”\n\nThe street-smart team has also committed to teaching the community about animal abuse and the harm that it does.\n\nAccording to Panz, young folks are often more willing to hear what they have to say; whereas they might be put off by a police constable’s assumption of authority, the bikers have the clout and street credit to convince the younger crowd.\n\nThe organization, founded in 2007, has saved more animals than their members have tattoos.\n\nTheir peak years of activity were between 2008 and 2014.\n\nIn 2009, they even premiered in their own reality television program called “Rescue Ink Unleashed,” which aired on National Geographic channel.\n\nThe group’s website sums up who they are and where they’ve been:\n\n“Some people like to think of us as superheroes.\n\n\"The truth is, we are super animal lovers (and protectors).\n\n\"Through the years, and through many caseloads, obstacles, and downright challenges, we remain strong and dedicated to our mission.”\n\n[RELATED] New Animal Protection Bill Could See Abusers Get 7 Years in Prison", "opengraph": {"type": "article", "url": "https://neonnettle.com/features/1621-vigilante-bikers-rescue-abused-animals-confront-abusive-pet-owners", "image": "https://neonnettle.com/features/images/bikers-rescue-abused-animals-confront-pet-owners-112519.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Vigilante Bikers Rescue Abused Animals, Confront Abusive Pet Owners", "description": "Biker group known as Rescue Ink is saving desperate animals from abuse - A group of burly, tattooed bikers is taking action against abusive pet owners and rescuing abused... | NEON NETTLE"}, "tags": ["Animals", "Tattoos"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "592", "height": "333", "embed_code": "<iframe src=\"https://www.youtube.com/embed/WLCMTUZ4YAI\" width=\"592\" height=\"333\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/WLCMTUZ4YAI"}, {"embed_type": "iframe", "provider": "youtube", "width": "592", "height": "333", "embed_code": "<iframe src=\"https://www.youtube.com/embed/yevRDxK47qM\" width=\"592\" height=\"333\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/yevRDxK47qM"}, {"embed_type": "iframe", "provider": "youtube", "width": "592", "height": "333", "embed_code": "<iframe src=\"https://www.youtube.com/embed/v3b5nZdcaPQ\" width=\"592\" height=\"333\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/v3b5nZdcaPQ"}], "links": ["https://www.theepochtimes.com/tattooed-bikers-confront-abusive-pet-owners-to-rescue-desperate-animals_2873099.html", "https://www.theepochtimes.com/t-animal-abuse", "https://www.youtube.com/watch?v=WLCMTUZ4YAI", "https://people.com/pets/rescue-inks-tattooed-tough-guys-crack-down-on-animal-cruelty/", "http://www.rescueink.org/mission.html", "../../news/7137-new-animal-protection-bill-could-see-abusers-get-7-years-in-prison"], "authors": ["Neon Nettle"], "publish_date": "2019-06-01"}