{"result_id": "219005", "URL": "https://neonnettle.com/news/12315-russia-s-top-doctor-quits-accuses-govt-of-gross-violations-to-rush-covid-vaccine", "timestamp": "2023-04-25 16:32:49 CEST+0200", "meta": {"description": "Neon Nettle - Russia's Top Doctor Quits, Accuses Govt of 'Gross Violations' to Rush COVID Vaccine - Professor Alexander Chuchalin says government abused medical ethics", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/12315-russia-s-top-doctor-quits-accuses-govt-of-gross-violations-to-rush-covid-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Russia's Top Doctor Quits, Accuses Govt of 'Gross Violations' to Rush COVID Vaccine", "cleaned_text": "Russia's top respiratory doctor has quit, accusing the Russian government of a series of \"gross violations\" of medical ethics during their push to \"rush\" through their COVID-19 vaccine.\n\nProfessor Alexander Chuchalin sensationally resigned from the Russian health ministry's ethics council over concerns Putin's coronavirus jab is not ready.\n\nProf. Chuchalin fiercely attacked the new drug, named \"Sputnik V,\" ahead of the council approving its registration.\n\nThe news comes amid deep skepticism among Western experts over the vaccine.\n\nIt now also appears that Chuchalin shared the same concerns as he sought and failed to block its registration on \"safety\" grounds before quitting the ethics council.\n\nChuchalin specifically accused the two leading medics behind in its development of flouting medical ethics as they rushed the vaccine into production.\n\nDr. Chuchalin named Prof. Alexander Ginsburg, director of the Gamaleya Research Centre for Epidemiology and Microbiology, and Prof Sergey Borisevich, a medical colonel and Russian army's top virologist.\n\nThe two men were the leading academics behind the new \"world-beating\" vaccine.\n\nChuchalin allegedly asked them: \"Have you passed all the necessary paths approved by Russian Federation legislation and the international scientific community? Not!\n\n\"This job has not been done.\n\n\"Thus, one of the ethical principles of medicine has been grossly violated - to do no harm.\"\n\nHe stressed: \"I am depressed by the position of some of our scientists who make irresponsible statements about ready-made vaccines.\"\n\nAlthough specific reasons for his resignation were not given, in an interview with journal Nauka i Zhizn (Science and Life) shortly before he quit, Chuchalin warned: \"In the case of a drug or vaccine, we, as ethical reviewers, would like to understand, first of all, how safe it is for humans.\n\n\"Safety always comes first. How to evaluate it?\n\n\"The vaccines that are being created today have never been used in humans, and we cannot predict how a person will tolerate it.\"\n\nChucalin, who created the Russian Research Institute of Pulmonology, and is head of the Department of Hospital Therapy, at the Pirogov Russian National Research Medical University, added: \"It is impossible to determine this without weighing all the scientific facts.\n\n\"Therefore, our number one task is to extract scientific data based on evidence-based medicine in order to understand that the action performed by scientists will not harm a person.\"\n\nChuchalin said it is vital to know \"the effect of the vaccine in the longer term,\" adding that \"the fact is that there are a number of biological substances that do not manifest themselves immediately, but only after a year or two.\"\n\nWith Russia also preparing other vaccines to tackle Covid-19, he warned: \"Those vaccines that are now being developed by many of our research centers, the criteria for their safety can only be of a short-term nature.\n\n\"But the safety criteria for a vaccine must also be long-term and this becomes clear only with long-term observation - at least two years.\"\n\nAnd one of Russia's leading virologists has even warned that the vaccine could increase the spread of COVID-19.\n\nIn a separate attack on the vaccine, Prof. Alexander Chepurnov said the \"danger exists\" of \"increasing the disease with the wrong design of the vaccine.\"\n\nChepurnov is the former head of the laboratory for specially hazardous diseases at the Vector Institute in Siberia which is also involved in developing vaccines for coronavirus.\n\nHe warned: \"Time is needed….antibodies are different.\n\n\"In some situations - and for coronavirus, this is already known - the infection intensifies with some antibodies.\n\n\"It should be known which antibodies the vaccine produces.\"\n\nBut the vaccine creators had not published scientific articles on the vaccine, he said.\n\nThey need to explain the level of neutralization, and details of doses and \"whether it develops or not the ability to increase infection by antibodies.\"\n\nWhile this is not done \"it is impossible to talk about the release of a vaccine,\" he said.\n\nAnother leading scientist Vladimir Chekhonin, vice president of the Russian Academy of Sciences, claimed Russia was flouting the Nuremberg Code on human experimentation and the country's own laws in human clinical research involved in COVID-19 vaccine testing.\n\nHe expressed concern about the use of serving military personnel as recipients of the vaccine.\n\n\"We cannot conduct experiments on humans,\" said the respected immunologist.\n\n\"This is a gross violation of the international Nuremberg Code.\n\n\"We are just making fools of ourselves with this early vaccine that can bring us a lot of trouble.\"\n\nScientists \"do not have the ethical right to speak to society and defiantly drip the vaccine into their nose or inject it into other places.\"\n\nVaccine makers though insist all those taking part in tests were volunteers, including troops serving in the army.\n\nRussia has made the vaccine race a matter of national prestige and has named the product \"Sputnik V\" after the former Soviet space satellites, prompting fears that safety will be compromised for the sake of Russia's image.\n\nIT has made clear that additional research is needed for administering the vaccine to those aged over 60, and for now only those aged between 18-60 will be allowed the drug.\n\nThe chief executive of the Russian Direct Investment Fund Kirill Dmitriev hit out at attacks from abroad on the new vaccine.\n\n\"Attacks are coming only from the West, the US, and Europe,\" he said.\n\n\"We are confident that we have the most effective and reliable vaccine in the world, and I am ready to clarify that.\n\n\"Accordingly, we are under attack because our rivals understand it perfectly well and they are fearful of Russia's strong position on the global vaccine market.\"\n\nThe expected price on the foreign market is $10 for two doses.\n\nThe documentation linked to the vaccine said it was registered after tests on only 38 healthy adult volunteers.\n\nHowever, it is now said it was tested on double this number - 76 - at two institutions — the Moscow-based Sechenov University and the Defence Ministry's Burdenko Main Military Clinical Hospital.\n\nIt is unclear why the documentation linked to Sputnik V used the figure 38.\n\nOf the 76, around half are believed to have been serving military personnel who took part \"voluntarily.\"\n\nPutin said one of his daughters had been given the vaccine and had suffered no side effects worse than a high temperature.\n\n\"She's feeling well and has a high number of antibodies,\" he boasted.\n\nAlthough Putin did not specify which of his daughters was given the drug, Otkrytie Media reported it was Ekaterina - known as Katerina - Tikhonova.\n\nShe had the vaccination at a very early stage of its development, it was claimed.\n\nThere was no official confirmation that she was the vaccine's recipient.\n\n[RELATED] Melinda Gates: COVID-19 Vaccine Should Be Used on Black People First", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/russia-top-doctor-quits-gross-violations-covid-vaccine-114820.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Russia's Top Doctor Quits, Accuses Govt of 'Gross Violations' to Rush COVID Vaccine", "description": "Professor Alexander Chuchalin says government abused medical ethics - Russias top respiratory doctor has quit, accusing the Russian government of a series of gross v... | NEON NETTLE"}, "tags": ["Russia", "coronavirus", "Vaccine"], "tweets": [], "movies": [], "links": ["../tags/coronavirus", "../../news/11628-melinda-gates-covid-19-vaccine-should-be-used-on-black-people-first"], "authors": ["Jay Greenberg"], "publish_date": "2020-08-14"}