{"result_id": "219030", "URL": "https://neonnettle.com/news/19252-russia-threatens-to-strike-the-west-if-ukraine-uses-rockets-supplied-by-u-s", "timestamp": "2023-04-25 16:34:04 CEST+0200", "meta": {"description": "Neon Nettle - Russia Threatens to ‘Strike the West’ If Ukraine Uses Rockets Supplied by U.S - 'Our armed forces will have no other choice'", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/19252-russia-threatens-to-strike-the-west-if-ukraine-uses-rockets-supplied-by-u-s", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Russia Threatens to ‘Strike the West’ If Ukraine Uses Rockets Supplied by U.S", "cleaned_text": "Russia Threatens to ‘Strike the West’ If Ukraine Uses Rockets Supplied by U.S\n\n'Our armed forces will have no other choice'\n\nThe Kremlin has issued a veiled threat that if its territory is hit it could strike back directly at the West.\n\n\"One of President Putin’s closest allies has warned that Moscow could target western cities if Ukraine uses rocket systems supplied by the United States to carry out strikes on Russian territory,\" the UK Times is reporting.\n\nThe warning was given by close top Putin ally and former president Dmitry Medvedev, who currently serves as the Russian security council deputy chairman.\n\n\"If, God forbid, these weapons are used against Russian territory then our armed forces will have no other choice but to strike decision-making centers,\" Medvedev warned in the new statements.\n\nThat's when he suggested the following for the first time, marking a severe escalation of rhetoric:\n\n\"Of course, it needs to be understood that the final decision-making centers in this case, unfortunately, are not located on the territory of Kyiv\" - with the suggestion being that those Western capitals supplying the advanced arms could come under attack in response.\n\nPreviously Russia has threatened to hit \"decision-making centers\" within Ukraine, such as Kiev and Lviv.\n\nThese cities have been targeted on occasion, but rarely, throughout the war now in its fourth month.\n\nThe US confirmed this past week that Ukraine would receive M142 high-mobility artillery rocket systems, which are medium-ranged, capable of striking targets some 50 miles away.\n\nPresident Biden on Tuesday stressed that \"we're not going to send to Ukraine rocket systems that strike into Russia\" - which the Kremlin acknowledged as a \"rational\" decision, while still condemning the transfer of the systems.\n\nUkraine's government, meanwhile, has reportedly given Washington \"assurances\" that it will not uses US-supplied weaponry to target Russian territory, which Moscow has long made clear would mark a severe violation of its \"red lines.\"\n\n\"The West has been increasingly willing to give Ukraine longer-range weaponry, including M777 howitzers, as its forces battle Russians with more success than intelligence officials had predicted.\"\n\nLikely these fresh warnings from Medvedev serve to further warn and enforce Russia's red line.\n\nWhile the longer-range MLRS missiles are apparently off the table for now, which can reach up to 190 miles away, the shorter-range MLRS systems could easily be updated with the larger, more advanced, and longer-range systems.\n\nOn the sanctions and economic war front, Poland officials have on Saturday said the next, seventh round of anti-Russia sanctions is currently being readied - suggesting that for the time being the ongoing Russian-NATO/EU standoff will only escalate further.\n\nNegotiations are at the same time stalled completely, and diplomatic openings and communications are fewer and fewer, making the situation even more dangerous.\n\n[READ MORE] Ukraine President: Biden to Blame for Russian Invasion", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/russia-warns-o488.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Russia Threatens to ‘Strike the West’ If Ukraine Uses Rockets Supplied by U.S", "description": "'Our armed forces will have no other choice' - The Kremlin has issued a veiled threat that if its territory is hit it could strike back directly... | NEON NETTLE"}, "tags": ["Russia Ukraine", "Putin"], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">The map shows where HIMARS MLRS M30/M31 rockets can strike on the front line with a range of up to 70 km. Also, M30 / M31 missiles can hit Snake Island, 50 km from the nearest Ukrainian city. <a href=\"https://t.co/idDDNjpK4M\">pic.twitter.com/idDDNjpK4M</a></p>&#13;\n— ТРУХА⚡️English (@TpyxaNews) <a href=\"https://twitter.com/TpyxaNews/status/1532596529638301696?ref_src=twsrc%5Etfw\">June 3, 2022</a></blockquote>&#13;\n", "<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/Donetsk?src=hash&amp;ref_src=twsrc%5Etfw\">#Donetsk</a> - The city center of Donetsk is under heavy shelling from <a href=\"https://twitter.com/hashtag/Ukraine?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukraine</a> this evening. The exact target is unclear from this footage. <a href=\"https://t.co/8cmwTiaFqc\">pic.twitter.com/8cmwTiaFqc</a></p>&#13;\n— OSINT Aggregator (@AggregateOsint) <a href=\"https://twitter.com/AggregateOsint/status/1533156039201157120?ref_src=twsrc%5Etfw\">June 4, 2022</a></blockquote>&#13;\n"], "movies": [], "links": ["https://t.co/idDDNjpK4M", "https://twitter.com/TpyxaNews/status/1532596529638301696?ref_src=twsrc%5Etfw", "https://sg.news.yahoo.com/russia-ukraine-dmitry-medvedev-us-rockets-nuclear-165640289.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuemVyb2hlZGdlLmNvbS8&guce_referrer_sig=AQAAAHYNQeuqnWLZYYcPTdi8QrVdH_PTZ6JEYg8LC_CXKM5ZsDvp_T4Ng1IC2LGRhGilzZLrsou3yPDX4yhortyYBqygigGQ4ZEdmQBp3nyRs7Ap6k3V-sh2c502SWyIYnXN0j94eSRybHK4yvzj3xLVdmZuEy7WPNMLjzEfqL9JK2DR", "https://twitter.com/hashtag/Donetsk?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Ukraine?src=hash&ref_src=twsrc%5Etfw", "https://t.co/8cmwTiaFqc", "https://twitter.com/AggregateOsint/status/1533156039201157120?ref_src=twsrc%5Etfw", "../../news/18473-ukraine-president-biden-to-blame-for-russian-invasion"], "authors": ["Daniel Newton"], "publish_date": "2022-06-05"}