{"result_id": "219037", "URL": "https://neonnettle.com/news/14850-pentagon-scientists-invent-microchip-that-detects-filters-covid-19-from-your-body", "timestamp": "2023-04-25 16:34:25 CEST+0200", "meta": {"description": "Neon Nettle - Pentagon Scientists Invent Microchip that Detects & 'Filters' COVID-19 from Your Body - Defense Advanced Research Projects Agency (DARPA) develops chip to implant under skin", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/14850-pentagon-scientists-invent-microchip-that-detects-filters-covid-19-from-your-body", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Pentagon Scientists Invent Microchip that Detects & 'Filters' COVID-19 from Your Body", "cleaned_text": "Pentagon Scientists Invent Microchip that Detects & 'Filters' COVID-19 from Your Body\n\nA team of Pentagon scientists has invented a microchip that can detect COVID-19 and \"filter\" it out from your body.\n\nResearchers at the Defense Advanced Research Projects Agency (DARPA) developed the chip that is implanted underneath the skin and can detect a coronavirus infection before the person feels any symptoms.\n\nThe chip will detect a COVID-19 infection and works with a revolutionary filter that can remove the virus from the blood when attached to a dialysis machine.\n\nDARPA has been working for years on preventing and fighting pandemics.\n\nHowever, some of the ingenious solutions the team produces sometimes appear more from a science fiction novel than a working laboratory.\n\nThe agency revealed its latest microchip invention during 60 Minutes on Sunday night.\n\nThe microchip is sure to spark worries among some about a government agency implanting a microchip in a citizen.\n\nOfficials who spoke to the 60 Minutes team said the Pentagon isn't looking to track your every move.\n\nA more detailed explanation was not given.\n\nRetired Colonel Matt Hepburn, an army infectious disease physician leading DARPA's response to the pandemic, showed the 60 Minutes team a tissue-like gel, engineered to continuously test your blood.\n\n\"You put it underneath your skin and what that tells you is that there are chemical reactions going on inside the body, and that signal means you are going to have symptoms tomorrow,\" he explained.\n\nHe said they were inspired by the struggle to stem the virus's spread onboard the USS Theodore Roosevelt, where 1,271 crew members tested positive for the coronavirus.\n\n\"It's like a 'check engine' light,\" said Hepburn.\n\n\"Sailors would get the signal, then self-administer a blood draw and test themselves on site.\n\n\"We can have that information in three to five minutes.\n\n\"As you truncate that time, as you diagnose and treat, what you do is you stop the infection in its tracks.\"\n\nTroops are likely to be highly skeptical of the new invention.\n\nIn February, The New York Times reported that a third of troops have refused to take the vaccine, sighting concerns that the vaccine contains a microchip devised to monitor recipients, that it will permanently disable the body’s immune system or that it is some form of government control.\n\nAnother invention of Hepburn's team is a filter, which is placed on a dialysis machine and removes the virus from the blood.\n\nThe experimental four-day treatment was given to \"Patient 16,\" a military spouse, who was in the ICU with organ failure and septic shock.\n\n\"You pass it through, and it takes the virus out and puts the blood back in,\" said Hepburn.\n\nThe FDA has authorized the filter for emergency use, and it has been used to treat nearly 300 critically ill patients.\n\nAnother Pentagon agency, the Joint Pathology Institute, studies tissue samples from soldiers and sailors infected with pathogens all over the world.\n\nA member of the team, Dr. Kayvon Modjarrad, is currently trying to create a vaccine against all coronaviruses.\n\n\"This is not science fiction, this is science fact,\" he told the show.\n\n\"We have the tools, we have the technology, to do this all right now.\"\n\nHe said the aim was to be able to inoculate people against deadly viruses that have not even been identified.\n\n\"Killer viruses that we haven't seen or even imagined, we'll be protected against,\" he said.\n\n[RELATED] World Economic Forum Promotes 'Smart Mask' that Sends 'Alerts' if You Don't Wear It", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/scientists-micropchip-detect-filter-covid-body-112421.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Pentagon Scientists Invent Microchip that Detects & 'Filters' COVID-19 from Your Body", "description": "Defense Advanced Research Projects Agency (DARPA) develops chip to implant under skin - A team of Pentagon scientists has invented a microchip that can detect COVID-19 and filter it o... | NEON NETTLE"}, "tags": ["AdFree", "Bill Gates"], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">Among some of the current projects that the Defense Advanced Research Projects Agency is developing: a health-monitoring subdermal implant. It’s not a government tracking microchip, but rather a tissue-like gel engineered to continuously test your blood. <a href=\"https://t.co/1UDs9dBNcE\">https://t.co/1UDs9dBNcE</a> <a href=\"https://t.co/Zfph8xQUKC\">pic.twitter.com/Zfph8xQUKC</a></p>&#13;\n— 60 Minutes (@60Minutes) <a href=\"https://twitter.com/60Minutes/status/1381394043121381379?ref_src=twsrc%5Etfw\">April 11, 2021</a></blockquote>&#13;\n"], "movies": [], "links": ["https://www.cbsnews.com/news/last-pandemic-science-military-60-minutes-2021-04-11/?ftag=CNM-00-10aab7d&linkId=115939030", "https://www.dailymail.co.uk/news/article-9460389/Pentagon-scientists-invent-microchip-senses-COVID-19-body-symptoms.html?ns_mchannel=rss&ito=1490&ns_campaign=1490", "https://t.co/1UDs9dBNcE", "https://t.co/Zfph8xQUKC", "https://twitter.com/60Minutes/status/1381394043121381379?ref_src=twsrc%5Etfw", "https://www.nytimes.com/2021/02/27/us/politics/coronavirus-vaccine-refusal-military.html", "../../news/14810-world-economic-forum-promotes-smart-mask-that-sends-alerts-if-you-don-t-wear-it"], "authors": ["Jay Greenberg"], "publish_date": "2021-04-12"}