{"result_id": "219011", "URL": "https://neonnettle.com/news/15516-top-chinese-military-scientist-died-mysteriously-after-filing-covid-vaccine-patent", "timestamp": "2023-04-25 16:33:10 CEST+0200", "meta": {"description": "Neon Nettle - Top Chinese Military Scientist Died Mysteriously after Filing COVID Vaccine Patent - Investigation launched after CCP scientist filed COVID-19 vaccine patent in Feb 2020", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/15516-top-chinese-military-scientist-died-mysteriously-after-filing-covid-vaccine-patent", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Top Chinese Military Scientist Died Mysteriously after Filing COVID Vaccine Patent", "cleaned_text": "An international investigation has been launched after it has now emerged that a leading Chinese Communist Party (CCP) scientist died mysteriously shortly after filing a patent for a COVID-19 vaccine, according to reports.\n\nThe Five Eyes intelligence alliance is reportedly investigating the death of China's The People’s Liberation Army scientist Zhou Yusen.\n\nThe circumstances surrounding Zhou's sudden passing have set off alarm bells in the international community as the military scientist filed the patent in February 2020, which experts warn would be too soon to develop after the CCP claims to have discovered the virus.\n\nZhou also reportedly had connections to the Wuhan Institute of Virology’s “Bat Woman,” Shi Zhengli.\n\nThe Australian reported that national security experts told the publication that this was proof that the Wuhan Institute of Virology was engaged in “secret military activity.”\n\nHis death in Spring 2020 - just weeks after filing the patent - is shrouded in mystery, with no official reason given by the Chinese government.\n\nZhou, who conducted the research in conjunction with the Wuhan institute, the University of Minnesota and the New York Blood Centre, was the first to file a patent for a Covid-19 vaccine on February 24 last year, according to documents obtained by The Weekend Australian. This was only five weeks after China admitted there was human-to-human transmission of the virus. Zhou is listed as the lead inventor on the patent application lodged by the “Institute of Military Medicine, Academy of Military Sciences of the PLA”.\n\nNikolai Petrovsky, a medical researcher at Flinders University who has been creating a vaccine for the coronavirus, told the publication that while it was technically possible a vaccine could have been developed in that short amount of time, it would be unlikely and considered a “remarkable achievement.”\n\nHe said, “This is something we have never seen achieved before, raising the question of whether this work may have started much ­earlier.”\n\nHowever, just several weeks after Zhou filed the patent for the vaccine, he died. The Australian reported that the Five Eyes intelligence alliance — which is comprised of intelligence agencies from the United States, Canada, United Kingdom, Australia, and New Zealand — is now investigating Zhou’s “unexplained death” in May.\n\n\"While he was an award-­winning military scientist, there were no reports paying tribute to his life,” the report said.\n\n\"His death was only mentioned in passing in a Chinese-media report in July and at the end of a December scientific paper, both had the word ­’deceased’ in brackets after his name.\n\n\"The Weekend Australian has established that his death has been treated as unusual and is an early line of inquiry under the new Five Eyes probe into the origins of Covid-19 launched by Joe Biden.”\n\nThe report said that Zhou had conducted research experimenting with the spike proteins in coronaviruses and vaccine development.\n\nDavid Asher, who led the Trump administration’s investigation into the origins of the COVID-19 pandemic, told Fox News during the last week in May that he had U.S. government biostatisticians calculate the probability that the coronavirus developed evolved in nature.\n\nHe said they concluded that it was “about one in 13 billion.”\n\n[READ MORE] Kamala Harris Named in Hunter Biden Email as Key Contact on China Deal", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/china-admits-destroying-coronavirus-samples-417520.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Top Chinese Military Scientist Died Mysteriously after Filing COVID Vaccine Patent", "description": "Investigation launched after CCP scientist filed COVID-19 vaccine patent in Feb 2020 - An international investigation has been launched after it has now emerged that a leading Chinese ... | NEON NETTLE"}, "tags": ["China", "AdFree"], "tweets": [], "movies": [], "links": ["https://twitter.com/SharriMarkson/status/1400926746292097026", "https://www.dailywire.com/news/biostatisticians-calculated-odds-of-coronavirus-evolving-naturally-to-be-1-in-13-billion-top-ex-pandemic-investigator-says", "../../news/13552-kamala-harris-named-in-hunter-biden-email-as-key-contact-on-china-deal"], "authors": ["Jay Greenberg"], "publish_date": "2021-06-08"}