{"result_id": "219002", "URL": "https://neonnettle.com/news/12626-doctor-slams-calls-for-mandatory-covid-19-vaccines", "timestamp": "2023-04-25 16:32:40 CEST+0200", "meta": {"description": "Neon Nettle - Doctor Slams Calls for Mandatory COVID-19 Vaccines - Medical doctor argues getting people vaccinated 'serves certain special interests'", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/12626-doctor-slams-calls-for-mandatory-covid-19-vaccines", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Doctor Slams Calls for Mandatory COVID-19 Vaccines", "cleaned_text": "An American doctor has slammed calls for COVID-19 vaccines to be mandatory for the entire population, arguing that forcing people to get vaccinated only \"serves certain special interests.\"\n\nDr. Leland Stillman was speaking at the “March Against Mandates” in Richmond, Virginia, earlier this month.\n\nStillman was asked by a reporter whether he believes the push for a vaccine may be, in some way, financially motivated.\n\n“I have no doubt about it,” Dr. Stillman responded.\n\nStillman, a physician, insists that “it’s quite clear from the data” that the coronavirus “is not nearly as virulent or deadly as it was made out to be originally.”\n\n\"I have friends in New York City,\" he continued.\n\n\"I have friends in New Jersey who worked through the COVID-19 pandemic, at the peak of it, saw the sickest patients, who had lots of patients on ventilators.”\n\nBut on the other hand, “I work in rural America, and I’ve seen three cases in eight months.\n\n\"And one of them was a false positive.\n\n\"You’re going to tell me everybody ought to be vaccinated over a virus that seems to be harming a very, very small proportion of Americans, most of whom were already extremely old or malnourished or extremely sick?\n\nHe pointed out that the people dying from the virus “are clearly people who are sick previously,” sometimes “by their own choices: they ate poorly, they smoked, they didn’t exercise.”\n\nAt the same time, “the public at large who may work very hard and spend a lot of money keeping up their health, is being told that they’re going to be forced to vaccinate with a vaccine that, again, we don’t know the efficacy of, and we don’t know the side effects of.”\n\nHe said an attitude like this “certainly violates the principle...that I was taught as a physician, which is primum non nocere, which means, ‘first, do no harm.’\n\n\"So it’s just, this is all political theater, and it’s an agenda to get people vaccinated because it serves certain special interests.”\n\nStillman said Americans “need to wake up to the fact that the mainstream media is not telling them the truth about their health.\n\n\"Because the reality is that the mainstream media works for the people who pay their salaries.\n\n“And you can go through the list of the top advertisers on any mainstream media network, and you will see that they are producing things that either make you sick, or treat the sicknesses that you have.\n\n\"Why would anyone who’s got that agenda tell you how to be healthy?” he asked.\n\nAsked about the benefits of using hydroxychloroquine (HCQ) to treat COVID-19, Stillman said he did not have personal experience with the medication.\n\nAmong his friends in the medical profession, however, he said the response seemed to be positive.\n\n[RELATED] Bill Gates: 'Final Hurdle' for COVID-19 Vaccine is Ensuring People Take It", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/doctor-slams-calls-mandatory-covid-19-vaccine-116920.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Doctor Slams Calls for Mandatory COVID-19 Vaccines", "description": "Medical doctor argues getting people vaccinated 'serves certain special interests' - An American doctor has slammed calls for COVID-19 vaccines to be mandatory for the entire populat... | NEON NETTLE"}, "tags": ["coronavirus", "Bill Gates"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "620", "height": "340", "embed_code": "<iframe src=\"https://www.youtube.com/embed/BegGXhBD4Lc\" width=\"620\" height=\"340\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/BegGXhBD4Lc"}], "links": ["https://www.lifesitenews.com/news/young-doctor-explains-why-hes-against-forced-covid-19-vaccine", "../../news/11795-bill-gates-final-hurdle-for-covid-19-vaccine-is-ensuring-people-take-it"], "authors": ["Jay Greenberg"], "publish_date": "2020-09-16"}