{"result_id": "219032", "URL": "https://neonnettle.com/news/14926-florida-gov-desantis-covid-lockdown-orders-were-a-huge-mistake-", "timestamp": "2023-04-25 16:34:10 CEST+0200", "meta": {"description": "Neon Nettle - Florida Gov DeSantis: COVID Lockdown Orders Were a 'Huge Mistake' - Governor says he regrets ordering a 30-day lockdown across his state last year", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/14926-florida-gov-desantis-covid-lockdown-orders-were-a-huge-mistake-", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Florida Gov DeSantis: COVID Lockdown Orders Were a 'Huge Mistake'", "cleaned_text": "Governor says he regrets ordering a 30-day lockdown across his state last year\n\nFlorida's Republican governor, Ron DeSantis, has spoken out to declare that he believes lockdown orders, implemented across America to tackle the COVID-19 pandemic, were a \"huge mistake.\"\n\nSpeaking during an interview this week, Gov. DeSantis said he regrets ordering a 30-day lockdown across his own state last year.\n\nDeSantis told the Epoch Times on Friday that the measures \"didn't work.\"\n\n“We wanted to mitigate the damage,\" the governor explains.\n\n\"Now in hindsight, the 15 days to slow the spread and the 30 – it didn’t work.\n\n\"We shouldn’t have gone down that road.\"\n\nWhile the Florida lockdown, which was imposed in April 2020, was less restrictive than those in many states, DeSantis regrets issuing the order.\n\nLockdowns across the US have destroyed lives and devastated economies, and DeSantis and other Republican governors have argued that states that continue to impose such orders are harming their residents without curtailing the spread of Covid-19.\n\nThat same month, DeSantis banned local governments from enforcing mask mandates.\n\nEarlier this month, he issued an executive order banning businesses and government entities from requiring so-called vaccine passports to access goods, services, or activities.\n\nSuch decisions have made DeSantis a target of mainstream media attacks – and helped make him a top early contender for the 2024 GOP presidential nomination.\n\nPollster Tony Fabrizio found in March that DeSantis has 17% support among Republican primary voters if President Donald Trump isn’t in the race.\n\nOnly former Vice President Mike Pence polled higher, at 19%.\n\nDespite having the second-highest percentage of elderly population in the US, Florida ranks behind 27 other states in COVID-19 death rate, currently 159 per 100,000.\n\nThe four states with the highest death rates – New Jersey, New York, Massachusetts, and Rhode Island – are all run by Democrats and have imposed relatively tight COVID-19 restrictions on their residents.\n\nDeSantis also spoke out on Friday against recommendations by Dr. Anthony Fauci, President Joe Biden’s top medical adviser, to continue social-distancing precautions after someone has been fully vaccinated.\n\n“My view is, if you get a vaccine, the vaccines are effective,” DeSantis said.\n\n“If you tell people the opposite, then gee, you know why, if it’s not effective for them and it’s not going to change anything then what’s the point of going through it?\"\n\n[RELATED] Florida to Allow Citizens to Shoot Rioters & Looters Who Target Their Property", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/florida-gov-reopen-state-monday-coronavirus-lockdown-130420.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Florida Gov DeSantis: COVID Lockdown Orders Were a 'Huge Mistake'", "description": "Governor says he regrets ordering a 30-day lockdown across his state last year - Floridas Republican governor, Ron DeSantis, has spoken out to declare that he believes lockdown ... | NEON NETTLE"}, "tags": ["Florida", "Democrats", "lockdown"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/mkt_morningbrief/desantis-lockdowns-were-a-huge-mistake_3777926.html", "../../news/14762-florida-governor-bans-vaccine-passports-with-executive-order", "https://thehill.com/homenews/campaign/541918-desantis-pence-tied-in-2024-republican-poll", "https://www.beckershospitalreview.com/public-health/us-coronavirus-deaths-by-state-july-1.html", "../tags/democrats", "../../news/13204-florida-to-allow-citizens-to-shoot-rioters-looters-who-target-their-property"], "authors": ["Jay Greenberg"], "publish_date": "2021-04-18"}