{"result_id": "219004", "URL": "https://neonnettle.com/news/19722-biden-planning-to-declare-monkeypox-a-public-health-emergency-ahead-of-midterms", "timestamp": "2023-04-25 16:32:45 CEST+0200", "meta": {"description": "Neon Nettle - Biden Planning to Declare Monkeypox a Public Health Emergency Ahead of Midterms - White House leaks reveal plans declare state of emergency", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/19722-biden-planning-to-declare-monkeypox-a-public-health-emergency-ahead-of-midterms", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Biden Planning to Declare Monkeypox a Public Health Emergency Ahead of Midterms", "cleaned_text": "Democrat Joe Biden is planning to declare monkeypox a public health emergency ahead of the looming red wave that is predicted for the midterm elections.\n\nThe Biden administration is weighing plans to declare a state of emergency in the coming days, according to reports.\n\nSources familiar with the matter reportedly told Politico the declaration could happen as soon as later this week.\n\nThe declaration would be made by Biden’s Department of Health and Human Services (HHS).\n\nSimilar measures in 2020 saw the roll-out of controversial mail-in voting for the presidential election, a move that significantly benefited the Democrats.\n\nDeclaring an emergency would give HHS access to additional funds and increase its staff to address the matter.\n\nSecretary Xavier Becerra is expected to hold press conferences this week to warn the public about the threat of monkeypox.\n\nThe report comes days after the World Health Organization (WHO) declared the international monkeypox virus outbreak a global health emergency.\n\nOfficials in the U.S. have been raising the alarm about monkeypox.\n\nHealth departments in San Francisco and other major cities say they still don’t have enough shots of the vaccine to meet demand.\n\n\"Unfortunately, because our federal government failed to act quickly to acquire the vaccine supplies needed to prevent an outbreak, we are now in a public health emergency that is only going to escalate,\" Weiner said.\n\n\"Given that gay and bi men and trans people are the most impacted, it’s sadly becoming clear that we are being left behind once again.\"\n\nThe monkeypox virus mainly spreads through skin-on-skin contact, but it can also transmit through touching linens used by someone with the infection.\n\nThe vast majority of cases reported have been in men who have sex with men.\n\nHowever, health officials have stressed that anyone can catch the virus.\n\n[READ MORE] Rand Paul: A ‘Day of Reckoning Is Coming,’ Americans Will ‘Rise Up’", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/drone-footage-migrants-biden-disaster-border-12821.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Biden Planning to Declare Monkeypox a Public Health Emergency Ahead of Midterms", "description": "White House leaks reveal plans declare state of emergency - Democrat Joe Biden is planning to declare monkeypox a public health emergency ahead of the loomin... | NEON NETTLE"}, "tags": ["Joe Biden", "Election"], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">It’s time for California &amp; San Francisco to declare a state of emergency on monkeypox.<br/><br/>Monkeypox isn’t contained. It’s spreading &amp; we don’t have enough vaccines or testing.<br/><br/>A state of emergency allows flexibility on testing, contracting for services &amp; vaccine administration.</p>&#13;\n— Senator Scott Wiener (@Scott_Wiener) <a href=\"https://twitter.com/Scott_Wiener/status/1552357059424751617?ref_src=twsrc%5Etfw\">July 27, 2022</a></blockquote>&#13;\n"], "movies": [], "links": ["https://www.foxnews.com/health/who-declares-monkeypox-global-health-emergency", "https://twitter.com/Scott_Wiener/status/1552357059424751617?ref_src=twsrc%5Etfw", "../../news/19696-rand-paul-a-day-of-reckoning-is-coming-americans-will-rise-up-"], "authors": ["Jay Greenberg"], "publish_date": "2022-07-28"}