{"result_id": "219041", "URL": "https://neonnettle.com/news/14762-florida-governor-bans-vaccine-passports-with-executive-order", "timestamp": "2023-04-25 16:34:38 CEST+0200", "meta": {"description": "Neon Nettle - Florida Governor Bans 'Vaccine Passports' with Executive Order - Gov. Ron DeSantis signs order to prohibit use of vaccine proof certificates", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/14762-florida-governor-bans-vaccine-passports-with-executive-order", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Florida Governor Bans 'Vaccine Passports' with Executive Order", "cleaned_text": "Gov. Ron DeSantis signs order to prohibit use of vaccine proof certificates\n\nFlorida's Republican Governor Ron DeSantis has signed an executive order to ban the use of \"vaccine passports\" in his state.\n\nGov. DeSantis also said that the state legislature is striving to make the protections “permanent.”\n\nDeSantis asserts in his executive order that “vaccination passports reduce individual freedom and will harm patient privacy.”\n\nThe governor has previously described vaccine passports as a “terrible” and “unacceptable” idea.\n\nHe announced his executive order Friday, which prohibits the use of what he described as “so-called COVID-19 vaccine passports” in the Sunshine State.\n\n“The Legislature is working on making permanent these protections for Floridians and I look forward to signing them into law soon,” he said on Twitter.\n\nAccording to the executive order, Florida seeks to ensure that “every Floridian who desires a COVID-19 vaccine can obtain one.”\n\nThe order emphasizes that they will “not be mandated” and adding that vaccine passports “reduce individual freedom and will harm patient privacy.”\n\n“Requiring so-called COVID-19 vaccine passports for taking part in everyday life — such as attending a sporting event, patronizing a restaurant, or going to a movie theater— would create two cases of citizens based on vaccination,” the executive order reads.\n\nIt goes to add that it is “necessary to protect the fundamental rights and privacies of Floridians and the free flow of commerce within the state.”\n\nThe executive order specifically states that “no Florida government entity, or its subdivisions, agents, or assigns, shall be permitted to issue vaccine passports, vaccine passes, or other standardized documentation for the purpose of certifying an individual’s COVID-19 vaccination status to a third party, or otherwise publish or share individuals’ COVID-19 vaccination record or similar health information.”\n\nIt also bars businesses from requiring patrons or customers to provide such documentation, according to Breitbart.\n\nAll entities must comply to be eligible for grants or contracts funded through state revenue, the order adds.\n\nNotably, the executive action does not prohibit businesses from continuing to implement basic coronavirus screening protocols in accordance with state and federal law.\n\nWhite House press secretary Jen Psaki confirmed this week the White House is working with private companies to develop a vaccine passport, telling reporters the administration will “make some recommendations” throughout the process.", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/florida-scraps-obama-failed-common-core-11219.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Florida Governor Bans 'Vaccine Passports' with Executive Order", "description": "Gov. Ron DeSantis signs order to prohibit use of vaccine proof certificates - Floridas Republican Governor Ron DeSantis has signed an executive order to ban the use of vacci... | NEON NETTLE"}, "tags": ["Florida", "lockdown"], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">Today I issued an executive order prohibiting the use of so-called COVID-19 vaccine passports. The Legislature is working on making permanent these protections for Floridians and I look forward to signing them into law soon. Read my EO here – <a href=\"https://t.co/6QwLsLWEWm\">https://t.co/6QwLsLWEWm</a></p>&#13;\n— Ron DeSantis (@GovRonDeSantis) <a href=\"https://twitter.com/GovRonDeSantis/status/1378031400633430019?ref_src=twsrc%5Etfw\">April 2, 2021</a></blockquote>&#13;\n"], "movies": [], "links": ["https://www.breitbart.com/politics/2021/03/19/florida-gov-ron-desantis-vaccine-passports-terrible-idea-state-mandate-totally-off-table/", "https://www.flgov.com/wp-content/uploads/2021/04/EO-21-81.pdf", "https://t.co/6QwLsLWEWm", "https://twitter.com/GovRonDeSantis/status/1378031400633430019?ref_src=twsrc%5Etfw", "https://www.breitbart.com/politics/2021/04/02/florida-gov-ron-desantis-signs-executive-order-prohibiting-use-vaccine-passports/", "https://www.breitbart.com/politics/2021/03/29/white-house-working-with-corporations-to-develop-vaccine-passport/", "../../news/14744-kansas-republicans-end-democrat-governor-s-mask-mandate"], "authors": ["Jay Greenberg"], "publish_date": "2021-04-04"}