{"result_id": "219024", "URL": "https://neonnettle.com/news/15363-facebook-whistleblowers-expose-very-incriminating-censorship-campaign", "timestamp": "2023-04-25 16:33:46 CEST+0200", "meta": {"description": "Neon Nettle - Facebook Whistleblowers Expose ‘Very Incriminating’ Censorship Campaign - Two 'insiders' step forward with leaked internal documents", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/15363-facebook-whistleblowers-expose-very-incriminating-censorship-campaign", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Facebook Whistleblowers Expose ‘Very Incriminating’ Censorship Campaign", "cleaned_text": "Two Facebook whistleblowers have stepped forward to expose a disturbing plot to censor users' posts and comments on the platform.\n\nThe \"insiders\" have provided leaked internal documents to prove the social media giant is censoring users with concerns about the COVID-19 vaccine.\n\nThe memos show Facebook is demoting user comments by way of an algorithm that calculates a \"vaccine hesitancy score,\" Project Veritas reports.\n\nInvestigative journalist James O'Keefe, the head of Project Veritas, revealed on Fox News that two anonymous Facebook employees leaked documents showing that the company was testing a \"beta\" version of the algorithm that targets users who are \"hesitant\" about vaccines, even though they are not in violation of the company's policies.\n\nThe leaked documents purport to show that the beta version was being tested on 1.5 percent of some 3.8 billion users of Facebook and its subsidiary, Instagram, around the world.\n\n\"Based on that VH [vaccine hesitancy] score, we will demote or leave the comment alone depending on the content within the comment,\" one of the anonymous whistleblowers told Project Veritas.\n\nThe internal memos leaked to Project Veritas explain \"Vaccine Hesitancy Comment Demotion\" which shows the \"goal\" is to \"drastically reduce user exposure to vaccine hesitancy.\"\n\nIf a user expresses doubts about vaccines or appears \"hesitant,\" their posts and comments will be removed from the view of other users - even if they haven't explicitly made anti-vaccine statements - in an apparent effort to amplify the support for widespread vaccinations.\n\nAnother leaked document addressed \"Borderline Vaccine (BV) Framework\" that delves into how to classify such content with another expressed \"goal\" of to \"identify and tier the categories of non-violating content that could discourage vaccination in certain contexts, thereby contributing to vaccine hesitancy or refusal,\" adding \"We have tiered these by potential harm and how much context is required in order to evaluate harm.\"\n\n\"Facebook uses classifiers in their algorithms to determine certain content… they call it ‘vaccine hesitancy',\" one Facebook \"insider\" told Project Veritas founder James O'Keefe.\n\n\"And without the user's knowledge, they assign a score to these comments that's called the ‘VH Score,' the ‘Vaccine Hesitancy Score’.\n\n\"And then based on that score will demote or leave the comment alone depending on the content within the comment.\"\n\nThe insider, who is described by O'Keefe as a \"data center technician\" for Facebook, revealed that the tech giant was running a \"test\" on 1.5% of its 3.8 billion users with the focus on the comments sections on \"authoritative health pages.\"\n\n\"They're trying to control this content before it even makes it onto your page before you even see it,\" the insider told O'Keefe.\n\nThe ratings are divided into two tiers, one being \"Alarmism & Criticism\" and the other being \"Indirect Vaccine Discouragement\" which includes celebrating vaccine refusal and \"shocking stories\" that may deter others from taking the vaccine.\n\nThe algorithm flags key terms in comments to determine whether or not it can remain in place but allows human \"raters\" to make a ruling if the algorithm cannot do so itself.\n\nA second insider described as a \"Data Center Facility Engineer\" likened Facebook's actions as being in an \"abusive\" relationship where they're \"not allowing their spouse to speak out about the things that are going on in their marriage… and limiting their voice…\n\n\"It's very incriminating, in my opinion.\"\n\nIn response to the leaked documents, Facebook told Project Veritas, \"We proactively announced this policy on our company blog and also updated our help center with this information.\"\n\nO'Keefe told Fox News's Sean Hannity on Monday that Facebook is using the algorithm to target users who disseminate messaging that runs counter to the company's political ideology – even if the comments being made are factually accurate.\n\n\"The narrative [is] get the vaccine, the vaccine is good for you, everyone should get it,\" O'Keefe told Hannity.\n\n\"If you don't, you will be singled out as an enemy of society.\"\n\nThe first whistleblower told O'Keefe, in a video he played for Hannity, that Facebook CEO Mark Zuckerberg, wants to \"build a community where everyone complies -- not where people can have an open discourse and dialogue about the most personal and private and intimate decisions.\"\n\nThe employee stated that the policy will continue to expand its reach until \"anything can be violated.\"\n\n\"What's remarkable about these private documents that Facebook has not wanted you to see until tonight is that 'Tier 2' [violation] says even if the facts are true that you will be targeted and demoted -- your comments will be targeted and demoted,\" said O'Keefe.\n\nFacebook responded to Project Veritas, saying they \"proactively announced this policy on our company blog.\"\n\nO'Keefe, however, countered that the change in policy has largely been private – lamenting that Facebook's stated image as a free-speech town square is actually naught.\n\n\"They don't want you to know that they are doing this,\" he said.\n\n\"And this is the town square as you all know.\n\n\"We are trying to retake our town square.\n\n\"They are demoting your comments and de-boosting you on Facebook without you knowing that they are doing that.\n\n\"And they are obviously terrified of this report because they are responding to Project Veritas before they would attack us or ignore us.\"\n\n\"There is more to come,\" O'Keefe remarked.\n\n[RELATED] Candace Owens Challenges Facebook 'Fact-Checker' and Wins: 'They Lied for Democrats'", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/facebook-whistleblowers-insider-leak-documents-censorship-125521.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Facebook Whistleblowers Expose ‘Very Incriminating’ Censorship Campaign", "description": "Two 'insiders' step forward with leaked internal documents - Two Facebook whistleblowers have stepped forward to expose a disturbing plot to censor users pos... | NEON NETTLE"}, "tags": ["Propaganda", "Facebook"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "620", "height": "340", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/Kzhu0NPx6UI\" width=\"620\" height=\"340\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/Kzhu0NPx6UI"}], "links": ["https://www.foxnews.com/media/okeefe-project-veritas-hannity-facebook-vaccine-hesitancy", "https://www.projectveritas.com/news/breaking-facebook-whistleblowers-expose-leaked-internal-docs-detailing-new/", "../../news/13405-candace-owens-challenges-facebook-fact-checker-and-wins-they-lied-for-democrats-"], "authors": ["Jay Greenberg"], "publish_date": "2021-05-25"}