{"result_id": "219006", "URL": "https://neonnettle.com/news/4263-putin-on-wwiii-a-final-holy-war-is-the-only-thing-that-will-stop-the-elites-", "timestamp": "2023-04-25 16:32:52 CEST+0200", "meta": {"description": "Neon Nettle - Putin On WWIII: A Final Holy War Is The Only Thing That Will Stop The Elites  - Russian leader says global conflict will end after final holy war", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/4263-putin-on-wwiii-a-final-holy-war-is-the-only-thing-that-will-stop-the-elites-", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Putin On WWIII: A Final Holy War Is The Only Thing That Will Stop The Elites", "cleaned_text": "Putin On WWIII: A Final Holy War Is The Only Thing That Will Stop The Elites\n\nRussian leader says global conflict will end after final holy war\n\nRussian President Vladimir Putin has claimed that a final holy war or World War 3 will be “an end of civilization,” in a new interview during a live televised call-in show.\n\nThe Russian leader then went on to say that the threat should restrain elite international powers from pushing for global conflict.\n\nWhen giving his views on the huge risks of a new world war, he recalled Albert Einstein:\n\nJust a few months ago, Putin has given many warnings to the US and its coalition amid the recent Syria strikes.\n\nPutin, who is currently celebrating his next term as the president of Russia, has warned of the false flag chemical attacks and stage events that are designed to trigger a global war.\n\nIn a reference to the Cold War era, Putin said that “it was a fear of mutual destruction” that has always prevented the international actors from any radical moves and forced them to respect each other.\n\nThe Russian leader then pointed out that recent US actions – in particular its unilateral withdrawal from the Anti-Ballistic Missile Treaty signed with the Soviet Union – are nothing but an apparent “attempt to disrupt this strategic parity.”\n\nHe argued that Russia needs to develop its own state-of-the-art weapons systems to retain this condition.\n\nI don't know with what weapons World War III will be fought, but World War IV will be fought with sticks and stones - Putin quotes Einstein #DirectLine http://on.rt.com/9703\n\nPutin also said that the ongoing policy of sanctions and endless accusations of the West against Russia is “counterproductive” and harms the West’s own interests just as it harms Russia’s.\n\nWestern leaders believe it is a “means of deterring Russia’s development,” he said, adding that he believes “this policy is flawed.”\n\n“One should not ‘deter’ anyone, including Russia, but should develop constructive cooperation instead,” the president said.\n\nThis would, in turn, benefit everyone, and Western nations are becoming “gradually aware” of this fact.\n\n[READ MORE] Putin Announces Total Independence from 'Rothschild-Controlled' US Dollar", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/putin-ww3-conflict.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Putin On WWIII: A Final Holy War Is The Only Thing That Will Stop The Elites ", "description": "Russian leader says global conflict will end after final holy war - Russian President Vladimir Putin has claimed that a final holy war or World War 3 will ... | NEON NETTLE"}, "tags": ["World War III", "World War 3", "Putin"], "tweets": [], "movies": [], "links": ["../tags/world-war-iii", "../../news/4163-putin-issues-final-warning-to-us-and-nato-before-wwiii", "https://www.rt.com/news/428988-putin-wwiii-restrain-conflicts/", "../../news/4202-putin-announces-total-independence-from-rothschild-controlled-us-dollar"], "authors": ["Daniel Newton"], "publish_date": "2018-06-07"}