{"result_id": "219028", "URL": "https://neonnettle.com/news/13530-uk-health-workers-suffer-anaphylactoid-reaction-after-pfizer-s-covid-19-vaccine", "timestamp": "2023-04-25 16:33:58 CEST+0200", "meta": {"description": "Neon Nettle - UK Health Workers Suffer 'Anaphylactoid Reaction' After Pfizer's COVID-19 Vaccine - Government scientists call for calm as problems emerge from mass vaccination program", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/13530-uk-health-workers-suffer-anaphylactoid-reaction-after-pfizer-s-covid-19-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "UK Health Workers Suffer 'Anaphylactoid Reaction' After Pfizer's COVID-19 Vaccine", "cleaned_text": "Government scientists call for calm as problems emerge from mass vaccination program\n\nUK Government officials are calling for calm after it emerged that several health workers have suffered an \"anaphylactoid reaction\" after receiving the Pfizer COVID-19 vaccine.\n\nBritish scientists attempted to quash public panic about the Pfizer/BioNTech following reports that two NHS staff suffered an adverse reaction just after being immunized this week.\n\nThe jab is currently being rolled out across the country as part of the biggest-ever mass vaccination program in British history.\n\nWithin 24 hours of it getting underway, the UK's drug regulator told anyone with a serious allergy to medicines or food to stay away from the vaccine.\n\nThe number of people set to be excluded is not known, though up to seven million people in the country have allergies severe enough to require medical care, according to the NHS.\n\nAround 250,000 Brits need to carry an EpiPen at all times to treat an allergic reaction in an emergency.\n\nBoth the unnamed healthcare workers needed immediate treatment but are \"recovering well\" after they developed symptoms shortly after receiving the jab, according to The Daily Mail.\n\nIt is not known if either person needed to use the EpiPens they both carry with them at all times.\n\nThey suffered an \"anaphylactoid reaction\" to the vaccine, which is milder than anaphylaxis, and tends to involve a rash, shortness of breath, swelling of the face and tongue, or a drop in blood pressure, the NHS says.\n\nDespite the two allergy cases the Government is continuing to vaccinate between 5,000 and 7,000 people per day across the UK with 800,000 Pfizer doses already in hospitals and millions more on the way.\n\nYesterday, the Medicines and Healthcare products Regulatory Agency (MHRA) – which authorized emergency use of the vaccine at a breathtaking speed – gave precautionary advice to all 50 NHS trusts now vaccinating the population that anyone who has a history of \"significant\" allergic reactions to medicines or food should not receive the vaccine.\n\nHowever, British scientists called for calm as public fears of the alleged dangers of the new vaccine - which is said to have a 95 percent efficacy against infection – threaten to derail the NHS's mass inoculation program in the latest stage of the pandemic.\n\nProfessor Graham Ogg of Oxford University urged calm, saying: \"It will be important to now understand the specific nature of the reactions and the background medical history of the individuals affected so that any risks of reactions can be more closely defined.\n\n\"Staff are always prepared for the possibility of reactions and as with all medications, will continue to submit reports of any further episodes.\n\n\"In the meantime, reasonable precautions have been advised by the MHRA.\"\n\nIn the US vaccine trial carried out by Pfizer, 137 out of around 19,000 people given the vaccine had one or more of these reactions.\n\nBut 111 who got the placebo also had allergic reactions.\n\nReactions to the jab can include a temperature, nausea, swelling of the arm, or in severe cases, feeling generally unwell with swollen lymph node glands.\n\nA Pfizer spokesman said: \"We have been advised by MHRA of two yellow card reports that may be associated with allergic reaction due to administration of the COVID-19 BNT162b2 vaccine.\n\n\"As a precautionary measure, the MHRA has issued temporary guidance to the NHS while it conducts an investigation in order to fully understand each case and its causes.\n\n\"Pfizer and BioNTech are supporting the MHRA in the investigation.\n\n\"In the pivotal phase 3 clinical trial, this vaccine was generally well tolerated with no serious safety concerns reported by the independent Data Monitoring Committee.\n\n\"The trial has enrolled over 44,000 participants to date, over 42,000 of whom have received a second vaccination.\"\n\nThe allergy scare came hours after Britain's drug regulator dismissed safety fears over the Pfizer/BioNTech coronavirus vaccine after a report revealed four people in a trial in the US got Bell's palsy.\n\nThe condition, which is usually temporary, causes muscles on one side of the face to droop because of nerves not working properly.\n\nFour cases of it were found in a group of 21,720 people who had the Pfizer vaccine in a trial in the US, compared to none among 21,728 people given a placebo vaccine.\n\nBut this rate of occurrence is no different to how often it would be expected to happen in a random population, the company said.\n\n[RELATED] Melinda Gates: COVID-19 Vaccine Should Be Used on Black People First", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/uk-health-workers-reaction-covid-19-vaccnes-1101220.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "UK Health Workers Suffer 'Anaphylactoid Reaction' After Pfizer's COVID-19 Vaccine", "description": "Government scientists call for calm as problems emerge from mass vaccination program - UK Government officials are calling for calm after it emerged that several health workers have su... | NEON NETTLE"}, "tags": ["AdFree", "coronavirus"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-9034115/Allergy-risk-Pfizer-jab-TWO-patients-fall-ill-V-Day-rollout.html", "https://www.dailymail.co.uk/health/article-9030943/Four-volunteers-got-Pfizers-vaccine-developed-Bells-palsy.html", "../../news/11628-melinda-gates-covid-19-vaccine-should-be-used-on-black-people-first"], "authors": ["Jay Greenberg"], "publish_date": "2020-12-10"}