{"result_id": "219014", "URL": "https://neonnettle.com/news/14040-biden-administration-to-give-covid-vaccines-to-terrorists-first", "timestamp": "2023-04-25 16:33:19 CEST+0200", "meta": {"description": "Neon Nettle - Biden Administration to Give COVID Vaccines to Terrorists First - 9/11 terrorists to be prioritized, report says", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/14040-biden-administration-to-give-covid-vaccines-to-terrorists-first", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Biden Administration to Give COVID Vaccines to Terrorists First", "cleaned_text": "Biden Administration to Give COVID Vaccines to Terrorists First\n\n9/11 terrorists to be prioritized, report says\n\nJoe Biden is planning to offer the COVID-19 vaccine to terrorists and detainees held at the U.S. military prison in Guantánamo Bay, according to a New York Times report.\n\nThe Pentagon is planning to offer the coronavirus vaccine, which is still in high demand, to terror suspects as early as next week, according to the prosecutor in the case against 9/11 terrorists.\n\nThe detainees could receive the vaccines as early as Monday, the report says.\n\nTerrorist prosecutor, Clayton G. Trivett Jr., wrote to defense lawyers “that an official in the Pentagon has just signed a memo approving the delivery of the Covid-19 vaccine to the detainee population in Guantánamo.”\n\nU.S. naval base medical workers started vaccinating the 6,000 residents earlier this month, including the 1,500 troops assigned to the detention operation.\n\nThe Trump administration previously declined to say whether prisoners would be vaccinated.\n\nIt is not clear if the self-proclaimed mastermind behind the 9/11 attacks, Khalid Sheikh Mohammed, would have agreed to be vaccinated.\n\nAn Army judge has scheduled arraignment on Feb. 22 for three prisoners accused of conspiring in deadly terrorist attacks in Indonesia in 2002 and 2003. Under the timeline described by Mr. Trivett, prisoners who agree to be vaccinated could receive their second dose on the eve of the arraignment, the first at Guantánamo’s war court since 2014.\n\nThe demand for vaccines remains high across the United States, as limited supplies are reserved for vulnerable populations.\n\nChief medical adviser for Biden's coronavirus team, Dr. Anthony Fauci, predicted the availability for those in any category would likely come by April.\n\nFauci also did not rule out wearing two masks at once, even for those who have been vaccinated.\n\nHe added that it would not be until 70 and 85 percent of the population have been vaccinated to relax public health measures.\n\nSo far, the U.S. has distributed 48,386,275 vaccines.\n\n21,698,606 of those were administered as of January 28, according to the Centers for Disease Control and Prevention’s (CDC) data\n\nLast year, Rep. Tulsi Gabbard (D-HI) insisted that vulnerable Americans like the elderly should be vaccinated before politicians and those in government.\n\nThe former Democratic presidential candidate also blasted the Centers for Disease Control (CDC) for prioritizing healthy \"essential workers\" over the older population.\n\n[READ MORE] Bill Gates: 'Final Hurdle' for COVID-19 Vaccine is Ensuring People Take It", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/Biden-Administration-to-Give-COVID-Vaccines-to-Terrorists-First.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Biden Administration to Give COVID Vaccines to Terrorists First", "description": "9/11 terrorists to be prioritized, report says - Joe Biden is planning to offer the COVID-19 vaccine to terrorists and detainees held at the U.S. ... | NEON NETTLE"}, "tags": ["Joe Biden", "coronavirus"], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/live/2021/01/28/world/covid-19-coronavirus#prisoners-at-guantanamo-bay-will-be-offered-vaccination-the-pentagon-says", "../tags/coronavirus", "https://www.bbc.co.uk/news/world-us-canada-49532731", "../../news/13699-fauci-warns-the-worst-is-yet-to-come-with-coronavirus-surge", "../../news/13670-tulsi-gabbard-declines-covid-19-vaccine-says-elderly-should-be-priority-", "../../news/11795-bill-gates-final-hurdle-for-covid-19-vaccine-is-ensuring-people-take-it"], "authors": ["Jack Murphy"], "publish_date": "2021-01-29"}