{"result_id": "219035", "URL": "https://neonnettle.com/features/1803-bill-gates-we-can-only-go-back-to-normal-when-the-population-is-widely-vaccinated-", "timestamp": "2023-04-25 16:34:18 CEST+0200", "meta": {"description": "Neon Nettle - Bill Gates: We Can Only Go Back to 'Normal' When the Population is 'Widely Vaccinated' - Billionaire speaks out on COVID-19 pandemic", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/features/1803-bill-gates-we-can-only-go-back-to-normal-when-the-population-is-widely-vaccinated-", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Bill Gates: We Can Only Go Back to 'Normal' When the Population is 'Widely Vaccinated'", "cleaned_text": "Bill Gates: We Can Only Go Back to 'Normal' When the Population is 'Widely Vaccinated'\n\nBillionaire Bill Gates has warned that life can only return to \"normal\" once the population has been \"widely vaccinated\" for COVID-19.\n\nBill Gates, the founder of Microsoft, said life after the coronavirus pandemic will not be the same “for some time” without most people taking a vaccine.\n\nIn a lengthy interview with CBS This Morning earlier this year, Gates predicted that people’s fear of large public gatherings would take time to subside.\n\nHe said it would be closer to normal “once we have the vaccination.”\n\n“Our foundation works a lot on diagnostics and vaccines,” Gates, who leads the Bill & Melinda Gates Foundation with his wife, said at the time.\n\nVaccine developers are the ones “that can really get things back on track where we’re not worried about large public gatherings,” he insists.\n\nAccording to Gates, “there’s a lot of dialog between our foundation experts and the government,” about opening up life to normal activities after the pandemic is under control.\n\n“Which activities, like schools, have such benefit and can be done in a way that the risk of transmission is very low?\n\n\"And which activities, like mass gatherings, may be – in a certain sense – more optional?\n\n\"And so until you’re widely vaccinated, those may not come back at all.”\n\nGates, an abortion supporter and population control advocate, has spoken about using vaccines in the past to reduce the world’s population.\n\n\"Now if we do a really great job on new vaccines, health care, reproductive health services, we lower that [the population] by perhaps 10 or 15 percent,\" he said in a 2010 TED (Technology, Entertainment, Design) conference.\n\nSome parents worry that whatever coronavirus vaccination is developed will become mandatory, overriding any objections based on parental rights, health reasons, or religious concerns.\n\nGates said during the CBS interview there are currently “seven or more” potential vaccines that look promising to combat the COVID-19 pandemic.\n\nIn order to have billions of doses of the vaccine ready to go as soon as possible, Gates proposed to build factories mass-producing each of the potential vaccines while testing is being done.\n\nIn the end, “only probably two of the vaccines will be the ones we go ahead with,” he admitted, pointing to the enormous risks involved in making his plan a reality.\n\nGates also mentioned that a nationwide approach to the COVID-19 pandemic is needed, echoing what he had written in a Washington Post op-ed on April 1.\n\n“Because people can travel freely across state lines, so can the virus,” Gates stated.\n\n\"The country’s leaders need to be clear: Shutdown anywhere means shutdown everywhere.\n\n\"Until the case numbers start to go down across America – which could take 10 weeks or more – no one can continue business as usual or relax the shutdown.\"\n\nIn the CBS This Morning interview, Gates said it was important to act quickly after the coronavirus outbreak – even more quickly than was the case.\n\n“We understand what needs to be done here. It’s going to be very painful.\n\n\"But taking the pain early means there’s a lot less pain both medically and economically than if we dilly-dally and wait until every town has big numbers before we react.”\n\nThe Microsoft founder said the COVID-19 pandemic will, in the end, cost trillions of dollars, as well as hundreds of thousands of lives globally.\n\n“For the next one, we will be far more ready than we were for this one,” he predicted.\n\n[RELATED] Petition to Investigate Bill Gates for 'Crimes Against Humanity' Goes Viral", "opengraph": {"type": "article", "url": "https://neonnettle.com/features/1803-bill-gates-we-can-only-go-back-to-normal-when-the-population-is-widely-vaccinated-", "image": "https://neonnettle.com/features/images/bill-gates-blasts-america-turning-inward-globalism-coronavirus-crisis-126620.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Bill Gates: We Can Only Go Back to 'Normal' When the Population is 'Widely Vaccinated'", "description": "Billionaire speaks out on COVID-19 pandemic - Billionaire Bill Gates has warned that life can only return to normal once the population has b... | NEON NETTLE"}, "tags": ["coronavirus", "Bill Gates"], "tweets": [], "movies": [], "links": ["../tags/coronavirus", "https://www.youtube.com/watch?v=4X-KkQeMMSQ", "https://www.lifesitenews.com/news/bill-gates-life-wont-go-back-to-normal-until-population-widely-vaccinated", "https://www.ted.com/talks/bill_gates_innovating_to_zero", "https://www.washingtonpost.com/opinions/bill-gates-heres-how-to-make-up-for-lost-time-on-covid-19/2020/03/31/ab5c3cf2-738c-11ea-85cb-8670579b863d_story.html", "../../news/12023-petition-to-investigate-bill-gates-for-crimes-against-humanity-goes-viral"], "authors": ["Neon Nettle"], "publish_date": "2020-09-13"}