{"result_id": "219007", "URL": "https://neonnettle.com/news/12289-russia-s-world-s-first-covid-vaccine-was-tested-on-putin-s-own-daughter", "timestamp": "2023-04-25 16:32:56 CEST+0200", "meta": {"description": "Neon Nettle - Russia's 'World's First' COVID Vaccine Was Tested on Putin's Own Daughter - Russian president claims his country has approved first coronavirus vaccine", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/12289-russia-s-world-s-first-covid-vaccine-was-tested-on-putin-s-own-daughter", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "Russia's 'World's First' COVID Vaccine Was Tested on Putin's Own Daughter", "cleaned_text": "Russia's 'World's First' COVID Vaccine Was Tested on Putin's Own Daughter\n\nRussian president claims his country has approved first coronavirus vaccine\n\nRusssian President Vladimir Putin announced this week that Russia's health ministry has approved the world’s \"first\" COVID-19 vaccine, according to the country's state-run media.\n\nThe world’s first clinically approved vaccine against the coronavirus has reportedly been manufactured by the Gamaleya Research Institute in collaboration with the Russian Defence Ministry.\n\nPutin reportedly claims that his daughter has already received the vaccination and hopes that Russia would soon start the mass production of the COVID-19 vaccine.\n\nHe added that his daughter had a mild temperature after she was vaccinated but it quickly went away.\n\nPutin revealed that the vaccine received the green signal after extensive trials.\n\nRussia has become the first country to register a coronavirus vaccine, however, questions have been raised over the decision to register its vaccine before Phase 3 trials which last for months.\n\nPutin said mass production of the vaccine will start soon after claiming that the vaccine has completed all the necessary tests.\n\nMoscow named its first approved COVID-19 vaccine \"Sputnik V\" for foreign markets, a reference to the world's first satellite.\n\nRussia's health ministry confirmed regulatory approval had been given after less than two months of human testing by Moscow's Gamaleya Institute.\n\nSpeaking at a government meeting on state television, Mr. Putin said the vaccine, developed by Moscow's Gamaleya Institute, was safe and that it had even been administered to one of his daughters.\n\nThe Russian president hailed the vaccine and said it \"works rather effectively.\"\n\n\"As far as I know, this morning for the first time in the world a vaccine against the novel coronavirus infection was registered,\" he said.\n\n\"I know that it works rather effectively, forms a stable immunity, and, I repeat, it passed all the necessary inspections.\"\n\nThe Russian leader said he hoped the country would soon start mass-producing the vaccine.\n\nKirill Dmitriev, head of the country's RDIF sovereign wealth fund, said Russia had already received requests from more than 20 countries for 1 billion doses of its newly-registered vaccine.\n\nThe move paves the way for mass inoculation even as the final stages of clinical trials to test safety and efficacy continue.\n\nThe speed at which Russia is moving to roll out its vaccine highlights its determination to win the global race for an effective product.\n\nBut it has also stirred concerns Russia may be putting national prestige before science and safety.\n\nIts approval by the health ministry foreshadows the start of a larger trial involving thousands of participants, commonly known as a Phase III trial.\n\nSuch trials, which require a certain rate of participants catching the virus to observe the vaccine's effect, are normally considered essential precursors for a vaccine to receive regulatory approval.\n\nRegulators around the world have insisted that the rush to develop COVID-19 vaccines will not compromise safety.\n\nBut recent surveys show growing public distrust in governments' efforts to rapidly-produce such a vaccine.\n\nHe told Bloomberg: “Why are all corporations following the rules, but Russian ones aren’t?\n\n\"The rules for conducting clinical trials are written in blood. They can’t be violated.\n\n\"This is a Pandora’s Box and we don’t know what will happen to people injected with an unproven vaccine.”\n\nRussian health workers treating COVID-19 patients will be offered the chance of volunteering to be vaccinated soon after the vaccine's approval, a source said previously.\n\nIt comes after Russia reported 4,945 new coronavirus cases and 130 deaths in the past 24 hours, with the official death toll rising to 15,131\n\nThis pushed its national case tally to 897,599, the fourth largest in the world.\n\nMore than 100 possible vaccines are being developed around the world to try to stop the COVID-19 pandemic.\n\nAt least four are in final Phase III human trials, according to the World Health Organization (WHO) data, including three developed in China and another in Britain.\n\n[RELATED] Bill Gates: 'Final Hurdle' for COVID-19 Vaccine is Ensuring People Take It", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/russia-covid-vaccine-tested-putin-daughter-112820.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "Russia's 'World's First' COVID Vaccine Was Tested on Putin's Own Daughter", "description": "Russian president claims his country has approved first coronavirus vaccine - Russsian President Vladimir Putin announced this week that Russias health ministry has approved ... | NEON NETTLE"}, "tags": ["Russia", "coronavirus"], "tweets": [], "movies": [], "links": ["https://www.republicworld.com/world-news/rest-of-the-world-news/russia-to-launch-worlds-first-covid-19-vaccine-on-august-12.html", "https://www.express.co.uk/news/world/1321304/coronavirus-vaccine-russia-vladimir-putin-covid19-vaccine-latest", "../../news/11795-bill-gates-final-hurdle-for-covid-19-vaccine-is-ensuring-people-take-it"], "authors": ["Jay Greenberg"], "publish_date": "2020-08-12"}