{"result_id": "219027", "URL": "https://neonnettle.com/news/19667-cia-chief-russia-has-taken-60-000-casualties-in-ukraine", "timestamp": "2023-04-25 16:33:55 CEST+0200", "meta": {"description": "Neon Nettle - CIA Chief: 'Russia Has Taken 60,000 Casualties in Ukraine' - 'Quite significant set of losses'", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-57x57.png", "canonical": "https://neonnettle.com/news/19667-cia-chief-russia-has-taken-60-000-casualties-in-ukraine", "encoding": "UTF-8"}, "image": null, "domain": "neonnettle.com", "title": "CIA Chief: 'Russia Has Taken 60,000 Casualties in Ukraine'", "cleaned_text": "CIA Chief: 'Russia Has Taken 60,000 Casualties in Ukraine'\n\nRussian forces have sustained 60,000 casualties in their effort to overthrow Ukrainian President Volodymyr Zelensky, according to a U.S. spy official.\n\n\"It's always a range and, you know, there's no perfect number,” CIA Director William Burns told the Aspen Security Forum.\n\n“I think the latest estimates from the U.S. intelligence community would be, you know, something in the vicinity of 15,000 killed and maybe three times that wounded, so a quite significant set of losses.”\n\nThe Ukrainian troops “have suffered as well — probably a little less than” the Russians, he added.\n\nThe estimates outline a picture of a slugfest that Russian President Vladimir Putin had not expected, Burns said.\n\nHe then described Moscow’s miscalculations as a function of Putin’s character and ideology during a conversation with NBC’s Andrea Mitchell.\n\n“Putin really does believe in his rhetoric — and I've heard him say this privately over the years — that Ukraine is not a real country,” said Burns, a longtime diplomat who visited Putin in November in an effort to discourage him from launching the war.\n\n“He believes that it's his entitlement, Russia's entitlement, to dominate Ukraine,\" he said.\n\n\"Putin and the people closest to him clearly believed they had a favorable landscape over this past winter — a Ukraine that they judged to be weak and divided, that would fold quickly, a Russian military modernized to the point where they could win, in his view, a quick and decisive victory at minimal cost.”\n\nThose expectations were dashed as the regular Ukrainian military and territorial defense forces repelled the Russian troops who tried to seize Kyiv.\n\nRussian forces had more success in eastern Ukraine and Moscow dropped the pretense that they intend only to fight in defense of the so-called separatists in Donbas.\n\n“It is not only the [Donbas] — it is also the Kherson region, the Zaporizhzhia region, and a number of other territories.”\n\nBurns then downplayed the suggestion that Putin’s actions have been shaped by mental or physical instability.\n\n“As far as we can tell, he's entirely too healthy,\" he said.\n\n\"It’s not a formal intelligence judgment,” he said to laughter.\n\n“His views have hardened, in my experience, over the years, but he's got his own way of looking at reality.\"\n\n\"And as we, you know, could see in the first stages of this war, it was based on some profoundly flawed assumptions and some real illusions, especially about Ukraine and the will to resist in Ukraine.”\n\nThat doesn’t mean the war is getting any easier for Ukraine, as officials in Kyiv have acknowledged to Burns.\n\n“In one of my recent conversations with one of my Ukrainian counterparts, he pointed out that the dumb Russians are all dead,” Burns said.\n\n“What he meant by that is ... the Russians have adapted. Putin has shrunk his objectives, at least for the time being — I stress, at least for the time being — he’s concentrated his forces in the Donbas, and they’re grinding away.”\n\nBurns also noted that Putin “helped to create” that Ukrainian determination to fight by conducting a low-intensity war in eastern Ukraine since 2014.\n\n“My own strong view is that Putin was wrong in his assumptions about breaking the alliance and breaking Ukrainian will before the war began,” he said.\n\n“And I think he is just as wrong now.\"\n\n\"He insists that Ukraine is not a real country. Well, real countries fight back, and that's what the Ukrainians have done, so long as we continue to support them with the weaponry and the munitions that they have used so effectively.”\n\n[READ MORE] Biden Praises Putin on World Stage, Trashes Trump and Republicans - WATCH", "opengraph": {"type": "article", "image": "https://neonnettle.com/news/images/CIA-Chief-Russia-Has.jpg", "image:width": "620", "image:height": "340", "site_name": "Neon Nettle", "title": "CIA Chief: 'Russia Has Taken 60,000 Casualties in Ukraine'", "description": "'Quite significant set of losses' - Russian forces have sustained 60,000 casualties in their effort to overthrow Ukrainian President ... | NEON NETTLE"}, "tags": ["Russia Ukraine", "Putin", "CIA"], "tweets": [], "movies": [], "links": ["../tags/cia", "https://www.washingtonexaminer.com/policy/defense-national-security/russia-outside-donbas", "../../news/15599-biden-praises-putin-on-world-stage-trashes-trump-and-republicans-watch"], "authors": ["Daniel Newton"], "publish_date": "2022-07-21"}