{"result_id": "222003", "URL": "https://newsinsideout.com/2021/07/contagious-contactee-reverse-engineering-nurse-klanmother-karen-macdonald-dr-ross-andersen-lloraine/", "timestamp": "2023-04-25 16:35:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://newsinsideout.com/wp-content/uploads/2015/09/cropped-Favicon2-32x32.png", "canonical": "https://newsinsideout.com/2021/07/contagious-contactee-reverse-engineering-nurse-klanmother-karen-macdonald-dr-ross-andersen-lloraine/", "encoding": "UTF-8"}, "image": null, "domain": "newsinsideout.com", "title": "Contagious Contactee Reverse engineering Nurse Klanmother Karen MacDonald, Dr. Ross Andersen & Lloraine", "cleaned_text": "Fan for 4 years on Alfred, Tony and Karen.\n\n Correct me if I’m wrong on anything Tony.\n\nDaniel from Nova Scotia here just giving you guys a small update what I’m doing and where I have been. If anyone has any tips or anything don’t be afraid to reach out.\n\nWe are de-vaxxing people and getting good success from a number of Biomagnetism therapists in mexico, US and in Canada. We use the body’s internal compass and information from our biofeedback technique of kinesiology to determine the information the body is holding or hiding. We specifically drain the ingredients and components to the bladder so that it may be urinated out, we clean the major organs or minor systems that is needed as well.\n\nBecause the Nanolipid particle (hydrogel) has magnetic components. We believe one magnetic component could be ferritin or Ferrite which is naturally in the blood at low levels. The hydrogel itself has encased an amoeba parasite. That amoeba parasite is an amoeba ecoli species( we believe) and the toxins and deposits this parasite leaves behind including it’s eggs are hybridized the artificial nanotech that exists in the hydrogel even though it may not be the only way of utilizing transfect.\n\nAs in terms of the metal contained in the vaccines, it is not only the metal that one should be looking for as to why magnets and metal objects are sticking. There are specific bacteria which give off a high magnetic resonance in specific areas of the body.\n\nWe use Biomagnetism Pair Therapy and Bioenergy to hack the magnetism, de-activate the nano and cycle it out. We can use the divine intelligence of the soul to figure out how to best do this for each individual. The spirit will tell us exactly how to use magnets to utilize against the intended issue or concern. We can identify the ingredients by their magnetic polarities and dissemble them. It isn’t without risks.\n\nSince the nano will re-activate, replicate and spread, it can be resilient and intelligent to re-assemble and re-organize through the body. It can use the Liver or the Spleen to do this. To note, I suspect this technology can learn defense mechanisms and profiles, and is connected with a hive mind like communication. I also suspect other magnetic therapies, and MRI’s , ones which doesn’t utilize the soul/spirit’s natural divine intelligence, could be detrimental. As the nanotechnologies in our body can harvest magnetism and emfs when needed.\n\nSpritual/shamanic clearing should be done for those de-vaxxing as well. They all have become targeted individuals and signing up for the gene modification may have some spiritual clauses to it.\n\n \n\n OTHER NANOTECHNOLOGY With Biomagnetism Therapy.\n\n We have had to develop a detox protocol where we have to de-activate, dissemble and extricate the nanotech within 3 day windows. In one of our cases, the women was in a sound proof, emf proof studio with no signals coming in or out, nothing and after 3 days she continued to experience targeted individual harassment. It became very virulent and aggressive outside emf zones and the signal to restart was coming from the inside. So isolation from RF-free environments in a detox didn’t turn out to be as effective. Each case on my end has to be methodically observed and analyzed and documented for weeks with follow ups every three days or so. We had to monitor it closely to de-activate the nanotechnology from coming back online and spreading even further from the body.\n\nNot that I can widely verify, but I do get the sense through muscle testing that some frequencies that would regularly be beneficial might be feeding the burdensome residence. More cases are needed to investigate how, why or if this is the case widespread or in secluded cases. The isolation was good however because it could not connect back to the network to update it’s defensive procedures. It took around 1 month to clear.\n\nMy findings on spike protein through clients:\n\n When I scan for the spike protein in my clients. Interesting things come up.\n\n 1. The spike protein comes up that it is transmission is through thought-emotion first and foremost. It is transported from the mental plane to the physical biological matrix. It is synthesized in the body as a menonomic response or through the power of suggestion. It can be transferred through emotional chords of loved ones who strangers.\n\n 2. If it is assimilated into the mental plane ( the person is willing to take on the belief that it is real), the signals from GMO will authenticate that mental response and start to produce a mechanism of defense, possibly even natural immunity.\n\n 3. It’s main delivery is not through touch or breath as regular proteins, but through the mental plane first. The AI biology can program and send messages to others ” I’m sick, I’ll die, get clotting” and are broadcasting these subliminal messages which is causing part of the shedding.\n\n 4. Your mental plane can be activated against the spike protein and the signals by repelling or rejecting them, not to be in denial of their existence but to come into your own command and power of your body.\n\n 5. The signal response is activating other’s nanotechnology if it is able to penetrate into the mind (mental field layer of the body).\n\n 6. A command, technique, practice or technology to balance out the ionic field or mind of the person would be helpful. If the spike protein as a energetic particle is repelled by the mind in the barrier, your body will not express the spike protein. I will be making a magnetic shield one can apply, but I need a little more knowledge and expertise for it. I was looking at Tony’s generators and if I knew how it worked in detail I could possibly engineer a magnetic shield inspired from his ion balancers.\n\n .\n\nSpike Protein/ Auto-Vax Clearing Global Healing Pattern\n\n I’ve detached from the spike protein (physical contagion) paradigm myself, however for those who do believe and are utilizing their mental plane to authenticate it, mainly what I believe to be a self-induced psychotic psy-ops operation against the self-manifestation of the co-creator, I did create a healing pattern which can be replicated at any time.\n\nI compose, orchestrate and organize magnetism in the environment and in our bodies at will, which is not from the regular branch of Medical Biomagnetism Therapy, but a call back to Mesmer’s work back in 1700’s. I can imprint my sessions I do and compose a “magnetic song” or wave pattern onto people for those who need protection from the spike protein. This technique was developed specifically by me and is practiced by one other person in the world who is based out of Mexico and he calls it magnetic programming. The major healing session can be utilized and tapped in by using the following phrase:\n\n “I accept and receive the biomagnetism healing behind BiomagneticSolstice21, Thank you Life” It is important to show gratitude to Life or which ever god you worship, not that it is mandatory. The magnetic wave pattern can be utilized anywhere at any time for the next 100 years and is built for the defense and detox of vaccinations and spike protein spreading. It is not a complete solution but a very powerful aid.\n\nI also put David Wolfe’s spike protein ingredients into the pattern as well through magnetism resonance. You can do kinesiology or muscle test to confirm the authenticity or the effect. The wave is made specifically safe for reach individual spirit who accepts the offering and will only implement what will not result in harm respective to pre-existing conditions. The pattern was created on a Tartarian star fort to assist in global deliverance.\n\nThe pattern does not run on placebo! it does run on water and your spirit accepting the offering, the more hydrated you are, the more effect the code has on your body. You only need to apply the code once a week. People have reported significant decreases in symptoms related to shedding when applying this code. My clients come back with no spike protein in their body days after applying this code. This session de-vaxs people as well for the jnj astro, moderna and pfizer ( they must be recently vaccinated for full clearing and spike protein pairs for consistent draining.\n\nYou may share with others this code and the phrase, but please try to keep me anonymous as dark controllers don’t like people with this kind of power and change. Not everyone will or has accepted the offering in their spiritual awareness either. Do not apply code more than once a day or dehydration can occur. Once a week is good, though once a month can do as well if you use your intention to apply it throughout that month subconsciously.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n Self morphing Black goo (may not be same as in vaccine)\n\n We treat Morgellons the same as Lyme right now, which it isn’t, but we do suspect a portion of reported Lyme Disease is Ai nanotech. As Tony said years ago, the thing can use the natural way of pleomorphism but in it’s artificial way to change it’s biological profile or shape shift, so even with muscle testing and kinesiology we can receive incorrect information. The body may say it has Epstein Barr but unless the experienced kinesiologist peers back the curtains and veils they usually will not find this information.\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n AI sends tripping signals, can measure or indicate intention or read thoughts of those in proximity by utilizing the natural bio-resonance communication pathways of the body when asking about vaccine/spike protein.\n\nWhen I do work on these types of cases and I am doing my biofeedback, unless I go in with stealth or I clear and cover myself and assume the identity of some one else, masking my intentions, the vaccine and spike protein begin to trip up the body or hack the signal to reverse it. In a session one can respond back they don’t have nanotech while the last 20 minutes they did. This is because when approaching the body, the AI is taking queues of information from the body, the body picks up my intention of what I want to address ( just by thinking about it) and begin to trip up, confuse or scatter the results.\n\nI usually do not tell the person I am working on when I will be, and then I cover myself with veils and I wear silk ( as it cloaks your feelings and emotions from the body listening in), not that I think it does anything to protect but silk is known for it’s energetic camouflage. We then go in and defuse the problems accordingly. \n\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n Biomagnetism Therapy Complimentary to other modalities.\n\n In my experience from magnetic therapies, Rife/Healy are at best patch-work, out-dated and sometimes do have contraindications for sure. I don’t know anything about TENS or to much of your BIofeedback or AO scanners yet in my work worth noting.\n\nBut Biomagnetism is a complimentary modality which does compliment PEMF technologies nicely because of the hydrogen bridge that is created in the body from a biomagnetic pair, which acts as a magnetic highway for PEMFs to follow. Excess PEMFs will destroy this delicate hydrogen bridge, which isn’t considered a contraindication at all in Biomagnetism. It helps the body implement and cement the PEMF better when used in conjunction.\n\nThat is why we do Biomagnetism without a device that has radiation, specifically because people don’t even sticker or shield their phones we ask them to leave their phone in their car, not that the therapy interrupts or activated wifi around it, essentially it just brings any wifi/emfs into natural proton-electron balance and grounds the person naturally, we just ask because wifi inteferes with my own mindset and process.", "opengraph": {"locale": "en_US", "type": "article", "title": "Contagious Contactee Reverse engineering Nurse Klanmother Karen MacDonald, Dr. Ross Andersen & Lloraine - NewsInsideOut", "description": "  Contagious Contactee Reverse engineering Nurse Klanmother Karen MacDonald, Dr. Ross Andersen & Lloraine WATCH ON TRUETUBE: https://youtu.be/PxMgl1gkwlA NEWSINSIDEOUT:  https://newsinsideout.com/2021/07/contagious-contactee-reverse-engineering-nurse-klanmother-karen-macdonald-dr-ross-andersen-lloraine/ WATCH ON FACEBOOK: https://www.facebook.com/3573459989401157/videos/1305904189839839 WATCH ON FACEBOOK PAGE: https://www.facebook.com/watch/live/?v=4205261762865769&ref=watch_permalink WATCH ON TWITCH: https://www.twitch.tv/omniversitylive   Karen MacDonald Lloraine Dr. Ross Andersen CONTACT safezoneemf.ca ozonedoc@gmail.com klanmother13@gmail.com   ALSO: FROM Daniel NSMINS <no5gdan@tuta.io> Fan for 4 years on Alfred, Tony […]", "url": "https://newsinsideout.com/2021/07/contagious-contactee-reverse-engineering-nurse-klanmother-karen-macdonald-dr-ross-andersen-lloraine/", "site_name": "NewsInsideOut", "article:publisher": "https://www.facebook.com/NewsInsideOut", "article:author": "https://www.facebook.com/profile.php?id=100001662284456", "article:published_time": "2021-07-06T01:09:36+00:00", "article:modified_time": "2021-07-06T01:11:34+00:00", "image": "https://i0.wp.com/newsinsideout.com/wp-content/uploads/2021/07/KAREN-2.png?fit=838%2C472&ssl=1", "image:width": "838", "image:height": "472", "image:type": "image/png"}, "tags": ["Covid 19 vaccine unsafe", "Nurse Klanmother Karen Lucyk Macdonald", "Alfred Lambremont Webre", "COVID Vaccination genocide", "MRNA vaxx", "5G", "Lloraine", "Spike Protein", "Live Blood Analysis", "Dr. Ross Andersen"], "tweets": [], "movies": [], "links": [], "authors": ["Alfred Lambremont Webre"], "publish_date": "2021-07-06T01:09:36+00:00"}