{"result_id": "222036", "URL": "https://newsinsideout.com/2022/10/war-crimes-genocide-crimes-against-humanity-iraq-afghanistan-9-11-war-on-terror-genocidal-technologies-pandemic-law-tribunals-of-conscience/", "timestamp": "2023-04-25 16:35:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://newsinsideout.com/wp-content/uploads/2015/09/cropped-Favicon2-32x32.png", "canonical": "https://newsinsideout.com/2022/10/war-crimes-genocide-crimes-against-humanity-iraq-afghanistan-9-11-war-on-terror-genocidal-technologies-pandemic-law-tribunals-of-conscience/", "encoding": "UTF-8"}, "image": null, "domain": "newsinsideout.com", "title": "War Crimes, Genocide, Crimes against Humanity - Iraq, Afghanistan, 9/11 War on Terror, Genocidal Technologies Pandemic: Law & Tribunals of Conscience", "cleaned_text": "War Crimes, Genocide, Crimes against Humanity – Iraq, Afghanistan, 9/11 War on Terror, Genocidal Technologies Pandemic: Law & Tribunals of Conscience\n\nHi! As you asked about my history of serving as a Judge on 3 Tribunals of Conscience over the years, here is a record of my experience. As you know,\n\nPrivate Tribunals of Conscience\n\n Their History and Why They Matter\n\n Ralph Fucetola, JD\n\nTribunals of Conscience and Crimes Against Humanity\n\nOver the past century and more, various private Tribunals of Conscience have focused the moral judgment of humanity in situations where official bodies have either failed to hold violators of human rights to account or have been themselves the perpetrators of horrific acts that shock the conscience. These nongovernmental, private expressive associations must be distinguished from international legal tribunals, such as the Nuremberg Tribunals and the International Court of Justice, which are examples of multinational courts established by governments under international law to try cases of making war and of war crimes.\n\nThe three [3] Tribunals of Conscience on which I have served as a Judge include:\n\nAs a result of our Tribunal finding US Pres GW Bush, VP Cheney, and UK PM Tony Blair guilty of war Crimes in Iraq, Afghanistan and Guantanamo, Cuba, neither Bush nor Cheney could leave the USA for fear of international arrest, and Blair had to flee South Africa where Archbishop Tutu took our Tribunal Judgment to state prosecutors to arrest Blair who was then visiting South Africa.\n\nVANCOUVER, BC – Judge Alfred Lambremont Webre of the 9/11 War Crimes Tribunal here highlights the evidence the 9/11 Tribunal has received to date, and issues a call for 9/11 witnesses and experts to submit their sworn evidence to the Tribunal pending the Tribunal’s issuance of Verdicts under applicable international humanitarian law and criminal law in the false flag operation of September 11, 2001.\n\nThe interview occurred on September 11, 2014 with host Donny Gillson of Truth Frequency radio and KBeach Radio 88.1 FM HD-3 Long Beach/Los Angeles.9/11 War Crimes Tribunal\n\nThe 9/11 War Crimes Tribunal is a citizen’s tribunal of conscience that was duly constituted by the 9/11 Vancouver Hearings June 15-17, 2012 in Vancouver, B.C.Alfred Lambremont Webre, one of the Judges on the Tribunal states, “As a duly constituted citizen’s tribunal of conscience for the events of September 11, 2001, the 9/11 War Crimes Tribunal has jurisdiction under natural law and justice; declarations of natural law, such as the U.N. Declaration of Human Rights; international humanitarian law such as the Geneva Conventions; and national laws such as national, state and provincial criminal statues prohibiting murder and conspiracy for any jurisdiction whose citizens died in the World Trade Center on 9/11.\n\nThe 9/11 War Crimes Tribunal was convened by a worldwide community of citizens who participated in the 911 Vancouver Hearings (June 15-17, 2012) in Vancouver, BC and via streaming internet from diverse locations around the world including the United States, India, and elsewhere.\n\n”During the 9/11 Vancouver Hearings, 19 expert witnesses gave sworn testimony as to names, titles, and implicating evidence for individuals, each of whom is alleged to have acted as part of a common plan as a leading co-conspirator in the events of 9/11 and for whom they are aware of prima facie evidence that is sufficient to raise a presumption of fact.9/11 War Crimes Tribunal Verdicts & SentencesFollowing the Hearings, these 19 sworn 9/11 expert witnesses and additional expert and eye witnesses filed further written submissions and affidavits with the 9/11 Vancouver War Crimes Tribunal as to individuals for whom there is prima facie evidence that they acted as part of a common plan in the events of 9/11. Each expert witness is asked to provide a detailed summary of implicating evidence for each such individual named.\n\nThe 9/11 War Crimes Tribunal has now called as of September 11, 2014, for additional 9/11 expert and witness evidence. From the totality of submitted evidence, the 9/11 Tribunal will develop and issue a Verdict of individuals found guilty to have participated in a criminal, common plan and conspiracy to carry out the events of September 11, 2001, together with Sentences for each.Legal implications of the 9/11 War Crimes Tribunal\n\nFollowing the issuance 9/11 Verdicts and Sentences against specific named individuals who allegedly participated in a common plan and conspiracy in the events of 9/11, there are multiple legal venues in which the 9/11 Verdicts and Sentences can be enforced against the Guilty individuals, organizations and Nations.\n\nA. International law – The crimes of the Guilty individuals in the Verdicts may be found to violate the Geneva Conventions of 1949 and constitute war crimes, genocide and crimes against humanity. At the 9/11 Vancouver Hearings Judge Alfred Webre stated,\n\n“The 9/11 false flag operations may qualify as a crime against peace, war crime, genocide, and crime against humanity, inter alia, if it can be demonstrated that the true intent of the 9/11 perpetrators was to carry out 9/11 as a pretext for invading Afghanistan, which invasion and war has been found to be genocidal because of the use of depleted uranium weapons and other reasons. So the legal chain of culpability is there, under the Nuremberg precedents of a crime against peace and starting an unjust war. The Tokyo Tribunal for War Crimes in Afghanistan, in an opinion by Judge Niloufer Bhagwat, found that U.S. President George W. Bush and his administration had committed war crimes, genocide, and crimes against humanity through the horrific birth defects and other widespread genetic and health damage cause to Afghan civilians through the U.S. use of depleted uranium weapons.\n\n”The 9/11 Verdicts and Sentences can be taken by the 9/11 War Crimes Tribunal to the national courts of any of the more than 100 nations, such as Germany and Spain, that are signatories to the Rome statue of the International Criminal Court (ICC) for prosecution and enforcement, as well as to the ICC itself. A former chief prosecutor of the ICC, to the criticism of many throughout the world, has failed to act on over 400 complaints on war crimes in Iraq and in Afghanistan by US and UK forces, and has privately stated he will not take jurisdiction of 9/11.Organization of American States –\n\nAccording to one source, “The 9/11 War Crimes Tribunal [Verdict and Sentence] can also be submitted to the Organization of American States (OAS) which might be an even better choice since it has the only international criminal court the U.S. has signed onto and the other OAS member countries may not be so biased in favor the U.S.\n\nOne attorney took the U.S. government as a defendant there to get an opinion on the fact that the US used Depleted Uranium weapons on hospitals in Granada during the U.S. attack on Granada. She won and the U.S. had to rebuild all the hospitals they destroyed in Granada. She never would have achieved that victory in any other international courts.”\n\nB. U.S. Congress – The 9/11 War Crimes Tribunal Verdict and Sentences can be taken by the 9/11 War Crimes Tribunal to the U.S. Senate and to the U.S. House of Representatives Judiciary Committee for the appointment of a Special Prosecutor to prosecute the Accused Treason under Article III of the U.S. Constitution, which provides, “Treason against the United States, shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court. The Congress shall have Power to declare the Punishment of Treason, but no Attainder of Treason shall work Corruption of Blood, or Forfeiture except during the Life of the Person attainted.”\n\nThere is legal precedent for such an action. In November 2007, a Memorandum was presented to senior Congressional staff and personally to Rep John Conyers, Chairman of the House Judiciary Committee setting out sufficient prima facie evidence of Article III(3) treason in connection with the events of 9/11 by George W. Bush, Richard B. Cheney, Donald H. Rumsfeld, and other Jane and John Does. Senior Congressional staff acknowledged the seriousness of the allegations in the Memorandum. Rep. Conyers took the Memorandum home to Detroit, MI over the Thanksgiving 2007 holidays promising an answer as to whether he would move on the file after the Holidays. To this date, no answer has been forthcoming from Rep. Conyers.\n\nC. Canadian Parliament – There are various concurrent efforts to have the Parliament of Canada investigate the 9/11 events, as NORAD is a joint Canada/USA function and 26 Canadians were killed at the World Trade Center on 9/11. The 9/11 War Crimes Tribunal Verdicts and Sentences can be taken by the 9/11 War Crimes Tribunal to members of Parliament and the Senate, including the Prime Minister and the Opposition Leaders in the Parliament of Canada to appoint a Public Inquiry to investigate and report on possible criminal violations by Canadian persons or U.S. persons, including U.S. government employees or contractors/agents, and other individuals flowing out of the 9/11 events.\n\nD. Prosecution for murder – The 9/11 War Crimes Tribunal Verdict and Sentences can be taken by the 9/11 War Crimes Tribunal to any District attorney and/or U.S. Attorneys in the United States of America, and to any Public Prosecutors in other nations whose citizens were killed in the World Trade Center or the events of 9/11. The alleged Accused, Co-conspirators and persons acting in a common plan to cause, facilitate or support the events of September 11, 2001 can each be prosecuted for murder by a U.S. attorney, by a district attorney or by public prosecutors of a nation whose citizens were killed at the World Trade Center or in any aspect of the false flag operation on September 11, 2001.\n\n9/11 War Crimes Tribunal Judges on the 9/11 War Crimes Tribunal include Constance (Connie) Fogal, B.A, B.Ed, M.A., LL.B, and Alfred Lambremont Webre, JD, MEd. Connie Fogal is former leader of the Canadian Action Party, former Vancouver Parks Board Commissioner, former Director, Kitsilano and Vancouver Community Resource boards; lawyer with the Defence of Canadian Liberty Committee to oppose what Fogal sees as threats to Canadian constitutional sovereignty. Alfred Lambremont Webre, who has served as Judge on the Kuala Lumpur War Crimes Tribunal, submitted a Memorandum to the Chairman of the U.S. House of Representatives Judiciary Committee calling for the appointment of a special prosecutor to investigate 9/11 and was a co-architect of the Space Preservation Treaty.\n\nThe 9/11 Vancouver Hearings were organized by under Professor Jim Fetzer, PhD, McKnight Professor Emeritus at the University of Minnesota Duluth, the founder of Scholars for 9/11 Truth, who edited its first book, THE 9/11 CONSPIRACY (2007), organized its first conference, “The Science and Politics of 9/11″ (Madison) and produced its first DVD; and co-organizer Joshua Blakeney, Graduate student at the University of Lethbridge, 9/11 activist, Staff Writer at Veterans Today, and now the Canadian correspondent for PressTV, who was awarded the Queen Elizabeth II Graduate Scholarship to study “The Origins of the Global War on Terror”.\n\nSee more at: http://exopolitics.blogs. com/911_war_crimes_tribunal/ 2012/09/911-war-crimes- tribunal-expected-to-issue- indictments-of-accused-in-911- events-on-january-22-2013. html#sthash.uA37c8ID.dpuf\n\n3. Natural and Common Law Tribunal for Public Health and Justice at http://www.peaceinspace.org 2020-2022\n\nTribunal Issues Cease & Desist Order For All Covid “Vaccination Boosters” Natural and Common Law Tribunal for Public Health & JusticeTribunal Issues Cease & Desist Order For mRNA-Type “Vaccines”, “COVID-Related” Or Not, As Genetic Biowarfare, Genocide & Crimes Against Humanity BioweaponsTribunals of Conscience\n\nBLAINE, WASHINGTON, USA, October 12, 2022 /EINPresswire.com/ — Tribunal Issues Cease & Desist Order For All “Vaccination Boosters”\n\n Tribunal Cease & Desist Order Classifies mRNA-Type “Vaccines”, whether “COVID-Related” Or Not, As Genetic Biowarfare, Genocide & Crimes Against Humanity Bioweapons\n\n NEWSINSIDEOUT: https:// newsinsideout.com/2022/10/ fact-sheet-international- tribunal-issues-1-cease- desist-order-for-all-covid- vaccination-booster- injections/\n\nDownload OCT 12 2022 – 2.0 TRIBUNAL CEASE&DESIST-WRITOFMANDAMUS – COVID BIOWEAPONS VAXX BOOSTERS\n\n https://exopolitics.blogs.com/ files/oct-12-2022—2.0- tribunal-ceasedesist- writofmandamus—covid- bioweapons-vaxx-boosters.pdf\n\n \n\n Tribunal – Natural and Common Law Tribunal for Public Health and Justice\n\n \n\n In a Nov. 29, 2020 Tribunal virtual Trial and Judgment, accessible at our Website:\n\n http://www.peaceinspace.org\n\n \n\n The Tribunal ordered:\n\n\n\n 1. Emergency Injunctions stopping all 5G rollouts, all COVID 19 vaccinations, any and vaccinations, use of Aspartame in vaccinations and all consumer products, Lockdowns, Detentions, Concentration camps, and a planned Reset on grounds of immediate and irreparable harm from Genocide and Crimes Against Humanitybeing caused to humanity. One Pandemic expert estimated more than two billion adverse medical events, 70 million starvation deaths worldwide alone from Pandemic Social Control Methods, constituting genocide. Another Trial expert testified that RNA/DNA COVID vaccinations could cause irreparable damage to the human DNA genome worldwide, constituting Genocide and Crimes against Humanity.\n\n2. Emergency Writs of Mandamus, clawing back Unjust Enrichment by Pandemic Profiteers. and Setting up a South Africa Style Pandemic Reconciliation Commission – For example: Unjust Enrichment during the Pandemic –\n\n Jeff Bezos (Amazon)increase = $36.2 billion Mark Zuckerberg (Facebook)increase = $30.1 billion\n\n Elon Musk (Space X)increase = $14.1 billion Sergey Steve Brin(Google)increase = $13.9 billion\n\n Larry Page (Google)= $13.7 billion Steve Ballmer (Microsoft)= $13.3 billion\n\n MacKenzie Bezos (Amazon)= $12.6 billion Michael Bloomberg (Bloomberg)= $12.1 billion Bill Gates (Microsoft/BMGF)= $11.8 billion Larry Ellison (Oracle)= $8.5 billion\n\n Mark Zuckerberg – From March 18 to June 4 Zuckerberg increased his wealth 52% to over $83 billion, according to the report. CNBC\n\n According to that report, the total net worth of America’s billionaires rose 15% during the two months, from $2.9 trillion to $3.4 trillion. FORBES\n\n Jeff Bezos, founder and CEO of Amazon, was the biggest winner as his fortune grew by $36.2 billion to $202 billion between March 18 and June 4,\n\n3. Imposed Incarceration Sentences without Parole for Pandemic Defendants, including:\n\n 5G Defendants and Perpetrators – 10 years incarceration\n\n COVID Vaccination/Vaccination/ Aspartame Perpetrators – 10 years incarceration\n\n Pandemic Social Control and Disinformation Perpetrators – 10 years incarceration\n\n Crimes regarding 2009-2020 Lockstep Depopulation 5G-vaccines-Pandemic Criminal Conspiracy:\n\nTribunal Judge Alfred Lambremont Webre, JD, MEd, CERT Harvard School of Public Health \n\n Natural and Common Law Tribunal for Public Health & Justice\n\n +1 604-600-9203\n\n peace@peaceinspace.org\n\n October 21, 2022", "opengraph": {"locale": "en_US", "type": "article", "title": "War Crimes, Genocide, Crimes against Humanity - Iraq, Afghanistan, 9/11 War on Terror, Genocidal Technologies Pandemic: Law & Tribunals of Conscience - NewsInsideOut", "description": "War Crimes, Genocide, Crimes against Humanity – Iraq, Afghanistan, 9/11 War on Terror, Genocidal Technologies Pandemic: Law & Tribunals of Conscience NEWSINSIDEOUT: https://newsinsideout.com/2022/10/war-crimes-genocide-crimes-against-humanity-iraq-afghanistan-9-11-war-on-terror-genocidal-technologies-pandemic-law-tribunals-of-conscience/ Hi! As you asked about my history of serving as a Judge on 3 Tribunals of Conscience over the years, here is a record of my experience. As you know,  Private Tribunals of Conscience Their History […]", "url": "https://newsinsideout.com/2022/10/war-crimes-genocide-crimes-against-humanity-iraq-afghanistan-9-11-war-on-terror-genocidal-technologies-pandemic-law-tribunals-of-conscience/", "site_name": "NewsInsideOut", "article:publisher": "https://www.facebook.com/NewsInsideOut", "article:author": "https://www.facebook.com/profile.php?id=100001662284456", "article:published_time": "2022-10-21T16:54:41+00:00", "article:modified_time": "2022-10-21T17:07:04+00:00", "image": "https://newsinsideout.com/wp-content/uploads/2022/09/3.-LOGO-international-tribunal-logo-copy-2.png", "image:width": "800", "image:height": "800", "image:type": "image/png"}, "tags": ["positive timeline", "HAARP", "Genocide", "Pope Francis Bergoglio", "Mind Control", "Donald Trump", "assassination", "5G", "CIA", "Elizabeth Windsor", "false flag", "Afghanistan", "Vatican", "Satanism", "time travel", "United Nations", "Genocidal Technologies Pandemic: Law & Tribunals of Conscience", "Spirituality", "George HW Bush", "Contact", "child sacrifice", "Covid 19", "Torture", "Crimes against Humanity - Iraq", "Alfred Lambremont Webre", "UK Monarchy", "9/11 War on Terror", "War Crimes", "George W Bush"], "tweets": [], "movies": [], "links": ["https://newsinsideout.com/wp-content/uploads/2022/09/3.-LOGO-international-tribunal-logo-copy-2.png", "https://newsinsideout.com/2022/10/war-crimes-genocide-crimes-against-humanity-iraq-afghanistan-9-11-war-on-terror-genocidal-technologies-pandemic-law-tribunals-of-conscience/", "https://exopolitics.blogs.com/international_criminal_co/2021/07/private-tribunals-of-conscience-their-history-and-why-they-matter-by-ralph-fucetola-jd.html", "https://www.foreignpolicyjournal.com/2011/11/30/kuala-lumpur-war-crimes-tribunal-bush-and-blair-guilty/", "https://exopolitics.blogs.com/911_war_crimes_tribunal/", "http://www.starshipearththebigpicture.com/2014/09/17/911-war-crimes-tribunal-resumes-verdicts-expected/comment-page-1/", "mailto:tribunal@911warcrimestribunal.org", "http://www.911vancouverhearings.com/", "http://exopolitics.blogs.com/911_war_crimes_tribunal/2012/09/911-war-crimes-tribunal-expected-to-issue-indictments-of-accused-in-911-events-on-january-22-2013.html#sthash.uA37c8ID.dpuf", "http://www.peaceinspace.org/", "https://www.washingtonstatepolitics.com/article/595515639-tribunal-issues-cease-desist-order-for-all-covid-vaccination-boosters", "https://exopolitics.blogs.com/international_criminal_co/2021/07/private-tribunals-of-conscience-their-history-and-why-they-matter-by-ralph-fucetola-jd.html", "https://newsinsideout.com/2022/10/fact-sheet-international-tribunal-issues-1-cease-desist-order-for-all-covid-vaccination-booster-injections/", "https://exopolitics.blogs.com/files/oct-12-2022%E2%80%942.0-tribunal-ceasedesist-writofmandamus%E2%80%94covid-bioweapons-vaxx-boosters.pdf", "http://www.peaceinspace.org/", "mailto:peace@peaceinspace.org"], "authors": ["Alfred Lambremont Webre"], "publish_date": "2022-10-21T16:54:41+00:00"}