{"result_id": "222038", "URL": "https://newsinsideout.com/2020/05/sallie-elkordy-why-covid-19-vaccines-are-unsafe-must-be-stopped/", "timestamp": "2023-04-25 16:35:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://newsinsideout.com/wp-content/uploads/2015/09/cropped-Favicon2-32x32.png", "canonical": "https://newsinsideout.com/2020/05/sallie-elkordy-why-covid-19-vaccines-are-unsafe-must-be-stopped/", "encoding": "UTF-8"}, "image": null, "domain": "newsinsideout.com", "title": "SALLIE ELKORDY: Why COVID-19 Vaccines are Unsafe & Must be Stopped!", "cleaned_text": "SALLIE ELKORDY: Why COVID-19 Vaccines are Unsafe & Must be Stopped!\n\n1. What’s in the COVID-19 VACCINE itself?\n\n$275 million will go to research and vaccine development.\n\n9. Saskatchewan: About 20% of people in recent survey said they wouldn’t take COVID-19 vaccine: CBC\n\nAt ~ She quotes Benjamin Franklin who says any law imposed that contradicts the constitution should be resisted by the public, even if it means civil disobedience…\n\n15. URGENT – PLEASE TAKE 10 MINUTES TO READ THIS ARTICLE ABOUT Dr Judy Mikovits revelations! PLANDEMIC Part 1: Shut Down WHO, FDA, CDC, AMA and We’ve Got a Healthy World Again\n\n17. THE ORIGINS OF COVID 19 – from a friend:\n\nCOVID ORIGINS: They mention Project Scoop and Fort Detrick. This couples with Brother Nathanael data.\n\nThe COVID 19 virus was made at Fort Detrick. It was transported to Wuhan and released during a US military exercise at the World Military Games back in October 2019\n\nAll this is document in the video.\n\n“US President Donald J Trump was briefed, and dismissed reports of the COVID 19 released by CIA-US Military contingent back in Nov. 2019.\n\nI recall the Chinese talking about this DOD-CIA origin of COVID 19 a#in April 2019 and this was dismissed by the US govt and MSM as well.”\n\nNeed for Natural and Common Law intervention on the false flag unlawful lockdown and on the coming COVID 19 Vaccinations- which may be accompanied by a vaccination Passport to travel, work, bank, trade, buy and grow seeds and food, get medical and health care treatment.\n\nSome research suggests that the vaccinations are designed as the principal agent to depopulate up to 80% of human souls in human bodies and may contain (1) nanobots to integrate the human recipient to AI Artificial Intelligence tracking & thought monitoring and control (2) the GOD GENE virus vaccine tested in Afghanistan and Iraq to destroy DNA and the human brain’s ability to know and sense the Divine Source God coming through the interdimensional portal to the Sun, Galaxy, and Universe [Source], [3] Depopulation agents to destroy DNA, trigger autism, brain damage, cancer. Human audiences now support natural and common law Prosecution and Trials of the perpetrators of the 2020 COVID -19 false flag “Plandemic”:\n\nSEE Natural and Common Law Tribunal for Public Health and Justice\n\n19. VIDEO: Pentagon leaked video of virus/Vaccine used to alter Afghanistan Islamic fighters to alter DNA/brain ability of discern God concepts – The God Gene.\n\nQuery: Is this Virus in COVID 19 2020 Operation/Tests/Vaccine as part of the Transhumanist Agenda?\n\nDr Mikovits joins Gary Franchi on the Next News Network and says that based on her 30+ years of working with Anthony Fauci, it is horrifying to see history repeat itself, as it did in determining the treatment for HIV/AIDS. It’s also disturbing to watch her expressions as she recounts these pivotal moments in her career, which Fauci destroyed. I find her to be a very credible witness but I can clearly see how very deeply she’s been traumatized.\n\nThis is particularly so when she describes how Anthony Fauci shut down her work on the highly-infectious XMRV mouse retrovirus, while looking into the cause of Chronic Fatigue- and Gulf War Syndrome. An early polio vaccine had been cultivated on pulverized mouse brains and her studies indicated that XMRV had entered the human virome through the blood supply and through the MMR and Polio vaccines given to American children and the Japanese Encephalitis vaccines given to US military personnel.\n\nThis discovery, revealed massive liabilities for the Big Pharma companies and for governments worldwide and it proved to be career-ending for Mikovits. Fauci was the Deep State enforcer who ruthlessly carried this out. She believes – and the data support – that this was “a cover-up, in the attempt to literally bury the evidence of the people who have been injured worldwide by Dr Fauci’s recklessness.”\n\nBy “injured”, she’s talking about millions of cases of cancer and AIDs and other Frankenvirus diseases, worldwide.\n\n“Most of our biological therapies today are made using mouse tissue and animal tissue. So, this shows that in fact, for almost forty years, as we’ve mixed animal and human tissue – it’s called xenotransplantation – we’ve directly injected it in the blood and created many, many viruses that come from animals that would otherwise not have been introduced into humans naturally. That is, they can’t infect human cells.\n\n“This is a huge liability…The cover-up of a hundred million people with contagious, cancer-causing virus…Look at our exploding cancer figures. Look at our exploding autism, chronic fatigue syndrome, AIDS-like diseases, autoimmune diseases. These are all from from viruses that are acquired not naturally but through biological therapies and this has been perpetrated by our government, knowingly by Tony Fauci since that first explosion of HIV.”\n\nMikovits believes that for the harm they caused with their handling of HIV, alone, “Tony Fauci…Robert Redfield, and Deborah Birx…should have been literally criminally charged for for killing millions and everyone knew it at that time and it was covered up.”\n\nHer past trauma is made that much worse for her as she watches the entire world currently being subjected to Fauci’s psychopathic behavior.\n\n“What I see is literally, history repeating itself. Where, throughout the ’80s, he continued to direct therapies and the funding of therapies for which he held patents and stood to gain clinically, when clearly, all research showed that those weren’t the appropriate therapies…\n\n“My…award-winning PhD thesis showed, in fact, another target would be the appropriate therapeutic target and I was part of the team that developed Peptide T [discovered in 1986 by Dr Candace Pert]…simple immune therapy, safe.\n\n“That therapy never made it to people. [Fauci] prevented that, while he directed the therapy the wrong way, leading to the deaths of millions.\n\n“And I see the same scenario playing itself out, now, where he says, ‘Oh, it’s anecdotal. Oh, hydroxychloroquine or Plaquenil, anecdotal evidence!’\n\n“Anecdotal evidence means storytelling. It’s not storytelling! The WHO calls Plaquenil and hydroxychloroquine an essential medicine for all health. 70 years of data in its use. Same thing for Interferon Type 1. Interferon’s very low dose, very effective at preventing the spread, even the jumping of viruses from species and that therapy has been prevented from getting to the people.\n\n“So, now in 2020, we use pre-exposure prophylaxis around the world for HIV…and Tony Fauci is deliberately misrepresenting that and leading to the spread of this virus throughout the world.”\n\nTo her, the COVID-19 numbers coming out show, “The numbers of deaths from CV to less than .1% to .3% and those studies are clear… a natural herd immunity has been established from the natural infection and that everyone should go back to work now…\n\n“It’s very clear that the treatment of ventilators and the lack of oxygen has been what has been killing people – not a virus.\n\n“That a single agent is causative for a disease is not true and that perpetrating that – what I call fraud – in order to push an agenda to drive towards a strategy of therapy, when…safe, effective therapies that are sanctioned by the World Health Organization, now for more than 70 years aren’t taking place is what I believe is destroying human health and will have a lasting effect for many years.”\n\nAs for the origins of the novel coronavirus that has caused the global shutdown, she says, “In those original studies that were published in 2015, Tony Fauci, the NIAID, Ian Lipkin through the new Centers for Discovery and Diagnostics actually funded the cell line strains that that were used to grow the virus.\n\n“And that cell line strain came directly from Fort Detrick and USAMRIID (US Army Medical Research Institute of Infectious Diseases). So an unintended release, maybe but USAMRIID was shut down in 2019 for safety concerns.\n\n“That it came from a laboratory is clear and I think not only the Wuhan Biosafety Level 4 but the Biosafety Level 4 at Fort Detrick, USAMRIID…where I worked for 22 years and directly in that laboratory, I did research on Ebola.\n\n“It’s clear that these two labs colluded under the direction of Tony Fauci, when it was, in fact illegal in this country to do those studies…\n\nDr Mikovits’ book, Plague of Corruption released 2 weeks ago has already sold out of its first printing. She says it’s about “Propaganda masquerading as science, it tells how I was jailed, how I was threatened, how the threats were carried through, literally at every level; the corruption in the courts, how the media is driving these pandemics and how these pandemics have been driven.\n\n“Bobby Kennedy jr. writes a fabulous forward, where he talks about – he literally walks through history how we’ve been lied to as a public about environmental toxins and about these programs, which have have literally caused the development, the explosion of chronic diseases at the hands of Dr Fauci and Dr Redfield, Dr Birx. You know, the entire corrupt Old Boys Network that has been in power since at least 1980, for my entire career…\n\n“At the end of the book is a fabulous ending. It shows how we have proven them wrong, how we were able to, how we refuse the order to throw away the data, to autoclave, to burn all of the samples from the infected people from our research, from 2011 and ’12 and how we secured those data and gave them to the FBI a full five years ago – and that’s been covered up to the DOJ, to the Attorney General’s office; how I had a lawsuit that implicates every one of these people for five years, held under seal…meaning, nobody could talk about it while the government decided if…they could give me whistleblower status.\n\n“The minute this book came in press, that case was dropped with prejudice, which means I made it all up to promote a book. We have the evidence, we have the evidence secured, we have the receipt from the FBI for the terabyte hard drive that proves everything I’ve been saying over the course of the last twenty to thirty years.\n\nHost, Gary Franchi says, “Dr. Judy it’s been a pleasure having you on. The last thing I wanna drive home here is ask you the question: Should Dr Fauci be indicted?”\n\n21. “Moms – Get out of the House! March! Do Something!!” Lockdown Protest Leader Susan Standfield Spooner\n\nAt ~ She quotes Benjamin Franklin who says any law imposed that contradicts the constitution should be resisted by the public, even if it means civil disobedience…", "opengraph": {"locale": "en_US", "type": "article", "title": "SALLIE ELKORDY: Why COVID-19 Vaccines are Unsafe & Must be Stopped! - NewsInsideOut", "description": "SALLIE ELKORDY: Why COVID-19 Vaccines are Unsafe & Must be Stopped! WATCH ON TRUETUBE.CO:  https://www.bitchute.com/video/COZpwCYh5ZMD/ NEWSINSIDEOUT:  https://newsinsideout.com/2020/05/sallie-elkordy-why-covid-19-vaccines-are-unsafe-must-be-stopped/ Why COVID-19 Vaccines are Unsafe & Must be Stopped! FACEBOOK: https://www.facebook.com/groups/1026397407762438 45 Percent of Surveyed American Adults Doubt Vaccine Safety https://www.infectioncontroltoday.com/vaccines-vaccination/45-percent-surveyed-american-adults-doubt-vaccine-safety 1. What’s in the COVID-19 VACCINE itself? YIKES!  https://is.gd/ZH4fdf “Vaccine Free America with Sallie Elkordy” RBN Saturday […]", "url": "https://newsinsideout.com/2020/05/sallie-elkordy-why-covid-19-vaccines-are-unsafe-must-be-stopped/", "site_name": "NewsInsideOut", "article:publisher": "https://www.facebook.com/NewsInsideOut", "article:author": "https://www.facebook.com/profile.php?id=100001662284456", "article:published_time": "2020-05-10T15:16:34+00:00", "article:modified_time": "2020-05-10T19:08:43+00:00", "image": "https://i0.wp.com/newsinsideout.com/wp-content/uploads/2020/05/Screen-Shot-2020-05-10-at-07.39.50.png?fit=1157%2C557&ssl=1", "image:width": "1157", "image:height": "557", "image:type": "image/png"}, "tags": ["Covid 19 vaccine unsafe", "covid 19 vaccines", "Ascension", "positive timeline", "Alfred Lambremont Webre", "Donald Trump", "Justin Trudeau", "Sally Elkordy", "CIA", "Bill Gates", "VACCINES", "Vaccine awareness", "War Crimes", "Covid 19"], "tweets": [], "movies": [], "links": ["https://www.bitchute.com/video/COZpwCYh5ZMD/", "https://newsinsideout.com/2020/05/sallie-elkordy-why-covid-19-vaccines-are-unsafe-must-be-stopped/", "https://www.facebook.com/groups/1026397407762438", "https://www.infectioncontroltoday.com/vaccines-vaccination/45-percent-surveyed-american-adults-doubt-vaccine-safety", "https://is.gd/ZH4fdf", "http://tinyurl.com/VaccineFreeAmerica", "http://tinyurl.com/VaccineFreeMedia", "http://tobtr.com/11237993", "http://tinyurl.com/20-20Clarity", "https://brightfuture83.wordpress.com/2020/05/08/does-anyone-hear-doctors-nurses-patients-funeral-directors-and-statesmen-blowing-the-whistle-its-deafening/", "http://www.bitchute.com/video/xqkcYLlVk3YM", "http://www.businessinsider.com/bill-gates-14-billion-doses-coronavirus-vaccine-may-be-needed-2020-5", "https://www.breitbart.com/health/2020/05/07/president-trumps-operation-warp-speed-pushing-for-100-million-coronavirus-vaccine-doses-by-the-fall/", "https://www.youtube.com/watch?v=RWOrdfWG6Sc&t=83s", "https://www.globalcitizen.org/en/content/justin-trudeau-announces-coronavirus-fund/", "https://www.lifesitenews.com/news/trudeau-mulls-making-coronavirus-vaccine-mandatory-for-canadians", "https://www.cbc.ca/news/canada/saskatchewan/covid-survey-first-round-results-1.5541053", "http://explore.research.ufl.edu/survey-eighty-percent-of-americans-would-get-covid-19-vaccine-if-available.html", "https://www.infectioncontroltoday.com/vaccines-vaccination/45-percent-surveyed-american-adults-doubt-vaccine-safety", "https://www.independent.co.uk/news/world/americas/coronavirus-vaccine-anti-vaxxer-donald-trump-a9426151.html", "https://exopolitics.blogs.com/5g_coronavirus_news/2020/04/how-to-decline-a-vaccinefrom-nurse-kate-shemirani.html", "https://londonreal.tv/is-coronavirus-a-plandemic-exposing-the-truth-behind-americas-covid-19-strategy-dr-judy-mikovits/", "https://forbiddenknowledgetv.net/plandemic-a-film-about-the-global-plan-to-take-control-of-our-lives-liberty-health-and-freedom/", "http://www.technovelgy.com/ct/content.asp?Bnum=2738", "http://www.bitchute.com/video/MUr6NOCZUxgB", "http://peaceinspace.org/", "mailto:peace@peaceinspace.org", "https://www.youtube.com/watch?v=spw5nmUrpWA&feature=share&fbclid=IwAR009Bo5Gan4-qVEbQl2NJ_g4_YWzsI-H__tgkDp_NObEKBF4Fva9vOV8Fs", "https://forbiddenknowledgetv.net/dr-faucis-darkest-secret-surfaces-as-his-predictive-model-crushes-trump-economy-dr-mikovits/", "https://youtu.be/B7SFe_GVNDU", "https://newsinsideout.com/2020/05/moms-get-out-of-the-house-march-do-something-lockdown-protest-leader-susan-stanfield-spooner/", "https://www.facebook.com/groups/1790005637805052/", "https://londonreal.tv/is-coronavirus-a-plandemic-exposing-the-truth-behind-americas-covid-19-strategy-dr-judy-mikovits/"], "authors": ["Alfred Lambremont Webre"], "publish_date": "2020-05-10T15:16:34+00:00"}