{"result_id": "222021", "URL": "https://newsinsideout.com/2014/12/ebola-depopulation-un-takeover-mass-extermination-plot-embedded-obamacare-codes-will-fail/", "timestamp": "2023-04-25 16:35:17 CEST+0200", "meta": {"description": "Ole Dammegard: UN takeover, Ebola pandemic depopulation plot embedded in Obamacare codes will fail", "lang": "en", "keywords": "", "favicon": "https://newsinsideout.com/wp-content/uploads/2015/09/cropped-Favicon2-32x32.png", "canonical": "https://newsinsideout.com/2014/12/ebola-depopulation-un-takeover-mass-extermination-plot-embedded-obamacare-codes-will-fail/", "encoding": "UTF-8"}, "image": null, "domain": "newsinsideout.com", "title": "Ole Dammegard: UN takeover, Ebola pandemic depopulation plot embedded in Obamacare codes will fail", "cleaned_text": "[EDITORIAL NOTE: Please note that the directed energy weapons attack upon Ole Dammegard in the days prior to this interview in an effort to prevent the interview is unlawful and a violation of the Geneva Conventions prohibiting military attacks upon civilians, as well as a violation of international humanitarian law and EU legislation. See www.warcrimestribunal.org]\n\nVANCOUVER, BC – A Memorandum prepared by the website EbolaGate (below) has uncovered on an apparent regulatory and reimbursement infrastructure in Obamacare coding for a mass extermination of the U.S. population, based on regulations signed by the last four U.S. Presidents, including Bush Sr. Clinton, Bush Jr. and Obama.\n\nIn this NewsInsideOut.com interview author and researcher Ole Dammegard, an expert on false flag operations including the JFK assassination and 9/11, Mr. Dammegard states that in his judgment this elaborate false flag operation, that implicates all four Presidents in attempted Genocide as well as Treason, will ultimately fail.\n\nPrior to his interview, Ole Dammegard was personally attacked by directed energy weapons and rendered unconscious in an effort to prevent him from commenting on the information released with this interview.\n\nIncluded below is the original EbolaGate Memorandum, and two supporting documents prepared in connection with an Injunction to halt this plot by the U.S. Government.\n\nThe plan for the take over of the US, foreign invasion, and mass murder:\n\nHow various executive orders, international regulations, state laws, and hidden coding intersect to activate this plan.\n• Bush signed an executive order in 2005 that arranges to destroy the sovereign US.\n• The executive order (see the PDFs to view it) lists various things as the justification for suspending (ending, since there’s no means listed of reinstating it) the Constitution, Congress and the Supreme Court, and with a second order setting up for DHS to rule alongside the President:\n• In short, Bush planned a coup that he formalized with an executive order.\n• Bush listed these items, all of which can arranged:\n• Environmental catastrophe – earthquakes? (HAARP) more oil spills? Droughts and no food? (HAARP and chemtrails)\n• Collapse of the economy – that is obviously planned, and the two pandemic drills this month included shutting off the banking system\n• Pandemic emergency – this is the real ringer.\n• Bush signed the executive order without involvement of Congress. It’s far more than unconstitutional, it’s treason.Bush signed a second order without Congressional approval or involvement in 2005 – that repeats one of the items in the executive order: the ringer.\n• Bush signed the US onto the WHO’s International Health Regulations in 2005\n• This agreement says that in the event of a pandemic emergency, the UN and WHO would take over in the US and rule through crisis committees.\n• The WHO declares a pandemic emergency, no proof required\n• Bush arranged with two foreign entities for them to invade the US and take control of the country at the local level.\n\nIII. Immediately after 9/11 and using the anthrax deaths as a prompt, Bush and the CDC and pharma as lobbyists got state pandemic laws passed\n• Thus the ringer – a pandemic emergency – shows up three times thanks to Bush:\n• In the executive order for a coup listing pandemic emergency as a justification\n• In the WHO International Health Regulations listing pandemic emergency as the justification for a foreign invasion and take over\n• In pandemic laws Bush had put into place\n• The pandemic laws appear to be the legal structure through which the UN and WHO would “rule.”\n• They could be used in numerous ways for murder, including mass murder.\n• These laws arrange for “medical” martial law. In effect, they are military.\n• The laws are a dramatic change from all previous public health laws that simply asked people to self-quarantine in case of a disease and helped to provide support if needed.\n• There is nothing medically beneficial in the laws, there is no recourse to anyone for help, and all liability for harm including death has been removed.\n• The allegedly “medical” aspect of the laws includes wholesale and forced violations of everyone’s bodies (except those ordering this): (Further down, one can see that pharma not only lobbied but is involved at every level.)\n• Unspecified and unlimited taking of any bodily samples,\n• The financial plunder including (Further down, one can see that the bankers are involved.)\n• $1000 a day fines for refusing any type of order\n• 1/2 the monies go to the judge ordering someone sent away\n• 1/2 to some health trust fund that is likely related to the bankers\n• Compensation from local resources for those imposing any of this\n• The resource plunder includes a take over of all US (Further down one can see the various interests who are involved.)\n• ICoding inside Obamacare intersects with all three items listed above and is more dangerous than all of them\n• The coding from the WHO and UN inside Obamacare arranges for a military junta or other “ruling authority.\n• The coding section in Obamacare is ICD 9 E 978 “Legal Execution”\n• The coding includes wording describing a military junta or whatever other non-elected, non-democratic power this would refer to: “All executions performed at the behest of the judiciary or ruling authority [whether permanent or temporary]”\n• Dressed up in white coats, that’s a description of the “crisis committees” mentioned in the WHO’s International Health Regulations through which the WHO itself and the UN (troops) would “rule” in the event of a pandemic emergency the WHO declares itself.\n• The coding lists as “legal death by execution” various forms of mass murder: (Comments have been added to attempt to flesh out possibilities this might refer to.}\n• Asphyxiation by gas [As was done in the Nazi death camps? What government legally asphyxiates people? How many people? Where? In the bricked up train buildings in Indiana that have tracks running into them for FEMA/DHS train cars? In subways with Sarin or other gases? From the sky?]\n• Beheading, decapitation (by guillotine) (We’re got them already installed in the front of UN/FEMA boxcars.)\n• Capital punishment [By what means? Was this just thrown in so someone scanning the list quickly would see something familiar and not look further?]\n• Hanging [Was this also thrown in to appear normal on such a list? But do US states hang people for capital crimes? Does any country?]\n• Poisoning [In what country is poisoning a legal execution? Does this refer to poisoning of water supplies? Or of food supplies? Or by chemtrails? Or by assassination?]\n• Shooting [Firing squad? Shooting of protestors? Mass shootings in front of pits as was done by the Nazis?]\n• Other specified means [What? Where are those listed? This UN coding leaves this section refers to secret information. What kind of medical coding is that? Are drones such means? Or mandated lethal vaccines such as with weaponized Ebola patented by the CDC? Is harvesting of organs included on the secret list of means?]\n• Injury undetermined whether accidentally or purposely inflicted [How can it be a “legal execution” if it is accidental? How can it be a “legal execution” – distinct from all the choices above – if it is an injury that was purposefully “inflicted“? This could be about vaccines. Or forced drugs. Or forced “treatments” under the pandemic laws. Or human experimentation. Or a description of torture. Would rape not fit here? Would child rape, torture and satanic sacrifice by the elite as exposed by org not fit here as well?]\n• The coding was put in there by the WHO and the UN. Coming from international (foreign) entities, it is prohibited to the states.\n• The coding, coming from foreign entities, possibly would have needed to be voted on by the Senate, as would a treaty to be applicable to the federal government, which it was not\n• In terms of threat to the American people, the Obamacare coding goes way beyond the executive order establishing a coup, the International Health Regulations with its UN and WHO invasion of the US to “rule” through crisis committees, and even the pandemic laws. Since the Obamacare coding “legalizes” mass murder without even the pretence of a medical situation.\n• Obamacare’s contribution to the coup, to an invasion of the US, and to pandemic laws that could be lethal if followed, is to attempt to legalize various – even hideous – means of mass murder, giving vast, unlimited power to “ruling authorities.”\n• Obamacare coding is the hidden deadly teeth behind the three Bush arranged legal structures.\n• While Obamacare does not mention a pandemic emergency in this coding, the coding intersects with the other three Bush items:\n• By its reference to a ruling authority – as the WHO claims it would be,\n• By its reference to a ruling authority – as the Bush executive order implies a president would be, and\n• By the words “at the behest of a judiciary” (not a trial by jury) which is similar to the judges mentioned in the pandemic laws who collect half the $1000 a day penalties imposed on anyone who resists anything or doesn’t follow orders.\n• Ebola makes all of the above possible and was invented by the US for this purpose. The CDC holds the patent on Ebola, pushed through the pandemic laws, strongly promoted Obamacare and is CIA.\n\n\n\n Three main facts to take in:\n• This is a fascist coup directly related to the Nazis of WWII\n• Help for Ebola is a deadly wolf in sheep’s clothing\n• US government created Ebola to create the necessary “pandemic emergency” for a coup, invasion, and mass murder here\n\nI. This destruction of the US was planned by the Bushes, the Rockefellers, and those behind them (the Jesuits, the Vatican)\n• The Rockefellers had 1/2 interest in IG Farben, the German pharmaceutical and chemical conglomerate that put Hitler into office, rant he camps, experimented on prisoners, and murdered millions of people. One of the main experiments done at Auschwitz was with vaccines, in an attempt to find a means to sterilize people at doctors’ appointments without their knowing.b. The Vatican and Jesuits were so involved with arranging the Holocaust that they even laid out the major death and concentration camps in a pentagram with the lines from the pentagram going through the Vatican.\n• George Bush’s grandfather, Prescott Bush, attempted a fascist coup in the US in 1933.\n• Those behind Bush’s orders and plans were intimately involved in Nazi Germany and sought genocide.\n• These interests which once ran the death camps and sought world control as Nazis, control the western banking interests, oil companies, nuclear interests, pharma, armaments, surveillance, all forms of advanced technologies, genetic engineering of food and vaccines, etc.\n• After WWII, the Bushes, the Rockefellers “moved” the Nazis into the US and elsewhere via Operation Paperclip, an OSS/CIA plan to bring Nazi scientists – including Mengele – out of Germany.\n• This is the same time frame during which the fascist Vatican and Jesuits set up the UN and all its agencies, the WHO and UNICEF and others.\n\n Operation Paperclip also coincides with the founding of the CDC, which ran the Tuskegee Experiment and to the bitter end, would not stop it. The CDC works for the CIA, actually sending people to Langley and having them return to work on secret projects.\n• The WHO is run by the Rockefellers and the pharmaceutical companies that made up IG Farben – that is by former Nazi companies deeply committed to and successful at genocide.\n• Those former Nazi murderers went from causing genocide in Europe to arranging to have control over “global health.”\n• To give but one example of their continuing but now covert and much larger scale genocide, the WHO in 1972 requested an immune virus that would kill T-cells to test what would happen. Immediately after it put on a smallpox vaccine campaign and AIDS occurred, an immune virus that kills T-cells. In 1987, the WHO admitted that the small pox vaccines set off AIDS, blaming a hidden genetic issue that was triggered by the vaccine – NOT explaining why AIDS had never occurred previously with smallpox vaccines and NOT admitting they had created AIDS on purpose. How many millions died world wide because of this one intentional virus placed in a vaccine that was forced on parts of the world?\n• The UN and WHO began vaccine campaigns that sterilized people in the third world, with Kissinger even urging that the US covertly sterilized whole countries with vaccines. Kenya has just reported that millions of its young women and children have recently been sterilizing during an alleged “tetanus” vaccine campaign.\n• Bill Gates paralyzed over 47,500 children in India in one year alone with his genetically engineered polio vaccine and killed 10,000 in Pakistan. The WHO called the vaccine-caused crippling “non-polio” paralysis, and after the Pakistanis attempted to stop the vaccine campaign after they saw so many children dying (and that the CIA was involved – which the US has admitted), the WHO threatened them with “saturation vaccination” when. Here, the military aspect of vaccines raised its ugly head enough to be visible for a moment.\n\nIII. Along with moving Nazis out of Germany. A complete PR change occurred in fascism after WWII.\n• There was a 180-degree alteration in fascist public speech and their “seeming” interest.\n• The genocidal fascists no longer foamed at the mouth about hating and wanting to destroy inferior people or about wanting to take over territory.\n\n Now – as control of the UN and the WHO and of many “philanthropic foundations” – suddenly spoke only of wanting to save people’s lives.This massive PR change took two forms both of which are still fascist: overriding national sovereignty and taking control of other countries.\n• The Rockefellers, mass murderers during WWII, were part of establishing a “humanitarian” justification to take control of other countries called “Responsibility to Protect.”\n• The UN, controlled by the genocide-planning Vatican, Zionists, and Jesuits, supported this agenda, which is used as a “philanthropic” pretext for pre-emptive war and colonialism.\n• The giant foundations promoting R2P claim that national sovereignty is obsolete and that in the interest of people in need, they should override international law to help “the people.” Using their controlled mass media, they simply declare a humanitarian emergency wherever they want resources and power.\n• This geopolitical PR “remake” or brute force dress up as “help,” destroyed Libya just as surely as Hitler did in overrunning countries.\n• Health – the one to watch for it is THE most successful hiding of the fascist power and genocidal agenda\n• The Nazis did not experiment on prisoners at Auschwitz with vaccines or practice forcing unknown, untested vaccines on each of the countries they conquered, for nothing.\n• The WHO and the UN (as well as the Gates Foundation, UNICEF, Doctors without Borders, the Red Cross – run by the Jesuits – Save the Children) have been running massive vaccine campaigns around the world, under the PR claim to “save the lives of poor, neglected people.”\n• Those vaccines campaigns by agencies run by former Nazis, are forced on people – sometimes at gun point – and have been coincidentally sterilizing, crippling and killing the very same people the Nazis used to very openly speak of wanting to see dead – black, brown, poor, diseased, disabled.\n• The campaigns most often occur where these fascists’ interests seek resources (gold, diamonds, oil, minerals…).\n• The Nazis figured out that it is much easier to get their destructive vaccines into people by creating a fear campaign about a disease and claiming to care about saving their lives, than by their previous method of openly admitting their desire to kill millions of people they see as worthless\n• If anyone objects – as the Pakistanis did, the WHO and UN attack them for causing diseases “that could have been prevented” (an unprovable claim), for being backward, for being a danger to society or other countries, and they are threatened with international sanctions or loss of visas or “saturation” vaccination.\n• Bill Gates whose fortune is tied now to vaccines – showed how these interests behave if there is any resistance to them. He led a McCarthy-like (fascist) attack on American parents object to “unsafe” vaccines for their children – even with those vaccines known to be crippling and even killing children. But Gates whose vaccines are literally crippling and killing tens of thousands of children, went so far as to claim that in merely questioning vaccinating, American parents were killing children.\n\nDemand for an Immediate Injunction Against Quarantining/Detention and Mandatory Vaccines\n\nWe, the people of the united States of America are demanding an immediate injunction against any and all quarantining and mandatory vaccination of the American people because in the unseen context of such orders, as will be shown below, they are in no way health measures, they are unquestionably unconstitutional, they are tied to a plan to end the US as a sovereign country and bring in foreign troops, and they are an immediate and blatant genocidal threat to the lives of millions of Americans, men, women and children.\n\nHere are the reasons which rest on legal, medical, historical and criminal information:\n• Quarantining and mandatory vaccination rest upon two intersecting orders signed by George W Bush in 2007 with neither voted on by Congress.\n• George W. Bush signed a Presidential Directive on May 9, 2007 under which gives the White House unprecedented dictatorial power over the government and the country, bypassing the US Congress and obliterating the separation of powers. The directive also places the Secretary of Homeland Security in charge of domestic “security”.", "opengraph": {"locale": "en_US", "type": "article", "title": "Ole Dammegard: UN takeover, Ebola pandemic depopulation plot embedded in Obamacare codes will fail", "description": "Ole Dammegard: UN takeover, Ebola pandemic depopulation plot embedded in Obamacare codes will fail", "url": "https://newsinsideout.com/2014/12/ebola-depopulation-un-takeover-mass-extermination-plot-embedded-obamacare-codes-will-fail/", "site_name": "NewsInsideOut", "article:publisher": "https://www.facebook.com/NewsInsideOut", "article:author": "https://www.facebook.com/profile.php?id=100001662284456", "article:published_time": "2014-12-10T08:01:44+00:00", "article:modified_time": "2016-08-22T22:42:16+00:00", "image": "https://i0.wp.com/newsinsideout.com/wp-content/uploads/2014/12/OLE.DAMMEGARD.png?fit=1279%2C719&ssl=1", "image:width": "1279", "image:height": "719", "image:type": "image/png"}, "tags": ["Executive orders", "environmental catastrophe", "George W Bush", "Economic collapse", "George HW Bush", "Alfred Lambremont Webre", "Obama", "Clinton", "HAARP", "false flag", "vaccine", "EbolaGate", "depopulation", "Ole Dammegard", "Ferguson", "Ebola", "Obamacare"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/TFRx8fFpWz0?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/TFRx8fFpWz0?feature=oembed"}], "links": ["http://www.NewsInsideOut.com", "http://www.warcrimestribunal.org", "http://www.NewsInsideOut.com", "http://www.exopolitics.com/ebolagate", "http://exopolitics.blogs.com/ebolagate/2014/09/first-911-then-guillotines.html", "http://exopolitics.blogs.com/files/injunction-1.pdf", "http://exopolitics.blogs.com/files/evidence-for-injunction-1.pdf", "http://www.lightonconspiracies.com", "http://www.NewsInsideOut.com", "http://www.NewsInsideOut.com", "mailto:news@newsinsideout.com"], "authors": ["Alfred Lambremont Webre"], "publish_date": "2014-12-10T08:01:44+00:00"}