{"result_id": "223011", "URL": "https://www.newstarget.com/2022-10-21-von-der-leyen-needs-to-resign-immediately.html", "timestamp": "2023-04-25 16:35:39 CEST+0200", "meta": {"description": "For her role in scamming the European public out of billions of dollars to purchase vast quantities of Wuhan coronavirus (Covid-19) “vaccines,” European Commission President Ursula von der Leyen “must resign” immediately, says Romanian MEP Cristian Terhes. The lawmaker gave an impassioned speech this week demanding that von der Leyen step down right away from […]", "lang": "en", "keywords": "Albert Bourla,badhealth,badmedicine,big government,Big Pharma,Collusion,conspiracy,corruption,COVID,Cristian Terhes,deception,EU,fraud,Pfizer,resign,transparency,Ursula von der Leyen,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2022-10-21-von-der-leyen-needs-to-resign-immediately.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "EU’s Ursula von der Leyen needs to resign IMMEDIATELY over covid “vaccine” scam, says Romanian MEP", "cleaned_text": "EU’s Ursula von der Leyen needs to resign IMMEDIATELY over covid “vaccine” scam, says Romanian MEP\n\nFor her role in scamming the European public out of billions of dollars to purchase vast quantities of Wuhan coronavirus (Covid-19) \"vaccines,\" European Commission President Ursula von der Leyen \"must resign\" immediately, says Romanian MEP Cristian Terhes\n\nThe lawmaker gave an impassioned speech this week demanding that von der Leyen step down right away from her post after the European Public Prosecutor's Office (EPPO) confirmed that an investigation has been opened into the European Union's (EU) Fauci Flu shot purchases.\n\nTerhes, who belongs to the European Conservatives and Reformists (ECR) Group, explained that \"since her actions are [being] criminally investigated by EU prosecutors,\" von der Leyen has absolutely no business remaining in her position. (Related: Remember when von der Leyen considered trying to force all EU residents to get injected with the jabs she conspired to purchase?)\n\nThough von der Leyen was not specifically named in the EPPO announcement, it is widely believed based on the circumstances that she and Pfizer CEO Albert Bourla communicated at the onset of Operation Warp Speed about purchasing billions of Chinese Virus injections for billions of dollars.\n\nSeveral other EU watchdog groups had previously expressed concern about secret communications between von der Leyen and Bourla, who allegedly texted each other about the scheme. Those text messages have since disappeared and many want to know: where did they go?\n\n\"Ursula @vonderleyen must resign, since her actions are criminally investigated by @EUProsecutor,\" Terhes tweeted about the matter.\n\n\"She signed contracts to purchase 4.6 billion COVID vaccine doses worth €71, contracts that are still not fully released to the public and MEPs. #UrsulaMustResign #EUCorruption.\"\n\nUrsula von der Leyen purchased 10 doses of covid shots for every single EU citizen\n\nThe way the contracts were formed and signed between von der Leyen and Bourla point to serious criminality, hence the launching of a full investigation by the EPPO.\n\n\"Ursula von der Leyen must immediately and unconditionally resign from her position as president of the European Commission due to the fact that her actions are currently being criminally investigated by the European Public Prosecutor's Office,\" Terhes added.\n\n\"The EPPO just announced a few days ago that it is investigating the way the contracts were signed between the Commission and the producers of vaccines.\"\n\nIf you calculate out the number of jabs von der Leyen purchased from Bourla using EU tax dollars, it comes out to 10 doses of injection for every EU citizen. And this, according to Terhes, was done \"based on contracts that were never released to the public.\"\n\n\"This is how the contracts that she signed with pharmaceutical companies were released to the public,\" Terhes stated during his speech before Parliament while holding up two heavily redacted pages of a procurement contract between the Commission and the vaccine manufacturer.\n\n\"How is this possible in a European Union that is called to be transparent with the way it is using people's money?\"\n\nAccording to Emily O'Reilly, the European Ombudsman, the aforementioned procurement agreement between von der Leyen and Bourla points to the former as being guilty of \"maladministration,\" specifically because it was done via text messages that were improperly stored and thus unavailable for public scrutiny.\n\nSaid texts were not covered by EU law regarding the requirement to store all documents in accordance with policy, meaning von der Leyen committed a serious crime, it would appear.\n\n\"And she has not disappeared yet?\" asked a Natural News commenter. \"What's the hold up, Europe?\"\n\n\"How have our lives become a hellish nightmare seemingly overnight?\" asked another.\n\nThe latest news about Fauci Flu shots can be found at BigPharmaNews.com.", "opengraph": {"article:published_time": "2022-10-21 07:17:14", "title": "EU’s Ursula von der Leyen needs to resign IMMEDIATELY over covid “vaccine” scam, says Romanian MEP", "type": "article", "url": "https://www.newstarget.com/2022-10-21-von-der-leyen-needs-to-resign-immediately.html", "site_name": "Newstarget.com", "description": "For her role in scamming the European public out of billions of dollars to purchase vast quantities of Wuhan coronavirus (Covid-19) “vaccines,” European Commission President Ursula von der Leyen “must resign” immediately, says Romanian MEP Cristian Terhes. The lawmaker gave an impassioned speech this week demanding that von der Leyen step down right away from […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2022/10/Corrupt-Handshake-Business-Man-Money-Hand-Illegal.jpg"}, "tags": ["conspiracy", "EU", "big government", "Ursula von der Leyen", "Big Pharma", "fraud", "Cristian Terhes", "badhealth", "COVID", "deception", "Collusion", "badmedicine", "Pfizer", "vaccines", "resign", "transparency", "corruption", "Albert Bourla"], "tweets": [], "movies": [], "links": ["https://rmx.news/european-union/von-der-leyen-must-resign-over-vaccine-procurement-transparency-failings-mep-claims/", "https://www.brighteon.tv", "https://naturalnews.com/2021-12-06-european-commission-considering-forcing-covid-vaccines-europe.html", "https://bigpharmanews.com", "https://rmx.news/european-union/von-der-leyen-must-resign-over-vaccine-procurement-transparency-failings-mep-claims/", "https://naturalnews.com/2021-12-06-european-commission-considering-forcing-covid-vaccines-europe.html"], "authors": [], "publish_date": "2022-10-21 07:17:14"}