{"result_id": "223051", "URL": "https://www.newstarget.com/2023-01-18-covid-vaccine-pushing-talking-heads-now-back-pedaling.html", "timestamp": "2023-04-25 16:36:02 CEST+0200", "meta": {"description": "When World War II came to an end in 1945, the United States, along with the Soviet Union, UK, and France, agreed to convene a joint tribunal, now known as the Nuremberg Trials, to try 21 of the most insidious surviving leaders of Nazi Germany, as well as six German organizations that supported “Hitler Science.” […]", "lang": "en", "keywords": "badhealth,Big Pharma,biological warfare,clot shots,Dangerous Medicine,depopulation,Fauci,fear mongering,genocide,medical extremism,Medical Tyranny,medical violence,nuremberg II,Nuremburg Trials,pharmaceutical fraud,science deception,tribunal,vaccine death,Vaccine deaths,vaccine pushers,vaccine wars,vaccines,wen", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-01-18-covid-vaccine-pushing-talking-heads-now-back-pedaling.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "TRIBUNAL FEAR: Covid-vaccine-pushing talking heads now BACK-PEDALING to cover their tracks for fear of future prosecution for conspiring to push deadly vaccines", "cleaned_text": "TRIBUNAL FEAR: Covid-vaccine-pushing talking heads now BACK-PEDALING to cover their tracks for fear of future prosecution for conspiring to push deadly vaccines\n\nWhen World War II came to an end in 1945, the United States, along with the Soviet Union, UK, and France, agreed to convene a joint tribunal, now known as the Nuremberg Trials, to try 21 of the most insidious surviving leaders of Nazi Germany, as well as six German organizations that supported \" Hitler Science .\" The trials weren't just about convicting mass murderers and conspirators, but gathering irrefutable evidence of Nazi crimes. In fact, the trials convicted over 150 guilty parties of the 177 defendants that were tried. Two dozen of the guilty were sentenced to death.\n\nToday, many scientists, immunologists, and doctors who aggressively push the Covid-19 \"vaccinations\" on the masses are beginning to back-pedal, to alter their image and tactics, in hopes that as the mass-carnage and death tolls rear their ugly heads from this evil campaign, they too won't be found guilty by tribunals for mass murder and conspiring to propagate this biological \"clot shot\" genocide.\n\nVaccine pushers are carrying out a campaign to \"cleanse\" the world of a whole class of individuals through mass sterilization and the genetic mutation of cell function (mRNA)\n\nFor communism, the New World Order, and the ultimate \"elite\" power to rule the planet, the \"middle class\" must be completely wiped out and the \"lower class\" completely incapacitated, broken, perpetually sick, and enslaved. For a dozen years, Nazi Germany carried out the campaign to \"cleanse German society\" of people Hitler defined as \"biological threats\" to the \"nation's health.\" Sound familiar? Today, the vaccine pushers claim anyone who does not get jabbed represents that same kind of threat, but the irony is that the jabs themselves are the weapon of mass destruction.\n\nYou see, the Nazis developed \"health policies\" that featured the mass sterilization of European Jews, including carrying out over 400,000 forced sterilizations and 275,000 euthanasia deaths. To carry out this atrocity, the Nazis enlisted physicians, psychiatrists, medically trained geneticists, and even anthropologists, calling them \"racial science experts.\" Today, during the scamdemic, these folks are referred to as \"disease experts,\" \"vaccine advisors\" and \"pandemic experts,\" but what are they really?\n\nSeveral of these so-called \"disease experts,\" including Dr. Paul Offit and CNN's talking head, Dr. Leana Wen, are acting \"disappointed\" and \"angry\" that much of the data about the dangers and ineffectiveness of the Covid-19 vaccines, boosters, and even the masks, was not revealed to them during important meetings designed to further push the deadly clot shots and scamdemic mandates on the masses. Vital data was suppressed. Important information from clinical trials was hidden, skewed, or even omitted from discussions and medical journals.\n\nNow that millions of vaccine-infected humans are dying from heart attacks, strokes, vascular clots, and \"unexplained sudden deaths,\" these vaccine-pushing cohorts are suddenly upset they weren't privy to certain information? The question is how much did they already know, because it's obvious that the spike protein injections come with horrific health consequences that may prove to be a form of population reduction and genocide by biological warfare.\n\nSudden Adult Death Syndrome, spontaneous abortions, vascular clots -- they're all results of a planned depopulation agenda by Covid \"vaccination\"\n\nThe insidious Dr. Paul Offit, who created the Rotavirus jab that contains deadly pig virus strains called circovirus, is now on the record claiming he's \"angry\" that some data wasn't shown to him that reveals the clot shots aren't so safe or effective, as claimed. Offit, who is a member of the Vaccines and Related Biological Products Advisory Committee that advises FDA vaccine decisions, says that Moderna boosted their efficacy claims about their Covid booster. Oh really? As if that's some new trend, that Merck never did it, or Pfizer, or any of the other pharma cartels that are guilty of medical crimes and false claims over the past several decades.\n\nOffit speaks out: “I was angry to find out that there was data that was relevant to our decision that we didn’t get to see,” and… “Decisions that are made for the public have to be made based on all available information – not just some information, but all information.”\n\nIf the boosters are \"no better than the original shots,\" that means they are worse than useless, but dangerous to humans, especially teenagers, kids, infants, and pregnant women. Welcome to the club Offit. How does it feel to be lied to about the most insidious \"medicine\" on the planet? Is Offit turning against the endless Covid vaccine push, and will the medical industrial complex now turn on him, as they have Dr. Robert Malone?\n\nMaybe the lead vaccine pushers, who have been calling everyone who doesn't want to die by vaccine, \"anti-vaxxers\" and \"anti-science\" -- maybe those propagandists are guilty of biological war crimes, so they're all backpedaling now. Afraid of tribunals, are you? Nuremberg Trials Part II may be quickly approaching, and it won't be pretty for the co-conspirators involved in pushing the clot shots \"for the greater good.\" Where have we heard that before?\n\nRemember, those who forget or ignore history are doomed to repeat it. Eighty years ago the population reduction WMD was the gas chambers, today it's the mRNA clot shots. Are you \"volunteering\" to walk into the \"death chambers\" of the Vaccine Holocaust? Just take a look at the propaganda then and now. Is the \"V\" for victory by vaccination?\n\nBookmark Vaccines.news to your favorite independent websites for updates on the Vaccine Holocaust that's sweeping the nation and the world as you read this.", "opengraph": {"article:published_time": "2023-01-18 11:42:46", "title": "TRIBUNAL FEAR: Covid-vaccine-pushing talking heads now BACK-PEDALING to cover their tracks for fear of future prosecution for conspiring to push deadly vaccines", "type": "article", "url": "https://www.newstarget.com/2023-01-18-covid-vaccine-pushing-talking-heads-now-back-pedaling.html", "site_name": "Newstarget.com", "description": "When World War II came to an end in 1945, the United States, along with the Soviet Union, UK, and France, agreed to convene a joint tribunal, now known as the Nuremberg Trials, to try 21 of the most insidious surviving leaders of Nazi Germany, as well as six German organizations that supported “Hitler Science.” […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/01/Death-Holocaust-Vaccine-Syringe.jpg"}, "tags": ["biological warfare", "Big Pharma", "badhealth", "medical violence", "science deception", "wen", "fear mongering", "Nuremburg Trials", "nuremberg II", "vaccine pushers", "clot shots", "vaccine wars", "Fauci", "tribunal", "depopulation", "medical extremism", "Medical Tyranny", "Dangerous Medicine", "Vaccine deaths", "genocide", "vaccines", "vaccine death", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.ushmm.org/collections/bibliography/nazi-racial-science", "https://www.brighteon.tv", "https://www.naturalnews.com/2023-01-13-offit-angry-lied-to-about-covid-jabs.html", "https://naturalnews.com/2022-09-06-mask-pusher-dr-leana-wen-admits-masks-mandates-retarded-her-childs-language-development.html", "https://12ft.io/proxy?q=https://www.cnn.com/2023/01/11/health/moderna-bivalent-transparency/index.html", "https://naturalnews.com/2022-08-28-leana-wen-rejected-fauci-flu-propaganda-machine.html", "https://www.nbcnews.com/health/health-news/younger-healthy-people-dont-need-another-covid-booster-vaccine-expert-rcna65324", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2023-01-13-offit-angry-lied-to-about-covid-jabs.html", "https://www.nbcnews.com/health/health-news/younger-healthy-people-dont-need-another-covid-booster-vaccine-expert-rcna65324", "https://12ft.io/proxy?q=https://www.cnn.com/2023/01/11/health/moderna-bivalent-transparency/index.html", "https://www.ushmm.org/collections/bibliography/nazi-racial-science"], "authors": [], "publish_date": "2023-01-18 11:42:46"}