{"result_id": "223015", "URL": "https://www.newstarget.com/2023-03-31-faa-cleared-pilot-with-vaccine-induced-myocarditis.html", "timestamp": "2023-04-25 16:35:41 CEST+0200", "meta": {"description": "An anonymous pilot leaked a letter to the media this week showing that the Federal Aviation Administration (FAA) issued a first-class medical clearance to another pilot with a known medical history that includes “possible” vaccine-induced myocarditis. With names and dates redacted, the letter states that the medical clearance came from the FAA’s Civil Aerospace Medical […]", "lang": "en", "keywords": "airlines,badhealth,badmedicine,Censored Science,COVID,FAA,Federal Aviation Administration,myocarditis,vaccination,vaccine,vaccine damage,vaccine injury,vaccine wars,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-03-31-faa-cleared-pilot-with-vaccine-induced-myocarditis.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "ASSUME CRASH POSITION: FAA cleared pilot with history of “possible” covid vaccine-induced myocarditis to fly planes", "cleaned_text": "ASSUME CRASH POSITION: FAA cleared pilot with history of “possible” covid vaccine-induced myocarditis to fly planes\n\nAn anonymous pilot leaked a letter to the media this week showing that the Federal Aviation Administration (FAA) issued a first-class medical clearance to another pilot with a known medical history that includes \"possible\" vaccine-induced myocarditis.\n\nWith names and dates redacted, the letter states that the medical clearance came from the FAA's Civil Aerospace Medical Institute in Oklahoma City. It reads, in part, as follows:\n\n\"You are cautioned to abide by Title 14 of the CFR's, Section 61.53, relating to operations during medical deficiency.\n\n“Because of your history of possible Vaccine induced Myocarditis, Hyperlipidemia, Ganglion Cyst removal Left Hand, and Knee pain, operation of aircraft is prohibited at any time new symptoms or adverse changes occur in your health status.\"\n\nHaving made no attempt whatsoever to investigate and assess the pilot in question to ensure that he is safe to fly, the FAA appears to have decided to simply rubber-stamp the medical clearance, further stating to the pilot upon approval:\n\n\"Our review of your medical records has established that you are eligible for a first-class medical certificate.\"\n\nAre commercial airlines allowing vaccine-damaged pilots to fly their planes?\n\nThere are several classes of pilot licensing issued by the FAA, the first-class type obviously being ahead of the pack.\n\nAccording to the agency, a first-class medical certificate generally \"is designed for the airline transport pilot\" while \"second-class [is] for the commercial pilot, and third-class for the student, recreational and private pilot.\"\n\nThat the FAA would award this possibly health-damaged pilot its top certificate is stunning in and of itself. Even more shocking is that this is the first known instance in which the FAA acknowledged a vaccine injury, let alone one stemming from Wuhan coronavirus (Covid-19) \"vaccines.\"\n\nBack on January 24, Federal Air Surgeon Susan Northrup, MD, MPH, announced that the FAA has seen \"no evidence\" of Fauci Flu shot injuries that have led to \"aircraft accidents or pilot incapacitations.\"\n\nLater in February, Northrup changed her story by admitting that she was \"aware of only four potentially vaccine-related adverse events in active pilots.\" Of these, \"only one [pilot] has provided medical documentation through the normal process,\" she added, failing to describe what the \"normal process\" actually is.\n\nIt turns out that the FAA and Northrup knew at least as far back as April 2022 that some pilots had become injured by covid injections. These injuries first emerged, as far as we can tell, around December 2021, according to a letter from the California-based Advocates for Citizens' Rights that was hand-delivered to the FAA and several other federal agencies, including the U.S. Department of Transportation.\n\n\"The letter included data showing pilots across the aviation industry – including commercial, military and general aviation pilots – face increased health risks from the COVID-19 vaccines due to the unique nature of their profession,\" reported The Defender.\n\n\"The letter referred to specific incidents, including the case of an agricultural pilot, Cody Flint, who nearly blacked out while flying but managed to land his plane safely – although he has no recollection of how he did it.\"\n\nIn a later interview with The Defender, Flint said the incident occurred just two days after he received his first and only dose of the two-part primary mRNA (messenger RNA) series from Pfizer and BioNTech in February 2021.\n\n\"My intracranial pressure had risen so high that it caused both of my inner ears to 'blow out,'\" Flint said, adding that doctors told him this type of thing is usually caused by major head trauma.\n\nThe latest news about the destruction of society by covid \"vaccine\" can be found at ChemicalViolence.com.", "opengraph": {"article:published_time": "2023-03-31 12:34:07", "title": "ASSUME CRASH POSITION: FAA cleared pilot with history of “possible” covid vaccine-induced myocarditis to fly planes", "type": "article", "url": "https://www.newstarget.com/2023-03-31-faa-cleared-pilot-with-vaccine-induced-myocarditis.html", "site_name": "Newstarget.com", "description": "An anonymous pilot leaked a letter to the media this week showing that the Federal Aviation Administration (FAA) issued a first-class medical clearance to another pilot with a known medical history that includes “possible” vaccine-induced myocarditis. With names and dates redacted, the letter states that the medical clearance came from the FAA’s Civil Aerospace Medical […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/03/Interior-Airplane-Passengers-Seats-Waiting-Taik.jpg"}, "tags": ["Federal Aviation Administration", "vaccine wars", "FAA", "airlines", "badhealth", "COVID", "vaccine", "myocarditis", "vaccine injury", "badmedicine", "vaccines", "vaccine damage", "Censored Science", "vaccination"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/faa-pilot-medical-clearance-myocarditis/", "https://www.brighteon.tv", "https://naturalnews.com/2022-05-23-airlines-cut-training-hours-pilots-shortage-vaccines.html", "//chemicalviolence.com", "https://childrenshealthdefense.org/defender/faa-pilot-medical-clearance-myocarditis/", "https://naturalnews.com/2022-05-23-airlines-cut-training-hours-pilots-shortage-vaccines.html"], "authors": [], "publish_date": "2023-03-31 12:34:07"}