{"result_id": "223035", "URL": "https://www.newstarget.com/2023-01-06-how-much-longer-covidians-keep-up-appearances.html", "timestamp": "2023-04-25 16:35:53 CEST+0200", "meta": {"description": "Below is a small selection of articles posted yesterday about covid “vaccines.”   It’s all bad news for the pharmaceutical industry and those pushing the so-called vaccines. (Article by Rhoda Wilson republished from Expose-News.com) A survey in America shows that 28% of people, one in four, know someone who has died from the covid injections. A […]", "lang": "en", "keywords": "bivalent booster,covid vaccine,covid-19,Dangerous Medicine,government,infant mortality,medical martial law,Medical Tyranny,medival violence,myocarditis,pharmaceutical fraud,politics,propaganda,vaccine,vaccine damage,Vaccine deaths,vaccine injury,Wuhan coronavirus", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-01-06-how-much-longer-covidians-keep-up-appearances.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "COVID vaccine news: How much longer can COVIDians keep up appearances?", "cleaned_text": "COVID vaccine news: How much longer can COVIDians keep up appearances?\n\nBelow is a small selection of articles posted yesterday about covid “vaccines.” It’s all bad news for the pharmaceutical industry and those pushing the so-called vaccines.\n\nA survey in America shows that 28% of people, one in four, know someone who has died from the covid injections. A study of excess deaths in Australia finds an association between deaths and covid vaccine rollout. And infant mortality in Israel spiked after mRNA injections.\n\nA study of bivalent booster “vaccines” revealed that they have failed and the injected are more likely to get infected.\n\nThe Wall Street Journal, finally, admits that covid injections are causing illness. A recently published paper found elevated levels of an unusual antibody that robs vaccinated people of a crucial immune system tool against the coronavirus and may cause cancer. A study finds booster mandates at universities in USA will cause harm.\n\nThe good news is the public at large is becoming more aware of vaccine harms.\n\nUS Survey Finds 28% Personally Know of a Death Caused by Covid Injections\n\nA Rasmussen Reports survey of 1,000 American Adults was conducted in the last week of December 2022. It found 71% say they have received a covid vaccination, while 26% have not. However, the vaccinated appear to be waking up to the harms of the injections.\n\nAmong the vaccinated, many of whom pushed the covid injections on family members or in the workplace, now 38% consider unexplained deaths from the vaccine at least somewhat likely.\n\nAnd 22% of vaccinated adults know of a vaccine death making the population average a stunning 28%.\n\nThe survey provides two independent proofs that people are not making things up when discussing covid vaccine deaths:\n\nFirstly, more married (33%) than unmarried (23%) Americans think someone they know personally might have died from vaccine side effects. This is because, logically, married people have a larger circle of friends (husband’s friends and wife’s friends).\n\nSecondly, more Democrats know someone killed by the vaccines than Republicans which ties in with the statistic that more Democrats (85%) than Republicans (63%) have been vaccinated against covid.\n\nProbable Causal Association Between Australia’s New Regime of High All-Cause Mortality and Its Covid Vaccine Rollout\n\nMr. David Shuldman, an Israeli systems analyst and economist, requested information from the Central Bureau of Statistics in Israel (CBS). The information he requested included the number of babies who have died shortly after birth in the last few years, and the data that he received is explosive.\n\nHe requested information about infant deaths and the vaccination status of the mothers from all major health clinics. Maccabi, a health clinic that covers more than 25% of citizens in Israel, sent a response to Mr. Shuldman in August 2022. The data that Mr. Shuldman received documented babies who died between the day they were born and 27 days after birth, from Q1 of 2019 until Q2 of 2022.\n\nThe data are devastating and demonstrate a 100% increase in the number of babies dying since the vaccine rollout began.\n\nIn September 2022, Cleveland Clinic researchers released the results of their study involving 10,804 employees of Cleveland Clinic Health System that were bivalent vaccine boosted. The study is yet to be peer-reviewed.\n\nThe study findings showed an association of greater risk of covid infection with higher numbers of prior vaccine doses. Put simply, the more people vaccinated, the more the SARS-CoV-2 transmission.\n\nThe study authors pointed out that those who avoided CDC recommendations actually got infected less than those that followed CDC recommendations. The authors also point out that there are other studies that find a possible association of higher prior vaccine doses and higher risk of covid.\n\nMounting data also suggests in the aggregate that more doses equal higher risk\n\nThe bivalent booster has failed, all the vaccines do not work, there is negative effectiveness and the vaccinal antibodies wane rapidly, there is the emergent issue of immune tolerance (IgG4 class switch etc.), there is constant viral immune escape, original antigenic sin, and antibody-dependent enhancement of infection, constantly.\n\nYet Another “Conspiracy Theory” Comes True – Vaccines Fuelling Variants and Causing Sickness\n\nCan we have a tally of how many “conspiracy theories” actually become “true” within a number of months? The latest one appears in The Wall Street Journal: ‘Are Vaccines Fuelling New Covid Variants? The virus appears to be evolving in ways that evade immunity’.\n\nAllysia Finley, who wrote the article, begins by describing panic over the new Omicron variant – XBB. It is rapidly spreading across the US and whilst it is unlikely to be any more lethal, its mutations are evading antibodies. According to Ms. Finley, growing evidence also suggests that repeated vaccinations may make people more susceptible to XBB and fuelling its rapid evolution.\n\nWho would have thought!?\n\nAntibody-dependent enhancement (“ADE”) and/or original antigenic sin (“OAS”) were always a concern but apparently not to the big-brained scientists who know better than everyone else. Who would have thought when we were reporting, over a year ago, on official UK data showing the injected were more likely to get infected!?\n\nRead the full article HERE and another article on the same WSJ article HERE.\n\nAs early as July 2021, Vinay Prasad with colleagues from mathematics, cardiology, and paediatrics worried that dose 2 was unfavourable in adolescent boys. With emerging data from the UK, it was clear that for some products and some doses, myocarditis post covid injection exceeded myocarditis post illness.\n\nAnd yet, covid influencers – with no ability to analyse data – continued to make the false statement that covid had worse myocarditis under all circumstances. They blindly pushed their anti-anti-vax zealotry. Yet, you can see clearly that was not true.\n\nmRNA myocarditis minimisers habitually hid the safety signal by, for example, lumping 20-year-old men with 80-year-old women together. In a new peer-reviewed analysis the researchers grouped myocarditis cases into age groups. Looking at the highest-risk demographics and it becomes obvious. The new analysis is full of interesting findings, for example, dose 2 is worse than dose 1, and Moderna is worse than Pfizer.\n\nBooster Mandates in Young Adults Are Expected to Cause a Net Harm\n\nA Science Immunology paper published on 22 December showed that people who have received mRNA covid injections produce more of an unusual antibody called IgG4 over time.\n\nWorst-case scenario: the mRNA injections lead to a doom loop, robbing vaccinated people of a crucial immune system tool against the coronavirus in a way that worsens with each new infection. And some people may suffer nasty autoimmune side effects too, including pancreatitis, kidney disease, and even aneurysms.\n\nThe truly worst-case scenario would come if those changes combine with a new, more dangerous Sars-CoV-2 variant that our weakened immune systems cannot clear.\n\nIn light of the findings of this study, The Epoch Times described why the covid-vaccinated are getting new cancers. Journalists are speculating that it is because of IgG4 antibodies spiking in the blood labs of those who are triple-injected with the mRNA vaccines, but that is not the main reason.\n\nThe American Public is Extremely Worried About the Vaccines\n\nOne of the few positive aspects of the covid vaccine campaign is that it has been so egregious, many people A Midwestern Doctor knew who were previously on the fence about vaccines have decided vaccination has serious issues which need to be looked at. Put differently, vaccine safety concerns have gone from a fringe viewpoint very few were even aware of to a mainstream political position.\n\nThe pharmaceutical industry has advanced its business model of pushing harmful and ineffective proprietary medications onto the population so aggressively (while the entire government has capitulated to the money they receive from facilitating this), that the public is now seeing that business model for exactly what it is and no longer wanting to take its products.\n\nDr. Meryl Nass asked: Who should Fauci be more afraid of?\n• The 300 million Americans who got at least one lab-created covid infection he helped pay to produce?\n• The 60 million Americans injured or killed by his poisonous vaccines? (60 million is a guess)\n• The rulers of the Great Reset (the real Godfathers) who relied on him to create a viral bioweapon that could never be traced back to a lab; and also relied on him to create a vaccine that did not fail so fast and miserably and allow us, the despised masses of humanity, to figure out what was going on before the Godfathers’ traps for humanity were ready to snap shut?\n\nHow Many Lives Did the Covid Vaccines Really Save?\n\nIf the vaccines really did save 20 million from covid deaths then it would not be effective if it led to more than 20 million deaths from adverse events.\n\nNot only is there now strong evidence of an increase in all-cause mortality among the vaccinated, but we do not believe there is any objective reliable evidence that the covid vaccines saved any PREVENTABLE deaths from covid. There are nine reasons for coming to this conclusion …\n\nHealth Canada dropped a new policy to Ring in the New Year…basically, a full-on admission of failure.\n\nThe Government of Canada announced a negative covid test requirement for travellers arriving from the People’s Republic of China, Hong Kong or Macao – regardless of vaccination status.\n\nThe End of the Covid Data\n\nJust after Christmas, we got the news that the UK Government will stop publishing wartime-style bulletins of Covid casualties after nearly three years.\n\nWe are now “living with the virus” as if that had not been the number one option all along. While the zero covid brigades seem to have vanished into thin air, don’t be fooled – those who seek to restrict freedom of thought, speech and movement are still lurking in the wings with their models and mandates.", "opengraph": {"article:published_time": "2023-01-06 04:30:20", "title": "COVID vaccine news: How much longer can COVIDians keep up appearances?", "type": "article", "url": "https://www.newstarget.com/2023-01-06-how-much-longer-covidians-keep-up-appearances.html", "site_name": "Newstarget.com", "description": "Below is a small selection of articles posted yesterday about covid “vaccines.”   It’s all bad news for the pharmaceutical industry and those pushing the so-called vaccines. (Article by Rhoda Wilson republished from Expose-News.com) A survey in America shows that 28% of people, one in four, know someone who has died from the covid injections. A […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/01/Covid-19-Montage-Vaccine-Syringe.jpg"}, "tags": ["covid vaccine", "government", "covid-19", "Vaccine deaths", "medival violence", "vaccine", "politics", "myocarditis", "vaccine injury", "Medical Tyranny", "pharmaceutical fraud", "bivalent booster", "vaccine damage", "infant mortality", "Wuhan coronavirus", "medical martial law", "propaganda", "Dangerous Medicine"], "tweets": [], "movies": [], "links": ["https://www.brighteon.tv", "https://expose-news.com/2023/01/04/how-much-longer-can-covidians-keep-up-appearances/", "https://petermcculloughmd.substack.com/p/national-survey-finds-finds-28-personally", "https://igorchudov.substack.com/p/rasmussen-survey-on-covid-vaccine", "https://www.researchgate.net/publication/366445769_Probable_causal_association_between_Australia%27s_new_regime_of_high_all-cause_mortality_and_its_COVID-19_vaccine_rollout", "https://twitter.com/david_shuldman", "https://etana.substack.com/p/infant-mortality-spiked-in-israel", "https://www.trialsitenews.com/a/large-studys-disturbing-results-questionable-bivalent-booster-performance-the-greater-the-previous-mrna-doses-the-greater-the-risk-for-infection-b468bbce?s=03", "https://palexander.substack.com/p/pfizer-and-moderna-covid-gene-therapy", "https://archive.ph/miwI6", "https://nakedemperor.substack.com/p/yet-another-conspiracy-theory-comes", "https://www.thegatewaypundit.com/2023/01/pandemic-vaccinated-wsj-reports-covid-vaccines-may-causing-covid-variants-evolve/", "https://onlinelibrary.wiley.com/doi/epdf/10.1111/eci.13947", "https://sensiblemed.substack.com/p/our-new-analysis-of-myocarditis-after", "https://jme.bmj.com/content/early/2022/12/05/jme-2022-108449", "https://www.science.org/doi/10.1126/sciimmunol.ade2798", "https://alexberenson.substack.com/p/something-wicked-this-way-comes-and", "https://www.theepochtimes.com/how-covid-vaccines-cause-cancer_4952911.html", "https://amidwesterndoctor.substack.com/p/the-american-public-is-extremely", "https://merylnass.substack.com/p/who-should-fauci-be-more-afraid-of", "https://wherearethenumbers.substack.com/p/kirsch-challenge", "https://sheldonyakiwchuk.substack.com/p/finally-an-admission-by-the-liberal", "https://www.dailymail.co.uk/news/article-11573653/UK-Government-stop-publishing-Covid-data-January-country-living-virus.html?ito=native_share_article-top", "https://trusttheevidence.substack.com/p/the-end-of-the-covid-data-so-what", "https://expose-news.com/2023/01/04/how-much-longer-can-covidians-keep-up-appearances/"], "authors": [], "publish_date": "2023-01-06 04:30:20"}