{"result_id": "223014", "URL": "https://www.newstarget.com/2023-04-17-indictment-allows-doctor-access-secret-covid-records.html", "timestamp": "2023-04-25 16:35:40 CEST+0200", "meta": {"description": "A plastic surgeon accused of performing fraudulent Wuhan coronavirus (COVID-19) vaccinations was given an opportunity to single-handedly expose the corruption and alleged link between the experimental injections and deaths in every American state. Following the U.S. attorney’s criminal indictment against Utah’s Dr. Kirk Moore for allegedly running a “COVID-19 vaccine scheme to defraud the government,” the […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,big government,Big Pharma,Brady Rule,CDC,Censorship,Collapse,conspiracy,corruption,covid-19,Dangerous Medicine,deception,indictment,jury nullification,Kirk Moore,pandemic,pharmaceutical fraud,Steve Kirsch,vaccination record cards,vaccine damage,Vaccine injuries,vaccine injury,vaccine safety,vaccine wars,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-04-17-indictment-allows-doctor-access-secret-covid-records.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "Criminal indictment allows doctor access to concealed records linking COVID vaccines and deaths", "cleaned_text": "Criminal indictment allows doctor access to concealed records linking COVID vaccines and deaths\n\nA plastic surgeon accused of performing fraudulent Wuhan coronavirus (COVID-19) vaccinations was given an opportunity to single-handedly expose the corruption and alleged link between the experimental injections and deaths in every American state\n\nFollowing the U.S. attorney's criminal indictment against Utah's Dr. Kirk Moore for allegedly running a \"COVID-19 vaccine scheme to defraud the government,\" the doctor has been given the right to request public health records, including Medicare, National Democratic Institute (NDI) and all state death and vaccination records. (Related: Right Now with Ann Vandersteel: CDC is hiding Medicare data about the dangers of COVID-19 vaccines – Brighteon.TV.)\n\n\"Now the truth will finally be exposed,\" Vaccine Safety Research Foundation Executive Director Steve Kirsch said. The philanthropist started advising Moore on what documents to request in legal discovery in a bid to pursue \"jury nullification.\"\n\nMoore left a message on Kirsch's April 5 Substack article about his prosecution and plan to \"get as much data as possible\" held by the feds to buttress his defense.\n\n\"As part of my defense, I am looking to get as much data as possible from our fed government. What data do you need, what would you like to see? If they have the data, or it is available, they must provide it to me or suffer a loss for a Brady violation,\" the indicted doctor said.\n\nKirsch's article was about the authorities' refusal to release granular data that could show the inherent risk of COVID-19 vaccination. \"Every state has both death and vax status databases, and a simple merge of the two tables would show how many days elapsed from each vaccine dose for each person who died,\" he wrote.\n\nMoore's Plastic Surgery Institute of Utah and its codefendants had been accused in January of accepting \"direct cash payments\" or purported charitable donations in exchange for \"fraudulently completed vaccination record cards\" for more than 1,900 doses that were never administered.\n\nAccording to a Department of Justice press release, the scheme destroyed more than $28,000 worth of government-provided vaccines, including those meant for children who actually received saline shots \"at the request of their parents.\"\n\nKirsch celebrated what happened to Moore, pointing out this could be a blessing in disguise.\n\n\"What if Dr. Moore was actually saving lives instead and is a hero?\" Kirsch said in his April 10 newsletter. He said federal prosecutors have given \"the anti-vax movement in America the greatest gift ever\" by charging Moore, potentially giving his defense \"the secret public health records of every state\" that could show links between COVID-19 vaccination and deaths.\n\nKirsch: Moore could use jury nullification to win case\n\nKirsch also pointed to historic and contemporary uses of jury nullification, which is an option that defendants typically can't suggest to juries, such as in low-level drug prosecutions. Back in 2016, a former federal prosecutor argued that jurors should use the tool to reduce racial disparities in prosecution.\n\nAccording to Kirsch, jury nullification is a powerful check on abusive government and unjust laws. But most Americans aren't aware of it and lawyers aren't allowed to inform a jury of their right to nullify a law. It will take a massive public education effort to make enough Americans aware of the power they hold in jury duty to make a difference in trials.\n\n\"So, spread the word,\" he urged. \"This is the biggest opportunity ever to end the narrative. The government has literally opened up the secret books in every state for inspection.\"\n\nVisit PharmaceuticalFraud.com for more news on Big Pharma's dangerous vaccines.\n\nWatch the video below where Kirsch exposed that more people died in the vaccine group than in the placebo group during clinical trials.\n\nThis video is from the In Search Of Truth channel on Brighteon.com.\n\nSteve Kirsch: Data shows COVID-19 vaccine is the MOST DANGEROUS vaccine ever made.\n\nSteve Kirsch estimates between 5M and 12M people have been killed by COVID clot shots worldwide (so far).\n\nNo, covid vaccines are NOT \"safe and effective\" – these 10 surveys reveal the truth.\n\nVACCINE HOLOCAUST: More than 40 times the number of Americans who died in WWII are now dead from covid \"vaccines.\"", "opengraph": {"article:published_time": "2023-04-17 13:47:01", "title": "Criminal indictment allows doctor access to concealed records linking COVID vaccines and deaths", "type": "article", "url": "https://www.newstarget.com/2023-04-17-indictment-allows-doctor-access-secret-covid-records.html", "site_name": "Newstarget.com", "description": "A plastic surgeon accused of performing fraudulent Wuhan coronavirus (COVID-19) vaccinations was given an opportunity to single-handedly expose the corruption and alleged link between the experimental injections and deaths in every American state. Following the U.S. attorney’s criminal indictment against Utah’s Dr. Kirk Moore for allegedly running a “COVID-19 vaccine scheme to defraud the government,” the […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/04/Covid-19-Coronavirus-Shot-Vaccine-Syringe.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "Big Pharma", "badhealth", "vaccination record cards", "deception", "Vaccine injuries", "corruption", "CDC", "covid-19", "Brady Rule", "vaccine damage", "indictment", "Kirk Moore", "Steve Kirsch", "vaccine wars", "vaccine safety", "Dangerous Medicine", "jury nullification", "Collapse", "Censorship", "vaccine injury", "badmedicine", "vaccines", "badscience", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://justthenews.com/government/courts-law/covid-vaccine-fraud-prosecution-could-force-feds-share-correlated-deaths-data", "https://vaccinedeaths.com/", "https://www.brighteon.tv", "https://www.justice.gov/usao-ut/pr/utah-doctor-and-co-defendants-charged-running-covid-19-vaccine-scheme-defraud-government?utm_source=substack&utm_medium=email", "https://www.naturalnews.com/2023-03-07-cdc-hides-medicare-data-covid-vaccine-dangers.html", "https://stevekirsch.substack.com/p/the-medicare-records-clearly-show/comment/14260267", "https://abcnews.go.com/US/doj-salt-lake-city-plastic-surgeon-4-charged/story?id=96603689", "https://stevekirsch.substack.com/p/the-us-attorney-in-utah-has-given?utm_source=direct&utm_campaign=post&utm_medium=web", "https://archive.is/bzbo3", "https://pharmaceuticalfraud.com/", "https://www.brighteon.com/333faf9c-2c77-4be5-9eae-948e90dacc10", "https://www.brighteon.com/channels/insearchotruth", "https://naturalnews.com/2022-11-08-kirsch-covid-vaccine-most-dangerous-ever-made.html", "https://vaccines.news/2022-08-17-steve-kirsch-vaccines-killed-between-5m-12m.html", "https://vaccineinjurynews.com/2022-05-24-covid-vaccines-not-safe-effective-ten-surveys.html", "https://vaccinedeaths.com/2022-08-17-40-times-americans-died-wwii-covid-vaccines.html", "https://justthenews.com/government/courts-law/covid-vaccine-fraud-prosecution-could-force-feds-share-correlated-deaths-data", "https://www.justice.gov/usao-ut/pr/utah-doctor-and-co-defendants-charged-running-covid-19-vaccine-scheme-defraud-government?utm_source=substack&utm_medium=email", "https://stevekirsch.substack.com/p/the-medicare-records-clearly-show/comment/14260267", "https://abcnews.go.com/US/doj-salt-lake-city-plastic-surgeon-4-charged/story?id=96603689", "https://stevekirsch.substack.com/p/the-us-attorney-in-utah-has-given?utm_source=direct&utm_campaign=post&utm_medium=web", "https://archive.is/bzbo3", "https://www.brighteon.com/333faf9c-2c77-4be5-9eae-948e90dacc10"], "authors": [], "publish_date": "2023-04-17 13:47:01"}