{"result_id": "223037", "URL": "https://www.newstarget.com/2023-03-01-covid-vaccines-eight-times-deadlier-disease-itself.html", "timestamp": "2023-04-25 16:35:54 CEST+0200", "meta": {"description": "In the six months that followed the unleashing of Wuhan coronavirus (Covid-19) “vaccines” under Operation Warp Speed, eight times as many people died from the jab than died from the so-called “virus” over the course of 18 months, official government data show. The National Health Service (NHS) of the United Kingdom published data covering the […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,chemical violence,conspiracy,COVID,Dangerous Medicine,death,deception,deep state,medical violence,pharma fraud,pharmaceuticals,research,science deception,statistics,vaccination,Vaccine deaths,vaccine wars,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-03-01-covid-vaccines-eight-times-deadlier-disease-itself.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "Covid “vaccines” found to be EIGHT TIMES deadlier than the disease itself – government data", "cleaned_text": "Covid “vaccines” found to be EIGHT TIMES deadlier than the disease itself – government data\n\nIn the six months that followed the unleashing of Wuhan coronavirus (Covid-19) \"vaccines\" under Operation Warp Speed, eight times as many people died from the jab than died from the so-called \"virus\" over the course of 18 months, official government data show\n\nThe National Health Service (NHS) of the United Kingdom published data covering the 18-month period from March 2020 up through Aug. 25, 2021. During that timeframe, there were 90,147 \"covid\" deaths reported within 28 days of a \"positive\" test result.\n\nOf these, 86,315 died from other pre-existing health conditions such as dementia, chronic kidney disease, chronic pulmonary disease, chronic neurological disease, and heart disease, but were added to the covid statistics because of the \"positive\" test result.\n\nWhat this means is that 96 percent of the \"covid\" deaths recorded in the U.K. from the start of the scamdemic through mid-2021 when the so-called \"vaccines\" were in full swing were actually deaths caused by non-covid health conditions. Meanwhile, tens of thousands have died from the jabs – deaths that would not have occurred had the victims skipped getting injected.\n\n\"When you consider that testing was compulsory in hospitals, despite it not being written in law, and they used the PCR test notorious for producing false positives, it's not hard to see how the Government managed to mix tens of thousands of people who actually died of other causes into the Covid-19 death statistics,\" reported The Exposé.\n\n\"Thankfully the NHS data informs us that just 3,832 people actually died OF Covid-19 within 28 days of a positive test result in England hospitals between March 2020 and August 25th 2021.\"\n\nThe government has been lying since the beginning about \"covid\" deaths\n\nIt was difficult to obtain accurate data on the number of deaths caused by covid jabs. Investigators had to file dozens of Freedom of Information requests to Public Health England (PHE) (now known as the U.K. Health Security Agency, or UKHSA) to extract this information, which the PHE initially claimed it did \"not hold.\"\n\nAfter months of denial, the UKHSA finally released the information through the Office for National Statistics (ONS) – but perhaps by accident, according to The Exposé. Accident or otherwise, the cat is now out of the bag.\n\nThe ONS published a fake report on Sept. 13, 2021, falsely claiming that the vast majority of \"covid\" deaths were occurring in the unvaccinated population. It turns out this earlier report included a huge number of deaths that occurred during the second \"wave\" of the virus when barely anybody had gotten injected.\n\nThe parameters used in that report were carefully chosen to make it seem like the only people dying were the unvaccinated, but a more accurate assessment range like the one The Exposé put together tells a different story.\n\n\"The figures contained in the report were supposed to mislead the public into believing Covid-19 vaccination was fantastic at preventing death,\" the outlet reported. \"But by publishing those figures they accidentally revealed that 30,305 people had died within 21 days of having a Covid-19 vaccine in England between January 2nd and July 2nd 2021.\"\n\n\"Another 11,470 people died within 21 days of having their second dose of a Covid-19 vaccine, and 182 people died within 21 days of having their second dose of a Covid-19 vaccine whose death allegedly involved Covid-19 ... Therefore 30,305 people died within 21 days of having the Covid-19 vaccine in England during the first 6 months of 2021.\"\n\nAs covid injections continue to needlessly end people's lives early, we will keep you informed about the latest at VaccineDeaths.com.", "opengraph": {"article:published_time": "2023-03-02 00:54:24", "title": "Covid “vaccines” found to be EIGHT TIMES deadlier than the disease itself – government data", "type": "article", "url": "https://www.newstarget.com/2023-03-01-covid-vaccines-eight-times-deadlier-disease-itself.html", "site_name": "Newstarget.com", "description": "In the six months that followed the unleashing of Wuhan coronavirus (Covid-19) “vaccines” under Operation Warp Speed, eight times as many people died from the jab than died from the so-called “virus” over the course of 18 months, official government data show. The National Health Service (NHS) of the United Kingdom published data covering the […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/03/Vaccine-Syringe-Shot-Arm.jpg"}, "tags": ["conspiracy", "big government", "Big Pharma", "pharma fraud", "deep state", "badhealth", "COVID", "deception", "medical violence", "statistics", "vaccination", "science deception", "pharmaceuticals", "chemical violence", "vaccine wars", "death", "Dangerous Medicine", "Vaccine deaths", "research", "badmedicine", "vaccines"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/03/01/covid-vaccination-8x-deadlier-than-disease/", "https://www.brighteon.tv", "https://naturalnews.com/2021-09-30-vaccine-death-report-millions-died-covid-vaccines.html", "//vaccineholocaust.org", "//VaccineDeaths.com", "https://expose-news.com/2023/03/01/covid-vaccination-8x-deadlier-than-disease/", "https://naturalnews.com/2021-09-30-vaccine-death-report-millions-died-covid-vaccines.html"], "authors": [], "publish_date": "2023-03-02 00:54:24"}