{"result_id": "223046", "URL": "https://www.newstarget.com/2023-04-07-hobbs-vetoes-bill-granting-covid-vaccine-exemptions.html", "timestamp": "2023-04-25 16:35:59 CEST+0200", "meta": {"description": "Arizona’s Democratic Gov. Katie Hobbs vetoed state legislation that would have guaranteed religious exemptions to certain vaccines under Arizona law, including the Wuhan coronavirus (COVID-19) vaccine. The bill in question, Senate Bill 1250, would have required employers – including those in the healthcare industry – to offer exemptions to vaccine mandates for certain vaccines that […]", "lang": "en", "keywords": "Arizona,badhealth,badmedicine,big government,covid-19,democrats,freedom,health freedom,Katie Hobbs,Liberty,medical fascism,Medical Tyranny,religious exemptions,Suppressed,traitors,Vaccine exemptions,vaccine mandate,vaccine wars,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-04-07-hobbs-vetoes-bill-granting-covid-vaccine-exemptions.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "Arizona Gov. Katie Hobbs vetoes bill protecting employees from bosses who refuse to grant COVID-19 vaccine mandate exemptions", "cleaned_text": "Arizona Gov. Katie Hobbs vetoes bill protecting employees from bosses who refuse to grant COVID-19 vaccine mandate exemptions\n\nArizona's Democratic Gov. Katie Hobbs vetoed state legislation that would have guaranteed religious exemptions to certain vaccines under Arizona law , including the Wuhan coronavirus (COVID-19) vaccine.\n\nThe bill in question, Senate Bill 1250, would have required employers – including those in the healthcare industry – to offer exemptions to vaccine mandates for certain vaccines that also include those for influenza A or B and \"any vaccination authorized by the United States Food and Drug Administration for emergency use only.\" Employers that refuse to recognize exemptions for these vaccines can be punished with fines of up to $5,000. (Related: Recently passed New York state bills could pave way for future legislation mandating adult enrollment in state vaccination database.)\n\nState law already allows employees to refuse to take the COVID-19 vaccine based on deeply held religious convictions, but SB 1250 would have expanded this right to allow employees who were not afforded a chance to claim a religious exemption to file a case against their employer with the Attorney General's Office. The office could then launch an investigation into the matter.\n\nSB 1250 would have also expanded the exemptions employees could request to include moral or ethical objections to vaccinations.\n\nCurrent state regulations direct employers to provide \"reasonable accommodation\" for employees who ask for religious exemptions to vaccinations, including mandating mask-wearing, requiring employees to work remotely or moving them from parts of the office where there is a risk of contact with a vulnerable member of the workforce.\n\nSB 1250 was approved in both chambers of the Arizona Legislature with only Republican support.\n\nIn a letter to Arizona Senate President Warren Petersen, a Republican, Hobbs claimed that the bill was \"unnecessary\" because there were already existing federal laws that can protect employees who have deeply held religious convictions that prevent them from taking the COVID-19 vaccine.\n\nShe wrote: \"I have vetoed SB 1250. This bill is unnecessary, as legal protections for an employee's religious beliefs already exist in federal employment law. This bill also threatens employers with a civil penalty and a hefty fine, which could be devastating for Arizona's many small businesses. Let's work to find bipartisan solutions that promote the educated and healthy workforce that is essential for Arizona's economy.\"\n\nArizona Republicans strongly criticized Hobbs' decision to veto the bill. Sen. Janae Shamp noted that the bill would have given the state even more power to protect the rights of employees.\n\n\"And that's exactly what this bill was designed to do, and that is exactly why I am here – that is why I am an elected [senator] because I could no longer work because of what happened and there are many out there facing the same thing,\" she said. Shamp, is a former nurse who lost her job due to her refusal to get a COVID-19 vaccine.\n\n\"I spent my entire career as a nurse, being an advocate for my patients and ensuring that their beliefs are respected and protected. My top priority is this bill because during the pandemic, Americans' medical freedoms were taken from them, myself included,\" added Shamp. \"For me, the governor's veto is personal. Not just for me, but for every Arizonan who lost their job in the same manner.\"\n\nHobbs' claim of wanting to find \"bipartisan solutions\" to the problems affecting Arizonans is also disproven by the fact that the governor has already vetoed 19 bills submitted by the Arizona House and the Arizona Senate. This doesn't even include her veto of the state budget, which included vetoes for 13 measures within the budget.\n\nLearn more about COVID-19 vaccines and vaccine mandates in the U.S. at MedicalTyranny.com.\n\nWatch this episode of the \"Health Ranger Report\" as Mike Adams, the Health Ranger, talks to Ed Dowd about how around 7,500 Americans have died or become disabled every day after the implementation of COVID-19 vaccine mandates.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nJoselyn Berry, Arizona Gov. Katie Hobbs' press secretary, resigns after tweeting an image promoting more gun violence against \"transphobes.\"\n\nDr. Sam Sigoloff: The fight against vaccine mandates in the military continues.\n\nWATCHED: CDC purchased location data of 55M phone users to track them during COVID-19 lockdowns.\n\nCLAIM: Arizona's Democrat governor, Katie Hobbs, accused of taking bribes from Mexican cartel through complex real estate scheme.", "opengraph": {"article:published_time": "2023-04-07 22:01:21", "title": "Arizona Gov. Katie Hobbs vetoes bill protecting employees from bosses who refuse to grant COVID-19 vaccine mandate exemptions", "type": "article", "url": "https://www.newstarget.com/2023-04-07-hobbs-vetoes-bill-granting-covid-vaccine-exemptions.html", "site_name": "Newstarget.com", "description": "Arizona’s Democratic Gov. Katie Hobbs vetoed state legislation that would have guaranteed religious exemptions to certain vaccines under Arizona law, including the Wuhan coronavirus (COVID-19) vaccine. The bill in question, Senate Bill 1250, would have required employers – including those in the healthcare industry – to offer exemptions to vaccine mandates for certain vaccines that […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/04/Katie-Hobbs-Speech-Microphone.jpg"}, "tags": ["big government", "Katie Hobbs", "Liberty", "badhealth", "covid-19", "vaccine mandate", "vaccine wars", "Suppressed", "Medical Tyranny", "Vaccine exemptions", "medical fascism", "Arizona", "badmedicine", "vaccines", "democrats", "traitors", "freedom", "health freedom", "religious exemptions"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/arizona-gov-katie-hobbs-vetoes-bill-requiring-conscience-protections-for-covid-jab-mandates/", "https://kjzz.org/content/1842703/heres-list-all-arizona-bills-gov-katie-hobbs-has-vetoed-so-far", "https://www.brighteon.tv", "https://www.azmirror.com/blog/hobbs-vetoes-bills-punishing-businesses-for-denying-vaccine-exemptions-public-camping/", "https://www.naturalnews.com/2023-03-28-ny-bills-paving-way-adult-enrollment-vaccine-database.html", "//healthfreedom.news", "//MedicalTyranny.com", "https://www.brighteon.com/5219767b-aee8-4296-bdec-93ffa6c4bab1", "https://www.brighteon.com/channels/hrreport", "https://www.brighteon.com/channels/hrreport", "https://violence.news/2023-04-02-josselyn-berry-katie-hobbs-resigns-gun-violence.html", "https://healthfreedom.news/2023-03-31-sigoloff-fight-against-military-vaccine-mandates-continues.html", "https://vaccines.news/2023-03-26-court-blocks-biden-covid-jab-mandate-government.html", "https://www.naturalnews.com/2023-03-21-cdc-purchased-location-data-55m-cellphone-users.html", "https://corruption.news/2023-03-01-katie-hobbs-accused-taking-bribes-mexican-cartel.html", "https://www.lifesitenews.com/news/arizona-gov-katie-hobbs-vetoes-bill-requiring-conscience-protections-for-covid-jab-mandates/", "https://kjzz.org/content/1842703/heres-list-all-arizona-bills-gov-katie-hobbs-has-vetoed-so-far", "https://www.azmirror.com/blog/hobbs-vetoes-bills-punishing-businesses-for-denying-vaccine-exemptions-public-camping/", "https://www.brighteon.com/5219767b-aee8-4296-bdec-93ffa6c4bab1"], "authors": [], "publish_date": "2023-04-07 22:01:21"}