{"result_id": "223040", "URL": "https://www.newstarget.com/2023-03-19-german-health-minister-admits-covid-vaccines-harmful.html", "timestamp": "2023-04-25 16:35:56 CEST+0200", "meta": {"description": "Germany’s Federal Health Minister Karl Lauterbach, who is known for his aggressive promotion of mass vaccination and strict lockdown policies, recently admitted that the Wuhan coronavirus (COVID-19) vaccines were indeed linked to adverse side effects. Lauterbach, a politician of the Social Democratic Party of Germany (SPD), initially denied that COVID-19 vaccines had negative side effects back in […]", "lang": "en", "keywords": "adverse effects,adverse reactions,badhealth,badmedicine,badscience,Big Pharma,COVID,covid vaccines,deception,Germany,Karl Lauterbach,lies,pandemic,Paul Ehrlich Institute,propaganda,side effects,truth,vaccine injury,vaccine side effects,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-03-19-german-health-minister-admits-covid-vaccines-harmful.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "German health minister admits COVID-19 vaccines are HARMFUL after previously claiming they’re “free of side effects”", "cleaned_text": "German health minister admits COVID-19 vaccines are HARMFUL after previously claiming they’re “free of side effects”\n\nGermany's Federal Health Minister Karl Lauterbach, who is known for his aggressive promotion of mass vaccination and strict lockdown policies, recently admitted that the Wuhan coronavirus (COVID-19) vaccines were indeed linked to adverse side effects\n\nLauterbach, a politician of the Social Democratic Party of Germany (SPD), initially denied that COVID-19 vaccines had negative side effects back in the summer of 2021.\n\nGerman government data shows that more than 330,000 people in the country have COVID-19 vaccine-related injuries. Many of them include young people who have suffered severe side effects.\n\nIn an interview with public service broadcaster ZDF's \"Today Journal' on Sunday, March 12, Lauterbach said that one in every 10,000 vaccinated individuals suffer serious side effects. He added that the drugs for treating \"post-vac\" are not yet available. Worse, health insurance companies’ claims for coverage are very limited in Germany.\n\nAfter backtracking, Lauterbach was asked about a claim he made in a tweet in 2021. In his post, he said that vaccination was \"free of side effects.\"\n\nLauterbach then tried to change the topic by adding that it was an exaggeration he made in \"an unfortunate tweet.\" Still, the official is adamant that he did not see any failure on the part of the Ministry of Health. He also claimed that severe side effects due to the vaccines are rare.\n\n\"Severe vaccination damage, based on data from the Paul Ehrlich Institute or the European licensing authority, is on the order of less than one in 10,000 vaccinations. So it's not that vaccine damage is that common,\" said Lauterbach.\n\nGerman users took to social media to criticize Lauterbach. For example, University of Hanover professor Stefan Homburg called out Lauterbach for saying that he was \"all aware\" of the registered vaccination damage, yet he denied them and pushed for mass vaccination.\n\nPeople injured by vaccines are planning to sue manufacturers\n\nAccording to Welt news, people severely affected by COVID-19 vaccines are working together to sue vaccine manufacturers. However, the odds are often against those suffering vaccine injuries because manufacturers can often hide behind legal protections.\n\nMany of these victims, like 20-year-old Alina Adams, were perfectly healthy before getting vaccinated. Adams fell ill one day after getting the vaccine. Now, Adams is mostly confined to a wheelchair and has been diagnosed with \"post-vac syndrome.\"\n\nHomburg also challenged the official figures from Lauterbach, who claimed there was only one severe case in 10,000.\n\n\"At 1:10,000 Lauterbach downplays the risk of serious vaccine damage. His own ministry assumes 1:5,000 without unreported cases, which makes 1:1,250 with four doses,\" said Homburg.\n\nPeople are now calling for vaccine manufacturers to shoulder some of the financial burden among people experiencing adverse side effects because of COVID-19 vaccines. (Related: WHO whistleblower: Globalist puppets seek full control over humanity through deployment of COVID-19 pandemic treaty.)\n\nIn the interview, Lauterbach mentioned that he is calling for pharmaceutical companies to share in compensation for the victims.\n\nHe announced that he started a program with his ministry to investigate the consequences of \"Long Covid and Post Vac (vaccination damage)\" and to improve care for people suffering vaccine injuries.\n\nThe Paul Ehrlich Institute has received at least 333,492 suspected cases of adverse reactions and 50,833 suspected cases of severe adverse reactions \"after basic immunization plus booster vaccinations\" through December 2022. Severe side effects linked to COVID-19 vaccines include heart inflammation, neurological damage and paralysis.\n\nGo to VaccineInjurynews.com for more stories about vaccine-related injuries.\n\nWatch the video for more information about the side effects of COVID-19 vaccines.\n\nThis video is from the Tommy's Podcast channel on Brighteon.com.\n\nThe more vaccines a baby gets, the higher the likelihood of sudden death: STUDY.", "opengraph": {"article:published_time": "2023-03-19 12:07:14", "title": "German health minister admits COVID-19 vaccines are HARMFUL after previously claiming they’re “free of side effects”", "type": "article", "url": "https://www.newstarget.com/2023-03-19-german-health-minister-admits-covid-vaccines-harmful.html", "site_name": "Newstarget.com", "description": "Germany’s Federal Health Minister Karl Lauterbach, who is known for his aggressive promotion of mass vaccination and strict lockdown policies, recently admitted that the Wuhan coronavirus (COVID-19) vaccines were indeed linked to adverse side effects. Lauterbach, a politician of the Social Democratic Party of Germany (SPD), initially denied that COVID-19 vaccines had negative side effects back in […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/03/Doctor-Mask-Close-Up-Covid-19-Vial-Vaccine.jpg"}, "tags": ["pandemic", "Big Pharma", "badhealth", "COVID", "deception", "lies", "covid vaccines", "Paul Ehrlich Institute", "Karl Lauterbach", "truth", "vaccine side effects", "propaganda", "Germany", "adverse reactions", "adverse effects", "vaccine injury", "badmedicine", "vaccines", "side effects", "badscience"], "tweets": [], "movies": [], "links": ["https://rmx.news/germany/german-health-minister-now-admits-serious-side-effects-from-covid-19-vaccines-after-earlier-claiming-the-vaccines-were-free-from-side-effects/", "https://www.brighteon.tv", "https://www.uni-hannover.de/en/", "https://naturalnews.com/2023-01-26-globalists-seek-full-control-covid-pandemic-treaty.html", "https://todaytimeslive.com/world/240178.html", "https://vaccineinjurynews.com/", "https://www.brighteon.com/390faa43-2573-40c8-b306-07b7cf587c8f", "https://www.brighteon.com/channels/tommyspodcast", "https://naturalnews.com/2023-02-09-naomi-wolf-covid-vaccine-war-women-fertility.html", "https://naturalnews.com/2023-02-10-more-vaccines-baby-higher-likelihood-sudden-death.html", "https://naturalnews.com/2023-02-06-naomi-wolf-exposed-pfizer-illegal-vaccine-trial-childen.html", "https://rmx.news/germany/german-health-minister-now-admits-serious-side-effects-from-covid-19-vaccines-after-earlier-claiming-the-vaccines-were-free-from-side-effects/", "https://todaytimeslive.com/world/240178.html", "https://www.brighteon.com/390faa43-2573-40c8-b306-07b7cf587c8f"], "authors": [], "publish_date": "2023-03-19 12:07:14"}