{"result_id": "223027", "URL": "https://newstarget.com/2023-03-08-moderna-ceo-100k-covid-vaccines-manufactured-2019.html", "timestamp": "2023-04-25 16:35:48 CEST+0200", "meta": {"description": "Moderna CEO Stephane Bancel admitted during a talk with the World Economic Forum (WEF) that the company was already manufacturing Wuhan coronavirus (COVID-19) vaccines as early as 2019, months before the pandemic officially started. The admission occurred during a Jan. 19 panel session of the WEF 2023 conference in Davos, Switzerland, called “State of the Pandemic.” […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,conspiracy,covid-19,deception,honest,insanity,mainstream media,Moderna,news cartels,pandemic,pharmaceutical fraud,Plandemic,propaganda,Stephane Bancel,vaccine production,vaccine wars,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://newstarget.com/2023-03-08-moderna-ceo-100k-covid-vaccines-manufactured-2019.html", "encoding": "utf-8"}, "image": null, "domain": "newstarget.com", "title": "Moderna CEO Stephane Bancel admits company made 100K COVID-19 vaccine doses in 2019 before the pandemic even started", "cleaned_text": "Moderna CEO Stephane Bancel admits company made 100K COVID-19 vaccine doses in 2019 before the pandemic even started\n\nModerna CEO Stephane Bancel admitted during a talk with the World Economic Forum (WEF) that the company was already manufacturing Wuhan coronavirus (COVID-19) vaccines as early as 2019 , months before the pandemic officially started.\n\nThe admission occurred during a Jan. 19 panel session of the WEF 2023 conference in Davos, Switzerland, called \"State of the Pandemic.\"\n\nDuring the session, journalist Sasha Vakulina, who was moderating the panel, asked Bancel to discuss Moderna's vaccine development, adoption and scaling with regard to how the company responded to the rise of different coronavirus variants. In his answer, Bancel admitted that the company had already been manufacturing COVID-19 vaccines since 2019, months before the first cases reached Europe and North America.\n\n\"So the great news versus 2020, where we are today is that we have manufacturing capacity,\" said Bancel. \"When the pandemic happened, Moderna had made 100,000 doses in 2019 for the whole year.\" (Related: Moderna plans to release mRNA vaccines for other diseases, including cancer.)\n\nFurthermore, Bancel admitted that the company knew that there was going to be a global pandemic in 2020.\n\n\"And I remember walking into the office of my manufacturing and I say, 'How about we make a billion doses next year?'\" he added. \"And they look at me a bit funny and say, 'What?' And I say, 'Yeah, we need to make a billion dose next year, there's going to be a pandemic.'\"\n\nThe clip of Bancel's admission spread rapidly all over social media in the days and weeks following his statement. Kate Cronin, a spokesperson for Moderna, immediately claimed that it is \"totally incorrect\" to suggest that Bancel admitted to the company manufacturing COVID-19 vaccines in 2019.\n\nFurthermore, multiple mainstream media outlets have also come to the defense of the Big Pharma CEO, claiming his words were deliberately misinterpreted.\n\nSudiksha Kochi, writing for USA Today, claimed that Bancel never specifically said the company made 100,000 COVID-19 vaccines in 2019, writing: \"Moderna made approximately 100,000 vaccine doses in 2019 across all of the company's products.\"\n\nSophia Tulp, writing for the Associated Press, reiterated Kochi's claim, pointing out that transcripts of other interviews with Bancel show he has made similar remarks in the past that make it clear the 100,000 doses he mentioned to refers to all of the vaccines Moderna manufactured in 2019. Tulp further claims that people who shared the clip of Bancel were deliberately misconstruing his words.\n\n\"Social media users sharing this clip to suggest Bancel was admitting to predicting the pandemic, and preliminary producing vaccines, ignore the fact that he does not specify what kind of doses he's discussing when he mentions 2019 production,\" she claimed. \"Previous interviews with Bancel in which he makes nearly identical remarks also make clear that he's comparing 2019 doses of any kind of vaccine with the upgraded capacity put into place once the virus began rapidly spreading in early 2020.\"\n\nBut what media outlets fail to point out is that these previous statements from Bancel also show him admitting to developing COVID-19 vaccines before the pandemic.\n\nIn one appearance on CNBC in early January, journalist Rebecca Quick commented that in her last meeting with Bancel, during a WEF meeting in early 2020, the CEO admitted that Moderna was already working on a COVID-19 vaccine even though the disease at that point didn't even have a name yet.\n\n\"I remember … you were talking about how you had actually, you were working on a vaccine for COVID,\" said Quick. \"At that point, COVID-19 didn't even really exist in our minds.\"\n\n\"I think there was no name at that time,\" responded Bancel.\n\nFor more news about Big Pharma companies, visit BigPharmaNews.com.\n\nWatch the full clip from the World Economic Forum of Moderna CEO Stephane Bancel admitting to producing thousands of COVID-19 vaccine doses in 2019 before the pandemic even began.\n\nThis is from the GalacticStorm channel on Brighteon.com.\n\nModerna CEO Stephane Bancel brags to WEF attendees about predicting a \"billion dollar\" pandemic in 2019.\n\nCHURNING OUT DEATH: Moderna CEO wants mRNA vaccine factories on every continent.\n\nGREED PARADE: Moderna plans to sell COVID-19 vaccine for up to $130 per dose – more than 8 times its initial price of $15.25 per dose.\n\nModerna patented a 19-nucleotide sequence in 2013 that matches the most infectious sequence of SARS-CoV-2.\n\nModerna developing new mRNA injection to heal damaged hearts, after mRNA COVID vaccines cause heart damage.", "opengraph": {"article:published_time": "2023-03-08 21:42:44", "title": "Moderna CEO Stephane Bancel admits company made 100K COVID-19 vaccine doses in 2019 before the pandemic even started", "type": "article", "url": "https://www.newstarget.com/2023-03-08-moderna-ceo-100k-covid-vaccines-manufactured-2019.html", "site_name": "Newstarget.com", "description": "Moderna CEO Stephane Bancel admitted during a talk with the World Economic Forum (WEF) that the company was already manufacturing Wuhan coronavirus (COVID-19) vaccines as early as 2019, months before the pandemic officially started. The admission occurred during a Jan. 19 panel session of the WEF 2023 conference in Davos, Switzerland, called “State of the Pandemic.” […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/03/Lab-Tech-Vaccine-Vials-Covid-19.jpg"}, "tags": ["pandemic", "conspiracy", "vaccine production", "Big Pharma", "badhealth", "deception", "news cartels", "honest", "covid-19", "propaganda", "vaccine wars", "mainstream media", "insanity", "Stephane Bancel", "Moderna", "badmedicine", "vaccines", "Plandemic", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/52b9dc8c-3339-4846-9823-f4a4e94b1f75", "https://www.brighteon.tv", "//pandemic.news", "https://www.naturalnews.com/2023-01-30-moderna-to-release-mrna-vaccines-other-diseases.html", "https://www.usatoday.com/story/news/factcheck/2023/02/13/fact-check-post-misinterprets-moderna-ceo-comments-vaccine-supply/11219825002/", "https://apnews.com/article/fact-check-moderna-covid-stephane-bancel-298794971352", "https://www.thegatewaypundit.com/2023/01/must-see-cnbc-host-congratulates-moderna-ceo-developing-covid-vaccine-name-disease/", "https://bigpharmanews.com/", "https://www.brighteon.com/52b9dc8c-3339-4846-9823-f4a4e94b1f75", "https://www.brighteon.com/channels/galacticstorm", "https://www.brighteon.com/channels/galacticstorm", "https://bigpharmanews.com/2023-02-17-moderna-ceo-brags-wef-billion-dollar-pandemic.html", "https://pharmaceuticalfraud.com/2023-01-20-moderna-ceo-wants-mrna-factories-every-continent.html", "https://vaccines.news/2023-01-11-moderna-to-sell-covid-vaccine-8x-initial-price.html", "https://newstarget.com/2022-10-30-moderna-patented-19-nucleotide-sequence-in-2013-matches-covid-virus.html", "https://bigpharmanews.com/2022-10-19-moderna-developing-injection-to-heal-cardiac-damage.html", "https://www.brighteon.com/52b9dc8c-3339-4846-9823-f4a4e94b1f75", "https://www.usatoday.com/story/news/factcheck/2023/02/13/fact-check-post-misinterprets-moderna-ceo-comments-vaccine-supply/11219825002/", "https://apnews.com/article/fact-check-moderna-covid-stephane-bancel-298794971352", "https://www.thegatewaypundit.com/2023/01/must-see-cnbc-host-congratulates-moderna-ceo-developing-covid-vaccine-name-disease/"], "authors": [], "publish_date": "2023-03-08 21:42:44"}