{"result_id": "223007", "URL": "https://www.newstarget.com/2023-01-09-japan-orders-probe-covid-19-vaccine-deaths.html", "timestamp": "2023-04-25 16:35:36 CEST+0200", "meta": {"description": "The Japanese government has mobilized researchers to conduct a probe on the deaths caused by the Wuhan coronavirus (COVID-19) vaccines. NewsPunch‘s Baxter Dmitry reported that authorities in the East Asian country have instructed Japanese experts to investigate the mechanisms by which the experimental mRNA shots could be causing deaths and severe adverse reactions. As of […]", "lang": "en", "keywords": "badhealth,badmedicine,Blood clots,body temperatures,covid-19,depopulation,genocide,immune system,inflammation,Japan,Ministry of Health Labor and Welfare,pandemic,real investigations,SARS-CoV-2,Skin lesions,spike protein,vaccine,vaccine damage,Vaccine deaths,Vaccine injuries,vaccines,Wuhan coronavirus", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-01-09-japan-orders-probe-covid-19-vaccine-deaths.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "Japan orders probe of COVID-19 vaccine deaths", "cleaned_text": "The Japanese government has mobilized researchers to conduct a probe on the deaths caused by the Wuhan coronavirus (COVID-19) vaccines.\n\nNewsPunch's Baxter Dmitry reported that authorities in the East Asian country have instructed Japanese experts to investigate the mechanisms by which the experimental mRNA shots could be causing deaths and severe adverse reactions. As of writing, two researchers have come forward to share their findings.\n\nMasataka Nagao of Hiroshima University's School of Medicine highlighted how the bodies of vaccinated persons he autopsied with the help of police officers were abnormally warm. He said: \"The first concern was that the body temperatures of the corpses were very high.\" According to Nagao, the bodies he autopsied had temperatures between 33 and 34 C (91 to 93 F).\n\nOther bodies he examined had temperatures above normal, with one example measuring more than 40 C (104 F). Based on this, Nagao concluded that the COVID-19 mRNA vaccine causes immune system abnormalities that prompt inflammation throughout the body – causing the high temperatures.\n\nMeanwhile, dermatology expert Shigetoshi Sano of Kochi University's School of Medicine recounted finding SARS-CoV-2 spike proteins at the site of skin lesions on vaccinated patients.\n\n\"The spike protein derived from the vaccine was found in the skin,\" he told reporters. \"Spike proteins are locally suppressing the immune system. As a result, the spike proteins facilitate in reactivation of the herpes virus.\"\n\nAside from this, Sano remarked that the spike proteins also prompt inflammation that can lead to blood clots. \"Even worse, spike proteins can also locally induce inflammation,\" he continued.\n\n\"I don't know if I should say this, but it has been found that vaccinated people are more likely to get [COVID-19] than unvaccinated people. Sometimes, things that are not good are introduced into the human body. Vaccination may cause our overall immune system to fail to fight against such bad things.\"\n\nThe investigations conducted by Nagao and Sano followed a strong rebuke by Kyoto University professor emeritus Dr. Masanori Fukushima against the Japanese Ministry of Health, Labor and Welfare (MHLW) for refusing to stop the country's COVID-19 vaccination program.\n\n\"People are already doing research all over the world,\" he told authorities during a January 2023 conference. \"You have vaccinated so many people. And yet only 10 percent of the members of the MHLW – who are leading members of the vaccine campaign – have been vaccinated. Is this a joke?\"\n\nBack in November of last year, Fukushima expressed opposition to the COVID-19 vaccines during a conference convened by concerned citizen Kazuhisa Ukawa.\n\n\"Vaccine damage is now a global problem,\" the professor emeritus said. \"All those who have fallen ill after being vaccinated should not delay informing their medical institution. Don't be slow.\"\n\nFukushima continued: \"Given the wide range of adverse events, billions of lives could ultimately be in danger.\" Some of the serious reactions he mentioned were cardiovascular disease, autoimmune disease and susceptibility to infection. (Related: Japanese expert warns: COVID-19 injections endanger BILLIONS of lives.)\n\n\"Due to vaccination, natural immunity has been suppressed. This is what happened. I don't think it will subside at all; it will spread more and more,\" he said.\n\n\"Most people already have post-vaccination infections. The people who have the disease right now are not the ones who haven't been vaccinated, but the ones who have been vaccinated.\"\n\nHe then directed his words at MHLW: \"You spend trillions of yen importing [COVID-19 vaccines] and inciting the population [to get vaccinated]. In professional magazines, the misunderstanding has come to light and now it is understood how dangerous [these vaccines are].\n\nWatch Dr. Masanori Fukushima warn against the dangers COVID-19 vaccine below.\n\nThis video is from the In Search Of Truth channel on Brighteon.com.\n\nDr. Ryan Cole explains how the COVID vaccines compromise the immune system.\n\nDr. Ryan Cole: Spike protein in COVID shots can cause serious damage to arteries.", "opengraph": {"article:published_time": "2023-01-09 10:27:47", "title": "Japan orders probe of COVID-19 vaccine deaths", "type": "article", "url": "https://www.newstarget.com/2023-01-09-japan-orders-probe-covid-19-vaccine-deaths.html", "site_name": "Newstarget.com", "description": "The Japanese government has mobilized researchers to conduct a probe on the deaths caused by the Wuhan coronavirus (COVID-19) vaccines. NewsPunch‘s Baxter Dmitry reported that authorities in the East Asian country have instructed Japanese experts to investigate the mechanisms by which the experimental mRNA shots could be causing deaths and severe adverse reactions. As of […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/01/Coronavirus-Covid-19-Vaccine-Syringe-Lab.jpg"}, "tags": ["pandemic", "badhealth", "Vaccine injuries", "Japan", "covid-19", "Ministry of Health Labor and Welfare", "real investigations", "vaccine", "Skin lesions", "Blood clots", "spike protein", "immune system", "Wuhan coronavirus", "depopulation", "Vaccine deaths", "inflammation", "genocide", "body temperatures", "badmedicine", "vaccines", "SARS-CoV-2", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://newspunch.com/japan-orders-investigation-into-covid-vaccine-deaths-as-msm-admit-the-jabs-are-killing-us/", "https://www.brighteon.tv", "https://www.hiroshima-u.ac.jp/en", "https://www.kochi-u.ac.jp/english/", "https://www.kyoto-u.ac.jp/en", "https://www.shtfplan.com/headline-news/japanese-professor-warns-billions-of-lives-could-ultimately-be-in-danger", "https://www.naturalnews.com/2022-12-05-japanese-expert-covid-injections-endanger-billions-lives.html", "https://vaccinedeaths.com", "https://www.brighteon.com/7bab1f37-ad76-4e8f-bc21-f59c24b168dc", "https://www.brighteon.com/channels/insearchotruth", "https://immunesystem.news/2022-01-28-ryan-cole-covid-vaccines-compromise-immune-system.html", "https://pandemic.news/2022-12-08-dr-cole-spike-protein-seriously-damage-arteries.html", "https://vaccineinjurynews.com/2022-11-30-covid-vaccines-causing-blood-clots-says-hirschman.html", "https://vaccinedamage.news/2022-09-02-mrna-covid-spike-proteins-lesions-months-vaccination.html", "https://newspunch.com/japan-orders-investigation-into-covid-vaccine-deaths-as-msm-admit-the-jabs-are-killing-us/", "https://www.shtfplan.com/headline-news/japanese-professor-warns-billions-of-lives-could-ultimately-be-in-danger", "https://www.brighteon.com/7bab1f37-ad76-4e8f-bc21-f59c24b168dc"], "authors": [], "publish_date": "2023-01-09 10:27:47"}