{"result_id": "223041", "URL": "https://newstarget.com/2023-04-14-pfizer-cdc-behavior-change-project-vaccine-critics.html", "timestamp": "2023-04-25 16:35:57 CEST+0200", "meta": {"description": "A new report has shed fresh light on the connection between the Centers for Disease Control and Prevention (CDC), the Food and Drug Administration (FDA), and numerous private-sector drug, vaccine, and health care companies that have been working together to silence vaccine critics from speaking their minds. The Public Good Projects (PGP), as it is […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,behavior change,biased,CDC,Censored Science,conspiracy,Crybullies,deception,health freedom,Medical Tyranny,medical violence,Misinformation Response Unit,Pfizer,Public Good Projects,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://newstarget.com/2023-04-14-pfizer-cdc-behavior-change-project-vaccine-critics.html", "encoding": "utf-8"}, "image": null, "domain": "newstarget.com", "title": "Pfizer funded a CDC “behavior change” project that targeted vaccine critics with psyops", "cleaned_text": "The Public Good Projects (PGP), as it is benevolently dubbed, describes itself as a public health non-profit group centered around \"large-scale monitoring programs, social and behavior change interventions.\" The truth, though, is that it is a fascist public-private operation aimed at keeping a lid on the deadly truth about vaccines.\n\nPGP is little more than a mass censorship operation that, especially at the height of the Wuhan coronavirus (Covid-19) \"pandemic,\" kept itself busy de-platforming doctors and other medical specialists who tried to sound the alarm about the dangers of Fauci Flu shots.\n\nIn addition to the CDC and the FDA, other PGP partners include Kaiser Permanente, Rockefeller, and Humana, according to the Tennessee Department of Health, which identified these partners from the biography of PGP CEO Dr. Joe Smyser.\n\nPGP funding came not from lobbyists but directly from vaccine manufacturers like Pfizer and Moderna\n\nDeviating from the norm of receiving funding from industry lobbyists working on behalf of corporations, PGP's operating cash came directly from major industry players such as Pfizer and Moderna, both of which have a vested interest in stamping out so-called \"vaccine hesitancy.\"\n\nWhen people think for themselves, Pfizer and Moderna do not make money. So, they funneled gobs of cash into the PGP in an effort to keep people in the dark and the profits flowing.\n\nThe New York City Health Department's Misinformation Response Unit (MRU) also contributed to the PGP, which also operates an initiative called Shots Heard that is similar to the United Nations Verified Initiative, the Vaccine Confidence Project, and Team Halo.\n\nAll of these entities have the same goal of bullying and silencing voices like those of Dr. Mary Talley Bowden, a Stanford-educated doctor who found herself in the crosshairs when she questioned covid \"vaccines\" and promoted ivermectin on social media platforms like Twitter and TikTok.\n\nSocial media \"influencers\" like Zachary Rubin and Christina Kim, both members of Team Halo, called Bowden \"problematic\" while calling for her to be stripped of her medical license. They were also instrumental in getting Bowden suspended from her position at Houston Methodist Hospital.\n\n\"Over the following months, Bowden's life was thrown into chaos as multiple social media influencers targeted her,\" reads an article from the Houston Chronicle. \"However, the most dogged was a pharmacist named Savannah, who posts under the handle @rxOrcist.\"\n\nThis \"Savannah\" character is a member of Shots Heard, and she is even more vile than the others, having falsely accused Bowden of \"xenophobia and racism\" because she happened to mention that most of the anti-ivermectin pharmacists she spoke with were of Asian descent.\n\nBowden was ultimately axed from TikTok while YouTube suspended her account. She also received a litany of fake patient reviews on her career pages, which have negatively impacted her career – and she is unable to get them removed.\n\nIn a few instances, Bowden's office was also targeted and security had to get involved.\n\n\"Individual citizens must adopt a here but no further mentality and retaliate against their oppressors who cross the line knowing full well they may lose their lives in the process,\" one of our readers wrote about all this oppression. \"They can take our lives, but they can't take our freedom.\"\n\nMore of the latest news about the CDC's collusion with Big Pharma and the vaccine industry can be found at CDC.news.", "opengraph": {"article:published_time": "2023-04-14 12:20:31", "title": "Pfizer funded a CDC “behavior change” project that targeted vaccine critics with psyops", "type": "article", "url": "https://www.newstarget.com/2023-04-14-pfizer-cdc-behavior-change-project-vaccine-critics.html", "site_name": "Newstarget.com", "description": "A new report has shed fresh light on the connection between the Centers for Disease Control and Prevention (CDC), the Food and Drug Administration (FDA), and numerous private-sector drug, vaccine, and health care companies that have been working together to silence vaccine critics from speaking their minds. The Public Good Projects (PGP), as it is […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/04/Covid-19-Coronavirus-Pfizer-Vaccine-Vials.jpg"}, "tags": ["conspiracy", "Crybullies", "Misinformation Response Unit", "badhealth", "deception", "medical violence", "Public Good Projects", "badmedicine", "Medical Tyranny", "Pfizer", "behavior change", "vaccines", "biased", "badscience", "Censored Science", "health freedom", "CDC"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/cdc-behavior-change-project-targeted-vaccine-critics", "https://www.brighteon.tv", "//www.stanford.edu", "https://www.naturalnews.com/2023-03-16-vitality-project-stanford-big-tech-censorship-vaccine-injuries.html", "//cdc.news", "https://reclaimthenet.org/cdc-behavior-change-project-targeted-vaccine-critics", "https://www.naturalnews.com/2023-03-16-vitality-project-stanford-big-tech-censorship-vaccine-injuries.html"], "authors": [], "publish_date": "2023-04-14 12:20:31"}