{"result_id": "223036", "URL": "https://newstarget.com/2023-04-12-big-pharma-mrna-vaccines-cancer-heart-disease.html", "timestamp": "2023-04-25 16:35:54 CEST+0200", "meta": {"description": "The corporate-controlled media is leaping with joy over a new range of “vaccines” for conditions like cancer and heart disease that the pharmaceutical industry has slated to unleash by the year 2030. None other than Moderna, which had never successfully produced a single vaccine before being chosen by the Trump administration for inclusion in the […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,cancer,Dangerous Medicine,heart disease,Medical Tyranny,medical violence,mRNA,outbreak,pandemic,pharmaceutical fraud,Plague,rigged,vaccination,vaccine,vaccine wars,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://newstarget.com/2023-04-12-big-pharma-mrna-vaccines-cancer-heart-disease.html", "encoding": "utf-8"}, "image": null, "domain": "newstarget.com", "title": "Big Pharma says new mRNA “vaccines” for cancer and heart disease will be “ready by end of the decade”", "cleaned_text": "Big Pharma says new mRNA “vaccines” for cancer and heart disease will be “ready by end of the decade”\n\nThe corporate-controlled media is leaping with joy over a new range of \"vaccines\" for conditions like cancer and heart disease that the pharmaceutical industry has slated to unleash by the year 2030.\n\nNone other than Moderna, which had never successfully produced a single vaccine before being chosen by the Trump administration for inclusion in the Operation Warp Speed covid \"vaccine\" scam, is promising to release a slate of new messenger RNA (mRNA) injections for everything from cancer and cardiovascular disease to autoimmune disease and RSV (respiratory syncytial virus).\n\nThe experimental shots are already showing \"tremendous promise,\" the company claims. What would have normally taken around 15 years to produce has been \"unspooled\" to just 12-18 months, said Moderna chief medical officer Dr. Paul Burton.\n\nThanks to Trump's inclusion of the Moderna mRNA shot in Operation Warp Speed, the multi-billion-dollar company can now unleash all sorts of other new jabs on the same fast-tracked schedule. In as little as five years, Burton says, Moderna will have the ability to unleash new jabs for \"all sorts of disease areas.\"\n\n\"We will have that vaccine and it will be highly effective, and it will save many hundreds of thousands, if not millions of lives,\" Burton claims. \"I think we will be able to offer personalized cancer vaccines against multiple different tumor types to people around the world.\"\n\nModerna planning to unleash a multivalent mRNA jab for covid, the flu, and RSV – all in one just like MMR (measles, mumps, and rubella)\n\nMany rare diseases for which there are currently no viable, FDA-approved pharmaceuticals are targets for the Moderna mRNA \"vaccine\" pipeline.\n\n\"I think we will have mRNA-based therapies for rare diseases that were previously undruggable,\" Burton says.\n\n\"And I think that 10 years from now, we will be approaching a world where you truly can identify the genetic cause of a disease and, with relative simplicity, go and edit that out and repair it using mRNA-based technology.\"\n\nNot only that, but Moderna is planning to unleash a single multi-valent drug injection for covid, influenza, and RSV. It will be an all-in-one injection much like the MMR vaccine for measles, mumps, and rubella – except with experimental mRNA technology instead of traditional viral vector technology.\n\nIn order to make all this possible, Moderna needs a lot of cash, it says. High-level investments in these fast-tracked, warp speed shots are needed – but from those investments, a whole lot more cash will be generated when the shots are inevitably forced on the public to address the next scheduled \"pandemic.\"\n\nAll of this is about money and depopulation, of course. The rich drug cartel fat cats will pad their pockets while more families, including children, die from the \"side effects\" of these experimental injections. And the world will go on and on like this presumably indefinitely as people these days seem to not care at all about this mass genocide-for-profit taking place right in front of them.\n\n\"I think what we have learned in recent months is that if you ever thought that mRNA was just for infectious diseases, or just for covid, the evidence now is that that’s absolutely not the case,\" Burton further bragged about what his company plans to do now that its products have been mainstreamed through Operation Warp Speed.\n\n\"It can be applied to all sorts of disease areas; we are in cancer, infectious disease, cardiovascular disease, autoimmune diseases, rare disease. We have studies in all of those areas and they have all shown tremendous promise.\"\n\nMore of the latest news about Big Pharma's push to \"vaccinate\" the world for everything can be found at Vaccines.news.", "opengraph": {"article:published_time": "2023-04-12 11:31:19", "title": "Big Pharma says new mRNA “vaccines” for cancer and heart disease will be “ready by end of the decade”", "type": "article", "url": "https://www.newstarget.com/2023-04-12-big-pharma-mrna-vaccines-cancer-heart-disease.html", "site_name": "Newstarget.com", "description": "The corporate-controlled media is leaping with joy over a new range of “vaccines” for conditions like cancer and heart disease that the pharmaceutical industry has slated to unleash by the year 2030. None other than Moderna, which had never successfully produced a single vaccine before being chosen by the Trump administration for inclusion in the […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/04/Death-Holocaust-Vaccine-Syringe.jpg"}, "tags": ["pandemic", "vaccine wars", "vaccination", "cancer", "Big Pharma", "outbreak", "rigged", "badhealth", "vaccine", "medical violence", "badmedicine", "Medical Tyranny", "pharmaceutical fraud", "heart disease", "Plague", "vaccines", "mRNA", "Dangerous Medicine"], "tweets": [], "movies": [], "links": ["https://www.theguardian.com/society/2023/apr/07/cancer-and-heart-disease-vaccines-ready-by-end-of-the-decade", "https://www.brighteon.tv", "https://naturalnews.com/041988_GlaxoSmithKline_cancer_vaccine_clinical_trial_failure.html", "//vaccines.news", "https://www.theguardian.com/society/2023/apr/07/cancer-and-heart-disease-vaccines-ready-by-end-of-the-decade", "https://naturalnews.com/041988_GlaxoSmithKline_cancer_vaccine_clinical_trial_failure.html"], "authors": [], "publish_date": "2023-04-12 11:31:19"}