{"result_id": "223001", "URL": "https://www.newstarget.com/2023-01-20-moderna-ceo-wants-mrna-factories-every-continent.html", "timestamp": "2023-04-25 16:35:32 CEST+0200", "meta": {"description": "Moderna CEO Stephane Bancel expressed his desire to establish messenger RNA (mRNA) vaccine factories in every continent around the world. He voiced this out during the 2023 meeting of the globalist World Economic Forum (WEF) in Davos, Switzerland. Bancel joined Euronews Senior Business Editor Sasha Vakulina, European Research Council President Maria Leptin and Gavi, the […]", "lang": "en", "keywords": "badhealth,badmedicine,Bernie Sanders,Big Pharma,corruption,covid-19,Moderna,mRNA facility,mRNA vaccine,pandemic,Price gouging,Stephane Bancel,vaccine,vaccine factories,world economic forum,Wuhan coronavirus", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-01-20-moderna-ceo-wants-mrna-factories-every-continent.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "CHURNING OUT DEATH: Moderna CEO wants mRNA vaccine factories on every continent", "cleaned_text": "CHURNING OUT DEATH: Moderna CEO wants mRNA vaccine factories on every continent\n\nModerna CEO Stephane Bancel expressed his desire to establish messenger RNA (mRNA) vaccine factories in every continent around the world.\n\nHe voiced this out during the 2023 meeting of the globalist World Economic Forum (WEF) in Davos, Switzerland. Bancel joined Euronews Senior Business Editor Sasha Vakulina, European Research Council President Maria Leptin and Gavi, the Vaccine Alliance CEO Seth F. Berkley at the \"State of the Pandemic\" panel discussion held on Jan. 19.\n\n\"I would really like, on every continent, to have mRNA capacity,\" said the French-born Bancel. \"The amazing thing about mRNA is you can use the same facility, the same plant [and] the same machines to make any vaccine you want.\"\n\nThe pharmaceutical bigwig also mentioned that Moderna is moving forward with this plan.\n\n\"We are building a factory in Canada, [and] we already bought ground in the fall. We are building a factory in Australia. We are going to start a factory this quarter in the U.K., and we are also going to start building a factory in Kenya.\" (Related: Australia inks deal with Moderna to build vaccine facility.)\n\nBancel also lamented in the same panel that scientific and political debate were to blame for low Wuhan coronavirus (COVID-19) vaccination rates in some countries.\n\n\"In some countries, you saw scientific debates in national TV [on] prime time,\" he said. \"You can imagine how people were scared.\"\n\n\"[While there was] a lot of political debate in some countries, the U.S. was probably one of the worst places in the world. You saw the differences of countries where all the parties would say, 'You know, this has been approved by the regulators; clinical studies have been done; you should get your vaccines and so on.'\"\n\nThe Moderna CEO also pointed out the \"terrible\" role of social media and how it made things \"very hard for everybody.\"\n\n\"You had countries where you had scientific debate, political debate and social media. With those three things, the [vaccination] rate was very, very low.\"\n\nThis only means one thing: Big Pharma is losing in these debates.\n\nModerna wants to increase the price of its COVID-19 vaccine\n\nTo accomplish Bancel's vision of mRNA production facilities in every continent, Moderna needs a huge amount of money. One way for the company to obtain this huge funding is by increasing the price of its COVID-19 vaccines.\n\nA Jan. 9 report by the Wall Street Journal (WSJ) said the Cambridge, Massachusetts-based company is considering increasing the price per dose of its mRNA COVID-19 vaccine between $110 to $130. Bancel defended the plan during an interview at the 41st J.P. Morgan Healthcare Conference in San Francisco, saying: \"I would think this type of pricing is consistent with the value [provided by the vaccine].\"\n\nThe proposed price increase is more than four times the vaccine's price per dose as stipulated in the latest contract inked with the federal government.\n\nOriginally, the vaccine was priced at about $15 to $16 per dose. A later federal supply contract signed in July 2022 for updated bivalent booster shots increased this to about $26 per dose – amounting to a total of $1.74 billion for 66 million doses.\n\nAccording to the WSJ, sales of Moderna's COVID-19 vaccine are expected to decline despite the higher price. The company recorded about $18.4 billion in sales for the mRNA shot in 2022, but said it expects a minimum of $5 billion in sales for the vaccine in 2023.\n\nBut U.S. Sen. Bernie Sanders (I-VT) had none of it. The independent senator penned a letter to Bancel, denouncing Moderna's price gouging for its COVID-19 shot and asking it to halt any planned price hikes.\n\n\"You propose to make the vaccine unaffordable for the residents of this country who made the production of the vaccine possible,\" he wrote. \"That is not acceptable.\"\n\n\"In the midst of a continuing public health crisis and a growing federal deficit, [now] is not the time for Moderna to be quadrupling the price of this vaccine. Now is not the time for unacceptable corporate greed.\"\n\nVisit BigPharmaNews.com for more stories about Moderna.\n\nWatch this 7NEWS report about Moderna's mRNA facility in Australia.\n\nThis video is from the Alex Hammer channel on Brighteon.com.\n\nPfizer to sell COVID-19 vaccine at 10,000% markup over production cost in 2023.\n\nRomanian lawmaker GRILLS Big Pharma executives over lack of accountability for dangerous COVID-19 vaccines.\n\nGREED PARADE: Moderna plans to sell COVID-19 vaccine for up to $130 per dose – more than 8 times its initial price of $15.25 per dose.", "opengraph": {"article:published_time": "2023-01-20 11:22:20", "title": "CHURNING OUT DEATH: Moderna CEO wants mRNA vaccine factories on every continent", "type": "article", "url": "https://www.newstarget.com/2023-01-20-moderna-ceo-wants-mrna-factories-every-continent.html", "site_name": "Newstarget.com", "description": "Moderna CEO Stephane Bancel expressed his desire to establish messenger RNA (mRNA) vaccine factories in every continent around the world. He voiced this out during the 2023 meeting of the globalist World Economic Forum (WEF) in Davos, Switzerland. Bancel joined Euronews Senior Business Editor Sasha Vakulina, European Research Council President Maria Leptin and Gavi, the […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/01/Coronavirus-Covid-19-Vaccine-Production-Vials.jpg"}, "tags": ["pandemic", "Stephane Bancel", "covid-19", "world economic forum", "Wuhan coronavirus", "Big Pharma", "Moderna", "mRNA facility", "badhealth", "vaccine", "Price gouging", "Bernie Sanders", "badmedicine", "corruption", "mRNA vaccine", "vaccine factories"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/moderna-ceo-tells-world-economic-forum-he-wants-an-mrna-shot-factory-on-every-continent/", "https://www.brighteon.tv", "https://vaccines.news", "https://naturalnews.com/2021-12-17-moderna-to-build-vaccine-facility-australia.html", "https://www.lifesitenews.com/news/moderna-ceo-blames-scientifc-political-debate-for-low-covid-vaccination-rates/", "https://www.wsj.com/articles/moderna-considers-price-of-110-130-for-covid-19-vaccine-11673289609", "https://www.theepochtimes.com/health/moderna-considers-hiking-covid-vaccine-price-to-130-per-dose-report-says_4974416.html", "https://bigpharmanews.com/", "https://www.brighteon.com/a00545d0-fbd9-4187-bcd0-e3a3264eee11", "https://www.brighteon.com/channels/alexhammer", "https://pandemic.news/2021-08-19-bofa-analyst-dubs-moderna-stock-price-ridiculous.html", "https://rigged.news/2020-06-02-moderna-stock-surge-illustrates-pump-dump-scam.html", "https://bigpharmanews.com/2022-10-25-pfizer-covid-vaccine-10000-percent-markup-2023.html", "https://biggovernment.news/2022-09-09-romanian-lawmaker-grills-big-pharma-execs-vaccines.html", "https://pandemic.news/2023-01-11-moderna-to-sell-covid-vaccine-8x-initial-price.html", "https://www.lifesitenews.com/news/moderna-ceo-tells-world-economic-forum-he-wants-an-mrna-shot-factory-on-every-continent/", "https://www.lifesitenews.com/news/moderna-ceo-blames-scientifc-political-debate-for-low-covid-vaccination-rates/", "https://www.wsj.com/articles/moderna-considers-price-of-110-130-for-covid-19-vaccine-11673289609", "https://www.theepochtimes.com/health/moderna-considers-hiking-covid-vaccine-price-to-130-per-dose-report-says_4974416.html", "https://www.brighteon.com/a00545d0-fbd9-4187-bcd0-e3a3264eee11"], "authors": [], "publish_date": "2023-01-20 11:22:20"}