{"result_id": "223028", "URL": "https://www.newstarget.com/2023-01-09-covid-vaccine-injuries-deaths-collapsing-civilization-dowd.html", "timestamp": "2023-04-25 16:35:49 CEST+0200", "meta": {"description": "The years 2021 and 2022 were a really bad time to be employed. The reason is because the establishment forced hundreds of millions of people to get “vaccinated” for covid, resulting in ever-increasing rates of serious injury, disability, and death among the fully jabbed. Ex-executive at BlackRock and Wall Street guru Edward Dowd spoke about […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,chemical violence,Collapse,COVID,Dangerous Medicine,disability,economy,Ed Dowd,pandemic,pharmaceutical fraud,spike protein,vaccine damage,Vaccine deaths,vaccine injury,vaccine wars,vaccines", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-01-09-covid-vaccine-injuries-deaths-collapsing-civilization-dowd.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "Covid “vaccine” injuries and deaths are collapsing civilization: WATCH as Ed Dowd and Mike Adams discuss", "cleaned_text": "Covid “vaccine” injuries and deaths are collapsing civilization: WATCH as Ed Dowd and Mike Adams discuss\n\nThe years 2021 and 2022 were a really bad time to be employed. The reason is because the establishment forced hundreds of millions of people to get \"vaccinated\" for covid, resulting in ever-increasing rates of serious injury, disability, and death among the fully jabbed.\n\nEx-executive at BlackRock and Wall Street guru Edward Dowd spoke about this and more in a recent interview on the \"Health Ranger Report,\" revealing to Mike Adams some of what he expects to happen next.\n\nDowd recently wrote a book called \"'Cause Unknown:' The Epidemic of Sudden Deaths in 2021 and 2022,\" foreword by Robert F. Kennedy Jr. and afterword by Gavin De Becker. This book expounds upon what Dowd told Adams during their latest discourse, which you can watch below:\n\n\"We're in the middle of a fraud and coverup so we continue to do the work,\" Dowd explained about his efforts to get the word out about the mass genocide taking place under the guise of mass \"vaccination.\"\n\n\"It's the greatest asymmetric information gap in my lifetime, meaning 10-15 percent of us know exactly what's going on, the damage that's been done, how deadly these vaccines are, and the rest of the population is oblivious.\" (Related: Back in February, Dowd warned that the global debt bubble has reached its peak, calling it \"the end.\")\n\nWorking-age people are becoming disabled at an ever-accelerating rate thanks to covid injections\n\nDowd told Adams that it was \"detrimental to your health\" to be employed over the past couple of years. Ever since Donald Trump launched Operation Warp Speed, tens of millions of Americans, and hundreds of millions of people around the world, were forced, many against their will, to get injected for covid.\n\nThe result of this mass jabbing effort has been the widespread destruction of health, particularly among working-age people who were the most-targeted demographic for jabbing.\n\n\"It's been detrimental to your health to be employed in 2021 and 2022,\" Dowd said.\n\nIt took a few months for the damage to really start becoming noticeable. Particularly in February 2021, just two months after the launch of Operation Warp Speed, disabilities really started to accelerate. Then, come May, it accelerated even further.\n\nIn a normal year, disabilities trend at around 29-30 million new cases. By September 2022, that figure ballooned to 33.2 million people, according to Dowd's investigatory work, this representing a three-standard deviation event, or three-sigma, which has only a 0.03 percent of occurring at any given time.\n\nAccording to the latest data Dowd was able to procure, the general population has seen about an 11 percent increase in disabilities ever since covid jabs were unleashed. Among working-age people, that figure is an astounding 26 percent, or more than double that of the general population.\n\nSince employed people tend to be healthier than unemployed people due to age or health limitations, one might assume that these figures should be switched. But keep in mind that employed people are the ones who were told that, in order to remain employed, they needed to get jabbed for covid.\n\nAs the shots continue to do their damage to people's immune systems, ultimately killing many if not most of them in the coming years, the economy as we currently know it will fail. As demand plummets and supply chains crumble, the old world order will fall, soon to be replaced by the new.\n\nDowd and Adams discuss what all this will entail as well, along with so much more that you will not want to miss. Be sure to watch the full video above and check out Dowd's book if these topics are of interest to you.\n\nThe latest news about covid injection injuries and deaths can be found at ChemicalViolence.com.", "opengraph": {"article:published_time": "2023-01-09 23:37:30", "title": "Covid “vaccine” injuries and deaths are collapsing civilization: WATCH as Ed Dowd and Mike Adams discuss", "type": "article", "url": "https://www.newstarget.com/2023-01-09-covid-vaccine-injuries-deaths-collapsing-civilization-dowd.html", "site_name": "Newstarget.com", "description": "The years 2021 and 2022 were a really bad time to be employed. The reason is because the establishment forced hundreds of millions of people to get “vaccinated” for covid, resulting in ever-increasing rates of serious injury, disability, and death among the fully jabbed. Ex-executive at BlackRock and Wall Street guru Edward Dowd spoke about […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/01/Disaster-Insurance-Fire-Apocalypse-Business-Collapse-Crisis.jpg"}, "tags": ["pandemic", "Big Pharma", "badhealth", "COVID", "disability", "biological weapon", "spike protein", "chemical violence", "Ed Dowd", "vaccine wars", "economy", "pharmaceutical fraud", "Dangerous Medicine", "Vaccine deaths", "Collapse", "vaccine injury", "badmedicine", "vaccines", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.brighteon.tv", "https://www.brighteon.com/5d8c7046-3c45-4026-846b-c8565c8bbc0d", "https://naturalnews.com/2022-02-02-edward-dowd-blackrock-global-debt-bubble-peak.html", "//chemicalviolence.com", "https://www.brighteon.com/5d8c7046-3c45-4026-846b-c8565c8bbc0d", "https://naturalnews.com/2022-02-02-edward-dowd-blackrock-global-debt-bubble-peak.html"], "authors": [], "publish_date": "2023-01-09 23:37:30"}