{"result_id": "223047", "URL": "https://newstarget.com/2023-04-13-mass-vaccinations-mandates-reasons-behind-excess-deaths.html", "timestamp": "2023-04-25 16:36:00 CEST+0200", "meta": {"description": "The Wuhan coronavirus (COVID-19) mass vaccinations and vaccine mandates are the primary reasons behind excess deaths, financial analyst Ed Dowd told host Ann Vandersteel during the April 6 episode of “Right Now with Ann Vandersteel” on Brighteon.TV. Americans saw a 40 percent higher death rate in people aged 18 to 64 during last two quarters of 2021 compared […]", "lang": "en", "keywords": "America,Ann Vandersteel,badhealth,badmedicine,badscience,biological weapon,Brighteon.tv,covid-19,covid-19 vaccines,Dangerous Medicine,depopulation,Ed Dowd,excess deaths,excess mortality,genocide,pandemic,spike protein,truth,Vaccine deaths,vaccine mandate,vaccines,Wuhan coronavirus", "favicon": "Images/favicon.ico", "canonical": "https://newstarget.com/2023-04-13-mass-vaccinations-mandates-reasons-behind-excess-deaths.html", "encoding": "utf-8"}, "image": null, "domain": "newstarget.com", "title": "COVID-19 mass vaccinations, vaccine mandates are primary reasons behind excess deaths, Ed Dowd tells Ann Vandersteel – Brighteon.TV", "cleaned_text": "The Wuhan coronavirus (COVID-19) mass vaccinations and vaccine mandates are the primary reasons behind excess deaths , financial analyst Ed Dowd told host Ann Vandersteel during the April 6 episode of \"Right Now with Ann Vandersteel\" on Brighteon.TV\n\nAmericans saw a 40 percent higher death rate in people aged 18 to 64 during last two quarters of 2021 compared to the same period the previous year. \"We're seeing right now the highest death rates we've ever seen in the history of this business,\" Scott Davison, the CEO of life insurance and retirement company OneAmerica, said in January last year.\n\nFor context, the first COVID-19 vaccine to get an emergency authorization from the Food and Drug Administration was Pfizer's on December 11, 2020. It's safe to say that the massive spike in excess deaths happened months after the rollout of COVID-19 vaccines.\n\nDowd said an industry report came out in August last year from the Society of Actuaries showing that companies saw over 40 percent more claims from group life policyholders in 2021. Group life insurance policies are a type of life insurance that covers an entire group of people under one contract. Typically, these policies cover employees of a company. (Related: Trail of death: Latest actuarial data connects excess deaths to covid vaccine mandates.)\n\n\"That happened in 2021, and the general U.S. population saw 32 percent excess mortality. So, 40 versus 32, eight points higher in this group life policyholder subset of our population. What you need to know about that is that does not happen. It's usually the other way around,\" Dowd said.\n\nThe Society of Actuaries noted that group life policyholders die at one-third the rate of the general American population in recent years – but that flipped in 2021.\n\nDowd blamed the mass vaccination program and vaccine mandates for it. He added that the excess mortality in the said age group is still running around 23 to 25 percent, particularly among millennials. He told Wisconsin Senator Ron Johnson that the country's employed population has experienced the worst health outcomes following the vaccine rollout.\n\nThere were about 30 million disabled people in America prior to the COVID-19 pandemic, and this went up to 33.2 million by September 2022 – with 1.7 million of them employed. Dowd noted that employed disability rate increased by 31 percent.\n\nIt was not normal as employed individuals are supposed to be the healthiest in the population because they get to work and have access to the best health care available. Dowd called for an investigation to figure out why these things are happening.\n\n\"This is a sad and cruel joke on humanity. And these crimes have been perpetrated by sick and evil people,\" Vandersteel said.\n\nDowd agreed, adding that people need to go to jail for it. The financial analyst said their data, which is based on conservative numbers, shows an estimated 300,000 excess deaths in America directly related to COVID-19 vaccines.\n\nHis group estimates that the total damage caused by COVID-19 vaccines in 2022 alone was $150 billion, including $5.2 billion in lost wages. Dowd also noted that the worktime lost is worth around $89 billion to the U.S. economy.\n\nThese figures, he said, were reflected in the loss of worktime data over the past two years.\n\nOf course, some sectors thrived over that same period. Dowd said Pfizer earned $7.1 billion and Moderna $4.4 billion for a total of $11.5 billion in vaccine revenues last year.\n\nFollow Vaccines.news for more stories about COVID-19 vaccines.\n\nWatch the April 6 episode of \"Right Now with Ann Vandersteel\" below. \"Right Now with Ann Vandersteel\" airs weekdays at 8 p.m. on Brighteon.TV.\n\nCDC report shows 40 percent increase in excess deaths among Americans ages 18 to 49.\n\nExhaustive peer-reviewed study says MILLIONS worldwide now suffer from serious health problems caused by covid “vaccines.”\n\nNOT the virus: Deaths among teens and 20-somethings soar following COVID \"vaccine\" release.\n\nMore Covid vaccine negative effects and coverups are emerging.", "opengraph": {"article:published_time": "2023-04-13 07:36:42", "title": "COVID-19 mass vaccinations, vaccine mandates are primary reasons behind excess deaths, Ed Dowd tells Ann Vandersteel – Brighteon.TV", "type": "article", "url": "https://www.newstarget.com/2023-04-13-mass-vaccinations-mandates-reasons-behind-excess-deaths.html", "site_name": "Newstarget.com", "description": "The Wuhan coronavirus (COVID-19) mass vaccinations and vaccine mandates are the primary reasons behind excess deaths, financial analyst Ed Dowd told host Ann Vandersteel during the April 6 episode of “Right Now with Ann Vandersteel” on Brighteon.TV. Americans saw a 40 percent higher death rate in people aged 18 to 64 during last two quarters of 2021 compared […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/04/Coronavirus-Covid-19-Nurse-Vaccine-Vial.jpg"}, "tags": ["pandemic", "excess mortality", "badhealth", "covid-19 vaccines", "biological weapon", "covid-19", "Brighteon.tv", "vaccine mandate", "spike protein", "truth", "Ed Dowd", "America", "Wuhan coronavirus", "depopulation", "Dangerous Medicine", "excess deaths", "Vaccine deaths", "genocide", "badmedicine", "vaccines", "Ann Vandersteel", "badscience"], "tweets": [], "movies": [], "links": ["//www.brighteon.com/a14ee9e5-97ff-4e2b-bc74-746f1049871e", "https://brighteon.tv/", "https://www.brighteon.tv", "https://www.wfyi.org/news/articles/insurance-death-rates-working-age-people-up-40-percent", "//vaccineholocaust.org", "https://naturalnews.com/2022-08-26-actuarial-data-trail-of-death-covid-vaccine-mandates.html", "//vaccines.news", "//www.brighteon.com/a14ee9e5-97ff-4e2b-bc74-746f1049871e", "https://brighteon.tv/", "https://naturalnews.com/2022-03-18-excess-deaths-mount-covid-vaccine-rollouts-mandates.html", "https://naturalnews.com/2022-01-24-increase-in-excess-deaths-among-americans.html", "https://www.vaccines.news/2023-03-06-study-millions-health-problems-covid-vaccines.html", "https://naturalnews.com/2022-11-01-deaths-young-soar-following-covid-vaccine-rollout.html", "https://naturalnews.com/2022-05-25-covid-vaccine-negative-effects-coverups-emerging.html", "https://www.brighteon.com/a14ee9e5-97ff-4e2b-bc74-746f1049871e", "https://www.wfyi.org/news/articles/insurance-death-rates-working-age-people-up-40-percent"], "authors": [], "publish_date": "2023-04-13 07:36:42"}