{"result_id": "223016", "URL": "https://newstarget.com/2022-12-16-covid-jabs-cause-4800-percent-increase-vax-deaths.html", "timestamp": "2023-04-25 16:35:41 CEST+0200", "meta": {"description": "On December 7, 2022, U.S. Senator Ron Johnson (R-Wis) headed up an expert panel to discuss the latest data on covid-19 vaccines. The panel discussed what covid-19 vaccines actually are, how they work in the human body, and how they “could possibly cause injuries.” Senator Johnson was joined by several medical professionals who are standing […]", "lang": "en", "keywords": "badhealth,badmedicine,cardiotoxin,CDC,crimes against humanity,Death by vaccine,depopulation,excess mortality,FDA,grand jury,hospitalizations,medical error,medical fraud,medical malpractice,medical violence,mortality rates,Open Vaers,ron johnson,Suppressed,V-safe data,vaccine death,vaccine injury,vaccine wars,vaccines,wrongful death", "favicon": "Images/favicon.ico", "canonical": "https://newstarget.com/2022-12-16-covid-jabs-cause-4800-percent-increase-vax-deaths.html", "encoding": "utf-8"}, "image": null, "domain": "newstarget.com", "title": "Shocking data show a 4,800% increase in US vax deaths, hundreds of thousands of hospitalizations from covid-19 jabs", "cleaned_text": "Shocking data show a 4,800% increase in US vax deaths, hundreds of thousands of hospitalizations from covid-19 jabs\n\nOn December 7, 2022, U.S. Senator Ron Johnson (R-Wis) headed up an expert panel to discuss the latest data on covid-19 vaccines . The panel discussed what covid-19 vaccines actually are, how they work in the human body, and how they “could possibly cause injuries.” Senator Johnson was joined by several medical professionals who are standing up to the corrupt establishment. They include: Dr. Peter McCullough, Dr. Pierre Kory, Dr. Paul Marik, Dr. Robert Malone, Dr. Harvey Risch, Dr. David Wiseman, Dr. Jim Thorp, Dr. Jancy Lindsay, Dr. Paul Alexander, Dr. Kirk Milhoan, Dr. Renata Moon, and Dr. Ryan Cole. The expert panel also featured the founders of REACT19 Brianne Dressen and Dr. Joel Wallskog, the founder of Open Vaers Liz Willner, Edward Dowd, Josh Sterling, ICAN attorney Aaron Siri, and Lt. Col. Theresa Long, who originally helped blow the whistle on catastrophic vaccine injuries in the military.\n\nSenator Johnson also invited the CEOs of Pfizer and Moderna and the heads of the federal agencies, but everyone who developed, promoted, and pushed the covid-19 vaccines declined Johnson’s invite, ignoring all data on vaccine injury and death.\n\nCovid jab causes shocking 4800% increase in vax deaths and 2,876% increase in hospitalizations\n\nWillner was the first to testify. As the founder of Open Vaers, Willner gathered all publicly available data on vaccine injury and death collected by pharmacovigilance systems setup by the Centers for Disease Control (CDC) and the Food and Drug Administration (FDA). According to the data, there has been a 4800% increase in vax deaths since the covid-19 vaccines were rolled out on December 14, 2020. Additionally, there has been a 2,876% increase in hospitalizations, a 2,050% increase in permanent disabilities, and a 1,108% increase in life-threatening events. The CDC and FDA refuse to acknowledge the data within the very pharmacovigilance systems that were setup to monitor vaccine injury and death in the American population.\n\nDr. Milhoan, a pediatric cardiologist, explained how these covid-19 vaccines force the body to produce a cardiotoxin that “causes the heart to be inflamed.” “Let that sink in,” Milhoan said. “The current public health plan is asking our own body to make a cardiotoxin.”\n\nDr. Thorp, an obstetrician and maternal-fetal medicine specialist is disturbed by the overwhelming number of adverse events that occur in his vaccinated patients. During the vaccine rollout, he noticed an alarming increase in stillbirths and miscarriages.\n\nCDC knew that the covid jab would cause myocarditis but hid this adverse event from the public\n\nNext, ICAN attorney Aaron Siri discussed how the CDC knew that the covid-19 vaccines caused myocarditis, but concealed the reality in their V-safe system. Siri filed a Freedom of Information Act request to obtain data from the CDC’s V-safe system. According to the documents, the CDC knew that the vaccines would cause a host of injuries, including myocarditis. However, the CDC did not include “myocarditis” in the list of “check the box options” for adverse events that vaccine injured patients could report.\n\nThe V-safe data includes reports from approximately ten million people. Of the ten million people reporting, 800,000 individuals (7.7%) needed medical care after being inoculated with covid-19 vaccines. Of those who sought medical care, 25% required medical attention from the ER, with additional hospitalization. Another 40% of the vaccine injured needed urgent care. Approximately 25% of the vaccine injured were unable to perform every day activities and could not attend work or school. Obtaining this data was not easy. Siri said it took one and half years and two federal lawsuits to force these federal agencies to disclose the data.\n\nEdward Dowd presented data from the Society of Actuaries 2021 Group Life Insurance. The data shows a spike in excess mortality for young and middle-aged adults, only after the covid-19 vaccines were mandated on them. Sterling, a Wall Street insurance analyst, presented all cause mortality by age. Americans who took one dose of the covid-19 vaccine were disproportionately harmed. Not only did they have to discontinue the vaccination program, but they suffered through a 145% higher mortality over the year and half follow-up period.\n\nThe expert panel continues to be ignored and vilified by the corporate media and the federal government. The CDC, FDA and other government officials who coerced the public to take the so-called vaccine all bear responsibility for causing mass medical fraud, medical malpractice, and wrongful death. Hopefully, it won't be long before these corrupt, mass murdering government agencies are forced to appear before a grand jury.", "opengraph": {"article:published_time": "2022-12-17 09:49:19", "title": "Shocking data show a 4,800% increase in US vax deaths, hundreds of thousands of hospitalizations from covid-19 jabs", "type": "article", "url": "https://www.newstarget.com/2022-12-16-covid-jabs-cause-4800-percent-increase-vax-deaths.html", "site_name": "Newstarget.com", "description": "On December 7, 2022, U.S. Senator Ron Johnson (R-Wis) headed up an expert panel to discuss the latest data on covid-19 vaccines. The panel discussed what covid-19 vaccines actually are, how they work in the human body, and how they “could possibly cause injuries.” Senator Johnson was joined by several medical professionals who are standing […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2022/12/Death-Holocaust-Vaccine-Syringe.jpg"}, "tags": ["cardiotoxin", "medical fraud", "excess mortality", "badhealth", "FDA", "medical violence", "CDC", "wrongful death", "ron johnson", "Open Vaers", "grand jury", "vaccine wars", "V-safe data", "Death by vaccine", "Suppressed", "depopulation", "medical error", "medical malpractice", "crimes against humanity", "mortality rates", "vaccine injury", "hospitalizations", "badmedicine", "vaccines", "vaccine death"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/6517a2bf-3b72-45b5-ae16-29b45190af86", "https://naturalnews.com/2022-03-21-military-doctor-ordered-to-suppress-vaccine-injuries.html", "https://www.brighteon.tv", "//vaccineholocaust.org", "https://openvaers.com/", "https://www.theepochtimes.com/4-takeaways-from-sen-johnsons-panel-on-covid-19-vaccines_4910155.html", "//abortions.news", "https://naturalnews.com/2022-12-12-senator-johnsons-round-table-shock-vaccinated-26-higher-mortality-rate.html", "//vaccines.news", "https://www.naturalnews.com/2022-12-14-desantis-state-sc-grand-jury-coronavirus-vaccine-probe.html", "https://www.brighteon.com/6517a2bf-3b72-45b5-ae16-29b45190af86", "https://naturalnews.com/2022-03-21-military-doctor-ordered-to-suppress-vaccine-injuries.html", "https://openvaers.com/", "https://www.theepochtimes.com/4-takeaways-from-sen-johnsons-panel-on-covid-19-vaccines_4910155.html", "https://naturalnews.com/2022-12-12-senator-johnsons-round-table-shock-vaccinated-26-higher-mortality-rate.html", "https://www.naturalnews.com/2022-12-14-desantis-state-sc-grand-jury-coronavirus-vaccine-probe.html"], "authors": [], "publish_date": "2022-12-17 09:49:19"}