{"result_id": "223054", "URL": "https://newstarget.com/2023-03-30-biden-officials-pressured-censor-vaccine-skeptics.html", "timestamp": "2023-04-25 16:36:04 CEST+0200", "meta": {"description": "New emails have revealed how the Biden administration pressured Facebook to censor the private messages of vaccine skeptics on their WhatsApp messaging service. The emails, which were obtained in discovery in a multi-state lawsuit accusing the administration of colluding with tech firms to suppress people’s First Amendment rights, showed how Biden’s Director of Digital Strategy, […]", "lang": "en", "keywords": "Biden,big government,Big Tech,Censorship,conspiracy,Facebook,First Amendment,freedom of speech,Glitch,Government Slaves,health freedom,meta,privacy watch,speech police,Suppressed,tech giants,technocrats,thought police,Tyranny,vaccine skeptics,vaccine wars,vaccines,WhatsApp,White House", "favicon": "Images/favicon.ico", "canonical": "https://newstarget.com/2023-03-30-biden-officials-pressured-censor-vaccine-skeptics.html", "encoding": "utf-8"}, "image": null, "domain": "newstarget.com", "title": "Biden administration officials pressured Meta to censor private WhatsApp messages of COVID-19 vaccine skeptics", "cleaned_text": "New emails have revealed how the Biden administration pressured Facebook to censor the private messages of vaccine skeptics on their WhatsApp messaging service.\n\nThe emails, which were obtained in discovery in a multi-state lawsuit accusing the administration of colluding with tech firms to suppress people’s First Amendment rights, showed how Biden’s Director of Digital Strategy, Rob Flaherty, tried to convince Facebook executives to censor Americans’ speech on the platform.\n\nIn response to Flaherty's pressure, a representative from Meta, the company that owns Facebook and WhatsApp, told the White House that it had been making moves to limit virality on WhatsApp overall, which it said should prevent so-called misinformation from making its way to a broader audience. They explained that they were using approaches such as labeling message forwards and limiting them based on the belief that messages that do not come from a person’s close contacts are more likely to contain misinformation.\n\nThis was apparently not enough for Flaherty, who pressed on in his attempt to get them to stop what he termed “vaccine-skeptical content.”\n\nHe wrote: “I care mostly about what actions and changes you’re making to ensure you’re not making our country’s vaccine hesitancy problem worse.\n\n“I still don’t have a good, empirical answer on how effective you’ve been at reducing the spread of vaccine-skeptical content and misinformation to vaccine fence sitters.”\n\nFlaherty added that they needed a “good mousetrap” to observe the encrypted content being shared by users on the platform.\n\nBiden administration appeared desperate to stop people from expressing concerns about vaccines\n\nIt is not clear whether Facebook gave into these demands, but the exchange does illustrate the extreme lengths the Biden administration was willing to go to censor people’s private messages. It is worth noting that censoring the private messages of Americans would also require monitoring them.\n\nIt wouldn’t be the first time Meta/Facebook caved to governmental pressure; their WhatsApp service banned more than 100,000 accounts in the leadup to the 2018 Brazilian presidential election in response to stories that supporters of the populist candidate Jair Bolsonaro were using it to spread “misinformation.”\n\nWhatsApp is an encrypted direct messaging platform, and nine out of ten messages sent are between two individuals; groups on the platform generally have fewer than 10 people. A Meta executive explained to Flaherty that they cannot see the content of the messages on the platform but described actions they had taken to help stem the spread of misinformation.\n\n“The labels (‘forwarded’; and ‘forwarded many times’ if the message has been forwarded five times or more) are intended to prompt people to stop and think when they are reading a message and before they forward something, which may not be accurate. The forward limits (no more than five chats at time; one chat a time for highly forwarded messages), are intended to reduce their spread,” he noted.\n\nThe executive added that after introducing these limits early in the pandemic, highly forwarded messages decreased by 70 percent on a global basis. However, he said that not all forwards contain misinformation.\n\nFlaherty and a White House Covid-19 adviser, Andrew Slavitt, had been pressuring executives at Meta to act against what they claimed was COVID-19 misinformation on the grounds that it could lead to vaccine hesitancy – even if what the individuals involved were saying was actually true. Many Americans pushed back against the aggressive tactics used by the Biden administration to force them to get the vaccine, including through mandates. Now, it is clearer than ever that the Biden administration was desperate to force Americans to get the vaccine, even if it meant violating protected freedoms.", "opengraph": {"article:published_time": "2023-03-30 09:48:36", "title": "Biden administration officials pressured Meta to censor private WhatsApp messages of COVID-19 vaccine skeptics", "type": "article", "url": "https://www.newstarget.com/2023-03-30-biden-officials-pressured-censor-vaccine-skeptics.html", "site_name": "Newstarget.com", "description": "New emails have revealed how the Biden administration pressured Facebook to censor the private messages of vaccine skeptics on their WhatsApp messaging service. The emails, which were obtained in discovery in a multi-state lawsuit accusing the administration of colluding with tech firms to suppress people’s First Amendment rights, showed how Biden’s Director of Digital Strategy, […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/03/Censorship-Censored-Freedom-Tape-Mouth.jpg"}, "tags": ["conspiracy", "vaccine skeptics", "big government", "WhatsApp", "speech police", "privacy watch", "White House", "technocrats", "Biden", "First Amendment", "Big Tech", "vaccine wars", "freedom of speech", "tech giants", "Suppressed", "thought police", "Facebook", "Glitch", "Tyranny", "Government Slaves", "Censorship", "vaccines", "meta", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.brighteon.tv", "https://www.breitbart.com/tech/2023/03/24/biden-white-house-pressured-facebook-to-censor-vaccine-skeptics-on-private-messaging-service-whatsapp/", "https://www.foxnews.com/media/biden-white-house-urged-meta-crack-down-vaccine-skeptical-content-whatsapp-private-chat-platform", "https://censorship.news/", "https://www.breitbart.com/tech/2023/03/24/biden-white-house-pressured-facebook-to-censor-vaccine-skeptics-on-private-messaging-service-whatsapp/", "https://www.foxnews.com/media/biden-white-house-urged-meta-crack-down-vaccine-skeptical-content-whatsapp-private-chat-platform"], "authors": [], "publish_date": "2023-03-30 09:48:36"}