{"result_id": "223024", "URL": "https://www.newstarget.com/2021-11-23-study-finds-covid-vaccines-increase-average-death-totals.html", "timestamp": "2023-04-25 16:35:47 CEST+0200", "meta": {"description": "A Swedish study involving four million people raises several red flags concerning covid vaccines and death rates. The preprint paper took a closer look at real world vaccine effectiveness. The study revealed three main issues. The paper found that the vaccine doesn’t offer protection at all. Its so-called protection plunged significantly after six months, even […]", "lang": "en", "keywords": "adverse events,badhealth,badmedicine,badscience,Big Pharma,bioweapon,Dangerous Medicine,discoveries,immune depletion,immune system,pharmaceutical fraud,research,spike protein,Vaccine deaths,vaccines", "favicon": "wp-content/themes/Newstarget/Images/favicon.ico", "canonical": "https://www.newstarget.com/2021-11-23-study-finds-covid-vaccines-increase-average-death-totals.html", "encoding": null}, "image": null, "domain": "www.newstarget.com", "title": "Swedish study finds that covid vaccines deplete the immune system, INCREASE all-cause mortality by 20%", "cleaned_text": "Swedish study finds that covid vaccines deplete the immune system, INCREASE all-cause mortality by 20%\n\nA Swedish study involving four million people raises several red flags concerning covid vaccines and death rates. The preprint paper took a closer look at real world vaccine effectiveness. The study revealed three main issues. The paper found that the vaccine doesn’t offer protection at all. Its so-called protection plunged significantly after six months, even for severe cases of COVID-19. The study doesn’t just show that vaccine effectiveness is waning. It shows that the protection is a fallacy altogether. The study concluded that those who are vaccinated are more likely to be infected and suffer severe disease than people who aren’t vaccinated.\n\nCovid jabs accelerate death totals in two-week follow-up period after the second dose\n\nThe study also found that excess deaths from all causes are rising in Sweden, like in most countries, but the study did not examine these excess deaths. Finally, the study found a total of 3,939 deaths out of 4.03 million people who were given two doses of the experimental vaccine. These deaths occurred within two weeks after the person received their second covid shot. This data shows that people are dying at a rate 20 percent higher than normal in the two-week follow-up period after their second shot.\n\nWhen the data is extrapolated over an entire year, the annual mortality rate in Sweden can be expected to rise by three times its average magnitude! In a typical year, about 1 in 115 Swedish citizens pass away. In a population that is poisoned and degraded by covid shots, that mortality rate could realistically rise by 2.5 percent over the next year. The new mortality rate could be approximately 1 in 40 people going into the new year. The only confounding factor that could skew these numbers in the coming year is the young, healthy population that won’t get vaccinated.\n\nAccording to the all-cause Swedish mortality data from 2015 to 2019, there is an average of 3,300 deaths every two weeks for a population of roughly 10.6 million. This takes into account the entire population, and the data generally stays the same from year to year.\n\nWhen these numbers are compared to a 2021 cohort of fully vaccinated people, it appears that the vaccines are increasing the all-cause mortality rate by 20 percent. There was a total of 3,939 deaths in a two-week period following vaccination. If the vaccines are saving lives, then the mortality rate after vaccination should be negligible, not equal or even greater than the average mortality rate for all cause deaths. This is a medical travesty! The Swedish people who are receiving two vaccines in a 4 million people cohort are accounting for every single death and then some in a two-week follow-up period.\n\nCovid jabs make people more susceptible to infection and DEATH — a reality that can no longer be suppressed\n\nLet this Swedish data sink in: Even if the vaccines had no effect on the death rate, there would be around 3,300 deaths every two weeks in the 4.03 million cohort. There should not be more deaths than that because the entire country of Sweden does not have more deaths than that in this same time period. This fact is made more troubling considering that the baseline number for the vaccinated group should not even be 3,300 deaths. Under average circumstances, a large slice of these deaths would include unvaccinated people in the remaining 6.6 million population. The baseline number for the vaccinated is actually lower than 3,300 under the best circumstances. So, the 20 percent increase in death post-vaccination is a generous and conservative observation of the data.\n\nSo how do the vaccine manufacturers and the government explain away this data? People are dying at an alarming rate post-vaccination and their protection against covid also turns out to be a FARCE just months later. How will the ensuing destruction of individual immunity also affect the death rate in the years to come?", "opengraph": {"image": "https://www.newstarget.com/wp-content/uploads/sites/43/2021/11/Vaccine-Vial-Bottles-Covid-19.jpg", "article:published_time": "2021-11-23 10:52:50", "title": "Swedish study finds that covid vaccines deplete the immune system, INCREASE all-cause mortality by 20%", "type": "article", "url": "https://www.newstarget.com/2021-11-23-study-finds-covid-vaccines-increase-average-death-totals.html", "site_name": "Newstarget.com", "description": "A Swedish study involving four million people raises several red flags concerning covid vaccines and death rates. The preprint paper took a closer look at real world vaccine effectiveness. The study revealed three main issues. The paper found that the vaccine doesn’t offer protection at all. Its so-called protection plunged significantly after six months, even […]"}, "tags": ["Big Pharma", "Vaccine deaths", "research", "badhealth", "immune depletion", "adverse events", "badmedicine", "pharmaceutical fraud", "spike protein", "vaccines", "bioweapon", "immune system", "badscience", "discoveries", "Dangerous Medicine"], "tweets": [], "movies": [], "links": ["https://alexberenson.substack.com/p/another-major-red-flag-about-covid", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410", "https://www.brighteon.tv", "https://www.scb.se/en/finding-statistics/statistics-by-subject-area/population/population-composition/population-statistics/", "//vaccines.news", "https://alexberenson.substack.com/p/another-major-red-flag-about-covid", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410", "https://www.scb.se/en/finding-statistics/statistics-by-subject-area/population/population-composition/population-statistics/", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.newstarget.com/2021-11-23-study-finds-covid-vaccines-increase-average-death-totals.html&linkname=Swedish%20study%20finds%20that%20covid%20vaccines%20deplete%20the%20immune%20system%2C%20INCREASE%20all-cause%20mortality%20by%2020%25", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2021-11-23 10:52:50"}