{"result_id": "223043", "URL": "https://www.newstarget.com/2023-01-06-covid-vaccine-safety-skeptics-branded-as-criminals.html", "timestamp": "2023-04-25 16:35:58 CEST+0200", "meta": {"description": "Pfizer CEO Albert Bourla has branded people who he claims spread “misinformation” about the safety of the Wuhan coronavirus (COVID-19) vaccines as “criminals” responsible for the loss of “millions of lives.” The head of the New York-based vaccine manufacturer claimed there is a “very small” group of people that purposefully circulate misinformation on the injections. […]", "lang": "en", "keywords": "Albert Bourla,badhealth,badmedicine,Big Pharma,corruption,covid-19,criminals,deception,European Parliament,Janine Small,lies,medical fascism,misinformation,pandemic,Pfizer,pharmaceutical fraud,propaganda,special committee,testimony,vaccine,vaccine safety,vaccine wars,Wuhan coronavirus", "favicon": "Images/favicon.ico", "canonical": "https://www.newstarget.com/2023-01-06-covid-vaccine-safety-skeptics-branded-as-criminals.html", "encoding": "utf-8"}, "image": null, "domain": "www.newstarget.com", "title": "Look who’s talking: Skeptics of COVID-19 vaccine safety branded “criminals” by nefarious Pfizer CEO", "cleaned_text": "Look who’s talking: Skeptics of COVID-19 vaccine safety branded “criminals” by nefarious Pfizer CEO\n\nPfizer CEO Albert Bourla has branded people who he claims spread \"misinformation\" about the safety of the Wuhan coronavirus (COVID-19) vaccines as \"criminals\" responsible for the loss of \"millions of lives.\"\n\nThe head of the New York-based vaccine manufacturer claimed there is a \"very small\" group of people that purposefully circulate misinformation on the injections. This, he added, further misleads those already hesitant about getting the shot.\n\n\"Those people are criminals,\" Bourla told Atlantic Council CEO Frederick Kempe back in November 2021. \"They're not bad people, [but] they're criminals because they have literally cost millions of lives.\"\n\nPublic health experts blame \"misinformation\" for millions of American adults refusing the COVID-19 shots, even though most of the doses have been available to most Americans and they are eligible for them.\n\nBourla claimed in the same interview that many people's lives can go \"back to normal\" once the unvaccinated get injected with the COVID-19 vaccine. \"The only thing that stands between the new way of life and the current way of life is, frankly, hesitancy to vaccinations,\" he said.\n\nAs per a Kaiser Family Foundation survey, more than three-quarters of adults either believe or aren't sure about at least one of eight \"false statements about COVID-19 or the vaccines,\" with unvaccinated adults and Republicans among those most likely to hold misconceptions.\n\nThe Greek-born Bourla declined to testify before the European Parliament's Special Committee on the COVID-19 Pandemic for the second time. (Related: Pfizer CEO backs out of testifying at EU Parliament after reports of backdoor dealings with European Commission president.)\n\nA Dec. 2 letter from the Pfizer CEO seen by POLITICO stated: \"Since the October COVID hearing, we have no further information to share with the committee, so [we] respectfully decline the invitation to again revisit these issues.\" Bourla earlier pulled out of a planned testimony before the committee in October 2022, which would involve tough questions from lawmakers about how secretive vaccine deals were struck.\n\nThe Pfizer CEO's decision to not show up followed an audit report into the European Union's vaccine procurement strategy. Following the report, new questions were raised about the multibillion-euro vaccine contract inked by Bourla and European Commission President Ursula von der Leyen. The drug executive testing positive for COVID-19 a second time, despite being fully vaccinated and boosted, also played a factor in his refusal to testify.\n\nPfizer International Development Markets President Janine Small took the stand in place of Bourla. According to the company, Small \"has been identified as best placed to support the committee in meeting their objectives.\" But the committee deemed Small's answers as lacking, leading to a second invitation for Bourla sent Oct. 28.\n\nMeanwhile, Pfizer confirmed in a statement to the Associated Press that Bourla is still serving as the pharmaceutical company's chairman and CEO. Recent reports alleged that Bourla is resigning from his post.\n\n\"Albert Bourla continues to serve as the chairman and CEO of Pfizer. Any claims to the contrary are false. The COVID-19 vaccine continues to be safe and effective for protection against severe disease and hospitalization,\" the company said in an email.\n\nBigPharmaNews.com has more news about Pfizer.\n\nWatch Pfizer CEO Albert Bourla admit to the presence of mRNA in other vaccines, aside from those for COVID-19.\n\nThis video is from the TIME WE HAVE LEFT channel on Brighteon.com.\n\nPfizer CEO, conman Albert Bourla tests positive for covid-19 again, after being sick throughout August.\n\nCLOWN SCIENCE: Pfizer and Moderna to self-investigate their own covid jabs for heart risks.\n\nFirst RSV emergency declared as Pfizer and GSK race to get vaccines approved.\n\nStudy finds possible link between Pfizer’s COVID-19 vaccine and myocarditis in children.", "opengraph": {"article:published_time": "2023-01-06 23:06:40", "title": "Look who’s talking: Skeptics of COVID-19 vaccine safety branded “criminals” by nefarious Pfizer CEO", "type": "article", "url": "https://www.newstarget.com/2023-01-06-covid-vaccine-safety-skeptics-branded-as-criminals.html", "site_name": "Newstarget.com", "description": "Pfizer CEO Albert Bourla has branded people who he claims spread “misinformation” about the safety of the Wuhan coronavirus (COVID-19) vaccines as “criminals” responsible for the loss of “millions of lives.” The head of the New York-based vaccine manufacturer claimed there is a “very small” group of people that purposefully circulate misinformation on the injections. […]", "image": "https://www.newstarget.com/wp-content/uploads/sites/43/2023/01/Covid-19-Coronavirus-Pfizer-Vaccine-Vials.jpg"}, "tags": ["pandemic", "Big Pharma", "badhealth", "deception", "criminals", "Pfizer", "lies", "corruption", "covid-19", "vaccine", "Wuhan coronavirus", "propaganda", "misinformation", "vaccine wars", "European Parliament", "vaccine safety", "Albert Bourla", "testimony", "medical fascism", "Janine Small", "badmedicine", "special committee", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.cnbc.com/2021/11/09/covid-vaccines-pfizer-ceo-says-people-who-spread-misinformation-on-shots-are-criminals.html", "https://www.brighteon.tv", "https://www.kff.org/coronavirus-covid-19/poll-finding/kff-covid-19-vaccine-monitor-media-and-misinformation/", "https://naturalnews.com/2022-10-04-pfizer-ceo-backs-out-testifying-eu-parliament.html", "https://www.politico.eu/article/pfizer-coronavirus-albert-bourla-europea-union-refuses-testify/", "https://newspunch.com/after-reports-of-secretive-vaccine-deals-pfizer-ceo-pulls-out-of-testifing-at-eu-parliament/", "https://apnews.com/article/fact-check-Pfizer-CEO-Albert-Bourla-903298293295", "https://bigpharmanews.com/", "https://www.brighteon.com/ead31091-8370-4847-809d-d8b35f13f983", "https://www.brighteon.com/channels/motherlode11", "https://naturalnews.com/2022-10-02-pfizer-ceo-bourla-tests-positive-for-covid-19-again.html", "https://vaccineinjurynews.com/2022-11-16-pfizer-moderna-self-investigate-covid-jabs-myocarditis.html", "https://vaccines.news/2022-11-09-first-rsv-emergency-declared-pfizer-gsk-race-vaccines.html", "https://badmedicine.news/2022-11-10-study-pfizer-covid-vaccine-myocarditis-in-children.html", "https://www.cnbc.com/2021/11/09/covid-vaccines-pfizer-ceo-says-people-who-spread-misinformation-on-shots-are-criminals.html", "https://www.kff.org/coronavirus-covid-19/poll-finding/kff-covid-19-vaccine-monitor-media-and-misinformation/", "https://www.politico.eu/article/pfizer-coronavirus-albert-bourla-europea-union-refuses-testify/", "https://newspunch.com/after-reports-of-secretive-vaccine-deals-pfizer-ceo-pulls-out-of-testifing-at-eu-parliament/", "https://apnews.com/article/fact-check-Pfizer-CEO-Albert-Bourla-903298293295", "https://www.brighteon.com/ead31091-8370-4847-809d-d8b35f13f983"], "authors": [], "publish_date": "2023-01-06 23:06:40"}