{"result_id": "225038", "URL": "https://blog.nomorefakenews.com/2022/02/23/another-article-too-hot-to-handle-even-vaccine-critics-wont-run-with-it/", "timestamp": "2023-04-25 16:37:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2022/02/23/another-article-too-hot-to-handle-even-vaccine-critics-wont-run-with-it/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Another article too hot to handle; even vaccine critics won’t run with it « Jon Rappoport's Blog", "cleaned_text": "A few days ago — in my article The Test for Klaus Schwab and the World Economic Forum, I republished my proof that the medical cartel has been routinely killing millions of people, with its treatments, for at least the past 20 years.\n\nAnd when I say proof, I’m talking about clear mainstream research.\n\nVirtually no one has taken those research citations and run with them, despite the fact that I’ve highlighted them for years. I’ve highlighted them in articles and interviews.\n\nApparently, even many “alternative” journalists and doctors are keeping a piece of their souls in the official prison of fake medicine and fake science. On purpose.\n\nThey want to hedge their bets. They want to go halfway, but not all the way.\n\nThey want to admit some things, but not other things.\n\nSo today, I’m posting another one of my “too hot to handle” pieces. I’ve published this article at least four times. Even doctors who oppose the COVID vaccines won’t pick up on it.\n\nIt’s too REAL, because it proves the RNA injections were DESIGNED to fail, to be useless, from the get-go.\n\nAnd if you expose THAT, you burn the whole house down.\n\nNo one will believe anything the establishment says about vaccines. Nor should they.\n\nAnd many journalists and doctors of all stripes want to “protect the public” from THE TRUTH.\n\nI don’t want to bury the truth. I’m not settling for half.\n\nI wrote and posted this piece while the clinical trials of the COVID vaccine were in progress. It reveals how and why those trials were constructed and designed to fail. They did fail.\n\nThe vaccine makers DESIGNED a series of clinical trials that, even on their own terms (“the virus is real, fear the virus”) were destined to be a complete flop.\n\nPeter Doshi, associate editor of the medical journal BMJ, and Eric Topol, Scripps Research professor of molecular medicine, have written a devastating NY Times opinion piece about the ongoing COVID vaccine clinical trials.\n\nThey expose the fatal flaw in the large Pfizer, AstraZeneca, and Moderna trials.\n\nSeptember 22, 2020, the Times: “These Coronavirus Trials Don’t Answer the One Question We Need to Know” (also, here):\n\n“If you were to approve a coronavirus vaccine, would you approve one that you only knew protected people only from the most mild form of Covid-19, or one that would prevent its serious complications?”\n\n“The answer is obvious. You would want to protect against the worst cases.”\n\n“But that’s not how the companies testing three of the leading coronavirus vaccine candidates, Moderna, Pfizer and AstraZeneca, whose U.S. trial is on hold, are approaching the problem.”\n\n“According to the protocols for their studies, which they released late last week, a vaccine could meet the companies’ benchmark for success if it lowered the risk of mild Covid-19, but was never shown to reduce moderate or severe forms of the disease, or the risk of hospitalization, admissions to the intensive care unit or death.”\n\nBOOM. THE CLINICAL TRIALS WERE NOT DESIGNED TO SHOW THE VACCINE COULD PREVENT SERIOUS ILLNESS. OR HOSPITALIZATION. OR DEATH.\n\nThe Times: “To say a vaccine works should mean that most people no longer run the risk of getting seriously sick. That’s not what these trials will determine.”\n\nThis means these clinical trials are dead in the water.\n\nAnd I could stop this article right here and walk away. Done. Finished. Nothing more need be said.\n\nAnd you the reader could walk away. OK, done. The clinical trials of the vaccine were never intended to prevent serious illness of any kind. Never intended to prevent hospitalizations or deaths. End of story.\n\nGoodbye. Forget the vaccine. Why would anyone want to take it?\n\nBut if you want to know WHY the clinical trials were designed this way, and HOW the con was played, and why it was actually necessary to design the clinical trials to be useless, read on.\n\nThe whole vaccine house is ALREADY burned down, but I’m going to say a lot more. I’m going to burn the ashes.\n\nFirst of all, make sure you understand the clinical trials of the RNA vaccines were only designed to show effectiveness in preventing “mild cases of COVID,” which nobody should care about, because mild cases (cough, fever, chills) naturally run their course and cause no harm. THERE IS NO NEED FOR A VACCINE THAT PREVENTS MILD CASES.\n\nNow let’s go deeper. Read the next section from the Times piece, and then I’ll make comments.\n\n“The Moderna and AstraZeneca studies will involve about 30,000 participants each; Pfizer’s will have 44,000. Half the participants will receive two doses of vaccines separated by three or four weeks, and the other half will receive saltwater placebo shots. The final determination of efficacy will occur after 150 to 160 participants develop Covid-19…”\n\nNow pay close attention. Here’s how it works. The vaccine companies are looking for a total of 150 mild COVID cases to occur, combined, in the two groups— those receiving the placebo and those receiving the vaccine. How would that happen? The researchers believe “the coronavirus is spreading everywhere” and it will pounce on some of the volunteers during the clinical trial.\n\nLet’s say that, during the trial, 100 people receiving the placebo develop mild COVID-19 (cough, chills, fever), and only 50 people receiving the vaccine develop mild COVID.\n\nThe vaccine companies would say, “We just proved the vaccine is 50% effective in preventing COVID, and that’s all we need to do, in order to win emergency authorization from the FDA. Release the vaccine. Inject the world.”\n\nThe outcomes for ONLY 150 people equal “let’s shoot up seven billion people.”\n\nBut it gets even worse. The magic number of 150 COVID cases? How is a COVID case defined? The authors of the Times piece have the answer:\n\n“In the Moderna and Pfizer trials, even a mild case of Covid-19 — for instance, a cough plus a positive lab test — would qualify and muddy the results. AstraZeneca is slightly more stringent but would still count mild symptoms like a cough plus fever as a case.”\n\nBut wait. The NY Times itself recently published an article stating that up to 90% of US COVID cases could very well be false positives—in other words, not cases at all. Why? Because the diagnostic PCR test, as it is performed by labs, is too sensitive. It registers “positive for COVID” when it shouldn’t.\n\nSo, in these vaccine clinical trials, the whole process of determining that “150 people developed COVID-19” is completely unreliable, useless, absurd, and nonsensical.\n\nOn the one hand, a positive PCR test is unreliable and means nothing. On the other hand, a cough and fever (“mild COVID”) are nothing to worry about, and don’t require a vaccine at all. We’re talking about 150 cases of “who cares.” That’s what the COVID vaccine is DESIGNED to prevent.\n\n“So, Doctor, the magic number is 150 ‘who cares’ mild cases? That’s the number that will decide the immediate fate of the planet?”\n\n“And these 150 people, who you say develop mild COVID-19…no one should care, because those symptoms cure themselves, and no vaccine is needed.”\n\n“And come to think of it, the people receiving the vaccine in the clinical trials could develop symptoms indistinguishable from mild COVID-19, as a result of the effects of the vaccine.”\n\n“But you’re very confident in the success of the vaccine.”\n\n“I have to be confident. If we’re exposed as incompetent frauds, our bottom line will take a huge hit. And we’ll wind up in prison.”\n\nNow I’m going to go over the vital information again, but this time I’m going to show you how…\n\nThe vaccine companies can use the fatal flaw in their protocol design to…\n\nActually win approval of their COVID vaccine.\n\nStick with me. This is big.\n\nOnly 150 people are needed to make the major clinical trials of a COVID vaccine look like a success.\n\nOut of 30,000 volunteers in a trial, researchers are waiting for 150 people to “come down with COVID-19.” MILD cases. They assume this will happen because they believe the coronavirus is everywhere, and it’ll infect some of their volunteers.\n\nOf course, their definition of a mild case of COVID-19 is meaningless. Cough plus fever, and a positive PCR test. The test spits out false positives like a rigged slot machine, and the visible mild symptoms could result from flu, polluted air, or too many candy bars.\n\nNevertheless, the researchers are waiting for a total of 150 people to “catch a mild case of COVID.” When that number is reached, everything stops.\n\nNow comes the big moment. How many of those 150 COVID cases occurred in the group that received the vaccine, and how many in the group that received the placebo shot of salt water?\n\nLet’s say only 50 COVID cases occurred in the vaccine group, and 100 in the placebo group. The researchers pop champagne corks. They say, “Look, the vaccine is 50% effective at preventing COVID, and that’s all we need to win emergency authorization from the FDA.”\n\nBUT suppose 75 cases occurred in the vaccine group and 75 in the placebo group? No good. No good at all. No way to call the vaccine effective.\n\nNow comes the “reshaping of the data.”\n\nHERE WE GO.\n\nThe researchers say, “Wait. Thirty of the COVID cases in the vaccine group were REALLY just adverse reactions to the vaccine. They weren’t cases of COVID. You see, the vaccine can cause symptoms that are indistinguishable from mild COVID. Cough, fever, chills. ACTUALLY, there were only 30 cases of COVID in the vaccine group. There were 75 in the placebo group. That’s good enough. The vaccine IS effective. We’re golden. We can get emergency authorization from the FDA right now to shoot up everybody.”\n\nVaccine manufacturers HAVE KNOWN ALL ALONG that they could pull this trick.\n\nWhy risk a few hundred billion dollars of profit on a random distribution of mild COVID cases among the volunteers in their clinical trials?\n\nThe definition of a mild COVID case is EXACTLY what the vaccine manufacturers needed. It enabled them to hatch a plan, to make sure they didn’t fail.\n\nThey could pawn off a MILD case of COVID as a reaction to the vaccine. They could fake that without causing ripples. The FDA would say, “The vaccine reactions aren’t serious. All right, no problem. We’ll approve this vaccine for emergency use.”\n\nHowever…If the manufacturers designed their clinical trial protocol to prevent serious cases of COVID—-very serious pneumonia—then first of all, they would be waiting to see 150 cases of really sick people to occur among the volunteers.\n\nThat might never happen. In 100 years.\n\nAnd second, if it did happen, and the manufacturers had to pull their devious switcheroo trick and blame the vaccine for some of these SERIOUS cases…\n\nThey would have to tell the FDA that their vaccine was causing life-threatening pneumonia; and the FDA, under a lot of scrutiny these days, would find it very difficult to overlook that.\n\nFDA: “We can’t approve this vaccine. It could cause a few million cases of dire pneumonia…”\n\nThe vaccine companies didn’t make a titanic stupid mistake in their protocol design. In gearing the protocol to prevent MILD COVID cases, they did what they did on purpose. It allows them to “reshape their data” and win FDA emergency approval for their vaccine.\n\nThese companies have no intention of failing, starting over, and spending a year recruiting 30,000 new volunteers. They want success and money now. They want to win the race.\n\nAnd they will win, if the truth isn’t known and shared widely.\n\nEvery “expert,” in August 2021, is instructed to say the vaccine is definitely protecting people against severe illness and hospitalization. This is their promotional message to the world.\n\n“Yes, even if you’re vaccinated, you could become infected with the virus, you could develop COVID, and you could pass the virus to other people, BUT you must take the shot. It will protect you from becoming severely ill.”\n\nAs you can see from what I’ve written above, this is a straight-out lie.\n\nIt was always a fantastic lie, from the beginning of COVID vaccine development, because the design of the clinical trials had nothing to do with preventing serious illness.\n\nOK, we’re back in the present now; 2022. Everything you’ve just read has been studiously ignored. Shoved to the side.\n\nThe vaccine was only designed, at best, to prevent mild cough, fever, chills. That’s it. A mild case of flu-like illness. Which cures itself.\n\nThat design was intentional. It allowed the vaccine makers to win approval for the injection.\n\nIf they had to wait around for 150 volunteers in the clinical trials to develop serious pneumonia, that could have taken years. Or forever.\n\nThe vaccine, even in mainstream scientific terms, was worthless.\n\nIt was designed that way.\n\nThat’s a chunk of blockbuster news anybody with a half a brain should be shouting from the rooftops. Instead: SILENCE.\n\nAgain, because this blockbuster news burns the whole house down.\n\nIt takes down the whole vaccine establishment.\n\nAnd there are lots of vaccine critics who DON’T WANT TO GO ALL THE WAY.\n\nEVEN THOUGH THEY SHOULD.\n\nThey back away. They pretend they don’t know what they DO know.\n\nThey could shoot down, overnight, the whole basis for these COVID shots, and they would expose the vaccine that is maiming and killing of millions upon millions of people.\n\nGet them to tell you what their problem is.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://blog.nomorefakenews.com/2022/02/21/the-test-for-klaus-schwab-and-the-world-economic-forum/", "https://www.nytimes.com/2020/09/22/opinion/covid-vaccine-coronavirus.html", "https://www.bmj.com/content/371/bmj.m4037", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Feb23"}