{"result_id": "225022", "URL": "https://blog.nomorefakenews.com/2020/12/14/shocking-report-on-covid-vaccine-adverse-effects-the-roll-out-continues-anyway/", "timestamp": "2023-04-25 16:36:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2020/12/14/shocking-report-on-covid-vaccine-adverse-effects-the-roll-out-continues-anyway/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Shocking report on COVID vaccine adverse effects: the roll-out continues anyway « Jon Rappoport's Blog", "cleaned_text": "Millions of people can experience life-threatening effects from the vaccine\n\nFrom the UK, The Guardian has the story [1]: “People with a history of significant allergic reactions should not receive the Covid vaccine, the medicines regulator has said, after two NHS workers experienced symptoms on Wednesday.”\n\nThey just figured this out? Now?\n\nThe Guardian is referring to the Pfizer/BioNTech vaccine, which has just been approved in the US.\n\nTwo people experiencing significant adverse effects may not sound important, particularly since they already a history of allergic reactions, but the following quote in the Guardian article raises major red flags a mile high:\n\n“The MHRA [UK Medicines and Healthcare products Regulatory Agency] advice states: ‘Any person with a history of a significant allergic reaction to a vaccine, medicine or food (such as previous history of anaphylactoid reaction or those who have been advised to carry an adrenaline autoinjector) should not receive the Pfizer/BioNtech vaccine. Resuscitation facilities should be available at all times for all vaccinations. Vaccination should only be carried out in facilities where resuscitation measures are available’.”\n\nFirst of all, a very large number of people have a history of allergic reactions to a vaccine or medicine or food. Automatically, these people should not take the vaccine. But how many people in the general public are aware of this restriction?\n\nSecond, with the operation to vaccinate hundreds of millions of people running at top speed, who actually believes that many locations where shots are given will have the necessary resuscitation equipment on hand? Sheer insanity.\n\nThen, on top of all this, we have a bombshell statement from the Denver Post [2]: “Documents published by the two [vaccine] companies [Pfizer and BioNTech] showed that people with a history of severe allergic reactions were excluded from the [clinical vaccine] trials, and doctors were advised to look out for such reactions in trial participants who weren’t previously known to have severe allergies.”\n\nIn other words, the clinical trials were already biased, because they excluded people with a history of allergic reactions. Therefore, the performance of the vaccine looked safer. Therefore, no one would find out that allergic reactions to the vaccine are a MAJOR danger.\n\nAnd NOW, as if it’s nothing more than an afterthought, we get—“Oh, by the way, if people have allergies, they shouldn’t take the vaccine.”\n\nWhy don’t regulators simply admit, “This vaccine is as disastrous as possible, but we can’t let that cat out of the bag.”\n\nI have written about the inherent dangers of the new experimental RNA technology deployed with this COVOD vaccine. The world population is a vast group of guinea pigs. Past efforts to introduce RNA tech have failed because serious autoimmune reactions have occurred. [3] The body basically attacks itself.\n\nWhat rational person would line up to take this shot?\n\nYou have to ask yourself why some Pittsburgh and Chicago medical centers aren’t making the new COVID vaccine mandatory for their own healthcare workers. [4] [5]\n\nThey’ve issued that announcement on the basis of wait-and-see. They know the vaccine carries major risks, and the clinical trials were far from convincing.\n\nAccording to WebMD [6], “more than 50 million Americans suffer from allergies each year.” 200,000 people come to the ER with food allergies. 4-5% of the population have food allergies. Who can say, with certainty, how many Americans would experience, say, life- threatening anaphylactic shock from the COVID vaccine?\n\nAnd when it comes to medicines, consider just one type of allergic reaction—to penicillin or antibiotics. Is the outbreak of a rash serious enough to warrant automatic exemption from the COVID vaccine? Should shortness of breath be the standard? No one knows.\n\nFinally, as I’ve reported in these pages several times, the 3 major clinical trials of COVID vaccines (Pfizer, Moderna, AstraZeneca) were designed to prevent nothing more than a “mild case of COVID-19.” That means a cough, or chills and fever. [7]\n\nSerious cases of illness? Hospitalization? Death? These were not on the radar of the clinical trials.\n\nCough, or chills and fever, cure themselves naturally. No need for a vaccine.\n\nSo again, what rational person would line up to take the COVID shot?\n\nWhat rational person would imagine the celebratory media coverage of the vaccine rollout, or the carnival barking of Trump, amounts to more than a typical sales job and a hustle and a con? [8]\n\nOf course, you’re not supposed to know about the information in this article, even though it’s readily available in open source literature and in mainstream news. Social media censor the ANALYSIS OF THE MEANING OF THIS INFORMATION.\n\nA dictatorship wants you to take the COVID shot.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Dec14"}