{"result_id": "225029", "URL": "https://blog.nomorefakenews.com/2021/10/11/natural-immunity-vs-vaccine-induced-immunity-that-terrifies-pro-vaxx-mafia/", "timestamp": "2023-04-25 16:36:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/10/11/natural-immunity-vs-vaccine-induced-immunity-that-terrifies-pro-vaxx-mafia/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Natural immunity vs. Vaccine-induced immunity: the issue that terrifies the pro-vaxx mafia « Jon Rappoport's Blog", "cleaned_text": "As my readers know, I’ve been proving, for the past year, that the SARS-CoV-2 virus doesn’t exist. Therefore, the whole issue of immunity is a non-starter. Immune to what? To a phantom. A myth. A superstition. A fairy tale. A collective hallucination.\n\nNEVERTHELESS, I make frequent forays into the fantasy bubble-world, where millions and millions of people believe the virus is real, the case numbers are real, and the vaccine is relevant. I do this to point out the ridiculous contradictions and internal inconsistencies and lies within that bubble.\n\nI’m making another such foray now. For the purposes of argument only, I’ll assume the virus is real and viral immunity is real and discussion about the vaccine is relevant.\n\nA key question within the bubble: is naturally acquired immunity, achieved through infection by the virus, equivalent to, or better than, immunity acquired as a result of vaccination?\n\nThe answer to that question is vital for the pro-vaxx mafia. They MUST claim natural immunity is inferior. Otherwise, their goose is cooked.\n\nOtherwise, their whole brutal campaign to force shots into arms is doomed.\n\nEnter Senator Rand Paul. The other day, in a hearing, he took Biden’s Health and Human Services Secretary, Xavier Becerra, to the woodshed, to the cleaners, to school.\n\n“Referring to a recent Israeli study that found vaccinated people are up to seven times more likely to get COVID-19 than those who have natural immunity, Paul told Becerra that Americans should be allowed to take a ‘Look at a study with 2.5 million people and say you know what? Looks like my [natural] immunity is as good as the vaccine’ or not.”\n\n“’Maybe in a free country, I ought to be able to make that decision,’ Paul urged.”\n\n“’Instead, you’ve chosen to travel the country calling people like Johnathan Isaac, and others, myself included, flat-earthers,’ the Senator continued, adding ‘We find that very insulting. It goes against the science’.”\n\n“Paul then asked Becerra if he was a qualified medical doctor, knowing that he isn’t.”\n\n“’So you’re not a medical doctor. Do you have a science degree?’ Paul further questioned, knowing that Becerra doesn’t.”\n\n“’You alone are on high and you’ve made these decisions, a lawyer with no scientific background, no medical degree…this is an arrogance coupled with an authoritarianism that is unseemly and un-American,’ Paul blasted.\n\n“’You sir, are the one ignoring the science. The vast preponderance of scientific studies, dozens and dozens, show robust, long-lasting [natural] immunity after infection,’ the Senator further charged, demanding that Becerra should apologise for being dishonest.”\n\nIf natural immunity is superior to vaccine-acquired immunity, then millions and millions of people who have been labeled “COVID cases” and recovered…don’t need the vaccine.\n\nWait. There’s more. A few months ago, the FDA issued a strange edict that confused many medical professionals. The agency suddenly announced that COVID antibody tests would no longer be considered useful or accurate.\n\nThe hidden reason for that decision is becoming clear. Widespread antibody testing would reveal that an EXTRAORDINARY number of people developed viral infections and recovered. A far greater number than anyone expected or assumed. They have antibodies against the virus and they’re healthy.\n\nAnd THAT revelation would sink the pro-vaxx ship to the bottom of the sea. Because, obviously, all those antibody-positive people developed natural immunity to the virus and have no need for a vaccine.\n\nThen, on top of all this, the PCR test, when run at a sensitivity of 35 cycles or above, also indicates millions and millions of people are infected by the virus and recover nicely. THOSE people as well would need no vaccine.\n\nThe total tonnage of scientific bullshit required to argue that everyone should be vaccinated is titanic.\n\nHence, we have Fauci, sold-out talking news heads, vaccine mandates, lying doctors, lying public health officials, etc.\n\nIt would not surprise me at all if it turned out that 80-90 percent of the population—subjected to testing and re-testing—at one time or another qualified as COVID cases—and recovered nicely or were never sick in the first place…AND THEREFORE HAVE NO NEED FOR A VACCINE.\n\n—And that concludes today’s episode of Lunatics on the Loose inside the Mad Mad World Where People Believe the Virus is Real and the Vaccine is Relevant and Necessary. As I say, I make forays into that world to demonstrate the contradictions and lies the liars are spouting, even on their own terms.\n\nThe liars are no more reliable than drunks in a bar at 2AM.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["immunity"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://www.infowars.com/posts/video-rand-paul-blasts-biden-health-secretary-this-is-an-arrogance-coupled-with-an-authoritarianism-that-is-unseemly-and-un-american/", "https://blog.nomorefakenews.com/2021/06/29/fda-reverses-itself-rejects-covid-antibody-test-results-insanity-reigns/", "https://blog.nomorefakenews.com/2021/08/27/smoking-gun-fauci-states-covid-pcr-test-has-fatal-flaw/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Oct11"}