{"result_id": "225033", "URL": "https://blog.nomorefakenews.com/2021/10/25/people-of-faith-and-the-covid-vaccine/", "timestamp": "2023-04-25 16:36:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/10/25/people-of-faith-and-the-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "People of faith and the COVID vaccine « Jon Rappoport's Blog", "cleaned_text": "Refusing the COVID vaccine should be a personal mandate\n\nVaccines, live infants, and fetal tissue research: shedding light on the darkness\n\n“Well, I mean, sure, maybe some of the research behind the COVID vaccine involved aborted fetuses, but that was a long time ago, and really, I can’t think about that, I need to take the vaccine to protect myself, and besides, abortion is legal…”\n\nToday, I’m featuring the work of journalist Monica Seeley, and her stunning article, “Exploring the dark world of vaccines and fetal tissue research, Part 1,” published at catholicworldreport.com.\n\nSeeley had considerable help, as she details, from investigative reporter, Pamela Acker. Acker has weathered attacks from several quarters—including critics within the Catholic Church structure.\n\nShe has stood firm, and deserves high praise for her seminal work on fetal tissue research, vaccines, and medical murder.\n\nIt turns out that much of the best analysis of fetal tissue research, medical abortions, vaccines, and the medical killing of infants comes from writers publishing at independent Catholic outlets. Just to mention one website—Children of God For Life.\n\nThese writers and their publishers obviously take their faith seriously. They’re not bent on compromise or adjustment to trends of the times. Unlike the Vatican hierarchy, they have no qualms about exposing deep medical crimes.\n\nI’m going to quote from Monica Seeley’s article and add my own comments along the way. I strongly urge you to read her whole piece.\n\nYou should understand that researchers who extract tissue and organs from aborted fetuses are using those parts for the development of drugs and vaccines—including the COVID vaccine.\n\nAbortion is a religious issue of conscience for many people. When the fetus is extracted alive, from the mother’s womb, then murdered in the process of removing his/her organs, the crime is so horrific that people who have very little conscience at all should be shocked to the core.\n\nSince these crimes form a significant part of the research-basis for many vaccines, refusing the vaccines as a matter of conscience and conviction should be a personal decision for ANYONE.\n\nAnd now, to Monica Seeley’s article. She reveals these medical crimes stretch back in time:\n\n“…newspapers reported matter of factly on fetal vivisection, as in this article from the San Francisco Chronicle, April 19, 1973, entitled ‘Operations on Live Fetuses’:”\n\n“’Dr. Jerald Gaull in periodic trips to Finland injects a radioactive chemical into the fragile umbilical cords of fetuses freshly removed from their mothers’ wombs in abortions. The fetus in each case is far too young to survive, but in the brief period that its heart is still beating, Gaull, chief of pediatrics research at the New York State Institute for Basic Research in Mental Retardation on Staten Island—then operates to remove its brain, lung, liver and kidneys for study’.”\n\nIn other words, Gaull tortures and murders the infant. But of course, the Chronicle article doesn’t explore this fact. It’s all “medical,” you see. So it must make sense. Somehow.\n\nSeeley: “A 1976 report by drug manufacturer Batelle-Columbus Laboratories acknowledged the role of live fetal research in four medical advances: amniocentesis, respiratory distress syndrome, and, significantly for this article, the rubella and Rh vaccines: ‘It is apparent from a study of the development of the four selected cases… that research on living human fetuses played a significant role in each.’ The report recommended against restrictions on such research.”\n\nThe term “living human fetuses” doesn’t register with many people. And they certainly don’t realize these infants have been taken alive, from their mother’s womb, and then stripped of their body parts for research—killing them. Or if death is not immediate result, the murder is committed by cutting out their hearts or vacuuming their brains from their skulls.\n\nAgain, the ensuing research contributes to the development of vaccines and drugs—including the COVID vaccines (as I’ve covered in previous articles).\n\nSeeley: “…seeing a report on cardiac stem cell research in which human fetal hearts were hooked up to a Lagendorff assembly—which can keep a heart beating artificially outside the body—I did not at first realize that these hearts must come from live subjects.”\n\nYes. The report, on first reading, comes across as neutral and technical and medical. But then—WHAT? The heart was taken from the infant while he/she was ALIVE. —Aborted, alive, then killed by taking the beating heart.\n\nSeeley: “A 1988 article in the Hastings Journal assumed that tissue removal from live, nonviable fetuses was already taking place:”\n\n“[The Hastings Journal:] ’Perhaps the most pertinent federal restriction is the ban on research of any kind on a live nonviable fetus ex utero that would prematurely terminate the fetus’ life. This ban may be significant because the procedure required for removing fetal brain tissue transplantation would hasten the death of a live fetus. Thus, if a similar restriction were imposed on fetal tissue transplants, it would prohibit the removal of fetal brain tissue and, potentially, other types of tissue, from live nonviable fetuses’.”\n\nThe above quote is crucial. By non-viable, the article means a live fetus removed from the womb that will die very soon. In that short span of life remaining, researchers want to be able to torture the infant in many ways, by cutting out parts of the body, killing him/her. And don’t assume that a 1988 ban on this “research” stopped what was happening and still happens in closed labs.\n\nGiven the (planned) ignorance on the part of the public, people will say, “But we need all this vital medical research so our doctors can treat us…”\n\nTo reply, I’ll cite one study out of several I have written about many times in these pages:\n\nAuthor, Dr. Barbara Starfield, a respected and revered public health expert at the Johns Hopkins School of Public Health; “Is US Health Really the Best in the World?”; Journal of the American Medical Association, July 26, 2000:\n\nStarfield concludes that, every year in the US, the medical system kills 225,000 people. 106,000 as a result of the administration of medical drugs, and 119,000 from medical errors and mistreatment in hospitals.\n\nThat adds up to 2.25 million deaths per decade.\n\nWhen I interviewed Dr. Starfield, she said her estimate of deaths was conservative, and succeeding studies put the number higher.\n\nHer shocking finding becomes more understandable, when we realize a significant amount of underlying medical research comes from professionals who murder infants.\n\nWhy would we expect the work of these people to be useful and valuable?\n\nWhy would we expect their drugs and vaccines to be safe?\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine", "medical infanticide"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://www.catholicworldreport.com/2021/05/17/exploring-the-dark-world-of-vaccines-and-fetal-tissue-research-part-1/", "https://www.lifesitenews.com/tags/tag/pamela-acker/", "https://cogforlife.org/", "https://www.jhsph.edu/research/centers-and-institutes/johns-hopkins-primary-care-policy-center/Publications_PDFs/A154.pdf", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Oct25"}