{"result_id": "225015", "URL": "https://blog.nomorefakenews.com/2021/05/10/covid-vaccine-deaths-the-numbers-point-to-a-catastrophe/", "timestamp": "2023-04-25 16:36:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/05/10/covid-vaccine-deaths-the-numbers-point-to-a-catastrophe/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "COVID vaccine deaths: the numbers point to a catastrophe « Jon Rappoport's Blog", "cleaned_text": "A new May 4 report by independent researcher, Virginia Stoner, reveals US vaccine-death figures. The report is titled, “The Deadly Covid-19 Vaccine Coverup.”\n\nStoner uses the US government’s own numbers.\n\nHere are key quotes from her report:\n\n“There has been a massive increase in deaths reported to the Vaccine Adverse Event Reporting System (VAERS) this year. That’s not a ‘conspiracy theory’, that’s an indisputable fact.”\n\n“We’re talking about a huge and unprecedented increase—so massive that in the last 4 months alone, VAERS has received over 40% of all death reports it has ever received in its entire 30+year history.”\n\n“The increase in VAERS death reports is not due to more vaccination.”\n\n“Most recently, the death count went from 2794 on April 5, to 3005 on April 12, to 3848 on April 26….1054 deaths in 21 days.”\n\n“One hypothesis…is that the elderly and infirm, many in long-term care facilities, were the first to be targeted by the COVID-19 vaccine campaign, and they are much more likely to die coincidentally. These coincidental deaths then lead to an increase in suspected vaccine-induced deaths reported to VAERS.”\n\n“VAERS data just does not support that hypothesis. First, because all age groups—not just seniors—had a dramatic increase in VAERS death reports from COVID-19 vaccines…Across the board, all age groups experienced a dramatic increase in deaths reported to VAERS from the COVID-19 shots—even the under 18 group, which has had very few COVID-19 shots (so far).”\n\nStoner constructs a chart showing reported deaths from vaccinations in years prior to COVID, and deaths reported so far from COVID vaccines.\n\nFor prior years, we’re talking about roughly 100 deaths a year from somewhere between 250 million and 350 million vaccines administered. On the other hand, we’re talking about 3800 deaths from about 150 million COVID shots—not in a full year; in only four months.\n\nThe experts would say neither death figure (100 or 3800) is alarming, given the huge number of vaccines administered. But this is a deception.\n\nOver the years, much has been written (even in the mainstream) about what sits behind REPORTED vaccine injuries and deaths. Estimates of TRUE injury numbers range from 10 to 100 times greater than the reported figures.\n\n3800 reported deaths from COVID vaccines would skyrocket when you estimated the true figure.\n\nAs Stoner points out in her report, public health officials, in Orwellian fashion, keep repeating, “The vaccine is safe and effective.” A straightforward analysis of their own numbers completely contradicts their stance.\n\nLikewise, the mainstream press, politicians, corporations, and celebrities are on an all-out push to convince the public that the vaccine is a) necessary and b) a marvel, if only the “hesitant” people would “follow the science” and see the light.\n\nWell, some cults are small; that one is huge.\n\nVirginia Stoner’s report is a stark refutation of the conspiracy theory the cult is promoting.\n\nWhen the entire population is being subjected to a vast experiment deploying a never-before-released RNA technology; when the shot in the arm is actually a genetic treatment; when the entire field of genetic research is riddled with pretense and lies and alarming miscalculations, leading to ripple effects in overall genetic structures; what else would you expect?\n\nYou would expect exactly what Stoner’s report shows and implies. The COVID vaccine is a building disaster.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine", "dying"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://www.virginiastoner.com/writing/2021/5/4/the-deadly-covid-19-vaccine-coverup", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "May10"}