{"result_id": "225041", "URL": "https://blog.nomorefakenews.com/2021/09/13/great-walkout-is-starting-against-the-vaccine-mandate/", "timestamp": "2023-04-25 16:37:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/09/13/great-walkout-is-starting-against-the-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "The Great Walkout is starting; against the vaccine mandate « Jon Rappoport's Blog", "cleaned_text": "Children’s Health Defense: “Thousands of Parents and Educators Plan to ‘Walk Out’ To Protest Masking, Vaccine Mandates. We have launched a nationwide ‘Walk Out Week’ starting on September 13 in response to mask and vaccine mandates in schools and businesses around the country. Parents, educators and concerned citizens across the U.S. will participate in the coordinated week-long event focused on peaceful non-compliance, to remind government officials that individuals should have the final say when it comes to their health and that of their children.”\n\nNny360: “In a letter to [New York] Gov. Kathy Hochul and state Health Commissioner Howard Zucker, the GOP lawmakers warned the [vaccine] mandate could lead to massive resignations and firings of health care workers who refuse the shot.”\n\nMadison.com: “Increasingly, health care facilities in Wisconsin and around the country require their employees to be vaccinated. Yet in long-term care facilities such as nursing homes — where residents are highly susceptible to severe illness and death from COVID-19 — some workers refuse the shot.”\n\n“As of late August, Wisconsin’s rate of fully vaccinated nursing home employees was around 60%.”\n\nBloomberg: “Right now nearly 1 in 8 nurses are neither vaccinated nor planning to get a shot.”\n\n“And in some parts of the country, hospital administrators say only about half of their nursing staff are vaccinated.”\n\nStat News: “Millions of unused Covid-19 vaccines are set to go to waste as demand dwindles across the United States and doses likely expire this summer, according to public health officials…”\n\n“Currently, states have administered 52.36 million fewer doses than have been distributed to them, according to federal data.”\n\n“A significant tranche of Pfizer doses is expected to expire in August… Given waning domestic vaccine demand, those doses are unlikely to be fully used before they must be tossed.”\n\n“’We’re seeing demand [for the vaccine] falling off across all the states,’ said Marcus Plescia, chief medical officer at the Association of State and Territorial Health Officials.”\n\nFrank has his weekly appointment with his therapist.\n\nWell, Frank, you know, during the pandemic and the lockdowns, the subconscious is swinging into high gear. Many people are having uncomfortable dreams.\n\nThat doesn’t make me feel better.\n\nI could write you a prescription for Depoxywraparound-3-x.\n\nReally? So in the dream, I was at a small rally in a country town. Biden was talking to a few people. Then I was standing with him alone, off to the side, next to a tent. I handed him an ice cream cone. He went at it like it was his last meal.\n\nCould you see his teeth?\n\nSo I asked him, Do you really know what you’re doing with this new vaccine mandate? It affects a HUNDRED MILLION people.\n\nWhat did he say?\n\nHe kept gobbling up the ice cream. Between bites, he said, “That many people? That’s good. I want to force everyone.” Why, I said. He said, “Because it’s standard. We have to have a standard. Otherwise people go off on their own. That would be dangerous.”\n\nAnd his comment disturbed you?\n\nYes. When he said go off on their own, he meant…he was talking about anything they might do that wasn’t regulated. Anything at all.\n\nHow do you know he meant that?\n\nI could tell. In the dream, it was obvious.\n\nYou could have misinterpreted him.\n\nNo. I saw something in his face.\n\nWhat was that?\n\nA desire for revenge. He was suffering and he wanted to blame everybody else. There was blankness in his face. As if he was acting under orders.\n\nI’m not assuming. I SAW all that.\n\nIn the dream you were telepathic?\n\nHaven’t you ever had a dream where you just KNEW what was going on?\n\nSeveral reasons. I’ve resolved, in therapy, many of the issues that would cause my subconscious to work overtime while I’m asleep. Also, several years ago, I participated in a contract with the Department of Defense.\n\nWe studied automatic reflexes. The training involved using physical inputs to change the responses to stimuli.\n\nLet’s say when a person hears the sound of gunfire, he feels fear. We want to change that reflex. We want a soldier to feel nothing, or a sense of excitement.\n\nHow is that possible?\n\nYou could say that. So continue describing your dream, Frank.\n\nI said to Biden, This is has never been done in the history of America—telling more than a hundred million people they can’t work at a job unless they take a vaccine. It’s UNTHINKABLE.\n\nDid he answer you?\n\nYes. He said, “We’re at that stage now. We have to do unthinkable things.” Why, I said. He said, “It’s on the schedule.”\n\nIt was as if there was a schedule, and Biden couldn’t do anything about it. He accepted that.\n\nIn life, there ARE certain things we can’t change. It’s a sign of maturity when we come to terms with—\n\nNo. That’s not what I mean. Biden was a disabled old man saying that. He knew what was going on, and he was…\n\nHe was what?\n\nBeyond despair. He had already felt despair, and he found out it didn’t do any good. Years ago. Do you see? He’d totally surrendered to something.\n\nYou’re making all sorts of assumptions again.\n\nNo I’m not. In the dream, what I’m telling you…it was as clear as day.\n\nYou know what your problem is, Frank?\n\nWhen you go to sleep, you dream. That’s the basic issue. I see I can’t talk you out of your own interpretations of these dreams. So you just have to stop.\n\nI don’t know. It sounds like surgery. If I stop dreaming, will I be different when I’m awake?\n\nI would say yes. You won’t be as emotional. You’ll have more balance.\n\nLike Biden in the dream? I’ll be blank? You know, he kept eating ice cream. The cone didn’t run out. There was always ice cream in it.\n\nThat alone should tell you…in your dream, you obviously weren’t talking with Biden. It was your version of him.\n\nI’m not so sure.\n\nCome on, Frank. You can’t believe the man in your dream was like the actual Biden.\n\nLet me write you a prescription. Try it for a week. You’ll stop dreaming. If you don’t like the effect, I’ll wean you off the drug.\n\nBy then, it might be too late.\n\nWhat do you mean?\n\nIn my new state of mind, I might want to keep taking it.\n\nAnd what would be so wrong with that?\n\nBiden was under…he had given up his…he was under the control of other people. He knew it. Way back in the past, he had fought it, and he lost.\n\nThere you go again. What do you want to change about your life, Frank?\n\nYou want to be happy. You don’t want to be bothered and distracted by troubling things. Doesn’t that sound about right?\n\nYou come in here with a dream—sure, I could analyze it for you, but it’s just a dream…\n\nHe was talking to a Chinese official.\n\nBiden. He was sitting in a chair in an empty auditorium. A Chinese officer was standing over him, lecturing him.\n\nWe’re back on that again. Why don’t you call the White House and tell them about your dream, Frank? Lay it out. They’ll put you on a long list of nutcases. Is that what you want?\n\nWill you take the medicine I want to give you?\n\nWhat? Yes, yes he was.\n\nYes. How did you—\n\nHe was wearing a gray suit, and a blue tie?\n\nThe place where you were asking him about the vaccine mandate—there was a tree, a large oak tree. You were standing in the shade. There was a tent nearby.\n\nHow do you know that?\n\nThe ice cream cone. It was a dark brown.\n\nHow do you know all this?\n\nI’ve had ten patients in the last two weeks who’ve had the same dream.\n\nI’d agree with you. Except for the ten patients.\n\nHow can you explain it?\n\nI can’t. Actually, it’s more than ten. I’ve spoken with several colleagues. They’ve all had patients who had the same dream.\n\nSomeone is putting the dream in our minds?\n\nI don’t think so. I think it’s an organic event.\n\nPeople are staging a rebellion, internally. That would be my interpretation. The vaccine mandate is going too far. The shared dream is the first wave of the resistance. A new level of resistance.\n\nWhat’s going to happen next?\n\nThere was something else I said to him in the dream.\n\nI know what it was, Frank. You said the whole country is going to stage a walkout. The whole country is going to stay home from work. In protest against the mandate.\n\nThat’s exactly what I said.\n\nEvery patient, in his dream, told Biden that.\n\nSo let’s do it, Doc.\n\nCome on, Doc. Don’t you think I know what’s going on? You had the same dream, too.\n\nIt’s the first time I had a dream in ten years.\n\nHow did it feel?\n\nThe next morning, I remembered what it was like to be happy.\n\nHere’s the thing, Doc. It’s already started. We just don’t know about it yet.\n\nThe walkout. The nurses, for instance. They’re leaving their jobs because they won’t take the vaccine. More nurses than we know about. Many more.\n\nYou know, Frank…my cousin was killed in Vietnam. His mother had a dream about it, before it was reported to her. The Army stalled the report, because her son was killed by friendly fire. She actually had the dream after her son was dead, but before it was reported…\n\nThat’s why we’re dreaming, Doc. Because the walkout has started, but the news doesn’t want to report the extent of it…\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["tyranny", "Biden"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://childrenshealthdefense.org/action/walk-out-week/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Sep13"}