{"result_id": "225031", "URL": "https://blog.nomorefakenews.com/2021/10/19/the-vaccine-a-religious-exemption-for-the-whole-world/", "timestamp": "2023-04-25 16:36:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/10/19/the-vaccine-a-religious-exemption-for-the-whole-world/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "The vaccine: A religious exemption for the whole world « Jon Rappoport's Blog", "cleaned_text": "Yesterday, I quoted extensively from AnnaMaria Cardinalli’s stunning Crisis article that concluded there was the murder of an infant, in order to obtain the cell line used in COVID vaccine testing.\n\nI put out a call to medical professionals to weigh in on her analysis.\n\nHere is the basic ramification: THERE IS A RELIGIOUS EXEMPTION FOR THE WHOLE WORLD.\n\nFor all people of faith. Every faith.\n\n“According to my religious belief, the murder of an undeniably live infant for any reason is unconscionable and evil, and I refuse the vaccine.”\n\nHere is a Force against which no government, no establishment, no secret society, no wealth can stand.\n\nI fully understand all sorts of professionals will spout language that purports to show “the infant was not alive, the lab followed all the legal guidelines, this is an old argument that has been debunked…”\n\nBut this is not just an old argument. This is the equivalent of an opening statement in a murder trial. Nothing less.\n\nIf religious leaders will read AnnaMaria Cardinalli’s article, they will see how important her charge is.\n\nThe question isn’t “will people of faith wake up and do what they should”; the question is “how can any person of faith NOT do what they should”.\n\nIf they will make a stand; if all people of faith will; the entire dire situation we are facing changes in the blink of an eye.\n\nSolomon to God: “You have made Your servant king instead of my father David, but I am a little child; I do not know how to go out or come in…Therefore give to Your servant an understanding heart to judge Your people, that I may discern between good and evil.”\n\nGautama Buddha: “To cease from evil, to do good, and to purify the mind yourself, this is the teaching of all the Buddhas.”\n\nJohn 10:10: “The thief comes only to steal and kill and destroy. I came that they may have life and have it abundantly.”\n\nWould any church, any religion in the world say that God wants the killing of live infants for the purpose of medical research?\n\nIn the midst of this COVID tyranny, haven’t we all been looking for an issue that will galvanize huge numbers of people?\n\nAnd not as some kind of stunt. But rather as an inevitable outcome of deep faith.\n\nFaith and justice come from the same everlasting tree.\n\nI hear the voices that say we can never rouse a billion people from their slumber. But they are wrong. Nothing is impossible. The so-called evidence of history is never more than What Was. And even down through history, “what could never happen” was the status quo until a breakthrough shattered it.\n\nFor people who missed it, here is my article from yesterday:\n\nWas COVID vaccine fetal tissue obtained by the murder of an infant?\n\nWith the release of COVID vaccines, and then the mandates, we’ve seen a new resurgence of people attempting to gain religious exemptions.\n\nMany of these attempts focus on fetal tissue obtained through abortion.\n\nOn January 19, 2021, AnnaMaria Cardinalli published an explosive article in Crisis Magazine, headlined, “Catholic Conscience and the COVID-19 Vaccine.”\n\nCardinalli details the collection of fetal tissue for the cell line named HEK 293. This cell line was used for “testing” the Moderna and Pfizer vaccines.\n\nCardinalli writes: “We know that the Pfizer and Moderna vaccines do not use any cells derived from abortion in the production process. That is, we know that we are not being directly injected with fetal cells or their engineered descendants (though this fact differs with other manufacturers). We hear that the abortion-derived cell lines were only used in testing, which should somehow comfort us, though it still means that the vaccines from which we seek to benefit depend on the involvement of abortion. We are told that the cell line used in testing came from one abortion, which took place decades ago. These things are all true, but they do not serve to inform us fully.”\n\n“What we may not know follows. The most prominent cell line, called HEK 293, comes from an abortion performed in the 1970’s. It’s labeled 293 because that’s how many experimental attempts the researchers needed to get a working cell line. Therefore, though the abortion-to-experiment ratio is not precisely one-to-one, hundreds of abortions went into the project, even if they didn’t result in the working line.”\n\n“HEK stands for human embryonic kidney. To harvest a viable embryonic kidney for this purpose, sufficiently healthy children old enough to have adequately-developed kidneys must be removed from the womb, alive, typically by cesarean section, and have their kidneys cut out. This must take place without anesthesia for the child, which [anesthesia] would lessen the viability of the organs. Instead of being held, rocked, and comforted in the time intervening between their birth and their death, they have organs cut out of them alive.”\n\n“There is no way that a spontaneous abortion could result in the cell line (as the kidneys cannot remain viable past the brief window in which they must be harvested) or that some brilliant researcher found a way for great good to come out of a rare tragedy by making use of a child’s body donated to science after it was aborted. The deliberate killing of an unwanted child (a little girl, in the case of HEK 293) took place in the tortuous manner it did precisely to obtain her organs for research. The harvest of her organs was the direct cause of her death, prior to which, she was a living child, outside the womb.”\n\n“I fear that Pope Francis and Pope Emeritus Benedict may not have had this information when they received the vaccines. If we re-examine the Vatican statement that ‘it is morally acceptable to receive COVID-19 vaccines that have used cell lines from aborted fetuses in their research and productions process,’ we see that it does not apply here. It does not imagine this scenario. To approve of the currently-available vaccines, it would have to read ‘it is morally acceptable to receive COVID-19 vaccines that have used cell lines from living persons, killed by the harvest of their organs for use in medical research and productions processes,’ but the Church’s moral teachings could never truly bend so far.”\n\n“Similar to the human rights abuses exposed by international tribunal in today’s China, where unwanted individuals such as religious and political dissidents are executed by the harvest of their organs for profit, the little girl whose cells gave rise to the COVID-19 vaccines was brutally sacrificed for the purpose, as were all the children whose cell lines failed before her.”\n\nIf Cardinalli is correct in her analysis, not only is the granting of religious exemptions a foregone conclusion; the whole field of fetal tissue research, going back many years and involving many pharmaceutical products should be put on trial.\n\nThe people who have been carrying out the murders, the people who have been using the harvested tissue, the companies—all of them—on trial.\n\nI hope many medical professionals will take Cardinalli’s article as a springboard, and weigh in on what she is very clearly stating.\n\nAnd not just doctors. All people who are shocked by her conclusions.\n\nSo far, I see two counter-claims to Cardinalli’s assertions.\n\nOne: In the fetal cell line HEK 293, the number does not stand for the number of live-birth abortions performed, in order to obtain a functioning cell line. The number 293 refers to the number of “passages” of the one cell line obtained from one abortion. This difference doesn’t concern me. It’s not central to the fact of murdering babies. And of course, many such live abortions are performed all over the world with the goal of obtaining cells lines for research.\n\nTwo: Cardinalli’s claim that the kidneys of the aborted baby must be harvested very quickly is false. The kidneys can survive for a longer period.\n\nOn that score, I refer you to a devastating video interview conducted by Robert Kennedy Jr. His guest was SOUND CHOICE PHARMACEUTICAL INSTITUTE “President and Founder, Dr. Theresa Deisher Ph.D., [with] over 30 years of pharmaceutical research and leadership experience. She discovered adult cardiac derived stem cells, has worked on their therapeutic uses as an alternative to human fetal DNA, and leads a team of scientists at AVM Biotechnology dedicated to changing what a diagnosis of cancer, autoimmunity, or chronic infectious disease means to patients and their loved ones. As a result of this work, Dr. Deisher is named as an inventor on over 47 patents.”\n\nIn the first 15 minutes of the interview, Deisher makes it quite clear that infants in the womb are taken out alive, with their blood supply functioning (essential) and then killed by cutting out their hearts or their brains. This is what is done in order to obtain tissue that will be turned into fetal cell lines.\n\nSince this act of murder is standard practice, it would appear it was committed against the live baby whose kidney cells became cell line HEK 293, used in testing the COVID vaccines. (More evidence coming in future articles.)\n\nAt the top of the interview, Kennedy said he didn’t want to get into the moral aspect of fetal cell lines. But after listening to Deisher, he was shaken. He said so. He said they would have to cover the moral aspect.\n\nThe whole world has to.\n\nAborted fetal cells and vaccines – a scandal much bigger than Pfizer’s whistleblower ever imagined\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine", "medical infanticide"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://blog.nomorefakenews.com/2021/10/18/was-covid-vaccine-fetal-tissue-obtained-by-the-murder-of-an-infant/", "https://www.crisismagazine.com/2021/catholic-conscience-and-the-covid-19-vaccine", "https://childrenshealthdefense.org/news/robert-f-kennedy-jr-q-a-with-dr-theresa-deisher/", "https://americasfrontlinedoctors.org/2/frontlinenews/aborted-fetal-cells-and-vaccines-a-scandal-much-bigger-than-pfizers-whistleblower-ever-imagined/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Oct19"}