{"result_id": "225002", "URL": "https://blog.nomorefakenews.com/2021/08/17/massive-fraud-in-reporting-vaccine-injuries-withheld-data-pretense-of-safe/", "timestamp": "2023-04-25 16:36:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/08/17/massive-fraud-in-reporting-vaccine-injuries-withheld-data-pretense-of-safe/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Massive fraud in reporting vaccine injuries; withheld data, pretense of “safe and effective” « Jon Rappoport's Blog", "cleaned_text": "ONE: A bombshell. Alex Berenson, former New York Times reporter, August 6: “Covid vaccine maker Moderna received 300,000 reports of side effects after vaccinations over a three-month period following the launch of its shot, according to an internal report from a company that helps Moderna manage the reports.”\n\n“That figure is far higher than the number of side effect reports about Moderna’s vaccine publicly available in the federal system that tracks such adverse events.”\n\nBOOM. 300,000 vaccine adverse effects NOT reported to VAERS, the federal database.\n\nBerenson: “The 300,000 figure comes from an internal update provided to employees by IQVIA, a little-known but enormous company that helps drugmakers manage clinical trials. Headquartered in North Carolina, IQVIA has 74,000 employees worldwide and had $11 billion in sales last year.”\n\n“Earlier this week, Richard Staub, the president of IQVIA’s Research & Development Solutions division, sent a ‘Q2 2021 update’ which was labeled ‘Confidential – For internal distribution only’.”\n\n“A person with access to the presentation provided screenshots of the relevant slide, which clearly explains the 300,000 side effect reports were received over ‘a three-month span’ – not since the introduction of the vaccine in December…”\n\nTWO: Independent researcher Virginia Stoner has issued a stunning new report on the VAERS numbers, and the effort by mainstream scientists to minimize the destructive effects of the COVID vaccines. Here are key quotes from her report:\n\n“More deaths have been reported to VAERS from the covid shots than from all other vaccines combined for the last 30 years.”\n\n“There’s a code of silence shielding the massive increase in deaths (and other serious injuries) reported to VAERS from the covid shots. Not only do CDC web pages and press releases omit that inconvenient fact—vaccine research studies omit it as well.”\n\n“The number of covid shots [in the US] administered so far in 2021 (309 million) is roughly the same as all other vaccines administered in 2020 (316 million). But a shocking 36-times more deaths were reported this year from the covid shots than were reported last year from all other vaccines.”\n\n“Someone died from a vaccine they [a medical provider] administered…could it potentially call their professional judgment into question, or result in a malpractice lawsuit? If you were a doctor, or supervisor at a drive-thru covid vaccination clinic, and you were given a choice between spending the evening filing a VAERS report, or having dinner with friends, which would you choose?”\n\n“There are reasons to think death may be one of the most underreported vaccine injuries of all—mainly because the victim is dead, and can’t file a VAERS report. Nor can they prod their doctor into filing a VAERS report. Unless they’re fortunate enough to have a relative or doctor who knows they got the vaccine, knows about VAERS, understands the potential for vaccine injury, and is willing to go through the onerous process of filing a VAERS report, it won’t happen.”\n\nTHREE: Open letter from Doctors for COVID Ethics accusing governments and media of lying to the people:\n\n“Official sources, namely EudraVigilance (EU, EEA, Switzerland), MHRA (UK) and VAERS (USA), have now recorded more Injuries and Deaths from the ‘Covid’ vaccine roll-out than from all previous vaccines combined since records began.”\n\n“TOTAL for EU/UK/USA – 34,052 Covid-19 injection related deaths and over 5.46 million injuries reported as at 1 August 2021.”\n\n“It is important to be aware that the official figures above (reported to the health authorities) are but a small percentage of the actual figures. Furthermore, people continue to die (and suffer injury) from the injections with every day which passes.”\n\n“This catastrophic situation has not been reported by the mainstream media, despite the official figures above being publicly available.”\n\n“The Signal of Harm is now indisputably overwhelming, and, in line with universally accepted ethical standards for clinical trials, Doctors for Covid Ethics demands that the ‘Covid’ vaccine programme be halted immediately.”\n\n“Continuation of the programme in the full knowledge of ongoing serious Harm and Death to both adults and children constitutes a Crime Against Humanity/Genocide for which those found to be responsible or complicit will ultimately be held personally liable.”\n\n“Governments worldwide are lying to you the people, to the populations they purportedly serve.”\n\n“The figures above demonstrate that the mRNA vaccines are deadly.”\n\nFOUR: The well-known 2010 Harvard Pilgrim Health Care, Inc. study of VAERS bluntly stated: “Adverse events from vaccines are common but underreported, with less than one percent reported to the Food and Drug Administration (FDA). Low reporting rates preclude or delay the identification of ‘problem’ vaccines, potentially endangering the health of the public.”\n\nFollowing the finding of that study, you would multiply the number of reported vaccine injuries by 100 to arrive at a proper figure.\n\nFIVE: In view of the massive number of vaccine injuries and deaths, how would we expect the public to react? Here is a major clue. Stat News, July 21: “Millions of unused Covid-19 vaccines are set to go to waste as demand dwindles across the United States and doses likely expire this summer, according to public health officials…”\n\n“Currently, states have administered 52.36 million fewer doses than have been distributed to them, according to federal data.”\n\n“A significant tranche of Pfizer doses is expected to expire in August… Given waning domestic vaccine demand, those doses are unlikely to be fully used before they must be tossed.”\n\n“’We’re seeing demand [for the vaccine] falling off across all the states,’ said Marcus Plescia, chief medical officer at the Association of State and Territorial Health Officials.”\n\nSIX: Understanding this, government, media, and corporate criminals are ramping up vaccine mandates wherever and however they can, to force the needle into your arm.\n\n“You’re aware that our product is highly dangerous and destructive? We’ll make you take it.”\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Aug17"}