{"result_id": "225011", "URL": "https://blog.nomorefakenews.com/2021/09/15/metal-particles-in-many-vaccines-but-dont-worry-line-up-and-take-your-shots/", "timestamp": "2023-04-25 16:36:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/09/15/metal-particles-in-many-vaccines-but-dont-worry-line-up-and-take-your-shots/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Metal particles in many vaccines; but don’t worry, line up and take your shots like happy little robots « Jon Rappoport's Blog", "cleaned_text": "First, current news—Japan and the Moderna COVID vaccine. Fiercepharma reports:\n\n“…another one million doses of the vaccine were suspended over concerns of possible contamination found in two additional vaccine lots…The material was determined to be metallic particles, Japan news outlet NHK reported last week. Last week, Japan suspended the use of 1.63 million doses.”\n\nSo that’s two separate suspensions of lots of the Moderna vaccine in Japan.\n\nBut this is just the beginning of the problem. Here is a piece I wrote more than a year ago, about a widely ignored study. The implications are staggering:\n\n“The Lung,” Second Edition, 2014: “Nanoparticles [are] comparable in size to subcellular structures…enabling their ready incorporation into biological systems.”\n\nA 2017 study of 44 types of 15 traditional vaccines, manufactured by leading global companies, has uncovered a very troubling and previously unreported fact:\n\nThe vaccines are heavily contaminated with a variety of nanoparticles.\n\nMany of the particles are metals.\n\nWe’re talking about traditional vaccines, such as HPV, flu, Swine Flu, Hepatitis B, MMR, DPT, tetanus, etc.\n\nTo begin to understand some of the destructive effects of contaminating nanoparticles in vaccines, here is the groundbreaking 2017 study:\n\nInternational Journal of Vaccines & Vaccination\n\n Volume 4 Issue 1\n\n January 23 2017\n\n New Quality-Control Investigations on Vaccines:\n\n Micro- and Nanocontamination\n\n Antonietta M Gatti and Stefano Montanari\n\n“The analyses carried out show that in all samples checked vaccines contain non biocompatible and bio-persistent foreign bodies which are not declared by the Producers, against which the body reacts in any case. This new investigation represents a new quality control that can be adopted to assess the safety of a vaccine. Our hypothesis is that this contamination is unintentional, since it is probably due to polluted components or procedures of industrial processes (e.g. filtrations) used to produce vaccines…”\n\n“The quantity of foreign bodies detected and, in some cases, their unusual chemical compositions baffled us. The inorganic particles identified are neither biocompatible nor biodegradable, that means that they are biopersistent and can induce effects that can become evident either immediately close to injection time or after a certain time from administration. It is important to remember that particles (crystals and not molecules) are bodies foreign to the organism and they behave as such. More in particular, their toxicity is in some respects different from that of the chemical elements composing them, adding to that toxicity…they induce an inflammatory reaction.”\n\n“After being injected, those microparticles, nanoparticles and aggregates can stay around the injection site forming swellings and granulomas…But they can also be carried by the blood circulation, escaping any attempt to guess what will be their final destination…As happens with all foreign bodies, particularly that small, they induce an inflammatory reaction that is chronic because most of those particles cannot be degraded. Furthermore, the protein-corona effect…due to a nano-bio-interaction…can produce organic/inorganic composite particles capable of stimulating the immune system in an undesirable way…It is impossible not to add that particles the size often observed in vaccines can enter cell nuclei and interact with the DNA…”\n\n“In some cases, e.g. as occurs with Iron and some Iron alloys, they can corrode and the corrosion products exert a toxicity affecting the tissues…”\n\n“Given the contaminations we observed in all samples of human-use vaccines, adverse effects after the injection of those vaccines are possible and credible and have the character of randomness, since they depend on where the contaminants are carried by the blood circulation. It is only obvious that similar quantities of these foreign bodies can have a more serious impact on very small organisms like those of children. Their presence in the muscles…could heavily impair the muscle functionality…”\n\n“We come across particles with chemical compositions, similar to those found in the vaccines we analyzed, when we study cases of environmental contamination caused by different pollution sources. In most circumstances, the combinations detected are very odd as they have no technical use, cannot be found in any material handbook and look like the result of the random formation occurring, for example, when waste is burnt. In any case, whatever their origin, they should not be present in any injectable medicament, let alone in vaccines, more in particular those meant for infants.”\n\nThis 2017 study opens up a whole new field: the investigation of nanoparticles in vaccines where none were expected.\n\nSuch particles are not medicine in any sense of the word.\n\nMany legal and scientific “experts” assert the State has a right to mandate vaccines and force them on the population. But these contaminating nanoparticles are not vaccines or medicines. Only a lunatic would defend the right of the State to inject them.\n\nHere is another section from the 2017 study. Trade names of vaccines, and compositions of the nanoparticle contaminants are indicated. Take a deep breath and buckle up:\n\n“…further presence of micro-, sub-micro- and nanosized, inorganic, foreign bodies (ranging from 100nm to about ten microns) was identified in all cases [all 44 vaccines], whose presence was not declared in the leaflets delivered in the package of the product…”\n\n“…single particles, cluster of micro- and nanoparticles (less than 100nm) and aggregates…debris of Aluminum, Silicon, Magnesium and Titanium; of Iron, Chromium, Silicon and Calcium particles…arranged in a cluster, and Aluminum-Copper debris…in an aggregate.”\n\n“…the particles are surrounded and embedded in a biological substrate. In all the samples analyzed, we identified particles containing: Lead (Typhym, Cervarix, Agrippal S1, Meningitec, Gardasil) or stainless steel (Mencevax, Infarix Hexa, Cervarix. Anatetall, Focetria, Agrippal S1, Menveo, Prevenar 13, Meningitec, Vaxigrip, Stamaril Pasteur, Repevax and MMRvaxPro).”\n\n“…particles of Tungsten identified in drops of Prevenar and Infarix (Aluminum, Tungsten, Calcium chloride).”\n\n“Some metallic particles made of Tungsten or stainless steel were also identified. Other particles containing Zirconium, Hafnium, Strontium and Aluminum (Vivotif, Meningetec); Tungsten, Nickel, Iron (Priorix, Meningetec); Antimony (Menjugate kit); Chromium (Meningetec); Gold or Gold, Zinc (Infarix Hexa, Repevax), or Platinum, Silver, Bismuth, Iron, Chromium (MMRvaxPro) or Lead,Bismuth (Gardasil) or Cerium (Agrippal S1) were also found. The only Tungsten appears in 8/44 vaccines, while Chromium (alone or in alloy with Iron and Nickel) in 25/44. The investigations revealed that some particles are embedded in a biological substrate, probably proteins, endo-toxins and residues of bacteria. As soon as a particle comes in contact with proteic fluids, a nano-bio-interaction…occurs and a ‘protein corona’ is formed…The nano-bio-interaction generates a bigger-sized compound that is not biodegradable and can induce adverse effects, since it is not recognized as self by the body.”\n\n“…examples of these nano-bio-interactions. Aggregates can be seen (stable composite entities) containing particles of Lead in Meningitec… of stainless steel (Iron, Chromium and Nickel…) and of Copper, Zinc and Lead in Cervarix…Similar aggregates, though in different situations (patients suffering from leukemia or cryoglobulinemia), have already been described in literature.”\n\nI’m sure you’ve read official assurances that vaccine-manufacturing problems are “rare.” You can file those pronouncements along with other medical lies.\n\n“I’d like the heavy metal sandwich on rye, please. And instead of serving it on a plate, can you inject it?”\n\nSeveral vital questions demanding answers spring from the findings of this 2017 study:\n\nAre some of these nanoparticles intentionally placed in vaccines?\n\nDoes the standard manufacturing process for traditional vaccines INEVITABLY lead to dangerous and destructive nano-contamination?\n\nNew nano-technology is already being employed in vaccines—supposedly “improving effectiveness.” Does this manufacturing process carry with it the unavoidable effect of unleashing a hurricane of nanoparticle contaminants?\n\nHow many cases of childhood brain damage and autism can be laid at the door of nanoparticle contamination?\n\nAnd finally, where are these contaminated vaccines manufactured? The above study did not attempt to discover this. It was outside the scope of the research. It’s common knowledge that, for example, in the case of the US, vaccines or their components, are, in many instances, not produced domestically. Where does this put control of safety? In, say, China, where there have been numerous pharmaceutical scandals connected to contamination of products?\n\nThe vaccine establishment does not show the slightest interest in answering any of these questions. They are busy pretending the questions don’t exist.\n\nTrusting the establishment would be suicidal.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["nanoparticles", "vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://medcraveonline.com/IJVV/new-quality-control-investigations-on-vaccines-micro--and-nanocontamination.html", "https://web.archive.org/web/20200604111734/https://medcraveonline.com/IJVV/new-quality-control-investigations-on-vaccines-micro--and-nanocontamination.html", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Sep15"}