{"result_id": "225045", "URL": "https://blog.nomorefakenews.com/2023/01/13/the-coronavirus-vaccine-as-a-source-of-dangerous-invasion-2/", "timestamp": "2023-04-25 16:37:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2023/01/13/the-coronavirus-vaccine-as-a-source-of-dangerous-invasion-2/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "The Coronavirus Vaccine as a source of dangerous invasion « Jon Rappoport's Blog", "cleaned_text": "Continuing my “greatest COVID hits” articles. To read my introduction to this ongoing series, go here. To support my work and get value for value, order My Matrix Collections here and subscribe to my substack here.\n\nThis article is based on the research of Annie Logical. Her far-reaching, many-branched piece, “Corona Virus Fakery And The Link To 5G Testing,” can be found at vigiliae.org.\n\nIn prior pieces (see here and here), I documented two of the experimental technologies that may be unleashed on the public, in the rush to develop a coronavirus vaccine.\n\nDNA vaccines inject synthesized genes. The recipient’s genetic makeup is altered PERMANENTLY in unknown ways. RNA vaccines carry the potential to trigger autoimmune reactions: the body attacks aspects of itself.\n\nAs if that weren’t enough, there is another element deployed in DNA vaccines. It’s called electroporation.\n\nAn online dictionary provides a definition: “the action or process of introducing DNA or chromosomes into bacteria or other cells [including human cells] using a pulse of electricity to briefly open the pores in the cell membranes.”\n\nA pioneer in this field is Dr. David Weiner. He is the co-founder of a San Diego company, Inovio Pharmaceuticals.\n\nNBC San Diego, January 25, 2020: “A San Diego biotech company just received a $9 million grant to develop a vaccine for the coronavirus. Inovio Pharmaceuticals received a grant from the Coalition for Epidemic Preparedness Innovations (CEPI).”\n\nIf Inovio wins a license to sell their version of a DNA coronavirus vaccine, electroporation will undoubtedly be brought along as part of the technology.\n\nHere is an excerpt from an article, “What you always needed to know about electroporation DNA vaccines,” published in the journal, Human Vaccines and Immunotherapeutics, November 1, 2012: “…the cell membrane also needs to be in a permeabilized [“opened”] state in order to allow passage of the DNA molecule…[Electric] Pulses may be optimized to achieve either a greater degree of permeability of the cell membrane (for passive diffusion of drugs), or a greater degree of electrophoretic effect. As mentioned below, there are various ways to go about this, but generally a series of short high voltage pulses (e.g., 8 pulses of 0.1 ms at 1,000 V/cm voltage to electrode distance) is used for drug delivery, and a combination involving long low voltage pulses is used for DNA transfer [into human cells] (e.g., 1 pulse of 0.1 ms, 800 V/cm and 1 long pulse of 400 ms 80 V/cm).”\n\nIn a nutshell, this means that human cells, whose membranes are “too tight” to allow DNA to be injected into them, will be “opened up” by electric pulses, in order to deliver the new type of vaccine.\n\nApparently, it doesn’t occur to the researchers that human cells may be as “tight” as they are for a reason; and forcing them open with electric pulses, in order to inject DNA, could have unforeseen effects.\n\nElectroporation isn’t the same kind of invasive action as, say, cutting into flesh to remove a bullet, during emergency surgery. The DNA vaccines, along with electric pulses, would be given to healthy people.\n\nBut as long as we think of ourselves as guinea pigs, willing to sit still for all sorts of medical experiments, what difference does it make? Genetic-altering vaccines, the body attacking itself, electroporation—if we surrender to the experts, and their assurances, I’m sure everything will be all right.\n\n“Here’s what we’re doing. It’s quite innovative. You see, with electric pulses, we briefly open up cells and inject DNA, synthesized genetic material, into them. Ordinarily, the cells would reject such an intrusion, but we get around that. Once the genetic material is inside cells, it mimics a virus, and the immune system responds, as if this were an actual viral disease. That’s the vaccine effect. It’s wonderful. Safe. Nothing dangerous could happen…”\n\nThese “Greatest COVID Hits” Series Of Articles are archived under the category Covid Revisited\n\nThese articles — at the time of original publication — are archived under the category Covid\n\nTo read Jon’s articles on Substack, click here.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://blog.nomorefakenews.com/2022/10/03/introduction-to-my-greatest-covid-hits-series-of-articles/", "https://marketplace.mybigcommerce.com/", "https://jonrappoport.substack.com/subscribe", "https://web.archive.org/web/20200226022617/https://www.vigiliae.org/virus-link-to-5g/", "https://blog.nomorefakenews.com/2022/10/14/vaccine-for-the-china-virus-the-planet-is-the-guinea-pig-for-a-vast-experiment-2/", "https://blog.nomorefakenews.com/2022/12/07/new-vaccines-will-permanently-alter-your-dna-2/", "https://blog.nomorefakenews.com/category/covid-revisited/", "https://blog.nomorefakenews.com/category/covid/", "https://jonrappoport.substack.com/p/new-podcast-the-transgender-and-transhumanist", "https://jonrappoport.substack.com/p/new-podcast-the-transgender-and-transhumanist-e6e", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://jonrappoport.substack.com/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Jan13"}