{"result_id": "225013", "URL": "https://blog.nomorefakenews.com/2021/11/18/covid-vaccine-missing-key/", "timestamp": "2023-04-25 16:36:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/11/18/covid-vaccine-missing-key/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "COVID vaccine: missing key « Jon Rappoport's Blog", "cleaned_text": "—In the US alone, reported COVID vaccine injuries have topped 600,000. The well-known Harvard Pilgrim study concludes you should multiply the number of reported vaccine injuries by 100 to arrive at a true number—\n\nIn any field where information is vital, the omissions are often worse than the lies.\n\nIn this article, I point out one such glaring omission, when it comes to the safety of COVID vaccines.\n\nTracking vaccine injuries and deaths through reports to databases is one avenue; another avenue would be direct studies of people who have been vaccinated.\n\nProper studies have not been done. Omission.\n\nThis would be a proper study: For starters, based on what MANY clinicians are seeing, develop/confirm true markers for: blood clots, including micro-clots; specific heart dysfunctions; miscarriages; menstrual cycle disruption; infertility; toxic effects on cells (e.g., the presence of graphene oxide); the appearance of the spike protein in cells, in areas of the body where the protein should not appear.\n\nEnroll, in a modest pilot study, 1000 people who have received one of the RNA COVID vaccines. Run tests on these people (blood, tissue, pictures) looking for these markers.\n\nI’m NOT talking about a few photos of one patient’s blood. I’m talking about a full study of 1000 people, for starters.\n\nYou would think such a study has already been done, because only sheer ignoramuses or criminals would fail to realize that, when you inject people with substances, you should discover the effects BY STUDYING THE EFFECTS.\n\nSomebody suffers a blow to the head, you take a picture of the head and look at the effects. Somebody injects a person with liquid containing 10 ingredients, you run tests to find out what negative consequences may have occurred.\n\nUnfortunately, most people are so hypnotized by the IDEA of medical science, they assume that if a study hasn’t been done, it doesn’t need to be done.\n\nLab workers all over the world will torture test animals, by injecting them with larger and larger doses of a compound in a new cosmetic, to discover the dose that kills the animals. But doing harmless tests on people who have received a new vaccine is out of the question.\n\nTo gain insight on the scientists who refuse to run the tests I’m proposing on vaccinated people, these are the same scientists who say, “Yes, a number of people died after vaccination, but there is no evidence the injection caused those deaths.”\n\nWhat they mean is, “We didn’t look to see whether the vaccine caused the deaths, and furthermore, we don’t know how to establish causation. We’ve never worked that out.”\n\nWhich is like saying, “The chemical that entered the river from a pipe in the factory? We haven’t done sufficient studies on the chemical to determine whether it causes cancer. Therefore, the 96 plaintiffs with cancer who are suing the company have no case. Causation cannot be proved. It will never be proved, because we will never study the chemical.”\n\nThere is another factor at work. Many people who are interested in scandals are only interested in the details of overt crimes. “They shot him and buried his body in a landfill? Are there pictures of the decaying corpse? The killer was married to the victim’s sister? Was she in on it?”\n\n“Clinton and Monica in a little room off the Oval Office? Did you see the photo of the stained dress?”\n\nIf you tell these people the biggest scandal in a situation is OMISSION— what DIDN’T HAPPEN, WHAT SHOULD HAVE BEEN DONE, BUT WASN’T—they fade out and walk away.\n\nAsk these people the following question: Which would you prefer? LOOKING at one microscope photo of one drop of blood from one vaccinated person that might show a wiggling line that might be a live organism? Or KNOWING that the absolutely essential safety study of a vaccine that has been injected into 3.6 billion people has never been done?\n\n“Let me see the picture. I want to see the photo. Where’s the wiggle?”\n\nThis article is for the people who give the other answer.\n\nAnd for scientists who know that mass maiming and killing also involve a crime of omission.\n\n“We know the vaccines are safe because we didn’t study the people who got the vaccine.”\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://openvaers.com/covid-data", "https://rickjaffeesq.com/2021/02/19/what-the-heck-is-the-harvard-pilgrim-study-and-did-it-really-say-that-about-the-underreporting-of-vaccine-adverse-events/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Nov18"}