{"result_id": "225028", "URL": "https://blog.nomorefakenews.com/2021/11/23/a-pandemic-of-the-vaccinated/", "timestamp": "2023-04-25 16:36:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/11/23/a-pandemic-of-the-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "A pandemic of the vaccinated « Jon Rappoport's Blog", "cleaned_text": "And to keep the REAL pandemic going, we must have vaccine mandates and passports and crackdowns on the unvaccinated\n\nDaily Mail, November 18, 2021: “Dr. Anthony Fauci, the director of the National Institute for Allergy and Infectious Diseases, said waning immunity from the initial shots is leading to a rise in severe cases among immunized Americans. ‘What we’re starting to see now is an uptick in hospitalizations among people who’ve been vaccinated but not boosted’…”\n\nNY Times podcast, November 12, 2021; Fauci states: “They are seeing a waning of [vaccine-induced] immunity not only against infection but against hospitalization and to some extent death, which is starting to now involve all age groups. It isn’t just the elderly.”\n\nTranslation: The vaccine is severely injuring and killing MANY people, but of course we’re calling those injuries and deaths “COVID-19 disease.” Also, our solution to this catastrophe is piling on MORE injections (boosters), which will hospitalize and kill even MORE people.\n\nThe dailyexpose.uk has the much deeper story:\n\n“The public are being repeatedly lied to by elected officials, unelected advisors, and the mainstream media, with all of them claiming that the world is currently experiencing a Pandemic of the Unvaccinated. This could not be further from the truth.”\n\n“But the lie has now been used to justify locking down the unvaccinated in Austria, and locking the unvaccinated out of society in Australia.”\n\n“Now Germany is about to follow suit, Scotland is about to ban the unvaccinated from pubs and restaurants under the advice of a qualified nutritionist posing as a Pandemic expert who goes by the name of Devi Sridhar, and the authorities and media in England have gone into overdrive on the advice of the ‘nudge unit’ to sway the population into supporting a lockdown for only the unvaccinated.”\n\n“But it all makes absolutely no sense because official Public Health data shows that over the past three months… two-thirds of Covid-19 hospitalisations [people who get very sick from the shot] have been among the fully vaccinated, and a frightening 91% of Covid-19 deaths [people who die from the shot] have been among the fully vaccinated, and projections shows things are about to get a lot worse.”\n\n“…in the week beginning November 6th a total of 773 Covid-19 hospitalisations [people injured by the shot] were confirmed in Scotland. Of these 137 were among the unvaccinated population, whilst 363 were among the vaccinated population.”\n\n“…the fully vaccinated accounted for the majority of hospitalisations [in Scotland] between October 16th and November 12th, and again by taking into account hospitalisations as far back as August 23rd we can see that things have been getting progressively worse for the fully vaccinated by the week.”\n\n“In the week beginning August 21st the vaccinated accounted for 68% of hospitalisations, but fast forward to the week beginning November 6th and we can see that the vaccinated accounted for 73% of hospitalisations.”\n\n“The worst week so far for the vaccinated however, in terms of hospitalisations, came in the week beginning October 16th which saw the vaccinated population account for 79% of Covid-19 hospitalisations [people injured by the shot].”\n\n“[In Scotland]…the fully vaccinated accounted for the overwhelming majority of Covid-19 deaths [deaths from the shot] between October 9th and November 5th 2021. But by also taking into account the number of…deaths by vaccination status as far back as August 14th we’re able to see that things are getting significantly worse for the fully vaccinated population by the week…”\n\n“…the week beginning August 14th the vaccinated accounted for 78% of deaths, but fast forward to the week beginning October 30th and we can see that the vaccinated accounted for 85% of deaths.”\n\nSwitching from Scotland to England: “The latest Public Health England technical briefing on Covid-19 variants of concern has been published and it reveals that up to the 12th September 2021, 74% of all alleged Covid-19 deaths since August 2nd 2021 [people killed by the shot] have been among the vaccinated population, confirming the UK is currently experiencing a pandemic of the vaccinated.”\n\nBut don’t worry, be happy. The solution—endless toxic boosters—will surely save the day. And by “save the day,” I mean tens or even hundreds of millions of lives will be ruined and ended.\n\nAnd by “save the day,” I also mean the news media will cover all this up and continue to promote an alternative fantasy of a universe, in which the vaccine is a rescuing rainbow and the unvaccinated are terrorists.\n\nThere’s magic at work here. If you believe what the news media are telling you, then you’ll remain vibrant and healthy (if you take the vaccine and all the boosters). If you don’t take the vaccine, you’re doomed. It’s really quite something. Those talking news heads are elves from the forest. With every word they utter, they cast powerful spells.\n\nThat’s why the really smart people trust the news and embrace the elves.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["Fauci", "vaccine", "lockdown"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Nov23"}