{"result_id": "225017", "URL": "https://blog.nomorefakenews.com/2021/10/05/wheres-the-biden-executive-order-mandating-the-vaccine/", "timestamp": "2023-04-25 16:36:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/10/05/wheres-the-biden-executive-order-mandating-the-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Where is the Biden Executive Order mandating the vaccine? Does it exist? « Jon Rappoport's Blog", "cleaned_text": "I’m talking about the Executive Order (EO) commanding all US companies with more than 100 employees to mandate the COVID vaccine for those employees.\n\nI can’t find the EO. I don’t see it in the Federal Register, where it’s supposed to be published. (Note: the following two Biden EOs only cover Federal employees and Federal contractors.)\n\nIf it hasn’t been published, then there is no mandate.\n\nIf there is no mandate yet, then obviously, none of the companies are under any obligation to enforce it.\n\nOSHA is apparently the federal agency responsible for framing a set of regulations for the mandate, including fines. But federal agencies only construct regulations after a law has been passed or an EO is issued.\n\nIf I’m correct, and no EO has been published, we have an odd situation, to say the least.\n\nGovernors and lawyers have been threatening to sue, because the EO is unconstitutional and overrides state powers. But if there is no Presidential EO, then all these legal cases would be meaningless, because, again, there is no official mandate.\n\nIs the White House stalling? Do they realize the EO and the mandate will be overturned in court? Are they hoping to achieve corporate compliance without an official mandate?\n\nI’ve queried several lawyers. One suggested that so far, in this situation, the feds are mandating by bluffing.\n\nThat indeed would be extraordinary.\n\nMaybe the EO is forthcoming as we speak. Possibly (though I can’t imagine it), it’s been published somewhere other than the Federal Register. But until it’s visible and official, there is no private-sector mandate.\n\nUnless speeches and press releases and media coverage suddenly, all by themselves, have the force of law.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["mandates", "vaccine", "Biden"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://www.federalregister.gov/presidential-documents/executive-orders/joe-biden/2021", "https://www.federalregister.gov/documents/2021/09/14/2021-19927/requiring-coronavirus-disease-2019-vaccination-for-federal-employees", "https://www.federalregister.gov/documents/2021/09/14/2021-19924/ensuring-adequate-covid-safety-protocols-for-federal-contractors", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Oct5"}