{"result_id": "225001", "URL": "https://blog.nomorefakenews.com/tag/vaccine/", "timestamp": "2023-04-25 16:36:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/tag/vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "vaccine « Jon Rappoport's Blog", "cleaned_text": "Let’s get one thing straight. I’m not writing for your mother-in-law. I’m writing for you.\n\nYour mother-in-law is still deciding whether to vote for Jimmy Carter or Ronald Reagan. She thinks J Edgar Hoover is Herbert Hoover.\n\nA few readers have suggested I should make several adjustments, so my work is more “accessible” to the general public.\n\nThe general public is a collectivist cheeseball which has been sitting in a frying pan, with the flame set on low, for a very long time.\n\nI published my first article in 1982. I’ve never made any adjustments.\n\nSince then, I’ve only worked one change. I stopped taking assignments from editors. I don’t like them. I’ve always had the crazy notion that if editors want writers to carve away THIS and add THAT, they should write the pieces themselves. There are three reasons they don’t: they can’t write; they’re filled with self-importance; they’re lazy bureaucrats.\n\nFor me, writing has ebbs and flows. They depend on me finding a tag-end I like, which I then pull on. The article then takes shape. The tag-end might be a headline I read. It might be some absurd insane sentence uttered by a news anchor. It might be a scene in a dream. It might be an answer to the question, “What would be crazier than the last tag-end I found?”\n\nIf I can’t think of a tag, I sit here and stare at the wall and keep thinking. Or I watch a cooking show. Or I go over the five or six pretentious scuzzy reasons doctors deploy when they assure readers the virus exists. Or I fly my Gulfstream to London, where I dine with the Queen, and discuss how non-existent climate change will force us to eat insects for protein. Or I find a medical review admitting that, in 2001, only 18 flu deaths in the US could be traced to a flu virus. Actually, the number is zero. Or I reread the NY Times opinion piece which revealed the three major clinical trials of the COVID vaccines were designed to show the injection could prevent nothing more serious than cough, chills, and fever—after which the Times never mentioned the subject again. Or I consider how fear of the virus and love of the virus and the conviction the virus exists merge like a subconscious nursery rhyme. Or I imagine a time when men and women would have laughed off orders to lock down and would have gone about their lives without a second thought. And THAT’S a tag-end:\n\nJULY 20, 2020. Look at what happened to a great city, to the people of that city, who over several decades were subjected to forms of cultural mind control…and who then became DIFFERENT.\n\n…People turning into caricatures of themselves. In the process, they were ripened for takeover—which is what happened when the fake pandemic was declared.\n\nNew York. Once upon a time, I was married to it. No more. But it’s still my city.\n\nI was born there. One of my early memories was looking across 2nd Avenue at a candy store. This was 1943. The candy store no longer sold Fleer’s bubble gum—the best bubble gum—because the latex was needed for the War effort. But the rumor was, they peddled it under the counter for an exorbitant two cents a chunk, with the cartoon inside the wrapper.\n\nWhen I was 22, after growing up in the suburbs, I moved back to NY and for several years lived among some of the smartest asymmetric people in the world. You could have an argument with the dumbest person in the city and it would be a smart argument. Everyone had opinions, and they could back them up. There was no such thing as political correctness, believe me. If you had uttered the phrase, no one would have known what you were talking about.\n\nNew York was a great city. The thing was, no one was proud to BE a New Yorker. That false synthetic layer of goo came much later. In the old days, there was no pose, no artificial front. People had ideas, they had talent, they had survival instincts.\n\nThe best jazz musicians in the world lived and played in New York. When a giant like Bud Powell was playing at Birdland, you could get in for a dollar and sit in a hard wooden chair and listen to him until two in the morning. A buck for the greatest pianist in the world.\n\nAnd now, the city is wrecked and boarded up, and the people are locked in.\n\nOut on the street, the few aimless glazed pedestrians wear masks. They’re not the same people. They’re replacements. Pods.\n\nOVERNIGHT, the people of New York could throw off the whole phony pandemic, not only for themselves, but the world. They could come out of their apartments and go back to work, defying the petty little lunatics like Cuomo and De Blasio. They could open up their restaurants and bars and stack in the customers. They could start building again. They could open wide the libraries and museums and fill the concert halls. They could open up the little groceries to all comers. They could laugh in the face of the public health authorities.\n\nAnd it would be OVER.\n\nIn 1960, that’s exactly what would have happened. And not for some cause. Not for the chance to do a little virtue signaling. Not for the sake of “being a New Yorker.” For survival. For continuing to live their lives, people would have shaken off that slimy fraud Fauci like a five-minute bad dream. A joke played by an idiot.\n\nThey would have looked at the screaming lockdown headlines in the newspapers on the corner stand and shrugged and gone on their way. “You’re telling me I can’t walk down the street and listen to John Coltrane at the Jazz Gallery on a summer night? You’re out of your mind.” And the Termini brothers, who owned the club, would have packed the place even tighter than usual, just to thumb their noses at the mayor and his con artists. They would have put in a call to their contact at Democratic Machine headquarters. And it would have been OVER.\n\nNo one would have obeyed. Independent scholars would have walked into the 42nd St. library, as they did every day, and gone to the reference desk and asked for manuscripts on ancient Roman law and the Walt Whitman papers and the early maps of the city. The quiet upstairs macrobiotic restaurant on 2nd Avenue would have served supper as usual. The Cedar Bar on University Place would have turned in another raucous night. The Irish bars would have been jammed. A chamber orchestra in Washington Square Park would have performed Vivaldi, with the sounds of traffic from 6th Avenue in the background. Miles Davis would have played two sets at the Apollo. If Ravi Shankar was in town, he would have laid out a few stunning hours of ragas at the Asia Society and adjourned to an East Side apartment to continue on until dawn. No one and nothing would have obeyed a lockdown.\n\nThat New York…where is it? Who are all these flat minds swearing allegiance to medical fakery? Are they passively waiting for gold stars on the blackboard from the teacher?\n\nIn the old days, New York had DISDAIN. You didn’t get by with platitudes. You didn’t blithely mouth Left or Right and get away with it. The city was plugged into its own non-stop bullshit detector. What did you have to OFFER? Aimless blabbermouths were consigned to a special circle of Hell.\n\nThere was no political PROGRAM. Today’s “New Yorkers” would apparently be afraid to live in a landscape like that. They wouldn’t know which way to turn. They have a desperate need to become slaves to an IDEA. In this case, an idea about a virus.\n\nIn the 1960s, concealed by the Vietnam War, the city was undergoing a transformation into a cartoon of itself. That’s when the synthetic notion of “being a New Yorker”—based on nothing—started to take hold.\n\nThere were many reasons. The shrinking value of the dollar. Crippling street drugs. Mind numbing leveling television. The raising of children to be targets of advertising and fetish objects in a consumer society. The new New Yorkers were taught that liberal politics were a necessary adjunct of their status. Liberal equaled big government. Messaging from every possible quarter was aimed at turning the people of the city into servants of share and care as defined by government…\n\nGoing to doctors and acquiring serial diagnoses of physical and mental conditions was starting to take off as a social trend. The medicines and the vaccines were, of course, toxic. The city was taking in more immigrants than it could handle. There weren’t enough jobs. Desultory schools were steamrollered. Literacy was being destroyed. Even skyscraper architecture was moving away from unique structures like the Chrysler and the Empire State, into functional steel and glass boxes. Signs of the minds.\n\nWith people dumbed down enough, they would fall for any con. Any piece of shiny gloss. And it was eventually provided:\n\nNew York media covered the rise of New Money in the city as if it were a perfumed cultural signal of a dawning utopia. By the 1970s, envious intellectuals in the city were reading and admiring hyped chronicles of the emerging $$ stars of Manhattan: painters, fashioneers, stock speculators. And yes, Trump. The content of these celebs’ characters was entirely irrelevant. All that mattered was that their hustles were ringing up extraordinary sales in inflated dollars.\n\nAnd finally, to view how thin and vulnerable new New York had become, and how brainless—when, in 2020, the fake pandemic hit, and lockdowns were announced, the population promptly folded, stayed indoors, went into mask and social distance mode without a whisper of protest.\n\nIn short order, the city was made over into abject wreckage, shuttered, obedient, loyal to a psychotic delusion.\n\nIn a silly song he recorded long after its internal demise, Frank Sinatra said New York was the city that never sleeps.\n\nNow that’s all it does.\n\nCODA: If the September 11th attacks had happened in 1960, there would have been no need for Billy Joel or the Yankees to rally “all New Yorkers.” The people of the city would have looked at the firemen and cops as human heroes risking everything for other humans. Period. That would have been enough. More than enough. That would have gone deep into souls and minds. Where it counts.\n\n—Entraining minds. The job of the Super-State. Reworking independence into devotion to a synthetic pose of altruism.\n\nBut in this phony pandemic, it’s good to be BAD…\n\nI’m not talking about looting and burning. I’m talking about a different type of BAD. Think it through. Figure it out. It’s always there, like a tag-end. You just have to pull on it…\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine", "mrna", "nanoparticles", "podcast", "virus", "testing", "medical infanticide"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine"], "authors": [], "publish_date": "Feb6"}