{"result_id": "225043", "URL": "https://blog.nomorefakenews.com/2021/05/11/covid-vaccine-can-worsen-disease-mainstream-study-not-on-the-evening-news/", "timestamp": "2023-04-25 16:37:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/05/11/covid-vaccine-can-worsen-disease-mainstream-study-not-on-the-evening-news/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "COVID Vaccine can worsen disease; mainstream study; not on the evening news « Jon Rappoport's Blog", "cleaned_text": "“COVID-19 vaccines designed to elicit neutralising antibodies may sensitise vaccine recipients to more severe disease than if they were not vaccinated.”\n\nFeel free to take THAT to a doctor.\n\nThis quote appears in an October 2020 study, published in the International Journal of Clinical Practice. The title of the study: “Informed consent disclosure to vaccine trial subjects of risk of COVID-19 vaccines worsening clinical disease.” [1]\n\nThe two authors are Timothy Cardozo and Ronald Veazy. Cardozo’s affiliation is listed as “Department of Biochemistry and Molecular Pharmacology, NYU Langone Health, New York, NY, USA.” Veazy’s affiliation is “Division of Comparative Pathology, Department of Pathology and Laboratory Medicine, Tulane University School of Medicine, Tulane National Primate Research Center, Covington, LA, USA.”\n\nThe study declares that volunteers in COVID vaccine clinical trials and people who receive the vaccine after clinical trials—meaning now—should be informed there is a risk of “more severe disease than if they were not vaccinated.”\n\nSo that’s what I’m doing.\n\nHave you heard of anyone about to receive the vaccine being INFORMED that they’re at risk—that they’re liable to become more seriously ill than if they refused the shot?\n\nOf course not. Politicians, news people, and other idiots simply take the word “vaccine” and push it like a street dealer pushes heroin.\n\nConsent given by the patient, after being truly informed, is a bedrock medical responsibility.\n\nThe claim that a declared crisis overrides a person’s need to understand what is being done to him is a criminal claim.\n\nLooking at how the COVID vaccination campaign is being conducted, anyone can see informed consent is being violated to its core.\n\nManufactured hysteria is not an acceptable substitute for moral duty.\n\nModern-day fascists believe that “ten thousand bloviating Faucis” declaring the vaccine is absolutely safe and effective is actual science.\n\nMonths ago, I wrote a piece that fits nicely with this article. Based on a New York Times op ed by Peter Doshi and Eric Topol—the clinical trials of the COVID vaccine conducted by Pfizer, AstraZeneca, and Moderna were designed to prove nothing more than: [2] [3]\n\nThe vaccine could prevent a cough, or chills and fever (diagnosed as COVID-19).\n\nNow follow this. The vaccine makers were waiting for the SARS-CoV-2 virus to descend on some volunteers during the clinical trials.\n\nBut since the volunteers were healthy, how long would it take for “serious cases of COVID”—pneumonia—to show up? Three years? Ten years? Never?\n\nThe vaccine makers certainly weren’t going to wait. No, they were going to stop the clinical trial when 150 of the 30,000 volunteers were diagnosed with “mild COVID”—a cough, or chills and fever.\n\nThen they were going to see how many people who actually got the vaccine vs. how many people who got a saltwater placebo shot received a COVID-19 diagnosis.\n\nTHAT was the essence of the clinical trial.\n\nOf course, all three vaccine makers claimed that far more people in the placebo group were diagnosed with COVID—thus “proving” the vaccine was effective.\n\nEffective at preventing “a mild case of COVID”—a cough, or chills and fever—both of which cure themselves naturally, without the need for a vaccine.\n\nSo now, as vaccine-caused deaths escalate daily [4], this destructive genetic shot is being given to people all over the world [5] [6] [7]. There is no authentic informed consent that spells out the incredible danger. And the vaccine was never meant to prevent more than a cold or mild flu.\n\nYet you’re supposed to develop a suicidal impulse, take the shot, and earn your vaccine passport or virtue-signaling immunity bracelet or microchip so you can enlist in the Brave New World.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://pubmed.ncbi.nlm.nih.gov/33113270/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "May11"}