{"result_id": "225027", "URL": "https://blog.nomorefakenews.com/2022/02/18/vaccine-shedding-spreads-disaster-to-unvaccinated-pregnant-women/", "timestamp": "2023-04-25 16:36:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2022/02/18/vaccine-shedding-spreads-disaster-to-unvaccinated-pregnant-women/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Vaccine shedding spreads disaster to unvaccinated pregnant women? « Jon Rappoport's Blog", "cleaned_text": "Since the COVID vaccines were authorized, MANY women have posted reports of disrupted and unusual menstrual cycles, heavy bleeding, and miscarriages.\n\nWhat’s more, some of these women state they haven’t received the COVID vaccine, but they’ve been in close contact with others who have been vaccinated—leading to the question:\n\nCan the COVID RNA vaccine (which is actually an experimental genetic treatment) “shed” something harmful that can be passed from person to person?\n\nWhat does Pfizer say about the dangers to pregnant women?\n\nLet’s consider a key Pfizer document, describing procedures to be followed in its clinical trial of the COVID vaccine. The document is titled:\n\n“A PHASE 1/2/3, PLACEBO-CONTROLLED, RANDOMIZED, OBSERVER-BLIND, DOSE-FINDING STUDY TO EVALUATE THE SAFETY, TOLERABILITY, IMMUNOGENICITY, AND EFFICACY OF SARS-COV-2RNA VACCINE CANDIDATES AGAINST COVID-19 IN HEALTHY INDIVIDUALS.”\n\nOn page 67, we find a warning about potential adverse effects of the vaccine. The abstruse term “study intervention” pops up. It surely means “vaccination.” “Environmental exposure” means contact with elements of the vaccine other than by injection.\n\nWarning of adverse effect: “A female is found to be pregnant while being exposed or having been exposed to study intervention due to environmental exposure. Below are examples of environmental exposure during pregnancy:”\n\n“A female family member or healthcare provider reports that she is pregnant after having been exposed to the study intervention by inhalation or skin contact.”\n\n“A male family member or healthcare provider who has been exposed to the study intervention by inhalation or skin contact then exposes his female partner prior to or around the time of conception.”\n\nThese warnings, from the vaccine manufacturer, Pfizer, are shocking. They imply that pregnant women can be harmed by breathing in, or contacting by skin, the vaccine as it moves from person to person. Which would be “shedding.”\n\nAnd what is being transferred from person to person? What is in the vaccine? Genetic material. RNA. RNA encapsulated in toxic lipid nanoparticles.\n\nThe Pfizer document states that, if any of these “adverse events” involving pregnant women occur during the clinical trial of the vaccine, they must be reported.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://media.tghn.org/medialibrary/2020/11/C4591001_Clinical_Protocol_Nov2020_Pfizer_BioNTech.pdf", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Feb18"}