{"result_id": "225040", "URL": "https://blog.nomorefakenews.com/2020/09/21/exposed-new-federal-court-to-handle-expected-covid-vaccine-injury-claims/", "timestamp": "2023-04-25 16:37:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2020/09/21/exposed-new-federal-court-to-handle-expected-covid-vaccine-injury-claims/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Exposed: There’s a new federal court to handle all the expected COVID vaccine-injury claims « Jon Rappoport's Blog", "cleaned_text": "The simple truth is: the US government is anticipating many people will be filing claims for compensation, when their family members are harmed or killed by a new COVID vaccine.\n\nOf course, the government isn’t coming right out and admitting that.\n\nThe press will tout the usual excuses for injury and death. “He died from COVID, not the vaccine.” “Well, there was just one bad batch of vaccines.” “Because COVID is such a dire situation, and we’re rushing to save lives, a few mistakes are inevitable.”\n\nAnything but the truth: GUESS WHAT, THE VACCINE IS HIGHLY TOXIC.\n\nThis new federal vaccine court for COVID will operate exactly like the present system for paying out claims for vaccine injury to children. Citizens have to jump through many absurd hoops and navigate all sorts of red tape, to try to squeeze money out of the federal government. The system is set up that way. It’s your basic bureaucratic nightmare.\n\nThe language that establishes the new COVID vaccine court is found in the Federal Register, 3/17/20, buried in section 14 of a document titled: “Declaration Under the Public Readiness and Emergency Preparedness Act for Medical Countermeasures Against COVID-19.”\n\nHere is the relevant passage in that document:\n\n“Countermeasures Injury Compensation Program…Section 319F-4 of the PHS Act, 42 U.S.C. 247d-6e, authorizes the Countermeasures Injury Compensation Program (CICP) to provide benefits to eligible individuals who sustain a serious physical injury or die as a direct result of the administration or use of a Covered [COVID] Countermeasure [e.g., a vaccine]. Compensation under the CICP for an injury directly caused by a Covered Countermeasure is based on the requirements set forth in this Declaration, the administrative rules for the Program, and the statute. To show direct causation between a Covered Countermeasure and a serious physical injury, the statute requires ‘compelling, reliable, valid, medical and scientific evidence.’ The administrative rules for the Program further explain the necessary requirements for eligibility under the CICP…”\n\nA quick piece of important history. In the mid-1980s, vaccine manufacturers were facing a blizzard of law suits from parents of vaccine-injured children. The very nervous manufacturers told the government they were going to get out of the vaccine business. The financial hit was going to be too deep.\n\nThe government said WAIT. Meetings were held. A plan was devised. A law was passed exempting the manufacturers from financial liability.\n\nInstead, for any of the recommended childhood vaccines, parents had to go to a government court to file a claim for compensation, after their children had been injured or killed by a vaccine.\n\nAnd the government made this court a VERY tough place to win compensation.\n\nThat’s the precise model for this new COVID vaccine court. And it’s based on the same unstated confession that existed in the 1980s: there are MANY vaccine injuries.\n\nThat’s what they aren’t saying. They’re just preparing. With a new vaccine court. To handle injury and death of children and adults.\n\nThat should not give you a warm secure feeling.\n\n“We know—and don’t ask us how—that millions of you are going to get headaches. To prevent that, we’re going to hit all of you on the head with a very heavy sledgehammer. If, ahem, a few of you happen to sustain an injury or die, we have a court where your relatives can try to get money out of us. By the way, in this court, we’ll do everything we can to deny you money. Good luck.”\n\nYes, the government knows exactly what’s coming when they approve a COVID vaccine. And now, so do you.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://www.federalregister.gov/documents/2020/03/17/2020-05484/declaration-under-the-public-readiness-and-emergency-preparedness-act-for-medical-countermeasures", "https://www.hrsa.gov/cicp/", "https://health.mil/Military-Health-Topics/Health-Readiness/Immunization-Healthcare/Vaccine-Safety-Adverse-Events/Reporting-Vaccine-Health-Problems/Countermeasures-Injury-Compensation-Program", "https://en.wikipedia.org/wiki/National_Childhood_Vaccine_Injury_Act", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Sep21"}