{"result_id": "225014", "URL": "https://blog.nomorefakenews.com/2021/08/06/pfizer-document-describes-vaccine-shedding-from-person-to-person/", "timestamp": "2023-04-25 16:36:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/08/06/pfizer-document-describes-vaccine-shedding-from-person-to-person/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Pfizer document describes vaccine “shedding” from person to person « Jon Rappoport's Blog", "cleaned_text": "If Pfizer insists that certain unvaccinated persons who come into contact with a vaccinated person creates a…\n\nSAFETY SITUATION that must be reported to Pfizer within 24 hours…\n\nWould you say that implies…\n\nThe transfer of vaccine components from person to person can occur?\n\nIf you answered YES, you win four tickets to Oobladee, a little-known island nation where vaccines are forbidden and the people naturally remain healthy and live to a ripe old age.\n\nHere is a Pfizer document, admitting and warning of person-to-person transfer of dangerous vaccine components [1]: “A PHASE 1/2/3, PLACEBO-CONTROLLED, RANDOMIZED, OBSERVER-BLIND, DOSE-FINDING STUDY TO EVALUATE THE SAFETY, TOLERABILITY, IMMUNOGENICITY, AND EFFICACY OF SARS-COV-2RNA VACCINE CANDIDATES AGAINST COVID-19 IN HEALTHY INDIVIDUALS,” (see page 67).\n\nI’m going to take this in small chunks, and translate the fake-speak clinical language as we go along.\n\n“Exposure to the study intervention under study during pregnancy or breastfeeding and occupational exposure are reportable to Pfizer Safety within 24 hours of investigator awareness.”\n\nThe “study intervention” means the RNA COVID shot. That’s what the study is FOR—intervening with a jab. “Hi, I’m your intervener, you’re a volunteer in the clinical trial, and I’m going to hit you in the arm with this needle and inject you.”\n\n“Exposure” to the shot doesn’t mean injection. It means somebody who hasn’t been injected gets physically close to somebody who has been injected. Or it could mean an un-injected person touches vaccine-liquid from a vial.\n\nAnd that un-injected somebody would be a woman who is pregnant or breastfeeding. For example, she could be a lab worker, or a person who is giving the shots.\n\nIf THIS exposure event happens, it’s a safety situation, and it has to be reported within 24 hours.\n\nA lab worker who is pregnant or breastfeeding gets physically close to a person who has received the vaccine and BANG, it’s serious, and it has to be reported.\n\nWhy? Because, obviously, there is a potential danger to the unborn baby. Or the mother, who is already breastfeeding her baby, could pass this danger to the baby through her breast milk.\n\nThe woman just came physically close to a person who already received the vaccine. That’s all. That’s all that happened. But it’s enough. It means THERE CAN BE A TRANSFER OF VACCINE COMPONENTS FROM PERSON TO PERSON, AND THIS IS NOT GOOD, THIS IS DANGEROUS TO PREGNANT AND BREASTFEEDING MOTHERS AND THEIR BABIES.\n\nHere is the next piece of the Pfizer document. It’s crucial:\n\n“An EDP [exposure to the vaccine during pregnancy] occurs if a male participant who is receiving or has discontinued study intervention exposes a female partner prior to or around the time of conception.”\n\nThis is a dangerous situation, too. A man who did get the shot then gets physically close to his female partner, who didn’t get the shot. This doesn’t necessarily mean sex. It means close physical contact. But the warning is obviously all about danger to the woman who is going to conceive a child or has just conceived, and the warning is also about a danger to that child. Some kind of severe injury. Or a miscarriage. Again, the document is obviously referring to the transfer of vaccine components from a vaccinated to unvaccinated person.\n\nAnd then, in the Pfizer document, we find an example of this dangerous, immediately reportable situation: “A female family member or healthcare provider reports that she is pregnant after having been exposed to the study intervention by inhalation or skin contact….”\n\nHere, as plain as day, we see two meanings of “come in close contact with.” Inhalation, and skin contact. Do not assume this has to mean physically rubbing up against or breathing in the liquid in the vaccine vial. Go back and read the other quotes I gave you from the Pfizer document. They are clearly talking about something much different. They’re talking about close contact between PEOPLE, one of whom has ALREADY had the shot, and one who hasn’t.\n\nThey’re talking about vaccine components passing from the inside of one person’s body to another person.\n\nCall it shedding, call it transfer, call it transmission, call it whatever you want to. Pfizer was clearly worried about it, because they insisted that any such occurrence had to be reported to company safety personnel.\n\nThey were aware that damage could be the result. Damage to mothers conceiving, mothers pregnant, mothers who are breastfeeding, and damage to babies.\n\nThrough person to person passage of components in the vaccine.\n\nA person might object, saying, “Well, maybe the pregnant woman had skin contact with someone who was just vaccinated, and the vaccinated person has a small amount of vaccine on his skin, because that tiny amount of liquid somehow escaped from the needle during injection.”\n\nThat’s highly doubtful. And if you go back and read the Pfizer statement about the man who received the vaccine and then had close contact with his female partner, there is no time line mentioned. A) He received the shot and then b) at some point later, he came into close contact with his female partner. It could be days later, weeks later. There would be no amount of vaccine left on his skin.\n\nWe ARE talking about the passage of vaccine components from the inside of one person’s body to another person.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Aug6"}