{"result_id": "225012", "URL": "https://blog.nomorefakenews.com/2021/10/13/there-is-still-no-hundred-employee-vaccine-mandate/", "timestamp": "2023-04-25 16:36:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/10/13/there-is-still-no-hundred-employee-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "There is still no “hundred-employee” vaccine mandate « Jon Rappoport's Blog", "cleaned_text": "First, the broad strokes. Just over a month ago, Biden directed the Department of Labor and OSHA to develop the details of a COVID vaccine mandate for all US companies with 100 or more employees.\n\nIt appears (but it is not certain) that this mandate will allow several escape hatches: medical and religious exemptions, and weekly testing as a substitute for vaccination.\n\nIf there are exemptions, we don’t know under what terms they’ll be permitted.\n\nThe Department of Labor has not yet issued the regulations framing and detailing this mandate.\n\nIndeed, as the law firm Eckert Seamans states on its website: “The President did not give a deadline or timeframe for the New COVID ETS [Emergency Temporary Standard], but it is likely to take weeks or months to be issued. Though it is a simple directive on its face, there are complex issues that OSHA will have to work out in preparing the ETS. Moreover, even though it is an emergency standard, OSHA still must build a basis for meeting the statutory criteria for emergency standards, and that takes time.”\n\n“Recall that in January the President directed OSHA to issue a COVID ETS…and he imposed a March 15 deadline for action on that. However, OSHA did not issue the First COVID ETS until June, and even then, it applied only to healthcare settings…”\n\n“However, if the New COVID ETS toes the line the President has drawn, it will be considerably broader and certainly more heavy handed, so it is more likely to draw court challenges from employers and others who already are declaring their opposition to such a broad mandate—and that could mean further delay.”\n\nSo we don’t yet have a set of rules for this 100-employee mandate, a month after Biden made his speech, and perhaps we won’t have those rules for some time.\n\nTherefore, the question is: Right now, does the mandate exist?\n\nThe Eckert Seamans law firm has an answer: “The President’s statement [on September 9] itself imposes no immediate legal obligations or penalties as far as private employers under the OSH Act. It is simply an announcement that he has directed OSHA to promulgate the New COVID ETS, and provides a few details of what he expects it to contain.”\n\nThere is no mandate now. There is only an announcement that there will be a mandate.\n\nThere will be a mandate when the Department of Labor issues its regulations.\n\nIf an employer went to court now, to challenge the mandate, the judge (assuming competency and honesty) would say, “Your challenge has no merit, because there is no mandate yet.”\n\nAnd if there is no mandate yet, no employer with 100 or more employees is under obligation to order his employees to take the vaccine.\n\nNote: I’m not talking about the Biden order that all federal employees and contractors must be vaccinated. That is a different situation.\n\nRight now, all employers with 100 or more employees who are ordering their employees to take the vaccine are doing so voluntarily.\n\nIf they are ordering their employees to take the vaccine “because we have to, because the federal government is ordering it,” they are making a factually incorrect statement.\n\nThis possibly opens the door to an employee filing an action against his employer: “I was told to take the vaccine under false pretenses…”\n\nI’m not saying such a charge would stand up in court, but it’s worth thinking about.\n\nOn September 10, Biden Press Secretary Jen Psaki took questions from reporters. She couched the 100-employee mandate this way:\n\n“So, Congress passed a law in 1970 — the Occupational Safety and Health Act. And the reason the Department of Labor and OSHA is able to take the strong step to protect Americans from COVID [with the new mandate] is that Congress passed that law. Yesterday’s announcement by the Department of Labor is proceeding under that law. And the law basically requires the Department of Labor take action when it finds grave risk to workers. And certainly a pandemic that killed more than 600,000 people qualifies as ‘grave risk to workers’.”\n\n“And so, if the Secretary determines workers are in grave danger, he has an obligation to issue an emergency temporary standard [ETS]. That’s exactly what he did.”\n\nI believe this is incorrect. Psaki is implying the 100-employee mandate already exists. Her words can certainly be taken that way. But the mandate doesn’t yet exist, because the Department of Labor hasn’t issued the regulations which CONSTITUTE the mandate.\n\nAgain: ALL EMPLOYERS WITH 100 OR MORE EMPLOYEES WHO ARE ORDERING THEIR EMPLOYEES TO TAKE THE VACCINE, OR ARE FIRING THOSE WHO REFUSE, ARE DOING SO VOLUNTARILY.\n\nThey’re caving in. They’re issuing orders to their employees before the regulations are issued, and before the many legal challenges against those regulations pile up—challenges which, if they chose to, they could help spearhead.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["mandates", "vaccine", "Biden"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://www.bdlaw.com/publications/prepare-now-for-a-new-osha-emergency-temporary-standard-on-covid-19/", "https://www.eckertseamans.com/legal-updates/osha-and-covid-19-another-emergency-temporary-standard", "https://www.whitehouse.gov/briefing-room/press-briefings/2021/09/10/press-briefing-by-press-secretary-jen-psaki-september-10-2021/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Oct13"}