{"result_id": "225034", "URL": "https://blog.nomorefakenews.com/2022/04/20/deadly-covid-vaccine-smoking-gun-astrazeneca-ceo-reveals-the-secret/", "timestamp": "2023-04-25 16:36:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2022/04/20/deadly-covid-vaccine-smoking-gun-astrazeneca-ceo-reveals-the-secret/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Deadly: COVID vaccine smoking gun; AstraZeneca CEO reveals the secret « Jon Rappoport's Blog", "cleaned_text": "The usual destructive effects of the vaccine are not enough—there must be greater destruction\n\nTHE TRUTH COMES OUT.\n\nProject Veritas has just released a leaked recording of a December 2020 Zoom call, during which AstraZeneca CEO, Pascal Soriot, stated that millions of people, whose immune systems are compromised, cannot receive the COVID vaccine:\n\n“If you have an immune disease, lupus or some other immune condition, you cannot – or multiple sclerosis, you can’t be vaccinated. So, there are millions of people in the world that will need a protection that cannot be coming from a vaccine.”\n\nThe reasoning is very simple. I explained it early in 2020. A vaccine is supposed to provoke a reaction from the immune system. But if the system is weak and can’t respond, the vaccine functions as a SUPER-high toxic invader and overwhelms the body.\n\nThe AstraZeneca CEO does not fully understand the scope of what he is referring to—because the number of people in the world whose immune systems are compromised are on the order of 700 million; and that may be an underestimate.\n\nI base this estimate on my 1987-88 research (see my book “AIDS Inc: Scandal of the Century”), which turned up the fact that the largest cause of immune T-cell depletion in the world is severe malnutrition/lack of nutrition. Chronic hunger, for example. And you can add in people who are routinely eating a diet of empty calories.\n\nALL these people have compromised immune systems.\n\nThen you also have people who, for other reasons, have weak immune systems. For instance, as a result of pollution, pesticides, and toxic medical and street drugs and vaccines.\n\nWorse yet—almost all the 700 million or more people whose immune systems are compromised DON’T KNOW IT. They don’t think in those terms. Therefore, they don’t know how harmful the COVID vaccine (or any vaccine) will be to them.\n\nNow here is the kicker. Don’t imagine that the AstraZeneca CEO’s statement above is shared by public health agencies. It isn’t. These agencies have no concern for people whose immune systems are compromised.\n\nFor instance, referring to the AstraZeneca COVID vaccine (Vaxzevria), the European Medicines Agency, an agency of the European Union, states: “There are limited data on immunocompromised people (people with weakened immune systems). Although immunocompromised people may not respond as well to the vaccine, there are no particular safety concerns. Immunocompromised people can still be vaccinated as they may be at higher risk from COVID-19.”\n\nAnd then, shockingly, we have this, from a World Health Organization advisory: “SAGE [Strategic Advisory Group of Experts on Immunization] recommends that severe and moderately immunocompromised persons should be offered an additional dose of vaccine.”\n\nIn other words, the usual highly destructive effects of the vaccine would not be enough. People should be more deeply injured. Those who die should be deader.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://www.infowars.com/posts/veritas-strikes-again-astrazeneca-ceo-millions-of-immunocompromised-people-cant-be-vaccinated/", "https://www.amazon.com/AIDS-Inc-Scandal-Jon-Rappoport/dp/0941523039/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Apr20"}