{"result_id": "225026", "URL": "https://blog.nomorefakenews.com/2022/06/16/the-babies-and-the-vaccine/", "timestamp": "2023-04-25 16:36:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2022/06/16/the-babies-and-the-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "The Babies and The Vaccine « Jon Rappoport's Blog", "cleaned_text": "Protecting your baby from a virus that doesn’t exist, with a killshot\n\nSo you’ve had your eight-month-old baby injected with the COVID vaccine.\n\nI’ve heard that. But it’s not the issue for us.\n\nWhat is the issue for you?\n\nWe need to stay in the forefront of trends.\n\nHave you seen the federal database that records vaccine injury and death reports?\n\nSo you know your baby could die from the shot.\n\nAnd that doesn’t matter to you.\n\nNot as much as being able to tell our friends we had our baby vaccinated.\n\nThat’s a misunderstood term. We don’t consider ourselves parents. The State is the parent. We’re the monitors.\n\nWe observe, and carry out limited functions.\n\nEven if you assume the virus exists, the chances of your baby catching it and becoming ill are incredibly tiny.\n\nThat’s right. But this isn’t what we’re about. As I said, we’re keeping pace with fashion.\n\nIt depends on how you define the term. Humans are biological machines. Most people believe in something beyond that, but the content of belief is predetermined by a person’s upbringing, genes, conditioning, and so on.\n\nHave you ever questioned vaccine science?\n\nThere’s nothing to question. We understand science. I have a PhD in psychology, and my husband is a software engineer. My IQ is 141. My husband’s is 136. We’re equipped to deal with vaccine issues.\n\nIf your baby died from the shot, would you mourn?\n\nYes. We would post photos and statements on our Facebook page.\n\n—No doubt, some people would take offense at this “interview.” How could I? Here’s how. I wrote it. I wrote it because the government and Pfizer and Moderna—no matter how they interpret COVID and “the virus”—are moving ahead to inject as many babies as possible—which is a crime of mass assault and mass murder. Many parents will go along with it.\n\nTo read Jon’s articles on Substack, click here.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://jonrappoport.substack.com/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Jun16"}