{"result_id": "225019", "URL": "https://blog.nomorefakenews.com/2021/08/30/refusing-the-covid-vaccine-setting-the-record-straight/", "timestamp": "2023-04-25 16:36:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/08/30/refusing-the-covid-vaccine-setting-the-record-straight/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Refusing the COVID vaccine; setting the record straight « Jon Rappoport's Blog", "cleaned_text": "In this article, I’m cutting through a few miles of new verbiage circulating on the issue of refusing the COVID vaccine.\n\nPeople have recently announced “an extraordinary discovery”: there is a legal way to reject the vaccine. “It’s still experimental,” they say, even after the FDA just fully approved it, and under federal law, a person has the right to refuse an experimental medicine.\n\nSo…take a breath, let it out, take a step back, and consider the following:\n\nSince the moment COVID vaccines were launched, a person has been able to refuse them. Since they were first mandated, a person has been able to refuse them.\n\n“Mandate” means: if you refuse, you pay the price.\n\nConsequences. You’re fired from your job. You can’t enter certain restaurants. And so on.\n\nAfter the August 23 FDA approval of the Pfizer shot, nothing in that regard has changed. You can refuse the shot, but you take the consequences.\n\nEven in the Army (so far), they can’t hold you down and force the needle into your arm. They put you in a cell, they discharge you dishonorably, they court martial you; whatever.\n\nPerhaps a lawyer can argue that the consequences of refusing the shot are egregious, too severe, are tantamount to “forcing the shot,” but that is a different issue. I would like to see that issue raised.\n\nBut let’s not confuse huge numbers of people by telling them they now have a clear path to refusing the shot. That clear path has always existed (with perhaps the exception of prisons and nursing homes and hospitals where some people were forced to take the shot illegally).\n\nWhat people are dealing with is, how can I avoid the consequences of refusing the shot?\n\nI’ve suggested strategies that entail getting employers wrapped up in answering probing detailed questions about financial and legal responsibility for vaccine injuries—\n\nBut the ultimate bottom line is the individual refusing the shot, No Matter What.\n\nIn my MANY articles about vaccines, detailing how they are dangerous, destructive, ineffective, and unnecessary, my aim has been to bring people closer to making their own stand.\n\nThat is what this is all about: No Matter What.\n\nWill you refuse the vaccine no matter what?\n\nBelieve me, I support all sorts of legal case filings and challenges to vaccine mandates. I don’t care how slim the chances of success are.\n\nBut in the end, every individual has to decide what he will accept and what he will reject.\n\nNo matter what the consequences are.\n\nWe are the cure. This is the war.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["mandates", "vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://blog.nomorefakenews.com/2021/08/25/did-fda-really-approve-the-pfizer-covid-vaccine-wait-what/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Aug30"}