{"result_id": "225018", "URL": "https://blog.nomorefakenews.com/2021/08/03/the-vaccine-war-who-really-has-the-upper-hand/", "timestamp": "2023-04-25 16:36:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2021/08/03/the-vaccine-war-who-really-has-the-upper-hand/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "The Vaccine War: who really has the upper hand? « Jon Rappoport's Blog", "cleaned_text": "I don’t believe governments are telling the truth about how many people have taken the COVID shot. I think they’re lying. Inflating the numbers because they’re desperate; far more people than advertised are refusing the vaxx.\n\nIn every war, spies and other hired hands try to demoralize the enemy. This is standard operating procedure. Inflating key numbers is one strategy.\n\nIn this vaccine war, the ace in the hole is obvious: if enough people say NO to the shot, it’s over. A tidal wave will engulf the governments and their corporate allies.\n\nIf people believed, say, that only 30% of Americans have taken the shot, and that number is holding steady, despite all the new mandates, morale would shoot up to a new high.\n\nIt always feels better to be on a winning side.\n\nIf most Americans knew that massive anti-vaxx protests are taking place in France and Germany and other countries, their attitude would shift. If most Americans knew that in Australia, the most fascist pro-vaxx government in the world is sweating bullets, because despite horrendous lockdowns and vaccine mandates, despite cops and soldiers on the streets, Aussies are still going to the beach…that knowledge would bolster spirits.\n\nIf people opposed to the vaccine and/or the mandates could get an accurate count on how many posts and how many videos and how many accounts have been censored by social media, worldwide, because those posts express opposition to the vaxx…people would see how large the resistance really is.\n\nHere’s a report from statista.com: “As of August 1, 2021, China had administered about 1.67 billion doses of coronavirus COVID-19 vaccine, whereas about 4.18 billion doses of the vaccine had been applied worldwide.”\n\nI don’t believe it. I don’t think the global organization and the logistics are that good. People who’ve traveled extensively know how diverse and spread-out the global landscape is. They know how inefficient many, many governments are.\n\nThe world isn’t one huge well-lit modern pharmacy with people lined up and techs administering the jabs.\n\nAs several people have pointed out, the unvaccinated are a control group in this vast COVID vaccine experiment. If a year from now, millions and millions of us who didn’t take the shot are obviously still healthy, that’s not going to sit well with the vaccinators-in-charge or the pro-vaccine crowd. They don’t want a vibrant control group. They want compliant robots.\n\nThen there is this, from Stat News, July 21: “Millions of unused Covid-19 vaccines are set to go to waste as demand dwindles across the United States and doses likely expire this summer, according to public health officials…”\n\n“Currently, states have administered 52.36 million fewer doses than have been distributed to them, according to federal data.”\n\n“A significant tranche of Pfizer doses is expected to expire in August… Given waning domestic vaccine demand, those doses are unlikely to be fully used before they must be tossed.”\n\n“’We’re seeing demand [for the vaccine] falling off across all the states,’ said Marcus Plescia, chief medical officer at the Association of State and Territorial Health Officials.”\n\nSo which sets of statistics should we believe? Those that pump up the numbers of people who’ve taken the shots, or those that show millions of vials going to waste? I think the latter stats are the true indicators. Officials are less likely to confess to them, unless they’re accurate.\n\nOut in front, the movie called COVID VACCINE is being hailed as a brilliant blockbuster, but at the back end, ticket sales are dropping off a cliff.\n\nThere are reasons for that. One is: People are having very serious and severe injuries from the shot; they’re dying; and their families and friends know about it.\n\nHere are the latest CDC figures I have, as compiled by Children’s Health Defense. The statistics are taken from VAERS, the federal Vaccine Adverse Event Reporting System. “VAERS data released today by the CDC showed a total of 463,457 reports of adverse events from all age groups following COVID vaccines, including 10,991 deaths and 48,385 serious injuries between Dec. 14, 2020 and July 9, 2021.”\n\nKeep in mind there is vast underreporting of injuries, because most Americans don’t know what VAERS is or are hesitant to make a report.\n\nSome analysts have suggested that, to get a reasonably accurate count, you should multiply reported numbers by 10.\n\nThe well-known 2010 Harvard Pilgrim Health Care, Inc. study of VAERS bluntly stated: “Adverse events from vaccines are common but underreported, with less than one percent reported to the Food and Drug Administration (FDA). Low reporting rates preclude or delay the identification of ‘problem’ vaccines, potentially endangering the health of the public.”\n\nFollowing the finding of that study, you would multiply the number of reported vaccine injuries by 100 to arrive at a proper figure.\n\nThe numbers of vaccine injuries and deaths are huge. In any situation other than the current fake pandemic, the vaccination program would have been stopped. Cancelled.\n\nNo matter what governments and news parrots say about the vaccine (“safe and effective”), vast numbers of injured people, their families, and the families of those who’ve died from the shot are messengers for the truth.\n\nIn a war, when combatants and civilians end up in hospitals, and when many of them lie in coffins lowered into the ground, and when the people can no longer hold a coherent story in their minds about why the war is being fought, the whole mood of a country changes.\n\nThis is no time for surrendering or joining those who claim doom is the only outcome.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine", "VAERS", "war"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Aug3"}