{"result_id": "225007", "URL": "https://blog.nomorefakenews.com/2022/06/10/another-covid-vaccine-smoking-gun/", "timestamp": "2023-04-25 16:36:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://blog.nomorefakenews.com/2022/06/10/another-covid-vaccine-smoking-gun/", "encoding": "UTF-8"}, "image": null, "domain": "blog.nomorefakenews.com", "title": "Another COVID Vaccine smoking gun « Jon Rappoport's Blog", "cleaned_text": "I’m going to start with a bizarre analogy, which illustrates the folly called vaccination.\n\nA boy of 16 who lives on a farm has been driving vehicles all over the land since he was 11. He’s driven cars, trucks, and tractors. He’s driven them on roads, across fields, and on many occasions with his father beside him, he’s driven cars and trucks on city streets and highways. The boy knows how to drive. He’s a pro.\n\nBut when he turns 16, his father is on vacation, and his uncle comes to stay with the family. The uncle is quite insane. He tells the boy, “I’m going to put you through a training course in driving. It’s a rehearsal for the real thing.”\n\nAgainst the protests of the boy, the uncle sits him in a closed car, which is specially equipped to pump amphetamines into the air. The uncle says, “The drug will make you more alert when you drive. So you’ll have enhanced skills. You’ll become a better driver with this rehearsal…so when you actually get your license, you’ll be ready for the real thing…”\n\n“But I can already drive better than you can,” the boy says.\n\nI call vaccination a rehearsal, because that’s what it’s supposed to be.\n\nThe immune system is tuned up for the possible later appearance of “the real thing.”\n\nFor the moment, put aside the fact that SARS-CoV-2 doesn’t exist and therefore a vaccine is entirely irrelevant.\n\nFor the many who believe in the virus, here’s a question. Why does the use of a vaccine, as rehearsal for the real thing, make any sense at all?\n\nIf the immune system springs into action against the virus (or a virus protein) in the vaccine, why wouldn’t it also spring into action when the virus shows up naturally? What’s the point of the prior rehearsal? Isn’t the body already ready for the real thing?\n\nIt turns out there is a medical answer. Vaccines contain various substances called adjuvants. Their function is to enhance the immune response during the rehearsal, better preparing it for the moment when the real thing comes along.\n\nHowever, as many scientists know, PEG can cause a dangerous anaphylactic reaction. Not good.\n\nWhy does PEG cause that reaction?\n\nThink it through. The body’s immune system isn’t being enhanced during the rehearsal called vaccination. The adjuvant (PEG) isn’t causing the immune system antibodies to ramp up against the spike protein in the virus. The adjuvant is causing the immune system to attack it, the adjuvant.\n\nTherefore, what good is the vaccine?\n\nAnd we’re not just talking about the adjuvant called PEG. By implication, this anaphylactic response suggests that ALL adjuvants in all vaccines aren’t really enhancing immune response against viruses. Instead, they’re provoking antibody reactions to themselves, the adjuvants.\n\nIn which case, I return to my original question: why bother with the rehearsal called vaccination, since it proves nothing except the body is already prepared for the real thing. And so the vaccination wasn’t needed.\n\nHere are excerpts from an article in Science (12/21/20), “Suspicions grow that nanoparticles in Pfizer’s COVID vaccine [and Moderna’s] trigger rare allergic reactions.” You can plow through and dig out the nuggets that, taken together, illustrate what I’ve just presented.\n\nThe caps in the following quotes are mine.\n\n“Severe allergy-like reactions in at least eight people who received the COVID-19 vaccine produced by Pfizer and BioNTech [Pfizer] over the past 2 weeks may be due to a compound in the packaging of the messenger RNA (mRNA) that forms the vaccine’s main ingredient, scientists say. A similar mRNA vaccine developed by Moderna, which was authorized for emergency use in the United States on Friday, also contains the compound, polyethylene glycol (PEG).”\n\n“PEG has never been used before in an approved vaccine, but it is found in many drugs that have occasionally triggered anaphylaxis—a potentially life-threatening reaction that can cause rashes, a plummeting blood pressure, shortness of breath, and a fast heartbeat. Some allergists and immunologists believe a small number of people previously exposed to PEG may have HIGH LEVELS OF ANTIBODIES AGAINST PEG, putting them at risk of an anaphylactic reaction to the vaccine.”\n\n“The two vaccines both contain mRNA wrapped in lipid nanoparticles (LNPs) that help carry it to human cells, BUT ALSO ACT AS AN ADJUVANT, A VACCINE INGREDIENT THAT BOLSTERS THE IMMUNE RESPONSE. The LNPs are ‘PEGylated’—chemically attached to PEG molecules that cover the outside of the particles and increase their stability and life span.”\n\n“PEGs were long thought to be biologically inert, but a growing body of evidence suggests they are not. As much as 72% of people have at least SOME ANTBODIES AGAINST PEGs, according to a 2016 study led by Samuel Lai, a pharmaco-engineer at the University of North Carolina, Chapel Hill, presumably as a result of exposure to cosmetics and pharmaceuticals. About 7% have a level that may be high enough to predispose them to anaphylactic reactions, he found.”\n\nTo read Jon’s articles on Substack, click here.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free NoMoreFakeNews emails here or his free OutsideTheRealityMachine emails here.", "opengraph": {}, "tags": ["vaccine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://blog.nomorefakenews.com/2022/06/13/the-big-time-vaccine-scam-antibodies/", "https://blog.nomorefakenews.com/2022/06/09/one-more-time-where-is-the-spike-protein/", "https://www.science.org/content/article/suspicions-grow-nanoparticles-pfizer-s-covid-19-vaccine-trigger-rare-allergic-reactions", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://jonrappoport.substack.com/", "https://marketplace.mybigcommerce.com/the-matrix-revealed/", "https://marketplace.mybigcommerce.com/exit-from-the-matrix/", "https://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://lp.constantcontactpages.com/su/3Xv1Jcb/nomorefakenews", "https://lp.constantcontactpages.com/su/9oWc9ml/outsidetherealitymachine", "#shared-counts-email"], "authors": [], "publish_date": "Jun10"}