{"result_id": "226006", "URL": "https://notrickszone.com/2022/04/03/berlin-physician-estimates-cases-of-severe-side-effects-at-3-projected-one-million-affected-in-germany/", "timestamp": "2023-04-25 16:37:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/04/03/berlin-physician-estimates-cases-of-severe-side-effects-at-3-projected-one-million-affected-in-germany/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Berlin Physician Estimates Cases Of Severe Side Effects At 3%…Projected One Million Affected In Germany", "cleaned_text": "While Germany Health Minister Karl Lauterbach continues to insist the mRNA technology vaccines are “more or less free of side effects”, German commentary site achgut.com here reports how vaccine injuries have exploded across Germany.\n\nThe site reports “the Marburg University Hospital has set up a special outpatient clinic for patients with side effects after the Corona vaccination, and the waiting list has grown to about 800 patients.”\n\nRecently a number of doctors have been warning about the risks of the vaccines at achgut.com: Dr. Gunter Frank, Dr. Jochen Ziegler and Dr. Andreas Zimmermann.\n\nDr. Jochen Ziegler wrote Germany could have “a real socio-medical emergency” that would also even result in “a fundamental crisis of confidence in the state and its institutions”.\n\nSlowly, and ever so hesitantly, the first major media outlets like Austrian Servus TV and Germany’s ARD plusminus, have reported on vaccine side effects. Most recently the Berliner Zeitung reported on physician Erich Freisleben, whose practice is virtually “overrun” by patients with vaccination side effects.\n\nAccording to Achgut.com, Dr. Freisleben “estimates the cases of severe vaccine side effects at three percent. That would affect a projected one million people in Germany alone.”\n\nAccording to Freisleben: “I’ve seen maybe five or six side effects with vaccines before in 35 years of practicing medicine. For the novel vaccines, I have now counted 96. That’s out of proportion.”\n\nAchgut.com comments that “we are dealing here with a completely new vaccination technology” and: “We do not yet know what the new mRNA vaccines will do to our immune system.”\n\nFreisleben warns against compulsory vaccination and that a “softening of the Basic Law would mean not having understood the lessons of history.”\n\n“Compulsory vaccination would open the door wide to abuse,” the Berlin physician adds.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.achgut.com/artikel/impfschaeden_das_thema_erreicht_den_mainstream", "https://notrickszone.com/wp-content/uploads/2022/04/Achgut.png", "https://www.achgut.com/artikel/impfschaeden_das_thema_erreicht_den_mainstream", "https://www.achgut.com/artikel/bericht_zur_coronalage_millionen_deutsche_wegen_impffolgen_beim_arzt", "https://www.achgut.com/artikel/erzeugen_die_zugelassenen_impfstoffe_einen_nettoschaden", "https://www.achgut.com/artikel/warum_werden_corona_geimpfte_so_krank", "https://www.achgut.com/artikel/impffolgen_wieviele-wird_es_treffen", "https://www.berliner-zeitung.de/gesundheit-oekologie/eine-impfpflicht-wuerde-das-tor-zum-missbrauch-weit-oeffnen-li.219816", "https://www.achgut.com/artikel/impfschaeden_das_thema_erreicht_den_mainstream", "https://www.achgut.com/artikel/impfschaeden_das_thema_erreicht_den_mainstream"], "authors": [], "publish_date": null}