{"result_id": "226010", "URL": "https://notrickszone.com/2023/01/19/new-study-covid-vaccines-profoundly-impair-protective-immunity-probably-enhance-disease-severity/comment-page-1/", "timestamp": "2023-04-25 16:37:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2023/01/19/new-study-covid-vaccines-profoundly-impair-protective-immunity-probably-enhance-disease-severity/comment-page-1/#comments", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "New Study: COVID Vaccines ‘Profoundly Impair’ Protective Immunity, ‘Probably Enhance Disease Severity’", "cleaned_text": "Recipients of repeated COVID-19 mRNA vaccinations may have fully damaged their immune system’s capacity to protect them from severe effects from the disease. Each successive booster shot may actually worsen protection.\n\nEven though it has been determined that COVID-19 vaccinated young people aged 18-24 are 44 times (males) and 41 times (females) more likely to be afflicted with heart-damaging myocarditis than the unvaccinated in this same age group, many US universities nonetheless required students to receive booster shots as a condition of attendance in 2022-’23.\n\nBut now new mice research (Gao et al., 2022) provides damning evidence that continued COVID-19 booster vaccinations “negatively impact the immune response” and “fully impair the…neutralizing efficacy” of COVID-19 antibodies and memory.\n\nScientists warn that continuing the course of booster COVID-19 mRNA vaccinations may pose risks of “enhanced disease severity” for those re-infected with COVID-19 and thus the administration of boosters “should be preceded with caution.”\n\n“Our findings revealed that repeated dosing after the establishment of vaccine response might not further improve the antigen-specific reactivity; instead, it could cause systematic tolerance and inability to generate effective humoral and cellular immune responses to current SARS-CoV-2 variants.”\n\nIn other words, health authorities have mandated young people get a shot that may fully impair their immune system’s capacity to protect them from the very variants the shots were intended to neutralize.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2022/08/Vaccine-induced-myocarditis-44x-greater-than-unvaccinated-Le-Vu-2022.jpg", "https://www.bestcolleges.com/news/2021/12/14/what-colleges-require-covid-vaccine-booster-omicron/", "https://www.sciencedirect.com/science/article/pii/S2589004222017515", "https://www.sciencedirect.com/science/article/pii/S2589004222017515"], "authors": [], "publish_date": null}