{"result_id": "226044", "URL": "https://notrickszone.com/2022/09/14/top-german-virologist-hendrik-streeck-does-not-want-to-be-vaccinated-against-corona-again/comment-page-1/", "timestamp": "2023-04-25 16:37:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/09/14/top-german-virologist-hendrik-streeck-does-not-want-to-be-vaccinated-against-corona-again/comment-page-1/#comments", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Top German Virologist, Hendrik Streeck, “Does NOT Want To Be Vaccinated Against Corona Again!", "cleaned_text": "All the health woes surrounding the mRNA Covid vaccines and broken promises are leading people to become more wary of getting regularly injected.\n\nNow leading German virologist Hendrick Streeck has openly come out and said he will not being getting a fourth shot. Bild online daily reports:\n\nHe has decided AGAINST it: Hendrik Streeck (45), virologist at the University Hospital in Bonn and member of the government’s expert council. Even if the infection figures should rise in the fall, Streeck does NOT want to be vaccinated against Corona again.”\n\nMeanwhile, on August 31, 2022, the U.S. Food and Drug Administration authorized the new mRNA COVID boosters, but didn’t even allow members of its Vaccines and Related Biological Products Advisory Committee (VRBPAC) to meet, discuss or vote on the matter.\n\nPfizer’s new booster is a bivalent injection targeting Omicron subvariants BA.4 and BA.5, and was tested on a total of eight mice, which were then only checked for antibody levels, which in turn says nothing about how well a person is protected against infection or serious illness.\n\nSo it’s little wonder, then, that experts like Streeck have lost their enthusiasm and are backing off from getting the injections.\n\nAnd recently in a roundtable discussion, sociologist Toby Rogers made the following points on the rush authorization:\n• The FDA “didn’t even allow the advisory committee to meet”. “They just skipped that altogether.”\n• “COVID-19 shots are the most dangerous medical products in human history.”\n• “It’s a clown show. These people are clowns. They are not serious scientists. They are not men and women of science, and they don’t care about the health and wellbeing of the public. It’s outrageous.”\n• Despite all the deaths, serious injuries and miscarriages, the reformulated shots are being rolled out in a hurry, without any quality control and safety testing.\n• “So, to put it simply, we are looking at a winter of severe illness and death for the vaccinated.”\n• “Only 3% of parents of kids under 5 have been dumb enough for their kids because their kids are not at risk.”\n\nLarge number of Americans will reject further vaccination\n\nI think the American people do not like being experimented on by their government, and I think the American people are going to reject these shots and most of these 171 million doses that the Biden Administration foolishly bought will end up going into the trash because they are unused.”", "opengraph": {}, "tags": ["Misc."], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2022/09/Streeck-U-of-Bonn.png", "https://hiv-forschung.de/streeck", "https://www.bild.de/bild-plus/politik/inland/politik-ausland/top-virologe-streeck-ueber-den-corona-herbst-ich-lasse-mich-nicht-zum-4-mal-impf-81314086.bild.html", "https://live.childrenshealthdefense.org/shows/chd-friday-roundtable", "https://rumble.com/v1irvjt-friday-roundtable-new-booster-rollout-with-no-human-testing-meryl-nass-toby.html"], "authors": [], "publish_date": null}