{"result_id": "226027", "URL": "https://notrickszone.com/2022/08/13/more-covid-jabs-for-you-but-not-for-us-germanys-health-minister-last-boosted-9-months-ago/comment-page-1/", "timestamp": "2023-04-25 16:37:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/08/13/more-covid-jabs-for-you-but-not-for-us-germanys-health-minister-last-boosted-9-months-ago/comment-page-1/#comments", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "More Covid Jabs For You, But Not For Us! Germany’s Health Minister Last Boosted 9 Months Ago!", "cleaned_text": "Germany’s Federal Health Minister Karl Lauterbach claims in public he has been Covid vaccinated four times and urgently recommends everyone to follow his example.\n\nUnfortunately for Lauterbach, who recently struggled with a bout of the COVID infection himself, it appears he has been vaccinated only 3 times. His last shot was administered in November of last year!\n\nAccording to Germany’s Berliner Zeitung here, “A check of his digital vaccination certificates with the CovPassCheck app has now revealed that at least the last digitally noted vaccination took place more than 270 days ago, i.e. in mid-November 2021. It is noted as a ‘booster vaccination.'”\n\nDuring a press conference last Friday, the health minister unwittingly showed off his digital vaccination certificate on his mobile device, complete with QR code, before dozens of cameras. Like everyone else’s certificates, it too can be checked with just a few clicks using CovPassCheck.\n\nOops, CovPassCheck showed his last vaccination was 271 days ago, long before the fourth vaccination was even in public discussion.\n\nThe Berliner Zeitung reports that journalist Janina Lionello wanted to know how long it had been since Lauterbach’s last vaccination, “but the Federal Ministry of Health refuses to provide this information,” she said, and quoted a ministry spokesman: “Please understand that we can’t go into details about medical matters.”\n\nUnder Lauterbach’s plans for the future, regular citizens wouldn’t have the luxury of such privacy, and would be denied access to a wide range of public venues.\n\nRecently the vaccine fanatic health minister even called for everyone getting a fourth shot, and to not wait for the new vaccines to arrive later this fall. Moreover, he sparked controversy when he suggested a booster every 3 months thereafter. Lauterbach told German ZDF television that “only freshly vaccinated is well vaccinated.”\n\nWhen asked to explain what was meant by freshly vaccinated, Lauterbach told ZDF: “According to the definition we use here, it means three months. That means at least the third vaccination or another vaccination must be no more than three months ago. Then you have a good probability that the vaccinated person himself is well protected and not as much at risk of infection as someone who has been vaccinated longer ago. Or who has only had one vaccination.”\n\nLater Lauterbach quickly backpedaled, insisting that a jab every three months would be nonsense.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2022/08/Lauterbach-4.-impfung.png", "https://www.berliner-zeitung.de/news/laut-covpasscheck-karl-lauterbach-zuletzt-vor-271-tagen-geimpft-corona-li.255960", "https://www.berliner-zeitung.de/news/laut-covpasscheck-karl-lauterbach-zuletzt-vor-271-tagen-geimpft-corona-li.255960", "https://www.wiwo.de/politik/deutschland/booster-imfpung-lauterbach-will-empfehlung-zu-vierter-impfung-fuer-jede-altersgruppe/28580742.html", "https://www.mdr.de/brisant/lauterbach-corona-122.html"], "authors": [], "publish_date": null}