{"result_id": "226046", "URL": "https://notrickszone.com/2021/12/22/german-judges-state-attorneys-elaborate-10-reasons-against-compulsory-covid-19-vaccinations/", "timestamp": "2023-04-25 16:37:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2021/12/22/german-judges-state-attorneys-elaborate-10-reasons-against-compulsory-covid-19-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "German Judges, State Attorneys, Elaborate 10 Reasons Against Compulsory COVID-19 Vaccinations", "cleaned_text": "A German site by critical judges and state attorneys, Netzwerk Kritische Richter und Staatsanwälte n.e.V. KRiStA – outlines 10 compelling reasons against compulsory vaccination against the SARS-COV-2 virus.\n\nI expect it will soon become a valuable resource as German pandemic zealots rush for compulsory vaccination next year and possibly setting off one of the greatest German legal battles in postwar-history.\n\nThe COVID-19 vaccination does not protect against infection and transmission of the SARS-COV-2 virus, according to the official information from the regulatory authority EMA. All COVID-19 vaccines have been approved by the EMA only to protect against COVID-19 disease, i.e. to protect against a severe course after infection with SARS-CoV-2.\n\n2. No correlation between infections and vaccination rates\n\nAccording to a comprehensive Harvard study, there is no correlation between infection figures and vaccination rates. On the contrary, the study even found a slight tendency that as vaccination rates increase, so do infection rates. The results of the study are in line with the negative experiences of some countries with particularly high vaccination rates (Gibraltar (about 100 %), Iceland, Ireland, Portugal), which have seen an increase in infection numbers despite high vaccination rates.\n\nAccording to this Harvard study, a positive effect of the vaccination rate on the incidence of infection cannot be proven.\n\nThe COVID-19 vaccination is in no way comparable to the measles or smallpox vaccination, because the COVID-19 vaccination precisely does not protect against infection and transmission of the virus and does not lead to sterile immunity. In contrast to measles and smallpox vaccination, a positive effect of COVID-19 vaccination on the incidence of infection with SARS-CoV-2 cannot be proven.\n\nMoreover, the lethality of smallpox is around 30%, the infection mortality of SARS-CoV-2 is 0.23 % on average according to the WHO. Due to the different danger, the smallpox or measles vaccination cannot be used as a comparison.\n\nAccording to the CDC, the English PHE health authority and four studies, the vaccinated have a comparably high viral load as the unvaccinated when they become infected. This means that vaccinated people are just as contagious as unvaccinated people, vaccinated people pose a comparably high risk of infection as unvaccinated people..\n\nAccording to the Robert Koch Institute (RKI), Nov. 25, 2021, 56% of hospitalized COVID-19 patients over 60 years of age were dually vaccinated. Public Health Wales reported as of 9/11/2021 that 83.6% of hospitalized COVID-19 patients were dually vaccinated. The claim that mainly unvaccinated patients are in hospital because of COVID-19 is not true.\n\n6. No overloading of the healthcare system\n\nAccording to the report of the Federal Audit Office, there was no overloading of the health system in Germany in the first pandemic year 2020. On the contrary, there were even more hospital beds occupied in 2019 than in 2020.\n\nAn analysis of the performance of hospitals of April 30, 2021 by the Advisory Council of the Ministry of Health (press release) also comes to the conclusion that on average four percent of all intensive care beds were occupied with Corona patients and that the pandemic did not bring inpatient care to its limits at any time.\n\nAccording to the report of the Federal Audit Office and the analysis of the Advisory Council of the Ministry of Health of April 30, 2021, there was no overloading of the health system during the first, second and third “pandemic waves”. The question arises as to why there should now be an overload in the fourth “wave”, especially since 70% of people are now vaccinated and should therefore be protected against a severe course. Therefore, there should be no overloading of the health system at this point in time if the COVID-19 vaccinations actually offered protection against a severe illness.\n\nEven in the current situation, there is no threat of an overload of our health care system, since according to the DIVI intensive care register for which the Robert Koch Institute (RKI) is responsible, there is no increase in the total occupancy of intensive care beds. On the contrary, there are currently even slightly fewer intensive care beds occupied overall than in April 2021. Furthermore, according to the weekly report of the influenza working group, there is also no increase in acute respiratory diseases. The incidence of acute respiratory illnesses, which also includes COVID-19, is in the range of the previous years 2017, 2018 and 2019..\n\nAccording to the WHO epidemiological bulletin of October 2020, the infection mortality of SARS-CoV-2 is 0.23% on average. The infection mortality of 0.23% corresponds to that of influenza. In previous years, no compulsory vaccination was considered necessary during influenza waves, so the question arises as to why compulsory vaccination should be necessary now because of COVID-19. The fact that SARS-CoV-2 is less deadly than initially assumed is also confirmed by the fact that, according to Prof. Kauermann from the Institute for Statistics at the Ludwig-Maximilians University in Munich and a study by the University of Duisburg-Essen: there was no excess mortality in Germany in 2020.\n\nProtection of the general public through COVID-19 vaccination cannot be proven (see explanations under points 1 to 3). If compulsory vaccination were introduced only for individual protection, it would also be logical to ban high-risk sports, motorcycling, smoking, alcohol and particularly sugary drinks. Anyone who then needs medical treatment because of their high-risk lifestyle or unhealthy lifestyle would have to be denied it. This contradicts a free democratic basic order.\n\nCompulsory vaccination would only be constitutional if there were no alternative treatment options for COVID-19, but only COVID-19 vaccination was available as a preventive protective measure. This seems doubtful, since there are scientific publications according to which treatment with ivermectin can reduce hospitalization by 75 to 85%.\n\nLikewise, there are positive empirical values with the use of ivermectin for COVID-19 from some Indian states, from Mexico and Peru. The testing of whether ivermectin is suitable for the treatment of COVID-19 has not yet been completed and must not be hindered or suppressed, but this seems to be happening at present for purely financial reasons. The Bavarian State Parliament also addressed the use of ivermectin for the treatment of COVID-19 in its resolution of June, 24, 2021. As long as it cannot be ruled out that ivermectin is an alternative treatment option for COVID-19, this argues against compulsory vaccination.\n\nThe legislator must prove that no alternative treatment options are available besides vaccination. In case of doubt, this is at the expense of compulsory vaccination.\n\nEach point is then justified (in German) at the KRiStA n.e.V site.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://netzwerkkrista.de/2021/12/10/10-gruende-gegen-die-impfpflicht/", "https://netzwerkkrista.de/2021/12/10/10-gruende-gegen-die-impfpflicht/", "https://www.bundesgesundheitsministerium.de/presse/pressemitteilungen/2021/2-quartal/corona-gutachten-beirat-bmg.html", "https://netzwerkkrista.de/2021/12/10/10-gruende-gegen-die-impfpflicht/"], "authors": [], "publish_date": null}