{"result_id": "226014", "URL": "https://notrickszone.com/2023/02/10/austrian-court-acquits-doctor-charged-of-falsely-issuing-covid-vaccine-exemption-certificates/comment-page-1/", "timestamp": "2023-04-25 16:37:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2023/02/10/austrian-court-acquits-doctor-charged-of-falsely-issuing-covid-vaccine-exemption-certificates/comment-page-1/#comments", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Austrian Court ACQUITS Doctor Charged Of Falsely Issuing COVID Vaccine Exemption Certificates", "cleaned_text": "Austrian physician: vaccine has to be avoided, especially when “a corrupt state and an even more corrupt medical association, made up of puppets of the pharmaceutical industry, coerce people into a potentially lethal vaccination.”\n\nPhysician Dr. Andreas Sönnichsen was accused in 2022 of issuing digital exemption certificates for the Covid 19 vaccine for 20 euros to patients who did not want the new controversial medical mRNA technology injected into their bodies.\n\nDespite the privacy rights between patient and doctor, Austrian authorities dragged Sönnichsen to a Salzburg court on charges of fraud and usurpation of authority.\n\nYesterday, the Salzburg court ruled in favor of Sönnichsen. The acquittal is viewed as a major victory by proponents of patient-physician rights, medical privacy and bodily autonomy.\n\nCompulsory vaccination was introduced in Austria in February, 2022, but was suspended already in March before being dropped altogether in the summer after heated protests.\n\nStory at the derstandard.de here.\n\nThe courageous Sönnichsen was an outspoken critic of the Austrian government’s harsh COVID measures and used scientific arguments to refute the charges against him.\n\n“Sönnichsen pleaded his innocence in the trial. The judge could not recognize a subjective factual element or an intent to enrich,” Der Standard reports. Prosecutors claimed the doctor’s certificates “were issued via the Internet without the patients having been conscientiously examined”, but the defendant “argued that the certificates very much had a medical value”.\n\n“According to the judge, the physician had wanted to issue a medical certificate as a doctor to help people not to have to go vaccinate,” Der Standard reports. “After the acquittal, Sönnichsen strongly criticized the Covid policy in an interview with ORF Salzburg. Those who had not been vaccinated had been severely defamed and discriminated against.”\n\nAt the end of 2021 in a press conference, Sönnichsen called COVID 19 the “biggest medical scandal of all time”, and at a press conference in Salzburg in November 2021, he warned that the risk-benefit ratio of vaccination against Corona was “highly likely to be negative for most healthy people and especially for children.”\n\nIn an open letter to the Salzburg Medical Association at the end of October 2022, Sönnichsen called the Covid vaccination of healthy people “a crime because the harm is much greater than the benefit”.\n\nAnd now that the overwhelming evidence for the harmfulness of vaccination has come to light, Sönnichsen says the Hippocratic Oath “obliges” him to issue vaccination exemption certificates, especially “when a corrupt state and an even more corrupt medical association, made up of puppets of the pharmaceutical industry, coerce people into a potentially lethal vaccination.”", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2023/02/Vaccine-bottle.png", "https://www.derstandard.de/story/2000143400611/freispruch-fuer-arzt-der-corona-impfunfaehigkeit-atteste-ausstellte", "https://www.derstandard.de/story/2000143400611/freispruch-fuer-arzt-der-corona-impfunfaehigkeit-atteste-ausstellte", "https://www.derstandard.de/story/2000143400611/freispruch-fuer-arzt-der-corona-impfunfaehigkeit-atteste-ausstellte"], "authors": [], "publish_date": null}