{"result_id": "226005", "URL": "https://notrickszone.com/2022/02/25/1300-more-cases-of-injury-suspected-by-german-insurer-than-reported-by-paul-ehrlich-institute/", "timestamp": "2023-04-25 16:37:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/02/25/1300-more-cases-of-injury-suspected-by-german-insurer-than-reported-by-paul-ehrlich-institute/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "1300% More Cases Of Injury Suspected By German Insurer Than Reported By Paul Ehrlich Institute", "cleaned_text": "Germany’s Paul Ehrlich Institute (PEI) reported 244,576 cases of vaccine side effects for 2021. But the BKK ProVita health insurer has found that the number may be as high as 3 million!\n\nIt’s clear that media, governments and institutions are suppressing the real numbers when it comes mRNA vaccine side effects.\n\nThis was confirmed two days ago when Germany’s “Welt” online daily published an article on the findings found by the health insurer BKK ProVita.\n\nAndreas Schöfbeck, board member of the BKK ProVita, had evaluated data from the 10.9 million BKK insured persons for vaccination side effects. The result: “The number of patients suffering side effects from the COVID vaccines is much higher than first thought.” In the findings, Schöfbeck speaks of a “severe warning signal”.\n\nIn a February 21, 2022, letter to Germany’s Paul Ehrlich Federal Institute for Vaccines and Biomedicines, the BKK ProVita wrote that they had evaluated data from the entire first half of 2021 and half of the data from the 3rd quarter of 2021. The letter continued:\n\nThe evaluation showed from a sampling, even though the entire data is not yet available for 2021, that we expect to see 216,695 treated cases for side effects after Corona vaccination. When these figures are computed for the entire year and entire population in Germany, then the result is expected to be 2.5 – 3 million people who were medically treated by doctors for side effects after vaccination.”\n\nNote these 2.5 – 3 million are cases that were serious enough to cause the patient to seek out medical help and does not include those who stayed home and toughed it out.\n\nGermany’s BKK ProVita health insurer sends a letter to the Paul Ehrlich Vaccine Institute warning of “severe warning signal” in the data on patients treated for vaccine side effects.\n\n“When we factor in the number of vaccinated persons in Germany, this means that about 4 to 5% of the vaccinated people in Germany were treated by doctors for vaccine side effects,” wrote the BKK in its letter to the PEI. “Because a danger to human life cannot be excluded, we request your reply on this matter by 6 pm, February 22, 2022.”\n\nIt is not known if the Paul Ehrlich Institute actually replied to the BKK. Earlier the PEI announced that Germany had seen inly 244, 576 cases of vaccine side effects, less than one tenth estimated by the BKK ProVita.\n\nThe BKK ProVita is one of Germany’s oldest insurers.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.welt.de/politik/deutschland/plus237106177/Coronavirus-Mehr-Impf-Nebenwirkungen-als-bisher-bekannt.html", "https://twitter.com/UnbiasedReport/status/1496575430656155660/photo/1", "https://notrickszone.com/wp-content/uploads/2022/02/BKK-letter.png"], "authors": [], "publish_date": null}