{"result_id": "226034", "URL": "https://notrickszone.com/2022/07/10/the-harrowing-covid-vaccine-injury-story-of-a-36-year-old-german-now-permanently-disabled/", "timestamp": "2023-04-25 16:37:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/07/10/the-harrowing-covid-vaccine-injury-story-of-a-36-year-old-german-now-permanently-disabled/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "The Tragic COVID Vaccine Injury Story Of A 36-Year Old German. Now Permanently Disabled", "cleaned_text": "Two days ago, German online weekly FOCUS here reported on the adverse side effects of the COVID mRNA vaccines, a topic that up until recently had been taboo in Europe. Thankfully, the media seems to be slowly waking up to the vaccine folly and adverse effects.\n\n\n\nMany German physicians refuse to acknowledge the potential risks of COVID vaccines, despite clear evidence and great numbers of reported adverse effects. Image: The Lancet\n\nFrom healthy to disabled in a matter of minutes\n\nSince having been “vaccinated” with Moderna, German Ken Schneider (36) has been suffering health issues and agreed to be interviewed by FOCUS. In the interview he tells the German news weekly how at first the doctor didn’t take his complaints of “weakness, dizziness, swollen lymph nodes, high pulse and shortness of breath” seriously and suggested his ailments were imagined.\n\nBut Schneider’s ailments have in fact gotten even worse in the hot summer weather. An examination now shows Schneider is suffering from myocarditis and neurological damage.\n\nAs of the end of 2021, according to the Robert Koch Institute (RKI) data, as reported by FOCUS, there had been 244,576 reported cases of possible vaccine side effects…which corresponds to a rate of 1.64 per 1000 doses. But that figure is likely far higher due to the massive underreporting taking place in Germany, where physicians frequently forgo reporting cases because they need over 30 minutes to write the report and they don’t have the time for it.\n\nInstead, Schneider tells FOCUS how the doctor in his case first chose to play down his injuries, insisting he was fine, telling him to stop worrying, and to pretend everything was okay and that he was the first patient to complain about side effects. “The whole thing almost sounds funny, in retrospect. If only it weren’t so sad,” Schneider recalls.\n\nAll too often in Germany, patients complaining of ailments after vaccines are not taken seriously and told to go home and stop imagining the “nonsense”.\n\nLater, fortunately, the doctor did “familiarize himself with the subject” and then even apologized to Schneider.\n\nIn Schneider’s case, tests showed the vaccines indeed likely had caused clots to form, with one migrating to the heart and causing nerve tracts leading away from the brain to be destroyed. “A condition that cannot be reversed,” his neurologist told him. “You will never be able to work again,” he said.\n\n“In just a matter of minutes, Schneider’s went from being a healthy active working man to a disabled pensioner. To add insult to injury, Schneider will have to get by with only €1,200 a month from the state. “A slap in the face.”\n\n“Before my Corona vaccination, I did weight training, mountain biking,” Schneider told FOCUS. “Now I spend most of the day in bed.”", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.focus.de/gesundheit/coronavirus/long-covid-nach-der-impfung-erst-hielt-mich-der-arzt-fuer-einen-simulant-spaeter-sagte-er-ich-koenne-nie-mehr-arbeiten_id_108012533.html", "https://notrickszone.com/wp-content/uploads/2022/07/Vaccine-negative-efficacy.png", "https://www.focus.de/gesundheit/coronavirus/long-covid-nach-der-impfung-erst-hielt-mich-der-arzt-fuer-einen-simulant-spaeter-sagte-er-ich-koenne-nie-mehr-arbeiten_id_108012533.html", "https://www.focus.de/gesundheit/coronavirus/long-covid-nach-der-impfung-erst-hielt-mich-der-arzt-fuer-einen-simulant-spaeter-sagte-er-ich-koenne-nie-mehr-arbeiten_id_108012533.html", "https://www.focus.de/gesundheit/coronavirus/long-covid-nach-der-impfung-erst-hielt-mich-der-arzt-fuer-einen-simulant-spaeter-sagte-er-ich-koenne-nie-mehr-arbeiten_id_108012533.html", "https://www.focus.de/gesundheit/coronavirus/long-covid-nach-der-impfung-erst-hielt-mich-der-arzt-fuer-einen-simulant-spaeter-sagte-er-ich-koenne-nie-mehr-arbeiten_id_108012533.html"], "authors": [], "publish_date": null}