{"result_id": "226020", "URL": "https://notrickszone.com/2022/08/11/young-adults-18-24-are-41-44-times-more-likely-to-be-afflicted-with-myocarditis-than-unvaccinated/", "timestamp": "2023-04-25 16:37:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/08/11/young-adults-18-24-are-41-44-times-more-likely-to-be-afflicted-with-myocarditis-than-unvaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Vaccinated Young Adults 18-24 Are 41-44 Times More Likely To Be Afflicted With Myocarditis Than Unvaccinated", "cleaned_text": "The dangers of the mRNA COVID vaccines for young people has been increasingly exposed.\n\nMyocarditis is an inflammation of the heart that may lead to irregular heart rhythms and a reduction in the heart’s capacity to pump blood. It is a potentially life-threatening or life-shortening injury that received little public attention until recent years.\n\nPrior to the widespread availability of COVID-19 mRNA vaccines for all age groups (March 2020 to January 2021), there was no increased risk (and perhaps a slightly lower risk) of myocarditis following COVID-19 infection among the unvaccinated vs. control group (Tuvali et al., 2022).\n\nEver since the COVID vaccines became available to the younger age groups, physicians have begun reporting much higher rates of myocarditis among the vaccinated. Males and females 18 to 24 are, respectively, 44 and 41 times more likely to be afflicted with myocarditis than their unvaccinated peers (Le Vu et al., 2022). The rates of vaccine-associated myocarditis are reported to be as high as 1 in 5,900 second doses.\n\nAnother new study indicates the rate of myocarditis or pericarditis is 1 in 3,339 for males 18 to 24 receiving 2 doses of the Moderna vaccine, and it is 1 in 6,262 for males 12 to 17.\n\nBy January, 2022, one year after the vaccines became available, there were already over 1,000 peer-reviewed scientific papers reporting on mRNA vaccine-induced injuries like myocarditis. Now that the censorial proclivities of governments and health authorities has waned, the literature is teeming with vaccine injury reports.\n\nAs an indication of what may become a trend worldwide, just this week Denmark has banned COVID-19 vaccination for children.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.mdpi.com/2077-0383/11/8/2219", "https://www.mdpi.com/2077-0383/11/8/2219", "https://www.nature.com/articles/s41467-022-31401-5", "https://www.nature.com/articles/s41467-022-31401-5", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2793551", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2793551", "https://www.informedchoiceaustralia.com/post/1000-peer-reviewed-studies-questioning-covid-19-vaccine-safety", "https://www.informedchoiceaustralia.com/post/1000-peer-reviewed-studies-questioning-covid-19-vaccine-safety", "https://www.westernstandard.news/news/denmark-bans-covid-vaccines-for-children/article_f9f70ba0-18c4-11ed-89cc-3b914fdcb391.html"], "authors": [], "publish_date": null}