{"result_id": "226021", "URL": "https://notrickszone.com/2020/10/02/leading-german-virologist-prof-hendrik-streeck-covid-19-vaccine-in-the-near-future-is-unlikely/", "timestamp": "2023-04-25 16:37:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2020/10/02/leading-german-virologist-prof-hendrik-streeck-covid-19-vaccine-in-the-near-future-is-unlikely/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Leading German Virologist Prof. Hendrik Streeck: “Covid-19 Vaccine In The Near Future Is Unlikely”", "cleaned_text": "Leading German virologist Professor Hendrik Streeck is skeptical about a quick vaccine for COVID-19, reports t-online.de.\n\nWhen asked in an interview why he was so skeptical, Streeck, director of the Institute of Virology at the University Hospital in Bonn, said\n\n nobody can say exactly when the vaccine against Covid-19 will be available and thinks “a Covid-19 vaccine in the near future is unlikely”.\n\nCurrently several vaccine projects are currently in the final clinical trial phase on volunteers. Streeck told t-online: “It may be that the next vaccine will work wonderfully. But it may also be that all vaccines that are in Phase III do not work. This simply cannot be seriously predicted.”\n\nTo caution against a new vaccine, Streeck cites a 1961 vaccine against RSV, where “everything went well” in initial tests on children. Later it turned out it could make the disease even worse. “As a result of the vaccine trials in 1961, two children who had previously received the vaccine died. We know the same phenomenon from dengue and other pathogens,” he told t-online.\n\nHe added another example: an AstraZeneca vaccine, which he says is likely to cause someone to become infected and so the ” virus can still be passed on”.\n\nAccording to Streeck, it’s far too early to say when a vaccine will be ready and effective. “I’m just saying we don’t know.”\n\nStreeck also criticizes the lack of coordination and cooperation in the research and some researchers are more concerned about their egos than getting good results. “The research is not done together, everyone tries to be the fastest for himself. This is a pity, because it is partly about delivering fast results, so that the individual distinguishes himself with a better publication,” Streeck told t-online. “A pandemic should lead to a distribution of tasks among all researchers. That is my vision for science, that we all work together – worldwide.”\n\nVirologist Streeck is sure about one thing: ”There is no question that the number of infections will increase.”", "opengraph": {}, "tags": ["Misc."], "tweets": [], "movies": [], "links": ["https://www.t-online.de/gesundheit/krankheiten-symptome/id_88659440/virologe-streeck-im-interview-warum-sind-sie-so-skeptisch-beim-impfstoff-.html?fbclid=IwAR2iY6mFLyEg8zKAudqNOfaP0SzIEanlUG4Kdd7ZQ3XftSeCKFqBNx3gKyI", "https://notrickszone.com/wp-content/uploads/2020/10/Streeck-U-of-Bonn.png", "https://www.youtube.com/watch?v=OmhAt6Zsn74&feature=youtu.be&fbclid=IwAR2eZsOTeSYplCorDFEc1_ZHpJYakWaDH8h9zRUYZ2fpxjgsLrtmGXy4KkQ"], "authors": [], "publish_date": null}