{"result_id": "226026", "URL": "https://notrickszone.com/2022/07/02/former-pfizer-executive-warns-spike-protein-shot-a-diabolical-mistake-toxic-and-mutates-rapidly/", "timestamp": "2023-04-25 16:37:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/07/02/former-pfizer-executive-warns-spike-protein-shot-a-diabolical-mistake-toxic-and-mutates-rapidly/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Former Pfizer Executive Warns: Spike Protein Shot A “Diabolical Mistake”, “Toxic” And “Mutates Rapidly”", "cleaned_text": "A new paper appearing in the prestigious New England Journal of medicine titles: “Effects of Previous Infection and Vaccination on Symptomatic Omicron Infections” by Altarawneh et al find that vaccines are worse than what they are claimed to be and that natural immunity is better.\n\nThe study, investigated vaccination rates and immunity among more than 100,000 Omicron infected and non-infected individuals.\n\n“The authors found that those who had a prior infection but no vaccination had a 46.1 and 50 percent immunity against the two subvariants of the Omicron variant, even at an interval of more than 300 days since the previous infection,” reports the Epoch Times here. “However, individuals who received two doses of the Pfizer and Moderna vaccine but had no previous infection, were found with negative immunity against both BA.1 and BA.2 Omicron subvariants, indicating an increased risk of contracting COVID-19 than an average person without prior infection and vaccination.”\n\nSix months after getting two doses of the Pfizer vaccine, immunity against any Omicron infection gradually dropped to -3.4 percent, below an average person without infection and vaccination (control) which would be set at 0. For two doses of the Moderna vaccine, immunity against any Omicron infection dropped to -10.3 percent after more than six months since the last injection. The authors reported that three doses of the Pfizer vaccine increased immunity to over 50 percent. However, considering that immunity was measured at only 42 days after the third vaccination, this is a very rapid immune decline over a short time period. In comparison, previous infection gave 50 percent immunity, even over 300 days after the infection, which is a far longer period of protection.”\n\nMeanwhile, Michael Yeadon, Ph.D., a former vice-president and chief scientific adviser for the drug company Pfizer, warns that the use of the spike protein in the shot is “a diabolical mistake” and that the spike protein is also “toxic and mutates rapidly”. Read more here.", "opengraph": {}, "tags": ["Misc."], "tweets": [], "movies": [], "links": ["https://www.nejm.org/doi/full/10.1056/NEJMoa2203965?query=featured_home", "https://www.theepochtimes.com/vaccination-increases-risk-of-covid-19-but-infection-without-vaccination-gives-immunity-study_4544042.html", "https://www.theepochtimes.com/t-moderna-vaccine", "https://www.theepochtimes.com/vaccination-increases-risk-of-covid-19-but-infection-without-vaccination-gives-immunity-study_4544042.html", "https://www.theepochtimes.com/t-pfizer-vaccine", "https://articles.mercola.com/sites/articles/archive/2022/07/02/leaky-covid-vaccine.aspx"], "authors": [], "publish_date": null}