{"result_id": "226007", "URL": "https://notrickszone.com/2021/12/16/its-official-covid-vaccines-infection-disease-protection-lasts-3-6-months-then-it-vanishes/", "timestamp": "2023-04-25 16:37:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2021/12/16/its-official-covid-vaccines-infection-disease-protection-lasts-3-6-months-then-it-vanishes/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "It’s Official: COVID Vaccines’ Infection/Disease Protection Lasts 3-6 Months, Then It ‘Vanishes’", "cleaned_text": "A summary of some of the latest research affirms COVID vaccine effectiveness at preventing and reducing disease/viral load is very temporary and prone to disappearing. This suggests shot after shot in perpetuity is required to maintain one’s “vaccinated” status.\n\nDisturbing research on the waning effectiveness of COVID vaccines has been elevated from the pre-print to a peer-reviewed publication in the journal Nature Medicine.\n\nAlthough “initially effective” in reducing the severity of disease for the first month or two after vaccination, the authors (Levine-Tiefenbrun et al., 2021) assert an infection with the Delta variant ultimately renders “no difference” in the Ct (cycle threshold), or viral load, of the vaccinated versus the unvaccinated.\n\n“[V]iral load reduction effectiveness declines with time after vaccination, significantly decreasing at 3 months after vaccination and effectively vanishing after about 6 months.”\n\nAnother recent study (Israel et al., 2021) also indicates the COVID infection protection that vaccines are advertised to offer plummets by up to 40% per month within 2½ months after the second dose.\n\nIn stark contrast to the rapidly disappearing viral load and infectivity effectiveness of vaccines, a study with a sample size of over 5.7 million people has determined a recovery from a COVID infection offers (a) 7.7 times greater protection from severe disease (compared to the vaccinated: 0.6 versus 4.6 rates) as well as (b) “substantial natural immunity against reinfection” (Goldberg et al., 2021). Unvaccinated individuals with a prior infection are more than 6 times less likely to be (re)infected with COVID than the vaccinated with no prior reinfection.\n\nAccording to 11 studies with a collective sample size of 615,77, the re-infection rate is just 0.27% for those who have been infected previously (Murchu et al., 2021). That is, 1 of every 370 people are infected with COVID twice.\n\nPeople who do happen to get COVID twice are hospitalized at a rate of only 0.03% (5 per 14,840). The COVID death rate for those with natural immunity (but who nonetheless are re-infected) is just 0.01% (Kojima and Klausner, 2021).\n\nOn a final note, it is encouraging to learn that healthy (no underlying condition) children aged 5 to 11 in Germany are hospitalized at a rate of just 2 per 100,000 if infected COVID (Sorg et al., 2021). And, even better, there have been zero deaths linked to COVID among the 404,847 confirmed cases this age group.\n\nThis begs the question: Why are we vaccinating children aged 5-11?", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.nature.com/articles/s41591-021-01575-4", "https://www.nature.com/articles/s41591-021-01575-4", "https://pubmed.ncbi.nlm.nih.gov/34462761/", "https://pubmed.ncbi.nlm.nih.gov/34462761/", "https://www.medrxiv.org/content/10.1101/2021.12.04.21267114v1.full.pdf", "https://www.medrxiv.org/content/10.1101/2021.12.04.21267114v1.full.pdf", "https://onlinelibrary.wiley.com/doi/10.1002/rmv.2260", "https://onlinelibrary.wiley.com/doi/10.1002/rmv.2260", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00676-9/fulltext", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00676-9/fulltext", "https://www.medrxiv.org/content/10.1101/2021.11.30.21267048v1.full.pdf", "https://www.medrxiv.org/content/10.1101/2021.11.30.21267048v1.full.pdf"], "authors": [], "publish_date": null}