{"result_id": "226041", "URL": "https://notrickszone.com/2023/02/25/german-mainstream-media-serious-flaws-in-pfizer-biontech-vaccine-study-many-irregularities/comment-page-1/", "timestamp": "2023-04-25 16:37:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2023/02/25/german-mainstream-media-serious-flaws-in-pfizer-biontech-vaccine-study-many-irregularities/comment-page-1/#comments", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "German Mainstream Media: “Serious Flaws In Pfizer BioNTech Vaccine Study”…”Many Irregularities”", "cleaned_text": "Studies, trials by Pfizer Biontech were “seriously flawed” and fraught with “many irregularities” German journalist finds. It’s all beginning to dawn on the media…\n\nEmergency approval based on sloppy and deceptive trials and studies?\n\nAt Germany’s flagship daily Die Welt, journalist Elke Bodderas recently penned an investigative article: The Many Irregularities In The Pfizer Approval Study\n\nUntil recently, Germany’s mainstream media had refused to report on the glaring number of side effects of the COVID 19 mRNA vaccines, dismissing them has disinformation spread by rightwing crackpots. But now there’s no denying something has gone terribly awry, and that the “crackpots” had been right all along.\n\nIn her article, Bodderas concedes that the Biontech/Pfizer’s mRNA vaccine appears to have been “based on incorrect documentation”, that there is “growing doubt about the data from the pivotal Phase 3 trial” and that “Pfizer is dodging the accusations and refusing to be scrutinized.”\n\nThe metropolis Buenos Aires was a key area for test phase with almost 6000 of the 43,548 test subjects worldwide. and things there, according to Die Welt’s Bodderas, “did not go as they should have”.\n\nThe “significant, consequential irregularities” that arose during the trials “cast the entire study of the efficacy and side effects of the Biontech/Pfizer vaccine in a different light.”\n\nNo one believes “safe and effective”, not even the media\n\nIn Germany, the days of believing the new mRNA vaccines by Biontech and Pfizer are “safe and effective” are finally disappearing as a reluctant mainstream media begins to report on the glaring adverse effects and the now well-known inadequately conducted trials.\n\nIn other parts of the world, it’s been long known that these new experimental vaccines not only did not work like they once had been claimed to do, but that they also never prevented the transmission of the virus and had numerous, dangerous side effects. Only now, months later, are these now well-known facts beginning to dawn on Germany’s mainstream media.\n\nDie Welt reports on how Argentine test candidate Augusto Roux, a 36-year old lawyer, felt unwell after having received his second dose in the trials, then “experienced shortness of breath, burning chest pain, nausea, and fever” and that “his urine turned black like cola” before passing out. After having been admitted to a hospital, physician Gisela di Stilio suspected an “adverse reaction to coronavirus vaccine (high probability).” But Roux was simply dropped from the December 2020 study, and never appeared in subsequent evaluations. Instead he was counted as having suffered from COVID-19.\n\nIn total, “In one fell swoop, the test administration [in Buenos Aires] had said goodbye to 53 subjects on August 31, 2020. The test candidates had been ‘unblinded.'” reports Die Welt’s Bodderas.\n\nDie Welt adds: “A total of 302 subjects of the vaccine group were deleted from the study after the second vaccination and thus not included in the evaluation. 200 of them came from Buenos Aires. Have unwelcome results been suppressed here?”\n\nAccording to Bodderas, “Deaths were concealed, serious side effects were not registered, and the study protocol was violated several times.”\n\n“The case casts a bad light on Pfizer, a company that has often been plagued by scandal in the past, but also on the regulatory agencies EMA and FDA.”\n\nBodderas also appeared on Bild’s Viertel Nach Acht: “Serious Flaws in Pfizer BioNTech Vaccine Study.”", "opengraph": {}, "tags": ["Misc."], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2023/02/Vaccine-bottle-1.png", "https://www.welt.de/politik/deutschland/plus243820767/Corona-Impfstoff-Die-vielen-Ungereimtheiten-bei-der-Pfizer-Zulassungsstudie.html", "https://www.youtube.com/watch?v=QTKBIMBB2Xw&t=0s"], "authors": [], "publish_date": null}