{"result_id": "226009", "URL": "https://notrickszone.com/2022/10/25/incredible-shrinking-vaccine-efficacy-health-minister-concedes-severe-cases-not-prevented/", "timestamp": "2023-04-25 16:37:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/10/25/incredible-shrinking-vaccine-efficacy-health-minister-concedes-severe-cases-not-prevented/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Incredible Shrinking Vaccine Efficacy: Federal Health Minister Concedes Severe Cases Not Prevented", "cleaned_text": "First they promised it offered you immunity and stopped transmission. It didn’t.\n\nThen that changed to: it prevented serious cases, which also was untrue.\n\nNow the latest promise is: Well, it keeps you from dying of COVID at the hospital.\n\nThe string of phony promises surrounding the mRNA vaccines is long.\n\nDo you remember? “Two weeks to flatten the curve”. But that didn’t work and so a novel vaccine got rushed out at warp speed (i.e. without any proper development quality control).\n\n“If you get vaccinated, you won’t get COVID,” President Joe Biden claimed.\n\nIt’ll stop the virus from being transmitted, others insisted. In April 2021, Biontec’s chief even predicted that “herd immunity” would be achieved by August. But that was all bogus, too. Vaccinated people started getting sick with COVID, too.\n\n“Well, it’s just some rare breakthrough cases,” they claimed next. Yet, here as well the “rare breakthrough cases” became frequent. Fully vaccinated persons are reported getting COVID everywhere, often not once but twice.\n\nSo then they moved on next to the next promise: “Well, the vaccine prevents serious cases.” Lo and behold, that too has since turned out to be a complete myth. In fact, some data suggest that a disproportionately high number of COVID hospitalizations are among the vaccinated, never mind all the side effects.\n\nThe mRNA vaccines are having little or no effect on the severity of the infection, it’s becoming clear. Now this has been confirmed by Germany’s Minister of Health, Karl Lauterbach at a Parliamentary hearing in Berlin yesterday, as Stefan Homburg notes at Twitter:\n\nWhen a German parliamentarian asked Lauterbach why so many vaccinated people were winding up hospitalized with COVID despite being vaccinated after being promised they would get only mild cases, the Health Minister could no longer deny it, conceding vaccinated people were indeed suffering in hospitals from severe cases. Lauterbach was left with no choice – he had to concoct a new promise: If you get vaccinated, you won’t die of serious COVID in the hospital.\n\n“The difference is that there’s difference if you come to the hospital and get successfully treated, or if you come to a hospital and die,” Lauterbach answered. “People come to the hospitals and survive the illness because they were vaccinated. And if they weren’t vaccinated, then the course of the illness would be much more serious and more people would die.”\n\nOf course, that promise most likely will also turn out to be totally bogus as well.\n\nWhat could the next promise after that possibly be? If you get vaccinated, you’ll be able to pass through the Gates of St. Peter?", "opengraph": {}, "tags": ["Misc."], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"de\" dir=\"ltr\">Lauterbach: Kein Schutz vor schwerer Erkrankung!</p>\n<p>Auf Nachfrage weicht <a href=\"https://twitter.com/Karl_Lauterbach?ref_src=twsrc%5Etfw\">@Karl_Lauterbach</a> aus und behauptet nur noch Schutz vor Tod – vorerst.</p>\n<p>Nachdem der Schutz vor Infektion und Übertragung schon von Pfizer abgeräumt wurden, bleibt fast nichts übrig.<a href=\"https://t.co/VYvezDoLzK\">pic.twitter.com/VYvezDoLzK</a></p>\n<p>— Stefan Homburg (@SHomburg) <a href=\"https://twitter.com/SHomburg/status/1584602018932731904?ref_src=twsrc%5Etfw\">October 24, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://twitter.com/Karl_Lauterbach?ref_src=twsrc%5Etfw", "https://t.co/VYvezDoLzK", "https://twitter.com/SHomburg/status/1584602018932731904?ref_src=twsrc%5Etfw"], "authors": [], "publish_date": null}