{"result_id": "226049", "URL": "https://notrickszone.com/2022/12/24/german-survey-results-show-one-in-three-18-29-year-olds-have-seen-severe-vaccine-side-effects/comment-page-1/", "timestamp": "2023-04-25 16:38:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/12/24/german-survey-results-show-one-in-three-18-29-year-olds-have-seen-severe-vaccine-side-effects/comment-page-1/#comments", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "German Survey Results Show One In Three 18-29 Year-Olds Have Seen “Severe Vaccine Side Effects”", "cleaned_text": "Germany’s Pleiteticker.de here reports on a recent INSA survey that shows “one in three experienced severe vaccine side effects”.\n\nMoreover, Corona vaccines have long lost their appeal since being (falsely) portrayed as the gateway back to freedom and the savior of humanity.\n\n“A majority would not like to be vaccinated again against the Corona virus,” reports Pleiteticker.de “This is according to a new survey by the research institute INSA-Consulere.”\n\n“Thirty-three percent of young respondents between 18 and 29 said they themselves had suffered severely from the side effects of a Corona vaccination, or had close family members who had,” the German site reports. “17 percent of respondents said they had been affected.”\n\nKittle wonder the willingness to vaccinate has plummeted and millions of vaccine doses will end up being disposed of and costing taxpayers billions worldwide.\n\n“47 percent” of the population have said they are not planning to get the vaccine against the Corona virus again, while 40 percent are considering another vaccination.\n\n“There is no longer any sign of vaccination euphoria,” said Hermann Bringer, managing director of INSA-Consulere.\n\n54 percent of the young people would rather not be vaccinated. Only older people over 60 years of age intend by a majority to be vaccinated (once again) against the Corona virus.\n\n“The unvaccinated rule out vaccination by an overwhelming 92 percent.”\n\nCount me in on the latter.", "opengraph": {}, "tags": ["Misc."], "tweets": [], "movies": [], "links": ["https://pleiteticker.de/impf-umfrage-jeder-dritte-junge-mensch-mit-schweren-impfnebenwirkungen/"], "authors": [], "publish_date": null}