{"result_id": "226028", "URL": "https://notrickszone.com/2022/01/21/analysis-by-german-prof-thousands-of-hidden-deaths-daily-may-be-greatest-medical-debacle-in-human-history/comment-page-1/", "timestamp": "2023-04-25 16:37:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/01/21/analysis-by-german-prof-thousands-of-hidden-deaths-daily-may-be-greatest-medical-debacle-in-human-history/comment-page-1/#comments", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Analysis By German Prof: “Thousands Of Hidden Deaths Daily” …May Be Greatest Medical Debacle In Human History", "cleaned_text": "Shocking mortality data from Germany, Austria, Israel, England: thousands of post-vaccine non-Covid deaths covered up – miscategorized as unvaccinated deaths…”extremely alarming situation”\n\n“Thousands are dying of the vaccine daily without us even being aware of it.”\n\nUniversity of Regensberg Professor Christof Kuhbandner uncovered what he calls an extremely alarming situation, one where thousands and thousands of vaccine deaths are being hidden in the statistics.\n\nAccording to this Austrian report broadcast by servus.tv, Prof. Kuhbandner happened to come across a recent preprint study in the journal ResearchGate, where the authors examined the UK ONS vaccine mortality surveillance report.\n\nAlthough at first glance the all-cause mortality appeared far lower in the vaccinated than the unvaccinated, on closer inspection they found fundamental inconsistencies and anomalies in the data and that there had been a “systemic miscategorization of deaths between the different categories of unvaccinated and vaccinated” among other factors.\n\nFor the period of calendar week 1-38, 2021, Figures 8 and 9 show strong peaks in non-Covid mortality for the unvaccinated 60-69 and 70-79 age groups while the mortality among the vaccinated stayed steady.\n\nAt first glance this would suggest that the vaccines were functioning well in England and Wales. But the ending is not a happy one.\n\nDisturbing: The peaks did occur at the same time\n\nProf. Kuhbandner noted something very unusual was going on and examined the trend also for the 80+ age group as well. The following are the plots for all three age groups. The peaks and deaths were offset.\n\nMoreover, the paper’s authors also commented:\n\nIn other words, the vaccines were rolled out in stages, first administered to the most elderly (80+years old) and then to the next group (70-79) and then to the 60-69 group some weeks later. The death peaks then followed the vaccination stages.\n\nSo why would people NOT getting the vaccine be the ones dying in huge numbers, and not those getting the vaccine?\n\nThis is because in Europe the status of “vaccinated” first gets assigned 14 days after getting the final jab. Thus any deaths occurring before this, ends up being counted as an “unvaccinated death”! So if a patient who got a vaccine dies less than 14 days later, he/she gets counted as an unvaccinated death. This is how vaccine deaths are getting hidden. And there many thousands.\n\nAs Figures 5-7 above show, thousands of deaths occurred shortly after the vaccines had been administered, and many among them were likely linked to the vaccine itself. If this is the case globally, and not just in Britain, then the number of vaccine deaths may be profound. The nightmare appears to be true, Prof Kuhbandner shows.\n\nProf. Kuhbandner then examined the mortality data for Germany and found the very same pattern: large jumps in mortality immediately following the vaccine campaigns. These deaths appear to be directly the result of vaccinations. It’s just too coincidental to be dismissed.\n\nCarnage equivalent to two commercial jets crashing every day\n\n“When you express this in numbers, it translates to 700 more deaths a day on average,’ Kuhbandner tells servus.tv, looking just at the German numbers. “It would be like two commercial planes full of people crashing every day.”\n\nKuhbandner also found the same pattern of post-vaccination death in Israel.\n\nThe U. of Regensburg professor contacted both the Robert Koch Institute and Paul Ehrlich institutes to present his findings, but so far they’ve ignored them. The RKI wrote they did not “have the capacity to evaluate suspicions from every individual.”\n\nAs it stands, no one knows when these extremely disturbing findings are going to be taken seriously by the responsible authorities. Until they do, however, many thousands more are going to die each and every day.\n\n“If it turns out that there’s a causal effect with the vaccinations, then we are dealing with an extremely alarming situation,” says Kuhbandner. “Then we have a case here where thousands of people are dying of the vaccine daily without us even being aware of it,”", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.servustv.com/aktuelles/v/aa1uhra88dp5llzqs7cp/", "https://www.researchgate.net/publication/356756711_Latest_statistics_on_England_mortality_data_suggest_systematic_mis-categorisation_of_vaccine_status_and_uncertain_effectiveness_of_Covid-19_vaccination", "https://notrickszone.com/wp-content/uploads/2022/01/Mortality-vaxxed-vs-unvaxxed-England-1.png", "https://www.researchgate.net/publication/356756711_Latest_statistics_on_England_mortality_data_suggest_systematic_mis-categorisation_of_vaccine_status_and_uncertain_effectiveness_of_Covid-19_vaccination", "https://notrickszone.com/wp-content/uploads/2022/01/Mortality-vaxxed-vs-unvaxxed-England_2.png", "https://www.researchgate.net/publication/356756711_Latest_statistics_on_England_mortality_data_suggest_systematic_mis-categorisation_of_vaccine_status_and_uncertain_effectiveness_of_Covid-19_vaccination"], "authors": [], "publish_date": null}