{"result_id": "226045", "URL": "https://notrickszone.com/2022/", "timestamp": "2023-04-25 16:37:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Archive for 2022", "cleaned_text": "Share this… Facebook TwitterIs Tesla falling apart? Elon Musk’s dream company is becoming everything except sweet… Electric cars are the technology of the future and by 2030, combustion engine cars won’t even be sold in some countries, we are told. Reality collides with dream Yet, the inconvenient economic and technical realities of electric cars refuse […]\n\nItaly Plans An Energy U-Turn, A Comeback To Nuclear Power As Green Energies “Far From Sufficient” Share this… Facebook Twitter Symbol photo. Grafenrheinfeld power plant, Germany – 2013, Avda – Own work. CC BY-SA 3.0 Italy is planning an energy U-turn reports, the Berliner Morgenpost: “So while Germany is saying goodbye to the use of nuclear energy, the technology is making a comeback in Italy, where people turned away from it almost 40 […]\n\nAnother New Study Affirms The Arctic Was Warmer With Less Sea Ice During The Mid-Holocene Share this… Facebook Twitter“Compared to the present climate, the Arctic climate in MH [Mid-Holocene] summer became warmer and had less sea ice” (Dong et al., 2022). While the modern Arctic “remains largely covered by sea ice in June and July,” the higher summer sea surface temperatures (SSTs) from about 3,000 to 7,000 years ago meant […]\n\nGermany’s ZDF Public Television Suggests Bathing Once A Week Would Be Beneficial Share this… Facebook TwitterPrivate daily showers to become a luxury for the privileged and wealthy in Germany? “What if we showered/bathed only once a week?” You won’t shower any more, and you’ll be happy, German ZDF broadcaster suggests. Image cropped from ZDF kugelzwei. What the BBC is to Great Britain, are what the WDR and […]\n\nNew Study: A ‘Thought Model’ Saying There’s A 33 K ‘Natural Greenhouse Effect’ Is ‘Meritless’ Assumption Share this… Facebook TwitterThe conceptualization of a 33 K warmer Earth due to the presence of water vapor and CO2 (greenhouse gases) in the atmosphere is wholly based on the unobserved and unknown, or assumptions about what an imaginary world with no atmosphere would be like. It is widely believed that we can determine the […]\n\nShare this… Facebook TwitterMERRY CHRISTMAS EVERYBODY! The first half of December here in Central Europe was on the frigid side, but has since warmed up nicely and gotten wet. USA, on the other hand has been seeing extremely brutal winter conditions. Buffalo is now seeing one of its worst blizzards in recorded history, accompanied by […]\n\nGerman Survey Results Show One In Three 18-29 Year-Olds Have Seen “Severe Vaccine Side Effects” Share this… Facebook TwitterVaccination euphoria disappearing in Germany… Germany’s Pleiteticker.de here reports on a recent INSA survey that shows “one in three experienced severe vaccine side effects”. Moreover, Corona vaccines have long lost their appeal since being (falsely) portrayed as the gateway back to freedom and the savior of humanity. “A majority would not like […]\n\nSkeptic Group Clintel Intervenes On Friends Of The Earth Lawsuit Forcing Shell To Cut CO2 Emissions Share this… Facebook TwitterRuling forcing Shell to cut CO2 emissions did not take all the side of the science into account… Clintel Intervenes In Friends Of The Earth’s Shell Lawsuit By Andy May Friends of the Earth (Netherlands) sued Royal Dutch Shell, using The Netherlands law that allows non-governmental organizations to sue over environmental or […]\n\nWhat If Real-World Physics Do Not Support The Claim Top-Of-Atmosphere CO2 Forcing Exists? Share this… Facebook TwitterThe longstanding claim is CO2 (greenhouse gas) top-of-atmosphere (TOA) forcing drives climate change. But it is too cold at the TOA for CO2 (or any greenhouse gas) to exist. Image Sources: Schneider et al., 2020, NASA, UCAR, CGA TOA greenhouse gas forcing is a fundamental tenet of the CO2-drives-climate-change belief system. And […]\n\nTough Mobility Restrictions Coming Soon “Like It Or Not”: Oxford Proposes “15 Minute Nieghborhoods” Share this… Facebook TwitterCitizens to be confined to small areas…permits just to drive into other neighbourhoods People using their cars for short trips to run everyday errands are contributing to the “climate catastrophe” climate doomsday-sayers claim. And whether you like it or not, many of these doomsday-sayers are currently in real positions of power and […]\n\nGerman Officials Blame Gas Shortage On Consumers, Warn “People Will Feel The Cost Of The Energy Crisis Hard” Share this… Facebook TwitterGermany is desperately fighting for every kilowatt-hour of energy…blames consumers for supply shortfalls! Here’s a winning political strategy the German government is using: Just blame the voters for the problems you’ve created. If their mastermind green plans don’t work, it’s the citizens’ fault! Germany energy site Blackout News here reports that this […]\n\nError, Uncertainty In Calculating Natural Climate Forcing Is 24 – 80 Times Larger Than CO2 Forcing Share this… Facebook TwitterIf the error and uncertainty associated with determining the extent to which natural factors (aerosol forcing, downwelling shortwave variability) affect climate are factors of ten times larger than the presumed effects of human activity, then we cannot definitively say human activity is driving climate change. It takes 10 years and 22 ppm […]", "opengraph": {}, "tags": ["CO2 and GHG", "Misc.", "Climate Politics", "Alternative Energy", "Arctic", "Paleo-climatology", "Nuclear energy", "Sea Ice", "Climate Sensitivity", "Natural Variability", "Activism", "Green Follies"], "tweets": [], "movies": [], "links": ["https://notrickszone.com/2022/12/31/berlin-tesla-plant-plagued-by-slow-sales-staffing-shortages-complete-chaos/", "https://notrickszone.com/2022/12/31/berlin-tesla-plant-plagued-by-slow-sales-staffing-shortages-complete-chaos/", "https://notrickszone.com/2022/12/30/italy-plans-an-energy-u-turn-a-comeback-to-nuclear-power-as-green-energies-far-from-sufficient/", "https://notrickszone.com/2022/12/30/italy-plans-an-energy-u-turn-a-comeback-to-nuclear-power-as-green-energies-far-from-sufficient/", "https://notrickszone.com/2022/12/29/another-new-study-affirms-the-arctic-was-warmer-with-less-sea-ice-during-the-mid-holocene/", "https://notrickszone.com/2022/12/29/another-new-study-affirms-the-arctic-was-warmer-with-less-sea-ice-during-the-mid-holocene/", "https://notrickszone.com/2022/12/28/germanys-zdf-public-television-suggests-bathing-once-a-week-would-be-beneficial/", "https://notrickszone.com/2022/12/28/germanys-zdf-public-television-suggests-bathing-once-a-week-would-be-beneficial/", "https://notrickszone.com/2022/12/26/new-study-a-thought-model-saying-theres-a-33-k-natural-greenhouse-effect-is-meritless-assumption/", "https://notrickszone.com/2022/12/26/new-study-a-thought-model-saying-theres-a-33-k-natural-greenhouse-effect-is-meritless-assumption/", "https://notrickszone.com/2022/12/25/the-great-buffalo-christmas-blizzard-of-2022/", "https://notrickszone.com/2022/12/24/german-survey-results-show-one-in-three-18-29-year-olds-have-seen-severe-vaccine-side-effects/", "https://notrickszone.com/2022/12/23/skeptic-group-clientel-intervenes-on-friends-of-the-earth-lawsuit-forcing-shell-to-cut-co2-emissions/", "https://notrickszone.com/2022/12/22/what-if-real-world-physics-do-not-support-the-claim-top-of-atmosphere-co2-forcing-exists/", "https://notrickszone.com/2022/12/22/what-if-real-world-physics-do-not-support-the-claim-top-of-atmosphere-co2-forcing-exists/", "https://notrickszone.com/2022/12/21/tough-mobility-restrictions-coming-soon-like-it-or-not-oxford-proposes-15-minute-nieghborhoods/", "https://notrickszone.com/2022/12/20/german-officials-blame-gas-shortage-on-consumers-warn-people-will-feel-the-cost-of-the-energy-crisis-hard/", "https://notrickszone.com/2022/12/20/german-officials-blame-gas-shortage-on-consumers-warn-people-will-feel-the-cost-of-the-energy-crisis-hard/", "https://notrickszone.com/2022/12/19/error-uncertainty-in-calculating-natural-climate-forcing-is-24-80-times-larger-than-co2-forcing/", "https://notrickszone.com/2022/12/19/error-uncertainty-in-calculating-natural-climate-forcing-is-24-80-times-larger-than-co2-forcing/", "https://notrickszone.com/2022/page/2/"], "authors": [], "publish_date": null}