{"result_id": "226018", "URL": "https://notrickszone.com/2021/11/", "timestamp": "2023-04-25 16:37:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2021/11/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Archive for November 2021", "cleaned_text": "NASA Data On Global Sea Ice Area Shows A Growth Equal To The Size Of Belgium Since 1982! Share this… Facebook Twitter Global Sea Ice Area Data analyst Zoe Phin just posted some interesting, surprising results on global sea ice area. Data sources like the National Snow and Ice Data Center show global sea ice has been” drastically decreasing for a long time” and so we need to panic and overhaul the entire carbon […]\n\nThere Has Been No Trend In A ‘Key Holistic Variable Indicating Climate Change’ Since 2001 Share this… Facebook TwitterThe Greenland end-of-melt-season snowline should presumably be exhibiting a trend consistent with consequential Greenland ice sheet melt, especially an increase in the bare ice area. Yet, consistent with the recent non-warming trend for Greenland, there has been no statistically significant linear trend in these key climate change metrics. The Polar Portal Arctic […]\n\n“Slow Disaster Playing Out” As Germany Moves To Shut Down 8.5 GW Of Baseload Nuclear Capacity Share this… Facebook TwitterAt FaceBook, Dane Peter Bardland presents a chart and commentary on Germany’s upcoming rapid nuclear power phaseout. By the end of 2022, the government will have shut down another 6 plants with a total (baseload) capacity of 8.54 gigawatts! Chart: Presented by Peter Bardland Yesterday we commented here that Germany will in […]\n\nWeather Lulls: Germany Forced To Burn 20% More Coal, The Very Energy Source That’s To Be Phased Out Share this… Facebook TwitterThe energy source that Germany moves to shut down, rescued the country from widespread blackouts in 2021. Blackout News reports that more of Germany’s power is being produced by coal and nuclear fuels. In 2021, due to unfavorable weather conditions, wind and solar energy production plummeted in 2021 compared to 2020. “Germany’s […]\n\nNew Study: Modelers Got Aerosols All Wrong…CO2 Climate Sensitivity Likely Another 0.4°C Overstated! Share this… Facebook TwitterDie kalte Sonne reports on a new aerosol study by Liu et al. The results are a major blow to the high greenhouse-gas climate sensitivity modelers. IPCC scientists have a favorite wild card they often use to explain serious model discrepancies: aerosols. Mysterious cooling events in the past are often explained away […]\n\nThe Lancet: German/US Treatment Of The Unvaccinated Risks Summoning Nazi/Racist Past Share this… Facebook TwitterAt a time (October, 2021) when 90% of the new COVID cases in UK residents 60 or older are fully vaccinated, a German physician publishing in The Lancet asserts it is “grossly negligent” to suggest the vaccinated are not a relevant source of viral infection and transmission as he pleads for privileged […]\n\nTis The Season To Be Hateful: Hanover Excludes Unvaccinated From Advent And Christmas Celebrations Share this… Facebook TwitterA poster from Hanover, Germany has inspired me to start a new page at this site: My Corona Diaries, 2020s Germany. I don’t need to tell what it reminds me of. I’ll be posting there from time to time to give readers some insight on the madness that’s sweeping across Austria and […]\n\nShare this… Facebook TwitterThe danger of blackouts in Europe is increasing, warns a German energy export. The result could be “numerous deaths “. Also, $10 a gallon not far off… In a recent interview with independent journalist Boris Reitschuster, German energy expert Prof. Fritz Vahrenholt warns that the risk of as power blackout in Europe […]\n\nPhysicists: Climate Model Error Overestimates CO2 Impact On Global Temps By Factor Of 5 Share this… Facebook TwitterA new study suggests CO2 molecules have little consequential impact affecting outgoing radiation, and that climate models attribute global temperature effects to CO2 that are fundamentally erroneous. Russian physicists (Smirnov and Zhilyaev, 2021) have published a peer-reviewed paper in the Advances in Fundamental Physics Special Issue for the journal Foundations. They assesses […]\n\nGerman Physician Warns Already Vaxxed: “Don’t Get Another Shot Under Any Circumstances!“ Share this… Facebook TwitterGerman public health expert, physician, warns those who have already been vaccinated: “Don’t get another shot under any circumstances!“ German physician and public health expert Wolfgang Wodarg is a leading critic of COVID-19 panic and the high pressure vaccine campaign against the COVID-19 virus. In an interview with Elsa Mittmannsgruber, he tells […]\n\nBelow Normal Extremes…2021 Northern Hemisphere Cyclone Activity Below Normal…US Tornadoes Below Normal Share this… Facebook TwitterBy meteorologist Paul Dorian The accumulated cyclone energy (ACE) is the best measure of overall tropical activity and it is below-normal for the 2021 season across the Northern Hemisphere. Data: Colorado State University, NOAA Overview Tropical cyclone activity across the Northern Hemisphere has been below-normal in 2021 in much the same way […]\n\nShare this… Facebook TwitterThe climate issue has become the least of my worries lately. I’ve found over the last couple weeks that blogging about climate is feeling more and more like a trivial use of time. What’s really worrying is the exploding medical tyranny in Europe, which is spreading like an Australian bushfire on a […]", "opengraph": {}, "tags": ["Cooling/Temperature", "Misc.", "CO2 and GHG", "Activism", "Hurricanes/Tornados", "Alternative Energy", "Arctic", "Models", "Climate Sensitivity", "Antarctic", "Pandemic", "Pollution", "Green Follies"], "tweets": [], "movies": [], "links": ["https://notrickszone.com/2021/11/30/nasa-data-on-global-sea-ice-area-shows-a-growth-equal-to-the-size-of-belgium-since-1982/", "https://notrickszone.com/2021/11/29/there-has-been-no-trend-in-a-key-holistic-variable-indicating-climate-change-since-2001/", "https://notrickszone.com/2021/11/29/there-has-been-no-trend-in-a-key-holistic-variable-indicating-climate-change-since-2001/", "https://notrickszone.com/2021/11/28/slow-disaster-playing-out-as-germany-moves-to-shut-down-8-5-gw-of-baseload-nuclear-capacity/", "https://notrickszone.com/2021/11/28/slow-disaster-playing-out-as-germany-moves-to-shut-down-8-5-gw-of-baseload-nuclear-capacity/", "https://notrickszone.com/2021/11/27/weather-lulls-germany-forced-to-burn-20-more-coal-the-very-energy-source-thats-to-be-phased-out/", "https://notrickszone.com/2021/11/26/new-study-modelers-got-aerosols-all-wrong-co2-climate-sensitivity-likely-another-0-4c-overstated/", "https://notrickszone.com/2021/11/26/new-study-modelers-got-aerosols-all-wrong-co2-climate-sensitivity-likely-another-0-4c-overstated/", "https://notrickszone.com/2021/11/25/the-lancet-german-us-treatment-of-the-unvaccinated-risks-summoning-nazi-racist-past/", "https://notrickszone.com/2021/11/25/the-lancet-german-us-treatment-of-the-unvaccinated-risks-summoning-nazi-racist-past/", "https://notrickszone.com/2021/11/24/tis-the-season-to-be-hateful-hanover-excludes-unvaccinated-from-advent-and-christmas-celebrations/", "https://notrickszone.com/2021/11/23/gross-energy-mismanagement-energy-expert-warns-of-europe-power-blackouts-numerous-deaths/", "https://notrickszone.com/2021/11/22/physicists-climate-model-error-overestimates-co2-impact-on-global-temps-by-factor-of-5/", "https://notrickszone.com/2021/11/22/physicists-climate-model-error-overestimates-co2-impact-on-global-temps-by-factor-of-5/", "https://notrickszone.com/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/", "https://notrickszone.com/2021/11/21/german-physician-warns-already-vaxxed-dont-get-another-shot-under-any-circumstances/", "https://notrickszone.com/2021/11/20/below-normal-extremes-2021-northern-hemisphere-cyclone-activity-below-normal-us-tornadoes-below-normal/", "https://notrickszone.com/2021/11/19/climate-issue-hardly-matters-anymore-austria-germany-europe-race-towards-medical-tyranny/", "https://notrickszone.com/2021/11/page/2/"], "authors": [], "publish_date": null}