{"result_id": "226011", "URL": "https://notrickszone.com/2021/12/30/scientists-now-confirm-mrna-vaccines-produce-negative-effectiveness-against-omicron/", "timestamp": "2023-04-25 16:37:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2021/12/30/scientists-now-confirm-mrna-vaccines-produce-negative-effectiveness-against-omicron/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Scientists Now Confirm mRNA Vaccines Produce NEGATIVE Effectiveness Against Omicron", "cleaned_text": "Multiple scientific studies and testing data compiled by national health centers expose the harrowing truth: injection with COVID-19 vaccines actually increase the likelihood of infection with the Omicron variant.\n\nThere were 1.61 million new COVID cases confirmed on 29 December. This is hundreds of thousands more than any other single day since the pandemic began.\n\nOver 1 million of these new cases occurred in 5 highly vaccinated countries: USA, France, UK, Spain, and Canada.\n\nData compiled by the Ontario government show that fully vaccinated individuals have 28% higher COVID-19 infection rates (64 per 100,000) than the unvaccinated (50 per 100,000). On 29 December there were 8,221 new cases in fully vaccinated Ontarians versus 1,514 in the unvaccinated.\n\nAn Omicron study from Denmark tells us that within 91 to 150 days after receiving the Pfizer and Moderna mRNA shots the vaccine effectiveness against symptomatic infection with the Omicron variant is decisively negative: -76.5% and -39.3%, respectively.\n\nIn other words, fully vaccinated individuals are about 40 to 75% more likely to be symptomatically infected with COVID-19 – the Omicron variant – than individuals who have not been vaccinated.\n\nThe effectiveness of Pfizer and Moderna vaccines plummets from about 40-50% during the first month to just above 0% 61 to 90 days after the last dose. After 90 days, the vaccines enhance the likelihood of infection.\n\nThe UK government COVID data compiled between 27 November and 17 December show a similarly disappointing pattern in an analysis of 68,489 Omicron cases.\n\nVaccine (Pfizer, Moderna, AstraZeneca) effectiveness against Omicron hovers around 40-60% during 5-9 weeks after the second dose, but then effectiveness rapidly declines to 0% and below (-5% to -15%) by weeks 20-24.\n\nSeventeen scientists published a pre-print analysis online on 15 December reporting the Omicron variant is “remarkably resistant to neutralization by serum” from the widely-used COVID-19 vaccines.\n\n“Even serum from persons vaccinated and boosted with mRNA-based vaccines exhibited substantially diminished neutralizing activity against [Omicron].”\n\n“The Omicron variant presents a serious threat to many existing COVID-19 vaccines and therapies” as it “seemingly flattens the antibody therapy landscape for COVID-19.”\n\n“[A] substantial decrease in neutralization of [Omicron] was observed, with mean drops of >6.0-foldand >4.1-fold for the fully vaccinated group and boosted group, respectively.”\n\nEarlier this month scientists publishing in The New England Journal of Medicine (including the USA’s notorious Dr. Anthony Fauci) seemed to concede that Omicron changes the pandemic-response landscape.\n\nThey insisted there is already an “urgent need” for new vaccines because mRNA vaccines “elicit transient and incomplete protective immunity” and they are “unable to prevent ‘breakthrough’ infections.” And, due to these “sobering facts,” COVID-19 will “continue to circulate indefinitely”.\n\n==============================\n\n Note:\n\n The question is why would that be so? A weakened immune system? Let’s hope not because that is the last thing a generally poorly nourished population would need if there’s an influenza outbreak this winter. -PG", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.worldometers.info/coronavirus/#countries", "https://covid-19.ontario.ca/data", "https://covid-19.ontario.ca/data", "https://www.medrxiv.org/content/10.1101/2021.12.20.21267966v3", "https://www.medrxiv.org/content/10.1101/2021.12.20.21267966v3", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1043608/Vaccine_surveillance_report_-_week_51.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1043608/Vaccine_surveillance_report_-_week_51.pdf", "https://www.biorxiv.org/content/10.1101/2021.12.14.472719v1.full.pdf", "https://www.nejm.org/doi/full/10.1056/NEJMp2118468", "https://www.nejm.org/doi/full/10.1056/NEJMp2118468"], "authors": [], "publish_date": null}