{"result_id": "226023", "URL": "https://notrickszone.com/2023/01/03/german-ethics-council-chairwoman-investigation-of-corona-debacle-dangerous-to-democracy/", "timestamp": "2023-04-25 16:37:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2023/01/03/german-ethics-council-chairwoman-investigation-of-corona-debacle-dangerous-to-democracy/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "German Ethics Council Chairwoman: Investigation Of Corona Debacle “Dangerous To Democracy”", "cleaned_text": "An investigation of the Corona policies debacle would be “dangerous to democracy”, claims German Ethics Chairwoman Alena Buyx\n\nMany have noticed: Once outspoken COVID restrictions and vaccine proponents just don’t want to talk about it anymore, and are wishing the whole thing to be forgotten.\n\nNot only has the economic and mental health damage been of immense dimensions, but so has the loss of life resulting from the measures, especially the vaccines, have conservatively run in the hundreds in Germany alone. Injuries have run into the tens of thousands. Excess mortality has skyrocketed.\n\nHence it’s little wonder today those responsible for having promoted and enacted these damaging measures are now politically behaving like the reckless hit-and-run drunk driver who wakes up the next day realizing something awful has happened and hopes no one will notice and it will just all go away.\n\nInvestigation of the Corona debacle would be “dangerous to democracy”, claims German Ethics Chairwoman Alena Buyx. Photo source: German Ethics Council.\n\nOne example is Alena Buyx, Chairperson of the German Ethics Council, which served to provide the needed moral cover whenever the German government imposed cruel lockdowns and experimental vaccinations against the will of many people. Buyx was an outspoken promoter of mass vaccination and the restrictive measures.\n\nIn an interview with Germany’s centre-left Die Zeit, Buyx told that the need for an investigation “is understandable, but it’s incredibly toxic. It has a profound effect on polarizing society. And it is dangerous to democracy.”\n\nNow that the data are exposing the greatest medical debacle/fraud of all time, leading persons like Buyx are obviously running scared-to-death of investigations and due process.\n\n“According to Buyx, anyone who is calling for a fundamental reappraisal of Corona’s policies, anyone who demands personal and, if necessary, legal consequences, is an enemy of democracy,” comments Pleiteticker.de here.\n\nThat’s the level of ethics we are seeing in Germany today. Recall how the former communist “The German Democratic Republic”, a.k.a. East Germany, used to claim the same about their phony democracy and any political opposition.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://ec.europa.eu/eurostat/statistics-explained/images/2/24/Map01_Excess_Mortality_2022_Oct.png", "https://notrickszone.com/wp-content/uploads/2023/01/Buyx.png", "https://www.ethikrat.org/en/", "https://www.ethikrat.org/en/", "https://www.ethikrat.org/en/press-releases/press-releases/2021/german-ethics-council-recommends-expansion-of-statutory-duty-to-vaccinate/", "https://pleiteticker.de/suche-nach-schuldigen-demokratiegefaehrdend-ethikrat-chefin-will-corona-aufarbeitung-verhindern/"], "authors": [], "publish_date": null}