{"result_id": "226016", "URL": "https://notrickszone.com/category/allgemein/", "timestamp": "2023-04-25 16:37:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/category/allgemein/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Misc.", "cleaned_text": "Share this… Facebook TwitterBy Die Klimanachrichten If there’s any any doubt, then it’s climate change. Not only more home runs in baseball, but now also more rioting at German public swimming pools in Berlin – due to climate change. The Berliner Zeitung on a report in the WDR. The massive riots in Berlin’s open-air swimming […]\n\nReview Of Koonin’s “Unsettled”…Government, Scientific Institutions As “Instruments Of Hostile Forces” Share this… Facebook TwitterA German scientist asked if I would post the following text on behalf of William Walter Kay =================================== Koonin’s Sociology of Climatology By William Walter Kay BA JD Although focused on hard science, Koonin’s Unsettled broaches Sociology of Climatology in Chapter 10 (WHO BROKE “THE SCIENCE” AND WHY); commencing: Can it […]\n\nTropical Paradise Islands Are Not Sinking And Shrinking…Most Are In Fact Growing! Share this… Facebook TwitterBecause of global warming, tropical paradises are said to be shrinking. In reality, however, most of them are actually GROWING, as extensive long-term studies have shown. By Wolfgang Kaufmann (Editor. PAZ*) On 17 October 2009, the then President of the Maldives, Mohamed Nasheed, convened a cabinet meeting six meters below the surface […]\n\nExpert Warns: Cars Soon Unaffordable To 50% Of Germans! “Huge Social Conflict”… Idiotic, Singular Policy” Share this… Facebook TwitterIdeological green policies are tearing Germany’s economy apart In an interview, Prof. Kurt Lauk, former economic council head and automobile manager, warns half of Germans “will no longer be able to afford a car.” Socially explosive…”a disgrace”. Green policies are currently driving German industry into a wall at 300 km/hr. Image cropped […]\n\nGermany’s Renewable Heating Plan To Cost Many Times More Than Expected: 776 Billion Euros! Share this… Facebook TwitterGermany’s heating debacle takes on even greater dimensions The Federal Ministry of Economics, headed by Robert Habeck (Green party) has “GROSSLY MISCALCULATED” the cost of removing oil and gas heating systems from homes and buildings, and installing heat pumps in their place by 2045. Germany’s heat pump cost estimate is spiraling out […]\n\nShare this… Facebook TwitterThe German news show Tagesschau reports that climate-neutral flying likely will remain “an illusion” for the foreseeable future. Hat- tip: Klimanachrichten The Tagesschau reports: But the development challenges are still enormous. It is also unclear where the gigantic amount of renewable energy needed will come from. Just to cover the current demand […]\n\nDeforesting To Save The Planet? Europe’s Forests Shrinking As Wood Used For “Green” Energy Share this… Facebook TwitterHow wood pellet power plants are fueling climate change By Klimanachrichten (Translated/edited by P. Gosselin) German public broadcasting show SWR3-Wissen had a podcast about burning wood in Europe. In Germany’s forests, less wood is taken than what grows back, but in Europe it’s different. Here, the forest is losing total area, which […]\n\nSurprise: “Coal Became Most Important Energy Source For Electricity In Germany” In 2022 Share this… Facebook TwitterThe more Germany tries to wean itself off fossil fuels, the more it seems to rely on them – especially coal. Germany’s online Blackout News here reports: “Coal again the most important energy source in power generation”. As Germany continues to move ahead and shut down its nuclear power plants, leaders are […]\n\nBerlin’s March 26th Climate Referendum… Berlin Leaders Could Have Immediate Dictatorial Powers Share this… Facebook TwitterThe road to tyranny begins in Berlin as climate gets framed as a state of emergency A new, radical climate amendment that will be voted on on March 26th in a referendum that could change Berlin’s climate targets to enforceable obligations, thus clearing the way for radical CO2 reduction measures by an […]\n\nShare this… Facebook TwitterStudies, trials by Pfizer Biontech were “seriously flawed” and fraught with “many irregularities” German journalist finds. It’s all beginning to dawn on the media… Emergency approval based on sloppy and deceptive trials and studies? At Germany’s flagship daily Die Welt, journalist Elke Bodderas recently penned an investigative article: The Many Irregularities In […]\n\nMy Household Electricity And Gas Prices Rise 87% And 178% Respectively! Share this… Facebook TwitterGreen energies making life in Germany unaffordable…we’ll have no heat and lights and be happy We’ve all heard about the excruciatingly high energy prices Germans are forced to pay in the wake of the Energiewende (transition to green energies). Yet, due to the fact that my own household had made a contract […]\n\nCovered Up Tragedy: Doctors, Officials Turn Backs On Tens Of Thousands Of Seriously Vaxxed Injured Share this… Facebook TwitterEurope’s ARTE presents an English language documentary on those seriously injured by the COVID vaccine in Germany. Featured are 2 young adults, Pascal (35) and Tamara (28), who were led to believe by government officials and health institutes that the vaccine was safe, effective and free of side effects. These two young, […]", "opengraph": {}, "tags": ["Misc."], "tweets": [], "movies": [], "links": ["https://notrickszone.com/2023/04/22/loony-science-german-mainstream-media-blame-riots-at-berlin-public-pools-on-climate-change/", "https://notrickszone.com/2023/04/16/review-of-koonins-unsettled-government-scientific-institutions-as-instruments-of-hostile-forces/", "https://notrickszone.com/2023/04/16/review-of-koonins-unsettled-government-scientific-institutions-as-instruments-of-hostile-forces/", "https://notrickszone.com/2023/04/15/tropical-paradise-islands-are-not-sinking-and-shrinking-most-are-in-fact-growing/", "https://notrickszone.com/2023/04/15/tropical-paradise-islands-are-not-sinking-and-shrinking-most-are-in-fact-growing/", "https://notrickszone.com/2023/04/12/expert-warns-cars-soon-unaffordable-to-50-of-germans-huge-social-conflict-idiotic-singular-policy/", "https://notrickszone.com/2023/04/12/expert-warns-cars-soon-unaffordable-to-50-of-germans-huge-social-conflict-idiotic-singular-policy/", "https://notrickszone.com/2023/04/11/germanys-renewable-heating-plan-to-cost-many-times-more-than-expected-776-billion-euros/", "https://notrickszone.com/2023/04/11/germanys-renewable-heating-plan-to-cost-many-times-more-than-expected-776-billion-euros/", "https://notrickszone.com/2023/03/24/green-aviation-remains-pie-in-the-sky-illusion-enormous-development-challenges/", "https://notrickszone.com/2023/03/22/deforesting-to-save-the-planet-europes-forests-shrinking-as-wood-used-for-green-energy/", "https://notrickszone.com/2023/03/22/deforesting-to-save-the-planet-europes-forests-shrinking-as-wood-used-for-green-energy/", "https://notrickszone.com/2023/03/14/surprise-coal-became-most-important-energy-source-for-electricity-in-germany-in-2022/", "https://notrickszone.com/2023/03/12/berlins-march-26th-climate-referendum-berlin-leaders-could-have-immediate-dictatorial-powers/", "https://notrickszone.com/2023/02/25/german-mainstream-media-serious-flaws-in-pfizer-biontech-vaccine-study-many-irregularities/", "https://notrickszone.com/2023/02/25/german-mainstream-media-serious-flaws-in-pfizer-biontech-vaccine-study-many-irregularities/", "https://notrickszone.com/2023/02/19/my-household-electricity-and-gas-prices-rise-87-and-178-respectively-here-in-germany/", "https://notrickszone.com/2023/02/19/my-household-electricity-and-gas-prices-rise-87-and-178-respectively-here-in-germany/", "https://notrickszone.com/2023/02/08/covered-up-tragedy-doctors-officials-turn-backs-on-tens-of-thousands-of-seriously-vaxxed-injured/", "https://notrickszone.com/2023/02/08/covered-up-tragedy-doctors-officials-turn-backs-on-tens-of-thousands-of-seriously-vaxxed-injured/", "https://notrickszone.com/category/allgemein/page/2/"], "authors": [], "publish_date": null}