{"result_id": "226012", "URL": "https://notrickszone.com/2022/12/12/breaking-data-of-72-million-insured-shows-massive-sudden-unexpected-deaths-exploded-in-germany-since-2021/", "timestamp": "2023-04-25 16:37:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/12/12/breaking-data-of-72-million-insured-shows-massive-sudden-unexpected-deaths-exploded-in-germany-since-2021/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "BREAKING: Data of 72 Million Insured Shows “Sudden, Unexpected Deaths Exploded” in Germany Since 2021!", "cleaned_text": "“FRIGHTENING FINDINGS” stun… “immediately after vaccination start on December 27, 2020, sudden and unexpected deaths exploded in Germany.”\n\nThis is shown by just released data of the 72 million insured by Association of Statutory Health Insurance Physicians (KBV):\n\nSudden and unexpected deaths in per quarter since 2016. Chart: Association of Statutory Health Insurance Physicians (KBV),\n\nThe number has more than doubled since the vaccine was introduced at the end of 2020, jumping from about 6000 per quarter to 14,000 currently. The difference, 8000, means more than 80 people each and every day are dying suddenly and mysteriously.\n\nThe German analysis since the start of Corona vaccination show the population has seen drastic changes in disease patterns and deaths. This is the result of data from the Association of Statutory Health Insurance Physicians (KBV), which Martin Sichert was able to evaluate exclusively together with data expert Tom Lause, and made public at a press conference earlier today.\n\n“Patient data of the Association of Statutory Health Insurance Physicians (KBV) on side effects of the Corona vaccinations provide frightening findings,” tweets Prof. Stefan Homburg. “With the start of Corona mass vaccinations, the number of those who died ‘suddenly and unexpectedly’ jumped more than fourfold compared to previous years. In each quarter, beginning with the first quarter of 2021, more sudden and unexpected deaths were recorded by panel physicians than in any total year from 2016 to 2020.”\n\nThe task and responsibility of monitoring vaccine safety falls in the hands of Germany’s Paul Ehrlich Institute (PEI), which appears to have grossly neglected analyzing the KBV data – a duty it is obligated to do in the interest of public safety.\n\nThe German government in 2020 indeed standardized the use of the insurance data to protect against immunization damage, but the current government and the PEI have stunningly ignored the law.\n\nGerman parliamentarian Martin Sichert and data analyst Tom Lausen have since forced forced the release of the data and the shocking results.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2022/12/KBV.png", "https://www.youtube.com/watch?v=qfB6ZFUgIEk", "https://twitter.com/SHomburg/status/1602178795074883584"], "authors": [], "publish_date": null}