{"result_id": "226033", "URL": "https://notrickszone.com/2021/11/17/doomsday-vaccine-german-physician-corona-vaccines-a-programmed-self-destruction-of-the-body/", "timestamp": "2023-04-25 16:37:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2021/11/17/doomsday-vaccine-german-physician-corona-vaccines-a-programmed-self-destruction-of-the-body/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Doomsday Vaccine? German Physician: “Corona ‘Vaccines’: A Programmed Self-Destruction Of The Body”", "cleaned_text": "German doctor warns Corona vaccines are toxic…each booster become increasingly dangerous…tantamount to self-destruction\n\nWhen you ask COVID vaccine proponents how these mRNA type vaccines work, most either don’t know, or give you the wrong answer. Very few really understand how the spike protein interacts with the immunes system and thus accept the vaccine based on faith.\n\nGerman site “Lawyers for Fundamental Rights” has a post by Dr. Christian Fiala, a general practitioner, specialist in gynecology and obstetrics, with training in tropical medicine, presents very clearly how the mRNA type “vaccine” works and its very real risk.\n\n ==================================\n\nFirst our immune system is highly complex and it recognizes a pathogen or foreign cell on the basis of the cell surface and destroys the cell that carries these antigens. This principle is used in vaccinations. For this purpose, a pathogen is usually or killed so that it can no longer cause an infection.\n\nAn essential feature of the immune system is the strict differentiation between one’s own cells and foreign cells. Only in this way is a healthy life possible at all. It is precisely this fundamental distinction and basis of life that is being challenged with what is currently known as the\n\n jab, and being propagated as a corona “vaccination”. The much-cited spike proteins are a recognition feature of the Corona virus, an antigen.\n\nWhen the Corona virus enters the body, the immune system recognizes the invader on the basis of the spike protein antigen and destroys the virus or the cells that have already been infected by the virus.\n\nWith the mRNA corona “vaccination”, body cells are for the first time in history deliberately and genetically programmed by means of the mRNA to produce the spike protein as a (foreign) antigen on the cell surface, although they are completely healthy and not infected with the virus.\n\nThe mechanism of action of the corona “vaccination” is to falsely mark healthy cells as foreign.\n\nAs a consequence, the immune system reacts immediately; it recognizes the antigen as foreign, forms antibodies against it and destroys the spike protein by destroying the cell that carries this spike protein. [1,2]\n\nThis means that the corona “vaccination” fools our immune system and tricks it into attacking and destroying our own healthy cells. In the military it is this is called ‘friendly fire’ when soldiers attack their own troops. This represents a fundamental danger not only for our health but also to our survival. We know this situation with the rarely occurring autoimmune diseases. These are usually severe and can even be fatal.\n\nTo better assess the danger of the Corona “vaccination”, it is important to know how much mRNA is administered with one dose of the vaccine, i.e. how many body cells are stimulated to produce the spike protein and thus released to be destroyed by the\n\n immune system. Unfortunately, this important information is also not mentioned in the approval studies. There is only a scientific estimate of the number of particles in which the mRNA is transported by the so-called lipid nanoparticles: about 2 trillion particles.\n\nNot every particle reaches a healthy cell and some cells in the body are affected by more than one particle. Moreover, not all particles may be fully functional. Nevertheless, the number of particles is extremely relevant when one considers that the human body consists of approximately 37 trillion cells.\n\nWhich organs does the Corona “vaccination” damage?\n\nThe corona “vaccination” is programmed in such a way that the immune system destroys the body’s own cells that have produced the spike protein on its surface. Could this happen on vital organs?\n\nThe answer to this question can be found, among others, in animal experiments by the vaccine manufacturer BionTech/Pfizer. The spike protein blueprint is found in a gene segment, the so-called mRNA, and is embedded in very small spheres of fat, the so-called lipid nanoparticles. After 1 hour, half of them were already distributed throughout the body. The lipid nano-particles were detected in all organs in the above-mentioned animal experiment, especially in the liver.\n\nThey were also detected in the brain, which proves they were able to cross the blood-brain barrier. They were also detected in the ovaries and testes. This means the body’s cells form the spike protein in the respective organs, which probably explains why the very numerous side effects and vaccine damage are also found randomly distributed in many organs. [6,7,8]\n\nSince the lipid nanoparticles are distributed in the blood, especially the so-called endothelial cells get affected.[9] This explains the numerous blood clots (thromboses or embolisms) observed as a result of the Corona “vaccination”. These also occur in the brain, among other places, and lead to partially irreversible damage. This is particularly worrying because it shows that even those organs that are separated from the immune system by a special barrier are now vulnerable.\n\nBooster “vaccination” – enough is not enough\n\nThe Corona “vaccination” is designed to be given at short intervals. Thus the vaccination expires after 6 or 9 months and the vaccinated persons will then be considered unvaccinated.[10] Many governments have already ordered tens of millions of doses to be given in the coming years. In Israel, a large part of the population has already been vaccinated for the 3rd time.[13]\n\nThe key question becomes: what effect does a repeated injection have on the body?\n\nOur immune system is capable of learning. When a pathogen enters the body for the first time, it is recognized as foreign, but it takes a few days for the immune system to kick in. During this time, the pathogen has the upper hand for a short time. Only after a few days is the immune system strong enough to destroy the pathogen and we become healthy.\n\nFortunately, the second time, the immune system remembers the “appearance” of the pathogen and it is activated much faster and\n\n much more powerfully. This strong defense protects us and we do not fall ill again; we are immune.\n\nThis vital mechanism also takes place with every further corona “vaccination”, but the massive reaction of the immune system with each further injection is not directed against a pathogen but against our own healthy body cells that have once again been marked with the spike protein. Viewed as a pathogen, this otherwise healthy cell is targeted to be destroyed. The effectiveness and ferocity of this destruction of healthy cells is increased with each injection. This means that the healthy “spiked cells” in the body are destroyed even more efficiently than in the first injection.\n\nThus, this memory capacity of the immune system becomes a dangerous weapon against ourselves.\n\nInstead of making foreign pathogens harmless, the immune system now destroys the body’s own cells which were instructed to produce the spike protein. Every further injection of a Corona “vaccine” consequently poses a great risk. This corresponds to the observation that more and stronger vaccination complications occur with the second vaccination.\n\nThe same applies to people who have had a Corona infection in the past, have recovered and still get a Corona “vaccination”. [14,15,16,17]\n\nFortunately people who have already been vaccinated can opt out of the vaccination cycle at any time, and are thus very likely to avoid further risks to their health.\n\nWith the mRNA Corona “vaccination”, an unimaginably large number of healthy endogenous cells are marked as foreign with the spike protein and thus given the green light for destruction by the body’s immune system. the immune system has been tricked into destroying billions of healthy cells.\n\nThe processes described are basic medical knowledge and are well known. It is therefore all the more worrying that these important aspects are practically absent from the scientific and public discourse. Further information on Corona “vaccination” is summarized in the following article: 10 reasons against vaccination:\n\n www.initiative-corona.info/fileadmin/dokumente/10_Gruende_gegen_Impfung.pdf", "opengraph": {}, "tags": ["Misc."], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2021/11/Coronas-virus-CDC.png", "https://www.afa-zone.at/allgemein/corona-impfung-die-programmierte-selbst-zerstoerung-des-koerpers/", "https://www.afa-zone.at/allgemein/corona-impfung-die-programmierte-selbst-zerstoerung-des-koerpers/", "https://www.initiative-corona.info/fileadmin/dokumente/10_Gruende_gegen_Impfung.pdf", "https://www.afa-zone.at/allgemein/corona-impfung-die-programmierte-selbst-zerstoerung-des-koerpers/"], "authors": [], "publish_date": null}