{"result_id": "226002", "URL": "https://notrickszone.com/2021/09/03/bombshell-study-vaccine-protection-against-covid-infection-and-viral-load-vanishes-within-6-months/", "timestamp": "2023-04-25 16:37:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2021/09/03/bombshell-study-vaccine-protection-against-covid-infection-and-viral-load-vanishes-within-6-months/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Bombshell Study: Vaccine Protection Against COVID Infection And Viral Load ‘Vanishes’ Within 6 Months", "cleaned_text": "Reports of plummeting vaccine effectiveness against current COVID-19 variants are proliferating. A new study assesses the viral load and risk of infection with COVID-19 is the same for a fully vaccinated person as it is for an unvaccinated person within just 180 days after the second vaccine dose. In the study, 84% of those testing positive in an Israeli hospital system were fully vaccinated.\n\nThe effectiveness of the 2-dose vaccines in reducing infectivity and viral loads was assessed from the 28th of June to 24th of August, 2021, by a team of scientists (Levine-Teifenbrun et al., 2021) using a sample of nearly 12,000 infected patients of Maccabi Healthcare Services in Israel.\n\nAbout 84% (9,734 of 11,644) of those who tested positive during this period were fully (2-dose) vaccinated. Another 245 were infected with COVID-19 (“breakthrough infections,” or BTI) soon after obtaining the third “booster” shot – which only became available in the last month of the observation period.\n\nThe scientists report vaccine efficacy in preventing infection and severe symptoms precipitously declines after the first 2 months, and then it essentially “vanishes” within 6 months after the second shot. So, after just 180 days, a fully vaccinated person is no more protected against COVID than an unvaccinated person.\n\nFurthermore, the researchers reported there was “no difference in Ct [cycle threshold, or viral load] between vaccinated and unvaccinated infected with Delta,” the most common COVID-19 variant during the June to August period.\n\n57.3% of California health workers infected with COVID-19 since March were fully vaccinated\n\nIsrael’s vaccine rollout occurred about 1 or 2 months ahead of the vaccination schedule in the United States. Consequently, it wasn’t until July – about 4 months after the 2nd dose – that the vaccines’ effectiveness for the ~80% vaccinated University of California San Diego Health (UCSDH) workers began to rapidly disappear per a new study published in the New England Journal of Medicine.\n\nAfter the percentage of new cases in fully vaccinated workers averaged between 19 and 33% from March to June, this percentage exploded to 75% in the month of July – right about the time vaccine effectiveness is documented to all but “vanish”.\n\nWith Delta, infectiveness, viral load, transmission is no different for vaccinated vs. unvaccinated\n\nMany have claimed that the vaccines offer lower viral-load protection from COVID-19 and its variants. But a new study (Servellita et al., 2021) reports the fully vaccinated (a) “were more likely than unvaccinated persons to be infected by variants,” (b) “symptomatic vaccine breakthrough infections had similar viral loads to unvaccinated infections,” and (c) the transmission of COVID-19 is as efficient for vaccinated infections as it is for the unvaccinated.\n\nWhat is going on in Vietnam? Australia?\n\nSomething curious is occurring in countries that experienced very low COVID-19 confirmed cases and deaths throughout the pre-vaccination stages of the pandemic.\n\nVietnam reported under 1,500 total cases and just 35 total deaths from March of 2020 to April of 2021. That’s a rate of about 0.09 COVID-19-related deaths per day.\n\nThen a mass vaccination program began in Vietnam in late April (2021). By June, new cases began to percolate. By late August, Vietnam was enduring ~12,000 new cases per day and averaging 409 deaths per day.\n\nAustralia was able to escape most of the ravages of COVID-19 for the first year of the pandemic. Then, as in Vietnam, a mass vaccination schedule was implemented and Australia is now experiencing its highest number of new cases per day than at any time during the pandemic.\n\nThis wasn’t supposed to happen with vaccine rollouts. So what is going on here?", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.medrxiv.org/content/10.1101/2021.08.29.21262798v1.full.pdf", "https://www.medrxiv.org/content/10.1101/2021.08.29.21262798v1.full.pdf", "https://www.nejm.org/action/downloadFigures?doi=10.1056%2FNEJMc2112981&id=f1", "https://www.nejm.org/action/downloadFigures?doi=10.1056%2FNEJMc2112981&id=f1", "https://www.medrxiv.org/content/10.1101/2021.08.19.21262139v1", "https://www.medrxiv.org/content/10.1101/2021.08.19.21262139v1", "https://ourworldindata.org/covid-vaccinations?country=VNM", "https://www.worldometers.info/coronavirus/country/viet-nam/#graph-cases-daily", "https://www.worldometers.info/coronavirus/country/australia/"], "authors": [], "publish_date": null}