{"result_id": "226025", "URL": "https://notrickszone.com/2022/11/02/study-incidence-of-acute-cardiac-involvement-after-mrna-booster-800-times-higher/", "timestamp": "2023-04-25 16:37:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/11/02/study-incidence-of-acute-cardiac-involvement-after-mrna-booster-800-times-higher/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Study: Incidence Of Acute Cardiac Involvement After mRNA Booster “800 Times Higher”", "cleaned_text": "That’s the headline of an article by at transparenztest.de.\n\nThe finding is based on results by a Swiss observational study by Prof. Christian Eugen Mueller published here.\n\n1 of 35 individuals showed laboratory values indicative of acute cardiac injury after booster mRNA vaccination.\n\nResearchers led by Prof. Christian Eugen Müller of the University Hospital Basel investigated the extent to which cardiac involvement occurs after mRNA booster vaccinations. Heart damage from the mRNA booster shots appears to be a much higher risk than previously thought, the recent findings show.\n\n777 employees of Basel University Hospital, median age 37 years and 69% female, had received booster vaccination. After 3 days, their troponin levels (hs-cTnT) were measured. Troponin is a laboratory value that indicates acute damage to the heart.\n\n“40 subjects showed elevated troponin levels. In 18 of these cases, other causes were present. The remaining 22 cases corresponded to an incidence of 2.8%. The incidence in women was 3.7% and in men only 0.8%,” reports transparenztest.de. “Most of the subjects had no cardiovascular history. Three days after vaccination, their troponin levels (hs-cTnT) were measured to detect cardiac damage. If levels were elevated, another hs-cTnT measurement and imaging examination followed the next day.”\n\nThe surprising results were presented at the 2022 ESC Congress.\n\nIt had been previously suggested that such complications were very rare, with an incidence in the range of only 0.0035%. But the new study results suggest it’s far worse.\n\nAccording to Prof. Christian Müller: “The study confirms the hypothesis that the incidence of acute cardiac involvement is higher than thought. At 2.8% it was 800 times higher than in passive observational studies. But now that we need annual booster vaccinations, there could be a lot of vaccine-related cardiac involvement.”\n\nProf. Christian Müller adds. “From day 3 to day 4, we observed a clear drop in troponin in almost all participants, indicating that this was an acute problem.”\n\n“The incidence of 2.8% of acute cardiac involvement is alarmingly high,” transparenztest.de warns. “Thus, 1 out of 35 boostered persons shows such values shortly after the mRNA vaccination. Converted, one would have e.g. with 350,000 booster vaccinations consequently 10,000 persons or with 3.5 million 100,000 persons, who show such laboratory values of an acute heart damage.”", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.transparenztest.de/post/alarmierend-1-von-35-geboosterten-hat-laborwerte-die-auf-akute-herzschaedigung-hinweisen", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9484848/", "https://www.transparenztest.de/post/alarmierend-1-von-35-geboosterten-hat-laborwerte-die-auf-akute-herzschaedigung-hinweisen", "https://www.transparenztest.de/post/alarmierend-1-von-35-geboosterten-hat-laborwerte-die-auf-akute-herzschaedigung-hinweisen", "https://www.youtube.com/watch?v=bGZJfVR9-wo"], "authors": [], "publish_date": null}