{"result_id": "226037", "URL": "https://notrickszone.com/2022/01/17/scotlands-fully-vaccinated-now-twice-as-likely-to-be-infected-and-50-more-likely-to-die/comment-page-1/", "timestamp": "2023-04-25 16:37:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/01/17/scotlands-fully-vaccinated-now-twice-as-likely-to-be-infected-and-50-more-likely-to-die/comment-page-1/#comments", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "Scotland’s Fully Vaccinated Now Twice As Likely To Be Infected And 50% More Likely To Die", "cleaned_text": "Multiple studies affirm negative vaccine effectiveness against the COVID-19 Omicron variant. Now there is evidence full vaccination is negatively affecting death rates.\n\nIn February, 2021, the Big Pharma-endorsed claim that the new mRNA COVID-19 vaccines are 95% effective against infection with COVID-19 was wholly adopted by governments across the world.\n\nWhat did the falsely advertised (with no liability) claim of 95% vaccine effectiveness actually mean? Per The Lancet, it meant out of 100,000 vaccinated individuals, there would be just 50 confirmed cases of COVID-19.\n\nFast forward 11 months. Public Health Scotland now reports that instead of the advertised 50 cases it is now (25 December to 7 January) ~2,700 cases per 100,000 fully vaccinated (2 doses) individuals. This vaccinated rate is more than 2 times the rate for the unvaccinated, ~1,100 per 100,000, reported during this same 2-week period.\n\nAge-standardized hospitalization and death rates are now (25 December to 7 January) more than 50% higher in the fully vaccinated than in the unvaccinated.\n\nDuring the first week in January, there were 59 hospitalizations per 100,000 in the unvaccinated versus 130 hospitalizations per 100,000 in the fully vaccinated.\n\nFrom 25 December to 7 January, there were about 3.5 deaths per 100,000 in the unvaccinated versus nearly 7 deaths per 100,000 in the fully vaccinated.\n\nNone of this should be surprising. The vaccines’ negative effectiveness (i.e., the 2-dose vaccinated are more likely to be infected with COVID-19) against Omicron has now been affirmed in studies in Ontario, California, Denmark, the UK (Buchan et al., 2022, Tseng et al., 2022, Hansen et al., 2022, UK Health Security Agency).\n\nIn Ontario, “…receipt of 2 doses of COVID-19 vaccines was not protective against Omicron infection at any point in time, and vaccine effectiveness was -38% 120-179 days and -42% 180-239 days after the second dose.”\n\nIn California, vaccine effectiveness against Omicron is “0.0% after 180 days.”\n\nWithin 91 to 150 days after receiving the Pfizer and Moderna mRNA shots the vaccine effectiveness against symptomatic infection with the Omicron variant is decisively negative, -76.5% and -39.3%, respectively, in Denmark.\n\nThe UK government COVID data compiled between 27 November and 17 December show a similarly disappointing pattern in an analysis of 68,489 Omicron cases.\n\nVaccine (Pfizer, Moderna, AstraZeneca) effectiveness against Omicron hovers around 40-60% during 5-9 weeks after the second dose, but then effectiveness rapidly declines to 0% and below (-5% to -15%) by weeks 20-24.", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://www.thelancet.com/journals/laninf/article/PIIS1473-3099%2821%2900075-X/fulltext", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099%2821%2900075-X/fulltext", "https://publichealthscotland.scot/media/11089/22-01-12-covid19-winter_publication_report.pdf", "https://publichealthscotland.scot/media/11089/22-01-12-covid19-winter_publication_report.pdf", "https://publichealthscotland.scot/media/11089/22-01-12-covid19-winter_publication_report.pdf", "https://publichealthscotland.scot/media/11089/22-01-12-covid19-winter_publication_report.pdf", "https://www.medrxiv.org/content/10.1101/2021.12.30.21268565v1.full.pdf", "https://www.medrxiv.org/content/10.1101/2022.01.07.22268919v1", "https://www.medrxiv.org/content/10.1101/2021.12.20.21267966v3", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1043608/Vaccine_surveillance_report_-_week_51.pdf", "https://www.medrxiv.org/content/10.1101/2021.12.30.21268565v1.full.pdf", "https://www.medrxiv.org/content/10.1101/2022.01.07.22268919v1", "https://www.medrxiv.org/content/10.1101/2021.12.20.21267966v3", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1043608/Vaccine_surveillance_report_-_week_51.pdf"], "authors": [], "publish_date": null}