{"result_id": "226047", "URL": "https://notrickszone.com/2022/11/16/high-profile-german-physician-covid-vaccines-dangerous-genetic-modification-of-human-beings/", "timestamp": "2023-04-25 16:38:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2022/11/16/high-profile-german-physician-covid-vaccines-dangerous-genetic-modification-of-human-beings/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "High Profile German Physician: COVID Vaccines Dangerous “Genetic Modification Of Human Beings”", "cleaned_text": "COVID vaccines “are killing people, they are injuring them. They’re causing huge long-term damage that is irreparable.” …”There’s no therapy, and every shot makes it worse!”\n\nIn a new interview by German Report24, Dr. Wolfgang Wodarg, one of the very first critics of the COVID pandemic lockdowns and vaccines, commented on why so many doctors simply played along: de facto pharmaceutical and media corruption.\n\nDr. Wolfgang Wodarg noted that vaccinations used to be a burden on the state and no money was made from them, but now they have become highly lucrative for the pharmaceutical companies, some of them having had to pay billions in fines for harming people in the past.\n\n“We are rightly suspicious of the pharmaceutical supply,” Wodarg said.\n\nDr. Wodarg, a physician, also spent years as head of a public health department, a member of the German Bundestag and chairman of the Health Committee for Germany in the Council of Europe became very familiar with the art of lobbying. He knew something was very wrong already at the beginning of the pandemic, noting that the Corona pandemic worked so well because people had “learned from the previous fake pandemics and developed completely new, effective strategies”.\n\nWodarg blasts the media and journalists for eliminating criticism and playing on people’s fear. “This was massively stoked, especially with adjusted and doctored statistics.”\n\nThe retired physician also warns of a massive invasion of personal privacy by the state in the form of vaccine passports and testing, all made possible by the fear-laden Corona crisis.\n\nDr. Wodarg says the Corona vaccination is not a classic vaccine, but rather describes it as “a genetic modification of human beings, which has no benefit, and instead causes us massive harm and which, in the worst case, is life-threatening.” He adds that anyone who continues to promote the pandemic – despite the obvious facts – is committing a criminal offense.”\n\n“What we have already known for a long time, since clinical studies were planned, is that the stuff is dangerous, that it provides no benefit, that it is not necessary, says Wodarg on the COVOD vaccines. “They are killing people, they are injuring them. They’re causing huge long-term damage that is irreparable. There’s no therapy, and every shot makes it worse!”\n\nWodarg says that there’s plenty of information available to doctors and that there’s no longer any excuse for doctors not to know what’s really going on. He calls the continued, willful repeated vaccination: “malicious, and it needs to be punished.”", "opengraph": {}, "tags": ["Pandemic"], "tweets": [], "movies": [], "links": ["https://notrickszone.com/wp-content/uploads/2022/11/Wodarg_Report-24.png", "https://report24.news/dr-wolfgang-wodarg-wer-jetzt-noch-weitermachen-will-muss-bestraft-werden/", "https://report24.news/dr-wolfgang-wodarg-wer-jetzt-noch-weitermachen-will-muss-bestraft-werden/"], "authors": [], "publish_date": null}