{"result_id": "226043", "URL": "https://notrickszone.com/2021/09/14/33-holocaust-survivors-decedents-defend-covid-vaccine-critic-prof-bhakdi-against-anti-semitism-smears/", "timestamp": "2023-04-25 16:37:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://notrickszone.com/wp-content/uploads/2020/09/cropped-Norway_2020_08-32x32.png", "canonical": "https://notrickszone.com/2021/09/14/33-holocaust-survivors-decedents-defend-covid-vaccine-critic-prof-bhakdi-against-anti-semitism-smears/", "encoding": "UTF-8"}, "image": null, "domain": "notrickszone.com", "title": "33 Holocaust Survivors/Descendants Defend COVID Vaccine Critic Prof. Bhakdi Against Anti-Semitism Smears", "cleaned_text": "Like Wikipedia, German flagship ARD public television has maliciously accused outspoken microbiologist Prof. Sucharit Bhakdi of “being an anti-Semite” in a smear campaign against the renowned researcher and COVID-19 vaccine critic.\n\nSmear campaign by Wikipedia, German ARD public television gets a harsh reaction from 33 Holocaust survivors who rally to defend “good man”.\n\nIn a response, 33 Holocaust Survivors/Descendants have published an open letter in German to protest the vicious tactics. What follows is the open letter translated in the English (bold headings added by NTZ).\n\nOPEN LETTER FROM HOLOCAUST SURVIVORS AND DESCENDANTS TO THE GERMAN MEDIA\n\nAfter the shocking news reached us that the state-funded media have accused Professor Sucharit Bhakdi of being an anti-Semite, we have decided to write this letter. We stand behind Professor Bhakdi because he speaks the truth.\n\nYou, the media, have lied to the people for years by preaching false lessons from the Holocaust. That is not the lesson of the Holocaust, that Jews must not be killed or questioned. No human being should be killed! The lesson from the Holocaust is that you must not stand by and participate when a minority is persecuted. You have instrumentalized the Holocaust to achieve the opposite: to deprive people of the will to resist injustice. And in this godless way you have prepared a new Holocaust and are in the process of implementing it.\n\nAgain in Germany: campaign to “deny, injure and humiliate”\n\nWe expressly warn that another holocaust is unfolding, only bigger and more more sophisticated. The brutality with which you fight the opposition, both verbally and physically, deny, injure and humiliate, and serves to suppress the truth. Destroyed lives, apartment searches, occupational bans, forced psychiatric detentions, and worse – this could be the story of our lives, but this is the reality we observe in Germany.\n\n“Dr. Bhakdi has done nothing wrong. He merely implied that the phrase “Vaccination Macht Frei” bears an uncanny resemblance to the slogan on the gate of Auschwitz, which is quite correct. Please stop attacking this good man, who is certainly not an anti-Semite.”\n\n“I’m alive because my grandmother was disobedient when it was ordered that Jews should gather, like now to the vaccination centers by means of coercion and fear. I’m alive because courageous people were disobedient when they were forbidden to hide Jews Just as now Sucharit Bhakdi and other decent people are disobeying to save lives. To punish them for this with the term “anti-Semite” is an outrageous hypocrisy.”\n\n“My grandparents and my mother were in Bergen-Belsen because of their Jewish origin. I am not religious, but this heritage has accompanied me since my youth and I react very sensitively to anti-Semitism in any form. Whoever calls Prof. Bhakdi an anti-Semite because of an unfortunate formulation has never had anything to do with anti-Semites. It is probably done with the aim of discrediting this humane and emotionally committed scientist on a personal level. I would like to raise my voice against that.”\n\n“Immediately after the report by Mr. Wulf Rohwedder (ARD), in which Prof. Bhakdi was stigmatized as an anti-Semite, we wrote to several broadcasters. We set the record straight that the constant misuse of the term “anti-Semite” in no way serves the safety of Jews. The opposite is the case. No response came from any of those responsible, nor was there a public apology. Now those who know best how it feels to be stigmatized and persecuted are speaking out.”", "opengraph": {}, "tags": ["Activism", "Pandemic"], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Sucharit_Bhakdi", "https://notrickszone.com/wp-content/uploads/2021/09/Bhakdi_Wiki-slander.png", "https://www.mwgfd.de/offener-brief-holocaustueberlebender-und-nachfahren-an-die-medien/", "https://notrickszone.com/wp-content/uploads/2021/09/Holocaust-survivors-Bhakdi.png"], "authors": [], "publish_date": null}