{"result_id": "227044", "URL": "https://www.nowtheendbegins.com/mrna-covid-19-whistleblowers-reveal-vaccine-trials-were-compromised-fda-failed-to-act/", "timestamp": "2023-04-25 16:40:54 CEST+0200", "meta": {"description": "Whistleblowers for mRNA COVID-19 vaccine reveal stunning information on compromised FDA safety trials says British Medical Journal editor.", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/mrna-covid-19-whistleblowers-reveal-vaccine-trials-were-compromised-fda-failed-to-act/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "Evidence Now Emerging That Clinical Trials For mRNA Vaccines Were Compromised From The Beginning As Editor From British Medical Journal Sounds Alarm", "cleaned_text": "The FDA only inspected 9 of the trial’s 150-plus sites before approving the vaccine. Just 9 sites. What about Moderna? FDA had over a year and inspected just one – ONE – of the trial’s 99 sites. How can FDA feel confident in the Moderna data based on a 1% sample?\n\nNot to say we told you so, but we indeed told you so last year that, after all the smoke and mirrors of the man-made, gain of function pandemic started to settle down, the truth would begin to come out about what a sham the whole process really was. Now whistleblowers are beginning to make their voices known, and what they are telling us is downright terrifying if you were one of those people who agreed to receive the government injections.\n\n“And ye shall know the truth, and the truth shall make you free.” John 8:32 (KJB)\n\nIn 2020, everything was rushed and put through without much attention to detail, even the name of Trump’s vaccine campaign was entitled ‘Operation Warp Speed’. But there are some things that should not be rushed, a fine souffle is something that cannot be rushed, an untried and untested gene editing cocktail is also something that shouldn’t be rushed into production. As it turns out, the Pfizer and Moderna trials were in fact shams, with the shoddy protocols covered up and hidden from view as we were frightened into submitting to them. So go ahead, Facebook, give me another suspension for telling the truth, I couldn’t care less, the truth has set me free. You should try it some time.\n\nEditor of the British Medical Journal tells the FDA about Serious Concerns over Pfizer Trial Data Integrity\n\nFROM NAKED EMPEROR’S NEWS: Dr Doshi is an associate professor of pharmaceutical health at the University of Maryland School of Pharmacy, as well as a senior editor at the British Medical Journal. “His research focuses on the drug approval process, how the risks and benefits of medical products are communicated, and improving the credibility and accuracy of evidence synthesis and biomedical publications.”\n\nIn the most recent Food and Drug Administration (FDA) Vaccines and Related Biological Products Advisory Committee meeting in the US (6 April 2022), Peter dialled in to the Open Public Hearing Session. This is where members of the public can present their own information to the FDA. The committee was meeting to discuss considerations for the use of COVID-19 vaccine boosters and the process for COVID-19 vaccine strain selection to address current and emerging variants.\n\nPeter told the FDA about Brook Jackson, a whistle-blower from Ventavia, which ran Pfizer’s vaccine trials. He discussed how unblinding of trial participants seems to have occurred and how this creates serious concerns about data integrity. Dr. Doshi also highlighted the lack of FDA inspection. A transcript of his comments is below.\n\nHi, I’m Peter Doshi, thanks for the opportunity to speak. Hopefully you can see my title slide with my financial disclosures. For identification purposes, I am on the faculty at the University of Maryland and an editor at The BMJ. I have no relevant conflicts of interest and my comments today are my own.\n\nLast November, The BMJ reported the disclosures of a whistle-blower named Brook Jackson, who worked for Ventavia, a contract research company that ran three of the clinical trial sites for Pfizer’s vaccine. Jackson alleged the company had falsified data, unblinded patients, employed inadequately trained vaccinators, and was slow to follow up on adverse events. She provided The BMJ with company emails, internal documents, text messages, photos and recordings of her conversations with company employees.\n\nAnd unblinding may have occurred on a far wider scale. Here you can see the document containing the instructions Ventavia staff were given to file each trial participant’s randomization and drug assignment confirmation sheet into each participant’s chart. This contained unblinded information.\n\nUnblinding, as I think everybody knows, creates serious concerns about data integrity. Once this massive error was discovered, Ventavia asked staff to go through each and every chart to take out the randomization and drug assignment confirmations. You can see here an email from Ventavia’s COO reacting after discovery of the problem: they had not even realized that the drug assignment confirmation contained unblinding information.\n\nIn the heat of a pandemic, it’s not hard to imagine that corners were cut and mistakes were made. Some mistakes are benign, but others carry serious consequences to data integrity. One hopes Ventavia is an extreme outlier, but we need more than just hope. We need evidence that the data were dealt with properly. We need regulatory oversight. But despite whistleblower Brook Jackson’s direct complaint to the FDA, FDA never inspected Ventavia. In fact, FDA only inspected 9 of the trial’s 150-plus sites before approving the vaccine. Just 9 sites. And Pfizer continues to use Ventavia for trials.\n\nData integrity requires adequate regulatory oversight. Trustworthy science requires data transparency. It’s been over a year, but anonymised participant level data remain inaccessible to doctors, researchers, and the public. The public paid for these products, and the public takes on the balance of benefits and harms post vaccination. The public has a right to data transparency, and FDA has an obligation to act. Thank you. READ MORE\n\nJoin the U.S. Food and Drug Administration for an upcoming meeting of its Vaccines and Related Biological Products Advisory Committee (VRBPAC) to discuss considerations for future COVID-19 vaccine booster doses and the process for selecting specific strains of the SARS-CoV-2 virus for COVID-19 vaccines to address current and emerging variants. The video for the meeting is below. Peter Doshi’s statement starts at 5:34:44 but all of the public presentations are interesting and these begin at around 5:15.\n\nPresident of Bayer Pharmaceuticals Says mRNA Is Gene Editing Technology\n\nPresident of Bayer’s Pharmaceuticals Sector and member of the board said in his speech: ‘Ultimately the mRNA vaccines are an example for that cell and gene therapy. I always like to say: If we had surveyed two years ago in the public: ‘would you be willing to take a gene or cell therapy and inject it into your body?’ we probably would have had a 95% refusal rate”\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last Days before the Rapture of the Church\n• HOW TO DONATE: Click here to view our WayGiver Funding page\n\nWhen you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. Even all the way to South Africa. We even restarted our weekly radio Bible study on Sunday nights again, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing.\n\nBut whatever you do, don’t do nothing. Time is short and we need your help right now. If every one of the 15,860+ people on our daily mailing list gave $4.50, we would reach our goal immediately. If every one of our 150,000+ followers on Facebook gave $1.00 each, we would reach 300% of our goal. The same goes for our 15,900 followers on Twitter. But sadly, many will not give, so we need the ones who can and who will give to be generous. As generous as possible.\n\n“Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV)\n• HOW TO DONATE: Click here to view our WayGiver Funding page", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2022/05/mrna-covid-19-vaccine-test-data-unblinded-pfizer-moderna-studies-compromised.jpg", "url": "https://www.nowtheendbegins.com/mrna-covid-19-whistleblowers-reveal-vaccine-trials-were-compromised-fda-failed-to-act/", "title": "Evidence Now Emerging That Clinical Trials For mRNA Vaccines Were Compromised From The Beginning As Editor From British Medical Journal Sounds Alarm", "description": "Whistleblowers for mRNA COVID-19 vaccine reveal stunning information on compromised FDA safety trials says British Medical Journal editor.", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2022-05-10T15:08:01+00:00", "article:modified_time": "2022-05-10T16:30:35+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["Government Injections", "Pfizer", "Moderna", "mRNA Vaccines"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/x8rq247E80I\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/x8rq247E80I"}, {"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/lGQ0YiLwysU\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/lGQ0YiLwysU"}], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fmrna-covid-19-whistleblowers-reveal-vaccine-trials-were-compromised-fda-failed-to-act%2F&linkname=Evidence%20Now%20Emerging%20That%20Clinical%20Trials%20For%20mRNA%20Vaccines%20Were%20Compromised%20From%20The%20Beginning%20As%20Editor%20From%20British%20Medical%20Journal%20Sounds%20Alarm", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fmrna-covid-19-whistleblowers-reveal-vaccine-trials-were-compromised-fda-failed-to-act%2F&linkname=Evidence%20Now%20Emerging%20That%20Clinical%20Trials%20For%20mRNA%20Vaccines%20Were%20Compromised%20From%20The%20Beginning%20As%20Editor%20From%20British%20Medical%20Journal%20Sounds%20Alarm", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fmrna-covid-19-whistleblowers-reveal-vaccine-trials-were-compromised-fda-failed-to-act%2F&linkname=Evidence%20Now%20Emerging%20That%20Clinical%20Trials%20For%20mRNA%20Vaccines%20Were%20Compromised%20From%20The%20Beginning%20As%20Editor%20From%20British%20Medical%20Journal%20Sounds%20Alarm", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fmrna-covid-19-whistleblowers-reveal-vaccine-trials-were-compromised-fda-failed-to-act%2F&linkname=Evidence%20Now%20Emerging%20That%20Clinical%20Trials%20For%20mRNA%20Vaccines%20Were%20Compromised%20From%20The%20Beginning%20As%20Editor%20From%20British%20Medical%20Journal%20Sounds%20Alarm", "https://www.addtoany.com/share", "https://www.bmj.com/content/375/bmj.n2635", "https://www.iambrookjackson.com/", "https://www.ventaviaresearch.com/", "https://www.youtube.com/watch?v=RaLxhFiOBYk", "https://www.fda.gov/media/152252/download", "https://www.fda.gov/media/156343/download", "https://www.bmj.com/content/376/bmj.o102", "https://nakedemperor.substack.com/p/editor-of-the-british-medical-journal?s=r", "https://waygiver.com/campaigns/1486", "https://www.nowtheendbegins.com/nteb-gospel-tracts/", "https://www.nowtheendbegins.com/subscribe-to-nteb-daily-prophecy-updates/", "https://www.facebook.com/NowTheEndBegins/", "https://twitter.com/nowtheendbegins", "https://waygiver.com/campaigns/1486"], "authors": ["Geoffrey Grider"], "publish_date": "2022-05-10T15:08:01+00:00"}