{"result_id": "227008", "URL": "https://www.nowtheendbegins.com/scotland-announces-theyll-no-longer-give-vaccination-status-to-deaths-hospitalizations-because-it-gives-anti-vaxxers-too-much-information/", "timestamp": "2023-04-25 16:38:23 CEST+0200", "meta": {"description": "Scotland Stops Releasing Death and Hospitalization Figures by Vaccination Status, Says Truth Seeking Anti-Vaxxers Are 'Misusing Them'", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/scotland-announces-theyll-no-longer-give-vaccination-status-to-deaths-hospitalizations-because-it-gives-anti-vaxxers-too-much-information/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "Scotland Announces They'll No Longer Give Vaccination Status To Deaths And Hospitalizations Because It Gives Anti-Vaxxers Too Much Information", "cleaned_text": "Carnage is erupting on the streets of France tonight after French President Emmanuel Macron’s flagship pension reform passed a vital constitutional milestone despite months of disruptive strikes and protests.\n\nPeople have been writing and messaging me ever since the mass protests on the streets of Paris over the much-hated retirement age hike by Emmanuel Macron first caused outrage. Certainly this time, they said, Macron will be taken down. He can’t last this out, it’s just not possible. 3 million people protesting on the city streets, Macron is finished!!! And yet, not only is he not finished, he got the French Constitutional Council, their top court, to agree with him and just like that, Macron wins again. Oh, he just has that ‘special something’, lol.\n\n“And his power shall be mighty, but not by his own power: and he shall destroy wonderfully, and shall prosper, and practise, and shall destroy the mighty and the holy people.” Daniel 8:24 (KJB)\n\nFor 6 years now, we have told you that Emmanuel Macron looks like an excellent choice for the biblical man of sin, and during that entire time, he has not said or done anything to disappoint or prove otherwise. Remember when Macron was the first head of any nation to mandate the government shot for their citizens? Everyone said that that was the last straw. What happened? A whole bunch of other nations, including America, followed his lead.\n\nEmmanuel Macron hated bid to raise retirement age is approved by top constitutional court\n\nFROM THE DAILY MAIL UK: The legislation, which pushes the age at one can draw a full pension to 64 from 62, is deeply unpopular in France and has triggered huge disruption. After the decision was announced by the Constitutional Council on Friday, largescale protests began around the country and quickly turned violent – with 112 people arrested in Paris alone.\n\nCarnage is erupting on the streets of France tonight after French President Emmanuel Macron’s flagship pension reform passed a vital constitutional milestone despite months of disruptive strikes and protests.\n\nAfter the decision was announced by the Constitutional Council on Friday, largescale protests began around the country and quickly turned violent – with 112 people arrested in Paris alone. Protesters are marching on the centre of Paris, with 3,000 people already assembled outside the town hall by 5pm BST, according to French media.\n\nIn Paris, protesters have let off flares and set fire to bikes outside the town hall, triggering a significant response by police. Dustbins and other items have also been set on fire around the city. Some have erected barricades in the streets of the capital, using sheets of metal, bins, wood and fire. A march is approaching the Place de la Bastille, where the infamous Bastille prison once stood. Police have arrested some protesters, including around a dozen young people who were pictured being detained by officers with batons and tear gas.\n\nIn Nantes, bottles and other projectiles have been thrown at police by some protesters, causing the police to respond with water cannons. Protesters are attempting to disrupt major roads and tramways by creating lines of burning dustbins.\n\nShortly after 8pm BST, a Nantes police station was set aflame by protesters, with the entire entranceway alight, before a water cannon was used to extinguish the flames. Protesters are marching on the centre of Paris, with 3,000 people already assembled outside the town hall by 5pm BST, according to French media.\n\nMacron and his government hoped this outcome would discourage further trade union-led protests, which have at times turned violent – but this does not seem to be the case. Protests have broken out almost weekly since January as around two in three people are against the highly unpopular reform. Approval from the council will bring France closer into line with its EU neighbours.\n\nProtesters gathered outside Paris City Hall, holding banners reading ‘climate of anger’ and ‘no end to the strikes until the reform is pulled’ when the Constitutional Council’s verdict was announced. A heavy police presence is on scene in Lyon, with dozens of officers in riot gear battling to maintain control. READ MORE\n\nFrance’s Constitutional Council has ruled in favour of President Emmanuel Macron’s unpopular pension reform bill, which raises the legal age of retirement to 64 from 62. Twelve full days of protests have been held against the reforms since January.\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last Days before the Rapture of the Church\n• HOW TO DONATE: Click here to view our WayGiver Funding page\n\nPlease continue to pray for us, and for wisdom for me especially, as we continue taking steps to print the NTEB branded King James Bible for our free Bible and Bibles Behind Bars program. It is exciting and intimidating at the same time. If the Lord has prospered your financially, we ask you to donate to help us continue to send out free Bibles at this level, and even higher than we are at the moment. It takes a lot of prayer, and a lot of resources to do all this. Praise the Lord we are doing it, all of us together, labouring in the Lord’s harvest field. TO THE FIGHT!!!\n\nWhen you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. We have a Gospel Billboard program. We are now broadcasting Bible studies, Podcasts and a Sunday Service 5 times a week, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing.\n\nBut whatever you do, don’t do nothing. Time is short and we need your help right now. The Lord has given us an open door with a tremendous ‘course’ for us to fulfill that will create an excellent experience at the Judgement Seat of Christ. Please pray for our efforts, and if the Lord leads you to donate, be as generous as possible. The war is REAL, the battle HOT and the time is SHORT…TO THE FIGHT!!!\n\n“Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJB)", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2022/02/scotland-no-longer-providing-vaccination-status-for-deaths-hospitalizations-as-anti-vaxxers-are-getting-too-much-information.jpg", "url": "https://www.nowtheendbegins.com/scotland-announces-theyll-no-longer-give-vaccination-status-to-deaths-hospitalizations-because-it-gives-anti-vaxxers-too-much-information/", "title": "Scotland Announces They'll No Longer Give Vaccination Status To Deaths And Hospitalizations Because It Gives Anti-Vaxxers Too Much Information", "description": "Scotland Stops Releasing Death and Hospitalization Figures by Vaccination Status, Says Truth Seeking Anti-Vaxxers Are 'Misusing Them'", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2022-02-19T18:09:56+00:00", "article:modified_time": "2022-02-20T02:22:45+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["COVID", "Vaccinations", "Scotland", "Anti-Vaxxers", "Dr. Birx"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/TZh9dbyAd0Q\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/TZh9dbyAd0Q"}], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Femmanuel-macron-wins-as-top-constitutional-court-in-france-approves-retirement-age-bill%2F&linkname=Macron%20Wins%20Again%21%20Despite%20Millions%20Of%20French%20Protesting%20In%20The%20Streets%20Of%20Paris%2C%20Top%20French%20Court%20Passes%20Controversial%20Retirement%20Age%20Increase%20Bill", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Femmanuel-macron-wins-as-top-constitutional-court-in-france-approves-retirement-age-bill%2F&linkname=Macron%20Wins%20Again%21%20Despite%20Millions%20Of%20French%20Protesting%20In%20The%20Streets%20Of%20Paris%2C%20Top%20French%20Court%20Passes%20Controversial%20Retirement%20Age%20Increase%20Bill", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Femmanuel-macron-wins-as-top-constitutional-court-in-france-approves-retirement-age-bill%2F&linkname=Macron%20Wins%20Again%21%20Despite%20Millions%20Of%20French%20Protesting%20In%20The%20Streets%20Of%20Paris%2C%20Top%20French%20Court%20Passes%20Controversial%20Retirement%20Age%20Increase%20Bill", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Femmanuel-macron-wins-as-top-constitutional-court-in-france-approves-retirement-age-bill%2F&linkname=Macron%20Wins%20Again%21%20Despite%20Millions%20Of%20French%20Protesting%20In%20The%20Streets%20Of%20Paris%2C%20Top%20French%20Court%20Passes%20Controversial%20Retirement%20Age%20Increase%20Bill", "https://www.addtoany.com/share", "https://www.france24.com/en/live-news/20230414-%F0%9F%94%B4-france-s-constitutional-council-upholds-raising-of-legal-retirement-age-to-64", "https://www.nowtheendbegins.com/category/emmanuel-macron/", "https://www.nowtheendbegins.com/emmanuel-macron-jewish-assyrian-ancestry-pope-francis-revived-roman-empire-antichrist-666-judas/", "https://www.nowtheendbegins.com/man-of-sin-emmanuel-macron-mandatory-covid-vaccines-big-tech-google-facebook-whole-world-following-him/", "https://www.nowtheendbegins.com/product-category/nteb-christian-book-bundles/", "https://www.dailymail.co.uk/news/article-11973887/Macrons-bid-raise-retirement-age-approved-constitutional-court-despite-strikes-protests.html", "https://waygiver.com/campaigns/1486", "https://www.nowtheendbegins.com/category/free-bible-program/", "https://biblesbehindbars.com/", "https://www.nowtheendbegins.com/category/gospel-witness-billboard-program/", "https://biblesbehindbars.com/"], "authors": ["Geoffrey Grider"], "publish_date": "2022-02-19T18:09:56+00:00"}