{"result_id": "227006", "URL": "https://www.nowtheendbegins.com/tampa-bay-rays-catcher-jean-ramirez-dead-at-28-after-team-sponsored-vaccinate-at-plate-anne-graham-lotz-daughter-multiple-heart-attacks-bob-saget-betty-white/", "timestamp": "2023-04-25 16:38:19 CEST+0200", "meta": {"description": "28-year old vaccinated catcher for the Tampa Bay Rays, Jean Ramirez, died unexpectedly as Rachel-Ruth Lotz suffered 2 heart attacks.", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/tampa-bay-rays-catcher-jean-ramirez-dead-at-28-after-team-sponsored-vaccinate-at-plate-anne-graham-lotz-daughter-multiple-heart-attacks-bob-saget-betty-white/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "Tampa Bay Rays Catcher Jean Ramirez Dead At 28 After Team Sponsored 'Vaccinate At The Plate', Anne Graham Lotz Daughter Multiple Heart Attacks", "cleaned_text": "The evidence is overwhelming that many vaccinated people are dying, not from COVID so much as from the vaccine. Unless you believe in a “heart attack and blood clot season”, you know what I am telling you is the truth.\n\nStrange things are happening, could it be possible they are all connected? Vaccinated Betty White, who said she felt in “perfect health” died just a few days before her 100th birthday. Well, she was very old, and old people get strokes. OK. Comedian Bob Saget was 65, and on a nation-wide comedy tour. He was found dead in his hotel room bed from a likely heart attack 3 weeks after getting boosted. Hmm. Vaccinated Rachel-Ruth Lotz Wright, daughter Anne Graham Lotz, just suffered two heart attacks, she is in her mid-40’s. Shall I continue? OK. Tampa Bay Rays bullpen catcher Jean Ramirez just dropped dead from “unknown causes” after team recently held a “Vaccinate At The Plate” event over the summer. From 100 years old all the way down to 28, what do these people have in common? They were all vaccinated and most of them boosted. Pray that Rachel-Ruth Lotz recovers, and if you’ve taken the vaccine, pray for yourself, too.\n\n“So they poured out for the men to eat. And it came to pass, as they were eating of the pottage, that they cried out, and said, O thou man of God, there is death in the pot. And they could not eat thereof.” 2 King 4:40 (KJB)\n\nFor months we’ve been telling you about the rising tsunami of deaths and adverse reactions reported on the CDC VAERS website, nearly 1,000 people died just last weekend after getting boosted. The fake news media, Fauci, the Biden administration and others have been bluffing and hoping you believed it, that the vaccines are “safe and effective”, but the mounting pile of dead bodies is bringing to light this demonic rouse.\n\nThey told us that the vaccinated could not catch COVID last summer, this winter that has become a lie, along with the lies that the vaccinated don’t get hospitalized from COVID or die from COVID. None of that turned out to be true. But the evidence is overwhelming that many vaccinated people are dying, not from COVID so much as from the vaccine. Unless you believe in a “heart attack and blood clot season”, you know what I am telling you is the truth. Remember when Rachel-Ruth Lotz’ uncle Franklin Graham was pushing the vaccines last year, and then wound up having emergency heart surgery? Are we to believe that none of all this is in any way connected to the vaccines that were rushed into production? I trow not. (Go look it up, G1380 in your Strong’s Concordance.)\n\nFROM CHRISTIAN HEADLINES: Evangelist Anne Graham Lotz, the daughter of the late evangelist Billy Graham, is asking for prayers after her daughter, Rachel-Ruth, suffered two heart attacks over the weekend.\n\n“Multiple times I have prayed Psalm 73:26 for people who were struggling with heart issues: My flesh and my heart may fail, but God is the strength of my heart and my portion forever,” Lotz wrote on Facebook Tuesday.\n\n“I am now driving the stake of my faith down deep into this promise for my daughter, Rachel-Ruth,” she continued. “She was rushed to the hospital on Saturday night with a heart attack, followed by a catheterization. Sunday afternoon, she had a second heart attack, followed by another catheterization.” READ MORE\n\n“As we process this unexpected and difficult loss, we are grateful for the times we shared with Jean,” Neander said. Ramirez, a native of Puerto Rico who attended high school in Fort Worth, Texas, was a 28th-round draft pick out of Illinois State in 2016. He played three years in Tampa Bay’s minor league system before beginning a three-season stint as a bullpen catcher with the major league team in 2019. “He brought so much passion and energy each day to our clubhouse and bullpen, and his love for the Rays and baseball was evident to all who interacted with him,” manager Kevin Cash said in a statement. READ MORE Vaccinate at the Plate comes to Tampa Bay FROM SUN COAST NEWS: Incentives to receive the COVID-19 vaccine are spreading to Major League Baseball stadiums throughout the country. Dubbed MLB Vaccinate at the Plate, MLB joined the cause in fighting the pandemic this month and is allowing each franchise to roll out its own vaccination strategies. Vaccinate at the Plate came to the Tampa Bay area when the Rays and Tropicana Field hosted three consecutive dosing days in St. Petersburg last week. From 3-7 p.m., June 15-17, all unvaccinated individuals were invited to come to Tropicana Field and receive their choice of the Pfizer or Johnson & Johnson vaccines. In exchange, the newly vaccinated left with vouchers good for two tickets to an upcoming Tampa Bay Rays game. READ MORE Heart attack or stroke suspected in Bob Saget’s death, report says FROM THE MERCURY NEWS: Saget, 65, was found lying face up, “tucked in his bed” in his room at the Ritz-Carlton in Orlando, Florida, police sources told TMZ. He had his left arm across his chest and his right arm lying beside him, with the hand on his chest suggesting the possibility of a heart attack. Officially, Saget’s cause of death remains unknown, following the completion of an autopsy, Monday. Joshua Stephany, the chief medical examiner for Orange and Osceola Counties, confirmed that there was no evidence of drug use or foul play. READ MORE\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last Days before the Rapture of the Church\n• HOW TO DONATE: Click here to view our WayGiver Funding page When you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. Even all the way to South Africa. We even restarted our weekly radio Bible study on Sunday nights again, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing. But whatever you do, don’t do nothing. Time is short and we need your help right now. If every one of the 15,860+ people on our daily mailing list gave $4.50, we would reach our goal immediately. If every one of our 150,000+ followers on Facebook gave $1.00 each, we would reach 300% of our goal. The same goes for our 16,400 followers on Twitter. But sadly, many will not give, so we need the ones who can and who will give to be generous. As generous as possible. “Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV)\n• HOW TO DONATE: Click here to view our WayGiver Funding page", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2022/01/vaccinated-tampa-bay-rays-catcher-dead-at-28-betty-white-bob-saget-rachel-ruth-lotz-heart-attack-stroke-covid-19-vaccine-adverse-reactions-vaers.jpg", "url": "https://www.nowtheendbegins.com/tampa-bay-rays-catcher-jean-ramirez-dead-at-28-after-team-sponsored-vaccinate-at-plate-anne-graham-lotz-daughter-multiple-heart-attacks-bob-saget-betty-white/", "title": "Tampa Bay Rays Catcher Jean Ramirez Dead At 28 After Team Sponsored 'Vaccinate At The Plate', Anne Graham Lotz Daughter Multiple Heart Attacks", "description": "28-year old vaccinated catcher for the Tampa Bay Rays, Jean Ramirez, died unexpectedly as Rachel-Ruth Lotz suffered 2 heart attacks.", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2022-01-12T20:40:04+00:00", "article:modified_time": "2022-01-12T23:21:18+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["Adverse Reactions", "Jean Ramirez", "Betty White", "Bob Saget", "Tampa Bay Rays", "Vaccinated"], "tweets": [], "movies": [], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Ftampa-bay-rays-catcher-jean-ramirez-dead-at-28-after-team-sponsored-vaccinate-at-plate-anne-graham-lotz-daughter-multiple-heart-attacks-bob-saget-betty-white%2F&linkname=Tampa%20Bay%20Rays%20Catcher%20Jean%20Ramirez%20Dead%20At%2028%20After%20Team%20Sponsored%20%E2%80%98Vaccinate%20At%20The%20Plate%E2%80%99%2C%20Anne%20Graham%20Lotz%20Daughter%20Multiple%20Heart%20Attacks", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Ftampa-bay-rays-catcher-jean-ramirez-dead-at-28-after-team-sponsored-vaccinate-at-plate-anne-graham-lotz-daughter-multiple-heart-attacks-bob-saget-betty-white%2F&linkname=Tampa%20Bay%20Rays%20Catcher%20Jean%20Ramirez%20Dead%20At%2028%20After%20Team%20Sponsored%20%E2%80%98Vaccinate%20At%20The%20Plate%E2%80%99%2C%20Anne%20Graham%20Lotz%20Daughter%20Multiple%20Heart%20Attacks", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Ftampa-bay-rays-catcher-jean-ramirez-dead-at-28-after-team-sponsored-vaccinate-at-plate-anne-graham-lotz-daughter-multiple-heart-attacks-bob-saget-betty-white%2F&linkname=Tampa%20Bay%20Rays%20Catcher%20Jean%20Ramirez%20Dead%20At%2028%20After%20Team%20Sponsored%20%E2%80%98Vaccinate%20At%20The%20Plate%E2%80%99%2C%20Anne%20Graham%20Lotz%20Daughter%20Multiple%20Heart%20Attacks", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Ftampa-bay-rays-catcher-jean-ramirez-dead-at-28-after-team-sponsored-vaccinate-at-plate-anne-graham-lotz-daughter-multiple-heart-attacks-bob-saget-betty-white%2F&linkname=Tampa%20Bay%20Rays%20Catcher%20Jean%20Ramirez%20Dead%20At%2028%20After%20Team%20Sponsored%20%E2%80%98Vaccinate%20At%20The%20Plate%E2%80%99%2C%20Anne%20Graham%20Lotz%20Daughter%20Multiple%20Heart%20Attacks", "https://www.addtoany.com/share", "https://abcnews.go.com/Health/wireStory/franklin-graham-undergoes-heart-surgery-mayo-clinic-81046104", "https://www.nowtheendbegins.com/product/strongs-exhaustive-concordance-updated-edition-kjv/", "https://www.nowtheendbegins.com/laodicean-franklin-graham-pleads-with-evangelicals-to-receive-the-sacrament-of-vaccination-says-hell-join-with-joe-biden-to-push-the-jab/", "https://www.facebook.com/photo/?fbid=468227047994529&set=a.250168396467063", "https://www.christianheadlines.com/contributors/milton-quintanilla/please-pray-anne-graham-lotzs-daughter-hospitalized-after-suffering-two-heart-attacks.html", "https://www.washingtonpost.com/sports/mlb/rays-bullpen-catcher-jean-ramirez-dies-unexpectedly-at-28/2022/01/12/59fe804c-73c9-11ec-a26d-1c21c16b1c93_story.html", "https://www.nowtheendbegins.com/dead-doctors-dont-lie-physicians-dropping-dead-after-receiving-covid-19-vaccine-jab/", "https://www.suncoastnews.com/news/vaccinate-at-the-plate-comes-to-tampa-bay/article_e365b9e0-d45f-11eb-8165-7fc584043c50.html", "https://www.mercurynews.com/2022/01/11/heart-attack-or-stroke-suspected-in-bob-sagets-death-report-says/", "https://waygiver.com/campaigns/1486", "https://www.nowtheendbegins.com/product-category/gospel-tracts/", "https://www.nowtheendbegins.com/subscribe-to-nteb-daily-prophecy-updates/", "popverse://bible+av/Pro_4:50", "https://www.facebook.com/NowTheEndBegins/", "popverse://bible+av/Pro_1:00", "https://twitter.com/nowtheendbegins", "popverse://bible+av/Tit_2:13", "https://waygiver.com/campaigns/1486"], "authors": ["Geoffrey Grider"], "publish_date": "2022-01-12T20:40:04+00:00"}