{"result_id": "227039", "URL": "https://www.nowtheendbegins.com/bill-gates-says-combined-covid-vaccine-flu-shots-coming-luciferase-666/", "timestamp": "2023-04-25 16:40:35 CEST+0200", "meta": {"description": "Bill Gates said the only time you will really have to think about the virus is when you get your joint COVID and flu vaccine every fall.", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/bill-gates-says-combined-covid-vaccine-flu-shots-coming-luciferase-666/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "Bill Gates Says To Get Ready For A Mandatory Combined Flu And COVID Vaccine Shot At Least Once Per Year As Only Way To Stop The Pandemic", "cleaned_text": "Bill Gates, long recognized as one of the world’s foremost proponents of vaccines, raised some eyebrows at a recent talk in Australia when he admitted there are “problems” with current COVID-19 vaccines.\n\nEveryone’s favorite epidemiologist Bill Gates became uncharacteristically critical of the current mRNA COVID ‘vaccines’ which led a lot of people to scratch their heads wondering why. You can stop scratching now, as it turns out, Bill Gates just cashed out his investment in BioNTech for a cool half a billion dollars, and suddenly there are nothing but problems with the vaccines he said the entire would should be forced to take. If you recall that, at the height of the pandemic, Pfizer and BioNTech said that were making $1,000-per-second in profits. Is your COVID fog starting to clear up a little now?\n\n“For the love of money is the root of all evil: which while some coveted after, they have erred from the faith, and pierced themselves through with many sorrows.” 1 Timothy 6:10 (KJB)\n\nAfter this stunning though expected revelation, Bill Gates is now championing ‘new methods’ of delivering ‘life saving vaccines’ to people including a nasal spray, and I am positive he is already investing in whatever company will produce that. Bill Gates is not only evil, he is also a very predictable and self-serving and self-enriching liar who profits off the misery he causes. If you’re taking notes, write this down. Anything that Bill Gates is for, you be against. That’s the memo.\n\nFROM THE DEFENDER: Speaking at Australia’s Lowy Institute as part of a talk entitled “Preparing for Global Challenges: In Conversation with Bill Gates,” the Microsoft founder made the following admission:\n\n“We also need to fix the three problems of COVID-19 vaccines. The current vaccines are not infection-blocking. They’re not broad, so when new variants come up you lose protection, and they have very short duration, particularly in the people who matter, which are old people.”\n\nSuch statements came as a surprise to some in light of Gates’ longstanding support of — and investments in — vaccine manufacturers and organizations promoting global vaccination. However, they were the latest in a string of developments in recent weeks that have increasingly called the COVID-19 vaccines, in particular, into question.\n\nSeveral analysts and commentators were critical of Gates — but not due to disagreement with the statements he made in Australia. Instead, they argued that he had previously heavily invested in mRNA vaccines at the same time he encouraged a global COVID-19 vaccination campaign and supported mandatory vaccination.\n\nSpeaking Jan. 25 on The Hill TV’s “Rising,” co-hosts Briahna Joy Gray and Robby Soave addressed Gates’ statements. Soave initially agreed at face value with Gates’ criticism of current mRNA vaccines, saying:\n\n“He really nails it on the issues that we’re having: the short duration of protection, not a significant discernable impact on the transmission of cases … not a massive benefit for a lot of otherwise healthy and younger people.”\n\nHowever, Soave — who on Jan. 19 revealed “Facebook files” indicating the CDC significantly influenced content moderation and censorship on the platform pertaining to COVID-19 vaccines — then pointed out Gates’ prior investments that contributed to the development of mRNA vaccine technology.\n\n“We were just doing some digging,” continued Soave, “[and] we saw that he sold a lot of those shares at … how much profit was that?”\n\n“10x,” replied Gray. “He invested $55 million in BioNTech back in 2019 and it’s now worth north of $550 million. He sold some stock … at the end of last year, I believe it was, with the share price over $300, which represented a huge gain for him over when he invested.”\n\n“Let’s follow that trajectory: Gates invests heavily in BioNTech, ‘mRNA vaccines are great, this is the future,’ he talks about the vaccine timeline and how we can develop it faster, ‘we might have to cut some corners on safety’ … All in … sells it … makes a huge amount of money … but now it’s ‘yeah, it’s okay, it could be better, but what we really need is this breath spray.’”\n\nSoave was referring to a statement Gates made during his recent talk in Australia, immediately prior to his remarks regarding the mRNA vaccines, where he said:\n\n“We think we can also have, very early in an epidemic, a thing that you can inhale that will mean that you can’t be infected, a blocker, an inhaled blocker.”\n\nGray raised the issue of conflicts of interest between individuals such as Gates who hold significant positions with drug and vaccine manufacturers, and the federal government’s spending of large sums of taxpayer money to purchase these products. She said:\n\n“At the same time, the Biden administration is opening its doors, revolving doors, to people from these various industries like Jeff Zients, who is the new chief of staff for Joe Biden … who has spent his entire career at the kinds of companies, investing in the kinds of companies, that have been overcharging the government for Medicare and Medicaid payments and exact kinds of overpayments. It is an enormous grift and one that is incredibly common.”\n\nZients was formerly the Biden administration’s “COVID czar” and publicly pushed for universal vaccination. READ MORE\n\nAWKWARD! Bill Gates Squirms When Asked About Relationship With Jeffrey Epstein\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last Days before the Rapture of the Church\n• HOW TO DONATE: Click here to view our WayGiver Funding page\n\nWhen you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. We have a Gospel Billboard program. We are now broadcasting Bible studies, Podcasts and a Sunday Service 5 times a week, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing.\n\nBut whatever you do, don’t do nothing. Time is short and we need your help right now. The Lord has given us an open door with a tremendous ‘course’ for us to fulfill that will create an excellent experience at the Judgement Seat of Christ. Please pray for our efforts, and if the Lord leads you to donate, be as generous as possible. The war is REAL, the battle HOT and the time is SHORT…TO THE FIGHT!!!\n\n“Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJB)", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2021/12/bill-gates-says-covid-vaccine-boosters-will-be-combined-with-flu-shots-for-a-yearly-software-update-Pharmakeia-666.jpg", "url": "https://www.nowtheendbegins.com/bill-gates-says-combined-covid-vaccine-flu-shots-coming-luciferase-666/", "title": "Bill Gates Says To Get Ready For A Mandatory Combined Flu And COVID Vaccine Shot At Least Once Per Year As Only Way To Stop The Pandemic", "description": "Bill Gates said the only time you will really have to think about the virus is when you get your joint COVID and flu vaccine every fall.", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2021-12-08T18:51:49+00:00", "article:modified_time": "2021-12-08T22:34:17+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["Flu Shot", "GatesNotes", "Bill Gates", "Gates Of Hell", "Omicron"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Bill Gates last week saying the “vaccines don’t block transmission, they’re not broad and they have a very short duration”. Now why on earth would anyone with a brain want these vaccine?? <a href=\"https://twitter.com/hashtag/BillGatesBioTerrorist?src=hash&amp;ref_src=twsrc%5Etfw\">#BillGatesBioTerrorist</a> <a href=\"https://twitter.com/hashtag/vaccinegenocide?src=hash&amp;ref_src=twsrc%5Etfw\">#vaccinegenocide</a> <a href=\"https://twitter.com/hashtag/DiedSuddendly?src=hash&amp;ref_src=twsrc%5Etfw\">#DiedSuddendly</a> <a href=\"https://t.co/wiBFUQKZBB\">pic.twitter.com/wiBFUQKZBB</a></p>\n<p>— Now The End Begins (@NowTheEndBegins) <a href=\"https://twitter.com/NowTheEndBegins/status/1618310022827741185?ref_src=twsrc%5Etfw\">January 25, 2023</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/AyZvC-z9qV0\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/AyZvC-z9qV0"}], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fafter-cashing-out-biontech-stock-bill-gates-criticizes-covid-mrna-vaccines%2F&linkname=After%20Selling%20Off%20His%20BioNTech%20Stock%20For%20A%20Cool%20%24500%20Million%20Profit%2C%20Bill%20Gates%20Suddenly%20Starts%20Talking%20About%20All%20The%20%E2%80%98Problems%20With%20The%20Current%20Vaccines%E2%80%99%2C%20Hmm", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fafter-cashing-out-biontech-stock-bill-gates-criticizes-covid-mrna-vaccines%2F&linkname=After%20Selling%20Off%20His%20BioNTech%20Stock%20For%20A%20Cool%20%24500%20Million%20Profit%2C%20Bill%20Gates%20Suddenly%20Starts%20Talking%20About%20All%20The%20%E2%80%98Problems%20With%20The%20Current%20Vaccines%E2%80%99%2C%20Hmm", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fafter-cashing-out-biontech-stock-bill-gates-criticizes-covid-mrna-vaccines%2F&linkname=After%20Selling%20Off%20His%20BioNTech%20Stock%20For%20A%20Cool%20%24500%20Million%20Profit%2C%20Bill%20Gates%20Suddenly%20Starts%20Talking%20About%20All%20The%20%E2%80%98Problems%20With%20The%20Current%20Vaccines%E2%80%99%2C%20Hmm", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fafter-cashing-out-biontech-stock-bill-gates-criticizes-covid-mrna-vaccines%2F&linkname=After%20Selling%20Off%20His%20BioNTech%20Stock%20For%20A%20Cool%20%24500%20Million%20Profit%2C%20Bill%20Gates%20Suddenly%20Starts%20Talking%20About%20All%20The%20%E2%80%98Problems%20With%20The%20Current%20Vaccines%E2%80%99%2C%20Hmm", "https://www.addtoany.com/share", "https://www.nowtheendbegins.com/pfizer-biontech-say-third-shot-booster-needed-to-protect-against-omicron-covid-variant/", "https://www.nowtheendbegins.com/category/bill-gates/", "https://twitter.com/hashtag/BillGatesBioTerrorist?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/vaccinegenocide?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/DiedSuddendly?src=hash&ref_src=twsrc%5Etfw", "https://t.co/wiBFUQKZBB", "https://twitter.com/NowTheEndBegins/status/1618310022827741185?ref_src=twsrc%5Etfw", "https://childrenshealthdefense.org/defender/bill-gates-profits-biontech-effectiveness-covid-vaccines/", "https://waygiver.com/campaigns/1486", "https://biblesbehindbars.com/"], "authors": ["Geoffrey Grider"], "publish_date": "2021-12-08T18:51:49+00:00"}