{"result_id": "227021", "URL": "https://www.nowtheendbegins.com/anthony-fauci-bill-gates-global-vaccine-action-plan-with-mandatory-covid-19-vaccinations/", "timestamp": "2023-04-25 16:39:14 CEST+0200", "meta": {"description": "Dr. Anthony Fauci, who once worked with technocratic oligarch Bill Gates on his Global Vaccine Action Plan now seeking mandatory COVID-19 vaccinations.", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/anthony-fauci-bill-gates-global-vaccine-action-plan-with-mandatory-covid-19-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "Dr. Anthony Fauci Has Subverted The Trump Administration To Carry Out Bill Gates 'Global Vaccine Action Plan' With Mandatory COVID-19 Vaccinations", "cleaned_text": "Dr. Anthony Fauci, who has become a beloved doom prophet fomenting mass hysteria among the American public amidst the coronavirus pandemic, once worked with technocratic oligarch Bill Gates on his “Global Vaccine Action Plan.”\n\nAnthony Fauci is, as you are starting to see is absolutely not one of the good guys, not by a longshot. He has lied repeatedly about the mortality rates, as recently as just last week calling for between 100-200,000 death bodies when nothing remotely close to that has happened. Not only that, he is a longtime member of the vaccine cabal with Bill Gates. Have you figured out yet why he has been so against using the anti-malaria drug hydroxychloroquine? Because he and his buddy Bill Gates want to give everyone a vaccine instead. You mad, bro?\n\nI believe that Donald Trump is one of the good guys, but I also think that he has underestimated The Swamp which is at this moment seeking to overwhelm him. Anthony Fauci is a Swamp Creature, as is Bill Gates and all the rest of them. You know how Fauci is always referencing his work on AIDS in the 1980’s? Yeah, well, his ‘recommended AIDS protocols’ killed my older brother Bob. Fauci and his staff said that ‘AZT showed great promise’ and pushed for AIDS sufferers to take it. Well they took it, like my brother did, and it killed them dead. I have no love for Anthony Fauci and even less for his cabal master Bill Gates.\n\nAnthony Fauci is the one who told President Trump to ‘shut it down’ referring to the economy, Anthony Fauci is the one who tried to stop the anti-malaria drug hydroxychloroquine, and Anthony Fauci is part of the team trying to take down America. Someone close to President Trump needs to get him this message and wake him up.\n\nAt this very moment, Anthony Fauci is attempting a coup on the White House, in order to fulfill the mission of the Global Vaccine Action Plan he created with Bill Gates. Mark my words, they will push and push and push until every American will be forced to take the vaccination. Let me just go on record right now, I will not take it for any reason under any circumstances. Do your homework, find out what Fauci was doing with Gates on the Global Vaccine Action Plan. When you do, then you will understand why the COVID-19 vaccine will be mandatory.\n\nFROM THE WASHINGTON TIMES: Activist reporter Mike Coudrey drew attention to this fact on his Twitter account in a post from Sunday:\n\nThe “Global Vaccine Action Plan” was announced in 2010 as a public-private partnership of the World Health Organization (WHO), the United Nations Children’s Fund (UNICEF), the National Institute of Allergy and Infectious Diseases (NIAID), and the Bill & Melinda Gates Foundation.\n\n“This plan will build on the successes of current work to achieve key milestones in the discovery, development and delivery of lifesaving vaccines to the most vulnerable populations in the poorest countries over the next decade,” WHO wrote in their press release about the project.\n\nAs the NIAID director, Fauci helped guide the vaccine-pushing project as a member of its Leadership Team. He was joined by other globalist kingpins including Anthony Lake, Executive Director for UNICEF; Margaret Chan, Director General of WHO; Joy Phumaphi, Chair of the International Advisory Committee and Executive Secretary, African Leaders Malaria Alliance; and Tachi Yamada, President of Global Health at the Bill & Melinda Gates Foundation.\n\nThe project was designed to assemble some of the most powerful globalist actors on the planet and encourage them to conspire on ways to peddle vaccines throughout the world.\n\n“The Global Vaccine Action Plan will enable greater coordination across all stakeholder groups – national governments, multilateral organizations, civil society, the private sector and philanthropic organizations — and will identify critical policy, resource, and other gaps that must be addressed to realize the life- saving potential of vaccines,” WHO wrote in their press release about the scheme.\n\nFauci has been the primary voice in the Trump administration urging the public to be skeptical of hydroxychloroquine, a possible miracle treatment for coronavirus. Fauci has remained a critic of hydroxychloroquine despite indications that it can be effective in helping the afflicted recover from the disease.\n\n“No. The answer is no,” Fauci said last month after he was asked about whether or not there was any evidence showing that hydroxychloroquine can be effective in treating the coronavirus.\n• None When it became clear that hydroxychloroquine can be effective in treating the coronavirus, Fauci walked back his comments.\n\n“Although there is some suggestion with the study that was just mentioned by Dr. Oz, granted that there is a suggestion that there is a benefit there, I think we’ve got to be careful that we don’t make that majestic leap to assume that this is a knockout drug,” Fauci said during an appearance on “FOX & Friends” last week.\n\nFauci may be trying to halt the use of hydroxychloroquine as part of the “Global Vaccine Action Plan” that he plotted many years ago. Gates has already talked about digital tracking implants being tagged into people’s skin for authorities to enforce their vaccination schedule. Fauci could be serving as a bureaucratic enabler of Gates’ sociopathic Big Brother ambitions. READ MORE\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last days before the Rapture of the Church\n• HOW TO DONATE:Click here to view our GoFundMe page\n\nWhen you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. Even all the way to South Africa. We even restarted our weekly radio Bible study on Sunday nights again, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing.\n\nBut whatever you do, don’t do nothing. Time is short and we need your help right now. If every one of the 13,862 people on our daily mailing list gave $4.50, we would reach our goal immediately. If every one of our 149,000 followers on Facebook gave $1.00 each, we would reach 300% of our goal. The same goes for our 14,800 followers on Twitter. But sadly, many will not give, so we need the ones who can and who will give to be generous. As generous as possible.\n\n“Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV)\n• HOW TO DONATE: Click here to view our GoFundMe page", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/anthony-fauci-partner-with-bill-gates-global-vaccine-action-plan-mandatory-covid-19-vaccinations-united-states-hydroxychloroquine.jpg", "url": "https://www.nowtheendbegins.com/anthony-fauci-bill-gates-global-vaccine-action-plan-with-mandatory-covid-19-vaccinations/", "title": "Dr. Anthony Fauci Has Subverted The Trump Administration To Carry Out Bill Gates 'Global Vaccine Action Plan' With Mandatory COVID-19 Vaccinations", "description": "Dr. Anthony Fauci, who once worked with technocratic oligarch Bill Gates on his Global Vaccine Action Plan now seeking mandatory COVID-19 vaccinations.", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2020-04-09T04:06:43+00:00", "article:modified_time": "2022-06-15T19:49:31+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["anti-malaria drug", "Bill Gates", "Anthony Fauci", "hydroxychloroquine", "COVID-19 Vaccine"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Dr. Fauci served a leadership role on the “Global Vaccine Plan” through partnership with the Bill and Melinda Gates foundation.</p>\n<p>Naturally, he’ll push back against the Hydroxychloroquine + Azithromycin treatment and instead opt for a patented vaccine. <a href=\"https://t.co/FCkOIAsHW2\">pic.twitter.com/FCkOIAsHW2</a></p>\n<p>— Mike Coudrey (@MichaelCoudrey) <a href=\"https://twitter.com/MichaelCoudrey/status/1247013944905977857?ref_src=twsrc%5Etfw\">April 6, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">But this is just “anecdotal” evidence…</p>\n<p>TRUMP’S MIRACLE DRUG: French Study of 1,000+ Patients Including Seniors See 98% Success Rate with Hydroxychloroquine-Azithromycin Regimen <a href=\"https://t.co/M6o19qpaws\">https://t.co/M6o19qpaws</a></p>\n<p>— Michael J. Fell (@MichaelJFell) <a href=\"https://twitter.com/MichaelJFell/status/1248666439160037377?ref_src=twsrc%5Etfw\">April 10, 2020</a></p></blockquote>\n"], "movies": [], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fanthony-fauci-bill-gates-global-vaccine-action-plan-with-mandatory-covid-19-vaccinations%2F&linkname=Dr.%20Anthony%20Fauci%20Has%20Subverted%20The%20Trump%20Administration%20To%20Carry%20Out%20Bill%20Gates%20%E2%80%98Global%20Vaccine%20Action%20Plan%E2%80%99%20With%20Mandatory%20COVID-19%20Vaccinations", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fanthony-fauci-bill-gates-global-vaccine-action-plan-with-mandatory-covid-19-vaccinations%2F&linkname=Dr.%20Anthony%20Fauci%20Has%20Subverted%20The%20Trump%20Administration%20To%20Carry%20Out%20Bill%20Gates%20%E2%80%98Global%20Vaccine%20Action%20Plan%E2%80%99%20With%20Mandatory%20COVID-19%20Vaccinations", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fanthony-fauci-bill-gates-global-vaccine-action-plan-with-mandatory-covid-19-vaccinations%2F&linkname=Dr.%20Anthony%20Fauci%20Has%20Subverted%20The%20Trump%20Administration%20To%20Carry%20Out%20Bill%20Gates%20%E2%80%98Global%20Vaccine%20Action%20Plan%E2%80%99%20With%20Mandatory%20COVID-19%20Vaccinations", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fanthony-fauci-bill-gates-global-vaccine-action-plan-with-mandatory-covid-19-vaccinations%2F&linkname=Dr.%20Anthony%20Fauci%20Has%20Subverted%20The%20Trump%20Administration%20To%20Carry%20Out%20Bill%20Gates%20%E2%80%98Global%20Vaccine%20Action%20Plan%E2%80%99%20With%20Mandatory%20COVID-19%20Vaccinations", "https://www.addtoany.com/share", "https://www.nowtheendbegins.com/fema-requests-hundred-thousand-body-bags-covid-19-coronavirus-fatalities-in-april-as-morgues-overflow/", "https://www.who.int/immunization/global_vaccine_action_plan/GVAP_doc_2011_2020/en/", "https://t.co/FCkOIAsHW2", "https://twitter.com/MichaelCoudrey/status/1247013944905977857?ref_src=twsrc%5Etfw", "https://www.who.int/immunization/newsroom/press/news_release_decade_vaccines/en/", "https://www.nowtheendbegins.com/category/bill-gates/", "https://t.co/M6o19qpaws", "https://twitter.com/MichaelJFell/status/1248666439160037377?ref_src=twsrc%5Etfw", "https://bigleaguepolitics.com/pharma-insider-first-data-from-clinical-studies-indicates-hydroxychloroquine-kills-the-coronavirus/", "https://www.cnn.com/2020/03/28/health/coronavirus-hydroxychloroquine-trial/index.html", "https://www.realclearpolitics.com/video/2020/04/03/fauci_we_cant_make_that_majestic_leap_and_believe_hydroxychloroquine_is_the_cure_to_coronavirus.html", "https://bigleaguepolitics.com/as-coronavirus-panic-spreads-bill-gates-talks-up-digital-certificates-to-enforce-mandatory-vaccines/", "https://www.washingtontimes.com/news/2020/apr/8/anthony-fauci-sets-stage-mandatory-vaccine/", "https://www.gofundme.com/now-the-end-begins-reader-support", "https://www.nowtheendbegins.com/nteb-gospel-tracts/", "https://www.nowtheendbegins.com/subscribe-to-nteb-daily-prophecy-updates/", "https://www.facebook.com/NowTheEndBegins/", "https://twitter.com/nowtheendbegins", "https://www.gofundme.com/now-the-end-begins-reader-support"], "authors": ["Geoffrey Grider"], "publish_date": "2020-04-09T04:06:43+00:00"}