{"result_id": "227047", "URL": "https://www.nowtheendbegins.com/bill-melinda-gates-foundation-spending-millions-creating-human-implantable-quantum-dot-microneedle-vaccine-mark-technology-with-data-storage/", "timestamp": "2023-04-25 16:41:05 CEST+0200", "meta": {"description": "The Bill and Melinda Gates Foundation has donated more than $21 million towards creating a human implantable quantum dot vaccine mark with data storage.", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/bill-melinda-gates-foundation-spending-millions-creating-human-implantable-quantum-dot-microneedle-vaccine-mark-technology-with-data-storage/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "Bill and Melinda Gates Foundation Spending Millions Creating Human Implantable Quantum Dot Microneedle Vaccine Mark With Data Storage", "cleaned_text": "The Bill and Melinda Gates Foundation has donated more than $21 million towards developing a vaccine technology that uses a tattoo-like mechanism which injects invisible quantum dot nanoparticles under the skin that is now being tested in a vaccine against the virus that causes COVID-19\n\nHistory will record that 2020 was the year that everyone learned the phrase ‘quantum dot tattoo’, as well as recording that this science fictionesque technology is being funded by Bill Gates and the eponymous foundation him and his wife Melinda preside over. The foundation to date has spent over $21 million dollars developing this new vaccine delivery technology, which can best be described as a mark that is implanted in the human body and is capable of data storage.\n\n“And I saw thrones, and they sat upon them, and judgment was given unto them: and I saw the souls of them that were beheaded for the witness of Jesus, and for the word of God, and which had not worshipped the beast, neither his image, neither had received his mark upon their foreheads, or in their hands; and they lived and reigned with Christ a thousand years.” Revelation 20:4 (KJB)\n\nLook at the glowing “X” marks you see in the top photo of this article, those are actual pictures of what it looks like when the quantum dot mark is injected into the human body. Researchers at Massachusetts Institute of Technology have developed a microneedle patch containing a nanocrystal dye that creates near-infrared-emitting dots under the skin. The emitted light is then detected by a specially modified smartphone, which is what you are looking at.\n\nBefore we go further, let’s review, shall we?\n\n“Behold ye among the heathen, and regard, and wonder marvellously: for I will work a work in your days, which ye will not believe, though it be told you.” Habakkuk 1:5 (KJB)\n\nOK, here it is. Bill Gates and his wife are spending tens of millions to create a human implantable mark that when injected emits a glowing, red X pattern as it delivers the vaccine, and what is left behind is capable of data storage and retrieval for years afterwards. Not only that, it is the oft-stated aim and goal of Bill Gates and his wife Melinda to give a quantum dot vaccination mark to every human being on the face of the earth. Got it? Please tell me you got it.\n\nFROM GREEN MED INFO: The microneedle technology is also being wed to injectable technology, funded by the Bill and Melinda Gates Foundation, which embeds under the skin a vaccination record visible by near infrared light that can be read by smartphone technology.\n\nThe Bill and Melinda Gates Foundation is funding the technologies with aims to enable them in “house-to-house” vaccine campaigns undertaken by people with “minimal training.” Researchers from the University of Pittsburgh reported in their study published April 1 in EBiomedicine, a Lancet Journal, that their microneedle patch vaccine against the SARS CoV-2 virus that causes COVID-19 “prompted robust antibody production in the mice within two weeks.”\n\nThe researchers had been testing vaccine using the microneedle patch for other coronaviruses, including the one that causes Middle East Respiratory System (MERS) and reported that three different experimental MERS vaccines induced the production of antibodies against the virus. These responses were stronger than the responses generated by regular injection of one of the vaccines along with a powerful immune stimulant (an adjuvant). Antibody levels continued to increase over time in mice vaccinated by microneedle patch-up to 55 weeks, when the experiments ended. The researchers have now turned their technology to the COVID-19 virus, SARS CoV-2.\n\nAnother study funded by the Bill and Melinda Gates Foundation and published in December, 2019 by researchers from the Massachusetts Institute of Technology, the Institute of Chemistry of the Chinese Academy of Sciences in Beijing and the Global Good, Intellectual Ventures Laboratory in Bellevue, WA, describes how “near-infrared quantum dots” can be implanted under the skin along with a vaccine to encode information for “decentralized data storage and bio-sensing.”\n\nFridrik Laurusson, an author of the microchip study, is from The Global Good, Intellectual Ventures Labarotory. Its website features Microsoft founder Bill Gates on its front page and describes itself as a “collaboration between Bill Gates and Intellectual Ventures” a company founded by Nathan Myhrvold and Edward Jung of Microsoft. Wikipedia describes Intellectual Ventures in Gates’ home state as a private American company that “centers on the development and licensing of intellectual property” and “one of the top-five owners of U.S. patents, as of 2011.\n\nThe website of the Bill and Melinda Gates lists multiple grants awarded to develop the “microneedle array patch” – for use in “house-to-house campaigns via administration by minimally-trained personnel.” The most recent grant for $370,035 was awarded in February, 2020 to the Centers for Disease Control and Prevention for an MMR vaccine patch that does not require refrigeration and “enables house-to-house campaigns” via people without medical experience or training.\n\nBill Gates has awarded much larger grants for microneedle array patch technology to companies and organizations including:\n• * Vaxxas Pty Ltd in Brisbane, Queensland ($4.99 million in November, 2019) to develop a “microneedle array patch for measles and rubella vaccination that enables house-to-house campaigns via administration by minimally-trained personnel” Vaxxas was created in 2011 after Mark Kendall’s research group at the University of Queensland commercialized the nanotechnology under the company, UniQuest. The company has raised more than $35 million for the nanotechnology. It’s partnered with vaccine manufacturer Merck – a company whose drug Vioxx caused more than 27,000 deaths by heart attack before the company revealed the risks it had hidden from the public. Merck has repeatedly been accused by judges for “egregious” ethical breaches and of “improper testing and data falsification” on its Gardasil HPV and MMR vaccines. Merck made\n• Micron Biomedical Inc ($6,744,906 in November, 2019) “to develop a microneedle array patch for measles and rubella vaccination that enables house-to-house campaigns via administration by minimally-trained personnel”\n• Georgia Institute of Technology ($958,849 in December, 2019) “to develop a microneedle array patch for measles and rubella vaccination that enables house-to-house campaigns via administration by minimally-trained personnel”\n• Vaxess Inc, ($2,967,741 in November, 2016) in Boston, MA “to support the preclinical development and manufacture of a thermostable microneedle patch with the aim of lowering barriers to vaccine access by simplifying dosing and administration, alleviating cold chain constraints, and lowering costs\n• Cardiff University ($$3,570,376 in December, 2019) “to develop a dissolvable microneedle array patch for the sustained dermal delivery of a progestin contraceptive, including the conduct of preclinical proof of concept studies”\n\nBill Gates began funding the implantable biotechnology back in 2011 via a small ($100,000) grant to the Santa Cruz based company TransDerm Inc whose Linkedin page links to a website for the pharmaceutical giant Allergan.\n\nLast month Reuters news service reported – falsely – that a popular Facebook post about Bill Gates planning to use microchip implants to fight the coronavirus pandemic was a “false claim.” The news service linked to the censored Facebook post.\n\nBill Gates, whose father was the director of Planned Parenthood Federation of America and mother worked for PPFA’s funding affiliate United Way, has been noted for his population control ideology. His wife, Melinda Gates, launched a Family Planning Summit on World Population Day in 2012 with the aim of garnering tax dollars from governments to expand reproductive health services aimed at lowering the global birth rate. READ MORE\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last days before the Rapture of the Church\n• HOW TO DONATE:Click here to view our GoFundMe page\n\nWhen you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. Even all the way to South Africa. We even restarted our weekly radio Bible study on Sunday nights again, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing.\n\nBut whatever you do, don’t do nothing. Time is short and we need your help right now. If every one of the 14,444+ people on our daily mailing list gave $4.50, we would reach our goal immediately. If every one of our 149,000 followers on Facebook gave $1.00 each, we would reach 300% of our goal. The same goes for our 15,300 followers on Twitter. But sadly, many will not give, so we need the ones who can and who will give to be generous. As generous as possible.\n\n“Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV)\n• HOW TO DONATE: Click here to view our GoFundMe page", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/bill-gates-melinda-foundation-funding-quantum-dot-human-implantable-microneedle-vaccine-tattoos-mark-of-the-beast-666-microchip.jpg", "url": "https://www.nowtheendbegins.com/bill-melinda-gates-foundation-spending-millions-creating-human-implantable-quantum-dot-microneedle-vaccine-mark-technology-with-data-storage/", "title": "Bill and Melinda Gates Foundation Spending Millions Creating Human Implantable Quantum Dot Microneedle Vaccine Mark With Data Storage", "description": "The Bill and Melinda Gates Foundation has donated more than $21 million towards creating a human implantable quantum dot vaccine mark with data storage.", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2020-04-29T13:56:33+00:00", "article:modified_time": "2020-04-29T19:52:16+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["mark of the beast", "nanotechnology", "Bill Gates", "quantum dot", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fbill-melinda-gates-foundation-spending-millions-creating-human-implantable-quantum-dot-microneedle-vaccine-mark-technology-with-data-storage%2F&linkname=Bill%20and%20Melinda%20Gates%20Foundation%20Spending%20Millions%20Creating%20Human%20Implantable%20Quantum%20Dot%20Microneedle%20Vaccine%20Mark%20With%20Data%20Storage", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fbill-melinda-gates-foundation-spending-millions-creating-human-implantable-quantum-dot-microneedle-vaccine-mark-technology-with-data-storage%2F&linkname=Bill%20and%20Melinda%20Gates%20Foundation%20Spending%20Millions%20Creating%20Human%20Implantable%20Quantum%20Dot%20Microneedle%20Vaccine%20Mark%20With%20Data%20Storage", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fbill-melinda-gates-foundation-spending-millions-creating-human-implantable-quantum-dot-microneedle-vaccine-mark-technology-with-data-storage%2F&linkname=Bill%20and%20Melinda%20Gates%20Foundation%20Spending%20Millions%20Creating%20Human%20Implantable%20Quantum%20Dot%20Microneedle%20Vaccine%20Mark%20With%20Data%20Storage", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fbill-melinda-gates-foundation-spending-millions-creating-human-implantable-quantum-dot-microneedle-vaccine-mark-technology-with-data-storage%2F&linkname=Bill%20and%20Melinda%20Gates%20Foundation%20Spending%20Millions%20Creating%20Human%20Implantable%20Quantum%20Dot%20Microneedle%20Vaccine%20Mark%20With%20Data%20Storage", "https://www.addtoany.com/share", "https://physicsworld.com/a/invisible-dye-embeds-vaccination-records-on-skin/", "https://www.gatesfoundation.org/search#q/k=microneedle%20array", "https://www.genengnews.com/topics/drug-discovery/quantum-dots-deliver-vaccines-and-invisibly-encode-vaccination-history-in-skin/", "https://www.nowtheendbegins.com/category/bill-gates/", "https://www.ncbi.nlm.nih.gov/pubmed/32249203", "https://www.upmc.com/media/news/040220-falo-gambotto-sars-cov2-vaccine", "https://sci-hub.tw/10.1126/scitranslmed.aay7162", "http://news.mit.edu/2019/storing-vaccine-history-skin-1218", "http://news.mit.edu/2019/storing-vaccine-history-skin-1218", "https://www.intellectualventures.com/what-we-do/global-good-fund/our-work", "https://en.wikipedia.org/wiki/Intellectual_Ventures", "https://en.wikipedia.org/wiki/Patent_trolling", "https://en.wikipedia.org/wiki/Patent_troll", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2020/02/INV-005725", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2019/11/INV-003551", "https://www.nbcnews.com/id/6192603/ns/health-arthritis/t/report-vioxx-linked-thousands-deaths/", "https://www.biopharmadive.com/news/judge-accuses-merck-of-egregious-misconduct-tosses-200m-award-in-hep-c/420563/", "https://vaccineimpact.com/2018/merck-fighting-fraud-lawsuits-in-u-s-courts-on-mmr-and-gardasil-vaccines/", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2019/11/INV-002311", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2019/12/INV-003561", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2016/11/OPP1156172", "https://www.gatesfoundation.org/How-We-Work/Quick-Links/Grants-Database/Grants/2019/11/OPP1214034", "https://www.allergan.com/", "https://www.reuters.com/article/uk-factcheck-coronavirus-bill-gates-micr-idUSKBN21I3EC", "https://www.facebook.com/FlatEarthStationary/photos/a.1685985571659645/2546367705621423/?type=3&__tn__=-R", "https://www.pbs.org/now/transcript/transcript_gates.html", "https://www.dailysignal.com/2016/06/24/united-way-affiliates-give-3-million-a-year-to-planned-parenthood/", "https://www.greenmedinfo.com/blog/bill-gates-and-intellectual-ventures-funds-microchip-implant-vaccine-technology1", "https://www.gofundme.com/now-the-end-begins-reader-support", "https://www.nowtheendbegins.com/nteb-gospel-tracts/", "https://www.nowtheendbegins.com/subscribe-to-nteb-daily-prophecy-updates/", "https://www.facebook.com/NowTheEndBegins/", "https://twitter.com/nowtheendbegins", "https://www.gofundme.com/now-the-end-begins-reader-support"], "authors": ["Geoffrey Grider"], "publish_date": "2020-04-29T13:56:33+00:00"}