{"result_id": "227017", "URL": "https://www.nowtheendbegins.com/stephen-colbert-vax-scene-dancing-drag-queens-covid-19-vaccinations-new-world-order-george-orwell-1984/", "timestamp": "2023-04-25 16:38:56 CEST+0200", "meta": {"description": "If you have any doubts about taking the COVID vaccine, just watch Stephen Colbert and 'The Vax Scene' dancing drag queens to clear it up.", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/stephen-colbert-vax-scene-dancing-drag-queens-covid-19-vaccinations-new-world-order-george-orwell-1984/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "On The Fence About Taking The Vaccine? Watch Stephen Colbert And His Dancing Syringe Drag Queens Do The 'Vax Scene' And Your Doubts Will Vanish Away!", "cleaned_text": "Stephen Colbert professes to be a Roman Catholic, and like his papal forefathers, he would reinstitute a modern-day Spanish Inquisition if he could, burning at the stake as many anti-vaxxers as he could. In the meantime, it’s ‘The Vax Scene’ to torment you.\n\nIf you like unfunny Liberal comedians, you have a wide range to choose from. Start with the talentless Trevor Noah who only has a job because he’s black, Jimmy Kimmel who used to love dressing up in blackface and using the n-word, all the way up to Stephen Colbert who doesn’t even pretend to be funny. It is here you will find drag queens dancing dressed as vaccine syringes, in a bit they call ‘The Vax Scene’ that is pathetic on every level except for one.\n\n“Every record has been destroyed or falsified, every book rewritten, every picture has been repainted, every statue and street building has been renamed, every date has been altered. And the process is continuing day by day and minute by minute. History has stopped. Nothing exists except an endless present in which the Party is always right.”― George Orwell, 1984\n\nThe one level it succeeds on is their revelation of how much they hate every one who does not think they way they do, and that given the chance, they would have us all put to death without reservation or hesitation. Make sure you watch the video below of Stephen Colbert and Oprah mocking God, the Bible and Jesus Christ, that’ll be an eye-opener if you still need one after watching ‘The Vax Scene’. If I was on the fence about taking the vaccine and watched this video, my mind would be made up instantly to not take it. Thanks, Maya!\n\n“When someone shows you who they are, believe them the first time.” – Maya Angelou\n\nWhen the great state of Florida went for Trump in 2020, Trevor Noah posted a video of Florida being vaporized by alien attack, killing all 22 million residents in the process. This is what the great comedic minds of ‘The Daily Show’ like to laugh about. Stephen Colbert also thinks there is a huge segment of the population unfit to live, and it is to those people his ‘Vax Scene’ is actually directed. Stephen Colbert professes to be a Roman Catholic, and like his papal forefathers, he would reinstitute a modern-day Spanish Inquisition if he could, burning at the stake as many anti-vaxxers as he could. But until they are in power, you will just have to settle for dancing syringe drag queens pushing the jab.\n\nWe live in a world where the insane people are the ones making the rules, where the ongoing murder of babies is not only tolerated but demanded, and where the enslavement of the global population is happening at a stunning rate. Over on the Communist YouTube, they are deleting all videos that going against the party line. As part of a new set of policies aimed at cutting down on anti-vaccine content on the Google-owned site, YouTube will ban any videos that claim that commonly used vaccines approved by health authorities are ineffective or dangerous. The company previously blocked videos that made those claims about coronavirus vaccines, but not ones for other vaccines like those for measles or chickenpox.\n\nGet the picture now? Either you side with Stephen Colbert and are part the ‘vax scene’, or you’re nowhere, locked out of your local system as well as the larger global system. And that part I mentioned about them ‘burning us at the stake’ if they could? Prepare yourself, because that’s ‘on deck’ right now if the Lord tarries. Even so, come get us Lord Jesus!\n\nOn the Stephen Colbert show in 2018, Colbert discussed with guest Oprah Winfrey the possibility of her running for president in 2020. Winfrey famously said not too long ago that if she were to run for president, she would need a ‘sign from God’. So Colbert had “god” show up to discuss it.\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last Days before the Rapture of the Church\n• HOW TO DONATE: Click here to view our WayGiver Funding page When you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. Even all the way to South Africa. We even restarted our weekly radio Bible study on Sunday nights again, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing. But whatever you do, don’t do nothing. Time is short and we need your help right now. If every one of the 15,860+ people on our daily mailing list gave $4.50, we would reach our goal immediately. If every one of our 150,000+ followers on Facebook gave $1.00 each, we would reach 300% of our goal. The same goes for our 15,900 followers on Twitter. But sadly, many will not give, so we need the ones who can and who will give to be generous. As generous as possible. “Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV)\n• HOW TO DONATE: Click here to view our WayGiver Funding page", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2021/09/stephen-colbert-late-show-vax-scene-covid-vaccine-liberalism-is-mental-disorder-police-state-democrats.jpg", "url": "https://www.nowtheendbegins.com/stephen-colbert-vax-scene-dancing-drag-queens-covid-19-vaccinations-new-world-order-george-orwell-1984/", "title": "On The Fence About Taking The Vaccine? Watch Stephen Colbert And His Dancing Syringe Drag Queens Do The 'Vax Scene' And Your Doubts Will Vanish Away!", "description": "If you have any doubts about taking the COVID vaccine, just watch Stephen Colbert and 'The Vax Scene' dancing drag queens to clear it up.", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2021-09-29T19:56:21+00:00", "article:modified_time": "2021-09-30T15:52:52+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["George Orwell 1984", "liberals", "COVID vaccine", "The Vax Scene", "Stephen Colbert"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Stephen Colbert, winning hearts and minds of the vaccine hesitant <a href=\"https://t.co/fa98vRrcRj\">pic.twitter.com/fa98vRrcRj</a></p>\n<p>— Daily Caller (@DailyCaller) <a href=\"https://twitter.com/DailyCaller/status/1443037724529811456?ref_src=twsrc%5Etfw\">September 29, 2021</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/JZeZ_zh0cMY\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/JZeZ_zh0cMY"}], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fstephen-colbert-vax-scene-dancing-drag-queens-covid-19-vaccinations-new-world-order-george-orwell-1984%2F&linkname=On%20The%20Fence%20About%20Taking%20The%20Vaccine%3F%20Watch%20Stephen%20Colbert%20And%20His%20Dancing%20Syringe%20Drag%20Queens%20Do%20The%20%E2%80%98Vax%20Scene%E2%80%99%20And%20Your%20Doubts%20Will%20Vanish%20Away%21", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fstephen-colbert-vax-scene-dancing-drag-queens-covid-19-vaccinations-new-world-order-george-orwell-1984%2F&linkname=On%20The%20Fence%20About%20Taking%20The%20Vaccine%3F%20Watch%20Stephen%20Colbert%20And%20His%20Dancing%20Syringe%20Drag%20Queens%20Do%20The%20%E2%80%98Vax%20Scene%E2%80%99%20And%20Your%20Doubts%20Will%20Vanish%20Away%21", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fstephen-colbert-vax-scene-dancing-drag-queens-covid-19-vaccinations-new-world-order-george-orwell-1984%2F&linkname=On%20The%20Fence%20About%20Taking%20The%20Vaccine%3F%20Watch%20Stephen%20Colbert%20And%20His%20Dancing%20Syringe%20Drag%20Queens%20Do%20The%20%E2%80%98Vax%20Scene%E2%80%99%20And%20Your%20Doubts%20Will%20Vanish%20Away%21", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fstephen-colbert-vax-scene-dancing-drag-queens-covid-19-vaccinations-new-world-order-george-orwell-1984%2F&linkname=On%20The%20Fence%20About%20Taking%20The%20Vaccine%3F%20Watch%20Stephen%20Colbert%20And%20His%20Dancing%20Syringe%20Drag%20Queens%20Do%20The%20%E2%80%98Vax%20Scene%E2%80%99%20And%20Your%20Doubts%20Will%20Vanish%20Away%21", "https://www.addtoany.com/share", "https://www.nowtheendbegins.com/product/foxes-book-of-martyrs/", "https://www.independent.co.uk/arts-entertainment/tv/news/jimmy-kimmel-blackface-hiatus-snoop-dogg-christmas-oprah-man-show-a9580496.html", "https://www.goodreads.com/work/quotes/153313", "https://www.nowtheendbegins.com/unfunny-host-daily-show-trevor-noah-calls-for-death-of-21-million-floridians-after-state-returns-historic-win-for-president-trump/", "https://www.nowtheendbegins.com/product/foxes-book-of-martyrs/", "https://t.co/fa98vRrcRj", "https://twitter.com/DailyCaller/status/1443037724529811456?ref_src=twsrc%5Etfw", "https://www.msn.com/en-us/news/us/youtube-is-banning-prominent-anti-vaccine-activists-and-blocking-all-anti-vaccine-content/ar-AAOXmdF", "https://waygiver.com/campaigns/1486", "https://www.nowtheendbegins.com/product-category/gospel-tracts/", "https://www.nowtheendbegins.com/subscribe-to-nteb-daily-prophecy-updates/", "https://www.facebook.com/NowTheEndBegins/", "https://twitter.com/nowtheendbegins", "https://waygiver.com/campaigns/1486"], "authors": ["Geoffrey Grider"], "publish_date": "2021-09-29T19:56:21+00:00"}