{"result_id": "227034", "URL": "https://www.nowtheendbegins.com/two-senior-fda-decision-makers-resign-over-biden-administration-vaccine-booster-shots-covid-theater/", "timestamp": "2023-04-25 16:40:10 CEST+0200", "meta": {"description": "Two senior FDA officials have resigned over frustrations with Biden administration’s plans for COVID-19 booster shots without their prior approval", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/two-senior-fda-decision-makers-resign-over-biden-administration-vaccine-booster-shots-covid-theater/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "Stunning Upset At FDA As Two Top Vaccine Decision Makers Resign Due To Vast Booster Shot Overreach By CDC And Biden Administration Actors", "cleaned_text": "Two senior FDA officials have resigned from their positions within the US Food and Drug Administration over frustrations with the Biden administration’s plans to move forward with recommending COVID-19 booster shots without their prior approval, according to a report.\n\nLike we have told you from the beginning, COVID-19 is a real virus, and does real damage to real people, do your very best not to catch it. That said, everything surrounding COVID-19 has been politicized and weaponized to beat you into submission to the New World Order. Today the façade of all the COVID theater crumbled just a little bit more as two top FDA vaccine leaders have resigned over massive disagreements regarding COVID-19 booster shots with the CDC and the Biden Administration.\n\n“And ye shall know the truth, and the truth shall make you free.” John 8:32 (KJB)\n\nDirector of the FDA’s Office of Vaccines Research & Review Marion Gruber and OVRR deputy director Phil Krause are not the first people to resign over decisions made by the CDC and the Biden administration over the COVID-19 vaccine. As much as the government tries to present a united face, the fact is that there is an agenda being pushed and the people who still have a conscience are refusing to keep working there. 6 people so far have quit because of the decisions of the CDC over the COVID-19 vaccine.\n\n“Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.” John 14:6 (KJB)\n\nThere is no set of circumstances that could exist to make me agree to take a flu shot, just as there are no circumstances that could exist that would make me agree to take the COVID-19 vaccine. I have prayed about it, and fully trust God, my Great Physician, to keep me alive or take me Home, just as He has done for me these past 60 years. Note to self – never change horses in the midst of a battle! If you’re saved, then pray and ask the Holy Spirit to lead and guide you, just as I have done. If you’re lost, roll the dice and hope for the best. But either way, use your brain and research all this for yourself, and if you look hard enough the truth will find you. Jesus Christ is the Truth.\n\nFROM THE NY POST: Director of the FDA’s Office of Vaccines Research & Review Marion Gruber and OVRR deputy director Phil Krause are set to leave the agency this fall, with sources telling Politico that the two officials were at odds with the FDA’s top vaccine official Peter Marks and discontent with the Centers for Disease Control and Prevention and Advisory Committee on Immunization Practices role in decisions they believed should be handled by the FDA.\n\nAccording to trade publication Endpoints, the officials felt they were sidelined in major decisions, felt the administration’s plan for boosters was jumping the gun, and that Marks should have pushed for the FDA to have more autonomy on the matter.\n\nMarks played a leading role in helping the administration craft its August announcement of calls for an additional vaccine for most adults following an eight-month period. Marks announced the resignations in a letter to colleagues obtained by Endpoints.\n\n“The administration’s booster plan; it wasn’t the FDA’s booster plan,” University of Pennsylvania infectious disease expert Paul Offit, who serves on FDA’s vaccine advisory committee, told Politico. “The administration has kind of backed themselves up against the wall a little bit here.”\n\nActing FDA Commissioner Janet Woodcock sent a memo to regulators on Tuesday standing by the booster timeline, stating, “The issues are complex and the days are long, but please know the work you all have done to date and will continue to do in the days, weeks and months ahead, will hopefully one day allow us to fully put Covid-19 behind us and better prepare us for future challenges.”\n\nAnd Jeff Zients, the Biden administration’s coronavirus czar, also defended the booster timeline.\n\n“The booster decision was made by and announced by the nation’s leading public health officials… and as our medical experts laid out having reviewed all the available data, it is in their clinical judgment that it’s time to prepare Americans for a booster shot. We announced our approach to stay ahead of the virus and to be transparent on latest data,” he said in a statement to Politico. READ MORE\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last Days before the Rapture of the Church\n• HOW TO DONATE: Click here to view our WayGiver Funding page When you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. Even all the way to South Africa. We even restarted our weekly radio Bible study on Sunday nights again, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing. But whatever you do, don’t do nothing. Time is short and we need your help right now. If every one of the 15,860+ people on our daily mailing list gave $4.50, we would reach our goal immediately. If every one of our 150,000+ followers on Facebook gave $1.00 each, we would reach 300% of our goal. The same goes for our 15,900 followers on Twitter. But sadly, many will not give, so we need the ones who can and who will give to be generous. As generous as possible. “Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV)\n• HOW TO DONATE: Click here to view our WayGiver Funding page", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2021/09/senior-fda-leaders-stepping-down-as-covid-19-theater-vaccination-booster-shot-controversy-rages-marion-gruber-phil-krause-vaccines-mandatory.jpg", "url": "https://www.nowtheendbegins.com/two-senior-fda-decision-makers-resign-over-biden-administration-vaccine-booster-shots-covid-theater/", "title": "Stunning Upset At FDA As Two Top Vaccine Decision Makers Resign Due To Vast Booster Shot Overreach By CDC And Biden Administration Actors", "description": "Two senior FDA officials have resigned over frustrations with Biden administration’s plans for COVID-19 booster shots without their prior approval", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2021-09-01T19:51:15+00:00", "article:modified_time": "2021-09-01T22:13:26+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["Booster Shots", "Fauci", "FDA", "Biden administration", "Food and Drug Administration", "COVID-19 Vaccine"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/XDb6bcnx0E0\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/XDb6bcnx0E0"}], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Ftwo-senior-fda-decision-makers-resign-over-biden-administration-vaccine-booster-shots-covid-theater%2F&linkname=Stunning%20Upset%20At%20FDA%20As%20Two%20Top%20Vaccine%20Decision%20Makers%20Resign%20Due%20To%20Vast%20Booster%20Shot%20Overreach%20By%20CDC%20And%20Biden%20Administration%20Actors", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Ftwo-senior-fda-decision-makers-resign-over-biden-administration-vaccine-booster-shots-covid-theater%2F&linkname=Stunning%20Upset%20At%20FDA%20As%20Two%20Top%20Vaccine%20Decision%20Makers%20Resign%20Due%20To%20Vast%20Booster%20Shot%20Overreach%20By%20CDC%20And%20Biden%20Administration%20Actors", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Ftwo-senior-fda-decision-makers-resign-over-biden-administration-vaccine-booster-shots-covid-theater%2F&linkname=Stunning%20Upset%20At%20FDA%20As%20Two%20Top%20Vaccine%20Decision%20Makers%20Resign%20Due%20To%20Vast%20Booster%20Shot%20Overreach%20By%20CDC%20And%20Biden%20Administration%20Actors", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Ftwo-senior-fda-decision-makers-resign-over-biden-administration-vaccine-booster-shots-covid-theater%2F&linkname=Stunning%20Upset%20At%20FDA%20As%20Two%20Top%20Vaccine%20Decision%20Makers%20Resign%20Due%20To%20Vast%20Booster%20Shot%20Overreach%20By%20CDC%20And%20Biden%20Administration%20Actors", "https://www.addtoany.com/share", "https://www.nowtheendbegins.com/eternal-life-through-the-blood-of-jesus-christ-is-a-free-gift/", "https://www.nowtheendbegins.com/anthony-fauci-azt-aids-scandal-nih-national-institute-of-health-quack-doctor-covid-19-vaccine-wear-a-mask/", "https://www.politico.com/news/2021/08/31/biden-booster-plan-fda-508149", "https://endpts.com/breaking-in-a-major-blow-to-vaccine-efforts-senior-fda-leaders-stepping-down-report/", "https://endpts.com/breaking-in-a-major-blow-to-vaccine-efforts-senior-fda-leaders-stepping-down-report/", "https://nypost.com/2021/09/01/two-senior-fda-officials-resign-over-biden-administration-booster-shot-plan/", "https://waygiver.com/campaigns/1486", "https://www.nowtheendbegins.com/product-category/gospel-tracts/", "https://www.nowtheendbegins.com/subscribe-to-nteb-daily-prophecy-updates/", "https://www.facebook.com/NowTheEndBegins/", "https://twitter.com/nowtheendbegins", "https://waygiver.com/campaigns/1486"], "authors": ["Geoffrey Grider"], "publish_date": "2021-09-01T19:51:15+00:00"}