{"result_id": "227018", "URL": "https://www.nowtheendbegins.com/uk-191832-individual-adverse-events-including-blindness-deafness-after-receiving-mrna-covid-vaccine-jab/", "timestamp": "2023-04-25 16:39:00 CEST+0200", "meta": {"description": "In the U.K., 35 cases of deafness and 25 cases of blindness have been reported by people who have taken the experimental mRNA COVID-19 vaccines.", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/uk-191832-individual-adverse-events-including-blindness-deafness-after-receiving-mrna-covid-vaccine-jab/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "In the UK, 191,832 Individual Adverse Events Including Blindness And Deafness Have Been Reported After Receiving The mRNA COVID Vaccine Jab", "cleaned_text": "Among people in the U.K., 35 cases of deafness and 25 cases of blindness have been reported by people who have taken the experimental mRNA COVID-19 vaccines.\n\nAre you starting to see just how dangerous these jabs really are? Coming up on a quarter of a million people in the UK who have and are experiencing adverse reactions to the mRNA vaccine including dozens of cases of blindness and deafness. What if that was you who got the jab and now find yourself blind? Is it worth it to lose your eyes to have marginal protection from a virus with a 99% recovery rate?\n\n“So they poured out for the men to eat. And it came to pass, as they were eating of the pottage, that they cried out, and said, O thou man of God, there is death in the pot. And they could not eat thereof.” 2 Kings 4:40 (KJB)\n\nRemember, this is just the tip of the iceberg, it is only going to get much worse from here. On top of all that, no one knows the long-term effects of injecting an mRNA vaccine into a human body, those studies have never been done and that’s why this type of vaccine has never been approved for human use. And it is still not approved now outside of emergency use, so you need to think about that as well. This is not conspiracy theory, these are the facts on the ground.\n\nFROM LIFE SITE NEWS: The numbers are derived from the U.K. Yellow Card vaccine reporting scheme, which is the British equivalent to the American Centers for Disease Control and Prevention’s (CDC) Vaccine Adverse Event Reporting System (VAERS).\n\nBoth the Pfizer/BioNTech and Oxford/AstraZeneca mRNA COVID vaccines were given temporary authorization in the U.K. by the Medicines and Healthcare products Regulatory Agency (MHRA), the former in mid-December 2020, and the latter at the beginning of January 2021. Since then, the Yellow Card scheme has flagged a combined 191,832 individual adverse events, or side effects, of varying degrees of injury. Of the injuries recorded, AstraZeneca’s vaccine consistently performed the worst, accounting for 60% of all adverse events, and 58% of deaf and blind reports. Additionally, of the 402 fatalities, 197 were reported following use of the Pfizer formula, and 205 after taking AstraZeneca’s vaccine.\n\nThe regulator doubled down on supporting the jabs, stating that the “expected benefits of the vaccines in preventing COVID-19 and serious complications associated with COVID-19 far outweigh any currently known side effects,” including deafness, blindness, and death.\n\nThe MHRA justified this position by citing the passively analytical nature of recordings on the Yellow Card scheme: It is a self-reporting system. This means that none of the serious injuries, or even the deaths, are confirmed by a licensed doctor, giving the MHRA some leeway to declare that “the available evidence does not currently suggest that the vaccine caused the event.” Rather, the MHRA favors use of the term “temporally-related” to describe the succession of adverse events from injection with the vaccine, which they describe as “events occurring following vaccination but may or may not be caused by the vaccine.”\n\nA pattern of adverse results has been established regarding use of the Pfizer vaccine, which can be seen by examining its use in the U.S., following the award of “Emergency Use Authorization” by the Food and Drug Administration (FDA) in December. In both the U.K. and the U.S., use of the Pfizer vaccine has brought about similar results, accounting for the majority of post-vaccination injuries in America. VAERS has recorded 19,907 cases of adverse events arising after taking a COVID-19 vaccine, 64% of which are linked to Pfizer’s mRNA vaccine, and 36% attributable to Moderna’s equivalent jab.\n\nIn the U.S., VAERS reported 23 cases of complete deafness and 27 of unilateral deafness, with Pfizer’s jab making up 76% of complaints. Additionally there have been 29 cases of partial or complete blindness, over half of which followed the Pfizer vaccine. READ MORE\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last Days before the Rapture of the Church\n• HOW TO DONATE: Click here to view our WayGiver Funding page When you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. Even all the way to South Africa. We even restarted our weekly radio Bible study on Sunday nights again, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing. But whatever you do, don’t do nothing. Time is short and we need your help right now. If every one of the 15,860+ people on our daily mailing list gave $4.50, we would reach our goal immediately. If every one of our 150,000+ followers on Facebook gave $1.00 each, we would reach 300% of our goal. The same goes for our 15,900 followers on Twitter. But sadly, many will not give, so we need the ones who can and who will give to be generous. As generous as possible. “Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV)\n• HOW TO DONATE: Click here to view our WayGiver Funding page", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2021/03/pfizer-biontech-moderna-astrazeneca-mrna-covid-19-vaccine-adverse-reactions-yellow-card.jpg", "url": "https://www.nowtheendbegins.com/uk-191832-individual-adverse-events-including-blindness-deafness-after-receiving-mrna-covid-vaccine-jab/", "title": "In the UK, 191,832 Individual Adverse Events Including Blindness And Deafness Have Been Reported After Receiving The mRNA COVID Vaccine Jab", "description": "In the U.K., 35 cases of deafness and 25 cases of blindness have been reported by people who have taken the experimental mRNA COVID-19 vaccines.", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2021-03-09T01:33:45+00:00", "article:modified_time": "2021-03-09T16:40:43+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["Vaccine", "Adverse Reactions", "mRNA", "COVID Jab"], "tweets": [], "movies": [], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fuk-191832-individual-adverse-events-including-blindness-deafness-after-receiving-mrna-covid-vaccine-jab%2F&linkname=In%20the%20UK%2C%20191%2C832%20Individual%20Adverse%20Events%20Including%20Blindness%20And%20Deafness%20Have%20Been%20Reported%20After%20Receiving%20The%20mRNA%20COVID%20Vaccine%20Jab", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fuk-191832-individual-adverse-events-including-blindness-deafness-after-receiving-mrna-covid-vaccine-jab%2F&linkname=In%20the%20UK%2C%20191%2C832%20Individual%20Adverse%20Events%20Including%20Blindness%20And%20Deafness%20Have%20Been%20Reported%20After%20Receiving%20The%20mRNA%20COVID%20Vaccine%20Jab", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fuk-191832-individual-adverse-events-including-blindness-deafness-after-receiving-mrna-covid-vaccine-jab%2F&linkname=In%20the%20UK%2C%20191%2C832%20Individual%20Adverse%20Events%20Including%20Blindness%20And%20Deafness%20Have%20Been%20Reported%20After%20Receiving%20The%20mRNA%20COVID%20Vaccine%20Jab", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fuk-191832-individual-adverse-events-including-blindness-deafness-after-receiving-mrna-covid-vaccine-jab%2F&linkname=In%20the%20UK%2C%20191%2C832%20Individual%20Adverse%20Events%20Including%20Blindness%20And%20Deafness%20Have%20Been%20Reported%20After%20Receiving%20The%20mRNA%20COVID%20Vaccine%20Jab", "https://www.addtoany.com/share", "https://www.nowtheendbegins.com/messenger-33-covid-19-coronavirus-vaccine-mark-of-the-beast-buying-selling-666-nteb/", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://www.lifesitenews.com/news/uk-data-show-402-reports-of-deaths-following-covid-vaccines", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/964207/COVID-19_mRNA_Pfizer-_BioNTech_Vaccine_Analysis_Print__1_.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/964208/COVID-19_AstraZeneca_Vaccine_Analysis_Print__2_.pdf", "https://www.lifesitenews.com/news/uk-data-show-402-reports-of-deaths-following-covid-vaccines", "https://medalerts.org/vaersdb/findfield.php", "https://medalerts.org/vaersdb/findfield.php", "https://medalerts.org/vaersdb/findfield.php", "https://www.lifesitenews.com/news/uk-35-people-deaf-and-25-blind-after-taking-mrna-vaccine-shots", "https://waygiver.com/campaigns/1486", "https://www.nowtheendbegins.com/nteb-gospel-tracts/", "https://www.nowtheendbegins.com/subscribe-to-nteb-daily-prophecy-updates/", "https://www.facebook.com/NowTheEndBegins/", "https://twitter.com/nowtheendbegins", "https://waygiver.com/campaigns/1486"], "authors": ["Geoffrey Grider"], "publish_date": "2021-03-09T01:33:45+00:00"}