{"result_id": "227015", "URL": "https://www.nowtheendbegins.com/christians-seeking-covid-19-religious-exemption-will-be-easy-to-identify-round-up/", "timestamp": "2023-04-25 16:38:48 CEST+0200", "meta": {"description": "Religious Exemption makes rounding up all the unvaccinated Christians to place them in concentration camps on Bill Gates farmland super easy.", "lang": "en", "keywords": "", "favicon": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2020/04/cropped-nteb-site-icon-2020-new-logo-hi-res-32x32.png", "canonical": "https://www.nowtheendbegins.com/christians-seeking-covid-19-religious-exemption-will-be-easy-to-identify-round-up/", "encoding": "UTF-8"}, "image": null, "domain": "www.nowtheendbegins.com", "title": "They Will Use The COVID-19 Vaccine 'Religious Exemption' To Make It Easier To Identify The Body Of Christ When Time Comes For The Camps", "cleaned_text": "Religious exemptions, once used sparingly around the country to get exempted from various required vaccines, are becoming a much more widely used loophole against the mandated COVID-19 shot.\n\nChristians all across America are right now scrambling for what’s known as a ‘religious exemption’ which will allow them to not have to receive the COVID-19 vaccine injection based on their religious and spiritual beliefs. Christians think this a good thing, but hold on now, this may be exactly what the government is hoping you will do.\n\n“Then shall they deliver you up to be afflicted, and shall kill you: and ye shall be hated of all nations for my name’s sake.” Matthew 24:9 (KJB)\n\nAcross all of the liberal media news outlets right now, various commentators and pundits are calling for the unvaccinated to be removed from society, to be denied access to food, water, and emergency medical attention. At the highest levels of the American government, the order has already been given to start withholding life-saving medicine to people battling COVID. None of this is fear mongering or speculation, it is happening. Receiving a religious exemption tells the government that you identify with the Body Of Jesus Christ, you are putting yourself on a hit list of your own making. When it comes time for the unvaccinated to be removed, and Bill A416 is pending in New York State right now, rounding up all the unvaccinated Christians to place them in concentration camps located on Bill Gates 240,000 acres of farmland will be just as easy as shooting ducks in a barrel.\n\n“If thou hast run with the footmen, and they have wearied thee, then how canst thou contend with horses? and if in the land of peace, wherein thou trustedst, they wearied thee, then how wilt thou do in the swelling of Jordan?” Jeremiah 12:5 (KJB)\n\nOn a related side note, I have been receiving some feedback today about this afternoon’s Prophecy News Podcast, with some saying that I have “gone too far”, and that I am scaring people and should pull back. I would like to reply with the following two thoughts. The smartest thing that Albert Einstein ever came up with was not his Theory of General Relativity, E=mc2, or anything else from that fertile brain. No, the smartest thing that Einstein ever did was to flee Nazi Germany in 1932 while he could still get out. He was smart enough to read the ‘handwriting on the wall’ and do something about it. How about you, Christian? You say you are saved and believe the Bible, if so, then that makes you smarter than Einstein ever was. Don’t get mad at me for telling you the truth of what’s happening, do something about it.\n\nFROM THE ASSOCIATED PRESS: An estimated 2,600 Los Angeles Police Department employees are citing religious objections to try to get out of the required COVID-19 vaccination. In Washington state, thousands of state workers are seeking similar exemptions. And in Arkansas, a hospital has been swamped with so many such requests from employees that it is apparently calling their bluff.\n\nReligious objections, once used sparingly around the country to get exempted from various required vaccines, are becoming a much more widely used loophole against the COVID-19 shot. And it is only likely to grow following President Joe Biden’s sweeping new vaccine mandates covering more than 100 million Americans, including executive branch employees and workers at businesses with more than 100 people on the payroll.\n\nThe administration acknowledges that a small minority of Americans will use — and some may seek to exploit — religious exemptions. But it said it believes even marginal improvements in vaccination rates will save lives.\n\nIt is not clear how many federal employees have asked for a religious exemption, though union officials say there will be many requests. The Labor Department has said an accommodation can be denied if it causes an undue burden on the employer. In the states, mask and vaccine requirements vary, but most offer exemptions for certain medical conditions or religious or philosophical objections. The use of such exemptions, particularly by parents on behalf of their schoolchildren, has been growing over the past decade.\n\nA religious belief does not have to be recognized by an organized religion, and it can be new, unusual or “seem illogical or unreasonable to others,” according to rules laid out by the Equal Employment Opportunity Commission. But it can’t be founded solely on political or social ideas. That puts employers in the position of determining what is a legitimate religious belief and what is a dodge. Many major religious denominations have no objections to the COVID-19 vaccines. But the rollout has prompted heated debates because of the longtime role that cell lines derived from fetal tissue have played, directly or indirectly, in the research and development of various vaccines and medicines.\n\nRoman Catholic leaders in New Orleans and St. Louis went so far as to call Johnson & Johnson’s COVID-19 shot “morally compromised.” J&J has stressed that there is no fetal tissue in its vaccine. Moreover, the Vatican’s doctrine office has said it is “morally acceptable” for Catholics to receive COVID-19 vaccines that are based on research that used cells derived from aborted fetuses. Pope Francis himself has said it would be “suicide” not to get the shot, and he has been fully vaccinated with the Pfizer formula. READ MORE\n\nDon Lemon On The Unvaccinated: ‘Leave Them Behind’\n\nNow The End Begins is your front line defense against the rising tide of darkness in the last Days before the Rapture of the Church\n• HOW TO DONATE: Click here to view our WayGiver Funding page When you contribute to this fundraising effort, you are helping us to do what the Lord called us to do. The money you send in goes primarily to the overall daily operations of this site. When people ask for Bibles, we send them out at no charge. When people write in and say how much they would like gospel tracts but cannot afford them, we send them a box at no cost to them for either the tracts or the shipping, no matter where they are in the world. Even all the way to South Africa. We even restarted our weekly radio Bible study on Sunday nights again, thanks to your generous donations. All this is possible because YOU pray for us, YOU support us, and YOU give so we can continue growing. But whatever you do, don’t do nothing. Time is short and we need your help right now. If every one of the 15,860+ people on our daily mailing list gave $4.50, we would reach our goal immediately. If every one of our 150,000+ followers on Facebook gave $1.00 each, we would reach 300% of our goal. The same goes for our 15,900 followers on Twitter. But sadly, many will not give, so we need the ones who can and who will give to be generous. As generous as possible. “Looking for that blessed hope, and the glorious appearing of the great God and our Saviour Jesus Christ;” Titus 2:13 (KJV)\n• HOW TO DONATE: Click here to view our WayGiver Funding page", "opengraph": {"type": "article", "image": "https://t4x3y5r8.stackpathcdn.com/wp-content/uploads/2021/09/covid-19-vaccine-religious-exemption-to-trap-body-of-christ-bible-believing-christians-mark-beast-666.jpg", "url": "https://www.nowtheendbegins.com/christians-seeking-covid-19-religious-exemption-will-be-easy-to-identify-round-up/", "title": "They Will Use The COVID-19 Vaccine 'Religious Exemption' To Make It Easier To Identify The Body Of Christ When Time Comes For The Camps", "description": "Religious Exemption makes rounding up all the unvaccinated Christians to place them in concentration camps on Bill Gates farmland super easy.", "locale": "en_US", "site_name": "Now The End Begins", "article:publisher": "https://www.facebook.com/ntebministries/", "article:published_time": "2021-09-17T22:53:50+00:00", "article:modified_time": "2021-09-19T13:10:47+00:00", "image:width": "950", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["Bill Gates Farmland", "Albert Einstein", "Nazi Germany", "COVID vaccine", "Religious Exemption", "End times"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/_CKlomcUobI\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/_CKlomcUobI"}, {"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/_CIsbTia1cg\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/_CIsbTia1cg"}], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fchristians-seeking-covid-19-religious-exemption-will-be-easy-to-identify-round-up%2F&linkname=They%20Will%20Use%20The%20COVID-19%20Vaccine%20%E2%80%98Religious%20Exemption%E2%80%99%20To%20Make%20It%20Easier%20To%20Identify%20The%20Body%20Of%20Christ%20When%20Time%20Comes%20For%20The%20Camps", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fchristians-seeking-covid-19-religious-exemption-will-be-easy-to-identify-round-up%2F&linkname=They%20Will%20Use%20The%20COVID-19%20Vaccine%20%E2%80%98Religious%20Exemption%E2%80%99%20To%20Make%20It%20Easier%20To%20Identify%20The%20Body%20Of%20Christ%20When%20Time%20Comes%20For%20The%20Camps", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fchristians-seeking-covid-19-religious-exemption-will-be-easy-to-identify-round-up%2F&linkname=They%20Will%20Use%20The%20COVID-19%20Vaccine%20%E2%80%98Religious%20Exemption%E2%80%99%20To%20Make%20It%20Easier%20To%20Identify%20The%20Body%20Of%20Christ%20When%20Time%20Comes%20For%20The%20Camps", "https://www.addtoany.com/add_to/print?linkurl=https%3A%2F%2Fwww.nowtheendbegins.com%2Fchristians-seeking-covid-19-religious-exemption-will-be-easy-to-identify-round-up%2F&linkname=They%20Will%20Use%20The%20COVID-19%20Vaccine%20%E2%80%98Religious%20Exemption%E2%80%99%20To%20Make%20It%20Easier%20To%20Identify%20The%20Body%20Of%20Christ%20When%20Time%20Comes%20For%20The%20Camps", "https://www.addtoany.com/share", "https://www.nowtheendbegins.com/new-york-state-assembly-bill-a416-to-arrest-detain-people-with-communicable-diseases-place-in-fema-camps/", "https://www.nowtheendbegins.com/nteb-prophecy-news-podcast-eugenics-new-world-order-bill-gates-anthony-fauci-georgia-guidestones/", "https://www.britannica.com/biography/Albert-Einstein/Nazi-backlash-and-coming-to-America", "https://www.nowtheendbegins.com/bill-gates-becomes-americas-largest-farmland-owner-with-shock-purchase-of-242000-acres-food-production-or-anti-vaxxers-fema-camps/", "https://apnews.com/article/joe-biden-health-religion-los-angeles-arkansas-3ba53f2f00e1ab7105d7d128f2b1e65d", "https://waygiver.com/campaigns/1486", "https://www.nowtheendbegins.com/product-category/gospel-tracts/", "https://www.nowtheendbegins.com/subscribe-to-nteb-daily-prophecy-updates/", "https://www.facebook.com/NowTheEndBegins/", "https://twitter.com/nowtheendbegins", "https://waygiver.com/campaigns/1486"], "authors": ["Geoffrey Grider"], "publish_date": "2021-09-17T22:53:50+00:00"}