{"result_id": "229008", "URL": "https://nutritionfacts.org/video/social-distancing-lockdowns-testing-how-to-slow-the-covid-19-pandemic/", "timestamp": "2023-04-25 16:41:36 CEST+0200", "meta": {"description": "What can we learn from other countries and the 1918 pandemic to slow COVID-19?", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://nutritionfacts.org/video/social-distancing-lockdowns-testing-how-to-slow-the-covid-19-pandemic/", "encoding": "utf-8"}, "image": null, "domain": "nutritionfacts.org", "title": "Social Distancing, Lockdowns, and Testing: How to Slow the COVID-19 Pandemic", "cleaned_text": "Below is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video.\n\nI’ve talked about where the COVID-19 coronavirus came from, and how we might prevent such emergences from animals in the future, but now that it’s spreading human-to-human, what can we do about it?\n\nSocial distancing. That’s what each of us can do. Locking down cities, closing nonessential businesses, cancelling gatherings, and encouraging people to shelter-in-place at home are all old-school public health strategies to break every possible chain of transmission. China was condemned for its early response, sanctioning critics and denying the extent of the crisis (referring to it as “preventable and controllable”), similar to the response of other world leaders. But China was later lauded for that same authoritarian approach when it came to successfully enacting extreme quarantine measures. A top WHO official praised China’s efforts as “probably the most ambitious, and I would say, agile and aggressive disease containment effort in history.”\n\nIt was, however, too little, too late to contain the disease locally. By the time authorities banned travel out of Wuhan, more than a third of the fourteen million residents had already left the region, whether for the Chinese New Year holiday or to flee before the lockdown of the city went into effect on January 23. One could argue that had local officials not wasted weeks silencing whistleblowers and releasing fake reports, the world could have been spared this pandemic. But the aggressive actions China subsequently did take may have indeed bought us all some time.\n\nEnacting so-called wartime control measures, China initiated the largest community containment effort in history, affecting about three-quarters of a billion people. Borders were closed, cities were sealed off, and people were confined to their homes. Unlike so-called “lockdowns” other countries started instituting, like the U.S. that still allowed people to venture freely outside as long as they respected a certain personal distance, in China, citizens were totally restricted, with permission cards that only allowed them to leave their home every second day for a maximum of thirty minutes for essentials..The policy was criticized by human rights advocates, but it worked. The epidemic immediately started decelerating.\n\nChinese authorities achieved what many public health experts didn’t think was possible—the containment of the spread of a widely circulating respiratory infection. Within two months, Hubei Province, ground zero where the disease first emerged, reported its first day of no new local cases. “I will praise China again and again,” said the Director-General of the World Health Organization, “because its actions actually help in reducing the spread of [the novel] coronavirus to other countries.” “In many ways, China is actually setting a new standard for outbreak response.”\n\nOf course, the day Hubei Province reported no new cases, the world confirmed its 200,000th case. Would the rest of the world be willing to enact rules one global health policy specialist called “astounding, unprecedented, and medieval”? The command-and-control authority of the Chinese government allowed them to enforce a resource-intensive containment strategy that involved costs to trade, travel, and liberty that many doubted democracies would be able to stomach. Thankfully, successful strategies in countries such as South Korea showed that such draconian measures may not be necessary.\n\nAll of the nations that were able to get the disease under control quickly relied on a foundation of testing and tracing. In other words, identify all cases through mass testing, and then trace every possible contact each patient had, to break as many chains of transmission as possible through isolation and quarantine. South Korea had a test approved the first week of February, and, with enough testing, was able to bring the disease under control by the end of the month. With such expansive, well-organized testing, countries like South Korea were able to control the epidemic without resorting to locking down its populace. The World Health Organization took notice. “We have a simple message for all countries,” the Director-General declared, “Test, test, test.”\n\nThe United States did not appear to get the message in time. By mid-March, South Korea had already tested more than a quarter million of its citizens, more than five thousand out of every million, compared to fewer than a hundred per million in the United States. Hamstrung by FDA red tape and a series of blunders, sufficient U.S. testing capacity failed to materialize before the window on containment closed. It’s humbling to realize that the U.S. and South Korea recorded their first cases on the same day, yet the ensuing epidemics took very different courses.\n\nOnce containment fails, the strategy then shifts to suppression and mitigation. If you don’t know who’s infected, all you can do is try to prevent everyone from coming in contact with anyone. By April, most Americans were being told to stay home to try to curb the spread. As Dr. Fauci said at a press conference, “If it looks like you’re overreacting, you’re probably doing the right thing.”\n\nClosing nonessential businesses and encouraging people to stay inside to limit social contacts are efforts taken in an attempt to “flatten the curve” before it flattens us. Flatten the epidemic curve––in other words, to slow the spread of the illness to more evenly distribute the cases over time. This would give health systems time to scale up and respond effectively—not only to treat COVID-19, but to maintain overall care continuity. During the recent Ebola crisis in West Africa, for example, deaths increased from other causes as well, due to the saturation of the healthcare system (as well as the death of healthcare workers).\n\nSchool closures are more controversial, as they could threaten the availability of the 29 percent of healthcare providers in this country who live in households that would need to take care of young children. One model suggested that school closures might have to reduce COVID-19 cases by more than 25 percent to make up for the loss of healthcare workers in terms of an overall net reduction in COVID-19 mortality. A 25 percent drop may be achievable for pandemic influenza, a disease in which children may play a critical role in community transmission, but children don’t appear to be the main drivers of the transmission of COVID-19.\n\nUntil an effective vaccine is widely available, likely not until 2021 at the earliest, population lockdowns can help rob the virus of susceptible hosts. Once such measures are relaxed, though, the disease could come roaring back. In the pandemic of 1918, for example, some U.S. cities experienced a second peak in mortality following the lifting of social-distancing measures. Check out what happened in St. Louis. As soon as they detected a doubling of the baseline mortality, they instituted school closures and a ban on public gatherings. And you can see how they were successfully able to bend the curve. So they decided it was time to relax the social distancing, and they got a big spike in new cases that required a reinstitution of the shutdown measures.\n\nBut the important thing is they instituted the social distancing early, within days of their first case. Compare that to how Philadelphia reacted. It took them weeks to shut the city down, and they suffered the consequences. Here’s a graph of that double hump death rate in St. Louis, compared to what they suffered in Philadelphia. And here’s the mass graves they then had to dig in the city of brotherly love. It’s better to be six feet apart, than six feet under.\n\nBy periodically pumping the brake with flattening-the-curve strategies like shelter-in-place ordinances to slow community transmission, the hope is that we can turn the initial tidal wave of cases into a series of smaller successive waves our healthcare capability can more safely ride out. If not, more intensive care units in U.S. hospitals may become overwhelmed, just as they did in Italy, and doctors will have to make triage decisions as to who lives and who dies.\n\nTriage protocols have actually already been published. First in line for ventilators are those who are most likely to survive both in the short term and over the subsequent year. Then the priority goes to children and adults under the age of 50. Those 50 to 69 are in the next tier, followed by those aged 70 to 84, and, finally, lowest priority is given to patients 85 and older. If there’s a tie, life-saving ventilation may be allocated based on some form of lottery, like flipping a coin.\n\nIn the New England Journal of Medicine, a preeminent group of medical ethics experts wrote, “[W]e believe that removing a patient from a ventilator or an ICU bed to provide it to others in need is also justifiable and that patients should be made aware of this possibility when at admission [to the hospital,]” adding, “the decision to withdraw a scarce resource to save others is not an act of killing and does not require the patient’s consent.” Wow, can you imagine? To relieve the front-line clinicians of the burden, they suggest the designation of “triage officers” to make the decisions.\n\nThe countries that were able to mobilize the fastest and have been able to best control COVID-19 were those that had learned hard lessons from previous outbreaks. China, Hong Kong, Singapore, and Taiwan bear the memories of SARS. More recently, South Korea suffered a MERS outbreak in 2015, triggered by a businessman returning from the Middle East. The country’s test-and-trace infrastructures were therefore in place, and its populations primed to sacrifice for the promise of containment. If outbreaks involving dozens or even hundreds of deaths can rally countries to a state of pandemic preparedness, perhaps the thousands or even millions of deaths from COVID-19 will orient countries of the world to the mission of pandemic prevention. But first, what can each of us do individually to ride out the current pandemic? That’s what I’ll cover next.\n\nPlease consider volunteering to help out on the site.", "opengraph": {"video": "http://youtube.com/v/Sy_odMx_tV8", "video:type": "application/x-shockwave-flash", "video:duration": "732", "video:width": "640", "video:height": "360", "locale": "en_US", "title": "Social Distancing, Lockdowns, and Testing: How to Slow the COVID-19 Pandemic | NutritionFacts.org", "description": "What can we learn from other countries and the 1918 pandemic to slow COVID-19?", "url": "https://nutritionfacts.org/video/social-distancing-lockdowns-testing-how-to-slow-the-covid-19-pandemic/", "image": "https://nutritionfacts.org/app/themes/sage/dist/images/default-image.png", "type": "video.other", "twitter:player": "http://youtube.com/v/Sy_odMx_tV8"}, "tags": ["respiratory infections", "children", "zoonotic disease", "Africa", "FDA", "COVID-19", "World Health Organization", "pandemics", "China", "lung health", "vaccines", "Asia", "coronavirus", "viral infections", "Volume 50Cov", "mortality"], "tweets": [], "movies": [], "links": ["https://nutritionfacts.org/volunteer"], "authors": [], "publish_date": "June 17, 2020"}