{"result_id": "229027", "URL": "https://nutritionfacts.org/video/r0-and-incubation-periods-how-other-coronavirus-outbreaks-were-stopped/", "timestamp": "2023-04-25 16:41:59 CEST+0200", "meta": {"description": "Why can’t we stop COVID-19 like we stopped SARS and MERS, the other two 21st century coronavirus outbreaks?", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://nutritionfacts.org/video/r0-and-incubation-periods-how-other-coronavirus-outbreaks-were-stopped/", "encoding": "utf-8"}, "image": null, "domain": "nutritionfacts.org", "title": "R0 and Incubation Periods: How Other Coronavirus Outbreaks Were Stopped", "cleaned_text": "Below is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video.\n\nI’ve talked about the emergence of other deadly coronavirus outbreaks like SARS and MERS. How were we able to get them under control?\n\nMERS could be stopped because of its relatively low “basic reproduction number,” abbreviated as R with a little subscript zero. (That’s the R naught you may have heard about.) The reason they call it the reproduction number is because the concept goes back to the study of human population growth, like the number of daughters, on average, each woman had. But in infectious disease, it represents the number of people a single infected individual is expected to pass the disease along to in a susceptible population, so R is a measure of how contagious a new pathogen is.\n\nFor the MERS coronavirus––the Middle East Respiratory Syndrome virus––the R was only about 1; so, each MERS patient tended to transmit the disease to only one other person. You can imagine how much easier a disease like that can be stopped, compared to a virus with the potential to spread exponentially—viruses like the SARS or COVID-19 coronaviruses, with an R of 2 or greater.\n\nIn the case of a virus with an R of 2, for example, unless stopped, one infected person could become two, then four, then eight, and so on.\n\nThe coronavirus that causes COVID-19 may indeed be able to latch onto receptors in the human respiratory tract better than the coronavirus that causes SARS, and also replicate better in the upper airways than SARS. But the primary reason there were more COVID-19 cases in the first month after it was reported than SARS ever did revolves less around how contagious it is, and more around when it is contagious.\n\nThe three characteristics of microbes most likely to cause pandemics are: novelty, a new pathogen, so there’s no pre-existing immunity; respiratory spread (I mean pneumonia is humanity’s fourth leading killer, even outside a pandemic); and the third characteristic for optimal pandemic potential is transmission before symptom onset.\n\nThe last four pandemics of respiratory disease were caused by new flu viruses, originating from bird flu and swine flu viruses, each of which fit all three of those criteria. SARS, however, was not considered a pandemic, despite spreading to twenty-nine countries and regions. Why did the World Health Organization (WHO) only consider SARS a “Public Health Emergency of International Concern,” and how were we able to stop it within just a few months at only around 8,000 cases and 800 deaths? It was a brand new virus, spread via respiratory droplets, but SARS lacked the third necessary characteristic: significant spread before symptoms arise.\n\nFor SARS, the average incubation period—the time between first becoming unwittingly infected after exposure to the virus, and first coming down with symptoms—was around five days, similar to COVID-19. But it took another six to eleven days, however, for SARS viral loads to fully ramp up in upper respiratory tract secretions coughed or sneezed from one person to the next. So, even after falling ill, patients with SARS weren’t very infectious in the first five days or so of the illness. Since viral loads peaked about ten days after people started feeling sick, after they knew they had it, you can see how human-to-human transmission could be stopped if patients could be isolated within the first few days after the onset of symptoms. And that’s exactly what happened. A massive international effort spearheaded by the WHO was able to identify all of the cases by their symptoms, isolate the patients, and trace all their contacts. That’s how we were able to effectively eradicate smallpox from the planet too, (with a vaccine) in the same way. Smallpox was also only contagious after you knew who had it.\n\nSo, fever screening at airports helped stop the global spread of SARS in its tracks. You didn’t become particularly infectious until after symptoms started—and, 100 percent of SARS patients developed a fever. In a way, SARS was a disease designed to be stopped. With MERS, 98 percent of the patients became febrile (meaning have a fever). In the case of COVID-19, though, as many as 36 percent—more than one in three—do not present with fever, a nice objective symptom, at the onset of symptoms. And, more seriously, patients may be infectious during the incubation period without any symptoms at all.\n\nIn fact, the viral load in an asymptomatic patient with COVID-19 was found to be similar to that of symptomatic patients, with as many as 15 million viral copies within every quarter teaspoon of snot. Same amount of virus in symptomatic snot—taken from someone who’s just turned sick—compared to asymptomatic snot. Spewing just as much virus right before you get sick.\n\nWith COVID-19, you can feel perfectly fine, no symptoms at all, but actually have the disease and spread the disease before the first cough––before you get a fever or any symptoms. It’s the same thing with the flu. That’s how new flu viruses can trigger pandemics, too. Like the flu, you can potentially spread COVID-19 before you know you have it, even while you’re feeling perfectly fine. That’s a disease that’s hard to stop. To slow the spread of that kind of disease, where you don’t know who’s infectious and who’s not, you have to try isolating everyone. That’s where social distancing measures are required.\n\nPlease consider volunteering to help out on the site.", "opengraph": {"video": "http://youtube.com/v/gxiTR_lTts0", "video:type": "application/x-shockwave-flash", "video:duration": "400", "video:width": "640", "video:height": "360", "locale": "en_US", "title": "R0 and Incubation Periods: How Other Coronavirus Outbreaks Were Stopped | NutritionFacts.org", "description": "Why can’t we stop COVID-19 like we stopped SARS and MERS, the other two 21st century coronavirus outbreaks?", "url": "https://nutritionfacts.org/video/r0-and-incubation-periods-how-other-coronavirus-outbreaks-were-stopped/", "image": "https://nutritionfacts.org/app/themes/sage/dist/images/default-image.png", "type": "video.other", "twitter:player": "http://youtube.com/v/gxiTR_lTts0"}, "tags": ["respiratory infections", "zoonotic disease", "COVID-19", "fever", "World Health Organization", "pandemics", "China", "lung health", "Asia", "coronavirus", "viral infections", "Volume 50Cov"], "tweets": [], "movies": [], "links": ["https://nutritionfacts.org/volunteer"], "authors": [], "publish_date": "June 15, 2020"}