{"result_id": "229014", "URL": "https://nutritionfacts.org/video/mercury-in-vaccinations-vs-tuna-2/", "timestamp": "2023-04-25 16:41:43 CEST+0200", "meta": {"description": "Balancing the risks and benefits of fish consumption.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://nutritionfacts.org/video/mercury-in-vaccinations-vs-tuna-2/", "encoding": "utf-8"}, "image": null, "domain": "nutritionfacts.org", "title": "Mercury in Vaccinations vs. Tuna", "cleaned_text": "There have been been dozens of these risk-benefit analyses lately, looking at the nutrient and contaminant tradeoffs for fish. Now, fish consumption provides nutrients, but all fish also provide methylmercury, a known neurotoxin. The more fish we eat, the more omega–3s we get, but the more fish we eat, the more mercury we get, too. Mercury is a cardiac toxin as well. So, while fish omega–3s are decreasing our risk of a heart attack, the mercury in that same fish is increasing our risk of having a heart attack. So, studies like this look through the various species. Salmon has less mercury than tuna, but tuna has less dioxin. As I mentioned last year, the only truly healthy fish in the world would be made out of dark green leafy vegetables.\n\nOnce upon a time, routine childhood vaccinations used a mercury-containing preservative called thimerisol. I was always surprised by parents who fed their kids tuna—yet, didn’t want vaccinations, because they didn’t want to expose their children to mercury. Eating a single serving of tuna, which is about half a can, is equivalent to getting injected with how many thimerisol-containing vaccines? One…hundred! A single serving of canned tuna.\n\nSure, dietary exposure to mercury may harm child development, but if we cut down on fish, the argument goes, we may get fewer omega-3s. So, these researchers got out their calculators, and in a city about the size of New York, if pregnant mothers ate lots of fish, because omega-3s like DHA are so beneficial to brain development, we would expect to see an improvement in 209,000 years of children’s lives (what are called quality-adjusted life years). But, at the same time, the mercury in that very same fish would damage 203,000 of children’s life years. So, they do the math; it comes out positive by a hair, and we hear on the news such and such medical authority says the benefits outweigh the risks: eat fish.\n\nNow, of course, this does not take into account the dioxins, the PCBs, which tip the scale the other way. But, more importantly, why accept any risk at all? By getting DHA from plant sources, we can get all the benefit, with none of the risks. All the benefit, without the hundreds of thousands of life years of brain damage.\n\nThis isn’t unlike the dairy and calcium thing. Every time they come out with yet another study linking dairy consumption with something bad—cancer, Parkinson’s—they get out of saying “stop drinking milk” by ending the article with something like: “But one has to balance the risk of cancer, or diabetes (or whatever) with the risk of not getting enough calcium.” As if the only source of calcium on the planet were dairy. Where do you think the cows get it from in the first place? Plants. And, the same thing with omega-3s like DHA. Where do you think the fish get it from? Plants. And, we can, too—tiny little plants called golden algae.\n\nTo see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video. This is just an approximation of the audio contributed by Dianne Moore.\n\nPlease consider volunteering to help out on the site.", "opengraph": {"video": "http://youtube.com/v/6e9zPZhoD7k", "video:type": "application/x-shockwave-flash", "video:duration": "230", "video:width": "640", "video:height": "360", "locale": "en_US", "title": "Mercury in Vaccinations vs. Tuna | NutritionFacts.org", "description": "Balancing the risks and benefits of fish consumption.", "url": "https://nutritionfacts.org/video/mercury-in-vaccinations-vs-tuna-2/", "image": "https://nutritionfacts.org/app/themes/sage/dist/images/default-image.png", "type": "video.other", "twitter:player": "http://youtube.com/v/6e9zPZhoD7k"}, "tags": ["persistent organic pollutants", "pregnancy", "fish", "supplements", "neurotoxins", "seafood", "infants", "brain health", "algae", "tuna", "Volume 2", "cardiovascular disease", "heart disease", "PCBs", "fish oil", "children", "industrial pollutants", "mercury", "DHA", "dioxins", "vaccines", "salmon"], "tweets": [], "movies": [], "links": ["https://nutritionfacts.org/volunteer"], "authors": [], "publish_date": "September 11, 2008"}