{"result_id": "229025", "URL": "https://nutritionfacts.org/video/modifiable-risk-factors-and-comorbidities-for-severe-covid-19-infection/", "timestamp": "2023-04-25 16:41:57 CEST+0200", "meta": {"description": "There are things you can do right now to reduce your risk of falling seriously ill and dying from this disease.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://nutritionfacts.org/video/modifiable-risk-factors-and-comorbidities-for-severe-covid-19-infection/", "encoding": "utf-8"}, "image": null, "domain": "nutritionfacts.org", "title": "Modifiable Risk Factors and Comorbidities for Severe COVID-19 Infection", "cleaned_text": "Below is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video.\n\nThe severity of COVID-19 varies widely based on pre-existing conditions. Those with high blood pressure are at twice the odds of suffering a severe course, and those with cardiovascular disease have three times the odds. What’s more, those with either condition are about four times more likely to end up in the ICU. Those with COPD—chronic obstructive pulmonary diseases, like emphysema—appear to be at the highest risk, with six times the odds of a severe course for COVID-19, and nearly eighteen times the odds of an admission to the intensive care unit.\n\nWe know that exposure to air pollution can increase susceptibility to respiratory viral infections, and that may be the case with COVID-19 as well, as higher pollutant levels appeared to be correlated with pandemic deaths. But just as air pollution may influence COVID-19, COVID-19 may be influencing air pollution. Check out this satellite data from NASA. This is nitrogen dioxide pollutant levels before the pandemic, then after lockdown. Here’s what ground zero, Wuhan province, looked like at around this time last time last year, and then post-pandemic. Ready for some irony? The decrease in air pollution following the quarantine is so great that the COVID-19 pandemic might paradoxically have decreased the total number of deaths by drastically decreasing the number of fatalities due to air pollution, averting as many as 30,000 deaths a month in China. In other words, the air quality in China was so bad that COVID-19 may have ended up saving lives—like 1,000 lives a day!\n\nA history of smoking is a risk factor for disease progression, though, surprisingly, active smoking may or may not be. This seeming paradox may provide a clue as to why those with high blood pressure appear to be at higher risk.\n\nIt’s easy to imagine why those with heart disease are at higher risk of crashing from COVID-19. Even without direct heart damage, lung infections can put a tremendous strain on the heart. Up to nearly 30 percent of patients hospitalized for regular pneumonia develop cardiovascular complications. About one in 35 suffer cardiac arrest, and those who don’t are still at four times higher risk of a heart attack or stroke within the first 30 days after being released from the hospital. Okay, but why is just having high blood pressure a COVID-19 severity risk factor?\n\nUnder certain circumstances, those hospitalized for regular pneumonia with hypertension may do even better. Investigators speculated this may be due to the anti-inflammatory effects of a common class of high blood-pressure drugs called ACE inhibitors (like lisinopril, for which there are more than a hundred million prescriptions dispensed annually in the United States alone). Super common drugs. And, indeed, people on those drugs not only appear to be less likely to die of pneumonia, but they seem to be less likely to even get pneumonia in the first place. Ironically, this same reason why those with hypertension may be protected from regular pneumonia may also be the reason why those with hypertension are at greater risk from COVID-19.\n\nACE-inhibitor drugs may be anti-inflammatory, but they may also upregulate the expression of ACE2, which, as you may remember, is the enzyme the COVID-19 virus spike protein latches onto in our lungs to infect our cells and spread. So, perhaps the reason those with hypertension seem to be doing worse is that so many of them are on this class of drugs, which may be making them more susceptible to viral attack.\n\nACE2 expression is increased in some of these comorbid conditions, but the drug connection has yet to be verified. So, more evidence is urgently needed to confirm the relation—if any—between these high blood-pressure drugs and COVID-19. In the meanwhile, here’s a flow chart that can help guide your doctor. Should we be holding all the ACEs? Well certainly, those on these drugs for heart failure or severe or uncontrolled hypertension should continue on these drugs. (When ICUs are overwhelmed is definitely not the time to have a stroke.) However, the majority of people taking these drugs do so for treating well-managed mild hypertension, and for these patients, physicians may want to consider temporarily discontinuing them for those at high risk of contracting COVID-19, until we know more. As always, you should never just change or stop taking medications on your own without guidance from your prescribing practitioner.\n\nThose of you who follow me on social media know that early on I recommended that people consider not taking ibuprofen unnecessarily, as it is another drug thought to boost ACE2 expression. While the concern again remains theoretical, no drug is completely benign. (NSAID drugs like ibuprofen cause intestinal lining damage in as many as 80 percent of users, for example.) So, no drug should be taken unnecessarily. Furthermore, NSAID use (ibuprofen use) is strongly advised against in lower respiratory tract infections, as it has been associated with higher complication rates in both children and adults with pneumonia. In fact, fever may actually be beneficial in COVID-19, and probably shouldn’t be routinely treated by any means. If you have a fever, cool compresses to the face can make you feel better, without dousing your internal high temperature which may be helping you fight off the infection. Having said all that, those prescribed low-dose aspirin for cardiovascular disease should continue to take it.\n\nTo bring this full circle, the ACE2 connection may also offer some insight into the inconsistent findings between current and past smokers. Nicotine may downregulate ACE2. So, while it’s always a good idea to quit smoking, this may explain why active smokers may or may not necessarily be at significantly higher risk of COVID-19 progression.\n\nReversing your type 2 diabetes may help, as those with diabetes may suffer a more severe course. The same was true for past deadly coronavirus outbreaks: SARS and MERS— the Middle East Respiratory Syndrome.\n\n“[I]n this regard, the virus has relentlessly highlighted our global Achilles heel of metabolic dysfunction,” but also “points to a prime opportunity to fight back.” “That fight, however, is not going to be won only with Clorox, Purell, masks, or anti-inflammatory drugs. The fight will only be won through a serious commitment to improving everyone’s foundational metabolic health, starting with the lowest hanging evidence-based fruit: dietary and lifestyle interventions.” In other words, “[c]onsuming fresh, fiber-rich whole foods could serve to mitigate some of the overwhelming [pro-inflammatory] immune response which appears to be compounded in patients with COVID-19 who have diabetes and obesity, and must be a central focus included in any clinical recommendations made to patients or healthcare systems during this pandemic.”\n\nExcess body fat alone seems to be a risk factor independent of diabetes. Those with severe obesity (weighing more than 215 pounds at the average American’s height of five foot six) have seven times the odds of ending up on a ventilator. But even just being overweight puts you at risk. Those with a body mass index (BMI) of 28 or more (about 175 pounds at the average height) appear to be at nearly six times the odds of suffering a severe COVID-19 course. So, BMI of 28 or more puts you at more than five times the risk, and the average BMI in the United States is over 29. So, we’re not talking about obese. Just being overweight (skinnier, in fact, than the average American) may put you at significantly higher risk. The excess risk from the excess body fat may arise from greater systemic inflammation, fat covering the heart itself, or the restriction of breathing caused by excessive fatty tissue in the upper body. Even without taking weight into account, though, sadly, most American adults over the age of 50 suffer from a “co-morbidity” that may put them at risk,e such as heart disease, lung disease, diabetes, high blood pressure, or cancer.\n\nI know I have my infectious diseases hat on right now, rather than my lifestyle medicine hat, but I can’t allow it to pass without comment that the major comorbid conditions for COVID-19 severity and death—obesity, high blood pressure, type 2 diabetes, and heart disease— all can be controlled or even reversed with a healthy enough diet centered around whole plant foods. Thus, in terms of the impact of nutrition, now more than ever, wider access to healthy foods should be a top priority, and individuals should be mindful of healthy eating habits to reduce susceptibility to and long-term complications from COVID19.\n\nNot all risk factors are modifiable though. Advanced age is also a key risk factor for COVID-19 progression and death. Although the disease has afflicted newborns only a few days old through seniors in their 90’s, most patients (around 90 percent in one large case series) are between 30 and 79. The severity of disease, however, disproportionately affects older individuals. In China, the average age of those requiring intensive care was 62, compared to the non-ICU cases, which had an average age of 46. In the United States, even those 65 and older without underlying conditions or other risk factors appear to be hospitalized or end up in the ICU at approximately three times the rate of those age 19 to 64.\n\nThough the media has capitalized on stories of young, healthy individuals suffering severe or even fatal outcomes, people under 65 without known underlying, predisposing medical conditions may only account for about 1 percent of COVID-19 deaths. South Korea has some of the best data because they did such widespread testing. As you can see, of confirmed cases, only about 1 in 1000 confirmed died in their thirties and forties. So, if you’re healthy in your 30s and 40s only about 1 in a 1000 of dying, but for those in their 50s that rises to closer to 1 in 200. Those in their 60s, about 1 in 50 die. Those in their 70s it’s closer to 1 in 14, and in their 80s nearly 1 in 5 lost their lives to COVID-19.\n\nThough the relative lack of testing makes U.S. data less reliable, based on the first few thousands of American cases that just got reported, these age-related death risks are similar, as you can see. Note those are percentages. Lots more younger people are getting infected, so if you look at just the absolute numbers, you can see a big chunk of people are getting hospitalized and sent to the ICU in their 20s, 30s, 40s, and 50s. Lots of younger and middle-aged folks are suffering significant illness, but the vulnerability of our seniors to the pandemic was exemplified by ground zero of the first major U.S. outbreak, a nursing home in Washington State. Of the home’s 130 or so residents, 101 became infected, and a third lost their lives.\n\nPlease consider volunteering to help out on the site.", "opengraph": {"video": "http://youtube.com/v/ruo-yor7v0w", "video:type": "application/x-shockwave-flash", "video:duration": "742", "video:width": "640", "video:height": "360", "locale": "en_US", "title": "Modifiable Risk Factors and Comorbidities for Severe COVID-19 Infection | NutritionFacts.org", "description": "There are things you can do right now to reduce your risk of falling seriously ill and dying from this disease.", "url": "https://nutritionfacts.org/video/modifiable-risk-factors-and-comorbidities-for-severe-covid-19-infection/", "image": "https://nutritionfacts.org/app/themes/sage/dist/images/default-image.png", "type": "video.other", "twitter:player": "http://youtube.com/v/ruo-yor7v0w"}, "tags": ["chronic diseases", "China", "mortality", "diabetes", "stroke", "zoonotic disease", "Plant-Based Diets", "pandemics", "coronavirus", "pneumonia", "heart health", "body fat", "COVID-19", "fever", "cardiovascular disease", "emphysema", "heart disease", "aging", "Volume 50Cov", "smoking", "respiratory infections", "blood pressure", "hypertension", "inflammation", "lung health", "lifestyle medicine", "Asia", "Ibuprofen", "viral infections", "high blood pressure", "COPD"], "tweets": [], "movies": [], "links": ["https://nutritionfacts.org/volunteer"], "authors": [], "publish_date": "June 24, 2020"}