{"result_id": "229010", "URL": "https://nutritionfacts.org/video/flashback-friday-the-role-of-burger-viruses-in-cancer/", "timestamp": "2023-04-25 16:41:38 CEST+0200", "meta": {"description": "Polyomaviruses discovered in meat can survive cooking and pasteurization.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://nutritionfacts.org/video/flashback-friday-the-role-of-burger-viruses-in-cancer/", "encoding": "utf-8"}, "image": null, "domain": "nutritionfacts.org", "title": "Flashback Friday: The Role of Burger Viruses in Cancer", "cleaned_text": "Below is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video.\n\n“Nearly 20% of cancer[s]…can be linked to infectious agents,” such as viruses. There are seven viruses now conclusively tied to human cancer, and as new viruses enter into human populations, the incidence and causes of cancer will likely change accordingly.\n\nThe foundation of modern tumor virology was laid over a century ago, with the discovery of a cancer-causing chicken virus, for which a Nobel Prize was awarded. Another Nobel went to the guy that discovered the HPV virus was causing cervical cancer. And in his acceptance speech, he mused that there may be a bovine polyomavirus, a multiple tumor virus, in cattle, that could be playing a role in human colon cancer, lung cancer, and breast cancer. But, no polyomavirus had ever been discovered in meat—until now.\n\nPolyomaviruses are a particular concern, not only because they are “known to be carcinogenic,” but because they can survive cooking temperatures. Because single burgers these days can contain meat from “many dozens of animals,” they figured it would “present an ideal situation for virus-hunting.” So, researchers at the National Cancer Institute just walked into three supermarkets, and grabbed meat right off the shelf, and found three different polyomaviruses in ground beef. Now, just because three types of polyomaviruses are “commonly detectable in food-grade ground beef” doesn’t necessarily mean they are causing human disease.\n\nWhat made this Nobel laureate suspect them? Well, for one thing, some people got cancer right where they were vaccinated for smallpox—a whole bunch of different cancers. The vaccine was harvested from “the…skin of calves.” And so, maybe there’s some cancer-causing cow virus?\n\n“Many people are exposed to potentially virus-contaminated meat and dairy products” through their diet, but those in the industry would be even more exposed. So, it would be interesting to see if these groups have higher cancer incidence. And indeed, it now appears clear that those who work “in the meat industry are at increased risk of developing and dying” from a variety of cancers.\n\nAnother “reason…to suspect the involvement of [some kind of] bovine infectious factor…in colorectal cancer” is the fact that countries that don’t eat a lot of beef appear to have relatively low rates of colorectal cancer. And, countries that all of a sudden started eating lots of meat had their rates shoot up. Mongolia appears to be the exception. Lots of red meat, yet low colon cancer rates. But, “there they eat yak,” and maybe yaks don’t harbor the same viruses.\n\nCan’t you just avoid steak tartare? Even steak cooked “medium” may not reach internal temperatures above 70 Celsius, and it takes temperatures above that to inactivate some of these viruses. So, we would expect viruses to survive both cooking and pasteurization. In fact, they followed up with a paper suggesting that consumption of dairy products may represent a “main risk factor for the development of [human] breast cancer.” The recent discovery of a larger number of presumably new viruses in the blood, meat, and milk of dairy cows should be investigated, since one might speculate that infectious “agents present in dairy products [might have a special] affinity for [breast cells],” since they came from breast cells.\n\nThe fact that people with lactose intolerance, who tend to avoid milk and dairy throughout their lives, have lower rates of breast cancer and other cancers could be seen as supporting this concept—though there are certainly other reasons dairy may increase cancer risk, such as increasing levels of the cancer-promoting growth hormone IGF-1, or adversely affecting our gut microbiome. Or, for that matter, maybe the plant-based milks they’re drinking instead could be protective. That’s the problem with population studies: you can’t tease out cause and effect. It doesn’t matter how many viruses are found in retail beef, pork, and chicken if we can’t connect the dots.\n\nCan’t you just look for the presence of these viruses within human tumors? They’ve tried, and found some. But, even if you don’t find any, that doesn’t necessarily mean viruses didn’t play a role. There’s this “viral hit-and-run” theory of cancer development that suggests that certain viruses can slip in and out of our DNA to initiate the cancer, but be long gone by the time the tumor matures. So, there’s still a lot of work to be done.\n\nBut, if the link between bovine polyomaviruses and human disease pans out, the National Cancer Institute researchers “envision the development of [a] high-potency…vaccine…” So, just like the HPV vaccine may prevent cervical cancer from unsafe sex, one day, perhaps, vaccines may prevent breast and colon cancer from unsafe sirloin.\n\nPlease consider volunteering to help out on the site.", "opengraph": {"locale": "en_US", "title": "Flashback Friday: The Role of Burger Viruses in Cancer | NutritionFacts.org", "description": "Polyomaviruses discovered in meat can survive cooking and pasteurization.", "url": "https://nutritionfacts.org/video/flashback-friday-the-role-of-burger-viruses-in-cancer/", "image": "https://nutritionfacts.org/app/themes/sage/dist/images/default-image.png", "type": "video.other", "video": "http://youtube.com/v/Gz3M-0Hdqa4", "video:height": "360", "video:width": "640", "video:type": "application/x-shockwave-flash", "twitter:player": "http://youtube.com/v/Gz3M-0Hdqa4"}, "tags": [], "tweets": [], "movies": [], "links": ["https://nutritionfacts.org/volunteer"], "authors": [], "publish_date": "August 27, 2021"}