{"result_id": "229036", "URL": "https://nutritionfacts.org/video/the-role-of-pesticides-and-pollution-in-autism/", "timestamp": "2023-04-25 16:42:09 CEST+0200", "meta": {"description": "What are the effects of smoking, pesticides, vaccine mercury, and air pollution on autistic spectrum disorder risk?", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://nutritionfacts.org/video/the-role-of-pesticides-and-pollution-in-autism/", "encoding": "utf-8"}, "image": null, "domain": "nutritionfacts.org", "title": "The Role of Pesticides and Pollution in Autism", "cleaned_text": "Below is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video.\n\n“The prevalence of [autism] has increased dramatically in the US…” We’re not exactly sure how prevalent it used to be, but these days, about “1 in 68” kids born in the United States will have it. Despite a massive influx of research funding, we still don’t know: what’s the cause? This “sharp increase in prevalence remains unresolved.” Yes, “[c]hanges in awareness [and diagnosis] can account for some of the increase,” but it also might be something we’re exposed to in the environment.\n\nFor example, all the new chemicals we’re now exposed to. Out of 80,000 agents the chemical industries now put out, we have evidence that at least a thousand may have neurotoxic properties, yet “only a small fraction have been studied in humans during critical windows of development.” “The current chemical risk assessment approach is typically based on the toxicity caused by a single chemical…without acknowledging” the effects of different chemical mixtures. There are hundreds of chemicals currently “allowed in food that may have potential harmful effects on the developing brain.” “Each individual chemical may or may not have a harmful effect [on its own], but we know next to nothing about their cumulative biological effects on the brain.”\n\n“If we really want to protect children’s brains from chemicals…, we first need to recognize and deal with the massive dearth of basic hazard and exposure information [about any] risks posed by environmental chemicals.” A lot of the data we do have is from “preclinical studies”—meaning like test tubes and lab animals. Well, yeah, it’s not like you can expose people on purpose. That’s where epidemiological research can step in: studying exposures within populations. That’s how we found out about other well-known hazards, like benzene and asbestos. You can’t ethically force people to smoke for a study, but you can note how many people exposed to cigarette smoke day in and day out get lung cancer, compared to nonsmokers.\n\nIndustries spewing poison like to patronize the public that we shouldn’t worry our pretty little heads, but what does the science show? What does the epidemiological evidence have to say about exposures to environmental chemicals and autism?\n\nFor example, there’s a bunch of studies on the effects of smoking during pregnancy on autism rates. I’ve talked about these so-called forest plots before, where values greater than one suggest at least a tendency towards an increased risk, whereas the values less than one suggest more of a protective association. And should the whiskers here cross the line, then that means that particular finding did not reach statistical significance. This allows you with a quick glance to interpret a huge amount of data from multiple studies.\n\nSo, regarding this figure here, does it look like smoking during pregnancy has any effect on autism rates? No; about half skewed to one side, half to the other, and hardly any of the results reached statistical significance—meaning they may have just been largely chance findings.\n\nSame thing with thimerosal exposure, the mercury-containing preservative used in vaccines. Yeah, one study found significantly increased risk of autism, but three other studies found that those with more vaccine mercury exposure had lower the risk of autism. But mostly, they just showed no relationship either way—not that it matters much at this point, since thimerosal has been removed from most vaccines.\n\nBut check out the air pollution data. This is exposure to car exhaust and diesel fumes during pregnancy and infancy. See how all the data is skewed to the right, with half the findings reaching statistical significance—meaning a significant correlation between air pollution and autism. But, correlation doesn’t necessarily mean causation. This could be a true cause-and-effect relationship, or maybe it’s just that poor people live in the inner cities next to polluted highways, or the traffic noise is causing stress, or some other confounding factor.\n\nThe other suspicious link they found was “pesticide exposure.” Again, just a few-second blink at this chart, and you can see where most of the evidence trends. Lots of environmental toxicants have been implicated in autism: plastics, chemicals, PCBs, solvents, toxic waste sites, and heavy metals. But the “strongest evidence [has been] found for air pollutants and pesticides.”\n\nYeah, “[c]linicians [can] advise pregnant women and parents [to try to avoid exposures to] harmful substances in their environment.” But, instead of just advising patients one-by-one, a “more powerful” strategy would be for us clinicians to band together and take a “leadership role in advocating for a healthy environment” and society-wide actions to help everyone.\n\nPlease consider volunteering to help out on the site.", "opengraph": {"locale": "en_US", "title": "The Role of Pesticides and Pollution in Autism | NutritionFacts.org", "description": "What are the effects of smoking, pesticides, vaccine mercury, and air pollution on autistic spectrum disorder risk?", "url": "https://nutritionfacts.org/video/the-role-of-pesticides-and-pollution-in-autism/", "image": "https://nutritionfacts.org/app/themes/sage/dist/images/default-image.png", "type": "video.other", "video": "http://youtube.com/v/w8g4QaZZEzs", "video:height": "360", "video:width": "640", "video:type": "application/x-shockwave-flash", "twitter:player": "http://youtube.com/v/w8g4QaZZEzs"}, "tags": ["autism", "cigarettes", "benzene", "smoking", "women's health", "children", "industrial pollutants", "mercury", "organic foods", "air pollution", "heavy metals", "infants", "pregnancy", "animal studies", "vaccines", "pesticides", "PCBs", "Volume 40"], "tweets": [], "movies": [], "links": ["https://nutritionfacts.org/volunteer"], "authors": [], "publish_date": "January 29, 2018"}