{"result_id": "229016", "URL": "https://nutritionfacts.org/video/aluminum-in-vaccines-vs-food/", "timestamp": "2023-04-25 16:41:44 CEST+0200", "meta": {"description": "What is the #1 source of aluminum in the diet?", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://nutritionfacts.org/video/aluminum-in-vaccines-vs-food/", "encoding": "utf-8"}, "image": null, "domain": "nutritionfacts.org", "title": "Aluminum in Vaccines vs. Food", "cleaned_text": "Speaking of toxic metallic elements, there continues to be growing concern about aluminum exposure and the development of neurodegenerative diseases, such as Alzheimer’s. But how are we exposed to aluminum?\n\nThis is how much we get cooking acidic foods like tomato sauce in an aluminum pot for an hour. Aluminum is also added to childhood vaccines as an immune irritant to improve efficacy. But it’s come under fire from some parenting groups. This is how much you get smoking a pack of cigarettes, and this is how much you get if you use aluminum-containing antiperspirants. But researchers just found a food item that blows these other sources away.\n\nWhat do you think it is? Is it Brussels sprouts? Many of you wish it were Brussels sprouts! Cheese, chicken, eggs, fish, or shellfish?\n\nThe highest natural levels of aluminum are found in shellfish, but the highest level overall is in cheese. Why? Just like the poultry industry adds arsenic to chicken, the dairy industry adds aluminum to cheese, the #1 source of aluminum in the diet.\n\nWhy would they do that? The aluminum salts produce a “smooth, uniform film around each fat droplet” to prevent something called fat “bleeding,” and to give the cheese a softer texture, and “desirable slicing properties.”\n\nSo if you’re a parent worrying about the aluminum in vaccines, every grilled cheese sandwich you give to your kids is like injecting them with a dozen aluminum-containing vaccines.\n\nTo see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video. This is just an approximation of the audio contributed by veganmontreal.\n\nPlease consider volunteering to help out on the site.", "opengraph": {"video": "http://youtube.com/v/Wozd4cQ3IEw", "video:type": "application/x-shockwave-flash", "video:duration": "140", "video:width": "640", "video:height": "360", "locale": "en_US", "title": "Aluminum in Vaccines vs. Food | NutritionFacts.org", "description": "What is the #1 source of aluminum in the diet?", "url": "https://nutritionfacts.org/video/aluminum-in-vaccines-vs-food/", "image": "https://nutritionfacts.org/app/themes/sage/dist/images/default-image.png", "type": "video.other", "twitter:player": "http://youtube.com/v/Wozd4cQ3IEw"}, "tags": ["chicken", "dementia", "tobacco", "children", "seafood", "Alzheimer’s disease", "Brussels sprouts", "cheese", "fish", "food additives", "brain health", "vaccines", "eggs", "Volume 3", "aluminum", "tomatoes", "cooking methods", "antiperspirant"], "tweets": [], "movies": [], "links": ["https://nutritionfacts.org/volunteer"], "authors": [], "publish_date": "January 4, 2010"}