{"result_id": "229039", "URL": "https://nutritionfacts.org/video/how-to-prevent-the-next-pandemic/", "timestamp": "2023-04-25 16:42:13 CEST+0200", "meta": {"description": "We need to reform the food system before it’s too late.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://nutritionfacts.org/video/how-to-prevent-the-next-pandemic/", "encoding": "utf-8"}, "image": null, "domain": "nutritionfacts.org", "title": "How to Prevent the Next Pandemic", "cleaned_text": "Below is an approximation of this video’s audio content. To see any graphs, charts, graphics, images, and quotes to which Dr. Greger may be referring, watch the above video.\n\nInfectious diseases are emerging globally at an unprecedented rate. Literally hundreds of new pathogens have emerged and re-emerged over the last few decades, and what we eat is responsible for most of the new diseases that have jumped from animals to humans.\n\nIn response to the torrent of emerging zoonotic (animal-to-human) diseases, three of the world’s leading authorities—the World Health Organization, the Food and Agriculture Organization of the United Nations, and the World Organization for Animal Health (OIE)—held a joint consultation to determine the key underlying causes. First on their list was the “Increasing demand for animal protein.”\n\nThe greatest swords of Damocles dangling are the H5 and H7 bird flu viruses blanketing much of the earth. A bird flu pandemic could be devastating, given their current upwards of Ebola-like flip-of-the-coin death rates. Given that the emergence of these deadly bird flu viruses, H5N1 and H7N9, are “linked to intensification of the poultry sector,” there have been calls for the “de-industrialization of animal production”––for example, as suggested here in the Annals of the New York Academy of Sciences, “replacing large industrial units with smaller units with lower stocking densities,” potentially resulting in less stress, less disease susceptibility, less intense infectious contact, and smaller infectious loads. Maybe they’re the ones that could use a little social distancing.\n\nThe American Public Health Association, the largest and oldest association of public health professionals in the world, has called for a moratorium on factory farming for nearly two decades now. Maybe COVID-19 is the dry run we needed, the fire drill to awake us from our complacency and reform the food system before it’s too late.\n\nBut if, as the Food and Agriculture Organization of the United Nations visualized it, the next pandemic starts with “increased demand for poultry products,” before ending up with human-to-human transmission, maybe we need to move beyond just giving these animals some more breathing room. This editorial in the journal of the American Public Health Association goes beyond just calling for a deintensification of poultry industry, questioning the prudence of raising so many animals for food in the first place. “It is curious, therefore [given the pandemic threat], that changing the way humans treat animals—most basically, ceasing to eat them or, at the very least, radically limiting the quantity of them that are eaten—is largely off the radar as a significant preventive measure. Such a change, if sufficiently adopted or imposed, could still reduce the chances of the much-feared influenza epidemic. It would be even more likely to prevent unknown future diseases that, in the absence of this change, may result from farming animals intensively and killing them for food. Yet humanity [doesn’t even] consider this option.”\n\nHowever, thanks to food innovations, this may be changing. Have you looked in the dairy case at the supermarket lately? Some of America’s largest dairy producers have recently filed for bankruptcy due to the constellation of new consumer choices.\n\nI was peripherally involved in the largest meat recall in human history. Remember the footage of the cows getting forklifted? A hidden-camera investigation at a California slaughter plant for “spent” dairy cows led to the recall of nearly 150 million pounds of beef for violations of food safety rules meant to protect the public from mad cow disease. Downed dairy cows—too sick to even walk—were being dragged to slaughter with chains into the federal school lunch program. You don’t have to worry about contaminated cattle brains in your oat milk, though.\n\nBut, you can see what I’m saying. Yes, you can pass public health regulations to stop the cannibalistic feeding of slaughterhouse waste to dairy cows—or, you can just provide the public better alternatives, and let the market eliminate the risk entirely, because there’s no prions in plants.\n\nHIV/AIDS likely arose from people slaughtering primates. 30 million people wouldn’t be dead right now if we were eating meals from bushes instead of bushmeat. We can’t get coronaviruses from cauliflower. There is no flu in falafel production, no matter how tightly you crowd the balls together. What I am saying is our food choices don’t just affect our personal health, but our global health. Not just in terms of climate change, but in terms of stifling pandemic risk.\n\nThere has been a tremendous surge in interest in diversified protein sources, given the increasing consensus that reduced meat consumption is critical for addressing both the climate crisis and our burgeoning epidemics of lifestyle diseases. Eating less meat may not only help save the world, but could help prevent the loss of more than ten million human lives a year. To their credit, in 2016, the Chinese government recommended its citizens cut their meat consumption in half, in part to reduce their growing rates of chronic disease. A completely plant-based diet might reap $30 trillion from the health benefits alone, and that would be just from the lowered rates of chronic diseases like cancer, heart disease, and type 2 diabetes––not even factoring in the decreased catastrophic pandemic risk. What we eat doesn’t just affect our personal health, but our global health in more ways than one.\n\nMaking healthier choices could also help mediate the next coronavirus epidemic, not only at the source by sidestepping wet markets, but by also decreasing the rates of co-morbidities found to increase the risk in all the deadly coronaviruses: SARS, MERS, and COVID-19. Consider the underlying risk factors for COVID-19 severity and death: obesity, heart disease, hypertension, type 2 diabetes and chronic pulmonary disease. “In virtually all studies, vegetable protein is superior to animal protein [in terms of] lower rates of heart disease and type 2 diabetes and lower blood pressure than animal protein.” Here’s a meta-analysis published a few months ago on diabetes risk and animal protein consumption. For hypertension, meat, including poultry, may contribute to a higher risk of high blood pressure. Meat may even be associated with impaired lung function, increasing the risk of lung diseases like emphysema.\n\nThe same diet that can help you survive this pandemic can also help prevent the next. So, instead of propping up the meat industry to the tune of a 100 million taxpayer dollars a month, and forcing meat plants to stay open, pandemic proof your diet. Thankfully, expanded options are now hitting the meat case as well. No longer a niche market for vegetarians, major meat producers have started blending in vegetable proteins to make hybrid meat products, like Perdue’s chicken plus nuggets, or Tyson’s “Whole Blends” sausage links. Smithfield, the world’s largest pork producer, recently debuted an entire line of plant-based products. Hormel has a new plant-based line too; the purveyors of SPAM now believe in the power of plants. Check out this headline from a few weeks ago: “KFC to roll out Cargill’s plant‐based chicken across China.” Talk about a cultural revolution. And, we’re not talking about Tofurkey. Cargill is America’s largest private corporation, and one of the biggest meat packers in the world.\n\nHow many fewer curly-tailed viral mixing vessels are there now that Dunkin’ Donuts has a meat-free breakfast sausage? How many fewer hens are packed beak-to-beak now that egg-free mayo has taken the sandwich spread sector by storm? Quorn, a brand of meat-free meat made from the mushroom kingdom, opened a single facility that can produce the meat equivalent of twenty million chickens per year. These products may not be the healthiest from a personal standpoint— a doughnut sandwich without pork is still a doughnut sandwich—but hey, swap in an egg-free omelette from Tim Hortons and from a pandemic standpoint? Zero risk.\n\nDoesn’t necessarily have to be plants, though. In this review on food systems in the era of the coronavirus, they noted that “researchers are seeking alternative protein sources everywhere.” Can’t think of any possible alternative to cow’s milk? How about cockroach milk? I mean, you think almond milk is nuts? How about some of this on your corn flakes? Could be healthier than cow’s milk, and hey, no lactose, no dairy allergy problems. An important alternative. I mean I can’t imagine anything else you can make milk out of. And gluten-free too! The only downside, evidently, was the flavor, but the researchers—perhaps funded by Big Bug?—chalked this up to fact that the judges knew there were cockroaches in the bread; and so, they were all just biased. Hmmm, I think I’ll stick with the plants.\n\nBut if you’re like: “you’ll have to pry that pork chop from my cold, dead hands,” we may be able to have our meat and eat it too. An even more innovative approach to pandemic prevention was suggested by Winston Churchill in 1932. In an article in Popular Mechanics entitled “Fifty Years Hence,” he predicted that “[w]e shall escape the absurdity of growing a whole chicken in order to eat the breast or wing, by growing these parts separately under a suitable medium.”\n\nAnd indeed, the prediction is becoming a reality. Instead of taking a cutting from a plant and growing vegetables, you’re taking a sample from an animal, and growing meat. Potentially lots of meat––like maybe a billion pounds from a single sample. Indeed, in terms of efficiency, growing meat straight from muscle cells could reduce greenhouse gas emissions and water use by as much as 96 percent, and lower land use by as much as 99 percent. But when you factor in pandemic risk, the benefits to human health of a slaughter-free harvest could arguably rival those to planetary health.\n\nFood safety has been considered the primary human health benefit of such an approach. There has been a six-fold increase in food poisoning over the last few decades, sickening tens of millions of Americans every year, and contaminated meats and animal products are the most common cause. So, when the cultivated meat industry calls its product “clean meat,” that’s not just a nod to clean energy. Food-poisoning pathogens like E. coli, Campylobacter, and Salmonella are due to fecal residue––traces of which are found on most poultry sampled in the United States, and about half of retail ground beef and pork chops. They’re intestinal bugs, so you don’t have to worry about them if you’re producing meat without intestines. You don’t have to cook the crap out of meat if there’s no crap to begin with, just like you don’t have to worry about brewing up new respiratory viruses that could kill millions of people if you’re making meat without the lungs.\n\n“A culinary choice in south China led to a fatal infection in Hong Kong, and subsequently to 8000 cases of severe acute respiratory syndrome (SARS), and nearly 1000 deaths in 30 countries on six continents.” If only we had learned our lesson then. We may be one bushmeat meal away from the next HIV, one pangolin plate away from the next killer coronavirus, and one factory farm away from the next deadly flu. Tragically, it may take a pandemic with a virus like H5N1 before the world realizes the true cost of cheap chicken.\n\nPlease consider volunteering to help out on the site.", "opengraph": {"video": "http://youtube.com/v/n93ln-weXRw", "video:type": "application/x-shockwave-flash", "video:duration": "794", "video:width": "640", "video:height": "360", "locale": "en_US", "title": "How to Prevent the Next Pandemic | NutritionFacts.org", "description": "We need to reform the food system before it’s too late.", "url": "https://nutritionfacts.org/video/how-to-prevent-the-next-pandemic/", "image": "https://nutritionfacts.org/app/themes/sage/dist/images/default-image.png", "type": "video.other", "twitter:player": "http://youtube.com/v/n93ln-weXRw"}, "tags": ["dairy", "E. coli", "chronic diseases", "China", "meat", "mortality", "diabetes", "zoonotic disease", "foodborne illness", "Plant-Based Diets", "protein", "pandemics", "coronavirus", "plant protein", "pork", "factory farming practices", "viral infections", "chicken", "HIV/AIDS", "heart health", "food poisoning", "poultry", "meat substitutes", "Salmonella", "vegetables", "COVID-19", "World Health Organization", "Campylobacter", "cardiovascular disease", "heart disease", "Volume 50Cov", "fake meat", "respiratory infections", "blood pressure", "hypertension", "obesity", "lung health", "lifestyle medicine", "animal products", "Asia", "eggs", "fruit", "high blood pressure"], "tweets": [], "movies": [], "links": ["https://nutritionfacts.org/volunteer"], "authors": [], "publish_date": "July 27, 2020"}