{"result_id": "230004", "URL": "https://nworeport.me/serbia-may-produce-russian-covid-19-vaccine/", "timestamp": "2023-04-25 16:42:23 CEST+0200", "meta": {"description": "Source: Tsarizm Staff Serbia may have the capacity to produce the Russian vaccine against the Sputnik V coronavirus by the end of this year, said Serbian Minister without Portfolio Nenad Popovic, Radio Free Europe reports. He made the remarks on Thursday following a meeting with a group of Russian experts who visited Belgrade to analyze the country’s", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/nworeport.me/wp-content/uploads/2018/01/cropped-fgm7iw1t.jpg?fit=32%2C32&ssl=1", "canonical": "https://nworeport.me/serbia-may-produce-russian-covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "nworeport.me", "title": "Serbia May Produce Russian COVID-19 Vaccine", "cleaned_text": "Serbia may have the capacity to produce the Russian vaccine against the Sputnik V coronavirus by the end of this year, said Serbian Minister without Portfolio Nenad Popovic, Radio Free Europe reports.\n\nHe made the remarks on Thursday following a meeting with a group of Russian experts who visited Belgrade to analyze the country’s capacity to produce the vaccine.\n\n“For a full production cycle … this could take up to nine or 10 months,” Popovic told media, adding that the vaccine would not only be distributed within Serbia, “but also in the region and throughout Europe”.\n\nEarlier during the day, Popovic said Serbia should buy the equipment needed to start production of the Sputnik V vaccine.\n\n“There is a huge shortage of this equipment in the world,” he said.\n\nLast week, Serbian President Aleksandar Vucic said that the country he leads would invest as much as it needs to start domestic production of the Russian vaccine.\n\nUnder the state vaccination program, Serbs can now decide whether they want to be vaccinated with the Pfizer / BioNTech, Chinese Sinopharm, or Russian vaccines.\n\nWith about 8% of the population vaccinated with at least one dose of anti-COVID-19 vaccine, Serbia is one of the countries with the highest vaccination rate in the world, after Israel and the United Arab Emirates, the United States of America, and Great Britain.\n\nThis week, Serbia received 500,000 doses of the Chinese vaccine and 50,000 doses of the Russian vaccine.", "opengraph": {"locale": "en_US", "site_name": "Nwo Report - nwo world news conservative news alternative nwo news deep state news", "type": "activity", "title": "Serbia May Produce Russian COVID-19 Vaccine", "description": "Source: Tsarizm Staff Serbia may have the capacity to produce the Russian vaccine against the Sputnik V coronavirus by the end of this year, said Serbian Minister without Portfolio Nenad Popovic, Radio Free Europe reports. He made the remarks on Thursday following a meeting with a group of Russian experts who visited Belgrade to analyze the country’s capacity to produce the vaccine. [...]", "url": "https://nworeport.me/serbia-may-produce-russian-covid-19-vaccine/"}, "tags": ["Vaccines"], "tweets": [], "movies": [], "links": ["https://tsarizm.com/author/todd/", "https://www.evropaelire.org/a/31098369.html", "mailto:?subject=%5BShared%20Post%5D%20Serbia%20May%20Produce%20Russian%20COVID-19%20Vaccine&body=https%3A%2F%2Fnworeport.me%2Fserbia-may-produce-russian-covid-19-vaccine%2F&share=email", "https://nworeport.me/serbia-may-produce-russian-covid-19-vaccine/#print", "https://nworeport.me/serbia-may-produce-russian-covid-19-vaccine/?share=facebook", "https://nworeport.me/serbia-may-produce-russian-covid-19-vaccine/?share=twitter", "#", "https://nworeport.me/serbia-may-produce-russian-covid-19-vaccine/?share=reddit"], "authors": [], "publish_date": null}