{"result_id": "230018", "URL": "https://nworeport.me/the-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity-genocide/", "timestamp": "2023-04-25 16:42:36 CEST+0200", "meta": {"description": "Source: HeathData.org Nazi “Medical Experiments” Let us recall the categorization of specific crimes pertaining to Nazi “medical experiments” conducted on concentration camp prisoners. These included “the killing of Jews for anatomical research, the killing of tubercular Poles, and the euthanasia of sick and disabled civilians in Germany and occupied territories. …” Karl Brandt and six other", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/nworeport.me/wp-content/uploads/2018/01/cropped-fgm7iw1t.jpg?fit=32%2C32&ssl=1", "canonical": "https://nworeport.me/the-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity-genocide/", "encoding": "UTF-8"}, "image": null, "domain": "nworeport.me", "title": "The COVID-19 “Vaccine” and the Nuremberg Code. Crimes Against Humanity, Genocide", "cleaned_text": "“We, the survivors of the atrocities committed against humanity during the Second World War, feel bound to follow our conscience. … Another holocaust of greater magnitude is taking place before our eyes. We call upon you to stop this ungodly medical experiment on humankind immediately. It is a medical experiment to which the Nuremberg Code must be applied.” (Rabbi Hillel Handler, Hagar Schafrir, Sorin Shapira, Mascha Orel, Morry Krispijn et al, see complete text here)\n\nThe mRNA vaccine is “experimental’ and unapproved. Since December 2020, it has resulted in a worldwide upward trend in deaths and injuries.\n\nNumerous scientific studies confirm the nature of the Covid-19 mRNA vaccine which is being imposed on all humanity.\n\nThe stated objective is to enforce the Worldwide vaccination of 7.9 billion people in more than 190 countries, to be followed by the imposition of a digitized “vaccine passport”.\n\nNeedless to say this is a multi-billion dollar operation for Big Pharma. In a bitter irony, Pfizer which is playing a dominant role in marketing the vaccine at the level of the entire planet, has a criminal record with the US Department of Justice (for more details see below).\n\nThe national health authorities cannot say: we did not know. Nor can they say that the objective is “to save lives”. This is a killer vaccine. And they know it.\n\nThe latest official figures (September 15, 2021) point to approximately:\n\n40,666 mRNA vaccine reported and registered deaths in the EU, UK and US (combined) and\n\nEU/EEA/Switzerland to 11 September 2021 – 24,528 Covid-19 injection related deaths and 2,292,967 injuries, per EudraVigilance Database.\n\nUK to 1 September 2021 – 1,632 Covid-19 injection related deaths and 1,186,844 injuries, per MHRA Yellow Card Scheme.\n\nUSA to 3 September 2021 – 14,506 Covid-19 injection related deaths and 3,146,691 injuries, per VAERS database.\n\nTOTAL for EU/UK/USA – 40,666 Covid-19 injection related deaths and 6,626,502 injuries reported as at 15 September 2021.\n\nBut only a small fraction of the victims or families of the deceased will go through the tedious process of reporting vaccine related deaths and adverse events to the national health authorities.\n\nThose death and injury figures (EU, UK, US) SOFAR are at least ten times higher than the official reported cases.\n\n410,000 deaths, 66 million injuries out of a population of approximately 850 million.\n\nMoreover, the health authorities are actively involved in obfuscating the deaths and injuries resulting from the mRNA “vaccine”, while inflating the number of Covid-19 related deaths. (“autopsies not required”).\n\nVideo: Michel Chossudovsky provides a broad picture of the ongoing crisis which is destroying people’s lives Worldwide.\n\nhttps://www.bitchute.com/embed/uBzx3eYozeXz/\n\nTo view the video on Bitchute, enter a comment, click the link below:\n\nhttps://www.bitchute.com/video/uBzx3eYozeXz/\n\nThe vaccine is being applied and imposed Worldwide. The target population is 7.9 billion. Several doses are contemplated. It is the largest vaccination program in World history.\n\n“Never before has immunization of the entire planet been accomplished by delivering a synthetic mRNA into the human body”.\n\nThe WHO “Guidelines” for establishing a Worldwide Digital Informations System for issuing so-called “Digital Certificates for Covid-19” are generously funded by the Rockefeller and Bill and Melinda Gates foundations.\n\nThe mRNA vaccine is not a project of a UN intergovernmental body (WHO) on behalf the member states of the UN: This is a private initiative. The billionaire elites which fund and enforce the Vaccine Project Worldwide are Eugenists committed to Depopulation.\n\nThe global vaccine project entitled COVAX is coordinated Worldwide by the WHO, GAVI, CEPI, the Gates Foundation in liaison with the World Economic Forum (WEF), the Wellcome Trust, DARPA and Big Pharma which is increasingly dominated by the Pfizer-GSK partnership established barely four months before the onset of the Covid-19 crisis in early January 2020.\n\nPfizer –which has a criminal record with the US Department of Justice– is playing a “near monopoly role” in the marketing of the mRNA “vaccine”. Already in the EU, Pfizer is slated to deliver 1.8 billion doses which is equivalent to four times the population of the European Union.\n\nIn a historic US Department of Justice decision in September 2009, Pfizer Inc. pleaded guilty to criminal charges. It was “The Largest Health Care Fraud Settlement” in the History of the U.S. Department of Justice.\n\nIn addition to compliance and enforcement, the “vaccine poison” imposed at the level of the entire planet is produced by a pharmaceutical company which has been indicted by the DOJ on charges of “fraudulent marketing”.\n\n“Fraudulent Marketing” in relation to the mRNA vaccine is a gross understatement. The health authorities as well as Big Pharma not to mention the WHO, the Rockefellers and the Gates foundation are fully aware that the vaccine has resulted in countless deaths and injuries, including blood clots, infertility, brain damage, myocarditis, etc.\n\nAnd yet the governments (with the 24/7 support of the media) are pressuring people to take the jab. “It will save lives”.\n\nThe health risks are known and documented, yet at the same time people are not only misinformed, they are forced into accepting the vaccine. Or else…\n\nNo career, no income, no future… It’s an issue of compliance. And no access to education and health services if you are not vaccinated.\n\nIf they refuse the jab, they loose their job.\n\nStudents are barred from attending schools, colleges and universities, health workers and high school teachers who do not conform are fired, civil society is precipitated into a state of chaos.\n\nFocussing on the experimental nature of the mRNA vaccine and its devastating health impacts, legal analysts have raised the issue of the historic Nuremberg “Nazi Doctors Trial’ (1946-47) in which Nazi doctors were charged for war crimes, specifically in the conduct of medical experiments on both prisoners in the concentration camps and civilians.\n\nThe Medical Case, U.S.A. vs. Karl Brandt, et al. (also known as the Doctors’ Trial), was prosecuted in 1946-47 against twenty-three doctors and administrators accused of organizing and participating in war crimes and crimes against humanity in the form of medical experiments and medical procedures inflicted on prisoners and civilians.\n\nKarl Brandt, the lead defendant, was the senior medical official of the German government during World War II; other defendants included senior doctors and administrators in the armed forces and SS. See Harvard Documents\n\nResulting from the verdict on August 19, 1947, the Nuremberg Code was enacted. Reviewed below are the Ten Principles of the Nuremberg Code. Several of these principles –in relation to the mRNA vaccine and the vaccine passport– have been blatantly violated.\n\nThe first principle of the “Nuremberg Code.” states that “the voluntary consent of the human subject is absolutely essential,” And that is precisely what is being denied in relation to the “vaccine”(see sentences in bold below).\n\n1. The voluntary consent of the human subject is absolutely essential.\n\nThis means that the person involved should have legal capacity to give consent; should be so situated as to be able to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, over-reaching, or other ulterior form of constraint or coercion; and should have sufficient knowledge and comprehension of the elements of the subject matter involved as to enable him to make an understanding and enlightened decision. This latter element requires that before the acceptance of an affirmative decision by the experimental subject there should be made known to him the nature, duration, and purpose of the experiment; the method and means by which it is to be conducted; all inconveniences and hazards reasonably to be expected; and the effects upon his health or person which may possibly come from his participation in the experiment.\n\n2. The experiment should be such as to yield fruitful results for the good of society, unprocurable by other methods or means of study, and not random and unnecessary in nature.\n\n3. The experiment should be so designed and based on the results of animal experimentation and a knowledge of the natural history of the disease or other problem under study that the anticipated results will justify the performance of the experiment.\n\n4. The experiment should be so conducted as to avoid all unnecessary physical and mental suffering and injury.\n\n5. No experiment should be conducted where there is an a priori reason to believe that death or disabling injury will occur; except, perhaps, in those experiments where the experimental physicians also serve as subjects.\n\n6. The degree of risk to be taken should never exceed that determined by the humanitarian importance of the problem to be solved by the experiment.\n\n7. Proper preparations should be made and adequate facilities provided to protect the experimental subject against even remote possibilities of injury, disability, or death.\n\n8. The experiment should be conducted only by scientifically qualified persons. The highest degree of skill and care should be required through all stages of the experiment of those who conduct or engage in the experiment.\n\n9. During the course of the experiment the human subject should be at liberty to bring the experiment to an end if he has reached the physical or mental state where continuation of the experiment seems to him to be impossible.\n\n10. During the course of the experiment the scientist in charge must be prepared to terminate the experiment at any stage, if he has probably cause to believe, in the exercise of the good faith, superior skill and careful judgment required of him that a continuation of the experiment is likely to result in injury, disability, or death to the experimental subject.\n\nEntire populations in a large number of countries are under threat to comply and get vaccinated.\n\nWith reference to the Nuremberg Code, they are unable:\n\n“to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, over-reaching, or other ulterior form of constraint or coercion” (Nuremberg 1 above).\n\nAmply documented, there is an upward trend in mRNA vaccine deaths and injuries Worldwide and the health authorities are fully aware of the “health risks”, yet they have not informed the public. There is no informed consent. And the media is lying through their teeth:\n\n“No experiment should be conducted where there is an a priori reason to believe that death or disabling injury will occur” (Nuremberg 5 above).\n\nThat “a priori reason” outlined in Nuremberg principle 5, is amply documented: Deaths and disabling injuries are ongoing at the level of the entire planet. They are confirmed by the official statistics of mRNA vaccine mortality and morbidity (EU, US, UK).\n\nVideo: The mRNA vaccine was launched in mid to late December 2020. In many countries, there was a significant shift in mortality following the introduction of the mRNA vaccine\n\nLet us recall the categorization of specific crimes pertaining to Nazi “medical experiments” conducted on concentration camp prisoners. These included “the killing of Jews for anatomical research, the killing of tubercular Poles, and the euthanasia of sick and disabled civilians in Germany and occupied territories. …”\n\nKarl Brandt and six other defendants were convicted, sentenced to death, and executed; nine defendants were convicted and sentenced to terms in prison; and seven defendants were acquitted.\n\nThe trial documents and evidence are all on file. The defendants were charged with war crimes and crimes against humanity.\n\nThe Scale and Size of the Worldwide Covid-19 Vaxx Operation\n\nI have not been able to review the relevant documents in detail with a view to establishing the number of victims resulting from the Nazi medical experiments.\n\nWhile the Nuremberg principles are of utmost relevance to the Covid-19 vaccine project, simplistic comparisons should be avoided. The context, the history and the mechanisms of compliance pertaining to the mRNA “vaccine” are fundamentally different.\n\nThe scale and size of the Worldwide Vaxx operation as well as its complex organizational structure (WHO, GAVI, Gates Foundation, Big Pharma) is unprecedented.\n\nHumanity in its entirety is the objective of the Vaxx project. The target population for vaccine experimentation of the Covid-19 vaccine is the entire population of Planet Earth:\n\nMultiply the World’s population by 4 doses (as proposed by Pfizer): the order of magnitude is 30 billion doses Worldwide.\n\nThe numbers are in the billions. The likely impacts on mortality and morbidity are beyond description.\n\nBig Money is behind this public-private partnership project.\n\nWe are dealing with a Worldwide process of crimes against humanity. Entire populations in a large number of member states of the UN are subject to compliance and enforcement (without the Rule of Law).\n\nIf they refuse the vaccine, they are socially marginalized and confined, rejected by their employers, rejected by society: no education, no career, no life. Their lives are destroyed.\n\nIf they accept the vaccine, their health and their life are potentially in jeopardy. The evidence of mortality and morbidity resulting from vaccine inoculation both present (official data) and future (e.g. undetected microscopic blood clots) is overwhelming.\n\nAnd that’s just the beginning.\n\nExtensive crimes against humanity Worldwide are being committed.\n\nThe mRNA “vaccine” modifies the human genome at the level of the entire Planet. It’s Genocide.\n\nIt’s a “Holocaust of Greater Magnitude, Taking Place before our Eyes”.\n\nMichel Chossudovsky is an award-winning author, Professor of Economics (emeritus) at the University of Ottawa, Founder and Director of the Centre for Research on Globalization (CRG), Montreal, Editor of Global Research.\n\nHe has undertaken field research in Latin America, Asia, the Middle East, sub-Saharan Africa and the Pacific and has written extensively on the economies of developing countries with a focus on poverty and social inequality. He has also undertaken research in Health Economics (UN Economic Commission for Latin America and the Caribbean (ECLAC), UNFPA, CIDA, WHO, Government of Venezuela, John Hopkins International Journal of Health Services (1979, 1983)\n\nHe is the author of twelve books including The Globalization of Poverty and The New World Order (2003), America’s “War on Terrorism” (2005), The Globalization of War, America’s Long War against Humanity (2015).\n\nHe is a contributor to the Encyclopaedia Britannica. His writings have been published in more than twenty languages. In 2014, he was awarded the Gold Medal for Merit of the Republic of Serbia for his writings on NATO’s war of aggression against Yugoslavia. He can be reached at crgeditor@yahoo.com", "opengraph": {"locale": "en_US", "site_name": "Nwo Report - nwo world news conservative news alternative nwo news deep state news", "type": "activity", "title": "The COVID-19 “Vaccine” and the Nuremberg Code. Crimes Against Humanity, Genocide", "description": "Source:  Prof Michel Chossudovsky Introduction “We, the survivors of the atrocities committed against humanity during the Second World  War, feel bound to follow our conscience. … Another holocaust of greater magnitude is taking place before our eyes. We call upon you to stop this ungodly medical experiment on humankind immediately. It is a medical experiment to which the Nuremberg [...]", "url": "https://nworeport.me/the-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity-genocide/"}, "tags": ["COVID-19 “Vaccine”", "GENOCIDE", "Nuremberg Code"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "616", "height": "347", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"616\" height=\"347\" src=\"https://www.youtube.com/embed/xSrc_s2Gqfw?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/xSrc_s2Gqfw?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://www.globalresearch.ca/author/michel-chossudovsky", "https://www.globalresearch.ca/stop-the-covid-holocaust-open-letter/5755902", "https://i0.wp.com/www.globalresearch.ca/wp-content/uploads/2021/09/killer-covid-vaccine-1024x816-1.png?ssl=1", "https://www.bitchute.com/embed/uBzx3eYozeXz/", "https://www.bitchute.com/video/uBzx3eYozeXz/", "https://www.globalresearch.ca/stop-the-covid-holocaust-open-letter/5755902", "https://www.globalresearch.ca/wp-content/uploads/2021/01/tedros-gates.jpg", "https://i0.wp.com/www.globalresearch.ca/wp-content/uploads/2021/01/tedros-gates.jpg?ssl=1", "https://i0.wp.com/www.globalresearch.ca/wp-content/uploads/2021/09/Screen-Shot-2021-09-13-at-13.53.19.png?ssl=1", "https://i0.wp.com/www.globalresearch.ca/wp-content/uploads/2016/08/Rockefeller.png?ssl=1", "https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history", "https://i0.wp.com/www.globalresearch.ca/wp-content/uploads/2021/03/Screen-Shot-2021-03-03-at-09.09.12.png?ssl=1", "https://nuremberg.law.harvard.edu/nmt_1_intro", "https://nuremberg.law.harvard.edu/nmt_1_intro", "https://i0.wp.com/www.globalresearch.ca/wp-content/uploads/2021/09/Screen-Shot-2021-09-14-at-15.56.04.png?ssl=1", "https://i0.wp.com/www.globalresearch.ca/wp-content/uploads/2021/04/Nuremberg-docotors-War-Crime-Trial.jpg?ssl=1", "https://i0.wp.com/www.globalresearch.ca/wp-content/uploads/2019/02/8.jpg?ssl=1", "https://www.globalresearch.ca/michel-chossudovsky-biographical-summary/5580999", "https://journals.sagepub.com/doi/10.2190/CTXP-RL02-QGB8-6QQ4", "https://journals.sagepub.com/doi/10.2190/CTXP-RL02-QGB8-6QQ4", "https://journals.sagepub.com/doi/abs/10.2190/K31G-5ACT-BAWB-F7PN", "https://www.globalresearch.ca/the-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity/crgeditor@yahoo.com", "https://www.globalresearch.ca/michel-chossudovsky-biographical-summary/5580999", "https://www.globalresearch.ca/author/michel-chossudovsky", "mailto:?subject=%5BShared%20Post%5D%20The%20COVID-19%20%E2%80%9CVaccine%E2%80%9D%20and%20the%20Nuremberg%20Code.%20Crimes%20Against%20Humanity%2C%20Genocide&body=https%3A%2F%2Fnworeport.me%2Fthe-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity-genocide%2F&share=email", "https://nworeport.me/the-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity-genocide/#print", "https://nworeport.me/the-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity-genocide/?share=facebook", "https://nworeport.me/the-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity-genocide/?share=twitter", "#", "https://nworeport.me/the-covid-19-vaccine-and-the-nuremberg-code-crimes-against-humanity-genocide/?share=reddit"], "authors": [], "publish_date": null}