{"result_id": "230010", "URL": "https://nworeport.me/mit-scientist-and-professor-on-exposing-covid-19-vaccine-injuries-you-have-to-be-careful-because-you-could-be-eliminated/", "timestamp": "2023-04-25 16:42:29 CEST+0200", "meta": {"description": "Source: Brian Shilhavy Editor, Health Impact News ICU Doctors and Prestigious Scientists Are Being Threatened for Blowing the Whistle on COVID-19 Vaccine Injuries Today I bring you more evidence that the leaders of the U.S. Government health agencies and the pharmaceutical companies producing the COVID-19 “vaccines” are guilty of crimes against humanity, including mass murder.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/nworeport.me/wp-content/uploads/2018/01/cropped-fgm7iw1t.jpg?fit=32%2C32&ssl=1", "canonical": "https://nworeport.me/mit-scientist-and-professor-on-exposing-covid-19-vaccine-injuries-you-have-to-be-careful-because-you-could-be-eliminated/", "encoding": "UTF-8"}, "image": null, "domain": "nworeport.me", "title": "MIT Scientist and Professor on Exposing COVID-19 Vaccine Injuries: “You Have to be Careful Because You Could be Eliminated”", "cleaned_text": "ICU Doctors and Prestigious Scientists Are Being Threatened for Blowing the Whistle on COVID-19 Vaccine Injuries\n\nToday I bring you more evidence that the leaders of the U.S. Government health agencies and the pharmaceutical companies producing the COVID-19 “vaccines” are guilty of crimes against humanity, including mass murder.\n\nI have been criticized and censored by many even in the alternative media for using such strong language, often being accused of using “sensationalism.”\n\nBut when the truth and the facts are so obvious as they are today, sensationalism is not needed. Just the courage to tell the truth, and expose the criminals, is all that is needed to warn the public.\n\nAnd the truth is that more and more frontline doctors who work with vaccine-injured patients, as well as very prestigious medical scientists and researchers, have tried to blow the whistle on those being killed and injured by these vaccines by informing the leaders at the FDA, CDC, NIH, etc., and not only are their voices being ignored, there is a concerted effort to silence them.\n\nThese professionals are risking not only their careers and livelihoods but possibly their very lives for exposing the truth on just how much harm these experimental gene-altering shots are causing.\n\nThe drug companies and the federal regulatory bodies know full well what is going on, which makes them complicit with these crimes against humanity and mass murder.\n\nThis is the truth, and for my colleagues in the alternative media who don’t have the courage to come out and say this because you are afraid of being labeled with some pejorative term that might affect your funding or popularity, shame on you!\n\nYou too are then complicit with these crimes as these monsters rush as fast as they can to inject as many children and other people as they can before the truth finally catches up with them.\n\nBecause that will happen at some point. At some point, the public narrative will change, because there will be so many people dead and crippled from the shots that it will no longer be able to be denied, even among most of the ignorant and foolish.\n\nToday I am publishing the work of Attorney Aaron Siri who represents more than 12 physicians from ICU units and other frontline hospital jobs that have tried to speak out to the CDC, FDA, and other health organizations about what they are seeing in their patients with vaccine injuries, but are being ignored.\n\nAttorney Siri has filed 11 declarations against these agencies and is threatening further legal action.\n\nThen I have also published another speaker from last week’s Roundtable discussion in Washington D.C. by Senator Ron Johnson, with Dr. Retsef Levi, an Israeli professor at MIT Sloan School of Management who has also tried to warn health officials in Israel and here in the U.S., but has been censored, including being refused publication in academic journals.\n\n11 months now into the mass COVID-19 vaccination campaigns, there is no longer any excuse for those who are allowing these deaths and injuries to continue. It is time to start arresting people and convening citizen grand juries to begin trying their cases, and if found guilty, they should be publicly executed, all in accordance with the Law of the Land, the Constitution of the United States of America.\n\nAnd these criminals are in both political parties, so the sooner we stop making this a partisan issue, the quicker we can start arresting and trying the criminals.\n\nOne Brave ICU Physician Reporting Covid-19 Vaccine Injuries Leads to a Dozen More\n\nOne act of bravery begins to snowball. Dr. Patricia Lee “risked it all” to step forward, after being ignored by public health officials, to reveal the serious series of harms she witnessed from Covid-19 vaccines in her intensive care unit.\n\nWith that one act, my firm has now been contacted by more than a dozen other physicians. Attached are 11 declarations from physicians across the country attesting to serious harms from Covid-19 vaccines.\n\nThese physicians, like Dr. Lee, reached out to public health authorities at the CDC, FDA, and NIH for over ten months only to have their concerns dismissed or ignored.\n\nThese agencies typically respond by saying that VAERS is not showing a safety signal so there is nothing to worry about.\n\nIf you don’t already know, VAERS is the system that the CDC and FDA say cannot show that a vaccine causes an injury, but yet can show a vaccine is safe. Means heads they win, tails you lose.\n\nWorse, many of these physicians were injured by a Covid-19 vaccine themselves, and despite being physicians, the physicians from whom these injured physicians sought treatment also typically dismissed their injuries. And they are physicians seeking help from fellow physicians!\n\nThe story most of these physicians tell is like that of Maddie de Garay who, despite being in a wheelchair and needing a feeding tube through her nose, was told it was psychological.\n\nThese physicians were, incredibly, almost all initially told the same. Only after seeking treatment from physicians that they knew from work or medical school, were many of them believed.\n\nIf physicians are dismissed as “making it up,” imagine what the average individual without medical knowledge and access must deal with after a Covid-19 vaccine injury.\n\nPublic health authorities tell us to trust doctors. If individuals have concerns about the vaccine, they say: “speak with your doctor.” These very doctors are now telling health authorities there is a serious problem.\n\nThey have been telling these health authorities for months in myriad correspondences. And the 11 declarations attached are likely a small sampling – after all, Dr. Patricia Lee’s letter was only released on this Substack when only had a few hundred subscribers. It nonetheless started a snowball of physicians reaching out with similar stories which is growing by the day.\n\nIt should not be that public health authorities listen to physicians only if they parrot their preferred messaging regarding Covid-19 vaccines.\n\nOn the contrary, physicians should especially be listened to when their clinical experience directly opposes that messaging. But the experience of these physicians, and the many more who have contacted my firm, evidence precisely the opposite is true.\n\nThese doctors, like most doctors, are the last individuals that want to admit that a Covid-19 vaccine caused their patients or their own injuries. And they are the last to want to publicly make such an admission. Truly.\n\nBut reality does not afford them these luxuries. The injuries they report are all too real and devastating. As detailed in the attached declarations, most of the injured physicians can no longer work or are severely restricted in their ability to work.\n\nThe lesson yet again is that civil and individual rights should never be contingent upon a medical procedure. Never.\n\nRequiring informed consent – which means giving every American the ability to give or withhold consent without coercion – is the last and final backstop to the dangers that result when we permit the government to decide what must be injected or placed into or onto our bodies.\n\nThis is no hyperbole as the current state of affairs is that you cannot sue the manufacturers for Covid-19 vaccine injuries, cannot see the data underlying the licensure of the vaccine, cannot discuss Covid-19 vaccine injuries on social media, and cannot say no to the vaccine if you want to keep your job or attend many universities.\n\nWhatever your views are on the Covid-19 vaccine itself, every American should reject letting the government decide what medical procedures they must engage in to participate in civil society.\n\nRead the full article and see the attachments at AaronSsiri.substack.com.\n\nMIT Israeli Scientist on Going Against the COVID-19 Vaccine “Mainstream” Narrative: “You Have to be Careful Because You Could be Eliminated”\n\nDr. Retsef Levi is a professor at MIT Sloan School of Management. He was one of the featured speakers last week in Washington D.C. during Senator Ron Johnson’s Roundtable Discussion on COVID-19 Vaccine mandates. We have published the presentations from many of the other participants that attended this meeting hosted by Senator Johnson. See:\n\nDoctors and COVID-19 Vaccine Injured Testify in Washington D.C. to Crimes Against Humanity – CDC, FDA, NIH, Fauci are No Shows\n\nDr. Levi is pro-vaccine and has an impressive bio as a scientist and professor at MIT Sloan School of Management.\n\nRetsef Levi is the J. Spencer Standish (1945) Professor of Operations Management at the MIT Sloan School of Management. He is a member of the Operations Management Group at MIT Sloan and affiliated with the MIT Operations Research Center. Levi also serves as the Faculty Co-Director of the MIT Leaders for Global Operations (LGO). Before coming to MIT, he spent a year in the Department of Mathematical Sciences at the IBM T.J. Watson Research Center as the holder of the Goldstine Postdoctoral Fellowship. He received a Bachelor’s degree in Mathematics from Tel-Aviv University (Israel) in 2001, and a PhD in Operations Research from Cornell University in 2005. Levi spent almost 12 years in the Israeli Defense Forces as an officer in the Intelligence Wing and was designated as an Extra Merit Officer. After leaving the Military, Levi joined an emerging new Israeli hi-tech company as a Business Development Consultant. Levi’s current research is focused on the design of analytical data-driven decision support models and tools addressing complex business and system design decisions under uncertainty in areas such as health and healthcare management, supply chain, procurement and inventory management, revenue management, pricing optimization and logistics. Levi has been leading several industry-based collaborative research efforts with some of the major academic hospitals in the Boston area, such as Mass General Hospital (MGH), Beth Israel Deaconess Medical Center (BIDMC), Children’s Hospital, and across the U.S. (e.g., Memorial Sloan Kettering Cancer Center, NYC Presbyterian Hospital System and the American Association of Medical Colleges). Levi was the PI on an MIT contract with the Federal Drug Administration (FDA) to develop systematic risk management approach to address risk related to economically motivated adulterations of food manufactured in global supply chains. Levi has graduated 10 PhD students, 34 Master students and 6 postdoctoral fellows. He was also awarded several prestigious teaching awards. (Full bio here.)\n\nAs you can see, he has plenty of experience in drug development and working with the FDA.\n\nAnd yet, similar to the frontline physicians who have now sent declarations to the FDA, CDC, and HHS, his concerns about the dangers of the COVID-19 vaccines have been ignored.\n\nDr. Levi then states that a colleague of his at MIT who is a member of the National Academy of Engineering told him:\n\nDr. Levi then goes on to talk about academic fraud and how he and many other scientists saw right away that what Pfizer was publishing about the results of their COVID-19 vaccine trials was seriously flawed, and that their statements regarding efficacy were wrong.\n\nAnd we now also have a whistleblower who worked on the COVID-19 vaccine trials for Pfizer who has also exposed the fraud at Pfizer. See:\n\nWhistleblower Reveals Fraud in Pfizer COVID Vaccine Trials as 5 to 11-Year-Olds Begin to be Injected – Vaccine Deaths and Injuries to Follow\n\nThese scientists tried to get their critiques of the Pfizer studies published in the academic journals but were denied. The only studies published were the ones that conformed to the mainstream narrative, and these studies were basically pure junk.\n\nDr. Levi gives the example of the studies that were just recently published to state that the new booster shots were effective and safe. Most of the patients given the shots in the trials were only followed for less than two weeks in order for the drug companies to declare the vaccines are safe and effective.\n\nHe is very critical of these journals because, regarding safety, they are failing to report any negative side effects, including deaths.\n\nDr. Levi goes on to give an example of this academic censorship.\n\nMe and my co-authors pointed out that when you look at national emergency services calls in Israel for cardiac arrest among young individuals under 40, you see a dramatic increase of 25% of these calls parallel to the vaccination campaign in Israel early in 2021, and we see a statistical association to that campaign. We wrote the paper about that, NOT claiming that there’s a casual effect between the vaccines and what we see, because don’t have the proof for that. But we did raise the concern, and we called authorities to check what is going on. Needless to say, we never got a response from the authorities, and in fact, they went public and called this research “fake.” But even more concerning, journal after journal after journal in the academic literature is rejecting this article, most of the time based on the argument that it is “not a priority.” Well, I don’t think that calling safety concerns “fake” is morally right, or scientifically right. I think it is clear that these vaccines are not naive, and they have serious and unprecedented side effects.\n\nWatch the full presentation by Dr. Levi. This is on our Rumble and Bitchute channels.\n\nComment on this article at", "opengraph": {"locale": "en_US", "site_name": "Nwo Report - nwo world news conservative news alternative nwo news deep state news", "type": "activity", "title": "MIT Scientist and Professor on Exposing COVID-19 Vaccine Injuries: “You Have to be Careful Because You Could be Eliminated”", "description": "Source: Brian Shilhavy Editor, Health Impact News ICU Doctors and Prestigious Scientists Are Being Threatened for Blowing the Whistle on COVID-19 Vaccine Injuries Today I bring you more evidence that the leaders of the U.S. Government health agencies and the pharmaceutical companies producing the COVID-19 “vaccines” are guilty of crimes against humanity, including mass murder. I have been [...]", "url": "https://nworeport.me/mit-scientist-and-professor-on-exposing-covid-19-vaccine-injuries-you-have-to-be-careful-because-you-could-be-eliminated/"}, "tags": ["Health Impact News", "Exposing COVID-19 Vaccine Injuries", "Brian Shilhavy Editor"], "tweets": [], "movies": [], "links": ["https://i0.wp.com/nworeport.me/wp-content/uploads/2021/11/image-524.png?ssl=1", "https://aaronsiri.substack.com/p/one-brave-icu-physician-reporting", "https://aaronsiri.substack.com/p/whistleblower-fda-and-cdc-ignore", "https://www.icandecide.org/wp-content/uploads/2021/05/Letter-to-HHS-CDC-and-FDA-re-VAERS-underreporting.pdf", "https://aaronsiri.substack.com/p/fda-buries-data-on-seriously-injured", "https://aaronsiri.substack.com/p/one-brave-icu-physician-reporting", "https://aaronsiri.substack.com/p/one-brave-icu-physician-reporting", "https://aaronsiri.substack.com/p/covid-19-vaccine-manufacturers-can", "https://aaronsiri.substack.com/p/scientists-sue-the-fda-for-data-it", "https://www.facebook.com/help/230764881494641", "https://www.whitehouse.gov/covidplan/", "https://aaronsiri.substack.com/p/one-brave-icu-physician-reporting", "https://mitsloan.mit.edu/faculty/directory/retsef-levi", "https://healthimpactnews.com/2021/doctors-and-covid-19-vaccine-injured-testify-in-washington-d-c-to-crimes-against-humanity-cdc-fda-hin-fauci-are-no-shows/", "https://mitsloan.mit.edu/faculty/directory/retsef-levi", "https://mitsloan.mit.edu/faculty/directory/retsef-levi", "https://healthimpactnews.com/2021/whistleblower-reveals-fraud-in-pfizer-covid-vaccine-trials-as-5-to-11-year-olds-begin-to-be-injected-vaccine-deaths-and-injuries-to-follow/", "https://rumble.com/vox2td-mit-scientist-on-criticizing-covid-vaccines-you-have-to-be-careful-because-.html", "https://www.bitchute.com/video/76q9F5B9qQiC/", "mailto:?subject=%5BShared%20Post%5D%20MIT%20Scientist%20and%20Professor%20on%20Exposing%20COVID-19%20Vaccine%20Injuries%3A%20%E2%80%9CYou%20Have%20to%20be%20Careful%20Because%20You%20Could%20be%20Eliminated%E2%80%9D&body=https%3A%2F%2Fnworeport.me%2Fmit-scientist-and-professor-on-exposing-covid-19-vaccine-injuries-you-have-to-be-careful-because-you-could-be-eliminated%2F&share=email", "https://nworeport.me/mit-scientist-and-professor-on-exposing-covid-19-vaccine-injuries-you-have-to-be-careful-because-you-could-be-eliminated/#print", "https://nworeport.me/mit-scientist-and-professor-on-exposing-covid-19-vaccine-injuries-you-have-to-be-careful-because-you-could-be-eliminated/?share=facebook", "https://nworeport.me/mit-scientist-and-professor-on-exposing-covid-19-vaccine-injuries-you-have-to-be-careful-because-you-could-be-eliminated/?share=twitter", "#", "https://nworeport.me/mit-scientist-and-professor-on-exposing-covid-19-vaccine-injuries-you-have-to-be-careful-because-you-could-be-eliminated/?share=reddit"], "authors": [], "publish_date": null}