{"result_id": "232016", "URL": "https://off-guardian.org/2021/07/03/vaccine-billionaires-and-human-guinea-pigs/", "timestamp": "2023-04-25 16:43:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2021/07/03/vaccine-billionaires-and-human-guinea-pigs/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Vaccine Billionaires and Human Guinea Pigs", "cleaned_text": "How do you make a potentially dangerous and ineffective drug appear like a miracle of modern science? You could, for instance, enrol only certain people in clinical trials and exclude others or bring the study to a close as soon as you see a spike in the data that implies evidence of effectiveness.\n\nThere are many ways to do it.\n\nAccording to health practitioner and writer Craig Stellpflug in his article ‘Big Pharma: Getting away with murder’(2012), the strategy is to get in quick, design the study to get the result you want, get out fast and make lots of money.\n\nOf course, it helps to get the regulatory agencies on board and to convince the media and health officials of the need for your wonder product and its efficacy and safety. In the process, well-paid career scientists and ‘science’ effectively become shaped and led by corporate profit margins and political processes.\n\nAnd what better way to make a financial killing than by making a mountain out of a molehill and calling it a ‘pandemic’?\n\nThe Wall Street Journal recently published an article by two health professors who said politics — not science — is behind the failure of health officials and the media to fully inform the public about the potential risks associated with COVID vaccines.\n\nAlthough the article is available in full to subscribers only, the Children’s Health Defense (CHD) website provides an informative summary.\n\nThe CHD notes that Dr Joseph A Ladapo, associate professor of medicine at the David Geffen School of Medicine, and Dr Harvey A Risch, professor of epidemiology at Yale School of Public Health, wrote that while prominent scientists have raised concerns that the safety risks of Covid-19 vaccines have been underestimated, the politics of vaccination has relegated their concerns to the outskirts of scientific thinking.\n\nThe two professors noted that clinical studies do not always tell the full story about the safety of medications and that the health effects often remain unknown until the medicine is rolled out to the general public. Examples include Vioxx, a pain reliever that increased the risk of heart attack and stroke; antidepressants that appeared to increase suicide attempts among young adults; and an influenza vaccine used in the 2009-10 swine flu epidemic that was suspected of causing febrile convulsions and narcolepsy in children.\n\nThe authors added that clinical trials often enrol patients who are not representative of the general population and more is learnt about drug safety from real-world evidence. With this in mind, they said the large clustering of side effects following COVID vaccines is concerning as is the silence around these potential signals of harm.\n\nSerious adverse events reported by the Vaccine Adverse Event Reporting System include low platelets, heart inflammation, deep-vein thrombosis and death. However, the two scientists argue this is likely to be a fraction of the total number of adverse events.\n\nThey criticise the Centers for Disease Control and Prevention (CDC) and the US Food and Drug Administration (FDA) for ignoring the reported serious COVID vaccine side effects.\n\nThe authors acknowledge the risks of COVID vaccines in certain populations, not least children, may outweigh the benefits. They also state that not a single published study has demonstrated that patients with a prior infection benefit from COVID-19 vaccination. Something which is not readily acknowledged by the CDC or Anthony Fauci, an indication, according to the authors, of how deeply entangled pandemic politics is in science.\n\nThey conclude that public health authorities are making a mistake and risking public erosion of trust by not being forthcoming about the possibility of harm from the vaccines.\n\nIt is revealing that the two scientists refer to Vioxx, which was once popular for treating the symptoms of arthritis. It was removed from the market in 2004 after concerns that it may have injured hundreds of thousands of patients, while possibly killing tens of thousands in the US.\n\nDr David Graham, whistleblower and senior FDA investigator, criticised the FDA’s approval process of Vioxx (rofecoxib), an anti-inflammatory drug administered orally. In various interviews and congressional hearings, he described the outcome of Vioxx as disastrous and unparalleled in the history of the US. He added that the saga surrounding Vioxx had constituted an unprecedented failure of the nation’s system of drug approval and oversight.\n\nIn 2004, Graham argued that the painkiller had caused 88,000 to 139,000 heart attacks in the US – 30-40 per cent of which were fatal – over the previous five years. Nevertheless, manufactured by Monsanto (a company with a proven track record of corrupt practices) and co-marketed by Merck, Vioxx became a leading drug in providing pain relief from the symptoms of various forms of arthritis.\n\nResearch presented to the FDA in early 2001 showed that patients taking Vioxx had a higher risk of heart attack compared to those taking some of the older alternatives.\n\nHowever, the real game-changer came in 2004 when Dr Graham released the findings that found Vioxx increased the chance of heart attack and death from cardiac arrest significantly more than its biggest rival on the market. Dosages of Vioxx in excess of the recommended daily dose of 25 milligrams were also found to more than triple a patient’s risk compared to those who had not taken painkillers.\n\nIn September 2004, Vioxx was pulled from the market. But in 2006, more damning findings were revealed by a study that showed that some patients had likely suffered from a heart attack much sooner after starting treatment with Vioxx.\n\nAppearing in the Canadian Medical Association Journal, the study showed that 25 per cent of the patients who had heart attacks while taking Vioxx did so within two weeks of starting the drug. This indicated that Vioxx-related cardiovascular risks may occur much earlier than previously thought.\n\nThe FDA was criticised for its close relationship with Merck and witnesses at a senate finance committee hearing described how danger signals of Vioxx went ignored. Indeed, a 2007 article published by the National Institutes of Health alleged that even though scientists at Merck knew that the drug might adversely affect the cardiovascular system, none of the intervention studies submitted to the FDA in 1998 were designed to evaluate such risk.\n\nMerck reported over $11 billion in Vioxx sales during the five years the drug was on the market. To date, the company has paid nearly $6 billion in litigation settlements and criminal fines over Vioxx. Still, in hard-nosed commercial terms, it was a massive success, resulting in a $5 billion gain for the company.\n\nIn May 2021, it was reported that Covid-19 vaccines had created at least nine new billionaires. According to research by the People’s Vaccine Alliance, the new billionaires included Moderna CEO Stéphane Bancel and Ugur Sahin, the CEO of BioNTech, which has produced a vaccine with Pfizer. Both CEOs were then worth around $4 billion. Senior executives from China’s CanSino Biologics and early investors in Moderna have also become billionaires.\n\nAlthough the nine new billionaires are worth a combined $19.3 billion, the vaccines were largely funded by public money. For instance, according to a May 2021 report by CNN, BioNTech received €325 million from the German government for the development of the vaccine. The company made a net profit of €1.1 billion in the first three months of the year, largely thanks to its share of sales from the Covid-19 vaccine, compared with a loss of €53.4 million for the same period last year.\n\nModerna’s Covid-19 vaccine sales reached $1.7 billion in the first three months of this year and it had its first profitable quarter ever. Moderna is expected to make $13.2 billion in Covid-19 vaccine revenue in 2021. The company received billions of dollars in funding from the US government for development of its vaccine.\n\nBig Pharma has every reason to perpetuate the notion of a deadly global pandemic and to inflate the efficacy of and need for its vaccines. And it, along with its associates in government and at the WHO, has every reason to discredit alternative and arguably more effective treatments like Ivermectin (see the online article ‘The Campaign against Ivermectin: WHO’s Chief Scientist Served with Legal Notice for Disinformation and Suppression of Evidence‘).\n\nThere is no need to cover ground here that has been covered extensively elsewhere but it is now abundantly clear that many continue to question the overall official COVID-19 narrative, the fear propaganda, the specific data, the PCR testing protocols, the apparent conflicts of interest and vaccine efficacy.\n\nMoreover, A group of 57 leading scientists, doctors and policy experts recently released a report calling in to question the safety and efficacy of the current Covid-19 vaccines. They are calling for an immediate end to all vaccine programmes.\n\nThere are hundreds of scientists who have questioned governmental and WHO strategy and who have brought attention to the extremely low risks posed by COVID to the bulk of the population as well as the destructive (ineffective) policies and decisions pertaining to lockdowns and other restrictions.\n\nThere are many other top scientists who are questioning the need for mass vaccination and who have also pointed out credible and extremely disturbing side effects (real and potential) of such a strategy, not least Dr Robert Malone, credited with developing mRNA vaccine technology, Dr Byram Bridle, a viral immunologist, and Dr Geert Vanden Bossche, a prominent virologist and vaccine expert.\n\nUnlike Merck and Vioxx, it will be governments (the public) that foot any future indemnity costs of these experimental vaccines that have escaped proper (long-term) testing. And given the scale of the rollout, the damage caused could make the adverse effects of Vioxx seem a mere blip.\n\nVaccines that were brought to market via emergency authorisation use for an ‘emergency’ constructed on the basis of deaths so often wrongly attributed to COVID-19. Brought to market on the basis of flawed PCR test protocols with magnification cycles primed to create a ‘casedemic’.\n\nTo borrow from Dr David Graham: are we currently witnessing something more disastrous and unparalleled in the history of the world, let alone the US: an unprecedented failure of gobal drug approval and oversight?\n\nIn the meantime, while billions of vaccinated people serve as human guinea pigs, the newly crowned vaccine kings will make hay while the sun shines (and the fear continues).\n\nColin Todhunter is an independent journalist who writes on development, environmental issues, politics, food and agriculture. In August 2018 he was named as one of 400 Living Peace and Justice Leaders and Models by Transcend Media Services, in recognition of his journalism.", "opengraph": {"type": "article", "title": "Vaccine Billionaires and Human Guinea Pigs", "url": "https://off-guardian.org/2021/07/03/vaccine-billionaires-and-human-guinea-pigs/", "description": "Colin Todhunter How do you make a potentially dangerous and ineffective drug appear like a miracle of modern science? You could, for instance, enrol only certain people in clinical trials and exclu…", "article:published_time": "2021-07-03T12:00:33+00:00", "article:modified_time": "2021-07-03T13:53:47+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/syringe-vaccines-money-profit-shadow-scaled.jpg", "image:width": "2560", "image:height": "1792", "locale": "en_US"}, "tags": ["Big Pharma", "Craig Stellpflug", "Vioxx", "Moderna", "David Graham", "Colin Todhunter", "vaccines", "Pfizer", "covid19", "coronavirus", "Merck"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/syringe-vaccines-money-profit-shadow-scaled.jpg", "https://www.naturalnews.com/036096_Big_Pharma_murder_fatalities.html", "https://www.wsj.com/articles/are-covid-vaccines-riskier-than-advertised-11624381749", "https://childrenshealthdefense.org/defender/wsj-op-ed-politics-behind-failure-covid-vaccine-risks/%20%20", "https://www.cdc.gov/vaccinesafety/concerns/history/narcolepsy-flu.html", "https://childrenshealthdefense.org/defender/cdc-vaers-data-deaths-adverse-events-covid-vaccines-including-children/", "https://vaers.hhs.gov/", "https://childrenshealthdefense.org/defender/david-mallozzi-myocarditis-pfizer-vaccine-hospital-not-reporting-vaers/", "https://childrenshealthdefense.org/defender/19-year-old-dies-heart-problem-moderna-vaccine/", "https://www.sciencedaily.com/releases/2006/05/060502172943.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1779871/", "https://app.box.com/s/c487wmiyquh9q1glpbatzf5sukls7ph2", "https://www.globalresearch.ca/ivermectin-who-chief-scientist-served-legal-notice-disinformation-suppression-evidence/5746871", "https://www.globalresearch.ca/57-top-scientists-doctors-release-shocking-study-covid-vaccines-demand-immediate-stop-all-vaccinations/5746848", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2021-07-03T12:00:33+00:00"}