{"result_id": "232005", "URL": "https://off-guardian.org/2022/09/03/vaccine-vultures/", "timestamp": "2023-04-25 16:43:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/09/03/vaccine-vultures/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Vaccine Vultures", "cleaned_text": "Vultures are birds that seek out wounded animals about to die and then swoop down on them when they are dead (or close to death) and devour them—apocryphally starting with gouging out the eyes.\n\nVultures are typically not classed in the “warm and fuzzy” anthropomorphic grouping, although they accomplish a great service to the ecology of the planet, such as other animals thrown in the “yuck” bucket of human perception such as flies, spiders, laughing hyenas, and carrion beetles (who knows what a carrion beetle is?—they ARE pretty, so before you know what they do for a living, you might like them).\n\nSo are we human vultures when we swoop down on dead or dying people we have heard about to see if they are vaxxed or not and if what they are suffering or dying from is due to the jab? Two? Three, god forbid four?\n\nAt the beginning of the vaccine madness, I was quite brazen and would unashamedly blurt out when hearing of someone’s misfortune, “were they vaccinated???!!!” I never got brazen enough to ask this to the person suffering (obviously if dead), but did to their friends, or whoever was explaining what was happening.\n\nI eventually backed off of the personal incidents I was experiencing as it did seem a bit too vulture-like, but I still would ask sheep in my company what they thought of dozens of athletes dropping in the fields, now extended out to just average Joe’s not waking up or doctors way too young to be experiencing such severe cardiac issues.\n\nNow I don’t even do that. I just listen.\n\nIt seems this particular vulture just enjoys the shock of seeing no one (sheep) realizing the secret. “You’ll see,” I say to myself, in my evil vulture voice. “You’ll see.”\n\nNow, isn’t that sick? Maybe. But what else is this experience going to drive us to if not un-empathetic lunacy. Think of Lord of the Rings’ Gollum. Isn’t that what did him in?\n\nWe have been put into this untenable position of finding “joy” or at least “satisfaction” in the trauma of another. At its worse it is a form of schadenfreude, pleasure derived from another’s misfortune. But I would argue this is not really the case. I do not think what we are feeling (assuming others are fellow vaccine vultures) is “pleasure” and whatever it is that we are feeling is not due to someone else’s health misfortune.\n\nOf course the definition does include “self satisfaction from another’s failures”—maybe that is the closest schadenfreude comes to defining vaccine vultures.\n\nI recall a scene in the movie Fail Safe staring Henry Fonda, Larry Hagman, and Walter Matthau. Assuming most of you have seen this I will not elaborate: the scene I am speaking of takes place in the operation room where all the military men have been assigned the task of shooting down their own planes because they had been given false orders to nuke Moscow.\n\nThe US manages to shoot down one of the planes as the only way to avoid nuclear disaster. All in the ops room cheer. They are immediately told to pipe down, which they do realizing their “mistake.”\n\nWe certainly could be put into a similar position in our everyday lives where the only way to remedy a problem, a huge one, is for people to see for themselves the result of the problem (such as vaccine adverse effects) by suffering the problem directly. It is a cognitive dissonant moment for sure, but at least understandable if you are aware of the entire truth surrounding it.\n\nOf course the vaccine “cheer” is not the same as the scene from Fail Safe. There is definitely no cheering, just a sick feeling of despair, but also the feeling of validation, which is the dicey part, “this is just what they have been saying would happen.”\n\nThat is clearly sobering, but also carries a tinge of hope. “Maybe this will be enough for everyone to know, and then to do something about it.” There ARE treatments to mitigate the pathology of the vaccines, but of course no one, or very few, are aware they need them.\n\nI recently saw the Stew Peters show about Canadian doctors “dropping dead in droves” since doctors have been required to get the fourth booster in order to work (I believe this was in Canada’s Alberta, but I am sure it is happening in other places as well). Why is this not considered unconscionable to just ignore? “Well, a lot of other doctors who took the booster are fine, only 28 have suddenly died.” Two of them had cancer…does that take them out of the “vaccine caused” pool? I don’t think so.\n\nThere are many similar talk show presentations recently about such things, “Sudden Adult Death Syndrome,” doctors dying after the latest booster, cancers recurring with a vengeance after years of remission, children dying of myocarditis. These are just a few brought to my attention: here, here and here.\n\nAnd it is not only in the alternative media. I hear these same stories from friends and colleagues. If they are sheep telling me, they are just shocked, but of course do not correlate it to the vaccine. If they are shrews they too are shocked, but not so much because of what is happening, but because no one else (sheep) seem to get it at all.\n\nJust the other day I was driving to a restaurant with my wife and passed a house in the neighborhood with a police car in the driveway and a black coroner’s van pulling up to the house. My wife says, “Oh gosh, I guess someone has died. How sad.”\n\nOn the way home we saw in another part of the ‘hood an ambulance with the lights flashing in someone’s driveway. “Wow,” my wife says. “Wow, indeed,” I murmur—two wows for two different reasons. My wife just thinks it is a coincidence. I don’t, I actually don’t recall ever seeing anything like it before.\n\nBut is it a coincidence? Am I paranoid? Maybe. But my vulture alarm goes off and I start wishing I knew if either victim was vaccinated.\n\nI have recently decided that the number one culprit for keeping sheep asleep is the media. The media has always played the role of the unbiased family member that will let you in on any corruption it saw in our leaders or other groups trying to get our attention. I think that is still true (that people rely on media for that reason) but the corruption is now in the media, at least the mainstream media.\n\nWe have been brainwashed to believe anything other than the New York Times, The Washington Post, CNN, or other puppets of the system, is pure hogwash. It is now the other way around. I do believe that if any of these “gods of media” ran a story like we see day in and day out in the alternate media, many sheep heads would turn regardless what the venerated talking heads of government and power had to say.\n\nAll the rest of us are struggling and trying to make heads or tails out of all this. Thus the vultures come out not as carrion devourers but as inquisitive, and partially confused shrews trying to find validation in a sea of relentless lies. We don’t want our fellow humans to suffer and die, we just want everyone to see the truth the way we do.\n\nChicken Little didn’t want the sky to fall, she just wanted everyone to know it was falling so they could avoid the crushing, and destructive, results. Our Chicken Little story is different than the classic, because in our story the sky really is falling, and very few see that it is.\n\nTodd Hayen is a registered psychotherapist practicing in Toronto, Ontario, Canada. He holds a PhD in depth psychotherapy and an MA in Consciousness Studies. He specializes in Jungian, archetypal, psychology. Todd also writes for his own substack, which you can read here", "opengraph": {"type": "article", "title": "Vaccine Vultures", "url": "https://off-guardian.org/2022/09/03/vaccine-vultures/", "description": "Todd Hayen Vultures are birds that seek out wounded animals about to die and then swoop down on them when they are dead (or close to death) and devour them—apocryphally starting with gouging out th…", "article:published_time": "2022-09-03T07:00:50+00:00", "article:modified_time": "2022-09-02T09:17:07+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/adobe-stock-vultures-tree-night-scaled.jpeg", "image:width": "2560", "image:height": "1707", "locale": "en_US"}, "tags": ["sudden adult death syndrome", "Canada", "vaccines", "covid19", "Doctors", "coronavirus", "Alberta", "Todd Hayen"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/oicYUhgff7Q\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/oicYUhgff7Q"}], "links": ["https://shrewviews.substack.com/p/sheep-and-shrew?s=w", "https://stevekirsch.substack.com/p/doctors-in-canada-are-dying-at-a?r=jwnzw&s=r&utm_campaign=post&utm_medium=email&fbclid=IwAR3Zbaqnh3ypXicdtVAoo-K8Y-bod7Acqarql05qHL9z0vSVWVpJqwRaMow", "https://www.looper.com/194430/gollums-entire-backstory-explained/", "https://www.imdb.com/title/tt0058083/?ref_=fn_al_tt_1", "https://rumble.com/v1gypvd-hundreds-of-canadian-doctors-dead-genocide-confirmed-after-4th-booster-mand.html", "https://celiafarber.substack.com/p/the-killing-fields-sudden-deaths?r=184bmm&utm_medium=ios", "https://www.bitchute.com/video/gkQ7LsHPASA/", "https://palexander.substack.com/p/bhakdi-and-palmer-vascular-and-organ?utm_source=substack&utm_medium=email", "https://shrewviews.substack.com/p/sheep-and-shrew?s=w", "http://shrewviews.substack.com/", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-09-03T07:00:50+00:00"}