{"result_id": "232018", "URL": "https://off-guardian.org/2021/11/18/swedens-vaccine-passes-should-teach-us-an-important-lesson/", "timestamp": "2023-04-25 16:43:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2021/11/18/swedens-vaccine-passes-should-teach-us-an-important-lesson/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Sweden’s “Vaccine Passes” should teach us an important lesson.", "cleaned_text": "The Scandinavian country has been a touchstone for lockdown skeptics, but this U-turn shows us the danger of accepting any part of the narrative.\n\nThe Swedish Public Health Agency (PHA) has announced that, starting next month, gatherings of more than 100 people will require “Covid passes” showing vaccination status.\n\nUnlike similar schemes in other countries, a negative test will not be accepted as a substitute – either you’re vaccinated, or you can’t enter the venue.\n\nThere’s no talk yet of including restaurants, bars or cafes in this…but it is still early.\n\nThe PHA published a press release yesterday, detailing the plans. Quoted in The Local, Sweden’s culture minister Amanda Lind said:\n\nThe vaccination pass comes on the heels of announcing the re-introduction of other “anti-COVID” measures, including limitations on mass indoor gatherings. The pass is being described as a way to get around these restrictions by “guaranteeing that participants are vaccinated”.\n\nFrom the beginning of the “pandemic” Sweden has been almost an outlier. Their refusal to lockdown was held up as an example of irresponsible laissez-faire libertarianism in the mainstream press, but made it an important touchstone for lockdown sceptics who viewed it as a bastion of common sense.\n\nIt turns out neither is true.\n\nWhile Germany, Austria, New Zealand, Canada (and others) have gone full fascist brutally suddenly, Sweden is taking the scenic route. Rather than refusing to comply with the narrative, Sweden is simply using a looser net to catch the stragglers.\n\nThose championing Sweden’s approach to Covid have just been caught in a supranational game of “good cop, bad cop”.\n\nIt shouldn’t really come as a surprise, the warning signs were all there.\n\nFor starters, the sheer amount of coverage given to the “Swedish approach” should have tipped people off.\n\nLet’s take a moment to remind ourselves that the countries that have really rejected the Covid narrative in its entirety – such as Belarus – are never in the news.\n\nIn fact the governments that genuinely refused to play ball all had colour revolutions (or attempted ones at least), or saw their presidents die of sudden heart attacks.\n\nSweden suffered no such bad luck. Because it was playing its part.\n\nFor over a year and a half, Sweden has been portrayed as the calm voice in a room of panicking hysterics. They ‘refused’ to lockdown, and their “covid deaths” never reached the disastrous predictions of the modellers, whilst their economy suffered markedly less than the rest of Europe.\n\nPlaying that level-headed role has bought them credibility in Lockdown-sceptic circles, which can now be parlayed into an argument for vaccine passes: “Oh you hate vaccine passports? Well you love Sweden and they have them there!”\n\nIt’s all about manipulation – getting the doubters to concede to your narratives bit by bit without realizing they are doing so.\n\nBy supporting Sweden’s no lockdown approach, because it seems relatively sane, you concede, without fully realizing it, that there is a pandemic, and it does require some kind of intervention.\n\nThe same can be said for the “alternate therapies” and “pre-existing immunity” arguments.\n\nAlthough both seem to have scientific evidence supporting them, the argument is built on a priori assumptions which concede the basic reality of the pandemic narrative.\n\nAnd you will never win if you play by those rules. This is their pandemic and they can reinvent it in any way they choose.\n\nThink promoting ivermectin is a good way of opposing the vaxx without alienating the believers? No!\n\nYou have to follow rules. They don’t. They can just invent a new “variant” out of wholecloth. One that is “resistant to ivermectin”.\n\nAnd then what do you do?\n\nIt’s a simple and important lesson, hopefully, forced home by now:\n\nDon’t part-accept irrationality in an effort to be reasonable. Don’t try and meet insanity in the middle. Deal only in what you can research and observe yourself.\n\nDon’t attempt to compromise with the establishment, because they will never compromise back. There is no middle way.\n\nNever, EVER, accept part of their narrative on trust.\n\nSweden should teach us never to pick sides in the Covid game, because it’s all rigged and the only way to win is not to play.", "opengraph": {"type": "article", "title": "Sweden’s “Vaccine Passes” should teach us an important lesson.", "url": "https://off-guardian.org/2021/11/18/swedens-vaccine-passes-should-teach-us-an-important-lesson/", "description": "Don’t part-accept irrationality in an effort to be reasonable. Don’t try and meet insanity in the middle. Deal only in what you can research and observe yourself. Don’t attempt to…", "article:published_time": "2021-11-18T14:00:57+00:00", "article:modified_time": "2021-11-19T19:43:39+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/sweden-covid-policy.jpg", "image:width": "1364", "image:height": "910", "locale": "en_US"}, "tags": ["vaccine passports", "Covid+", "ivermectin", "Sweden", "coronavirus", "lockdown"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/sweden-covid-policy.jpg", "https://off-guardian.org/wp-content/medialibrary/Swedens-Vaccine-Passes-should-teach-us-an-important-lesson-01-Edit-1-MONO-2.mp3", "https://www.folkhalsomyndigheten.se/nyheter-och-press/nyhetsarkiv/2021/november/nya-atgarder-for-att-minska-spridning-av-covid-19/", "https://www.thelocal.se/20211117/analysis-will-sweden-introduce-covid-vaccine-passes/", "https://off-guardian.org/2020/08/16/belarus-in-the-firing-line-for-a-colour-revolution/", "https://off-guardian.org/2020/07/14/coronavirus-and-regime-change-burundis-covid-coup/", "https://off-guardian.org/2021/03/12/tanzania-the-second-covid-coup/", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2021-11-18T14:00:57+00:00"}