{"result_id": "232033", "URL": "https://off-guardian.org/2022/11/24/new-study-blames-vaxxed-deaths-on-the-unvaxxed-because-they-cause-anxiety-seriously/", "timestamp": "2023-04-25 16:43:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/11/24/new-study-blames-vaxxed-deaths-on-the-unvaxxed-because-they-cause-anxiety-seriously/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "New study blames VAXXED deaths on the UNVAXXED…because they cause anxiety. Seriously.", "cleaned_text": "New study blames VAXXED deaths on the UNVAXXED…because they cause anxiety. Seriously.\n\nI mean, the headline says it all really. A study published in August in the Journal of BioMedicine actually claims in its abstract:\n\nFear mongering and misinformation being peddled by people with no scientific training to terrorise people into staying unvaccinated is not just causing people to remain susceptible to viral outbreaks, but could also be causing more side effects seen in the vaccination process. This brief review will offer data that may demonstrate that misinformation perpetuated by the anti-vaccination movement may be causing more deaths and side effects from any vaccine.\n\nYes, apparently all those people suddenly dropping dead of heart attacks and strokes are being stressed into it by us anti-vaxxers warning them about heart attacks and strokes.\n\nNow, if you’re thinking that’s the most ridiculous thing you’ve ever heard…well, you’re wrong. He’s done the research:\n\nA mini review of published literature has been conducted and found that mental stress clearly causes vasoconstriction and arterial constriction of the blood vessels. Therefore, if subjects are panicked, concerned, stressed or scared of the vaccination, their arteries will constrict and become smaller in and around the time of receiving the vaccine.\n\nSee, they’re not dying because the vaccine gave them a heart attack…they’re dying because they were afraid it might.\n\nBrilliant logic. And a sound argument for taking warnings off cigarettes and taking all the anti-alcohol ads off the TV. Just think how many people died of alcohol related heart problems because they were scared of alcohol.\n\n…You don’t need me to tell you how absurd this is.\n\nBy far the most ridiculous explanation for vaccine-caused heart attacks yet, and that includes high energy bills and “post-pandeimc stress disorder”.\n\nIt’s been a rough couple of years for The ScienceTM, but this is a new low.\n\nA shout-out to Mark Crispin Miller for featuring this study on his substack Notes From the Underground. A great read and a highly recommended subscribe.", "opengraph": {"type": "article", "title": "New study blames VAXXED deaths on the UNVAXXED…because they cause anxiety. Seriously.", "url": "https://off-guardian.org/2022/11/24/new-study-blames-vaxxed-deaths-on-the-unvaxxed-because-they-cause-anxiety-seriously/", "description": "Kit Knightly I mean, the headline says it all really. A study published in August in the Journal of BioMedicine actually claims in its abstract: Fear mongering and misinformation being peddled by p…", "article:published_time": "2022-11-24T23:30:11+00:00", "article:modified_time": "2023-01-29T13:23:13+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/heart-hammers.jpg", "image:width": "2050", "image:height": "1366", "locale": "en_US"}, "tags": ["strokes", "post pandemic stress disorder", "blood clots", "heart attacls", "stress", "vaccines", "covid19", "coronavirus", "bio medicine"], "tweets": [], "movies": [], "links": ["https://www.biomedicinej.com/biomedicine/vol12/iss3/1/", "https://substack.com/profile/37258171-mark-crispin-miller", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-11-24T23:30:11+00:00"}