{"result_id": "232026", "URL": "https://off-guardian.org/2022/03/11/reality-check-100-day-vaccines-are-not-possible/", "timestamp": "2023-04-25 16:43:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/03/11/reality-check-100-day-vaccines-are-not-possible/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Reality Check: “100 day vaccines” are NOT possible.", "cleaned_text": "They want us to believe the “next pandemic” will have a safe vaccine in three months. That flies in the face of reality.\n\nNeatly nestled behind the Ukraine headlines plastered all over the front pages, this past week has seen the World Health Organization meeting to discuss the global legislation to empowering the WHO to combat “future pandemics”.\n\nThe first consultation was held on March 1st. The EU passed a motion authorizing the bloc to negotiate such a treaty on March 3rd.\n\nNobody knows exactly what the hypothetical international regulations – dubbed the “Pandemic Treaty” – would entail, but there are hints.\n\nIt’s almost certainly going to involve some kind of international vaccine passport, possible based on the SMART Health Cards currently rolling out all across the US.\n\nIt’s also interesting to note that this treaty is being developed in parallel to the UK “reforming” their Human Rights Act 1998 into a new “UK bill of rights” which seeks to prevent the “abuse” of “rights culture” and place a new emphasis on “social responsibility”.\n\nHowever, the specifics will remain a mystery until the final proposal is published later this year.\n\nOne thing we do know though, is that a big part of the proposed “strengthening” of our pandemic response will be increased funding and resources for developing vaccines even faster than the Covid vaccine.\n\nThis aim was announced at the recent Global Pandemic Preparedness Summit in London, where the Coalition for Epidemic Preparedness Innovations (CEPI) announced their “100 Days Mission”.\n\nCEPI, for those who don’t know, is a foundation jointly funded by (among others) the Bill and Melinda Gate Foundation and the World Economic Forum, whose stated aim is “to develop vaccines to stop future epidemics”.\n\nThe 100 Days Mission, which already has its own website and a trending hashtag (#100DaysMission), is pretty much exactly what it sounds like.\n\nIn future CEPI wants to produce new vaccines for unknown emerging diseases – what they call Disease X – within 100 days of the pathogen being isolated.\n\nThey’ve already secured 1.5 BILLION pounds sterling to further this effort.\n\nOver a billion pounds to produce vaccines for a disease that – as yet – does not even exist, and may never exist.\n\nThis looks like a further step in the process, begun by the ‘pandemic’ narrative, of redefining everything we previously understood about how infective agents and vaccines interact.\n\nCovid, let’s remember, was a disease-narrative totally removed from all social, scientific and historical context to create a fluid, agenda-driven alternate reality. And it looks as if this is intended to be the ‘new normal’.\n\nHere’s a little refresher course on just how fast the Covid vaccines sped through the usual scientific process:\n• The virus was allegedly discovered in December.\n• It was fully genetically sequenced by January 10th 2020.\n• The paper that all the PCR tests were based on was peer-reviewed in less than 24 hours.\n• After decades of failure, the human race produced a dozen effective coronavirus vaccines in less than three months.\n• These vaccines were then “safety tested” in less than six months.\n\nAll told, from ‘discovering’ the virus to getting the vaccine(s) approved for use on people, it took 300 days.\n\nThis process normally takes at least 3-10 years.\n\nIt usually takes at least 5-10 years to bring a fully-tested vaccine to market. A paper by Pronker et al, “Risk in vaccine research and development quantified” (PubMed 2013), estimates the average development time for a new vaccine to be over 10 years.\n\nSimply put, it has never been possible to make a vaccine for a new disease in 1000 days, let alone 100.\n\nThe speed with which the covid vacines were produced is totally unprecedented in the history of vaccines.\n\nThe idea you could further reduce this unprecedented time frame, and produce a safe and effective vaccine in only 100 days is frankly absurd. It’s surreal. Fictional.\n\nFor one thing, the vast majority of candidate vaccines don’t work.\n\nThe Pronker paper, found that of all potential vaccines products being researched, only about 6% ever actually hit the market.\n\nSo, back in the real world, a vaccine manufacturer will go through that 5-10 year process knowing there is a ~94% chance there will be nothing to show for it in the end.\n\nAfter decades of trying they haven’t managed to produce a vaccine against AIDs, or the flu, or malaria or many other common diseases. These are conditions they know and (allegedly) understand, but they cannot make vaccines for them.\n\nSo, in that old world of veridical reality, even if you managed to make a vaccine in 100 days, the odds are it either won’t produce immunity, or it will but will also produce harmful side effects, or maybe it will do literally nothing.\n\nNow, granted, science and technology are not static. We are always moving forward and making progress…but that’s irrelevant to this issue, because even if vaccine manufacturing technology really did take a huge leap forward just in time to battle covid, you still can’t produce a safe vaccine in 100 days, or even 300 days – because the process NEEDS time.\n\nIt takes time to test rigorously, it takes time – a lot of it – to a assess long term side effects. The clue is right there in the name.\n\nNo amount of new tech is going to permit you to know the ten-year effects of a vaccine in under three months.\n\nWith the public eye fixed on Ukraine, and Covid now firmly in the collective unconsciousness’s rearview mirror the powers that be are trying to normalise what was, inherently, an abnormal, unreal (if not impossible) process. To make it easier “next time”.\n\nWe’ve already seen Bill Gates lament that the vaccine was too slow, and he was partially right. The Covid story didn’t keep people hypnotized enough to secure everything they needed, in part because their “vaccine” rollout took almost a year.\n\nBut for the future “Disease X” waiting in the wings, it will officially only take three months, and the fear will still be fresh. The fact the process will be completely incompatible with reality or sense will not matter in the slightest.\n\nTo be clear: You cannot develop a “safe and effective” vaccine for a brand new disease in three months.\n\nYou can’t do it in one year.\n\nAnd if in the future they claim to have done so, they will be lying.", "opengraph": {"type": "article", "title": "Reality Check: “100 day vaccines” are NOT possible.", "url": "https://off-guardian.org/2022/03/11/reality-check-100-day-vaccines-are-not-possible/", "description": "Kit Knightly Neatly nestled behind the Ukraine headlines plastered all over the front pages, this past week has seen the World Health Organization meeting to discuss the global legislation to empow…", "article:published_time": "2022-03-11T13:00:58+00:00", "article:modified_time": "2022-03-11T17:46:06+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/100-days-mission-covid.jpg", "image:width": "2050", "image:height": "950", "locale": "en_US"}, "tags": ["flu", "CEPI", "Bill Gates", "coronavirus", "WHO"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/100-days-mission-covid.jpg", "https://www.consilium.europa.eu/en/policies/coronavirus/pandemic-treaty/", "https://off-guardian.org/2022/02/26/who-planning-new-pandemic-treaty-for-2024/", "https://off-guardian.org/2022/03/01/who-moving-foward-on-global-vaccine-passport-program/", "https://off-guardian.org/2022/02/08/uk-reforming-human-rights-law-compulsory-vaccines-on-the-horizon/", "https://www.gov.uk/government/speeches/minister-milling-speech-at-the-cepi-global-pandemic-preparedness-summit-2022", "https://en.wikipedia.org/wiki/Coalition_for_Epidemic_Preparedness_Innovations", "https://100days.cepi.net/", "https://twitter.com/hashtag/100DaysMission?src=hashtag_click", "https://en.wikipedia.org/wiki/Disease_X", "https://www.cidrap.umn.edu/news-perspective/2020/01/china-releases-genetic-data-new-coronavirus-now-deadly", "https://off-guardian.org/2021/09/22/30-facts-you-need-to-know-your-covid-cribsheet/", "https://news.sky.com/story/world-must-roll-out-jab-for-next-pandemic-virus-in-just-100-days-scientist-behind-oxford-covid-vaccine-says-12560169", "https://pubmed.ncbi.nlm.nih.gov/23526951/", "https://pubmed.ncbi.nlm.nih.gov/23526951/", "https://twitter.com/backtolife_2022/status/1494820172389040128", "https://off-guardian.org/2022/02/20/this-week-in-the-new-normal-23/", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-03-11T13:00:58+00:00"}