{"result_id": "232003", "URL": "https://off-guardian.org/2022/06/24/polio-outbreak-the-who-bill-gates-emergency-vaccines-more-of-the-same/", "timestamp": "2023-04-25 16:43:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/06/24/polio-outbreak-the-who-bill-gates-emergency-vaccines-more-of-the-same/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "“Polio Outbreak” – The WHO, Bill Gates, emergency vaccines & more of the same", "cleaned_text": "“Polio Outbreak” – The WHO, Bill Gates, emergency vaccines & more of the same\n\nPolio is on the front pages of British newspapers again for the first time in decades. What a time to be alive.\n\nFor those who missed it, two days ago the UK government declared a “national incident” after traces of the polio virus were detected in sewage from North London.\n\nThis is a massive escalation, even compared to the pandemic. Covid and Monkeypox at least had the good taste to wait for a single person to actually have the disease (allegedly) before hitting the big red panic button.\n\nIn a somewhat startling coincidence, just two days before the “polio in London” news broke, Forbes published an article headlined…\n\nIt’s totally unrelated, talking about a “polio-like” enterovirus that hasn’t yet had a vaccine approved in the US, and never mentions London once.\n\nThe same (or similar) news hitting headlines around the world for (supposedly) totally different reasons makes my inner-cynic twitch.\n\nSo, what’s going on here?\n\nWhile it may look like polio is suddenly back in the news, it’s actually been there longer than you’d think and has been building to this point.\n\nThe truth is it all fits into a very predictable pattern.\n\nIn November of 2020, a new “genetically engineered” and “triple-locked” polio vaccine was the first vaccine to be granted “emergency use listing” by the World Health Organization, despite there being only around five thousand cases of polio in the world over the last decade.\n\nIn October 2021, the government of Ukraine declared a “biological emergency” due to the “re-emergence” of polio, which was blamed on low vaccine uptake.\n\nThis was steadily reported in back pages of the news for months. Culminating in headlines like “Polio Makes a Comeback in Ukraine as War Halts Vaccination Campaign”, following Russia beginning its “special operation”.\n\nLater, in March of this year, Israel reported they too had a “re-emergence” of polio after allegedly detecting “vaccine-derived” polio in the stool of a young girl suffering from paralysis.\n\nAt this point, the Global Polio Eradication Initiative (GPEI) started speaking out. GPEI is a project co-funded by the WHO, the US CDC, GAVI the vaccine alliance and the Bill and Melinda Gates Foundation.\n\n…in other words, exactly who you’d expect.\n\nFollowing the reported case in Israel, GPEI released a statement calling for “enhanced surveillance”…\n\nA month later, in April of this year, using alleged “re-emergence” as a springboard, GPEI called for “renewed efforts” to combat polio, launching their new “Strategy” and claiming to need a further 4.8 billion dollars in funding.\n\nThen in late May, at the WHO’s 75th World Health Assembly, “global health leaders” called for “urgent action to end polio once and for all before a unique window of opportunity closes for good.”\n\nThe same week, the WHO’s Director-General Tedros Adhanom Ghebreyesus addressed the assembly regarding polio [emphasis added]:\n\n…which brings us to June, and scare-stories on both sides of the Atlantic warning of “low vaccination rates”\n\nNote that the WHO report claims the virus entered the UK on someone who received a “live vaccination” overseas, and the alleged outbreak in Israel is “vaccine-derived”.\n\nDo you see how this works yet?\n• The WHO approves “emergency use vaccine”, bypassing need for trials and safety data\n• A handful of cases of polio are reported (as they are every year)\n• Gates/WHO funded thinktank calls for “increased surveillance”, meaning more testing (using PCR tests)\n• Cases are blamed on the old vaccines\n• New “modern” and “safer” vaccines are rolled out.\n\nIn October, at the World Health Summit in Germany, GPEI is launching a “pledging moment” to try and raise around 5 billion dollars to “achieve a polio-free world”.\n\nGiven the headlines, they should pass that mark pretty easily, wouldn’t you think?\n\nIt’s interesting to note that market researchers found the polio vaccine market had “stagnated” through 2020 and 2021, due to the Covid19 “pandemic”.\n\nNo more stagnation now.", "opengraph": {"type": "article", "title": "“Polio Outbreak” – The WHO, Bill Gates, emergency vaccines & more of the same", "url": "https://off-guardian.org/2022/06/24/polio-outbreak-the-who-bill-gates-emergency-vaccines-more-of-the-same/", "description": "Kit Knightly Audio Version New Feature! Polio is on the front pages of British newspapers again for the first time in decades. What a time to be alive. For those who missed it, two days ago the UK …", "article:published_time": "2022-06-24T11:00:59+00:00", "article:modified_time": "2022-11-02T22:06:40+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/polio-vaccine-vial.jpg", "image:width": "1688", "image:height": "950", "locale": "en_US"}, "tags": ["Tedros Adhanom Ghebreyesus", "Bill and Meliinda Gates Foundation", "Kari Butler", "ukraine", "GAVI", "Israel", "vaccines", "polio", "WHO"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/Off-G-Polio-Outbreak_01.mp3", "https://www.forbes.com/sites/williamhaseltine/2022/06/20/there-may-be-a-new-polio-epidemic-on-its-wayif-so-what-we-can-do-part-ii/?sh=58716ed01b03", "https://www.globalcitizen.org/en/content/polio-vaccine-nOPV2/", "https://www.who.int/teams/regulation-prequalification/eul", "https://ourworldindata.org/polio", "https://www.precisionvaccinations.com/ukraine-declares-biological-emergency-regarding-polio-outbreak", "https://time.com/6155963/polio-ukraine-war/", "https://polioeradication.org/news-post/circulating-vaccine-derived-poliovirus-type-3-confirmed-in-israel/", "https://polioeradication.org/financing/donors/", "https://polioeradication.org/news-post/circulating-vaccine-derived-poliovirus-type-3-confirmed-in-israel/", "https://polioeradication.org/news-post/global-polio-eradication-initiative-calls-for-renewed-commitments-to-achieve-promise-of-a-polio-free-world/", "https://reliefweb.int/report/world/faster-better-more-equitable-world-health-assembly-challenged-take-urgent-action-window-opportunity-closes-eradicate-polio-tackle-cvdpvs-same-urgency-wpvs", "https://www.dailymail.co.uk/health/article-10946151/US-polio-vaccine-coverage-SHORT-95-threshold-believed-needed-control-outbreak.html", "https://www.theguardian.com/society/2022/jun/23/low-polio-vaccination-rates-among-teenagers-risks-virulent-infection-in-uk", "https://www.cdc.gov/polio/what-is-polio/lab-testing/diagnostic.html", "https://polioeradication.org/news-post/global-polio-eradication-initiative-calls-for-renewed-commitments-to-achieve-promise-of-a-polio-free-world/", "https://www.einnews.com/pr_news/578105056/polio-vaccine-market-growth-business-advancements-and-statistics-by-2031", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-06-24T11:00:59+00:00"}