{"result_id": "232017", "URL": "https://off-guardian.org/2022/08/17/putin-sputnik-v-mass-vaccination/", "timestamp": "2023-04-25 16:43:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/08/17/putin-sputnik-v-mass-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Putin, Sputnik V & mass vaccination", "cleaned_text": "This is Part I of an ongoing series, “Putin & COVID.” Parts II, III, IV are already available on Riley’s substack.\n\nWhat role has Putin played in Russia’s response to COVID? Is he waging a silent war to root out the clot-shot fanatics and Virus nannies in his country? Or has he enabled and supported these bad actors?\n\nDid Russia’s power-hungry regional governors use COVID for their own selfish purposes, defying the wishes of the federal government? Or are the regions imposing unsavory policies to appease the Kremlin and federal agencies?\n\nPerhaps Putin deferred to Russia’s “public health” experts and is not actively involved in formulating COVID measures? After all, he can’t do everything; Putin is the leader of a rather large, complex and consequential country—it would be unrealistic to expect him to take the reins on every policy issue, or to make every decision.\n\nFinally, is there evidence Putin has used the special military operation in Ukraine to “end” the “pandemic” in Russia?\n\nThis article will be the first in a series exploring these questions. We can’t promise definitive answers. Instead, our hope is to provide a chronology of Putin’s stated views—as well as his directives and instructions to federal and regional authorities—to allow readers to make informed judgements for themselves.\n\nBecause Russia is rebooting its mass vaccination drive, we thought it would be appropriate to begin with Putin’s role in Sputnik V’s development and deployment.\n\nOn April 20, 2020, Putin held a meeting via videoconference on the “sanitary and epidemiological situation in the Russian Federation.” Attendees included Deputy Prime Minister Tatyana Golikova, Health Minister Mikhail Murashko, Moscow Mayor Sergey Sobyanin, and leading medical professionals.\n\nThe creation of a COVID vaccine was a top agenda item.\n\n“I would like to hear today how the work on creating an antiviral vaccine is progressing,” Putin told the meeting’s participants. “I am aware of what a complex, painstaking scientific search is being carried out in this direction. It is difficult to guess here, impossible. After all, the vaccine should not only be delivered. Its effectiveness and safety must be proven. In this regard, I understand what a colossal responsibility for the result lies with the developers.”\n\nBut several of the assembled medical experts expressed doubts about the feasibility and necessity of creating a COVID vaccine. Some even suggested the threat posed by coronavirus had been greatly exaggerated.\n\nProfessor Alexander Chuchalin, President of the Russian Respiratory Society, a member of the Russian Academy of Sciences, and the head of the Russian Health Ministry’s Ethics Council, advocated for a “paradigm change” allowing for a “correct assessment” of the new virus.\n\nFor example, he spoke out against using ventilators to treat COVID patients, describing artificial ventilation of the lungs as “ineffective.”\n\nNext to speak was Nikolai Durmanov, Special Representative of the Ministry of Science and Higher Education for Biological Safety.\n\nDurmanov told Putin it was “probably a naïve dream” to think a vaccine could be developed that would be effective for the entire population.\n\nThe official cited previous attempts to create vaccines against Ebola and swine flu, which triggered lethal inflammatory syndromes when tested on mice:\n\nHowever, Durmanov didn’t rule out the possibility of “creating a number of vaccine alternatives, each targeted to work with the specific genes an individual carries.”\n\nNext up was Alexander Gintsburg, the head of the Health Ministry’s Gamaleya Center.\n\nGintsburg promised his institute could create a COVID vaccine “in a very limited time frame, within a few months.”\n\nIn 2015, the Gamaleya Center created a “technological platform” that used “virus-like particles” to deliver genetic material to cells. A genetic injection based on this platform could provide immunity against COVID within 10-12 days after being administered, he claimed.\n\nGintsburg stressed the platform was safe and effective, as evidenced by Gamaleya’s Ebola vaccine, which was registered in Russia and subjected to “extensive” testing in Guinea. The vaccine template was later modified to develop a serum against Middle East Respiratory Syndrome (MERS), providing 100% protection in animal tests, and exhibiting very promising results among 200 human volunteers.\n\nBack in the real world, Gintsburg’s “technological platform” had yet to produce a single drug approved for use outside of Russia. Even Gamaleya’s much-vaunted Ebola vaccine was only tested on 2,000 people in Guinea a year after the African nation was declared Ebola-free in June 2016.\n\nGamaleya’s Ebola shot was conspicuously absent when hemorrhagic fever returned to Guinea in February 2021, prompting an emergency vaccination program in the country. The drug only has been registered in Russia; luckily, there aren’t many Ebola outbreaks in Moscow.\n\nAs for Gamaleya’s MERS vaccine: as of August 2022, it’s been indefinitely shelved without completing clinical trials. The vaccine was administered to 268 people as part of combined Phase I-II studies. The results of these trials have not been published.\n\nMaybe Gintsburg slightly exaggerated his platform’s impregnable track record—but by then it didn’t matter. His pitch to Putin was a mere formality: The Gamaleya Center had already received “a government assignment to develop a vaccine against COVID-19.”\n\nReporting on the project’s latest developments, Gintsburg told Russia’s president that his COVID injection had shown promising results in mice and guinea pigs.\n\nPreclinical studies were slated to end on May 31, with clinical trials expected to begin at the start of June.\n\nGintsburg also thanked Putin for issuing a directive allowing Gamaleya to conduct “clinical trials in parallel with preclinical studies,” explaining this decision would “speed up” the vaccine’s development.\n\nPutin expressed satisfaction with Gintsburg’s presentation, and ordered Russia’s health minister to ensure Gamaleya’s COVID vaccine wouldn’t be bogged down by unnecessary red tape.\n\n“Mikhail Albertovich [Murashko], it is necessary to systematize everything that was just proposed by Alexander Leonidovich [Gintsburg]. Prepare appropriate proposals for me. This also applies to the acceleration of licensing procedures,” Putin instructed his health minister.\n\nGintsburg ultimately prevailed over the more cautious medical professionals who issued advice to Putin. Gamaleya’s vaccine—Sputnik V—received emergency authorization from the Russian Health Ministry on August 11, 2020.\n\n“This morning, for the first time in the world, a vaccine against a new coronavirus infection was registered,” Putin announced. “It works quite effectively, forms a stable immunity and has passed all the necessary checks.”\n\nWhile “the world’s first registered COVID-19 vaccine” was hailed as a triumph of Russian scientific prowess, not everyone in the country’s medical community celebrated.\n\nProfessor Chuchalin—who warned against “dramatizing” coronavirus—came out against Sputnik V, claiming the decision to rush through clinical trials was a gross violation of medical ethics.\n\n“We will just make fools of ourselves with this early vaccine, which can bring us a lot of trouble,” Chuchalin warned a month after participating in the April 20 videoconference with Putin.\n\nThe professor resigned as head of the Health Ministry’s Ethics Council on August 10, 2020—a day before Sputnik received approval from the ministry.\n\nIn November 2020, Chuchalin reiterated the ethical problems with Russia’s rushed vaccine: There was no way to know if Sputnik V was safe and effective, because you can’t expedite long-term safety and efficacy trials. At least two years of observation was needed to determine the drug’s safety profile, he noted.\n\nCiting previous research on adenovirus vector therapies, the professor also predicted the alleged effectiveness of Sputnik V would rapidly decrease over time.\n\nThe professor claimed Gintsburg and Russia’s Health Ministry were aware of his position.\n\nIn retrospect, it seems Chuchalin’s assessment was correct. On April 10, 2021, Gintsburg boasted Sputnik V would provide lifelong immunity against COVID. Exactly one year later, he said Russians should get revaccinated every six months, and even suggested a “two-dose” booster for high-risk individuals.\n\nSputnik V’s safety record is more difficult to gauge. Russia does not have a VAERS-like database for reporting and viewing suspected post-vaccination complications. In January 2022, Russian authorities shut down a website that tracked suspected vaccine-linked deaths in the country.\n\nAccording to Putin, Sputnik V has not been linked to a single serious adverse reaction in Russia—and technically he’s correct, since there are no publicly available figures on post-vaccination complications.\n\nAt the same time, Putin has raised questions about the safety of foreign-made vaccines.\n\n“Indeed, there is something to be proud of, bearing in mind that our vaccine is the safest and most effective in the world,” the Russian president said of Sputnik V.\n\nHe made a similar claim three months later.\n\n“Let me remind you that the Russian vaccine is recognized as the safest and most effective. Efficiency over 96%. And, according to our regulatory authorities, there is not a single lethal outcome from the use of the vaccine,” Putin said during a speech at the St. Petersburg International Economic Forum (SPIEF) on June 4, 2021.\n\nOn the same day, Russia’s president told journalists that “[Russian] authorities have not recorded a single lethal outcome from the use of [Sputnik V], while other [foreign] manufacturers, unfortunately, have such tragic cases.”\n\nIs Putin aware of the vaccine-linked deaths in his country reported by Russian media? Judging by his inner circle of health experts, perhaps not.\n\n“I talked with the head of the Gamaleya Institute [Alexander Gintsburg], they conducted research and Sputnik V effectively neutralizes the new Omicron strain,” Russia’s leader said on December 28, 2021. He added Sputnik V “provides somewhere around 90% protection, somewhere in the region.”\n\nPutin on the need for mass vaccination\n\nWhile Russia’s president has sent mixed signals about his position on mandatory injections, he has been vocal about his support for mass vaccination. In fact, Putin has repeatedly called vaccination the key to ending the purported health crisis.\n\n“The coronavirus pandemic will not go away on its own: in order to defeat it, you need to be vaccinated. This opinion was expressed by Russian President Vladimir Putin,” TASS reported on June 30, 2021.\n\nBelow is a chronology of Putin’s views on mass vaccination.\n\nDecember 17, 2020: “Regarding the need for mass or universal vaccination: I believe that this should be done. The same is said not only by our, domestic virologists, but also by their colleagues almost all over the world. One of the few ways to overcome all issues related to the pandemic is through mass vaccination, which should create nationwide immunity. And I repeat once again: our vaccine is effective and safe. So I see no reason not to get vaccinated.” [source: Kremlin.ru]\n\nApril 21, 2021: Russian President Vladimir Putin urged Russians to get vaccinated against coronavirus infection…“Once again I appeal to the citizens of Russia. My dears, you must not lose your vigilance. I ask you to take care of yourself and your loved ones, to comply with all the recommendations of doctors and sanitary services as responsibly as possible,” the head of state stressed. [source: Izvestia]\n\nApril 21, 2021: “Vaccination is of central importance now. I ask the government, the Ministry of Health, the heads of regions to deal with these issues on a daily basis,” [Putin] said, speaking with a message to the Federal Assembly. [source: RIA Novosti]\n\nMay 10, 2021: “Today we talked with Anna Popova, our chief health officer. Both on my behalf and on her behalf, I want to appeal to our citizens to continue the vaccination campaign,” Putin said. [source: RIA Novosti]\n\nJune 2, 2021: “Vaccination is an extremely important thing, we have talked about it many times. I am even trying, as far as I can, to support this process, to support you in achieving the necessary results, goals and volumes of vaccination,” the head of state said during a meeting with government members via videoconference, addressing Deputy Prime Minister Tatyana Golikova. [source: Izvestia]\n\nJune 4, 2021: “Today, every adult citizen of Russia has the opportunity to get vaccinated as comfortably as possible, voluntarily and free of charge. And, taking this opportunity, I want to once again ask our citizens to use this opportunity to protect themselves and their loved ones,” Putin said. [source: RIA Novosti]\n\nJune 30, 2021: The President noted that the only way to prevent the further spread of the epidemic is through vaccination. “This is known very well, experts have said many times on television and on the Internet, in all possible media, through all channels that it is possible to prevent the further spread of the epidemic only through vaccination,” the head of state said. [source: TASS]\n\nJuly 21, 2021: “Our main task now is to increase the rate of vaccination in the country. It is extremely important to convince people of the need to get vaccinated, that this is the only way we can put a barrier to the epidemic,” Putin said. [source: TASS]\n\nAugust 5, 2021: “In some regions, vaccination is proceeding at a fairly rapid pace, in others it is slower, it is necessary to identify the best practices and implement them throughout the Russian Federation, in all regions,” Putin said at a meeting with members of the government. [source: RIA Novosti]\n\nAugust 22, 2021: “We need to do everything to overcome the pandemic, and the best tool for this fight is vaccination,” the president said at a meeting with representatives of the United Russia party. [source: RIA Novosti]\n\nSeptember 17, 2021: Russian President Vladimir Putin drew attention to the importance of timely revaccination against COVID. The head of state touched upon this topic at a meeting with the Governor of St. Petersburg Alexander Beglov online on Friday. “You spoke about the measures taken by the city authorities to combat COVID infection. We must not forget to revaccinate on time,” Putin stressed, recalling that an outbreak of coronavirus occurred in his inner circle due to the late revaccination of a number of employees. [source: TASS]\n\nOctober 5, 2021: It is necessary to undergo revaccination against coronavirus in a timely manner, this moment should not be missed. This was stated by Russian President Vladimir Putin at a meeting with the government on Tuesday. “It is very important that revaccination takes place on time,” he said. [source: TASS]\n\nOctober 12, 2021: Putin called on State Duma deputies to actively, but at the same time patiently explain to citizens the need for vaccination against coronavirus…“I ask you to take an active part in this work, conduct educational work, speak in the media. People trust you and listen to advice and recommendations, this is very important…We need to work persistently and patiently with people who explain to them all the benefits associated with the prevention of this dangerous disease,” he said, addressing the deputies. In general, the head of state stressed that the pace of vaccination against coronavirus infection in the Russian Federation today needs to be increased. [source: TASS]\n\nOctober 20, 2021: Russian President Vladimir Putin, at a meeting with the government, urged citizens to get vaccinated and called strange the behavior of his acquaintances who hesitate to get vaccinated against COVID-19… “Strange, people with good education, with scientific degrees. I don’t understand what is happening,” Putin said, noting that Russia has good, effective vaccines. [source: RBK]\n\nOctober 20, 2021: Russian President Vladimir Putin announced the need to increase the pace of vaccination and called on citizens to be more actively vaccinated. “I draw the attention of the heads of the subjects of the Federation to the need to increase the pace of vaccination and, of course, I once again urge all our citizens to actively get vaccinated…It is better to get vaccinated, why wait for severe consequences.” [source: Izvestia]\n\nNovember 1, 2021: “The real salvation from the severe course of the disease and the salvation from deaths is vaccination,” the head of state said. [source: Interfax]\n\nWhile Putin has claimed he is against using coercive measures to increase Russia’s vaccination rate (a topic we will explore in detail in Part II of this series), he has nonetheless made attempts at shaming Russian citizens into getting the shot.\n\nRefusing the vaccine is a “dishonest position against your people,” Putin said on December 23, 2021.\n\nHow many Russians need to be vaccinated?\n\nLike most world leaders, Putin has championed mass vaccination as the only way to return to “normal” life. But how many Russians need to get the shot to form “collective immunity”?\n\nSpeaking to Rossiya 1 on March 28, 2021, Putin claimed 70% of Russia’s adult population needed to be immunized to end the pandemic.\n\nA little more than two months later, on June 5, 2021, the Russian president predicted international travel restrictions would remain in place until Russia achieved “60% immunization of the entire population.”\n\nHe readjusted his assessment at the end of December.\n\n“We need collective immunity at 80%. I hope next year in the second quarter we will reach this level,” Putin said on December 23, 2021.\n\nHe spoke on the same subject less than a week later while attending a Commonwealth of Independent States (CIS) summit.\n\n“Colleagues abroad are already striving to immunize more than 90 percent [of their populations]. And you need 90 percent,” the Russian president said on December 28.\n\nWhat role did Russia’s president play in Sputnik V’s development & deployment?\n\nRiley Waggaman is your humble Moscow correspondent. He worked for RT, Press TV, Russia Insider, yadda yadda. In his youth, he attended a White House lawn party where he asked Barack Obama if imprisoned whistleblower Bradley Manning (Chelsea was still a boy back then) “had a good Easter.” Good times good times. You can subscribe to his Substack here, or follow him on twitter or Telegram.", "opengraph": {"type": "article", "title": "Putin, Sputnik V & mass vaccination", "url": "https://off-guardian.org/2022/08/17/putin-sputnik-v-mass-vaccination/", "description": "Riley Waggaman This is Part I of an ongoing series, “Putin & COVID.” Parts II, III, IV are already available on Riley’s substack. What role has Putin played in Russia’s response to COVID?…", "article:published_time": "2022-08-17T13:00:56+00:00", "article:modified_time": "2022-08-17T12:32:53+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/sputnik-vials.jpg", "image:width": "1610", "image:height": "910", "locale": "en_US"}, "tags": ["Sputnik V", "Riley Waggman", "vaccines", "coronavirus", "covid19", "TASS", "putin", "russia"], "tweets": [], "movies": [], "links": ["https://edwardslavsquat.substack.com/p/covid-russia-the-virus-junta-strikes", "http://kremlin.ru/events/president/news/63229", "https://edwardslavsquat.substack.com/p/the-false-prophet-leading-russians", "https://brownstone.org/articles/the-covid-chaos-in-russia/", "https://clinicaltrials.gov/ct2/show/NCT04128059?term=Gamaleya&draw=2", "https://www.fontanka.ru/2020/08/11/69416050/", "https://rossaprimavera.ru/news/78c046f2", "https://pharmvestnik.ru/content/news/Aleksandr-Chuchalin-kritikovavshii-sroki-issledovaniya-vakciny-ot-COVID-19-pokinul-Sovet-po-etike.html", "https://www.business-gazeta.ru/article/488341", "https://www.interfax.ru/russia/760529", "https://tass.ru/obschestvo/14334837", "https://edwardslavsquat.substack.com/p/russian-authorities-shut-down-website", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20210304-1603.html", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20210604-1456.html", "http://special.kremlin.ru/events/president/news/65749", "https://edwardslavsquat.substack.com/p/an-18-year-old-was-coerced-into-taking", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20211228-1504.html", "https://edwardslavsquat.substack.com/p/is-putin-fighting-to-stop-the-clot", "https://tass.ru/obschestvo/11787133", "http://kremlin.ru/events/president/news/64671", "https://iz.ru/1154597/2021-04-21/putin-prizval-rossiian-sdelat-privivku-ot-koronavirusa", "https://ria.ru/20210421/vaktsinatsiya-1729249496.html", "https://ria.ru/20210510/vaktsinatsiya-1731659995.html", "https://iz.ru/1172874/2021-06-02/putin-prizval-rossiian-proiti-vaktcinatciiu-ot-covid-19", "https://ria.ru/20210604/privivka-1735629244.html", "https://tass.ru/obschestvo/11785341", "https://tass.ru/obschestvo/11952855", "https://ria.ru/20210805/koronavirus-1744529548.html", "https://ria.ru/20210822/vaktsinatsiya-1746750174.html", "https://tass.ru/obschestvo/12433591", "https://tass.ru/obschestvo/12583123", "https://tass.ru/obschestvo/12641057", "https://www.rbc.ru/rbcfreenews/6170084d9a7947502387b64e", "https://iz.ru/1238232/2021-10-20/putin-prizval-narashchivat-tempy-vaktcinatcii-ot-koronavirusa", "https://www.interfax-russia.ru/main/putin-lekarstvo-ot-covid-19-poyavitsya-v-rf", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20211223-1329.html", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20210328-1440.html", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20210605-0816.html", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20211223-1254.html", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20211228-1525.html", "https://edwardslavsquat.substack.com/p/putin-and-compulsory-vaccination", "https://edwardslavsquat.substack.com/", "https://twitter.com/RileyWaggaman?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor", "https://t.me/edwardslavsquat", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-08-17T13:00:56+00:00"}