{"result_id": "232048", "URL": "https://off-guardian.org/2021/12/07/did-the-sputnik-v-inventor-just-murder-his-own-vaccine/", "timestamp": "2023-04-25 16:44:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2021/12/07/did-the-sputnik-v-inventor-just-murder-his-own-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Did the Sputnik V inventor just murder his own vaccine?", "cleaned_text": "Did the Sputnik V inventor just murder his own vaccine?\n\nAlexander Gintsburg is the father of Sputnik V, Russia’s 500,000% effective COVID vaccine. He also recently won a trophy in recognition of his lifelong pursuit of total failure and creepy business dealings.\n\nHe is the highest-rated scientist on Yelp and serves as director of “the world’s leading research institution,” which bears a striking resemblance to a homeless shelter.\n\nGintsburg had it all—and then he threw it all away.\n\nJust look at what he did to himself and his precious injection [emphasis added]:\n\nDirector of the Gamaleya Center Alexander Gintsburg called for the introduction of the QR code system for vaccination against coronavirus infection in the Russian Federation at the federal level as soon as possible. “I always insist that it is necessary not only to introduce QR codes as quickly as possible, but with their help to strictly demarcate opportunities for interaction between the vaccinated and unvaccinated,” he said on Saturday. Gintsburg also recalled the need to comply with epidemiological safety measures, in particular, the wearing of masks. “The mask primarily protects against those people who are not vaccinated, who do not have protective antibodies. And the wearing of masks by the vaccinated makes it possible to prevent the transmission of the pathogen from the person who is vaccinated and who does not know that he is a carrier to those people who are not vaccinated,” he said.\n\nLet’s pause here for a moment. Close your eyes. Allow Gintsburg’s soggy word salad to marinate in your mind. (You didn’t close your eyes, did you?)\n\nSputnik V’s main dude says Russia needs vaccine segregation right now, and he also says that anyone who got his safe and effective shot is probably a two-legged super-spreader passing out bags of coronavirus like Bioweapon Santa—without even realizing it.\n\nMaybe it’s time for a lockdown of the vaccinated? These “people” are dangerous!\n\nIf the vaccine works, why would you need QR codes? If the vaccine doesn’t work—and according to Gintsburg, it doesn’t seem to work that well—why would you need QR codes?\n\nWe are just being pedantic, of course. The digital cattle tag will save tens of millions of lives every day. As Moscow Mayor Sergey Sobyanin recently noted:\n\nEveryone needs to get this vaccine—because without it, how will people get a QR code? And if there are no QR codes, how will people get used to the fact that they need to get the vaccine? Do you see the dilemma here?\n\nA final observation before we go.\n\nIn October 2020, Gintsburg was interviewed by Rossiyskaya Gazeta—it was your typical nine innings of softball “questions.” Here is one of those questions:\n\nHa-ha. (Masks are worse than useless, by the way.)\n\nThe lies are so numerous and unrelenting—if you could somehow stack them, like pancakes, you could build a staircase to the Moon. Which is QR code-restricted, by the way.\n\nRiley Waggaman is your humble Moscow correspondent. He worked for RT, Press TV, Russia Insider, yadda yadda. In his youth, he attended a White House lawn party where he asked Barack Obama if imprisoned whistleblower Bradley Manning (Chelsea was still a boy back then) “had a good Easter.” Good times good times. You can subscribe to his Substack here, or follow him on twitter.", "opengraph": {"type": "article", "title": "Did the Sputnik V inventor just murder his own vaccine?", "url": "https://off-guardian.org/2021/12/07/did-the-sputnik-v-inventor-just-murder-his-own-vaccine/", "description": "Riley Waggaman Alexander Gintsburg is the father of Sputnik V, Russia’s 500,000% effective COVID vaccine. He also recently won a trophy in recognition of his lifelong pursuit of total failure and c…", "article:published_time": "2021-12-07T14:00:02+00:00", "article:modified_time": "2021-12-08T13:44:28+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/Alexander-Gintsburg-sputnik-V-vaccine.jpg", "image:width": "1617", "image:height": "910", "locale": "en_US"}, "tags": ["vaccine passports", "Moscow", "Alexander Gintsburg", "coraonvirus", "Riley Waggaman", "vaccines", "covid19", "russia"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/nq_SpRBXRmE?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" width=\"728\" height=\"409\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube-nocookie.com/embed/nq_SpRBXRmE?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}], "links": ["https://off-guardian.org/wp-content/medialibrary/Alexander-Gintsburg-sputnik-V-vaccine.jpg", "https://edwardslavsquat.substack.com/p/putins-favorite-scientist-calls-for", "https://edwardslavsquat.substack.com/p/myth-vs-reality-in-covid-russia", "https://edwardslavsquat.substack.com/p/russias-main-sputnik-v-manufacturer", "https://sputnikvaccine.com/about-us/", "https://edwardslavsquat.substack.com/p/quiz-gamaleya-center-or-crack-house", "https://news.mail.ru/society/49076728/?frommail=1", "https://off-guardian.org/wp-content/medialibrary/riley-waggaman-russia-qr-code-poll.png", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20211022-1422.html", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20201001-1655.html", "https://edwardslavsquat.substack.com/p/outrage-russians-will-be-forced-to", "https://edwardslavsquat.substack.com/", "https://twitter.com/RileyWaggaman?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2021-12-07T14:00:02+00:00"}