{"result_id": "232025", "URL": "https://off-guardian.org/2022/01/26/media-lies-the-sacred-rites-of-the-vaccine-cult/", "timestamp": "2023-04-25 16:43:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/01/26/media-lies-the-sacred-rites-of-the-vaccine-cult/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Media Lies & the Sacred Rites of the Vaccine Cult", "cleaned_text": "The coverage Szilveszter Csollany’s death shows you being called an “anti-vaxxer” is more about what you think, than what you do.\n\nThe Independent has put out an early (and strong) entry for “Worst Journalism of the Year” award, reporting yesterday the death of Hungarian gymnastics coach Szilveszter Csollany under the headline:\n\nThe glaring issue with this headline becomes clear just three paragraphs into the article [our emphasis]:\n\nThe evidence supplied for Csollany’s supposed “anti-vaccination views” is non-existent. Second-hand hearsay, at best. No direct quotations, no sources provided.\n\nOffGuardian would be ashamed to publish something so flimsy. Any outlet should.\n\nBut, of course, that isn’t the most egregious part – as you can tell from our emphasised quote – the supposed “anti-vaxxer” had been vaccinated.\n\nTo bury that in the body, under that headline, is deliberate deception. They know many people will read the title and assume he hadn’t had the vaccine without ever reading the body of the text, and they are relying on that to spread an intentionally false impression.\n\nThe very definition of disinformation.\n\nAfter deliberately misrepresenting the man’s life, they proceed to do the same to his death. Not even granting him the respect of an honest appraisal of his last weeks alive, they totally ignore all the relevant questions pertaining to the man’s health.\n\nThey never question why a previously healthy 51-year-old would ever need to be put on a ventilator, or consider how ventilator-associated pneumonia or ventilator-induced trauma may have contributed to his death.\n\nThe article readily admits he died “of Covid” despite being vaccinated, but never even attempts to explain that, sparing a throwaway sentence suggesting “he contracted the virus soon after receiving his jab, and thus had not built sufficient levels of antibodies”, which is not supported by any medical opinion or sources.\n\nHaving admitted he WAS vaccinated, and only a short time before he died, the article never considers even for a second the obvious logical conclusion: That the vaccine may have played some part in his death, or killed him outright.\n\nIt doesn’t even refute the idea, it simply refuses to acknowledge its existence.\n\nBut really, the worst aspect of this black-hole of integrity is not the deliberately misleading headline, or the lack of even the most basic journalistic ethics, it is deeper than that. There is an unspoken message concealed within the tone of the writing, and a shifting of linguistic definitions that comes with it.\n\nThe implied thought buried in the text is that, even though he was vaccinated, his alleged doubts mean he was still an “anti-vaxxer” and therefore deserved to die. That he brought the Covid curse down upon his head through his expressing “anti-vaccination views”.\n\nAs if he called down God’s wrath through speaking heresy.\n\nThis is not the first time we have seen the narrative try and separate the meaning of “anti-vaxxer” from a person’s vaccination status.\n\nIn Australia the Northern Territories Premier Michael Gunner recently told the media :\n\nYes, in Australia an anti-vaxxer can be a vaccinated person who “gives comfort” to someone who argues against the vaccine, they don’t have to agree with the anti-vaxxer they simply have to tolerate them.\n\nIt’s a dark age belief system, where to even hear heresy spoken is to be tainted by it.\n\nThis is all part of the redefining, really the broadening, of what people even mean by “anti-vaxxer” in the first place. Yet more “pivoting of our language”.\n\nSzilveszter Csollany is accused of “expressing anti-vaccination views” on social media, but in our current climate that can mean almost anything.\n\nOpposing vaccine mandates, vaccine passports, or the giving of untested vaccines to children. All have been described as “anti-vax” positions.\n\nYou could have every vaccine you’ve ever been offered, but decline the Covid “vaccine” to wait for long-term safety data, and still find yourself branded an “anti-vaxxer”.\n\nAnd now, finally, you can actually be vaccinated, but be labelled an “anti-vaxxer” because you may have previously expressed doubts or asked questions.\n\nThe injection has become the quite literal equivalent of a religious rite, where your beliefs are just as important as your actions, maybe even more so.\n\nThe vaccines are “safe and effective”, that’s the mantra for the modern age, chanted in televised chapels.\n\nIn the beginning, people were told that if you were anti-vaxxer you would die, for the vaccines are the new blood of Christ, and by accepting them into your heart you are promised life eternal.\n\nThis conditioning has gone so deep people are inverting it and spitting it back out: Now, if you die, you must have been an anti-vaxxer.\n\nBeing vaccinated, but not believing in the vaccine, is just as bad as rejecting the vaccine, and you will remain unvaccinated in spirit.\n\nAnd like a modern-day ducking stool, if – like poor Szilveszter Csollany – you get the vaccine and die anyway, it shows only that your faith was not strong enough, you were secretly an anti-vaxxer at heart, and the press will say as much in your obituary.\n\nThe media all talk this way.\n\nI can’t tell if they do it dishonestly to create this bizarre atmosphere of religious fervour, or they don’t even realise they’re doing it because they’re so caught up in zealotry. And I’m not sure which is worse.\n\nEither way, the endpoint is clear: A world where being “anti-vaccination” is no longer defined by what you do, but by what you say and think or even what you allow others to think.\n\nAn all-purpose label, so vague as to be functionally meaningless, but universally applied to anyone who diverts as much as one degree from the mainstream course, turning them into an outsider who must be shunned.\n\nIt really is a cult. There’s no other way to describe it.", "opengraph": {"type": "article", "title": "Media Lies & the Sacred Rites of the Vaccine Cult", "url": "https://off-guardian.org/2022/01/26/media-lies-the-sacred-rites-of-the-vaccine-cult/", "description": "Kit Knightly The Independent has put out an early (and strong) entry for “Worst Journalism of the Year” award, reporting yesterday the death of Hungarian gymnastics coach Szilveszter Cs…", "article:published_time": "2022-01-26T21:00:01+00:00", "article:modified_time": "2022-01-26T20:07:42+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/independent-Szilveszter-Csollany-banner.jpg", "image:width": "2050", "image:height": "930", "locale": "en_US"}, "tags": ["covid vaccines", "Australia", "Independent", "Blikkk", "Hungary", "Michael Gunner"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/independent-Szilveszter-Csollany-banner.jpg", "https://www.independent.co.uk/sport/olympics/antivax-covid-szilveszter-csollany-hungary-b2000002.html", "https://off-guardian.org/2020/05/06/covid19-are-ventilators-killing-people/", "https://twitter.com/DrEliDavid/status/1462835855559729158?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1462835855559729158%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Foff-guardian.org%2F2021%2F11%2F26%2Fwhat-is-happening-in-australias-aboriginal-communities%2F", "https://off-guardian.org/2022/01/25/cdc-pivoting-its-language-on-vaccination-status/", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-01-26T21:00:01+00:00"}