{"result_id": "232010", "URL": "https://off-guardian.org/2021/11/06/pfizer-vax-kill-200-to-save-one/", "timestamp": "2023-04-25 16:43:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2021/11/06/pfizer-vax-kill-200-to-save-one/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Pfizer “vaccine”: kill 200 to ‘save’ one?", "cleaned_text": "Analysis of official data shows the risks attached to Covid “vaccine” far outweighs any theoretical reward.\n\nIn the early days of the “vaccine” rollout, we ran several articles discussing the risk-reward of the new mRNA jabs. Dr Sadaf Gilani, in particular, did good detailed write-ups on “absolute risk reduction”.\n\nTo explain “absolute risk reduction” (ARR) in simple terms: if an unvaccinated person has a 10% chance of getting the disease, and a vaccinated person has a 1% chance, then the ARR for the vaccine is 9%.\n\nOf course, that’s just an example, the actual ARR for the Covid “vaccines” is nowhere near 9%:\n\nFrom the “absolute risk reduction”, you can then calculate the “number needed to vaccinate” (NNTV). This is the rough number of people you need to inject in order to definitely prevent one case/death.\n\nTo continue the example above, if your vaccine reduces the odds of infection from 10% to 1% (an ARR of 9%), you need to vaccinate eleven people to prevent one infection, giving you an NNTV of 11.\n\nAgain, the NNTV of the Covid vaccines are much, much, MUCH higher than 11. Estimates range from between 88 and 700 to prevent a single case, and anything up to 100,000 to prevent one solitary death.\n\nAnd remember, all this data was for adults. Children are at a far lower risk from Covid – both in terms of hospitalisation and death. In the US, children aged 5-11 have a 99.992% chance of surviving “Covid” – so it naturally follows the NNTV for this group will be far, far higher than for adults.\n\nBut, now that the FDA has approved Pfizer’s “vaccine” for emergency use on children aged 5-11, “far, far higher” is not good enough. We need to calculate an actual figure for the “number needed to vaccinate” in order to hypothetically protect one child from dying “with Covid”.\n\nFortunately for us, someone else has already done it.\n\nWriting on his Substack, economist Toby Rodgers PhD has collated the numbers from Pfizer’s own trials, the FDA and the CDC and done a very thorough write up. You can read the whole thing here, we’ll just present you with some of the highlights:\n\nAs of October 30, 2021, the CDC stated that 170 children ages 5 to 11 have died of COVID-19-related illness since the start of the pandemic. (That represents less than 0.1% of all coronavirus-related deaths nationwide even though children that age make up 8.7% of the U.S. population). The Pfizer mRNA shot only “works” for about 6 months (it increases risk in the first month, provides moderate protection in months 2 through 4 and then effectiveness begins to wane, which is why all of the FDA modeling only used a 6 month time-frame). So any modeling would have to be based on vaccine effectiveness in connection with the 57 (170/3) children who might otherwise have died of COVID-related illness during a 6-month period. At best, the Pfizer mRNA shot might be 80% effective against hospitalizations and death. That number comes directly from the FDA modeling (p. 32). I am bending over backwards to give Pfizer the benefit of considerable doubt because again, the Pfizer clinical trial showed NO reduction in hospitalizations or death in this age group. So injecting all 28,384,878 children ages 5 to 11 with two doses of Pfizer (which is what the Biden administration wants to do) would save, at most, 45 lives (0.8 effectiveness x 57 fatalities that otherwise would have occurred during that time period = 45). So then the NNTV to prevent a single fatality in this age group is 630,775 (28,384,878 / 45). But it’s a two dose regimen so if one wants to calculate the NNTV per injection the number doubles to 1,261,550. It’s literally the worst NNTV in the history of vaccination.\n\n630,000 children injected with 1.2 million doses to save one life. That’s incredibly inefficient. However, it could be even worse than that.\n\nAs we covered last week, according to statistics cited at the VRBPAC meeting, only 94 children from the 5-11 age group have died. If this lower figure is correct, the NNTV to prevent a single death jumps up to 915,641.\n\nIn other words, in order to hypothetically prevent a single child from dying over a six month period, you would have to inject nearly one million children with almost two million doses of the Pfizer vaccine.\n\nWhat kind of risk are those 915,641 children facing from their two doses of Pfizer mRNA soup?\n\nWell, early studies found around 11.1 cases of severe anaphylaxis per million doses of the Pfizer shot, so already any “fully vaccinated” child is almost 22x more likely to have an allergic reaction than to actually be protected from Covid.\n\nOther severe reactions are harder to calculate.\n\nIt is known, for example, that Pfizer’s own trial showed increased all-cause mortality in the vaccinated group vs the placebo group, to the point the trial was abandoned after six months and all remaining placebo members were given the vaccine, effectively destroying the control group. To quote Rodgers again:\n\nAs Bobby Kennedy explains, Pfizer’s clinical trial in adults showed alarming increases in all cause mortality in the vaccinated: “In Pfizer’s 6 month clinical trial in adults — there was 1 covid death out of 22,000 in the vaccine (“treatment”) group and 2 Covid deaths out of 22,000 in the placebo group (see Table s4). So NNTV = 22,000. The catch is there were 5 heart attack deaths in the vaccine group and only 1 in placebo group. So for every 1 life saved from Covid, the Pfizer vaccine kills 4 from heart attacks. All cause mortality in the 6 month study was 20 in vaccine group and 14 in placebo group. So a 42% all cause mortality increase among the vaccinated. The vaccine loses practically all efficacy after 6 months so they had to curtail the study. They unblinded and offered the vaccine to the placebo group. At that point the rising harm line had long ago intersected the sinking efficacy line. Former NY Times investigative reporter Alex Berenson also wrote about the bad outcomes for the vaccinated in the Pfizer clinical trial in adults (here). Berenson received a lifetime ban from Twitter for posting Pfizer’s own clinical trial data.\n\nIt’s not in Big Pharma’s interest to have an accurate collation of severe vaccine reactions, combine this with the (acknowledged) potential for totally unknown long-term side effects, and calculating the complete potential risk becomes very complicated.\n\nHowever, Rodgers – using the VAERS data as his basis – makes a very reasonable effort:\n\nAt this point, going purely off official data and VAERS reports, you can conclude that injecting every 5-11 year old in the US would theoretically save approximately 31 lives, but kill roughly 116 children.\n\nThat’s clearly already a very bad outcome. However, if the predictions for under-reporting of vaccine harms are accurate, it’s potentially much worse than that:\n\nIn conclusion, going purely off official data, vaccinating 5-11 year olds will create 22 allergic reactions per death prevented, and could very well result in four deaths per life saved.\n\nAnd, if Rodgers’ calculations are correct, the Pfizer shot could kill over 200 children before it has saved a single one.\n\nAs always, the point of this analysis is to illustrate that even the establishment’s own data doesn’t support their conclusions, it is NOT necessarily an endorsement of that data, or of the idea that “Covid” is indeed a “pandemic” that poses any kind of risk to anyone.", "opengraph": {"type": "article", "title": "Pfizer “vaccine”: kill 200 to ‘save’ one?", "url": "https://off-guardian.org/2021/11/06/pfizer-vax-kill-200-to-save-one/", "description": "Kit Knightly Audio Version New Feature! In the early days of the “vaccine” rollout, we ran several articles discussing the risk-reward of the new mRNA jabs. Dr Sadaf Gilani, in particul…", "article:published_time": "2021-11-06T21:00:45+00:00", "article:modified_time": "2021-11-07T20:41:16+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/adobe-stock-child-being-injected-doctor-vaccine-scaled.jpeg", "image:width": "2560", "image:height": "1707", "locale": "en_US"}, "tags": ["number needed to vaccinate", "covid vaccines", "VAERS", "ARR", "Toby Rodgers PhD", "5-11 year olds", "Sadaf Gilani", "NNTV", "Pfizer", "RFK jr", "coronavirus", "absolute risk reduction", "covid19"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/adobe-stock-child-being-injected-doctor-vaccine-scaled.jpeg", "https://off-guardian.org/wp-content/medialibrary/Pfizer-vaccine-kill-200-to-save-one-Edit-1-MONO.mp3", "https://off-guardian.org/2021/02/22/synthetic-mrna-covid-vaccines-a-risk-benefit-analysis/", "https://off-guardian.org/2021/06/01/covid-vaccines-a-faltering-framework/", "https://www.ncbi.nlm.nih.gov/books/NBK63647/", "https://www.ncbi.nlm.nih.gov/books/NBK63647/", "https://www.mdpi.com/1648-9144/57/3/199/htm", "https://cf5e727d-d02d-4d71-89ff-9fe2d3ad957f.filesusr.com/ugd/adf864_8c97b2396c2842b3b05975bfbd8254cb.pdf", "https://off-guardian.org/2021/10/30/theres-no-case-for-vaccinating-children-the-fda-meeting-proves-it/", "https://tobyrogers.substack.com/p/what-is-the-number-needed-to-vaccinate", "https://covid.cdc.gov/covid-data-tracker/#demographics", "https://datacenter.kidscount.org/data/tables/101-child-population-by-age-group#detailed/1/any/false/574,1729,37,871,870,573,869,36,868,867/62,63,64,6,4693/419,420", "https://off-guardian.org/2021/10/30/theres-no-case-for-vaccinating-children-the-fda-meeting-proves-it/", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7002e1.htm", "https://alexberenson.substack.com/p/on-the-pfizer-study-that-caused-twitter", "https://off-guardian.org/2021/07/29/covid-vaccines-the-leaked-pfizer-contract/", "https://covid.cdc.gov/covid-data-tracker/?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Fcoronavirus%2F2019-ncov%2Fcases-updates%2Fcases-in-us.html#vaccination-demographic", "https://openvaers.com/covid-data/mortality", "https://docs.google.com/document/d/1stq2nHFjAcMHhxJhWiXa33wl6x0Ga1qdIxodZnFixRw/edit#", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://openvaers.com/covid-data/mortality", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2021-11-06T21:00:45+00:00"}