{"result_id": "232022", "URL": "https://off-guardian.org/2022/12/23/arise-astrazeneca/", "timestamp": "2023-04-25 16:43:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/12/23/arise-astrazeneca/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Arise, AstraZeneca!", "cleaned_text": "In the UK today, it seems, being knighted means you’re someone the UK state wishes to protect from prosecution for crimes against the British people. We don’t need to point to Sir Tony Blair, Klaus Schwab KBE, or even to Sir Jimmy Saville to corroborate this theory.\n\nLast week, Pascal Soriot, the French-born Australian and Chief Executive Officer of the British-Swiss pharmaceutical company, AstraZeneca plc., whose ‘vaccine’ for COVID-19 has produced reports of 875,000 adverse drug reactions in the UK public, including 1,334 deaths, was knighted ‘for services to UK sciences and leadership in the global response to the COVID-19 pandemic’.\n\nOther British nationals made knights or dames for their part in the UK ‘vaccination’ programme include Sir Andrew Pollard, Director of the Oxford Vaccine Group that in April 2020 entered into a partnership with AstraZeneca to develop its viral-vector ‘vaccine’; Dame Sarah Gilbert, the Oxford Project Leader; Sir Adrian Hill, Sir Peter Horby and Sir Martin Landray, who were also responsible for conducting the development and trials of the Oxford ‘vaccine’; and Sir Aziz Sheikh, who was responsible for demonstrating the effectiveness of both the Oxford/AstraZeneca and BioNTech/Pfizer injections.\n\nIn addition to those directly involved in the AstraZeneca ‘vaccine’, other senior figures in the UK ‘vaccination’ programme rewarded with knighthoods include Sir Chris Whitty, Chief Medical Office of England; Sir Jonathan Van-Tam, Deputy CMO; Sir Gregor Smith, CMO of Scotland; Sir Frank Atherton, CMO of Wales; and Sir Patrick Vallance, Chief Government Scientific Adviser.\n\nThese were all senior members of the Scientific Advisory Group for Emergencies (SAGE), and therefore responsibile for the tens of thousands of deaths caused by removing medical diagnosis, care and treatment for 68.8 million Britons under two years of lockdown, which has seen excess deaths in the UK not attributed to COVID-19 far above average in 2022.\n\nThey also personally authorised the injection of the unlicensed, experimental and dangerous ‘vaccines’ into the British public — another, but still unacknowledged, contributing factor.\n\nSenior female figures in the UK ‘vaccination’ programme to receive damehoods include Dame Emily Lawson, Chief Commercial Officer at NHS England who oversaw the injection of the AstraZeneca, Pfizer and Moderna ‘vaccines’ into millions of Britons; Dame Jenny Harries, the Chief Executive Officer of the sinisterly-named UK Health Security Agency, the merger of Public Health England, NHS Track and Trace and the Joint Biosecurity Centre, responsible for policing and enforcing censorship and restrictions in the UK Biosecurity State; and, finally, Dame June Raine, Chief Executive Officer of the Medicines and Healthcare products Regulatory Agency (MHRA), who on 30 December 2020 granted temporary authorisation to the AstraZeneca/Oxford viral vector ‘vaccine’ for COVID-19, even though the clinical trials are not due to be completed until February 2023.\n\nBy March 2021, less than three months since it began to be injected into a terrorised public not only in the UK but across Europe and the world, the incidents of blood clots with low blood platelets and deaths following injection with the Oxford/AstraZeneca ‘vaccine’ were so numerous that its use was suspended or banned in Austria, Bulgaria, Canada, the Congo, Cyprus, Denmark, France, Germany, Iceland, Indonesia, Ireland, Italy, Latvia, Luxembourg, Malaysia, the Netherlands, Norway, Portugal, Romania, Slovenia, South Africa, Spain, Sweden and Thailand.\n\nIn the UK, however, it continued to be injected into people whose informed consent about the risks, dangers and consequences of doing so had been censored by the Government, media and National Health Service.\n\nThree months before it was authorised, in September 2020, the Oxford trials for the AstraZeneca ‘vaccine’ was paused after a UK participant suffered spinal cord inflammation; yet it took a month to send the ‘vaccine’ trial safety data to the US Food and Drug Administration (FDA).\n\nIn November 2020, it was revealed that AstraZeneca’s claim that its vaccine has an efficacy of 90% was based on a trial only administered to individuals up to 55 years of age, a demographic with a far lower chance of developing the symptoms of COVID-19.\n\nIn April 2021, The Lancet, one of the oldest medical journals in the world, estimated that, although the AstraZeneca ‘vaccine’ has a relative risk reduction of 67%, the absolute risk reduction is only 1.9%. neither of which come near the claims of 90% efficacy made by AstraZeneca or the NHS medical professionals administering it the British public.\n\nThe following month, May 2021, Transparency International Global Health accused AstraZeneca of a lack of transparency over its ‘vaccine’ trials, secret contracts with governments, and conducting ‘science by press release’.\n\nFar from resulting from the pressures of producing a ‘vaccine’ in record time, these questions over the probity of AstraZeneca were consistent with the company’s record of malpractice and bribery.\n\nIn 2010, AstraZeneca paid $520 million in fines to settle charges by the US Federal Government for illegally marketing the anti-psychotic drug, Seroquel, to children and elderly patients for uses not approved by the Food and Drug Administration (FDA).\n\nIn 2013 it was revealed that pharmaceutical companies were paying UK doctors £40 million every year to promote their drugs, with the UK office of AstraZeneca paying £671,400 in fees to 903 doctors plus £30,200 for their travel and hotel bills.\n\nIn 2016, AstraZeneca agreed to pay $5.5 million to settle charges of violating the Foreign Corrupt Practices Act by bribing doctors in China and Russia in order to boost sales of their pharmaceutical products.\n\nAnd in April 2018, it was revealed that AstraZeneca had paid €17.9 million in secret payments to ‘independent’ healthcare professionals to endorse their products, including the use of vaccines. There is nothing to indicate this systemic bribery has stopped.\n\nIndeed, since 2000, AstraZeneca has paid $1.381 billion in fines: $594 million for healthcare-related offences; $556.2 million in government-related offences under the False Claims Act; $198 million for safety-related offences; $21 million under the Foreign Corrupt Practices Act; and $5.52 million for ‘kickbacks and bribery’.\n\nBy mid 2021, however, when the peoples of the world had begun to wake up to the dangers of injecting its product into their bodies, AstraZeneca had reaped the profits from its secret contracts with the governments of those people, having agreed deals to sell 100 million doses of its ‘vaccine’ to the UK, 400 million doses to Europe, 700 million doses to the US and the GAVI Vaccine Alliance, and 1 billion doses to India. As a result of these contracts, AstraZeneca’s net profit in the second quarter of 2020 rose to £581.18 million, compared to just £99.94 million in the same quarter the previous year.\n\nBut the game of cash for lives was up. In November 2021, AstraZeneca, which sold £1.64 billion of its ‘vaccine’ in the first 9 months of 2021, announced it was reneging on its promise to sell at cost ‘for the duration of the pandemic’, which it now declared was in the ‘endemic phase’. A year later, AstraZeneca dropped its submission for approval for its ‘vaccine’ by US regulators.\n\nIn the UK, however, the adverse drug reactions (ADRs) to the Oxford/AstraZeneca ‘vaccine’ were so numerous that even the DHSC, the SAGE, the MHRA and the NHS couldn’t completely deny them, and only 59,700 doses have been administered as part of the UK vaccination programme’s third and ‘booster’ campaigns.\n\nBut the injuries and deaths following injection continued to rise. According to the ‘Yellow Card’ reports of adverse drug reactions and deaths sent to the Medicines and Healthcare products Regulatory Agency, between 28 July 2021 and 23 November 2022, the 259,700 doses of the AstraZeneca ‘vaccine’ injection into the UK public caused an additional 54,000 adverse drug reactions and 270 deaths.\n\nAnd yet, with the exception of a handful of the 81 deaths from thrombo-embolic events (blood clotting), the MHRA responsible for authorising the use and guaranteeing the safety of the experimental biotechnology injected into the UK public as COVID-19 ‘vaccines’ continues to insist that all these injuries and deaths are ‘natural’, ‘coincidental’ and ‘expected’.\n\nWhat the Regulatory Agency doesn’t explain is how, if there is no causal connection to the injections, there is such a huge disparity in the proportion of injuries and deaths to doses between the different brands of ‘vaccines’, which the 169 million doses injected would expect to even out. Based on the reports received by the MHRA, the AstraZeneca injection has a far higher number of ADRs per report (3.54) than Pfizer’s (2.88).\n\nThe chances of having at least one ADR per dose also varying hugely, with those injected with the AstraZeneca ‘vaccine’ having a 0.5% chance of an ADR per dose, compared with 0.2% from Pfizer’s ‘vaccine’ and 0.19% per cent from Moderna’s.\n\nMoreover, as of 23 November 2022, the age of the deceased whose deaths within seven days of injection have been reported to the MHRA are as follows. Under 18 years of age: 9 dead; 18-29: 49 dead; 30-39: 90 dead; 40-49: 138 dead; 50-59: 218 dead; 60-69: 305 dead; 70-79: 471 dead; 80+: 713 dead; unknown age: 369 dead. With the average life expectancy in the UK being 82 years of age, these figures do not support the MHRA’s claim that these deaths were ‘natural’, ‘coincidental’ and ‘expected’.\n\nOn the contrary, what they strongly indicate is causality of different degrees between these experimental viral-vector and messenger RNA injections and the recorded 1.5 million injuries and 2,362 deaths they have caused, and, respectively, the millions and thousands of others that haven’t been officially recorded.\n\nOn 16 October, 2020, The Human Medicines (Coronavirus and Influenza) (Amendment) Regulations 2020 modified The Human Medicines Regulations 2012 to allow temporary authorisation of the unlicensed COVID-19 vaccines. But it also extended complete immunity from civil liability to the scientists, pharmaceutical companies and medical professionals responsible for their manufacture, distribution and administering to the UK public. So Pascal Soriot, KBE, and his fellow knights and dames have nothing to fear from the British courts.\n\nIt is not in order to confer immunity from criminal prosecution, therefore, that those responsible for this catalogue of injuries and deaths inflicted have been knighted, but rather from investigation into the processes and inducements by which they have been placed above the law.\n\nSir Jonathan Van Tam, the Deputy Chief Medical Officer for England, missed his own inauguration ceremony because he tested positive to the novel coronavirus to which the vaccine for whose roll-out he was being awarded a knighthood supposedly conferred immunity. In reality, the only form of immunity these knights and dames have developed is their own immunity to prosecution for crimes against the British people.\n\nAs a measure of the contempt in which he regards his victims, not only in this country but across the world, after he was knighted by King Charles III at Windsor Castle last week, Pascal Soriot, KBE, declared that the concerns around the AstraZeneca injection had been ‘overblown by the media’ and that the incidents of injury and death were ‘extremely rare’.\n\n‘Extremely rare’, however, the term also used by the MHRA and the British Heart Foundation to dismiss the deaths and injuries caused by the COVID-19 ‘vaccines’, is a medically meaningless term when applied to the quantification of risk, being used instead to assure those terrorised into compliance that these dangerous injections are safe. It is also medically inaccurate.\n\nIn May 2019, the Medicines and Healthcare products Regulatory Agency estimated that only 10% of serious Adverse Drug Reactions and between 2% and 4% of non-serious ADRs are reported to them. According to definitions used by the National Institute for Health and Care Excellence, an executive non-departmental public body of the Department of Health and Social Care in England, Adverse Drug Reactions to the AstraZeneca injections are a long way from ‘extremely rare’ or even ‘very rare’ (affecting less than 1 in 10,000 people, or a risk of 0.01%).\n\nOn the contrary, they are ‘uncommon’ (between 1 in 1,000 and 1 in 100 people, or a risk of 0.1 to 1%) if 100% of ADRs are reported; ‘common’ (between 1 in 100 and 1 in 10 people, or a risk of 1% to 10%) if 10% of ADRs are reported; and ‘very common’ (affecting more than 1 in 10 people, or a risk of 10% or higher) if only 2% of ADRs are reported.\n\nNotwithstanding the denials of the MHRA and NHS and the legal immunity conferred by changes to UK legislation, Pascal Soriot, KBE, is not only morally responsible for injuring nearly a quarter of a million Britons and killing 1,334 with his company’s viral-vector ‘vaccine’.\n\nHe is also lying about the risks it continues to pose to those sufficiently terrorised into believing in the honour of knights, dames, kings and other figures of the British Establishment.\n\nIn doing so, he is violating the legal requirement under international law, UK law and NHS best practice for informed consent to medical intervention. This is the man the UK Monarch has chosen to honour and to protect with a knighthood.\n\nA companion piece, The Victims of AstraZeneca, will be published later today.\n\nIf you’re concerned about the UK’s descent into criminality and the ongoing war it is waging against the British people, you may be interested in my new book, The Road to Fascism: For a Critique of the Global Biosecurity State, which is available in hardback, paperback and e-book. Please click on the link for purchase options.\n\nSimon Elmer is the founder of Architects for Social Housing (ASH), you can follow them on twitter.", "opengraph": {"type": "article", "title": "Arise, AstraZeneca!", "url": "https://off-guardian.org/2022/12/23/arise-astrazeneca/", "description": "Simon Elmer In the UK today, it seems, being knighted means you’re someone the UK state wishes to protect from prosecution for crimes against the British people. We don’t need to point to Sir Tony …", "article:published_time": "2022-12-23T04:00:12+00:00", "article:modified_time": "2023-03-25T12:06:03+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/pascal-soriot-astrazeneca-knighted.jpg", "image:width": "1600", "image:height": "1242", "locale": "en_US"}, "tags": ["Simon Elmer", "AstraZeneca", "vaccines", "coronavirus", "covid19", "UK"], "tweets": [], "movies": [], "links": ["https://www.astrazeneca.com/media-centre/press-releases/2022/astrazenecas-pascal-soriot-awarded-british-knighthood-services-uk-life-sciences-leadership-global-response-covid-pandemic.html", "https://www.ox.ac.uk/news/2021-06-11-oxford-university-academics-recognised-queen-s-birthday-honours", "https://www.ed.ac.uk/news/2022/covid-19-effort-recognised-in-queen-s-honours", "https://www.bbc.co.uk/news/uk-59809682", "https://www.aljazeera.com/news/2021/3/15/which-countries-have-halted-use-of-astrazenecas-covid-vaccine", "https://www.dailymail.co.uk/health/article-8843639/AstraZeneca-took-ONE-MONTH-FDA-vaccine-trial-data-study-paused.html", "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(21)00069-0/fulltext", "https://www.transparency.org/en/press/covid-19-vaccines-lack-of-transparency-trials-secretive-contracts-science-by-press-release-risk-success-of-global-response", "https://abcnews.go.com/Politics/Health/astrazeneca-pay-520-million-illegally-marketing-seroquel-schizophrenia/story?id=10488647", "https://www.theguardian.com/society/2013/apr/05/drug-companies-pay-doctors-40m", "https://www.statnews.com/pharmalot/2016/08/31/astrazeneca-bribes-china-russia/", "https://www.thetimes.co.uk/article/20m-secret-payments-to-plug-drugs-by-astrazeneca-and-shire-ns2qrf7m2", "https://violationtracker.goodjobsfirst.org/parent/astrazeneca", "https://invezz.com/news/2020/07/30/astrazenecas-net-profit-jumps-to-581-18-million-in-the-second-quarter/", "https://www.theguardian.com/business/2021/nov/12/astrazeneca-sells-22bn-of-covid-vaccine-in-first-nine-months", "https://www.reuters.com/business/healthcare-pharmaceuticals/astrazeneca-withdraws-us-application-covid-vaccine-2022-11-10/", "https://www.gov.uk/drug-safety-update/yellow-card-please-help-to-reverse-the-decline-in-reporting-of-suspected-adverse-drug-reactions", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://www.legislation.gov.uk/uksi/2020/1125/contents/made", "https://www.bbc.co.uk/news/uk-england-nottinghamshire-61491996", "https://www.independent.co.uk/news/uk/covid-astrazeneca-damian-lewis-william-roache-matt-baker-b2245136.html", "https://twitter.com/thebhf/status/1603071599778873345", "https://www.gov.uk/drug-safety-update/yellow-card-please-help-to-reverse-the-decline-in-reporting-of-suspected-adverse-drug-reactions", "https://bnf.nice.org.uk/medicines-guidance/adverse-reactions-to-drugs/", "https://unesdoc.unesco.org/ark:/48223/pf0000212116", "https://www.supremecourt.uk/cases/uksc-2013-0136.html", "text=Consent%20to%20treatment%20means%20a,an%20explanation%20by%20a%20clinician.", "https://architectsforsocialhousing.co.uk/2022/09/28/the-road-to-fascism-for-a-critique-of-the-global-biosecurity-state/", "https://architectsforsocialhousing.co.uk/", "https://twitter.com/SimonElmer2022", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-12-23T04:00:12+00:00"}