{"result_id": "232042", "URL": "https://off-guardian.org/2023/01/19/why-are-they-finally-admitting-the-covid-vax-could-be-harmful/", "timestamp": "2023-04-25 16:44:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2023/01/19/why-are-they-finally-admitting-the-covid-vax-could-be-harmful/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Why are they FINALLY “admitting” the Covid Vax could be harmful?", "cleaned_text": "Why are they FINALLY “admitting” the Covid Vax could be harmful?\n\nThe mainstream narrative spinners – from politicians to the CDC to the media – have started reporting “possible harms” due to Covid “vaccines”.\n\nThis is a potentially seismic shift in the narrative, but as usual we need to ask the perennial questions –\n\nFor almost two years, those of us expressing concern about the possible damage done by forcing untested and unnecessary gene therapies on billions of people have been either ignored by the noisy majority or slandered by them. And this includes both mainstream and “alt” media.\n\nOn the rare occasion an “anti-vaxxer” was given any kind of platform, it was usually either a hand-picked kook, or a minor celebrity making arguments from emotion.\n\nThe actual science – and the professionals communicating that science – were banished from the mainstream airwaves. Airbrushed out of sight and mind.\n\nThe vaccines were branded “safe and effective”, by everyone everywhere.\n\nLast week the UK’s BBC News invited Dr Aseem Malhotra to discuss prescriptions for statins to prevent heart disease (yeah – another issue, for another time).\n\nDuring his seven-minute interview, he linked mRNA covid “vaccines” to potential cardiac disease:\n\nThis, as far as I know, marks the first time a medical professional has been allowed to make these facts known in the mainstream media.\n\nBut why did it happen?\n\nAnd why did it happen now?\n\nThe “official” story is it was an oopsy moment. That somehow Dr Malhotra just “slipped through the net”, had been invited on to discuss statins, not Covid and just cleverly flipped the script and used his temporary platform to broadcast the truth.\n\nLet’s unpack this idea and see what we have.\n\nFirst thing to note is Dr Malhotra is by no means a closet vaccine-sceptic.\n\nHe has a Twitter account with substantial numbers of followers, on which he regularly questions the mRNA vaccines.\n\nHe has appeared on GB News questioning the vaccines multiple times.\n\nIt seems vanishingly unlikely any BBC researcher would fail to discover what his opinions of the vaccine were.\n\nAnd even supposing he did “slip through the net”, once he started talking about the vaccines, why did the anchor let him continue?\n\nWe have seen in the past how mainstream outlets treat people who start saying things they shouldn’t say:\n\nHe’s going off-topic, and as an interviewer, she would have every right to nudge him back toward the question. But if you watch the interview she barely even attempts to do this. In fact rather than changing the subject, blasting him for being an “anti-vaxxer conspiracy theorist”, or simply cutting the feed…the anchor actively pursues the subject, asking him further questions to draw him out.\n\nWhy would she do this if he was “slipping through the net”?\n\nAnd here’s the kicker: the very same day this “accident” happened Reuters reported the US CDC and FDA are investigating a possible link between Pfizer shots and strokes, under the headline:\n\nThis really should put the final nail in the coffin of the “accident” argument for anyone who understands how narrative-creation works.\n\nWhat we can deduce from this is there is a deliberate ongoing move to shift the narrative and allow some partial, limited discussion of vaccine harms.\n\nThe pressing question is why.\n\nI trust anyone reading this is well aware we can rule out any idea that the BBC, CDC et al have suddenly realized they made a huge mistake.\n\nThe entirety of the global establishment hasn’t been ignoring the risks of the vaccines because they didn’t understand, ok. It wasn’t one big supranational brain fart.\n\nThey were lying, actively and deliberately, for years.\n\nIt’s just that for some reason they have stopped, very briefly and in the tiniest way possible.\n\nSecondly, however reassuring it might be to think so, they have not been forced to admit the truth by sheer weight of evidence.\n\nThat’s not how the psychopathic world of politics and narrative-creation works. There’s nothing so true the agenda-setters and their tame media are forced to report it. On the contrary, they routinely deny the undeniably obvious every day, for year after year, for as long as they need or want to.\n\nThe truth has no relevance in their lexicon unless it also serves some other purpose. They tell stories of convenience, they report only what is of service to those stories.\n\nAnd let’s not forget – they haven’t admitted the truth.\n\nThey haven’t even begun to do that and almost certainly never will.\n\nThey’ve just stopped actively suppressing one part of the suppressed reality.\n\nHowever, even that tiny nano-grain of honesty potentially poses a direct threat to the mainstream narrative, in the way a single pebble rolling down a hill can potentially kick off a landslide – and they clearly know this because they immediately surrounded their “admission” with walkbacks and caveats – just in case.\n\nWithin a few hours of Dr Malhotra’s appearance on the news, the BBC had invited “senior doctors” on to counter his claims, and the Guardian was running a piece quoting various “outraged” doctors criticising the BBC for even letting him on.\n\nLess than 24 hours after the CDC/FDA admitted they were reviewing the vaccine’s possible link to strokes…they reported their results and announced they hadn’t found anything.\n\nThe entire exercise was clearly carefully controlled. The smallest possible shift in the narrative, under very strict conditions.\n\nAfter all, the lethal dose of truth is surprisingly small.\n\nSo back to our initial question: Why this? Why now?\n\nWhy do it at all? Why put two years of “safe and effective” brainwashing at risk? What is going on behind the scenes here?\n\nWell, here are a few possible explanations:\n• Power struggle – Internal political struggle between the Great Reset supporters and those more traditional political factions who want to discredit the “new normal”.\n• “Vaccine wars” – Big pharma infighting, nothing but corporate greed winning out over narrative cohesion (they all pointedly question only the mRNA vaccines at this point, after all).\n• More fear – If the aim of the game is to scare people, then telling the 4 billion vaccinated individuals you might have poisoned them is a powerful move.\n• “new and improved vaccines” – Maybe a push to corral the unvaccinated by “admitting” a (tiny) problem, then “fixing it” in the next updated booster.\n\nWe can’t completely rule out sabotage, of course. It’s possible that some people within the establishment harbour genuine doubts about the course of events since 2020 and are trying to covertly get information out. Although the coordinated nature of the release makes that unlikely, it’s not impossible.\n\nRegardless, we still need to keep our eyes open. It might be a victory, but it might be something else.\n\nThe old mantra applies: Always be sceptical of the media, even when – especially when – they tell you what you want to hear.", "opengraph": {"type": "article", "title": "Why are they FINALLY “admitting” the Covid Vax could be harmful?", "url": "https://off-guardian.org/2023/01/19/why-are-they-finally-admitting-the-covid-vax-could-be-harmful/", "description": "Kit Knightly The mainstream narrative spinners – from politicians to the CDC to the media – have started reporting “possible harms” due to Covid “vaccines”. This…", "article:published_time": "2023-01-19T15:00:58+00:00", "article:modified_time": "2023-01-19T14:41:36+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/13_jan_2023_screenshot_2023-01-13_at_16.00.15_social_media.jpg", "image:width": "1200", "image:height": "630", "locale": "en_US"}, "tags": ["GB news", "vaccines", "Pfizer", "covid19", "Reuthers", "guardian", "twitter"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">BREAKING BBC News:</p>\n<p>Cardiologist says likely contributory factor to excess cardiovascular deaths is covid mRNA vaccine and roll out should be suspended pending an inquiry.</p>\n<p>We did it. We broke mainstream broadcast media 🔥🔥🔥 <a href=\"https://t.co/F72YS7JAuE\">pic.twitter.com/F72YS7JAuE</a></p>\n<p>— Dr Aseem Malhotra (@DrAseemMalhotra) <a href=\"https://twitter.com/DrAseemMalhotra/status/1613837487796850688?ref_src=twsrc%5Etfw\">January 13, 2023</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/ybSIhzOcD9w\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/ybSIhzOcD9w"}], "links": ["https://off-guardian.org/?attachment_id=87107", "https://t.co/F72YS7JAuE", "https://twitter.com/DrAseemMalhotra/status/1613837487796850688?ref_src=twsrc%5Etfw", "https://www.reuters.com/business/healthcare-pharmaceuticals/us-says-pfizers-bivalent-covid-shot-may-be-linked-stroke-older-adults-2023-01-13/", "https://www.dumptheguardian.com/world/2023/jan/13/bbc-cardiologist-aseem-malhotra-links-covid-jabs-to-heart-disease-deaths", "https://www.washingtonpost.com/health/2023/01/13/pfizer-covid-vaccine-safety/", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2023-01-19T15:00:58+00:00"}