{"result_id": "232024", "URL": "https://off-guardian.org/2021/02/15/5-questions-to-ask-your-friends-who-plan-to-get-the-covid-vaccine/", "timestamp": "2023-04-25 16:43:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2021/02/15/5-questions-to-ask-your-friends-who-plan-to-get-the-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "5 questions to ask your friends who plan to get the Covid vaccine", "cleaned_text": "5 questions to ask your friends who plan to get the Covid vaccine\n\nMany of us have friends or family who plan on getting the vaccine. Maybe they truly believe they are in danger. Maybe they think it’s better safe than sorry. Maybe they just want to be able to go to the pub again.\n\nIf you know someone who is planning on getting vaccinated against Covid19, ask them these five questions. Make sure they understand exactly what they’re asking for.\n\n1. Did you know that we have NEVER successfully vaccinated against ANY coronavirus?\n\nNo successful vaccine against a coronavirus has ever been developed.\n\nScientists have been trying to develop a SARS and MERS vaccine for years, with nothing to show for it. In fact, some of the failed SARS vaccines actually caused hypersensitivity to the SARS virus. Meaning that vaccinated mice could potentially get the disease more severely than unvaccinated mice.\n\n2. Did you know it usually takes 5-10 years to fully develop a vaccine?\n\nVaccine development is a slow, laborious process. Usually, from development through testing and finally being approved for public use takes many years. The various vaccines for Covid have all been developed and approved in less than a year.\n\nWhile the media are quick to offer a TON of “explainer” guides, which cite “foresight, hard work and luck” as the reasons we got a Covid vaccine so quickly “without cutting corners”, they all leave out key information.\n\nNamely, that none of the vaccines have yet been subject to proper trials. Many of them skipped early-stage trials entirely, and the late stage human trials have either not been peer reviewed, have not released their data, will not finish until 2023 or were abandoned after “severe adverse effects”.\n\n3. Did you know that the Covid “vaccine” is based on new technology, which has never been approved for use on humans before?\n\nWhile traditional vaccines work by exposing the body to a weakened strain of the microorganism responsible for causing the disease, these new Covid vaccines are mRNA vaccines.\n\nmRNA (messenger ribonucleic acid) vaccines theoretically work by injecting viral mRNA into the body, where it replicates inside your cells and encourages your body to recognise, and make antigens for, the “spike proteins” of the virus. They have been the subject of research since the 1990s, but before 2020 no mRNA vaccine was ever approved for use.\n\n4. Did you know that the pharmaceutical companies can’t be sued if the vaccine hurts or kills someone?\n\nBack in the Spring of 2020 many governments around the world granted vaccine manufacturers immunity to civil liability, either by invoking existing legislation or writing new laws.\n\nThe USA’s Public Readiness and Emergency Preparedness Act (PREP) grants immunity until at least 2024.\n\nThe EU’s product licensing law does the same, and there are reports of confidential liability clauses in the contracts the EU signed with vaccine manufacturers.\n\nThe UK went even further, granting permanent legal indemnity to the government, and any employees thereof, for any harm done when a patient is being treated for Covid19 or “suspected Covid19”.\n\n5. Did you know 99.8% of people survive Covid19?\n\nThe case-fatality ratio of Sars-Cov-2 infection has been a bone of contention for months, but it is certainly much lower than all the initial models predicted.\n\nIt was originally massively inflated, with the WHO using a figure of 3.4%.\n\nSubsequent studies have found it to be much lower, in some cases even lower than 0.1%. A report published in October in the WHO’s own research bulletin finding a CFR of 0.23% “or possibly considerably lower”.\n\nMeaning, even according to the WHO, at least 99.77% of people infected with the virus will survive.\n\nAsk your friends these questions. Give them detailed answers.\n\nIt is a rushed and untested vaccine, made using unprecedented technology, with no legal recourse should it do you harm, to treat a virus 99.8% of people will survive.\n\nSo the question that really matters is: Do you really want, or need, to take that risk?", "opengraph": {"type": "article", "title": "5 questions to ask your friends who plan to get the Covid vaccine", "url": "https://off-guardian.org/2021/02/15/5-questions-to-ask-your-friends-who-plan-to-get-the-covid-vaccine/", "description": "It is a rushed and untested vaccine, made using unprecedented technology, with no legal recourse should it do you harm, to treat a virus 99.8 of people will survive. So the question that really mat…", "article:published_time": "2021-02-15T20:30:36+00:00", "article:modified_time": "2021-07-28T11:22:33+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/close-up-vaccine-injection.jpg", "image:width": "1200", "image:height": "900", "locale": "en_US"}, "tags": ["SARS", "BioNTech", "sars-cov-2", "vaccines", "Pfizer", "covid19", "Kit Knightly", "mRNA"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/close-up-vaccine-injection.jpg", "https://www.abc.net.au/news/health/2020-04-17/coronavirus-vaccine-ian-frazer/12146616", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3335060/", "https://www.weforum.org/agenda/2020/06/vaccine-development-barriers-coronavirus/", "https://www.channel4.com/news/how-did-we-get-coronavirus-vaccines-so-fast", "https://www.bbc.co.uk/news/health-55041371", "https://www.medicalnewstoday.com/articles/how-did-we-develop-a-covid-19-vaccine-so-quickly", "https://www.theguardian.com/commentisfree/2020/dec/26/ten-reasons-we-got-covid-19-vaccines-so-quickly-without-cutting-corners", "https://off-guardian.org/2021/01/03/what-vaccine-trials/", "https://web.archive.org/web/20201128213442/https://clinicaltrials.gov/ct2/show/results/NCT04516746", "https://web.archive.org/web/20201229112508/https://clinicaltrials.gov/ct2/show/study/NCT04540393", "https://horizon-magazine.eu/article/five-things-you-need-know-about-mrna-vaccines.html", "http://sitn.hms.harvard.edu/flash/2015/rna-vaccines-a-novel-technology-to-prevent-and-treat-disease/", "https://www.cnbc.com/2020/12/16/covid-vaccine-side-effects-compensation-lawsuit.html", "https://fullfact.org/health/unlicensed-vaccine-manufacturers-are-immune-some-not-all-civil-liability/", "https://www.reuters.com/article/uk-health-coronavirus-eu-vaccine-idUKKCN26D0UG", "https://off-guardian.org/2020/04/08/coronavirus-fact-check-2-the-emergency-powers-will-only-last-2-years/", "https://www.sciencemediacentre.org/expert-reaction-to-who-director-generals-comments-that-3-4-of-reported-covid-19-cases-have-died-globally/", "https://www.who.int/bulletin/online_first/BLT.20.265892.pdf", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2021-02-15T20:30:36+00:00"}