{"result_id": "232004", "URL": "https://off-guardian.org/2022/10/22/experts-now-admit-you-will-never-be-fully-vaccinated/", "timestamp": "2023-04-25 16:43:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/10/22/experts-now-admit-you-will-never-be-fully-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "“Experts” now admit you will NEVER be “fully vaccinated”", "cleaned_text": "“Experts” now admit you will NEVER be “fully vaccinated”\n\nWe at OffG – and many of our fellow alt media sites – have been reporting for over a year now that the Covid “vaccination” campaign will never end.\n\nIn short, you will NEVER be “fully vaccinated”.\n\nThat much was obvious once health institutions around the world started “updating” their definition of the term.\n\nIsrael. America. Britain. New Zealand. Australia…they all did it, and it came as no surprise.\n\nFrom the beginning, the “pandemic” has been created, policed, enforced and perpetuated through nothing but rhetorical tricks and manipulative language. News names for old things. New definitions for old words.\n\n“Covid” has always been nothing but a pandemic of terminology. The fluid nature of “fully vaccinated” is just another example.\n\nIt has already ballooned from “double-jabbed” to “boosted” and “double-boosted”, and with new “vaccines” expected for all the variants, it doesn’t look like any end is on the horizon.\n\nAs I said, you’ll never really be “fully vaccinated”…and now they’re admitting it.\n\nIn yet another attempt at control through language manipulation, there’s a push on to completely scrub the term “fully vaccinated” from the Covid discourse.\n\nBefore going on to claim:\n\nIf you still say “fully vaccinated” for Covid, it’s time to stop. With new boosters on the market and an ever-evolving virus, experts say the term no longer means being the most protected you can be. They point to two, far more appropriate alternatives to use in this current phase of the pandemic\n\nThey also recommend “adjusting your vocabulary” with their suggested new alternative: “up to date”, a frank admission that the Covid boosters will keep on coming, potentially forever.\n\nEssentially, having spent 18 months convincing millions of people to get “fully vaccinated”, they’re now messing with language again to reverse course and strip that designation away.\n\nMeaning all those people who dutifully took their clot shots are not only no longer considered “fully vaccinated”, but never will be, and are now not even allowed to use that phrase because it creates a false impression.\n\nThe good news is that vaccine uptake is slowing – it has been for months – and this transparent effort to lay the ground for future booster campaigns will likely fall flat on its face.\n\nAnd finally, to all the (formerly) “fully vaccinated” out there, we are sorry…but we did try to tell you this would happen.", "opengraph": {"type": "article", "title": "“Experts” now admit you will NEVER be “fully vaccinated”", "url": "https://off-guardian.org/2022/10/22/experts-now-admit-you-will-never-be-fully-vaccinated/", "description": "Kit Knightly We at OffG – and many of our fellow alt media sites – have been reporting for over a year now that the Covid “vaccination” campaign will never end. In short, yo…", "article:published_time": "2022-10-22T17:00:47+00:00", "article:modified_time": "2022-10-22T14:08:18+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/adobe-stock-world-needles-injection-vaccine-scaled.jpeg", "image:width": "2560", "image:height": "1440", "locale": "en_US"}, "tags": ["NBC", "Israel", "vaccines", "Pfizer", "coronavirus", "covid19", "USA"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/2021/12/14/you-will-never-be-fully-vaccinated/", "https://off-guardian.org/2021/10/23/cdc-director-we-may-need-to-update-our-definition-of-fully-vaccinated/", "https://www.cnbc.com/2022/10/21/covid-experts-stop-saying-fully-vaccinated-use-up-to-date-instead.html", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-10-22T17:00:47+00:00"}