{"result_id": "232047", "URL": "https://off-guardian.org/2022/04/21/russia-astrazeneca-vaccine-collusion/", "timestamp": "2023-04-25 16:44:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/04/21/russia-astrazeneca-vaccine-collusion/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Russia & AstraZeneca: “Vaccine” Collusion", "cleaned_text": "By April 2020, a third of the world’s population was living under medical martial law. But there was a light at the end of the tunnel: trusted pharmaceutical companies were developing “safe and effective” vaccines that would stop the spread of the dreaded virus and end the pandemic. Or so we were told.\n\nThe clock was ticking – and Big Pharma needed lots of money in order to expedite the creation of a miracle drug. In the United States, the Trump administration launched Operation Warp Speed, a lavishly funded program that aimed to accelerate the development and distribution of coronavirus elixirs.\n\nAt the same time, the Russian government poured resources into developing its own vaccine. Funding for the public health initiative came from the Russian Direct Investment Fund (RDIF), the country’s sovereign wealth fund. In June 2020, RDIF announced a joint venture with R-Pharm, one of Russia’s largest pharmaceutical firms.\n\nThe duo would work together to produce and distribute a vaccine developed by the Russian health ministry’s Gamaleya Center.\n\nThe health ministry approved the vaccine after less than two months of testing, making Sputnik V the world’s first registered COVID shot. The drug’s catchy name was the brainchild of RDIF CEO Kirill Dmitriev, a World Economic Forum Young Global Leader (Class of 2009).\n\nThe Soros Foundation spotted Dmitriev’s potential at an early age, and awarded him a scholarship to study at Stanford University and later Harvard Business School. He worked for Goldman Sachs and McKinsey & Company before taking the reins at RDIF in 2011.\n\nDmitriev’s decision to include R-Pharm in RDIF’s investment portfolio was a shrewd move worthy of his Young Global Leader pedigree.\n\nOn July 17, 2020, AstraZeneca announced R-Pharm would become “one of the hubs for the production and supply of [its] vaccine to international markets.” Under the agreement, the British-Swedish pharmaceutical giant agreed to transfer its adenoviral vector to Russia. R-Pharm would then be tasked with “finishing” doses and shipping them abroad.\n\nThe company said in a press release:\n\nIn other words: by July 2020, the Russian government had positioned itself to profit from the production and distribution of two COVID vaccines: Sputnik V and AstraZeneca’s shot.\n\nAs vaccine-linked injuries and deaths continue to be documented around the world, some have portrayed Russia as a bulwark against Big Pharma’s murderous business model. As we will document below, nothing could be further from the truth.\n\nOn July 17, 2020, the Guardian reported the British government was “more than 95%” sure that Russian hackers had targeted UK, US and Canadian organizations involved in developing a coronavirus vaccine.\n\nCuriously, on the exact same day, AstraZeneca revealed it had partnered with Russia’s R-Pharm.\n\nDmitriev dismissed the hacking allegations as ludicrous, pointing to the fact that stealing British vaccine secrets would be a waste of time because R-Pharm had already signed a deal with AstraZeneca to manufacture the company’s vaccine.\n\n“Everything needed to produce the British vaccine has already been transferred to R-Pharm,” RDIF’s CEO said in response to the spurious hacking accusations. “AstraZeneca has already signed commitments to transfer all production of the British vaccine to R-Pharm.”\n\nHowever, this partnership didn’t stop Dmitriev from taking swipes at AstraZeneca. When clinical trials for AstraZeneca’s shot hit a brief road bump in September 2020, RDIF’s director suggested the British vaccine was based on an “untested platform.” (Perhaps he was trying to deflect scrutiny of Sputnik V, which was also based on a totally unproven platform?)\n\nDmitriev’s doubts about the British-Swedish vax didn’t stop RDIF from pursuing closer business ties with AstraZeneca. On the contrary, in December, RDIF, AstraZeneca, the Gamaleya Center, and R-Pharm signed a memorandum of cooperation.\n\n“Today we announce a clinical trial program to assess safety and immunogenicity of the combination of AZD1222, developed by AstraZeneca and Oxford University, and Sputnik V, developed by Russian Gamaleya Center… Both AZD1222 and Sputnik V are adenoviral vector vaccines that contain genetic material of SARS-CoV-2 virus spike protein,” AstraZeneca said in a December 11 press release.\n\n“I am absolutely convinced that such an attitude towards partnership today can serve as a good, convincing example of combining scientific forces, technologies, investments for a common goal – to protect the life, health and safety of millions of people on the planet as a whole,” Putin noted. Addressing AstraZeneca’s CEO, he added: “I want to wish you success not only in the Russian market, but also in global markets, and express the hope that the new year will be favorable for your company and for solving the problems that we are now talking about.”\n\nCommenting on the partnership, Gamaleya’s director, Alexander Gintsburg, predicted a combination of Sputnik V and AstraZeneca would eventually be registered for use in Russia.\n\nIt was the beginning of a beautiful friendship.\n\nRDIF wasted no time in pursuing its dream of creating a COVID-fighting cocktail from the two vaccines it was financially invested in. In February 2021, Azerbaijan agreed to host a clinical trial to test a combination of Sputnik V’s first component (“Sputnik Light”) and AstraZeneca’s shot. Dmitriev praised the study as an example of “international efforts” to defeat coronavirus.\n\nMeanwhile, inconvenient “safety concerns” were popping up in the media. By mid-March, 20 European countries had temporarily suspended the use of AstraZeneca’s vaccine due to reports linking the drug to blood clots and internal bleeding.\n\nDespite the worrying reports, RDIF did not abandon its Big Pharma pal.\n\nOn July 15, Sputnik V’s official Twitter account boasted RDIF was “the 1st to start joined [sp] trials with AstraZeneca in February and will be announcing more collaborations soon. We urge other vaccine producers to join forces with us for mix & match trials. This is the way to immunity for the global community!”\n\nAbout a week later, Russia’s health ministry approved a Sputnik Light-AstraZeneca trial. Five Russian medical institutions participated in the study, which involved 150 subjects.\n\nAt the end of July, RDIF disclosed the preliminary results of the clinical trial held in Azerbaijan. A whopping 50 people were injected with the Sputnik V-AstraZeneca cocktail, which was determined to be safe and effective.\n\nPreliminary data from a parallel study held in Argentina produced similarly promising results. The timing was perfect, because in August, the Argentinian government began administering AstraZeneca and Moderna shots to people who had received the first component of Sputnik V. Argentina said it was mixing the drugs due to supply shortages, but Dmitriev insisted this had been the plan all along.\n\n“We suggested it, we always wanted to do a combo,” Dmitriev said at the time. “Sputnik is the first combined vaccine, the first mix and match, which consists of two different shots. We have said from the beginning that two different shots work better than two identical ones.”\n\nThe same month, data released by Argentina’s health authorities showed Sputnik V was causing far more post-vaccination complications than AstraZeneca’s vaccine.\n\nMeanwhile, R-Pharm was making final preparations to begin mass production of both Sputnik V and the British-Swedish shot. In September, the Russian pharmaceutical company announced it had started manufacturing the AstraZeneca vaccine for export.\n\nBy late 2021, the big-brains behind Sputnik V were openly collaborating with Pfizer and Moderna.\n\n“We already have a joint study with Moderna in Argentina, and Argentina is now investigating a combination of Sputnik and Moderna. There are also two other countries that are currently doing research on a combination of Pfizer and Sputnik, and we believe that this will be a very successful combination,” Dmitriev said in October.\n\nAround the same time, Sputnik V’s official Twitter account gushed about the trial results of the Sputnik Light-Moderna combo.\n\nThe Gamaleya Center was also excited about these new clot-shot cocktails. In November, one of the scientists who developed Sputnik V, Dmitry Shcheblyakov, advocated for mixing the Russian vaccine with mRNA shots.\n\n“We see that the combination of different vaccines made with different technologies only gives an advantage,” Shcheblyakov said.\n\nAccording to RDIF, data from Pfizer-Sputnik trials will be available by the end of 2022.\n\nThere was big news in February: the Azerbaijan study now had an impressive 100 participants, and the results were still extremely promising.\n\n“Preliminary data from the combined use of Sputnik Light and AstraZeneca vaccines confirm the benefit of using different vaccines during revaccination. In the context of the emergence of new dangerous strains of coronavirus, it is this approach that can provide safe, effective and long-term protection,” Dmitriev said in a February 14 press release.\n\nNotably, western sanctions introduced in response to the “special operation” in Ukraine have not put an end to Russia’s partnership with Big Pharma. Western drugmakers have maintained operations in the country, even as dozens of companies have pulled out of Russia.\n\nOn March 15, R-Pharm applied to register AstraZeneca’s coronavirus vaccine in Russia.\n\nThe fact that Russia’s cynical vaccine profiteering continues unabated, even after Moscow has been almost completely cut off from western financial systems and markets, reveals an uncomfortable reality: there is no escaping the depraved, anti-human biosecurity theater spawned by “the pandemic.”\n\nThe only question now is: which “bloc” will claim the right to torment and inject you?\n\nRiley Waggaman is your humble Moscow correspondent. He worked for RT, Press TV, Russia Insider, yadda yadda. In his youth, he attended a White House lawn party where he asked Barack Obama if imprisoned whistleblower Bradley Manning (Chelsea was still a boy back then) “had a good Easter.” Good times good times. You can subscribe to his Substack here, or follow him on twitter.", "opengraph": {"type": "article", "title": "Russia & AstraZeneca: “Vaccine” Collusion", "url": "https://off-guardian.org/2022/04/21/russia-astrazeneca-vaccine-collusion/", "description": "Riley Waggaman Audio Version New Feature! By April 2020, a third of the world’s population was living under medical martial law. But there was a light at the end of the tunnel: trusted pharmaceutic…", "article:published_time": "2022-04-21T18:00:28+00:00", "article:modified_time": "2022-04-22T14:25:14+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/waggaman-russia-AZ-vaccine-banner.jpg", "image:width": "2050", "image:height": "950", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/waggaman-russia-AZ-vaccine-banner.jpg", "https://off-guardian.org/wp-content/medialibrary/Russia-AstraZeneca-Vaccine-Collusion-1-Edit-1-Mono.mp3", "https://web.archive.org/web/20200718051932/https:/www.rdif.ru/Eng_fullNews/5328/", "https://www.newyorker.com/magazine/2021/02/08/the-sputnik-v-vaccine-and-russias-race-to-immunity", "https://www.weforum.org/people/kirill-dmitriev", "https://archive.ph/84lrr", "https://web.archive.org/web/20201025055303/https:/www.rdif.ru/Eng_Portfolio/r-pharm/", "https://www.astrazeneca.ru/media/press-releases/2020/20201707-ru2011.html", "https://www.theguardian.com/world/2020/jul/17/russian-hackers-steal-coronavirus-vaccine-uk-minister-cyber-attack", "https://www.astrazeneca.ru/media/press-releases/2020/20201707-ru2011.html", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20200717-1819.html", "https://fortune.com/2020/07/20/covid-vaccine-russia-approach/", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20200912-1956.html", "https://brownstone.org/articles/the-covid-chaos-in-russia/", "https://web.archive.org/web/20210102124113/https:/www.astrazeneca.ru/content/az-ru/media/news/2020/20201211-ru201.html", "https://sputniknews.com/20201221/russias-gamaleya-research-uk-swedish-astrazeneca-sign-memorandum-of-cooperation-in-covid-19-fight-1081524451.html", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20201221-1343.html", "https://www.biopharma-reporter.com/Article/2021/02/09/Clinical-trial-set-to-test-efficacy-of-mixing-Sputnik-V-and-COVID-19-Vaccine-AstraZeneca", "https://www.science.org/content/article/it-s-very-special-picture-why-vaccine-safety-experts-put-brakes-astrazeneca-s-covid-19", "https://twitter.com/sputnikvaccine/status/1415657399801630721", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20210727-0802.html", "https://www.clinicaltrialsarena.com/news/astrazeneca-shot-sputnik-light/", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20210731-0918.html", "https://web.archive.org/web/20210805212245/https:/www.reuters.com/world/americas/argentina-handles-sputnik-v-delay-by-giving-second-jabs-other-vaccines-2021-08-05/", "https://edwardslavsquat.substack.com/p/sputnik-v-what-youre-not-being-told?s=w", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20210917-1430.html", "https://tass.ru/ekonomika/12653407", "https://twitter.com/sputnikvaccine/status/1448630611921473546", "https://tass.ru/obschestvo/12974965", "https://xn--80aesfpebagmfblc0a.xn--p1ai/news/20211209-1134.html", "https://web.archive.org/web/20220214103804/https:/www.rdif.ru/fullNews/7292/", "https://www.thepharmaletter.com/article/business-as-usual-for-global-drugmakers-in-russia-despite-military-escalation-and-sanctions", "https://www.interfax.ru/russia/828285", "https://edwardslavsquat.substack.com/", "https://twitter.com/RileyWaggaman?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-04-21T18:00:28+00:00"}