{"result_id": "232007", "URL": "https://off-guardian.org/2022/11/18/g20s-globalist-pledge-commits-to-vaccine-passports-digital-currency-much-much-more/", "timestamp": "2023-04-25 16:43:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/11/18/g20s-globalist-pledge-commits-to-vaccine-passports-digital-currency-much-much-more/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "G20’s globalist “pledge” commits to vaccine passports, digital currency & much, much more", "cleaned_text": "G20’s globalist “pledge” commits to vaccine passports, digital currency & much, much more\n\nThis past week saw G20’s annual meeting taking place in Bali, with the leaders of the world’s 20 largest economies signing a pledge that commits to:\n• Increase surveillance and censorship of “disinformation” on the internet\n\nYes, while everyone was so nicely distracted by the “fall of Kherson” and that missile that allegedly hit Poland, leaders from around the world were gathering in matching shirts and publishing their plans for world government in glossy little ring binders.\n\nWe’ve already seen the COP27 focus on “alternative farming” (ie. lab-grown meat and eating insects), but the G20 leader’s declaration is much more ambitious. And we still have the UN Biodiversity Summit to look forward to.\n\nYes, the creepy global gathering season is really hitting its stride, and the participants are making no secret of their global plans moving forward.\n\nYou can read the whole thing here, we’ll just be pulling out a few key quotes.\n\nFor starters let’s take a look at the “theme” of this year’s summit, which has a very familiar ring to it:\n\nCall me crazy, but that sounds like just another way of saying “build back better”, doesn’t it?\n\nYou might expect any declaration made under the “build back better” banner to be filled with Great Reset talking points…and you’d be absolutely correct.\n\nThere’s a re-dedication to the ongoing war on food, and an echoing of the COP27 focus on “innovation” and “reform” in agriculture [emphasis added throughout]:\n\nTo be clear, “mitigating climate change” means “farming less meat”; “diversifying food sources” means “eating bugs”; and “innovative practices and technologies” means lab-grown meat and/or yeast paste.\n\nThere’s a LOT of material on “reversing” or “mitigating” climate change, including overly verbose pledges to “reform” energy supplies:\n\nYou don’t need me to translate that.\n\nAnd after that comes the “pandemic preparedness” spiel, calling for a “legally binding instrument” to “strengthen” global pandemic preparedness:\n\nThat has been on the agenda for a while, you can read our previous pieces on it here and here.\n\nNext there’s the promise to control the internet more strictly, for the sake of “security”:\n\nIf you’ve been waiting with bated-breath for them to mention central bank digital currencies (CBDCs), well wait no longer:\n\nFinally – and probably most concerning of all – they pledge to introduce international vaccine passports:\n\nThere you have it, the G20 shopping list that includes (but is not limited to): Food reform, energy reform, pandemic legislation, “cyber security”, CBDCs, and vaccine passports/digital ID.\n\nNothing surprising, but unusual to see it all laid out in one document like that.\n\nAnd let’s not forget the more old-fashioned motive – greed. The “pledge” is riddled with talk of “funding gaps”, donations, and “public-private partnerships”.\n\nAll of these serve as cover for international money laundering, embezzling, and other ways of funneling tax-payer money into the over-stuffed pockets of the 1%.\n\nOh, a little reminder to those who still believe Russia is fighting the good fight against the globalist baddies in Ukraine – Russia is a member of the G20 and signed the pledge.\n\nAs did China, along with every other member of BRICS.\n\nThere are no heroes here, they are all in it together…but their war sure made for a good distraction, didn’t it?\n\nBasically, it’s all just confirmation – if confirmation were needed – that the Great Reset is still coming. Even if Covid goes away, the new normal is here to stay.\n\nBut, of course, that was always the plan.", "opengraph": {"type": "article", "title": "G20’s globalist “pledge” commits to vaccine passports, digital currency & much, much more", "url": "https://off-guardian.org/2022/11/18/g20s-globalist-pledge-commits-to-vaccine-passports-digital-currency-much-much-more/", "description": "Kit Knightly This past week saw G20’s annual meeting taking place in Bali, with the leaders of the world’s 20 largest economies signing a pledge that commits to: “Reform” fo…", "article:published_time": "2022-11-18T23:00:24+00:00", "article:modified_time": "2023-02-06T16:26:44+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/g20-agenda-cover.jpg", "image:width": "2271", "image:height": "2560", "locale": "en_US"}, "tags": ["CBDCs", "vaccine passports", "G20", "ukraine", "edible insects", "cop27", "BRICS", "lab grown meat", "Poland", "russia", "china"], "tweets": [], "movies": [], "links": ["https://www.bbc.co.uk/news/63648958", "https://off-guardian.org/2022/11/13/lab-grown-meat-nuclear-yeast-vats-cop27-reignites-the-war-on-food/", "https://www.un.org/en/content/summits2022/", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/", "https://www.youtube.com/watch?v=YkcaeaD45MY", "https://off-guardian.org/2022/10/11/pandemic-treaty-reports-of-its-death-have-been-greatly-exaggerated/", "https://off-guardian.org/2022/04/19/pandemic-treaty-will-hand-who-keys-to-global-government/", "https://off-guardian.org/2021/10/01/programmable-digital-currency-the-next-stage-of-the-new-normal/", "http://edwardslavsquat.substack.com/p/world-leaders-agree-to-cattle-tag?utm_source=profile&utm_medium=reader2", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-11-18T23:00:24+00:00"}