{"result_id": "232039", "URL": "https://off-guardian.org/2021/01/03/what-vaccine-trials/", "timestamp": "2023-04-25 16:43:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2021/01/03/what-vaccine-trials/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "What Vaccine Trials?", "cleaned_text": "The most important, meaningful phase of CV-19 vaccine trials has barely begun, let alone been completed\n\nCOVID 19 vaccine trials appear to have caused some confusion. Hopefully, this article might help clear things up a bit. People genuinely appear to believe that the COVID 19 vaccines have undergone clinical trials and have been proven to be both safe and effective. That belief is simply wrong.\n\nThe main point is this. If you decide to have Pfizer and BioNTech’s experimental mRNA-based BNT162b2 (BNT) vaccine, or any other claimed COVID 19 vaccine for that matter, you are a test subject in a drug trial.\n\nThe mRNA in the BNT vaccine was sequenced from the 3rd iteration of the original WUHAN published Genome SARS-CoV-2 (MN908947.3). However, the WHO protocols Pfizer used to produce the mRNA do not appear to identify any nucleotide sequences that are unique to the SARS-CoV-2 virus. When investigator Fran Leader questioned Pfizer they confirmed:\n\nNor are there any completed clinical trials for these vaccines. Trials are ongoing. If you are jabbed with one, you are the guinea pig. This may be fine with you but it’s not a leap of faith I or my loved ones wish to take. However, everyone is different.\n\nOn December the 8th the BBC reported a study in the Lancet and categorically stated:\n\nThe BBC had no justification to make this claim. The study in the Lancet did not confirm anything of the sort. The researchers wrote:\n\nThis was an interim analysis funded by, among others, CEPI and the Bill and Melinda Gates Foundation. The analysis was based upon trials which are years from completion and haven’t reported anything. The researchers also stated:\n\nThere is no clear scientific evidence establishing either the safety or efficacy of proposed COVID 19 vaccines. The BBC and other MSM reports that this evidence exists are false.\n\nWe are going to focus on Pfizer and BioNTech’s BNT vaccine but all the manufacturers have essentially exploited the same trick. The regulators and governments have worked with the pharmaceutical corporations to conflate the limited data from the initial, or phase one, trials with the incomplete and ongoing data collection from the substantially larger phase two and three trials. The MSM have then falsely claimed the 1,2,3 phase trials are complete and insinuated that the untested data demonstrates vaccine efficacy and safety.\n\nIn reality, not only has the reporting of existing data been manipulated to show efficacy that isn’t evident in the raw data itself, the most important and meaningful phases of the trials have barely begun, let alone been completed.\n\nRecently the UK Financial Times reported that the UK regulators (the MHRA) are due to approve Astrazeneca/Oxfords AZD1222 [ChAdOx1] COVID 19 Vaccine. The FT revealed an anonymous statement from the UK Department of health:\n\nThus giving the public the impression that the trials are complete and that the regulators have strict safety standards. The 1,2,3 phase trial for AZD1222 was registered with the U.S. Centre for Disease Control as clinical trial NCT04516746 [Archived 29th December 2020]. It is incomplete and the estimated end date is February 21st 2023. The CDC state:\n\nAstrazeneca are years away from reporting any “final data.” It is impossible for the UK Department of Health to review it, because it doesn’t exist.\n\nNCT04516746 is one of four trials of AZD1222. Another Russian arm of the AZD1222 trial was suspended after a Suspected Unexpected Serious Adverse Reaction (SUSAR) event occurred. The SUSAR supposedly happened in the United Kingdom after a 37 year old women developed inflammation of the spinal chord. It appears the Russian Ministry of Health have yet to reinstate their arm of the Astrazeneca/Oxford trial while it has resumed in the UK and elsewhere.\n\nOn November 18th Pfizer and BioNTech announced they had concluded their phase three trial of BNT. They had demonstrated efficacy of 95% and U.S. Food and Drug Administration’s (FDA’s) Emergency Use Authorization (EUA) safety data milestone had been met.\n\nThe only part of this claim that was true was compliance with FDA emergency safety data milestones. They have not concluded their phase three trials. They haven’t even fully completed phase one.\n\nUnder section 564 of the Federal Food, Drug, and Cosmetic Act (FD&C Act) so called “unapproved” drugs are allowed on the market in emergencies. Similarly, in the UK, authorisation under Regulation 174 of the Human Medicine Regulations 2012 (as amended) permits the same.\n\nHaving also been approved in the UK, this is why the Medicines and Healthcare products Regulatory Agency (MHRA) state:\n\nThe fact that there are no completed clinical trials for the Pfizer and BioNTech BNT vaccine also explains why the FDA State:\n\nYet the first people to receive this vaccine are the most vulnerable in society, many of whom are immunocompromised. The precautionary principle appears to have been abandoned. The notion that the purpose of the BNT vaccine roll out is to save life appears untenable.\n\nThe Pfizer announcement enabled politicians to pretend to cry on national television while others were really excited. UK Prime Minister Boris Johnson said it was “fantastic news,” and the BBC said it was “good news” and “really encouraging.” Everyone was thoroughly impressed with the 95% effective claim.\n\nHowever, this was based upon relative risk reduction. That is the declared percentage difference between the vaccinated group’s 8/18310 chance (0.044%) of developing COVID 19 against a 162/18319 (0.88%) chance of COVID 19 symptoms without the vaccine. As this larger group of 43,000 people have yet to be trialled, there is no basis for this claimed outcome. But it is what it is, and we can use these reported figures here.\n\nIt should be noted this only refers to an alleged reduction of COVID 19 symptoms among those who have the virus. The tested endpoints do not demonstrate that the vaccine will either reduce the spread of infection or save lives. It should also be noted that these figures suggest the threat from COVID 19 is vanishingly small.\n\nUsing Pfizer’s figures, the relative risk reduction is 100(1 – (0.044/0.88)). Which is 95%. Voila!\n\nThis sounds fantastic and is a much better marketing strategy than reporting the absolute risk reduction. The absolute risk of developing COVID 19 symptoms without the vaccine is supposedly 0.88% and with the vaccine 0.044%. In absolute terms, the effectiveness of the vaccine is (0.88-0.044)%.\n\nBy using the relative instead of absolute risk reduction, the mainstream media (MSM) were free to market the mRNA vaccine for Pfizer and BioNTech (and other interested parties) with impressive sounding claims. These weren’t remotely truthful, not only because they relied upon statistical manipulation but because no one had a clue about BNT’s safety or efficacy. To this day, there are no clinical trial results.\n\nAn analysis of available positive RT-PCR tests and mortality results led the Oxford Centre for Evidence Based Medicine estimated a very tentative COVID 19 Case Fatality Rate (CFR) of around 1.4%. Based upon the figures reported to the FDA by Pfizer and BioNTech, this indicates a broad population based mortality risk from COVID 19 of 1.4(0.88/100) which is 0.012%.\n\nPlease bear this incredibly remote risk in mind as we discuss the early indication of the apparent threat to public health presented by the mRNA vaccine.\n\nIt is reasonable to work in terms of population risk because, while the chance of COVID 19 mortality seemingly increases with age, with the average age of death being 82 and a mortality distribution indistinguishable from standard mortality, the intention is to give the vaccine to everybody.\n\nIf we look at the “V-Safe Active Surveillance for COVID 19 Vaccines” reported by the U.S. Center For Disease Control (CDC), early indications of the recorded “Health Impact Events” (HIE) reveal a worrying level of adverse reactions from the mRNA vaccine. The CDC define an HIE as:\n\nOn December the 18th 112,807 people were injected with the Pfizer/BioNTech vaccine in the U.S. Of these, 3,150 were subsequently unable to perform normal daily activities, unable to work, required care from doctor or health care professional. This is an HIE rate of 2.8%.\n\nThis suggests that among the first 10 million people to receive the vaccine in the UK, around 280,000 may find themselves unable to perform normal daily activities, unable to work and require medical care as a result. As it is the most vulnerable who are the first to receive this vaccine, given the tiny risk of mortality from the COVID 19 disease, it is by no means clear that this is a risk worth taking.\n\nNot that any of the other vaccines seem any better. So far the CDC have noted more than 5,000 HIE’s for all vaccine being trialled on the population. Clearly, the potential exists that the vaccines will contribute to more deaths than the disease they allegedly protects vulnerable people against.\n\nThe Pfizer/BioNTech trial was registered as clinical trial number NCT04368728 with the CDC. Having recently discussed what I am about to share with you with people who simply refused to believe the evidence of their own eyes, I think it is important to stress that this is the Phase 3 Clinical Trial which Pfizer claimed they had concluded in their press release. There isn’t another one. This is it.\n\nAt the time of writing (21st December 2020) as can be seen by date of the archived ClinicalTrials.gov web-page, the Study Results tab reads “No Results Posted.” That is because there are no posted or submitted results from the Pfizer BioNTech trial of the BNT162b2 vaccine:\n\nMainstream media reports, giving the impression that these vaccines have been found to be effective and safe are not evidence and they are not based on science. They are based on political policy and they report dangerous pseudo-scientific babble, masquerading as science journalism.\n\nThere will of course be mindless anti-rationalists who will call this dangerous antivaxxer nonsense. All the time insisting that it is perfectly safe to give a vaccine with a questionable safety profile, for which there are no completed clinical trials, to the most vulnerable people in our society.\n\nI am running out of patience with these people.\n\nThe start date for NCT04368728 was April 29th and the estimated trial completion date is January 27th 2023. The estimated end date of the primary or phase one of a three phase trial is June 13th 2021.\n\nAccording to the “Current Primary Outcome Measures,” the minimum time frame for Pfizer to assess serious adverse events (SAE’s) is “6 months after last dose.” This is the minimum term for assessing SAE’s in phase one of the trial.\n\nPhase one is the only part of the NCT04368728 trial to have been completed and published. It was published on the 14th October, 5 months and two weeks after the start date. Most of that period was taken up with recruitment an allocation. The minimum term for assessing SAE’s has not been met during Phase One.\n\nDuring Phase One, 195 participants were split into 13 groups of 15 people. In each group 12 received one of two potential mRNA vaccine candidates (either BNT162b1 or BNT162b2) and 3 a placebo.\n\n39 people aged between 18-55 and another 39 people aged between 65-85 received the BNT vaccine, now approved for global distribution. The threat of COVID 19, though tiny overall, is statistically zero for those aged 18-55. Those with any measurable risk from COVID 19 were in the older age group.\n\nOf the 39 older people who received 2 doses of BNT about half of them experienced “fatigue,”roughly 15% had “chills” and 3 of them had a fever. The common side effects of BNT included nausea, headache (a very common BNT induced nervous system disorder) arthralgia and myalgia (very common), fatigue, chills and fever (again very common.) Other than fatigue, no one in the placebo group suffered these problems.\n\nTherefore, it is reasonable to conclude that while Pfizer see the side effects of their vaccine as fatigue, chills and fever, the CDC refer to them as people who can’t work and need medical care.\n\nThe UK Medical and Healthcare products Regulatory Agency (MHRA) approved the BNT vaccine, to be given to vulnerable British people, based upon a study of 39 older people. This study reported a pretty high adverse reaction rate. It was produced exclusively from the R&D of the vaccine manufacturer. The MHRA questioned nothing.\n\nThey “approved” BNT in the certain knowledge that there were no completed clinical trials for this vaccine. In their Public Assessment Report they state:\n\nThis conclusion and approval not only lacks supporting evidence it is utterly at odds with what little is known about BNT. While Pfizer and BioNTech only completed trials of the vaccine on 39 relevant test subjects, the results, even from this practically inconsequential effort, suggest the risk from the vaccine is greater than the risk presented by COVID 19. By a considerable margin.\n\nThis undoubtedly explains why the MHRA ordered software from European suppliers to deal with the slew of vaccine adverse reaction they presumably anticipate. They stated:\n\nFrom the way the manufacturers, politicians, regulators and the MSM have approached vaccine safety, it is clear that they collectively have a total disregard for the welfare of vulnerable people. We really must put aside this infantile notion that “the authorities” care about us or our loved ones. We mean nothing to them.\n\nCOVID 19 is only an appreciable risk for the most vulnerable in society. It is a risk to the infirm elderly and people with existing life threatening conditions.\n\nIf we look at the exclusion criteria for Phase One, these people were not in the cohort tested. Anyone with high blood pressure, asthma, diabetes or a high BMI were excluded from the alleged safety trial. But the vaccine is being given to the most vulnerable first.\n\nOf the 39 older people at most risk in the phase one study, none of them had the serious comorbidities which the overwhelming majority of those who die “with” COVID 19 possess. The people actually at risk from COVID 19 nominally entered the BNT trials at phase 2 and 3. However, it appears every effort has been made to limit, if not completely remove, their number too. “Immunocompromised or individuals with known or suspected immunodeficiency,” were excluded.\n\nImmunodeficiency is caused by a wide range of health conditions. Conditions such as undernutrition, polytrauma, stress after surgery, diabetes and cancer lead to immunodeficiency. The people with the comorbidities associated with so called COVID 19 deaths were practically ruled out from the BNT vaccine trials.\n\nNCT04368728 was designed as a 1,2,3 trial with all phases running concurrently. With regards to assessing safety Pfizer described systemic events as:\n\nThe first 360 subjects randomised into the phase 2 and 3 trials underwent monitoring for systemic events for less than a week, following each dose:\n\nThe same cohort of 360 test subjects were also monitored for Serious Adverse Events (SAE’s) for up to 6 months in phase 2 and 3:\n\nPfizer also intend to report the percentage of all test subjects who suffer SAE’s:\n\nBut there are no reported results from either phase 2 or 3. No one has the faintest idea what the health risks of BNT are, especially for those it is supposedly designed to protect, and no one in authority gives a damn. Phase 2/3 clinical trials are now a moot point anyway.\n\nThe regulatory agencies have already approved the vaccine and health services have started injecting people with BNT. They do so after the manufacturers failed to properly test its safety on a 39 people who were in the at risk group but did not have the comorbidity that leads to claimed COVID 19 deaths.\n\nThe degree to which people have been misled into believing that these vaccines are known to be either safe or effective is almost beyond imagination.\n\nSadly, we don’t need imagination. The evidence is clear.\n\nYou can read more of Iain’s work at his blog In This Together\n\n03 January 2021, 20:00 \n\n This article was amended at the author’s request, to correct a small decimal point error. See the author’s comment below.", "opengraph": {"type": "article", "title": "What Vaccine Trials?", "url": "https://off-guardian.org/2021/01/03/what-vaccine-trials/", "description": "Iain Davis COVID 19 vaccine trials appear to have caused some confusion. Hopefully, this article might help clear things up a bit. People genuinely appear to believe that the COVID 19 vaccines have…", "article:published_time": "2021-01-03T04:00:29+00:00", "article:modified_time": "2021-01-03T23:05:55+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/schott-covid19-3840x2160-26062020.jpg", "image:width": "1920", "image:height": "1080", "locale": "en_US"}, "tags": ["sars-cov-2", "FDA", "Iain Davis", "MHRA", "Pfizer", "covid19", "ClinicalTrials.gov", "Medicines and Healthcare products Regulatory Agenc", "CDC", "Clinical Trial", "vaccine", "covid 19", "immunocompromised", "coronavirus", "Immunodeficiency", "CV-19", "Oxford", "Food and Drug Administration", "WHO", "BioNTech", "AstraZeneca", "genome", "vaccine trials", "mRNA"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/wp-content/medialibrary/schott-covid19-3840x2160-26062020.jpg", "https://archive.is/zchT2", "https://in-this-together.com/covid-19-evidence-of-global-fraud/", "https://hive.blog/worldnews/@francesleader/email-exchange-with-uk-mhra-exposing-the-genomic-sequence-of-sarscov2", "https://archive.is/Ve9Kv", "https://web.archive.org/web/20201229132439/https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)32661-1/fulltext", "https://archive.is/qMBIy", "https://web.archive.org/web/20201128213442/https://clinicaltrials.gov/ct2/show/results/NCT04516746", "https://web.archive.org/web/20201229112508/https://clinicaltrials.gov/ct2/show/study/NCT04540393", "https://archive.vn/xKG0C", "https://off-guardian.org/wp-content/medialibrary/Screen-Shot-2021-01-02-at-23.25.10__5.jpg", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-conclude-phase-3-study-covid-19-vaccine", "https://www.fda.gov/federal-food-drug-and-cosmetic-act-fdc-act", "https://web.archive.org/web/20201212022810/https://www.fda.gov/media/144413/download", "https://web.archive.org/web/20201216060923/https://www.fda.gov/media/144245/download", "https://www.bitchute.com/video/H9Y2EYK2JM2Z/", "https://web.archive.org/web/20201202084910if_/https://uk.reuters.com/article/uk-health-coronavirus-britain-johnson/johnson-hails-fantastic-news-of-vaccine-authorisation-idUKKBN28C0ZZ", "https://www.bmj.com/content/371/bmj.m4347/rr-4", "https://archive.is/fbvhK", "https://archive.is/L4WfV", "https://www.cebm.net/covid-19/the-declining-case-fatality-ratio-in-england/", "https://archive.is/xKffh", "https://bit.ly/3h580gt", "https://off-guardian.org/wp-content/medialibrary/Screen-Shot-2021-01-03-at-00.15.09__2.jpg", "https://sharylattkisson.com/2020/12/cdc-more-than-5000-covid-19-vaccine-recipients-have-reportedly-suffered-health-impact-event/", "https://bit.ly/2WAhXJq", "https://web.archive.org/web/20201223211449/https://www.pfizer.com/science/find-a-trial/search/NCT04368728", "https://bit.ly/2M08gSx", "https://archive.is/1Ta18", "https://in-this-together.com/anti-rationalist/", "https://web.archive.org/web/20201029012809/https://www.nejm.org/doi/full/10.1056/NEJMoa2027906", "https://www.ukcolumn.org/article/covid-19-data-exposing-deception", "https://web.archive.org/web/20201207114708/https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/941452/Information_for_healthcare_professionals.pdf", "https://off-guardian.org/wp-content/medialibrary/Screen-Shot-2021-01-03-at-01.02.56__2.jpg", "https://archive.is/2JXqO", "https://www.nhs.uk/conditions/coronavirus-covid-19/people-at-higher-risk/whos-at-higher-risk-from-coronavirus/", "https://archive.is/9cQQh", "https://www.sciencedaily.com/releases/2009/09/090914111540.htm", "https://in-this-together.com/anti-rationalist/", "https://off-guardian.org/2021/01/03/what-vaccine-trials/#comment-297914", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2021-01-03T04:00:29+00:00"}