{"result_id": "232012", "URL": "https://off-guardian.org/2022/07/08/we-cant-trust-the-renewed-polio-vaccination-push-heres-why/", "timestamp": "2023-04-25 16:43:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/07/08/we-cant-trust-the-renewed-polio-vaccination-push-heres-why/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "We can’t trust the renewed “polio vaccination” push. Here’s why.", "cleaned_text": "Last week we wrote about the new “polio outbreak” reported in the UK and around the world, and how it was likely yet another constructed narrative designed to sell yet more vaccines.\n\nAfter all, it was reported that the market for polio vaccines had “stagnated” through 2021, and the first-ever vaccine granted approval under emergency use license by the World Health Organization was a new “triple-locked” polio vaccine.\n\nIn early June, the WHO granted Chinese pharmaceutical giant SINOVAC international approval for their new polio vaccine too.\n\nSo, they had brand new products, but no one to buy them.\n\nThe motive was there to create a population of ‘incentivised’ customers. That’s a simple mechanic of marketing we’re all very familiar with.\n\nSince March, Israel has been running the “Operation Two Drops”, a polio vaccination drive (using that new “emergency use” polio vaccine), which apparently resulted in a huge increase in vaccine uptake in children of all ages.\n\nThis program was reported to be “over” just yesterday, with the Jerusalem Post headlining that “Israel’s polio outbreak finally under control”.\n\nJust as with the Covid “vaccines”, Israel has acted as the world’s guinea pig.\n\nFollowing the proclaimed “polio outbreak” in London (yes, they’re actually calling it an outbreak despite literally zero reported cases) the UK government declared an “emergency” and laid plans to “increase vaccine coverage”.\n\nThe EU meanwhile has pledged to provide 40 million euros worth of polio vaccines to Afghanistan,\n\nAnd just today Malawi, Tanzania, Zambia and Mozambique announced they have already administered over 36 million doses of polio vaccines as part of a new joint initiative, despite the region reporting just two cases in the whole of 2022.\n\nSo, clearly, a big part of this is selling vaccines.\n\nBut at the same time, some questions remain. In a world with an ongoing (fake) covid “pandemic” and an incipient (fake) monkeypox scare, why bring back polio of all things? What agenda can polio propaganda serve?\n\nWell, the answer might be that it plugs important gaps in the Covid narrative.\n\nTake this article, from the Guardian…\n\nIt argues that just because we think a disease is gone, doesn’t mean it definitely has. Even if there’s no cases for literal decades, we must always be prepared for it to come back…\n\nDo you see how this works?\n\nThe article is seeding the idea that just because there haven’t been any actual cases in 20 years doesn’t mean we should halt vaccination programs.\n\nThat’s an argument that can (and will) be used to give Covid jabs to kids in perpetuity.\n\nThis article from the Times is even cleverer, headlining:\n\nIt claims that, in some ways, lockdown was “worse than Covid” for children, because it disrupted too much – including the polio vaccination program.\n\nThis little narrative twist is designed for a very specific purpose – to corral covid sceptics into a pro-vaccine position.\n\n“Look”, they say, “maybe lockdown was a bit of an over-reaction and we got a bit obsessed with Covid. Sorry, our bad.\n\nIt’s perfectly understandable you don’t want to give your kids the experimental Covid vaccine – Covid doesn’t even affect kids much after all, does it?\n\nBut unfortunately – due to our own incompetence (silly us) – we’re now behind in our polio vaccinations. It’s OK to give your kids the polio vaccine…isn’t it?”\n\nThey cede that lockdown may have been “worse than the disease”, and criticise “our obsession with Covid” to get the sceptics on side, then they point to the supposedly neglected polio vaccination program as an aspect of criticising the government’s approach to Covid.\n\nJust like that, wanting to vaccinate against polio becomes a covid sceptic position. And the same people who would never let their kids get the Covid shot are signing up to get them double-jabbed with another emergency use vaccine…only for polio.\n\nAre these new polio vaccines safe and effective? Are they really necessary?\n\nAre they even really polio vaccines, not just covid shots with a different label? Or something else entirely?\n\nWe don’t know, and a lot of people won’t think to ask, such is the cultivated trust in the polio vax.\n\nIt’s all about getting people “vaccinated”, and creating the cultural norm of regular state-mandated injections for “protection” against the disease du jour.\n\nThe “polio outbreak” is just a dragnet picking up all those who may have slipped through the Covid cracks.\n\nEither you take the clotshot for Covid, or you take smallpox vaccine for monkeypox or you take the polio vaccine…just to be safe.\n\nIn the end they just want everyone to get at least one vaccine, and it seems they don’t much care which.\n\nIt makes one wonder if there’s some “secret ingredient” all three could have in common.", "opengraph": {"type": "article", "title": "We can’t trust the renewed “polio vaccination” push. Here’s why.", "url": "https://off-guardian.org/2022/07/08/we-cant-trust-the-renewed-polio-vaccination-push-heres-why/", "description": "Kit Knightly Last week we wrote about the new “polio outbreak” reported in the UK and around the world, and how it was likely yet another constructed narrative designed to sell yet more…", "article:published_time": "2022-07-08T21:00:39+00:00", "article:modified_time": "2022-07-08T18:36:04+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/adobe-stock-world-needles-injection-vaccine-scaled.jpeg", "image:width": "2560", "image:height": "1440", "locale": "en_US"}, "tags": ["Tanzani", "EU", "The Times", "monnkeypox", "The Guardian", "Israel", "Zambia", "Afghanistan", "Mozambique", "vaccines", "covid19", "Malawi", "polio", "Tanzania", "UK"], "tweets": [], "movies": [], "links": ["https://off-guardian.org/2022/06/24/polio-outbreak-the-who-bill-gates-emergency-vaccines-more-of-the-same/", "https://www.businesswire.com/news/home/20220609005387/en/SINOVAC-Polio-Vaccine-Prequalified-by-WHO", "https://www.vaxbeforetravel.com/israels-children-polio-vaccination-campaign-scores-win", "http://Israel's polio outbreak finally under control", "https://www.npr.org/2021/01/31/960819083/vaccines-for-data-israels-pfizer-deal-drives-quick-rollout-and-privacy-worries", "https://web.archive.org/web/20220703211846/https://www.telegraph.co.uk/news/2022/06/22/polio-back-national-incident-declared-uk-disease-spreads-first/", "https://www.gov.uk/government/publications/polio-detection-of-vdpv2-in-london-sewage-samples/immediate-actions-in-response-to-detection-of-vaccine-derived-polio-virus-type-2-vdpv2-in-london-sewage-samples", "https://www.helsinkitimes.fi/world-int/21830-eu-provides-additional-euro-40-million-for-polio-vaccines-child-protection-in-afghanistan.html", "https://african.business/2022/07/apo-newsfeed/southern-africa-in-fresh-vaccination-drive-to-halt-wild-polio/", "http://The discovery of the polio virus in Britain proves we can never let our guard down", "https://web.archive.org/web/20220703190212/https://www.telegraph.co.uk/politics/2022/07/03/uk-polio-outbreak-price-obsession-covid/", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-07-08T21:00:39+00:00"}