{"result_id": "232006", "URL": "https://off-guardian.org/2022/12/08/dangerous-precedent-nz-court-orders-baby-removed-from-anti-vax-parents/", "timestamp": "2023-04-25 16:43:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/12/08/dangerous-precedent-nz-court-orders-baby-removed-from-anti-vax-parents/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Dangerous Precedent: NZ court orders baby removed from “anti-vax” parents", "cleaned_text": "A court in New Zealand has awarded temporary custody of a baby to medical professionals, after the parents insisted their child be given only unvaccinated blood transfusions during surgery.\n\nA critically-ill six-month-old baby will be placed under the temporary guardianship of New Zealand’s High Court after his parents refused to allow him to undergo lifesaving heart surgery using blood from people vaccinated against Covid-19 […] The baby’s parents believed there were “spike proteins in the blood of people who have been vaccinated and that these proteins were causing unexpected deaths relating to transfusions,” according to the judgment.\n\nThe key detail here is that the parents have not, in any way, refused their child medical care – the usual prerequisite for this kind of court order. They want their son to have the surgery, they are simply setting reasonable terms.\n\nNow, whether or not the parents are correct and spike proteins do pose a threat, they have every right to try and do the best for their child as they see fit.\n\nTo any pro “vaccine” people out there who are not OK with this, answer this simple question: What if parents of a vaccinated child had specifically requested vaccinated blood transfusions, and the court had removed the baby and injected it with unvaccinated blood…would that be OK?\n\nI’m guessing not. And the principle is clearly the same.\n\nThis isn’t about the health of the baby, obviously. After all, literally ALL of the blood in its body is already unvaccinated. If that were the issue, the court could have ordered he be vaccinated.\n\nIn fact, the minimum age for Covid “vaccination” in New Zealand is 5 years old. So in administering vaccinated blood to a baby, the hospital would potentially be going against both the WHO guidance on Covid “vaccines”, and their own government regulations.\n\nGiven that, you’d think ensuring a baby be given unvaccinated blood would not only be possible, but preferable.\n\nInstead, it has become a headline grabbing issue. Why?\n\nBecause this case is about setting an important precedent, undermining the sovereignty of parenthood, and putting children in the stewardship of the state first and their family a distant second.\n\nFurther, it erodes the ability of people to avoid contact with the Covid “vaccine” legally.\n\nBut more than that, it also increasingly divides society, pulling on frayed threads of distrust between vaccinated and unvaccinated people.\n\nThe erosion of individual rights in the face of the ever-hungry state is rightly the primary concern here.\n\nHowever, there’s a secondary potential fall-out of this. It’s possible we may see a situation where the establishment “concedes” the point, and allows people to avoid contact with the vaccine.\n\nWhile it could be framed as a victory for covid sceptics, the practical result would be tiptoeing towards a segregated society. Unlikely, for sure, but certainly something to keep an eye on.\n\nOh, and there’s this of course (again, from CNN):\n\nIt’s probably going to devolve into an excuse to “crack down” on free speech, just like everything else does.", "opengraph": {"type": "article", "title": "Dangerous Precedent: NZ court orders baby removed from “anti-vax” parents", "url": "https://off-guardian.org/2022/12/08/dangerous-precedent-nz-court-orders-baby-removed-from-anti-vax-parents/", "description": "Kit Knightly A court in New Zealand has awarded temporary custody of a baby to medical professionals, after the parents insisted their child be given only unvaccinated blood transfusions during sur…", "article:published_time": "2022-12-08T16:30:46+00:00", "article:modified_time": "2022-12-08T16:24:04+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/new-zealand-court-protest-baby-unvaccinated.jpg", "image:width": "1425", "image:height": "950", "locale": "en_US"}, "tags": ["the new normal", "spike proteins", "civil rights", "CNN", "New Zealand", "vaccines", "coronavirus", "covid19"], "tweets": [], "movies": [], "links": ["https://edition.cnn.com/2022/12/07/asia/new-zealand-covid-vaccine-donor-blood-baby-scn-intl-hnk/index.html", "https://www.health.govt.nz/covid-19-novel-coronavirus/covid-19-vaccines", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-12-08T16:30:46+00:00"}