{"result_id": "232034", "URL": "https://off-guardian.org/2022/10/15/voodoo-vaccine/", "timestamp": "2023-04-25 16:43:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/10/15/voodoo-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Voodoo Vaccine", "cleaned_text": "“Voodoo Vaccine” seemed like a catchy title, but a more apt title for this article would be something like, “How the Covid Vaccine is More Like Superstition Than Science.”\n\nVoodoo has a superstition basis, so this title works as well. So, what is voodoo, or superstition, and how is the Covid vaccine, its reverence, its effect, the fear that it is supposed to assuage and the relationship between the people pushing it, and the people taking it superstitious?\n\nThe word around town is that the fancy named third booster, the Bivalent booster for BA.4 and BA.5, is not being received all that well. There is also a “third shot” that is different than the “third booster”—don’t ask me how, but apparently is best taken by those who are immunocompromised.\n\nFor a virus that is rumored not even to exist, and/or been accurately isolated, they sure do know details about the pesky little thing.\n\nI am no scientist (woo hoo) so obviously I cannot comment on the genius minds that put all this stuff together, but gosh dang it is like stuff you’d see a wizard do, it is so complicated and magical.\n\nThat comment is probably closer to the truth than not. Now, I am sure the minds that put all this together are indeed brilliant. And I am sure there is a boatload of science in all of this.\n\nBut hell, the damn things don’t even work, and they sure as hell are dangerous (if you talk to the right people) so why are so many people taking them, one after the other?\n\nYes, it is true the mad fervor for the latest jab is waning. But a lot of people are still yakking on Facebook about getting them, “I have an appointment to get the latest super booster! I am so excited!” “Me too!! Yahoo!!”\n\nAnd of course there is a plethora of arm selfies with two, not one, little round Band-Aids covering the booster entry as well as the annual flu jab. Yahoo indeed! Double your money folks!\n\nIt reminds me of the good ol’ days when teenaged girls were blubbering on their pink princess phones about some current heartthrob they got an autographed picture from. Screams and giggles.\n\nWhat is this crap?\n\nThe people that seem totally mesmerized by all of this and are frantic to get in line for the latest jab are the true believers. But I think there are still many who would act the same if the propaganda machine starting spitting out the usual hockey-poo.\n\nI have a very close shrew friend who is a freedom fighter. He says Covid is dead, that even if the authorities scared the bejesus out of the general public again, few would take any new poke they laid on us.\n\nI’m not so sure.\n\nActually, how much do any of us know these days about stuff we put into our body to ward off the evil spirits of disease? With all the science out there, who in the common pool of educated human beings really know the scientific mechanism of pharmaceuticals, or even anything about the diseases they treat?\n\nNot me, said the flea. So for the most part we are relying on hocus-pocus at best.\n\nYeah, the guy/gal in the white coat said it works, so what the hell. I just know if I refused it because of some remote chance there was an unpleasant side effect that would get me, I would be worried all day and night about the boogey man it was supposed to ward off. Better just take the meds.\n\nDoesn’t a rabbit’s foot do the same thing, ward off boogey men? Oh, right, but that isn’t science. The medicine is science. Right…science.\n\nPeople have been taking antidepressants for years believing in the science and the white coat wizard writing the prescription. And look where that got us.\n\nHey, I have nothing against lucky charms. But if you are going to rely on that stuff pick a charm that doesn’t cause any harm. I don’t think a rabbit’s foot has side effects, antidepressants do.\n\nVoodoo is a specialized form of science, oops, I mean religion, that is practiced in a variety of locations around the world. Known primarily in Africa and parts of the Caribbean and South America (as well as the southern USA), it relies on a lot of strange (to a non-voodooer) rituals and practices.\n\nIt would be safe to say that the custom of voodoo relies heavily on superstition—defined usually as an “irrational” belief. I would refine that a bit and leave the “irrational” out of it and just say superstition is a belief that is usually found outside the realm of materiality.\n\nSo what does that mean?\n\nWell, I would venture to say that taking a vaccine that has shown to do very little of what it is trumped up to do and is in fact quite dangerous at the same time it is touted to be “safe and effective,” borders on superstition. And it certainly is treated by the people taking it as having magical powers. Very few vaccinated folks know how it does what it is supposed to do, even in a very elementary way.\n\nFewer still are adequately informed about its safety and efficacy (isn’t that called “informed consent”?). Yet it is gobbled up like cotton candy on a hot afternoon at the county fair.\n\nIf people just took it and shut up about it that would be one thing. But they don’t. They dance about it, sing about it, give high fives about it, take pictures of it, dream about it, maybe even have orgasms about it (I wouldn’t be surprised).\n\nIt is the thing to do, like having a Pet Rock in the ‘70s. This is voodoo.\n\nI used to travel a lot, before my un-vaxxed status ended that (oh, happy, happy, joy, joy, they are again allowing me on a plane!). Years ago I was obsessed about getting all jabbed up for my trips. I would find a special travel doctor and get a list of CDC recommended medications and vaccines specially aligned with whatever strange primitive country I was going to that still grew amongst its primitive population various weird outer-space-type diseases.\n\nThis was fun. I felt responsible, intelligent, and all properly voodoo-ized for my trip. “No weird outer space invader type critter is going to get into MY veins, no sir-ee.”\n\nDid I know anything about any of these diseases? Or how to naturally prevent them from wreaking havoc on my helpless unhealthy body? Nope. I had the crucifix around my neck and a silver bullet in my pocket. Ain’t no fleas on me, I was protected.\n\nPeace of mind. Yeah, that’s what they call it. Peace of mind. Rub that rabbit’s foot in your pocket and get the mark, the “shot card,” the “proof of Covid vaccination,” no problem at all. Side effects? Never heard of ‘em.\n\nTodd Hayen is a registered psychotherapist practicing in Toronto, Ontario, Canada. He holds a PhD in depth psychotherapy and an MA in Consciousness Studies. He specializes in Jungian, archetypal, psychology. Todd also writes for his own substack, which you can read here", "opengraph": {"type": "article", "title": "Voodoo Vaccine", "url": "https://off-guardian.org/2022/10/15/voodoo-vaccine/", "description": "Todd Hayen “Voodoo Vaccine” seemed like a catchy title, but a more apt title for this article would be something like, “How the Covid Vaccine is More Like Superstition Than Science.” Voodoo has a s…", "article:published_time": "2022-10-15T08:00:14+00:00", "article:modified_time": "2022-10-14T15:55:58+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/adobe-stock-voodoo-scaled.jpeg", "image:width": "2560", "image:height": "1709", "locale": "en_US"}, "tags": ["science", "religion", "vaccine", "voodoo", "coronavirus", "covid19", "Todd Hayen", "superstition"], "tweets": [], "movies": [], "links": ["http://shrewviews.substack.com/", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-10-15T08:00:14+00:00"}