{"result_id": "232030", "URL": "https://off-guardian.org/2022/12/30/covid-vaccines-why-is-the-mhra-lying-about-adverse-effects/", "timestamp": "2023-04-25 16:43:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://off-guardian.org/wp-content/medialibrary/2018/11/cropped-LogoOffGraun3-200x200.jpg", "canonical": "https://off-guardian.org/2022/12/30/covid-vaccines-why-is-the-mhra-lying-about-adverse-effects/", "encoding": "UTF-8"}, "image": null, "domain": "off-guardian.org", "title": "Covid “Vaccines”: Why is the MHRA Lying About Adverse Effects?", "cleaned_text": "In its weekly summary of the Yellow Card reports it receives of the adverse drug reactions (ADRs) suffered by the British public following injection with the COVID-19 ‘vaccines’ it has authorised, the Medicines and Healthcare products Regulatory Agency (MHRA) continues to insist that the ‘overwhelming majority’ are:\n\nIn doing so, the MHRA — and, by extension, the UK Prime Minister, the Department for Health and Social Care, the UK Health Security Agency, the Joint Committee on Vaccination and Immunisation, the Scientific Advisory Group for Emergencies, the National Health Service and the pharmaceutical companies that have been testing this experimental biotechnology on the British public for the past two years — can all dismiss the growing fears and anger about the UK ‘vaccination’ programme as the fearmongering of ‘conspiracy theorists’.\n\nIndeed, it was precisely this term that outraged Members of Parliament used to describe MP Andrew Bridgen recently after he called on Rishi Sunak to halt the UK ‘vaccination’ programme.\n\n \n\n But is this claim by the MHRA borne out by the more than 474,000 Yellow Card reports it has received since the programme was initiated in December 2020? As you’d expect of an organisation funded by the pharmaceutical companies and vaccine investors whose products it is paid to guarantee the safety of, the answer is an unsurprising ‘no’.\n\nAfter failing — or refusing — to differentiate between serious and non-serious adverse reactions to the fake ‘vaccines’ during the politically-declared coronavirus ‘pandemic’, at the end of December 2022 the MHRA finally published the figures that distinguish between them for each of the different brands of ‘vaccines’.\n\nAnd as we should by now expect of a privately-funded government body that has repeatedly and consistently lied to the UK public since March 2020, the data contradicts their own assertions. In this article, I’m going to show how. It should be clear by now why they have lied.\n\nOf the 177,925 Yellow Card reports of 511,775 adverse drug reactions received after being injected with the Pfizer/BioNTech mRNA ‘vaccine’ by 23 November 2022, 71 per cent (125,711 reports) were categorised by the MHRA as ‘serious’.\n\nAnd rather than the ‘sore arms, headaches and tiredness’ described by the MHRA, these adverse reactions include 2,640 disorders of the immune system, 7,950 vascular disorders; 14,380 cardiac disorders; 17,670 blood disorders; 23,070 respiratory disorders; 31,790 reproductive system and breast disorders; 58,340 musculoskeletal and connective tissue disorders; and 84,730 disorders of the nervous system.\n\nAnd far from being the ‘normal, expected, and coincidental’ illnesses of an ageing demographic who just happened to be injected before suffering these symptoms, the serious adverse reactions were mostly in the young and healthy, with 65 per cent under the age of 50.\n\nOf the 246,866 Yellow Card reports of 874,912 adverse drug reactions after being injected with the AstraZeneca/Oxford viral-vector ‘vaccine’ by 23 November 2022, 77 per cent (190,997 reports) were categorised by the MHRA as ‘serious’.\n\nAgain, instead of the ‘chills, fatigue and weakness’ described by the MHRA, these adverse reactions include 3,481 disorders of the immune system; 14,078 vascular disorders; 11,599 cardiac disorders; 7,922 blood disorders; 23,070 respiratory disorders; 20,983 reproductive system and breast disorders; 105,331 musculoskeletal and connective tissue disorders; and 183,978 disorders of the nervous system.\n\nAnd, once again, rather than being reports by the ageing and infirm who coincidentally were injected with the AstraZeneca viral vector ‘vaccine’, 48 per cent of the reports of serious adverse reactions came from people under the age of 50.\n\nFinally, of the 47,045 Yellow Card reports of 151,628 adverse drug reactions received after being injected with the Moderna/NIH mRNA ‘vaccine’ by 23 November 2022, 72 per cent (33,896 reports) were categorised by the MHRA as ‘serious’.\n\nContrary what the MHRSA says, ‘most’ of these adverse reactions were not ‘nausea, aching muscles and rapid heartbeat’, but included 738 disorders of the immune system; 1,641 vascular disorders; 2,862 blood disorders; 5,438 reproductive system and breast disorders; 14,152 cardiac disorders; 17,071 musculoskeletal and tissue disorders; 23,070 respiratory disorders; and 24,861 disorders of the nervous system.\n\nAnd, once again, 65 per cent of the serious adverse reactions to the Moderna injections were reported by people under the age of 50, exactly the same percentage as for the Pfizer injection.\n\nThis isn’t surprising, since both injections use the experimental messenger RNA platform to inject the COVID-19 spike protein, which doesn’t stay in the injected muscle, but spreads throughout the body, causing the human immune system to attack its own cells.\n\nIncluding the 446 reports of serious adverse drug reactions to the Novavax injections and an unspecified brand of COVID-19 ‘vaccine’, this adds up to 351,050 reports of adverse reactions to the MHRA approved injections it has categorised as ‘serious’.\n\nHowever, since the MHRA, by its own admission, estimates that only 10 per cent of serious ADRS are reported to their office, a more accurate estimate is that the COVID-19 injections have caused over 3.5 million serious adverse reactions in the UK, leading not to sore arms and headaches but to permanent injury, ruined health, amputation of limbs and death.\n\nIndeed, according to the World Council for Health, the list of damages caused by the spike protein in the mRNA injections includes tissue and organ damage, damage to the lining of blood vessels, blood clotting and thrombosis, innate immune suppression, autoimmune disease, suppression of the body’s interferon response to infection and disease, viral reactivation, inhibition of DNA repair, neurologic damage, mitochondrial damage, cardiac damage, narrowing of immune response for future coronaviruses, cells making spike proteins becoming the targets of antibodies, low sperm count, hormonal imbalance, and numerous contributors to cancer.\n\nAlmost none of these are mentioned in the MHRA’s own comments on the safety of the COVID-19 ‘vaccines’.\n\nBut the MHRA reports that incidents of Bell’s Palsy, which causes weakness or paralysis of the muscles on one side of the face, after being injected with a COVID-19 vaccine is ‘rare’. In medical terms, as established by the National Institute for Health and Care Excellence, this means there’s between 1 in 1,000 and 1 in 10,000 chance of this adverse reaction occurring.\n\nIt also reports that, as of October 2022, the MHRA had received 179 reports of transverse myelitis, an acute neurological disorder where parts of the spinal cord are inflamed: 129 after the AstraZeneca injection, 42 after Pfizer, and 8 after Moderna. The MHRA calls this ‘extremely rare’, or a less than 1 in 100,000 chance.\n\nAs of 23 November 2022, the MHRA had received 445 reports of thrombo-embolic events (blood clotting) with concurrent low platelets, of which 81 resulted in death, after injection with the AstraZeneca ‘vaccine’. And as for all the serious adverse events, these are not confined to the elderly and infirm, with 44 per cent of these events occurring in people under the age of 50.\n\nBy the same date, the MHRA had received 40,327 reports of 51,695 menstrual disorders and/or unexpected vaginal bleeding after injection with a COVID-19 ‘vaccine’. Despite this, the MHRA insists there is ‘no link’ to the injections.\n\nThe MHRA had also received, by the same date, 2,226 reports of myocarditis (inflammation of the heart) or pericarditis (swelling of the tissue around the heart) after injection with COVID-19 ‘vaccines’: 1,361 after the Pfizer injections, 363 after the Moderna injections, and 472 after the AstraZeneca injections.\n\nIndicative of a causal connection to the injections, the proportionally fewer incidents of both from the AstraZeneca ‘vaccine’ are overwhelmingly (83 per cent) among those over 40 years of age, while the injections using the mRNA platform in the Pfizer and Moderna ‘vaccines’ causes myocarditis and pericarditis mostly in the young, with 58 per cent of heart inflammations occurring in those aged between under 39. Again, the MHRA dismisses these as ‘very rare’, or less than 1 in 10,000.\n\nAgain, as of 23 November, 2022, the MHRA has received 697 reports of Guillain-Barré Syndrome and the related Miller Fisher Syndrome, both of which cause inflammation of the nerves and can lead to numbness, weakness and pain, usually in the feet, hands and limbs, as well as spreading to the chest and face.\n\nFinally, the most serious adverse reaction to the COVID-19 ‘vaccines’ is death, of which the MHRA has received 2,362 reports: 857 after the Pfizer/BioNTech injection; 1,334 after the AstraZeneca/Oxford injection; 111 after the Moderna/NIH injection; and 60 after an unspecified brand.\n\nGiven the loneliness in which people have been isolated by anti-social distancing and the fear created around anyone displaying any symptoms of illness, how many deaths after injection with these experimental ‘vaccines’ have not been reported to the MHRA?\n\nShould we estimate that, as a serious adverse event, only 10 per cent of these have also been reported, and the real death toll from the UK ‘vaccination’ programme is therefore closer to 23,620? Certainly, this would better explain the increase in excess deaths not attributed to COVID-19 of those under 40 years of age in 2021 and 2022.\n\nOne of the less pleasant character-traits of the COVID-faithful is their arrogant, contemptuous and cruel dismissal of the more than 1.54 million reported adverse reactions to these experimental and demonstrably dangerous ‘vaccines’.\n\nBut whatever the true toll in injuries and deaths, when the Medicines and Healthcare products Regulatory Agency responsible for guaranteeing their safety states that the ‘overwhelming majority’ of the 474,000 Yellow Card reports it has received of adverse reactions to the COVID-19 ‘vaccines’ are ‘sore arms, headaches, chills, tiredness, feeling sick, dizziness, weakness and aching muscles’, it is lying to the UK public — not only about the risks and dangers of being injected with this experimental biotechnology, but also about the seriousness of the consequences of doing so.\n\nIf you’re concerned about the corruption of UK Government and National Health Service by the international pharmaceutical companies and global investors funding them, and the consequences this is having for the health, freedom and lives of the British public, you may be interested in my new book, The Road to Fascism: For a Critique of the Global Biosecurity State, which is available in hardback, paperback and e-book. Please click on the link for purchase options.\n\nSimon Elmer is the founder of Architects for Social Housing (ASH), you can follow them on twitter.", "opengraph": {"type": "article", "title": "Covid “Vaccines”: Why is the MHRA Lying About Adverse Effects?", "url": "https://off-guardian.org/2022/12/30/covid-vaccines-why-is-the-mhra-lying-about-adverse-effects/", "description": "Simon Elmer In its weekly summary of the Yellow Card reports it receives of the adverse drug reactions (ADRs) suffered by the British public following injection with the COVID-19 ‘vaccines’ it has …", "article:published_time": "2022-12-30T13:00:06+00:00", "article:modified_time": "2022-12-30T20:25:24+00:00", "site_name": "OffGuardian", "image": "https://off-guardian.org/wp-content/medialibrary/adobe-stock-syringe-vaccine-injection-scaled.jpeg", "image:width": "2560", "image:height": "1705", "locale": "en_US"}, "tags": ["BioNTech", "Moderna", "AstraZeneca", "Simon Elmer", "MHRA", "vaccines", "Pfizer", "covid19"], "tweets": [], "movies": [], "links": ["https://www.independent.co.uk/news/uk/conservative-andrew-bridgen-rishi-sunak-medicines-and-healthcare-products-regulatory-agency-pmqs-b2240922.html", "https://yellowcard.mhra.gov.uk/idaps/TOZINAMERAN", "https://yellowcard.mhra.gov.uk/idaps/TOZINAMERAN", "https://off-guardian.org/wp-content/medialibrary/elmer-mhra-003.png", "https://yellowcard.mhra.gov.uk/idaps/TOZINAMERAN", "https://off-guardian.org/wp-content/medialibrary/elmer-mhra-004.png", "https://yellowcard.mhra.gov.uk/idaps/CHADOX1%20NCOV-19", "https://yellowcard.mhra.gov.uk/idaps/CHADOX1%20NCOV-19", "https://off-guardian.org/wp-content/medialibrary/elmer-mhra-006.png", "https://yellowcard.mhra.gov.uk/idaps/CHADOX1%20NCOV-19", "https://off-guardian.org/wp-content/medialibrary/elmer-mhra-007.png", "https://yellowcard.mhra.gov.uk/idaps/ELASOMERAN", "https://yellowcard.mhra.gov.uk/idaps/ELASOMERAN", "https://off-guardian.org/wp-content/medialibrary/elmer-mhra-009.png", "https://yellowcard.mhra.gov.uk/idaps/ELASOMERAN", "https://off-guardian.org/wp-content/medialibrary/elmer-mhra-010.png", "https://www.gov.uk/drug-safety-update/yellow-card-please-help-to-reverse-the-decline-in-reporting-of-suspected-adverse-drug-reactions", "https://worldcouncilforhealth.org/multimedia/aseem-malhotra-press-conference/", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting#annex-1-covid-19-vaccine-reports", "https://bnf.nice.org.uk/medicines-guidance/adverse-reactions-to-drugs/", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://architectsforsocialhousing.co.uk/2022/09/28/the-road-to-fascism-for-a-critique-of-the-global-biosecurity-state/", "https://architectsforsocialhousing.co.uk/", "https://twitter.com/SimonElmer2022", "https://ko-fi.com/offguardian", "https://www.subscribestar.com/offguardian", "https://off-guardian.org/support-us/#bitcoin", "https://liberapay.com/OffGuardian/donate", "https://off-guardian.org/support-us/#bank", "#", "#", "#", "#", "#"], "authors": [], "publish_date": "2022-12-30T13:00:06+00:00"}