{"result_id": "233038", "URL": "https://mediabiasfactcheck.com/2018/04/25/did-the-polio-vaccine-cause-cancer/", "timestamp": "2023-04-25 16:45:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/mediabiasfactcheck.com/wp-content/uploads/2020/12/cropped-transparent-MBFC-Square512.png?fit=32%2C32&ssl=1", "canonical": "https://mediabiasfactcheck.com/2018/04/25/did-the-polio-vaccine-cause-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "mediabiasfactcheck.com", "title": "Did the Polio Vaccine Cause Cancer?", "cleaned_text": "Q: Did people develop cancer because of the polio vaccine?\n\n\n\nA: There are no known cases, and it’s very unlikely. In the 1950s and 1960s, people did receive polio vaccines contaminated with a virus that causes cancer in rodents. But research suggests this virus doesn’t cause cancer in humans.\n\n\n\nWere people infected with cancer through the polio vaccine?\n\nMany of our readers have asked us whether people have developed cancer because they received the polio vaccine. Facebook users also have flagged stories on this topic as potentially false. The bottom line: It’s highly unlikely that the lots of polio vaccine contaminated in the ‘50s and ‘60s have caused anyone to develop cancer.\n\nPolio, or poliomyelitis, is a disease caused by the poliovirus. About 1 in 200 people who contract the virus develop the disease, which involves loss of movement in the limbs, explains the Centers for Disease Control and Prevention.\n\nNearly 3 out of 4 people who catch the virus have no symptoms. About 1 in 4 experience less severe symptoms, such as a sore throat, tiredness, nausea or fever. In rare cases, the virus can cause death.\n\nImmobility can also occur decades after a person seems to recover from the infection, says the CDC. Experts classify this as an illness different from polio, namely post-polio syndrome. Between 25 percent and 40 percent of “polio survivors” develop this syndrome.\n\nIn 1954 — the year before the polio vaccine became widely available — the U.S. saw more than 18,000 reported cases of paralytic polio and more than 1,000 deaths due to the virus, according to the CDC. By 1964, those numbers had dropped to 106 and 17, respectively.\n\nBecause of the vaccine, the U.S. has been virtually “polio-free” for 30 years, says the CDC, though “the disease still occurs in other parts of the world.”\n\nThe agency still recommends that children get four doses of the polio vaccine, each of which increases immunity to the virus. In 2016, 93.7 percent of children under 3 years old had received at least three doses of the vaccine. The CDC says children should get the fourth dose between the ages of 4 and 6.\n\nTo develop the vaccine, the epidemiologist and physician Jonas Salk, who died in 1995, grewthe poliovirus in a culture (think, petri dish) of monkey kidney cells. He then used a chemical called formalin to kill the virus, rendering it unable to cause polio.\n\nWhen this dead virus is introduced into people’s bodies, it teaches their immune systems how to build up defenses against the virus. In this way, the polio vaccine, like other vaccines, shows the body how to develop the tools it needs to fight off the live virus, if exposed to it.\n\nBut in the early years of the vaccine’s administration, two unexpected issues occurred. In 1955, some lots of the vaccine produced by one company actually contained live poliovirus, explains the CDC. This led to more than 250 cases of the disease polio and 10 deaths.\n\nThe second incident pertains to our readers’ questions.\n\nIn 1960, scientists discovered that some of the monkey kidney cells used to make the polio vaccines were contaminated with simian virus 40. For monkeys, this virus is harmless, producing no symptoms. But in high doses, SV40 can cause cancer in rodents.\n\nStarting in 1961, authorities required new lots of polio vaccines to be free of SV40. Still, many vaccines produced prior to this year weren’t recalled.\n\nAltogether, scientists estimate that around 100 million U.S. residents received one or more doses of the polio vaccine between 1954 and 1963, including those who were vaccinated during a clinical trial in 1954.\n\nTo be clear, not all of the vaccines given to people during this period were contaminated with SV40. Out of those that were, the formalin used to kill the poliovirus killed all or most of the SV40 as well, explained Keerti Shah, now a professor emeritus of molecular microbiology and immunology at Johns Hopkins University, in a 2006 review.\n\nPublished in the International Journal of Cancer, the review adds that the number of people truly at risk — those exposed to live SV40 — remains unknown.\n\nSince the 1960s, scientists have continued to research the relationship between the polio virus, SV40 and cancer.\n\nIn 2002, a committee at the National Academies’ Institute of Medicine (now the National Academy of Medicine) reviewed the available research on the subject and found “that the evidence was inadequate to conclude whether or not the contaminated polio vaccine caused cancer.”\n\nWhy did the committee make that decision?\n\nStudies had consistently shown that people who received the polio vaccine in the 1950s and 1960s had no increased risk of cancer, but these studies had “substantial limitations,” the committee said.\n\nFor example, these studies were “ecologic,” the report explained. Ecologic studies look at groups — in this case, people who received the polio vaccine in the 1950s and 1960s — not individuals.\n\nIf the polio vaccine contaminated with SV40 did cause cancer, scientists would expect to see an increased risk of cancer in the population of people who received the vaccine. But just because they didn’t find this effect in the group doesn’t rule out the possibility that some select individuals did develop cancer because of the vaccine.\n\nGiven the inconclusiveness of this research, the committee looked at other lines of evidence to elucidate whether SV40 can cause cancer in humans.\n\nFor example, the committee found that studies have shown that the virus can cause cancer in rodents. But just because a virus causes cancer in lab rodents doesn’t mean it can cause cancer in humans. How viruses affect one species is not necessarily how they affect others.\n\nThe committee also found that studies have shown that SV40 can “transform” human cells in a culture — that is, cells in a petri dish, not in the body. This means the virus can change genetic material within human cells, a process that’s necessary for a person to develop cancer from the virus.\n\nBut this is still not enough evidence to definitively say SV40 causes cancer in humans — how a virus affects cells outside of the body may not be how it affects cells within the human body.\n\nThe report also pointed to some studies that have found the genetic material of SV40 within human tumors. But again, the “detection of SV40 in tumors does not, by itself, demonstrate a causal relationship,” the report explained. “SV40 could be a passenger virus, infecting the cells but causing no pathology.”\n\nThe National Academies’ report concluded that — even if researchers do uncover conclusive evidence for a causal link between the polio vaccine and cancer in the future — evidence accumulated up to 2002 is “sufficiently robust to suggest that the relative contribution of SV40 to overall risk would have to be small.”\n\nResearch published since 2002 has only swayed the scientific pendulum toward a lack of a causal link, says Shah at Johns Hopkins.\n\nIn his 2006 review of the literature, Shah concluded that research published since the 2002 committee’s report “does not support the notion that SV40 contributed to the development of human cancers.”\n\nFor one, studies that found the genetic material of SV40 in human tumors were likely “false positives,” he wrote in his paper published in the International Journal of Cancer.\n\nShah also pointed out that four additional studies published since 2002 found no link between those who may have been exposed to SV40 via the polio vaccine and a higher prevalence of cancer.\n\nLike the 2002 report, Shah said that “these data by themselves do not disprove the role of SV40 in human cancer because the exposure to SV40 by the vaccine is not known at the level of the individual.” But given this more recent research, it’s “very likely that SV40” is “not linked to any human cancer,” he concluded.\n\nAs we pointed out last July when we wrote about a controversial European Union court decision about vaccines, it’s difficult, if not impossible, for scientists to definitively rule out that a vaccine causes a disease. We cited a 2012 report by the Institute of Medicine at the National Academies on vaccine safety to support that point.\n\nThe report states that it’s “virtually impossible to prove the absence of a relationship with the same certainty that is possible in establishing the presence of one.” Why? Because “studies may not rule out the possibility that the reaction is caused by vaccine in a subset of individuals,” the report explains.\n\nThis argument also applies to the case of the polio vaccine and cancer — evidence suggests the contaminated vaccine in the 1950s and 1960s doesn’t cause cancer, but it’s difficult for scientists to rule out the possibility that it may have done so in a handful of people.\n\nCDC. Polio and the Vaccine (Shot) to Prevent It. Accessed 24 Apr 2018.\n\nCDC. Polio Vaccination: What Everyone Should Know. Accessed 24 Apr 2018.\n\nShah, Keerti V. “SV40 and human cancer: A review of recent data.” International Journal of Cancer. 27 Nov 2006.\n\nNASEM. “Press Release: Institute of Medicine to Become National Academy of Medicine.” 28 Apr 2015.\n\nLeft vs. Right Bias: How we rate the bias of media sources", "opengraph": {"locale": "en_US", "type": "article", "title": "Did the Polio Vaccine Cause Cancer?", "description": "By Vanessa Schipani  -  Factcheck.org Q: Did people develop cancer because of the polio vaccine? A: There are no known cases, and it’s very unlikely. In", "url": "https://mediabiasfactcheck.com/2018/04/25/did-the-polio-vaccine-cause-cancer/", "site_name": "Media Bias/Fact Check", "article:publisher": "https://www.facebook.com/mediabiasfactcheck/", "article:published_time": "2018-04-25T23:52:56+00:00", "image": "https://i0.wp.com/mediabiasfactcheck.com/wp-content/uploads/2017/06/false.jpg?fit=600%2C300&ssl=1", "image:width": "600", "image:height": "300", "image:type": "image/jpeg"}, "tags": ["Polio", "fact check"], "tweets": [], "movies": [], "links": ["https://www.factcheck.org/author/vanessa-schipani/", "https://www.factcheck.org/2018/04/did-the-polio-vaccine-cause-cancer/", "https://www.cdc.gov/polio/about/", "https://www.cdc.gov/polio/about/", "https://i0.wp.com/cdn.factcheck.org/UploadedFiles/SciCHECKsquare_4-e1430162915812.png?ssl=1", "https://www.cdc.gov/polio/us/pps.html", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/E/reported-cases.pdf", "https://www.cdc.gov/vaccines/parents/diseases/child/polio.html", "https://www.cdc.gov/vaccines/vpd/polio/public/index.html", "https://www.cdc.gov/nchs/fastats/immunize.htm", "https://www.salk.edu/about/history-of-salk/jonas-salk/", "https://onlinelibrary.wiley.com/doi/full/10.1002/ijc.22425", "https://www.cdc.gov/vaccines/hcp/conversations/downloads/vacsafe-understand-color-office.pdf", "https://onlinelibrary.wiley.com/doi/full/10.1002/ijc.22425", "https://www.cdc.gov/vaccinesafety/concerns/concerns-history.html", "https://onlinelibrary.wiley.com/doi/full/10.1002/ijc.22425", "https://onlinelibrary.wiley.com/doi/full/10.1002/ijc.22425", "https://onlinelibrary.wiley.com/doi/full/10.1002/ijc.22425", "https://www.jhsph.edu/alumni/share-your-story/nominate-someone-for-an-alumni-award/2016-winners/keerti-shah.html", "http://www.nationalacademies.org/hmd/Global/News%20Announcements/IOM-to-become-NAM-Press-Release.aspx", "https://www.ncbi.nlm.nih.gov/books/NBK221118/?report=reader", "https://www.jhsph.edu/alumni/share-your-story/nominate-someone-for-an-alumni-award/2016-winners/keerti-shah.html", "https://onlinelibrary.wiley.com/doi/full/10.1002/ijc.22425", "https://www.factcheck.org/2017/07/scientific-evidence-eu-court/", "https://www.nap.edu/catalog/13164/adverse-effects-of-vaccines-evidence-and-causality", "https://www.cdc.gov/polio/about/", "https://www.cdc.gov/polio/us/pps.html", "https://www.salk.edu/about/history-of-salk/jonas-salk/", "https://www.cdc.gov/vaccines/parents/diseases/child/polio.html", "https://www.cdc.gov/vaccines/vpd/polio/public/index.html", "https://onlinelibrary.wiley.com/doi/full/10.1002/ijc.22425", "https://www.cdc.gov/vaccines/hcp/conversations/downloads/vacsafe-understand-color-office.pdf", "https://www.cdc.gov/vaccinesafety/concerns/concerns-history.html", "http://www.nationalacademies.org/hmd/Global/News%20Announcements/IOM-to-become-NAM-Press-Release.aspx", "https://www.ncbi.nlm.nih.gov/books/NBK221118/?report=reader", "https://www.factcheck.org/2017/07/scientific-evidence-eu-court/", "https://www.nap.edu/catalog/13164/adverse-effects-of-vaccines-evidence-and-causality", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/E/reported-cases.pdf", "https://www.cdc.gov/nchs/fastats/immunize.htm", "https://mediabiasfactcheck.com/left-vs-right-bias-how-we-rate-the-bias-of-media-sources/", "https://mediabiasfactcheck.com/interactive-political-orientation-map-of-the-world/", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2018%2F04%2F25%2Fdid-the-polio-vaccine-cause-cancer%2F&linkname=Did%20the%20Polio%20Vaccine%20Cause%20Cancer%3F", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2018%2F04%2F25%2Fdid-the-polio-vaccine-cause-cancer%2F&linkname=Did%20the%20Polio%20Vaccine%20Cause%20Cancer%3F", "https://www.addtoany.com/add_to/tumblr?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2018%2F04%2F25%2Fdid-the-polio-vaccine-cause-cancer%2F&linkname=Did%20the%20Polio%20Vaccine%20Cause%20Cancer%3F", "https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2018%2F04%2F25%2Fdid-the-polio-vaccine-cause-cancer%2F&linkname=Did%20the%20Polio%20Vaccine%20Cause%20Cancer%3F", "https://www.addtoany.com/add_to/linkedin?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2018%2F04%2F25%2Fdid-the-polio-vaccine-cause-cancer%2F&linkname=Did%20the%20Polio%20Vaccine%20Cause%20Cancer%3F", "https://www.addtoany.com/add_to/flipboard?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2018%2F04%2F25%2Fdid-the-polio-vaccine-cause-cancer%2F&linkname=Did%20the%20Polio%20Vaccine%20Cause%20Cancer%3F", "https://www.addtoany.com/share"], "authors": ["Media Bias Fact Check"], "publish_date": "2018-04-25T23:52:56+00:00"}