{"result_id": "233013", "URL": "https://mediabiasfactcheck.com/2023/01/04/fact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims/", "timestamp": "2023-04-25 16:44:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/mediabiasfactcheck.com/wp-content/uploads/2020/12/cropped-transparent-MBFC-Square512.png?fit=32%2C32&ssl=1", "canonical": "https://mediabiasfactcheck.com/2023/01/04/fact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims/", "encoding": "UTF-8"}, "image": null, "domain": "mediabiasfactcheck.com", "title": "Fact Check: NFL Player Damar Hamlin’s Cardiac Arrest Triggers Unfounded Social Media Claims", "cleaned_text": "Buffalo Bills player Damar Hamlin collapsed on the field and suffered a cardiac arrest moments after taking a hit to his chest during a tackle. While it’s not yet known why his heart stopped, some experts say his condition is most likely due to a heart rhythm problem as a result of that impact. Still, people on social media have baselessly speculated that it was caused by a COVID-19 vaccine.\n\nNo vaccine or medical product is 100% safe, but the safety of vaccines is ensured via rigorous testing in clinical trials prior to authorization or approval, followed by continued safety monitoring once the vaccine is rolled out to the public to detect potential rare side effects. In addition, the Food and Drug Administration inspects vaccine production facilities and reviews manufacturing protocols to make sure vaccine doses are of high-quality and free of contaminants. One key vaccine safety surveillance program is the Vaccine Adverse Event Reporting System , or VAERS, which is an early warning system run by the Centers for Disease Control and Prevention and FDA. As its website explains , VAERS “is not designed to detect if a vaccine caused an adverse event, but it can identify unusual or unexpected patterns of reporting that might indicate possible safety problems requiring a closer look.” Anyone can submit a report to VAERS for any health problem that occurs after an immunization. There is no screening or vetting of the report and no attempt to determine if the vaccine was responsible for the problem. The information is still valuable because it’s a way of being quickly alerted to a potential safety issue with a vaccine, which can then be followed-up by government scientists. Another monitoring system is the CDC’s Vaccine Safety Datalink, which uses electronic health data from nine health care organizations in the U.S. to identify adverse events related to vaccination in near real time. In the case of the COVID-19 vaccines, randomized controlled trials involving tens of thousands of people, which were reviewed by multiple groups of experts, revealed no serious safety issues and showed that the benefits outweigh the risks. The CDC and FDA vaccine safety monitoring systems, which were expanded for the COVID-19 vaccines and also include a new smartphone-based reporting tool called v-safe, have subsequently identified only a few, very rare adverse events. For more, see “How safe are the vaccines?”\n\nDamar Hamlin, a 24-year-old safety for the Buffalo Bills, collapsed during a Jan. 2 game against the Cincinnati Bengals after being hit in the chest during a tackle.\n\nWhile Hamlin initially stood up after the play, he almost immediately fell over, and millions watched on live television as medical personnel attempted to resuscitate him. The Bills said early the following morning in a statement that Hamlin had suffered a cardiac arrest, meaning his heart had stopped beating, after the hit, although his “heartbeat was restored on the field.” The team added that Hamlin was “sedated and listed in critical condition” at a hospital in Cincinnati. Early Tuesday afternoon the Bills said Hamlin remained in critical condition. The game was postponed.\n\nWhile the cause of Hamlin’s cardiac arrest is not yet known, some physicians say the most likely cause is an arrhythmia that occurred as a result of the blow to his chest, known as commotio cordis.\n\nYet online, people have baselessly speculated — some within minutes of the collapse — that Hamlin’s condition is a result of COVID-19 vaccination. FactCheck.org is not aware of Hamlin’s vaccination status, but as of Jan. 13, 2022, nearly 95% of NFL players were vaccinated.\n\n“24 year old elite athletes in the NFL don’t just have cardiac arrest in the middle of a prime time game,” reads one post shared on Instagram. “This is squarely on the back of every single person who pushed that poison, required it, and shamed people who didn’t get it.”\n\nDr. Peter McCullough, a cardiologist known for spreading misinformation about the COVID-19 vaccines, suggestively said that if Hamlin “indeed took one of the COVID-19 vaccines, then subclinical vaccine-induced myocarditis must be considered in the differential diagnosis.” Myocarditis is inflammation of the heart muscle.\n\nSeveral people, including Charlie Kirk of the conservative group Turning Point USA, alluded to previous, unfounded notions that the vaccines are causing a surge of sudden deaths in young, healthy people, including athletes. There is no evidence for such claims.\n\nRepublican Rep. Marjorie Taylor Greene also chimed in on Twitter to suggest a connection between Hamlin and the COVID-19 vaccines. She also pointed to a tweet from last year from the Centers for Disease Control and Prevention about the dangers of relatively common blood clots in veins. The tweet had nothing to do with vaccination, as we’ve written.\n\nIt’s premature to know for certain what happened to Hamlin. But expert speculation has been focused on a rare condition known as commotio cordis.\n\n“It’s kind of like a perfect storm of events,” Neel Chokshi, a sports cardiologist at the University of Pennsylvania, told us. “When a blow to the chest wall happens at the right point during the cardiac cycle — or during a heartbeat — it can then trigger an irregular and life-threatening heart rhythm, which causes an individual to arrest.”\n\nAccording to a 2012 review article, about 10 to 20 cases of commotio cordis are reported each year to a U.S. registry, primarily among adolescent males who play sports. The condition is most common in baseball, but can occur in football.\n\nGiven that Hamlin collapsed just after a blow to the chest and he was able to be resuscitated, Chokshi said commotio cordis is “probably the most plausible explanation, not knowing any other details or any other predisposing conditions.”\n\nDr. Mark Link, a heart and arrhythmia specialist at UT Southwestern Medical Center, said that other conditions are more commonly the cause of cardiac arrest in a man of Hamlin’s age, but based on the footage, he too said that he thought commotio cordis was the most likely explanation.\n\nBuffalo Bills players and staff kneel after Damar Hamlin was injured during the first quarter of an NFL football game against the Cincinnati Bengals on Jan. 2. Photo by Kevin Sabitus/Getty Images.\n\nOther physicians have come to a similar conclusion based on the available information, although some have also proposed an underlying cardiac condition.\n\nWhen someone collapses after blunt force trauma to the heart, another main possibility is an aortic rupture or dissection. But Chokshi said that is less likely since Hamlin’s heart started beating again.\n\nThere is no evidence that vaccine-related myocarditis is behind Hamlin’s arrest. Myocarditis is a rare side effect of the mRNA COVID-19 vaccines that usually is mild.\n\nChokshi said that a past history of myocarditis — which can be caused by many things — can in a subset of patients result in scarring in the heart, which could make someone more prone to an irregular heart rhythm. But that’s rare, and typically a patient would be symptomatic with their myocarditis first, Chokshi said. He said it wasn’t impossible, but “highly unlikely” for Hamlin’s arrest to be due to myocarditis of any kind, let alone vaccine-related myocarditis specifically.\n\nLink said vaccine-related myocarditis was very unlikely. A work-up in the hospital would reveal more, he said.\n\nChokshi similarly said it would be important for doctors to run tests to rule out preexisting causes, including structural abnormalities of the heart. Genetic mutations can also predispose people to heart rhythm problems.\n\n“Vaccine myocarditis is probably the lowest on the list at this point,” he said of possible reasons for Hamlin’s cardiac arrest.\n\n“This is not something that people should go speculate about vaccines or anything like that causing this cardiac arrest,” said Dr. Brian Sutterer, a physical medicine and rehabilitation specialist, in a YouTube video. “There was a clear contact, a clear trauma, and I think a clear reason why, unfortunately, this happened for Hamlin.”\n\nEditor’s note: SciCheck’s COVID-19/Vaccination Project is made possible by a grant from the Robert Wood Johnson Foundation. The foundation has no control over FactCheck.org’s editorial decisions, and the views expressed in our articles do not necessarily reflect the views of the foundation. The goal of the project is to increase exposure to accurate information about COVID-19 and vaccines, while decreasing the impact of misinformation.\n\nLink, Mark S. “Commotio Cordis: Ventricular Fibrillation Triggered by Chest Impact–Induced Abnormalities in Repolarization.” Circulation: Arrhythmia and Electrophysiology. 1 Apr 2012.\n\nConservativeAnt [@AntConservativ3]. “He did not just collapse for no reason! When has it been normal to see so many athletes just drop! #BillsMafia #DamarHamlin.” Facebook. 2 Jan 2023.\n\nJuan Raul Garza. [juanraulgarzajrg] “A football player has collapsed tonight just like the dozens who have been ‘cUrEd.’ Those who know the truth. Spread the truth now. And prayers for damar Hamlin. Pray for his recovery.” Instagram. 2 Jan 2023.\n\nTheShaunaBrooks. [theshaunabrooks] “NFL @d.ham3 24, has a CARDIAC ARREST after making a tackle but y’all STILL ignoring @cdcgov saying BLACK mRNA vaccinated teenage boys & men ages 18-39 are disproportionately at higher risks of experiencing cardiac complications & related deaths…” Instagram. 3 Jan 2023.\n\nGilbert, David. “Far-Right Trolls Are Already Spreading Anti-Vax Conspiracies About Damar Hamlin.” Vice. 3 Jan 2023.\n\nAssociated Press. “Buffalo Bills’ Damar Hamlin in critical condition after collapse on field.” CNBC. 2 Jan 2023.\n\nLouis Uridel [louisuridel]. “24 year old elite athletes in the NFL don’t just have cardiac arrest in the middle of a prime time game. This is squarely on the back of every single person who pushed that poison, required it, and shamed people who didn’t get it.” Instagram. 2 Jan 2023.\n\nMcDonald, Jessica. “Vaccines Remain Largely Effective Against Delta Variant, Counter to Claims From Fox News Guest.” FactCheck.org. 30 Jul 2021.\n\nCharlie Kirk [@charliekirk11]. “This is a tragic and all too familiar sight right now: Athletes dropping suddenly.” Twitter. 2 Jan 2023.\n\nRep. Marjorie Taylor Greene [@RepMTG]. “Before the covid vaccines we didn’t see athletes dropping dead on the playing field like we do now. And we never saw the CDC say things like this. How many people are dying suddenly? Time to investigate the covid vaccines. #Bills.” Twitter. 3 Jan 2023.\n\nChokshi, Neel. Medical Director, Sports Cardiology and Fitness Program at Penn Medicine. Phone interview with FactCheck.org. 3 Jan 2023.\n\nLink, Mark. Laurence and Susan Hirsch/Centex Distinguished Chair in Heart Disease, UT Southwestern Medical Center. Phone interview with FactCheck.org. 3 Jan 2023.\n\nKHOU-11 Staff, Associated Press. “What is Commotio Cordis? Doctor describes what could be a traumatic injury to Damar Hamlin, CNN reports.” KHOU-11. 3 Jan 2023.\n\nJaramillo, Catalina. “Benefits of COVID-19 Vaccination Outweigh the Rare Risk of Myocarditis, Even in Young Males.” FactCheck.org. 1 Mar 2022.\n\nThe post NFL Player Damar Hamlin’s Cardiac Arrest Triggers Unfounded Social Media Claims appeared first on FactCheck.org.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fact Check: NFL Player Damar Hamlin’s Cardiac Arrest Triggers Unfounded Social Media Claims", "description": "By Jessica McDonald - factcheck.org SciCheck Digest Buffalo Bills player Damar Hamlin collapsed on the field and suffered a cardiac arrest moments after", "url": "https://mediabiasfactcheck.com/2023/01/04/fact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims/", "site_name": "Media Bias/Fact Check", "article:publisher": "https://www.facebook.com/mediabiasfactcheck/", "article:published_time": "2023-01-04T13:17:05+00:00", "image": "https://mediabiasfactcheck.com/wp-content/uploads/2021/12/facts-6Qi77x.jpeg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": ["Vaccines", "fact check", "Least Biased"], "tweets": [], "movies": [], "links": ["https://www.factcheck.org/author/jessica-mcdonald/", "https://www.cdc.gov/vaccinesafety/ensuringsafety/history/index.html", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/index.html", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/index.html", "https://vaers.hhs.gov/faq.html", "https://vaers.hhs.gov/data/dataguide.html", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/index.html", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vsd/index.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/vsafe.html", "https://www.factcheck.org/scicheck_digest/how-safe-are-the-vaccines/", "https://www.factcheck.org/scicheck_digest/how-do-we-know-vaccines-are-safe/", "https://www.cnn.com/videos/sports/2023/01/03/damar-hamlin-collapse-buffalo-bills-nfl-vpx.cnn", "https://perma.cc/NN8X-LVKG", "https://twitter.com/BuffaloBills/status/1610341189399584770", "https://twitter.com/NFL/status/1610111462281994241", "https://www.ahajournals.org/doi/full/10.1161/circep.111.962712", "https://perma.cc/J7K4-JZLC", "https://perma.cc/C4CM-74GZ", "https://perma.cc/UQP9-QWBW", "https://perma.cc/JNV8-WNC9?type=image", "https://www.cnbc.com/2023/01/03/buffalo-bills-damar-hamlin-collapses-on-field-gets-cpr-game-suspended.html", "https://www.vice.com/en/article/7k83qd/damar-hamlin-hit-covid-vaccine-conspiracies", "https://www.nfl.com/playerhealthandsafety/resources/press-releases/nfl-covid-19-testing-results-and-vaccination-rates-dec-26-2021-jan-8-2022", "https://perma.cc/C6NQ-LW7H", "https://www.factcheck.org/person/peter-mccullough/", "https://healthfeedback.org/authors/peter-mccullough/", "https://perma.cc/UXN4-EE22", "https://www.vice.com/en/article/7k83qd/damar-hamlin-hit-covid-vaccine-conspiracies", "https://perma.cc/M3A7-7LKS", "https://perma.cc/WM6V-LEWS", "https://mediabiasfactcheck.com/charlie-kirk-bias-rating/", "https://mediabiasfactcheck.com/turning-point-usa/", "https://www.factcheck.org/2022/06/scicheck-posts-baselessly-link-sudden-arrhythmic-death-syndrome-to-covid-19-vaccines/", "https://www.factcheck.org/2022/12/scicheck-died-suddenly-pushes-bogus-depopulation-theory/", "https://perma.cc/3X3Z-CR3C", "https://www.factcheck.org/2022/03/scicheck-post-misconstrues-public-health-awareness-campaigns-about-blood-clots/", "https://www.pennmedicine.org/providers/profile/neel-chokshi", "https://www.ahajournals.org/doi/full/10.1161/circep.111.962712", "https://nocsae.org/research-grant-program/research-grants-by-year/the-national-commotio-cordis-registry/", "https://utswmed.org/doctors/mark-link/", "https://www.washingtonpost.com/health/2023/01/03/hamlin-possible-heart-arrhythmia/", "https://www.khou.com/article/sports/nfl/what-is-commotio-cordis/285-0bba8189-2308-403c-b95e-3eac5122d65e", "https://www.youtube.com/watch?v=H-G9mziXL9w", "https://abc30.com/damar-hamlin-injury-buffalo-bills-cpr/12644273/", "https://www.medpagetoday.com/special-reports/exclusives/102481", "https://www.factcheck.org/2022/03/scicheck-benefits-of-covid-19-vaccination-outweigh-the-rare-risk-of-myocarditis-even-in-young-males/", "https://health.usnews.com/doctors/brian-sutterer-1440715", "https://www.youtube.com/watch?v=H-G9mziXL9w", "https://www.factcheck.org/covid-misconceptions/", "https://www.factcheck.org/2021/04/scicheck-and-our-committment-to-transparency/", "https://www.cnn.com/videos/sports/2023/01/03/damar-hamlin-collapse-buffalo-bills-nfl-vpx.cnn", "https://www.cnn.com/videos/sports/2023/01/03/damar-hamlin-collapse-buffalo-bills-nfl-vpx.cnn", "https://perma.cc/NN8X-LVKG", "https://twitter.com/NFL/status/1610111462281994241", "https://www.ahajournals.org/doi/full/10.1161/circep.111.962712", "https://www.nfl.com/playerhealthandsafety/resources/press-releases/nfl-covid-19-testing-results-and-vaccination-rates-dec-26-2021-jan-8-2022", "https://perma.cc/J7K4-JZLC", "https://perma.cc/C4CM-74GZ", "https://perma.cc/UQP9-QWBW", "https://perma.cc/JNV8-WNC9?type=image", "https://www.cnbc.com/2023/01/03/buffalo-bills-damar-hamlin-collapses-on-field-gets-cpr-game-suspended.html", "https://perma.cc/C6NQ-LW7H", "https://www.factcheck.org/2021/07/vaccines-remain-largely-effective-against-delta-variant-counter-to-claims-from-fox-news-guest/", "https://healthfeedback.org/authors/peter-mccullough/", "https://perma.cc/M3A7-7LKS", "https://perma.cc/WM6V-LEWS", "https://www.factcheck.org/2022/06/scicheck-posts-baselessly-link-sudden-arrhythmic-death-syndrome-to-covid-19-vaccines/", "https://www.factcheck.org/2022/12/scicheck-died-suddenly-pushes-bogus-depopulation-theory/", "https://perma.cc/3X3Z-CR3C", "https://www.factcheck.org/2022/03/scicheck-post-misconstrues-public-health-awareness-campaigns-about-blood-clots/", "https://nocsae.org/research-grant-program/research-grants-by-year/the-national-commotio-cordis-registry/", "https://www.washingtonpost.com/health/2023/01/03/hamlin-possible-heart-arrhythmia/", "https://www.khou.com/article/sports/nfl/what-is-commotio-cordis/285-0bba8189-2308-403c-b95e-3eac5122d65e", "https://www.youtube.com/watch?v=H-G9mziXL9w", "https://abc30.com/damar-hamlin-injury-buffalo-bills-cpr/12644273/", "https://www.medpagetoday.com/special-reports/exclusives/102481", "https://www.factcheck.org/2022/03/scicheck-benefits-of-covid-19-vaccination-outweigh-the-rare-risk-of-myocarditis-even-in-young-males/", "https://www.factcheck.org/2023/01/scicheck-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims/", "https://www.factcheck.org/", "https://www.factcheck.org/2023/01/scicheck-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims/", "https://mediabiasfactcheck.com/factcheck/", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2023%2F01%2F04%2Ffact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims%2F&linkname=Fact%20Check%3A%20NFL%20Player%20Damar%20Hamlin%E2%80%99s%20Cardiac%20Arrest%20Triggers%20Unfounded%20Social%20Media%20Claims", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2023%2F01%2F04%2Ffact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims%2F&linkname=Fact%20Check%3A%20NFL%20Player%20Damar%20Hamlin%E2%80%99s%20Cardiac%20Arrest%20Triggers%20Unfounded%20Social%20Media%20Claims", "https://www.addtoany.com/add_to/tumblr?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2023%2F01%2F04%2Ffact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims%2F&linkname=Fact%20Check%3A%20NFL%20Player%20Damar%20Hamlin%E2%80%99s%20Cardiac%20Arrest%20Triggers%20Unfounded%20Social%20Media%20Claims", "https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2023%2F01%2F04%2Ffact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims%2F&linkname=Fact%20Check%3A%20NFL%20Player%20Damar%20Hamlin%E2%80%99s%20Cardiac%20Arrest%20Triggers%20Unfounded%20Social%20Media%20Claims", "https://www.addtoany.com/add_to/linkedin?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2023%2F01%2F04%2Ffact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims%2F&linkname=Fact%20Check%3A%20NFL%20Player%20Damar%20Hamlin%E2%80%99s%20Cardiac%20Arrest%20Triggers%20Unfounded%20Social%20Media%20Claims", "https://www.addtoany.com/add_to/flipboard?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2023%2F01%2F04%2Ffact-check-nfl-player-damar-hamlins-cardiac-arrest-triggers-unfounded-social-media-claims%2F&linkname=Fact%20Check%3A%20NFL%20Player%20Damar%20Hamlin%E2%80%99s%20Cardiac%20Arrest%20Triggers%20Unfounded%20Social%20Media%20Claims", "https://www.addtoany.com/share"], "authors": ["Media Bias Fact Check"], "publish_date": "2023-01-04T13:17:05+00:00"}