{"result_id": "233033", "URL": "https://mediabiasfactcheck.com/2022/10/19/its-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission/", "timestamp": "2023-04-25 16:44:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/mediabiasfactcheck.com/wp-content/uploads/2020/12/cropped-transparent-MBFC-Square512.png?fit=32%2C32&ssl=1", "canonical": "https://mediabiasfactcheck.com/2022/10/19/its-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission/", "encoding": "UTF-8"}, "image": null, "domain": "mediabiasfactcheck.com", "title": "It’s Not News, Nor ‘Scandalous,’ That Pfizer Trial Didn’t Test Transmission", "cleaned_text": "The COVID-19 vaccine clinical trials were designed to study the vaccine’s safety and efficacy in preventing symptomatic disease, not transmission. But online publications now misleadingly present the fact that the Pfizer/BioNTech vaccine was not tested for transmission as a “shocking admission” and proof that the company and the government lied.\n\nMore than 16 million Americans had contracted COVID-19 and more than 300,000 had died from the disease when the first COVID-19 vaccine, from Pfizer/BioNTech, was cleared for use.\n\nThe Food and Drug Administration authorized the use of the vaccine on Dec. 11, 2020, in what the agency called a “milestone” in the fight against the coronavirus, or SARS-CoV-2, and “a true testament to scientific innovation and public-private collaboration worldwide.”\n\nThe emergency use authorization followed a review of data from phase 3 clinical trials that showed the vaccine was safe and 95% effective in preventing symptomatic COVID-19 a week or more after the second dose (the figure fell to 91% in the updated analysis reviewed for full approval). The clinical trials did not assess if the vaccine could reduce transmission, and neither the companies nor the government ever claimed they did.\n\n“At this time, data are not available to make a determination about how long the vaccine will provide protection, nor is there evidence that the vaccine prevents transmission of SARS-CoV-2 from person to person,” the FDA stated when it announced the emergency use authorization.\n\nSimilarly, in the authorization documents for the Pfizer/BioNTech vaccine, the European Medicines Agency concluded that “excellent vaccine efficacy (preventing symptomatic COVID-19) was shown,” but that it “is presently not known if the vaccine protects against asymptomatic infection, or its impact on viral transmission,” as well as the duration of the protection provided.\n\nOn Dec. 3, 2020, Pfizer’s CEO, Albert Bourla, told NBC News it was still unknown if vaccinated people could carry the virus and spread it to others. “I think this is something that needs to be examined. We are not certain about that right now,” he said.\n\nYet recent online posts claim, as if it were breaking news, that a Pfizer executive “admits” the vaccine was never tested for whether it prevented transmission. Social media posts claim the supposed “shocking admission” was “criminal” and “indisputable proof of the fact that our governments lied to us.”\n\nThe posts cite remarks by Pfizer’s president of international developed markets, Janine Small, while testifying on behalf of Bourla before the European Parliament’s COVID-19 committee on Oct. 10.\n\nDuring the session, a conservative Dutch member of the Parliament, Rob Roos, asked Small if Pfizer had tested the vaccine for transmission prevention before the vaccine entered the market (see the 15:23:00 mark of the video). Small said: “No. We had to really move at the speed of science to really understand what is taking place in the market” (see the 15:31:45 mark).\n\nFollowing the hearing, Roos posted a two-minute video statement on Twitter that included his exchange with Small.\n\n“BREAKING: In COVID hearing, #Pfizer director admits: #vaccine was never tested on preventing transmission. ‘Get vaccinated for others’ was always a lie. The only purpose of the #COVID passport: forcing people to get vaccinated. The world needs to know. Share this video!” said the post, which got 232,600 likes and 138,500 shares in less than two days.\n\n“I find this to be shocking, even criminal,” Roos said in his video statement.\n\nBut as we said, nobody claimed the vaccines — Pfizer’s nor Moderna’s — were tested for transmission prevention before they hit the market. Those studies started once the vaccines were being administered.\n\n“Our landmark phase 3 clinical trial (protocol published November 2020) was designed and powered to evaluate efficacy of BNT165b2 to prevent disease caused by SARS-CoV2, including severe disease. Stopping transmission was not a study endpoint,” Pfizer’s global media relations senior director, Andrew Widger, told us in an email, referring to the company’s vaccine.\n\nThat’s not uncommon. In a commentary published in Science in March, Natalie E. Dean, assistant professor in the Department of Biostatistics & Bioinformatics at the Emory University Rollins School of Public Health, and M. Elizabeth Halloran, head of the Biostatistics, Bioinformatics and Epidemiology Program at the Fred Hutchinson Cancer Research Center’s Vaccine and Infectious Disease Division, wrote that estimating indirect effects of a vaccine, such as reduction in infectiousness, “is typically done after a vaccine is licensed, in either observational studies or cluster randomized trials.”\n\nThe primary benefit of an effective vaccine is to prevent symptomatic disease, Dean told us in an email, and “given the urgent need to prevent COVID-19 illness, the trials focused on these primary goals,” she said. A secondary benefit of an effective vaccine is to reduce transmission, she added, either by protecting against infection or by making infected people less contagious. “But assessing protection against transmission requires specialized tests (antibody tests or more frequent sampling) and, to measure contagiousness, measuring viral load and, preferably, studying family members or other contacts,” she said.\n\nWe explained the difference between infection with a virus and disease, or the development of illness, in this video.\n\nRoos did not reply to our request for comment, but he told the Associated Press that governments infringed on fundamental rights by imposing vaccine mandates with “no evidence” that the vaccines stopped transmission. In an appearance on Fox News’ “Tucker Carlson Tonight” on Oct. 11, he said that “governments pushed millions of people worldwide to get vaccinated by telling them … do it for your grandmother” and introduced “so-called COVID passports,” mandates and lockdowns “in the name of public health.”\n\n“All of this was based on the idea that vaccination helps prevent the spread of the virus, otherwise, why shun people out of society? But this has now proven to be a big lie,” Roos said.\n\nTo be fair, some officials have overstated the transmission protection provided by the vaccines. But studies did find that vaccinated people were much less likely to spread the virus, either because they were protected from getting infected in the first place, or by being less contagious if infected.\n\nAs we’ve reported, that became less true with the emergence of the more transmissible and immune evasive omicron variant, but there is still evidence that for a short period, vaccines help reduce omicron transmission somewhat.\n\n“Being up to date with vaccination provides a transient period of increased protection against infection and transmission after the most recent dose, although protection can wane over time,” CDC experts wrote in their latest guidance for minimizing the impact of COVID-19.\n\nIn their commentary, Dean and Halloran mention two studies published in Science based on data from Israel to argue that there are multiple factors that affect the ability of COVID-19 vaccines to reduce transmission, such as time since vaccination and evasive variants.\n\nOne of the studies found that in households with one infected parent, the chances of at least one unvaccinated child becoming infected were much lower if that parent was vaccinated. The chance of infection was 72.1% lower with a vaccinated parent during the alpha period, shortly after the vaccines were rolled out, and 79.6% lower during the delta period. The other study found that vaccines reduce infectiousness by 23% using data from before the emergence of delta.\n\n“COVID-19 vaccines have provided exceptional protection against severe disease, and they have reduced transmission. Notably, indirect protection is not all or nothing but rather incrementally increases with each newly immunized person. Ensuring our communities are well vaccinated is a major priority as SARS-CoV-2 becomes endemic,” Dean and Halloran concluded.\n\nEditor’s note: SciCheck’s COVID-19/Vaccination Project is made possible by a grant from the Robert Wood Johnson Foundation. The foundation has no control over FactCheck.org’s editorial decisions, and the views expressed in our articles do not necessarily reflect the views of the foundation. The goal of the project is to increase exposure to accurate information about COVID-19 and vaccines, while decreasing the impact of misinformation.\n\nThis Week in Coronavirus: December 11 to December 17. KFF. 18 Dec 2020.\n\n“FDA Takes Key Action in Fight Against COVID-19 By Issuing Emergency Use Authorization for First COVID-19 Vaccine.” FDA. Press release. 11 Dec 2020.\n\n“Pfizer and BioNTech Conclude Phase 3 Study of COVID-19 Vaccine Candidate, Meeting All Primary Efficacy Endpoints.” Pfizer. Press release. 18 Nov 2020.\n\n“Assessment report. Comirnaty.” Committee for Medicinal Products for Human Use (CHMP). EMA. 19 Feb 2021.\n\nIngram, David. “3 vaccine executives say that after approval, distribution will be the main challenge.” NBC News. 3 Dec 2020.\n\nCOVID-19 – Lessons learned and recommendations for the future: extracts from the exchange of views – EP Special Committee on the COVID-19 pandemic. Multimedia Centre. European Parliament.\n\nSchraer, Rachel. “Covid jab probably does protect those around you.” BBC. 30 Mar 2021.\n\nA Phase 1/2/3, Placebo-Controlled, Randomized, Observer-Blind, Dose-Finding Study To Evaluate The Safety, Tolerability, Immunogenicity, And Efficacy Of Sars-Cov-2 Rna Vaccine. Pfizer. Nov 2020.\n\nDean, Natalie E. and M. Elizabeth Halloran. “Protecting the herd with vaccination.” Science. 10 Mar 2022.\n\nDean, Natalie E. Assistant Professor Department of Biostatistics & Bioinformatics, Rollins School of Public Health, Emory University. Email to FactCheck.org. 14 Oct 2022.\n\nGoldin, Melissa and Angelo Fichera. “Posts mislead on Pfizer COVID vaccine’s impact on transmission.” AP. 13 Oct 2022.\n\nRouw, Anna, et al. “Key Questions about COVID-19 Vaccine Passports and the U.S”. KFF. 15 Apr 2021.\n\nScience Brief: COVID-19 Vaccines and Vaccination. CDC. Last updated 15 Sep 2021.\n\nEyre, David W., et al. “Effect of Covid-19 Vaccination on Transmission of Alpha and Delta Variants.” New England Journal of Medicine. 24 Feb 2022.\n\nHow well do vaccines protect against Omicron? What the data shows. UK Health Security Agency. 10 Feb 2022.\n\nPlesner Lyngse, Frederik, et al. “Household transmission of the SARS-CoV-2 Omicron variant in Denmark.” Nature Communications. 23 Sep 2022.\n\nHayek, Samah, et al. “Indirect protection of children from SARS-CoV-2 infection through parental vaccination.” Science. Vol 375, Issue 6585. 27 Jan 2022.\n\nPrunas, Ottavia, et al. “Vaccination with BNT162b2 reduces transmission of SARS-CoV-2 to household contacts in Israel.” Vol 375, Issue 6585. 27 Jan 2022.\n\nMcDonald, Jessica. “Vaccinated People Not More Susceptible to COVID-19 Than Unvaccinated.” FactCheck.org. 10 Jun 2022.\n\nThe post It’s Not News, Nor ‘Scandalous,’ That Pfizer Trial Didn’t Test Transmission appeared first on FactCheck.org.\n\nLeft vs. Right Bias: How we rate the bias of media sources", "opengraph": {"locale": "en_US", "type": "article", "title": "It’s Not News, Nor ‘Scandalous,’ That Pfizer Trial Didn’t Test Transmission", "description": "SciCheck Digest The COVID-19 vaccine clinical trials were designed to study the vaccine’s safety and efficacy in preventing symptomatic disease, not", "url": "https://mediabiasfactcheck.com/2022/10/19/its-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission/", "site_name": "Media Bias/Fact Check", "article:publisher": "https://www.facebook.com/mediabiasfactcheck/", "article:published_time": "2022-10-19T12:00:39+00:00", "article:modified_time": "2022-10-19T11:03:28+00:00", "image": "https://i0.wp.com/mediabiasfactcheck.com/wp-content/uploads/2021/12/PIXNIO-2376190-1200x800-1-NSbKhe.jpeg?fit=1024%2C683&ssl=1", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": ["Least Biased", "Pfizer Vaccine"], "tweets": [], "movies": [], "links": ["https://www.factcheck.org/2020/12/a-guide-to-modernas-covid-19-vaccine/", "https://www.factcheck.org/2020/12/a-guide-to-pfizer-biontechs-covid-19-vaccine/", "https://www.nidcr.nih.gov/research/human-subjects-research/toolkit-and-education-materials/interventional-studies/data-and-safety-monitoring-board-guidelines", "https://www.cdc.gov/vaccines/hcp/acip-recs/vacc-specific/covid-19.html", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-takes-key-action-approving-second-covid-19-vaccine", "https://www.factcheck.org/scicheck_digest/how-were-the-vaccines-tested/", "https://www.kff.org/policy-watch/this-week-in-coronavirus-december-11-to-december-17/", "https://www.fda.gov/news-events/press-announcements/fda-takes-key-action-fight-against-covid-19-issuing-emergency-use-authorization-first-covid-19", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-conclude-phase-3-study-covid-19-vaccine", "https://www.factcheck.org/2020/12/a-guide-to-pfizer-biontechs-covid-19-vaccine/", "https://www.factcheck.org/2020/12/a-guide-to-pfizer-biontechs-covid-19-vaccine/", "https://www.fda.gov/news-events/press-announcements/fda-takes-key-action-fight-against-covid-19-issuing-emergency-use-authorization-first-covid-19", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://www.nbcnews.com/news/us-news/3-vaccine-executives-say-after-approval-distribution-will-be-main-n1249928", "https://perma.cc/D35T-6VC5", "https://perma.cc/M2AZ-6LPV", "https://cdn.factcheck.org/UploadedFiles/Screenshot-2022-10-17-121925.jpg", "https://cdn.factcheck.org/UploadedFiles/Screenshot-2022-10-17-121527.jpg", "https://perma.cc/559A-7VJE", "https://multimedia.europarl.europa.eu/en/video/lessons-learned-and-recommendations-for-the-future-extracts-from-the-exchange-of-views-ep-special-committee-on-the-covid-19-pandemic_I231213", "https://multimedia.europarl.europa.eu/en/webstreaming/covi-committee-meeting_20221010-1430-COMMITTEE-COVI", "https://www.europarl.europa.eu/meps/en/197709/ROBERT_ROOS/home", "https://perma.cc/83WZ-9LHR", "https://www.nature.com/articles/d41586-021-00450-z", "https://www.bbc.com/news/health-56514470", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://www.science.org/doi/10.1126/science.abo2959", "https://sph.emory.edu/faculty/profile/index.php?FID=natalie-dean-12818", "https://www.fredhutch.org/en/faculty-lab-directory/halloran-elizabeth.html", "https://www.factcheck.org/2021/02/scicheck-video-dont-confuse-the-virus-with-the-disease/", "https://apnews.com/article/fact-check-pfizer-transmission-european-parliament-950413863226", "https://www.foxnews.com/transcript/tucker-carlson-tulsi-gabbards-career-rising-democratic-party-star-came-halt-questioning", "https://nymag.com/intelligencer/2021/04/cdc-data-suggests-vaccinated-dont-carry-cant-spread-virus.html", "https://www.cdc.gov/coronavirus/2019-ncov/science/science-briefs/fully-vaccinated-people.html#infections-fully-vaccinated", "https://www.nejm.org/doi/full/10.1056/nejmoa2116597", "https://www.science.org/doi/10.1126/science.abl4292", "https://www.factcheck.org/2022/01/factchecking-the-justices-covid-19-claims/", "https://www.factcheck.org/2022/06/scicheck-vaccinated-people-not-more-susceptible-to-covid-19-than-unvaccinated/", "https://www.nature.com/articles/s41467-022-33328-3", "https://ukhsa.blog.gov.uk/2022/02/10/how-well-do-vaccines-protect-against-omicron-what-the-data-shows/", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7133e1.htm", "https://www.science.org/doi/10.1126/science.abo2959", "https://www.science.org/doi/10.1126/science.abm3087", "https://www.science.org/doi/10.1126/science.abl4292", "https://www.factcheck.org/covid-misconceptions/", "https://www.factcheck.org/2021/04/scicheck-and-our-committment-to-transparency/", "https://www.kff.org/policy-watch/this-week-in-coronavirus-december-11-to-december-17/", "https://www.fda.gov/news-events/press-announcements/fda-takes-key-action-fight-against-covid-19-issuing-emergency-use-authorization-first-covid-19", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-conclude-phase-3-study-covid-19-vaccine", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://www.nbcnews.com/news/us-news/3-vaccine-executives-say-after-approval-distribution-will-be-main-n1249928", "https://multimedia.europarl.europa.eu/en/video/lessons-learned-and-recommendations-for-the-future-extracts-from-the-exchange-of-views-ep-special-committee-on-the-covid-19-pandemic_I231213", "https://www.nature.com/articles/d41586-021-00450-z", "https://www.bbc.com/news/health-56514470", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://www.science.org/doi/10.1126/science.abo2959", "https://sph.emory.edu/faculty/profile/index.php?FID=natalie-dean-12818", "https://apnews.com/article/fact-check-pfizer-transmission-european-parliament-950413863226", "https://nymag.com/intelligencer/2021/04/cdc-data-suggests-vaccinated-dont-carry-cant-spread-virus.html", "https://www.kff.org/coronavirus-covid-19/issue-brief/key-questions-about-covid-19-vaccine-passports-and-the-u-s/", "https://www.cdc.gov/coronavirus/2019-ncov/science/science-briefs/fully-vaccinated-people.html#infections-fully-vaccinated", "https://www.nejm.org/doi/full/10.1056/nejmoa2116597", "https://ukhsa.blog.gov.uk/2022/02/10/how-well-do-vaccines-protect-against-omicron-what-the-data-shows/", "https://www.nature.com/articles/s41467-022-33328-3", "https://www.science.org/doi/10.1126/science.abm3087", "https://www.science.org/doi/10.1126/science.abl4292", "https://www.factcheck.org/2022/01/factchecking-the-justices-covid-19-claims/", "https://www.linkedin.com/in/andrewwidger/?originalSubdomain=uk", "https://www.factcheck.org/2022/06/scicheck-vaccinated-people-not-more-susceptible-to-covid-19-than-unvaccinated/", "https://www.factcheck.org/2022/10/scicheck-its-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission/", "https://www.factcheck.org/", "https://www.factcheck.org/2022/10/scicheck-its-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission/", "https://mediabiasfactcheck.com/factcheck/", "https://mediabiasfactcheck.com/left-vs-right-bias-how-we-rate-the-bias-of-media-sources/", "https://mediabiasfactcheck.com/interactive-political-orientation-map-of-the-world/", "https://www.addtoany.com/add_to/pinterest?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2022%2F10%2F19%2Fits-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission%2F&linkname=It%E2%80%99s%20Not%20News%2C%20Nor%20%E2%80%98Scandalous%2C%E2%80%99%20That%20Pfizer%20Trial%20Didn%E2%80%99t%20Test%20Transmission", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2022%2F10%2F19%2Fits-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission%2F&linkname=It%E2%80%99s%20Not%20News%2C%20Nor%20%E2%80%98Scandalous%2C%E2%80%99%20That%20Pfizer%20Trial%20Didn%E2%80%99t%20Test%20Transmission", "https://www.addtoany.com/add_to/tumblr?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2022%2F10%2F19%2Fits-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission%2F&linkname=It%E2%80%99s%20Not%20News%2C%20Nor%20%E2%80%98Scandalous%2C%E2%80%99%20That%20Pfizer%20Trial%20Didn%E2%80%99t%20Test%20Transmission", "https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2022%2F10%2F19%2Fits-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission%2F&linkname=It%E2%80%99s%20Not%20News%2C%20Nor%20%E2%80%98Scandalous%2C%E2%80%99%20That%20Pfizer%20Trial%20Didn%E2%80%99t%20Test%20Transmission", "https://www.addtoany.com/add_to/linkedin?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2022%2F10%2F19%2Fits-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission%2F&linkname=It%E2%80%99s%20Not%20News%2C%20Nor%20%E2%80%98Scandalous%2C%E2%80%99%20That%20Pfizer%20Trial%20Didn%E2%80%99t%20Test%20Transmission", "https://www.addtoany.com/add_to/flipboard?linkurl=https%3A%2F%2Fmediabiasfactcheck.com%2F2022%2F10%2F19%2Fits-not-news-nor-scandalous-that-pfizer-trial-didnt-test-transmission%2F&linkname=It%E2%80%99s%20Not%20News%2C%20Nor%20%E2%80%98Scandalous%2C%E2%80%99%20That%20Pfizer%20Trial%20Didn%E2%80%99t%20Test%20Transmission", "https://www.addtoany.com/share"], "authors": ["Media Bias Fact Check"], "publish_date": "2022-10-19T12:00:39+00:00"}