{"result_id": "234034", "URL": "https://organicconsumers.org/elements-refusal/", "timestamp": "2023-04-25 16:45:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://organicconsumers.org/wp-content/uploads/2022/02/cropped-OCAtomatotransparent-32x32.png", "canonical": "https://organicconsumers.org/elements-refusal/", "encoding": "utf-8"}, "image": null, "domain": "organicconsumers.org", "title": "Elements of Refusal", "cleaned_text": "Psychiatrist Norman Doidge, MD, has recently published a long, four-part article entitled Needle Points, in which he examines vaccine skepticism in America. The author, who got vaccinated “early and voluntarily,” is solidly pro-vaccine, yet he displays what is in these divisive times an unusual willingness to see the issue from the perspective of those with whom he disagrees.\n\nI don’t want to default to critique in responding to the article, which I appreciate for its peaceful intentions, diligent historical research, lucid style, and willingness to bridge a steep ideological divide. Instead I will meet in good will its implicit invitation into dialog around the core question enunciated in its tagline: “Why so many are hesitant to get the COVID vaccine, and what we can do about it.”\n\nAs that tagline suggests, an assumption runs quietly through Needle Points that Covid vaccines are by and large safe, necessary, and generally beneficial for personal and public health. Therefore, opposition to them must be explained in psychological or sociological terms, because we all know that, scientifically speaking, opposition is baseless.", "opengraph": {"locale": "en_US", "type": "article", "title": "Elements of Refusal", "description": "Psychiatrist Norman Doidge, MD, has recently published a long, four-part article entitled Needle Points, in which he examines vaccine skepticism in America. The author, who got vaccinated “early and voluntarily,” is solidly pro-vaccine, yet he displays what is in these divisive times an unusual willingness to see the issue from the", "url": "https://organicconsumers.org/elements-refusal/", "site_name": "Organic Consumers", "article:publisher": "https://www.facebook.com/organicconsumers", "article:published_time": "2021-11-29T18:43:00+00:00", "image": "https://organicconsumers.org/wp-content/uploads/2021/11/vaxno.png", "image:width": "1200", "image:height": "630", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["//charleseisenstein.substack.com/p/elements-of-refusal\" target=\"oca-linked\">Read the Full Article</a>", "https://www.tabletmag.com/sections/science/articles/needle-points-vaccinations-chapter-one"], "authors": ["OCA"], "publish_date": "2021-11-29T18:43:00+00:00"}