{"result_id": "234045", "URL": "https://organicconsumers.org/newsletter/populist-and-regenerative-solutions/how-detox-engineered-covid-spike-protein", "timestamp": "2023-04-25 16:45:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://organicconsumers.org/wp-content/uploads/2022/02/cropped-OCAtomatotransparent-32x32.png", "canonical": "https://organicconsumers.org/how-to-detox-from-the-engineered-covid-spike-protein/", "encoding": "utf-8"}, "image": null, "domain": "organicconsumers.org", "title": "How to Detox from the Engineered COVID Spike Protein", "cleaned_text": "Most Americans have now had a direct encounter with lab engineered virus spike proteins, whether from being infected with COVID, injected with an experimental “gene transfer” mRNA “vaccine,” or both. Millions are still suffering from the “long haul” side effects of the virus or the “Emergency Use,” rushed to market “vaccines.” OCA’s favorite doctor, Joseph Mercola, has some advice for those of us hoping to detox from our recent encounters with engineered spike proteins, whether voluntary or involuntary.\n\n“If you had COVID-19 or received a COVID-19 injection, you may have dangerous spike proteins circulating in your body.\n\nSpike proteins can circulate in your body after infection or injection, causing damage to cells, tissues and organs.\n\nThe World Council for Health has released a spike protein detox guide, which provides straightforward steps you can take to potentially lessen the effects of toxic spike protein in your body.\n\nThe top 10 spike protein detox essentials include vitamin D, vitamin C, nigella seed, quercetin, zinc, curcumin, milk thistle extract, NAC, ivermectin and magnesium.”\n\nLearn more: How to Detox Spike Protein After COVID or Vaccine", "opengraph": {"locale": "en_US", "type": "article", "title": "How to Detox from the Engineered COVID Spike Protein", "description": "Most Americans have now had a direct encounter with lab engineered virus spike proteins, whether from being infected with COVID, injected with an experimental “gene transfer” mRNA “vaccine,” or both.  Millions are still suffering from the “long haul” side effects of the virus or the “Emergency Use,” rushed to market “vaccines.” OCA’s favorite", "url": "https://organicconsumers.org/how-to-detox-from-the-engineered-covid-spike-protein/", "site_name": "Organic Consumers", "article:publisher": "https://www.facebook.com/organicconsumers", "article:published_time": "2022-03-21T19:10:00+00:00", "image": "https://organicconsumers.org/wp-content/uploads/2023/02/proteins_250x250.png", "image:width": "250", "image:height": "250", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.organicconsumers.org/news/how-detox-spike-protein-after-covid-or-vaccine", "https://www.organicconsumers.org/news/how-detox-spike-protein-after-covid-or-vaccine", "https://www.organicconsumers.org/news/how-detox-spike-protein-after-covid-or-vaccine"], "authors": ["OCA"], "publish_date": "2022-03-21T19:10:00+00:00"}