{"result_id": "234049", "URL": "https://organicconsumers.org/on-public-health-propaganda-vaccines-great-reset/", "timestamp": "2023-04-25 16:45:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://organicconsumers.org/wp-content/uploads/2022/02/cropped-OCAtomatotransparent-32x32.png", "canonical": "https://organicconsumers.org/on-public-health-propaganda-vaccines-great-reset/", "encoding": "utf-8"}, "image": null, "domain": "organicconsumers.org", "title": "On Public Health Propaganda, Vaccines, and the Great Reset", "cleaned_text": "Ronnie Cummins: As Nate and Alexis remind us, we have to talk about the Big Elephant in the room, an ever more powerful and monstrous public health elite, of unelected bureaucrats such as Anthony Fauci and billionaires, such as Bill Gates, dictating public policy and controlling how we live our everyday lives. These public health dictates that now shape our lives and politics are based upon Big Pharma propaganda, power, and profit-mongering rather than science, evidence, and practical experience.\n\nRecently America’s bio-medical cabal, acting in harmony with the Chinese government and the WHO, has gotten away with brainwashing, shaming, and terrifying a critical mass of the body politic, telling us that COVID-19 arose naturally, that it threatens everyone no matter how young or healthy, that there are no natural defenses nor natural health supplements and generic drugs that can help us, and that we must lock down, mask up, and roll up our sleeves for an injection of an experimental drug, a so-called miracle vaccine.\n\n“Folks, we’ve been fighting a long time. And, yes, we are great fighters! A crisis arises and we mobilize to deal with it. A state exemption allowing consumer/patient/parent choice is under threat? A new vaccine is coming out? Freedoms threatened? We need to mobilize now!\n\nBut there’s something we must admit – we are still on the defensive. Our opponents choose the battleground – the location, the scientific material, the conversations we face against. And the same thing is happening with the COVID response, their greatest attack yet upon us.\n\nMany of us have believed that if we just convince them of the science, then they will change their minds. But the historical record has shown that it’s not just about science. It’s about power and control.\n\nIt’s about narrative dominance. Whose story will win in society?\n\nVaccine-rights lawyer Alan Phillips explains the best: “Narrative domination is the result of psychological manipulation, not information. This is why brilliant pediatricians (and billions of others) believe vaccines are safe and effective. They’re not stupid, they’re manipulated. You can’t fix psychological manipulation with information, as the manipulation causes information to bounce off (as we’ve all seen repeatedly).\n\n“Psychology–perception manipulation–is simply more powerful than the conscious intellect. That’s why decades of debunking false narratives with truthful information has been ineffective. More of the same will get more of the same result.”\n\nWe seem to be on a never-ending treadmill. We’ve been thrown narrative after narrative over the years. And then we struggle to beat that narrative, only to be given another narrative, unfortunately, more sophisticated than the last.\n\nThey throw us something and then expect us to provide the evidence to debunk it; when we fail to do so, they reply smugly, “See, I told you they were anti-science!” \n\nFolks, we need to get off this treadmill, off of the rat-race. And how do we do so: by exposing the underlying control system. The light fears the darkness; we need to bring a massive spotlight.\n\nWe can fight the narrative and then prepare ourselves to fight the inevitable next one. Or we can fight the narrative AND bring attention to the puppet-masters behind the scene.\n\nWhat’s the common thread that ties the list of inequities together? Public health, specifically the agencies who have regulatory authority over public health – the CDC, the WHO, the NIH, the FDA, etc.\n\nPublic health agencies are the source of the problem. Let’s be frank. Who’s defining the health metrics used to justify the vaccine program? Who’s the entryway that lets Big Pharma manipulate the government? Who’s driving the COVID response and, by extension, the whole of society? Who decides what factors even constitute “health”? Public health, public health, public health.\n\nOur main problem is that “The public is not questioning public health.” The public believes that these pronouncements on health come from some divine source and cannot be questioned. In turn, the media pushes the COVID response and vaccinations as inevitable. It’s going to happen anyway – so why fight it? The only people saying otherwise are conspiratorial anti-vaxxers.\n\nOur main challenge is to show the people that public health is the root source, that it is acting as an unelected, fourth branch of government, and that a normal person can question the experts. Public health can only act with impunity while the public is unaware that alternatives are possible.\n\nWe must talk about the problems of public health in all our communications. We have to call them out. For example:\n• Here’s a vaccine injury AND here’s why public health’s vaccine safety science missed it.\n• Here’s an ineffective treatment AND here’s why public health failed to look for alternatives.\n• Here’s a COVID response AND here’s why public health was fudged up the recommendation.\n• There are too many vaccines on the schedule AND public health has not measured the effects on health of the aggregate schedule.\n\nOur ultimate goal is a societal change. So where do we start:\n\nCall out public health in our messaging: Our messaging has a short-term and long-term focus. We need to tie our current messaging into a longer-term discussion of public health reform.\n\nShine a spotlight on the systems of control: Fundamentally, the system is unfair. The more we make people aware of this and how these systems work, the better it is for us.\n\nEmpower the people: We need to teach people that they have the right to question medicine and public health, that these systems are tasked with serving the people, and, if they don’t, then they should be reformed.\n\nCollectively design the future that should be: It’s up to us to collectively define the vision of the future that should be. We either: 1) offer the public our alternative narrative, or 2) let the narrative of our opponent’s dominant (i.e. more mRNA vaccination, Agenda 2030, de-population?)”\n\n“We need to make the connection between the current propaganda surrounding “public health” and the core mission of the Organic Consumers Association.\n\n﻿If public health officials cared about public health more than the profits of the pharmaceutical and chemical companies, we’d all be eating nutrient-dense organic food, but of course it’s the opposite. They’ve always allowed the corporations to get away with poisoning us, drugging us and robbing us of our health! Then, when we try to get away from that, they go after the alternatives we’ve created.\n\nUSDA Organic doesn’t require food to be grown in soil anymore and it isn’t doing anything about organic cheaters keeping animals in factory farms. Meanwhile, it’s illegal to sell some of the healthiest and most regenerative organic foods, like raw milk. And they’re pushing new synthetic genetically engineered foods that aren’t safety-tested or labeled. This insanity was happening before so-called public health officials, corrupted by their financial ties to the pharmaceutical and tech companies, decided to try to lock us in our homes until we agreed to vaccine passports. But the answer to these problems is the same: We need to fight for our right to organic food and natural health!\n\nIn late 2019, a lab accident, likely involving research on experimental new vaccines, triggered a pandemic.\n\nThe vaccine companies and their investors had been anticipating such a scenario for years. They were prepared to exploit the pandemic as an opportunity to trial the same new vaccine technologies under Emergency Use Authorizations. Public health authorities in government were ready to help. For years, they had been taking Big Pharma’s money and letting them write the rules.\n\nTo meet the legal requirements for Emergency Use, these corrupt public health authorities engaged in willful misconduct, exaggerating the reach of the crisis and suppressing effective treatments. They were aided and abetted by media outlets dependent on revenue from the pharmaceutical companies’ advertising.\n\nTo ensure their success, they banished dissent, buried the truth and held us hostage by locking us down, closing schools and businesses, putting millions out of work and disabling the economy. In this willful misconduct, they have had the cooperation of the big tech billionaires who have made obscene amounts of money from the movement of public life and commerce to their online platforms.\n\nThis is just the opening act in the global corporations’ move to impose what they call the Great Reset. They plan to monetize every aspect of our lives and to prevent us from engaging in behavior that they can’t profit from. They envision a world where we own nothing and control nothing, where we are powerless to act or interact except through their online platforms. They want us to be lonely, disconnected, depressed, sick and afraid, dependent on the corporations for everything.\n\nWhen we know where this is coming from, and where it is going, we can chart a course for effective resistance.\n\nThe best things in life are free: a smile, a hug, a helping hand, a healthy immune system, a well-informed opinion, a commitment to truth and justice for all.\n\nWe can dedicate ourselves to defending the things that they would destroy: independent businesses, local commerce, organic food, natural health, brick-and-mortar education and genuine human connection.\n\nIt’s time to #CorrectTheCount of deaths that are actually attributable to COVID.\n\nIt’s time to tell the truth about “adequate, approved, and available” #COVIDtreatments.\n\nAnd, it’s time to hold corrupt public health officials accountable for their #WillfulMisconduct.”", "opengraph": {"locale": "en_US", "type": "article", "title": "On Public Health Propaganda, Vaccines, and the Great Reset", "description": "Ronnie Cummins: As Nate and Alexis remind us, we have to talk about the Big Elephant in the room, an ever more powerful and monstrous public health elite, of unelected bureaucrats such as Anthony Fauci and billionaires, such as Bill Gates, dictating public policy and controlling how we live our everyday lives. These public health", "url": "https://organicconsumers.org/on-public-health-propaganda-vaccines-great-reset/", "site_name": "Organic Consumers", "article:publisher": "https://www.facebook.com/organicconsumers", "article:published_time": "2021-04-21T15:58:00+00:00", "image": "https://organicconsumers.org/wp-content/uploads/2022/01/OCA-Tomato-White-Text-200x90.png"}, "tags": [], "tweets": [], "movies": [], "links": ["<a href=\"#\" target=\"oca-linked\">TITLE ERROR</a>\n"], "authors": ["OCA"], "publish_date": "2021-04-21T15:58:00+00:00"}