{"result_id": "234013", "URL": "https://www.organicconsumers.org/news/fda-urged-publish-follow-studies-covid-19-vaccine-safety-signals", "timestamp": "2023-04-25 16:45:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://organicconsumers.org/wp-content/uploads/2022/02/cropped-OCAtomatotransparent-32x32.png", "canonical": "https://organicconsumers.org/fda-urged-to-publish-follow-up-studies-on-covid-19-vaccine-safety-signals/", "encoding": "utf-8"}, "image": null, "domain": "www.organicconsumers.org", "title": "FDA Urged To Publish Follow-up Studies on COVID-19 Vaccine Safety Signals", "cleaned_text": "The FDA has been criticised for taking more than a year to follow up a potential increase in serious adverse events in elderly people receiving Pfizer’s covid-19 vaccine, Maryanne Demasi reports\n\nIn July 2021 the US Food and Drug Administration (FDA) quietly disclosed findings of a potential increase in four types of serious adverse events in elderly people who had had Pfizer’s covid-19 vaccine: acute myocardial infarction, disseminated intravascular coagulation, immune thrombocytopenia, and pulmonary embolism.1 Little detail was provided, such as the magnitude of the increased potential risk, and no press release or other alert was sent to doctors or the public. The FDA promised it would “share further updates and information with the public as they become available.”\n\nEighteen days later, the FDA published a study planning document (or protocol) outlining a follow-up epidemiological study intended to investigate the matter more thoroughly.2 This recondite technical document disclosed the unadjusted relative risk ratio estimates originally found for the four serious adverse events, which ranged from 42% to 91% increased risk. (Neither absolute risk increases nor confidence intervals were provided.) More than a year later, however, the status and results of the follow-up study are unknown. The agency has not published a press release, or notified doctors, or published the findings by preprint or the scientific literature or updated the vaccine’s product label.", "opengraph": {"locale": "en_US", "type": "article", "title": "FDA Urged To Publish Follow-up Studies on COVID-19 Vaccine Safety Signals", "description": "The FDA has been criticised for taking more than a year to follow up a potential increase in serious adverse events in elderly people receiving Pfizer’s covid-19 vaccine, Maryanne Demasi reportsIn July 2021 the US Food and Drug Administration (FDA) quietly disclosed findings of a potential increase in four types of serious adverse", "url": "https://organicconsumers.org/fda-urged-to-publish-follow-up-studies-on-covid-19-vaccine-safety-signals/", "site_name": "Organic Consumers", "article:publisher": "https://www.facebook.com/organicconsumers", "article:published_time": "2022-11-22T22:22:04+00:00", "image": "https://organicconsumers.org/wp-content/uploads/2023/02/cvv_0-4.png", "image:width": "1200", "image:height": "630", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["//www.bmj.com/content/379/bmj.o2527\" target=\"oca-linked\">Read the Full Article</a>", "https://www.bmj.com/content/379/bmj.o2527#ref-1", "https://www.bmj.com/content/379/bmj.o2527#ref-2"], "authors": ["OCA"], "publish_date": "2022-11-22T22:22:04+00:00"}