{"result_id": "234015", "URL": "https://organicconsumers.org/utterly-obscene-just-8-pfizer-and-moderna-investors-became-10-billion-richer-after-omicron/", "timestamp": "2023-04-25 16:45:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://organicconsumers.org/wp-content/uploads/2022/02/cropped-OCAtomatotransparent-32x32.png", "canonical": "https://organicconsumers.org/utterly-obscene-just-8-pfizer-and-moderna-investors-became-10-billion-richer-after-omicron/", "encoding": "utf-8"}, "image": null, "domain": "organicconsumers.org", "title": "'Utterly Obscene': Just 8 Pfizer and Moderna Investors Became $10 Billion Richer After Omicron Emerged", "cleaned_text": "In the first week that the Omicron variant sparked global fears of a new wave of infections, a small handful of investors and executives with Pfizer and Moderna—currently the world's preeminent makers of Covid-19 vaccines—saw over $10 billion in new wealth, with the Moderna's CEO alone adding over $800 million to his personal fortune.\n\n“Pharma execs and shareholders are making a killing from a crisis they helped to create,” said one justice campaigner.\n\nIn the first week that the Omicron variant sparked global fears of a new wave of infections, a small handful of investors and executives with Pfizer and Moderna—currently the world’s preeminent makers of Covid-19 vaccines—saw over $10 billion in new wealth, with the Moderna’s CEO alone adding over $800 million to his personal fortune.\n\n“When is a new covid variant good news? When you’re a pharma shareholder, obviously.”\n\nBased on data compiled by Global Justice Now and released Saturday, “just 8 top Pfizer and Moderna shareholders” added a combined $10.31 billion to their fortunes last week after stock prices soared in response to the emergence of Omicron. According to a statement by the group:\n\nModerna’s shares skyrocketed after the announcement and settled at $310.61/share on Wednesday 1 December, up 13.61% from $273.39/share since Wednesday 24 November, the day before the announcement. Pfizer’s shares rose by 7.41% from $50.91/share to $54.68/share. Moderna’s CEO, Stephane Bancel, personally became more than $824m richer in the week after the announcement, with the value of his shares rising from $6,052,522,978 to $6,876,528,630. He sold off 10,000 shares for $319 each on 26 November, the day after the variant was announced, cashing out $3.19 million. At close of business on Tuesday, Bancel’s shares had grown by $1.7 billion since the announcement, before falling after the company lost a legal dispute over patents. Bancel has refused to share the recipe for Moderna’s vaccine with the World Health Organisation to help scale-up manufacturing of mRNA vaccines through its new hub in South Africa. WHO scientists are now trying to reverse-engineer the vaccine. His company is also waging a legal battle to erase the role of massive public funding and public scientists in developing the jab.\n\nWith nations in the European Union, the United Kingdom, and others continuing to block a demand for a vaccine patent waiver at the World Trade Organization, public health campaigners have hammered government leaders for doing the bidding of the pharmaceutical industry. Anger has become especially harsh because the emergence of new and dangerous variants was predicted as the likely outcome if nations did not move swiftly to vaccinate the world by making shots universally available.\n\n“Pharmaceutical companies knew that grotesque levels of vaccine inequality would create prime conditions for new variants to emerge. They let Covid-19 spread unabated in low and middle-income countries.”\n\n“Pharmaceutical companies knew that grotesque levels of vaccine inequality would create prime conditions for new variants to emerge,” said Tim Bierley, pharma campaigner at Global Justice Now. “They let Covid-19 spread unabated in low and middle-income countries. And now the same pharma execs and shareholders are making a killing from a crisis they helped to create. It’s utterly obscene.”\n\n“At every turn,” he continued, “these companies have obstructed efforts to more equitably distribute vaccines around the world. They have made more than enough money from the pandemic, selling two of the most lucrative drugs in history. It’s time to hand over the recipe for these essential medicines to the WHO so we can finally end this pandemic.”\n\nWhile a scheduled decision on the WTO patent waiver was postponed last week, progressives worldwide have insisted that there will be no end to the global pandemic until vaccine apartheid is brought to an end.\n\nNobel economist Joseph Stiglitz and trade expert Lori Wallach argued in an op-ed last week that the pandemic cannot be defeated until the waiver is approved.\n\n“As the Omicron variant shows, as long as there are raging outbreaks anywhere, Covid-19 will mutate and the possibility of more infectious or deadly strains increases,” the pair wrote. “That’s why, unless people everywhere are vaccinated, we face the prospect of an endless pandemic.”\n\nWhen the “underlying problem is a lack of global supply,” they argued—and more vaccines and boosters will be needed to fend off variants—the WTO waiver “is an obvious way of increasing supply and helping put an end to the pandemic for good.”\n\nAnd as Bierley said, “It’s long past time for the UK and the EU to stand on the side of global health instead of vaccine billionaires—and get behind an intellectual property waiver on Covid-19 vaccines, tests, and treatments.”", "opengraph": {"locale": "en_US", "type": "article", "title": "'Utterly Obscene': Just 8 Pfizer and Moderna Investors Became $10 Billion Richer After Omicron Emerged", "description": "\"Pharma execs and shareholders are making a killing from a crisis they helped to create,\" said one justice campaigner.\r\n\r\n\r\nIn the first week that the Omicron variant sparked global fears of a new wave of infections, a small handful of investors and executives with Pfizer and Moderna—currently the world's preeminent makers of", "url": "https://organicconsumers.org/utterly-obscene-just-8-pfizer-and-moderna-investors-became-10-billion-richer-after-omicron/", "site_name": "Organic Consumers", "article:publisher": "https://www.facebook.com/organicconsumers", "article:published_time": "2021-12-07T19:32:29+00:00", "article:modified_time": "2022-10-27T18:06:15+00:00", "image": "https://organicconsumers.org/wp-content/uploads/2021/12/m_1.png", "image:width": "1200", "image:height": "630", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://docs.google.com/spreadsheets/d/12r3tikFLQsFlhp4qvYybwGCeJ4RymUPh/edit#gid=2138271628", "https://www.commondreams.org/views/2021/12/01/global-pandemic-will-rage-until-wto-approves-vaccine-patent-waiver", "https://www.commondreams.org/news/2021/12/05/utterly-obscene-just-8-pfizer-and-moderna-investors-became-10-billion-richer-after"], "authors": ["OCA"], "publish_date": "2021-12-07T19:32:29+00:00"}