{"result_id": "234018", "URL": "https://www.organicconsumers.org/news/cdc-vaccine-adjuvant-contributes-asthma-kids", "timestamp": "2023-04-25 16:45:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://organicconsumers.org/wp-content/uploads/2022/02/cropped-OCAtomatotransparent-32x32.png", "canonical": "https://organicconsumers.org/cdc-vaccine-adjuvant-contributes-to-asthma-in-kids/", "encoding": "utf-8"}, "image": null, "domain": "www.organicconsumers.org", "title": "CDC: Vaccine Adjuvant Contributes to Asthma in Kids", "cleaned_text": "…but public health “experts” say no changes are needed to the childhood vaccine schedule. Huh?\n\nA recently published, CDC-funded study was conducted in response to a call by the National Academies of Sciences, Engineering, and Medicine in 2013 for more research into the safety of vaccines, including their use of aluminum as an adjuvant. The results show that children vaccinated with most or all of the recommended aluminum-containing vaccines had a 36 percent higher risk of being diagnosed with persistent asthma than kids who got fewer vaccines. Yet proponents of vaccines were quick to dismiss the results, lest anything disrupt the status quo and threaten the profits of vaccine-makers. It shows that reasonable debate about the safety and benefits of vaccines is next to impossible in this country—which is why we must continue to fight for the right to make our own decisions about these treatments.\n\nThe study authors looked at health data from 326,991 children born between the start of 2008 and the end of 2014, who received care at seven sites across the U.S. The authors found “a positive association between cumulative vaccine-associated aluminum before age 24 months and persistent asthma at age 24 through 59 months among children with and without eczema.”\n\nThe reaction of Dr. Paul Offit, a longtime proponent of vaccines, says volumes about the state of debate on vaccines in this country. Dr. Offit told the Associated Press that the study’s results have “added nothing to our understanding of vaccines and asthma.” This is the same man who famously said that babies could tolerate “10,000 vaccines at once.”", "opengraph": {"locale": "en_US", "type": "article", "title": "CDC: Vaccine Adjuvant Contributes to Asthma in Kids", "description": "…but public health “experts” say no changes are needed to the childhood vaccine schedule. Huh?A recently published, CDC-funded study was conducted in response to a call by the National Academies of Sciences, Engineering, and Medicine in 2013 for more research into the safety of vaccines, including their use of aluminum as an", "url": "https://organicconsumers.org/cdc-vaccine-adjuvant-contributes-to-asthma-in-kids/", "site_name": "Organic Consumers", "article:publisher": "https://www.facebook.com/organicconsumers", "article:published_time": "2022-10-28T14:48:14+00:00", "image": "https://organicconsumers.org/wp-content/uploads/2023/02/v_3-5.png", "image:width": "640", "image:height": "336", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["//anh-usa.org/cdc-vaccine-adjuvant-contributes-to-asthma-in-kids/\" target=\"oca-linked\">Read the Full Article</a>", "https://els-jbs-prod-cdn.jbs.elsevierhealth.com/pb/assets/raw/Health%20Advance/journals/acap/Aluminium_Exposure_Article-1664288052690.pdf", "http://pediatrics.aappublications.org/content/109/1/124.full"], "authors": ["OCA"], "publish_date": "2022-10-28T14:48:14+00:00"}