{"result_id": "235031", "URL": "https://www.organicfacts.net/social-distance-mask-covid.html", "timestamp": "2023-04-25 16:46:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/social-distance-mask-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "Social Distancing, Face & Eye Masks Reduce COVID Spread: Lancet", "cleaned_text": "How effective are preventive measures like social distancing in limiting the spread of COVID-19? A comprehensive review gives us definitive data on the effectiveness of such measures in curtailing community spread. Published in The Lancet, this first wide-ranging review of available studies show that elementary measures like social distancing, face masks, and eye coverings can help prevent the spread of the infection. However, none of these methods provided complete protection. [1]\n\nThe study included data on SARS-COV-2 which causes COVID-19 as well as betacoronaviruses which is responsible for SARS and MERS. Using WHO-specific and COVID-19 specific sources, the research team picked 172 observational studies from 16 countries and 6 continents. This included studies in healthcare and non-healthcare settings.\n\nThe findings support that physical distancing of 1 meter was associated with a reduction of the infection. However, 2 meters was found more effective. Wearing a face mask protected healthcare workers and the general public from the infection. An eye mask further added to their protection. However, even when used properly and in combination, these measures were not foolproof.\n\nThis study supported the WHO guidance on presenting the spread of COVID-19 and may help conflicting positions on preventive measures adopted by certain countries. These simple measures could be adopted as a preventive strategy while a vaccine and treatments are developed, concluded the study.\n\nCOVID-19 is an emerging, rapidly evolving situation.\n\n Get the latest public health information from CDC.\n\n Get the latest research from NIH. [2] [3]", "opengraph": {"locale": "en_US", "type": "article", "title": "Social Distancing, Face & Eye Masks Reduce COVID Spread: Lancet | Organic Facts", "description": "How effective are preventive measures like social distancing in limiting the spread of COVID-19? A comprehensive review gives us definitive...", "url": "https://www.organicfacts.net/social-distance-mask-covid.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/distancetwo.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/distancetwo.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://doi.org/10.1016/S0140-6736(20)31142-9", "https://www.nih.gov/coronavirus", "https://www.coronavirus.gov", "https://www.nih.gov/coronavirus"], "authors": [], "publish_date": "June 02, 2020"}