{"result_id": "235040", "URL": "https://www.organicfacts.net/pregnancy-seafood.html", "timestamp": "2023-04-25 16:46:16 CEST+0200", "meta": {"description": "Well cooked oily fishes such as salmon, & trout provide nutrients like omega 3 fatty acids & calcium during pregnancy. Do avoid raw fish, tuna, & processed sea food.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/pregnancy-seafood.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "List of Safe & Unsafe Seafood to Eat During Pregnancy", "cleaned_text": "It is said that mothers who ate seafood, such as fish, during pregnancy have given birth to children with higher IQs (Intelligent Quotient), as compared to those who did not eat fish. This is due to the fact that seafood is a great source of protein and other nutrients: vitamins (vitamin D and choline), minerals (iron, zinc, iodine, copper, and selenium). In addition, it contains polyunsaturated Omega-3 fatty acids such as docosahexaenoic acid (DHA) and eicosapentaenoic acid (EPA), which are very helpful in the mental development of the child. [1]\n\nDuring pregnancy, the expecting mother needs to be careful in terms of what she eats for a healthy and safe pregnancy. Seafood (fish and shellfish) plays an important role in a pregnant woman’s diet as it has high nutritional benefits. Research studies indicate that the intake of seafood decreases the risk of premature births and lower weight of the baby. [2]\n\nThe following types of seafood is safe to eat by expecting mothers:\n\nWell-cleaned and properly cooked shellfish (such as prawns) are safe to eat. They are a good source of protein and omega-3 fatty acids, which help in the overall development of the baby, especially the brain, nerves, and eyes. It also contains a low level of saturated fats. Pregnant women can have prawn stir-fry or crab cakes as some healthy recipes. Therefore, pregnant women don’t need to miss out on shellfish until it is properly cooked. [3]\n\nAlthough they should be careful, since shellfish can contain some environmental pollutants – PCBs (polychlorinated biphenyls), dioxins, pesticides, and other contaminants. The variety includes turbot, bream, halibut, dogfish (or rock salmon or Huss), sea bass, and crab. It is a good idea to limit its intake to two portions a week.\n\nSmoked seafood and fish are both very rich in the nutrients required during pregnancy. It contains vitamins A and D, as well as proteins. Vitamins A and D are present in fish liver oil. They are also a rich source of vitamin B complex, especially B6, B12, and niacin. It has a very low fat content. It is safe to eat smoked fish during pregnancy, since it is not “raw”. Parasites, if there are any, are killed during the smoking of the fish. Smoked seafood and fish should be consumed during pregnancy, as they are a good source of calcium, iron, iodine, phosphorous, zinc, potassium, selenium, and omega-3 fatty acids, which are required from the development of the baby’s brain, eyes, and nervous system.\n\nConsumption of only canned smoked seafood is recommended. Also, pregnant women should avoid eating seafood such as shark, marlin and sword fish etc. These varieties may contain methyl mercury, which is very poisonous. Also, this kind of seafood may have listeria bacteria (which can cause listeriosis – a dangerous condition during pregnancy). This disease can lead to miscarriages, still births, and other complications related to pregnancy. [4] [5]\n\nPregnant women should be careful when buying seafood. It might be preserved along with raw fish, causing contamination and the transfer of bacteria to occur.\n\nOily fish such as herring, pilchards, mackerel, sardines, and salmon are a good source of essential fats required for pregnant women. They are a good source of various essential vitamins, such as calcium, nutrients, and omega-3 fatty acids required for the developing baby and the mother. Therefore, it is important to include it in the meal. The variety includes pilcards, fresh tuna, eel, salmon, herring, mackerel, trout, sardines, kippers, whitebait, and anchovies. [6] [7]\n\nOily fish may contain environmental pollutants – PCBs (polychlorinated biphenyls), dioxins, pesticides, and other contaminants. Therefore, pregnant women should limit the intake of these fishes to two portions in a week.\n\nIt is safe to eat sushi made from previously frozen fish. It is important to freeze the fish, since it kills parasites such as tape worms. These parasites can make you ill if the fish is not frozen and consumed directly. The raw fish used to make sushi should be frozen at -20 degrees for a minimum of 24 hours. The use of fresh fish to prepare sushi may be risky during pregnancy. One may choose fully cooked sushi varieties that are available. If you prepare sushi for yourself, make sure to freeze the fish for 24 hours, and in case you buy it from a shop or restaurant where they make sushi, you may ask the staff if you have any concerns. Sushi made from smoked salmon does not need to be frozen before consuming it, since smoking kills any parasites in the fish. Apart from sushi, other dishes could also be prepared from raw fish and could be consumed by pregnant women, until it has been frozen properly. Salting or making pickles of the raw food is also safe to eat. [8]\n\nFish Oil: Fish oil is rich in omega-3 fatty acids, which also help women during pregnancy. The intake of fish oil during pregnancy reduces the risk of various complications such as early delivery, high blood pressure, and miscarriages. Fish oil can be obtained by either eating fish or consuming supplements. The fish oil is made from fish such as salmon, cod liver, whale blubber, and tuna.\n\nThe following types of seafood are unsafe to eat during pregnancy:\n\nMercury severely affects the development of babies, especially in terms of their nervous system. Mostly, all the fishes contain some level of mercury. Some fishes such as tilefish, escolar, swordfish, orange roughy, king mackerel, marlin, and shark may contain very high levels of mercury. Therefore, they should not be consumed by pregnant women. It is advised that even women who are planning to become pregnant should stop themselves from eating these fish for a few months. Mercury absorbed by the fish and shellfish can accumulate in the body of pregnant women. It takes a lot of time to naturally flush it out from the body.\n\nMercury is released into the air through pollution and is also present in our environment. It is a liquid form of metal. Mercury, when it falls in water, gets converted to methyl mercury. It is a toxin that a fish and shellfish absorb through their food. This methylmercury badly affects the nervous system of babies and young children. Mercury in seafood is not of concern for adults. If a pregnant woman regularly consumes fish with high levels of mercury, it can accumulate in the bloodstream. This could negatively affect baby’s developing brain and nervous system. It could also lead to reproductive failure, pre-term birth, and miscarriage, as well as physical and developmental delays in babies. [9]\n\nEating small amounts of raw seafood during pregnancy can cause food poisoning, since it can contain harmful bacteria, viruses, or parasites such as tapeworms, toxoplasmosis, salmonella, and flukes. Food poisoning may or may not harm the baby, although it can harm the health of pregnant women. Parasites deplete the essential nutrients required by an expecting mother and the baby. Seafood should be frozen properly and cooked well before eating. This removes viruses, parasites, and bacteria, and also makes the seafood safe to eat.\n\nTuna usually contains high levels of mercury. Albacore (or white) tuna and tuna steaks have higher mercury levels (almost three times) as compared to canned light tuna. Although there is a higher limit for tuna consumption that is safe. This limit is 12 ounces for light tuna and 6 ounces for albacore per week. This limit is not applicable for canned tuna. There are different species of tuna that are low in mercury, such as yellowfin, tongol, and skipjack. Pregnant women do not need to limit their consumption of canned tuna.\n\nPregnant women should avoid unusually high sodium intake, since it can lead to swelling or increased blood pressure. This can cause illness to the mother and can harm the baby. The processing of seafood involves the addition of salt. This makes the sodium content in the food very high. Therefore, it should be avoided.\n\nRecommended Portion of Seafood: Pregnant women can eat 2 to 3 meals (that is up to 12 ounces – 340 grams) of fish and shellfish a week. Different kinds of fish and shellfish could be mixed and consumed. Canned light tuna, shrimp, crab, trout, herring, Pollock (Boston blue fish), anchovy, char, hake, mullet, haddock, catfish, smelt, cod, tilapia, scallops, flounder, clams, sole, oysters, crayfish, croaker, sardines, whitefish, and salmon are low in mercury content and are therefore safe to eat during pregnancy. Pregnant women should consume the same variety of fish or shellfish only once per week to be safe.", "opengraph": {"locale": "en_US", "type": "article", "title": "List of Safe & Unsafe Seafood to Eat During Pregnancy | Organic Facts", "description": "Well cooked oily fishes such as salmon, & trout provide nutrients like omega 3 fatty acids & calcium during pregnancy. Do avoid raw fish, tuna, & processed sea food.", "url": "https://www.organicfacts.net/pregnancy-seafood.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:tag": "prawn", "article:section": "Pregnancy", "article:published_time": "2013-02-12T19:47:19-08:00", "article:modified_time": "2020-02-19T12:32:37-08:00", "updated_time": "2020-02-19T12:32:37-08:00", "image": "https://www.organicfacts.net/wp-content/uploads/seafoods.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/seafoods.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.organicfacts.net/fish.html", "https://www.organicfacts.net/proteins.html", "https://www.organicfacts.net/health-benefits/vitamins/health-benefits-of-vitamin-d.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-iron.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-zinc.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-iodine.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-copper.html", "https://www.organicfacts.net/selenium.html", "http://www.hc-sc.gc.ca/fn-an/pubs/nutrition/omega3-eng.php", "http://www.bmj.com/content/324/7335/447", "https://www.organicfacts.net/saturated-fat.html", "https://www.organicfacts.net/health-benefits/animal-product/health-benefits-crab.html", "http://www.seafish.org/eating-seafood/seafood-for-health/seafood-during-pregnancy", "https://www.organicfacts.net/salmon.html", "https://www.organicfacts.net/health-benefits/vitamins/stocking-up-on-vitamin-b-rich-foods.html", "https://www.organicfacts.net/health-benefits/vitamins/vitamin-b3-or-niacin.html", "https://www.organicfacts.net/health-benefits/other/health-benefits-of-smoking.html", "https://www.organicfacts.net/health-benefits/minerals/calcium.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-potassium.html", "http://www.nhs.uk/conditions/pregnancy-and-baby/pages/foods-to-avoid-pregnant.aspx", "http://www.babymed.com/food-and-nutrition/smoked-seafood-safe-during-pregnancy", "http://www.nhs.uk/conditions/pregnancy-and-baby/pages/foods-to-avoid-pregnant.aspx", "https://www.organicfacts.net/herring.html", "https://www.organicfacts.net/health-benefits/animal-product/health-benefits-of-sardines.html", "http://www.niams.nih.gov/Health_Info/Bone/Bone_Health/Pregnancy/default.asp", "https://www.organicfacts.net/health-benefits/animal-product/health-benefits-of-anchovies.html", "http://www.seafish.org/eating-seafood/seafood-for-health/seafood-during-pregnancy", "http://www.niams.nih.gov/Health_Info/Bone/Bone_Health/Pregnancy/default.asp", "https://www.organicfacts.net/health-benefits/other/sushi.html", "https://www.organicfacts.net/health-benefits/other/health-benefits-of-pickles.html", "http://www.nhs.uk/conditions/pregnancy-and-baby/pages/foods-to-avoid-pregnant.aspx", "https://www.organicfacts.net/health-benefits/oils/health-benefits-of-fish-oil.html", "https://www.organicfacts.net/essential-oils-high-blood-pressure.html", "http://www.nhs.uk/conditions/pregnancy-and-baby/pages/foods-to-avoid-pregnant.aspx", "https://www.organicfacts.net/health-benefits/minerals/sodium.html", "https://www.organicfacts.net/health-benefits/other/health-benefits-of-salt.html", "https://www.organicfacts.net/health-benefits/animal-product/health-benefits-of-shrimp.html", "https://www.organicfacts.net/haddock.html", "https://www.organicfacts.net/health-benefits/animal-product/tilapia.html", "https://www.organicfacts.net/health-benefits/animal-product/oysters.html"], "authors": [], "publish_date": "2013-02-12T19:47:19-08:00"}