{"result_id": "235021", "URL": "https://www.organicfacts.net/cancers-preventable-says-study", "timestamp": "2023-04-25 16:46:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/cancers-preventable-says-study", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "Almost Half of the Cancers Are Preventable!", "cleaned_text": "A new study from the American Cancer Society says more than 4 in 10 cancers can be avoided\n\nThe cancer epidemic is getting worse in the US, but it can be stopped. The American Cancer Society has listed some easy ways to make sure that you can steer clear of this deadly disease.\n\nHere is the recommended list:\n\nThese findings were based on studying risk factors to overall cancer cases and deaths in 2014. Cigarette smoking topped the list – it accounted for 19% of all cancer cases and nearly 29% of cancer deaths. Lung cancer was at the top for both men and women, with more than 132,960 deaths. [1]\n\nExcess body weight was the second highest contributor to cancer. It was responsible for 7.8% of cancer cases and 6.5% of deaths. Drinking alcohol was a close third on the list of cancer-causing factors as it was linked to 5.6% of cancer cases and 4% of deaths.\n\nWhen the researchers combined excess body weight, alcohol intake, poor diet, and physical inactivity, they found this set of risks was responsible for a total of about 18% of cancer cases and 16% of deaths.\n\nThe recommended dietary changes to prevent cancer include increasing daily servings of fruits and vegetables, reducing the consumption of red meat and eating foods high in calcium and fiber. Recently, a study from the Centers for Disease Control and Prevention showed that only one in 10 Americans eat the recommended daily amount of fruits and vegetables. [2]\n\nCancer is among the leading causes of death worldwide. In 2012, there were 14 million new cases and 8.2 million cancer-related deaths worldwide. In the next two decades, the number of new cancer cases will rise to 22 million. [3]\n\nAccording to the study, the 5 top tips to reduce your cancer risk are:\n• Get help on how to kick the tobacco habit\n• Learn how to protect yourself from harmful UV radiation\n• Inform yourself about the possible infections that are associated with cancer\n• Make sure your family members who can benefit, get the HPV vaccine", "opengraph": {"locale": "en_US", "type": "article", "title": "Almost Half of the Cancers Are Preventable! | Organic Facts", "description": "A new study from the American Cancer Society says more than 4 in 10 cancers can be avoided The cancer...", "url": "https://www.organicfacts.net/cancers-preventable-says-study", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/alternativecancertreatments.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/alternativecancertreatments.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cancer.org/latest-news/more-than-4-in-10-cancers-and-cancer-deaths-linked-to-modifiable-risk-factors.html", "https://www.cdc.gov/media/releases/2017/p1116-fruit-vegetable-consumption.html", "https://www.cancer.gov/about-cancer/understanding/statistics", "https://www.cancer.org/healthy/stay-away-from-tobacco.html", "https://www.cancer.org/cancer/cancer-causes/infectious-agents.html", "https://www.cancer.org/cancer/cancer-causes/infectious-agents/hpv/what-parents-should-know-about-the-hpv-vaccines.html"], "authors": [], "publish_date": "November 22, 2017"}