{"result_id": "235044", "URL": "https://www.organicfacts.net/childhood-vaccines-covid-complications.html", "timestamp": "2023-04-25 16:46:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/childhood-vaccines-covid-complications.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "Childhood Vaccines May Lower COVID Complications", "cleaned_text": "What if some childhood vaccines could act as a natural inhibitor for the COVID-19 virus? In a paper published in the American Society of Microbiology, two American scientists proposed that the administration of unrelated live attenuated vaccines like MMR could prevent the complications associated with COVID-19. This could help in significantly reducing related morbidities. [1]\n\nThe authors pointed to the increasing evidence from across the world that shows positive results with similar live attenuated vaccines, like BCG. These vaccines can activate the nonspecific immune cells in the body, which in turn trigger the white blood cells in the immune system. This can help in creating an effective defense in case of unrelated infections.\n\nMany countries are already experimenting with this strategy. The authors indicated at least 6 clinical trials that are taking place in Australia, Europe, and the US. These trials involve BCG, another common live attenuated vaccine administered in childhood. However, BCG vaccination is not conducted in the US. Hence, the authors proposed MMR vaccine as an alternative. They supported this argument with the recent case of COVID-19 spread among the 955 sailors on the U.S.S. Roosevelt. These sailors reported mild symptoms with only one hospitalization. MMR vaccine, given to US Navy recruits, was commonly held as the reason.\n\nThe authors proposed a randomized clinical trial on MMR Vs BCG for COVID-19 infections. Finally, they recommended MMR booster dose for high-risk workers and first responders.", "opengraph": {"locale": "en_US", "type": "article", "title": "Childhood Vaccines May Lower COVID Complications | Organic Facts", "description": "What if some childhood vaccines could act as a natural inhibitor for the COVID-19 virus? In a paper published in...", "url": "https://www.organicfacts.net/childhood-vaccines-covid-complications.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/malevaccine.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/malevaccine.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://doi.org/10.1128/mBio.00907-20"], "authors": [], "publish_date": "June 30, 2020"}