{"result_id": "235043", "URL": "https://www.organicfacts.net/social-distancing-self-quarantine.html", "timestamp": "2023-04-25 16:46:17 CEST+0200", "meta": {"description": "In these unprecedented times brought on by a global pandemic, city streets seem quieter. Public health officials continually refer to social distancing and self-quarantine.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/social-distancing-self-quarantine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "Social Distancing and Self-Quarantine: Tips for Self-Care", "cleaned_text": "In these unprecedented times brought by a global pandemic, the city streets seem quieter and markets may be shut. Due to the outbreak of COVID-19 numbers continuing to increase worldwide, government health officials are constantly persuading everyone to follow social distancing and self-quarantine. Also, there is plenty of talk about these terms – most of which are new concepts to the general public and how they differ from one another. There is a social media boom on everyone sharing their idea of making the most of maintaining social distance and self-quarantine. [1]\n\nAs it sometimes is difficult to understand the differences between the two and what each term entails, everyone is following these measures religiously. Isn’t this cool? However, the most important question is – what exactly are these measures and why are they important? Let’s find out.\n\nWhat is Social Distancing and Self-Quarantine?\n\nSocial distancing and self-quarantine are necessary steps in flattening the curve. But these measures can have a huge impact on one’s mental health. Both can make us feel less productive and lonely. So, self-care must be a priority during this crisis. Now, let’s get into the basics.\n\nSocial distancing is a way to prevent people from being near one another which is enough to spread an infectious disease. In such a scenario, schools and other gathering places such as movie theatres or parks may close. Also, sports events and religious services are canceled.\n\nA 2006 study published in the Emerging Infectious Diseases journal shows that social distancing policies are sketched to lessen the rise of pandemic flu without the aid of vaccination or over-the-counter drugs. This means during a global health crisis, social distancing plays a pivotal role in fighting a pandemic as much as vaccination does. [2]\n\nAlong with regular hand washing and not shaking hands to avoid the spread of disease, people must stay at least 6 feet apart from others. Practicing social distance helps reduce the chances of catching an infection.\n\nSelf-quarantine is a special form of social distancing and plays an effective role during an outbreak. According to a recent study, one of the most effective mechanisms to contain the spread of an infectious disease is the implementation of quarantine policies. [3]\n\nSelf-quarantine is when you feel fine but distance yourself due to the possibility of being exposed to a disease. Self-quarantine is a restrictive act, wherein a person that feels unwell stays home and does not leave for a fortnight. During those fourteen days, the quarantined individual should check their health status twice a day and monitor symptoms which could include fever, coughing, or breathing problems.\n\nThose in self-quarantine can go outside yet avoid being in crowded places. It is recommended that any movement like grocery shopping and other errands should be restricted. If ever you leave the house, it is advisable to wear a mask.\n\nAs the world grapples with a global health pandemic, health authorities advise that social distancing and self-quarantine practices are crucial steps to flatten the curve.\n\nHere are some DIY ideas to take care of your mind and body while staying indoors during a health crisis.\n• Take-up meditation: If you feel anxious about the current health scenario, you are not alone and it is okay to feel worried. Practicing mindfulness or taking up meditation is a good way to let go of the overwhelmed feeling and stress.\n• Try and maintain a fitness regime: Don’t let staying at home keep you from being active. Follow a strict fitness schedule, eat healthy food, and follow good hygiene.\n• Pamper yourself to a DIY beauty treatment: Make a DIY face mask or an in-house manicure.\n• Get plenty of sleep: Studies indicate the best way to boost immunity is to ensure you are getting enough sleep.\n• Practice gratitude: Maintain a gratitude journal and remember all the good things that are present around you.\n\nFollowing a period of quarantine or isolation, you may feel mixed emotions, including relief and gratitude or loneliness and frustration. During such a time, it is most important to look after yourself and avoid being in a negative state of mind.\n\nAs they say, bad times don’t last. So, this too shall pass.", "opengraph": {"locale": "en_US", "type": "article", "title": "Social Distancing and Self-Quarantine: Tips for Self-Care | Organic Facts", "description": "In these unprecedented times brought on by a global pandemic, city streets seem quieter. Public health officials continually refer to social distancing and self-quarantine.", "url": "https://www.organicfacts.net/social-distancing-self-quarantine.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:tag": "social distancing", "article:section": "Health And Lifestyle", "article:published_time": "2020-04-03T11:55:27-07:00", "article:modified_time": "2020-05-26T12:00:58-07:00", "updated_time": "2020-05-26T12:00:58-07:00", "image": "https://www.organicfacts.net/wp-content/uploads/mentalhealtheightyfive.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/mentalhealtheightyfive.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public", "https://www.organicfacts.net/mental-health-how-to-deal.html", "https://www.organicfacts.net/health-benefits/other/health-benefits-of-playing-sports.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3372334/", "https://pubmed.ncbi.nlm.nih.gov/29390620/", "https://www.organicfacts.net/fever.html", "https://www.organicfacts.net/mindfulness.html", "https://www.organicfacts.net/health-benefits/other/meditation.html", "https://www.organicfacts.net/healthy-foods.html"], "authors": [], "publish_date": "2020-04-03T11:55:27-07:00"}