{"result_id": "235023", "URL": "https://www.organicfacts.net/cushing-disease-dogs.html", "timestamp": "2023-04-25 16:46:08 CEST+0200", "meta": {"description": "A condition which leads to the overproduction of a steroid hormone, cortisol, Cushing's disease in dogs or hyperadrenocorticism, usually affects middle-aged or older dogs.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/cushing-disease-dogs.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "Cushing's Disease in Dogs: Symptoms & Treatments", "cleaned_text": "Often confused as a condition only occurring in humans, Cushing’s disease in dogs is more than just common. In this article, we cover what is Cushing disease in dogs, its symptoms, treatments, and prognosis. Read ahead.\n\nWhat is Cushing’s Disease in Dogs?\n\nA condition which leads to the overproduction of a steroid hormone, cortisol, Cushing’s disease in dogs or hyperadrenocorticism, usually affects middle-aged or older dogs.\n\nCortisol is a hormone produced by the endocrine system in the body; it helps in the management and regulation of stress and the immune system. Although good for the body at optimum levels, an excess of this hormone, as in the case of Cushing’s disease in dogs, can lead to a lot of damage. It can be caused by taking high levels of any steroid dog medicine for a long time, say for the treatment of an immune system disorder or allergies. It can also be caused by the growth of a benign tumor on either side of the pituitary or the adrenal glands, according to a report published by the Bluecross. [1]\n\nCushing’s disease (CD) in dogs often goes unnoticed as its symptoms may get mistaken for the common sign of aging. As it usually affects older than the age of eight, by the time the dog owner/family realizes that their dog has CD, it already takes on to its advanced form. This makes it all the more necessary to recognize the symptoms.\n\nThere are many tell-tale signs and symptoms of Cushing’s disease in dogs, according to a report published by the Washing State University. Let us take a detailed look at them below. [2]\n• Hair loss on the body (not on the legs and head)\n• Excessive urination, also known as polydipsia and polyuria (PU/PD)\n\nWhen left untreated, it may also give rise to more symptoms, such as the following.\n• Weakness in the muscles and bones\n\nIf you observe these symptoms in your dogs, then please go to a veterinarian and get a proper medical diagnosis done.\n\nThere are three treatment options available for the treatment of Cushing’s disease in dogs. They include oral medication treatment, radiation therapy, and even surgery in some cases.\n\nIf your dog has been diagnosed with pituitary-dependent Cushing’s disease, then oral medication such as Vetoryl (trilostane) or Mitotane may be prescribed to him/her for a lifetime. It works by reducing the cortisol production in the adrenal glands.\n\nThe oral treatment, also known as induction, is given daily for about a week, after which the dosage of these drugs is significantly reduced as they can have severe side effects on your dogs. This makes it crucial to keep a watch on your dogs, while they are on them. Even after the treatment, some dogs can go into relapse and again start to develop the symptoms of the disease. It is important to consult a veterinarian before you decide on the right treatment or drug for your dog. [3]\n\nIn order to reduce the size of a small pituitary tumor, the veterinarian may prescribe radiation therapy. It helps with the symptoms of pituitary-dependent Cushing’s disease. Again, close monitoring is required in case of chemotherapy or radiation-related treatments as per the FDA. [4]\n\nAlthough not the most widely available option, if the disease is adrenal-dependent, research says that it can only be treated by removing the benign tumor through surgery. If the tumor is malignant, it can spread to the other parts of the body, in which case the surgery might not help. In the case of a pituitary tumor, transsphenoidal surgery is used. It involves the use of an exoscope to reach the pituitary through the mouth. Surgical removal of the tumor eliminates the need for lifelong medication. [5]\n\nThere is no apparent cure for Cushing’s disease in dogs, although treatment and control of the condition are possible if the tumor is small. You can see the signs disappearing quickly after the treatment begins. While symptoms like water and appetite consumption get better within a few weeks, full recovery of the fur takes a few months, as per a report published by the American College of Veterinary Internal Medicine. In the case of a large tumor, the dog has a lesser chance of getting treated. There are also cases where the tumor may be malignant, for which the prognosis is deemed poor. [6] [7]\n\nNote: Please consult a medical practitioner or veterinarian in case you observe the symptoms of Cushing’s disease in your dog. It is only after a series of blood tests, ultrasounds, and other tests that you can diagnose the condition for sure.", "opengraph": {"locale": "en_US", "type": "article", "title": "Cushing's Disease in Dogs: Symptoms & Treatments | Organic Facts", "description": "A condition which leads to the overproduction of a steroid hormone, cortisol, Cushing's disease in dogs or hyperadrenocorticism, usually affects middle-aged or older dogs.", "url": "https://www.organicfacts.net/cushing-disease-dogs.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:section": "Dog Care", "article:published_time": "2019-08-22T12:08:41-07:00", "article:modified_time": "2020-03-20T10:52:08-07:00", "updated_time": "2020-03-20T10:52:08-07:00", "image": "https://www.organicfacts.net/wp-content/uploads/dogplaying.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/dogplaying.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.organicfacts.net/allergies.html", "https://www.bluecross.org.uk/pet-advice/cushings-disease-in-dogs", "https://www.vetmed.wsu.edu/outreach/Pet-Health-Topics/categories/diseases/cushing'%20s-disease", "https://www.organicfacts.net/hair-loss.html", "https://www.organicfacts.net/health-benefits/essential-oils/healthy-skin.html", "https://www.organicfacts.net/health-benefits/other/health-benefits-of-walking.html", "https://www.organicfacts.net/diabetes.html", "https://www.vetmed.wsu.edu/outreach/Pet-Health-Topics/categories/diseases/cushing'%20s-disease", "https://www.fda.gov/consumers/consumer-updates/treating-cushings-disease-dogs", "https://www.vetmed.wsu.edu/outreach/Pet-Health-Topics/categories/diseases/cushing'%20s-disease", "https://www.acvim.org/animal-owners/animal-education/health-fact-sheets/small-animal-internal-medicine/cushings-disease-in-dogs", "https://vcahospitals.com/know-your-pet/cushings-disease-in-dogs", "https://www.acvim.org/animal-owners/animal-education/health-fact-sheets/small-animal-internal-medicine/cushings-disease-in-dogs"], "authors": [], "publish_date": "2019-08-22T12:08:41-07:00"}