{"result_id": "235022", "URL": "https://www.organicfacts.net/world-polio-day", "timestamp": "2023-04-25 16:46:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/world-polio-day", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "WHO Declares Global Eradication Of Wild Poliovirus Type 3", "cleaned_text": "The World Health Organisation has made a significant announcement to mark World Polio Day 2019. It has declared that two out of the three wild poliovirus strains have been eradicated. The latest to be eradicated worldwide has been the wild poliovirus type 3 (WPV3), as declared by an independent commission of experts.\n\nAll the three wild poliovirus strains are symptomatically similar, in which they cause paralysis and are potentially fatal. However, the need for them to be eradicated individually and marking these milestones arises from the genetic and virologic differences.\n\n“The achievement of polio eradication will be a milestone for global health. Commitment from partners and countries, coupled with innovation, means of the three wild polio serotypes, only type one remains,” said Dr. Tedros Adhanom Ghebreyesus, Director-General of the World Health Organization and Chair of the Global Polio Eradication Initiative (GPEI) Polio Oversight Board “We remain fully committed to ensuring that all necessary resources are made available to eradicate all poliovirus strains. We urge all our other stakeholders and partners to also stay the course until final success is achieved,” he added. [1]\n\nPrior to this, WPV2 was declared as eradicated in 2015. On the other hand, the last case of WPV3 was recorded in 2012 in northern Nigeria.\n\nWorld Polio Day was established to commemorate the birth of Jonas Salk, who led the first team to develop vaccine poliomyelitis. It was started by Rotary International.\n\nWhile the Philippines recently declared a polio outbreak, the continent of Africa is closer to declare polio eradication with Nigeria marks three years since the last case of polio.", "opengraph": {"locale": "en_US", "type": "article", "title": "WHO Declares Global Eradication Of Wild Poliovirus Type 3 | Organic Facts", "description": "The World Health Organisation has made a significant announcement to mark World Polio Day 2019. It has declared that two...", "url": "https://www.organicfacts.net/world-polio-day", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/polio.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/polio.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.who.int/news-room/feature-stories/detail/two-out-of-three-wild-poliovirus-strains-eradicated"], "authors": [], "publish_date": "October 24, 2019"}