{"result_id": "235026", "URL": "https://www.organicfacts.net/nose-cells-covid.html", "timestamp": "2023-04-25 16:46:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/nose-cells-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "Study Finds Key Nose Cells As Likely Entry Points For COVID Virus", "cleaned_text": "We know that the SARS-COV-2 virus is highly contagious, but how does it enter the body? A cross-country team of scientists has been mapping the human body to identify where the virus enters our body. Their findings, published in the journal Nature Medicine, identified two specific cells in the nose as the likely infection points. By understanding the spread of the virus, we can prevent transmission and develop an effective vaccine. [1]\n\nThe goblet and ciliated cells in the nose were found to contain high levels of entry proteins that the virus uses to enter the body. This could also explain the rapid spread of the virus. They found other organs with vital entry points. These were present in the eye, intestines, and vital organs like the heart.\n\nThe team used information from the Human Cell Atlas Data, an international consortium of scientists who are collaborating to map the airway cells in our body. They analyzed the single-cell RNA sequencing of non-infected people. They used more than 20 different tissues from organs like the lungs, eyes, heart, gut, liver, nasal cavity, and kidney. They were looking for cells that contained key proteins required by the virus to infect our cells.\n\n“This is the first time these particular cells in the nose have been associated with COVID-19. While there are many factors that contribute to virus transmissibility, our findings are consistent with the rapid infection rates of the virus seen so far. The location of these cells on the surface of the inside of the nose makes them highly accessible to the virus, and also may assist with transmission to other people,” said Dr. Martijn Nawijn, University Medical Center Groningen, Netherlands. He is one of the authors of the study.\n\nFor the latest updates on COVID-19, please visit the CDC link and the NIH link. [2] [3]", "opengraph": {"locale": "en_US", "type": "article", "title": "Study Finds Key Nose Cells As Likely Entry Points For COVID Virus | Organic Facts", "description": "We know that the SARS-COV-2 virus is highly contagious, but how does it enter the body? A cross-country team of...", "url": "https://www.organicfacts.net/nose-cells-covid.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/zikavirus.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/zikavirus.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://doi.org/10.1038/s41591-020-0868-6", "https://www.nih.gov/coronavirus", "https://www.coronavirus.gov", "https://www.nih.gov/coronavirus"], "authors": [], "publish_date": "April 27, 2020"}