{"result_id": "235018", "URL": "https://www.organicfacts.net/selenium.html", "timestamp": "2023-04-25 16:46:06 CEST+0200", "meta": {"description": "Selenium protects against heart diseases, boosts the immune system, maximizes thyroid function, reduces inflammation, prevents cancer and strengthen hair health.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/selenium.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "13 Proven Benefits of Selenium", "cleaned_text": "Selenium has a wide array of health benefits, including its ability to protect against certain heart diseases, boost the strength of the immune system, maximize thyroid function, reduce inflammation, reduce the signs of premature aging, protect against antibodies, boost hair health, and balance your hormones.\n\nSelenium is an essential trace mineral that is mainly derived from soil, water, and plant materials. Humans mainly acquire it from various plant sources, and since it is required for several essential activities, it is considered a non-metal. Although toxic in large quantities, it is necessary for certain cellular functions of animals and people. Therefore, including selenium-rich plant material in your diet is very important for maintaining overall health and wellness.\n\nThis mineral was discovered accidentally in the early 19th century, as a precipitate given off in the lead chamber process that was required to produce sulfuric acid. It was originally thought to be toxic and was eliminated, but when it was burned, it gave off an unusual smell, similar to the pungent odor of horseradish. Eventually, it was recognized as an independent element, although it is quite rare and difficult to find in large quantities. [1]\n\nThe health benefits of selenium are still being studied extensively, but certain important advantages are already well known and are explained in greater detail below.\n\nSelenium has been found to be rich in antioxidants and anti-inflammatory properties. [2]It is an essential part of various cellular processes, and this includes the body’s response to cancerous activity. A study published in Biology and Human Health has shown that normal intake of this mineral might result in a decrease of cancerous cell formation, especially in regard to prostate, colorectal, and lung cancers. A 2013 review study in the Nutrients journal, showed that in addition to its potential as a cancer preventative agent, selenium may also prove to be an anti-metastatic element, thus aiding in the later stages of cancer progression. [3]\n\nWhile the unique capabilities of this element to protect against carcinogenesis are noteworthy, large scale clinical trials are required to explore its full potential with regards to anticancer therapies. This was concluded in a 2017 study published in the Anticancer Research journal. [5]\n\nStudies have shown that selenium is important in the stimulation of antibodies, which are elements of the immune system that seek out and destroy viral, bacterial, fungal, and protozoan foreign bodies that result in diseases and infections. It is said to help stimulate these antibodies, particularly after you receive a vaccination for one of these diseases, making your body resilient and experienced in fighting them off so you remain healthy and protected throughout your life. [6]\n\nApart from boosting your immune system, this mineral also protects your body from wearing down and feeling older than it really is. A study in Hormone and Metabolic Research throws light on its potential anti-inflammatory properties. Selenium has been shown to reduce oxidative stress that often occurs around joints and bones, manifesting into the various inflammatory conditions like rheumatoid arthritis, gout, psoriasis, lupus, eczema associated pain, and weakness. By reducing the inflammation at these vital hinges of your body, you can remain active, healthy, and pain-free for many years. [7]\n\nAccording to a 2017 study, the presence of selenium per gram of tissue in the thyroid gland is higher as compared to all organs in the body. It supports the metabolism in thyroid hormones and therefore maintaining optimal levels of selenium may help to ensure smooth functioning of the thyroid and preventing any thyroid diseases. [8]\n\nSelenium-rich foods can help us live a longer and healthier life. This mineral is vital to well-being as it plays a role in improving overall health.\n\nA selenium deficiency is considered one of the reasons for asthma, which is why supplementation can be used as a remedy to relieve this respiratory condition. [9]\n\nSelenium is linked with promoting sperm motility and increasing the blood flow in the body. A 2017 research suggests that it could play a role in enhancing sperm health and male fertility. [10]\n\nThe antioxidant potential of selenium has been observed to be vital for protecting overall health, as the free radicals in the body can affect you several ways. Free radicals can weaken or kill cells in every organ system, can result in heart diseases, kidney malfunction, digestive issues, metabolic syndrome, hormonal imbalance, and premature aging. The antioxidant properties of selenium could prove beneficial in protecting against oxidative stress and keep such health issues at bay. [11]\n\nSelenium acts as an antioxidant and stimulates the creation of more antioxidants, thereby helping to fight off the free radicals in the body. These free radicals are associated with the aging process and are one of the primary causes of wrinkles, age spots, loose skin, weakened muscles, and a generally older appearance.\n\nCognitive decline has been associated with free radical activity in the neural cortex, destroying pathways and inhibiting the proper functioning of nerve impulses. As per studies, selenium can help prevent the onset of Alzheimer’s and improve mental health and overall mood by neutralizing free radicals before they can affect you. [12]\n\nThe Kashin-Beck disease is a heart-related condition, which affects a wide swath of the population, especially where the regular diet has low selenium content. This is perhaps the most serious and noticeable effect of a selenium deficiency, and it is characterized by the death of cartilage cells and retardation of growth, often resulting in osteoarthritis at a young age.\n\nSymptoms include joint pain, stiffness, lack of flexibility, and low range of motion, basically crippling those with severe cases. This deficiency is not the only cause of Kashin-Beck, but it is certainly one of the major causes. This is put forth in a study by Dr. Gerhard Schrauzer, et al., Biological Trace Element Research Institute, San Diego. [13]\n\nSelenium works as a blood thinner, which reduces the chances of blood clots, and it is also shown to reduce the amount of LDL cholesterol that builds up as plaque in the arteries and blood vessels. That plaque can lead to atherosclerosis, heart attacks, and strokes, so it is a powerful booster for your overall heart health for a number of reasons. [14]\n\nAlthough research is still being done on this condition, it is believed that good selenium content can reduce hair loss and the excessive dry scalp that results in dandruff. In a study cited in the Journal of the American Academy of Dermatology, selenium sulfide shampoo was found to be effective in the treatment of moderate to severe dandruff. [15]\n\nThe best sources of selenium intake for humans are mainly plants and animals, including the following:\n• Vegetarian sources: Brazil nuts are the richest source of this mineral discovered so far, mainly because the nut requires no selenium for its own function, but stores large quantities that can be absorbed and utilized by those who eat the nut. Other plant-based sources are spinach, mushrooms, sunflower seeds, and chia seeds. Other good sources are foods made from grains grown in selenium-rich soils, such as cereals, brown rice, white bread, and pasta.\n• Fish: Ocean fish and seafood are among the richest sources. These include halibut, tuna, crabs, rockfish, herring, and lobsters.\n\nWhen it comes to such nutrient minerals, it is important to know the proper dosage for a day, as an excess of this mineral can also be harmful to the health, resulting in selenium toxicity. The dosage, therefore, varies from age to age. Let us discuss it in detail below.\n\nSelenium toxicity is just as dangerous as a deficiency, so be careful not to overdo your intake. Symptoms of toxicity include:\n\nBe careful to only take what is necessary, and do not take selenium supplements if you are already on a selenium-rich diet!", "opengraph": {"locale": "en_US", "type": "article", "title": "13 Proven Benefits of Selenium | Organic Facts", "description": "Selenium protects against heart diseases, boosts the immune system, maximizes thyroid function, reduces inflammation, prevents cancer and strengthen hair health.", "url": "https://www.organicfacts.net/selenium.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:tag": "antiobodies", "article:section": "Minerals", "article:published_time": "2013-09-04T16:26:39-07:00", "article:modified_time": "2020-01-31T09:51:10-08:00", "updated_time": "2020-01-31T09:51:10-08:00", "image": "https://www.organicfacts.net/wp-content/uploads/brazilnuts-1.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/brazilnuts-1.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.organicfacts.net/home-remedies/15-best-foods-for-a-healthy-heart.html", "https://www.organicfacts.net/hemp-skin-hair-nails.html", "https://www.organicfacts.net/health-benefits/vegetable/horseradish.html", "https://www.sciencedirect.com/science/article/pii/S0272059083800177", "https://www.ncbi.nlm.nih.gov/pubmed/22381456?dopt=Abstract", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3705340/", "https://link.springer.com/chapter/10.1007/978-1-4612-2592-8_10", "http://ar.iiarjournals.org/content/37/12/6497.long", "http://jn.nutrition.org/content/133/5/1457S.short", "https://www.organicfacts.net/gout.html", "https://www.organicfacts.net/lupus.html", "https://www.organicfacts.net/eczema.html", "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0029-1220724", "https://www.organicfacts.net/home-remedies/11-ways-boost-metabolism.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5307254/", "https://www.organicfacts.net/selenium-foods.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3246085/", "https://crimsonpublishers.com/etun/pdf/ETUN.000521.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2698273/", "https://www.organicfacts.net/age-spots.html", "https://www.organicfacts.net/health-benefits/essential-oils/healthy-skin.html", "https://www.organicfacts.net/mental-health-how-to-deal.html", "https://www.ncbi.nlm.nih.gov/pubmed/26311427", "http://link.springer.com/article/10.1385/BTER:77:3:193", "https://www.organicfacts.net/home-remedies/blood-clots.html", "https://www.organicfacts.net/home-remedies/atherosclerosis.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1669559/", "https://www.organicfacts.net/hair-loss.html", "http://www.sciencedirect.com/science/article/pii/019096229370282X", "https://www.organicfacts.net/health-benefits/seed-and-nut/nuts.html", "https://www.organicfacts.net/health-benefits/vegetable/health-benefits-of-spinach.html", "https://www.organicfacts.net/health-benefits/vegetable/health-benefits-of-mushroom.html", "https://www.organicfacts.net/sunflower.html", "https://www.organicfacts.net/health-benefits/seed-and-nut/health-benefits-of-chia-seeds.html", "https://www.organicfacts.net/health-benefits/cereal/brown-rice.html", "https://www.organicfacts.net/fish.html", "https://www.organicfacts.net/health-benefits/animal-product/tuna-fish.html", "https://www.organicfacts.net/health-benefits/animal-product/health-benefits-crab.html", "https://www.organicfacts.net/herring.html", "https://www.organicfacts.net/lobster.html", "https://www.organicfacts.net/health-benefits/animal-product/health-benefits-of-chicken.html", "https://www.organicfacts.net/eggs.html", "https://www.organicfacts.net/home-remedies/home-remedies-for-bad-breath.html", "https://www.organicfacts.net/fever.html", "https://www.ncbi.nlm.nih.gov/books/NBK216723/", "https://www.organicfacts.net/edema.html", "http://www.annclinlabsci.org/content/36/4/409.long"], "authors": [], "publish_date": "2013-09-04T16:26:39-07:00"}