{"result_id": "235003", "URL": "https://www.organicfacts.net/egg-whites-benefits.html", "timestamp": "2023-04-25 16:45:59 CEST+0200", "meta": {"description": "Egg whites are a good source of protein, with almost 4 grams per serving, yet are still incredibly low in calories. Egg whites can also be used as a mask for skin & hair.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/egg-whites-benefits.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "Egg Whites: Top Health Benefits & Uses", "cleaned_text": "There are countless egg whites benefits that should encourage you to use these nutrient-dense ingredients in more of your cooking.\n\nEgg white is the clear liquid inside an egg, fertilized or unfertilized, that surrounds the yolk. The purpose of the white is to protect the egg and provide a cushion, as well as extra nutrition for an embryo. 90% of an egg white is water, while the rest consists of protein. It does not contain the same protein-rich lipids that the yolk has.\n\nFor anyone who has gone on a weight loss regimen, egg whites are a familiar recommendation. Diet magazines are filled with recipes for egg white omelets and egg white frittatas, and not without reason. Even though popular culture embraces the maligned egg yolk again, due to its nutrient density, egg whites are still lower in calories and cholesterol.\n\nMost recent experts do recommend eating the whole egg, which is full of vitamin A, potassium, calcium, folate, and omega-3 fatty acids. These essential nutrients are lost when the egg white alone is used, as well as half the protein. However, a solo egg white has none of the fat or cholesterol of a whole egg, and less than a quarter of the calories. Many people choose to keep some yolk in their recipes, but reduce the amount in relation to egg whites, which still allows them to get some of the benefits, but with significantly fewer calories.\n\nEgg whites have a long tradition of use in global cuisine, especially in the preparation of desserts. The whites are able to easily stabilized, making them popular as a stiffener for foods like mousse, souffle, and meringues. They are the cornerstone ingredient of pavlovas, macarons, and angel food cake.\n\nEgg whites are used in wine production and are an ingredient in certain cocktails. They are also used in the production of certain vaccines!\n\nEven without their yolks, egg whites are a good source of protein, with almost 4 grams per serving, yet are still incredibly low in calories. For this reason, people looking just for clean, low-calorie protein use egg whites, as they can use several in one meal. [1]\n\nEven though we know now that not all types of cholesterol are bad, for people on low-cholesterol diets, egg whites are the best choice. All of the cholesterol in eggs is located in the egg yolk with its saturated fats. Egg whites have no cholesterol left in them once separated. According to a study published by the Journal of the American Medical Association, conducted by Dr. Frank B. Hu et al., a reduction in egg yolk consumption has been linked to lower risk of cardiovascular disease, but egg whites can be separated and consumed separately for their respective benefits. [2] [3]\n\nThe egg white actually retains quite a few vitamins and minerals. One egg white contains 1.3mg of folate, 6.6 mcg of selenium, 2.3 mg of calcium, 3.6 mg of magnesium, 4.9 mg of phosphorus and 53.8 mg of potassium. Folate is a B vitamin essential to cell reproduction and growth. Selenium supports healthy thyroid and immune system function. Calcium and magnesium in conjunction help to build strong, dense bones. Phosphorus is important to your body’s energy production, while potassium is an important electrolyte that helps maintain blood pressure. [5]\n\nReducing your overall calorie intake is still an integral part of weight loss management. Using a whole egg has more than five times the calories of just an egg white. In egg-heavy recipes, like omelets and frittatas, replacing some of the whole eggs with just egg whites can significantly reduce the fat and calories of the dish without drastically changing the flavor or texture. [6]\n\nEgg whites have been used as a beauty wash for centuries. A mixture of egg white and lemon juice will shrink and tighten large pores. It is also used as a mask for excessively oily skin and is often recommended as a treatment for acne-prone skin. As the egg white mask dries on the skin, it removes blackheads and reduces puffiness. Egg whites are also a popular hair wash, as a treatment for oily scalp and are used to give shine to dull, dry hair. [7]\n\nAn egg white wash is often used in baking to add a golden color and shine to bread and pastries and to seal the edges of pies, pasta, and dumplings. An egg wash consists of egg whites whisked well with either water, milk or cream. Egg white and water is preferred for sealing edges. Egg white and milk, on the other hand, creates a deep golden crust on bread and pastries. [8]\n\nEgg whites are a natural, child-friendly glue that works well on paper and light craft supplies.\n\nUnder no circumstance should egg whites be used cosmetically if you are allergic to eggs. Eating raw egg whites is never recommended, as salmonella is a serious risk. People with kidney problems should talk to their doctor before starting a high-protein diet with egg whites as a central component.", "opengraph": {"locale": "en_US", "type": "article", "title": "Egg Whites: Top Health Benefits & Uses | Organic Facts", "description": "Egg whites are a good source of protein, with almost 4 grams per serving, yet are still incredibly low in calories. Egg whites can also be used as a mask for skin & hair.", "url": "https://www.organicfacts.net/egg-whites-benefits.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:section": "Animal Product", "article:published_time": "2019-03-14T06:54:34-07:00", "article:modified_time": "2020-02-26T10:43:30-08:00", "updated_time": "2020-02-26T10:43:30-08:00", "image": "https://www.organicfacts.net/wp-content/uploads/eggwhites.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/eggwhites.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.organicfacts.net/eggs.html", "https://www.organicfacts.net/proteins.html", "https://www.organicfacts.net/home-remedies/weight-loss.html", "https://www.organicfacts.net/health-benefits/vitamins/health-benefits-of-vitamin-a-or-retinol.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-potassium.html", "https://www.organicfacts.net/health-benefits/minerals/calcium.html", "https://academic.oup.com/jn/article-abstract/125/suppl_3/589S/4730879", "https://www.organicfacts.net/saturated-fat.html", "https://jamanetwork.com/journals/jama/fullarticle/189529?utm_content=&utm_medium=email&utm_source=sailthru&nr_email_referer=1", "https://www.jstage.jst.go.jp/article/jnsv1973/42/2/42_2_87/_article/-char/ja/", "https://jamanetwork.com/journals/jama/fullarticle/189529?utm_content=&utm_medium=email&utm_source=sailthru&nr_email_referer=1", "https://fdc.nal.usda.gov/fdc-app.html#/food-details/172183/nutrients", "https://www.organicfacts.net/selenium.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-magnesium.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-phosphorus.html", "https://academic.oup.com/ps/article-abstract/58/3/518/1627914", "https://www.ahajournals.org/doi/abs/10.1161/hc4001.096152", "https://www.organicfacts.net/health-benefits/fruit/health-benefits-of-lemon.html", "https://www.organicfacts.net/health-benefits/essential-oils/healthy-skin.html", "https://www.organicfacts.net/hemp-skin-hair-nails.html", "https://www.researchgate.net/profile/Dr_Ashish_Baldi/publication/235944029_Herbal_Cosmetics_Used_for_Skin_and_Hair/links/09e4151497b76aa3c5000000/Herbal-Cosmetics-Used-for-Skin-and-Hair.pdf", "https://www.organicfacts.net/health-benefits/animal-product/milk.html", "https://books.google.com/books?hl=en&lr=&id=CDypNklZdpIC&oi=fnd&pg=PT37&dq=%22egg+wash%22+baking&ots=TG_YH55SbV&sig=UMWS91v5kjUhXoIALxgnnhuStS4#v=onepage&q&f=false", "https://www.organicfacts.net/high-protein-diet.html"], "authors": [], "publish_date": "2019-03-14T06:54:34-07:00"}