{"result_id": "235019", "URL": "https://www.organicfacts.net/outbreak-proximity-anti-vaxxers", "timestamp": "2023-04-25 16:46:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/outbreak-proximity-anti-vaxxers", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "CDC Distrust, Proximity To Outbreak May Sway Anti-Vaxxers", "cleaned_text": "Something as simple as being in close vicinity of a disease outbreak could play a part in changing the beliefs of individuals against vaccinations. This is especially true about people who do not entirely trust institutions such as the CDC, found a study which was supported by the National Institutes of Health. [1]\n\nConducted by the University of Idaho, the study aimed to understand the effects of two factors on vaccine propensity. While the first was trust in government medical experts, the second was their propinquity to any recent disease outbreak.\n\nIt found that distrust of government medical experts and institutions such as the CDC have a positive effect on the vaccination attitude of individuals, in this case, measles. Apart from this, the paper points towards a strong interactive relationship between outbreak proximity and government expert trust.\n\nFurther, the study notes that vaccination laws and requirements varying across states and regions could also impact these decisions, as could mode of transmission of the disease. It also notes the importance of news media and the active role it could play in health communication.", "opengraph": {"locale": "en_US", "type": "article", "title": "CDC Distrust, Proximity To Outbreak May Sway Anti-Vaxxers | Organic Facts", "description": "Something as simple as being in close vicinity of a disease outbreak could play a part in changing the beliefs...", "url": "https://www.organicfacts.net/outbreak-proximity-anti-vaxxers", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/vaccination.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/vaccination.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://doi.org/10.1371/journal.pone.0220658"], "authors": [], "publish_date": "August 29, 2019"}