{"result_id": "235027", "URL": "https://www.organicfacts.net/prostate-cancer.html", "timestamp": "2023-04-25 16:46:10 CEST+0200", "meta": {"description": "Prostate cancer occurs in a man's prostate & can be treated. This cancer surrounds the urethra and is located below the bladder. Also, read causes, symptoms & treatments.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/prostate-cancer.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "9 Potential Treatments For Prostate Cancer", "cleaned_text": "by John Staughton (BASc, BFA) last updated - Medically reviewed by Ravleen Sakaria (MS, RD)\n\nAccording to the American Cancer Society, prostate cancer is one of the most common forms of cancer among males. It affects 1 in every 9 men over the course of their lifetime. Fortunately, there are very effective treatment methods available for this form of cancer, dropping the mortality rate in men to roughly 1 in 41 individuals. Even so, given that this disease kills more than 31,620 men each year in the United States alone, it is critical to understand the details of this chronic disease, including its causes, symptoms and potential treatment options.\n\nThe treatment options will depend on many factors like: [1]\n• Tumor size or the stage of cancer\n• Possible side effects of the therapy\n• The success rate of the therapy\n• Your thoughts on the treatment\n\nThe most common forms of reducing the risk of prostate cancer include radiation therapy, surgery, hormone therapy, chemotherapy, vaccine treatments, bone-directed treatment, cryotherapy, and active monitoring as per the National Cancer Institute. [2]\n\nDepending on the stage of your cancer, there are various strategies.\n\nIf any pre-cancerous or suspicious symptoms arise, many doctors choose to take a close monitoring approach. They schedule screenings like a prostate-specific antigen (PSA) blood test and digital rectal exam (DRE) every 6 months, so if cancer arises, more aggressive treatment can be started immediately. [3]\n\nA radical prostatectomy is a solution for some men with prostate cancer if cancer hasn’t spread outside of that gland. This is basically the complete removal of the prostate gland and some surrounding tissue, cutting out cancer at its source. [4]\n\nThis is a popular option if the cancer is discovered early and can be eliminated from within the prostate. High-energy rays are used to kill cancerous cells in this procedure. This may also work if the cancer isn’t killed after the radical prostatectomy has been completed. [5]\n\nCryotherapy or cryosurgery is a minimally invasive procedure, which involves releasing cold gases into the prostate gland to freeze and kill the cancer cells. This is typically used as a second line of treatment following radiation therapy if it is unsuccessful. [6]\n\nThe goal of this approach is to suppress certain hormones that can stimulate the unchecked growth of cancerous cells, namely androgens. This hormone therapy can have numerous unwanted side effects but can successfully stop the growth of cancer in the prostate. [7]\n\nIf your prostate cancer has spread to other parts of the body, chemotherapy is an option, wherein anti-cancer drugs are pumped into the bloodstream, thereby slowing the progress of cancer in many areas of the body. [8]\n\nThis specifically designed vaccine is able to stimulate the body to solely target to kill prostate cancer cells that may still be present in the body. It is favored for patients who have cancer, but aren’t showing any notable signs or symptoms, and has fewer side effects than many other treatment options. [9]\n\nOnce cancer begins to metastasize, one of the first places it will attack is the bones and in the case of prostate cancer, this can happen rapidly. Bone-directed treatment is intended to stop the spread of cancer, compared to only addressing the initial occurrence in the prostate. [10]\n\nAt a certain stage of cancer care, when no other treatments are left, palliative therapy is intended to make the patient as comfortable as possible. It focuses on reducing the symptoms of cancer instead of trying to cure it.\n\nThe main types of doctors that help in reducing the risk of prostate cancer are urologists, radiation oncologists, and medical oncologists as per a report published in 2019 by the American Cancer Society. [11]\n• Urologists are doctors that help in treating the urinary disorders as well as the male reproductive system, which includes the prostate.\n• Medical oncologists are doctors that take care of chemotherapy and hormone therapy.", "opengraph": {"locale": "en_US", "type": "article", "title": "9 Potential Treatments For Prostate Cancer | Organic Facts", "description": "Prostate cancer occurs in a man's prostate & can be treated. This cancer surrounds the urethra and is located below the bladder. Also, read causes, symptoms & treatments.", "url": "https://www.organicfacts.net/prostate-cancer.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:tag": "sexual dysfunction", "article:section": "Home Remedies", "article:published_time": "2017-07-25T14:01:41-07:00", "article:modified_time": "2020-09-22T07:37:09-07:00", "updated_time": "2020-09-22T07:37:09-07:00", "image": "https://www.organicfacts.net/wp-content/uploads/prostatecancer2.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/prostatecancer2.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cancer.org/cancer/prostate-cancer/treating.html", "https://www.cancer.gov/about-cancer/treatment", "https://www.cancer.org/cancer/prostate-cancer/treating/watchful-waiting.html", "https://www.cancer.org/cancer/prostate-cancer/treating/surgery.html", "https://www.cancer.org/cancer/prostate-cancer/treating/radiation-therapy.html", "https://www.cancer.org/cancer/prostate-cancer/treating/cryosurgery.html", "https://www.cancer.org/cancer/prostate-cancer/treating/hormone-therapy.html", "https://www.cancer.org/cancer/prostate-cancer/treating/chemotherapy.html", "https://www.cancer.org/cancer/prostate-cancer/treating/vaccine-treatment.html", "https://www.cancer.org/cancer/prostate-cancer/treating/treating-pain.html", "https://www.cancer.org/treatment/finding-and-paying-for-treatment/choosing-your-treatment-team/health-professionals-associated-with-cancer-care.html"], "authors": [], "publish_date": "2017-07-25T14:01:41-07:00"}