{"result_id": "235014", "URL": "https://www.organicfacts.net/flu-vaccine", "timestamp": "2023-04-25 16:46:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/flu-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "Scientists Inch Closer To A Universal Flu Vaccine", "cleaned_text": "A universal flu vaccine has long been considered one of the holy grails of medical research. Now scientists may be closer to developing such a vaccine more than ever before. A nationwide animal study by Scripps Research with scientists from Washington University School of Medicine and Icahn School of Medicine has found an antibody that was found to be effective against a wide range of influenza viruses. Published in the journal Science, this study could be the first step towards developing a universal vaccine against all strains of the flu virus. [1]\n\nThe antibodies were first discovered in 2017 in the blood sample of a flu patient at the Barnes-Jewish Hospital in St. Louis. Subsequent research at the Icahn School of Medicine found that these antibodies targetted a wide range of human and nonhuman virus strains. The scientists later tested the antibodies by injecting mice with lethal doses of influenza virus.\n\nAll the antibodies were found to be highly effective with one antibody named ‘1G01’ found to be effective against all the tested virus strains. All the mice survived, even when the vaccination was vaccination was administered after 72 hours of initial infection. While scientists are still studying how the antibody functions and whether it can be safely replicated for humans, this could be one of the first steps towards a universal flu vaccine.", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientists Inch Closer To A Universal Flu Vaccine | Organic Facts", "description": "A universal flu vaccine has long been considered one of the holy grails of medical research. Now scientists may be...", "url": "https://www.organicfacts.net/flu-vaccine", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/yellowfever.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/yellowfever.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://doi.org/10.1126/science.aay0678"], "authors": [], "publish_date": "October 29, 2019"}