{"result_id": "235004", "URL": "https://www.organicfacts.net/home-remedies/whooping-cough.html", "timestamp": "2023-04-25 16:45:59 CEST+0200", "meta": {"description": "Some of the most impressive home remedies for whooping cough include aromatherapy, salt water gargling, ginger, honey, and rosemary essential oil.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/home-remedies/whooping-cough.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "10 Powerful Home Remedies for Whooping Cough", "cleaned_text": "The most effective home remedies for whooping cough include aromatherapy, salt water gargling, ginger, honey, rosemary essential oil, eucalyptus, vitamin C, zinc, extra hydration, turmeric, garlic, lemon, almonds, and green tea.\n\nHome remedies for whooping cough include using ginger, honey, lemon, and oregano.\n\nThere are many health benefits of ginger, but when it comes to whooping cough, its expectorant qualities are the most important. By helping to eliminate excess mucus and phlegm, ginger tea or supplements can help to alleviate the chest congestion and improve airflow to the lungs and respiratory tracts. Furthermore, ginger possesses strong antibacterial qualities, which can help to eliminate or neutralize the bacteria that is causing whooping cough in the first place. [1]\n\nYou’ve often savored the sweet taste of honey dissolving on your tongue, but perhaps you didn’t know how many antiseptic, antibacterial, and antioxidant properties that little drop of heaven actually contained. Not only does honey help to coat the throat and reduce inflammation, but it can also actively seek out the bacterial infection and work to eliminate the illness very rapidly. Adding honey to a glass of chamomile tea is the perfect home remedy for a speedy recovery from pertussis. [2]\n\nLemons and other citrus fruits all contain citric acid, which is a powerful antibacterial and antiviral substance. Furthermore, it can help to cut through phlegm and mucus, which can improve breathing and eliminate that “whooping” sound. Finally, the vitamin C in lemons can help boost the immune system to handle the actual infection, while the other chemical components take care of the symptoms. [3]\n\nTo continue with the herbal approach to healing, oregano stands out as an anti-inflammatory and antispasmodic solution. By reducing the likelihood of spasms (painful dry coughing) and cutting down on irritation in the respiratory tracts, oregano can pave the way for a smooth recovery and a less painful experience. Oregano essential oil works very well, although adding fresh oregano to the diet can also achieve similar results. [4]\n\nAlthough it doesn’t get as much popular press as vitamin C when it comes to boosting the immune system, zinc is an excellent way to protect yourself from a variety of infections. If you take a zinc supplement or add foods rich in zinc (oysters, beef, wheat germ) to your diet, you can give yourself a supercharged line of defense that can clear out that bacterial infection in no time! [5]\n\nIt might not be particularly pleasant, but the high salt content of salt water gargling can cut right through that phlegm and return your breathing to normal, while also helping to soothe your aching throat from all that dry coughing. This is one of the easiest home remedies for whooping cough and can be performed at least once a day to reduce symptom severity. [6]\n\nAs always, garlic has a place in the home remedies for whooping cough. It is a natural antibiotic, so it can work to neutralize the bacterial infection in the lungs and respiratory tracts, while also promoting repair to the damaged, inflamed throat. Garlic extract can be mixed with a spoonful of honey for maximal effects! [7]\n\nOne of the most painful parts about whooping cough is the constant coughing that ravages your throat and hurts your chest and lungs. This dry, raspy cough can somewhat be alleviated by drinking excess water and fruit juices, which help to keep the respiratory tracts lubricated; natural fruit juices also contain antioxidants and vitamins that will help boost the immune system against the infection. [8]\n\nWith such a high content of phytochemicals packed into these delicious nuts, it comes as no surprise that they are a successful home remedy for pertussis. Furthermore, almonds boast certain minerals and vitamins that are essential for the immune system to fight off the pertussis infection. [9]\n\nAlthough some people are skeptical about the true effect of aromatherapy, one of the most legitimate treatment areas relates to respiratory tracts. For whooping cough, particularly in older children and adults suffering from this condition, aromatherapy with eucalyptus or peppermint essential oils can quickly cut through the phlegm and mucus, clear the sinuses, and soothe inflammation throughout the respiratory system. [10]\n\nWord of Caution: While these home remedies have been proven to be highly effective, it is still wise to consult a doctor if you believe you have contracted whooping cough. Furthermore, it is very important for young children to see a doctor if they as suffering from persistent coughing fits, as whooping cough can be even more dangerous, and even deadly, for infants and toddlers with underdeveloped immune systems, or if they have not yet received vaccinations.", "opengraph": {"locale": "en_US", "type": "article", "title": "10 Powerful Home Remedies for Whooping Cough | Organic Facts", "description": "Some of the most impressive home remedies for whooping cough include aromatherapy, salt water gargling, ginger, honey, and rosemary essential oil.", "url": "https://www.organicfacts.net/home-remedies/whooping-cough.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:tag": "pertussis", "article:section": "Home Remedies", "article:published_time": "2015-12-11T17:00:03-08:00", "article:modified_time": "2020-02-14T12:52:47-08:00", "updated_time": "2020-02-14T12:52:47-08:00", "image": "https://www.organicfacts.net/wp-content/uploads/whoopingcough.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/whoopingcough.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.organicfacts.net/home-remedies/home-remedies.html", "https://www.organicfacts.net/health-benefits/other/benefits-of-aromatherapy.html", "https://www.organicfacts.net/health-benefits/other/health-benefits-of-salt.html", "https://www.organicfacts.net/health-benefits/herbs-and-spices/ginger.html", "https://www.organicfacts.net/health-benefits/health-benefits-of-honey.html", "https://www.organicfacts.net/health-benefits/herbs-and-spices/rosemary.html", "https://www.organicfacts.net/health-benefits/essential-oils/essential-oil-benefits-uses.html", "https://www.organicfacts.net/health-benefits/herbs-and-spices/eucalyptus.html", "https://www.organicfacts.net/health-benefits/vitamins/health-benefits-of-vitamin-c-or-ascorbic-acid.html", "https://www.organicfacts.net/health-benefits/minerals/health-benefits-of-zinc.html", "https://www.organicfacts.net/health-benefits/herbs-and-spices/turmeric.html", "https://www.organicfacts.net/health-benefits/herbs-and-spices/health-benefits-of-garlic.html", "https://www.organicfacts.net/health-benefits/fruit/health-benefits-of-lemon.html", "https://www.organicfacts.net/health-benefits/seed-and-nut/health-benefits-of-almonds.html", "https://www.organicfacts.net/health-benefits/green-tea.html", "https://www.organicfacts.net/health-benefits/oregano.html", "https://www.organicfacts.net/tea.html", "http://online.liebertpub.com/doi/abs/10.1089/10755530050120691", "https://www.organicfacts.net/health-benefits/beverage/chamomile-tea-benefits-uses.html", "http://jamanetwork.com/journals/jama/article-abstract/287235", "https://www.organicfacts.net/citric-acid.html", "http://www.atsjournals.org/doi/abs/10.1164/arrd.1976.113.2.131", "https://www.organicfacts.net/home-remedies/foods-for-healing-wounds.html", "https://www.organicfacts.net/health-benefits/essential-oils/health-benefits-of-oregano-essential-oil.html", "https://www.researchgate.net/profile/Ajay_Pathak/publication/232709208_Antimicrobial_Activity_of_Plants_Belong_to_Solanaceae_Family/links/09e41508d6f21621a6000000.pdf", "https://www.organicfacts.net/zinc-supplement.html", "https://www.organicfacts.net/health-benefits/animal-product/oysters.html", "https://www.organicfacts.net/health-benefits/cereal/health-benefits-of-wheat-germ.html", "https://doi.org/10.1017/S0029665100000781", "http://www.sciencedirect.com/science/article/pii/S0378874104003836", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3968712/", "http://journals.lww.com/nursing/Citation/2006/07000/Pertussis.51.aspx", "https://www.organicfacts.net/health-benefits/seed-and-nut/nuts.html", "https://ijvst.um.ac.ir/index.php/veterinary/article/view/19398", "https://www.organicfacts.net/peppermint.html", "http://ijpr.sbmu.ac.ir/article_619_4.html"], "authors": [], "publish_date": "2015-12-11T17:00:03-08:00"}