{"result_id": "235001", "URL": "https://www.organicfacts.net/nih-hiv-vaccine-trial", "timestamp": "2023-04-25 16:45:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/nih-hiv-vaccine-trial", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "NIH Stops Trial Of HIV Vaccine Under HVTN 702", "cleaned_text": "In what comes as a setback to fight against HIV, the National Institute of Allergy and Infectious Diseases (NIAID) has discontinued the administration of an HIV vaccine being tested as a part of a clinical trial. The move comes after a review that found that the vaccine did not work towards preventing HIV.\n\nThe test vaccine was a part of the Phase 2b/3 study, named HVTN 702 or Uhambo in South Africa. Starting in 2016, it was adapted to the HIV subtype Clade C which is known to be the most common subtype in southern Africa, where the contagion is most prevalent.\n\n“An HIV vaccine is essential to end the global pandemic, and we hoped this vaccine candidate would work. Regrettably, it does not,” said NIAID Director Anthony S. Fauci, M.D. “Research continues on other approaches to a safe and effective HIV vaccine, which I still believe can be achieved.” [1]\n\nThe participants of this study were over 5000 HIV-negative volunteers between the ages of 18 to 35 who were sexually active. Over 18 months, they received six doses of vaccination injections. 2,689 volunteers from the pool had received a placebo injection.\n\nAfter the interim analysis in January 2020, it was found that 129 HIV infections occurred among the participants who received the vaccine, whereas 123 among the placebo recipients.\n\nNIH confirms further tests of different vaccines and other novel HIV-prevention products such as vaginal rings, implants, and multipurpose products being tested.", "opengraph": {"locale": "en_US", "type": "article", "title": "NIH Stops Trial Of HIV Vaccine Under HVTN 702 | Organic Facts", "description": "In what comes as a setback to fight against HIV, the National Institute of Allergy and Infectious Diseases (NIAID) has...", "url": "https://www.organicfacts.net/nih-hiv-vaccine-trial", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/2013/05/Aids.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/2013/05/Aids.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nih.gov/news-events/news-releases/experimental-hiv-vaccine-regimen-ineffective-preventing-hiv"], "authors": [], "publish_date": "February 05, 2020"}