{"result_id": "235012", "URL": "https://www.organicfacts.net/40-covid19-asymptomatic-vaccines.html", "timestamp": "2023-04-25 16:46:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/40-covid19-asymptomatic-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "40% COVID-19 Cases Asymptomatic, Vaccines Ready For Human Trials", "cleaned_text": "While the world is taking steps closer to a vaccine against the novel coronavirus, several studies across the world are still trying to figure out the best way to fight this and stay protected. The results of one such study, whose participants involved an entire town in Italy, found that about 40% of the cases were asymptomatic.\n\nThe subject of this study was the town of Vò in the Venetian region of Italy. The town, with a population of 3,200 residents, witnessed its first COVID-19 death on February 21st, earlier this year. Following this, the town was put under a 14-day quarantine, during which the research team tested most of the residents.\n\nApart from noticing that 40 percent of cases were asymptomatic, the team also highlights that it takes an average of 9.3 days for one’s body to be entirely cleared of the virus. This translates to anywhere between 8 to 14 days for one person, which holds testimony to the 14-day self-quarantine period that is being commonly followed around the world for travelers.\n\nWhile adults living with infected individuals such as family members tended to test positive, with or without symptoms, this wasn’t the case with children. No children under the age of 10 years, living with infected individuals tested positive.\n\nCo-lead researcher Professor Andrea Crisanti, from the Department of Molecular Medicine of the University of Padua and the Department of Life Sciences at Imperial, said: “Our research shows that testing of all citizens, whether or not they have symptoms, provides a way to manage the spread of disease and prevent outbreaks getting out of hand. Despite ‘silent’ and widespread transmission, the disease can be controlled.”\n\nAlongside this development, the UK also saw the first volunteer being administered the SARS-CoV-2 vaccine, marking the beginning of the human trials. India also saw its first vaccine, Covaxin, completing animal trials and ready to move into human trials phase in July, as per a BBC report. [1] [2]\n\nThe results of Italian study, conducted in collaboration with Imperial College London, have been published in the Nature journal. [3]", "opengraph": {"locale": "en_US", "type": "article", "title": "40% COVID-19 Cases Asymptomatic, Vaccines Ready For Human Trials | Organic Facts", "description": "While the world is taking steps closer to a vaccine against the novel coronavirus, several studies across the world are...", "url": "https://www.organicfacts.net/40-covid19-asymptomatic-vaccines.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "image": "https://www.organicfacts.net/wp-content/uploads/covidlockdown.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/covidlockdown.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bbc.com/news/world-asia-india-53230607", "https://www.imperial.ac.uk/news/198533/first-volunteer-receives-imperial-covid-19-vaccine/", "https://www.bbc.com/news/world-asia-india-53230607", "https://www.nature.com/articles/s41586-020-2488-1"], "authors": [], "publish_date": "July 01, 2020"}