{"result_id": "235006", "URL": "https://www.organicfacts.net/home-remedies/dengue-fever.html", "timestamp": "2023-04-25 16:46:00 CEST+0200", "meta": {"description": "Find out the best home remedies for dengue fever! These include barley grass, neem leaves, papaya, orange juice, coriander, basil leaves, water, & pomegranate juice.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/home-remedies/dengue-fever.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "8 Surprising Home Remedies For Dengue Fever", "cleaned_text": "by John Staughton (BASc, BFA) last updated - Medically reviewed by Afshan Shadman Ali (MSc, CDE)\n\nWhile there are no direct medical treatments available to cure dengue, there are effective remedies that relieve the symptoms of dengue fever. These include the use of barley grass, goldenseal, neem leaves, papaya, orange juice, coriander, basil leaves, water, fenugreek, and pomegranate juice.\n\nDengue fever is a viral infection spread by Aedes aegypti and Aedes albopictus mosquitos, which affects millions of people every year. This disease is commonly found in the tropics where there are more mosquitos, but since the mid-20th century, it is endemic to more than 100 countries worldwide. [1]\n\nThe symptoms of dengue usually manifest in threes (fever, rash, and headache), and are called dengue triad.\n\nThere may not be a cure for the dengue virus, treatment of secondary conditions is common, and in most cases, patients can survive. However, due to the lack of a formalized cure, many herbal and home remedies have been popularized, the most effective ones of which are explained in greater detail below.\n\nThe most effective form of treatment is actually prevention, but fending off annoying mosquitoes can be very difficult. The most effective preventative strategies are:\n• Standing water: Removing or eliminating standing, stagnant water, as that is where mosquitoes reproduce.\n• Mosquito repellent: If you are in a heavily wooded or tropical area, apply mosquito repellent to any exposed skin and your clothes.\n• Enclose and cover: Cover all your skin and ensure that the place you sleep in is fully enclosed, including tears in any mosquito netting that you may put in place to protect yourself.\n\nAccording to WHO, the first dengue vaccine, Dengvaxia (CYD-TDV) by Sanofi Pasteur, was developed in Mexico in December 2015. [3]\n\nHowever, in case you are infected by the dengue virus, follow these home remedies below for a quick recovery and an alleviation of your symptoms:\n\nPapaya leaves are widely known as being a natural cure for dengue fever. The complex mix of nutrients and an organic compound called papain (also known as papaya proteinase) found in raw papayas can cause a rise in your platelet count, the high levels of vitamin C also help to stimulate the immune system, and the antioxidants help to reduce oxidative stress and eliminate excess toxins in the blood. The leaves can be crushed and then strained with a cloth to drink the pure juice. Preparations of the raw fruit, ripe fruit slices, can also be had. [4]\n\nBarley grass has the unique ability to significantly increase the body’s blood platelet count by stimulating the production of more blood cells. You can drink barley water or eat barley grass directly and see a rapid increase in platelet count, which is one of the serious side effects of dengue fever that can prolong weakness and increase the susceptibility of the body to dengue hemorrhagic fever and more serious complications. [5] [6]\n\nAlthough many herbal or natural remedies aren’t directly approved or proven through research, homeopathic physicians have praised goldenseal for its ability to clear up the symptoms of dengue fever very quickly and eliminate the virus from the body. Goldenseal not only helps to ease fevers, chills, headaches, nausea, and vomiting, but its natural antiviral capacity can essentially cure dengue fever in a matter of days. [7]\n\nAs obvious as this might be staying hydrated through a bout of dengue is extremely important. Due to the excessive sweating, bodily exertion, and the internal toll that dengue fever takes on the body, extreme dehydration is common. Drink as much water as possible will also help to ease symptoms like headaches and muscle cramps, both of which are exacerbated by dehydration. Furthermore, water will help to flush the body and eliminate excess toxins that can complicate the viral impact of the pathogen. [8]\n\nNeem leaves are commonly prescribed for a variety of ailments, and dengue fever is no exception. Steeping neem leaves and then drinking the subsequent brew has been shown to increase both blood platelet count and white blood cell count, two of the most dangerous side effects of the virus. Properly brewed neem leaves can improve the immune system and return your strength much faster than many other home remedies. [9]\n\nThe rich mixture of antioxidants and vitamins found in orange juice makes it ideal for treating the secondary symptoms of dengue fever and eliminating the virus. Orange juice helps to promote antibodies of the immune system, increase urination and the release of toxins, and stimulates cellular repair due to vitamin C’s crucial role in the creation of collagen. [10]\n\nFenugreek leaves are known to reduce fever and act as a slight sedative to ease pain and promote more restful sleep for patients. This is a popular home remedy for dengue fever symptoms in numerous places around the world. [11] [12]\n\nHoly basil is not only a sacred plant in India, but it is also very useful in keeping dengue away. Moreover, it is easily accessible. Ocimum sanctum leaves, when washed clean and chewed raw, can work to alleviate the symptoms of dengue. You can also drink the juice of these leaves. [13]\n\nWord of Caution: Although most cases of dengue fever are not fatal, the fever can progress rapidly to more serious stages if the initial symptoms are not treated and preventative measures are not taken. While home remedies are significant to provide relief from the symptoms, seek professional medical attention to manage it better.\n\nNote: Please only use these home remedies as supplemental treatments.", "opengraph": {"locale": "en_US", "type": "article", "title": "8 Surprising Home Remedies For Dengue Fever | Organic Facts", "description": "Find out the best home remedies for dengue fever! These include barley grass, neem leaves, papaya, orange juice, coriander, basil leaves, water, & pomegranate juice.", "url": "https://www.organicfacts.net/home-remedies/dengue-fever.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:tag": "dengue shock", "article:section": "Home Remedies", "article:published_time": "2015-01-23T17:00:47-08:00", "article:modified_time": "2020-02-19T09:06:03-08:00", "updated_time": "2020-02-19T09:06:03-08:00", "image": "https://www.organicfacts.net/wp-content/uploads/denguefever.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/denguefever.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.organicfacts.net/fever.html", "https://www.organicfacts.net/health-benefits/cereal/barley-grass.html", "https://www.organicfacts.net/health-benefits/herbs-and-spices/goldenseal.html", "https://www.organicfacts.net/health-benefits/herbs-and-spices/neem.html", "https://www.organicfacts.net/health-benefits/fruit/health-benefits-of-papaya.html", "https://www.organicfacts.net/health-benefits/beverage/orange-juice.html", "https://www.organicfacts.net/health-benefits/herbs-and-spices/health-benefits-of-coriander.html", "https://www.organicfacts.net/basil.html", "https://www.organicfacts.net/health-benefits/vegetable/fenugreek.html", "https://www.organicfacts.net/health-benefits/fruit/health-benefits-of-pomegranate.html", "https://www.who.int/health-topics/dengue-and-severe-dengue#tab=tab_1", "https://www.organicfacts.net/home-remedies/home-remedies.html", "http://onlinelibrary.wiley.com/doi/10.1111/j.1365-3156.2009.02396.x/full", "https://www.organicfacts.net/health-benefits/essential-oils/healthy-skin.html", "http://www.who.int/immunization/research/development/dengue_vaccines/en/", "https://www.organicfacts.net/papaya-leaf.html", "https://www.organicfacts.net/health-benefits/vitamins/health-benefits-of-vitamin-c-or-ascorbic-acid.html", "http://www.sciencedirect.com/science/article/pii/S2221169111600555", "https://www.organicfacts.net/health-benefits/cereal/health-benefits-of-barley.html", "http://apps.searo.who.int/pds_docs/B4751.pdf", "http://www.agriculturejournals.cz/publicFiles/00089.pdf", "http://apps.searo.who.int/pds_docs/B4751.pdf", "http://www.seminar.schoolofnaturalhealing.com/sites/seminar.schoolofnaturalhealing.com/files/Golden%20Seal%20-%20Trina%20Cordingley.pdf", "https://www.organicfacts.net/home-remedies/muscle-cramps-home-remedies-and-causes.html", "http://europepmc.org/abstract/MED/3498669", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5607393/", "https://www.organicfacts.net/health-benefits/other/collagen.html", "http://onlinelibrary.wiley.com/doi/10.1525/maq.1991.5.3.02a00050/abstract", "https://www.nhp.gov.in/ayurvedic-perspective-of-dengue-fever_mtl", "https://books.google.co.in/books?id=WDacBAAAQBAJ&pg=PT19&lpg=PT19&dq=fenugreek+dengue&source=bl&ots=25VXcR-zUV&sig=ACfU3U0OZJ6LvlRlp8BsSdhxBTGnpuN7vg&hl=en&sa=X&ved=2ahUKEwioptG9qofmAhVUjuYKHWtGCdI4HhDoATAJegQICxAB#v=onepage&q=fenugreek%20dengue&f=false", "https://www.nhp.gov.in/ayurvedic-perspective-of-dengue-fever_mtl", "https://www.organicfacts.net/health-benefits/herbs-and-spices/health-benefits-of-holy-basil-tulsi.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3765846/"], "authors": [], "publish_date": "2015-01-23T17:00:47-08:00"}