{"result_id": "235036", "URL": "https://www.organicfacts.net/parenting/pregnancy/breast-feeding.html", "timestamp": "2023-04-25 16:46:14 CEST+0200", "meta": {"description": "Breastfeeding has benefits for mother and child, including nutrition for the baby, strengthened immunity, balanced metabolism, and a decreased risk of chronic illness.", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png?v2", "canonical": "https://www.organicfacts.net/parenting/pregnancy/breast-feeding.html", "encoding": "UTF-8"}, "image": null, "domain": "www.organicfacts.net", "title": "15 Surprising Benefits of Breastfeeding", "cleaned_text": "Breastfeeding is not just a natural and beautiful act between a mother and child, but it also provides a number of important health benefits for mother and child, including an ideal blend of nutrition for your baby, strengthened immunity, increased cognitive ability, balanced metabolism, and a decreased risk of chronic illness, in addition to many other important benefits for the mother as well!\n\nBreastfeeding is when a mother feeds her child milk that develops in her breast and is a process that begins within minutes of birth and can continue for years.\n\nThere has been some controversy in recent years about a move away from breast milk, and the rise of artificial formula has helped that trend grow. However, there have been many studies regarding the health benefits of breastfeeding, and it’s estimated that more than 1 million infant deaths each year could be prevented through more widespread awareness and practice of breastfeeding. [1]\n\nBreastfeeding can be started immediately after delivery or after 4-5 hours of a Cesarean section procedure. The milk that comes out initially is slightly thick and yellowish in color and acts as a vaccine. Mother’s milk should be the only source of diet for the infant during the first 6 months. No other supplementary vitamins or juice can replace it in terms of an ideal diet. Breastfeeding can be done for two years or more. It not only provides nourishment to the child but also gives relief to the mother’s pain after her delivery. Normally, the infants should be breastfed 10 to 12 times per day with an average of 12 to 14 minutes on either breast.\n\nExcept for certain cases, it is good to feed the infant with the mother’s milk. During these situations or diseased conditions, like a mother having active tuberculosis, or if a mother takes illegal drugs, then she should not breastfeed her infant. Also, an infant suffering from galactosemia must not be fed with mother’s milk.\n\nBreastfeeding occurs in drastically different concentrations around the world, with 75% of women in the United States breastfeeding for at least six months, while in many other parts of the world, that number drops to below 40%. Breastfeeding has been proven to benefit both the mother and the baby, and should, therefore, be seriously considered as a part of your early motherhood months. Even the World Health Organization (WHO) recommends six months of breastfeeding for mothers who are healthy and able to produce enough milk. Now, let’s dig a little deeper into the many benefits of breastfeeding. [2]\n\nBreastfeeding has many benefits, both for the infant and the mother. Let us discuss them in detail below.\n\nBenefits of breastfeeding for infants helps improve immunity, prevent chronic diseases, and more.\n\nIt is well known that the constant flow of beneficial nutrients coming from breast milk is accompanied by important antibodies from a baby’s mother. When you are an infant, you’re highly susceptible to falling ill, and there are often complications. During breastfeeding, the mother’s immunity powers pass on to the newborn via the antibodies present in breast milk. Medical studies suggest that breastfed children have fewer health ailments and hospitalization sessions than those infants who are not breastfed.\n\nBreastfeeding provides a strong first line of defense against infant illness and mortality. In fact, children who are breastfed had a lower risk of asthma, respiratory illnesses, stomach disorders, and allergies, so the effects of breastfeeding can last long into their adult life. According to the National Institute of Child Health and Human Development, milk present in mother’s milk forms a layer over the baby’s throat and nose, thereby preventing them from ear and asthma infections. [3] [4]\n\nSome of the most interesting claims in recent years are related to the reduction of asthma and obesity in children who were breastfed. The research on this correlation is relatively new, but the early results are encouraging, adding one more long-term reason for breastfeeding your child at least past the six-month mark. [5]\n\nBreast milk protects the baby from gastrointestinal diseases by enhancing the immune system of the Gastrointestinal Tract (GIT).\n\nBreast milk is rich in vital nutrients, which help the baby grow properly and significantly adds to all-around development. The custom-made mixture of nutrients and minerals in breast milk is perfect for your child. With a rich amount of vitamins, antibodies, protein, and fat, breastfeeding is the best way to ensure that your baby is getting the right amount and concentration of nutrients. The things that mothers consume also has an effect on the quality of the milk, which can encourage mothers to eat healthily and conscientiously throughout those postpartum months. While some critics argue that this “passing” of substances to babies is the dangerous aspect of breastfeeding, if a mother is thoughtful and considerate of her baby’s welfare, this aspect of anatomy can be a major advantage for growth. [6]\n\nBreast milk has a balanced core of nutrients that are essential for normal brain development of babies. It protects infants against various diseases as a newborn child’s immune system is not completely developed until the age of 2.\n\nStudies have connected breastfeeding with higher scores on IQ tests later in life and a general increase in cognitive abilities as children grow up. This is another slightly controversial claim, but it certainly doesn’t do any harm to cognition and mental development. The closeness and intimacy, as well as the frequent experience of physical contact, will help the baby develop emotional connections as well, helping their social interactivity later in life. [7]\n\nAs high as a 50% reduction in SIDS occurrences has been reported by mothers who breastfeed as opposed to those who don’t. Sudden Infant Death Syndrome (SIDS) is a tragic and thus far mysterious condition that kills over 2,500 infants each year. [8]\n\nBreastfeeding has numerous benefits for mothers. It helps them lose pregnancy weight, prevent ovarian cancer, and promote stronger bones, among others.\n\nWhen you breastfeed, the babies are literally sucking the nutrients out of your body, and a great deal of that is in the form of fat and protein. You end up burning quite a few calories just from breastfeeding, and it has been known to speed up the metabolism, an ideal situation for women trying to lose their baby weight in those first few postpartum months. [9]\n\nOne of the hormones released when lactating is oxytocin, which can help protect the uterus and return it to its pre-delivery size and condition. Excess bleeding can often lead to postpartum complications, and even increase your chances of developing uterine or ovarian cancer. Breastfeeding can successfully lessen those risks for mothers. [10]\n\nBreast cancer occurrence has been directly negatively correlated to breastfeeding, and it significantly affected by your total lifetime breastfeeding time.\n\nMore specifically, research published in the Breastfeeding Medicine journal shows that the longer the amount of time you spend breastfeeding your children, the lower your chances of developing breast cancer. It helps keep the breast tissues functioning in a normal way by discarding the cells with early DNA damage from the breast tissue. This finding has been corroborated in a number of other studies around the world as well. [11] [12] [13]\n\nWhile these studies may help us understand the protective effect of breastfeeding, a recent news release by NIH scientists reveals that the cancer preventive potential of breastfeeding may only be seen 30 years after the birth of the last child. [14]\n\nPostpartum depression can be a dangerous and delicate condition that many mothers will struggle through, but maintaining that physical and nutritional connection to your infant can help develop the bond that has been growing for nine months. You see reduced occurrences of postpartum depression in women who breastfeed their children, as well as lower levels of anxiety and a higher quality of overall emotional health. It is a natural phenomenon that while breastfeeding, the baby and mother are tied to each other emotionally. The infant also gains security with his or her mother by being close to her. [15]\n\nDue to the sucking action of the infant, a hormone is produced in the mother, causing the contraction of her uterus.\n\nAccording to a 2018 study, breastfeeding cuts the risk of developing type 2 diabetes nearly in half for women throughout their childbearing years compared to those who never breastfed. Also, women who breastfed for six months or less have a 25 percent reduction in diabetes risk. [16]\n\nVarious studies have reported that lactation causes a reduction in the volume of blood flow during menstrual cycles after delivery. This is advantageous to the mother as she is in a recovering phase after delivery.\n\nSome studies have shown that women who feed their babies with breast milk have low chances of hip fractures that occur after menopause.\n\nOne of the benefits of being pregnant or lactating is that the body increases its ability to uptake calcium. This more efficient means of accessing this important mineral has a long-term effect on a woman’s body. In fact, women who breastfeed are 4x less likely to develop osteoporosis as non-breastfeeding mothers. [17]\n\nIt has been found in various studies that compared to a baby fed with any other milk, the breastfed infants have increased protection against leukemia, high blood pressure, type I diabetes, and obesity. According to the American Academy of Pediatrics, breastfeeding decreases the occurrence of diarrhea, botulism, urinary tract infections, meningitis, and allergies. [18]", "opengraph": {"locale": "en_US", "type": "article", "title": "15 Surprising Benefits of Breastfeeding | Organic Facts", "description": "Breastfeeding has benefits for mother and child, including nutrition for the baby, strengthened immunity, balanced metabolism, and a decreased risk of chronic illness.", "url": "https://www.organicfacts.net/parenting/pregnancy/breast-feeding.html", "site_name": "Organic Facts", "article:publisher": "https://www.facebook.com/organicfacts", "article:tag": "oxytocin", "article:section": "Pregnancy", "article:published_time": "2016-03-10T17:00:02-08:00", "article:modified_time": "2020-02-28T10:03:36-08:00", "updated_time": "2020-02-28T10:03:36-08:00", "image": "https://www.organicfacts.net/wp-content/uploads/Breastfeeding.jpg", "image:secure_url": "https://www.organicfacts.net/wp-content/uploads/Breastfeeding.jpg", "image:width": "700", "image:height": "525"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.organicfacts.net/home-remedies/11-ways-boost-metabolism.html", "https://www.organicfacts.net/health-benefits/animal-product/milk.html", "http://europepmc.org/abstract/med/15687461", "https://www.organicfacts.net/home-remedies/tuberculosis.html", "http://dspace2.flinders.edu.au/xmlui/handle/2328/3006", "https://www.organicfacts.net/allergies.html", "http://www.nichd.nih.gov/Pages/index.aspx", "http://www.sciencedirect.com/science/article/pii/S1081120610627044", "http://www.nichd.nih.gov/Pages/index.aspx", "http://onlinelibrary.wiley.com/doi/10.1111/j.1399-3038.2011.01229.x/abstract", "https://www.organicfacts.net/proteins.html", "http://fnb.sagepub.com/content/20/1/53.short", "http://www.sciencedirect.com/science/article/pii/0277953688900287", "http://journals.rcni.com/doi/abs/10.7748/ns2006.05.20.38.52.c4166", "http://onlinelibrary.wiley.com/doi/10.1111/j.1552-6909.1998.tb02605.x/abstract", "http://www.sciencedirect.com/science/article/pii/0378378296017252", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6069526/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4085934/", "https://www.ncbi.nlm.nih.gov/pubmed/25785349", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6069526/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4085934/", "https://www.nih.gov/news-events/news-releases/nih-scientists-find-breast-cancer-protection-pregnancy-starts-decades-later", "https://www.organicfacts.net/home-remedies/home-remedies-for-depression.html", "https://www.organicfacts.net/home-remedies/home-remedies-for-anxiety.html", "http://onlinelibrary.wiley.com/doi/10.1111/j.1651-2227.2007.00602.x/abstract", "https://www.organicfacts.net/diabetes.html", "https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/2668634", "https://www.organicfacts.net/health-benefits/minerals/calcium.html", "https://www.organicfacts.net/osteoporosis.html", "https://www.researchgate.net/profile/Np_Magula/publication/6076615_Breastfeeding_and_Maternal_Health_and_Infant_Health_Outcomes_in_Developed_Countries/links/557651a508aeacff1ffe62c2.pdf", "https://www.organicfacts.net/essential-oils-high-blood-pressure.html", "https://www.organicfacts.net/home-remedies/home-remedies-for-diarrhea.html", "https://www.organicfacts.net/home-remedies/meningitis.html", "http://www.aap.org/en-us/Pages/Default.aspx"], "authors": [], "publish_date": "2016-03-10T17:00:02-08:00"}