{"result_id": "237011", "URL": "https://pandemic.news/2022-12-15-exposure-covid-spike-proteins-renders-women-infertile.html", "timestamp": "2023-04-25 16:46:26 CEST+0200", "meta": {"description": "The SARS-CoV-2 spike protein used in the Wuhan coronavirus (COVID-19) mRNA vaccines can render women infertile, scientists warned. A study conducted last year by a team of medical experts found that women injected with the mRNA shot are at an increased risk of experiencing severe fertility abnormalities, miscarriages and other serious health complications. The said […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,breast milk,covid-19,Dangerous Medicine,fertility,Michael Yeadon,miscarriage,pandemic,Pfizer,pharmaceutical fraud,pregnant women,reproductive health,spike protein,vaccine,vaccine damage,vaccine injury,Wolfgang Wodarg,women's health", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-12-15-exposure-covid-spike-proteins-renders-women-infertile.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "Exposure to COVID vaccine spike proteins renders women infertile, scientists warn", "cleaned_text": "The SARS-CoV-2 spike protein used in the Wuhan coronavirus (COVID-19) mRNA vaccines can render women infertile, scientists warned.\n\nA study conducted last year by a team of medical experts found that women injected with the mRNA shot are at an increased risk of experiencing severe fertility abnormalities, miscarriages and other serious health complications.\n\nThe said study published in Lancet Infectious Diseases scrutinized a total of 191,360 women aged between 15 and 49 years old. It found that pregnant women injected with a second dose of the Moderna mRNA COVID-19 shot had a significantly higher risk of experiencing a severe health event.\n\nMiscarriage or stillbirth was the most frequently reported adverse pregnancy outcome. Vaginal bleeding, abnormal fetal heart rate and reduced fetal movement were also reported within seven days following any mRNA vaccination.\n\nIn another study published in Frontiers in Immunology, 50 lactating women signed up to provide blood and milk samples before their first vaccine dose, before their second dose and four to 10 weeks after their second dose. The study authors then measured anti-SARS-CoV-2 receptor binding domain (RBD) antibodies in each sample.\n\nThey found that the levels of two RBD antibodies – immunoglobulin G (IgG) and immunoglobulin M – significantly increased in maternal plasma. Moreover, there was significant transfer of IgG and immunoglobulin A to breast milk.\n\nMothers who received the second dose of the mRNA COVID-19 vaccine also reported more symptoms compared to those who only received the first dose. The symptoms they reported include fever, chills, headache, joint pain, muscle aches or body aches, and fatigue or tiredness. Two mothers also reported slightly less milk production in the first 24 to 72 hours after being injected with the COVID-19 shot.\n\nFormer Pfizer VP warns against giving vaccine to pregnant women\n\nIn December 2020, British scientific researcher and ex-Pfizer Vice President Dr. Michael Yeadon and German physician and epidemiologist Dr. Wolfgang Wodarg issued a motion for administrative and regulatory action to the European Medicines Agency (EMA). They requested the regulator to immediately suspend all SARS-CoV-2 vaccine studies, especially the one for the Pfizer vaccine. They warned that the vaccines can attack placenta cells, causing female infertility.\n\nIn their petition, the two doctors pointed out that vaccinations are expected to produce antibodies against spike proteins of SARS-CoV-2. However, spike proteins also contain syncytin-homologous proteins, which are essential for the formation of the placenta in mammals, such as humans. It must be absolutely ruled out that a vaccine against SARS-CoV-2 could trigger an immune reaction against syncytin-1 – otherwise, infertility of indefinite duration could result in vaccinated women.\n\n“There is no indication whether antibodies against spike proteins of SARS viruses would also act like syncytin-1 antibodies,” said the petitioners. “However, if this were to be the case, this would then also prevent the formation of a placenta, which would result in vaccinated women essentially becoming infertile.” (Related: VAX ATTACKS: The new mRNA coronavirus vaccines will likely cause immune cells to attack placenta cells, causing infertility, miscarriage or birth defects.)\n\nHead over to VaccineDamage.news for more stories about how Pfizer’s COVID-19 vaccine renders women infertile.\n\nWatch Owen Shroyer of InfoWars discuss how nearly half of women injected with the Pfizer COVID-19 shot suffered a miscarriage.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nWill the CLOT SHOTS cause widespread mental retardation and infertility?\n\nPfizer’s vaccine studies are based on FRAUD and put lives in danger, warns former Pfizer vice president.\n\nBABY-CIDE JABS: Dr. Cole receiving placentas from covid-jabbed women that are inflamed, calcified and full of spike proteins.\n\nPfizer coronavirus vaccine warning: No breastfeeding or getting pregnant after being immunized… it might damage the child.", "opengraph": {"title": "Exposure to COVID vaccine spike proteins renders women infertile, scientists warn", "type": "article", "url": "https://www.pandemic.news/2022-12-15-exposure-covid-spike-proteins-renders-women-infertile.html", "site_name": "Pandemic News", "description": "The SARS-CoV-2 spike protein used in the Wuhan coronavirus (COVID-19) mRNA vaccines can render women infertile, scientists warned. A study conducted last year by a team of medical experts found that women injected with the mRNA shot are at an increased risk of experiencing severe fertility abnormalities, miscarriages and other serious health complications. The said […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/12/Pregnant-Woman-Worried-Covid-Vaccine.jpg"}, "tags": ["pandemic", "Wolfgang Wodarg", "covid-19", "women's health", "Big Pharma", "vaccine", "Michael Yeadon", "miscarriage", "vaccine injury", "Pfizer", "pregnant women", "spike protein", "vaccine damage", "breast milk", "reproductive health", "fertility", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://newspunch.com/exposure-to-spike-protein-makes-women-infertile-scientists-warn/", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(22)00426-1/fulltext", "https://www.frontiersin.org/articles/10.3389/fimmu.2021.777103/full", "https://2020news.de/wp-content/uploads/2020/12/Wodarg_Yeadon_EMA_Petition_Pfizer_Trial_FINAL_01DEC2020_EN_unsigned_with_Exhibits.pdf", "https://2020news.de/en/dr-wodarg-and-dr-yeadon-request-a-stop-of-all-corona-vaccination-studies-and-call-for-co-signing-the-petition/", "https://naturalnews.com/2020-12-07-mrna-vaccines-may-cause-body-attack-placenta-cells.html", "https://vaccinedamage.news/", "https://www.brighteon.com/847810b7-06d2-46d4-ad04-848f800bee5f", "https://www.brighteon.com/channels/infowarsnetwork", "https://naturalnews.com/2021-10-24-will-the-clot-shots-cause-retardation-and-infertility.html", "https://naturalnews.com/2021-05-27-covid-vaccine-bioweapons-attack-male-fertility-too.html", "https://naturalnews.com/2020-12-10-pfizers-vaccine-studies-based-on-fraud.html", "https://naturalnews.com/2022-12-12-dr-cole-placentas-covid-jabbed-inflamed-calcified.html", "https://naturalnews.com/2020-12-08-pfizer-coronavirus-vaccine-no-breastfeeding-getting-pregnant.html", "https://newspunch.com/exposure-to-spike-protein-makes-women-infertile-scientists-warn/", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(22)00426-1/fulltext", "https://www.frontiersin.org/articles/10.3389/fimmu.2021.777103/full", "https://2020news.de/wp-content/uploads/2020/12/Wodarg_Yeadon_EMA_Petition_Pfizer_Trial_FINAL_01DEC2020_EN_unsigned_with_Exhibits.pdf", "https://2020news.de/en/dr-wodarg-and-dr-yeadon-request-a-stop-of-all-corona-vaccination-studies-and-call-for-co-signing-the-petition/", "https://www.brighteon.com/847810b7-06d2-46d4-ad04-848f800bee5f", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-12-15-exposure-covid-spike-proteins-renders-women-infertile.html&linkname=Exposure%20to%20COVID%20vaccine%20spike%20proteins%20renders%20women%20infertile%2C%20scientists%20warn", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}