{"result_id": "237018", "URL": "https://pandemic.news/2022-10-05-pfizer-didnt-test-covid-vaccine-male-fertility.html", "timestamp": "2023-04-25 16:46:31 CEST+0200", "meta": {"description": "An analysis of Pfizer’s own documents regarding the development of its Wuhan coronavirus (COVID-19) vaccine shows that the vaccine was not properly tested for possible adverse effects on male fertility. Later tests showed that the vaccine was actually harmful to sperm. This analysis was conducted by Amy Kelly, program director for Steve Bannon’s program “war […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Pharma,biological weapon,covid-19,Dangerous Medicine,discoveries,immune system,male infertility,men's health,Pfizer,pharmaceutical fraud,reproductive health,science deception,science fraud,spike protein,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-10-05-pfizer-didnt-test-covid-vaccine-male-fertility.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "Pfizer DID NOT test its COVID-19 vaccine for possible effects on male fertility", "cleaned_text": "Pfizer DID NOT test its COVID-19 vaccine for possible effects on male fertility\n\nAn analysis of Pfizer’s own documents regarding the development of its Wuhan coronavirus (COVID-19) vaccine shows that the vaccine was not properly tested for possible adverse effects on male fertility. Later tests showed that the vaccine was actually harmful to sperm.\n\nThis analysis was conducted by Amy Kelly, program director for Steve Bannon’s program “war Room” and the head of the Pfizer documents analysis project of Naomi Wolf’s Daily Clout.\n\nAccording to Kelly’s investigation, Pfizer did not test its mRNA COVID-19 vaccine for “male reproductive toxicity.” This is defined as what adverse events the vaccine is capable of producing that are related to sexual function and fertility in adult males. Pfizer also did not test the vaccine’s negative effects on the sperm of vaccinated men or on offspring born to vaccinated men.\n\nPfizer did not initially conduct studies despite understanding that mRNA material injected into people traveled throughout the body and gathered in organs, including in testes. (Related: Study finds mRNA material in BREAST MILK of vaccinated mothers.)\n\nA later study of the effects of Pfizer’s mRNA COVID-19 vaccine found that the dangerous vaccine resulted in the creation of “anti-sperm antibodies,” or antibodies that treated sperm as invaders, leading to sperm being damaged or killed.\n\nThis study, which came to light at the end of Feb. 2021, was classified by Pfizer as producing an “adverse event of special interest.” Pfizer’s own document names the adverse event – “anti-sperm antibody positive” – as one of the nearly 1,300 adverse events that the COVID-19 vaccine can cause.\n\nAs Kelly pointed out, what this study shows is that Pfizer knew about how its vaccine negatively impacts male fertility since the very beginning. The company also knew at least a year before it made a clearly false statement to the National Institutes of Health in Feb. 2022 when it said that “COVID-19 vaccination does not reduce chances of conception.”\n\n“For nearly a year, then, the FDA [Food and Drug Administration], public health agencies and medical organizations ignored this ’cause of male infertility’ contained in the Pfizer documents – all of which were sent to the FDA, then they lied about it,” wrote Kelly.\n\n“They kept silent for a year and then misled the public, rather than alerting the public,” she continued. Kelly pointed out how the secrecy behind this serious adverse event constitutes a withholding of true informed consent for men.\n\n“By suppressing discussion of this information, public health agencies, medical professionals and governments globally denied and continue to deny men true informed consent,” wrote Kelly. “Contrary to established medical ethics, Pfizer and public health agencies did not disclose the true impacts of mRNA gene therapy vaccines on male fertility and, thus … denied men informed consent,” she concluded.\n\nLearn more about the COVID-19 vaccine’s effects on the body at VaccineDamage.news.\n\nWatch this episode of the “Health Ranger Report” as Mike Adams, the Health Ranger, discusses how the mRNA vaccines for children are designed to depopulate the world by making them permanently infertile.\n\nThis is from the Health Ranger Report channel on Brighteon.com.\n\nThe Zelenko Report with Ann Vandersteel: Pfizer avoided strict regulation thanks to emergency use authorization, says Karen Kingston – Brighteon.TV.\n\nScience truth SHUTOUT: Twitter CENSORS doctor for sharing study showing impact of Pfizer’s COVID-19 vaccine on male fertility.\n\n“Infertility: A Diabolical Agenda” film exposes WHO for engaging in vaccine “population control experiment.”\n\nRecently released Pfizer document shows mRNA COVID-19 vaccine can cause 1,291 different adverse events.\n\nPfizer, government regulators hid smoking gun data showing that COVID jabs cause birth defects and infertility.", "opengraph": {"title": "Pfizer DID NOT test its COVID-19 vaccine for possible effects on male fertility", "type": "article", "url": "https://www.pandemic.news/2022-10-05-pfizer-didnt-test-covid-vaccine-male-fertility.html", "site_name": "Pandemic News", "description": "An analysis of Pfizer’s own documents regarding the development of its Wuhan coronavirus (COVID-19) vaccine shows that the vaccine was not properly tested for possible adverse effects on male fertility. Later tests showed that the vaccine was actually harmful to sperm. This analysis was conducted by Amy Kelly, program director for Steve Bannon’s program “war […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/10/Covid-19-Coronavirus-Pfizer-Syringe-Vaccine-Vial.jpg"}, "tags": ["vaccine damage", "covid-19", "Big Pharma", "science deception", "science fraud", "vaccine injury", "vaccines", "Pfizer", "spike protein", "immune system", "male infertility", "reproductive health", "discoveries", "men's health", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/10/03/pfizers-vaccine-causes-astonishing-drop-in-male-fertility/", "https://behindthefdacurtain.substack.com/p/pfizer-fda-cdc-hid-proven-harms-to", "https://www.naturalnews.com/2022-09-30-study-finds-mrna-material-milk-vaccinated-mothers.html", "https://vaccinedamage.news/", "https://www.brighteon.com/05775661-54e1-4867-85b3-e5948be4390c", "https://www.brighteon.com/channels/hrreport", "https://www.brighteon.com/channels/hrreport", "https://www.naturalnews.com/2022-09-30-pfizer-avoided-regulation-thanks-to-emergency-use-authorization.html", "https://www.naturalnews.com/2022-06-24-twitter-censors-doctor-sharing-vaccine-impact-fertility.html", "https://vaccinedamage.news/2022-06-10-infertility-diabolical-agenda-film-exposes-who-vaccines.html", "https://vaccines.news/2022-03-07-pfizer-document-shows-1291-vaccine-adverse-events.html", "https://vaccineinjurynews.com/2022-05-11-pfizer-government-hid-data-covid-jabs-infertility.html", "https://expose-news.com/2022/10/03/pfizers-vaccine-causes-astonishing-drop-in-male-fertility/", "https://behindthefdacurtain.substack.com/p/pfizer-fda-cdc-hid-proven-harms-to", "https://www.brighteon.com/05775661-54e1-4867-85b3-e5948be4390c", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-10-05-pfizer-didnt-test-covid-vaccine-male-fertility.html&linkname=Pfizer%20DID%20NOT%20test%20its%20COVID-19%20vaccine%20for%20possible%20effects%20on%20male%20fertility", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}