{"result_id": "237040", "URL": "https://pandemic.news/2022-08-18-cdc-scraps-quarantine-distancing-end-vaccine-mandates.html", "timestamp": "2023-04-25 16:46:45 CEST+0200", "meta": {"description": "The Centers for Disease Control and Prevention (CDC) rescinded its guidelines regarding Wuhan coronavirus (COVID-19) quarantine and physical distancing, signaling the collapse of the public health agency’s justification for vaccine mandates. According to the Associated Press, the CDC relaxed its COVID-19 guidance on Aug. 12. Self-isolation upon close contact with someone infected with COVID-19 and […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,CDC,close contact,COVID guidelines,covid-19,health freedom,infections,isolation,medical fascism,Medical Tyranny,natural immunity,outbreak,pandemic,physical distancing,quarantine,vaccine mandates,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-08-18-cdc-scraps-quarantine-distancing-end-vaccine-mandates.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "CDC suddenly scraps quarantine and physical distancing, signaling end of vaccine mandates", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) rescinded its guidelines regarding Wuhan coronavirus (COVID-19) quarantine and physical distancing, signaling the collapse of the public health agency’s justification for vaccine mandates.\n\nAccording to the Associated Press, the CDC relaxed its COVID-19 guidance on Aug. 12. Self-isolation upon close contact with someone infected with COVID-19 and the six-feet physical distancing rule were among the measures relaxed by the public health agency.\n\nEarlier, the public health agency said those who are not up to date on their COVID-19 vaccinations should stay home for at least five days when they come into close contact with a COVID-positive person. But under the new guidelines, the CDC scrapped home isolation – instead urging the use of high-quality face masks for 10 days and a COVID-19 test after five days.\n\nCDC officials justified the move, driven by a recognition that an estimated 95 percent of Americans 16 years old and up have acquired some level of immunity either through vaccination or a previous infection.\n\nGreta Massetti, chief of the CDC’s Field Epidemiology and Prevention Branch, said: “The current conditions of the pandemic are very different from those of the last two years.” Massetti, a senior scientist with the agency, also authored the guidelines.\n\nFurthermore, the CDC dropped guidance recommending students exposed to COVID-19 undergo regular testing – in lieu of home quarantine – as a prerequisite to continue attending in-person classes. It also downgraded guidelines for face coverings, only recommending them in areas with high community transmission or when a person is considered at high risk of severe illness.\n\nNevertheless, the agency reiterated that COVID-positive individuals should quarantine themselves for at least five days regardless of their vaccination status. They can end isolation if they do not experience a fever for 24 hours without taking any medicine.\n\nThe new recommendations, which essentially acknowledge that vaccinated people are not protected from COVID-19 infection, were a boon for lawyers challenging compulsory vaccination. Several of them spoke out in support of the argument that the CDC’s guidelines collapse the justification for vaccine mandates. (Related: Our turn: Americans have every right to sue over covid mandates, especially now that the CDC is backtracking on its guidance.)\n\nAttorney Michael Senger of the New Civil Liberties Alliance (NCLA) pointed out that millions of Americans have lost their livelihoods and faced exclusion “from everyday life activities and basic medical care” because of “a differentiation that the CDC now admits does not make sense.”\n\nAttorney Jenin Younes, Senger’s colleague at the NCLA, wrote in an email that defendants in natural immunity lawsuits the alliance filed will definitely argue that the CDC’s new guidance renders the complaints moot. The NCLA has filed many cases arguing for the superiority of natural immunity over vaccine-induced immunity against COVID-19.\n\n“However, because we argued that their constitutional rights were already violated, and we are seeking recognition of that going forward, the courts should not dismiss the appeals (or cases still pending in lower courts) on mootness grounds,” she added.\n\nAttorney R. Davis Younts said the new CDC guidance “absolutely should” affect military vaccine mandates, even though that is not the case in real life. “The whole justification for denying religious accommodation [requests] is that there’s no safe alternative to the vaccine,” he argued.\n\nDavid Hacker, senior counsel for the First Liberty Institute (FLI), called on the Department of Defense to either “rescind its ill-conceived vaccine mandate or provide religious accommodation” for FLI’s clients – which include members of the Navy and Air Force.\n\nJoshua Yoder, co-founder of U.S. Freedom Flyers (USFF), wrote in an email that the new guidance is “another mile marker in the long march of incompetence from Washington bureaucrats that claims to follow ‘science’ yet this science has been out for well over a year and has been by the CDC and the corporations that are clearly state actors.” USFF challenged vaccine mandates for airline pilots.\n\nYale University epidemiologist Dr. Harvey Risch also put in his two cents on the updated recommendations.\n\n“This implies that mandates based on two-dose vaccination are now useless,” he wrote, adding that the case for boosters is not much stronger. “This was the only potential compelling interest in vaccine mandates.”\n\nVisit CDC.news for more about the public health agency’s COVID-19 guidance.\n\nWatch Courtney Allen of the “Patriot Strong Podcast” talk about the CDC’s updated COVID-19 recommendations below.\n\nThis video is from the Patriot Strong channel on Brighteon.com.\n\nCDC confesses it LIED about dangers of covid vaccines to protect Big Pharma.\n\nDoctors Lee Merritt and Ben Tapper slam CDC over late admission that masks and PCR tests are USELESS – Brighteon.TV.\n\nCDC finally recognizes right of “individuals” to make their own health choices – no more forced covid vaccinations or quarantines.", "opengraph": {"title": "CDC suddenly scraps quarantine and physical distancing, signaling end of vaccine mandates", "type": "article", "url": "https://www.pandemic.news/2022-08-18-cdc-scraps-quarantine-distancing-end-vaccine-mandates.html", "site_name": "Pandemic News", "description": "The Centers for Disease Control and Prevention (CDC) rescinded its guidelines regarding Wuhan coronavirus (COVID-19) quarantine and physical distancing, signaling the collapse of the public health agency’s justification for vaccine mandates. According to the Associated Press, the CDC relaxed its COVID-19 guidance on Aug. 12. Self-isolation upon close contact with someone infected with COVID-19 and […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/08/Cdc-Sign-Center-For-Disease-Control.jpg"}, "tags": ["pandemic", "COVID guidelines", "big government", "covid-19", "isolation", "medical fascism", "quarantine", "vaccine wars", "natural immunity", "close contact", "outbreak", "physical distancing", "infections", "vaccine mandates", "Medical Tyranny", "vaccines", "health freedom", "CDC"], "tweets": [], "movies": [], "links": ["https://www.wnd.com/2022/08/no-reason-shots-cdcs-case-vax-mandates-crumbles/", "https://apnews.com/article/covid-science-health-pandemics-public-ace8870b5e4ac4500aa06964db0544b8", "https://justthenews.com/government/federal-agencies/cdc-walk-back-covid-guidance-vindicates-legal-challenges-mandates", "https://naturalnews.com/2022-08-17-americans-sue-covid-mandates-cdc-backtracks-plandemic.html", "http://medicalfascism.news", "https://www.yale.edu/", "http://cdc.news/", "https://www.brighteon.com/1c705216-f7ae-4820-b7e9-62aad3358f58", "https://www.brighteon.com/channels/PatriotStrongPodcast", "https://cdc.news/2022-08-14-wow-cdc-completely-reverses-course-its-over.html", "https://cdc.news/2022-08-15-cdc-lied-covid-vaccines-protect-big-pharma.html", "https://pandemic.news/2022-07-20-mask-and-pcr-tests-are-useless.html", "https://cdc.news/2022-08-13-cdc-recognizes-individuals-health-choices-covid-vaccination.html", "https://www.wnd.com/2022/08/no-reason-shots-cdcs-case-vax-mandates-crumbles/", "https://apnews.com/article/covid-science-health-pandemics-public-ace8870b5e4ac4500aa06964db0544b8", "https://justthenews.com/government/federal-agencies/cdc-walk-back-covid-guidance-vindicates-legal-challenges-mandates", "https://www.brighteon.com/1c705216-f7ae-4820-b7e9-62aad3358f58", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-08-18-cdc-scraps-quarantine-distancing-end-vaccine-mandates.html&linkname=CDC%20suddenly%20scraps%20quarantine%20and%20physical%20distancing%2C%20signaling%20end%20of%20vaccine%20mandates", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}