{"result_id": "237017", "URL": "https://pandemic.news/2022-09-28-excess-deaths-children-soar-covid-vaccine-rollout.html", "timestamp": "2023-04-25 16:46:30 CEST+0200", "meta": {"description": "Europe has experienced a significant increase in excess deaths among children ever since the European Medicines Agency (EMA) granted Pfizer’s Wuhan coronavirus (COVID-19) vaccine an emergency use authorization for use in younger age groups. According to an investigation conducted by the Expose, between week 22 of 2017 and week 37 of 2021, the average number of excess deaths […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,children's health,covid-19,covid-19 vaccines,Dangerous Medicine,depopulation,Europe,European Union,excess deaths,genocide,pandemic,pharmaceutical fraud,spike protein,Vaccine dangers,Vaccine deaths,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-09-28-excess-deaths-children-soar-covid-vaccine-rollout.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "Excess deaths among children in Europe soar following vaccine rollout for younger age groups", "cleaned_text": "Excess deaths among children in Europe soar following vaccine rollout for younger age groups\n\nEurope has experienced a significant increase in excess deaths among children ever since the European Medicines Agency (EMA) granted Pfizer’s Wuhan coronavirus (COVID-19) vaccine an emergency use authorization for use in younger age groups.\n\nAccording to an investigation conducted by the Expose, between week 22 of 2017 and week 37 of 2021, the average number of excess deaths among children aged 0 to 14 was 169.65. From week 22 of 2021 to week 37 of 2022, the number of excess deaths among children of the same age soared to 1,224. (Related: COVID-19 vaccines are killing shocking numbers of doctors in Canada).\n\nWhat this means is that there has been a 630 percent increase in excess deaths among children aged zero to 14 across Europe since the EMA authorized the use of COVID-19 vaccine for children aged 12 to 15 in May 2021.\n\nThe Expose’s investigation also sought to figure out the increase in excess deaths since the start of the year and it found that there have been 542 reported excess deaths among children aged zero to 14 across Europe from the start of the year up to week 33.\n\nBy the end of 2021, the European Union began rolling out the Pfizer vaccine for children aged five to 11. Children aged 12 and over have also even been offered booster doses. Not surprisingly, the rate of excess deaths following the rollout of COVID-19 vaccines for children five and above has gone up another notch.\n\nFrom 2018 to 2021, the average number of excess deaths among children from the start of those years up to week 33 of each year equates to 63.4. This means that excess deaths among children throughout 2022 so far represent a 755 percent increase compared to the 2018 to 2021 average.\n\nEurope investigating cause of increase in excess deaths\n\nThe Expose first published the results of its investigation into the official mortality figures in Europe at the end of August. Around three weeks following the release of this initial investigation, the European Mortality Monitoring (EuroMoMo) bulletin for week 33 of 2022 admitted that “all-cause mortality for participating European countries show elevated excess mortality.”\n\nEuroMoMo is a weekly monitoring board operated by the Statens Serum Institut, a Danish research institute, with input from epidemiologists with data from 28 partner organizations located in 24 countries all over the continent. EuroMoMo’s week 33 bulletin was the first time any European public health or mortality monitoring board ever admitted that excess mortality rates in Europe were increasing beyond reasonable standards.\n\nThree weeks later, the board once again admitted that “estimates of all-cause mortality for the participating European countries show elevated excess mortality.” Furthermore, the board admitted that excess deaths among children was increasing and that it was conducting an investigation into why.\n\n“Since mid-2021, the accumulated level of mortality in Europe in the age group of 0-14 years seems to have increased,” wrote the board. “The possible explanations are being investigated.”\n\nThe writers at the Expose noted that they aren’t holding much hope “that the authorities will ever admit that these deaths are occurring because of the COVID-19 injections.”\n\n“The fact these excess deaths have only occurred since the EMA first approved the COVID-19 vaccine for children will most likely just be another ‘coincidence’ to add to the long list of ‘coincidences’ that have occurred since early 2020,” they wrote.\n\nLearn more about COVID-19 vaccines at Vaccines.news.\n\nWatch this episode of the “Health Ranger Report” as Dr. Judy Mikovitz explains to Mike Adams how glyphosate is making the COVID-19 vaccines more dangerous.\n\nThis is from the Health Ranger Report channel on Brighteon.com.\n\nHigh Court in India puts Bill Gates on notice over doctor’s death due to COVID-19 vaccine.\n\nVaccinated people 4 times more likely to get infected with COVID, warns Canadian doctor.\n\nRomanian lawmaker GRILLS Big Pharma executives over lack of accountability for dangerous COVID-19 vaccines.\n\nFormer congressional candidate Jane Adams experienced SEVERE side effects from the COVID-19 vaccine she was pressured to take.", "opengraph": {"title": "Excess deaths among children in Europe soar following vaccine rollout for younger age groups", "type": "article", "url": "https://www.pandemic.news/2022-09-28-excess-deaths-children-soar-covid-vaccine-rollout.html", "site_name": "Pandemic News", "description": "Europe has experienced a significant increase in excess deaths among children ever since the European Medicines Agency (EMA) granted Pfizer’s Wuhan coronavirus (COVID-19) vaccine an emergency use authorization for use in younger age groups. According to an investigation conducted by the Expose, between week 22 of 2017 and week 37 of 2021, the average number of excess deaths […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/09/Doctor-Gives-Vaccine-To-Child-Girl-Mother.jpg"}, "tags": ["pandemic", "covid-19", "excess deaths", "Big Pharma", "Vaccine dangers", "Vaccine deaths", "European Union", "genocide", "depopulation", "spike protein", "vaccines", "Europe", "children's health", "covid-19 vaccines", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.shtfplan.com/headline-news/europe-sees-755-increase-in-excess-deaths-among-children-since-ema-approved-covid-vaxx-for-kids", "https://www.naturalnews.com/2022-08-29-covid-vaccines-killing-doctors-in-canada.html", "https://expose-news.com/2022/09/18/eu-forced-investigate-17x-increase-excess-deaths-children/", "https://www.euromomo.eu/bulletins/2022-36", "https://vaccines.news/", "https://www.brighteon.com/48465d3a-7fc9-40dc-8eb5-5eb5b1c45a36", "https://www.brighteon.com/channels/hrreport", "https://www.brighteon.com/channels/hrreport", "https://www.naturalnews.com/2022-09-22-high-court-india-bill-gates-death-vaccine.html", "https://vaccines.news/2022-09-22-vaccinated-more-likely-to-get-infected-covid.html", "https://bigpharmanews.com/2022-09-09-romanian-lawmaker-grills-big-pharma-execs-vaccines.html", "https://vaccines.news/2022-09-08-study-covid-vaccines-shed-spread-via-aerosols.html", "https://newstarget.com/2022-09-01-jane-adams-side-effects-covid-vaccine-pressured.html", "https://www.shtfplan.com/headline-news/europe-sees-755-increase-in-excess-deaths-among-children-since-ema-approved-covid-vaxx-for-kids", "https://www.reuters.com/business/healthcare-pharmaceuticals/countries-vaccinating-children-against-covid-19-2021-06-29/", "https://expose-news.com/2022/09/18/eu-forced-investigate-17x-increase-excess-deaths-children/", "https://www.euromomo.eu/bulletins/2022-36", "https://www.brighteon.com/48465d3a-7fc9-40dc-8eb5-5eb5b1c45a36", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-09-28-excess-deaths-children-soar-covid-vaccine-rollout.html&linkname=Excess%20deaths%20among%20children%20in%20Europe%20soar%20following%20vaccine%20rollout%20for%20younger%20age%20groups", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}