{"result_id": "237007", "URL": "https://pandemic.news/2022-10-28-dj-reveals-horrors-of-covid-vaccine-damage.html", "timestamp": "2023-04-25 16:46:23 CEST+0200", "meta": {"description": "An Australian composer, songwriter, sound designer and disc jockey (DJ) who is internationally renowned for his work is speaking out about how his life has been ruined by Wuhan coronavirus (Covid-19) “vaccination.” Tyson Illingworth, who recently wrote a guest post for Dr. Robert Malone’s Substack blog, says he never could have imagined finding himself struggling […]", "lang": "en", "keywords": "adverse events,bad doctors,badhealth,badmedicine,big government,Big Pharma,big pharma news,Collusion,composer,COVID,Dangerous Medicine,deception,DJ,health freedom,Medical Tyranny,medical violence,pain,pharmaceutical fraud,science deception,suffering,Tyson Illingworth,vaccination,vaccine,vaccine damage,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-10-28-dj-reveals-horrors-of-covid-vaccine-damage.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "DJ goes public with horrors of covid vaccine damage; many excruciating days of pain and suffering", "cleaned_text": "DJ goes public with horrors of covid vaccine damage; many excruciating days of pain and suffering\n\nAn Australian composer, songwriter, sound designer and disc jockey (DJ) who is internationally renowned for his work is speaking out about how his life has been ruined by Wuhan coronavirus (Covid-19) “vaccination.”\n\nTyson Illingworth, who recently wrote a guest post for Dr. Robert Malone’s Substack blog, says he never could have imagined finding himself struggling to live, all because of a shot that his government, in cahoots with Big Pharma, told him was “safe and effective.”\n\nIllingworth took the double-dose Moderna injection series, which is made from messenger RNA (mRNA) technology that we know edits genes and alters DNA. (Related: Malone recently called out the CDC for tampering with data and committing major scientific fraud in approving covid jabs.)\n\n“It is important to know that I am pro-evidence-based science and thought the vaccine was safe for me,” Illingworth writes. “I believed whole heartedly that I was doing ‘the right thing’ by getting vaccinated.”\n\n“I had complete faith and trust in my country’s (Australia) leadership and medical system – that is until I suffered a severe adverse reaction that left me helpless, paralyzed, and with no help from doctors or my government.”\n\nHospital workers rudely denied Illingworth’s covid jab injuries; “there is no way this is the vaccine,” they scoffed\n\nIllingworth was living in California at the time when covid mysteriously appeared, prompting him to return home to Australia. In October 2021, he took the first injection of Moderna, which after just a few days started causing him “unbearable shooting pain and paralysis in my hands and feet.”\n\nAfter contacting a well-respected spinal surgeon for advice, Illingworth was told that he had clearly suffered a “catastrophic neurological failure,” after which he was rushed to the hospital for a two-week stay.\n\n“I was in disbelief and became depressed because I couldn’t believe the vaccine could do this to me, especially when we were all told it was safe and effective and if there was a reaction it would be minor,” Illingworth laments.\n\nIt would turn into a major argument with hospital staff over what caused Illingworth’s neurological damage. He was insistent, based on the surgeon’s advice, that it was caused by the jab, but personnel at the medical facility scoffed at that idea.\n\n“There is no way this is the vaccine,” one of them said in rude disgust.\n\nIllingworth tried to get answers about whether or not he would ever have the ability to walk again, only to be given no clear answer because staff members were “perplexed,” he says, at what they were seeing.\n\n“It was a surreal and lonely experience learning how to walk again, I had no one to turn to who could understand me and give me answers,” Illingworth writes.\n\nAmazingly, Illingworth was advised by the hospital neurologist to get a second injection of Moderna after leaving because “if you don’t get the second one,” he was told, “the first will be redundant.”\n\nIllingworth obeyed that order and got jabbed a second time, which caused him to develop even worse symptoms. He could barely move; his hands were on fire; and it was a major struggle just to get through each day.\n\nA few months later, Illingworth would have to be rushed to the hospital once again in the middle of the night because he was having trouble breathing and continued to develop fevers, uncontrollable shaking, and other disturbing symptoms.\n\nIllingworth was once again mistreated as he was forced into a two-week isolation “quarantine” where he was yelled at by staff and treated like garbage. He survived, but not without lasting neuropathy – be sure to read Illingworth’s full story in his own words.\n\nTo keep up with the latest news about Fauci Flu shots, visit ChemicalViolence.com.", "opengraph": {"title": "DJ goes public with horrors of covid vaccine damage; many excruciating days of pain and suffering", "type": "article", "url": "https://www.pandemic.news/2022-10-28-dj-reveals-horrors-of-covid-vaccine-damage.html", "site_name": "Pandemic News", "description": "An Australian composer, songwriter, sound designer and disc jockey (DJ) who is internationally renowned for his work is speaking out about how his life has been ruined by Wuhan coronavirus (Covid-19) “vaccination.” Tyson Illingworth, who recently wrote a guest post for Dr. Robert Malone’s Substack blog, says he never could have imagined finding himself struggling […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/10/Radio-Podcast-DJ-Recording-Studio.jpg"}, "tags": ["big government", "Big Pharma", "COVID", "deception", "medical violence", "Tyson Illingworth", "pain", "DJ", "vaccination", "science deception", "vaccine", "vaccine damage", "vaccine wars", "big pharma news", "suffering", "Medical Tyranny", "composer", "Collusion", "bad doctors", "adverse events", "vaccines", "health freedom", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://rwmalonemd.substack.com/p/vaccine-damaged-in-australia", "https://naturalnews.com/2022-03-07-robert-malone-cdc-hid-covid-data-fraud.html", "https://rwmalonemd.substack.com/p/vaccine-damaged-in-australia", "http://chemicalviolence.com", "https://rwmalonemd.substack.com/p/vaccine-damaged-in-australia", "https://naturalnews.com/2022-03-07-robert-malone-cdc-hid-covid-data-fraud.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-10-28-dj-reveals-horrors-of-covid-vaccine-damage.html&linkname=DJ%20goes%20public%20with%20horrors%20of%20covid%20vaccine%20damage%3B%20many%20excruciating%20days%20of%20pain%20and%20suffering", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}