{"result_id": "237027", "URL": "https://pandemic.news/2023-01-24-british-vaccine-injury-victims-gather-in-london.html", "timestamp": "2023-04-25 16:46:36 CEST+0200", "meta": {"description": "Britons who suffered vaccine damage from the Wuhan coronavirus (COVID-19) injections gathered in the British capital London on Jan. 21 for the “Truth Be Told” campaign. The event saw several brave and determined victims of the COVID-19 vaccines, family members of those killed by the injections and their supporters take part in the peaceful protest. […]", "lang": "en", "keywords": "Andrew Bridgen,badhealth,badmedicine,BBC,big government,covid-19,Dangerous Medicine,mainstream media,Matt Le Tissier,news cartels,pandemic,revolt,Truth Be Told,uprising,vaccine damage,Vaccine deaths,vaccine injury,vaccine wars,vaccines,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2023-01-24-british-vaccine-injury-victims-gather-in-london.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "British vaccine injury victims gather in London for “Truth Be Told” campaign", "cleaned_text": "British vaccine injury victims gather in London for “Truth Be Told” campaign\n\nBritons who suffered vaccine damage from the Wuhan coronavirus (COVID-19) injections gathered in the British capital London on Jan. 21 for the “Truth Be Told” campaign.\n\nThe event saw several brave and determined victims of the COVID-19 vaccines, family members of those killed by the injections and their supporters take part in the peaceful protest. The London gathering has been just one of many organized by the campaign, which had earlier staged similar gatherings across the United Kingdom.\n\nThe participants met outside the BBC Broadcasting House in central London, where several personalities spoke out in support of those injured and killed by the COVID-19 vaccines. Soccer player-turned-commentator Matt Le Tissier and Member of Parliament (MP) for North West Leicestershire Andrew Bridgen addressed event participants. (Related: MP Christopher Chope urges British government to support individuals suffering from COVID vaccine injuries.)\n\nHealth freedom advocates from across the pond also joined the Jan. 21 demonstration, including Children’s Health Defense founder Robert F. Kennedy, Jr. and mRNA vaccine technology inventor Dr. Robert Malone.\n\nA silent memorial procession following the speeches was held, culminating at the stretch of Downing Street where the offices of the British government are located. The participants then threw white roses across a police border on the street to honor those killed and injured by the COVID-19 vaccines.\n\nDuring their speeches at the Jan. 21 event, the commentator and the lawmaker denounced lies espoused by the establishment about COVID-19.\n\nLe Tissier set his sights on state-owned broadcaster BBC for serving as the mouthpiece of the government. He remarked: “[The BBC], over the last few years, has done more harm to people’s health than any man-made virus could ever do.”\n\n‘You’re meant to hold government accountable on behalf of We The People, but you let us down badly. The majority of people, I believe, now know this. They see you for what you are – a government propaganda arm.”\n\nThe former midfielder for Southampton FC then challenged the mainstream media: “It’s time for you to choose your side. Because we are the many and they are the few, and we are coming for you.”\n\nIn late August 2022, Le Tissier pointed out multiple incidents of soccer players and other athletes keeling over due to cardiac arrest. “I have seen … so many incidents of young, fit, healthy sports people collapsing on the field of play. It’s just not normal,” he told Mark Steyn of GB News at the time.\n\n“Yet the media seems to be normalizing it, and nobody seems to be paying any attention whatsoever to this huge rise that has gone on. For the authorities in charge of these sports to not notice it or not [call] an investigation, I think, is absolutely scandalous.”\n\nMeanwhile, Bridgen challenged the claim that the COVID-19 injections were “100 percent effective.”\n\n“We were told that these novel medical treatments … were 100 percent effective. That was a lie. We were [also] told that they were safe – and I get email after email, message after message, letter after letter from people. All that tells me … that was a lie as well,” he said. “I’m sick to death of the lies. The truth will prevail.”\n\nBridgen was recently suspended from sitting as Conservative MP after reposting an article critical of the COVID-19 vaccines. He accompanied the article from ZeroHedge that outlined the risks of the injections based on U.S. data with this caption: “As one consultant cardiologist said to me this is the biggest crime against humanity since the Holocaust.”\n\nWatch Matt Le Tissier discuss vaccine injuries in athletes from the COVID-19 shot with the New American magazine’s Veronika Kyrylenko.\n\nThis video is from The New American channel on Brighteon.com.\n\nFormer soccer star Matt Le Tissier: Sudden deaths of young, healthy athletes after COVID vaccine rollout need to be investigated.\n\nBritish MP calls for immediate and complete suspension of mRNA COVID-19 vaccines due to adverse effects.\n\nMatt Le Tissier: “I’ve never seen anything like it… Its unbelievable how many sports players are keeling over.”", "opengraph": {"title": "British vaccine injury victims gather in London for “Truth Be Told” campaign", "type": "article", "url": "https://www.pandemic.news/2023-01-24-british-vaccine-injury-victims-gather-in-london.html", "site_name": "Pandemic News", "description": "Britons who suffered vaccine damage from the Wuhan coronavirus (COVID-19) injections gathered in the British capital London on Jan. 21 for the “Truth Be Told” campaign. The event saw several brave and determined victims of the COVID-19 vaccines, family members of those killed by the injections and their supporters take part in the peaceful protest. […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2023/01/BBC-Wanted-1.jpg"}, "tags": ["pandemic", "Truth Be Told", "Wuhan coronavirus", "big government", "covid-19", "vaccine wars", "Vaccine deaths", "mainstream media", "BBC", "revolt", "vaccine injury", "vaccines", "news cartels", "Matt Le Tissier", "Andrew Bridgen", "uprising", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/01/23/truth-be-told-victims-gather-to-raise-awareness/", "https://www.naturalnews.com/2022-03-09-chope-urges-british-government-compensate-vaccine-victims.html", "http://vaccineinjurynews.com", "https://www.lifesitenews.com/news/former-soccer-star-wants-to-know-why-young-athletes-are-dying-and-no-one-seems-to-notice/", "https://www.newswars.com/conservative-british-mp-punished-under-investigation-for-tweet-exposing-covid-vaccines/", "https://vaccineholocaust.org", "https://www.brighteon.com/b1131ffa-0618-4ae9-bb04-c301dda30282", "https://www.brighteon.com/channels/thenewamerican", "https://vaccineinjurynews.com/2022-09-06-healthy-athletes-dying-after-covid-vaccine-rollout.html", "https://vaccinewars.com/2022-12-18-british-parliamentarian-immediate-suspension-mrna-covid-vaccines.html", "https://dangerousmedicine.com/2022-02-02-unbelievable-many-sports-players-are-keeling-over.html", "https://medicalfascism.news/2023-01-16-mp-suspended-investigated-tweeting-against-covid-vaccines.html", "https://expose-news.com/2023/01/23/truth-be-told-victims-gather-to-raise-awareness/", "https://www.lifesitenews.com/news/former-soccer-star-wants-to-know-why-young-athletes-are-dying-and-no-one-seems-to-notice/", "https://www.newswars.com/conservative-british-mp-punished-under-investigation-for-tweet-exposing-covid-vaccines/", "https://www.brighteon.com/b1131ffa-0618-4ae9-bb04-c301dda30282", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2023-01-24-british-vaccine-injury-victims-gather-in-london.html&linkname=British%20vaccine%20injury%20victims%20gather%20in%20London%20for%20%E2%80%9CTruth%20Be%20Told%E2%80%9D%20campaign", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}