{"result_id": "237021", "URL": "https://www.pandemic.news/2022-11-22-8-outrageous-excuses-for-covid-vaccine-deaths.html", "timestamp": "2023-04-25 16:46:32 CEST+0200", "meta": {"description": "Vaccine efficiency might be more believable if the industry would just admit it when their “products” cause more harm than good. Just recall them, like the FDA would recall some meat or milk contaminated with E-coli or salmonella. No persons or organizations are perfect, and especially not the vaccine industrial complex (VIC), that now features […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,chemical violence,conspiracy,Dangerous Medicine,deception,fake news,fauci lies,mainstream media,mRNA death,mRNA DNA,news cartels,pandemic,pharmaceutical fraud,propaganda,science deception,vaccine damage,vaccine death,vaccine injury,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.pandemic.news/2022-11-22-8-outrageous-excuses-for-covid-vaccine-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pandemic.news", "title": "8 Most OUTRAGEOUS EXCUSES for Covid vaccine deaths in 2022", "cleaned_text": "8 Most OUTRAGEOUS EXCUSES for Covid vaccine deaths in 2022\n\nVaccine efficiency might be more believable if the industry would just admit it when their “products” cause more harm than good. Just recall them, like the FDA would recall some meat or milk contaminated with E-coli or salmonella. No persons or organizations are perfect, and especially not the vaccine industrial complex (VIC), that now features Pfizer and Moderna at the forefront of gene therapy and DNA-mutation injection “technology,” also known as mRNA. After the tsunami of injuries and deaths caused by the Fauci Flu shots, the manufacturers have been forced to admit ‘adverse events’ and ‘side effects’ that are affecting a few hundred million people, including chronic inflammation, myocarditis, pericarditis, allergic reactions, miscarriages, and of course, cancer.\n\nThe vaccinated masses are dying in droves, while the fake news industrial complex (FNIC) blames the fully unvaccinated for “filling up hospital beds” – a total myth that has been debunked by science and statistics. Vaccines have already killed more people in total than opioids, gun violence, and vehicle wrecks, combined. The mRNA stabs are the most dangerous “vaccines” ever made, and they don’t even really qualify as vaccines at all. Maybe that’s the problem.\n\nSo now, the FNIC is working in tandem with the VIC to run propaganda cover-excuses right and left, all over the news, including TV, newspapers, websites, and social media. It’s like some dark comedy, the excuses they are using to run cover for vaccine-induced heart attacks, strokes, cancer, and SADS.\n\n8 Most ridiculous cover stories for Covid jab-induced deaths in 2022\n\n#1. Referee whistles: Suddenly, just since the pandemic vaccine campaign began, healthy athletes are suffering cardiac arrest whenever the referee or umpire makes a call.\n\n#2. “Tiny particles in the air may trigger sudden heart attacks” (‘Climate change’ and pollution in Singapore to blame).\n\n#3. Cold showers are now supposedly killing off military members and healthy athletes by shocking them to death with surprise.\n\n#5. “Long Covid” – meaning the long-term adverse events from the mRNA stabs.\n\n#6. “Sudden Arrhythmic Death Syndrome” – you cannot make this stuff up, only the Cleveland Clinic can.\n\n#7. Blood clots from Wuhan Virus (really strange rubbery clots caused by the spike protein injections).\n\n#8. Cancer that went “unaddressed” during the pandemic – really it’s cancer caused by the gene therapy shots that shut off your body’s innate ability to fight cancer.\n\nAccording to the CDC and Fake News Industrial Complex, if you want to live through the pandemic, you cannot do any of the following activities\n\nIn order to survive the man-made Fauci pandemic, you will need to abide by all of the useless mandates dictated by the fake “experts” and the government regulatory agency dictatorship. These include many activities that have never been dangerous before, so get ready to have your mind blown, your immunity compromised, your sanity annihilated, and your common sense dismantled by a conglomeration of ridiculous, unbelievable misinformation and disinformation coming straight from the top.\n• Never play any sports again or attend any sporting events that feature referees or umpires who blow whistles during the game or match. These sudden bursts of noise now cause spontaneous cardiac arrest for perfectly healthy folks (who just got a Fauci Flu jab or two or three).\n• Never go outside again, anywhere, even alone, as there are tiny particles in the atmosphere that can cause your heart to suddenly stop, or your entire immune system to suddenly shut down.\n• Whether you are a perfectly healthy athlete, military member, or airline pilot, never ever take a cold shower again. Before the pandemic, it was perfectly safe, but now (since the clot shots came out) it’s very dangerous and can cause even the most healthy person to drop dead instantly from myocardial infarction.\n• Though kids and teenagers (and many young adults) called ‘gamers’ have enjoyed violent video games (and Hollywood movies that are even worse) for several decades, without anyone dying of a heart attack or stroke, now, since the scamdemic began, these video games can cause you to die instantly by pulmonary embolism. You can’t make this up. Avoid them at all costs.\n• Long Covid means any new health issues that arrive (shortly after getting clot shots) are now simply Covid symptoms that never go away and plague you for life.\n• Cancer cases are now popping up all over the world at an alarming rate, and supposedly COVID is to blame, since nobody got “checked” for cancer the past two years.\n\nBookmark Vaccines.news to your favorite independent websites for updates on experimental gene therapy injections the CDC and fake news claim are “safe and effective” when they’re really dangerous and health-damaging.", "opengraph": {"title": "8 Most OUTRAGEOUS EXCUSES for Covid vaccine deaths in 2022", "type": "article", "url": "https://www.pandemic.news/2022-11-22-8-outrageous-excuses-for-covid-vaccine-deaths.html", "site_name": "Pandemic News", "description": "Vaccine efficiency might be more believable if the industry would just admit it when their “products” cause more harm than good. Just recall them, like the FDA would recall some meat or milk contaminated with E-coli or salmonella. No persons or organizations are perfect, and especially not the vaccine industrial complex (VIC), that now features […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/11/Covid-19-Vaccine-Vial-Close-Up.jpg"}, "tags": ["pandemic", "conspiracy", "vaccine damage", "fake news", "vaccine wars", "mRNA death", "Big Pharma", "science deception", "mainstream media", "vaccine death", "deception", "mRNA DNA", "vaccine injury", "fauci lies", "chemical violence", "news cartels", "propaganda", "pharmaceutical fraud"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/igDETH2kY-c\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/igDETH2kY-c"}], "links": ["https://www.naturalnews.com/2022-11-16-dr-tenpenny-warns-death-tsunami-covid-vaccines.html", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://naturalnews.com/2022-03-19-vaccine-industry-says-whistles-cause-heart-problems.html", "https://www.sciencealert.com/tiny-particles-in-the-air-may-trigger-sudden-heart-attacks-study-suggests", "https://my.clevelandclinic.org/health/diseases/23214-sudden-arrhythmic-death-syndrome", "https://www.sciencealert.com/mounting-evidence-suggests-air-pollution-triggers-autoimmune-diseases", "https://naturalnews.com/2022-11-06-cnn-scrambling-to-cover-for-covid-vaccine-induced-deaths-blaming-alcohol.html", "https://www.deccanchronicle.com/150908/technology-latest/article/side-effects-deaths-due-caused-video-game-addiction", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "http://vaccinedamage.news", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.sciencealert.com/tiny-particles-in-the-air-may-trigger-sudden-heart-attacks-study-suggests", "https://my.clevelandclinic.org/health/diseases/23214-sudden-arrhythmic-death-syndrome", "https://www.naturalnews.com/2022-09-30-which-kills-more-humans-opioids-guns-vaccines.html", "https://www.deccanchronicle.com/150908/technology-latest/article/side-effects-deaths-due-caused-video-game-addiction", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-11-22-8-outrageous-excuses-for-covid-vaccine-deaths.html&linkname=8%20Most%20OUTRAGEOUS%20EXCUSES%20for%20Covid%20vaccine%20deaths%20in%202022", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}