{"result_id": "237005", "URL": "https://pandemic.news/2022-10-18-pr-moderna-pfizer-cdc-vaccine-communications.html", "timestamp": "2023-04-25 16:46:22 CEST+0200", "meta": {"description": "The public relations firm that represents COVID-19 vaccine makers Moderna and Pfizer has members of staff embedded in the vaccine communications division of the Centers for Disease Control and Prevention (CDC) in what is clearly a major conflict of interest. At the heart of the controversy is the New York-based firm Weber Shandwick, who has […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,CDC,conflict of interest,conspiracy,corruption,covid-19,Dangerous Medicine,deception,Moderna,pandemic,Pfizer,pharmaceutical fraud,propaganda,traitors,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-10-18-pr-moderna-pfizer-cdc-vaccine-communications.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "Conflict of interest: PR firm representing Moderna and Pfizer is also working with the CDC to push vaccine propaganda", "cleaned_text": "Conflict of interest: PR firm representing Moderna and Pfizer is also working with the CDC to push vaccine propaganda\n\nThe public relations firm that represents COVID-19 vaccine makers Moderna and Pfizer has members of staff embedded in the vaccine communications division of the Centers for Disease Control and Prevention (CDC) in what is clearly a major conflict of interest.\n\nAt the heart of the controversy is the New York-based firm Weber Shandwick, who has been helping Pfizer’s public relations efforts since 2003. This June, they also took on Moderna as a client after the small biotech firm rose to prominence as one of the forefront COVID-19 vaccine makers.\n\nHowever, it has now emerged that the company also worked for the CDC during the COVID-19 pandemic, helping the agency’s health communications. At this point, it should come as no surprise that the firm was involved in public relations campaigns pushing Americans to get COVID-19 vaccines.\n\nIn 2021 alone, vaccine makers raked in more than $34 billion of profits from the COVID-19 shots, which equals roughly $1000 per second, or $93.5 million per day. This year, they are poised to earn billions of dollars more as booster campaigns get underway with the approach of winter.\n\nThe conflict of interest was made clear when an employee of Weber Shandwick made a LinkedIn post sharing their excitement about upcoming work for the CDC’s National Center for Immunization and Respiratory Diseases (NCIRD).\n\nThey wrote: “So excited to be starting a new role today! I’m joining Weber Shandwick as an Account Director supporting a contract I know well, at the CDC’s NCIRD!”\n\nThe same company also won a government contract worth as much as $50 million to promote flu jabs to Americans. Its responsibilities included distributing articles and posts on social media pushing vaccines, along with press releases to the media. They also worked on ads for the vaccines.\n\nA spokesperson for the PR firm told the Daily Mail: “When we work for organizations in the same sector, we have a thorough vetting and mitigation process to avoid conflicts, including legal review, separate and distinct teams and strong confidentiality protocols.”\n\nAs outrageous as it may be, it is not surprising that employees of Pfizer’s and Moderna’s PR firms could have a hand in producing public information and guidance on COVID-19 vaccine policies.\n\nWill this conflict of interest ever be investigated?\n\nA spokesperson for Senator Rand Paul (R-KY), who has long expressed concerns about potential conflicts of interest in the CDC’s vaccine recommendations, noted: “This new reporting that CDC had a contract with the same PR firm representing the manufacturers of the COVID-19 vaccine raises serious concerns.”\n\n“The American people deserve transparency and these conflicts of interest will be thoroughly investigated by our committee next year,” the spokesperson added. Sen. Paul will be next in line after November’s midterm elections as the top Republican on the HELP Committee, which is responsible for overseeing the CDC.\n\nInvestigative journalist Paul D. Thacker highlighted a former Weber Shandwick employee’s LinkedIn account, where the employee said his role with the PR firm for the CDC “focuses on boosting vaccination rates for flu, HPV, whooping cough, and COVID-19.”\n\nHarvard University Professor of Medicine Dr. Martin Kulldorf, who previously worked with the CDC to develop vaccine safety evaluation systems, commented: “It is concerning that CDC talking points are provided by the same public relations company that works for the vaccine manufacturers.”\n\nHe added: “To ensure public trust, CDC must provide accurate, science-based evidence on vaccines. They have failed to do so.”\n\nEarlier this month, a Pfizer executive admitted that the pharmaceutical firm did not know if its COVID-19 vaccine would actually stop the transmission of the disease before it made its way to the market last year. Nevertheless, the notion of getting vaccinated to help others was used to guilt countless individuals into getting the jab who may not have done so otherwise.", "opengraph": {"title": "Conflict of interest: PR firm representing Moderna and Pfizer is also working with the CDC to push vaccine propaganda", "type": "article", "url": "https://www.pandemic.news/2022-10-18-pr-moderna-pfizer-cdc-vaccine-communications.html", "site_name": "Pandemic News", "description": "The public relations firm that represents COVID-19 vaccine makers Moderna and Pfizer has members of staff embedded in the vaccine communications division of the Centers for Disease Control and Prevention (CDC) in what is clearly a major conflict of interest. At the heart of the controversy is the New York-based firm Weber Shandwick, who has […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/10/CDC-Vaccine-Coronavirus-Syringe.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "covid-19", "vaccine wars", "Big Pharma", "Moderna", "deception", "vaccines", "Pfizer", "pharmaceutical fraud", "conflict of interest", "traitors", "corruption", "propaganda", "CDC"], "tweets": [], "movies": [], "links": ["https://disinformationchronicle.substack.com/p/weber-shandwick-provides-pr-for-moderna", "https://www.dailymail.co.uk/health/article-11303017/PR-firm-represents-Pfizer-Moderna-sits-CDC-vaccine-advisory-committee.html", "https://www.harvard.edu/", "http://vaccines.news", "https://www.dailymail.co.uk/health/article-11303017/PR-firm-represents-Pfizer-Moderna-sits-CDC-vaccine-advisory-committee.html", "https://disinformationchronicle.substack.com/p/weber-shandwick-provides-pr-for-moderna", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-10-18-pr-moderna-pfizer-cdc-vaccine-communications.html&linkname=Conflict%20of%20interest%3A%20PR%20firm%20representing%20Moderna%20and%20Pfizer%20is%20also%20working%20with%20the%20CDC%20to%20push%20vaccine%20propaganda", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}