{"result_id": "237032", "URL": "https://www.pandemic.news/2023-03-15-ccdh-knowingly-suppressed-vaccine-injury-content.html", "timestamp": "2023-04-25 16:46:40 CEST+0200", "meta": {"description": "A TWITTER FILES bombshell just dropped revealing how a foreign, dark money group (CCDH) targeting the free speech of US citizens may have been indirectly funded by the US government, military, and taxpayers themselves. Moreover, CCDH is part of a vast Censorship Enterprise which knowingly called for the suppression of true stories and content related to injuries […]", "lang": "en", "keywords": "banned,big government,Big Tech,CCDH,Censorship,conspiracy,cyber war,fascism,First Amendment,free press,free speech,glitch,Social media,speech police,suppressed,tech giants,technocrats,thought police,Twitter,Tyranny,vaccine,vaccine damage,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.pandemic.news/2023-03-15-ccdh-knowingly-suppressed-vaccine-injury-content.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pandemic.news", "title": "BREAKING: A ‘vast censorship enterprise’ funded by taxpayers knowingly suppressed vaccine injury content", "cleaned_text": "A TWITTER FILES bombshell just dropped revealing how a foreign, dark money group (CCDH) targeting the free speech of US citizens may have been indirectly funded by the US government, military, and taxpayers themselves. Moreover, CCDH is part of a vast Censorship Enterprise which knowingly called for the suppression of related to injuries from the experimental mRNA jabs.\n\nIn a remarkable example of the media acting as a proxy for NGOs like the Center for Countering Digital Hate (CCDH), newly released emails show that the Financial Times gave Twitter until the end of the day to provide a “steer” on whether the so-called “disinformation dozen,” of which I am included, should be deleted from their platform as urged by CCDH.\n\nThe clear message in the email above from the Financial Times/CCDH: either Twitter delete the twelve accounts held by the so-called “disinformation dozen,” or brace for bad headlines. Incidentally, our 13-year old GreenMedInfo.com Twitter account was deleted only two weeks earlier immediately after I called out CCDH for publishing a digital hit list with my name on it. Moreover, CCDH’s campaign to deplatform 12 US citizens was revealed to be a ‘faulty narrative, without evidence,’ on August 18th, 2021, when Facebook VP of Content Policy revealed that CCDH’s statistics were inaccurate by an astronomical margin of 300 fold. It should be noted that not a single retraction or correction from CCDH, a government agency, nor several thousand media outlets has occurred since this came to light.\n\nMatt Taibbi, the four time NY Times bestselling author and American journalist, has done extensive reporting on the so-called TwitterFiles, revealing a ‘vast Censorship Industrial Complex’ at play between the US government, NGOs, and the commercial media, together which conspired against and succeeded in depriving countless US citizens of their first amendment rights.\n\nTaibbi gave testimony on the subject to the House Judiciary Committee on March 9th, 2023, at the Hearing on the Weaponization of the Federal Government on the Twitter Files, summarizing his findings as follows:\n\n“We learned Twitter, Facebook, Google, and other companies developed a formal system for taking in moderation “requests” from every corner of government: the FBI, DHS, HHS, DOD, the Global Engagement Center at State, even the CIA. For every government agency scanning Twitter, there were perhaps 20 quasi-private entities doing the same, including Stanford’s Election Integrity Project, Newsguard, the Global Disinformation Index, and others, many taxpayer-funded. A focus of this fast-growing network is making lists of people whose opinions, beliefs, associations, or sympathies are deemed “misinformation,” “disinformation,” or “malinformation.” The latter term is just a euphemism for “true but inconvenient.” Undeniably, the making of such lists is a form of digital McCarthyism. Ordinary Americans are not just being reported to Twitter for “deamplification” or de-platforming, but to firms like PayPal, digital advertisers like Xandr, and crowdfunding sites like GoFundMe. These companies can and do refuse service to law-abiding people and businesses whose only crime is falling afoul of a distant, faceless, unaccountable, algorithmic judge. As someone who grew up a traditional ACLU liberal, this mechanism for punishment without due process is horrifying. Another troubling aspect is the role of the press, which should be the people’s last line of defense. But instead of investigating these groups, journalists partnered with them. If Twitter declined to remove an account right away, government agencies and NGOs would call reporters for the New York Times, Washington Post, and other outlets, who in turn would call Twitter demanding to know why action had not been taken. Effectively, news media became an arm of a state-sponsored thought-policing system.”", "opengraph": {"title": "BREAKING: A ‘vast censorship enterprise’ funded by taxpayers knowingly suppressed vaccine injury content", "type": "article", "url": "https://www.pandemic.news/2023-03-15-ccdh-knowingly-suppressed-vaccine-injury-content.html", "site_name": "Pandemic News", "description": "A TWITTER FILES bombshell just dropped revealing how a foreign, dark money group (CCDH) targeting the free speech of US citizens may have been indirectly funded by the US government, military, and taxpayers themselves. Moreover, CCDH is part of a vast Censorship Enterprise which knowingly called for the suppression of true stories and content related to injuries […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2023/03/Censorship-Man-Censored-Tape-Mouth.jpg"}, "tags": ["conspiracy", "big government", "speech police", "Twitter", "technocrats", "banned", "vaccine", "First Amendment", "glitch", "Big Tech", "cyber war", "vaccine wars", "free press", "tech giants", "Social media", "thought police", "suppressed", "CCDH", "Tyranny", "fascism", "Censorship", "vaccine injury", "vaccines", "free speech", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://greenmedinfo.com/blog/breaking-vast-censorship-enterprise-funded-taxpayers-knowingly-suppressed-vaccine", "https://greenmedinfo.com/blog/twitter-deletes-greenmedinfos-13-year-old-account-after-calling-out-ccdhs-digital2", "https://greenmedinfo.com/blog/center-countering-digital-hate-publishes-digital-hitlist-including-greenmedinfo-f3", "https://greenmedinfo.com/blog/breaking-disinformation-dozen-faulty-narrative-no-evidence-says-facebook-despite-1", "https://thetruthaboutcancer.com/twitter-files-part-16/?mpweb=144-9922668-409748735", "https://www.racket.news/p/my-statement-to-congress", "https://judiciary.house.gov/committee-activity/hearings/hearing-weaponization-federal-government-twitter-files", "https://greenmedinfo.com/blog/breaking-vast-censorship-enterprise-funded-taxpayers-knowingly-suppressed-vaccine", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2023-03-15-ccdh-knowingly-suppressed-vaccine-injury-content.html&linkname=BREAKING%3A%20A%20%E2%80%98vast%20censorship%20enterprise%E2%80%99%20funded%20by%20taxpayers%20knowingly%20suppressed%20vaccine%20injury%20content", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}