{"result_id": "237001", "URL": "https://www.pandemic.news/2023-01-30-many-vaccine-injured-people-are-killing-themselves.html", "timestamp": "2023-04-25 16:46:19 CEST+0200", "meta": {"description": "Brianne Dressen, a former preschool teacher who was injured by the Wuhan coronavirus (COVID-19) vaccine, lamented that many others like her have committed suicide. “There is a vast majority of people that do complete suicide in the COVID vaccine injury world. They do not have a supportive family,” she told Jan Jekielek, the host of […]", "lang": "en", "keywords": "American Thought Leaders,bad doctors,badhealth,badmedicine,Brianne Dressen,covid-19,dangerous doctors,Dangerous Medicine,Epoch TV,gaslighting,Jan Jekielek,pandemic,suicide,vaccine,vaccine damage,vaccine injury,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.pandemic.news/2023-01-30-many-vaccine-injured-people-are-killing-themselves.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pandemic.news", "title": "MAKE IT STOP: Many vaccine-damaged people are killing themselves", "cleaned_text": "MAKE IT STOP: Many vaccine-damaged people are killing themselves\n\nBrianne Dressen, a former preschool teacher who was injured by the Wuhan coronavirus (COVID-19) vaccine, lamented that many others like her have committed suicide.\n\n“There is a vast majority of people that do complete suicide in the COVID vaccine injury world. They do not have a supportive family,” she told Jan Jekielek, the host of Epoch TV‘s “American Thought Leaders” on the program’s Jan. 19 edition.\n\n“There are only two that I know of that were from families that were supportive and watching them. The rest were people that their family members had walked away.”\n\nDressen told Jekielek that she was fortunate to have a supportive family, which she said was the only reason why she is still alive. Had she been without a family to back her up, she would have been dead by now and her children would have lost their mother. Dressen also mentioned her husband who believed in her, validated her and stood by her every step of the way.\n\nAside from the vaccine-induced serious reactions she suffered like tinnitus and electric sensations all over her body, she also experienced insomnia and suicidal intentions. (Related: Documents and videos reveal life-threatening adverse effects of COVID-19 vaccines.)\n\nMoreover, she also lamented how doctors are refusing to take their reports of vaccine injuries seriously. Dressen said most medical professionals attributed their health issues caused by the COVID-19 vaccine to mere “anxiety.”\n\nDressen admitted it was hard to cope and learn to live with the condition she had. She came to the point of wanting to end it all, and wrote farewell letters to her two children. However, she realized the need for her to think straight, overcome her issues and learn to accept her condition for their sake.\n\n“I have a choice every day when I wake up. I have a choice to accept my body sucks and it hurts. It doesn’t mean that I’m okay with it, but it means that I can accept it and go ‘yes, this is part of my life.'”\n\nVaccine-injured woman ends her life as family abandoned her\n\nThe former preschool teacher also shared the story of a woman who suffered COVID-19 vaccine injury. The woman decided to end her life through Canada’s medical assistance in dying program after she was abandoned by her family.\n\n“I know that people see that as just a number, but that’s a real human being. That is someone that deserved better and that is someone that deserved to have some dignity and respect. She didn’t have any choice in what happened to her,” Dressen said.\n\n“She should be just like a cancer patient. A cancer patient gets their diagnosis. They sat down with their family members and their medical teams. And they say, ‘OK, here’s a plan. Family, this is how you can support this person.'”\n\nDressen, however, lamented that “the opposite is happening here.”\n\n“You get a reaction and boom, you’re done. There is no help for you, and the help that you do get is going to be from random people you find on the internet.”\n\nWatch Brianne Dressen’s interview with Jan Jekielek on Epoch TV‘s “American Thought Leaders” below.\n\nThis video is from the Red Voice Media channel on Brighteon.com.\n\nDoctors share THEIR OWN vaccine injury horror stories, revealing that vaccines are devastating the medical profession.\n\nTruth for Health Foundation launches new global vaccine reporting system to track covid jab injuries.\n\nBritish vaccine injury victims gather in London for “Truth Be Told” campaign.\n\nCreator of mRNA tech banned on Twitter for warning public about COVID vaccine adverse effects.", "opengraph": {"title": "MAKE IT STOP: Many vaccine-damaged people are killing themselves", "type": "article", "url": "https://www.pandemic.news/2023-01-30-many-vaccine-injured-people-are-killing-themselves.html", "site_name": "Pandemic News", "description": "Brianne Dressen, a former preschool teacher who was injured by the Wuhan coronavirus (COVID-19) vaccine, lamented that many others like her have committed suicide. “There is a vast majority of people that do complete suicide in the COVID vaccine injury world. They do not have a supportive family,” she told Jan Jekielek, the host of […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2023/01/Woman-Depression-Lockdown-Covid-19.jpg"}, "tags": ["pandemic", "covid-19", "Epoch TV", "vaccine", "vaccine injury", "bad doctors", "American Thought Leaders", "Brianne Dressen", "dangerous doctors", "suicide", "gaslighting", "Wuhan coronavirus", "Jan Jekielek", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/18087321-539e-4ab4-8690-8661314627a6", "https://naturalnews.com/2021-11-09-documents-videos-reveal-dangers-of-covid-vaccines.html", "https://vaccineinjurynews.com", "http://www.brighteon.com/18087321-539e-4ab4-8690-8661314627a6", "https://www.brighteon.com/channels/redvoicemedia", "https://naturalnews.com/2021-08-06-doctors-share-vaccine-injury-horror-stories-devastating.html", "https://naturalnews.com/2022-04-18-foundation-launches-global-covid-vaccine-reporting-system.html", "https://vaccineinjurynews.com/2023-01-24-british-vaccine-injury-victims-gather-in-london.html", "https://naturalnews.com/2022-01-04-mrna-tech-creator-suspended-on-twitter.html", "https://www.brighteon.com/18087321-539e-4ab4-8690-8661314627a6", "http://www.theepochtimes.com/brianne-dressen-gaslit-by-doctors-and-loved-ones-some-vaccine-injured-are-making-the-ultimate-choice-to-end-their-suffering_4994340.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2023-01-30-many-vaccine-injured-people-are-killing-themselves.html&linkname=MAKE%20IT%20STOP%3A%20Many%20vaccine-damaged%20people%20are%20killing%20themselves", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}