{"result_id": "237019", "URL": "https://pandemic.news/2022-09-29-leaked-video-israeli-researchers-covid-vaccine-damage.html", "timestamp": "2023-04-25 16:46:31 CEST+0200", "meta": {"description": "An Israeli journalist by the name of Yaffa Shir-Raz obtained video footage that was supposed to remain private, showing Israeli researchers discussing known adverse events associated with covid “vaccines.” In the video, the researchers are heard calling out the Pfizer injection by name, as the company’s mRNA (messenger RNA) injection was administered exclusive of all […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,CDC,Censored Science,chemical violence,conspiracy,corruption,COVID,Dangerous Medicine,deception,Israel,Operation Warp Speed,research,traitors,vaccine,vaccine damage,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-09-29-leaked-video-israeli-researchers-covid-vaccine-damage.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "LEAKED: Video shows Israeli researchers discussing covid vaccine adverse events that were hidden from the public", "cleaned_text": "LEAKED: Video shows Israeli researchers discussing covid vaccine adverse events that were hidden from the public\n\nAn Israeli journalist by the name of Yaffa Shir-Raz obtained video footage that was supposed to remain private, showing Israeli researchers discussing known adverse events associated with covid “vaccines.”\n\nIn the video, the researchers are heard calling out the Pfizer injection by name, as the company’s mRNA (messenger RNA) injection was administered exclusive of all others in Israel.\n\nThe Israeli Ministry of Health (MoH) commissioned the investigation and later held a meeting about it to discuss. That meeting happened virtually this past June, the video footage of which was supposed to remain an internal affair.\n\nThe video was leaked, however, revealing that the Israeli government has known for several months now – and likely even long before – that Fauci Flu shots are deadly. (Related: Israel is the same country that called for endless covid booster shots to be taken annually like flu shots.)\n\nIsraeli MoH refuses to answer questions about disparity between meeting and public report\n\nAccording to the researchers, a phenomenon known as rechallenge was observed, meaning adverse events reoccurred or worsened following injection with additional doses or “boosts” of the covid vaccination.\n\nTen percent of women who complained of menstrual issues, for instance, showed a positive rechallenge. The same was also observed for other adverse events in other demographics.\n\nDr. Mati Berkovitch, head of the research team and a pediatric specialist, says rechallenge events change a causal link “from possible to definitive,” meaning the shots are definitely the cause.\n\nSasha Zhurat, another researcher who served as the main presenter during the meeting, added that rechallenge “helps us to establish the causal relationship.”\n\nThe advantage of the surveillance system and analysis that was performed, she added, “is not only to identify the symptoms but also to link them to the vaccine.”\n\nIn the months following the meeting, the Israeli MoH put out a public report that “causally differed,” to quote The Epoch Times, from what was discussed during the meeting.\n\n“The report presents all the cases that were reported in close proximity to the receipt of the coronavirus vaccine, and does not necessarily indicate a causal relationship between receiving the vaccine and the reported phenomenon,” MoH said in the report.\n\nWhen pressed for answers about these differences, a spokesperson responded with a press release dated Sept. 19, 2021, that did not answer any questions but simply announced the “establishment of a dedicated information headquarters for the fight against the coronavirus.”\n\nNobody directly involved in the research would comment on the matter either. They either did not respond at all or responded by referring all inquiries to the Israeli government.\n\nAccording to Dr. Robert Malone, the inventor of mRNA technology, rechallenge is a “standard pharmaceutical clinical trial practice” that can, in fact, provide definitive proof of causality.\n\n“The reports of rechallenge in the Israeli study do not prove causality,” he did admit, adding that it still “strongly suggests and supports causality.”\n\nDr. Harvey Risch, a professor emeritus of epidemiology at the Yale School of Public Health, also commented on the matter to support the findings of the researchers concerning rechallenge, calling them “essentially correct.”\n\n“The current evidence supports a causal association between mRNA COVID-19 vaccination and myocarditis and pericarditis,” further added Dr. Tom Shimabukuro, a health researcher at the U.S. Centers for Disease Control and Prevention (CDC).\n\nThe CDC remains insistent that covid injections are safe and effective, and that most adverse events are mild and short-lived. The agency refuses to admit that the shots are killing people left and right while leaving many more chronically ill.\n\nAs the covid scamdemic unravels, we will keep you abreast of the latest at Pandemic.news.", "opengraph": {"title": "LEAKED: Video shows Israeli researchers discussing covid vaccine adverse events that were hidden from the public", "type": "article", "url": "https://www.pandemic.news/2022-09-29-leaked-video-israeli-researchers-covid-vaccine-damage.html", "site_name": "Pandemic News", "description": "An Israeli journalist by the name of Yaffa Shir-Raz obtained video footage that was supposed to remain private, showing Israeli researchers discussing known adverse events associated with covid “vaccines.” In the video, the researchers are heard calling out the Pfizer injection by name, as the company’s mRNA (messenger RNA) injection was administered exclusive of all […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/09/Covid-19-Coronavirus-Nurse-Vaccine-Syringe-Vial.jpg"}, "tags": ["conspiracy", "vaccine damage", "big government", "vaccine wars", "research", "COVID", "vaccine", "deception", "Israel", "Operation Warp Speed", "vaccine injury", "vaccines", "traitors", "chemical violence", "corruption", "Censored Science", "CDC"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/israeli-investigators-find-covid-19-vaccines-cause-side-effects-leaked-video-recording_4748592.html", "https://rumble.com/v1jhaan-israeleak-part-1b-rechallenge.html", "https://naturalnews.com/2021-12-12-israel-says-covid-booster-shots-endless.html", "https://pandemic.news", "https://www.theepochtimes.com/israeli-investigators-find-covid-19-vaccines-cause-side-effects-leaked-video-recording_4748592.html", "https://rumble.com/v1jhaan-israeleak-part-1b-rechallenge.html", "https://naturalnews.com/2021-12-12-israel-says-covid-booster-shots-endless.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-09-29-leaked-video-israeli-researchers-covid-vaccine-damage.html&linkname=LEAKED%3A%20Video%20shows%20Israeli%20researchers%20discussing%20covid%20vaccine%20adverse%20events%20that%20were%20hidden%20from%20the%20public", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}