{"result_id": "237013", "URL": "https://pandemic.news/2022-09-07-vaccine-narrative-shifting-for-updated-pandemic-treaty.html", "timestamp": "2023-04-25 16:46:27 CEST+0200", "meta": {"description": "The Wuhan coronavirus (COVID-19) vaccine narrative is shifting in preparation for the World Health Organization‘s (WHO) enforcement of the “updated” pandemic treaty in December 2022, according to JD Rucker. The NOQ Report editor-in-chief revealed during an episode of “The JD Rucker Show” that the globalists are deliberately switching the narrative from “vaccines are safe and effective” to […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,conspiracy,deception,enslaved,fascism,freedom,global tyranny,globalists,great reset,health freedom,insanity,JD Rucker,Klaus Schwab,pandemic treaty,propaganda,vaccine wars,vaccines,wef,WHO", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-09-07-vaccine-narrative-shifting-for-updated-pandemic-treaty.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "JD Rucker: Globalists deliberately changing vaccine narrative to clear the way for revised pandemic treaty", "cleaned_text": "JD Rucker: Globalists deliberately changing vaccine narrative to clear the way for revised pandemic treaty\n\nThe Wuhan coronavirus (COVID-19) vaccine narrative is shifting in preparation for the World Health Organization‘s (WHO) enforcement of the “updated” pandemic treaty in December 2022, according to JD Rucker.\n\nThe NOQ Report editor-in-chief revealed during an episode of “The JD Rucker Show” that the globalists are deliberately switching the narrative from “vaccines are safe and effective” to “jabs are actually wreaking havoc on mankind.”\n\n“Imagine what the response will be to a pandemic treaty when they admit that they put together vaccines that do more harm than good – and as a matter of fact, we’ve got tens of millions, maybe hundreds of millions, or maybe billions of people whose immune systems are depleted, whose hearts are in danger, whose blood is clotting,” he said.\n\nRucker continued that the blame will then be put on politicians including former President Donald Trump’s “Operation Warp Speed,” health agencies and Big Pharma companies themselves.\n\n“They’re then going to tell us that the WHO needs to have complete control over all of this and are already in the process of reviving the pandemic treaty. And we thought: ‘That got shut down in May,’ but it’s coming back,” he said. (Related: WHO attempts to take control of future plandemics in a “totalitarian power grab” move.)\n\nAccording to a Global Research article, the WHO is moving ahead with plans to enact a new or revised international pandemic preparedness treaty, despite encountering setbacks earlier this summer after dozens of countries, primarily outside the Western world, objected to the plan.\n\nThe new agreement, which was agreed to be pursued during a meeting of WHO’s intergovernmental negotiating body, would create a new global framework for responding to pandemics.\n\nRucker pointed out that in order to take full control, the elite globalists, including World Economic Forum (WEF) Founder Klaus Schwab and Big Tech mogul Bill Gates, would not care about losing face admitting that vaccines are truly ineffective.\n\n“What is important to them is to be able to surveil and to control us. They will be using central banks and digital currencies, which will be attached to vaccine passports,” Rucker warned.\n\nRucker said the public should thank whistleblowers such as mRNA technology inventor Dr. Robert Malone, internist and cardiologist Dr. Peter McCullough and entrepreneur and truth advocate Steve Kirsch. McCullough is among the many doctors promoting ivermectin as part of a “multi-drug protocol” aimed at early treatment of COVID-19. Meanwhile, Kirsch has bravely stood up against the unsafe COVID-19 shots.\n\n“We can be happy about the truth coming out now, but things are about to get really nasty,” the host said.\n\nInstead of basking in this victory, however, Rucker exhorted people to start ramping up their defense. He added that the globalists are not going to stop, take their losses and just move on to something else.\n\n“In the end, what they want is for people to be forced. They would want to win and force the people to take as many jabs as possible, whether it’s the new polio monkeypox or hemorrhagic fever vaccines to carry on their depopulation efforts.”\n\nHe also warned that “we are witnessing in real-time the beginning of the next phase – a pandemic panic theater – which is the beginning of the final phase of the rollout of the Great Reset.\n\n“It’s happening much faster than I had anticipated, but it is happening now,” he concluded.\n\nWatch the full segment of the “JD Rucker Show” below.\n\nThis video is from JD Rucker channel on Brighteon.com.\n\nAustrian MP Gerald Hauser: WHO is abolishing our democracy.\n\nWHO partners with German telecom company to create global COVID-19 vaccine passport app.\n\nKlaus Schwab issues THREAT to Brazilian president for refusing to sign WHO pandemic treaty.", "opengraph": {"title": "JD Rucker: Globalists deliberately changing vaccine narrative to clear the way for revised pandemic treaty", "type": "article", "url": "https://www.pandemic.news/2022-09-07-vaccine-narrative-shifting-for-updated-pandemic-treaty.html", "site_name": "Pandemic News", "description": "The Wuhan coronavirus (COVID-19) vaccine narrative is shifting in preparation for the World Health Organization‘s (WHO) enforcement of the “updated” pandemic treaty in December 2022, according to JD Rucker. The NOQ Report editor-in-chief revealed during an episode of “The JD Rucker Show” that the globalists are deliberately switching the narrative from “vaccines are safe and effective” to […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/09/WHO-symbol.jpg"}, "tags": ["conspiracy", "big government", "great reset", "Big Pharma", "deception", "globalists", "wef", "propaganda", "pandemic treaty", "vaccine wars", "enslaved", "global tyranny", "insanity", "WHO", "JD Rucker", "fascism", "Klaus Schwab", "vaccines", "freedom", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/6d1e2007-4adf-441c-b916-10dd1b212a90", "https://naturalnews.com/2022-06-17-who-attempts-take-control-of-future-plandemics.html", "https://www.globalresearch.ca/who-renews-push-global-pandemic-treaty-world-bank-creates-1-billion-fund-vaccine-passports/5789543", "http://greatreset.news", "https://www.brighteon.com/6d1e2007-4adf-441c-b916-10dd1b212a90", "https://www.brighteon.com/channels/jdrucker", "https://naturalnews.com/2022-06-02-who-abolishing-our-democracy-says-austrian-mp.html", "https://pandemic.news/2022-06-01-who-german-telecom-covid-vaccine-passport-app.html", "https://freedom.news/2022-05-20-who-pandemic-treaty-spells-doom-for-democracy.html", "https://greatreset.news/2022-05-27-schwab-threatens-bolsonaro-refusing-sign-pandemic-treaty.html", "https://www.brighteon.com/6d1e2007-4adf-441c-b916-10dd1b212a90", "https://www.globalresearch.ca/who-renews-push-global-pandemic-treaty-world-bank-creates-1-billion-fund-vaccine-passports/5789543", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-09-07-vaccine-narrative-shifting-for-updated-pandemic-treaty.html&linkname=JD%20Rucker%3A%20Globalists%20deliberately%20changing%20vaccine%20narrative%20to%20clear%20the%20way%20for%20revised%20pandemic%20treaty", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}