{"result_id": "237024", "URL": "https://pandemic.news/2022-12-23-german-parliament-investigation-covid-vaccine-injuries-deaths.html", "timestamp": "2023-04-25 16:46:34 CEST+0200", "meta": {"description": "Following the discovery that upwards of 30 percent of all deaths that he and his team have evaluated are linked to covid “vaccination,” Bundestag (German federal parliament) vice president Wolfgang Kubicki is calling for a full investigatory autopsy to be conducted on all deceased who died shortly after getting the needle. All unexplained deaths that […]", "lang": "en", "keywords": "awakening,badhealth,badmedicine,big government,Big Pharma,biological weapon,Censored Science,COVID,Dangerous Medicine,depopulation,Germany,investigation,pandemic,pharmaceutical fraud,spike protein,vaccine damage,Vaccine deaths,vaccine injury,vaccines,Wolfgang Kubicki", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-12-23-german-parliament-investigation-covid-vaccine-injuries-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "VP of German Parliament calls for full investigation into covid “vaccine” injuries and deaths", "cleaned_text": "VP of German Parliament calls for full investigation into covid “vaccine” injuries and deaths\n\nFollowing the discovery that upwards of 30 percent of all deaths that he and his team have evaluated are linked to covid “vaccination,” Bundestag (German federal parliament) vice president Wolfgang Kubicki is calling for a full investigatory autopsy to be conducted on all deceased who died shortly after getting the needle.\n\nAll unexplained deaths that occur within 14 days post-injection need to be looked at with a fine-toothed comb, Kubicki argues. He wants all such cases to also be automatically registered as a suspected covid jab-related case with the Paul Ehrlich Institute (PEI).\n\nInvestigating a “link between vaccination, myocarditis, and death is imperative,” the Free Democratic Party (FDP) politician said.\n\nIn a speech, Kubicki referenced a recently published study by Peter Schirmacher, the chief pathologist at the Heidelberg University Clinic. That study, mentioned earlier, found that at least 30 percent of all deaths are now occurring not long after the deceased got “vaccinated” for covid.\n\n“We are talking about a relevant number that makes it necessary to approach this problem systematically,” Kubicki said, adding that health authorities need to “regularly” conduct autopsies on all people who die within two weeks of injection.\n\n“That also makes sense because the conditional approval of these vaccines took place under enormous time pressure,” he added. (Related: Earlier this year, German Dr. Sonja Reitz pegged covid jabs as the cause of her country’s “excess death” problem.)\n\nGermany health policy spokesman says Schirmacher study “shows how little we know” about covid jabs even after two years\n\nIf covid shots were really safe and effective as claimed, none of this would be bubbling to the surface like this. The fact that it is shows that something went seriously wrong – probably by design, based on all that we now know.\n\nTino Sorge, the health policy spokesman for the Christian Democratic Union of Germany (CDU), a prominent political party, believes that the Schirmacher study should serve as a serious wake-up call to German politicians to get their butts in gear and actually investigate these things already.\n\n“Two years after the first covid vaccination, it is high time for a more open approach to vaccination side effects and vaccination damage,” Sorge said, adding that the study itself is worrying “because it shows how little we know about the risks of the vaccines even after two years.”\n\nNow is the time, Sorge added, to start aggressively collecting and publishing all data associated with injuries and deaths potentially caused by covid shots. To not do this is to continue putting public health at risk with experimental chemical and biological drugs.\n\nSchirmacher himself also spoke to WELT, a German media outlet, warning that much more research is necessary to assess vaccine damage if public health is to be preserved from further devastation.\n\n“There are important unanswered questions that should be clarified either through comprehensive registration of all undesirable effects or as part of further research in the sense of vaccination improvement, vaccination indication, and civil protection,” Schirmacher said.\n\n“Are there any genetic factors or certain previous illnesses – for example Autoimmune diseases – that predispose to severe vaccination consequences? Vaccination consequences are vaccine-dependent – but which characteristics and components of the vaccine determine this? Do certain types of applications play a role?”\n\nBILD, another German news outlet, likewise addressed the matter, drawing attention to the growing number of politicians who are demanding further investigations into covid jab safety.\n\nIn the comments, several readers wrote that this is more than just a “problem” – it is genocide.\n\n“Every last criminal involved in unleashing these deadly poisons needs to hang,” one of them wrote.\n\nThe latest news coverage about covid injections can be found at Vaccines.news.", "opengraph": {"title": "VP of German Parliament calls for full investigation into covid “vaccine” injuries and deaths", "type": "article", "url": "https://www.pandemic.news/2022-12-23-german-parliament-investigation-covid-vaccine-injuries-deaths.html", "site_name": "Pandemic News", "description": "Following the discovery that upwards of 30 percent of all deaths that he and his team have evaluated are linked to covid “vaccination,” Bundestag (German federal parliament) vice president Wolfgang Kubicki is calling for a full investigatory autopsy to be conducted on all deceased who died shortly after getting the needle. All unexplained deaths that […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/12/Coronavirus-Vaccine-Vials-Covid-19.jpg"}, "tags": ["pandemic", "vaccine damage", "Wolfgang Kubicki", "big government", "Big Pharma", "Vaccine deaths", "COVID", "investigation", "vaccine injury", "depopulation", "pharmaceutical fraud", "spike protein", "vaccines", "awakening", "Censored Science", "biological weapon", "Germany"], "tweets": [], "movies": [], "links": ["https://rairfoundation.com/breaking-german-parliament-vice-president-calls-for-investigation-into-covid-vaccine-deaths-and-damages-video/", "https://naturalnews.com/2022-02-09-german-doctor-covid-vaccines-cause-excess-mortality.html", "http://Vaccines.news", "https://rairfoundation.com/breaking-german-parliament-vice-president-calls-for-investigation-into-covid-vaccine-deaths-and-damages-video/", "https://naturalnews.com/2022-02-09-german-doctor-covid-vaccines-cause-excess-mortality.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-12-23-german-parliament-investigation-covid-vaccine-injuries-deaths.html&linkname=VP%20of%20German%20Parliament%20calls%20for%20full%20investigation%20into%20covid%20%E2%80%9Cvaccine%E2%80%9D%20injuries%20and%20deaths", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}