{"result_id": "237026", "URL": "https://pandemic.news/2022-09-07-officials-admit-covid-shots-cause-side-effects.html", "timestamp": "2023-04-25 16:46:36 CEST+0200", "meta": {"description": "Despite the insistence of Big Pharma and world health leaders that the Wuhan coronavirus (COVID-19) vaccines are safe, many recorded cases confirm that they are linked to different adverse side effects. Even German officials admitted in a tweet that coronavirus vaccines produce more serious side effects than most public health officials would admit to the public. […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,covid-19,Dangerous Medicine,Germany,pandemic,pharmaceutical fraud,spike protein,truth,vaccine damage,Vaccine injuries,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-09-07-officials-admit-covid-shots-cause-side-effects.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "Germany’s Federal Ministry of Health admits 1 in 5,000 COVID-19 vaccine doses cause adverse side effects", "cleaned_text": "Germany’s Federal Ministry of Health admits 1 in 5,000 COVID-19 vaccine doses cause adverse side effects\n\nDespite the insistence of Big Pharma and world health leaders that the Wuhan coronavirus (COVID-19) vaccines are safe, many recorded cases confirm that they are linked to different adverse side effects. Even German officials admitted in a tweet that coronavirus vaccines produce more serious side effects than most public health officials would admit to the public.\n\nOn July 20, 2022, the German Federal Ministry of Health posted a shocking tweet where it revealed that one out of every 5,000 COVID-19 vaccines causes “serious” side effects.\n\nTranslated from German, the tweet read: “One in 5,000 people [sic] is affected by a serious side effect after a COVID-19 #vaccination. If you suspect #sideffects, get medical attention and report your symptoms to @PEI_Germany.”\n\nPEI-Germany or the Paul Ehrlich Institute (PEI) is Germany’s federal agency, medical regulatory body and research institution for vaccines and biomedicines. (Related: Germany to revive mask mandate in September despite declining COVID-19 cases.)\n\nAccording to journalist Alex Berenson, this one in 5,000 figure could be “a sharp underestimate” because side effect reporting systems for drugs and vaccines are often voluntary.\n\nThe COVID vaccine safety data used by the German Federal Ministry of Health to make this announcement is derived from a PEI safety report on side effects and vaccine complications occurring between December 27, 2020, and March 31, 2022. The report revealed that the rate of serious adverse reactions was 0.2 per 1,000 doses or one in 5,000 doses of coronavirus shots – not one in 5,000 COVID-19 vaccine recipients.\n\nThis means 5,000 administered doses of COVID-19 vaccines could be given to as few as 1,250 to 1,600 people, assuming they all receive at least three to four doses of the vaccine.\n\nMeanwhile, the Centers for Disease Control and Prevention (CDC) webpage listed some worrying side effects of COVID-19 vaccines. Those documented so far include:\n• Anaphylaxis – Anaphylaxis is a severe type of allergic reaction that can occur after any kind of vaccination. Estimates suggest there are at least five cases per one million vaccine doses administered.\n• Guillain-Barre Syndrome (GBS) – Guillain-Barre Syndrome (GBS) is a rare disorder where the body’s immune system mistakenly attacks and damages nerve cells, causing muscle weakness and sometimes paralysis. GBS is more common among men aged 50 years and older.\n• Myocarditis and pericarditis – Myocarditis and pericarditis are inflammatory heart conditions. The former refers to inflammation of the heart muscle while the latter is the inflammation of the outer lining of the heart. Most cases have been reported after people received Pfizer or Moderna mRNA COVID-19 vaccines, especially among male adolescents and young adults.\n• Thrombosis with thrombocytopenia syndrome (TTS) – Thrombosis with thrombocytopenia syndrome (TTS) is a rare and severe adverse event that causes blood clots in large blood vessels and low platelets or blood cells that help form clots.\n• Death – From December 14, 2020, through August 31, 2022, over 610 million doses of coronavirus vaccines were administered in the United States. During this time, the Vaccine Adverse Event Reporting System (VAERS) received 16,257 preliminary reports of death (0.0027 percent) among those who were vaccinated. Continued monitoring has revealed that there were nine deaths causally linked to J&J/Janssen COVID-19 vaccines.\n\nThe CDC also cited data from the Vaccine Safety Datalink showing that the rate of GBS within three weeks after getting the Johnson & Johnson (J&J) shot was surprisingly 21 times higher than the rate of GBS within three weeks after getting an mRNA shot from either Moderna or Pfizer.\n\nWithin 42 days of receiving the J&J vaccine, the rate of GBS was 11 times higher than Moderna or Pfizer.\n\nUnderreporting of adverse effects is also very likely given the known historical rates of underreporting to the nation’s passive vaccination safety surveillance system.\n\nVisit Vaccines.news for more information about the side effects linked to coronavirus vaccines and booster shots.\n\nWatch the video below to learn more about CovidVaccineVictims.com, a website that features testimonies from people who experienced COVID-19 vaccine injuries.\n\nThis video is from the right2speak channel on Brighteon.com.\n\nStudy finds 29% of teenagers develop heart problems following second dose of Pfizer’s mRNA COVID-19 vaccine.\n\nThe vaccine agenda was designed to bring down the economy.", "opengraph": {"title": "Germany’s Federal Ministry of Health admits 1 in 5,000 COVID-19 vaccine doses cause adverse side effects", "type": "article", "url": "https://www.pandemic.news/2022-09-07-officials-admit-covid-shots-cause-side-effects.html", "site_name": "Pandemic News", "description": "Despite the insistence of Big Pharma and world health leaders that the Wuhan coronavirus (COVID-19) vaccines are safe, many recorded cases confirm that they are linked to different adverse side effects. Even German officials admitted in a tweet that coronavirus vaccines produce more serious side effects than most public health officials would admit to the public. […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/09/Mother-Child-Upset-Scared-Covid-19-Masks.jpg"}, "tags": ["pandemic", "covid-19", "Big Pharma", "vaccines", "pharmaceutical fraud", "spike protein", "truth", "Vaccine injuries", "vaccine damage", "biological weapon", "Germany"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/1-in-5000-covid-shots-result-in-serious-side-effects-german-health-officials-admit.html", "https://childrenshealthdefense.org/defender/germany-covid-vaccine-side-effects/", "https://www.pei.de/EN/home/home-node.html", "https://naturalnews.com/2022-07-19-germany-revives-mask-mandates-despite-declining-cases.html", "https://alexberenson.substack.com/p/the-german-government-admits-hundreds", "https://www.naturalpedia.com/allergy-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.naturalpedia.com/myocarditis-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.naturalpedia.com/thrombocytopenia-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.vaccines.news/", "https://www.brighteon.com/46c74b61-6c1f-482a-b939-235416219fac", "https://www.brighteon.com/channels/right2speak", "https://naturalnews.com/2022-09-01-vaccines-reprogram-immune-system-attack-organs.html", "https://naturalnews.com/2022-08-12-teenagers-develop-heart-problems-second-pfizer-dose.html", "https://naturalnews.com/2022-08-11-covid-vaccine-injuries-support-group-faces-censorship.html", "https://naturalnews.com/2022-08-12-vaccine-agenda-was-designed-to-bring-down-economy.html", "https://www.naturalhealth365.com/1-in-5000-covid-shots-result-in-serious-side-effects-german-health-officials-admit.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://childrenshealthdefense.org/defender/germany-covid-vaccine-side-effects/", "https://alexberenson.substack.com/p/the-german-government-admits-hundreds", "https://www.brighteon.com/46c74b61-6c1f-482a-b939-235416219fac", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-09-07-officials-admit-covid-shots-cause-side-effects.html&linkname=Germany%E2%80%99s%20Federal%20Ministry%20of%20Health%20admits%201%20in%205%2C000%20COVID-19%20vaccine%20doses%20cause%20adverse%20side%20effects", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}