{"result_id": "237023", "URL": "https://pandemic.news/2023-01-23-jj-cancels-hiv-vaccine-failing-clinical-trial.html", "timestamp": "2023-04-25 16:46:34 CEST+0200", "meta": {"description": "Big Pharma company Johnson & Johnson (J&J) has announced that it has discontinued the creation of an HIV vaccine after a large clinical trial found that the experimental treatment was not effective at preventing infections. The trial in question was a phase 3 clinical trial – known as the Mosaico trial – J&J had organized […]", "lang": "en", "keywords": "AIDs,badhealth,badmedicine,badscience,Big Pharma,Clinical trials,HIV,HIV vaccine,human immunodeficiency virus,Johnson & Johnson,Mosaico trial,vaccine development,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2023-01-23-jj-cancels-hiv-vaccine-failing-clinical-trial.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "Johnson & Johnson cancels HIV vaccine study after failing clinical trial", "cleaned_text": "Big Pharma company Johnson & Johnson (J&J) has announced that it has discontinued the creation of an HIV vaccine after a large clinical trial found that the experimental treatment was not effective at preventing infections.\n\nThe trial in question was a phase 3 clinical trial – known as the Mosaico trial – J&J had organized along with the National Institute of Allergy and Infectious Diseases, the HIV Vaccine Trials Network and the United States Army’s Medical Research and Development Command.\n\nThe trial enrolled 3,900 volunteers at over 50 sites in multiple countries and studied the effect of the vaccine in gay men and transgender people, two groups that are considered more vulnerable to HIV. (Related: JABBED UNTIL DEATH: Endless mRNA jabs are now planned for multiple vaccine types, including influenza, HIV, RSV, Pneumococcal, Zika and many more.)\n\nThe trial’s failure marks yet another setback in J&J’s search for a vaccine against a virus that can rapidly mutate and find new ways to evade the immune system’s natural defenses. This also comes more than a year after J&J’s last failed study on a potential HIV vaccine.\n\n“We are disappointed with this outcome and stand in solidarity with the people and communities vulnerable to and affected by HIV,” said Penny Heaton, J&J’s global therapeutic area head for vaccines, in a statement. “We remain steadfast in our commitment to advancing innovation in HIV, and we hope the data from Mosaico will provide insights for future efforts to develop a safe and effective vaccine.”\n\nThe J&J vaccine was based on “mosaic” immunogens that amalgamated virus elements from several strains of HIV in the belief that this is meant to spur broadly protective immune responses. This particular vaccine featured components from four HIV subtypes delivered via a common cold virus.\n\nJ&J vaccine just the latest experimental HIV vaccine to fail\n\nThe failure of the Mosaico trial is just the latest failed attempt to develop an HIV vaccine. In 2021, a Phase 2b trial of a similar HIV vaccine candidate was halted when a data and safety monitoring board determined that the vaccine was not preventing infections. This trial, known as the Imbokodo trial, was studying the vaccine candidate’s effects in women in sub-Saharan Africa.\n\nBefore these last two trials, at least five other experimental HIV vaccines, tested over nine trials, have failed to show efficacy at the Phase 3 stage of clinical trials. This latest failure could influence investors to shift their resources to alternatives in the field of HIV.\n\n“I’m not sure we know exactly where the next big investment is going to come from because there’s not an obvious vaccine candidate in HIV that is next up in our efficacy pipeline,” said Mitchell Warren, executive director of the AIDS Vaccine Advocacy Coalition.\n\n“This is another reason why this result is disappointing. This was the last true product in development, and the other activities in the field, which are very exciting … [are] quite upstream. Important upstream science, but not products that are going to be in efficacy trials anytime soon.”\n\nStephaun Wallace, director of external relations for the HIV Vaccine Trials Network, admitted that work will only continue on a potential HIV vaccine if the public continues to support these efforts with interest and investment.\n\n“I’m pretty certain that, with continued public support and interest in this area, we will see the day that an HIV vaccine is developed,” he said.\n\nLearn more about how dangerous experimental vaccines are at Vaccines.news.\n\nWatch this clip from InfoWars discussing how the BBC admitted that the Wuhan coronavirus (COVID-19) vaccine contains HIV.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nClaims of a new, deadlier HIV variant could be attempt to frighten people into accepting another plandemic.\n\nDr. Fauci ran grotesque AIDS vaccine experiments on minority children in the 90s, causing organ failure, deformities, brain damage.\n\nMoringa oleifera lam. leaf powder can help HIV patients stay healthy during antiretroviral therapy.\n\nPowerful anti-HIV medicine discovered in Asian herb that might out-perform all synthetic drugs.\n\nJ&J recalls continue: HIV drug found to contain trace levels of dangerous fungicide.", "opengraph": {"title": "Johnson & Johnson cancels HIV vaccine study after failing clinical trial", "type": "article", "url": "https://www.pandemic.news/2023-01-23-jj-cancels-hiv-vaccine-failing-clinical-trial.html", "site_name": "Pandemic News", "description": "Big Pharma company Johnson & Johnson (J&J) has announced that it has discontinued the creation of an HIV vaccine after a large clinical trial found that the experimental treatment was not effective at preventing infections. The trial in question was a phase 3 clinical trial – known as the Mosaico trial – J&J had organized […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2023/01/HIV-AIDS-Virus-Infection.jpg"}, "tags": ["vaccine wars", "human immunodeficiency virus", "HIV vaccine", "Big Pharma", "Mosaico trial", "HIV", "Clinical trials", "Johnson & Johnson", "vaccines", "vaccine development", "AIDs"], "tweets": [], "movies": [], "links": ["https://www.biopharmadive.com/news/johnson-johnson-hiv-vaccine-stop-study-ineffective-mosaico/640612/", "https://www.reuters.com/business/healthcare-pharmaceuticals/jj-discontinue-hiv-vaccine-trial-2023-01-18/", "https://www.statnews.com/2023/01/18/hiv-vaccine-being-developed-by-johnson-johnson-fails-clinical-trial/", "https://naturalnews.com/2022-08-19-endless-mrna-jabs-planned-for-multiple-diseases.html", "https://vaccines.news/", "https://www.brighteon.com/8c598065-8d1c-4306-b94d-81a389456700", "https://www.brighteon.com/channels/infowarsnetwork", "https://www.brighteon.com/channels/infowarsnetwork", "https://vaccines.news/2022-02-25-deadlier-hiv-variant-attempt-to-frighten-people.html", "https://newstarget.com/2021-11-21-fauci-behind-aids-vaccine-experiments-on-minority-children-in-the-90s.html", "https://naturalnews.com/2018-06-21-moringa-oleifera-lam-leaf-powder-can-help-hiv-patients-stay-healthy-during-antiretroviral-therapy.html", "https://medicine.news/2017-07-31-powerful-anti-hiv-medicine-discovered-in-asian-herb-that-might-out-perform-all-synthetic-drugs.html", "https://naturalnews.com/032461_Johnson_&_fungicide.html", "https://www.biopharmadive.com/news/johnson-johnson-hiv-vaccine-stop-study-ineffective-mosaico/640612/", "https://www.reuters.com/business/healthcare-pharmaceuticals/jj-discontinue-hiv-vaccine-trial-2023-01-18/", "https://www.statnews.com/2023/01/18/hiv-vaccine-being-developed-by-johnson-johnson-fails-clinical-trial/", "https://www.brighteon.com/8c598065-8d1c-4306-b94d-81a389456700", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2023-01-23-jj-cancels-hiv-vaccine-failing-clinical-trial.html&linkname=Johnson%20%26%20Johnson%20cancels%20HIV%20vaccine%20study%20after%20failing%20clinical%20trial", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}