{"result_id": "237022", "URL": "https://pandemic.news/2023-01-25-german-government-admits-covid-vaccines-aids-symptoms.html", "timestamp": "2023-04-25 16:46:33 CEST+0200", "meta": {"description": "The government of Germany recently admitted that an “alarming number” of people vaccinated against the Wuhan coronavirus (COVID-19) are developing “AIDS-like symptoms.” New data released by German authorities strongly suggests that fully vaccinated individuals have started developing full-blown vaccine-acquired immunodeficiency syndrome, or VAIDS. (Related: History repeats itself: Holocaust survivor goes into hiding after German court […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,biological weapon,covid-19,Dangerous Medicine,excess deaths,Germany,honest,immune system,omicron,pandemic,pharmaceutical fraud,spike protein,truth,vaccine damage,Vaccine deaths,vaccine injury,vaccines,VAIDS", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2023-01-25-german-government-admits-covid-vaccines-aids-symptoms.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "German government admits COVID-19 vaccines are causing people to develop AIDS-like symptoms", "cleaned_text": "The government of Germany recently admitted that an “alarming number” of people vaccinated against the Wuhan coronavirus (COVID-19) are developing “AIDS-like symptoms.”\n\nNew data released by German authorities strongly suggests that fully vaccinated individuals have started developing full-blown vaccine-acquired immunodeficiency syndrome, or VAIDS. (Related: History repeats itself: Holocaust survivor goes into hiding after German court authorizes her transfer to psychiatric institution for forced COVID-19 vaccination.)\n\nAs of press time, around 76 percent of the German population is fully vaccinated, and another 1.58 percent is partially vaccinated. The country has also administered around 77 COVID-19 vaccine booster doses per 100 people, suggesting a very high rate of triple or even quadruple vaccination.\n\nHowever, data shows that vaccinated individuals are more likely to get infected by COVID-19, particularly the post-vaccine omicron variant. According to German government data, only 186 of the 6,788 omicron cases studied were unvaccinated individuals. This shows that the vaccinated omicron case incidence was 57 per one percent of the population, while the unvaccinated omicron case incidence was just 7.02 per one percent of the population.\n\nMeaning, the vaccinated were 8.12 times more likely to be infected with the omicron variant than the unvaccinated in Germany.\n\n“Vaccines allegedly help develop immunity by imitating an infection,” wrote the Expose in its investigation of excess deaths and VAIDS in Germany. “Once the imitation infection induced by the vaccine goes away, the body is left with a supply of ‘memory’ t-cells and antibodies that will remember how to fight that disease in the future.”\n\n“So, when the authorities state that the effectiveness of the vaccines weakens over time, what they really mean is that the performance of your immune system weakens over time,” continued the Expose.\n\nIf the likeliness of infection isn’t enough, the data released by the German government also showed that the country suffered over 102,000 excess deaths in 2022, a 276 percent increase on recorded excess deaths in the year 2020, when the COVID-19 pandemic was allegedly at its height and prior to the introduction of the experimental vaccines.\n\nThe data is only up until week 49 of 2022. In 2020, there were only 27,292 recorded excess deaths by week 49. In 2021, the first full year of COVID-19 vaccination, recorded excess deaths nearly tripled to 77,049.\n\nIn its conclusion, the Expose noted that this data, which came from the German government itself, should be enough to make the German public question whether the COVID-19 vaccines had the intended effect of protecting the populace against the coronavirus, or “if fully vaccinated Germans did indeed develop” VAIDS.\n\n“The government and pharmaceutical companies will of course continue to deny any responsibility and insist that the vaccine is safe and expensive,” the website wrote.\n\nBut if the COVID-19 vaccines are not responsible for giving the public AIDS and leading to a record-breaking 276 percent increase in excess deaths in 2022, then the German government needs to provide the public with an explanation of what exactly caused 100,000 more Germans to die that year.\n\nUnfortunately, it is unlikely the German government will provide an answer to these questions. In fact, the release of this data seems to have had the opposite effect, with Germany joining other European Union members in imposing new COVID-19-related restrictions, such as bringing back testing requirements for travelers.\n\nLearn more about how deadly the COVID-19 vaccines are by reading the latest articles at VaccineDeaths.com.\n\nWatch this episode of the “Health Ranger Report” as Mike Adams, the Health Ranger, talks to Ed Dowd about the catastrophic implications of vaccine deaths and disabilities.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nGovernment and Big Pharma plan to taint food supply by injecting animals with mRNA vaccines.\n\nSteve Kirsch: Data shows COVID-19 vaccine is the MOST DANGEROUS vaccine ever made.\n\nPanel of experts: More and more young people are dying because of COVID-19 vaccines.\n\nStudy finds 84% increase in incidence of cardiac-related DEATH among men under 40 following mRNA vaccination.\n\nNewly released CDC data shows nearly a third of people who got vaccinated experienced significant adverse events.", "opengraph": {"title": "German government admits COVID-19 vaccines are causing people to develop AIDS-like symptoms", "type": "article", "url": "https://www.pandemic.news/2023-01-25-german-government-admits-covid-vaccines-aids-symptoms.html", "site_name": "Pandemic News", "description": "The government of Germany recently admitted that an “alarming number” of people vaccinated against the Wuhan coronavirus (COVID-19) are developing “AIDS-like symptoms.” New data released by German authorities strongly suggests that fully vaccinated individuals have started developing full-blown vaccine-acquired immunodeficiency syndrome, or VAIDS. (Related: History repeats itself: Holocaust survivor goes into hiding after German court […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2023/01/VAIDS-Syringe-Vaccine.jpg"}, "tags": ["pandemic", "vaccine damage", "big government", "excess deaths", "covid-19", "Big Pharma", "Vaccine deaths", "vaccine injury", "vaccines", "pharmaceutical fraud", "spike protein", "truth", "VAIDS", "immune system", "honest", "omicron", "biological weapon", "Germany"], "tweets": [], "movies": [], "links": ["https://newspunch.com/german-govt-bombshell-alarming-number-of-vaccinated-are-developing-aids/", "https://www.naturalnews.com/2023-01-15-holocaust-survivor-ordered-by-german-court-forced-vaccination.html", "https://ourworldindata.org/covid-vaccinations", "http://immunesystem.news", "https://www.bloomberg.com/news/articles/2023-01-20/germany-saw-180-000-excess-deaths-during-three-years-of-covid?sref=jB82HHlm", "https://vaccinedeaths.com/", "https://www.brighteon.com/5d8c7046-3c45-4026-846b-c8565c8bbc0d", "https://www.brighteon.com/channels/hrreport", "https://www.brighteon.com/channels/hrreport", "https://vaccines.news/2023-01-18-government-big-pharma-to-taint-food-supply.html", "https://www.naturalnews.com/2022-11-08-kirsch-covid-vaccine-most-dangerous-ever-made.html", "https://www.naturalnews.com/2022-10-28-experts-more-young-people-dying-covid-vaccines.html", "https://vaccinedeaths.com/2022-10-13-men-cardiac-related-death-after-mrna-vaccination.html", "https://vaccinedamage.news/2022-10-07-cdc-data-vaccinated-experience-adverse-events.html", "https://newspunch.com/german-govt-bombshell-alarming-number-of-vaccinated-are-developing-aids/", "https://expose-news.com/2023/01/22/c19-vaccine-induced-aids-death-scandal-germany/", "https://ourworldindata.org/covid-vaccinations", "https://www.bloomberg.com/news/articles/2023-01-20/germany-saw-180-000-excess-deaths-during-three-years-of-covid?sref=jB82HHlm", "https://www.brighteon.com/5d8c7046-3c45-4026-846b-c8565c8bbc0d", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2023-01-25-german-government-admits-covid-vaccines-aids-symptoms.html&linkname=German%20government%20admits%20COVID-19%20vaccines%20are%20causing%20people%20to%20develop%20AIDS-like%20symptoms", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}