{"result_id": "237029", "URL": "https://pandemic.news/2023-02-22-who-vaccines-most-successful-public-health-interventions.html", "timestamp": "2023-04-25 16:46:38 CEST+0200", "meta": {"description": "The World Health Organization (WHO) is claiming that vaccinations are among the “most successful and cost-effective public health interventions” – a sentiment that did not quite sit well with many. On its official website, the global health body lauded vaccinations – disguised under the less-threatening “immunization” – as “one of modern medicine’s greatest success stories.” […]", "lang": "en", "keywords": "badhealth,badmedicine,covid-19,deception,lies,Medical Tyranny,mortality rate,Office for National Statistics,pandemic,United Kingdom,vaccine,vaccine damage,Vaccine deaths,World Health Organization,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2023-02-22-who-vaccines-most-successful-public-health-interventions.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "WHO claims vaccines among the “most successful and cost-effective public health interventions” despite high vaccine mortality rates", "cleaned_text": "WHO claims vaccines among the “most successful and cost-effective public health interventions” despite high vaccine mortality rates\n\nThe World Health Organization (WHO) is claiming that vaccinations are among the “most successful and cost-effective public health interventions” – a sentiment that did not quite sit well with many.\n\nOn its official website, the global health body lauded vaccinations – disguised under the less-threatening “immunization” – as “one of modern medicine’s greatest success stories.”\n\nThe WHO’s endorsement of vaccinations also extends to that of the injection for the Wuhan coronavirus (COVID-19). But Patrick Tims, staff writer for NaturalHealth365, begged to differ.\n\n“The widely accepted narrative is that public health interventions are economically efficient and a net positive for the human condition. Yet we know this narrative is a pure lie, given the fact that the [COVID-19 vaccine] has caused hundreds of thousands of deaths,” he wrote.\n\nTims further cited information from the WHO’s webpage about COVID-19, which claimed that getting injected with the clot shots “provide strong protection against serious illness, hospitalization and death. Moreover, the global health body cited “some evidence” that getting the vaccine will make it less likely for people to pass the virus on to others.\n\n“The WHO wants you to blindly accept that the decision to get injected is a public service that will eventually halt the spread of this deadly virus,” he pointed out, reminding people that the COVID-19 vaccines ultimately “do not protect against infection nor prevent transmission.”\n\nIn fact, the COVID-19 shots actually cause more harm than good – as evidenced by the reports of serious adverse reactions following injections. Most prominent among them are the blood clots and the cardiac inflammation frequently linked to the mRNA vaccines.\n\nCOVID shots are actually the “most successful and cost-effective” depopulation measure\n\nTo back up his point, Tims cited a Dec. 28, 2022 report by the Daily Expose regarding deaths in England caused by the COVID-19 vaccine. The report zoomed in on a July 6, 2022 report by the U.K. Office for National Statistics (ONS) that broke down deaths based on age and COVID-19 vaccination status from January to May of that year.\n\nThe report found that Britons 18 to 69 years old who were injected with at least one dose of the COVID-19 vaccine reported the highest mortality rates from January to May. Among the 70- to 79-year-old cohort, those injected with two doses or more reported the highest mortality. For those above 80 years of age, those injected with at least one shot of the COVID-19 vaccine reported higher mortality rates than unvaccinated individuals in the cohort. (Related: U.K. government says vaccinated are dying at a rate 286% higher than unvaccinated.)\n\nMoreover, the mortality rate of unvaccinated individuals across all cohorts never went beyond the 50 percent mark for the five months reported.\n\nThe Expose mentioned that based on the ONS report, “the COVID-19 vaccines are proving to be deadly, with the vaccinated experiencing significantly higher mortality rates than the unvaccinated in every age group.”\n\n“These alarming figures quietly published by the [British] government, cannot be ignored. It is crucial that we address the dangers of these vaccines and take action to protect ourselves and our loved ones,” the outlet noted.\n\nTims also put in his two cents on the report, saying that Downing Street’s “shocking admission” about the deaths caused by the COVID-19 vaccine would conflict with the WHO’s statements.\n\n“If you were to force officials from the U.K. to sit in a room with representatives from WHO to discuss the safety and efficacy of the COVID shots, you would witness quite the cognitive dissonance play out,” he wrote.\n\n“As soon as you embrace that idea that you’ve been lied to, you’ll begin to question the WHO’s endgame. How can a supposedly charitable organization turn a blind eye to the negative health consequences of the COVID shots? Critical thinkers rightfully question whether the COVID shots are a means to a nefarious end that will never be fully revealed to the masses.”\n\nWatch Martin Brodel talk about the British government’s revelation that the COVID-19 vaccines are linked to “hundreds of thousands of deaths” below.\n\nThis video is from the Martin Brodel channel on Brighteon.com.\n\n“Infertility: A Diabolical Agenda” film exposes WHO for engaging in vaccine “population control experiment.”\n\nAnalysis of 13 months of UK data shows “vaccines” cause more deaths for all age groups.\n\nWHO now openly admitting that vaccines cause more polio than actual wild virus.\n\nData show excess mortality all around the world due to covid “vaccines.”", "opengraph": {"title": "WHO claims vaccines among the “most successful and cost-effective public health interventions” despite high vaccine mortality rates", "type": "article", "url": "https://www.pandemic.news/2023-02-22-who-vaccines-most-successful-public-health-interventions.html", "site_name": "Pandemic News", "description": "The World Health Organization (WHO) is claiming that vaccinations are among the “most successful and cost-effective public health interventions” – a sentiment that did not quite sit well with many. On its official website, the global health body lauded vaccinations – disguised under the less-threatening “immunization” – as “one of modern medicine’s greatest success stories.” […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2023/02/Flu-Vaccine-Injection-Needle-Arm-Skin.jpg"}, "tags": ["pandemic", "covid-19", "United Kingdom", "Vaccine deaths", "vaccine", "deception", "World Health Organization", "Medical Tyranny", "Office for National Statistics", "lies", "mortality rate", "Wuhan coronavirus", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/diabolical-who-considers-covid-shots-one-of-the-most-successful-and-cost-effective-public-health-interventions.html", "https://www.who.int/news-room/facts-in-pictures/detail/immunization", "http://vaccinedeaths.com", "https://www.who.int/news-room/questions-and-answers/item/coronavirus-disease-(covid-19)-vaccines", "https://expose-news.com/2022/12/28/top-secret-covid-vaccination-deadier-than-disease/", "https://www.naturalnews.com/2022-01-12-uk-government-vaccinated-dying-286-percent-higher-unvaccinated.html", "https://vaccinedamage.news", "https://www.brighteon.com/0c30e2f9-785b-4fdd-8879-03777e696c45", "https://www.brighteon.com/channels/martinbrodel", "https://depopulation.news/2022-06-10-infertility-diabolical-agenda-film-exposes-who-vaccines.html", "https://badmedicine.news/2022-10-11-uk-data-shows-vaccines-cause-more-deaths.html", "https://dangerousmedicine.com/2019-12-03-who-openly-admitting-vaccines-cause-more-polio-than-wild-virus.html", "https://vaccinedeaths.com/2021-11-11-data-shows-excess-mortality-covid-vaccines.html", "https://vaccines.news/2022-02-18-uk-covering-up-thousands-covid-vaccine-deaths.html", "https://www.naturalhealth365.com/diabolical-who-considers-covid-shots-one-of-the-most-successful-and-cost-effective-public-health-interventions.html", "https://www.who.int/news-room/facts-in-pictures/detail/immunization", "https://www.who.int/news-room/questions-and-answers/item/coronavirus-disease-(covid-19)-vaccines", "https://expose-news.com/2022/12/28/top-secret-covid-vaccination-deadier-than-disease/", "https://www.brighteon.com/0c30e2f9-785b-4fdd-8879-03777e696c45", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2023-02-22-who-vaccines-most-successful-public-health-interventions.html&linkname=WHO%20claims%20vaccines%20among%20the%20%E2%80%9Cmost%20successful%20and%20cost-effective%20public%20health%20interventions%E2%80%9D%20despite%20high%20vaccine%20mortality%20rates", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}