{"result_id": "237003", "URL": "https://pandemic.news/2022-11-15-nuremberg-ii-mass-murder-trials-could-commence-after-midterms.html", "timestamp": "2023-04-25 16:46:21 CEST+0200", "meta": {"description": "The Covid crimes are years in the making and more than a handful of vaccine manufacturers and promoters could be on trial soon for mass-murder and conspiracy to commit genocide. Senator Rand Paul puts Dr. Anthony Fauci at the forefront of the whole plandemic brigade, since Fauci lied and DID help fund gain-of-function research that […]", "lang": "en", "keywords": "badhealth,badmedicine,conspiracy,covid criminals,Dr Fauci,Fauci,genocide,Hitler,Medical Tyranny,medical violence,murder,neuremberg,neuremberg II,pandemic,science deception,vaccine death,vaccine genocide,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://pandemic.news/2022-11-15-nuremberg-ii-mass-murder-trials-could-commence-after-midterms.html", "encoding": "UTF-8"}, "image": null, "domain": "pandemic.news", "title": "Nuremberg II: Mass-murder trials could commence after midterms for the vaccine-pushing genocidal maniacs Fauci, Walenski and more", "cleaned_text": "Nuremberg II: Mass-murder trials could commence after midterms for the vaccine-pushing genocidal maniacs Fauci, Walenski and more\n\nThe Covid crimes are years in the making and more than a handful of vaccine manufacturers and promoters could be on trial soon for mass-murder and conspiracy to commit genocide. Senator Rand Paul puts Dr. Anthony Fauci at the forefront of the whole plandemic brigade, since Fauci lied and DID help fund gain-of-function research that led directly to the (Wuhan Flu) virus outbreak in humans across planet Earth. Already those who planned and propagated the scamdemic are begging for forgiveness, knowing that Nuremberg II trials are coming, sooner or later, for them. There are too many people involved in this mass murder scheme, but the ones at the top should be tried first.\n\nAnthony “Fraudulent” Fauci is the King of Misinformation when it comes to anything related to Covid-19\n\nFauci flip-flopped on mask wearing, social distancing, lockdowns, medications, vaccinations, and just about every piece of “advice” that spewed from his mouth for the past two years. Back and forth he went, talking about mandates that were vital to ‘flattening the curve’ and saving lives, when, come to find out, most of his advice is responsible for killing millions, if not billions, of people. Then he wrote a book on it all so he can further pad his rich pockets from the whole scamdemic, that’s ongoing and may never end. That’s why Fauci is the King of Misinformation. Then there’s Bill Gates, Peter Daszak, Dr. Walenski, and their scamdemic-planning cohorts at the regulatory agencies, and those who literally invested in the pandemic and made a fortune also.\n\nTurns out the masks cause bacterial infections in the mouth, throat and lungs, leading to worsened cases of Covid and pneumonia. Turns out that the #1 recommended drug in hospitals for Covid patients is remdesivir, that decimates kidney function, and all the leading doctors, CDC, and FDA “experts” know it. Turns out lockdowns and ‘virtual learning’ destroys children’s cognitive AND social development. Oops.\n\nFauci swore up and down the vaccines were safe and effective, but they cause myocarditis, pericarditis, severe inflammation, and strange rubbery vascular clots that lead to SADS (Sudden Adult Death Syndrome).\n\nIt’s time to try the Covid-19 criminals for their crimes of murder and conspiracy to commit murder\n\nMost of the people taking direct orders from Adolf Hitler in Nazi Germany were GUILTY of mass murder, not just “taking orders.” They saw first hand the concentration death camps and they knew, at least to some extent, the genocide of Jews that was taking place. Hitler was also exterminating anyone with autism, handicaps, deformations, or senility. Today, depopulation agendas are rooted in “vaccination” agendas instead of gas chambers. The only difference is the victims are slowed walked into their own demise by their own choice, after being conned and brainwashed by fear and CDC-scripted MSM propaganda.\n\nDr. Rand Paul is on the record stating, “To arrive at the truth, the U.S. government should admit that the Wuhan Virology Institute was experimenting to enhance the coronavirus’s ability to infect humans.” The Jews in WWII were not “subhuman,” and the vaccinated masses now are not supposed to be slated for execution either, but the clot shots are setting up this mass tragedy we are seeing take place, under the media’s radar.\n\nThough many of the mass-murderers from WWII only got 4 to 7 years in federal prison for their crimes, at least they were found guilty and served time. Justice must be served again, for WWIII is underway, and just because the plandemic masterminds are not using guns and bombs to kill millions, they are using weapons of mass destruction (biological weapons or B-WMDs).\n\nSupport Dr. Rand Paul as he moves forward with the goal of bringing justice to these pandemic-spreading criminals. Bookmark Vaccines.news to your favorite independent websites for updates on the next wave of Fauci-funded Covid-19 that Biden says is coming to America soon.", "opengraph": {"title": "Nuremberg II: Mass-murder trials could commence after midterms for the vaccine-pushing genocidal maniacs Fauci, Walenski and more", "type": "article", "url": "https://www.pandemic.news/2022-11-15-nuremberg-ii-mass-murder-trials-could-commence-after-midterms.html", "site_name": "Pandemic News", "description": "The Covid crimes are years in the making and more than a handful of vaccine manufacturers and promoters could be on trial soon for mass-murder and conspiracy to commit genocide. Senator Rand Paul puts Dr. Anthony Fauci at the forefront of the whole plandemic brigade, since Fauci lied and DID help fund gain-of-function research that […]", "image": "https://www.pandemic.news/wp-content/uploads/sites/582/2022/11/Fauci-Hitler.jpg"}, "tags": ["pandemic", "conspiracy", "murder", "vaccine genocide", "vaccine wars", "science deception", "neuremberg II", "Fauci", "medical violence", "genocide", "Hitler", "Medical Tyranny", "vaccines", "vaccine death", "Dr Fauci", "neuremberg", "covid criminals"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2022-01-19-project-veritas-report-proves-fauci-lied.html", "https://naturalnews.com/2021-09-08-fauci-lied-funded-gain-function-research-wuhan.html", "https://www.naturalnews.com/2022-11-02-democrats-beg-for-covid-forgiveness-after-destroying-the-lives-of-millions.html", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://naturalnews.com/2022-10-31-covid-is-man-made-fauci-gates-daszak-moderna.html", "https://naturalnews.com/2022-10-31-covid-is-man-made-fauci-gates-daszak-moderna.html", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://www.msn.com/en-us/news/politics/rand-paul-says-us-botched-covid-he-could-soon-lead-probes-of-it/ar-AA13Dx5U", "https://conservativebrief.com/rand-55803/", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.msn.com/en-us/news/politics/rand-paul-says-us-botched-covid-he-could-soon-lead-probes-of-it/ar-AA13Dx5U", "https://www.naturalnews.com/2022-11-02-democrats-beg-for-covid-forgiveness-after-destroying-the-lives-of-millions.html", "https://conservativebrief.com/rand-55803/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpandemicnews%2F2022-11-15-nuremberg-ii-mass-murder-trials-could-commence-after-midterms.html&linkname=Nuremberg%20II%3A%20Mass-murder%20trials%20could%20commence%20after%20midterms%20for%20the%20vaccine-pushing%20genocidal%20maniacs%20Fauci%2C%20Walenski%20and%20more", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}