{"result_id": "238022", "URL": "https://patriots4truth.org/2020/03/03/rn-discovers-vaccines-are-injecting-cancer/", "timestamp": "2023-04-25 16:47:02 CEST+0200", "meta": {"description": "Not just cancer cells...but aborted fetal cells. Read the article link below the video to learn more. https://aim4truthblog.files.wordpress.com/2020/03/rn-discovers-vaccines-are-injecting-cancer_-.mp4 Italy Blows the Lid Off Vaccine Scam. Will No Longer Poison Citizens with Globalist Eugenics. Italian leaders actually care about the health and well-being of their citizens, Congratulations, Giulia Grillo, for standing up against the globalist agenda…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/2020/03/03/rn-discovers-vaccines-are-injecting-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "RN Discovers Vaccines are Injecting Cancer", "cleaned_text": "Not just cancer cells…but aborted fetal cells. Read the article link below the video to learn more.\n\nItaly Blows the Lid Off Vaccine Scam. Will No Longer Poison Citizens with Globalist Eugenics.\n\nItalian leaders actually care about the health and well-being of their citizens, Congratulations, Giulia Grillo, for standing up against the globalist agenda of maiming and destroying human life.\n\n“Italy sacked it’s vaccine scammers, and put in their place 100 percent new people who are not part of the global conspiracy to destroy people with vaccines, and then subsequently and practically immediately discovered that the vaccines have absolutely nothing they are advertised for, which begs the question: What the hell is really in those shots?\n\nVaccine advocacy group Corvelva, which is not compromised, spearheaded Italy’s investigation into the vaccine scam.\n\nThe Eugenicists are up in arms over Corvelva, a vaccine advocacy group appointed by the Italian government to investigate the vaccines which has now received over $50, 000 in funding to test all the vaccines and see if they are scams. And more, the Eugenicists are upset about WHERE the funding is coming from – top Italian medical science teams are funding Corvelva’s efforts, unlike what this Sott article implies in it’s headline and subsequently tries to state by claiming “scientists” are questioning the Italian government’s actions that the Italian government is off it’s rocker. That’s not what the headline should be. Here is what the headline should be:\n\nFIVE NWO approved science scammers are protesting a vaccine safety investigation being conducted by Italy’s real top scientists who are rapidly and easily uncovering the truth about what the current childhood vaccines really are, and that they are not vaccines at all, they are something else entirely.\n\nAs it turns out, all it takes to find out what is really in the vaccines is to break rank, seize a sample of what is being injected into the children, put it in a real lab that is not compromised by kikes, and VOILA!!! suddenly it is known that the vaccines are not at all what they are claimed to be. You can’t do that in the United States. No parent is allowed to walk out the door with a shot that has not been injected into their kids, take it to a lab, and test it. This is NOT ALLOWED. WHY? Italy just got the answer.\n\nThe MSM is holding this topic by the gills at arm’s length like a diseased fish because of what Corvelva has found – that the vaccines really don’t have anything they are advertised for and are instead full on scams.\n\nYou can’t find a legitimate MSM report on this topic. Instead, the reports are all slander, calling Italians stupid, backwards, “conspiratorial”, against “established science” and anything else they can muster, and they HAVE TO because the vaccine eugenics programs are one of their greatest treasures, with carefully placed totally compromised despicable hateful and soulless people in all key positions to keep a lid on the scam and allow the destruction of our children proceed without a hitch.\n\nItaly just blew the lid off the vaccine scam, and this one is not going away folks, Italy is NOT ZIMBABWE, they are clearly a first world country that can speak with authority. So the MSM is now trying to slander Italy because Italy uncovered one of kikedom’s NWO eugenics plots.\n\nAs if we did not all know the vaccines were wrecking our kids all along, – Gee, one in 35 kids now gets autism and “nobody can figure out why??” They know damn well at Newsweek, Sott and more. The entire shadow government KNOWS IT and now that Italy broke free of their grasp they are trying to bury it. Instead, they ought to just put a fork in it. THANKS ITALY for finally putting it in print from an official level. We knew it all along, but it is nice to get real confirmation from the top ranks of a first world government.”\n\nAnd now we know who is behind the vaccine agenda:\n\nQ is for the Queen’s Qinetiq", "opengraph": {"type": "article", "title": "RN Discovers Vaccines are Injecting Cancer", "url": "https://patriots4truth.org/2020/03/03/rn-discovers-vaccines-are-injecting-cancer/", "description": "Not just cancer cells…but aborted fetal cells. Read the article link below the video to learn more. Italy Blows the Lid Off Vaccine Scam. Will No Longer Poison Citizens with Globalist Eugenic…", "article:published_time": "2020-03-03T21:39:21+00:00", "article:modified_time": "2020-03-03T23:29:14+00:00", "site_name": "Patriots for Truth", "image": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2020/03/coronavirus-thumbnail.jpg", "image:secure_url": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2020/03/coronavirus-thumbnail.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "vimeo", "width": "845", "height": "475", "embed_code": "<iframe src=\"https://player.vimeo.com/video/392798558\" width=\"845\" height=\"475\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"/>", "src": "https://player.vimeo.com/video/392798558"}], "links": ["https://aim4truthblog.files.wordpress.com/2020/03/rn-discovers-vaccines-are-injecting-cancer_-.mp4", "https://truthbits.blog/2018/12/28/italy-blows-the-lid-off-vaccine-scam-will-no-longer-poison-citizens-with-globalist-eugenics/", "https://www.newsweek.com/anti-vaccine-italian-government-sacks-entire-health-expert-board-1242759", "http://82.221.129.208/.xu6.html", "http://www.corvelva.it/speciali-corvelva/analisi/vaccinegate-priorix-tetra-analysis-2nd-step-update.html", "https://patriots4truth.org/queen-coronavirus/", "https://patriots4truth.org/2020/03/03/rn-discovers-vaccines-are-injecting-cancer/coronavirus-thumbnail/", "https://aim4truth.org/2020/02/28/coronavirus-qinetiq-and-the-rothschild-bombshell/", "https://aim4truth.org/2020/02/26/cold-case-reopened-shows-virus-origins/", "https://vimeo.com/392798558", "https://patriots4truth.org/2020/03/03/rn-discovers-vaccines-are-injecting-cancer/?share=twitter", "https://patriots4truth.org/2020/03/03/rn-discovers-vaccines-are-injecting-cancer/?share=facebook"], "authors": [], "publish_date": "2020-03-03T21:39:21+00:00"}