{"result_id": "238003", "URL": "https://patriots4truth.org/2021/03/23/vaccine-expert-risks-of-mass-vaccination-to-human-population/", "timestamp": "2023-04-25 16:46:48 CEST+0200", "meta": {"description": "Urgent call to WHO: time to switch gears https://youtu.be/mUlDeCRDLnU . By a Patriot I am not writing this to change anyone’s mind about the current experimental mRNA covid “vaccine” methodology. Because most people are in one of two camps anyway — those who put blind faith in mainstream reporting and “official” narratives — and those…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/2021/03/23/vaccine-expert-risks-of-mass-vaccination-to-human-population/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Vaccine Expert – Risks of Mass Vaccination to Human Population", "cleaned_text": "Urgent call to WHO: time to switch gears\n\nI am not writing this to change anyone’s mind about the current experimental mRNA covid “vaccine” methodology. Because most people are in one of two camps anyway — those who put blind faith in mainstream reporting and “official” narratives — and those who tend to question “official” narratives. Adult minds are rarely changed about fundamental ideology or how they think. That’s never been my motivation. This is no different.\n\nI am writing this for the preparedness-minded. Period. For those who instinctively dig deeper (or dig at all!). Many of the preparedness-minded will prepare for the worst, while hoping for the best (hope is just a box to shut out risk and danger). This one is certainly “for the worst”, should it come to pass.\n\nVanden Bossche argues that humanity is now facing “a global catastrophe without equal,” because of the mass administration of what he considers to be the wrong vaccines.\n\nGeert Vanden Bossche, DMV, PhD, is an independent virologist and vaccine expert from Belgium, formerly employed at the Vaccine Alliance GAVI and at The Bill & Melinda Gates Foundation.\n\nHOWEVER, “When someone who appears to have devoted most of their career to developing and helping roll out vaccines globally decides to blow the whistle on the current global mass vaccination program, only an incautious person would choose to ignore it. That’s of course just what the mainstream media has done so far — an indicator of just how incautious this communication vehicle has become.” quoted from a related report from childrenshealthdefense.org.\n\nHis warning sent chills down my spine after I read the entire report. Why? Because he has been “in the club” so to speak. He adamantly believes the current mass Covid vaccinations (the consequences thereof) may theoretically substantially cull the human population!!\n\nBossche is pleading with the WHO, the world, to immediately halt the current mass vaccinations, right now.\n\nAlthough it may already be too late. Man oh man I hope he is wrong! But his credentials are what kept me reading and my motivation to report this to whoever might read this site.\n\nI am a critical thinker to the extent I can shed normalcy bias (which we all have to some degree). Especially when mainstream and/or .gov “officials” and/or Big Tech prohibit non-narrative voices, I become exceedingly and instinctively skeptical. Thus my digging for alternative opinions while seeking out “truths”. Vanden Bossche is pleading for his colleagues to stop and reconsider how they’re doing this [mRNA rollout], and right now.\n\nI have discovered many voices cautioning against this particular “vaccine” which is actually NOT a vaccine , but an experimental mRNA (it’s different). Their voices are eliminated from mainstream public discourse, despite credentials or credibility. There’s not even discussion about this. Which is VERY ALARMING. The present mass vaccinations are the “human test trials” of something that has NEVER been done before. We’re doing it on a global scale. Many experts have warned about the potential for bad outcomes. Some very bad indeed.\n\nOkay lets get to the warning from Vanden Bossche. I wish that I didn’t feel compelled to report this. I want life to return to normal. But there’s a lot going against us… We need to be prepared as we can be for what may come. And if it doesn’t (which is the outcome I wish for) you will have lost nothing, as it only helps your self reliance and sustainability.\n\nThe core of his warning is something called “viral immune escape,” which begets a weakened natural immunity and vaccine resistance to variants. This is what he believes will happen (is happening) to those who receive the present Covid “vaccination” shots. And it will affect ALL OF US, because of “them”.\n\n“This type of prophylactic vaccines are completely inappropriate, and even highly dangerous, when used in mass vaccination campaigns during a viral pandemic,”\n\n“How long can one ignore the problem when there is at present massive evidence that viral immune escape is now threatening humanity?”\n\n“It’s becoming increasingly difficult to imagine how the consequences of the extensive and erroneous human intervention in this pandemic are not going to wipe out large parts of our human population.”\n\nVanden Bossche suggests that herd immunity will not be achieved with the current vaccines, as they “turn vaccine recipients into asymptomatic carriers who are shedding virus.”\n\nHe calls for the use of vaccines that would be completely different from conventional vaccines in that they’re not inducing the B and T cells, but rather the natural killer (NK) cells.\n\nAccording to Vanden Bossche, there is compelling scientific evidence that the NK cells play a key role in facilitating complete elimination of COVID-19 at an early stage of infection in asymptomatic infected subjects.\n\nVanden Bossche has already warned various organizations, including the WHO, about his findings and recommendations.\n\nImmediate Cancellation of ALL Ongoing Covid-19 Mass Vaccination Campaigns\n\nFor him, “immediate cancellation of all ongoing Covid-19 mass vaccination campaigns should now become THE most acute health emergency of international concern,” and he urges an immediate international debate on the issue.\n\nIt’s Likely Too Late Already – The Worst Is Yet To Come\n\nThe worst of the pandemic is still to come. Bossche argues we are now experiencing the calm before the storm. Vanden Bossche predicts the next wave of infection will be dramatic — far worse than anything we’ve seen to-date.\n\nThis is because there will be more mutants to which the adaptive immune system provides little resistance, and this will come at the expense of decreased innate immune effectiveness.\n\nWhile he mentions that NK cell-based vaccines, which he claims to have been researching for the last decade or so but about which he also says he has no commercial interest, are the ultimate solution, he believes it is likely too late to escape the storm.\n\nOf all the reports I’ve read or heard or watched to-date, this one has me the most concerned.\n\nIf this man is right, we are all in so much trouble that it’s difficult to contemplate the ramifications. Difficult because it’s so apocalyptic. And that’s why I’m reporting this to you, the preparedness-minded. Take of it as you will. But this one has shaken me awake once again.\n\nI had been getting a bit complacent. I have even been making longer-term plans for 6 months from now which may get overturned if this plays out as Bossche warns. Therefore I need to adapt my thinking and alternatives for just-in-case we begin seeing this.\n\nMy closing thought is this… Nothing is going to change with the current mass global mRNA Covid-19 “vaccination” rollout. Nothing is going to stop it at this point.\n\nWhatever is going to happen because of this, is going to happen.\n\nThere will be coverups. The blame will NOT go onto the mRNA experimental shots. Instead it will all go onto the new deadly strains (which itself will be because of the current mass vaccination programs!).\n\nIf this culminates into massive die-offs from deadlier and more contagious strains, the resultant lockdowns will pale in comparison to what we’ve already experienced.\n\nShortages will be a ridiculous understatement. Systems will come to a halt. We will be on our own. This will become a worst case situation. One that will cull much of modern human civilization.\n\nSurvival will be difficult. So many things will have to go “right” just to stand a chance. Location. Year-round Sustainability. Security.\n\nListen, I hope Vanden Bossche is very wrong. But hope is just a mental box to stuff one’s concerns and fears. That’s not reality.\n\nI encourage you to read the following report, which gets somewhat technical. But it’s the original source to Bossche’s plea to the world, from COVEXIT.com\n\n>> Expert Sounds the Alarm about Risks of Mass Vaccination\n\nAfter you’ve read that, (here’s an update). The 2nd and 3rd paragraphs are frightening.", "opengraph": {"type": "article", "title": "Vaccine Expert – Risks of Mass Vaccination to Human Population", "url": "https://patriots4truth.org/2021/03/23/vaccine-expert-risks-of-mass-vaccination-to-human-population/", "description": "Urgent call to WHO: time to switch gears . By a Patriot I am not writing this to change anyone’s mind about the current experimental mRNA covid “vaccine” methodology. Because most people are in one…", "article:published_time": "2021-03-23T19:58:20+00:00", "article:modified_time": "2021-03-23T19:58:20+00:00", "site_name": "Patriots for Truth", "image": "http://img.youtube.com/vi/mUlDeCRDLnU/0.jpg", "image:secure_url": "https://img.youtube.com/vi/mUlDeCRDLnU/0.jpg", "image:width": "714", "image:height": "705", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "845", "height": "476", "embed_code": "<iframe class=\"youtube-player\" width=\"845\" height=\"476\" src=\"https://www.youtube.com/embed/mUlDeCRDLnU?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/mUlDeCRDLnU?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://youtu.be/mUlDeCRDLnU", "https://attackonliberty.com/globalism/vaccine-expert-risks-of-mass-vaccination-to-human-population/", "https://covexit.com/expert-sounds-the-alarm-about-risks-of-mass-vaccination/", "https://covexit.com/wp-content/uploads/2021/03/geert-vanden-bossche-update-march-8-2021.pdf", "https://patriots4truth.org/2021/03/23/vaccine-expert-risks-of-mass-vaccination-to-human-population/?share=twitter", "https://patriots4truth.org/2021/03/23/vaccine-expert-risks-of-mass-vaccination-to-human-population/?share=facebook"], "authors": [], "publish_date": "2021-03-23T19:58:20+00:00"}