{"result_id": "238021", "URL": "https://patriots4truth.org/category/global-control/", "timestamp": "2023-04-25 16:47:01 CEST+0200", "meta": {"description": "Posts about Global Control written by Our Spirit", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/category/global-control/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Global Control – Patriots for Truth", "cleaned_text": "From Matthew Ehret: “Yesterday, Russian President Vladimir Putin delivered powerful remarks to the Plenary session of a conference titled ‘Strong Ideas for a New Time’. Participants attending the event represented leading figures from the public and private sectors and was sponsored by the Agency for Strategic Initiatives.\n\nThe purpose of the conference which was first convened in 2020, was to chart out the most cutting edge ideas needed to reform every aspect of Russian life, touching on cultural, economic, scientific and democratic processes.\n\nSince the Russian President’s remarks took direct aim at the underlying flaws in the western unipolar system and succinctly identified the only possible solution to said self-annihilation, I thought it fit to reproduce his remarks in full…”\n\nI would like to begin by saying that I am very happy to be with you today.\n\nThrough you, I would like to greet and thank all those who have submitted their proposals to the forum Strong Ideas for a New Time, to thank the team of the Agency for Strategic Initiatives for organising the forum, and to express appreciation for the work of our regions, which have contributed to the implementation of the ideas presented at the first ASI forum, held in late 2020.\n\nIt is obvious that there is growing demand for the mechanism proposed by ASI for identifying, selecting and supporting civil projects and initiatives. As we were walking here with Svetlana Chupsheva, she said that, regrettably, an all-embracing and effective mechanism for selecting projects had not yet been created at the state level. But it is good that ASI is doing something like this. We will make increasingly broad use of this practice.\n\nThis mechanism is fully consonant with the tasks of our internal development and the time when truly revolutionary transformations are gaining momentum and getting stronger. These enormous changes are irreversible, of course. National and global processes are underway to develop the fundamentals and principles of a harmonious, fairer and more community-focused and safe world order as an alternative to the existing world order, or the unipolar world order in which we lived, and which, because of its nature, is definitely becoming a brake on the development of our civilisation.\n\nThe model of total domination by the so-called golden billion is unfair. Why should this golden billion, which is only part of the global population, dominate everyone else and enforce its rules of conduct that are based on the illusion of exceptionalism? It divides the world into first and second-class people and is therefore essentially racist and neo-colonial. The underlying globalist and pseudo-liberal ideology is becoming increasingly more like totalitarianism and is restraining creative endeavour and free historical creation.\n\nOne gets the impression that the West is simply unable to offer the world a model for the future of its own. Indeed, it was no accident that the golden billion attained its gold and achieved quite a lot, but it got there not because it implemented certain concepts. It mainly got to where it is by robbing other peoples in Asia and Africa. That is how it was. India was robbed for an extensive period of time. This is why the elite of the golden billion are terrified of other global development centres potentially coming up with their own development alternatives.\n\nNo matter how much the West and the supranational elite strive to preserve the existing order, a new era and a new stage in world history are coming. Only genuinely sovereign states are in a position to ensure a high growth dynamic and become a role model for others in terms of standards of living and quality of life, the protection of traditional values and high humanistic ideals, and development models where an individual is not a means, but the ultimate goal.\n\nSovereignty is about freedom of national development, and thus, the development of every individual. It is about the technological, cultural, intellectual and educational solvency of a state – that is what it is. No doubt, responsible, active and nationally minded and nationally oriented civil society is the most important component of sovereignty.\n\nI am convinced that in order to be strong, independent and competitive, we need to improve the mechanisms for people to participate in the country’s life and to make them more open and fairer. That includes mechanisms for direct democracy and people’s involvement in addressing the critical problems facing society and the public.\n\nThe way forward is to rely on our people’s creative potential, to team up with you and people like you who are not with us today. How many thousands participated, did you say?\n\nVladimir Putin: Some 19,000 people took part in the forum. We can achieve the results we are seeking only if we rely on this powerful potential.\n\nI consider your forum a key platform for an open and meaningful dialogue. Moreover, the Agency for Strategic Initiatives has always brought together people of a particular type. Thinking, proactive and goal-oriented people who are willing to make a significant contribution to making Russia a successful, prosperous and comfortable country for the people who strive to achieve self-fulfillment and to live dignified lives.\n\nI am positive that, as professionals, you have ideas about how to improve the state of affairs in technology, education and healthcare and to make things better for our companies, researchers and engineers, and so on. You have meaningful ideas that have been tested. We must work together to bring them to life. Some things have already been done, and I hope we will spend some time discussing them. However, these newly proposed ideas must be implemented as well.\n\nOf course, today we will be able to discuss only some of your ideas and projects. But I want you to know right from the outset that all constructive and sound proposals will be considered. It is imperative to make full use of the mechanisms for implementing the socially significant projects put forward by our citizens, which is being created by the Government, Vnesheconombank – Mr Shuvalov will confirm this – and the Agency for Strategic Initiatives, along with regional involvement.\n\nI would like to emphasise that it is important to do more than organise the training of the teams and fund them accordingly. It is critically important to create, as soon as possible, pilot legal frameworks in specific areas, to test every aspect of the efforts to introduce effective, bold and even out-of-the-box ideas that are ahead of their time and use them as the basis for carrying out systemic changes throughout the country.\n\nThis particular approach has made it possible to launch the truly useful projects that were presented at your first forum in November 2020. I will give you a quick example. An initiative that was put forward at the previous forum gave start to pilot operation of autonomous marine vessels, which will be an important step towards developing unmanned vehicles in Russia, using satellite navigation and making advances in AI technology.\n\nThe day before yesterday, our colleagues and I discussed in detail the creation of proper conditions for developing and implementing such advanced technologies that enjoy high demand at a meeting of the Council for Strategic Development and National Projects. I am sure that you also have breakthrough ideas that will be implemented. Let us discuss them today.\n\nI will spend a moment discussing public and social projects aimed at saving our nation, demographic development and, of course, the upbringing, as they usually say, of the youth, but I think education is a lifelong process and people should use new knowledge to evolve throughout their lives. So, I believe upbringing has much more to it than the upbringing of the youth.\n\nI would like my colleagues in the Government and the governors to hear me – such sincere initiatives that are often promoted even by small teams of enthusiasts certainly need the interested, weighty support of the managerial teams in the regions, on site, because the experience received in one region is valuable and useful for the entire country. Of course, this is true of the experience is valuable, if is implemented, if it works effectively and brings specific results for the region in question and the country.\n\nLet me recall that at the previous forum, representatives from the Novgorod Region search movement spoke about their efforts to go into schools. A very interesting initiative. As you know, genius lies in simplicity. They go to schools and tell the students about the history of their land by giving examples of their fellow residents, examples of heroism – this is much more interesting and effective than just sitting at a desk in school and thumbing through a textbook even if it is well written by specialists, historians and teachers. This live contact with history, especially if presented professionally, beautifully and creatively, certainly has a much stronger impression on people and affects all their lives.\n\nI would like to emphasise that to move forward into the future we need to remember our great, glorious past, rely on our traditions and be proud of our achievements. And, once again, we must move forward by all means. It is absolutely unacceptable to rest on our laurels, look back to the past and be happy at recalling what our fathers, grandfathers and grandmothers did. No. We must certainly rely on this enormous experience and the achievements of our nation, our peoples – our advantage lies in the multi-ethnic and multi-religious nature of our country – but we must of course look to the future and move only forward.\n\nIt is symbolic today, that this forum is taking place at this unique facility. I think all of you are happy to be here, at GES −2. It unites our history, the successes of the domestic engineering school and modern technology. They were used to make this unusual, creative space that reflects the spirit of today’s new era.\n\nI am sure this atmosphere will set a good direction for our discussion and motivate us to search for creative, unconventional approaches to resolving the tasks facing our country.\n\nThank you very much for your attention.", "opengraph": {"type": "website", "title": "Global Control – Patriots for Truth", "url": "https://patriots4truth.org/category/global-control/", "site_name": "Patriots for Truth", "image": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/aim-4-truth-png-bw.png?fit=714%2C705&ssl=1", "image:width": "714", "image:height": "705", "locale": "en_US"}, "tags": ["https://circleofthedolphins.wordpress.com/tag/rockefeller-rothschild/"], "tweets": [], "movies": [], "links": ["https://substack.com/redirect/08e797ec-f2ed-4119-a55d-94cce3b8f88a?u=87592971", "https://www.bitchute.com/video/GPA52mZlK5kI/", "https://www.bitchute.com/video/dJxI6abtjsIk/"], "authors": [], "publish_date": "February 11, 2023"}