{"result_id": "238019", "URL": "https://patriots4truth.org/category/pilgrims-society/", "timestamp": "2023-04-25 16:47:00 CEST+0200", "meta": {"description": "Posts about Pilgrims Society written by Our Spirit", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/category/pilgrims-society/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Pilgrims Society – Patriots for Truth", "cleaned_text": "Ronna McDaniel set to get new opponent for RNC post\n\nThe media claims that a potential run by Harmeet Dhillon represents the most serious threat to the current chair to date. But Harmeet Dhillon is just another pig in lipstick, Pilgrims Society placement, just like Ronna ROMNEY McDaniel has always been.\n\nThe Pilgrims want you to think that there will be a substantive change in RNC leadership – but seriously, folks, read her bio below and see for yourself Dhillon is pure SWAMP.\n\nDhillon became a British attorney (1998) before she was licensed in California (2000)\n\nHarmeet Kaur Dhillon #207873. (Licensed Jun. 23, 2000). Admitted to the State Far of California. California Bar. Association. Source: https://apps.calbar.ca.gov/attorney/Licensee/Detail/207873\n\nTelltale sign of the British Pilgrims Society grooming of Harmeet Dhillon – she swore an oath to the British Monarchy in 1998\n\nReuters controls the London Stock Exchange as well as the American exchanges through various convoluted entities.\n\n“… she has been a Solicitor of the Supreme Court of England and Wales.” (!!!)\n\n“We are the final court of appeal in the UK for civil cases, and for criminal cases from England, Wales and Northern Ireland. The Supreme Court hears cases of the greatest public or constitutional importance affecting the whole population.” https://www.supremecourt.uk/\n\nThe current standard oath of allegiance is set out from the Promissory Oaths Act 1868 in the following form:\n\n“I, (Insert full name), do swear that I will be faithful and bear true allegiance to His Majesty King Charles [in 1998, Her Majesty Queen Elizabeth] , his heirs and successors, according to law. So help me God.”\n\nCENSORSHIP NOTE: Wikipedia does not disclose that Dhillon worked for two Facebook attorneys:\n\nFenwick & West LLP (Palo Alto), via law partner John Paul Deol, John-Paul Deol – Employment Law Attorney – Dhillon Law Group Fenwick and West files most of Facebook’s patents building off of the social networking invention stolen from Leader Technologies, Columbus Ohio\n\n\n\nCooley Godward LLC was Facebook’s trial attorney in Leader v. Facebook patent infringement case where Leader proved that Facebook is infringing their social networking patents/invention. Cooley Godward’s Michael Rhodes (Facebook’s Leader v. Facebook trial lawyer) was one of the attorneys leading the distribution of Obama’s “energy stimulus” boondoggle that Elon Musk scarfed up. Facebook also engaged Orrick during the Leader v. Facebook trial.\n\nShe is being promoted by the British City of London-led Inner Temple organization, the American Bar Association: https://www.americanbar.org/groups/public_education/programs/19th-amendment-centennial/the-19th-amendment-then-and-now–lessons-for-the-21st-century/hermeet-dhillon/\n\n“Racism!!!” epithet already being dragged out to protect Dhillon from criticism: https://www.sikhnet.com/news/harmeet-dhillon-sikh-attorney-hit-racist-smears-own-party\n\nBeing promoted by Charlie Kirk and Turing Point USA, which is associated with the British Pilgrims Society and Rothschild gold, silver and copper merchant Lord Michael Farmer, father-in-law to Candace Owens https://www.tpusa.com/harmeet-dhillon\n\nBottom Line: She is a well-groomed leftist lawyer, groomed by DLA Piper to appear Republican. She has never had a real job.\n\nFirstly, there are way too many photos of her on Google images. That is always a telltale sign of a groomed cardboard cutout. Pages and pages!\n\nSecondly, she is an Indian citizen, not American.\n\nGroomed at all the right schools: Dartmouth College, Dartmouth Review, University of Virginia Law School, clerk for Judge Paul Victor Niemeyer, District Court of Maryland, 4th Circuit. Niemeyer worked for DLA Piper. DLA Piper’s chairman for decades was Sir Nigel G. Knowles, chairman of The Prince’s Trust International, boss of Doug Emhoff, Vice Pretender Kamala Harris’s former boss.\n\nLater she was a director of the leftist American Civil Liberties Union (ACLU).\n\nContributor to Kamala Harris political campaigns, even according to Wikipedia!\n\nShe has sprinkled much money to RINOs\n\nNOTE (she never disclosed her employment at Orrick in her Wikipedia)\n\nShe has given some speeches at various well-chosen Republican events. That is impressive.\n\nWikipedia even mentions jobs she interviewed for and never got. Even they were having trouble making her sound relevant and qualified (not).\n\nShe’s filed some lawsuits. The lawsuits appear to be window dressing to bolster her claim to be a Republican.\n\nShe FOUNDED the Center for American Liberty (CAL)—ALL LAWYERS. The name alone should raise red flags since such high-sounding names usually mean the opposite. https://libertycenter.org/\n\nFirst the CAL website is classically leftist/communist slick with no substance. The principals all have milk toast, whitewashed resumes that use buzzwords and say little. https://libertycenter.org/about/\n\nBritish Pilgrims Society. Jonathan M. Shaw – Attorney California – Dhillon Law Group including most notably, BARCLAYS BANK PLC, tied to The City of London and Boris Johnson’s wife Carrie (Bevan-Barclay partner)", "opengraph": {"type": "website", "title": "Pilgrims Society – Patriots for Truth", "url": "https://patriots4truth.org/category/pilgrims-society/", "site_name": "Patriots for Truth", "image": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/aim-4-truth-png-bw.png?fit=714%2C705&ssl=1", "image:width": "714", "image:height": "705", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.politico.com/news/2022/12/04/mcdaniel-dhillon-rnc-chair-election-00072116", "https://en.wikipedia.org/wiki/Harmeet_Dhillon", "https://fbcoverup.com/docs/library/2000-06-23-Harmeet-Kaur-Dhillon-No-207873-Admitted-to-the-State-Bar-of-California-California-Bar-Association-licensed-Jun-23-2000.pdf", "https://apps.calbar.ca.gov/attorney/Licensee/Detail/207873", "https://www.yaf.org/speakers/harmeet-dhillon/", "https://www.supremecourt.uk/", "https://fbcoverup.com/docs/library/1998-03-16-Harmeet-Kaur-Dhillon-SRA-271652-UK-Solicitors-Regulation-Authority-accessed-Dec-12-2022-admitted-Mar-16-1998.pdf", "https://www.sra.org.uk/consumers/register/person/?firstName=Harmeet&lastName=Dhillon&sraNumber=271652", "https://en.wikipedia.org/wiki/Oath_of_Allegiance_(United_Kingdom)", "https://www.dhillonlaw.com/", "https://www.independent.org/aboutus/person_detail.asp?id=4095", "https://ballotpedia.org/Harmeet_Dhillon", "https://www.linkedin.com/in/harmeet-k-dhillon-543773/", "https://www.dhillonlaw.com/team-showcase/john-paul-deol/", "https://www.americanbar.org/groups/public_education/programs/19th-amendment-centennial/the-19th-amendment-then-and-now--lessons-for-the-21st-century/hermeet-dhillon/", "https://www.sikhnet.com/news/harmeet-dhillon-sikh-attorney-hit-racist-smears-own-party", "https://www.tpusa.com/harmeet-dhillon", "https://americans4innovation.blogspot.com/2021/02/sir-nigel-knowles-king-of-k-street-is.html", "https://www.fec.gov/data/receipts/individual-contributions/?contributor_name=Dhillon%2C+Harmeet", "https://libertycenter.org/", "https://libertycenter.org/about/", "https://www.dhillonlaw.com/team-showcase/jonathan-m-shaw/", "https://ecf.dcd.uscourts.gov/cgi-bin/iquery.pl?160274112125743-L_1_0-0-175007", "https://ecf.dcd.uscourts.gov/cgi-bin/iquery.pl?160274112125743-L_1_0-0-171750"], "authors": [], "publish_date": "December 6, 2022"}