{"result_id": "238041", "URL": "https://patriots4truth.org/2021/06/20/kelly-sutton-first-do-no-harm/", "timestamp": "2023-04-25 16:47:16 CEST+0200", "meta": {"description": "Dr. Sutton has been a member of the AIM community for several years and is one of our Conclave experts in the medical field. In the audio below, she provides an update on how the trial is proceeding. Dr. Sutton can be reached at https://www.raphaelmedicine.com/ . Dr. Sutton clarifies terms used above: A contraindication is…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/2021/06/20/kelly-sutton-first-do-no-harm/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Dr. Kelly Sutton: First Do No Harm", "cleaned_text": "Dr. Sutton has been a member of the AIM community for several years and is one of our Conclave experts in the medical field. In the audio below, she provides an update on how the trial is proceeding. Dr. Sutton can be reached at https://www.raphaelmedicine.com/\n\nA contraindication is distinct from an adverse event following vaccination.\n\nContraindications — conditions under which vaccines should NOT be administered. Decided exclusively by the ACIP Advisory Committee on Immunization Practices. Many/most of whom have conflicts of interest. The trend is for states to pass vaccine mandates with no religious exemptions, no personal belief exemptions, and the medical exemptions must comply with the ACIP guidelines.\n\nMost contraindications are from a person having anaphylaxis (severe, potentially life-threatening allergic reaction.) following a vaccine. So in other words, you have to be damaged before you can be exempt.Then a person is exempt from that ONE vaccine and still must take all others. There are a few contraindications for congenital immune deficiency, cancer and chemotherapy, recent blood or gamma globulin infusion, and severe allergies to egg or yeast, in addition to anaphylaxis. It is important to note that up to 20% of the people die who experience anaphylaxis. Regulations require a high bar to skip a vaccine — put your life on the line.\n\nNY, ME, WV, MS, and CA currently allow only Med exempt based on ACIP guidelines, no relig exempt or personal belief exempt– great map here:\n\nVaccine studies for FDA approval are remarkably short — 4-42 days, with some phone follow up. There is no true saline inert placebo, but an adjuvant or another vaccine is the so-called placebo which accurately named is not a placebo but a comparator. The vaccine performs well in this match-up, as you might imagine In the vaccine insert the word ‘placebo’ is still used! Misleading!\n\nThe primary post-marketing follow up is the Vaccine Adverse Event Reporting System: VAERS. By design, doctors are required to report serious adverse events after vaccines, but the process is cumbersome and rarely accomplished. Patients may report adverse events. Reporting an event does not indicate causality. This data is not considered strong statistically, b/c it is passive reporting (not actively sought). It is not statistically strong. It is estimated only 1% -10% of all serious vaccine adverse events are reported to VAERS.\n\nA grant was given to Harvard Pilgrim HMO to make adverse event reporting an automatic part of the electronic medical record. This would follow appointments, diagnoses, and lab results in the EMR after a vaccine. This system estimated the frequency of adverse events after vaccination was 1/39. The media/medicine statement is the serious adverse events from vaccines are 1/1 million. The grant never went to fruition, as the CDC colleagues stopped answering phone calls from the study leaders.\n\nAEFI adverse event following immunization is a common term in the vaccine literature. This indicates a temporal relation between the vaccine and the adverse event.\n\nThe Institute of Medicine periodically evaluates adverse events to see if they are caused by the vaccines. There are 20-30 adverse EVENTS\n\nwhich are called adverse EFFECTS of vaccines b/c there is consistently supportive evidence of causality. The other adverse events do not have enough information to determine if causally related or not to the vaccine.\n\nThe claim that adverse events are ‘not related to vaccines’ for the most part is not a scientific statement, because, there is not enough information to determine causality or lack of causality. That doesn’t stop media/medicine from making claims of ‘no relation.’ If a person were reading the science, they would have to say: we don;t know. Of course, that makes it harder to justify BROAD vaccine programs, especially MANDATED vaccines, which will impact the most vulnerable, and in those states without exemptions, they are impacted without a defense.\n\nCheck out www.PhysiciansForInformedConsent.org. The educational material is clear, illustrated, and ALL BASED IN SCIENCE.", "opengraph": {"type": "article", "title": "Dr. Kelly Sutton: First Do No Harm", "url": "https://patriots4truth.org/2021/06/20/kelly-sutton-first-do-no-harm/", "description": "Dr. Sutton has been a member of the AIM community for several years and is one of our Conclave experts in the medical field. In the audio below, she provides an update on how the trial is proceedin…", "article:published_time": "2021-06-20T14:50:31+00:00", "article:modified_time": "2021-06-20T14:51:37+00:00", "site_name": "Patriots for Truth", "image": "https://patriots4truth.org/wp-content/uploads/2021/06/kelly-sutton-3.jpg", "image:width": "1440", "image:height": "2560", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.raphaelmedicine.com/", "https://www.cdc.gov/vaccines/hcp/acip-recs/general-recs/contraindications.html", "https://www.nvic.org/Vaccine-Laws/state-vaccine-requirements.aspx", "http://www.PhysiciansForInformedConsent.org", "https://patriots4truth.org/2021/06/20/kelly-sutton-first-do-no-harm/?share=twitter", "https://patriots4truth.org/2021/06/20/kelly-sutton-first-do-no-harm/?share=facebook"], "authors": [], "publish_date": "2021-06-20T14:50:31+00:00"}