{"result_id": "238034", "URL": "https://patriots4truth.org/2021/08/27/the-british-war-on-christianity/", "timestamp": "2023-04-25 16:47:12 CEST+0200", "meta": {"description": "https://americans4innovation.blogspot.com/2021/08/the-british-war-on-christianity.html . Britannia has fallen and is an enemy of Truth; she is dragging America down with her. When we write \"British,\" we mean self-anointed British elitists, not the British people Philip Whitwell Wilson: the \"Christian\" socialist Pilgrims Society journalist viper pope of the British Empire new world order—probably did more to eviscerate Christianity with his…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/2021/08/27/the-british-war-on-christianity/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "THE BRITISH WAR ON CHRISTIANITY", "cleaned_text": "Britannia has fallen and is an enemy of Truth; she is dragging America down with her.\n\nWhen we write “British,” we mean self-anointed British elitists, not the British people\n\nPhilip Whitwell Wilson: the “Christian” socialist Pilgrims Society journalist viper pope of the British Empire new world order—probably did more to eviscerate Christianity with his forked tongue than any other influencer in the 20th century\n\nAnglophiles want debauched aristocracy for themselves, and socialism / communism for you; 1776 only slowed them down.\n\nAmerica must dissemble every institution overrun by Britannia’s demons before they totally consume us too.\n\nWithout a Christian moral rudder, the American ship of state will sink (paraphrasing John Adams).\n\nBritish bankers were overtaken centuries ago by an addiction to abuse of their fellow human beings through slavery, sodomy, rape and pedophilia; this has not stopped or even slowed, its only changed its veneer.\n\nFaithful Christians have been their only counter, so they cajole Christian clery into which socialism, which many follow blindly, while polishing their medals and contrived accolades.\n\nOne heretofore unknown actor in this tragedy is Phil Whitwell Wilson, son of a London Bible publisher turned socialist advocate of the “social gospel.”\n\nP. Whitwell Wilson’s socialist influence spans Bolshevism, communism, Salvation Army, Y.M.C.A., Vladimir Lenin, journalism, spying, propaganda, human and drug trafficking, money laundering, United Nations, “Five Eyes”—whatever it took to destroy Christian opposition.\n\nIn the video below, Michael McKibben and Douglas Gabriel explains what this newly-uncovered history means. Then continue your education by reading: https://americans4innovation.blogspot.com/2021/08/the-british-war-on-christianity.html", "opengraph": {"type": "article", "title": "THE BRITISH WAR ON CHRISTIANITY", "url": "https://patriots4truth.org/2021/08/27/the-british-war-on-christianity/", "description": ". Britannia has fallen and is an enemy of Truth; she is dragging America down with her. When we write “British,” we mean self-anointed British elitists, not the British people Philip Wh…", "article:published_time": "2021-08-27T14:54:56+00:00", "article:modified_time": "2021-08-27T19:53:13+00:00", "site_name": "Patriots for Truth", "image": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2021/08/pandemic-mike-and-doug-2.jpg?fit=1200%2C909&ssl=1", "image:width": "1200", "image:height": "909", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americans4innovation.blogspot.com/2021/08/the-british-war-on-christianity.html", "https://americans4innovation.blogspot.com/2021/08/the-british-war-on-christianity.html", "https://www.fbcoverup.com/docs/library/2021-08-26-The-British-War-on-Christianity-by-Gabriel-McKibben-Amercan-Intelligence-Media-Americans-for-Innovation-Aug-26-2021.mp4", "https://patriots4truth.org/2021/08/27/the-british-war-on-christianity/?share=twitter", "https://patriots4truth.org/2021/08/27/the-british-war-on-christianity/?share=facebook"], "authors": [], "publish_date": "2021-08-27T14:54:56+00:00"}