{"result_id": "238049", "URL": "https://patriots4truth.org/category/corruption/page/2/", "timestamp": "2023-04-25 16:47:22 CEST+0200", "meta": {"description": "Posts about Corruption written by Our Spirit", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/category/corruption/page/2/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Corruption – Page 2 – Patriots for Truth", "cleaned_text": "An AIMCat asked us to do some background on Arizona Governor Doug Ducey (Douglas Anthony Roscoe Jr.). We are posting it here for anyone else who is interested.\n\nA cutout for his British Pilgrims Society financial controllers sent to AZ to faciliate the destruction of the American Republic and its reabsorption into the British new world order\n\nDucey’s conflicts of interest track straight back to the British Crown, Bill Gates, Anthony Fauci/NIH, Wellcome Trust, EU, WHO, UN, etc.\n\nDucey’s MI6-CIA connections totally align him with those of equally-groomed ASU president Michael Crow\n\nFinding: Ducey’s investing relationships include The Pirbright Institute (funded by the BBSRC), patent holder of the Coronoavirus and partner with Bill Gates, Fauci, NIH, Wellcome Trust, WHO, EU, DARPA\n\nDoug Ducey was born Douglas Anthony Roscoe Jr. in Toledo, Ohio, where he was raised.[1] He is the son of Madeline Scott and Douglas Roscoe Sr., a former member of the Toledo Police Department.[2]\n\nHis parents divorced and in 1975 his mother married businessman Michael Ducey, to whom she remained married until 1981.[3] Michael Ducey adopted Douglas and his siblings in 1976; Douglas’s last name was legally changed to his adoptive father’s.[4]\n\nDucey graduated from St. John’s Jesuit High School in 1982 and moved to Arizona to attend Arizona State University (ASU) while working at Hensley & Co., the Anheuser-Busch distributor owned by the family of Cindy McCain.[5] He graduated in 1986 with a Bachelor of Science degree in finance.[6]\n\nAfter graduating from ASU, Ducey joined Procter & Gamble and began a career in sales and marketing.[7] Ducey was the CEO at Cold Stone Creamery from 1995 to 2007.[8] When he and his business partner sold the company in 2007, Cold Stone (which was founded in 1988)[9] had more than 1,400 locations in the United States and ten other countries. After the company’s sale to Kahala, accusations of franchise mismanagement led Ducey to leave the organization.[10]\n\nHe became the lead investor and served as chairman of the board for iMemories from 2008 to 2012.[11] Cold Stone Creamery franchises ranked among the 10 worst franchise brands in terms of Small Business Administration loan defaults.[12]\n\nMD Felipe Mendoza closely associated with T-Mobile, Ciena (CIEN https://www.morningstar.com/stocks/xnys/cien/ownership held by the usual British Pilgrims Society insiders including Vanguard, UBS (Switzerland – Klaus Schwab, Bank for International Settlements, William J. Donovan, OSS, MI6, CIA), Fidelity, State Street)), Nortel Networks (creator of Hillary Clinton’s and Robert S. Mueller’s ultimate PKI control of ENTRUST, Orlando Bravo, CloudFlare), Alcatel, Roche Diagnostics, Cisco, Boehringer Mannheim (partner of The Pirbright Institute (UK – patent holder of the Coronavirus).\n\nJon Bayless – Jon was part of the original team that began the Sevin Rosen franchise and is considered one of the venture industry’s most successful investors of all time. Over the past 30 years, he has established an exceptional track record of marquis exits with outsized returns, including Landmark Graphics, Informed Access (sold to Access Health/HBO), Lightspeed Systems (Cisco), IPMobile (Cisco), Monterey Networks (Cisco), and CIENA. Jon currently sits on the boards of several of Sevin Rosen’s most promising portfolio companies, including GENBAND, Xtera, Extenet, WaveBender, and Vidyo. Jon served on the board of the National Venture Capital Association from 1997 to 2001. LinkedIn – NVCA was one of the co-founders of CIA In-Q-Tel where ASU’s Michael Crow is Chairman. Cisco = IoT and global mass surveillance. (READ: CIA In-Q-Tel and the Highlands Group illegal operation of the DoD Office of Net Assessment (that funded British agent Stefan Halper in the Trump-Russia hoax.)\n\nJack Furst – Jack D. Furst is a distinguished private equity investor. He manages his own capital making investments in real estate, oil and gas, fixed income securities and public and private equities. Jack is an Adjunct Professor at The University of North Texas and The University of Texas at Dallas (the Harvards of the Southwest) where he teaches finance and investments. He has over 33 years of private investment experience completing over $75 billion in transactions which resulted in attractive returns for investors. Jack was a founding Partner in HM Capital Partners (formally Hicks, Muse, Tate & Furst Incorporated).\n\nHM Capital is closely associated with British Telecom, and therefore the British Pilgrims Society, SERCO, QintetiQ. Other associations and investments include Morgan Stanley, Chancellor Media, KKR, UK Food Group Hillsdown Holdings, Mexican Grupo Minsa, Nestle Ambient Foods, UK Crosse & Blackwel and many other British food name brands like Weetabix.Kerns Oil & Gas (Blackbrish Energy), Persona cable Canada, Regency Gas, Centennial Puerto Rico, Regal Cinemas, International Wire, Lion Capital LLP (UK), food group spun off now Kainos Capital\n\nJohn Jaggers From 2006 to 2010, he also served on the board of the National Venture Capital Association (READ: CIA In-Q-Tel and the Highlands Group illegal operation of the DoD Office of Net Assessment (that funded British agent Stefan Halper in the Trump-Russia hoax.)\n\nBob McTeer – Bob is best known for his 36-year career with the Federal Reserve System, including almost 14 years as President of the Federal Reserve Bank of Dallas and member of the Federal Open Market Committee (FOMC). Bob received his Ph.D. in Economics from the University of Georgia with a National Defense Education Act fellowship. He currently is economic advisor to Commerce Street Capital and Protiviti, Inc. and serves on the boards of Westwood Holdings, Beal Bank, Refocus Group and Aquinas Companies.\n\nWas allowed by the global insiders to invest in 2008 in Plaxo, Facebook, LinkedIn Zynga, Playdom, ALIBABA GROUP (China). iN 2011 LIFELOCK, SURVEY MONKEY (Facebook VP Sheryl Sandberg’s husband), Lyft, Spotify, Pintrest, and APPLIED MOLECULAR TRANSPORT, and many other not so well known companies locking into the Pilgrims Society’s global spy control grid\n\nTop 20 owners include Blackstone (CIA), Fidelity (C)A), iShares (BlackRock – CIA)(iShares by BlackRock, the largest provider of exchange-traded-funds (ETFs) in the world), USAA\n\nWe are committed to creating sustainable economic impact for the UK\n\nThe UK Innovation and Science Seed Fund (UKI2S) is committed to nurturing new business arising from the world-class science undertaken in the UK in sectors such as biotechnology, synthetic biology, engineering, agriculture, computer science and environmental technology. Providing long-term, patient capital, the fund has helped build innovative businesses, leverage private investment and grow jobs. Beyond seed funding, UKI2S provides strategic advice and support to companies in their early stages.\n\nUKI2S has a substantial track record. The fund has a portfolio of 57 companies, created with just £15m of capital. Between them, and with the support of UKI2S, these companies have attracted over £500m of later stage investment and have a combined market value of over £750m. Read our recent report for more information on the economic impact of UKI2S.\n\nUKI2S works closely with our partners – led by STFC, BBSRC and NERC, which are all part of UK Research & Innovation (UKRI) and Dstl – and is aligned with the Catapult Network and Innovate UK to create the best environment for innovation to flourish and, in turn, boost the UK’s competitiveness and productivity by commercialising key technological advances.\n\nFind out more about our investment criteria and innovation campuses or get in touch if you are an innovative startup looking for investment.\n\nDefra controls much of the land surrounding The Pirbright Institute (UK)\n\nUKRI was created after The (Victor) Rothschild Report at the same time he created Biotechnology Investments Limited (BIL) – which was the beginning of biotechnology investing by banks https://americans4innovation.blogspot.com/2020/06/how-rothschilds-use-mass-surveillance.html\n\nMercia has invested in startups in various fields. It invested in Oxford Genetics Ltd (a UK based DNA engineering company),[9] in Warwick Audio Technologies from Warwick Ventures of the University of Warwick and in LM Technologies. The fund manager has also invested in Allinea Software, which was a winner in the Red Herring Global 100 and Molecular Solar, also from Warwick Ventures, which got the Lord Stafford Innovation in Development award, both in 2011.[6][7]\n\nIn June 2014, Abzena was the first Mercia Fund Management company to be listed on a public stock exchange.[19]\n\nThe Pilgrims Society overseer: OBE = Order of the British Empire\n\nRating as of May 28, 2021\n\nInvestors = the Pilgrims Society owners of every globalist company on the planet. See recent video on this subject. https://www.lewrockwell.com/2021/04/bill-sardi/who-runs-the-world-blackrock-and-vanguard/\n\nCorporate Transnational Warlord Pirates Are On the Run\n\nContinue your research on this corrupt governor:\n\nDoug Ducey Family Foundation Conspires with Foreign Entities and Banks Involved with the Trump-Russia Hoax, Notably James B. Comey’s HSBC", "opengraph": {"type": "website", "title": "Corruption – Page 2 – Patriots for Truth", "url": "https://patriots4truth.org/category/corruption/", "site_name": "Patriots for Truth", "image": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/aim-4-truth-png-bw.png?fit=714%2C705&ssl=1", "image:width": "714", "image:height": "705", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Doug_Ducey", "https://en.wikipedia.org/wiki/Toledo,_Ohio", "https://en.wikipedia.org/wiki/Ohio", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-1", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-2", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-3", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-4", "https://en.wikipedia.org/wiki/St._John%27s_Jesuit_High_School", "https://en.wikipedia.org/wiki/Arizona_State_University", "https://en.wikipedia.org/wiki/Hensley_%26_Co.", "https://en.wikipedia.org/wiki/Anheuser-Busch", "https://en.wikipedia.org/wiki/Cindy_McCain", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-5", "https://en.wikipedia.org/wiki/Bachelor_of_Science", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-6", "https://en.wikipedia.org/wiki/Arizona_State_University", "https://en.wikipedia.org/wiki/Procter_%26_Gamble", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-sonoranewsgovernor-7", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-8", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-9", "https://en.wikipedia.org/wiki/Kahala_Brands", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-10", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-11", "https://en.wikipedia.org/wiki/Doug_Ducey#cite_note-12", "https://www.imemories.com/", "https://www.bloomberg.com/profile/company/0234540Z:US", "https://pitchbook.com/profiles/company/53496-19#funding", "https://www.aristosventures.com/", "https://www.aristosventures.com/team.html", "https://www.morningstar.com/stocks/xnys/cien/ownership", "http://www.linkedin.com/in/jonbayless", "https://en.wikipedia.org/wiki/HM_Capital_Partners", "https://www.kginvest.net/", "https://www.capitalsouthwest.com/", "https://www.morningstar.com/stocks/xnas/cswc/quote", "https://www.morningstar.com/stocks/xnas/cswc/ownership", "https://www.capitalsouthwest.com/media/CSWC-Tearsheet_May-2021_NonSynd_WebsiteVersion_v1.pdf", "https://www.capitalsouthwest.com/media/CSWC-Company-Overview-Q4-2021_FINAL.pdf", "https://www.crunchbase.com/person/kevin-d-silva", "https://pitchbook.com/profiles/investor/11140-93#team", "https://ukinnovationscienceseedfund.co.uk/", "https://ukinnovationscienceseedfund.co.uk/sample-page/about-us/", "https://ukinnovationscienceseedfund.co.uk/investment-focus/medical-biotechnology/", "https://ukinnovationscienceseedfund.co.uk/investment-focus/synthetic-biology/", "https://ukinnovationscienceseedfund.co.uk/investment-focus/engineering-manufacturing/", "https://ukinnovationscienceseedfund.co.uk/investment-focus/agriculture-food-technology/", "https://ukinnovationscienceseedfund.co.uk/investment-focus/environmental-technology-alternative-energy/", "https://ukinnovationscienceseedfund.co.uk/portfolio/", "https://ukinnovationscienceseedfund.co.uk/wp-content/uploads/2020/03/UKI2S-FINAL-report-26.3.20.pdf", "https://ukinnovationscienceseedfund.co.uk/impact/economic-value/", "https://ukinnovationscienceseedfund.co.uk/investment-focus/partners/", "https://ukinnovationscienceseedfund.co.uk/investment-focus/criteria/", "https://ukinnovationscienceseedfund.co.uk/investment-focus/campuses/", "https://ukinnovationscienceseedfund.co.uk/looking-for-investment/", "https://www.pirbright.ac.uk/specialist-science-facilities/bbsrc-national-virology-centre-plowright-building", "https://americans4innovation.blogspot.com/2020/06/how-rothschilds-use-mass-surveillance.html", "https://en.wikipedia.org/wiki/UK_Research_and_Innovation", "https://en.wikipedia.org/wiki/Mercia_Fund_Management", "http://merciatech.co.uk/", "https://find-and-update.company-information.service.gov.uk/company/09223445", "https://s3.eu-west-2.amazonaws.com/document-api-images-live.ch.gov.uk/docs/wEFx-a7M0eg8J80bn63F09Xmy2_WOrSHMUfmyrjCJ1M/application-pdf?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAWRGBDBV3BS23FNGD%2F20210529%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20210529T134730Z&X-Amz-Expires=60&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEMn%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCWV1LXdlc3QtMiJIMEYCIQCyj2s0QdogKDI%2Fj%2BF1qmtboyzKSParcSlhA3WtkpN%2B7wIhAI3f2%2BWRa52Ro8nxXu8vZncWOUfdqwIBn02zkX9NnqGYKrQDCHEQAxoMNDQ5MjI5MDMyODIyIgy%2FX7rDbBLOMzRLghkqkQM5LY%2F3L3SGjdEOZeCR%2B8%2FC8w6QwJ5wAlKC5KJg3rSz7GpsnE278o8zxMi859MyLJltRwQpq8zhULT3orpXO%2BcWHY72JtMeOh%2Bzh6CDZA421XtHc2BfU0XSSemJHlyQK5PweEKQ7E6D91i7T4SXlovfaXjPksaEqpGXvDBIr%2FTdjl0mK4OZWoxyRCaam39OIyDPnUlffm%2FDviWWxGG%2BVKaaQ%2Ftm8m6wffxnOikFLdjtOlKmcMwmmrl%2FgMsMRviWIbffH3rr6v6UIuYs16EBce9PGKulCtmbVGt4An9337GfzLSyRvgcjlQGTt7W68Vn8jWt1eRNIPLeDj81i%2BCM8jLXSHKUVwUhXE%2B0We%2F8nJ4nsyWp5Mm%2FGDefhO2NQzBBlY6SrnU66SXrLohKlKIhT%2BGAvGSphBHOWo%2FnYNGd6FKu7J6t59yV6GuP%2BK7rWKDFGqyRd7HX%2FSYDH7YZQhwLm0EF5731KN%2FuTO%2FHkir%2FAXAF5eGVEGkNSpRSi6T5aD7yN1Gz%2BV35OcNWVLBWjR8vucQcUjDJ8MeFBjrqAdjd4CsLIBk85XblqHMkNGttZk9rcXUoUpWV3S%2FsIOXLvyWSkzvP33aDc7n%2BimrJpMsdvofGHCI2zGqnigGDg%2BIBkFnh0RH5G2qflTB15MwAjL85FV8AvVqB%2F%2FxIbdxtXyeQQ5oynuaJfyakKX8X7oDuWyMedzo7XwqXUmAdywybj6%2FKfkgDnLZGM%2BiRQ4BA3wIz1sgomXSP6mOFlRUopaPymP%2Fr%2BzsCBO9yWzd4xVV0xo17Y89rgLegZvNLQpWpO8aT2c805AvrASA4Qyv6WxFkwawh10EGlVpcB6TBfcxBp6zpx5NsvFwu%2BQ%3D%3D&X-Amz-SignedHeaders=host&response-content-disposition=inline%3Bfilename%3D%22companies_house_document.pdf%22&X-Amz-Signature=b7b5553c706bfa2a83a101d4f30e3494da500c4ea4ece099d3e04f5977408df0", "https://en.wikipedia.org/wiki/Mercia_Fund_Management#cite_note-IVC-9", "https://en.wikipedia.org/wiki/Warwick_Ventures", "https://en.wikipedia.org/wiki/University_of_Warwick", "https://en.wikipedia.org/wiki/Mercia_Fund_Management#cite_note-Warwick-6", "https://en.wikipedia.org/wiki/Mercia_Fund_Management#cite_note-Angel-7", "https://en.wikipedia.org/wiki/Mercia_Fund_Management#cite_note-19", "https://www.morningstar.com/sign-up/premium", "https://www.morningstar.com/stocks/xnys/ivz/quote", "https://www.morningstar.com/stocks/xnys/ivz/ownership", "https://www.lewrockwell.com/2021/04/bill-sardi/who-runs-the-world-blackrock-and-vanguard/", "https://aim4truth.org/2017/12/29/corporate-transnational-warlord-pirates-are-on-the-run/", "https://www.linkedin.com/in/rick-merrill-42758813/", "https://www.businesswire.com/news/home/20150127006528/en/Prudential-California-Realty-Joins-Berkshire-Hathaway-HomeServices-Real-Estate-Brokerage-Network", "https://patriots4truth.org/2021/06/02/doug-ducey-family-foundation-is-corrupt/"], "authors": [], "publish_date": "September 2, 2021"}