{"result_id": "238035", "URL": "https://patriots4truth.org/category/genocide/", "timestamp": "2023-04-25 16:47:12 CEST+0200", "meta": {"description": "Posts about Genocide written by Our Spirit", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/category/genocide/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Genocide – Patriots for Truth", "cleaned_text": "STAY AWAY FROM THE VAXXED, IT IS OFFICIAL, FROM PFIZER’S OWN DOCUMENTS\n\n\n\nI am so scared by this my brain is jamming and I am not coding right. I am fixing the coding errors now.\n\n\n\nDownload from original source\n\n\n\nhttps://media.tghn.org/medialibrary/2020/11/C4591001_Clinical_Protocol_Nov2020_Pfizer_BioNTech.pdf\n\n\n\nDownload from my server\n\n\n\nhttp://82.221.129.208/pfizervax.pdf\n\n\n\nTHE ELITE HAVE ALREADY FFED OFF TO THEIR HIDEOUTS, THEY HAVE RELEASED THE GENOCIDE\n\n\n\nREAD IT AND WEEP, WE ARE EFFED. PFIZER’S OWN DOCUMENTS STATE BOTH INHALATION AND SKIN CONTACT WILL TRANSMIT WHATEVER IS IN THE VAX FROM THE VACCINATED TO THE UNVACCINATED\n\n.\n\nHere is what just this small portion of this Pfizer document is saying:\n\n\n\n1. If a man who was not vaccinated touches a vaccinated woman, or breathes any of the air she breathes, (in other words, walks by her in the office) and he then has sex with his wife, his wife can have an adverse event and she should avoid having children.\n\n2. If a woman who was never vaccinated gets exposed to a woman who was vaccinated, she can:\n\nA: miscarry,\n\nB: spontaneously abort,\n\nC. poison a baby via her breast milk\n\nD: have babies that have cognitive difficulties.\n\n\n\nThis is universal, and very bad. Here is a small section of text I translated to English:\n\n\n\n8.3.5.3. Occupational Exposure\n\n“An occupational exposure occurs when a person receives unplanned direct contact with a vaccine test subject, which may or may not lead to the occurrence of an adverse event. These people may include health care providers, family members, and other people who are around the trial participant.\n\n\n\nWhen such exposures happen, the investigator must report them to Pfizer safety within 24 hours of becoming aware of when they happened, regardless of whether or not there is an associated secondary adverse event. This must be reported using the vaccine secondary adverse event report form. SINCE THE INFORMATION DOES NOT PERTAIN TO A PARTICIPANT INVOLVED IN THE STUDY, THE INFORMATION WILL BE KEPT SEPARATE FROM THE STUDY.”\n\n\n\nTO CLARIFY: Vaccine study participants become super spreaders of something, they don’t say what it is, but it triggers secondary adverse events in people that never had the vax, when they are exposed to people who did have the vax.\n\n\n\nTHIS IS SO BAD that right here, in this little bit of quoted text, it warns that un-vaccinated men who have been exposed to a woman who was vaxxed will then pass whatever is in the vax to another woman.\n\n\n\nEven the relatively small portion of the document I have put below here says the vax triggers spontaneous abortions and reproductive problems when un-vaccinated people are exposed to the vaccinated and that breast milk from a vaccinated mom can harm the infant. And if anyone does not believe it, then click the link above and wade through that enormous and intentionally confusing document. It’s for real folks, the vax is indeed the kill shot.\n\nDo not permit the vaccinated to come anywhere near you, it is now official.\n\n\n\nHere is a small portion of this huge document, straight from pfizer:\n\nTerms:\n\nStudy intervention – A vaccine test subject.\n\nAE – Adverse event in someone who got the vax.\n\nSAE: An adverse event in someone who was exposed to someone who got the vax.\n\nEDP: Exposure during pregnancy\n\n\n\n8.3.5. Exposure During Pregnancy or Breastfeeding, and Occupational Exposure Exposure to the study intervention under study during pregnancy or breastfeeding and occupational exposure are reportable to Pfizer Safety within 24 hours of investigator awareness.\n\n8.3.5.1. Exposure During Pregnancy An EDP occurs if:\n\n* A female participant is found to be pregnant while receiving or after discontinuing study intervention.\n\n* A male participant who is receiving or has discontinued study intervention exposes a female partner prior to or around the time of conception.\n\n* A female is found to be pregnant while being exposed or having been exposed to study intervention due to environmental exposure. Below are examples of environmental exposure during pregnancy:\n\n* A female family member or healthcare provider reports that she is pregnant after having been exposed to the study intervention by inhalation or skin contact.\n\n* A male family member or healthcare provider who has been exposed to the study intervention by inhalation or skin contact then exposes his female partner prior to or around the time of conception.\n\n\n\n\n\nIf this vax is not shedding into other people, why would contact between vaccinated and un-vaccinated be an event worth noting? If this vax is not shedding, then WHY does a guy who has been around a vaccinated woman, even if he did not touch her or have sex, need to worry about getting a different woman pregnant?\n\n\n\n\n\nThat’s not all, the following is detailed, and far worse.\n\n\n\nThe investigator must report EDP to Pfizer Safety within 24 hours of the investigator’s awareness, irrespective of whether an SAE has occurred. The initial information submitted should include the anticipated date of delivery (see below for information related to termination of pregnancy).\n\n* If EDP occurs in a participant or a participant’s partner, the investigator must report this information to Pfizer Safety on the Vaccine SAE Report Form and an EDP Supplemental Form, regardless of whether an SAE has occurred. Details of the pregnancy will be collected after the start of study intervention and until 6 months after the last dose of study intervention.\n\n* If EDP occurs in the setting of environmental exposure, the investigator must report information to Pfizer Safety using the Vaccine SAE Report Form and EDP Supplemental Form. Since the exposure information does not pertain to the participant enrolled in the study, the information is not recorded on a CRF; however, a copy of the completed Vaccine SAE Report Form is maintained in the investigator site file. Follow-up is conducted to obtain general information on the pregnancy and its outcome for all EDP reports with an unknown outcome. The investigator will follow the pregnancy until completion (or until pregnancy termination) and notify Pfizer Safety of the outcome as a follow-up to the initial EDP Supplemental Form. In the case of a live birth, the structural integrity of the neonate can be assessed at the time of birth. In the event of a termination, the reason(s) for termination should be specified and, if clinically possible, the structural integrity of the terminated fetus should be assessed by gross visual inspection (unless preprocedure test findings are conclusive for a congenital anomaly and the findings are reported). Abnormal pregnancy outcomes are considered SAEs. If the outcome of the pregnancy meets the criteria for an SAE (ie, ectopic pregnancy, spontaneous abortion, intrauterine fetal demise, neonatal death, or congenital anomaly), the investigator should follow the procedures for reporting SAEs. Additional information about pregnancy outcomes that are reported to Pfizer Safety as SAEs follows:\n\n\n\n* Neonatal deaths that occur within 1 month of birth should be reported, without regard to causality, as SAEs. In addition, infant deaths after 1 month should be reported as SAEs when the investigator assesses the infant death as related or possibly related to exposure to the study intervention. Additional information regarding the EDP may be requested by the sponsor. Further follow-up of birth outcomes will be handled on a case-by-case basis (eg, follow-up on preterm infants to identify developmental delays). In the case of paternal exposure, the investigator will provide the participant with the Pregnant Partner Release of Information Form to deliver to his partner. The investigator must document in the source documents that the participant was given the Pregnant Partner Release of Information Form to provide to his partner.\n\n8.3.5.2. Exposure During Breastfeeding An exposure during breastfeeding occurs if:\n\n* A female participant is found to be breastfeeding while receiving or after discontinuing study intervention.\n\n* A female is found to be breastfeeding while being exposed or having been exposed to study intervention (ie, environmental exposure). An example of environmental exposure during breastfeeding is a female family member or healthcare provider who reports that she is breastfeeding after having been exposed to the study intervention by inhalation or skin contact. The investigator must report exposure during breastfeeding to Pfizer Safety within 24 hours of the investigator’s awareness, irrespective of whether an SAE has occurred. The information must be reported using the Vaccine SAE Report Form. When exposure during breastfeeding occurs in the setting of environmental exposure, the exposure information does not pertain to the participant enrolled in the study, so the information is not recorded on a CRF. However, a copy of the completed Vaccine SAE Report Form is maintained in the investigator site file. An exposure during breastfeeding report is not created when a Pfizer drug specifically approved for use in breastfeeding women (eg, vitamins) is administered in accord with authorized use. However, if the infant experiences an SAE associated with such a drug, the SAE is reported together with the exposure during breastfeeding.\n\nHere’s the clear part of this, that everyone can understand:\n\n\n\n8.3.5.3. Occupational Exposure An occupational exposure occurs when a person receives unplanned direct contact with the study intervention, which may or may not lead to the occurrence of an AE. Such persons may include healthcare providers, family members, and other roles that are involved in the trial participant’s care. The investigator must report occupational exposure to Pfizer Safety within 24 hours of the investigator’s awareness, regardless of whether there is an associated SAE. The information must be reported using the Vaccine SAE Report Form. Since the information does not pertain to a participant enrolled in the study, the information is not recorded on a CRF; however, a copy of the completed Vaccine SAE Report Form is maintained in the investigator site file.\n\nI WILL TRANSLATE THAT TO ENGLISH:\n\n\n\nAn occupational exposure occurs when a person receives unplanned direct contact with a vaccine test subject, which may or may not lead to the occurrence of an adverse event. These people may include health care providers, family members, and other people who are around the trial participant.\n\nWhen such exposures happen, the investigator must report them to Pfizer safety within 24 hours of becoming aware of when they happened, regardless of whether or not there is an associated secondary adverse event. This must be reported using the vaccine secondary adverse event report form. SINCE THE INFORMATION DOES NOT PERTAIN TO A PARTICIPANT INVOLVED IN THE STUDY, THE INFORMATION WILL BE KEPT SEPARATE FROM THE STUDY.\n\n\n\nMy comment: This is why we have green screen Biden. They are ALL green screen now, we just caught Biden. They are green screen and working from sets because they have opened Pandora’s box and intend to hide out until everything is finished. This is why many people are claiming the white house is empty and that they are working from a set ad are not actually there. Because they are not there. If they do ever go on camera, they are not where they say they are.\n\nIndia is having their disaster happen now because they started with the vaxxes first, and have more people vaxxed than any other country.\n\nVIDEO David Icke and Celest Solum – Your body becomes a bio-reactor with these zombie bioweapons.\n\nListen to Clif High describe vaxxidents in this video: VAXXXIDENTS – EXPLORERS’ GUIDE TO SCIFI WORLD", "opengraph": {"type": "website", "title": "Genocide – Patriots for Truth", "url": "https://patriots4truth.org/category/genocide/", "site_name": "Patriots for Truth", "image": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/aim-4-truth-png-bw.png?fit=714%2C705&ssl=1", "image:width": "714", "image:height": "705", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["http://82.221.129.208/.uo4.html", "https://patriots4truth.org/wp-content/uploads/2021/04/pfizer-vax.pdf", "https://patriots4truth.org/wp-content/uploads/2021/04/pfizer-vax.pdf", "https://media.tghn.org/medialibrary/2020/11/C4591001_Clinical_Protocol_Nov2020_Pfizer_BioNTech.pdf", "http://82.221.129.208/pfizervax.pdf", "http://bitchute.com/video/9x3Sj42L0YUO/", "https://www.bitchute.com/video/tUHq0KkPSAOK/"], "authors": [], "publish_date": "March 18, 2022"}