{"result_id": "238008", "URL": "https://patriots4truth.org/2022/08/12/learn-how-to-research-like-an-afi-miner/", "timestamp": "2023-04-25 16:46:51 CEST+0200", "meta": {"description": "How to Research like a MINER https://youtu.be/3-eMSRVk_3E A Michigan AIMCat wrote us: Your research work, and the work of the miners, has inspired me to try to research and create an expose on the leader of the Michigan Republican party, Ron Weiser. He is on the board of WEF and has been leading Michigan politician…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/2022/08/12/learn-how-to-research-like-an-afi-miner/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Learn how to research like an AFI miner", "cleaned_text": "How to Research like a MINER\n\nYour research work, and the work of the miners, has inspired me to try to research and create an expose on the leader of the Michigan Republican party, Ron Weiser. He is on the board of WEF and has been leading Michigan politician in support of failed RINOs. He recently tried to take Macomb County from the grassroots leaders.\n\nI was wondering if the miners might have some tips as to how they are able to uncover so much otherwise hidden information. Do they employ a defined methodology (as V I suppose an engineer like you would)? Do they just query and do deep dives on what the find? I will bet they rely extensively on resources I haven’t even considered.\n\nThank you for the work you do, and thanks in advance for any tips.\n\nOur reply and we ask that you share these tips widely and USE THEM!\n\nThe shortest answer is see what is there, first, then, follow those links to see other links, start noting the interlocked relationships, follow each of those until you find the devils and their dirty deeds and data. Keep a file of notes, links, screen captures on your journey in a WORD file. That way, when you start preparing your write up, you won’t have to wonder where you got the earlier stuff.\n\nWhenever you discover items being censored, that is a clue to focus on that item as it is usually a smoking gun for information the demons think they should hide.\n\nThe demons usually hide a few layers deep, sometimes many layers.\n\nWe only use open source information from internet, libraries, archives, media, newspapers, genealogy, some of it is free, some of it is subscription. Then, persist, persist, persist. Sometimes weeks can go by rummaging through information before a break occurs. You have to be patient and dogged. This process is not for souls that give up easily because it is “too hard.”\n\nBefriend good state library researchers. They can be very helpful in tracking down stuff for you.\n\nDon’t be satisfied with evidence until it is “judicially recognizable”… that is, it is already so notoriously known, or comes from a notoriously accepted source that it can be used in court without further validation.\n\nWhen you save files, start with the date, ie. YYYY-MM-DD-CITATIONS-MO-DY–YYYY. This way people can get a context date for the material. For example, here is a recent document we will be posting.\n\nThe more of the subject you can get in the filename, the better. File names should be shortened when they get too long. iPads sometimes have trouble with too long file names. Windows PCs, less so.\n\nNote: all writings, speeches and information posted by public officials and institutions is judicially recognizable. Make sure you present a proper bibliography for the citation, including the original sources and links where possible. Without the links, it is hard for others to do their own verifications.\n\nOn anything you post, be sure to write “Reproduced for educational purposes only. Fair Use relied upon.” This will keep you from trouble and accusations of copyright violation vis a vis the Fair Use doctrine.\n\nFind a reliable place to post your research documents, and remember you can always send your research to us where we can post on one of our several blogs. You can also open up a substack account and publish your work – then post your findings to Gab or other platform where we can help you circulate it.", "opengraph": {"type": "article", "title": "Learn how to research like an AFI miner", "url": "https://patriots4truth.org/2022/08/12/learn-how-to-research-like-an-afi-miner/", "description": "How to Research like a MINER A Michigan AIMCat wrote us: Your research work, and the work of the miners, has inspired me to try to research and create an expose on the leader of the Michigan Republ…", "article:published_time": "2022-08-12T17:56:33+00:00", "article:modified_time": "2022-08-12T17:56:33+00:00", "site_name": "Patriots for Truth", "image": "http://img.youtube.com/vi/3-eMSRVk_3E/0.jpg", "image:secure_url": "https://img.youtube.com/vi/3-eMSRVk_3E/0.jpg", "image:width": "714", "image:height": "705", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "845", "height": "476", "embed_code": "<iframe class=\"youtube-player\" width=\"845\" height=\"476\" src=\"https://www.youtube.com/embed/3-eMSRVk_3E?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/3-eMSRVk_3E?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://youtu.be/3-eMSRVk_3E", "https://patriots4truth.org/2022/08/12/learn-how-to-research-like-an-afi-miner/?share=twitter", "https://patriots4truth.org/2022/08/12/learn-how-to-research-like-an-afi-miner/?share=facebook"], "authors": [], "publish_date": "2022-08-12T17:56:33+00:00"}