{"result_id": "238013", "URL": "https://patriots4truth.org/2022/04/19/go-after-corrupt-school-board-go-after-their-bonds/", "timestamp": "2023-04-25 16:46:55 CEST+0200", "meta": {"description": "Stop The Tyranny Fight Back (Excerpt from https://bondsforthewin.com/stop-the-tyranny-fight-back/) \"Every Government Elected Official since 1792 is obligated to obtain a PUBLIC OFFICIAL SURETY bond before he can take the oath of office. So why is this important to us? The surety bond is a PERSONAL LIABLILITY to the Public Official.The bond is our SECURITY and PERSONAL…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/2022/04/19/go-after-corrupt-school-board-go-after-their-bonds/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Go after corrupt school board; Go after their bonds", "cleaned_text": "“Every Government Elected Official since 1792 is obligated to obtain a PUBLIC OFFICIAL SURETY bond before he can take the oath of office.\n\nSo why is this important to us?\n• The surety bond is a PERSONAL LIABLILITY to the Public Official.\n• The bond is our SECURITY and PERSONAL GUARANTEE that the Public Official will do his job and doesn’t harm WE THE PEOPLE.\n• The Public Official has taken an oath to uphold the constitution of his state and of the United States.\n• If he fails to uphold the constitution, he is personally liable for all damages he has caused.\n• The surety bond is a two way contract between the Public Official and We The People.\n• If the Public Official breaks this contract We the People can file a claim against him personally through the Surety Bond Company.\n\nEvery action a Public Official does while he holds this office, he is personally responsible for. If he fails to uphold the constitution or enforces unlawful laws on We the People we can hold him personally accountable for these actions.\n\nThe Constitution of the United State, of each State and the Bill of Rights protects We the People. If enough people are tired of\n• Discrimination from businesses if we are not vaccinated\n• Forced PCR testing to keep your job\n• Trying to force vaccines in public school\n\nWe have the means to stop this now. Once we file a letter of intent to file a claim against the Public Officials surety bond he stands up and take notice. All it takes is 10 strong people to stand up and fight back. The Public Official is personally liable for each and every claim that is filed against their Surety Bond. He only has two choices now. Listen to our demands and change or pay us the full amount of his surety bond.\n\nOnce enough claims are filed against the surety bond the bond company will cancel his bond. This does not affect us. We will still be paid for all damages. If the Public Official surety bond is cancelled and he cannot obtain a new surety bond he is forced to step down. The Public Official cannot hold office if he cannot be bonded.”\n\nVIDEO Go after the School Board, Go after their bonds – Bonds for the Win – Step 1: Obtain the Bond\n\nVIDEO Go after the School Board, Go after their bonds-Bonds for the Win – Step 2: Serve a Letter of Intent\n\nVIDEO Go after the School Board, Go after their bonds – Bonds for the Win – Step 3: Filing a Claim\n\n“The Public Official is NOT performing their duties for the community or they are enforcing mandates that are NOT laws upon the people.\n• Write a letter to the Public Official demanding a certified copy of their Surety Bond – every Public Official is required to provide this information by law. In some states you might be required to pay a small fee to obtain this copy.\n• Write a letter to the Public Official of intent to file against the Surety Bond. State in this letter what harm he/she has caused you or the community, what needs to be done to rectify the situation, and the timeline for rectification. You should also include the amount of money they will be liable for and an explanation of how Surety Bonds work.\n• If the Public Official does not stop or take the action(s) you request, you can put them on notice by submitting a “Color of Law” violation.\n• If this fails, you can write a claim against the Public Official’s Surety Bond. Depending on the laws of your state, more than one claim can be filed against a single bond holder. To submit this claim, simply write a letter to the company that holds the Surety Bond. State in this claim letter what harm the Public Official has caused you or the community. In some states the bonding company may require that you fill out a form. \n\n\n\nWhat Happens Next?\n\nOnce you file the claim the Bond Company will inform the Public Official.\n• The Surety Company will then REQUIRE the Public Official to take care of the claim.\n• If the Public Official fails to take care of the claim the Surety Company will start an investigation to determine the claim’s validity.\n• If the Surety Company determines your claim is invalid no further actions will be taken. The Public Official will be liable for any costs the Surety company incurred during the investigation process.\n• If the claim is valid the company will contact the Public Official and remind them of their obligations under the bond. The Public Official can either:\n• Offer a resolution to the claim which will include compensating YOU for any financial loss or damages incurred.\n\n -OR-\n• They can submit a defense to the claim.\n• If the Public Official fails to respond or resolve the claim the Surety Company will make a decision based upon the information and documentation that you provided for the claim. The Surety Company will then pay YOU for the claim. Once the Surety Company pays the claim they will go after the Public Official to reimburse the amount of the settlement and any legal costs associated with it.\n\nDo We Have to Go To Court?\n\nNo, there is no need to go to court once you file a claim with the surety company. The surety company handles the claim and if needed, they will investigate the claim and pay you the damages. The Public Official is liable for all costs and the amount of the claim. Your claim cannot exceed the amount that is listed on the Surety Bond.\n\nKeep in mind that once a claim is made, this does not immediately cancel the Surety Bond for the Public Official. According to the revised code of each state, more than one claim can be filed against a Public Official surety bond.\n\nWhat Happens to the Public Official?\n\nThis depends on the Surety Bond Company. If there are too many complaints made against the bond or too many claims paid out they might cancel the bond. Once a bond has been cancelled it will be difficult for the Public Official to be bonded or licenced again by any other Surety Bond Company.\n\nPublic Officials are required by law to be bonded in order to hold office. If their bond has been cancelled and they are unable to obtain a new bond they will not be able to hold any public office.\n\nHow Does this Work in Our Favor?\n\nIf a Public Official is not performing his elected duties, these Surey Bonds give you, the public a chance to unseat them. This is one of the oldest laws on the books and it has been in effect since 1792.\n\nThe bond is a guarantee to We The People that Public Officials will not step outside the bounds of their office and enforce unlawful restrictions and laws on the public.\n\nDoes This Also Work for Businesses?\n\nThere are many types of surety bonds. The type of business will determine the type of bond the business must carry. Remember you can always request a copy of the company’s surety bond and read the provisions of the bond. Furthermore, there are different ways to file against other bonds and the surety bond company will supply you with this information upon request.\n\nNote: In order to obtain and qualify for government contracts, employers must be licensed and bonded. Generally the amount of coverage is based on the amount of the contract with the government.”\n\nLEARN MORE AND CALL TO ACTION. https://bondsforthewin.com/", "opengraph": {"type": "article", "title": "Go after corrupt school board; Go after their bonds", "url": "https://patriots4truth.org/2022/04/19/go-after-corrupt-school-board-go-after-their-bonds/", "description": "Stop The Tyranny Fight Back (Excerpt from “Every Government Elected Official since 1792 is obligated to obtain a PUBLIC OFFICIAL SURETY bond before he can take the oath of office. So why is t…", "article:published_time": "2022-04-19T15:12:13+00:00", "article:modified_time": "2022-04-19T15:12:13+00:00", "site_name": "Patriots for Truth", "image": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/aim-4-truth-png-bw.png?fit=714%2C705&ssl=1", "image:width": "714", "image:height": "705", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://bondsforthewin.com/stop-the-tyranny-fight-back/", "https://www.bitchute.com/video/0rR4IGDMSGf6/", "https://www.bitchute.com/video/WEFzrqoHtQsP/", "https://www.bitchute.com/video/XQ9rpZUSr3g8/", "https://bondsforthewin.com/what-are-surety-bonds/", "https://bondsforthewin.com/bond-request-letter-examples?swcfpc=1", "https://bondsforthewin.com/intent-to-file-claim?swcfpc=1", "https://bondsforthewin.com/2022/01/02/abuse-of-power-color-of-law-or-color-of-office", "https://bondsforthewin.com/", "https://patriots4truth.org/2022/04/19/go-after-corrupt-school-board-go-after-their-bonds/?share=twitter", "https://patriots4truth.org/2022/04/19/go-after-corrupt-school-board-go-after-their-bonds/?share=facebook"], "authors": [], "publish_date": "2022-04-19T15:12:13+00:00"}