{"result_id": "238040", "URL": "https://patriots4truth.org/2022/03/18/pottenger-cat-study/", "timestamp": "2023-04-25 16:47:16 CEST+0200", "meta": {"description": "In Dr. Pottenger's classical experiments in cat feeding, more than 900 cats were studied over 10 years. Dr. Pottenger found that only diets containing raw milk and raw meat produced optimal health: good bone structure and density, wide palates with plenty of space for teeth, shiny fur, no parasites or disease, reproductive ease and gentleness.…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2017/12/cropped-aim-4-truth-png-bw1.png?fit=32%2C32&ssl=1", "canonical": "https://patriots4truth.org/2022/03/18/pottenger-cat-study/", "encoding": "UTF-8"}, "image": null, "domain": "patriots4truth.org", "title": "Pottenger Cat Study", "cleaned_text": "“Dr. Pottenger was an original thinker and keen observer whose imagination, integrity and common sense gave him the courage to question official dogma. Dedicated to the cause of preventing chronic illness, he made significant contributions to the understanding of the role of nutrition in maintaining good health.\n\nIn his classical experiments in cat feeding, more than 900 cats were studied over 10 years. Dr. Pottenger found that only diets containing raw milk and raw meat produced optimal health: good bone structure and density, wide palates with plenty of space for teeth, shiny fur, no parasites or disease, reproductive ease and gentleness.\n\nCooking the meat or substituting heat processed milk for raw resulted in heterogeneous reproduction and physical degeneration, increasing with each generation. Vermin and parasites abounded. Skin diseases and allergies increased from 5% to over 90%. Bones became soft and pliable. Cats suffered from adverse personality changes, hypothyroidism and most of the degenerative diseases encountered in human medicine. They died out completely by the fourth generation.”\n\nThe is the reason why our food supply is IRRADIATED, which destroys the enzymes and good bacteria in the food, before it reaches the grocery stores into the human diet, is a form of genocide or extermination program of human beings. This is another example of the Pilgrim Society’s efforts to wage war against humanity through the food supply. If humans respond like these cats, then after four generations, humans who consumed low-enzyme diets will no longer be able to reproduce. In the meantime, generations 1 – 3 provide customers to the pharmaceutical and medical industries.\n\nWe do not buy produce and meats from warehouse stores like Costco, Sam’s Club, Aldi’s, Gordon Food because of rampant irradiation. We are very careful when we purchase in large regional and national grocery stores as well, like Meijer, Publix, Kroger (and similar ones in your neighborhood) for the same reason. There is a reason that produce and meats from these stores last so long in your refrigerator – they have been “nuked” and all the enzymes and good bacteria killed. This means that you cannot digest this product which has become ‘plastic’ with added vitamins.\n\nWe are posting these PDFs about the Pottenger Cat Study because the internet has scrubbed many of these reports or hides them behind expensive paywalls.\n\nAIMCats send these experimental cats our appreciation for giving up their lives to improve ours.", "opengraph": {"type": "article", "title": "Pottenger Cat Study", "url": "https://patriots4truth.org/2022/03/18/pottenger-cat-study/", "description": "In Dr. Pottenger’s classical experiments in cat feeding, more than 900 cats were studied over 10 years. Dr. Pottenger found that only diets containing raw milk and raw meat produced optimal h…", "article:published_time": "2022-03-18T14:30:44+00:00", "article:modified_time": "2022-03-18T14:36:25+00:00", "site_name": "Patriots for Truth", "image": "https://i0.wp.com/patriots4truth.org/wp-content/uploads/2022/03/cat-family.jpg?fit=1200%2C800&ssl=1", "image:width": "1200", "image:height": "800", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://patriots4truth.org/wp-content/uploads/2022/03/WHY-WE-DONT-LIKE-FOOD-IRRADIATION-whats-wrong-with-food-irradiation.pdf", "https://patriots4truth.org/wp-content/uploads/2022/03/WHY-WE-DONT-LIKE-FOOD-IRRADIATION-whats-wrong-with-food-irradiation.pdf", "https://www.fbcoverup.com/docs/library/2002-04-01-Editorial-A-Cat-Study-Vol-24-Issue-3-pp-225-227-by-Pamela-J-Brinks-PubMed-Apr-01-2002.pdf", "https://patriots4truth.org/wp-content/uploads/2022/03/2002-04-01-Editorial-A-Cat-Study-Vol-24-Issue-3-pp-225-227-by-Pamela-J-Brinks-PubMed-Apr-01-2002.pdf", "https://patriots4truth.org/wp-content/uploads/2022/03/2002-04-01-Editorial-A-Cat-Study-Vol-24-Issue-3-pp-225-227-by-Pamela-J-Brinks-PubMed-Apr-01-2002.pdf", "https://www.fbcoverup.com/docs/library/2002-Dr-Pottenger's-Cat-Study-re-Dr-Francis-M-Pottenger-MD-by-Ron-Schmid-ND-Price-Pottenger-Nutrition-Foundation-2002.pdf", "https://patriots4truth.org/wp-content/uploads/2022/03/2002-Dr-Pottengers-Cat-Study-re-Dr-Francis-M-Pottenger-MD-by-Ron-Schmid-ND-Price-Pottenger-Nutrition-Foundation-2002.pdf", "https://patriots4truth.org/wp-content/uploads/2022/03/2002-Dr-Pottengers-Cat-Study-re-Dr-Francis-M-Pottenger-MD-by-Ron-Schmid-ND-Price-Pottenger-Nutrition-Foundation-2002.pdf", "https://patriots4truth.org/2022/03/18/pottenger-cat-study/?share=twitter", "https://patriots4truth.org/2022/03/18/pottenger-cat-study/?share=facebook"], "authors": [], "publish_date": "2022-03-18T14:30:44+00:00"}