{"result_id": "239040", "URL": "https://www.paulcraigroberts.org/2021/07/15/how-the-covid-pandemic-was-orchestrated/", "timestamp": "2023-04-25 16:47:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.paulcraigroberts.org/wp-content/images/fav.png", "canonical": "https://www.paulcraigroberts.org/2021/07/15/how-the-covid-pandemic-was-orchestrated/", "encoding": "UTF-8"}, "image": null, "domain": "www.paulcraigroberts.org", "title": "How the Covid “Pandemic” Was Orchestrated", "cleaned_text": "How the Covid “Pandemic” Was Orchestrated\n\nVAERS data released today by the CDC showed a total of 463,457 reports of adverse events from all age groups following COVID vaccines, including 10,991 deaths and 48,385 serious injuries between Dec. 14, 2020 and July 9, 2021. VAERS reports that Covid deaths rose by 2,000 in the US in the past week. Remember, at best VAERS captures 10% of vaccine deaths and adverse effects.\n\nSimultaneously with this CDC release, the moron who is director of the CDC touted the killer vaccine as your assured protection.\n\nOver time malaria has developed some resistance to HCQ, and an alternative therapy is the current recommendation. However, Malaria’s resistance to HCQ has not resulted in a complete transition to artemisinin-based combination therapies. “CQ usage has continued for many years after the switch in national policies for the treatment of P.f.” P.f. stands for Plasmodium falciparum malaria —https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3820326/\n\nThe study concludes: “The spatial trend of CQ use reduction in African countries post policy change is illustrated in Figure S6. There are countries in East and West Africa with slow and fast reduction of CQ use, i.e., there is no obvious spatial pattern in the reduction of CQ use.”\n\nHCQ use has persisted because the replacement therapy (ACT) cost 25 times more: In Africa only a handful of countries with P. vivax recommend CQ. “However, CQ usage has persisted for many years after policy change. Studies have shown that between 40% and 60% of those who seek treatment of fever in malaria-endemic countries access drugs in the private sector, where CQ and SP (an earlier HCQ replacement) are up to 25 times less expensive than an ACT. In fact, this price differential was a primary motivation for the formation of the Affordable Medicines Facility—malaria (AMFm), a program designed to address this disparity. Furthermore, despite treatment guidelines that recommend ACTs, SP and CQ remain registered in many countries and because they are authorized to move through the marketplace, are highly available.”\n\nAs a malaria preventative, the artemisinin-based therapies could have similar properties to HCQ and thereby provide similar protection against Covid as HCQ.\n\nThe fact remains that according to the World Health Organization, over the entire length of the Covid pandemic Tanzania has only 509 cases and 21 deaths attributed to Covid. Tanzania’s population is nearly 60,000,000, which means that Covid is a non-existent problem for Tanzania.\n\nCorrection: I say all Covid vaccines are mRNA technology and have the same problems. In fact, what I should have written is that there are mRNA vaccines and vector vaccines and both work by delivering the Spike protein. Therefore, they all have the same problem.\n\nHow the Covid “Pandemic” Was Orchestrated\n\nEverything you should know about Covid\n\nThe virus is real. It is a danger to people with poor immune systems and to those with co-morbidities. People of any age could have impaired immune systems and serious illnesses. However, immune and health problems are more associated with the elderly as they have had a lifetime to engage in bad habits and non-healthy living. The vast majority of those whose deaths were attributed to Covid had co-morbidities.\n\nEven so, the elderly stricken with Covid still had a high survival rate of about 95 percent. Everyone else had a 98 or 99 percent survival rate. It is impossible to have precise numbers because the data is skewed to maximize Covid deaths. Hospitals were given economic incentives to report all deaths as Covid deaths as long as the person had Covid or a positive PCR test. A person who died in a motorcycle crash was listed as a Covid death because he had a positive PCR test. https://www.beckershospitalreview.com/data-analytics/florida-covid-19-fatalities-data-included-man-who-died-in-motorcycle-accident.html\n\nThe real question is whether the people who reportedly had Covid died from it, or from the lack of treatment, or the wrong treatment. Initially, hospitalized Covid patients were put on ventilators and were killed by the ventilators until a doctor figured out that the breathing problem had a different cause than what they assumed and issued a warning. Other Covid deaths were due to the lack of treatment.\n\nRemember, the assumption was that there were no treatments, thus the emphasis on developing a vaccine, but there were two highly successful, safe, and inexpensive treatments based on HCQ and Ivermectin. These treatments stood in the way of emergency permission to use untested and unapproved vaccines and were demonized for the sake of Big Pharma vaccine profits. So if you had Covid, they sent you home untreated until you got so bad that you had to be hospitalized, and then they killed you with ventilators.\n\nIn other words, we do not really know if anyone died from Covid itself.\n\nIf you care to understand what a total failure the entirety of the world’s health authorities have been in dealing with the “Covid pandemic” consider that in malaria-infested African countries there is no Covid, no masks, no lockdowns. Why is this? The answer is that in malaria-infested countries people take a HCQ pill one a week.\n\nConsider Tanzania, for example. The entire population of Tanzania—59,734,218 people— is considered at risk for malaria, with 93% of the population living in malaria transmission areas. Consequently, the population takes HCQ once a week as a preventative against malaria. HCQ is also a preventative and a cure for Covid. In all of Tanzania over the period from January 3, 2020 to July 14, 2021, there are only 509 reported cases of Covid and 21 reported deaths. Almost all occurred in April 2020. https://covid19.who.int/region/afro/country/tz\n\nAs the Covid test is unreliable and known to produce false positives and as anyone who dies who has a positive test has his death reported as a Covid death, we don’t actually know if there is a single case or a single death from Covid in Tanzania.\n\nThe Covid case numbers were greatly inflated by the PCR test. It is now understood that at the high rate of cycles at which the test was run it produces a false positive rate as high as 97 percent. Many and perhaps most of the mild cases and cases without symptoms were not really Covid infections. I have seen no explanation of why the test was run at a cycle rate known to invalidate the test. The question remains if it was done on purpose to generate fear and support for an experimental and untested vaccine.\n\nWhen the medical establishment tells you that the vaccine is safe, they do not know that, because it is an untested vaccine being used on an emergency basis. In fact, the vaccine is being tested on the world population. The Covid shot is called a vaccine, but in reality it is technology-based and seems to function like an operating system. Normally, vaccines are made from dead or live virus. The Covid “vaccine” is not.\n\nIndeed, we have learned that the vaccine is not safe for large numbers of people, especially the young who are not endangered by the virus itself. Some countries have abandoned use of some of the vaccines because of blood clots. For example, the Danish health authority has dropped the use of the Johnson & Johnson and AstraZeneca vaccines because of their association with blood clots. https://www.globalresearch.ca/denmark-ditches-jj-covid-vaccine-says-benefits-do-not-outweigh-risk-blood-clots/5744314\n\nHealth authorities are issuing new warnings due to heart inflammation problems and Guillain-Barre autoimmune disorders. https://www.globalresearch.ca/fda-add-warning-jj-vaccine-serious-rare-autoimmune-disorder/5749999\n\nIt is important to understand that as all the vaccines are based on the same mRNA technology, they all have the same problems. The medical bureaucrats haven’t yet admitted this, but it is the fact.\n\nPublic health authorities, having rushed to give emergency usage to the vaccines, pretend that the adverse effects they are now warning about are “rare.” But these effects are not rare. We now have reports that for all but the elderly the vaccine can be more dangerous than Covid. https://www.paulcraigroberts.org/2021/07/13/17503-dead-1-7-million-injured-50-serious-reported-in-european-unions-database-of-adverse-drug-reactions-for-covid-19-shots/\n\nA new variant, Delta, has appeared, or is claimed to have appeared, that is being used to renew the fear and herd the unvaccinated into vaccination. Public authorities and presstitute shills are making much of the Delta variant despite the fact that it has not resulted to date in the serious illness and death associated with Covid. We are told that the vaccine protects against the Delta variant too, but Big Pharma is blowing the trumpet for a booster vaccine, so far not approved by Big Pharma’s public health partners at NIH, CDC, and FDA.\n\nThere are questions whether the Delta variant, if it actually exists, is a mutation, or a consequence of the vaccine itself, or just the flu, which, as you know, has disappeared, causing some to conclude that Covid is just the flu. We cannot make any headway in finding out and evaluating the real situation because public debate even among scientists is blocked. Scientists and medical professionals whose findings differ from the official narrative are censored and deplatformed.\n\nThere are reports that of the 146,000 reported cases of the Delta variant in the UK, 50 percent of those said to be infected are vaccinated people. https://www.globalresearch.ca/half-all-covid-variant-deaths-occurring-people-already-vaccinated/5749904 Reports, such as this one, which are outside the narrative remain outside and are not part of the news.\n\nNot only are there reports that the vaccine does not protect you, there are credible reports that the vaccine harms you. The British counterpart to the American VAERS, the Vaccine Adverse Event Reporting System, is the Yellow Card system operated by the Medicines and Healthcare Products Regulatory Agency (MHRA). Researchers at the Evidence-based Medicine Consultancy (EbMC) have concluded that the coronavirus (COVID-19) vaccines are “unsafe for humans” based on adverse event reports. The research group’s director, Dr. Tess Lawrie, describing the research findings wrote: “The scope of morbidity is striking, evidencing a lot of incidents and what amounts to a large number of ill.” https://www.globalresearch.ca/uk-research-group-coronavirus-vaccine-unsafe-humans-due-adverse-events/5749913\n\nMike Whitney summarizing the evidence notes that the spike protein in the “vaccine” itself is a deadly pathogen. https://www.globalresearch.ca/the-killer-in-the-bloodstream-the-spike-protein/5747572\n\nTony Fauci, Big Pharma, and the presstitutes brainwash the public that these skeptics are tinfoil hat kooks who need to be shutdown. So many distinguished independent scientists and medical research groups have been deplatformed for allegedly spreading disinformation that the charges against them are not credible. Every scientist and doctor except those associated with Big Pharma cannot be wrong.\n\nTo recap at this point: the alleged “pandemic” was created by a test that produces false positives, thus greatly exaggerating the infection rate. The deaths were created by incorrect treatment, the absence of treatment, and by counting all deaths as Covid deaths.\n\nThe fear that was intentionally hyped was used to get gullible and fearful people to accept unapproved “vaccines” that are proving to be as dangerous or more so than the Covid virus.\n\nThe dire situation cannot be corrected, because Big Pharma and its associated health authorities, hired scientists, indoctrinated medical personnel, and presstitutes will not permit any questioning of the narrative.\n\nFor example, vaccine related deaths are not being autopsied in order to keep the deaths from being identified with the vaccine and in order to prevent knowledge of how the vaccine attacks the human body. https://www.globalresearch.ca/post-covid-vaccine-deaths-not-being-autopsied-why/5749994 Indeed, the narrative, despite the VAERS and Yellow Card data, does not acknowledge vaccine-related deaths except as “very rare.” By ignoring the mounting evidence, Fauci, CDC, FDA and the media whores can maintain the fiction that the vaccines do more good than harm. Note that even if this claim were true, it is a very weak argument. It is a claim that its is OK to endanger some people as long as you save more.\n\nSuch a weak argument cannot be used to justify mandated vaccination or pressures to accept vaccination. The CNN presstitutes have their own “medical analyst,” Dr. Jonathan Reiner, on TV declaring it is time to mandate coronavirus vaccination for all Americans. https://www.globalresearch.ca/video-cnn-doctor-says-time-start-mandating-covid-vaccines/5749996\n\nThe French President Macron is instituting a program of mandated vaccination and Vaccine passports. https://www.rt.com/news/529029-france-vaccine-passports-macron/\n\nThe current occupant of the White House wants agents sent door-to-door to get all Americans vaccinated.\n\nWhy these totalitarian measures for a virus that accumulating evidence suggests might be less dangerous than the vaccine? What is going on here? How can women have rights over their own bodies and be forced to be vaccinated? Is mass vaccination followed by booster shots for endless “variants” a way to guarantee forever Big Pharma profits? Is the purpose of mandated vaccination, lockdowns, and masks to bring individual autonomy to an end? Is the purpose to set plagues among us that elites use to assume all power? Is it population control? Or is it about wiring us up as a control node on the control grid? https://www.globalresearch.ca/mrna-covid-vaccine-not-vaccine/5734464\n\nWhy these measures when the HCQ and Ivermectin cures are available and when the deaths and cases claimed for Covid were exaggerated in order to increase fear?\n\nWhy are dissenting scientists and medical professionals silenced?\n\nThe entire “pandemic” has been conducted outside the realm of evidence. That should tell you that very much is wrong with the narrative.\n\nNOW WE COME TO THE CRUX OF THE MATTER\n\nHaving comprehended the information in my article, you are aware that you have been manipulated into compliance with a secret agenda. You are now prepared to face powerful and conclusive documented evidence presented by Dr. David Martin that Covid was an intentional release, not a leak from a lab or a natural virus from bats.\n\nThis aspect of the story is the most disturbing of all. The Covid virus was created in America and patented in 2002. NIH and US Armed Services were in on the patent: https://odysee.com/@vaccines-covid-nwo:3/JgxEMA02opvp:6 At the 9-10 minute mark: “We (US) made SARS and we patented it on April 19 2002.”\n\nAll of the elements of Covid were patented in 73 patents prior to the outbreak of the alleged pandemic, that is, prior to acknowledged awareness of the virus.\n\nGo to the 29-30 minute point and listen to the quote: “We need to increase public understanding of the need for medical countermeasures such as a pan-coronavirus vaccine. A key driver is the media, and the economics will follow the hype. We need to use that hype to our advantage to get to the real issues. Investors will respond if they see profit at the end of the process.” This was said by the man whose coronavirus gain of function research was financed by Fauci at NIH.\n\nNote also that UNC, NIAID, and Moderna began making the spike protein “vaccine” prior to the outbreak of the pandemic.\n\nThe documented information in this video interview makes it clear that Covid was an intentional release serving agendas arrayed against public health and civil liberty. https://odysee.com/@vaccines-covid-nwo:3/JgxEMA02opvp:6\n\nfactcheck.org takes exception to Dr. Martin’s statements. But fact check websites are not trustworthy.\n\nWhen fact check websites claim they check facts, what they mean is that they check whether statements are in compliance with the existing narrative. If the statements contradict or take issue with the official narrative, the statements are ruled to be wrong or conspiracy theories.\n\nIn other words, the standard of whether a statement is correct is whether it complies with the existing narrative.\n\nFact checkers never check the official narrative.\n\nThis means that fact checkers are merely enforcers of the narrative.\n\nDr. Martin’s reading and presentation of the 73 patents on Covid that were taken out by US government agencies and pharmaceutical companies long in advance of the Covid outbreak (or release) could be erroneous. However, that has to be decided by public debate by independent experts and not by narrative enforcers.", "opengraph": {"image": "http://www.paulcraigroberts.org/wp-content/uploads/2015/11/pcr_168x180.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/vaers-deaths-injuries-reported-cdc-covid-vaccines-moderna-pregnant-women/?itm_term=home", "https://sputniknews.com/us/202107161083401316-pandemic-of-the-unvaccinated-cdc-chief-says-97-of-us-hospitalizations-didnt-get-covid-19-shots/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3820326/", "https://www.beckershospitalreview.com/data-analytics/florida-covid-19-fatalities-data-included-man-who-died-in-motorcycle-accident.html", "https://covid19.who.int/region/afro/country/tz", "https://www.globalresearch.ca/denmark-ditches-jj-covid-vaccine-says-benefits-do-not-outweigh-risk-blood-clots/5744314", "https://www.globalresearch.ca/fda-add-warning-jj-vaccine-serious-rare-autoimmune-disorder/5749999", "https://www.axios.com/jj-vaccine-fda-warning-guillain-barre-408bb913-1d78-4096-acdc-7114186c0d75.html?utm_source=newsletter&utm_medium=email&utm_campaign=newsletter_axiosvitals&stream=top", "https://www.globalresearch.ca/halt-covid-vaccine-prominent-scientist-tells-cdc/5744828", "https://www.paulcraigroberts.org/2021/07/13/17503-dead-1-7-million-injured-50-serious-reported-in-european-unions-database-of-adverse-drug-reactions-for-covid-19-shots/", "https://www.globalresearch.ca/worst-side-effect-ever-heart-inflammation-happening-world-due-blood-clotting-caused-covid-19-vaccines/5749988", "https://www.globalresearch.ca/half-all-covid-variant-deaths-occurring-people-already-vaccinated/5749904", "https://www.wakingtimes.com/research-group-warns-adverse-event-reports-indicate-covid-vaccine-unsafe-for-use-in-humans/", "https://www.globalresearch.ca/uk-research-group-coronavirus-vaccine-unsafe-humans-due-adverse-events/5749913", "https://www.globalresearch.ca/the-killer-in-the-bloodstream-the-spike-protein/5747572", "https://www.globalresearch.ca/post-covid-vaccine-deaths-not-being-autopsied-why/5749994", "https://www.globalresearch.ca/video-cnn-doctor-says-time-start-mandating-covid-vaccines/5749996", "https://www.rt.com/news/529029-france-vaccine-passports-macron/", "https://www.globalresearch.ca/mrna-covid-vaccine-not-vaccine/5734464", "https://odysee.com/@vaccines-covid-nwo:3/JgxEMA02opvp:6", "https://odysee.com/@vaccines-covid-nwo:3/JgxEMA02opvp:6", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.paulcraigroberts.org%2F2021%2F07%2F15%2Fhow-the-covid-pandemic-was-orchestrated%2F&title=How%20the%20Covid%20%E2%80%9CPandemic%E2%80%9D%20Was%20Orchestrated", "http://reddit.com/submit?url=https%3A%2F%2Fwww.paulcraigroberts.org%2F2021%2F07%2F15%2Fhow-the-covid-pandemic-was-orchestrated%2F&title=How%20the%20Covid%20%E2%80%9CPandemic%E2%80%9D%20Was%20Orchestrated", "https://www.paulcraigroberts.org/2021/07/15/how-the-covid-pandemic-was-orchestrated/", "https://www.paulcraigroberts.org/2023/04/24/no-more-truth-from-fox-news/", "https://www.paulcraigroberts.org/2023/04/24/no-more-truth-from-fox-news/", "https://www.paulcraigroberts.org/2023/04/24/the-western-world-has-forsaken-all-of-its-former-values/", "https://www.paulcraigroberts.org/2023/04/24/the-western-world-has-forsaken-all-of-its-former-values/", "https://www.paulcraigroberts.org/2023/04/23/the-death-of-law-based-justice/", "https://www.paulcraigroberts.org/2023/04/23/the-death-of-law-based-justice/", "https://www.paulcraigroberts.org/2023/04/18/thanks-to-washingtons-abuse-of-the-reserve-currency-role-the-dollar-is-on-its-way-out/", "https://www.paulcraigroberts.org/2023/04/18/thanks-to-washingtons-abuse-of-the-reserve-currency-role-the-dollar-is-on-its-way-out/", "https://www.paulcraigroberts.org/2023/04/18/my-ignored-warnings-of-american-de-industrialization/", "https://www.paulcraigroberts.org/2023/04/18/my-ignored-warnings-of-american-de-industrialization/", "https://www.paulcraigroberts.org/2023/04/20/the-empire-of-lies-2/", "https://www.paulcraigroberts.org/2023/04/20/the-empire-of-lies-2/", "https://www.paulcraigroberts.org/2023/04/17/some-comments-on-the-inanities-of-our-time/", "https://www.paulcraigroberts.org/2023/04/17/some-comments-on-the-inanities-of-our-time/", "https://www.paulcraigroberts.org/2023/04/17/what-former-new-york-prosecutors-say-about-braggs-fake-case-against-trump/", "https://www.paulcraigroberts.org/2023/04/17/what-former-new-york-prosecutors-say-about-braggs-fake-case-against-trump/", "https://www.paulcraigroberts.org/2023/04/13/slavery-in-america-was-resurrected-in-1913/", "https://www.paulcraigroberts.org/2023/04/13/slavery-in-america-was-resurrected-in-1913/", "https://www.paulcraigroberts.org/2023/04/10/trump-is-americas-last-hope/", "https://www.paulcraigroberts.org/2023/04/10/trump-is-americas-last-hope/", "https://www.paulcraigroberts.org/2023/04/10/steve-kirsch-is-an-american-hero/", "https://www.paulcraigroberts.org/2023/04/10/steve-kirsch-is-an-american-hero/", "https://www.paulcraigroberts.org/2023/04/11/the-curse-of-rousseau/", "https://www.paulcraigroberts.org/2023/04/11/the-curse-of-rousseau/", "https://www.paulcraigroberts.org/2023/04/04/what-trumps-indictment-means/", "https://www.paulcraigroberts.org/2023/04/04/what-trumps-indictment-means/", "https://www.paulcraigroberts.org/2023/04/03/the-death-of-free-speech-truth-and-the-rule-of-law/", "https://www.paulcraigroberts.org/2023/04/03/the-death-of-free-speech-truth-and-the-rule-of-law/", "https://www.paulcraigroberts.org/2023/04/03/the-republican-party-has-reached-the-point-where-it-has-to-fight-for-trump-or-be-deserted-by-voters/", "https://www.paulcraigroberts.org/2023/04/03/the-republican-party-has-reached-the-point-where-it-has-to-fight-for-trump-or-be-deserted-by-voters/", "https://www.paulcraigroberts.org/2023/04/03/elon-musk-on-the-new-york-times-this-is-priceless/", "https://www.paulcraigroberts.org/2023/04/03/elon-musk-on-the-new-york-times-this-is-priceless/", "https://www.paulcraigroberts.org/2023/04/12/historical-lies-used-to-demonize-a-classic-historical-novel/", "https://www.paulcraigroberts.org/2023/04/12/historical-lies-used-to-demonize-a-classic-historical-novel/", "https://www.paulcraigroberts.org/2023/04/02/so-far-the-republican-partys-response-to-the-indictment-of-president-trump-is-to-use-the-event-for-fundraising/", "https://www.paulcraigroberts.org/2023/04/02/so-far-the-republican-partys-response-to-the-indictment-of-president-trump-is-to-use-the-event-for-fundraising/", "https://www.paulcraigroberts.org/2023/04/02/showpiece-of-democrats-insurrection-show-trials-suddenly-released-from-prison/", "https://www.paulcraigroberts.org/2023/04/02/showpiece-of-democrats-insurrection-show-trials-suddenly-released-from-prison/", "https://www.paulcraigroberts.org/2023/03/31/black-quota-hire-falsely-indicts-president-trump/", "https://www.paulcraigroberts.org/2023/03/31/black-quota-hire-falsely-indicts-president-trump/", "https://www.paulcraigroberts.org/2023/03/30/does-america-have-a-future-3/", "https://www.paulcraigroberts.org/2023/03/30/does-america-have-a-future-3/", "https://www.paulcraigroberts.org/2023/03/29/us-media-complicit-in-two-mass-murders-covid-vax-and-fentanyl/", "https://www.paulcraigroberts.org/2023/03/29/us-media-complicit-in-two-mass-murders-covid-vax-and-fentanyl/", "https://www.paulcraigroberts.org/2023/04/06/the-destruction-of-the-american-male/", "https://www.paulcraigroberts.org/2023/04/06/the-destruction-of-the-american-male/", "https://www.paulcraigroberts.org/2023/03/29/why-the-dollar-based-international-system-is-breaking-up/", "https://www.paulcraigroberts.org/2023/03/29/why-the-dollar-based-international-system-is-breaking-up/", "https://www.paulcraigroberts.org/2023/03/27/for-decades-i-have-explained-that-watergate-was-a-cia-scheme-to-remove-president-nixon-from-office/", "https://www.paulcraigroberts.org/2023/03/27/for-decades-i-have-explained-that-watergate-was-a-cia-scheme-to-remove-president-nixon-from-office/", "https://www.paulcraigroberts.org/2023/03/28/the-quota-hire-pretending-to-be-a-secretary-of-defense-is-terminating-the-us-army/", "https://www.paulcraigroberts.org/2023/03/28/the-quota-hire-pretending-to-be-a-secretary-of-defense-is-terminating-the-us-army/", "https://www.paulcraigroberts.org/2023/03/26/the-erosion-of-equality-under-law-continues/", "https://www.paulcraigroberts.org/2023/03/26/the-erosion-of-equality-under-law-continues/", "https://www.paulcraigroberts.org/2023/03/22/incompetent-federal-reserve-goofs-again/", "https://www.paulcraigroberts.org/2023/03/22/incompetent-federal-reserve-goofs-again/", "https://www.paulcraigroberts.org/2023/03/21/the-chinese-document-us-hegemony-and-its-perils-february-20-2023/", "https://www.paulcraigroberts.org/2023/03/21/the-chinese-document-us-hegemony-and-its-perils-february-20-2023/", "https://www.paulcraigroberts.org/2023/03/20/the-rise-of-tyranny-in-the-united-states/", "https://www.paulcraigroberts.org/2023/03/20/the-rise-of-tyranny-in-the-united-states/", "https://www.paulcraigroberts.org/2023/03/19/the-us-has-the-world-setup-for-a-worse-financial-crisis-than-in-2008/", "https://www.paulcraigroberts.org/2023/03/19/the-us-has-the-world-setup-for-a-worse-financial-crisis-than-in-2008/", "https://www.paulcraigroberts.org/2023/03/16/does-putin-want-nuclear-war/", "https://www.paulcraigroberts.org/2023/03/16/does-putin-want-nuclear-war/", "https://www.paulcraigroberts.org/2023/03/14/the-cover-up-begins/", "https://www.paulcraigroberts.org/2023/03/14/the-cover-up-begins/", "https://www.paulcraigroberts.org/2023/03/14/the-christian-hating-jew-zelensky-a-sexual-pervert-who-biden-is-supporting-with-christian-money-is-evicting-christian-monks-as-a-spiritual-cleansing-of-ukraine/", "https://www.paulcraigroberts.org/2023/03/14/the-christian-hating-jew-zelensky-a-sexual-pervert-who-biden-is-supporting-with-christian-money-is-evicting-christian-monks-as-a-spiritual-cleansing-of-ukraine/", "https://www.paulcraigroberts.org/2023/03/14/it-seems-putin-is-unwilling-or-lacks-the-force-to-quickly-end-the-conflict-before-the-west-can-arm-and-train-the-ukrainians-with-more-powerful-weapons/", "https://www.paulcraigroberts.org/2023/03/14/it-seems-putin-is-unwilling-or-lacks-the-force-to-quickly-end-the-conflict-before-the-west-can-arm-and-train-the-ukrainians-with-more-powerful-weapons/", "https://www.paulcraigroberts.org/2023/03/13/banking-troubles-on-the-horizon/", "https://www.paulcraigroberts.org/2023/03/13/banking-troubles-on-the-horizon/", "https://www.paulcraigroberts.org/2023/03/15/are-jews-responsible-for-the-destruction-of-western-civilization-as-tobias-langdon-claims-or-is-the-cause-self-destruction-resulting-from-white-liberal-attacks-on-white-confidence/", "https://www.paulcraigroberts.org/2023/03/15/are-jews-responsible-for-the-destruction-of-western-civilization-as-tobias-langdon-claims-or-is-the-cause-self-destruction-resulting-from-white-liberal-attacks-on-white-confidence/", "https://www.paulcraigroberts.org/2023/03/10/former-cdc-director-robert-redfield-told-congress-that-there-is-no-doubt-that-fauci-at-nih-funded-gain-of-function-research-that-made-possible-the-covid-pandemic/", "https://www.paulcraigroberts.org/2023/03/10/former-cdc-director-robert-redfield-told-congress-that-there-is-no-doubt-that-fauci-at-nih-funded-gain-of-function-research-that-made-possible-the-covid-pandemic/", "https://www.paulcraigroberts.org/2023/03/12/what-is-going-on-in-the-federal-reserves-head/", "https://www.paulcraigroberts.org/2023/03/12/what-is-going-on-in-the-federal-reserves-head/", "https://www.paulcraigroberts.org/2023/03/12/what-is-going-on-inside-the-kremlins-head/", "https://www.paulcraigroberts.org/2023/03/12/what-is-going-on-inside-the-kremlins-head/", "https://www.paulcraigroberts.org/2023/03/08/tucker-carlson-exposes-the-january-6-insurrection-hoax-and-is-denounced-by-leaders-of-the-republican-party-and-of-course-the-whore-media/", "https://www.paulcraigroberts.org/2023/03/08/tucker-carlson-exposes-the-january-6-insurrection-hoax-and-is-denounced-by-leaders-of-the-republican-party-and-of-course-the-whore-media/", "https://www.paulcraigroberts.org/2023/03/06/does-the-kremlin-desire-the-conflict-in-ukraine-to-spin-out-of-control/", "https://www.paulcraigroberts.org/2023/03/06/does-the-kremlin-desire-the-conflict-in-ukraine-to-spin-out-of-control/", "https://www.paulcraigroberts.org/2023/03/05/the-kremlin-still-has-not-committed-the-russian-army-to-the-ukrainian-conflict/", "https://www.paulcraigroberts.org/2023/03/05/the-kremlin-still-has-not-committed-the-russian-army-to-the-ukrainian-conflict/", "https://www.paulcraigroberts.org/2023/03/05/as-truth-declines-so-do-we-all/", "https://www.paulcraigroberts.org/2023/03/05/as-truth-declines-so-do-we-all/", "https://www.paulcraigroberts.org/2023/03/09/the-replacement-of-white-people-continues-with-remake-of-peter-pan/", "https://www.paulcraigroberts.org/2023/03/09/the-replacement-of-white-people-continues-with-remake-of-peter-pan/", "https://www.paulcraigroberts.org/2023/03/07/the-safe-and-effective-mrna-vaccines-caused-more-covid-cases-and-more-deaths-than-the-virus-itself/", "https://www.paulcraigroberts.org/2023/03/07/the-safe-and-effective-mrna-vaccines-caused-more-covid-cases-and-more-deaths-than-the-virus-itself/", "https://www.paulcraigroberts.org/2023/02/27/putin-went-to-war-but-refuses-to-fight/", "https://www.paulcraigroberts.org/2023/02/27/putin-went-to-war-but-refuses-to-fight/", "https://www.paulcraigroberts.org/2023/02/26/has-russia-given-up-on-resisting-domination-by-the-west/", "https://www.paulcraigroberts.org/2023/02/26/has-russia-given-up-on-resisting-domination-by-the-west/", "https://www.paulcraigroberts.org/2023/02/26/what-do-americans-get-from-their-government/", "https://www.paulcraigroberts.org/2023/02/26/what-do-americans-get-from-their-government/", "https://www.paulcraigroberts.org/2023/02/24/can-china-be-suckered-like-putin/", "https://www.paulcraigroberts.org/2023/02/24/can-china-be-suckered-like-putin/"], "authors": [], "publish_date": null}