{"result_id": "240006", "URL": "https://www.peta.org/media/news-releases/peta-statement-ncsu-and-uncs-nasal-spray-for-potentially-treating-covid-19/", "timestamp": "2023-04-25 16:48:07 CEST+0200", "meta": {"description": "Please see the following statement from PETA Vice President Shalin Gala regarding animal testing conducted by North Carolina State University and the", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/media/news-releases/peta-statement-ncsu-and-uncs-nasal-spray-for-potentially-treating-covid-19/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "Statement: NCSU and UNC’s Nasal Spray for Potentially Treating COVID-19", "cleaned_text": "Raleigh, N.C. – Please see the following statement from PETA Vice President Shalin Gala regarding animal testing conducted by North Carolina State University and the University of North Carolina–Chapel Hill in attempts to develop a human nasal spray to treat COVID-19:\n\nSpraying “fake cells” up the noses of terrified mice and monkeys trapped in laboratories in attempts to make a human COVID-19 therapeutic is about as smart as putting a screen door on a submarine. Even experimenter Ke Cheng, who conducted these tests, admits that he “wouldn’t say [he is] 100% confident” about the way the therapy will fare in human trials. Here’s an inconvenient fact: The National Institutes of Health says that 95% of all new drugs that are shown to be safe and effective in animal tests fail in human trials. If we are serious about effectively and swiftly combatting COVID-19, we need to modernize the stale and inefficient drug-development process by shifting from relying on animal tests to prioritizing human-relevant, non-animal testing strategies. Moderna, Pfizer, and BioNTech didn’t wait for lengthy and unreliable tests on monkeys and mice before initiating human clinical trials on their vaccines, proving that animal tests aren’t needed to develop safe and effective drugs.\n\nIt’s time to shift the focus away from yesterday’s science and to embrace the new model that these COVID-19 vaccine makers have pioneered—and to take it a step further by replacing animal tests with more reliable and human-relevant animal-free ones. For the sake of human health, it’s time for the U.S. Food and Drug Administration to replace its lengthy, animal-intensive drug-development process with one that emphasizes human-relevant science. (Click for PETA’s 2021 Research Modernization Deal.)\n\nHere are 7 Things You Need to Know About Experiments on Animals and COVID-19.", "opengraph": {"article:published_time": "2021-06-28", "locale": "en_US", "type": "article", "title": "PETA Statement: NCSU and UNC’s Nasal Spray for Potentially Treating COVID-19 | PETA", "description": "Please see the following statement from PETA Vice President Shalin Gala regarding animal testing conducted by North Carolina State University and the", "url": "https://www.peta.org/media/news-releases/peta-statement-ncsu-and-uncs-nasal-spray-for-potentially-treating-covid-19/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "image": "https://www.peta.org/wp-content/uploads/2015/04/peta-facebook-placeholder-new.jpg", "image:width": "1600", "image:height": "1006", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.peta.org/blog/coronavirus-vaccine-nih-skips-tests-on-animals/", "https://www.peta.org/wp-content/uploads/2020/12/The_Research_Modernization_Deal_Report_8.5x11_US_2021_web.pdf", "https://www.peta.org/wp-content/uploads/2020/12/The_Research_Modernization_Deal_Report_8.5x11_US_2021_web.pdf", "https://headlines.peta.org/end-experiments-on-animals-for-covid-19/"], "authors": [], "publish_date": "2021-06-28"}