{"result_id": "240024", "URL": "https://prime.peta.org/news/a-compassionate-guide-to-covid-19-vaccinations/", "timestamp": "2023-04-25 16:48:29 CEST+0200", "meta": {"description": "PETA answers important questions about the COVID-19 vaccine and explains how we can avoid future pandemics by going vegan.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://prime.peta.org/news/a-compassionate-guide-to-covid-19-vaccinations/", "encoding": "utf-8"}, "image": null, "domain": "prime.peta.org", "title": "A Compassionate Guide to COVID-19 Vaccinations", "cleaned_text": "COVID-19 vaccinations are rolling out across the nation. Naturally, with any new medication, consumers might have questions about the vaccine’s origin and ingredients. While all personal health queries should be directed to your own medical professional, here is a general guide to the COVID-19 vaccine and its relationship to animals.\n\nIs the COVID-19 vaccine (and are other vaccines) tested on animals?\n\nLegally, companies that make all medicines, including vaccines, are required by government agencies to conduct certain tests before they can sell their products. Some of these tests are performed on animals.\n\nPETA entities are working with governments around the world to change these requirements and promote superior testing methods that don’t require animal suffering. These models include in vitro human cell and tissue testing, advanced computer-modeling studies, and human volunteers.\n\nOne promising aspect of the COVID-19 vaccine development was the quick implementation of human trials, which—for the first time ever—overlapped with animal experiments rather than being done sequentially. This may not seem like much, but it was a sea change for the U.S. Food and Drug Administration (FDA), because it acknowledged that the agency understood that vaccine clinical trials in humans could begin safely without first requiring years of animal tests. We’re getting ever closer to a future in which superior, animal-free testing is the norm and no animals have to suffer for regulatory requirements.\n\nCan I get a COVID-19 vaccine if I’m vegan?\n\nLet’s first think about the reasons why we went vegan: to minimize cruelty and to create a kinder world for animals. While science is changing, we still live in a world in which tests on animals are a legal requirement for many medicines and animal-friendly substitutes aren’t available.\n\nIf we were to refuse medical treatment for ethical reasons, it could lead to a decline in our health—and our ability to speak up for animals in the future might be limited.\n\nUnfortunately, it’s too late for us to help the animals who were subjected to painful experiments for the COVID-19 vaccine. However, we can use our voices and take actions to spare other animals this fate.\n\nPlease follow the advice of your health-care provider when it comes to taking any new medication.\n\nDo the COVID-19 vaccines contain animal-derived ingredients?\n\nIngredient lists supplied by the FDA indicate that the vaccines made by Pfizer/BioNTech and Moderna do not contain any animal-derived ingredients, as best as we can tell. It’s possible that future COVID-19 vaccines will contain animal-derived ingredients. Substances such as shark squalene—an oil derived from the livers of sharks—can be added to a vaccine to stimulate an immune response, but vaccine makers are increasingly using more modern, animal-free ingredients.\n\nSeveral other vaccines are still in development. We may not know whether a future vaccine contains animal-derived ingredients until it’s approved for use, and at that point, it may be possible to opt for an animal-free vaccine on ethical grounds. As with any medical decision, this option should first be discussed with your doctor.\n\nIs there a link between COVID-19 and eating meat?\n\nYes. When animals are intensively confined to cramped cages, filthy sheds, packed trucks, or blood-spattered killing floors, diseases can mutate and spread. The Centers for Disease Control and Prevention has calculated that 75% of all new or emerging infectious diseases have animal origins.\n\nWe can help prevent future dangerous diseases from emerging and spreading by choosing food, clothing, and other products that don’t harm any animals. It’s easier than ever to follow a compassionate vegan lifestyle, which also reduces our risk of suffering from many health conditions and helps the environment!\n\nFor more information and several ways to add your voice to our push for ethical medicine, please visit PETA’s action alert page.", "opengraph": {"locale": "en_US", "type": "article", "title": "PETA Prime: A Compassionate Guide to COVID-19 Vaccinations", "description": "PETA answers important questions about the COVID-19 vaccine and explains how we can avoid future pandemics by going vegan.", "url": "https://prime.peta.org/news/a-compassionate-guide-to-covid-19-vaccinations/", "site_name": "PETA Prime", "article:published_time": "2021-03-09T19:55:27+00:00", "article:modified_time": "2022-02-11T22:17:44+00:00", "image": "https://prime.peta.org/wp-content/uploads/2021/03/031921-COVID-Vaccine-Featured.jpg", "image:width": "900", "image:height": "430", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/animal-testing-depth/", "https://www.peta.org/blog/covid-19-vaccine-fda-animal-testing/", "https://www.peta.org/blog/5-perfect-reasons-go-vegan/", "https://www.fda.gov/media/144638/download", "https://www.peta.org/blog/links-between-meat-and-coronavirus-facts-myths/", "https://www.peta.org/category/main-issues/animal-experimentation/?post_type=alert&en_txn7=blog::030921-Prime-Blog-Experiments-AA-Page"], "authors": ["PETA"], "publish_date": "2021-03-09T19:55:27+00:00"}