{"result_id": "240028", "URL": "https://www.peta.org/blog/coronavirus-vaccine-nih-skips-tests-on-animals/", "timestamp": "2023-04-25 16:48:33 CEST+0200", "meta": {"description": "The first human trial of a vaccine that could protect against COVID-19 has begun—without lengthy tests on animals being done first.", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/blog/coronavirus-vaccine-nih-skips-tests-on-animals/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "Coronavirus Vaccine: NIH Goes Straight to Human Trials", "cleaned_text": "Here at PETA, we’ve been saying for years that experiments on animals are pointless—they slow down the search for treatments and cures for human disease. Moreover, all the poisoning, shocking, burning, and killing is unethical and cruel. Many other scientists and experts agree. But when it comes to a new coronavirus vaccine, the National Institutes of Health (NIH) is finally heeding PETA’s call—according to BBC News, the agency isn’t waiting for the typical, lengthy animal-testing phase and is instead heading straight for human trials. While this won’t stop all tests on animals for the vaccine, it should pave the way for safe straight-to-human vaccine trials from now on.\n\nIn Seattle, 45 healthy, willing volunteers have reportedly agreed to partake in the first human trial of a vaccine, funded by NIH, that could protect against COVID-19, the novel, SARS-like coronavirus (which has apparently been traced back to live animals who were closely confined, shipped, killed, and eaten) that has much of the world in a fearful frenzy.\n\nRats, mice, and other animals can’t be willing participants in experiments.\n\nUnlike humans, animals can’t agree to being experimented on. And if they could, they likely wouldn’t consent to being mutilated, poisoned, infected with painful and deadly diseases, burned, electrocuted, shot, addicted to drugs, or psychologically tortured and eventually killed.\n\nRefusing to condemn animals to a life of pain, loneliness, and terror shouldn’t be reserved for urgent public health priorities—it should be standard practice.\n\nWe work globally to expose and end the use of animals in experiments. This includes working to phase out animal tests at the U.S. Environmental Protection Agency, collaborating with members of Congress to stop cruel studies, and persuading major corporations, other government agencies, and universities to abandon animal tests in favor of modern, non-animal methods. With the help of our members and supporters, we’re leading the way to the future—one that doesn’t include cruel, archaic tests on animals.\n\nWe do this partly because experiments on animals aren’t just cruel and expensive—they’re also overwhelmingly inapplicable to humans.\n\nNIH itself reports that 95 out of every 100 drugs that pass animal tests fail in humans. Experiments on animals divert time and funding from better, non-animal methods. And experts know it. Regardless of the lack of tests on animals, Moderna Therapeutics—the company behind the new coronavirus vaccine—reportedly says that “the vaccine has been made using a tried and tested process.”\n\nAll vaccines, drugs, treatments, and products should be “made using a tried and tested process” that doesn’t include nonconsenting animals. Click on the link below if you’re with us—urge NIH and the National Institute on Aging not to squander taxpayer dollars on cruel and worthless experiments on marmosets:", "opengraph": {"article:published_time": "2020-03-16T22:54:39+00:00", "locale": "en_US", "type": "article", "title": "Coronavirus Vaccine: NIH Goes Straight to Human Trials | PETA", "description": "The first human trial of a vaccine that could protect against COVID-19 has begun—without lengthy tests on animals being done first.", "url": "https://www.peta.org/blog/coronavirus-vaccine-nih-skips-tests-on-animals/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2020-09-10T19:05:51+00:00", "image": "https://www.peta.org/wp-content/uploads/2019/09/iStock-1052049312-rat-Caymia-1.jpg", "image:width": "1196", "image:height": "600", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">45 healthy volunteers set to take part in first human trial of potential coronavirus vaccine <a href=\"https://t.co/J4oFLDOBLJ\">https://t.co/J4oFLDOBLJ</a></p>\n<p>— BBC News (World) (@BBCWorld) <a href=\"https://twitter.com/BBCWorld/status/1239578154999656448?ref_src=twsrc%5Etfw\">March 16, 2020</a></p></blockquote>\n"], "movies": [], "links": ["https://www.peta.org/issues/animals-used-for-experimentation/", "https://headlines.peta.org/research-modernization-new-deal/", "https://www.peta.org/blog/top-five-reasons-stop-animal-testing/", "https://www.livescience.com/46147-animal-data-unreliable-for-humans.html", "https://www.bbc.com/news/health-51906604", "https://t.co/J4oFLDOBLJ", "https://twitter.com/BBCWorld/status/1239578154999656448?ref_src=twsrc%5Etfw", "https://www.peta.org/blog/coronavirus-go-vegan-now/", "https://www.peta.org/category/main-issues/animal-experimentation/?post_type=victory", "https://www.peta.org/about-peta/victories/epa-end-reliance-animal-tests/", "https://www.peta.org/blog/coast-guard-commandant-congress-ending-animal-use-right-thing/", "https://www.peta.org/features/peta-ends-near-drowning-tests-small-animals/", "https://www.peta.org/blog/nih-ends-baby-monkey-experiments/", "https://www.peta.org/features/uw-madison-cruelty/", "https://www.peta.org/issues/animals-used-for-experimentation/alternatives-animal-testing/", "https://www.peta.org/blog/experiments-on-animals-fail-90-of-the-time-why-are-they-still-done/", "https://support.peta.org/page/10553/action/1"], "authors": ["Katherine Sullivan"], "publish_date": "2020-03-16T22:54:39+00:00"}