{"result_id": "240037", "URL": "https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/food-drug-administration/", "timestamp": "2023-04-25 16:48:45 CEST+0200", "meta": {"description": "The U.S. Food and Drug Administration (FDA) is responsible for ensuring the safety of pharmaceuticals, biologicals, and medical devices.", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/food-drug-administration/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "U.S. Food and Drug Administration (FDA)", "cleaned_text": "The U.S. Food and Drug Administration (FDA) is responsible for ensuring the safety, effectiveness, and quality of pharmaceuticals, biologicals, and medical devices intended for human use as well as the safety of food, cosmetics, and radiation-emitting products. In addition, this agency is responsible for the safety, efficacy, and quality of pharmaceuticals and feed intended for animal use. As of 2009, this agency is also responsible for regulating the sale of tobacco products.\n\nThe FDA’s Center for Food Safety and Applied Nutrition (CFSAN) regulates food and food additives sold in the United States. CFSAN’s Redbook 2000 is a manual of test methods that the agency expects will be performed for novel food additives or ingredients. These tests include the use of many animals and multiple species; some typically involve dogs (or puppies) and, in some cases, last one year.\n\nCFSAN also requires the monitoring of shellfish for algal toxins that accumulate in their flesh and can cause health problems in humans. For decades, this monitoring meant injecting liquefied shellfish into the abdominal cavities of mice—an excruciating process that causes convulsions, severe pain, paralysis, and, ultimately, death when a shellfish is contaminated.\n\nPETA U.S. and PETA U.K. have worked closely with both the European Commission and the FDA to replace this test for all types of shellfish hazards.\n\nThe marketing of drugs and other pharmaceutical products in the U.S. is controlled by the Federal Food, Drug, and Cosmetic Act (FFDCA), which empowers the FDA’s Center for Drug Evaluation and Research to require extensive toxicity testing on animals before a new drug is deemed “safe” for marketing.\n\nIn order to satisfy FDA data requirements, thousands of rats, mice, rabbits, dogs, and primates are killed in “preclinical” laboratory poisoning experiments to assess the safety of new drugs (including all ingredients and even minor differences in formulation). Commonly required animal tests include the following:\n\nFollowing this extensive battery of animal testing, drugs generally undergo three phases of clinical trials before they are considered for widespread human use. The fact that months or years of human studies are required over and above the standard battery of animal tests suggests that health authorities do not trust the results of animal experiments—and for good reason. A significant number of drugs are rejected during human clinical trials because they are found to cause toxic and other adverse health effects “not predicted” in preclinical animal experiments.\n\nIn fact, the National Institutes of Health reports [1] that 95 out of every 100 drugs that successfully pass animal trials and go into human clinical testing fail during the human clinical trial phase.\n\nThe problem is that species differences are so vast that animal results are, at best, a very poor approximation of what will happen in humans or, at worst, dangerously misleading. The alternative is to advance science to the point where preclinical tests are based on human biology, which will better predict what will happen to real human volunteers or patients in the clinical trials.\n\nToday, cutting-edge technologies, such as the Hurel biochip, which features microfluidic circuits lined with cells from various human organs, can allow us to better predict complex human reactions.\n\n[1] National Center for Advancing Translational Sciences, “About New Therapeutic Uses,” https://ncats.nih.gov/ntu/about (accessed May 29, 2017).\n\nThe marketing of tobacco products in the U.S. is controlled by the FFDCA as amended by the Family Smoking Prevention and Tobacco Control Act (FSPTCA), which is administered by FDA’s Center for Tobacco Products (CTP). In contrast to other products that the FDA regulates, tobacco products are inherently unsafe. Nevertheless, the FSPTCA makes the FDA responsible for ensuring that any new tobacco product entering the market is “appropriate for the protection of the public health.” This is possible if a new product reduces risk for tobacco users without increasing risk for non-users (for example, by encouraging non-users to initiate tobacco use). While the FSPTCA names only cigarettes, smokeless tobacco, and roll-your-own tobacco, it also gives the FDA authority to deem other tobacco products subject to the Act. As of August 8, 2016, any product meeting the statutory definition of a tobacco product is subject to the Act, including hookah, e-cigarettes, dissolvables, cigars, and pipe tobacco, as well as future tobacco products.\n\nIn its guidance to industry on submitting marketing applications for new tobacco products, FDA includes in vivo (animal) tests among the types of tests that might be used when comparing risk between products. As a result, PETA is concerned that animal testing of tobacco products will increase. Because e-cigarettes and other electronic nicotine delivery systems (ENDS) are new products that may present a reduced health risk to users compared to conventional cigarettes, PETA is especially concerned that animal tests will be conducted in support of marketing applications for these products.\n\nPETA has submitted public comments on the FDA’s regulation of tobacco products, including its deeming rule and guidance to industry on both modified risk tobacco product applications and premarket applications for ENDS. PETA has also met directly with CTP to urge the agency to accept only data from nonanimal tests. In its final deeming rule, the FDA addressed each of PETA’s recommendations, such as setting product standards to reduce the need for new testing. In its recent draft guidance on premarket applications for ENDS products, the FDA now encourages applicants to meet with CTP early in the development process to discuss the suitability of nonanimal tests and provides clear guidance on literature reviews, computational modeling and certain in vitro tests. These important first steps will reduce the number of animals used to test tobacco products. PETA will continue to participate in the regulatory process until no animals are used.\n\nPETA and the PETA International Science Consortium also work with industry and academia to promote the development and acceptance of nonanimal methods. For example, human lung tissue, either donated or reconstructed from cultured cells, can be exposed to cigarette smoke or e-cigarette vapor directly. Such methods are more relevant to how people actually use tobacco products than forcing rats or dogs to inhale these substances before killing and dissecting them. In 2015, a PETA researcher coauthored a review of recent publications describing the use of nonanimal methods to study tobacco products, and PETA has also participated in workshops organized by the Institute for In Vitro Sciences to promote these methods.\n\nThe FSPTCA does not specifically require animal tests, so it is within the FDA’s authority to require that only nonanimal methods be used to support new products. Internationally, Belgium, Estonia, Germany, Slovakia, and the United Kingdom have all banned testing tobacco products using animals demonstrating that this is an achievable goal.\n\n“Biologicals” are medicinal products, such as vaccines, hormones, antibodies, and blood products, that are derived from living organisms. In the U.S., biologicals are regulated by the FDA’s Center for Biologics Evaluation and Research. Because of their origin, biologicals must undergo extensive quality control during production.\n\nVaccine testing in particular consumes an estimated 2.5 million animals every year because vaccines are often produced by weakening, inactivating, or detoxifying a virulent microorganism or toxin. Each batch of the finished product is then tested on animals, causing them pain, suffering, and death.\n\nSafety testing is carried out to try to make sure that a safe immune response is observed and that people who are inoculated with the vaccine are not infected by the pathogen. A common study is the “abnormal toxicity test,” in which guinea pigs and mice are injected with a biological product and observed for one week. The test may be repeated multiple times for the same product until all of the following criteria are met:\n• All the animals survive the observation period.\n• None of the animals show any weight loss at the end of the observation period.\n• None of the animals show toxic signs.\n\nNumerous other disease-specific animal safety tests have also been developed, such as the “mouse weight-gain test,” which is used for the whole-cell pertussis vaccine. In this test, mice injected with the vaccine are observed for weight gain and to see whether they are alive or dead after 72 hours and again after one week.\n\nAnother test, for the oral polio vaccine, called the “neurovirulence test,” is also devastating to animals. In this test, rhesus or cynomolgus monkeys receive an injection of the vaccine in their spines, are observed for up to three weeks for signs of paralysis, and are then killed and examined.\n\n“Potency testing” is carried out to determine the effectiveness of inactivated (nonliving) vaccines in protecting the recipient against bacterial or viral infections. These studies use “challenge” tests, in which large numbers of animals—usually mice, rats, guinea pigs, rabbits, and/or chickens—are inoculated with a vaccine and then “challenged” through purposeful infection with the disease that the vaccine is designed to protect against.\n\nTo test the potency of a single batch of rabies vaccine, for example, live rabies virus is injected through the skulls and directly into the brains of 160 mice. Some of these mice are given the protective vaccine first, but some are not. These cranial injections are extremely painful and completely irrelevant to the normal route of infection. Approximately half of the animals develop and/or die of rabies, a painful neurological disease involving tremors, loss of control over one’s body, the inability to swallow, and severe weight loss. Analytical methods have been developed by rabies vaccine manufacturers, but they are not yet validated or accepted for regulatory use. Until validation, countless animals will continue to die painful deaths in accordance with FDA and USDA guidance.\n\nThe FDA’s Center for Devices and Radiological Health is responsible for the licensing of medical devices, which include an extremely broad range of products, such as cardiac pacemakers, stents, insulin pumps, and surgical devices.\n\nA great deal of animal testing for these products relates to the safety of the materials in the medical devices: the plastic polymers, the metals, and the ceramics. These materials are implanted into an animal’s tissues, or chemicals leached from these products are injected into their tissues to observe the toxicity to animals. Researchers are generally looking for toxicity to cells and allergic potential, as well as applying the acute and chronic toxicity tests described above (in the “Drugs” section). These “biocompatibility tests” (click here for more information) are often conducted on mice, rats, and rabbits. Similar to what is done with biologics, each batch of a medical device is also tested for quality control using animals.\n\nTesting the effectiveness of medical devices is often difficult because these devices are specifically designed for human anatomy and physiology. Pigs, sheep, and dogs are the most commonly used species for efficacy testing of these devices, even though the structure of the animals’ bodies is often too dissimilar to be of use.\n\nPhysicians and medical device sales specialists also use animals (primarily dogs and pigs) during training exercises in which the animals are often implanted with the device and later killed.\n\nAlternatives include human cadavers, bench-top simulators of various human organs, cell-based tests, and computer programs that can simulate, for example, the effect of a particular heart rhythm as encoded into a pacemaker.", "opengraph": {"article:published_time": "2010-06-23", "locale": "en_US", "type": "article", "title": "U.S. Food and Drug Administration (FDA) | PETA", "description": "The U.S. Food and Drug Administration (FDA) is responsible for ensuring the safety of pharmaceuticals, biologicals, and medical devices.", "url": "https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/food-drug-administration/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2018-11-27T18:21:11+00:00", "image": "https://www.peta.org/wp-content/uploads/2013/10/200_2D00_IssuesExperimentsFDA.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/downloads/food/guidanceregulation/ucm222779.pdf", "http://bit.ly/3caag", "http://bit.ly/gaNjyi", "http://www.fda.gov/drugs/guidancecomplianceregulatoryinformation/guidances/default.htm", "http://hurelcorp.com/", "https://ncats.nih.gov/ntu/about", "http://www.fda.gov/TobaccoProducts/Labeling/RulesRegulationsGuidance/ucm246129.htm", "http://www.fda.gov/TobaccoProducts/default.htm", "http://www.fda.gov/TobaccoProducts/Labeling/ProductsIngredientsComponents/ucm456610.htm", "https://www.peta.org/blog/tobacco-companies-moving-away-from-animal-testing/", "https://www.regulations.gov/document?D=FDA-2009-N-0294-0610", "https://www.regulations.gov/document?D=FDA-2014-N-0189-79715", "https://www.regulations.gov/document?D=FDA-2012-D-0071-1818", "https://www.regulations.gov/document?D=FDA-2015-D-2496-0026", "http://www.piscltd.org.uk/", "http://www.piscltd.org.uk/wp-content/uploads/2015/04/ATLA-Manupello-2015.pdf", "http://www.iivs.org/", "http://www.fda.gov/MedicalDevices/DeviceRegulationandGuidance/GuidanceDocuments/ucm080742.htm"], "authors": [], "publish_date": "2010-06-23"}