{"result_id": "240025", "URL": "https://www.peta.org/blog/world-rabies-day-are-your-animal-companions-vaccinated/", "timestamp": "2023-04-25 16:48:30 CEST+0200", "meta": {"description": "Do you know when your dog’s or cat’s rabies vaccination expires? Forgetting can be deadly for all your loved ones.", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/blog/world-rabies-day-are-your-animal-companions-vaccinated/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "Rabies Is Preventable: How to Keep Your Loved Ones Safe", "cleaned_text": "Do you know when your animal companions’ rabies vaccinations expire? Forgetting to keep their shots up to date can be deadly for all your loved ones. This World Rabies Day (September 28), make sure your animal companions aren’t at risk.\n\nRabies is a viral disease that affects the central nervous system. It’s spread through the saliva and certain infectious tissues of an infected animal. Nearly all mammals can carry and contract rabies, but it’s very rare in smaller animals such as squirrels, chipmunks, rats, mice, rabbits, and opossums. While transmission occurs most commonly through saliva, the actual infection occurs in the brain, greatly changing the infected animal’s behavior and often giving them an “angry drunk” personality. However, not all animals with rabies will act aggressively, and some may even act overly friendly. A rabid animal may do the following:\n• Approach you, or let you get close to them (which is abnormal behavior for wild and feral animals)\n\nThese symptoms don’t necessarily mean an animal has rabies, but they’re often associated with it—along with a number of other painful diseases and conditions that require help from licensed individuals. If you see an animal exhibiting these types of behavior, contact your local animal control authorities and report the animal’s symptoms and location. Don’t approach the animal.\n\nWhat Happens if My Dog or Cat Gets Rabies?\n\nThere’s no cure for rabies. Once an animal begins to show symptoms, the disease is almost always fatal for mammals, including humans. Rabies can incubate in mammals for months with no symptoms, so if your animal companion isn’t vaccinated and has a known exposure to rabies, they will likely be quarantined for upward of four months, incurring a very large veterinary bill.\n\nEven though contracting rabies is entirely preventable, there have been many instances in which an expired rabies vaccine has led to animals’ deaths and humans’ exposure to the virus. A cat who had gone missing in South Carolina was three months overdue for a vaccination when they contracted rabies and exposed at least four people to it, and a dog in Montana contracted rabies after being exposed to a sick skunk, resulting in a countywide quarantine of all unvaccinated dogs, cats, and ferrets for 60 days.\n\nHow Can I Prevent My Animal Companions From Getting Rabies?\n\nAlthough it’s a scary disease, contracting rabies is entirely preventable through vaccination. To help protect yourself and your loved ones, follow PETA’s helpful safety tips:\n• Keep your animal companions’ rabies vaccination up to date.\n• Keep animal companions indoors unless they’re supervised and wearing properly fitting harnesses and a leash. In addition to putting their lives and those of many birds and small animals at risk, free-roaming cats are responsible for most cases of human rabies exposures among domestic animals in the U.S.\n• Even if your cat is always kept inside, they should have an up-to-date rabies vaccination. It’s legally required in many states, and if your unvaccinated cat were to end up outside, it could prove fatal.\n• Always feed animal companions indoors. Food left outside attracts concentrations of wild and stray animals, and since many diseases such as rabies are spread through saliva, sharing bowls with other animals can contribute greatly to the spread of disease.\n• Spay and neuter your animal companions! Sterilization is our best defense against the companion animal overpopulation crisis and reduces the number of roaming, homeless animals who can contract and spread rabies and other devastating diseases.\n\nIn the U.S., 90% of rabies cases stem from wildlife, but around the world, homeless, unvaccinated dogs and cats contribute to incidences of rabies much more often. In just one year, an unspayed cat can give birth to 12 kittens and an unspayed dog can give birth to 16 puppies.\n\nThankfully, PETA U.S. and other PETA entities offer free and low-cost sterilization and rabies vaccinations in many parts of the world. This work helps limit the suffering of animals for generations, as fewer unsterilized dogs and cats mean fewer animals born into communities that don’t have the resources to care for them and protect them from horrible diseases like rabies.", "opengraph": {"article:published_time": "2022-09-27T13:47:07+00:00", "locale": "en_US", "type": "article", "title": "Rabies Is Preventable: How to Keep Your Loved Ones Safe | PETA", "description": "Do you know when your dog’s or cat’s rabies vaccination expires? Forgetting can be deadly for all your loved ones.", "url": "https://www.peta.org/blog/world-rabies-day-are-your-animal-companions-vaccinated/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2022-09-27T15:39:10+00:00", "image": "https://www.peta.org/wp-content/uploads/2022/09/needle-gaffec6544_1920.jpg", "image:width": "1400", "image:height": "933", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.peta.org/wp-content/uploads/2020/08/two-cute-dogs-on-a-walk-Skyhobo.jpg", "https://www.peta.org/wp-content/uploads/2022/09/needle-gaffec6544_1920.jpg", "https://www.wspa.com/news/local-news/4-exposed-to-rabid-cat-in-greenville-co-dhec-says/", "https://nbcmontana.com/news/local/sixty-day-quarantine-issued-for-big-horn-county-after-dog-dies-of-rabies", "https://www.peta.org/features/keep-cats-inside/", "https://www.vet.cornell.edu/departments-centers-and-institutes/cornell-feline-health-center/health-information/feline-health-topics/ask-elizabeth-need-rabies-vaccination-indoor-cats", "https://headlines.peta.org/peta-global-compassion-fund/?en_txn7=blog::world%20rabies%20day#donate&p2asource=blog::world%20rabies%20day#donate"], "authors": ["Sara Oliver"], "publish_date": "2022-09-27T13:47:07+00:00"}