{"result_id": "240034", "URL": "https://www.peta.org/issues/animals-used-for-experimentation/animals-used-experimentation-factsheets/aids-contagion-confusion/", "timestamp": "2023-04-25 16:48:41 CEST+0200", "meta": {"description": "Acquired immune deficiency syndrome (AIDS) is a disease that results from a viral infection that damages the immune system. A damaged immune system cannot", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/issues/animals-used-for-experimentation/animals-used-experimentation-factsheets/aids-contagion-confusion/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "AIDS: Contagion and Confusion", "cleaned_text": "Acquired immune deficiency syndrome (AIDS) is a disease that results from a viral infection that damages the immune system. A damaged immune system cannot protect the body from other infections and cancers, and these secondary illnesses are often fatal. There are many strains of the AIDS virus, called the human immunodeficiency virus (HIV), with different strains existing in different geographical areas.\n\nBillions of dollars are spent annually to combat what has been called “one of the most destructive epidemics in history.” Since AIDS was first recognized in the 1980s, it has killed more than 35 million people, and almost 37 million people worldwide are believed to be infected with the virus.1 Not included in that number are the animal victims killed in countless wasteful experiments in an attempt to find a cure.\n\nNon-animal clinical, epidemiological, and in vitro studies have successfully isolated the virus that causes AIDS and have demonstrated how the virus is transmitted in people. Clinical evidence shows that AIDS is transmitted through blood, semen, vaginal fluids, and breast milk. The virus dies quickly outside the body, so it cannot be transmitted through the air or through casual contact. Because AIDS can develop years after the initial infection, it is impossible to predict how many people might get the disease.\n\nResearchers rely on epidemiology and in vitro lab work to identify, track, and isolate new strains of HIV before they spread.\n\nThe Failure of the Monkey ‘Model’\n\nHistorically, research focused on injecting the HIV virus into chimpanzees. Many AIDS-infected chimpanzees were locked in small steel-and-glass isolation chambers in laboratories, where these highly social animals typically became psychotic from stress and isolation. The stress of confinement also suppressed the chimpanzees’ immune systems, making accurate AIDS studies impossible. After years of trying to infect chimpanzees with the virus, in 1996, a 15-year-old chimpanzee named Jerome, who had been infected with HIV in 1986, died of AIDS.2 No chimpanzee has ever developed AIDS from normal exposure to the virus, and Jerome only developed AIDS because he was injected with three different strains of HIV, which formed a new hybrid strain unlike the ones found in humans.\n\nThe high cost and endangered status of chimpanzees prompted more researchers to inject AIDS-like viruses into other animals. In 1999, a monkey named “798” was injected with a trial vaccine, and from that point on, experimenters regularly injected him with virulent forms of HIV. Like all the monkeys in the trial, he tested positive for HIV but didn’t develop symptoms. The experimenters trumpeted their success in medical journals, all the while poking, prodding, and repeatedly jabbing the monkey with needles to withdraw still more blood. Then, suddenly, “798” got sick and, after a year of suffering from debilitating, body-wasting AIDS symptoms, he died.3\n\nAs far back as 1987, renowned AIDS researcher Dr. Allen Goldstein of George Washington University stated, “The sooner we begin testing on humans, the sooner we’ll hopefully be able to develop a vaccine.”4 Still, experiments designed to mimic the HIV virus involved infecting monkeys with simian immunodeficiency virus (SIV) and cats with feline immunodeficiency virus (FIV). However, like other AIDS-related viruses, these viruses do not resemble HIV. AIDS researcher Marc Girard stressed, “One should realize that we still do not know how the SIV or SHIV model compares to HIV infection in humans. Extrapolating from vaccine protection results in non-human primate studies to efficacy in man may be misleading.”5 An animal experimenter at the Washington National Primate Research Center wrote in a peer-reviewed journal that nonhuman primate models of HIV “do not allow direct testing of HIV vaccines” and that “because of the complexity and limitations of the nonhuman primate models, it remains difficult to extrapolate data from these models to inform the development of HIV vaccines.”6\n\nAbout 100 HIV vaccines have been tested successfully in animals, but not one of them has been shown in clinical trials to give humans sufficient protection from the virus.7,8 Jerome’s death and the endless suffering of other nonhuman primates from this horrible disease did not produce any benefits for human patients and drew precious research funds away from the study of AIDS in infected humans. A research scientist working on AIDS therapies wrote in New Scientist, “Animal research merely gives false hope to people who need real cures and detracts financially and intellectually from more appropriate research.”9 As the associate editor of the British Medical Journal stated, “When it comes to testing HIV vaccines, only humans will do.”10\n\nBy 2000, research using chimpanzees had declined. In 2015, the U.S. Fish and Wildlife Service classified all U.S. chimpanzees as endangered, which effectively banned further use of the primates in biomedical research.11\n\nWhat You Can Do\n\nPETA is urging National Institute of Allergy and Infectious Diseases to end HIV experiments on monkeys and instead use human-relevant, cutting-edge methods. Please take action by telling it to stop funding and conducting HIV/AIDS experiments on monkeys.\n\nSupport only charities that do not fund research on animals. If you must donate to a charity that conducts tests on animals, indicate on your check and donation form that you want your donation to go only toward animal-free research.\n\n1World Health Organization, “HIV/AIDS,” Global Health Observatory (GHO) data, accessed 20 Jan. 2019.\n\n 2David Berreby, “Twists and Turns in Chimp AIDS Research,” The New York Times 4 Feb. 1997.\n\n 3Mark Schoofs, “Monkey’s Death Muddles HIV Vaccine Hunt as Researchers Keep Focus on Inoculations,” The Wall Street Journal 17 Jan. 2002.\n\n 4Associated Press, “U.S. Said to Back AIDS Vaccine Test on Humans,” 18 Aug. 1987.\n\n 5Marc Girard et al., “New Prospects for the Development of a Vaccine Against Human Immunodeficiency Virus Type 1. An Overview,” Life Sciences 322 (1999): 959-66.\n\n 6Shiu-Lok Hu, “Non-Human Primate Models for AIDS Vaccine Research,” Current Drug Targets—Infectious Disorders 5 (2005): 193-201.\n\n 7Aysha Akhtar, “The Flaws and Human Harms of Animal Experimentation,” Cambridge Quarterly of Healthcare Ethics 24 (2015): 407-419.\n\n 8Emiliano Rodríguez Mega, “‘Mosaic’ HIV Vaccine to Be Tested in Thousands of People,” Nature 572 (2019): 165-166.\n\n 9Claude Reiss, “Mouse Model Fails,” New Scientist 11 May 2002.\n\n 10Alison Tonks, “Quest for the AIDS Vaccine,” British Medical Journal 334 (2007): 1346-8.\n\n 11David Grimm, “Research on Lab Chimps Is Over. Why Have So Few Been Retired to Sanctuaries?” Science, 12 June 2017.", "opengraph": {"article:published_time": "2003-12-16", "locale": "en_US", "type": "article", "title": "AIDS: Contagion and Confusion | PETA", "description": "Acquired immune deficiency syndrome (AIDS) is a disease that results from a viral infection that damages the immune system. A damaged immune system cannot", "url": "https://www.peta.org/issues/animals-used-for-experimentation/animals-used-experimentation-factsheets/aids-contagion-confusion/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2023-01-20T16:03:36+00:00", "image": "https://www.peta.org/wp-content/uploads/2015/04/peta-facebook-placeholder-new.jpg", "image:width": "1600", "image:height": "1006", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://support.peta.org/page/36378/action/1?en_txn7=blog::aids-contagion-confusion-issues&p2asource=blog::aids-contagion-confusion-issues", "https://www.who.int/gho/hiv/en/", "https://www.nytimes.com/1997/02/04/science/twists-and-turns-in-chimp-aids-research.html", "https://www.wsj.com/articles/SB1011217461246317720", "https://www.nytimes.com/1987/08/18/us/us-said-to-back-aids-vaccine-test-on-humans.html", "https://www.ncbi.nlm.nih.gov/pubmed/10646090", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1488817/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4594046/#fn55", "https://www.newscientist.com/issue/2342/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1906671/", "https://www.sciencemag.org/news/2017/06/research-lab-chimps-over-why-have-so-few-been-retired-sanctuaries"], "authors": [], "publish_date": "2003-12-16"}