{"result_id": "240026", "URL": "https://support.peta.org/page/36378/action/1?locale=en-US", "timestamp": "2023-04-25 16:48:31 CEST+0200", "meta": {"description": "The National Institute of Allergy and Infectious Diseases has spent 38 years infecting and killing monkeys in an attempt to develop an effective HIV vaccine. It has failed.", "lang": "en", "keywords": "", "favicon": "https://resources.peta.org/engaging-networks/pages/_shared/images/favicons/apple-touch-icon.png", "canonical": "https://support.peta.org/page/36378/action/1?locale=en-US", "encoding": "UTF-8"}, "image": null, "domain": "support.peta.org", "title": "PETA to NIH: Four Decades of Killing Monkeys in HIV Experiments Is Enough", "cleaned_text": "PETA to NIH: Four Decades of Killing Monkeys in HIV Experiments Is Enough\n\nUpdate (January 26, 2023): We’ve seen this movie before.\n\nAn HIV vaccine developed with funding from the National Institute of Allergy and Infectious Diseases (NIAID) has failed in a clinical trial in humans, despite testing successfully in monkeys. So you can add those animals to the pile of dead primates that haunt the disastrous history of HIV vaccine “research.” And add this latest failure to the dozens that came before it. Such multimillion-dollar fiascos will continue as long as experimenters rely on monkeys, who can’t be infected with HIV, to try to develop a vaccine to prevent HIV infection. Take action below to tell NIAID that patients deserve better.\n\nThe National Institute of Allergy and Infectious Diseases (NIAID), formerly led by Anthony Fauci, began experimenting on monkeys in an attempt to develop a vaccine for human immunodeficiency virus/acquired immunodeficiency syndrome (HIV/AIDS) in 1985. This was the same year that Microsoft introduced its Windows operating system.\n\nThis innovation made Microsoft one of the world’s largest corporations, while the reliance of NIAID—part of the National Institutes of Health (NIH)—on monkey models has wasted almost 40 years and billions of taxpayers’ dollars and has resulted in little more than a pile of dead monkeys. NIAID has failed to create a vaccine that protects humans from HIV infection. PETA needs your help to end this insanity.\n\nHumans are the only primates who contract HIV and develop AIDS. Chimpanzees don’t. Monkeys don’t. To get around this sticky issue, experimenters infect macaques with simian immunodeficiency virus (SIV), a virus unique to African primates, or they use an engineered SIV/HIV concoction. The idea is that macaques can serve as a surrogate model for HIV infection—except they can’t.\n\nExperimenters have developed dozens of vaccines. Only five have gotten as far as human trials, and all of them have failed. One of them even increased the likelihood of HIV infection in humans. After one of the human vaccine trials failed in 2018, Fauci acknowledged that the positive results of a macaque study he had been involved in “might [have been] a fluke.”\n\nIt’s not as though the experimenters aren’t seeing this massive failure.\n\nAs AIDS researcher Marc Girard stated, “One should realize that we still do not know how the SIV or SHIV model compares to HIV infection in humans. Extrapolating from vaccine protection results in non-human primate studies to efficacy in man may be misleading.”\n\nIn a peer-reviewed journal, an animal experimenter at the Washington National Primate Research Center admitted that nonhuman primate models of HIV “do not allow direct testing of HIV vaccines” and that “because of the complexity and limitations of the nonhuman primate models, it remains difficult to extrapolate data from these models to inform the development of HIV vaccines.”\n\nMaking Sick Monkeys Sicker\n\n On top of this, experimenters have likely used monkeys also infected with other diseases—which further compromises any experiments. A seven-month investigation by The Arizona Republic revealed that macaques from a University of Washington breeding colony (which was funded by NIH to supply healthy monkeys for HIV studies nationwide) have been housed for years on land that’s rife with Valley fever. They are exposed to—and even die of—a disease that experimenters admit would undermine their use in HIV research. Valley fever is found throughout the Southwest, where most monkeys are housed before they’re shipped all over the U.S. In fact, recent HIV studies—which Fauci was involved in—used macaques from a colony that included monkeys from a breeding facility in Alice, Texas, a Valley fever hotspot.\n\nTime to Modernize\n\n Over the past 38 years, the world has moved from using Microsoft’s first Windows system to prospecting the surface of Mars with remote control cars. But fossils like NIH continue to waste time, money, and lives mining the dusty failures of the past, inexplicably hoping for a different outcome while using the same tired methods.\n\nPETA is urging NIAID to end HIV experiments on monkeys and instead use human-relevant, cutting-edge methods.\n\nPlease take action by telling it to stop funding and conducting HIV/AIDS experiments on monkeys.", "opengraph": {"title": "PETA to NIH: Four Decades of Killing Monkeys in HIV Experiments Is Enough", "description": "The National Institute of Allergy and Infectious Diseases has spent 38 years infecting and killing monkeys in an attempt to develop an effective HIV vaccine. It has failed.", "image": "https://acb0a5d73b67fccd4bbe-c2d8138f0ea10a18dd4c43ec3aa4240a.ssl.cf5.rackcdn.com/10003/VIV+NIHMaternalMonkey+NC+DB.jpg?v=1516213907000", "url": "https://support.peta.org/page/36378/action/1?locale=en-US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nih.gov/news-events/news-releases/experimental-hiv-vaccine-regimen-safe-ineffective-study-finds?utm_source=dlvr.it&utm_medium=twitter", "https://www.peta.org/blog/wanprc-monkey-breeding-center-mesa-arizona-toxic-water/"], "authors": [], "publish_date": null}