{"result_id": "240033", "URL": "https://www.peta.org/blog/covid-19-vaccine-fda-animal-testing/", "timestamp": "2023-04-25 16:48:40 CEST+0200", "meta": {"description": "We need a COVID-19 vaccine, and we can't waste time on ineffective animal testing. Lucky for us and the whole world, the U.S. government agrees.", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/blog/covid-19-vaccine-fda-animal-testing/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "COVID-19 Proved We Must End Animal Testing Immediately", "cleaned_text": "With over 1 million confirmed cases of COVID-19 in the U.S. alone, we need effective treatments and vaccines. We can’t waste time on ineffective animal testing—and lucky for us and the whole world, the U.S. government agrees.\n\nIn a watershed moment in history, the U.S. Food and Drug Administration (FDA) has responded to the pandemic by prioritizing human clinical trials over animal testing. Now PETA is asking the FDA to seize this opportunity to stop requiring cruel, wasteful animal tests for all drugs—not just treatments for COVID-19.\n\nDespite the existence of human-relevant, non-animal tests, the FDA has insisted for decades that there is no way to bring a new drug to human clinical trials without first testing it on thousands of animals. But in the face of pressure to develop medicines to prevent or treat COVID-19 quickly and safely, the FDA has taken actions proving that this is not the case.\n\nLast month, for the first time in history, both the FDA and the U.S. National Institutes of Health (NIH) greenlighted a landmark human clinical trial of a vaccine without first requiring extensive animal tests. Companies are usually required to spend years putting animals through the agony of new product tests before human clinical trials are allowed to begin, even though those animal tests don’t predict whether a drug will work in humans.\n\nBut in this case, the company started developing a COVID-19 vaccine in January, and by March, the FDA and NIH both agreed: It’s time to see if this vaccine is effective in humans. And that’s just the tip of the iceberg—there are many similar trials up and running and in the planning stages.\n\nNinety-five percent of drugs that pass animal tests fail in humans. Skipping irrelevant animal tests avoids the delay in bringing lifesaving drugs to market and allows resources to be focused instead on human-relevant, non-animal test methods. It also avoids the possibility of abandoning a drug that might save human lives just because it doesn’t work in animals!\n\nThe writing is on the wall: Animal tests are a barrier to getting quick, safe, and effective medicines and vaccines for humans onto the market.\n\nAvoiding misleading tests on animals and asking human volunteers to give blood have sped up access to potentially lifesaving treatments for COVID-19. The most readily available treatment for COVID-19 and other diseases—called convalescent plasma—comes directly from humans who have recovered from the illness.\n\nThis treatment doesn’t use a single animal—just the antibodies made by the human immune system to fight off infection. The FDA has already allowed several people to receive convalescent plasma as part of its treatment for COVID-19 and is expanding this effort.\n\nIn all animal tests, the animals—with their complex emotions, sensitivities, and personalities—are treated as if they were inanimate laboratory equipment. They’re burned, mutilated, restrained, and pumped full of toxic chemicals and deadly pathogens. We can’t imagine the terror that every single animal trapped in a laboratory must feel day in and day out.\n\nThe FDA has been saying for years that the only way to guarantee that new medicines are developed quickly is to prioritize human-relevant testing approaches instead of relying on traditional animal testing. In its 2017 Predictive Toxicology Roadmap, it noted that new, human-relevant technology—not animal tests—is the key to better predicting the safety and effectiveness of a medicine for humans.\n\nNow it’s time for the agency to put these words into action. Here’s how to help.\n\nEveryone can help animals by urging the FDA not to limit its expansion of human clinical trials to the development of COVID-19 treatments and vaccines but instead to apply it to all new drugs and medical treatments in the future and not waste any more time on animal testing.\n\nRecovered from COVID-19 and want to help animals?\n\nThe FDA is asking people who have recovered from this illness to consider donating blood for use in these clinical trials. A single donation can treat up to four ill people—no animals required.", "opengraph": {"article:published_time": "2020-05-05T20:01:16+00:00", "locale": "en_US", "type": "article", "title": "COVID-19 Proved We Must End Animal Testing Immediately | PETA", "description": "We need a COVID-19 vaccine, and we can't waste time on ineffective animal testing. Lucky for us and the whole world, the U.S. government agrees.", "url": "https://www.peta.org/blog/covid-19-vaccine-fda-animal-testing/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2020-09-10T19:06:55+00:00", "image": "https://www.peta.org/wp-content/uploads/2019/09/iStock-1166363615-Svetlana-Pazhiltseva-1.jpg", "image:width": "1202", "image:height": "612", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.peta.org/blog/experiments-on-animals-fail-90-of-the-time-why-are-they-still-done/", "https://www.peta.org/wp-content/uploads/2019/09/iStock-1166363615-Svetlana-Pazhiltseva-1.jpg", "https://www.peta.org/wp-content/uploads/2020/05/2020.05.05-FDA-Commissioner-COVID-19-letter-FINAL.pdf", "https://headlines.peta.org/research-modernization-new-deal/#action", "https://www.peta.org/blog/coronavirus-vaccine-nih-skips-tests-on-animals/", "https://www.peta.org/blog/coronavirus-covid-19-vaccine-non-animal-tests/", "https://www.peta.org/issues/animals-used-for-experimentation/animal-testing-bad-science/", "https://www.peta.org/blog/peta-science-group-funded-non-animal-research-makes-scientific-breakthrough/", "https://www.peta.org/wp-content/uploads/2019/09/iStock-1052049312-rat-Caymia-1.jpg", "https://headlines.peta.org/research-modernization-new-deal/#action", "https://www.fda.gov/emergency-preparedness-and-response/coronavirus-disease-2019-covid-19/donate-covid-19-plasma"], "authors": ["Zachary Toliver"], "publish_date": "2020-05-05T20:01:16+00:00"}