{"result_id": "240021", "URL": "https://www.peta.org/blog/coronavirus-covid-19-vaccine-non-animal-tests/", "timestamp": "2023-04-25 16:48:26 CEST+0200", "meta": {"description": "Around the globe, there are a number of non-animal tests already underway aimed at developing a vaccine or treatment for COVID-19. Learn more.", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/blog/coronavirus-covid-19-vaccine-non-animal-tests/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "The Scientists Using Non-Animal Tests for a COVID-19 Vaccine", "cleaned_text": "With the world in the grip of a pandemic, scientists are working hard to develop much-needed treatments and vaccines for COVID-19, the disease caused by the novel coronavirus. Around the globe, there are a number of non-animal tests already underway aimed at developing a vaccine or treatment for COVID-19. Given the scale and seriousness of this pandemic, researchers can’t afford to waste time conducting useless experiments on animals.\n\nPETA and compassionate people everywhere were heartened to learn that, in order to speed up the development of a potential coronavirus vaccine, the National Institutes of Health (NIH) quickly began testing directly on humans without waiting for the results of the typical, lengthy animal-testing phase, showing that the results yielded by tests on animals are not necessary and are slowing down the development of medicines that will help humans.\n\nHere are more examples of innovative COVID non-animal tests allowing researchers to avoid cruel and archaic tests on animals in favor of cutting-edge, human-relevant methods:\n• The U.S. Food and Drug Administration (FDA) has announced that it will use chips containing human lung cells developed by Emulate, Inc.—PETA’s 2014 Company of the Year—to study the response generated by human plasma containing antibodies against SARS-CoV-2. Emulate said that the results of the study will not only be useful for showing how these antibodies may protect human lung cells from infection but also “provide insights into antibody dependent enhancement … which is relevant to evaluating the safety of vaccines for COVID-19.” Commenting on the agreement, the FDA’s chief scientist, Rear Adm. Denise Hinton said, “A robust commitment to science is at the core of our public health mission and helping to facilitate advancements in regulatory science reflects our dedication to fostering the development of critical medical products to address public health threats like COVID-19.”\n• Researchers in Boston have published a paper on their use of lung organoids—sophisticated models built with human lung cells—to understand how COVID-19 infections produce extreme lung inflammation. They say that the work has “launched a search for new therapeutics that could block this process before it can take off and turn fatal.” The senior author of the study points out that the findings are groundbreaking, since almost all previous work on this issue has been done using animal cells. “You learn a lot more about how human beings respond to the virus and how drugs might work in them when you infect human lung cells, not kidney cells from monkeys,” he says.\n• In San Diego, researchers are using lung organoids, also known as “mini lungs in a dish,” infected with SARS-CoV-2 to test the efficacy of two existing drugs against the virus. These organoids are 3-D structures composed of human skin cells that have been “coached” into becoming lung cells. One of the study’s researchers says, “Mini lungs are an ideal system to further investigate these drugs because they can emulate the actual COVID-19 disease, and they may help us bypass animal testing and fast-track them to patients.” Another non-animal component of the study involves the drugs themselves. They were identified as likely candidates through a high-throughput screening that employed sophisticated computer software.\n• Three-dimensional reconstructed human respiratory tissue models, such as those from Epithelix Sàrl and MatTek Life Sciences, can be used to study COVID-19 infection and screen for potential treatments. A longtime supporter of the two companies, the PETA International Science Consortium Ltd. helped fund the development of a first-of-its-kind model of the lower respiratory tract, EpiAlveolar, available from MatTek Life Sciences. EpiAlveolar is a three-dimensional model composed of human cells from the lower respiratory tract. The cells can be exposed to the test material in the air on one side and can receive nourishment from a nutrient-rich liquid on the other—similar to the workings of a human lung.\n• YUMAB announced that it has created and confirmed the effectiveness of the first human-derived antibodies against the novel coronavirus. Researchers are turning to fully human antibodies because they don’t use animals and are more scientifically robust and faster to make than animal-derived antibodies. In 2020, the Science Consortium co-organized a webinar series in which experts spoke about the use of animal-free antibodies, including for the development of vaccines and treatments for diseases such as COVID-19.\n• Scientists at Gauhati University in India used advanced computer simulation methods to work out which parts of the virus are best suited to triggering an immune response in humans. This work could contribute to the design of safe and effective vaccines against COVID-19.\n• Researchers at the University of Bristol in England are growing the virus in cells to gain a better understanding of the way it spreads and causes sickness. Using this technique, they can find out whether it mutates under certain conditions. Unlike pointlessly infecting mice, this work provides crucial information.\n• Researchers at Oak Ridge National Laboratory in Tennessee are using Summit—the world’s smartest and most powerful supercomputer—to identify existing drugs that could be effective in treating COVID-19 in humans. Based on the physical properties of the virus and of each drug, the computer predicts how the two might interact. The effectiveness of promising drugs can then be measured by testing them on cells infected with the virus.\n• The U.K. government has approved a study in which up to 90 healthy volunteers between the ages of 18 and 30 will be exposed to SARS-CoV-2. This research—the first of its kind for the novel coronavirus—aims to support the pandemic response by aiding the development of vaccines and treatments. To ensure participants’ safety, they will be constantly monitored and scientists will infect them with a version of the virus that’s been shown to pose a low risk to young, healthy adults. Clive Dix, Ph.D., interim chair of the U.K. Vaccines Taskforce—the government group charged with leading that country’s efforts to develop COVID-19 vaccines—commented on the importance of the research: “We have secured a number of safe and effective vaccines for the UK, but it is essential that we continue to develop new vaccines and treatments for Covid-19. We expect these studies to offer unique insights into how the virus works and help us understand which promising vaccines offer the best chance of preventing the infection.”\n• In the Netherlands, researchers used intestinal organoids—state-of-the-art models of the intestine grown with human cells—to determine that SARS-CoV-2, the virus that causes COVID-19, can infect that organ. The researchers say, “These findings could explain the observation that approximately one third of COVID-19 patients experience gastrointestinal symptoms.” The Dutch researchers are continuing to use human-relevant organoids as they investigate the differences in SARS-CoV-2 infections in the intestine compared to the lungs.\n• A North Carolina company is working to “develop biological 3-D models for all major organs and disease states.” PETA has long supported in vitro testing methods such as these, which use human cells. This way, tests that study the way a drug behaves in human tissue can be performed instead of pointless tests on animals that aren’t relevant to human health. The company states, “Given the rapid spread of COVID-19, we are quickly redeploying some of our internal resources to develop a lung model for research into potential COVID-19 treatments.”\n• In Toronto, Canada, researchers are using organs-on-chips—sophisticated, animal-free models of the human nose, mouth, eyes, and lungs—to understand how SARS-CoV-2 is so effective at breaking through the epithelial barriers that normally protect organs from harmful microbes. These chips contain human cells that mimic both the structure and function of human organs. One of the researchers involved in the work says, “With organ-on-a-chip, we can study what happens within 24 hours of COVID-19 entering the body.”\n• While it’s known that the saliva of people infected with SARS-CoV-2 can contain high levels of the virus, it’s unclear if that’s because the virus has directly invaded the oral tissue. In an effort to find out, an international team of researchers examined oral tissue from healthy humans. They discovered that cells in parts of the mouth contain two key proteins needed for SARS-CoV-2 to enter them. The scientists also analyzed mouth cells shed into the saliva of people with mild or asymptomatic COVID-19 and found that those cells contained SARS-CoV-2 RNA, indicating that the virus was actively replicating in the oral tissue. Studying a separate group of asymptomatic patients, the team found that those with the virus in their saliva were more likely to experience the loss of taste and smell. One of the study’s lead authors, Blake Warner, chief of the Salivary Disorders Unit at the National Institute of Dental and Craniofacial Research, commented on the importance of the research: “By revealing a potentially underappreciated role for the oral cavity in SARS-CoV-2 infection, our study could open up new investigative avenues leading to a better understanding of the course of infection and disease. Such information could also inform interventions to combat the virus and alleviate oral symptoms of COVID-19.\n• Thousands of researchers from 19 countries—including Finland, India, Japan, Malaysia, Spain, and the U.S.—have performed a genetic analysis of almost 50,000 human COVID-19 patients to search for gene variations associated with severe infection from the SARS-CoV-2 virus. The results, published in the journal Nature, describe 13 variants linked to susceptibility and serious illness. A Nature summary of these findings concludes that they “may provide new insights into how infection causes disease and could identify targets for drug development or repurposing.”\n\nNIH reports that 95 out of every 100 new drugs that pass animal tests fail in humans, because they are either unsafe or ineffective. Mice—who have to be genetically engineered just to be susceptible to the disease—show only mild symptoms of COVID-19. Dr Stanley Perlman, a coronavirologist at the University of Iowa, notes that infecting mice “doesn’t really tell you much about how the virus causes disease.”\n\nIn this time of great uncertainty and confusion, there’s one thing we do know for sure: Experimenting on animals is not only unethical but also unjustifiable from a scientific perspective.\n\nWhat You Can Do\n\nExperiments on animals are archaic and cruel. They waste resources, time, and lives. Join PETA and compassionate people around the world who want to see our leaders invest in real science that will help humans.\n\nYou can help animals suffering needlessly in labs today. Click the button below to get started:", "opengraph": {"article:published_time": "2020-04-09T19:21:53+00:00", "locale": "en_US", "type": "article", "title": "The Scientists Using Non-Animal Tests for a COVID-19 Vaccine", "description": "Around the globe, there are a number of non-animal tests already underway aimed at developing a vaccine or treatment for COVID-19. Learn more.", "url": "https://www.peta.org/blog/coronavirus-covid-19-vaccine-non-animal-tests/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2021-10-06T23:30:30+00:00", "image": "https://www.peta.org/wp-content/uploads/2020/08/tiny-white-mouse-green-branch.jpg", "image:width": "960", "image:height": "640", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.peta.org/issues/animals-used-for-experimentation/", "https://www.peta.org/blog/coronavirus-vaccine-nih-skips-tests-on-animals/", "https://www.biospace.com/employer/539512/emulate-inc-/", "https://www.peta.org/blog/announcing-petas-2014-company-year/", "https://www.sciencedirect.com/science/article/pii/S1934590920304598?via%3Dihub", "https://www.eurekalert.org/pub_releases/2020-07/sbpm-sbp071720.php", "https://www.peta.org.uk/blog/animal-free-inhalation-testing-talk-about-a-breath-of-fresh-air/", "https://www.epithelix.com/", "https://www.mattek.com/", "https://www.peta.org/blog/peta-funded-3-d-lung-superior-animal-tests/", "https://www.yumab.com/partnership-with-boehringer-ingelheim/", "https://www.peta.org/blog/peta-scientists-saving-animals-antibody-farms/", "https://www.wbur.org/hereandnow/2020/03/23/supercomputers-covid-19-drugs", "https://www.gov.uk/government/news/worlds-first-coronavirus-human-challenge-study-receives-ethics-approval-in-the-uk", "https://www.eurekalert.org/pub_releases/2020-05/hi-csi043020.php", "https://www.outsourcing-pharma.com/Article/2020/03/26/zPredicta-LabCorp-partner-on-3D-cell-culture-technology", "https://www.peta.org/blog/progress-fda-studying-organs-chips-replace-tests-animals/", "https://news.engineering.utoronto.ca/how-does-covid-19-invade-our-bodies-so-easily-u-of-t-engineering-team-uses-organ-on-a-chip-model-to-find-out/", "https://www.nih.gov/news-events/news-releases/scientists-find-evidence-novel-coronavirus-infects-mouths-cells", "https://www.nature.com/articles/s41586-021-03767-x", "https://investigations.peta.org/nih-monkey-torture/"], "authors": ["Danny Prater"], "publish_date": "2020-04-09T19:21:53+00:00"}