{"result_id": "240018", "URL": "https://www.peta.org/blog/covid-19-vaccine-trials-humans-are-not-guinea-pigs/", "timestamp": "2023-04-25 16:48:22 CEST+0200", "meta": {"description": "News flash: Guinea pigs should never be experimented on. And humans should never be referred to as “guinea pigs.”", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/blog/covid-19-vaccine-trials-humans-are-not-guinea-pigs/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "COVID-19: Humans Aren’t Vaccine ‘Guinea Pigs’", "cleaned_text": "News flash: Guinea pigs should never be experimented on. And humans should never be called “guinea pigs,” especially when referring to animal testing.\n\nCOVID-19 vaccine news has been dominating headlines—but some news outlets apparently missed the memo that words matter, referring to humans participating in vaccine trials as “guinea pigs.” And as the authors of the list of animal-friendly idioms that broke the internet in 2018, we have to admit that it was disappointing to see journalists perpetuating speciesism, a human-supremacist worldview.\n\nWhat do all these headlines have in common? Whether or not their authors realize it, they’re examples of prejudice and discrimination. Humans consent to participating in COVID-19 vaccine trials—guinea pigs (or “lab rats”) being confined to barren cages, socially isolated, psychologically traumatized, cut and burned and tortured and experimented on in other deplorable ways, and eventually killed do not. Using vulnerable guinea pigs in laboratories as a synonym for these humans is speciesist, it trivializes cruelty to animals, and—not to feed a fed horse but—PETA isn’t here for it.\n\nHumans can consent to being experimented on—guinea pigs can’t.\n\nLike other forms of supremacy, speciesism is ingrained in humans: Most of us grow up being taught that we’re entirely different from and superior to other animals, which lays the foundation for exploiting them. But changing how we speak about other species is a great way to start to overcome this destructive way of thinking.\n\n\n\nGuinea pigs are as individual as you and me. Guinea pigs put you through an approval process, just as humans do when dating or meeting potential new friends: “[Y]ou have to convince your pigs to like you,” a PETA staffer and adopted guinea pig guardian admitted. Another PETA staffer described her two adopted guinea pigs as “adorable, sweet, and funny.” And when these three words can be used to described a person, we shouldn’t be locking that person or others like them in a cages or hurting them.\n\nIf you need ideas for replacing harmful, outdated expressions, check out PETA’s list of animal-friendly idioms. And click below to learn and do more to end speciesism:\n\nInstead of “Arizonans Among COVID-19 Vaccine Guinea Pigs,” just call a spade a spade: “Consenting Arizonans Among COVID-19 Vaccine Trial Participants.” Our understanding of social justice issues like speciesism can’t evolve until we’re prepared to allow our language to evolve with it. Using words that recognize that all sentient beings deserve respect and compassion is a simple task for us, but it can mean a world of difference to our fellow Earthlings.", "opengraph": {"article:published_time": "2020-12-04T22:15:27+00:00", "locale": "en_US", "type": "article", "title": "COVID-19: Humans Aren’t Vaccine ‘Guinea Pigs’ | PETA", "description": "News flash: Guinea pigs should never be experimented on. And humans should never be referred to as “guinea pigs.”", "url": "https://www.peta.org/blog/covid-19-vaccine-trials-humans-are-not-guinea-pigs/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2020-12-07T16:07:45+00:00", "image": "https://www.peta.org/wp-content/uploads/2020/12/guinea_pig_i_am_not_a_test_subject_social.jpg", "image:width": "1400", "image:height": "700", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Stop referring to humans who are volunteering in <a href=\"https://twitter.com/hashtag/COVID19?src=hash&amp;ref_src=twsrc%5Etfw\">#COVID19</a> vaccine trials as “guinea pigs,” just use \"trial participants.\"</p>\n<p>Using a species who is tortured against their will in labs as a synonym for consenting humans is speciesist and trivializes cruelty. <a href=\"https://t.co/12OQxz31Zu\">https://t.co/12OQxz31Zu</a></p>\n<p>— PETA (@peta) <a href=\"https://twitter.com/peta/status/1335016038308716545?ref_src=twsrc%5Etfw\">December 5, 2020</a></p></blockquote>\n"], "movies": [], "links": ["https://www.peta.org/issues/animal-companion-issues/animal-companion-factsheets/facts-guinea-pigs/", "https://www.peta.org/issues/animals-used-for-experimentation/animals-used-experimentation-factsheets/animal-experiments-overview/", "https://www.peta.org/issues/animals-used-for-experimentation/", "https://twitter.com/hashtag/COVID19?src=hash&ref_src=twsrc%5Etfw", "https://t.co/12OQxz31Zu", "https://twitter.com/peta/status/1335016038308716545?ref_src=twsrc%5Etfw", "https://www.peta.org/blog/monkey-experimters-want-covid-vaccines-tested-on-animals/", "https://www.peta.org/features/animal-friendly-idioms/", "https://www.peta.org/features/what-is-speciesism/", "https://twitter.com/peta/status/1070066047414345729/photo/1", "https://testsubjectsfilm.com/", "https://www.peta.org/teachkind/lesson-plans-activities/animal-friendly-idioms/", "https://headlines.peta.org/end-speciesism/", "https://headlines.peta.org/end-speciesism/"], "authors": ["Katherine Sullivan"], "publish_date": "2020-12-04T22:15:27+00:00"}