{"result_id": "240023", "URL": "https://www.peta.org/about-peta/learn-about-peta/helping-animals-in-hampton-roads/snip/", "timestamp": "2023-04-25 16:48:28 CEST+0200", "meta": {"description": "PETA spays and neuters hundreds of animals every week in Southeastern Virginia in our state-of-the-art mobile spay-and-neuter clinic.", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/about-peta/learn-about-peta/helping-animals-in-hampton-roads/snip/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "’s Spay/Neuter Services for Your Dog or Cat", "cleaned_text": "In Virginia, PETA offers spay and neuter surgeries for dogs and cats in the Hampton Roads area in four state-of-the-art mobile clinics. We have also partnered with the Friends of Norfolk Animal Care Center to offer free spay and neuter surgeries for dogs and cats of Norfolk residents on the second Wednesday of each month (by appointment only). Rabies vaccines and microchipping are also free for surgical patients on these days.\n\nMake an Appointment to Have Your Animal Companion Spayed or Neutered\n\nLearn More About Our Program and How You Can Help\n\nNeed to Have Your Dog or Cat Spayed or Neutered?\n\nPETA’s mobile clinics travel throughout the Hampton Roads region daily. Your animal must have an appointment to be spayed or neutered. Fill out the appointment request form online or call 757-622-7382 (select option 3).\n\nWe recommend that you print and fill out the check-in form (using blue or black ink), which is for surgical patients only, before you visit a clinic.\n\nPlease note: We accept payment with cash or credit card only.\n\nHere are some helpful resources to review before your visit:\n\nBecause of breed-specific surgical complications or medical predispositions, our clinics do not accept Doberman pinschers, Rottweilers, or bulldogs for surgery. Flat-faced breeds are more prone to respiratory distress during anesthesia and postsurgical recovery because of their narrow nasal passages and facial structure. We recommend the use of a private veterinary hospital, where they can be monitored more closely. Acceptance for surgery in our mobile clinics is at the sole discretion of the attending veterinarian. Due to the extended surgical time involved, we cannot perform sterilization surgery on cryptorchid dogs weighing over 25 pounds. Please see your regular veterinarian or our low-cost options sheet for other clinics in this case.\n\nHow PETA’s Spay/Neuter Services in Virginia Help\n\nVia our Mobile Clinics Division, PETA spays and neuters hundreds of companion animals every week in southeastern Virginia. Each of our clinics is capable of sterilizing up to 30 animals per day. The staff consists of a licensed veterinarian, a licensed veterinary technician, a veterinary assistant, and an assistant who checks in each animal. The clinics operate an average of six days a week, and the mobile clinics travel from Virginia’s Eastern Shore to Gloucester County and from the Border Station in Chesapeake to Emporia and locations in between.\n\nSince the program’s inception in 2001, PETA’s mobile clinics have helped prevent the births and inevitable suffering of hundreds of thousands of unwanted dogs and cats in Virginia and North Carolina, all through low-cost or free sterilization surgeries. PETA staffers go into underserved neighborhoods to distribute flyers about our low-cost spay/neuter program. The mobile clinics park in these neighborhoods, which makes it easier for residents to take in their animal companions for surgery. If someone doesn’t have transportation, we offer to transport the animal to and from surgery at no cost.\n• Frequently Asked Questions About PETA's Spay/Neuter Services in Virginia Why should I have my dog or cat spayed or neutered? Aside from preventing unwanted litters of animals and mitigating the devastating companion animal overpopulation crisis, spaying and neutering helps your animal companion live a longer, healthier life. Spaying eliminates the stress and discomfort that females endure during heat cycles, eliminates the risk of life-threatening uterine infections, and greatly reduces the risk of mammary cancer. Neutering makes males far less likely to roam or fight, prevents testicular cancer, and reduces the risk of prostate cancer and painful prostatitis. Sterilized animals are less likely to contract deadly, contagious diseases, such as FIV (feline AIDS) and feline leukemia, that are spread through bodily fluids. In one year, an unspayed cat can give birth to 16 kittens, who can go on to reproduce in just four months. An unspayed dog can birth up to 12 puppies in a year. Cats and dogs can go back into heat just days after giving birth. PETA’s spay/neuter services mean that countless animals will never be left on the streets to fend for themselves, succumb to untreated injuries and illnesses, become the victims of abuse, or be turned over to an animal shelter and have to be euthanized because no one wanted them. Can my animal companion be spayed if she’s in heat? What if she might be pregnant? Our clinics will spay animals who are in heat or pregnant at no additional charge. How much does surgery cost? We never turn anyone away on the basis of their inability to pay for surgery. Free spay/neuter services are available by appointment on the second Wednesday of each month. How do I schedule an appointment? You can schedule an appointment by calling 757-622-7382 (select option 3) or submitting an online appointment request form. Do I need to bring my animal’s medical records with me to the appointment? It’s always a good idea to bring prior medical records to any veterinary appointment. However, we do not require records for surgery unless there is a specific previous medical condition for which we would need to see them. Please note that invoices or receipts are not medical records. In most cases, however, the only required paperwork is our check-in form, which can be filled out digitally upon arrival to your appointment. What time do I need to arrive? At most locations, the drop-off time is 8 a.m. for dogs and 8:30 a.m. for cats. Please note that check-in times vary depending on the distance that the clinic is traveling, so it may be later or earlier depending on where your appointment is. That information will be provided when you schedule your appointment. Late arrival for check-in may result in forfeiture of your animal’s surgical appointment. How long should my animal refrain from eating before surgery? Any animal who is under 6 months old or weighs less than 10 pounds should eat a small snack between 5 and 6 a.m. the morning of the surgery. Food should be withheld from all other animals after midnight the night before the surgery. All animals can have a small amount of water prior to surgery. Does my animal need to arrive in a carrier? Cats must arrive in a secure carrier for their own safety. A hard plastic carrier with a front door that can be locked is ideal. Dogs must be on a leash but don’t need to be in a carrier. What time do I pick up my animal from surgery? The pickup time is usually that same day between 12 noon and 1 p.m. for dogs and 1:30 and 2:30 p.m. for cats. Please note that these are estimates only—the clinic staff will assign you a specific time the day of surgery. I lost my animal’s records from one of PETA’s clinics. Can I get another copy? All clients are given paperwork after an appointment at our clinics—please keep it in a safe place, along with your animal’s other medical records. If you have misplaced your copy, please use this form to request another copy or call reception at 757-622-7382 (choose option 3). Please allow 24 to 48 hours to process the request. I need to reschedule or cancel my appointment. What should I do? If you need to change or cancel your appointment, please reply to your appointment confirmation e-mail or call 757-622-7382 (choose option 3). Please note that we request at least a 24-hour notice for appointment cancellations or changes. What if my animal has complications after surgery? Our post-operative instructions cover a number of common complications that can occur after surgery. You are the most important person to ensure your animal’s full and speedy recovery, so read them carefully. We also have an emergency phone number that you can call 24 hours a day to reach a clinic staff member who can advise you if complications should arise. Can I apply flea preventive medication to my animal prior to surgery? How about after surgery? You can bathe or put flea preventive medication on your animal prior to surgery, and you can apply flea preventive medication or administer heartworm preventive medication after surgery, but please do not bathe your animal for two weeks after the surgery. What other services do your clinics offer? Can I bring my animal in for bloodwork, dental cleanings, etc.? We offer some other basic veterinary services such as vaccinations and flea preventive medications at the time of surgery, but we are not a full-service clinic and therefore are not equipped to offer services such as bloodwork, physical exams, or dental cleanings. Can I have someone else drop off or pick up my animal? Other people are permitted to drop off or pick up animals before or after surgery, but the animal’s legal guardian must fill out the paperwork to consent to the surgery. We ask that you notify clinic staff if someone else will be dropping off or picking up your animal.", "opengraph": {"article:published_time": "2010-06-23", "locale": "en_US", "type": "article", "title": "PETA’s Spay/Neuter Services for Your Dog or Cat | PETA", "description": "PETA spays and neuters hundreds of animals every week in Southeastern Virginia in our state-of-the-art mobile spay-and-neuter clinic.", "url": "https://www.peta.org/about-peta/learn-about-peta/helping-animals-in-hampton-roads/snip/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2023-02-15T17:59:44+00:00", "image": "https://www.peta.org/wp-content/uploads/2010/06/HWRe-Wrapwithbuilding.jpg", "image:width": "4128", "image:height": "2322", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://clinichq.com/onlinegrouped/30a14a1c-0f6e-493b-b4a3-f3415d560d1d", "#faq", "https://clinichq.com/onlinegrouped/30a14a1c-0f6e-493b-b4a3-f3415d560d1d", "https://www.peta.org/wp-content/uploads/2021/06/Companion_Animal_Tattoo_Policy.pdf", "https://www.peta.org/wp-content/uploads/2021/06/PETA_Post_Operation_Form.pdf", "https://www.peta.org/wp-content/uploads/2021/06/PETAClinicFeeSheet.pdf", "https://www.peta.org/wp-content/uploads/2021/06/SurgicalGuidelines.pdf", "https://www.peta.org/issues/companion-animal-issues/spay-neuter/", "#", "https://www.peta.org/issues/companion-animal-issues/overpopulation/", "https://www.peta.org/issues/companion-animal-issues/overpopulation/spay-neuter/", "https://www.peta.org/wp-content/uploads/2021/06/PETAClinicFeeSheet.pdf", "https://clinichq.com/onlinegrouped/30a14a1c-0f6e-493b-b4a3-f3415d560d1d", "https://clinichq.com/public/paperwork/30a14a1c-0f6e-493b-b4a3-f3415d560d1d", "https://www.peta.org/wp-content/uploads/2021/06/PETA_Post_Operation_Form.pdf", "https://www.peta.org/wp-content/uploads/2021/06/PETA_Clinic_Fee_Sheet.pdf"], "authors": [], "publish_date": "2010-06-23"}