{"result_id": "240001", "URL": "https://www.peta.org/media/news-releases/university-of-washington-uw-made-knowingly-false-statement-about-primate-centers-role-in-covid-19-vaccine/", "timestamp": "2023-04-25 16:48:02 CEST+0200", "meta": {"description": "A federal agency says that an official with the University of Washington (UW) made “knowingly false” statements when she publicly claimed that monkey A federal agency says that an official with the University of Washington (UW) made “knowingly false” statements when she publicly claimed that monkey experiments at the Washington National Primate Research Center (WaNPRC) helped create Moderna’s COVID-19 vaccine. In an e-mail obtained by PETA, the Office of Research Integrity of the U.S. Department of Health and Human Services told UW that while this did not constitute research fraud, UW could take “any administrative actions” internally. PETA, which alerted federal officials to the lie, is calling on UW to retract the statement publicly and to remove any individuals involved from their positions.", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/media/news-releases/university-of-washington-uw-made-knowingly-false-statement-about-primate-centers-role-in-covid-19-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "University of Washington (UW) Made ‘Knowingly False’ Statement About Primate Center’s Role in COVID-19 Vaccine", "cleaned_text": "PETA Demands That University Come Clean and Take Corrective Action\n\nSeattle – A federal agency says that an official with the University of Washington (UW) made “knowingly false” statements when she publicly claimed that monkey experiments at the Washington National Primate Research Center (WaNPRC) helped create Moderna’s COVID-19 vaccine. In an e-mail obtained by PETA, the Office of Research Integrity of the U.S. Department of Health and Human Services told UW that while this did not constitute research fraud, UW could take “any administrative actions” internally. PETA, which alerted federal officials to the lie, is calling on UW to retract the statement publicly and to remove any individuals involved from their positions.\n\nInternal documents from UW, obtained by PETA through a public records request, do not indicate that university officials have taken any action.\n\nLast November, PETA science adviser Lisa Jones-Engel, Ph.D., attended a public meeting of UW’s Institutional Animal Care and Use Committee, which oversees the use of animals in the university’s laboratories. As shows, the committee’s chair, Jane Sullivan, read a prepared statement saying that primate center experimenter Deborah Fuller tested the Moderna vaccine on monkeys. When Jones-Engel requested a clarification, Sullivan stated, “You can look at the minutes when the story is published.” She later added that Jones-Engel could e-mail her after the meeting. In a follow-up e-mail exchange, Sullivan admitted that the Moderna vaccine was unrelated to experiments at the WaNPRC.\n\n“If UW can openly lie about its role in the Moderna vaccine development, we must question the integrity of the entire institution,” says Dr. Jones-Engel. “It’s a serious violation of public trust, and UW must take action to correct it.”\n\nThe WaNPRC’s long history of negligence, errors, and incompetence has resulted in numerous citations for violations of the federal Animal Welfare Act. Infant monkeys have died from physical trauma after they were placed in new groups and not properly monitored. In 2019, when an experimenter insisted that a surgery begin, even though a monkey had not been fasted, the monkey vomited, choked, went into respiratory arrest, and died. In another incident, a monkey who was used in a painful procedure was given an opioid analgesic that had been diluted, likely resulting in inadequate pain relief. Monkeys at the primate center have died from strangulation, starvation, dehydration, and veterinary error.\n\nPETA has released video footage showing monkeys filmed by WaNPRC experimenters. It shows how monkeys live for years, sometimes decades, inside small metal cages barely bigger than their bodies.\n\nPETA—whose motto reads, in part, that “animals are not ours to experiment on”—opposes speciesism, which is a human-supremacist worldview. The group’s letter is available upon request. For more information, please visit PETA.org, click here, or follow the group on Twitter, Facebook, or Instagram.", "opengraph": {"article:published_time": "2021-02-25", "locale": "en_US", "type": "article", "title": "University of Washington (UW) Made ‘Knowingly False’ Statement About Primate Center’s Role in COVID-19 Vaccine | PETA", "description": "A federal agency says that an official with the University of Washington (UW) made “knowingly false” statements when she publicly claimed that monkey A federal agency says that an official with the University of Washington (UW) made “knowingly false” statements when she publicly claimed that monkey experiments at the Washington National Primate Research Center (WaNPRC) helped create Moderna’s COVID-19 vaccine. In an e-mail obtained by PETA, the Office of Research Integrity of the U.S. Department of Health and Human Services told UW that while this did not constitute research fraud, UW could take “any administrative actions” internally. PETA, which alerted federal officials to the lie, is calling on UW to retract the statement publicly and to remove any individuals involved from their positions.", "url": "https://www.peta.org/media/news-releases/university-of-washington-uw-made-knowingly-false-statement-about-primate-centers-role-in-covid-19-vaccine/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "image": "https://www.peta.org/wp-content/uploads/2015/04/peta-facebook-placeholder-new.jpg", "image:width": "1600", "image:height": "1006", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.peta.org/blog/university-washington-official-lies-covid-19-vaccine-research/", "https://vimeo.com/516472791/0365cd946d", "https://www.youtube.com/watch?v=vQmyKNsttUA&feature=emb_logo", "https://www.peta.org/", "https://headlines.peta.org/?page_id=13287&preview=1&_ppp=1a4e5c2600", "https://twitter.com/peta", "https://www.facebook.com/official.peta", "https://www.instagram.com/peta/?hl=en"], "authors": [], "publish_date": "2021-02-25"}