{"result_id": "240031", "URL": "https://headlines.peta.org/expert-warnings-covid-animal-experiments-limitations/", "timestamp": "2023-04-25 16:48:37 CEST+0200", "meta": {"description": "PETA is pushing the scientific community to invest in modern, animal-free research methods in the fight against COVID-19. Here's why.", "lang": "en", "keywords": "", "favicon": "https://headlines.peta.org/wp-content/uploads/2023/01/cropped-peta-favicon-32x32.png", "canonical": "https://headlines.peta.org/expert-warnings-covid-animal-experiments-limitations/", "encoding": "UTF-8"}, "image": null, "domain": "headlines.peta.org", "title": "Warnings From Experts on the Limitations of COVID-19 Experiments on Animals", "cleaned_text": "On the differences between species: “Both companies recognized that mRNA vaccines work very differently in animals compared to humans.”\n\n—Michael Erman and Julie Steenhuysen, Reuters, November 17, 2020, “How Two Companies Sprinted Ahead in Extraordinary Race for a COVID Vaccine”\n\n\n\n “We can’t really conclude that this vaccine is going to be better in practice until we have some reliable safety and efficacy data in [humans].”\n\n—Angela Rasmussen, a Columbia University virologist, commenting in Science, November 3, 2020, “Will a Small, Long-Shot U.S. Company End Up Producing the Best Coronavirus Vaccine?”\n\n\n\n “These results indicate the importance of using human lung cells to study the virus, the researchers say. ‘A lot of these [favorable hydroxychloroquine] studies that came out are sort of meaningless because they were done in the wrong cell [types from monkeys].’”\n\n—Tina Hesman Saey, quoting Katherine Seley-Radtke, a medicinal chemist at the University of Maryland–Baltimore County, who commented on hydroxychloroquine experiments using monkeys and monkey cells, Science News, August 2, 2020, “Hydroxychloroquine Can’t Stop COVID-19. It’s Time to Move On, Scientists Say”\n\n\n\n “Malcolm Martin, a virologist at the National Institutes of Health who was not involved in the study, cautioned that monkeys are different from humans in important ways. The unvaccinated monkeys in this study didn’t develop any of the severe symptoms that some [humans] get following a coronavirus infection. ‘It looks like they got a cold,’ Dr. Martin said.”\n\n—Carl Zimmer, The New York Times, May 20, 2020, “Prototype Vaccine Protects Monkeys From Coronavirus”\n\n\n\n One virus in, two viruses out: “Many of these vaccine studies will be done in monkeys eventually. It could be that in an individual monkey, the virus that you’ve given [him or her] adapts and changes and becomes a monkey version of the virus you gave [the animal] in the first place. So it means that not only do you need to check that the virus going into the monkeys is still a human virus, but also throughout the course of the vaccine study you’re going to need to check that the virus hasn’t mutated during your trial in each individual monkey. And it could again basically make a mess of your vaccine trial by creating anomalous results that you misinterpret as either the vaccine is working or it’s not working.”\n\n—David A. Matthews, a University of Bristol coronavirologist, commenting in Cambridge University’s The Naked Scientists, April 15, 2020, “Coronavirus Mutation Disrupts Vaccine Trials”\n\n\n\n “Our data emphasizes that the viral genome sequence should be carefully monitored during the growth of viral stocks for research, animal challenge models and, potentially, in clinical samples. Such variations may result in different levels of virulence, morbidity and mortality.”\n\n—David A. Matthews, a University of Bristol coronavirologist, and his team in a paper they authored on the pitfalls of using monkeys to evaluate human vaccines for COVID-19.\n\nDavidson, A.D., Williamson, M.K., Lewis, S. et al., “Characterisation of the Transcriptome and Proteome of SARS-CoV-2 Reveals a Cell Passage Induced In-Frame Deletion of the Furin-Like Cleavage Site From the Spike Glycoprotein.” Genome Medicine 12, 68 (2020).", "opengraph": {"locale": "en_US", "type": "article", "title": "Warnings From Experts on the Limitations of COVID-19 Experiments on Animals", "description": "PETA is pushing the scientific community to invest in modern, animal-free research methods in the fight against COVID-19. Here's why.", "url": "https://headlines.peta.org/expert-warnings-covid-animal-experiments-limitations/", "site_name": "PETA Headlines", "article:modified_time": "2023-01-30T21:40:56+00:00", "image": "https://headlines.peta.org/wp-content/uploads/2020/09/rhesus-macaque-covid-19-experiments-on-animals.jpg", "image:width": "1400", "image:height": "934", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reuters.com/article/health-coronavirus-pfizer-vaccine-insigh/how-two-companies-sprinted-ahead-in-extraordinary-race-for-a-covid-vaccine-idUSKBN27X25I", "https://www.sciencemag.org/news/2020/11/will-small-long-shot-us-company-end-producing-best-coronavirus-vaccine", "https://www.sciencenews.org/article/covid-19-coronavirus-hydroxychloroquine-no-evidence-treatment", "https://www.nytimes.com/2020/05/20/health/coronavirus-vaccine-harvard.html", "https://www.thenakedscientists.com/articles/interviews/coronavirus-mutation-disrupts-vaccine-trials", "https://genomemedicine.biomedcentral.com/articles/10.1186/s13073-020-00763-0"], "authors": [], "publish_date": null}