{"result_id": "240002", "URL": "https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/usda/", "timestamp": "2023-04-25 16:48:03 CEST+0200", "meta": {"description": "The AWA stipulates minimal standards for the treatment of animals in such facilities, but shockingly, it does not cover mice, rats, and birds.", "lang": "en", "keywords": "", "favicon": "https://www.peta.org/wp-content/themes/petaorg/assets/images/apple-touch-icon-180x180.png", "canonical": "https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/usda/", "encoding": "utf-8"}, "image": null, "domain": "www.peta.org", "title": "U.S. Department of Agriculture", "cleaned_text": "When an undercover investigation reveals that circus trainers are using bullhooks to beat baby elephants or that workers in an animal research laboratory are slamming cats into cages and denying veterinary care to dogs with worm infestations, abscessed teeth, and open, oozing sores, PETA files complaints with the U.S. Department of Agriculture (USDA). The USDA is the government agency responsible for the regulation of food safety, nutrition, agriculture, and natural resources as well as the enforcement of the Animal Welfare Act (AWA), the only federal law that governs the treatment of animals who are bred for commercial use (including dogs bred in puppy mills and rabbits bred for experimentation), used in public exhibitions (such as circuses and zoos), and experimented on in U.S. laboratories. The AWA stipulates minimal standards for the treatment of animals in such facilities, but shockingly, it does not cover mice, rats, and birds, who make up approximately 95 percent of all animals used in laboratories. Moreover, the AWA does not prohibit any experiment, no matter how painful, trivial, or duplicative. It allows animals to be burned, shocked, poisoned, paralyzed, starved, cut into, brain-damaged, decapitated, and killed. However, PETA helps ensure that the modicum of protection afforded to animals by the AWA is implemented—and that violators are penalized.\n\nThe USDA’s Animal and Plant Health Inspection Service (APHIS) is responsible for enforcing the AWA. APHIS licenses and registers animal businesses, such as circuses, breeders, and animal laboratories. While APHIS conducts annual inspections to ensure that facilities are adhering to the AWA and associated regulations, the USDA’s Office of Inspector General has repeatedly found that APHIS is not adequately inspecting facilities or enforcing the AWA. Currently, there are only about 100 USDA inspectors to oversee more than 9,000 facilities (1,200 of which are animal experimentation labs), and labs housing thousands of animals may be inspected in just one day. Furthermore, the USDA relies primarily on laboratories’ own Institutional Animal Care and Use Committees (IACUCs) to enforce the AWA locally. IACUCs are composed mainly of animal experimenters, and they approve 98 percent of the projects that are proposed.\n\nPETA’s involvement with the USDA extends beyond violations and enforcement of the AWA. APHIS is also charged with the regulation of veterinary vaccine production and testing. While these experiments are meant to save animals from disease, they end up killing millions of animals in the process because of the testing that the USDA requires.\n\nThe USDA’s Center for Veterinary Biologics (CVB) is charged with ensuring the safety and consistency of veterinary vaccines. Despite the great strides in science over the last 100 years, USDA batch potency regulations have changed very little since their introduction, and many vaccines continue to rely on old-fashioned, animal-intensive methods for vaccine testing.\n\nHowever, there have been some critical advances for a number of veterinary vaccines, and PETA has made tremendous efforts to ensure the greatest possible use of newer methods so that the lethal methods of the last century will be completely retired. Of the approximately 10 million animals used each year for vaccine and other biological batch control testing, 80 percent are used for quality control for each batch of vaccines and other biologics, making this area of animal use a priority for PETA’s scientists. PETA has published a paper highlighting some of the larger successes of the paradigm that it developed to encourage the adoption of novel, non-animal methods for vaccine testing and regularly corresponds with the CVB on vaccine issues as they relate to animal welfare.\n\nThe AWA states that the use of animals in experiments should be approved only when alternatives are not available, but some companies use thousands of hamsters for leptospirosis vaccine potency tests even though modern non-animal methods have been available from the CVB since 2006. When animals are used for leptospirosis vaccine tests, 40 hamsters are injected with the live bacteria that cause this disease. The experiments can last up to five weeks and cause hamsters to experience such painful conditions as blood poisoning and kidney damage before dying—all without pain relief.\n\nThe Colorado Serum Company, for example, has used more than 1,800 hamsters since 2006 in these painful and ultimately lethal tests. In 2010, PETA filed a complaint with the USDA calling for an investigation into the company’s persistence in continuing to experiment on hamsters rather than using the CVB-approved non-animal test.\n\nIn 2009, PETA wrote to the CVB asking that the USDA follow Europe’s example and adopt a non-animal in vitro test for the erysipelas vaccine. Erysipelothrix rhusiopathiae is a bacterium that typically infects pigs who are crammed together on factory farms and in other places where infectious diseases are common and spread rapidly. Erysipelas infection can cause fever, chronic arthritis, heart inflammation, painful skin lesions, and often death. Each batch of the erysipelas vaccine used at the time was tested by intentionally infecting pigs with the disease, causing immense suffering and, in some cases, death.\n\nPETA’s letters to the CVB pointed out that the in vitro enzyme-linked immunosorbent assay (ELISA) test adopted by the European Union (EU) is more humane, is more reliable than simply administering the vaccine and seeing whether or not the pigs die, and helps ensure vaccine consistency. The CVB agreed, and the agency announced in 2009 that it would permanently end the use of pigs in these experiments.\n\nIn 2004, the EU conducted a large-scale validation study of the in vitro ELISA test for Newcastle disease virus (NDV). While this non-animal test is being used in the EU, the U.S. still mandates that NDV vaccine testing be conducted on chickens. PETA encouraged the CVB to conduct a similar validation study of U.S. NDV vaccine manufacturers, only to be told by the CVB that in vitro tests are incompatible with U.S. NDV vaccines. Although the CVB allows individual NDV vaccine manufacturers to use the ELISA test, the agency does not mandate it, thus there is no guarantee that any company in the U.S. will use it. Furthermore, many NDV vaccine manufacturers have both U.S. and international status, leading to possible redundancy of potency testing on animals.\n\nTo shed light on what is happening with U.S. NDV vaccine manufacturers, PETA has submitted Freedom of Information Act requests to the USDA requesting information on these manufacturers’ use of animal and non-animal methods. Unfortunately, companies are allowed to censor this information on their reports to the USDA, and since birds are excluded from the AWA, companies are not required to report any information on the vaccine tests that are conducted on chickens.\n\nC. tetani is a bacterium found in the gastrointestinal tract of animals that causes tetanus, a painful condition that leads to muscle spasms, respiratory failure, and death. Several EU studies led to in vitro acceptance of in vivo potency tests for clostridial vaccines in the EU. In 2009, the CVB told PETA that it was taking steps to implement in vitro testing of clostridial antigens and working toward an ELISA-based potency test. However, PETA learned that this non-animal alternative would still involve antibody production that uses mice in a painful and lengthy procedure. To produce large quantities of an antibody, hybrid cells (cells fused together from both normal and tumor cells) are injected into the abdomen of mice where the cells multiply and produce antibody-filled fluid (ascites). This method is known as the “mouse ascites method” of antibody production.\n\nThis method is so painful to mice that it has been banned or restricted in Australia, Germany, Switzerland, the Netherlands, and the United Kingdom, and the National Institutes of Health and USDA both encourage the use of in vitro methods instead. In a 2010 letter to the CVB, PETA asked the agency to replace the use of the ascites method with available non-animal alternatives. The CVB informed PETA that the majority of its ascites-produced antibodies are stockpiles that, once exhausted, will be replaced using non-animal techniques. Because the CVB anticipates that not all antibodies will be easily produced using currently available non-animal approaches, PETA is staying on top of current technologies and continues to encourage the CVB to examine the most modern non-animal approaches for manufacturing specific antibodies.\n\nWhen vaccines are created using live viruses, there can be variations in the strength and safety of each batch of the vaccine. To test for these variations, particularly for veterinary vaccines, experimenters test the batches on the “target” animal—the species for whom the vaccine is intended. Called “target animal batch safety testing,” or TABST, these tests use up to 10 times the recommended dose for live vaccines and twice the normal dose for inactivated vaccines and can last up to 28 days. Large numbers of animals are used in these tests, which can result in significant pain and suffering.\n\nIn the 1990s, after questions arose about the scientific and ethical aspects of these tests, a study of TABST results was undertaken by the European Commission, which is responsible for the administration and implementation of EU regulations, including for drug and product safety. The result was a 2002 statement by the European Commission that TABST as a routine part of batch testing was no longer relevant to ensure safety. In 2005, a rule introduced in Europe took these findings into account and allowed companies to forgo TABST if they proved that their batches were reliable.\n\nIn a collaboration between PETA U.S. and PETA U.K., affiliate scientific researchers discovered that the U.K. government was not ensuring that companies were using the mechanism that allowed them to avoid animal testing and, in some cases, was even charging companies to waive the tests. PETA U.K. pursued the issue with ministers and officials, sending numerous letters and e-mails and holding two meetings with government officials. The government responded by eliminating the waiver fee and subsequently changing its policies to simplify the process for companies applying to waive the tests, thus ensuring that veterinary vaccine tests that can be avoided will no longer be approved.\n\nThe situation in the U.K. underscores the fact that regulatory acceptance of non-animal alternatives does not always mean that those alternatives will be used. In 2011, PETA U.S. and PETA U.K. scientists published a paper outlining a way to bridge the gap between the approval of non-animal batch potency tests by U.S. and U.K. regulatory bodies and the use of these tests by industry. The “bridging paradigm” proposed in the paper is an “information collection and dissemination matrix” that would hasten regulatory acceptance of non-animal testing methods (if they are not already accepted) and uptake of these methods by industry through a series of steps involving petitions to regulatory bodies, stakeholder alerts, media attention, and confirmation of the use of the non-animal method by manufacturers. The bridging paradigm has been successful in promoting and expanding the use of non-animal methods for batch potency testing of erysipelas, leptospirosis, and pertussis vaccines in the U.S. and veterinary vaccines in the U.K.\n\nAnother way in which PETA is working to reduce the number of animals used in TABST is by working directly with the International Cooperation on Harmonisation of Technical Requirements for Registration of Veterinary Medicinal Products (VICH), a trilateral (U.S.-E.U.-Japan) program aimed at harmonizing requirements for veterinary product registration to reduce duplicative animal tests. In preparation for a VICH meeting in November 2011, PETA wrote to the head of VICH to ensure that the program prioritized the development of harmonized guidelines for rabies vaccine tests that enable the use of in vitro and other non-animal test methods and that the Steering Committee kept PETA apprised of the development of draft guidelines for in vitro extraneous agent testing of avian viral vaccines.\n\nClick here for more information about PETA’s efforts to ensure that federal government agencies are developing and using non-animal testing methods to the fullest extent.\n\nClick here to help support PETA’s efforts to fund alternatives to cruel and archaic animal tests.", "opengraph": {"article:published_time": "2012-06-19", "locale": "en_US", "type": "article", "title": "U.S. Department of Agriculture | PETA", "description": "The AWA stipulates minimal standards for the treatment of animals in such facilities, but shockingly, it does not cover mice, rats, and birds.", "url": "https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/usda/", "site_name": "PETA", "article:publisher": "https://www.facebook.com/officialpeta", "article:modified_time": "2021-06-17T18:08:39+00:00", "image": "https://www.peta.org/wp-content/uploads/2015/04/peta-facebook-placeholder-new.jpg", "image:width": "1600", "image:height": "1006", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.peta.org/features/professional-laboratory-research-services/", "https://www.peta.org/features/unc-awa/", "http://www.aphis.usda.gov/animal_welfare/index.shtml", "http://www.usda.gov/oig/webdocs/33002-03-SF.pdf", "https://www.aphis.usda.gov/aphis/ourfocus/animalhealth/veterinary-biologics/sa_about_vb", "https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/food-drug-administration/", "http://www.mdpi.com/2076-2615/1/4/414/", "https://www.peta.org/blog/company-kills-hamsters-peta-takes-action/", "http://eastdenver.kdvr.com/content/peta-alleges-denver-testing-lab-killing-animals-violation-federal-law", "https://www.peta.org/wp-content/uploads/2018/11/USDA-erysipelas-letter-FINAL.pdf", "https://www.peta.org/issues/animals-used-for-food/pigs/", "https://www.peta.org/wp-content/uploads/2018/11/Jeff-CVB-pigs-and-mice.pdf", "https://www.peta.org/wp-content/uploads/2021/06/CVB-Hill-Jr-NDV-and-SAMs-FINAL.pdf", "http://altweb.jhsph.edu/mabs/mabs.html", "https://www.peta.org/wp-content/uploads/2021/06/CVB-Hill-clostridial-vaccines-and-ascites-FINAL.pdf", "http://blog.peta.org.uk/2010/07/peta-gets-government-to-do-its-job/", "http://bit.ly/MdsUXz", "http://www.mdpi.com/2076-2615/1/4/414/pdf", "https://www.peta.org/wp-content/uploads/2021/06/VICH-SC-rabies-TABST-EA-11_2011.pdf", "https://www.peta.org/issues/animals-used-for-experimentation/us-government-animal-testing-programs/", "https://support.peta.org/page/2183/donate/1?supporter.appealCode=IXXXWBXXXXV.html&set.custom.Campaign_Code=I12FWDXXXXG&autologin=true"], "authors": [], "publish_date": "2012-06-19"}