{"result_id": "241037", "URL": "https://philosophers-stone.info/2023/02/07/could-the-covid-vaccines-cause-demonic-possession/", "timestamp": "2023-04-25 16:49:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://philosophers-stone.info/2023/02/07/could-the-covid-vaccines-cause-demonic-possession/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "COULD THE COVID VACCINES CAUSE DEMONIC POSSESSION? – Philosophers Stone", "cleaned_text": "The idea that a secret cabal of elite is brainwashing and mocking the masses via esoteric messages and predictive programming in entertainment has gained more traction over the years due to more people discovering the existence of secret societies. Recently, I watched the movie ‘The Invasion’ which might contain such messages. The movie has some coincidences related to the COVID vaccines and I thought it was worth writing an article about them. The movie is based on an infectious fungus that gets unleashed on Earth from a crashing space shuttle and the people who get infected become possessed by an alien force, leading them to become mind-controlled and to attempt to infect others with the fungus. It’s basically the same premise as the Body Snatchers, the famous 1954 movie produced by Walter Wanger. One of the characters that gets infected early on is Tucker Kaufman, a CDC director — who once becomes infected, hurriedly develops a vaccine and slips the fungus into it, so he can infect as many people as possible. So, millions of people that line up to get their vaccines get infected by the fungus and become possessed by the mysterious alien force. Horrible, right?\n\nOne of the scientists discovers that the fungus (which they slipped into the vaccines) can change the host’s genetic expression, saying: “What we’re dealing with is a complete intelligent entity that’s invading people’s bodies, integrating with their DNA and reprogramming their genetic expression”. This is where some coincidences start to arise. In this movie, people are receiving vaccines that were rushed out and didn’t undergo proper trials (similar to the COVID vaccines) with the alien fungus in that can reprogram their genetic expression. Well, coincidentally, some researchers have warned that the COVID vaccines are reprogramming our genetic makeup. Molecular biologist, Andrew Kaufman, says that the COVID vaccines will genetically change us. In this video,1 Kaufman talks about how the COVID vaccine will provide a vessel to “inject genes” into humans, by a procedure known as “electroporation”, in which an electric current “create holes in our cells that allow the DNA to go into our cells”, and by the end of the process he says it will end up changing our genetic makeup.\n\nHere’s where the rabbit hole gets darker. As mentioned above, the vaccines in the movie not only genetically change people, but possess them, leading them to become mind-controlled. Well, coincidentally, when we apply the backwards syntax of Biblical Hebrew, the word COVID becomes DIVOC, which is apparently Hebrew word meaning “possession by an evil spirit”. Translated into English, DIVOC becomes “dybbuk”. According to Yoram Bilu, a professor of anthropology and sociology at the Hebrew University of Jerusalem, dybbuk describes a demonic spirit responsible for possession, saying: “The term dybbuk was used in mystical circles to designate a spirit of the dead that took possession of a person. Dybbuk possession was always conceived as an affliction or an illness and the possessing agent had to be expelled”. So, to recap, in this movie, vaccines that were rushed out and didn’t undergo proper trials can genetically change people and leads to possession. Well, some researchers say that the COVID vaccines, which were rushed out, will genetically change us, and when we apply the backwards syntax of Biblical Hebrew, the word COVID apparently becomes “possession by an evil spirit”.\n\nBilu points out that “dybbuk possession left the victim as a passive object, bereft of self-awareness and without self-control vis-à-vis external authorities” (which, incidentally, sounds somewhat like autism). Meanwhile, Bogdan Herzog (author of the article referenced above) says that “dybbuks seem to target mainly women and children and “emotional intensification or arousal” are prerequisites for possession”. Dybbuks share similar characteristics to the Gnostic Archons which are described as inorganic beings that seek to keep humanity trapped in the material realm. In Gnosticism, the Archons are demonic rulers over the material realm. They are an ancient race of demons who have apparently hijacked our perception of reality in the manner of The Matrix. They possess us, incite wars, and beget misery. Some have described the Archons as “attached para-spiritual parasites”. Given the misanthropic and malevolent way that many politicians and world-leaders behave in our world today, is it so outlandish to believe that some of them could be possessed by actual demons?\n\nPersonally, I believe that demonic possession is possible and resist reducing it to a psychological or biological categorization. In March 2013, an article appeared by investigative journalist, Sola Ogundipe, in which she said: “A disease condition known as “anti-NMDA receptor encephalitis” that exhibits symptoms similar to demonic possession is increasingly striking women in the United States. Teresa Conrick explains how a 2011 study (Caroline Hofmann et al 2011) identified a link between the condition and vaccines. Symptoms of anti-NMDA receptor encephalitis were observed to appear not long after children received their routine vaccinations, suggesting a connection”. Demonic possession caused by vaccines goes hand-in-hand with spiritual disconnection, which is something Rudolf Steiner warned about (in a quote that has been much circulated over the last year, so many reading this could already be familiar with it): “Children will be vaccinated with a substance which it will certainly be possible to produce, and this will make them immune, so they do not develop foolish inclinations connected with spiritual life — ‘foolish’ here, of course in the eyes of materialists”.\n\nOne of the most well-known disorders claimed to be caused by vaccines (specifically the MMR vaccine) is autism which is now very common with about 1 in 40 children identified as autistic. According to Allal Ouhtit et al (2015):2 “In the Omani community, emotional and cognitive impairments like autism are usually perceived as a manifestation of possession by demonic spirits or supernatural forces, such as hassad (contemptuous envy), sihr (sorcery) or the “evil eye”. The societal perception of children with autism is often akin to “madness” or demonic possession”. According to a review on the history of ideas surrounding autism, a child with symptoms akin to autism was previously perceived as a “possessed soulless mass of flesh”. Sarah Cromwell posits: “The process that’s going on inside the autistic child caused by vaccines is that the child’s soul is prevented from having full control of its own body. This allows the body to be inhabited by different low-vibrational spirits making him or her, in effect, an unwilling trance medium. There are varying degrees of autism, so perhaps this is reflected in varying degrees of psychic influence over the child and may also explain ADHD”.\n\nThe idea that people could be possessed by demons existed in many parts of the ancient world and in many societies. This belief would continue through the Middle Ages, Renaissance Europe, and until the time of the Salem, and Massachusetts. Interestingly, vaccines have been associated with possession before, and so this is not just a loose connection to a movie. In the book ‘Annual Report Upon Vaccination in the N.W. Provinces’, it descibes how vaccines can cause “serious and dangerous symptoms”. When these serious and dangerous symptoms would arise, the parents of a child would sometimes “send for the inoculator who administered various heating and cooling medicines, as the case required; should these fail, a goat was procured, and the evil spirt which is supposed to have taken possession of the child was, by the process of the “jaru”, transferred from the child to the goat”. Could vaccination be the prerequisite for possession by a dybbuk? By the act of vaccination, could the vaccine-injured possibly lose self-control vis-à-vis external authorities and accept unprecedented circumscriptions on their freedoms?\n\n1 BitChute: Andrew Kaufman: They Want to Genetically Modify us With The COVID-19 Vaccine\n\n2 Underlying Factors Behind the Low Prevalence of Autism Spectrum Disorders in Oman", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://chipstero7.wordpress.com/2022/01/06/only-a-coincidence-short-article/", "https://www.freaklore.com/archons-are-attached-para-spiritual-parasites", "https://www.vanguardngr.com/2013/03/mysterious-disease-with-symptoms-of-demonic-possession-striking-young-women/", "https://paam.wildapricot.org/resources/Pictures/07%20RS-Traditional%20Childhood%20Illnesses%20and%20Vaccines.pdf", "https://journals.sagepub.com/doi/abs/10.1177/1362361397011004", "https://chipstero7.wordpress.com/2022/01/06/only-a-coincidence-short-article/", "https://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "https://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "https://philosophers-stone.info/2021/01/09/excerpt-from-2009-corbett-report-101-study-finds-link-between-h1n1-and-flu-shots/", "https://philosophers-stone.info/2020/07/08/awan-minutes-to-midnight-finding-hillarys-blackberries-and-everything-after/", "https://philosophers-stone.info/2022/02/17/pfizergate-scandal-the-worldwide-cover-up-of-data-to-disguise-the-fact-covid-19-vaccines-cause-vaids/", "https://philosophers-stone.info/2020/12/09/palantirs-tiberius-race-and-the-public-health-panopticon/", "https://philosophers-stone.info/2022/03/05/the-hidden-history-of-the-incredibly-evil-khazarian-mafia/", "https://philosophers-stone.info/2020/10/22/misinterpretation-virus-ii-beginning-and-end-of-the-corona-crisis/"], "authors": [], "publish_date": "7 February 2023"}