{"result_id": "241018", "URL": "http://philosophers-stone.info/2021/05/11/57-top-scientists-and-doctors-release-shocking-study-on-covid-vaccines-and-demand-immediate-stop-to-all-vaccinations/", "timestamp": "2023-04-25 16:49:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://philosophers-stone.info/2021/05/11/57-top-scientists-and-doctors-release-shocking-study-on-covid-vaccines-and-demand-immediate-stop-to-all-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "57 Top Scientists And Doctors Release Shocking Study On COVID Vaccines And Demand Immediate Stop to ALL Vaccinations – Philosophers Stone", "cleaned_text": "A group of 57 leading scientists, doctors and policy experts has released a report calling in to question the safety and efficacy of the current COVID-19 vaccines and are now calling for an immediate end to all vaccine programs. We urge you to read and share this damning report.\n\nThere are two certainties regarding the global distribution of Covid-19 vaccines. The first is that governments and the vast majority of the mainstream media are pushing with all their might to get these experimental drugs into as many people as possible. The second is that those who are willing to face the scorn that comes with asking serious questions about vaccines are critical players in our ongoing effort to spread the truth.\n\nYou can read an advanced copy of this manuscript in preprint below. It has been prepared by nearly five dozen highly respected doctors, scientists, and public policy experts from across the globe to be urgently sent to world leaders as well as all who are associated with the production and distribution of the various Covid-19 vaccines in circulation today.\n\nThere are still far too many unanswered questions regarding the Covid-19 vaccines’ safety, efficacy, and necessity. This study is a bombshell that should be heard by everyone, regardless of their views on vaccines. There aren’t nearly enough citizens who are asking questions. Most people simply follow the orders of world governments, as if they have earned our complete trust. They haven’t done so. This manuscript is a step forward in terms of accountability and the free flow of information on this crucial subject. Please take the time to read it and share it widely.\n\nSARS-CoV-2 mass vaccination: Urgent questions on vaccine safety that demand answers from international health agencies, regulatory authorities, governments and vaccine developers\n\n1Epidemiólogos Argentinos Metadisciplinarios. República Argentina.\n\n2Baylor University Medical Center. Dallas, Texas, USA.\n\n3Monestir de Sant Benet de Montserrat, Montserrat, Spain\n\n4INSERM U781 Hôpital Necker-Enfants Malades, Université Paris Descartes-Sorbonne Cité, Institut Imagine, Paris, France.\n\n5School of Natural Sciences. Autonomous University of Querétaro, Querétaro, Mexico.\n\n6Retired Professor of Medical Immunology. Universidad de Guadalajara, Jalisco, Mexico.\n\n7Médicos por la Verdad Puerto Rico. Ashford Medical Center. San Juan, Puerto Rico.\n\n8Retired Professor of Clinical Diagnostic Processes. University of Murcia, Murcia, Spain\n\n9Urologist Hospital Comarcal de Monforte, University of Santiago de Compostela, Spain.\n\n10Biólogos por la Verdad, Spain.\n\n11Retired Biologist. University of Barcelona. Specialized in Microbiology. Barcelona, Spain.\n\n12Center for Integrative Medicine MICAEL (Medicina Integrativa Centro Antroposófico Educando en Libertad). Mendoza, República Argentina.\n\n13Médicos por la Verdad Argentina. República Argentina. ´\n\n14Médicos por la Verdad Uruguay. República Oriental del Uruguay.\n\n15Médicos por la Libertad Chile. República de Chile.\n\n16Physician, orthopedic specialist. República de Chile.\n\n17Médicos por la Verdad Perú. República del Perú.\n\n18Médicos por la Verdad Guatemala. República de Guatemala.\n\n19Concepto Azul S.A. Ecuador.\n\n20Médicos por la Verdad Brasil. Brasil.\n\n21Médicos por la Verdad Paraguay.\n\n22Médicos por la Costa Rica.\n\n23Médicos por la Verdad Bolivia.\n\n24Médicos por la Verdad El Salvador.\n\n* Correspondence: Karina Acevedo-Whitehouse, karina.acevedo.whitehouse@uaq.mx\n\nSince the start of the COVID-19 outbreak, the race for testing new platforms designed to confer immunity against SARS-CoV-2, has been rampant and unprecedented, leading to emergency authorization of various vaccines. Despite progress on early multidrug therapy for COVID-19 patients, the current mandate is to immunize the world population as quickly as possible. The lack of thorough testing in animals prior to clinical trials, and authorization based on safety data generated during trials that lasted less than 3.5 months, raise questions regarding the safety of these vaccines. The recently identified role of SARS-CoV-2 glycoprotein Spike for inducing endothelial damage characteristic of COVID-19, even in absence of infection, is extremely relevant given that most of the authorized vaccines induce the production of Spike glycoprotein in the recipients. Given the high rate of occurrence of adverse effects, and the wide range of types of adverse effects that have been reported to date, as well as the potential for vaccine-driven disease enhancement, Th2-immunopathology, autoimmunity, and immune evasion, there is a need for a better understanding of the benefits and risks of mass vaccination, particularly in the groups that were excluded in the clinical trials. Despite calls for caution, the risks of SARS-CoV-2 vaccination have been minimized or ignored by health organizations and government authorities. We appeal to the need for a pluralistic dialogue in the context of health policies, emphasizing critical questions that require urgent answers if we wish to avoid a global erosion of public confidence in science and public health.\n\nSince COVID-19 was declared a pandemic in March 2020, over 150 million cases and 3 million deaths have been reported worldwide. Despite progress on early ambulatory, multidrug-therapy for high-risk patients, resulting in 85% reductions in COVID-19 hospitalization and death [1], the current paradigm for control is mass-vaccination. While we recognize the effort involved in development, production and emergency authorization of SARS-CoV-2 vaccines, we are concerned that risks have been minimized or ignored by health organizations and government authorities, despite calls for caution [2-8].\n\nVaccines for other coronaviruses have never been approved for humans, and data generated in the development of coronavirus vaccines designed to elicit neutralizing antibodies show that they may worsen COVID-19 disease via antibody-dependent enhancement (ADE) and Th2 immunopathology, regardless of the vaccine platform and delivery method [9-11]. Vaccine-driven disease enhancement in animals vaccinated against SARS-CoV and MERS-CoV is known to occur following viral challenge, and has been attributed to immune complexes and Fc-mediated viral capture by macrophages, which augment T-cell activation and inflammation [11-13].\n\nIn March 2020, vaccine immunologists and coronavirus experts assessed SARS-CoV-2 vaccine risks based on SARS-CoV-vaccine trials in animal models. The expert group concluded that ADE and immunopathology were a real concern, but stated that their risk was insufficient to delay clinical trials, although continued monitoring would be necessary [14]. While there is no clear evidence of the occurrence of ADE and vaccine-related immunopathology in volunteers immunized with SARS-CoV-2 vaccines [15], safety trials to date have not specifically addressed these serious adverse effects (SAE). Given that the follow-up of volunteers did not exceed 2-3.5 months after the second dose [16-19], it is unlikely such SAE would have been observed. Despite92 errors in reporting, it cannot be ignored that even accounting for the number of vaccines administered, according to the US Vaccine Adverse Effect Reporting System (VAERS), the number of deaths per million vaccine doses administered has increased more than 10-fold. We believe there is an urgent need for open scientific dialogue on vaccine safety in the context of large-scale immunization. In this paper, we describe some of the risks of mass vaccination in the context of phase 3 trial exclusion criteria and discuss the SAE reported in national and regional adverse effect registration systems. We highlight unanswered questions and draw attention to the need for a more cautious approach to mass vaccination.\n\nWith few exceptions, SARS-CoV-2 vaccine trials excluded the elderly [16-19], making it impossible to identify the occurrence of post-vaccination eosinophilia and enhanced inflammation in elderly people. Studies of SARS-CoV vaccines showed that immunized elderly mice were at particularly high risk of life-threatening Th2 immunopathology [9,20]. Despite this evidence and the extremely limited data on safety and efficacy of SARS-CoV-2 vaccines in the elderly, mass-vaccination campaigns have focused on this age group from the start. Most trials also excluded pregnant and lactating volunteers, as well as those with chronic and serious conditions such as tuberculosis, hepatitis C, autoimmunity, coagulopathies, cancer, and immune suppression [16-29], although these recipients are now being offered the vaccine under the premise of safety.\n\nAnother criterion for exclusion from nearly all trials was prior exposure to SARS-CoV-2. This is unfortunate as it denied the opportunity of obtaining extremely relevant information concerning post-vaccination ADE in people that already have anti-SARS-Cov-2 antibodies. To the best of our knowledge, ADE is not being monitored systematically for any age or medical condition group currently being administered the vaccine. Moreover, despite a substantial proportion of the population already having antibodies [21], tests to determine SARS-CoV-2-antibody status prior to administration of the vaccine are not conducted routinely.\n\nWill serious adverse effects from the SARS-CoV-2 vaccines go unnoticed?\n\nCOVID-19 encompasses a wide clinical spectrum, ranging from very mild to severe pulmonary pathology and fatal multi-organ disease with inflammatory, cardiovascular, and blood coagulation dysregulation [22-24]. In this sense, cases of vaccine-related ADE or immunopathology would be clinically-indistinguishable from severe COVID-19 [25]. Furthermore, even in the absence of SARS-CoV-2 virus, Spike glycoprotein alone causes endothelial damage and hypertension in vitro and in vivo in Syrian hamsters by down-regulating angiotensin-converting enzyme 2 (ACE2) and impairing mitochondrial function [26]. Although these findings need to be confirmed in humans, the implications of this finding are staggering, as all vaccines authorized for emergency use are based on the delivery or induction of Spike glycoprotein synthesis. In the case of mRNA vaccines and adenovirus-vectorized vaccines, not a single study has examined the duration of Spike production in humans following vaccination. Under the cautionary principle, it is parsimonious to consider vaccine-induced Spike synthesis could cause clinical signs of severe COVID-19, and erroneously be counted as new cases of SARS-CoV-2 infections. If so, the true adverse effects of the current global vaccination strategy may never be recognized unless studies specifically examine this question. There is already non-causal evidence of temporary or sustained increases138 in COVID-19 deaths following vaccination in some countries (Fig. 1) and in light of Spike’s pathogenicity, these deaths must be studied in depth to determine whether they are related to vaccination.\n\nAnother critical issue to consider given the global scale of SARS-CoV-2 vaccination is autoimmunity. SARS-CoV-2 has numerous immunogenic proteins, and all but one of its immunogenic epitopes have similarities to human proteins [27]. These may act as a source of antigens, leading to autoimmunity [28]. While it is true that the same effects could be observed during natural infection with SARS-CoV-2, vaccination is intended for most of the world population, while it is estimated that only 10% of the world population has been infected by SARS-CoV-2, according to Dr. Michael Ryan, head of emergencies at the World Health Organization. We have been unable to find evidence that any of the currently authorized vaccines screened and excluded homologous immunogenic epitopes to avoid potential autoimmunity due to pathogenic priming.\n\nSome adverse reactions, including blood-clotting disorders, have already been reported in healthy and young vaccinated people. These cases led to the suspension or cancellation of the use of adenoviral vectorized ChAdOx1-nCov-19 and Janssen vaccinesin some countries. It has now been proposed that vaccination with ChAdOx1-nCov-19 can result in immune thrombotic thrombocytopenia (VITT) mediated by platelet-activating antibodies against Platelet factor-4, which clinically mimics autoimmune heparin-induced thrombocytopenia [29]. Unfortunately, the risk was overlooked when authorizing these vaccines, although adenovirus-induced thrombocytopenia has been known for more than a decade, and has been a consistent event with adenoviral vectors [30]. The risk of VITT would presumably be higher in those already at risk of blood clots, including women who use oral contraceptives [31], making it imperative for clinicians to advise their patients accordingly.\n\nAt the population level, there could also be vaccine-related impacts. SARS-CoV-2 is a fast-evolving RNA virus that has so far produced more than 40,000 variants [32,33] some of which affect the antigenic domain of Spike glycoprotein [34,35]. Given the high mutation rates, vaccine-induced synthesis of high levels of anti-SARS-CoV-2-Spike antibodies could theoretically lead to suboptimal responses against subsequent infections by other variants in vaccinated individuals [36], a phenomenon known as “original antigenic sin” [37] or antigenic priming [38]. It is unknown to what extent mutations that affect SARS-CoV-2 antigenicity will become fixed during viral evolution [39], but vaccines could plausibly act as selective forces driving variants with higher infectivity or transmissibility. Considering the high similarity between known SARS-CoV-2 variants, this scenario is unlikely [32,34] but if future variants were to differ more in key epitopes, the global vaccination strategy might have helped shape an even more dangerous virus. This risk has recently been brought to the attention of the WHO as an open letter [40].\n\nThe risks outlined here are a major obstacle to continuing global SARS-CoV-2 vaccination. Evidence on the safety of all SARS-CoV-2 vaccines is needed before exposing more people to the184 risk of these experiments, since releasing a candidate vaccine without time to fully understand the resulting impact on health could lead to an exacerbation of the current global crisis [41]. Risk-stratification of vaccine recipients is essential. According to the UK government, people below 60 years of age have an extremely low risk of dying from COVID-191 187 . However, according to Eudravigillance, most of the serious adverse effects following SARS-CoV-2 vaccination occur in people aged 18-64. Of particular concern is the planned vaccination schedule for children aged 6 years and older in the United States and the UK. Dr. Anthony Fauci recently anticipated that teenagers across the country will be vaccinated in the autumn and younger children in early 2022, and the UK is awaiting trial results to commence vaccination of 11 million children under 18. There is a lack of scientific justification for subjecting healthy children to experimental vaccines, given that the Centers for Disease Control and Prevention estimates that they have a 99.997% survival rate if infected with SARS-CoV-2. Not only is COVID-19 irrelevant as a threat to this age group, but there is no reliable evidence to support vaccine efficacy or effectiveness in this population or to rule out harmful side effects of these experimental vaccines. In this sense, when physicians advise patients on the elective administration of COVID-19 vaccination, there is a great need to better understand the benefits and risk of administration, particularly in understudied groups.\n\nIn conclusion, in the context of the rushed emergency-use-authorization of SARS-CoV-2 vaccines, and the current gaps in our understanding of their safety, the following questions must be raised:\n• Is it known whether cross-reactive antibodies from previous coronavirus infections or vaccine206 induced antibodies may influence the risk of unintended pathogenesis following vaccination with COVID-19?\n• Has the specific risk of ADE, immunopathology, autoimmunity, and serious adverse reactions been clearly disclosed to vaccine recipients to meet the medical ethics standard of patient understanding for informed consent? If not, what are the reasons, and how could it be implemented?\n• What is the rationale for administering the vaccine to every individual when the risk of dying from COVID-19 is not equal across age groups and clinical conditions and when the phase 3 trials excluded the elderly, children and frequent specific conditions?\n• What are the legal rights of patients if they are harmed by a SARS-CoV-2 vaccine? Who will cover the costs of medical treatment? If claims were to be settled with public money, has the public been made aware that the vaccine manufacturers have been granted immunity, and their responsibility to compensate those harmed by the vaccine has been transferred to the tax-payers?\n\nIn the context of these concerns, we propose halting mass-vaccination and opening an urgent pluralistic, critical, and scientifically-based dialogue on SARS-CoV-2 vaccination among scientists, medical doctors, international health agencies, regulatory authorities, governments, and vaccine developers. This is the only way to bridge the current gap between scientific evidence and public health policy regarding the SARS-CoV-2 vaccines. We are convinced that humanity deserves a deeper understanding of the risks than what is currently touted as the official position. An open scientific dialogue is urgent and indispensable to avoid erosion of public confidence in science and public health and to ensure that the WHO and national health authorities protect the interests of humanity during the current pandemic. Returning public health policy to evidence-based medicine, relying on a careful evaluation of the relevant scientific research, is urgent. It is imperative to follow the science.\n\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\n• Arvin AM, Fink K, Schmid MA, et al. A perspective on potential antibody- dependent enhancement of SARS-CoV-2. Nature (2020) 484:353–363. doi:10.1038/s41586-020-2538-8\n• Coish JM, MacNeil AJ. Out of the frying pan and into the fire? Due diligence warranted for ADE in COVID-19. Microbes Infect (2020) 22(9):405-406. doi:10.1016/j.micinf.2020.06.006\n• Eroshenko N, Gill T, Keaveney ML, et al. Implications of antibody-dependent enhancement of infection for SARS-CoV-2 countermeasures. Nature Biotechnol (2020) 38:788–797. doi:10.1038/s41587-020-0577-1\n• Shibo J. Don’t rush to deploy COVID-19 vaccines and drugs without sufficient safety guarantees. Nature (2000) 579,321. doi:10.1038/d41586-020-00751-9\n• Munoz FA, Cramer JP, Dekker CL, et al. Vaccine-associated enhanced disease: Case definition and guidelines for data collection, analysis, and presentation of immunization safety data. Vaccine (2021) https://doi.org/10.1016/j.vaccine.2021.01.055\n• Cardozo T, Veazey R. Informed consent disclosure to vaccine trial subjects of risk of COVID-19 vaccines worsening clinical disease. Int J Clin Pract (2020) 28:e13795. doi: 10.1111/ijcp.13795\n• Bolles D, Long K, Adnihothram S, et al. A double-inactivated severe acute respiratory syndrome coronavirus vaccine provides incomplete protection in mice and induces increased eosinophilic proinflammatory pulmonary response upon challenge. J Virol (2001) 85:12201–12215. doi:10.1128/JVI.06048-11\n• Weingartl H, Czub M, Czub S, et al. Immunization with modified vaccinia virus Ankarabased recombinant vaccine against severe acute respiratory syndrome is associated with enhanced hepatitis in ferrets. J Virol (2004) 78:12672–12676. doi:10.1128/JVI.78.22.12672-12676.2004272\n• Tseng CT, Sbrana E, Iwata-Yoshikawa N, et al. Immunization with SARS coronavirus vaccines leads to pulmonary immunopathology on challenge with the SARS virus. PLoS One (2012) 7(4):e35421. doi: 10.1371/journal.pone.0035421\n• Iwasaki A, Yang Y. The potential danger of suboptimal antibody responses in COVID-19. Nat Rev Immunol (2020) 20:339–341. doi:10.1038/s41577-020-0321-6\n• Vennema H, de Groot RJ, Harbour DA, et al. Early death after feline infectious peritonitis virus challenge due to recombinant vaccinia virus immunization. J Virol (1990) 64:1407-1409\n• Lambert PH, Ambrosino DM, Andersen SR, et al. Consensus summary report for CEPI/BC March 12-13, 2020 meeting: Assessment of risk of disease enhancement with COVID-19 vaccines. Vaccine (2020) 38(31):4783-4791. doi:10.1016/j.vaccine.2020.05.064\n• de Alwis R, Chen S, Gan S, et al. Impact of immune enhancement on Covid-19 polyclonal hyperimmune globulin therapy and vaccine development. EbioMedicine (2020) 55:102768. doi:10.1016/j.ebiom.2020.102768\n• Folegatti PM, Ewer KJ, Aley PK, et al. Safety and immunogenicity of the ChAdOx1 nCoV287 19 vaccine against SARS-CoV-2: a preliminary report of a phase 1/2, single-blind, randomised controlled trial. Lancet (2020) 396:467–783. doi:10.1016/S0140-6736(20)31604-4\n• Polack FP, Thomas SJ, Kitchin N. Safety and efficacy of the BNT162b2 mRNA Covid-19 vaccine. N Engl J Med (2020) 383:2603–2615. doi:10.1056/NEJMoa2034577\n• Ramasamy MN, Minassian AM, Ewer KJ, et al. Safety and immunogenicity of ChAdOx1 nCoV-19 vaccine administered in a prime-boost regimen in young and old adults (COV002): a single-blind, randomised, controlled, phase 2/3 trial. Lancet (2021) 396:1979–93. doi: 10.1016/S0140-6736(20)32466-1\n• Chu L, McPhee R, Huang W, et al. mRNA-1273 Study Group. A preliminary report of a randomized controlled phase 2 trial of the safety and immunogenicity of mRNA-1273 SARS-CoV-2 vaccine. Vaccine (2021) S0264-410X(21)00153-5. doi:10.1016/j.vaccine.2021.02.007\n• Liu L, Wei Q, Lin Q, et al. Anti-spike IgG causes severe acute lung injury by skewing macrophage responses during acute SARS-CoV infection. JCI Insight (2019) 4(4):e123158. doi:10.1172/jci.insight.123158.\n• Ioannidis PA. Infection fatality rate of COVID-19 inferred from seroprevalence data. Bull WHO (2021) 99:19–33F. http://dx.doi.org/10.2471/BLT.20.265892\n• Martines RB, Ritter JM, Matkovic E, et al. Pathology and Pathogenesis of SARS-CoV-2 Associated with Fatal Coronavirus Disease, United States Emerg Infect Dis (2020) 26:2005-2015. doi:10.3201/eid2609.202095\n• Wu Z, McGoogan JM. Characteristics of and Important Lessons From the Coronavirus Disease 2019 (COVID-19) Outbreak in China: Summary of a Report of 72 314 Cases From the Chinese Center for Disease Control and Prevention. JAMA (2020) 323:1239-1242. doi:10.1001/jama.2020.2648\n• Xu Z, Shi L, Wang Y, et al. Pathological findings of COVID-19 associated with acute respiratory distress syndrome. Lancet Respiratory Med (2020) 8:420-422 doi:10.1016/S2213-2600(20)30076-X\n• Lei Y, Zhang J, Schiavon CR et al., Spike Protein Impairs Endothelial Function via Downregulation of ACE 2. Circulation Res (2021) 128:1323–1326. https://doi.org/10.1161/CIRCRESAHA.121.318902\n• Lyons-Weiler J. Pathogenic priming likely contributes to serious and critical illness and mortality in COVID-19 via autoimmunity, J Translational Autoimmunity (2020) 3:100051. doi:10.1016/j.jtauto.2020.100051\n• An H, Park J. Molecular Mimicry Map (3M) of SARS-CoV-2: Prediction of potentially immunopathogenic SARS-CoV-2 epitopes via a novel immunoinformatic approach. bioRxiv [Preprint]. 12 November 2020 [cited 2020 April 19] https://doi.org/10.1101/2020.11.12.344424\n• Othman M, Labelle A, Mazzetti I et al. Adenovirus-induced thrombocytopenia: the role of von Willebrand factor and P-selectin in mediating accelerated platelet clearance. Blood (2007) 109:2832–2839. doi:10.1182/blood-2006-06-032524\n• Grubaugh ND, Petrone ME, Holmes EC. We shouldn’t worry when a virus mutates during disease outbreaks. Nat Microbiol (2020) 5:529–530. https://doi.org/10.1038/s41564-020-0690-4\n• Greaney AJ, Starr TN, Gilchuk P, et al. Complete Mapping of Mutations to the SARS-CoV339 2 Spike Receptor-Binding Domain that Escape Antibody Recognition. Cell Host Microbe (2021) 29:44–57.e9. doi:10.1016/j.chom.2020.11.007.\n• Lauring AS, Hodcroft EB. Genetic Variants of SARS-CoV-2—What Do They Mean? JAMA (2021) 325:529–531. doi:10.1001/jama.2020.27124\n• Zhang L, Jackson CB, Mou H, et al. The D614G mutation in the SARS-CoV-2 spike protein reduces S1 shedding and increases infectivity. bioRxiv [Preprint]. June 12 2020 [cited 2021 Apr 19] https://doi.org/10.1101/2020.06.12.148726\n• Korber B, Fischer WM, Gnanakaran S et al. Sheffield COVID-19 Genomics Group. Tracking changes in SARS-CoV-2 spike: evidence that D614G increases infectivity of the COVID-19 virus. Cell (2020) 182:812-827.e19. doi:10.1016/j.cell.2020.06.043\n• Francis T. On the doctrine of original antigenic sin. Proc Am Philos Soc (1960) 104:572–578.\n• Vibroud C, Epstein SL. First flu is forever. Science (2016) 354:706–707. doi:10.1126/science.aak9816\n• Weisblum Y, Schmidt F, Zhang F, et al. Escape from neutralizing antibodies by SARS354 CoV-2 spike protein variants. Elife (2020) 9:e61312. doi:10.7554/eLife.61312\n• Coish JM, MacNeil AJ. Out of the frying pan and into the fire? Due diligence warranted for ADE in COVID-19. Microbes Infect (2020) 22(9):405-406. doi:10.1016/j.micinf.2020.06.006\n\nFigure 1. Number of new COVID-19 deaths in relation to number of people that have received at least one vaccine dose for selected countries. Graph shows data from the start of vaccination to May 3rd 365 , 2021. A) India (9.25% of population vaccinated), B) Thailand (1.58% of population vaccinated), C) Colombia (6.79% of population vaccinated), D) Mongolia (31.65% of population vaccinated), E) Israel (62.47% of population vaccinated), F) Entire world (7.81% of population vaccinated). Graphs were built using data from Our World in Data (accessed 4 May 2021) https://github.com/owid/covid-19-data/tree/master/public/data/vaccinations", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://en-volve.com/2021/05/08/57-top-scientists-and-doctors-release-shocking-study-on-covid-vaccines-and-demand-immediate-stop-to-all-vaccinations/", "https://en-volve.com/2021/05/08/57-top-scientists-and-doctors-release-shocking-study-on-covid-vaccines-and-demand-immediate-stop-to-all-vaccinations/#", "https://www.gov.uk/government/publications/covid-19-reported-sars-cov-2-deaths-in-england/covid-19-confirmed-deaths-in-england-report", "https://en-volve.com/2021/05/08/57-top-scientists-and-doctors-release-shocking-study-on-covid-vaccines-and-demand-immediate-stop-to-all-vaccinations/", "http://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "http://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "http://philosophers-stone.info/2020/07/08/awan-minutes-to-midnight-finding-hillarys-blackberries-and-everything-after/", "http://philosophers-stone.info/2020/09/27/warning-the-hpv-vaccine-is-dangerous-wholly-for-profit-not-required-can-cause-death-and-severe-injury-with-the-goal-likely-the-sterilization-of-young-girls/", "http://philosophers-stone.info/2021/01/01/developers-of-oxford-astrazeneca-vaccine-tied-to-uk-eugenics-movement/", "http://philosophers-stone.info/2020/12/30/10-facts-from-the-uk-government-pfizer-vaccine-guidance-that-promote-vaccine-hesitancy-common-sense/", "http://philosophers-stone.info/2020/10/17/covid-19-excess-mortalities-viral-cause-impossible-drugs-with-key-role-in-about-200000-extra-deaths-in-europe-and-the-us-alone/", "http://philosophers-stone.info/2020/09/30/exclusive-giant-class-action-against-german-inventors-of-pcr-test-no-pandemic-without-pcr-test/"], "authors": [], "publish_date": "11 May 2021"}