{"result_id": "241003", "URL": "https://philosophers-stone.info/2023/02/08/covishield-administered-in-india-worse-due-to-adverse-health-impact-expert/", "timestamp": "2023-04-25 16:48:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://philosophers-stone.info/2023/02/08/covishield-administered-in-india-worse-due-to-adverse-health-impact-expert/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "Covishield Administered In India ‘Worse’ Due To Adverse Health Impact: Expert – Philosophers Stone", "cleaned_text": "Eminent British-Indian Cardiologist Dr Aseem Malhotra said there have already been international calls to suspend mRNA vaccines like those manufactured by Pfizer and Moderna because of the serious adverse effects especially related to the cardiovascular system.\n\nEminent British-Indian Cardiologist Dr Aseem Malhotra, who has been leading international calls for the suspension of mRNA Covid-19 vaccines, said on Tuesday that Oxford-AstraZeneca’s jab, administered in India as Covishield, was even “worse” in terms of cardiovascular effects, heart attacks and strokes.\n\nDr Malhotra, who has demanded a full safety review into the use of AstraZeneca’s Covid vaccine, said Covishield “should never have been rolled out in the country in the first place”.\n\nDr Malhotra is National Health Service (NHS) trained medic and he has had two doses of the COVID-19 vaccine. He is in India this week to deliver a series of lectures on COVID vaccines to try and make an “evidence-based case” for their suspension.\n\nHe said there have already been international calls to suspend mRNA vaccines like those manufactured by Pfizer and Moderna because of the serious adverse effects especially related to the cardiovascular system.\n\nHowever, a comparison done up till June 2021, and published in a peer-reviewed research journal, showed that the Oxford/AstraZeneca’s Covid vaccine is far worse than Pfizer’s mRNA jab in terms of cardiovascular effects, heart attacks, strokes, soime death and clotting problem in both younger and older adults, he said.\n\n“We also have the pharmacovigilance data, which is post-marketing data, after the vaccine was approved and rolled out in the UK. We had 8,00,000 reports of adverse effects which were beyond mild after administering 9.7 million doses, almost 10 per cent,” he said. “This is unprecedented.”\n\n“Why was AstraZeneca’s Covishield administered in India when it was suspended in the UK and some European countries due to severe side-effects?” he said. “There needs to be immediate suspension pending inquiry as to why India got this so very very wrong.”\n\nThe World Health Organisation (WHO) had said last year that the Oxford/AstraZeneca COVID-19 vaccine is “safe and effective for all individuals aged 18 and above”.\n\n“The Astra-Zeneca vaccine can be offered to people who have had COVID-19 in the past. But individuals may choose to delay vaccination for three months following the infection,” the WHO advice from June 2022 reads.\n\nDr Malhotra said the major issue is that commercial entities and big pharma companies were allowed to control the politicians, regulators, media and ultimately that created a pandemic of misinformation amongst doctors and unwittingly harmed members of the public.\n\n“People need to understand that the pharmaceutical industry is there to make profit for their shareholders,” he said.\n\n“They have no legal requirement to give you the best treatment. In the process the way they exert their power has been described as being psychopathic. What we are dealing with are the psychopathic determinants of health. Once people understand that everything else starts to make sense,” he said.\n\nDr Malhotra, who critically analysed the data on the Pfizer mRNA vaccine and published the study last year in the peer-reviewed research in the Journal of Insulin Resistance, said the evidence became very clear that harms outweigh the benefits even from the beginning from reanalysis of the original trials.\n\nWhich means both Moderna and Pfizer’s vaccine should not have been approved in the first place, he said.\n\nHis analysis has found the backing of medical experts in India ahead of his lecture tour in New Delhi and Mumbai this week.\n\nWhen asked isn’t it late in the day to be seeking a full safety review when most of the people in several countries including India have already been vaccinated with two doses, Dr Malhotra said, “What should be asked rather is why we got it wrong so that these problems do not happen again.”\n\n“Many many people are suffering from vaccine induced injuries or have lost relatives. So we need compensation for these people. AstraZeneca has not got immunity or liability from vaccine injuries so this inquiry also needs to find out who is ultimately liable and who is going to compensate them.\n\nWhen asked about Bharat Biotech’s Covaxin, he said, “The data I have seen at the moment doesn’t suggest that Covaxin has any significant effects, and (it) seems safe. But of course when other vaccines are getting investigated we also need to look at Covaxin.”\n\nWhat should be reassuring to the Indian public and the government is that more than 90 per cent of Indians have been exposed to Covid-19 and natural immunity is very very powerful and protects against severe illness and death, he said.\n\n“There is no further requirement of vaccination for anybody in India,” Dr Malhotra asserted.\n\n“And there’s certainly no requirement for anyone to have a booster especially as we know the side-effect are incremental. In other words the more shots you have the greater the chance of suffering a serious sideeffect,” he said.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.outlookindia.com/national/covishield-administered-in-india-worse-due-to-adverse-health-impact-expert-news-260274", "https://www.outlookindia.com/national/covishield-administered-in-india-worse-due-to-adverse-health-impact-expert-news-260274", "https://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "https://philosophers-stone.info/2021/01/01/developers-of-oxford-astrazeneca-vaccine-tied-to-uk-eugenics-movement/", "https://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "https://philosophers-stone.info/2020/12/15/leading-covid-vaccine-candidates-plagued-by-safety-concerns/", "https://philosophers-stone.info/2021/06/27/latest-cdc-vaers-data-show-reported-injuries-surpass-11000-in-ages-12-to-17-following-covid-vaccines/", "https://philosophers-stone.info/2020/12/03/astrazeneca-under-scrutiny-again-as-countries-spend-billions-purchasing-its-low-cost-vaccine/", "https://philosophers-stone.info/2020/12/30/10-facts-from-the-uk-government-pfizer-vaccine-guidance-that-promote-vaccine-hesitancy-common-sense/", "https://philosophers-stone.info/2022/02/17/pfizergate-scandal-the-worldwide-cover-up-of-data-to-disguise-the-fact-covid-19-vaccines-cause-vaids/"], "authors": [], "publish_date": "8 February 2023"}