{"result_id": "241014", "URL": "https://philosophers-stone.info/2023/03/08/confidential-pfizer-documents-reveal-covid-19-vaccination-is-going-to-lead-to-depopulation/", "timestamp": "2023-04-25 16:49:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://philosophers-stone.info/2023/03/08/confidential-pfizer-documents-reveal-covid-19-vaccination-is-going-to-lead-to-depopulation/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "Confidential Pfizer Documents reveal Covid-19 Vaccination is going to lead to Depopulation – Philosophers Stone", "cleaned_text": "Covid-19 vaccination is going to lead to mass depopulation.\n\nThis is a pretty bold claim to make. ‘Your Government is trying to kill you’ is even bolder.\n\nBut unfortunately, these bold claims are now backed up with a mountain of evidence, and most of that evidence can be found in the confidential Pfizer documents that the U.S. Food & Drug Administration has been forced to publish by court order.\n\nSo let’s start with the evidence contained in the confidential Pfizer documents.\n\nThe US Food and Drug Administration (FDA) attempted to delay the release of Pfizer’s COVID-19 vaccine safety data for 75 years despite approving the injection after only 108 days of safety review on December 11th, 2020.\n\nBut in early January 2022, Federal Judge Mark Pittman ordered them to release 55,000 pages per month. They released 12,000 pages by the end of January.\n\nSince then, PHMPT has posted all of the documents on its website. The latest drop happened on 1st June 2022.\n\nOne of the documents contained in the data dump is ‘reissue_5.3.6 postmarketing experience.pdf’. Page 12 of the confidential document contains data on the use of the Pfizer Covid-19 injection in pregnancy and lactation.\n\nPfizer state in the document that by 28th February 2021 there were 270 known cases of exposure to the mRNA injection during pregnancy.\n\nForty-six-percent of the mothers (124) exposed to the Pfizer Covid-19 injection suffered an adverse reaction.\n\nOf those 124 mothers suffering an adverse reaction, 49 were considered non-serious adverse reactions, whereas 75 were considered serious. This means 58% of the mothers who reported suffering adverse reactions suffered a serious adverse event ranging from uterine contraction to foetal death.\n\nA total of 4 serious foetus/baby cases were reported due to exposure to the Pfizer injection.\n\nBut here’s where things get rather concerning. Pfizer state that of the 270 pregnancies they have absolutely no idea what happened in 238 of them.\n\nBut here are the known outcomes of the remaining pregnancies –\n\nThere were 34 outcomes altogether at the time of the report, but 5 of them were still pending. Pfizer note that only 1 of the 29 known outcomes were normal, whilst 28 of the 29 outcomes resulted in the loss/death of the baby. This equates to 97% of all known outcomes of Covid-19 vaccination during pregnancy resulting in the loss of the child.\n\nWhen we include the 5 cases where the outcome was still pending it equates to 82% of all outcomes of Covid-19 vaccination during pregnancy resulting in the loss of the child. This equates to an average of around 90% between the 82% and 97% figure.\n\nSo here we have our first piece of evidence that something is amiss when it comes to administering the Pfizer Covid-19 injection during pregnancy.\n\nHere’s the guidance taken from the UK Government’s ‘REG 174 INFORMATION FOR UK HEALTHCARE PROFESSIONALS’ document –\n\nThat’s how the guidance read in December 2020 anyway. Unfortunately, just a month or so later, the UK Government and other Governments around the world revised that guidance to read as follows –\n\nThis is still the official guidance as of June 2022, and leads to several questions requiring urgent answers when we consider since early 2021 pregnant women have been told Covid-19 vaccination is perfectly safe.\n\nYou only have to look at the things women were told to avoid during pregnancy prior to being told it’s perfectly safe to take an experimental injection to realise something just isn’t right here –\n\nThese are just to name a few, and the list is endless.\n\nSo let’s start with the ‘Pregnancy’ section of the official guidance. In December 2020 the guidance stated ‘Covid-19 vaccination is not recommended during pregnancy‘. Just a month or so later this guidance stated ‘Animal studies do not indicate harmful effects with respect to pregnancy etc.’\n\nSo let’s take a look at the animal studies in question.\n\nBut before we do it’s worth pointing out that the official guidance states, as of June 2022, that ‘administration of the COVID-19 mRNA Vaccine BNT162b2 in pregnancy should only be considered when the potential benefits outweigh any potential risks for the mother and foetus’. So why on earth has every single pregnant woman up and down the land been actively coerced into getting this injection?\n\nPfizer and Medicine Regulators hid dangers of Covid-19 Vaccination during Pregnancy due to Animal Study finding an increased risk of Birth Defects & Infertility\n\nThe limited animal study talked about in the official guidance actually uncovered the risk of significant harm to the developing foetus, but medicine regulators in the USA, UK and Australia actively chose to remove this information from public documents.\n\nThe actual study can be viewed in full here and is titled ‘Lack of effects on female fertility and prenatal and postnatal offspring development in rats with BNT162b2, a mRNA-based COVID-19 vaccine‘.\n\nThe study was performed on 42 female Wistar Han rats. Twenty-one were given the Pfizer Covid-19 injection, and 21 were not.\n\nHere are the results of the study –\n\nThe results of the number of foetuses observed to have supernumerary lumbar ribs in the control group were 3/3 (2.1). But the results of the number of foetuses to have supernumerary lumbar ribs in the vaccinated group were 6/12 (8.3). Therefore on average, the rate of occurrence was 295% higher in the vaccinated group.\n\nSupernumerary ribs also called accessory ribs are an uncommon variant of extra ribs arising most commonly from the cervical or lumbar vertebrae.\n\nSo what this study found is evidence of abnormal foetal formation and birth defects caused by the Pfizer Covid-19 injection.\n\nBut the abnormal findings of the study don’t end there. The ‘pre-implantation loss’ rate in the vaccinated group of rats was double that of the control group.\n\nPre-implantation loss refers to fertilised ova that fail to implant. Therefore, this study suggests that the Pfizer Covid-19 injection reduces the chances of a woman being able to get pregnant. So, therefore, increases the risk of infertility.\n\nSo with this being the case, how on earth have medicine regulators around the world managed to state in their official guidance that “Animal studies do not indicate direct or indirect harmful effects with respect to pregnancy”? And how have they managed to state “It is unknown whether the Pfizer vaccine has an impact on fertility“?\n\nThe truth of the matter is that they actively chose to cover it up.\n\nWe know this thanks to a ‘Freedom of Information (FOI) request made to the Australian Government Department of Health Therapeutic Goods Administration (TGA).\n\nA document titled ‘Delegate’s Overview and Request for ACV’s Advice‘ that was created on 11th January 2021 was published under the FOI request. Page 30 onwards of the document shows a ‘review of the product information’, and highlights changes that should be made to the ‘Non-clinical evaluation report’ prior to official publication.\n\nThe changes were requested to be made by Pfizer prior to the next product information update.\n\nSome of those requested changes were as follows –\n\nThe Module 4 evaluator requested Pfizer remove their claim that “Animal studies do not indicate direct or indirect harmful effects with respect to reproductive toxicity”.\n\nThe Module 4 evaluator told Pfizer that ‘Pregnancy Category B2’ was considered appropriate and requested that they added the following line –\n\n“A combined fertility and developmental toxicity study in rats showed increased occurrence of supernumerary lumbar ribs in fetuses from COMIRNATY- treated female rats”.\n\nBut here’s a reminder of how the official document issued to the general public reads –\n\nThe pregnancy category was changed to ‘B1’, no line was included on the increased occurrence of supernumerary lumbar ribs in fetuses, and they instead included the line that was requested to be removed claiming “Animal studies do not indicate direct or indirect harmful effects with respect to pregnancy…”.\n\nHere’s the official description of the pregnancy categories –\n\nThat’s quite a big difference between the two categories. But the fact that the Module 4 evaluator even thought Pregnancy Category B2 was appropriate is highly questionable when you consider the results, as we revealed above, of the “inadequate” and extremely small animal study that was performed to evaluate the safety of administering the Pfizer Covid-19 injection during pregnancy.\n\nSo not only do we have evidence that the Pfizer vaccine may cause between 82% and 97% of recipients to lose their babies, we also now have evidence that the Pfizer vaccine leads to an increased risk of suffering infertility or birth defects.\n\nBoth of these examples alone support the suggestion that Covid-19 vaccination is going to lead to depopulation. But unfortunately, the evidence doesn’t end there.\n\nConfidential Pfizer Documents reveal the Covid-19 Vaccine accumulates in the Ovaries\n\nAnother study, which can be found in the long list of confidential Pfizer documents that the FDA have been forced to publish via a court order here, was carried out on Wistar Han rats, 21 of which were female and 21 of which were male.\n\nEach rat received a single intramuscular dose of the Pfizer Covid-19 injection and then the content and concentration of total radioactivity in blood, plasma and tissues were determined at pre-defined points following administration.\n\nIn other words, the scientists conducting the study measured how much of the Covid-19 injection has spread to other parts of the body such as the skin, liver, spleen, heart etc.\n\nBut one of the most concerning findings from the study is the fact that the Pfizer injection accumulates in the ovaries over time.\n\nAn ‘ovary’ is one of a pair of female glands in which the eggs form and the female hormones oestrogen and progesterone are made.\n\nIn the first 15 minutes following injection of the Pfizer jab, researchers found that the total lipid concentration in the ovaries measured 0.104ml. This then increased to 1.34ml after 1 hour, 2.34ml after 4 hours, and then 12.3ml after 48 hours.\n\nThe scientists, however, did not conduct any further research on the accumulation after a period of 48 hours, so we simply don’t know whether that concerning accumulation continued.\n\nBut official UK data published by Public Health Scotland, which can be found here, offers some concerning clues as to the consequences of that accumulation on the ovaries.\n\nFigures for the number of individuals suffering from ovarian cancer show that the known trend in 2021 was significantly higher than 2020 and the 2017-2019 average.\n\nThe above chart shows up to June 2021, but the charts found on Public Health Scotland’s dashboard now show figures all the way up to December 2021 and unfortunately reveal that the gap has widened even further with the number of women suffering Ovarian cancer increasing significantly.\n\nThat concludes our third piece of evidence. So now we know –\n• The only animal study performed to prove the safety of administering the Pfizer vaccine during pregnancy indicated an increased risk of infertility and birth defects,\n• and further confidential Pfizer documents reveal the vaccine accumulates in the ovaries.\n\nUnfortunately, we also have evidence that Covid-19 vaccination increases the risk of newborn babies sadly losing their lives, and it also comes from the Public Health Scotland ‘Covid-19 Wider Impacts’ dashboard.\n\nNewborn Baby Deaths hit critical levels for 2nd time in 7 Months in March 2022\n\nOfficial figures reveal that the rate of neonatal deaths increased to 4.6 per 1000 live births in March 2022, a 119% increase on the expected rate of deaths. This means the neonatal mortality rate breached an upper warning threshold known as the ‘control limit’ for the second time in at least four years.\n\nThe last time it breached was in September 2021, when neonatal deaths per 1000 live births climbed to 5.1. Although the rate fluctuates month to month, the figure for both September 2021 and March 2022 is on a par with levels that were last typically seen in the late 1980s.\n\nPublic Health Scotland (PHS) did not formally announce they had launched an investigation, but this is what they are supposed to do when the upper warning threshold is reached, and they did so back in 2021.\n\nAt the time, PHS said the fact that the upper control limit has been exceeded “indicates there is a higher likelihood that there are factors beyond random variation that may have contributed to the number of deaths that occurred”.\n\nOur final piece of evidence to support the claim that Covid-19 vaccination is going to lead to depopulation comes in the form of more real-world data, but this time from the USA.\n\nCovid-19 Vaccination increases risk of suffering Miscarriage by at least 1,517%\n\nAccording to the Centers for Disease Control’s (CDC)) Vaccine Adverse Event Database (VAERS), as of April 2022, a total of 4,113 foetal deaths had been reported as adverse reactions to the Covid-19 injections, 3,209 of which were reported against the Pfizer injection.\n\nThe CDC has admitted that just 1 to 10% of adverse reactions are actually reported to VAERS therefore the true figure could be many times worse. But to put these numbers into perspective, there were only 2,239 reported foetal deaths to VAERS in the 30 years prior to the emergency use authorisation of the Covid-19 injections in December of 2020. (Source)\n\nAnd a further study which can be viewed here, found that the risk of suffering a miscarriage following Covid-19 vaccination is 1,517% higher than the risk of suffering a miscarriage following flu vaccination.\n\nThe true risk could however actually be much higher because pregnant women are a target group for Flu vaccination, whereas they are only a small demographic in terms of Covid-19 vaccination so far.\n\nWith the risk of this turning into an essay that concludes our evidence for today, but there is plenty more of it out there and we will make sure to report on it.\n• The only animal study performed to prove the safety of administering the Pfizer vaccine during pregnancy indicating an increased risk of infertility and birth defects,\n• Further confidential Pfizer documents revealing the vaccine accumulates in the ovaries, data from Scotland revealing cases of Ovarian cancer are at an all time high,\n• Further data from Scotland revealing deaths of new born babies have hit critical levels for the second time in seven months,\n• and CDC VAERS data showing Covid-19 vaccination increases the risk of suffering a miscarriage by at least 1,517%,\n\nIt looks like we already have more than enough evidence to make the claim that Covid-19 vaccination is going to lead to depopulation.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/author/the-expose/", "https://expose-news.com/2023/03/08/confidential-pfizer-documents-reveal-covid-19-vaccination-is-going-to-lead-to-depopulation/", "https://www.fda.gov/", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine#:~:text=The%20first%20EUA%2C%20issued%20Dec,trial%20of%20thousands%20of%20individuals.", "https://phmpt.org/pfizers-documents/", "https://phmpt.org/wp-content/uploads/2022/04/reissue_5.3.6-postmarketing-experience.pdf", "https://phmpt.org/wp-content/uploads/2022/04/reissue_5.3.6-postmarketing-experience.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-68.png?ssl=1", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1043778/Temporary_Authorisation_HCP_Information_BNT162_19_0_UK_Clean.pdf", "https://www.sciencedirect.com/science/article/pii/S0890623821000800?via%3Dihub", "https://www.sciencedirect.com/science/article/pii/S0890623821000800?via%3Dihub", "https://www.sciencedirect.com/science/article/pii/S0890623821000800?via%3Dihub", "https://www.sciencedirect.com/science/article/pii/S0890623821000800?via%3Dihub", "https://www.tga.gov.au/sites/default/files/foi-2389-01.pdf", "https://www.tga.gov.au/sites/default/files/foi-2389-01.pdf", "https://www.tga.gov.au/sites/default/files/foi-2389-01.pdf", "https://www.tga.gov.au/sites/default/files/auspar-bnt162b2-mrna-210125-pi.pdf", "https://www.tga.gov.au/sites/default/files/auspar-bnt162b2-mrna-210125-pi.pdf", "https://www.tga.gov.au/australian-categorisation-system-prescribing-medicines-pregnancy", "https://phmpt.org/wp-content/uploads/2022/03/125742_S1_M4_4223_185350.pdf", "https://phmpt.org/pfizers-documents/", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-76.png?ssl=1", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/06/image-78.png?ssl=1", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://scotland.shinyapps.io/phs-covid-wider-impact/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=VMAN&TSORT=down&EVENTS=ON&PERPAGE=100&ESORT=STATE&SYMPTOMS[]=Aborted_pregnancy_%2810000209%29&SYMPTOMS[]=Abortion_%2810000210%29&SYMPTOMS[]=Abortion_complete_%2810061614%29&SYMPTOMS[]=Abortion_complicated_%2810061615%29&SYMPTOMS[]=Abortion_early_%2810052846%29&SYMPTOMS[]=Abortion_incomplete_%2810000217%29&SYMPTOMS[]=Abortion_induced_%2810000220%29&SYMPTOMS[]=Abortion_induced_complete_%2810060928%29&SYMPTOMS[]=Abortion_induced_incomplete_%2810053984%29&SYMPTOMS[]=Abortion_late_%2810052847%29&SYMPTOMS[]=Abortion_missed_%2810000230%29&SYMPTOMS[]=Abortion_of_ectopic_pregnancy_%2810066266%29&SYMPTOMS[]=Abortion_spontaneous_%2810000234%29&SYMPTOMS[]=Abortion_spontaneous_complete_%2810061616%29&SYMPTOMS[]=Abortion_spontaneous_complicated_%2810000238%29&SYMPTOMS[]=Abortion_spontaneous_incomplete_%2810061617%29&SYMPTOMS[]=Ectopic_pregnancy_%2810014166%29&SYMPTOMS[]=Ectopic_pregnancy_termination_%2810014168%29&SYMPTOMS[]=Ectopic_pregnancy_with_contraceptive_device_%2810074497%29&SYMPTOMS[]=Foetal_cardiac_arrest_%2810084280%29&SYMPTOMS[]=Foetal_death_%2810055690%29&SYMPTOMS[]=Premature_baby_death_%2810076700%29&SYMPTOMS[]=Premature_delivery_%2810036595%29&SYMPTOMS[]=Ruptured_ectopic_pregnancy_%2810048407%29&SYMPTOMS[]=Stillbirth_%2810042062%29&VAX=COVID19", "http://healthimpactnews.com/", "https://healthimpactnews.com/2022/4113-fetal-deaths-in-vaers-following-covid-19-vaccines-not-including-those-murdered-alive-to-develop-the-vaccines/", "https://expose-news.com/2022/04/30/study-covid-vaccines-increase-risk-miscarriage-1517percent/", "https://expose-news.com/2023/03/08/confidential-pfizer-documents-reveal-covid-19-vaccination-is-going-to-lead-to-depopulation/", "https://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "https://philosophers-stone.info/2021/07/11/ivermectin-a-potential-anticancer-drug-derived-from-an-antiparasitic-drug/", "https://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "https://philosophers-stone.info/2021/06/27/latest-cdc-vaers-data-show-reported-injuries-surpass-11000-in-ages-12-to-17-following-covid-vaccines/", "https://philosophers-stone.info/2020/07/08/awan-minutes-to-midnight-finding-hillarys-blackberries-and-everything-after/", "https://philosophers-stone.info/2020/10/17/covid-19-excess-mortalities-viral-cause-impossible-drugs-with-key-role-in-about-200000-extra-deaths-in-europe-and-the-us-alone/", "https://philosophers-stone.info/2023/04/07/breaking-fda-confirms-graphene-oxide-is-in-the-mrna-covid-19-vaccines-after-being-forced-to-publish-confidential-pfizer-documents-by-order-of-the-us-federal-court/", "https://philosophers-stone.info/2021/01/01/developers-of-oxford-astrazeneca-vaccine-tied-to-uk-eugenics-movement/"], "authors": [], "publish_date": "8 March 2023"}