{"result_id": "241028", "URL": "https://philosophers-stone.info/2023/04/07/breaking-fda-confirms-graphene-oxide-is-in-the-mrna-covid-19-vaccines-after-being-forced-to-publish-confidential-pfizer-documents-by-order-of-the-us-federal-court/", "timestamp": "2023-04-25 16:49:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://philosophers-stone.info/2023/04/07/breaking-fda-confirms-graphene-oxide-is-in-the-mrna-covid-19-vaccines-after-being-forced-to-publish-confidential-pfizer-documents-by-order-of-the-us-federal-court/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "BREAKING: FDA confirms Graphene Oxide is in the mRNA COVID-19 Vaccines after being forced to publish Confidential Pfizer Documents by order of the US Federal Court – Philosophers Stone", "cleaned_text": "The Covid-19 vaccines have been at the centre of a heated debate since their introduction, with many questions and concerns raised about their safety and effectiveness.\n\nSpeculation has also been rife that the Covid-19 injections may contain traces of Graphene Oxide, a highly toxic and conductive substance.\n\nMedicine regulators, with the support of the Mainstream Media, have repeatedly denied these claims.\n\nBut they were lying to you.\n\nBecause recent evidence has emerged that confirms the presence of Graphene Oxide, a highly toxic and conductive substance, in the Pfizer vaccine. And it has come from the US Food and Drug Administration (FDA) which has been forced to publish the confidential Pfizer documents by order of the Federal Court in the USA.\n\nThe FDA had initially attempted to delay the release of Pfizer’s Covid-19 vaccine safety data for 75 years, despite approving the injection after only 108 days of a safety review on December 11th, 2020.\n\nHowever, a group of scientists and medical researchers sued the FDA under FOIA to force the release of hundreds of thousands of documents related to the licensing of the Pfizer-BioNTech Covid-19 vaccine.\n\nIn early January 2022, Federal Judge Mark Pittman ordered the FDA to release 55,000 pages per month, and since then, PHMPT has posted all of the documents on its website as they have been published.\n\nOne of the most recent documents published by the FDA saved as 125742_S1_M4_4.2.1 vr vtr 10741.pdf, confirms the use of Graphene Oxide in the manufacturing process of the Pfizer Covid-19 vaccine.\n\nThe document is a description of a study carried out by Pfizer between April 7th 2020 and 19th August 2020, with the objective being “to express and characterize the vaccine antigen encoded by BNT162b2.”\n\nThe study conclusion is as follows-\n\nIn layman’s terms, the study was conducted to determine how the vaccine works. The study found that the vaccine used mRNA to instruct your cells to produce a protein (called P2 S), which is the Spike protein of the alleged Covd-19 virus.\n\nThe millions of spike proteins then bind to a receptor called ACE2 on the surface of your cells, inducing an immune system response.\n\nBut what is most interesting about the study is that it confirms on page 7 that reduced Graphene Oxide is required to manufacture the Pfizer Covid-19 vaccine because it is needed as a base for the lipid nanoparticles.\n\nPfizer states on page 7 of the study in section 3.4 the following –\n\nThis is most peculiar because medicine regulators with the help of the Mainstream Media, have denied for months on end that Graphene Oxide is an ingredient of the Covid-19 vaccine. They’ve been able to say this because those who’ve proven and speculated Graphene Oxide is in the Pfizer Covid19 injection have been asking the wrong question.\n\nWhat everyone should have been asking is, ‘is Graphene Oxide used in the manufacturing process of the Pfizer Covid vaccine?’\n\nBecause as this document, which the FDA attempted to keep confidential and sealed the 75 years, shows, Graphene Oxide is indeed used in the manufacturing process of the vaccine because it is vital in helping to make the vaccine’s lipid nanoparticles stable.\n\nTherefore, trace amounts or large amounts, depending on the batch, of reduced Graphene Oxide inevitably make their way into the Pfizer Covid-19 injections.\n\nThe Pfizer Covid-19 vaccine uses tiny particles called lipid nanoparticles to deliver the vaccine’s genetic material (called messenger RNA, or mRNA) into cells in the body. These lipid nanoparticles are like tiny “bubbles” made up of fats and other molecules that can surround and protect the mRNA until it reaches its destination inside the cells.\n\nThe mRNA in the vaccine provides instructions to the cells to produce a protein (called spike protein) that is found on the surface of the Covid-19 virus. When the immune system detects this spike protein, it can recognize it as foreign and mount an immune response against it,\n\nFurthermore, it has been discovered that two of the lipids in Pfizer Covid-19 vaccines are ALC-0159 and ALC-315, as confirmed by the assessment report of the Pfizer Covid-19 vaccine published by the European Medicines Agency.\n\nBut both of these lipids carry manufacturer’s warnings that state they are never to be used in humans or animals.\n\nAs you can see for yourself, it tiny writing at the bottom of the product inserts here and here.\n\nGraphene Oxide is a tiny particle that is made up of carbon and oxygen atoms. It’s really small – so small that you can’t see it with your eyes. But even though it’s small, it can be dangerous.\n\nIt is known to be toxic to some cells, and research has shown that it can cause inflammation and damage to the lungs when inhaled.\n\nIn addition, Graphene Oxide is able to cross the blood-brain barrier, which is a protective barrier that prevents harmful substances from entering the brain. This could potentially lead to neurological problems.\n\nGraphene Oxide is detected in the immune system as if it were a pathogen. Once injected it has an affinity for the central nervous system, potentially causing paralysis, strokes and alteration of the nervous system.\n\nFurthermore, the long-term effects of Graphene Oxide exposure are not yet known. There is very little research on the long-term effects of Graphene Oxide exposure in humans, which means we don’t know what the potential risks are.\n\nBut thanks to the administration of the Pfizer COVID vaccine to millions of people, numerous times, we are finding out as the days pass. And sadly, both the short-term and long-term effects do not look good.\n\nGraphene Oxide is not the only toxic substance that the public should be concerned about. Because scientists have found Nanotech alongside Graphene Oxide when they have previously examined samples of Covid-19 injections.\n\nNanoscience and nanotechnology involve the ability to see and control individual atoms and molecules. Everything on Earth is made up of atoms—the food we eat, the clothes we wear, the buildings and houses we live in, and our own bodies.\n\nBut something as small as an atom is impossible to see with the naked eye. In fact, it’s impossible to see with the microscopes typically used in high school science classes. The microscopes needed to see things at the nanoscale were invented in the early 1980s.\n\nOnce scientists had the right tools, such as the scanning tunnelling microscope (STM) and the atomic force microscope (AFM), the age of nanotechnology was born.\n\nAnd scientists from Spain, have declared that nanotechnology, which has the ability to control atoms in your body, has been found in all of the Covid-19 injections alongside Graphene Oxide.\n\nAccording to the Spanish scientists who examined the Covid-19 injections, Graphene Oxide has the potential to cause strange blood clots. This may explain why it has been proven that Covid-19 injections increase the risk of suffering thrombosis with thrombocytopenia.\n\nBut it is not just scientists from Spain making these claims. Numerous scientists around the world have published findings where they allege they have discovered both nanotechnology and Graphene Oxide in the Covid-19 injections.\n\nAfter reviewing electron microscope images of elements contained in the Covid Pfizer and Moderna injections, Dr Daniel Nagase, a Canadian emergency room doctor, revealed that, strangely, the contents of the Pfizer and Moderna “vaccines” show no signs of biological material, including mRNA or DNA. (Read more here).\n\nDr Nagase’s research group looked at Moderna and Pfizer samples under a regular microscope. Although there were a lot of very interesting images, they were unable to be conclusive about what exactly they were seeing. So, they used an electron microscope to determine what elements the “vaccines” contained.\n\nHere are some of the images of what they found –\n\nDr Nagase examined a “ball with the legs growing out of it” found inside a Moderna sample and had this to say –\n\nDr Nagase and the researchers also discovered an unusual element from the lanthanide series – thulium – in a fibre-like structure found in a Pfizer sample –\n\nDr. Nagase and the researchers found a variety of shapes and structures inside the “vaccine” samples they tested – crystals, chips, strands, bulbs, spheres, fibres and balls with legs growing out of them – “we have polymorphic, which is many different forms,” he said.\n\nIn a presentation to the Chilean radio station El Mirador del Gallo, Argentine doctor Martín Monteverde presented the analyses carried out by Corona2Inspect researchers on the microtechnology found in the Pfizer Covid-19 mRNA vaccine.\n\nArgentina’s Dr Monteverde and other researchers carried out microscopic analyses of a vial of the Pfizer vaccine alongside four other Covid-19 “vaccine” types. He then sent these images to Corona2Inspect for further analysis. Corona2Inspect returned the images with their comments identifying what objects the images were showing.\n\nYou can watch a video of Dr Monteverde’s teams findings below –https://www.bitchute.com/embed/rp5ZyrmMLJQv/\n\nArgentina’s Dr Patricia Aprea, Director of Evaluation and Control of the ANMAT, also accidentally admitted AstraZeneca’s Viral Vector Covid-19 injection also contains Graphene during a legal case regarding a death post-Covid injection.\n\nYou can read the document where ANMAT recognised that Covid-19 vaccines contain Graphene Oxide HERE in (Spanish) or below, translated into English using Google –\n\nDoctors find Graphene is shedding from the COVID Vaccinated to the Unvaccinated, forming Strange Blood Clots & decimating Red Blood Cells\n\nDr Philippe van Welbergen, Medical Director of Biomedical Clinics, was one of the first to warn the public of the damage being caused to people’s blood by Covid injections by releasing images of blood samples under the microscope.\n\nIn a set of slides of blood samples taken from both “vaccinated” and unvaccinated people, Dr Philippe van Welbergen demonstrated that the Graphene Oxide, contained in the Pfizer Covid-19 vaccines being injected into people by amateurs and volunteers with no adequate training, is organising and growing into larger fibres and structures, gaining magnetic properties or an electrical charge and the fibres are showing indications of more complex structures with striations.\n\nAt the beginning of July 2021, Dr Philippe, was interviewed and he explained that when his patients started complaining about chronic fatigue, dizziness, memory loss, and even sometimes paralysis and late onset of heavy menstruation (women in their 60s upwards), he took blood samples.\n\nTheir blood had unusual tube-like structures, some particles which lit up and many damaged cells.\n\nFew healthy cells were visible. Until three months earlier, he had never seen these formations in blood.\n\nWe now know these tube-like structures are Graphene Oxide.\n\nHe also demonstrated that “shards” of Graphene Oxide are being transmitted from the Covid-19 vaccinated to vaccine-free or unvaccinated people, sadly destroying their red blood cells and causing blood clots. (Read more here).\n\nBelow is an image of typical healthy red blood cells as seen with a microscope, what blood should look like. There is no coagulation or foreign objects in it.\n\nSadly fibres of this size are capable of blocking capillaries.\n\n\n\nYou can also see that the Graphene fibres are hollow and have swallowed up some red blood cells.\n\nIn December 2021, a British medical practitioner offered to assist in an investigation to ascertain whether the results discovered by Dr. Andreas Noack, a German chemist, and Dr. Pablo Campra, of the University of Almeria in Spain, could be replicated in the UK and also to examine the Covid-19 injection vials for toxins or unexpected contents.\n\nThe medical practitioner seized an injection vial from the fridge housed in the surgery where she works and handed it to an independent investigator.\n\nA UK laboratory analysed the sample using Raman Spectroscopy and found Graphene, SP3 carbon, iron oxide, carbon derivatives and glass shards.\n\nThe first sample that was evaluated was the Moderna 01 which was examined by Raman spectroscopy. The investigation clearly showed that all the inclusions within the vaccine have a strong carbon signal with confirmed graphene compositions of some representative forms.\n\nTwo clear signals were obtained from two objects. The flat ribbon-like inclusions exhibited clear Graphene spectra integrated with the spectrum of glycol and other minor compounds. The other clear signal was obtained from a calcite microcrystalline form and Carbon composite forms also had a clear Graphene signal.\n\n\n\nYou can read a copy of the document encompassing a case briefing, the UNIT report and a summary of the toxicity of Graphene nanoparticles on UK Citizen 2021’s website HERE.\n\nThe 48-page UNIT report, ‘Qualitative Evaluation of Inclusions in Moderna, AstraZeneca and Pfizer Covid-19 vaccines’, begins on page 12 of the document.\n\nAn Open Access review highlighting the toxicity of the graphene family nanoparticles can be viewed here.\n\nNanotechnology and Graphene have also been found in Pfizer’s Comirnaty “vaccines” by scientists in New Zealand. (Read more here).\n\nAt the end of January 2022, Sue Grey, co-leader of the Outdoors and Freedom Party, and Dr Matt Shelton from New Zealand Doctors Speaking Out With Science (“NZDSOS”) put the Health Select Committee on notice that serious contamination of the Pfizer vaccine has been uncovered and they needed to act immediately to stop the injection campaign.\n\nDr Shelton came forward to disclose the discovery of formations of nano-particles found by New Zealand scientists using specialised microscopic techniques.\n\nNone of the experts consulted had ever seen anything like this before, and none of these contaminants are listed as approved ingredients.\n\nYou can read the full account, with additional images and videos, HERE. But below is a snapshot of what one New Zealand scientist found.\n\nThe image below was taken from one drop of New Zealand’s Pfizer Comirnaty “vaccine” under a cover slip, after it was inadvertently heated lightly, and viewed the same day through dark field microscopy at low magnification, projected onto a TV monitor.\n\nThe following images were taken after a new computer with improved graphics was purchased alongside new software for the camera –\n\nThey lied to you\n\nDespite repeated assurances from authorities and mainstream media that the Covid-19 vaccines are safe and effective, evidence has emerged time and time again that proves they have not been telling the whole truth.\n\nThe use of Graphene Oxide in the Pfizer Covid-19 vaccine has been a source of controversy and concern from the outset, with many individuals claiming that regulators and media outlets were deliberately misleading the public about its inclusion.\n\nDespite initial denials, the documents released by the FDA, which they were forced to publish by order of the Federal Court in the USA. have confirmed the use of Graphene Oxide in the manufacturing process of the Pfizer vaccine, raising questions about who we can trust.\n\nThis revelation should cause widespread alarm and will likely fuel suspicion about the true intentions of those in charge of public health.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/04/02/fda-confirms-graphene-is-in-the-covid-vaccines/", "https://expose-news.com/author/the-expose/", "https://phmpt.org/wp-content/uploads/2023/02/125742_S1_M4_4.2.1-vr-vtr-10741.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/03/image-132.png?ssl=1", "https://phmpt.org/wp-content/uploads/2023/02/125742_S1_M4_4.2.1-vr-vtr-10741.pdf", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://cdn.caymanchem.com/cdn/insert/34337.pdf", "http://as%20you%20can%20see%20for%20yourself%2C%20it%20tiny%20writing%20at%20the%20bottom%20of%20the%20product%20insers%20her./", "https://cdn.caymanchem.com/cdn/insert/34336.pdf", "https://expose-news.com/2022/08/16/radioactive-nanotech-found-in-covid-vaccine/", "https://expose-news.com/2022/08/16/radioactive-nanotech-found-in-covid-vaccine/", "https://www.encyclopedia.com/science-and-technology/chemistry/compounds-and-elements/lanthanide-series", "https://expose-news.com/2022/02/01/researchers-explain-nanotechnology-in-covid-injections/", "https://corona2inspect.net/acerca-de/", "https://ejercitoremanente.com/wp-content/uploads/2022/01/1_5125102865643209189.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/11/image-2.png?ssl=1", "https://expose-news.com/2022/10/27/drs-find-graph-ene-shed-vax-to-unvax/", "https://biomedclinics.wixsite.com/biomedical/about-us", "https://expose-news.com/2021/08/31/german-doctors-and-lawyers-assess-blood-smears-from-people-who-have-had-covid-injections-for-me-this-is-euthanasia-for-me-this-is-mass-murder-a-crime-on-a-grand-scale/", "https://expose-news.com/2022/10/27/drs-find-graph-ene-shed-vax-to-unvax/", "https://expose-news.com/2021/12/07/did-german-chemist-dr-andreas-noack-die-after-direct-energy-weapon-attack/", "https://expose-news.com/2021/07/10/the-real-pandemic-covid-19-or-graphene-oxide-poisonous-nano-material-found-in-covid-vaccines-and-face-masks/", "https://ukcitizen2021.org/", "https://particleandfibretoxicology.biomedcentral.com/articles/10.1186/s12989-016-0168-y", "https://expose-news.com/2022/02/12/injection-secret-ingredients-whats-the-aim/", "https://expose-news.com/2022/02/12/injection-secret-ingredients-whats-the-aim/", "https://nzdsos.com/", "https://robinwestenra.blogspot.com/2022/01/new-zealand-scientists-have-found.html", "https://expose-news.com/2023/04/02/fda-confirms-graphene-is-in-the-covid-vaccines/", "https://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "https://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "https://philosophers-stone.info/2020/10/17/covid-19-excess-mortalities-viral-cause-impossible-drugs-with-key-role-in-about-200000-extra-deaths-in-europe-and-the-us-alone/", "https://philosophers-stone.info/2021/01/01/developers-of-oxford-astrazeneca-vaccine-tied-to-uk-eugenics-movement/", "https://philosophers-stone.info/2022/01/21/remotely-detonated-graphene-bubbles-triggered-by-frequency-explode-like-bombs-causing-marburg-hemorrhagic-fever-like-symptoms-internal-bleeding/", "https://philosophers-stone.info/2021/12/22/spanish-msm-publishes-some-covid-truths-rna-injections-do-not-vaccinate/", "https://philosophers-stone.info/2022/02/17/pfizergate-scandal-the-worldwide-cover-up-of-data-to-disguise-the-fact-covid-19-vaccines-cause-vaids/", "https://philosophers-stone.info/2021/06/07/10570-dead-405259-injuries-european-database-of-adverse-drug-reactions-for-covid-19-vaccines/"], "authors": [], "publish_date": "7 April 2023"}