{"result_id": "241004", "URL": "https://philosophers-stone.info/2023/02/25/groundbreaking-study-shows-unvaccinated-children-are-healthier-than-vaccinated-children/", "timestamp": "2023-04-25 16:48:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://philosophers-stone.info/2023/02/25/groundbreaking-study-shows-unvaccinated-children-are-healthier-than-vaccinated-children/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "Groundbreaking Study Shows Unvaccinated Children Are Healthier Than Vaccinated Children – Philosophers Stone", "cleaned_text": "This study adds to a growing list of published peer-reviewed papers that compare the health of vaccinated children to the health of unvaccinated children. These studies suggest we have long underestimated the scope of vaccine harms, and that the epidemic of chronic illness in children is hardly a mystery.\n\nMiss a day, miss a lot. Subscribe to The Defender’s Top News of the Day. It’s free.\n\nUnvaccinated children are healthier than vaccinated children, according to a new study published in the International Journal of Environmental Research and Public Health. The study — “Relative Incidence of Office Visits and Cumulative Rates of Billed Diagnoses Along the Axis of Vaccination” — by James Lyons-Weiler, PhD and Paul Thomas, MD, was conducted among 3,300 patients at Dr. Thomas’ Oregon pediatrics practice, Integrative Pediatric.\n\nThis study adds to a growing list of published peer-reviewed papers (Mawson, 2017; Hooker and Miller, 2020) that compare the health of vaccinated children to the health of unvaccinated children. These studies suggest we have long underestimated the scope of vaccine harms, and that the epidemic of chronic illness in children is hardly a mystery.\n\nThe study the CDC refused to do\n\nSince 1986, the Centers for Disease Control and Prevention (CDC) has been legally obligated to conduct safety studies and issue a safety report on children’s vaccinations every two years. In 2018, it was determined they had never done so. It is therefore incumbent upon non-governmental groups to do the work the CDC refuses to do.\n\nAs the leading governmental organization driving vaccination among Americans, the CDC refuses to incriminate themselves in the epidemic of childhood chronic illness. It is a classic case of the fox guarding the henhouse. They are complicit in creating an evidence vacuum to deliberately manage against the possibility of the public turning against vaccination.\n\nSince the Lyons-Weiler and Thomas study demonstrates that vaccinated children have more chronic illness and were also more likely to get respiratory infections, those who downplay vaccine risks will be sent into another round of apoplectic machinations to attempt to invalidate the results.\n\nDespite the rigor with which this study was conducted, expect critics to do anything but cite opposing science. They cannot. It simply has not been done. Instead, expect critics to draw from a hackneyed playbook to draw the attention away from these scientific findings by directing ad hominem attacks on the authors, criticizing the journal where it was published, and claiming that the study design was not sound.\n\nWhen research highlights anomalies that diverge from a dominant scientific paradigm, it’s important to remember that the playground of science is not in proof, but in the accumulation of evidence that bolsters an emerging paradigm. The Lyons-Weiler and Thomas study strengthens this emerging paradigm that vaccines may cause more harm than previously documented and characterized.\n\nA perfect pediatric practice to study health outcomes among varying rates of vaccination\n\nThomas’ pediatric practice follows The Dr. Paul Approved Vaccine Plan, allowing for fully informed consent and parental decision-making in vaccination choices for their children. The plan was developed to reduce exposures to aluminum-containing vaccines and to allow parents to stop or delay vaccinations if some telltale signs of vaccine injury were starting to appear. Conditions like allergies, eczema, developmental delay or autoimmune conditions are typical signs that a child’s immune system is not processing vaccines normally.\n\nThese conditions serve as early indicators to help the parent and pediatrician consider slowing or stopping vaccination. As such, Dr. Thomas’ practice has an incredible mix of children who range from fully vaccinated, to partially vaccinated, to not vaccinated at all, making it the perfect pediatric practice to mine for insights into side effects of vaccination.\n\nThe Lyons-Weiler and Thomas study was conducted among pediatric patient records spanning 10 years, from Thomas’ practice in Oregon. Instead of using odds ratios of diagnoses in the two groups, the authors found that the relative incidence of office visit was more powerful. Even after controlling for health care exposure, age, family history of autoimmunity and gender, the associations of vaccination with many poor health outcomes were robust.\n\nUnvaccinated children have less fever, seek 25X less pediatric care outside well-child visits\n\nThe study found that vaccinated children in the study see the doctor more often than unvaccinated children. The CDC recommends 70 doses of 16 vaccines before a child reaches the age of 18. The more vaccines a child in the study received, the more likely the child presented with fever at an office visit.\n\nThe study had unique data that allowed the researchers to study healthcare seeking behavior. Unlike increases in fever accompanied by increased vaccine uptake, which is accepted as causally related to vaccination, increases in vaccine acceptance was not accompanied by a major increase in well-child visits. In fact, regardless of how many vaccinations parents decided their children would have, the number of well-child visits was about the same.\n\nAny concerns that the non-vaccinated or less-vaccinated children would avoid the doctor are unfounded, and puts the jaw-droppingly large difference in office visits in perspective — outside of well-child visits, children who received 90 to 95% of the CDC-recommended vaccines for their age group were about 25 times more likely than the unvaccinated group to see the pediatrician for an appointment related to fever.\n\nCompared to their unvaccinated counterparts, vaccinated children in the study were three to six times more likely to show up in the pediatrician’s office for treatment related to anemia, asthma, allergies and sinusitis. The striking charts below show age-specific cumulative office visits for various conditions among the fully vaccinated compared to the unvaccinated.\n\nIn a stunning finding sure to rock the psychiatric community, not a single unvaccinated child in the study was diagnosed with attention-deficit hyperactivity disorder (ADHD,) while 0.063% of the vaccinated group were diagnosed with ADHD. Likely due to the vaccine-friendly plan parent-doctor dyad decision-making at Dr. Thomas’ practice, the overall rates of ADHD and autism in the practice were roughly half the rates found in the general population of American children.\n\nLow levels of chicken pox and whooping cough in vaccinated and unvaccinated\n\nRegarding the question of whether or not vaccines prevent the infections they are intended to prevent, a quarter of a percent of the vaccinated were diagnosed with either chicken pox or whooping cough, while a half percent of the unvaccinated were diagnosed with chickenpox, whooping cough, or rotavirus.\n\nSignificantly, there were no cases of measles, mumps, rubella, tetanus, hepatitis or other vaccine-targeted infections in either the vaccinated or unvaccinated, during the entire 10.5 year study period.\n\nVaccinated 70% more likely to have any respiratory infection\n\nVaccinations do appear to make recipients more generally susceptible to infections, so it is ironic, yet not surprising that the vaccinated children in the study appeared at the doctor’s office for respiratory infections 70% more often than the unvaccinated. This finding is likely why vaccinated children present to the pediatrician so often with fevers. Your grandmother was right when she asked why kids these days seem to be sick all the time, despite heavy vaccination.\n\nFamily history of autoimmunity correlated with ear infection and allergic conditions\n\nDr. Yehuda Shoenfeld and others have described a condition called autoimmune syndrome induced by adjuvants (ASIA), where genetics and family history of autoimmunity appear to pre-dispose vaccinated patients to higher risks of developing an autoimmune condition. With this in mind, the authors compared patient records from those with a family history of autoimmune conditions — such as multiple sclerosis, type I diabetes or Hashimoto’s thyroiditis — to patients whose families do not have autoimmunity. The results were striking. Vaccination among children with autoimmunity in their family appeared to increase the risk of ear infection, asthma, allergies and skin rashes relative to the unvaccinated with family history of autoimmunity.\n\nReaders of the study will learn about flaws in past vaccine safety studies, such as over-adjustment bias, in which the data are analyzed many times over in search of the right combination of variables to make associations of adverse health outcomes with vaccines go away. One of the most important findings of this study is that the comparison of the number of office visits related to specific health condition is a far more accurate tool than just using the incidence of diagnoses. In fact, the study authors show this with simulation — and they point out that studies that use odds ratios with incidence of diagnosis are using a low-powered special case of the method introduced by their study, the relative incidence of office visits, because patients with a “diagnosis” have at least one billed office visit related to the diagnosis. The authors conclude that future vaccine safety studies should avoid using weak measures such as odds ratios of incidence of diagnosis.\n\nSince the study found healthcare seeking behavior could not explain vaccination rates, the only remaining explanation of why vaccinated patients require more healthcare for symptoms of chronic illness associated with vaccination is that vaccines are not only associated with adverse health outcomes — they are also associated with more severe and chronic adverse health outcomes. Recalling that 54% of children and young adults in the U.S. have chronic illnesses that lead to life-long pharmaceutical prescriptions, it seems a lot of human pain and suffering could be reduced by adhering to informed choice regarding the true risks of vaccination, and heeding signs of vaccine sensitivity. Although the authors call for more studies to be conducted using similar methodology, this study should certainly cause pediatricians to pause and wonder if they are contributing to life-long chronic illness in some of their patients.\n\nThe views and opinions expressed in this article are those of the authors and do not necessarily reflect the views of Children’s Health Defense.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/unvaccinated-children-healthier-than-vaccinated-children/", "https://childrenshealthdefense.org/authors/alix-mayer-mba/", "https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://www.mdpi.com/1660-4601/17/22/8674", "https://childrenshealthdefense.org/defender/support-dr-paul-thomas/", "https://www.integrativepediatricsonline.com/", "https://electromedicine.org.au/wp-content/uploads/2020/05/JTS-3-186.pdf", "https://journals.sagepub.com/doi/10.1177/2050312120925344", "https://www.integrativepediatricsonline.com/uploads/1/0/9/2/109222957/the_vaccine-friendly_plan.pdf", "https://childrenshealthdefense.org/defender/unvaccinated-children-healthier-than-vaccinated-children/", "http://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "http://philosophers-stone.info/2021/01/09/excerpt-from-2009-corbett-report-101-study-finds-link-between-h1n1-and-flu-shots/", "http://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "http://philosophers-stone.info/2021/07/11/ivermectin-a-potential-anticancer-drug-derived-from-an-antiparasitic-drug/", "http://philosophers-stone.info/2021/06/27/latest-cdc-vaers-data-show-reported-injuries-surpass-11000-in-ages-12-to-17-following-covid-vaccines/", "http://philosophers-stone.info/2021/06/04/from-unesco-study-11-to-unesco-2050-project-best-and-the-forty-year-plan-to-reimagine-education-for-the-fourth-industrial-revolution/", "http://philosophers-stone.info/2020/12/15/leading-covid-vaccine-candidates-plagued-by-safety-concerns/", "http://philosophers-stone.info/2021/12/26/the-real-reason-they-want-to-give-covid-jabs-to-children/"], "authors": [], "publish_date": "25 February 2023"}