{"result_id": "241009", "URL": "https://philosophers-stone.info/2021/08/31/american-scientists-confirm-toxic-graphene-oxide-and-more-in-covid-injections/", "timestamp": "2023-04-25 16:48:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://philosophers-stone.info/2021/08/31/american-scientists-confirm-toxic-graphene-oxide-and-more-in-covid-injections/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "American Scientists Confirm Toxic Graphene Oxide, and More, in Covid Injections – Philosophers Stone", "cleaned_text": "It is a human right, and global law governed under the Nuremberg Code, that vaccine specific ingredient information is disclosed. It is critical, required and necessary information so anyone, from any country in the world, can make an informed decision whether or not to consent to medical intervention. Because the full list of ingredients of the Covid “vaccines” have not been made available, Dr. Robert Young and his team conducted research to identify the specific ingredients in the Pfizer, Moderna, AstraZeneca and Johnson & Johnson Covid injections. On 20 August, they published their findings.\n\nDr. Young is a biochemist, microbiologist, and clinical nutritionist. He and his team of scientists have confirmed what the La Quinta Columna researchers found – toxic nanometallic content which are magneticotoxic, cytotoxic and genotoxic to plants, insects, birds, animals and humans – all life on the planet. One of the “vaccines” even contained life-threatening parasites. Taken together, the “vaccine” components – which include graphene oxide among many others and which may be influenced by radiation sources external to us – create a toxic chemical and radiative soup inside our bodies. Anyone who has a Covid injection is seriously putting their lives at risk.\n\nWe previously covered some of La Quinta Columna’s research in two articles: Spanish Researchers Find Covid-19 Vaccines Contain TOXIC Levels of Graphene Oxide; and, The real pandemic – Covid-19 or Graphene Oxide? Poisonous Nano-Material found in Covid Vaccines and Face Masks. For additional resources visit Orwell City, a website that translates, transcribes and adds English subtitles to a good portion of La Quinta Columna’s materials.\n\n“Vaccines” from the four major pharmaceutical companies were analysed by Dr. Young: Pfizer/BioNTech (“Pfizer”); Moderna/Lonza mRNA-1273 (“Moderna”); Vaxzevria by AstraZeneca (“AstraZeneca”); and, Janssen by Johnson & Johnson (“Janssen”).\n\nLiposome capsids are fatty lipid capsules. We are told their purpose is to envelope the mRNA to protect the genetic material from breaking down before it has reached its target – our body’s cells. All four Covid “vaccines” contain relatively high levels of graphene oxide but both the Pfizer and Moderna liposome capsids are 100% graphene oxide (after extracting the mRNA).\n\nGraphene oxide is cytotoxic, genotoxic, and magneticotoxic. The image below shows the liposome capsid containing graphene oxide in the Pfizer “vaccine.” The liposome delivers the graphene oxide to specific organs, glands and tissues, namely: the ovaries and testes; bone marrow; heart; and, brain.\n\nAlso found in the Pfizer injection was Trypanosoma cruzi – a parasite of which several variants are lethal and is one of many causes of acquired immune deficiency syndrome or AIDS. It’s not known if this was just a random ingredient or was purposefully placed and will be found in all Pfizer “vaccines.”\n\nIn the AstraZeneca “vaccines,” Dr. Young and his team identified histidine, sucrose, poly-ethylene glycol (“PEG”) and ethylene alcohol, which were also contained in the Pfizer, Moderna and Janssen Covid injections. PEG was the only adjuvant declared on the data sheet listing the ingredients of the AstraZeneca injection.\n\nThe injection of PEG and ethylene alcohol are both known to be carcinogenic and genotoxic.\n\nJanssen also contains particles which are composed of stainless steel which are glued together with a “Carbon-based glue” of reduced graphene oxide.\n\nThis aggregate is highly magnetic and can trigger pathological blood coagulation and the “Corona Effect” or the “Spike Protein Effect”\n\nThe Moderna “vaccine” also contains many spherical foreign bodies with some bubble-shaped cavities. These highly toxic nano particulate composition are quantum dots of cadmium selenide which are cytotoxic and genotoxic. Quantum dots are semiconductor nanoparticles that glow a particular colour after being illuminated by light. The colour they glow depends on the size of the nanoparticle. The black spots on the image below are graphene oxide.\n\nDr. Young’s paper concludes, these Covid injections “are NOT vaccines but nanotechnological drugs working as a genetic therapy … All these so-called “vaccines” are patented and therefore their actual content is kept secret even to the buyers, who, of course, are using taxpayers’ money. So, consumers (taxpayers) have no information about what they are receiving in their bodies by inoculation.”\n\nAccording to Dr. Young an estimated 500 million people worldwide have already been injured, with potentially 35 million deaths, due to Covid injections. This is likely to increase in the coming months with people who have had two injections being 13 times more likely to be injured, hospitalized or killed by the “Delta variant” compared to those with natural immunity. But what is actually causing the Covid “variants” and future “waves”?\n\nThe genetic code for the Spike Protein in the “vaccines” is computer generated, it is “man-made”, and can be easily altered. And, the graphene oxide in the body’s tissues – brain, connective tissue, potentially in the muscles – will interact with pulsating frequencies within the 5G range, said Dr. Young, this will be what causes the next “wave” predicted in October.\n\nStop putting poison into your body, Dr. Young said, “these [Covid] inoculates are dangerous because the nano particulates can pass right through the blood-brain barrier, they can pass right through the air-blood barrier. That’s why these inoculations are so dangerous. It’s because the particulates break through: the blood-brain barrier, which is protected; the air-blood barrier; and, the testicular or ovarian-blood barrier. The particulates go right in.” To poison the body in order to heal the body makes no sense – it is a failed narrative.\n\nDr. Young’s published scientific paper, Scanning & Transmission Electron Microscopy Reveals Graphene Oxide in CoV-19 Vaccines, can be read by following this LINK or in the pdf document as attached:Robert-Young-GrapheneOxideVaccinePaperUpdatedDownload\n\nThe paper is technical and those of us who have not made a career in science or medicine may struggle to understand its full implications. Dr. Young discussed his findings in depth during an interview which you can watch HERE. Beginning at the one hour mark he works methodically through the paper’s highlights. What he has to say is of enormous importance to us all. Whether we have had, are considering having or decline to have a Covid injection it’s worth taking the time to hear what he has to say.\n• What Causes Oxygen Deprivation of the Blood (DIC) and Then Lungs (SARS – CoV 2 & 12)?\n• The Genesis of Severe Acute Respiratory (Syndrome) or SARS & Corona Virus or COVID – 19\n• Team of Scientists Confirm Presence of Toxins Graphene, Aluminium, Cadmium Selenide, Stainless Steel, LNP-GO Capsids, Parasites, Other Toxins Variously in 4 COVID Vaccines: Pfizer, Moderna, AstraZeneca, Johnson & Johnson\n\nWhy would they put graphene oxide in the Covid injections? At the end of July a Pfizer whistle-blower, Karen Kingston, confirmed there is undisclosed graphene oxide in the Covid injections. She gives some insight as to the reason why which aligns with that given by Dr. Young. You can watch Kingston’s interview HERE.\n\nOn 26 August, Japan announced it was suspending the use of the Moderna “vaccines” due to reports of contamination with “a substance that reacts to magnets … it could be metal.”\n\nPreviously all Covid injections had emergency use authorisation only but on 23 August, for America, the FDA approved the Pfizer “vaccine”. Last Wednesday in a second interview Kingston discussed the impact this approval had on disclosure of ALL ingredients, including those not previously disclosed:https://rumble.com/embed/vj26z2/?pub=4#?secret=puKEYSNBOa", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drrobertyoung.com/meet-dr-young", "https://dailyexpose.co.uk/2021/08/30/american-scientists-confirm-toxic-graphene-oxide-and-more-in-covid-injections/", "https://www.laquintacolumna.net/", "https://www.thelibertybeacon.com/dr-robert-young-finds-graphene-oxide-in-all-four-vaccines-and-other-disturbing-ingredients/", "https://dailyexpose.co.uk/2021/07/19/spanish-researchers-find-covid-19-vaccines-contain-toxic-levels-of-graphene-oxide/", "https://dailyexpose.co.uk/2021/07/10/the-real-pandemic-covid-19-or-graphene-oxide-poisonous-nano-material-found-in-covid-vaccines-and-face-masks/", "https://www.orwell.city/2021/08/5G-software.html", "https://www.drrobertyoung.com/post/transmission-electron-microscopy-reveals-graphene-oxide-in-cov-19-vaccines", "https://www.cdc.gov/dpdx/trypanosomiasisamerican/index.html", "https://www.drrobertyoung.com/post/transmission-electron-microscopy-reveals-graphene-oxide-in-cov-19-vaccines", "https://www.drrobertyoung.com/post/transmission-electron-microscopy-reveals-graphene-oxide-in-cov-19-vaccines", "http://sciaeon.org/articles/What-Causes-Oxygen-Deprivation-of-the-Blood-DIC-and-Then-Lungs-SARS-CoV2and12.pdf", "http://sciaeon.org/articles/What-Causes-Oxygen-Deprivation-of-the-Blood-DIC-and-Then-Lungs-SARS-CoV2and12.pdf", "https://www.understandingnano.com/quantum-dots.html", "https://www.drrobertyoung.com/post/transmission-electron-microscopy-reveals-graphene-oxide-in-cov-19-vaccines", "https://www.drrobertyoung.com/post/transmission-electron-microscopy-reveals-graphene-oxide-in-cov-19-vaccines", "https://www.scribd.com/document/521947447/2021-08-24-21262415v1-full#from_embed", "https://www.drrobertyoung.com/post/transmission-electron-microscopy-reveals-graphene-oxide-in-cov-19-vaccines", "https://dailyexpose.co.uk/wp-content/uploads/2021/08/Robert-Young-GrapheneOxideVaccinePaperUpdated.pdf", "https://dailyexpose.co.uk/wp-content/uploads/2021/08/Robert-Young-GrapheneOxideVaccinePaperUpdated.pdf", "https://www.bitchute.com/video/Z2sAH0Woz38r/", "http://sciaeon.org/articles/What-Causes-Oxygen-Deprivation-of-the-Blood-DIC-and-Then-Lungs-SARS-CoV2and12.pdf", "https://www.drrobertyoung.com/post/the-genesis-of-severe-acute-respiratory-syndrome-or-sars-corona-virus-or-covid-19", "https://everydayconcerned.net/2021/08/28/newsbreak-133-team-of-scientists-confirm-presence-of-toxins-graphene-aluminium-cadmium-selenide-stainless-steel-lnp-go-capsids-parasites-other-toxins-variously-in-4-covid-vaccines-pfizer-mode/", "https://www.expandingawarenessrelations.com/stew-peters-show-interview-with-former-pfizer-employee-poisonous-graphene-oxide-is-100-in-the-vaccines/", "https://rumble.com/vkgdq7-deadly-shots-former-pfizer-employee-confirms-poison-in-covid-vaccine.html", "https://www.naturalnews.com/2021-08-27-japan-discovers-magnetic-substance-in-pfizer-covid-vaccines-journalists-start-dying.html", "https://dailyexpose.co.uk/2021/08/30/american-scientists-confirm-toxic-graphene-oxide-and-more-in-covid-injections/", "https://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "https://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "https://philosophers-stone.info/2021/07/11/ivermectin-a-potential-anticancer-drug-derived-from-an-antiparasitic-drug/", "https://philosophers-stone.info/2021/01/01/developers-of-oxford-astrazeneca-vaccine-tied-to-uk-eugenics-movement/", "https://philosophers-stone.info/2020/11/05/what-the-evil-bastards-have-planned-compulsory-vaccination-this-is-the-argument-theyll-use/", "https://philosophers-stone.info/2022/02/17/pfizergate-scandal-the-worldwide-cover-up-of-data-to-disguise-the-fact-covid-19-vaccines-cause-vaids/", "https://philosophers-stone.info/2023/04/07/breaking-fda-confirms-graphene-oxide-is-in-the-mrna-covid-19-vaccines-after-being-forced-to-publish-confidential-pfizer-documents-by-order-of-the-us-federal-court/", "https://philosophers-stone.info/2021/06/27/latest-cdc-vaers-data-show-reported-injuries-surpass-11000-in-ages-12-to-17-following-covid-vaccines/"], "authors": [], "publish_date": "31 August 2021"}