{"result_id": "241023", "URL": "https://philosophers-stone.info/2023/04/09/covid-vaccine-booster-now-does-more-harm-than-good-says-prof-angus-dalgleish/", "timestamp": "2023-04-25 16:49:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://philosophers-stone.info/2023/04/09/covid-vaccine-booster-now-does-more-harm-than-good-says-prof-angus-dalgleish/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "Covid vaccine booster now does more harm than good, says Prof ANGUS DALGLEISH – Philosophers Stone", "cleaned_text": "Professor Angus Dalgleish is Professor of Oncology at St Georges Hospital Medical School London. He is renowned for his ground-breaking work into HIV/AIDS. His conclusions on the Covid virus confound the Government line. We invite you to make up your own mind.\n\nCoronavirus: Dr Hilary updates on second booster rollout in 2022\n\nThe Government has just announced they are recommending and making available Covid vaccine boosters for the spring and summer, with Steve Barclay, Minister of Health, saying it will make everybody safe.\n\nWhat on earth is going on here? Last week the Policy Exchange Forum, who you would have thought would be pushing for objective assessment and open debate, held a forum entitled ‘What is the future for vaccines policy?’ with speakers from the Government and the pharmaceutical industry.\n\nHaving researched vaccines for many years and in particular looked very closely at the outcome of covid vaccination policies throughout the world, I was very interested to attend.\n\nI was initially accepted but after filling out the form I was informed it was oversubscribed and I could however watch on a video link, where I was able to observe the many empty seats available!\n\nWhat followed was truly unbelievable.\n\nThe speakers were all in self-congratulatory mood for a wonderful vaccine programme and even more pleased with themselves that they were going to roll it out at least twice over the next year and that they had plans for vaccines for everything in the future.\n\nVery few questions were selected and they were all essentially sycophantic comments.\n\nI have been a member of a number of groups researching and lobbying the true effectiveness of Covid vaccines, particularly in children and young adults. As a result of many such similarly minded groups, the vaccine has been withdrawn for everybody under 50, which is the case throughout much of Europe, although that figure has been raised to 75 in some countries.\n\nMeanwhile, it has been reported that the Government is increasing the number of people dealing with vaccine injuries up from a current four people to 80. This is absolutely staggering.\n\nThe government is recommending Covid vaccine boosters for the spring and summer (Image: Getty)\n\nThe Government is dealing with an avalanche of vaccine injuries on one hand, whilst persuading everybody else over 50 to continue with this madness.\n\nThis Forum did not address once any negative downside of the vaccine programme, nor admit the horrendous side effect profile that so many people have had to put up with.\n\nHaving boasted about the world-leading vaccine programme with AstraZeneca, there was no mention of why it has been quietly dropped, even though you do not have to look far to see the enormous number of reports of cardiac conditions and strokes.\n\nWhat is even more bizarre is that these side effects are not confined to AstraZeneca but are also widespread (moreso in some cases) in the current messenger RNA vaccines of Pfizer and Moderna.\n\nWhy are they still being offered when the yellow card system as the MHRA has far more yellow card adverse reactions reports than all the other vaccines ever made available over the last 50 years in the UK?\n\nThis alone should have led to the total cessation of the vaccine programme, as was the case in the 1976 swine and flu outbreak in America. The vaccines used in over 40m people were closely monitored and as soon as it became clear that the numbers of spinal paralyses, known as Guillain-Barré Syndrome were slowly rising at four to five times the normal level expected, the vaccine programme was pulled immediately.\n\nI believe that we reached this point with the Covid vaccine 18 months ago.\n\nSo why has it continued to be not only made available but actively encouraged? It is outrageous that the NHS has spent so much time and effort (including GP time) phoning and harassing people to get a vaccine that not only do they not need but is increasing side effect damage with each booster.\n\nThe amount of time and effort spent on this is certainly one reason why the NHS has failed to make any impact on the catch-up from the carnage wrecked by the totally inappropriate and ill-thought through lockdown policies.\n\nWith regards to the side effects, they are particularly severe in young adults, who clearly were never at risk of dying from Covid any more than they were from the annual flu.\n\nThe rise in cardiac damage, excess stroke and death did not start in the young people until the vaccine programmes were rolled out and many leading cardiologists have been making it very clear that the side effect profile is way in excess of any potential benefit.\n\nWe have been brought up on a diet of ‘follow the science’ through this pandemic but there now appears to have been no science performed whatsoever, at any stage – it is pure political hegemony.\n\nRight at the beginning of the pandemic I co-authored two major papers, one with my Norwegian colleagues, pointing out that this virus has been engineered and clearly had escaped from a laboratory, with the warning that the virus had an 80 percent homology with human proteins and that the spike protein should not be used in its entirety for vaccines.\n\nUnfortunately, every major vaccine manufacturer in the world chose to ignore this.\n\nThe second paper reviewed all the attempts to vaccinate against coronaviruses to date and noted that not only had they all failed but they had induced severe side effects in primates (monkeys) and that even if a good immune response was induced then it would not work for variants as the immune system would not adapt to minor variations, such as we have seen with Omicron, and that the response would enhance other infections.\n\nThis explains the observation that people who receive boosters are more likely to go down with a viral infection than those who do not.\n\nThe evidence that the vaccines are of any use is close to zero as can be expected and were presented to the House by Andrew Bridgen in great detail.\n\nHowever, as soon as he started to present ‘the science’ all the MPs walked out.\n\nIt is a national disgrace that the MPs did not listen to the facts and debate the issue.\n\nIt is now official that one in 800 people who received the vaccine develop severe adverse events or disability.\n\nFocusing on the age group of 50-55 year-olds who are being offered the vaccine, the data clearly shows that you need to vaccinate 40,000 of these people to prevent one hospitalisation from Covid and hundreds of thousands of people to stop one person entering intensive care.\n\nThis is clearly madness as one in 800 will die or be in intensive care, therefore far more people are being treated for adverse vaccine events than for any Covid issues prevented!\n\nThe very best justification for the very elderly does not stack up either as in order to prevent one hospitalisation the vaccine programme would have caused at least one serious adverse event, resulting in death or hospitalisation.\n\nWhen you consider how much the Government has paid for these vaccines, the fact that the people giving the vaccines are all being paid to give them, whether at GP surgeries or vaccine centres, this translates into the Government spending between £2m and £11m to prevent ONE hospitalisation from a Covid-like virus, depending upon age.\n\nIf this was not bad enough, the side effect profile is getting worse and broadening and I and many oncologists from around the world have been alarmed at the sudden increase in cancer relapses and new cancer growths, which only have a recent Covid booster vaccine in common.\n\nThis is put down as scaremongering (by the same people who were keen to threaten you with variants all the time to make you stay at home) and cases dismissed as mere anecdotes.\n\nHowever, there is very good science involved on the issues of over vaccination.\n\nGiving a booster vaccine for Covid is associated with T-cell suppression and a change in the type of antibody induced which, taken together, explains why the immune system is no longer able to control the cancers it was previously doing very well.\n\nThe first eminent cardiologist to point out the destruction of these vaccines on his cardiac patients, Aseema Malhotra, at a GP Forum in Scotland, where we had been warned that some of the doctors had branded us dangerous lunatics from England.\n\nHowever, having been given a chance to present our data, we were thanked by the majority of the GPs present for explaining scientifically why they were observing so much damage post their Covid booster and why they would not be giving any more again.\n\nIt is high time that the Government and all the available authorities woke up to this disgrace and stopped pushing a vaccine technology around messenger RNA, which clearly is no longer fit to be rolled out for infectious diseases.\n\nOthers have suggested that the failure to halt the programme may be related to either the fear of admitting that the programme was wrong (as revealed by Isabel Oakeshott’s review of Matt Hancock’s WhatsApp discussions) or that the Government has bought far too many of the vaccines and need to use them up, as it were.\n\nWhatever the reason, there is no justification for pursuing messenger RNA based vaccines, particularly when the recent Moderna trial showed that a messenger RNA flu vaccine was not only no better than any other available vaccine but also had far worse side effects.\n\nThat alone should be the death nail for this technology for infectious diseases.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.express.co.uk/search?s=Prof%20Angus%20Dalgleish&b=1", "https://www.express.co.uk/comment/expresscomment/1756038/vaccine-booster-covid-health-government-steve-barclay", "https://www.express.co.uk/latest/coronavirus", "https://www.express.co.uk/latest/steve-barclay", "https://www.youtube.com/results?search_query=Dr+Hilary+2nd+booster", "https://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "https://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "https://philosophers-stone.info/2020/10/17/covid-19-excess-mortalities-viral-cause-impossible-drugs-with-key-role-in-about-200000-extra-deaths-in-europe-and-the-us-alone/", "https://philosophers-stone.info/2022/02/17/pfizergate-scandal-the-worldwide-cover-up-of-data-to-disguise-the-fact-covid-19-vaccines-cause-vaids/", "https://philosophers-stone.info/2021/06/07/10570-dead-405259-injuries-european-database-of-adverse-drug-reactions-for-covid-19-vaccines/", "https://philosophers-stone.info/2020/07/08/awan-minutes-to-midnight-finding-hillarys-blackberries-and-everything-after/", "https://philosophers-stone.info/2020/07/15/leading-corona-researchers-admit-that-they-have-no-scientific-evidence-of-the-existence-of-a-virus/", "https://philosophers-stone.info/2021/12/22/spanish-msm-publishes-some-covid-truths-rna-injections-do-not-vaccinate/"], "authors": [], "publish_date": "9 April 2023"}