{"result_id": "241010", "URL": "http://philosophers-stone.info/2021/09/12/breaking-three-studies-published-by-the-cdc-uk-government-oxford-university-find-the-covid-19-vaccines-do-not-work/", "timestamp": "2023-04-25 16:48:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://philosophers-stone.info/2021/09/12/breaking-three-studies-published-by-the-cdc-uk-government-oxford-university-find-the-covid-19-vaccines-do-not-work/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "BREAKING – Three studies published by the CDC, UK Government & Oxford University find the Covid-19 Vaccines do not work – Philosophers Stone", "cleaned_text": "A graduate of Yale University who also obtained a PHD at Princeton University and an MD degree from the John Hopkins University School of Medicine has published a paper in which she concludes that mandating the public to take a vaccine is a harmful and damaging act because of excellent scientific research papers which clearly demonstrate the vaccines do not prevent infection or transmission of Covid-19.\n\nNina Pierpoint (MD, PhD) published a paper on September 9th analysing various studies that were published in August 2021 which prove the alleged Delta Covid-19 variant is evading the current Covid-19 injections on offer and therefore do not prevent infection or transmission of Covid-19.\n\nThe Doctor of Medicine explained in her published paper that vaccines aim to achieve two ends –\n• Protect the vaccinated person against the illness\n• Keep vaccinated people from carrying the infection and transmitting it to others.\n\nHowever, the Doctor of Medicine writes that herd immunity will not be reached through vaccination because new research in multiple settings shows that the alleged Delta variant produces very high viral loads which are just as high, and in some cases higher in the vaccinated population compared to the unvaccinated population.\n\nTherefore, according to Nina Pierpoint (MD, PhD), vaccine mandates; such as the one now enforced in the UK for all Care Home staff, have no justification because vaccinating individuals does not stop or even slow the spread of the alleged dominant Delta Covid-19 variant.\n\nWhich leads the Doctor of Medicine to conclude that natural immunity is much more protective than vaccination because all severities of Covid-19 illness produce healthy levels of natural immunity.\n\nNine Pieroint (MD, PhD) cites three studies whose findings and data support her conclusions and these include a study published August 6th 2021 in the Centre for Disease Control’s (CDC) ‘Morbidity and Mortality Weekly Report’, another study published August 10th 2021 by Oxford University, and a final study published August 24th 2021 which was funded by the UK Department for Health and Social Care.\n\nThe CDC study focused on 469 cases among Massachusetts residents who attended indoor and outdoor public gatherings over a two week period. The results found that 346 of the cases were among vaccinated residents with 79% of them presenting with alleged Covid-19 symptoms, and 1.2% being hospitalised.\n\nHowever the remaining 123 cases were among the unvaccinated population with just 1 person being hospitalised (0.8%. No deaths occurred in either group. The study also found that viral loads were found to be very similar among the vaccinated and unvaccinated, meaning they were equally infectious.\n\nThe Oxford University study examined 900 hospital staff members in Vietnam who had been vaccinated with the Oxford / AstraZeneca viral vector injection between March and April 2021. The entire hospital staff tested negative for the Covid-19 virus in mid May 2021 however, the first case among the vaccinated staff members was discovered on June 11th.\n\nAll 900 hospital staff were then retested for the Covid-19 virus and 52 additional cases were identified immediately, forcing the hospital into lockdown. Over the next two weeks, 16 additional cases were identified.\n\nThe study found that 76% of the Covid-19 positive staff developed respiratory symptoms, with 3 staff members developing pneumonia and one staff member requiring three days of oxygen therapy. Peak viral loads among the fully vaccinated infected group were found to be 251 times higher than peak viral loads found among the staff in March – April 2020 when they were not vaccinated.\n\nThe UK Department of Health & Social Care study is an analysis of ongoing population wide SARS-CoV-2 monitoring in the UK and includes measures of viral load among the population.\n\nThe study found that viral loads among the vaccinated and unvaccinated population are virtually the same, and much higher than had been recorded prior to the Covid-19 injection roll-out. The study also found that the majority of cases among the vaccinated population were presenting with symptoms when they became positive.\n\nThe authors of the study conclude that the Pfizer and Oxford / AstraZeneca injection have lost efficacy against what they claim to be the Delta Covid-19 variant, but they maintain that they are substantially effective at keeping people from becoming infected with the Delta variant in the rang of 67% to 80%.\n\nNine Pierpoint (MD, PhD) rightly asks in her paper how they can conclude this when 82% of the random sample of new positive PCR tests in the study were fully vaccinated people.\n\n‘If a vaccine reduces the risk of becoming infected by two-thirds (67%), we would expect the proportion of vaccinated in the positive sample to be less than the proportion of vaccinated in the population.\n\n\n\nSay we start with 1000 people in the country, of whom we will randomly sample 100. The country is 80% vaccinated. This means that in our sample of 100 we have 80 vaccinated and 20 unvaccinated people.\n\n\n\nLet’s say that the virus has infected 10% of the people across the sampling period, or 10 total cases. If 8 of the infected are among the vaccinated, and 2 in the unvaccinated (80% and 20% of the positives, matching the ratio of vaccinated and unvaccinated in the population), the vaccine has made no difference in whether one can get infected (0% efficacy). If the vaccine is 67% effective, the cases in the vaccinated group would be reduced by 2/3 to 2.67 cases, and the total cases would be only 4.67 cases (2.67 vaccinated and 2 unvaccinated).\n\n\n\nThis means that only 2.67/4.67 or 57% of the cases would be in the vaccinated group, and 43% in the unvaccinated. (We can go back to 10% overall being positive just using ratios, yielding 5.7 cases among the vaccinated and 4.3 among the unvaccinated.)\n\n\n\nThis is why the proportion vaccinated in the infected sample, very close to the proportions vaccinated in the total population, are incompatible with the efficacy numbers generated by the authors.\n\n\n\nIt appears to me—as in the Massachusetts study—that the vaccine is not decreasing susceptibility to infection at all, and is in reality somewhere between slightly (insignificantly) decreasing susceptibility and slightly increasing susceptibility to the Delta variant.\n\n\n\nThe UK study is clear that viral load (and thus infectiousness to others) is much greater with Delta than with Alpha, and that, with Delta, viral load and infectiousness are equal in vaccinated and unvaccinated infected people.’\n\nThe above three studies lead Nina Pierpoint (MD, PhD) to conclude in her paper that mandating others to take a vaccine is a potentially harmful, damaging act.\n\nShe writes that since the principal reason of a mandate is to protect others from infection, and these studies prove beyond a shadow of a doubt that they do not do this, those who mandate the Covid-19 injections may wish to seek legal councel regarding their culpability and liability for potential long-lasting harm to those whom they pressure into vaccination with the threat of exclusion from employment, education or society.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://theexpose.uk/2021/09/12/three-studies-find-the-covid-19-vaccines-do-not-work/", "https://ninapierpont.com/", "https://theexpose.uk/wp-content/uploads/2021/09/Pierpont-Why-mandated-vaccines-are-pointless-final-1.pdf", "https://theexpose.uk/wp-content/uploads/2021/09/Pierpont-Why-mandated-vaccines-are-pointless-final-1.pdf", "https://ninapierpont.com/", "https://www.cdc.gov/mmwr/volumes/70/wr/pdfs/mm7031e2-H.pdf", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3897733", "https://www.medrxiv.org/content/10.1101/2021.08.18.21262237v1", "https://www.cdc.gov/mmwr/volumes/70/wr/pdfs/mm7031e2-H.pdf", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3897733", "https://www.medrxiv.org/content/10.1101/2021.08.18.21262237v1", "https://theexpose.uk/wp-content/uploads/2021/09/Pierpont-Why-mandated-vaccines-are-pointless-final-1.pdf", "https://theexpose.uk/2021/09/12/three-studies-find-the-covid-19-vaccines-do-not-work/", "http://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "http://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "http://philosophers-stone.info/2021/01/01/developers-of-oxford-astrazeneca-vaccine-tied-to-uk-eugenics-movement/", "http://philosophers-stone.info/2021/09/15/13-reasons-why-you-should-not-allow-your-child-to-get-the-covid-19-vaccine/", "http://philosophers-stone.info/2022/02/17/pfizergate-scandal-the-worldwide-cover-up-of-data-to-disguise-the-fact-covid-19-vaccines-cause-vaids/", "http://philosophers-stone.info/2020/11/05/what-the-evil-bastards-have-planned-compulsory-vaccination-this-is-the-argument-theyll-use/", "http://philosophers-stone.info/2021/01/09/excerpt-from-2009-corbett-report-101-study-finds-link-between-h1n1-and-flu-shots/", "http://philosophers-stone.info/2020/11/30/external-peer-review-of-the-rtpcr-test-to-detect-sars-cov-2-reveals-10-major-scientific-flaws-at-the-molecular-and-methodological-level-consequences-for-false-positive-results/"], "authors": [], "publish_date": "12 September 2021"}