{"result_id": "241030", "URL": "https://philosophers-stone.info/2021/11/20/germany-dr-thomas-jendges-head-of-clinic-commits-suicide-covid-19-vaccine-is-a-genocide/", "timestamp": "2023-04-25 16:49:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://philosophers-stone.info/2021/11/20/germany-dr-thomas-jendges-head-of-clinic-commits-suicide-covid-19-vaccine-is-a-genocide/", "encoding": "UTF-8"}, "image": null, "domain": "philosophers-stone.info", "title": "Germany | Dr Thomas Jendges Head of Clinic, Commits Suicide “COVID-19 Vaccine Is a Genocide” – Philosophers Stone", "cleaned_text": "About Covid ‘vaccines’ he wrote:\n\nThese are “bio-warfare agents”. He is also said to have described the vaccine in his letter as genocide and a crime against humanity”\n\nIn Germany, the Head of the Chemnitz Clinic, Dr Thomas Jendges, committed suicide saying he no longer wants to be part of the Genocide happening vis the COVID-19 Vaccine. #genocide #pandemic #covid19 #covidvaccine\n\nThe Chief of a Clinic in Chemnitz, Germany committed suicide. In a letter found on the scene, he explains that he can no longer be part of the Genocide.\n\nOn Tuesday, Dr Thomas Jendges, Head of the Chemnitz Clinic, committed suicide by jumping from the top of the clinic’s building in Flemmingstrasse, Germany, according to Bild . He was 55 years old.\n\nThe Docteur died on the spot from his injuries. Jendges had only been appointed sole managing Director of the Chemnitz Clinic since October 1st 2021. Since April, he was acting as Managing Director of East Germany’s largest municipal hospital.\n\nSven Schulze explained on Tuesday afternoon, on the city’s website that, the Chemnitz Clinic, despite the tragic death of Dr. Thomas Jendges is still able to act. Schulze: “The expanded management team will be in charge of business in the coming days.”\n\n“It is with great dismay that I have just learned of the tragic death of Dr. Thomas Jendges’ experience. Last night (Monday, ed) we talked at length about the difficult situation of the crown “, said the mayor of Chemnitz Sven Schulze (50, SPD) on Tuesday morning.\n\nReports of a letter that the deceased alledgly left behind are circulating. Jendges alledgly killed himself to set an example against the corona vaccinations. These are “bio-warfare agents”, so it says in the postings. He is also said to have described the vaccine in his letter as genocide and a crime against humanity”, according to Tag24.\n\nAccording to Las repúblicas, In the lengthy farewell letter Dr. Thomas Jendges wrote before his suicide and demanded its publication, he is said to have harshly criticized the information policy of governments in dealing with the dangerousness of Covid vaccines. The constant lies and deceit to the patient and the vaccinated that the vaccines are supposedly harmless, he could no longer bear them, it is said in the letter.\n\n\n\nHe condemns vaccinating the population with experimental and lethal vaccines against Covid-19, which is in fact more of a biological warfare agent created and manipulated for that use, than for any other known utility. For Dr. Thomas Jendges a genocide and a crime against humanity is taking place, they report that he says the letter, according to the German press such as the Bild newspaper.\n\n\n\nBecause the mayor threatened to fire him if he no longer stayed in the submissive line imposed by government order and refused to vaccinate patients at the clinic, there were presumably no more options for Jendges. This director has not wanted to support a crime of the federal government, the state government and his faithful henchmen. So she considered that his suicide was the only way to oppose him.\n\n\n\nThese are some details of the farewell letter that are currently in circulation. Although Dr. Jendges has ordered that his entire suicide letter be published, according to the current state of knowledge of the mayor of Chemnitz, Sven Schulze of the SPD, who continues to prevent this publication. Numerous groups have formed in various forums demanding that Schulze abandon his blocking attitude and finally respect Jendges’ last wish.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "758", "height": "426", "embed_code": "<iframe title=\"Dr. Thomas Jendges Chemnitz Clinic director kills himself. Rest in Peace\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/A-_NZ_ES7Ug?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/A-_NZ_ES7Ug?feature=oembed"}], "links": ["https://stessnews.online/2021/11/17/germany-dr-thomas-jendges-head-of-clinic-commits-suicide-covid-19-vaccine-is-a-genocide/amp/", "https://m.bild.de/regional/chemnitz/chemnitz-news/trauer-um-dr-thomas-jendges-chemnitzer-klinik-chef-stuerzt-in-den-tod-78126224.bildMobile.html#%23%23wt_ref=https%3A%2F%2Fduckduckgo.com&wt_t=1636799738520###wt_ref=https%3A%2F%2Fwww.ukcolumn.org%2F&wt_t=1637132146457", "https://www.tag24.de/amp/chemnitz/lokales/grosser-wirbel-um-angeblichen-abschiedsbrief-von-chemnitzer-klinik-chef-2205407", "https://www.google.com/amp/s/www.lasrepublicas.com/2021/11/12/el-jefe-de-la-prestigiosa-clinica-chemnitz-se-habria-suicido-por-las-mentiras-sobre-la-vacunacion/amp/", "https://stessnews.online/2021/11/17/germany-dr-thomas-jendges-head-of-clinic-commits-suicide-covid-19-vaccine-is-a-genocide/amp/", "http://philosophers-stone.info/2020/11/30/voices-against-the-locking-and-isolation-of-people/", "http://philosophers-stone.info/2021/07/11/ivermectin-a-potential-anticancer-drug-derived-from-an-antiparasitic-drug/", "http://philosophers-stone.info/2020/12/29/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/", "http://philosophers-stone.info/2021/06/27/latest-cdc-vaers-data-show-reported-injuries-surpass-11000-in-ages-12-to-17-following-covid-vaccines/", "http://philosophers-stone.info/2020/12/15/the-bad-cops-how-minneapolis-protects-its-worst-police-officers-until-its-too-late/", "http://philosophers-stone.info/2023/04/16/whats-in-the-pfizer-documents-dr-naomi-wolf-ceo-the-daily-clout/", "http://philosophers-stone.info/2020/07/08/awan-minutes-to-midnight-finding-hillarys-blackberries-and-everything-after/", "http://philosophers-stone.info/2021/01/09/excerpt-from-2009-corbett-report-101-study-finds-link-between-h1n1-and-flu-shots/"], "authors": [], "publish_date": "20 November 2021"}