{"result_id": "242025", "URL": "https://pollution.news/2020-02-02-ads-warning-about-dangers-of-5g-banned-by-advertising-authority.html", "timestamp": "2023-04-25 16:49:41 CEST+0200", "meta": {"description": "Questioning the safety of untested 5G technology is now illegal in the United Kingdom, at least if you try to do it on an advertisement billboard. The Advertising Standards Authority (ASA) has reportedly outlawed what it claims is a “misleading” advertising campaign put out by Electrosensitivity-U.K. about the dangers of 5G, which include “reduced male […]", "lang": "en", "keywords": "5g,ads,advertising,advertising authority,Advertising Standards Authority,ASA,badpollution,banned,censored,conspiracy,dangerous tech,deception,depopulation,disease causes,electropollution,electrosensitivity,Glitch,government,Great Britain,privacy watch,public realth,telecom,United Kingdom", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://pollution.news/2020-02-02-ads-warning-about-dangers-of-5g-banned-by-advertising-authority.html", "encoding": "UTF-8"}, "image": null, "domain": "pollution.news", "title": "Ads warning about dangers of 5G BANNED by Great Britain’s advertising “authority”", "cleaned_text": "Ads warning about dangers of 5G BANNED by Great Britain’s advertising “authority”\n\nQuestioning the safety of untested 5G technology is now illegal in the United Kingdom, at least if you try to do it on an advertisement billboard.\n\nThe Advertising Standards Authority (ASA) has reportedly outlawed what it claims is a “misleading” advertising campaign put out by Electrosensitivity-U.K. about the dangers of 5G, which include “reduced male fertility, depression, disturbed sleep and headaches, as well as cancer.”\n\nA series of posters that were put up around town back in July and August of 2019, asking How safe is 5G? followed by various quotes from health professionals, has been outlawed by the ASA, effectively silencing the conversation about 5G that very much needs to be had for public safety purposes.\n\nYou can view the ad in question at this link.\n\nAs you’ll notice, the ad draws attention to the fact that the general public is being treated as human guinea pigs in a massive EMF (electromagnetic frequency) experiment, the long-term health consequences of which remain unknown. It also points to an Italian study which found that animals exposed to 5G developed brain and heart tumors.\n\n“Scientists and doctors call for a moratorium on the roll-out of 5G,” reads another quote on the poster from a group known as The 5G Appeal. “5G will substantially increase exposure to radio frequency electromagnetic fields that have been proven to be harmful for humans and the environment.”\n\nIn the eyes of the ASA, none of this is true because the telecommunications industry claims that 5G is perfectly safe. So, this is all that needs to be said or done about 5G, and the British people need to just shut up and accept 5G towers and micro-cells being placed every couple hundred yards across their neighborhoods and cities.\n\nSure, there’s a little more to it than that. The British government is also relying on industry-conducted “studies,” all of which have conveniently determined that 5G is 100 percent safe and effective – just like vaccines are 100 percent safe and effective, according to the government.\n\n5G is a radioactive weapon that the deep state will use to surveil the global population in real time\n\nBut the mini-documentary 5G: Next Gen Health Dangers, available for viewing at Brighteon.com, tells a much different story – one that the ASA doesn’t want you to hear.\n\nAs it turns out, 5G is not only a mass-poisoning tool to blast the public with deadly radiation, it’s also a real-time surveillance tool for keeping 24/7 tabs on the public without warrant or probable cause – meaning 5G is an affront to the Fourth Amendment to the United States Constitution.\n\nThe U.K. doesn’t share our Constitution, of course, but it doesn’t really matter as 5G is also being rolled out across the late-great U.S. of A. with no regard whatsoever for its impact on public health.\n\n“The entire point of 5G, flatly stated, is to create the world’s most invasive surveillance network that also doubles as an electromagnetic weapons platform that can target specific individuals with focused beams of cancer-causing radiation,” warns Mike Adams, the Health Ranger, adding that the movers and shakers know full well the many dangers associated with 5G, and this is a big reason why they want to implement it.\n\n“The tech industry is fully aware of these dangers but pushed 5G anyway, censoring critics of the technology and trying to silence the science that exposes the public health risks associated with this extreme technology.”\n\nElectrosensitivity-U.K. has also published its own list of research about the dangers of 5G exposure that you can access at this link.\n\nFor more related news about the dangers of 5G radiation, be sure to check out EMF.news.", "opengraph": {"title": "Ads warning about dangers of 5G BANNED by Great Britain’s advertising “authority”", "type": "article", "url": "https://www.pollution.news/2020-02-02-ads-warning-about-dangers-of-5g-banned-by-advertising-authority.html", "site_name": "Pollution News", "description": "Questioning the safety of untested 5G technology is now illegal in the United Kingdom, at least if you try to do it on an advertisement billboard. The Advertising Standards Authority (ASA) has reportedly outlawed what it claims is a “misleading” advertising campaign put out by Electrosensitivity-U.K. about the dangers of 5G, which include “reduced male […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2020/02/Censored-Freedom.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.informationliberation.com/?id=61121", "http://www.informationliberation.com/?id=61121", "https://www.naturalnews.com/2020-01-03-brighteon-films-new-5g-mini-documentary-imminent-danger-of-5g-cell-towers.html", "https://www.brighteon.com/aacb48c0-08e0-4041-8acf-9d0584cc28b4", "http://www.es-uk.info/research/", "http://emf.news", "http://www.informationliberation.com/?id=61121", "https://www.naturalnews.com/2020-01-03-brighteon-films-new-5g-mini-documentary-imminent-danger-of-5g-cell-towers.html", "https://www.brighteon.com/aacb48c0-08e0-4041-8acf-9d0584cc28b4", "http://www.es-uk.info/research/"], "authors": [], "publish_date": null}