{"result_id": "242002", "URL": "https://pollution.news/2019-02-12-glyphosate-water-filter-lab-test-results-released-by-natural-news.html", "timestamp": "2023-04-25 16:49:23 CEST+0200", "meta": {"description": "As promised, Natural News is now releasing the full video showing the surprising results of the water filters vs. glyphosate lab tests. Our lab, CWC Labs, is the only laboratory in the world carrying out these tests and releasing the results directly to the public, for free. To carry out the tests, we diluted glyphosate […]", "lang": "en", "keywords": "Aqua Pail,big berkey,clean water,cwc labs,glyphosate,goodcancer,goodpollution,herbicide,lab tests,Mike Adams,Natural.news,Seychelle,tap water,water filters,Zero Water", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://pollution.news/2019-02-12-glyphosate-water-filter-lab-test-results-released-by-natural-news.html", "encoding": "UTF-8"}, "image": null, "domain": "pollution.news", "title": "Water filter glyphosate removal lab test results released by Natural News – see the full video here", "cleaned_text": "Water filter glyphosate removal lab test results released by Natural News – see the full video here\n\nAs promised, Natural News is now releasing the full video showing the surprising results of the water filters vs. glyphosate lab tests. Our lab, CWC Labs, is the only laboratory in the world carrying out these tests and releasing the results directly to the public, for free.\n\nTo carry out the tests, we diluted glyphosate concentrate into water to create a 2ppm solution (two parts per million, or 2 ug / ml). This solution was then poured through all the water filters and the resulting water was collected and labeled. Before this, every water filter was thoroughly rinsed with clean, laboratory-grade purified water to flush their filters.\n\nThe resulting “filtered” glyphosate water was then analyzed using a high-end Waters triple quad mass spec instrument (LC-MS-MS), against a multi-point curve to quantitate the concentration of glyphosate remaining in the post-filtered water. (The video below shows the actual screen shots of the chromatography and mass spectrometry.)\n\nWe tested water filters from all the following brands. Note that we are receptive to testing more brands in a follow-up round of testing. No brands were deliberately excluded from these tests; we simply had to limit the testing to a certain number of water filters because, for the most part, we had to purchase these water filters ourselves (see full explanation and disclaimer below, as a few brands gave us water filters at no cost).\n\nWater filters were significantly more effective than we had predicted\n\nThree different categories of water filters were tested: Sports bottles, countertop pitchers, and countertop gravity filters. (We have not yet testing portable pump filters used by hikers.) On average, the sports bottles performed poorly, the countertop pitchers performed better, and the big gravity filters performed the best.\n\nThe good news is that these tests found water filters to be far more effective than we had predicted. In fact, these tests found one countertop filter that removed 100% of the glyphosate. Similarly, two of the large, countertop gravity filters were also confirmed to remove 100% of glyphosate. (See the video below for the actual brands that achieved 100% removal.)\n\nRemoving glyphosate from water is extremely difficult from a chemistry point of view because of the unique properties of the glyphosate molecule. It is very small (roughly 169 daltons) and highly polar, making it soluble in water and very difficult to separate from water. In fact, detecting glyphosate on lab instruments requires unique, complex chemistry far beyond the typical chromatography chemistry used to detect pesticides or common contaminants. (Read Glyphosate.news for more news updates on this cancer-causing herbicide.)\n\nVery few labs in America are able to accurately test for glyphosate. CWC Labs, which I founded, worked for two years to refine a glyphosate method that worked reliably. CWC Labs is ISO accredited and is a recognized pioneer in forensic food analysis and food safety testing. With the help of many experienced chemists, scientists and mass spec experts, we finalized a mass spec analysis method for glyphosate that requires no post-column derivatization and has virtually no tailing on the chromatography, allowing for accurate, consistent quantitation. Our most recent quant curve fit coefficient, for example, was .999991, describing a near-perfect linear response to varying levels of analyte concentration.\n\nWatch the full video here and see which filters did the best\n\nThis independent lab analysis testing is made possible by your support of the Health Ranger Store, where we are applying glyphosate testing (and certification) to an ever-expanding list of our in-house products. To continue to support our mission, consider shopping at HealthRangerStore.com where you’ll find over 700 lab-tested products for healthy living and healthy home.\n\nThe video is available exclusively on Brighteon.com:\n\nMany more glyphosate experiments are yet to come from CWC Labs. In fact, we have a list of 16 experiments to conduct and publish, just concerning glyphosate herbicide.\n\nACTION ITEM: Be sure to subscribe to the Natural News email newsletter to receive email alerts as these test results are released.\n\nTo maintain ethics in science, it is customary for those who carry out scientific experiments to disclose any potential conflicts of interest that might be present. As mentioned in the video, we purchased most of the water filters ourselves, but were given some filters for free. In the video, I stated that AquaPail gave us a filter for testing, but I did not recall at the time that Seychelle also gave us water filters for testing. So I’m adding that disclaimer here. All the other filters were purchased by us.\n• No water filter manufacturer paid us for testing. In fact, they were not even aware that we were conducting these tests.\n• My online store (HealthRangerStore.com) sells the Big Berkey water filter. However, it’s worth noting that we only chose to sell that filter after conducting heavy metals tests several years ago, finding that the Big Berkey removed nearly 100% of all heavy metals. (See WaterFilterLabs.com for detailed results of heavy metals testing.) From that test result, we decided to offer Big Berkey to our customers, since it was the most effective filter we could find. Nevertheless, Big Berkey was not aware of these new glyphosate tests and did not pay us any fees to conduct this test, nor did they give us a free filter for testing (we ran these new tests on a Big Berkey that we had purchased ourselves).\n• There are many other water filter brands where were not included in these test, but we are welcome to testing those brands if those manufacturers would send us a water filter for testing. Some of the requested brands we’re hearing about from readers include Alexa Pure, Aqua Tru and portable filters (pump filters) used by hikers. We welcome receiving filters from other companies as well, and we plan to conduct another round of testing to include those brands that wish to participate.\n• The reason this testing is so expensive for us is because all the water filters can no longer be used for human consumption after they have been subjected to this glyphosate test. As you would expect, the filter media become inundated with glyphosate molecules, which might be slowly released over time due to future use of the filters, theoretically releasing small concentrations of glyphosate into future water flows. We have not tested this effect, but because it is theoretically possible, these water filters in our lab can never be used by consumers due to safety concerns. In effect, we can only use these water filters for lab experiments from this point forward.\n\nCWC Labs is available to help water filter manufacturers test the glyphosate removal capabilities of their products\n\nFinally, because our mission has long been to help the public avoid exposure to toxic pesticides and herbicides, I am announcing today that CWC Labs is available to work with water filter manufacturers who wish to test their products (or various media variations of their products) for glyphosate removal efficacy as part of their R&D process. Any financial relationship with a water filter manufacturer would, of course, be openly disclosed in any future testing results.\n\nWe are able to offer private, validated glyphosate testing with sub-ppb detection capabilities and extremely accurate quantitation and full reporting for your own validation files. We are an ISO-accredited laboratory. Contact us at CWClabs.com if you represent a water filter manufacturer and are interested in this specialized glyphosate testing. Our lab also offers heavy metals testing via ICP-MS, with detection capabilities below 1 ppb. We do not yet offer a full complement of pesticide tests, but we are refining a multi-analyte method which will be available later this year.\n\nMuch more testing is yet to come from CWC Labs, Glyphosate.news and NaturalNews.com.\n\nWe are doing the job the EPA refuses to do. And we’re doing it without government money (i.e. money confiscated from taxpayers to waste on big government).\n\nThank you for your continued support of our mission for real science, public transparency and safe products for the public.", "opengraph": {"title": "Water filter glyphosate removal lab test results released by Natural News – see the full video here", "type": "article", "url": "https://www.pollution.news/2019-02-12-glyphosate-water-filter-lab-test-results-released-by-natural-news.html", "site_name": "Pollution News", "description": "As promised, Natural News is now releasing the full video showing the surprising results of the water filters vs. glyphosate lab tests. Our lab, CWC Labs, is the only laboratory in the world carrying out these tests and releasing the results directly to the public, for free. To carry out the tests, we diluted glyphosate […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2019/02/Glyphosate-water-pitchers.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://naturalnews.com", "https://www.brighteon.tv", "http://Glyphosate.news", "http://cwclabs.com", "http://healthrangerstore.com", "http://HealthRangerStore.com", "http://Brighteon.com/6001296356001", "https://www.naturalnews.com/Readerregistration.html", "http://HealthRangerStore.com", "http://WaterFilterLabs.com", "http://CWClabs.com", "http://Glyphosate.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2019-02-12-glyphosate-water-filter-lab-test-results-released-by-natural-news.html&linkname=Water%20filter%20glyphosate%20removal%20lab%20test%20results%20released%20by%20Natural%20News%20%E2%80%93%20see%20the%20full%20video%20here", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}