{"result_id": "242001", "URL": "http://pollution.news/2019-03-15-study-air-pollution-may-damage-healthy-bacteria-in-the-respiratory-track.html", "timestamp": "2023-04-25 16:49:22 CEST+0200", "meta": {"description": "Over the past few years, cars have become more affordable, which has led to a huge boom of private vehicles on our roads. While they sure are convenient, the sudden dramatic rise has some grave consequences for human and environmental health. The latest data from the World Health Organization (WHO) revealed that nine out of 10 […]", "lang": "en", "keywords": "Air pollution,air quality,antibiotic resistance,bacteria,black carbon,drug-resistant,infections,particulate matter,pollution,superbugs", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "http://pollution.news/2019-03-15-study-air-pollution-may-damage-healthy-bacteria-in-the-respiratory-track.html", "encoding": "UTF-8"}, "image": null, "domain": "pollution.news", "title": "Study: Air pollution allows bacteria to thrive in the respiratory track", "cleaned_text": "Study: Air pollution allows bacteria to thrive in the respiratory track\n\nOver the past few years, cars have become more affordable, which has led to a huge boom of private vehicles on our roads. While they sure are convenient, the sudden dramatic rise has some grave consequences for human and environmental health.\n\nThe latest data from the World Health Organization (WHO) revealed that nine out of 10 people breathe polluted air, making it one of the largest environmental threats to human health. In 2016, the agency estimates that 4.2 million deaths were caused by ambient pollution alone, while household air pollution, including cooking with polluting fuels and technologies, caused 3.8 million deaths in the same period. (Related: Air quality across the world has reached toxic levels.)\n\nBlack carbon, in particular, is emitted from gas and diesel engines, coal-fired power plants, and other sources that burn biomass or fossil fuel. It is a primary component of particulate matter, which is a huge contributor to air pollution. Previous research has shown that inhalation of black carbon can cause severe health issues such as respiratory and cardiovascular diseases, cancer, and birth defects.\n\nResearchers from the University of Leicester in the U.K. have now found that black carbon can alter how bacteria grow and form biofilms, resulting in disease and antibiotic resistance issues. Biofilms are communities of bacteria held together by a sticky, glue-like substance. Once they have grown to a certain size, biofilms can cause hard-to-treat infections that are extremely resistant to antibiotics.\n\nThe lead investigators — comprised of specialists in genetics, microbiology, and air pollution chemistry — identified their insights as groundbreaking. In particular, the study sheds new light on how air pollution affects human health with their research, according to lead author Julie Morrissey, a professor at the university’s genetics department.\n\n“Our research could initiate an entirely new understanding of how air pollution affects human health,” she added. “It will lead to enhancement of research to understand how air pollution leads to severe respiratory problems and perturbs the environmental cycles essential for life.”\n\nAir pollution can alter the way bacteria behave\n\nFor their study, published in the journal Environmental Microbiology, the researchers examined the effects of black carbon on bacteria living in the nose, throat, and lungs. They focused on two bacteria, Staphylococcus aureus and Streptococcus pneumoniae. Both bacteria are a leading cause of respiratory diseases and often cause antibiotic-resistance issues.\n\nDuring the four-year study, the team found that black carbon may change the way bacteria grow, improving their ability to survive and beat the human immune system. This may explain why infectious diseases arise more frequently in cities or bigger towns with high levels of air pollution.\n\nThe researchers also noted that black carbon alters the antibiotic tolerance of S. aureus while increasing the resistance of S. pneumoniae biofilms to penicillin, considered by most to be the front-line drug in the treatment of bacterial pneumonia. Additionally, the scientists reported that black carbon stimulated the spread of S. pneumoniae from the nose to the lower respiratory tract, increasing the risk of developing disease.\n\nThe team, in sum, said that their study highlights the overlooked effect air pollution has on bacteria and our health. Paul Monk, a leading expert on air pollution and a vice-chancellor at the University of Leicester, added: “This research has significant potential to initiate a global research effort to understand a hitherto unknown effect of air pollution and provide significant additional impetus to the control of pollution.”", "opengraph": {"title": "Study: Air pollution allows bacteria to thrive in the respiratory track", "type": "article", "url": "https://www.pollution.news/2019-03-15-study-air-pollution-may-damage-healthy-bacteria-in-the-respiratory-track.html", "site_name": "Pollution News", "description": "Over the past few years, cars have become more affordable, which has led to a huge boom of private vehicles on our roads. While they sure are convenient, the sudden dramatic rise has some grave consequences for human and environmental health. The latest data from the World Health Organization (WHO) revealed that nine out of 10 […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2019/03/Pollution-Air-Cars-Co2-Smog.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.who.int/news-room/air-pollution", "https://naturalnews.com/2017-02-15-air-quality-across-the-world-has-reached-toxic-levels.html", "https://www.epa.gov/air-research/black-carbon-research", "https://naturalpedia.com/cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://le.ac.uk/", "https://www2.le.ac.uk/offices/press/press-releases/2017/march/new-study-reveals-air-pollution-can-alter-the-effectiveness-of-antibiotics-and-increases-the-potential-of-disease", "http://www.environ.news/", "https://www.brighteon.tv", "https://www.medicalnewstoday.com/articles/316187.php", "https://www.who.int/news-room/air-pollution", "https://www.epa.gov/air-research/black-carbon-research", "http://www2.le.ac.uk/offices/press/press-releases/2017/march/new-study-reveals-air-pollution-can-alter-the-effectiveness-of-antibiotics-and-increases-the-potential-of-disease", "http://www.medicalnewstoday.com/articles/316187.php", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2019-03-15-study-air-pollution-may-damage-healthy-bacteria-in-the-respiratory-track.html&linkname=Study%3A%20Air%20pollution%20allows%20bacteria%20to%20thrive%20in%20the%20respiratory%20track", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}