{"result_id": "242022", "URL": "https://www.pollution.news/2022-10-06-global-warming-alternative-energy-sources-big-hoax.html", "timestamp": "2023-04-25 16:49:39 CEST+0200", "meta": {"description": "“World government wants massive profits for the wind and solar sector. They want to take away a lot of our freedoms.” – Scientist Tom Harris (Article by Miranda Sellick republished from RairFoundation.com) Nothing is what it appears to be. That heatwave that hit Europe this past summer? Twenty years ago, it was just a heatwave. […]", "lang": "en", "keywords": "badpollution,carbon emissions,climate alarmism,climate change,conspiracy,deception,Ecology,environment,fake science,global warming,globalist scam,Green New Deal,green tyranny,hoax,insanity,junk science,lies,propaganda,rational,science deception,science fraud,skeptics,Tom Harris,truth", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2022-10-06-global-warming-alternative-energy-sources-big-hoax.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "Deadly globalist scam: ‘Global warming to alternative energy sources, it’s all one big hoax’", "cleaned_text": "Deadly globalist scam: ‘Global warming to alternative energy sources, it’s all one big hoax’\n\n“World government wants massive profits for the wind and solar sector. They want to take away a lot of our freedoms.” – Scientist Tom Harris\n\nNothing is what it appears to be.\n\nThat heatwave that hit Europe this past summer? Twenty years ago, it was just a heatwave. Now, you’d be led to believe that it’s all part of the climate emergency that mankind has brought upon itself.\n\nA recent World Climate Declaration, signed by 1,100 scientists, has made the rounds on social media, claiming that there is no climate emergency. But a 2019 Cornell University study found that 99.9 percent of studies agree that humans have caused climate change.\n\nHowever, more and more scientists are speaking out to declare that the whole climate change narrative is based upon faulty science and incorrect modeling. Tom Harris, the executive director of the International Climate Science Coalition, based in Ottawa, is one of them. He describes himself as changing “from a climate alarmist to a climate realist.” He recently gave a wide-ranging interview to RAIR Foundation USA.\n\nAs a good starting point, Harris recommends the non-governmental International Panel on Climate Change publication that focuses on physical science. It’s nearly 1,000 pages long and has 1000s of peer-reviewed papers. “This one specifically shows that there’s no climate emergency. This is the kind of information that is actually being censored by government and by media,” says Harris. “I met with Catherine McKenna, who, of course, was the previous environment minister, and I gave her a copy of this and other documents, and her main comment was that it was heavy to carry back to her car. And within a week, she was attacking us as climate change deniers.”\n\nHarris asserts that the 1.2-degree temperature rise and the change in carbon dioxide, methane, and nitrous oxide levels worldwide since 1880 are minor and do not represent a threat to the planet. But the City of Ottawa used these measures to declare a climate emergency. All but two council members have voted to do away with Ottawa’s existing energy structure and replace it with wind and solar power. It’s the climate change master plan and energy evolution. “What most people in Ottawa don’t realize is that according to the city itself, and their estimates are probably lowball, they say it’s going to cost $57.4 billion. That’s almost $60,000 for every man, woman, and child in Ottawa,” says Harris. “To do this, they’re going to actually start charging us, for example, to drive into the downtown core, anybody who drives into the core will have to pay a $20 fee, you’ll have yearly fees, you’ll have massive increases in property tax, and of course, electricity prices will go through the roof because they want to replace our natural gas, which is a very clean burning effective fuel. They want to replace it with wind and solar power.”\n\nThe plan indicates an intention to build 710 industrial wind turbines taller than the Peace Tower and install 36 square kilometers of solar photovoltaics. That’s bigger than the Experimental Farm in Ottawa. Batteries will provide backup power when solar power is weak, such as the many months of limited sunlight in winter and when snow covers the panels.\n\n“And they want to do this supposedly, to save the planet?” says Harris. “The trouble is, not only is this going to cost an absolute fortune, but these batteries are highly destructive to the environment. These batteries use cobalt. And cobalt is mined by Chinese companies employing child labor in the Congo, breathing in radioactive dust in horrible working conditions. And then the cobalt is shipped to China, where again, with terrible environmental controls, the batteries are manufactured for Western green virtue signalers. “You have to ask, well, what would this sacrifice actually accomplish in the real world?”\n\nThe answer is not much. Wind turbines kill birds and bats in huge numbers. With Ontario’s growth and wind turbines, some bat species will be entirely driven to extinction. In California, thousands of golden eagles have been killed at one wind farm alone. And they’re not very reliable, producing power only about 30 percent of the time.\n\nBut the net result? You have to ask, how much of humanity’s greenhouse gas emissions does Ottawa produce? “It turns out; it’s point 0.014 percent. That’s around 100th of one percent. The actual change in temperature if Ottawa were to maintain this incredibly expensive plan all the way to the year 2100 would be one, one-thousandth of a degree Celsius for $60 billion,” according to Harris. “It’s way less than we’d ever be able to detect. It’s going to cost $60,000 for every man, woman, and child in the city; it’s going to make us very vulnerable to extreme weather, and we’ll have a very fragile energy system dependent on intermittent wind and solar power. Why would Ottawa do that?”\n\nApparently, the City of Ottawa aspires to set an example to lead the world. If the world followed Ottawa’s lead, what would it cost? “If you do just simple math, that would be $600 trillion, for one degree,” says Harris, “but the environmental activists want to avoid five degrees of warming. So, the actual number is 3000 trillion dollars. And I don’t know if there’s enough money in the whole world. We have to hope that countries do not follow Ottawa’s lead.”\n\nChina, which produces twice as much emissions as the U.S., continues to build coal-fired power stations. Their overall priority is poverty alleviation and development. The cheapest way to achieve these goals is by using coal power. In 2030, China will use this as a get-out clause to the Paris Treaty. “And so, we in the West will be handicapping ourselves, crippling ourselves, making our energy infrastructure weak, our economic system weak for nothing,” says Harris. “Because even if you believe the science of the U.N., the situation is like we’re puncturing this life raft with a pin. And China’s using a chainsaw. And we’re just ignoring the chainsaw and criticizing people in Ottawa for the pin.”\n\nWith this City of Ottawa plan, backup power provided by natural gas would be essential. But like a car engine that produces less emissions if it runs at a consistent speed, neither breaking nor accelerating, the on-again, off-again nature of gas or coal backup power would, in fact, produce more greenhouse emissions, according to Harris.\n\nShould we even be concerned about reducing greenhouse gases? Climate alarmists are talking about carbon dioxide, methane, and nitrous oxide. How much climate change do these gases cause? According to Harris, at very low concentrations, they cause quite a lot of warming. But by the time you get to the kind of levels that we’re at now, these gases cause minimal additional warming. “It’s a little bit like painting a barn red,” explains Harris. “The first coat of paint pretty well covers the barn; when you put more coats on, there’s almost no change in the actual color of your barn because most of it has already been covered with paint. It just doesn’t do much.”\n\nPresently the level is 420 parts per million of carbon dioxide in the atmosphere, which is 0.042 percent. Nitrogen is 60 percent of the atmosphere. Harris and his team interviewed Professor William Happer, a leading physicist from Princeton University who studies the radiation effects of increasing carbon dioxide, nitrous oxide, and methane. “What he shows is that at today’s level of those three gases, the additional warming that would occur due to a doubling, for example, of carbon dioxide is negligible, less than one degree Celsius.”\n\nIn other words, if we went from 420 parts per million to 840, climate activists will tell you that this will be a disaster. But Professor Happer says, “No.”\n\n“It’s kind of obvious,” says Harris, “because since 1880, carbon dioxide in the atmosphere has increased by 50%, and the temperature has gone up by 1.2 degrees. That’s a rise so small that if you didn’t have meteorologists and climatologists to tell you about it, you wouldn’t even know it happened.”\n\nA look back through geologic history reveals times when carbon dioxide was 840 parts per million, or much higher. We are presently at one of the lowest levels of carbon dioxide in Earth’s history, says Harris. “We’ve seen times in the past when carbon dioxide was 13 times today’s levels. And it’s interesting because at that time, 440 million years ago, the Earth was in its coldest period in the last half billion years. So the fact that there’s been a recent increase in temperature and a recent increase in CO2 is only a recent phenomenon. But there is no correlation that shows that CO2 drives warming.”\n\nAccording to Harris and many of his colleagues, carbon dioxide is not driving dangerous climate change but a massive increase in crop productivity. Forests are getting denser, and we are seeing a greening of the earth. “Even NASA – many of them are climate alarmists – says that our use of fossil fuels is greening the earth.” It is also driving productivity and helping to feed the world. The more carbon dioxide pumped into a greenhouse, the taller and faster plants grow, consuming less water.\n\nNitrous oxide is the next bone of contention. Countries like Holland have recently brought in all kinds of rigid regulations on nitrous oxide reduction, which effectively means a 30 percent reduction in fertilizer use. Similar rules will be coming to Canada soon. Experts say this will cause about a third of all Dutch farms to close. “Because if you’re doing this double whammy, reducing aerial fertilizer, which is carbon dioxide, and you’re reducing fertilizer, you’re going to have a massive reduction in crop yield. This is a really big problem. Both of these actions are being driven by the climate scare,” says Harris.\n\nHarris encourages anyone interested in the subject of climate change to visit a website called climatechangereconsidered.org . There, you will find information that supports the idea that fossil fuels have, in fact, been a good thing for society. Not only have they massively increased our standards of living – there can be no denying this from any side of the argument – but they have also aided our protection of the environment by preventing the complete destruction of Britain’s forests, for example, once coal became the energy source for the country. He also recommends that readers watch documentary maker Michael Moore’s film Planet of the Humans. “People were quite shocked when he actually revealed the incredible damage that’s being caused by wind and solar power.”\n\nAccording to Harris, we should focus on reducing energy where it’s scarce; we should focus on reducing pollution where it’s a problem, and carbon dioxide is not this. “We learned in elementary school that this is plant food. So the whole idea that it’s carbon pollution, I always say to them, what’s this carbon you’re talking about?\n\nOn the subject of electric cars, Harris has plenty to say.\n\n“If you feel that it is important to reduce carbon dioxide and other greenhouse gases, then stay with your gas-powered car.” Ron Stein, a California engineer and the author of Clean Energy Exploitations, nominated for the Pulitzer Prize in 2022, has performed a lifecycle analysis to show how much greenhouse gas is produced when you mine the cobalt and the various materials that are needed in electric vehicles, then ship them to China, then charge your car, then dispose of these highly toxic materials at the end of their life. “He found that the lifecycle analysis shows clearly that it increases greenhouse gases if you move over to electric vehicles. This is just one of the many scams that are out there. They’re saying they’re saving the planet, while actually, they’re causing far more environmental damage,” says Harris.\n\nFrom the Texas power failure in February 2021 that killed 700 people to the rolling power outages that a cold city like Ottawa can expect if the green plan is implemented, life will shortly become infinitely less comfortable. “Catherine McKenney, who’s a councillor right now and is the promoter of the fossil fuel Non-Proliferation Treaty, endorsed energy evolution and the other plans. Ottawa at minus 30, you’re going to see thousands of people die if we have a major power failure like they did. We’re going to get a preview of it in Europe this winter because Europe has done two things, which are really going to make a lot of people very cold and hungry. Europe closed many of its most dependable power sources, nuclear, coal, oil.”\n\nHarris endorses nuclear energy as clean and safe. “You have to realize that in the overall scheme of things, when you compare nuclear with coal or natural gas, there are actually far less accidents and far less people that are killed from anything to do with nuclear power. Nuclear power is probably the safest energy source on the planet.\n\n“All of this doom and gloom, we hear from the city, there’s a climate emergency; where is it? Not here now? Do you know what it’s based on? It’s based on computer models.” That’s all it’s based on.\n\nClimate scientists use computer models to forecast what they think the climate will be in 50 or 100 years. The climate scare is not based on what’s happening in the real world. So, what is it that’s driving the climate scare? “There are a lot of vested interests,” says Harris. “World government, they want to have massive profits for the wind and solar sector. They want to take away a lot of our freedoms.”\n\nHow good are the models at forecasting climate if we use what we already know? Pretty poor is the answer. “If we go 30 years into the past, and we plug in the conditions that we know existed, temperature, density, pressure, all that sort of thing, and we run computer models to the present, do we get today’s conditions?” Not so much.\n\nThey call it hindcasting, in contrast to forecasting. Hindcasting shows the temperature rise in the last 30 years should be three times higher than it actually is. “They’re off by 200 percent,” says Harris. “And yet, those are the models that are being used by the UN, by the climate activists by the governments, by the City of Ottawa, they’re relying on these models that have massively failed.”\n\nAccording to Harris, not one of the scientists’ ideas about climate change is right. Which begs the question – where are all the scientists who disagree with this? “They’re all over the place; at Ottawa University, we have Ian Clark, and at Carleton University, my mentor Tim Patterson and Fred Michael. These people are local, but they’re not covered by the media.\n\nWe’re not government funded, so we’re allowed to deal with the truth.”\n\nFrom global warming to alternative energy sources, it’s all one big hoax, says Harris. “If you really want to kill this, you know, you must go after the science. Because if you don’t, it’s death by 1000 cuts.”", "opengraph": {"title": "Deadly globalist scam: ‘Global warming to alternative energy sources, it’s all one big hoax’", "type": "article", "url": "https://www.pollution.news/2022-10-06-global-warming-alternative-energy-sources-big-hoax.html", "site_name": "Pollution News", "description": "“World government wants massive profits for the wind and solar sector. They want to take away a lot of our freedoms.” – Scientist Tom Harris (Article by Miranda Sellick republished from RairFoundation.com) Nothing is what it appears to be. That heatwave that hit Europe this past summer? Twenty years ago, it was just a heatwave. […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/10/Scared-Climate-Change.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://rairfoundation.com/deadly-globalist-scam-global-warming-to-alternative-energy-sources-its-all-one-big-hoax-exclusive-interview/", "https://clintel.org/world-climate-declaration/", "https://news.cornell.edu/stories/2021/10/more-999-studies-agree-humans-caused-climate-change", "https://rairfoundation.com/warning-left-wing-fights-to-morph-pandemic-lockdowns-into-climate-lockdowns/", "http://www.icsc-climate.com/", "https://www.heartland.org/about-us/who-we-are/tom-harris", "http://rairfoundation.com/", "https://www.brighteon.tv", "https://www.americaoutloud.com/leading-physicist-debunks-climate-hysteria/", "http://climatechangereconsidered.org/", "https://planetofthehumans.com/", "https://www.archwaypublishing.com/en/bookstore/bookdetails/824032-clean-energy-exploitations", "https://rairfoundation.com/deadly-globalist-scam-global-warming-to-alternative-energy-sources-its-all-one-big-hoax-exclusive-interview/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2022-10-06-global-warming-alternative-energy-sources-big-hoax.html&linkname=Deadly%20globalist%20scam%3A%20%E2%80%98Global%20warming%20to%20alternative%20energy%20sources%2C%20it%E2%80%99s%20all%20one%20big%20hoax%E2%80%99", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}