{"result_id": "242018", "URL": "https://pollution.news/2019-02-13-inpower-movement-is-helping-everyday-folks-combat-smart-meters.html", "timestamp": "2023-04-25 16:49:36 CEST+0200", "meta": {"description": "Despite all the rhetoric about “progress,” our modern world is drowning in pollution from technology – whether it’s the seemingly unavoidable radiation emitted from things like smart meters and 5G, or the chemical violence that comes from modern medical interventions like vaccines. But what if there was a way to take a stand against these […]", "lang": "en", "keywords": "5g,Cal Washington,goodhealth,health freedom,InPower Movement,Liberty,mandatory vaccination,natural health,Notice of Liability,opting out,pollution,radiation,resource,richard pan,smart meters,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://pollution.news/2019-02-13-inpower-movement-is-helping-everyday-folks-combat-smart-meters.html", "encoding": "UTF-8"}, "image": null, "domain": "pollution.news", "title": "InPower Movement is helping everyday folks combat smart meters, “mandatory” vaccination, 5G and more", "cleaned_text": "InPower Movement is helping everyday folks combat smart meters, “mandatory” vaccination, 5G and more\n\nDespite all the rhetoric about “progress,” our modern world is drowning in pollution from technology – whether it’s the seemingly unavoidable radiation emitted from things like smart meters and 5G, or the chemical violence that comes from modern medical interventions like vaccines. But what if there was a way to take a stand against these relentless assaults against our normal existence as human beings?\n\nThere is, and it’s known as the InPower Movement – a revolutionary project of two freedom advocates who’ve made it one of their missions in life to teach people how to regain control over the thing that truly matters: the freedom to life, liberty, and the pursuit of happiness.\n\nAs you’re probably well aware, modern living increasingly means having to succumb to all sorts of invasive technologies that threaten to rob us of our health – technologies that, for all intents and purposes, can’t really be stopped, especially when they’re part of a much larger technological “smart grid” designed to control every aspect of human life from one central command post.\n\nSmart meters, for instance, are no longer the exception, but the norm. While some municipalities have enacted laws for “opting out” of them, the cost to consumers is enormous – the intent being to coerce everyone into getting a smart meter, even when it means suffering serious health problems as a result.\n\n5G wireless technology is similarly threatening, as it’s repeatedly been shown to negatively impact human health. And perhaps the worst part about 5G is the fact that it has to be set up on towers that are very close to one another – just a few hundred feet apart, in fact – meaning every human being will eventually have one located right outside his home.\n\n“Whether it is unsafe technology or other unwanted interventions, InPower can help you reclaim your authority with the use of our commercial administrative process that anyone can use,” the InPower Movement website explains about the remedy that’s available for folks who want to stop these radioactive assaults against their personhood.\n\n“The InPower community is culturally, governmentally, and geographically diverse, but has a common bond: the need to have authority over one’s health and home. Regardless of where you live in the world today, people have fewer choices when it comes to certain technology and services, and often have no choices when it comes to medical interventions with no recourse for bodily harm,” the site adds about its purpose and mission.\n\nInPower Movement is helping people to resist “mandatory” vaccinations – even when exemptions are taken away by Big Pharma crooks like Richard Pan\n\nAnother area in which InPower Movement is helping people is with concerns about “mandatory” vaccination. By taking advantage of “Notice of Liability” legal provisions, all of which are spelled out – and now completely automated – via InPower Movement.\n\n“The Notice of Liability is a divinely-inspired document. It took years and years of study, and training, and trial and error. It is divinely-inspired. It is for this time in order to get out of the contracts that we have inadvertently agreed to worldwide,” says Cal Washington, the CEO and co-founder of InPower Movement, about how the process works.\n\n“We’ve been working hard behind the scenes to build an automated system so that we can better serve you and keep the documents accurate,” he further explains in a welcome video available on his company’s website.\n\nBe sure to check out the InPower Movement website to learn more about how the service works.\n\nYou can also keep up with the latest news about smart meters, 5G, and tyrannical vaccine mandates by visiting EMF.news, RadiationScience.com, and MedicalViolence.com.", "opengraph": {"title": "InPower Movement is helping everyday folks combat smart meters, “mandatory” vaccination, 5G and more", "type": "article", "url": "https://www.pollution.news/2019-02-13-inpower-movement-is-helping-everyday-folks-combat-smart-meters.html", "site_name": "Pollution News", "description": "Despite all the rhetoric about “progress,” our modern world is drowning in pollution from technology – whether it’s the seemingly unavoidable radiation emitted from things like smart meters and 5G, or the chemical violence that comes from modern medical interventions like vaccines. But what if there was a way to take a stand against these […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2019/02/smartmeter.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.inpowermovement.com/", "https://www.naturalnews.com/053783_Smart_Meters_carcinogenic_mysterious_health_problems.html", "https://www.naturalnews.com/2018-11-29-safety-of-5g-technology-questions.html", "https://www.brighteon.tv", "https://www.inpowermovement.com/", "http://emf.news", "http://radiationscience.com", "http://medicalviolence.com", "https://www.inpowermovement.com/", "https://www.naturalnews.com/053783_Smart_Meters_carcinogenic_mysterious_health_problems.html", "https://www.naturalnews.com/2018-11-29-safety-of-5g-technology-questions.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2019-02-13-inpower-movement-is-helping-everyday-folks-combat-smart-meters.html&linkname=InPower%20Movement%20is%20helping%20everyday%20folks%20combat%20smart%20meters%2C%20%E2%80%9Cmandatory%E2%80%9D%20vaccination%2C%205G%20and%20more", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}