{"result_id": "242014", "URL": "http://www.pollution.news/2020-09-10-5g-palm-trees-and-radiation-emitting-fake-cactus-towers.html", "timestamp": "2023-04-25 16:49:33 CEST+0200", "meta": {"description": "While everybody worries about Covid and the BLM metro-city riots across America, suburban neighborhoods are getting covertly blanketed with 5G small cell towers that are disguised as draping palm trees and giant cactuses. Nobody seems to realize what’s happening, and the few who do are getting banned and blacklisted from Facebook and YouTube for posting […]", "lang": "en", "keywords": "5g cactus,5g cancer,5g palms,5g radiation,5G towers,badhealth,badpollution,cell tower,cell tower radiation,cell towers,conspiracy,corrruption,cyber war,dangerous tech,deception,emf news,Glitch,health dangers,information technology,rf news", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "http://www.pollution.news/2020-09-10-5g-palm-trees-and-radiation-emitting-fake-cactus-towers.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "Attack of the 5G “palm trees” and radiation-emitting fake cactus towers", "cleaned_text": "Attack of the 5G “palm trees” and radiation-emitting fake cactus towers\n\nWhile everybody worries about Covid and the BLM metro-city riots across America, suburban neighborhoods are getting covertly blanketed with 5G small cell towers that are disguised as draping palm trees and giant cactuses. Nobody seems to realize what’s happening, and the few who do are getting banned and blacklisted from Facebook and YouTube for posting anything about it. The World Health Organizations classifies 5G “RF radiation” as a possible carcinogen, and you know what it means when they say that. It means it’s really bad, like glyphosate weed-killer bad. Still, these fake palm trees and plastic cactuses are being installed right next to nice residential homes, just about everywhere.\n\nParents are freaking out, and for good reason, as their babies and children are exposed to cancerous radiation all day and night, relentlessly, while in their homes and out in their yards. It’s abuse, they say. What’s worse is that another million 5G small cell towers are slated to be erected all across the USA in the next couple years.\n\nThough 5G technology works just fine from 2,000 feet, part of keeping everyone sick is to radiate the masses with dirty energy\n\nYou have no right to contention, according to social media and the corporate giants, who are also funding the riots and upheaval in America. You have no rights to your health or safety, according to Google, YouTube and the CDC. You have no rights to organic food, clean air or natural medicine, according to the FDA. And according to Bill Gates, everything “technological” and “scientific” is excellent for human health, including 5G radiation, abortion-cell-laced vaccines and chemotherapy for the radiation poisoning he’s promoting.\n\nThe Gods of Big Tech have taken over the planet, and anyone who blows the whistle about the eventual death toll paid for consuming dirty food, dirty medicine and dirty energy is “anti-science!”\n\nGot a smart electric meter outside your home, a 5G small cell tower, WiFi, appliances running constantly, smart devices, cell phones and a microwave oven? You’re consuming far too much dirty energy daily (which can literally drive you insane), and you need to detoxify.\n\nGot a fake palm tree or a fake cactus near your home that’s really a toxic cell phone tower? Raise hell with the phone company. Switch to a carrier that doesn’t invade your life with poisons. Doctors aren’t allowed to talk about 5G sickness, so they’ll just call it auto-immune disorder and blame genetics. “I bet this health crisis is inherited. Does sickness run in your family, ma’am/sir?”\n\nNo evidence has yet to be produced that shows 5G is biologically safe for human beings\n\n5G Awareness blogs have been shut down. Independent studies on 5G health problems will never be published in mainstream health news or as guidelines. Everything Monsanto ever made was deemed “safe and effective,” even though they’ve settled BILLIONS of dollars for health damages, for causing cancer in humans over the years. In the Southwest of America you can find these huge fake cactuses that emit cancer-causing radiation next to stores, homes, elementary schools and daycare centers.\n\nWhat’s next, a few brand new “state-of-the-art” cancer “treatment” specialty institutions? Did you know that 97 percent of all chemotherapy patients get no benefit, only harm from chemo? Better make some phone calls and shoot out some emails about those cancer cactuses.\n\nGot huge, synthetic arecaceae “growing” with huge antennas covered in evergreen fake leaf fronds, just 30 feet from your favorite shopping center and kid’s playground? You may be experiencing new health problems. You may be MORE susceptible to Covid-19. Wouldn’t that be ironic, that the pandemic was preempted by a “novel” form of biological warfare, and meant to attack your 5G-compromised immune system? Think about that one for a minute.\n\nDon’t get attacked by the 5G nightmare. It’s like the Wizard of Oz trees coming to life and attacking Dorothy, except these trees emit carcinogenic radiation and you get cancer instead of going to the glorious castle to tap your heals and a make a wish. Keep up with 5G real news at EMF.news and free your body from dirty energy.", "opengraph": {"title": "Attack of the 5G “palm trees” and radiation-emitting fake cactus towers", "type": "article", "url": "https://www.pollution.news/2020-09-10-5g-palm-trees-and-radiation-emitting-fake-cactus-towers.html", "site_name": "Pollution News", "description": "While everybody worries about Covid and the BLM metro-city riots across America, suburban neighborhoods are getting covertly blanketed with 5G small cell towers that are disguised as draping palm trees and giant cactuses. Nobody seems to realize what’s happening, and the few who do are getting banned and blacklisted from Facebook and YouTube for posting […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/03/5g-cactus.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.brighteon.tv", "https://www.naturalnews.com/2019-07-30-youtube-bans-critics-of-5g-to-cover-up-telecom-industry-crimes.html", "https://www.naturalnews.com/2019-12-03-5g-radiation-causes-behavior-changes-in-humans-mass-insanity.html", "https://www.nbcnews.com/politics/justice-department/california-jury-hits-monsanto-2-billion-judgment-cancer-lawsuit-n1005191", "http://emf.news/", "https://www.naturalnews.com/2019-07-30-youtube-bans-critics-of-5g-to-cover-up-telecom-industry-crimes.html", "https://www.nbcnews.com/politics/justice-department/california-jury-hits-monsanto-2-billion-judgment-cancer-lawsuit-n1005191", "https://www.activistpost.com/2019/07/youtube-terminates-account-of-sacramento-family-fighting-verizon-5g-small-cell-tower-installed-next-to-childrens-bedroom.html", "https://www.naturalnews.com/053783_Smart_Meters_carcinogenic_mysterious_health_problems.html", "https://5gawarenessnow.com/", "https://www.gofundme.com/2hszts-fight-against-5g-in-sacramento", "https://www.naturalnews.com/2019-07-12-youtube-promoting-pedophilia-with-new-fairness-algorithms.html", "http://emf.news/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2020-09-10-5g-palm-trees-and-radiation-emitting-fake-cactus-towers.html&linkname=Attack%20of%20the%205G%20%E2%80%9Cpalm%20trees%E2%80%9D%20and%20radiation-emitting%20fake%20cactus%20towers", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}