{"result_id": "242011", "URL": "https://www.pollution.news/2023-01-03-5g-weapons-system-designed-to-kill-people.html", "timestamp": "2023-04-25 16:49:30 CEST+0200", "meta": {"description": "Weapons expert Mark Steele has warned the public that 5G is a weapons system designed to kill people masquerading as a benign advanced technology for enhanced communications and faster downloads. In an expert report, Steele said 5G represents a heinous crime if a person understands the motive behind its deployment. Steele previously acted as a witness and provided […]", "lang": "en", "keywords": "5g,badhealth,badmedicine,badpollution,big government,Big Pharma,biological chemical weapons,conspiracy,covid-19,Dangerous Medicine,EMF,Mark Steele,nanotechnology,national security,Nuremberg Code,radiation,sterilization,telecommunications industry,vaccine damage,vaccine injury,vaccines,weapons technology", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2023-01-03-5g-weapons-system-designed-to-kill-people.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "5G is a weapons system designed to KILL people, says weapons expert Mark Steele", "cleaned_text": "5G is a weapons system designed to KILL people, says weapons expert Mark Steele\n\nWeapons expert Mark Steele has warned the public that 5G is a weapons system designed to kill people masquerading as a benign advanced technology for enhanced communications and faster downloads.\n\nIn an expert report, Steele said 5G represents a heinous crime if a person understands the motive behind its deployment.\n\nSteele previously acted as a witness and provided statements in several court cases, exposing the lack of any credible evidence that the 5G light-emitting diode (LED) network and planned neural connection to the 5G grid are safe. He also exposed the nano metamaterial technologies that are contaminating Wuhan coronavirus (COVID-19) vaccinations.\n\nHis efforts paid off as a judge at Newcastle Crown Court declared that “the 5G risk must be debated.”\n\n“The evidence I presented to the court defeated the attempt by the local authorities and actors in the British establishment to silence me from providing the published scientific evidence on the risks posed to the public and environment from the 5G urban radar network and its ultimate purpose,” Steele said.\n\nThat victory in legal battlefield created a publicity storm that helped highlight the actual risks of 5G deployment across the world, as well as the total lack of care by regulators.\n\nSteele lamented that the world is blindly following the plans of the technocratic elite and the military-industrial-pharma complex to terminate large numbers within populations across the world.\n\n“The compartmentalization of weapons systems development has played a crucial role in not alerting those within the regulatory authorities and telecommunications industry to the real purpose and intentions of those driving and funding the deployment of 5G and biological chemical weapons masquerading as COVID-19 vaccines for a planned control and command kill grid,” he said.\n\nElsewhere in the report, Steele elaborated on the connections between 5G and COVID-19 vaccines.\n\n“The COVID-19 vaccine adverse reactions data read like the destruction of mankind as millions of North American citizens die and are injured in the medical experiment that is in breach of the Nuremberg Code and the Rome Statute of the International Criminal Court,” Steele said.\n\n“The fact that the COVID-19 vaccines vector data was made in biological chemical weapons laboratories proves that they are only masquerading as vaccines, with the emerging data of sterilization, ill health and death across the West revealing their true purpose,” Steele said. (Related: Study: 5G exposure a “significant factor” in higher covid cases, deaths)\n\nAccording to Steele, the 5G network has the capability to target acquire and attack the vaccinated due to the nano metamaterial antenna from COVID-19 vaccine.\n\n“Lethal Autonomous Weapons Systems (LAWS) need the 5G networks to maintain their geoposition and navigate their environment to the target,” he explained.\n\n“These weapons cannot rely on satellite communications due to the potential for inclement weather events and signal latency to disrupt their signals so they must have localized 5G networks for the upcoming cityscape battlefield environment, for assassination capability and for battlefield domination in planned future wars.”\n\nFollow 5GAlert.com for more news about the dangers of 5G technology.\n\nWatch the video below to know why weapons expert Mark Steele called 5G a weapons system designed to kill people.\n\nThis video is from the Sons of Liberty channel on Brighteon.com.\n\n5G rollout must be stopped to avoid widespread exposure to EMF and RF radiation.\n\nExperts in epidemiology, occupational health, toxicology, physics and engineering agree: 5G radiation is toxic to humans.\n\nCrime against humanity: 5G is a weapons deployment system masquerading as a communications enhancement.\n\n5G radiation causes BEHAVIOR changes in humans, causes ion potentiation poisoning of brain cells, leading to mass insanity.", "opengraph": {"title": "5G is a weapons system designed to KILL people, says weapons expert Mark Steele", "type": "article", "url": "https://www.pollution.news/2023-01-03-5g-weapons-system-designed-to-kill-people.html", "site_name": "Pollution News", "description": "Weapons expert Mark Steele has warned the public that 5G is a weapons system designed to kill people masquerading as a benign advanced technology for enhanced communications and faster downloads. In an expert report, Steele said 5G represents a heinous crime if a person understands the motive behind its deployment. Steele previously acted as a witness and provided […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2023/01/COV-19-In-5G-CircuitBoard_large.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.globalresearch.ca/expert-report-fifth-generation-5g-directed-energy-radiation-emissions-context-nanometal-contaminated-vaccines-include-covid-19-graphite-ferrous-oxide-antennas/5786727", "http://radiation.news", "https://www.brighteon.tv", "https://naturalnews.com/2021-12-12-5g-significant-factor-higher-covid-cases-deaths.html", "https://clinics.law.harvard.edu/blog/2019/03/lethal-autonomous-weapons-systems-recent-developments/", "http://5galert.com", "http://www.brighteon.com/e493a120-ca8a-4b9a-92bf-a970de6a1639", "https://www.brighteon.com/channels/sonsofliberty", "https://naturalnews.com/2022-02-18-covid-disease-linked-5g-wireless-exposure-study.html", "https://naturalnews.com/2022-08-18-stop-5g-rollout-avoid-exposure-emf-radiation.html", "https://naturalnews.com/2021-01-18-experts-epidemiology-toxicology-physics-5g-radiation-toxic.html", "https://5galert.com/2022-06-23-crime-against-humanity-5g-weapons-deployment-system.html", "https://naturalnews.com/2019-12-03-5g-radiation-causes-behavior-changes-in-humans-mass-insanity.html", "http://www.globalresearch.ca/expert-report-fifth-generation-5g-directed-energy-radiation-emissions-context-nanometal-contaminated-vaccines-include-covid-19-graphite-ferrous-oxide-antennas/5786727", "http://clinics.law.harvard.edu/blog/2019/03/lethal-autonomous-weapons-systems-recent-developments/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2023-01-03-5g-weapons-system-designed-to-kill-people.html&linkname=5G%20is%20a%20weapons%20system%20designed%20to%20KILL%20people%2C%20says%20weapons%20expert%20Mark%20Steele", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}