{"result_id": "242020", "URL": "https://pollution.news/2019-11-21-pharmaceutical-drugs-destroying-environment.html", "timestamp": "2023-04-25 16:49:37 CEST+0200", "meta": {"description": "If you’re reading this and are the type of person who desperately wants to save the planet from a “climate catastrophe,” listen up: One of the biggest polluters in the world today is the pharmaceutical industry. And the pollution is the residue of billions of doses of chemical pills that end up in the freshwater […]", "lang": "en", "keywords": "Antibiotics,Antidepressants,badpollution,badscience,Big Pharma,chemical cocktails,clean water,climate change,climate science,depopulation,ecosystem destruction,environment,food chain,food supply,freshwater ecosystems,painkillers,pharmaceutical drug cartels,pharmaceuticals,pollution,toxic ingredients", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://pollution.news/2019-11-21-pharmaceutical-drugs-destroying-environment.html", "encoding": "UTF-8"}, "image": null, "domain": "pollution.news", "title": "Analysis finds that pharmaceutical drugs are destroying the environment – where are all the environmental activists?", "cleaned_text": "Analysis finds that pharmaceutical drugs are destroying the environment – where are all the environmental activists?\n\nIf you’re reading this and are the type of person who desperately wants to save the planet from a “climate catastrophe,” listen up: One of the biggest polluters in the world today is the pharmaceutical industry. And the pollution is the residue of billions of doses of chemical pills that end up in the freshwater ecosystems that sustain our global food chain.\n\nEven if you’re not a climate alarmist, this information is for you, too. As millions of people lament about cows, gas-powered vehicles, and other alleged causes of “global warming,” Big Pharma is the biggest elephant in the room that continues to get a free pass from the “climate experts” telling us all to become vegetarians and accept a global government that claims to have all the “answers” and “solutions.”\n\nAs it turns out, upwards of 90 percent of the active ingredients contained in the pills that many people take every day for their “health” end up being excreted back into the environment. And when we say environment, we mean the natural ecosystems that all lifeforms, including humans, need in order to live.\n\nWhat this means is that the pharmaceutical drug cartels are getting away with drugging the entire planet without anyone’s consent, while simultaneously destroying a major source of our sustenance: freshwater.\n\nAccording to a data analysis conducted by the Organisation for Economic Co-operation and Development (OECD), pharmaceutical residues are now being found virtually everywhere in our natural environment. This is clearly problematic because all of these chemical drug residues end up right back in the food chain, at concentrations and in combinations that have unknown detrimental effects on humans.\n\n“We’re seeing constant engineering of new pharmaceuticals and seeing clinical practices evolve to include recommendations of earlier treatment and higher doses,” warns Hannah Leckie, the author of the OECD report on these findings.\n\nEverything from painkillers to cross-sex hormones to antidepressants are seeping into our freshwater supplies\n\nOne of the study’s cited in this report found that there are “extremely high” concentrations of pharmaceutical products in water systems not just in the United States, but also in Israel, India, China, South Korea, and elsewhere.\n\nIn Great Britain alone, scientists identified the presence of ethinyloestradiol (a type of estrogen medication), diclofenac (a non-steroidal anti-inflammatory drug), ibuprofen (Advil), propranolol (a beta-blocker), and a slew of antibiotic drugs in the run-off of 890 different wastewater treatment plants, and at levels high enough to cause “adverse environmental effects.”\n\n“The residues of pharmaceuticals have been detected in surface and ground water across the world,” Leckie further warns.\n\nRecognizing the fact that more than 700,000 people die every year from drug-resistant infections, the presence of pharmaceutical chemical cocktails in our freshwater supplies suggests that many people are falling seriously ill and dying because of Big Pharma, and little to nothing is being done to stop this global genocide.\n\n“Unless adequate measures are taken to manage the risks, pharmaceutical residues will increasingly be released into the environment as ageing populations, advances in healthcare, and intensification of meat and fish production spur the demand for pharmaceuticals worldwide,” Leckie’s report explains.\n\nLeckie also discusses Big Pharma’s negative impacts on climate change in her report. Besides destroying ecosystems, Big Pharma drug residues are increasing the frequency and spread of infectious disease outbreaks – which also means that people who get vaccinated with Big Pharma vaccines are a major contributor to the spread of disease, not the unvaccinated like the mainstream media claims.\n\n“Human activity such as population (growth) and transport combined with climate change increases antibacterial resistance … and therefore the need for more pharmaceuticals,” Leckie concludes, highlighting the vicious cycle that exists between Big Pharma and climate change that’s destroying our natural environment at neck-breaking speed.\n\nTo keep up with the latest climate-related news, be sure to visit ClimateScienceNews.com.", "opengraph": {"title": "Analysis finds that pharmaceutical drugs are destroying the environment – where are all the environmental activists?", "type": "article", "url": "https://www.pollution.news/2019-11-21-pharmaceutical-drugs-destroying-environment.html", "site_name": "Pollution News", "description": "If you’re reading this and are the type of person who desperately wants to save the planet from a “climate catastrophe,” listen up: One of the biggest polluters in the world today is the pharmaceutical industry. And the pollution is the residue of billions of doses of chemical pills that end up in the freshwater […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2019/11/Pharmacy-Medicine-Background-Prescription-Tablets-Pharmaceutical-Medical.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://news.yahoo.com/medicines-pose-global-environmental-risk-experts-warn-170419416.html", "https://www.brighteon.tv", "https://www.naturalnews.com/024764.html", "http://climatesciencenews.com", "https://news.yahoo.com/medicines-pose-global-environmental-risk-experts-warn-170419416.html", "https://www.naturalnews.com/024764.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2019-11-21-pharmaceutical-drugs-destroying-environment.html&linkname=Analysis%20finds%20that%20pharmaceutical%20drugs%20are%20destroying%20the%20environment%20%E2%80%93%20where%20are%20all%20the%20environmental%20activists%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}