{"result_id": "242005", "URL": "https://www.pollution.news/2022-08-12-study-forever-chemicals-increase-liver-cancer-risk.html", "timestamp": "2023-04-25 16:49:26 CEST+0200", "meta": {"description": "A new study has found that synthetic chemicals common in food packaging and some kitchenware may heighten the risk of liver cancer. A University of Southern California (USC) research team recently identified a link between toxic chemicals and non-viral hepatocellular carcinoma, which is a common type of liver cancer. According to the study published in Jhep Reports, a particular […]", "lang": "en", "keywords": "badcancer,badhealth,badpollution,badscience,cancer causes,cancer criminals,clean water,drinking water,EPA,forever chemicals,health science,Liver cancer,liver damage,liver health,PFAS,products,research,tap water,toxic chemicals,toxic ingredients,toxins", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2022-08-12-study-forever-chemicals-increase-liver-cancer-risk.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "Study: “Forever chemicals” in popular cooking products increase risk of liver cancer", "cleaned_text": "A new study has found that synthetic chemicals common in food packaging and some kitchenware may heighten the risk of liver cancer. A University of Southern California (USC) research team recently identified a link between toxic chemicals and non-viral hepatocellular carcinoma, which is a common type of liver cancer.\n\nAccording to the study published in Jhep Reports, a particular type of “forever chemical” called perfluorooctane sulfonic acid (PFOS) may have a particularly strong connection to the development of this fatal illness.\n\nPFOS is one of the thousands of man-made per- and polyfluoroalkyl substances (PFAS) and is found widely throughout the environment. PFAS are a set of toxic chemicals found in household products such as nonstick pans, waterproof apparel, cosmetics and even shampoo. Experts referred to them as “forever chemicals” because they can take years to degrade in the body or the environment.\n\n“Liver cancer is one of the most serious endpoints in liver disease and this is the first study in humans to show that PFAS are associated with this disease,” Jesse Goodrich, the study’s lead author and a postdoctoral researcher at USC Keck School of Medicine, said in a statement.\n\nPrevious studies in animals have suggested that PFAS exposure increases the risk of liver cancer, but the latest one is the first to confirm a connection in human samples.\n\nThe USC researchers collected data from the “Multiethnic Cohort Study” and from a pool of over 200,000 people – 50 that had developed liver cancer were chosen and matched with 50 others that did not.\n\n“Part of the reason there have been few human studies is that you need the right samples,” said Dr. VeVeronica Wendy Setiawan, a professor of population and public health sciences at USC.\n\nSo they analyzed blood samples from the cancer patients before their diagnosis and compared them to the control group of those who never developed the disease.\n\nThey found that many of the people who eventually developed cancer had multiple types of chemicals in their bloodstream. Higher levels also increased a person’s risk of having cancer. The study concluded that people in the top ten percent of exposure to the chemicals were 4.5 times more likely to suffer from cancer.\n\nThe chemicals will usually enter the liver after being ingested in some way and will become embedded in the liver. The USC team found that PFOS alters glucose metabolism, bile acid metabolism and amino acids in the liver.\n\nAs a result of the disruption, more fat will form around the liver and put a person at an increased risk of developing non-alcoholic fatty liver disease or even liver cancer.\n\nEPA’s tests do not accurately reflect levels of PFOS in drinking water\n\nBack in June, the Environmental Protection Agency (EPA) issued an advisory to drastically reduce acceptable levels of PFOS in household goods. The new guidance stated that the EPA no longer recommends drinking water with more than 0.004 parts per trillion (ppt) of PFOA and 0.02 ppt of PFOS.\n\n“EPA is taking aggressive action as part of a whole-of-government approach to prevent these chemicals from entering the environment and to help protect concerned families from this pervasive challenge,” EPA administrator Michael Regan said in a statement.\n\nThe Biden administration has allocated $10 billion to specifically address PFAS and other contaminants in drinking water. But critics say when it comes to identifying PFAS-contaminated water, the limitations of the test used by state and federal regulators virtually guarantee regulators will never have a full picture of contamination levels.\n\nAccording to them, the test called EPA 537 can’t accurately measure how contaminated the water is as the industry churns out new compounds much faster than researchers can develop the science to measure them.\n\nBack in July, news outlet the Guardian made an analysis of water samples taken in nine cities with high levels of PFAS pollution and examined the samples using two types of tests: an EPA-developed method that detects 30 types of PFAS and a more robust method that checks for a marker of the more than 9,000 PFAS compounds known to exist.\n\nIn seven of the nine cities, higher levels of PFAS were found in water samples when using a “total organic fluorine” (TOF) test that identifies markers for all known PFAS compounds than when using the EPA test – at concentrations up to 24 times greater.\n\n“EPA is doing the bare minimum it can and that is putting people’s health at risk,” said Kyla Bennett, the policy director of Public Employees for Environmental Responsibility. (Related: EPA doing “bare minimum” to address toxic PFAS pollutants in drinking water.)\n\nWatch the below video that talks about EPA finding no safe level for two toxic “forever chemicals” in many U.S. water systems.\n\nThis video is from the Covid Times channel on Brighteon.com.\n\nCourt orders EPA to reassess glyphosate’s impact on human health and the environment.\n\nStudies find that exposure to “forever chemicals” INCREASES risk of catching COVID.\n\nUS Supreme Court deals huge blow to Biden’s climate change collapse agenda, rules EPA cannot force move from fossil fuels to “green” energy.", "opengraph": {"title": "Study: “Forever chemicals” in popular cooking products increase risk of liver cancer", "type": "article", "url": "https://www.pollution.news/2022-08-12-study-forever-chemicals-increase-liver-cancer-risk.html", "site_name": "Pollution News", "description": "A new study has found that synthetic chemicals common in food packaging and some kitchenware may heighten the risk of liver cancer. A University of Southern California (USC) research team recently identified a link between toxic chemicals and non-viral hepatocellular carcinoma, which is a common type of liver cancer. According to the study published in Jhep Reports, a particular […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/08/Liver-Fatty-Disease-Human-Cancer-Hepatitis-Anatomy.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-11092983/Researchers-forever-chemicals-popular-cooking-products-cause-liver-cancer.html", "https://www.usc.edu/", "https://www.jhep-reports.eu/article/S2589-5559(22)00122-7/fulltext", "https://chemicals.news/", "https://keck.usc.edu/synthetic-forever-chemical-linked-to-liver-cancer/", "https://keck.usc.edu/", "http://cancercauses.news", "https://www.brighteon.tv", "http://liverdamage.news", "https://www.theguardian.com/us-news/2022/jul/06/us-drinking-water-pfas-toxic-forever-chemicals-epa-tests", "https://childrenshealthdefense.org/defender/epa-u-s-drinking-water-contamination-toxic-pfas-forever-chemicals/", "https://naturalnews.com/2022-07-17-epa-doing-bare-minimum-detect-pfas-pollutants-water.html", "https://www.brighteon.com/7cd3dfe8-a3ef-489a-8ab9-490c0e85f6fa", "https://www.brighteon.com/channels/royalbluekid", "https://naturalnews.com/2022-07-12-toxic-forever-chemicals-contaminate-florida-oysters.html", "https://glyphosate.news/2022-06-22-epa-to-reassess-glyphosate-impact-human-health.html", "https://pandemic.news/2022-03-16-forever-chemicals-exposure-increases-risk-catching-covid.html", "https://environ.news/2022-06-30-supreme-court-destroys-biden-climate-collapse-agenda.html", "https://www.dailymail.co.uk/health/article-11092983/Researchers-forever-chemicals-popular-cooking-products-cause-liver-cancer.html", "https://www.jhep-reports.eu/article/S2589-5559(22)00122-7/fulltext", "https://keck.usc.edu/synthetic-forever-chemical-linked-to-liver-cancer/", "https://www.theguardian.com/us-news/2022/jul/06/us-drinking-water-pfas-toxic-forever-chemicals-epa-tests", "https://www.brighteon.com/7cd3dfe8-a3ef-489a-8ab9-490c0e85f6fa", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2022-08-12-study-forever-chemicals-increase-liver-cancer-risk.html&linkname=Study%3A%20%E2%80%9CForever%20chemicals%E2%80%9D%20in%20popular%20cooking%20products%20increase%20risk%20of%20liver%20cancer", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}