{"result_id": "242015", "URL": "https://www.pollution.news/2022-08-31-polio-vaccines-are-the-problem-not-the-solution.html", "timestamp": "2023-04-25 16:49:34 CEST+0200", "meta": {"description": "“Following the discovery of type 2 vaccine-derived poliovirus in sewage in north and east London, the Joint Committee on Vaccination and Immunisation (JCVI) has advised that a targeted inactivated polio vaccine (IPV) booster dose should be offered to all children between the ages of 1 and 9 in all London boroughs.” – UK Health Security Agency (“UKHSA”), 10 August 2022 (Article […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,Dangerous Medicine,infections,IPV,JCVI,outbreak,pharmaceutical fraud,polio,science deception,science fraud,truth,UKHSA,vaccine,vaccine damage,vaccine injury,WHO", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2022-08-31-polio-vaccines-are-the-problem-not-the-solution.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "Polio vaccines are the problem, not the solution", "cleaned_text": "Polio vaccines are the problem, not the solution\n\n“Following the discovery of type 2 poliovirus in north and east London, the Joint Committee on Vaccination and Immunisation (JCVI) has advised that a targeted inactivated polio vaccine (IPV) booster dose should be offered to all children between the ages of 1 and 9 in all London boroughs.” – UK Health Security Agency (“UKHSA”), 10 August 2022\n\nNo cases have been found in the UK. Vaccine-derived polio has been found in sewers. However, this little detail didn’t stop the Guardian from creating cases. “Polio is spreading in the US, UK and Israel. Should Australia be worried?” is the title of their article which goes on to give an ominous warning:\n\n“The last case of locally acquired polio in Australia was 1972. But it’s popping up in New York, London and Jerusalem, and we could be next … Given Australia’s open international borders, there is no reason why someone who has recently received the oral polio vaccine wouldn’t enter the country and excrete the virus.”\n\nThe Guardian then advises routine wastewater surveillance to detect an outbreak. Why wastewater surveillance? Because outside of Africa and Asia, despite corporate media using words such as “spreading” and “outbreaks,” there have been no polio cases detected in people – it has been detected in wastewater.\n\nAccording to figures from the World Health Organisation (“WHO”), since 2017 there have been 396 cases of polio caused by the “wild virus,” versus more than 2,600 linked to the oral vaccine. “We are basically replacing the wild virus with the virus in the vaccine, which is now leading to new outbreaks,” Scott Barrett from Columbia University told ABC News.\n\nDespite quoting Barrett and WHO’s figures in their article, ABC News describes vaccine-derived polio as an “extremely rare phenomenon.” In which case, the “wild virus” is more than extremely rare. This raises an obvious question: why are they persisting with vaccinations?\n\nNot only are they persisting but they want children to be injected with additional vaccines. In the UK they are advising all London children aged 1 to 9 to have a booster dose. While in the USA the fear is being ramped up presumably to convince parents to vaccinate their children:\n\nIn November 2020 the World Health Organisation (“WHO”) granted Emergency Use Listing (“EUL”) for novel oral polio vaccine type 2 (“nOPV2”) designed to treat the type of polio, vaccine-derived poliovirus type 2 (“VDPV2”), detected in London’s and other sewers.\n\nWHO gave two reasons for issuing a EUL. One was that vaccine-derived polio, circulating vaccine-derived poliovirus type 2 (“cVDPV2”), has been an ongoing emergency:\n\nSo, according to WHO, the oral polio vaccine (“OPV”) caused a polio emergency and the solution is to give a “new” OPV. This is a blatant scam and, judging by the safety and efficacy of previous polio vaccines, a harmful one.\n\nAccording to GPEI’s website, a global partnership across multiple agencies and experts from within and outside of GPEI supported nOPV2’s development. This includes Bio Farma, University of Antwerp, Fighting Infectious Diseases in Emerging Countries (“FIDEC”), MHRA’s subsidiary National Institute for Biological Standards and Control (“NIBSC”), University of California San Francisco (“UCSF”), US Centres for Disease Control and Prevention (“CDC”), PATH, the Bill & Melinda Gates Foundation, and several others.\n\nThe Bill & Melinda Gates Foundation provided 100% of the funding for the development and clinical trials of the nOPV2 vaccine.\n\nIt just so happens that nOPV2 is the vaccine that has been deployed most in clinical trials in Africa. The rollout of nOPV2 began in March 2021 and by the end of the vaccine’s initial use period, in October 2021, approximately 100 million doses had been administered to children across seven countries, in seven months. On 11 October 2021, WHO’s Strategic Advisory Group of Experts on immunisation (“SAGE”) endorsed the transition to the next use phase for the vaccine. It means that more countries are eligible to use the vaccine. SAGE also recommended Gates’ nOPV2 become the “vaccine of choice” for responding to type 2 polio outbreaks caused by polio vaccines.\n\n“It’s a listed product by the WHO which means it can be used in emergency situations even though it’s not approved,” Mark Bailey, interim director of NIBSC, said at a meeting of the MHRA in June.\n\nIn 2013 the MHRA merged with NIBSC. Since then, through NIBSC, the MHRA has been developing its own biological products and trading with the industry.\n\n“The [NIBSC’s] Division of Virology has worked on polio vaccines since their beginning in the 1960s ….Efforts at NIBSC are now focused on the end game and the post-eradication era, where vaccination will have to continue until it is certain that the virus has gone and all residual sources of the virus are contained or dealt with,” NIBSC’s website states on its ‘WHO Collaborating Centre on Polio’ page. And it continues:\n\n“Environmental screening and investigation of isolates is crucial to the end game and there is particular investigation of an individual who has been excreting poliovirus for over thirty years.”\n\nDoes this individual live in London?\n\nUKHSA has advised an IPV booster dose should be offered to all children between the ages of 1 and 9 in all London boroughs.\n\nIPV was developed in 1955 by Dr. Jonas Salk and is also referred to as the Salk vaccine. IPV consists of inactivated (killed) poliovirus strains of all three poliovirus types. But that’s not all that it contains.\n\nDr. Maurice Hilleman, Chief of the Merck Pharmaceutical Company’s vaccine division, developed over 40 vaccines and discovered SV40 and the adenoviruses.\n\nSV40 was the 40th virus found in rhesus monkey kidney cells when these cells were used to make the polio vaccine. This virus contaminated both the IPV and the oral or “live” polio vaccine (“OPV”) developed by Dr. Albert Sabin.\n\nWhen it was discovered that SV40 was an animal carcinogen that had found its way into the polio vaccines, a federal law was passed in 1961 that required that no vaccines contain this virus. It has been alleged that there have been SV40-contaminated batches of OPV administered to some children until the end of the 1990s. Although the prevalence of SV40 infections in humans is not known, numerous studies suggest that SV40 is a pathogen resident in the human population today.\n\nIn an astonishing recording made decades ago, Dr. Hillerman openly admitted that vaccines were contaminated with AIDS and cancer viruses, including SV40:\n\nDr. Maurice Hilleman: “Well I got an invitation [to give a talk] from the Sister Kinney Foundation which was the opposing Foundation when it was the live virus …”\n\nInserted clip Dr. Albert Sabin: “There were those who didn’t want a live virus vaccine. The National Foundation for Infantile Paralysis concentrated all its efforts on getting more and more people to use the killed virus vaccine, while they were supporting me for research on the live viruses.”\n\nDr. Maurice Hilleman: “So, now I got to have something [to talk about] (laughter), you know that’s going to attract attention. And gee, I thought that damn SV40, I mean that damn vacuolating agent that we have, I’m just going to pick that particular one, that virus has got to be in vaccines, it’s got to be in the Sabin vaccines. So, I quick tested it (laughter) and, sure enough, it was in there.”\n\nTowards the end of the clip, you can hear Dr Edward Shorter asking why this didn’t get out into the press. Dr. Hilleman answered:\n\n“Well, I guess it did, I don’t remember. We had no press release on it. Obviously, you don’t go out – this is a scientific affair within the scientific community.”\n\nIn other words, scientists kept their secrets to themselves.\n\nIf the video clip above is removed from YouTube you can watch it HERE and you can read the transcript HERE. The clip was taken from the 2007 documentary ‘In Lies We Trust’ by Leonard Horowitz. You can watch the full documentary HERE, the clip above begins at timestamp 2:00:00.\n\nFurther reading: Vaccine-Derived Polio Is Found in London’s Sewage and Their Solution is to Inject People with More Vaccines, 12 August 2022\n\nVaccines Never Eradicated Polio, They Cause Polio\n\nThe history of the polio vaccine and the corruption behind it is a topic Health Impact News has covered for over a decade. Health Impact News has been attacked and censored on this topic as they have made the claims, based on the evidence, that:\n• the polio vaccine never eradicated “polio” as they simply renamed the symptoms associated with “polio” to make it look like polio disappeared, and\n• the only people being infected with a “polio virus” today are those who were vaccinated for it with the live, oral polio vaccine (“OPV”).\n\nThis was called a “conspiracy theory” for years by corporate media, but the truth became so obvious that in 2019, just a few months before the “Covid Pandemic” arrived, corporate media finally admitted that the only cases of polio worldwide were caused by the polio vaccine.\n\nThere have never been any vaccines that have been proven to stop polio, and it is a well-known fact today that all cases of polio are from the polio vaccines.\n\nFinding evidence of the “polio virus” in sewage systems of large international cities where people frequently fly into from countries where the OPV is still being used, has been happening pretty much every year for the past 2 decades or so.\n\nPolio vaccines are the problem, NOT the solution.", "opengraph": {"title": "Polio vaccines are the problem, not the solution", "type": "article", "url": "https://www.pollution.news/2022-08-31-polio-vaccines-are-the-problem-not-the-solution.html", "site_name": "Pollution News", "description": "“Following the discovery of type 2 vaccine-derived poliovirus in sewage in north and east London, the Joint Committee on Vaccination and Immunisation (JCVI) has advised that a targeted inactivated polio vaccine (IPV) booster dose should be offered to all children between the ages of 1 and 9 in all London boroughs.” – UK Health Security Agency (“UKHSA”), 10 August 2022 (Article […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/08/PolioVaccine.jpg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/j0fJG2RzAJM?start=4356\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/j0fJG2RzAJM?start=4356"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/-uGWut6IRfA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/-uGWut6IRfA"}], "links": ["https://www.gov.uk/government/news/all-children-aged-1-to-9-in-london-to-be-offered-a-dose-of-polio-vaccine", "https://expose-news.com/2022/08/24/polio-vaccines-are-the-problem-not-the-solution/", "https://www.theguardian.com/australia-news/commentisfree/2022/aug/22/polio-is-spreading-in-the-us-uk-and-israel-should-australia-be-worried", "https://www.abc.net.au/news/2022-08-23/polio-outbreaks-reveal-rare-link-oral-vaccines/101361372", "https://polioeradication.org/news-post/novel-oral-polio-vaccine-type-2-nopv2-granted-interim-emergency-use-listing-recommendation/", "https://www.brighteon.tv", "https://www.nibsc.org/about_us/latest_news/nibsc_merges_with_the_mhra.aspx", "https://www.nibsc.org/products.aspx", "https://expose-news.com/2022/08/24/polio-vaccines-are-the-problem-not-the-solution/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2022-08-31-polio-vaccines-are-the-problem-not-the-solution.html&linkname=Polio%20vaccines%20are%20the%20problem%2C%20not%20the%20solution", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}