{"result_id": "242010", "URL": "http://www.pollution.news/2022-06-16-home-depot-lowes-stop-selling-cancer-causing-glyphosate.html", "timestamp": "2023-04-25 16:49:29 CEST+0200", "meta": {"description": "For nearly a decade, consumer groups and the general public have petitioned America’s two largest home improvement chains, Lowe’s and Home Depot, to stop selling glyphosate-based herbicide products such as Roundup because they cause cancer. Because nothing has happened as of yet, some groups are upping the ante with added pressure. As we reported back […]", "lang": "en", "keywords": "cancer,environment,food supply,Friends of the Earth,glyphosate,harvest,herbicide,Home Depot,Lowe's,Roundup,toxic ingredients", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "http://www.pollution.news/2022-06-16-home-depot-lowes-stop-selling-cancer-causing-glyphosate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "Consumer groups increase pressure on Home Depot, Lowe’s to stop selling cancer-causing glyphosate weedkillers", "cleaned_text": "For nearly a decade, consumer groups and the general public have petitioned America’s two largest home improvement chains, Lowe’s and Home Depot, to stop selling glyphosate-based herbicide products such as Roundup because they cause cancer. Because nothing has happened as of yet, some groups are upping the ante with added pressure.\n\nAs we reported back in 2015, glyphosate is a cancer-causing substance that is linked to many cases of non-Hodgkin’s lymphoma and other forms of the disease. It is indiscriminately sprayed on food crops and lawns all throughout the United States, which at least in part explains why cancer rates in this country are skyrocketing.\n\nTime and time again, concerned members of the public have asked Lowe’s and Home Depot to stop selling these cancer-causing products to their customers. Since they have not listened, Friends of the Earth (FoE) has installed a giant billboard outside the two retailers’ headquarters detailing how glyphosate is destroying both humans and animals.\n\nOn the day of its annual shareholder meeting, Lowe’s was bombarded with renewed pressure to stop selling glyphosate-based products. The company was informed once again that glyphosate is destroying pollinators such as bees and butterflies, which are necessary for food production, as well as humans who are developing cancer following exposure to the chemical.\n\n“As the second-largest home and garden retailer in the U.S., Lowe’s can play a huge role in ending the use of this toxic weedkiller in our backyards and across the country,” reports The Defender.\n\n“A recent analysis released by coalition member groups shows that half of herbicides sold by Lowe’s contain highly hazardous ingredients.”\n\nTell Lowe’s and Home Depot to STOP selling glyphosate and Roundup\n\nHome Depot, the nation’s number-one home improvement retailer, received a similar message. Backed by 124 other organizations, including SumOfUs, Beyond Pesticides, the Center for Food Safety, Green America, Herbicide Free Campus, Toxic Free NC, and Kids Right to Know, FoE is demanding immediate action.\n\n“It’s reckless for Lowe’s to keep selling glyphosate when safer organic alternatives exist,” says Paolo Mutia, a food and agriculture campaigner at Friends of the Earth.\n\n“Lowe’s must build on earlier commitments to phase out bee-toxic neonic pesticides and its chemical policy by immediately removing glyphosate products and ensuring alternatives are truly safer.”\n\nLacey Kohlmoos, the U.S. campaign manager at SumOfUs, added to this that Lowe’s claims to value its customers, “but company executives are putting their customers’ health at risk by refusing to take this toxic weedkiller off its shelves.”\n\n“We hope that hearing directly from concerned customers and shareholders will convince Marvin Ellison and the other Lowe’s executives to value health and safety over profit margins, and finally get rid of Roundup and other glyphosate products linked to cancer.”\n\nThe general public is already voluntarily shifting away from glyphosate as people learn the truth about how toxic it is. Many families have already switched to organic alternatives to protect their children and pets from glyphosate.\n\nThe problem is that many public parks and schools still use it, along with conventional, large-scale agriculture. And there is no way to tell one way or another unless a person knows the lawn care methods used on a particular property.\n\nBayer, which bought out Monsanto and now owns Roundup, has promised to remove glyphosate from the weedkiller in the U.S. consumer market by 2023. But what about in the meantime?\n\n“We are facing code-red biodiversity and climate crises and it is shameful that Lowe’s and Home Depot continue to prioritize profit over people and the planet,” added Sheina Crystal, the director of communications and campaigns at Herbicide-Free Campus.\n\n“Viable alternatives to glyphosate-based products exist. How many more people must get cancer from Roundup before these giant corporations take action to protect their customers?”\n\nMore related news about toxic, cancer-causing glyphosate can be found at Glyphosate.news.", "opengraph": {"title": "Consumer groups increase pressure on Home Depot, Lowe’s to stop selling cancer-causing glyphosate weedkillers", "type": "article", "url": "https://www.pollution.news/2022-06-16-home-depot-lowes-stop-selling-cancer-causing-glyphosate.html", "site_name": "Pollution News", "description": "For nearly a decade, consumer groups and the general public have petitioned America’s two largest home improvement chains, Lowe’s and Home Depot, to stop selling glyphosate-based herbicide products such as Roundup because they cause cancer. Because nothing has happened as of yet, some groups are upping the ante with added pressure. As we reported back […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/06/Glyphosate.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/lowes-home-depot-glyphosate-roundup-weedkiller/", "https://naturalnews.com/049973_Lowes_Home_Depot_glyphosate_petitions.html", "https://www.brighteon.tv", "http://glyphosate.news", "https://childrenshealthdefense.org/defender/lowes-home-depot-glyphosate-roundup-weedkiller/", "https://naturalnews.com/049973_Lowes_Home_Depot_glyphosate_petitions.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2022-06-16-home-depot-lowes-stop-selling-cancer-causing-glyphosate.html&linkname=Consumer%20groups%20increase%20pressure%20on%20Home%20Depot%2C%20Lowe%E2%80%99s%20to%20stop%20selling%20cancer-causing%20glyphosate%20weedkillers", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}