{"result_id": "242023", "URL": "http://www.pollution.news/2021-05-18-australians-ingesting-microplastics-at-home-reports-study.html", "timestamp": "2023-04-25 16:49:40 CEST+0200", "meta": {"description": "Australians are ingesting significantly large numbers of small pieces of plastic, called microplastics, inside their homes, according to a recent study published in the journal Environmental Pollution. The study, conducted by researchers from Macquarie University in Sydney, showed that between 22 and 6,169 microplastic fibers were deposited as dust indoors per square meter every day. This study is […]", "lang": "en", "keywords": "Air pollution,badhealth,badpollution,discoveries,environment,microplastic pollution,microplastics,plastics,research,toxins", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "http://www.pollution.news/2021-05-18-australians-ingesting-microplastics-at-home-reports-study.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "Australians are ingesting microplastics at home – study", "cleaned_text": "Australians are ingesting significantly large numbers of small pieces of plastic, called microplastics, inside their homes, according to a recent study published in the journal Environmental Pollution.\n\nThe study, conducted by researchers from Macquarie University in Sydney, showed that between 22 and 6,169 microplastic fibers were deposited as dust indoors per square meter every day. This study is the first to examine how much microplastics Australians are exposed to inside their homes.\n\nIn an article on The Conversation, the researchers said their study demonstrates it’s an inescapable reality that humans are living in “a sea of microplastics.”\n\nPeople are also exposed to microplastics indoors\n\nMicroplastics measure less than five millimeters (mm) across. They are derived from petrochemicals extracted from oil and gas productions. Since microplastics are still a relatively new field of study, not a lot is known about them and their impacts. But experts know they pose a danger to oceans and marine life, at the very least.\n\nScientists have also made troubling discoveries in recent years, finding microplastics in remote places like Mount Everest, the Mariana’s Trench and Antarctica. Such discoveries give scientists a glimpse of how pervasive microplastics are as environmental pollutants.\n\nHowever, only a handful of studies have looked at how much microplastics humans are exposed to inside their homes. To that end, the researchers analyzed dust deposited from indoor air in 32 homes across Sydney over a one-month period in 2019.\n\nThey found that 39 percent of the deposited dust particles were microplastics, while 42 percent were natural fibers like cotton and hair. Another 18 percent of the particles were natural-based fibers like viscose and cellophane. The remaining one percent of the particles were fragments made of various materials.\n\nWithin each home, 22–6,169 particles were deposited as dust per square meter per day. Homes with carpets had nearly double the number of microplastic fibers than homes without carpeted floors.\n\nHowever, homes without carpets had twice more polyvinyl fibers – synthetic fibers made of vinyl chloride – than homes with carpets. This is because the coating applied to hard flooring can degrade over time, producing microplastic fibers in house dust.\n\nThe researchers also found that about a quarter of all microplastic fibers recorded measured less than 250 micrometers. Microplastic fibers this small can be dangerous because they can be inhaled.\n\nUsing human exposure models, the researchers also determined that inhalation and ingestion rates were greatest in children under six years old. Children this age have a higher breathing rate than adults.\n\nIn fact, they inhale around 0.3 milligrams of microplastics per kilogram of body weight (mg/kg) per year. They also ingest an average of 6.1 mg/kg of microplastics per year. This is likely because they spend more time on the floor crawling or playing. They also tend to put their hands in their mouths more often than adults.\n\nHow to reduce exposure to microplastics\n\nDespite their troubling findings, the study still indicates that there are effective ways to minimize exposure. For instance, choosing floors with hard surfaces rather than carpeted ones is a great way to reduce microplastic exposure. It also helps to vacuum floors at least once a week to prevent dust buildup.\n• Drink tap water – A 2018 study in Frontiers in Chemistry showed that water from plastic bottles has nearly double the amount of microplastics in tap water on average.\n• Heat food in or on the stove – When heated, some plastic containers may leach chemicals into food. Use a pan when heating food.\n• Store food in glass or silicone containers – Plastic food containers, even recyclable ones, may contain potentially harmful chemicals. Use food containers made of glass or silicone instead.\n• Eat fresh food as much as possible – Processed foods carry a higher risk of microplastic contamination because of their plastic packaging. Opt for fresh foods instead. (Related: Phthalates found in plastic food packaging linked to chronic disease.)\n\nLearn more about the health risks associated with microplastic exposure at Microplastics.news.", "opengraph": {"title": "Australians are ingesting microplastics at home – study", "type": "article", "url": "https://www.pollution.news/2021-05-18-australians-ingesting-microplastics-at-home-reports-study.html", "site_name": "Pollution News", "description": "Australians are ingesting significantly large numbers of small pieces of plastic, called microplastics, inside their homes, according to a recent study published in the journal Environmental Pollution. The study, conducted by researchers from Macquarie University in Sydney, showed that between 22 and 6,169 microplastic fibers were deposited as dust indoors per square meter every day. This study is […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/05/Room-Carpet-Living-Luxury-Family-Floor-Home.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ecowatch.com/microplastics-health-risk-2652900578.html", "https://www.mq.edu.au/", "https://www.brighteon.tv", "https://www.consumerreports.org/health-wellness/how-to-eat-less-plastic-microplastics-in-food-water/", "https://naturalpedia.com/water-sources-health-risks.html", "https://naturalpedia.com/organic-food-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.naturalnews.com/2018-07-31-phthalates-found-in-plastic-food-packaging-linked-to-chronic-disease.html", "http://microplastics.news/", "https://www.ecowatch.com/microplastics-health-risk-2652900578.html", "https://www.consumerreports.org/health-wellness/how-to-eat-less-plastic-microplastics-in-food-water/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2021-05-18-australians-ingesting-microplastics-at-home-reports-study.html&linkname=Australians%20are%20ingesting%20microplastics%20at%20home%20%E2%80%93%20study", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}