{"result_id": "242021", "URL": "https://www.pollution.news/2022-04-22-americas-water-supply-poisoned-long-before-covid.html", "timestamp": "2023-04-25 16:49:38 CEST+0200", "meta": {"description": "The Health Ranger Mike Adams was appalled by people criticizing Dr. Bryan Ardis for bringing up the possibility that the water systems across the United States are contaminated with SARS-CoV-2 – the virus behind the Wuhan coronavirus (COVID-19) pandemic. “I found it a little bit surprising that some people were giving you some pushback on the […]", "lang": "en", "keywords": "badhealth,badpollution,badscience,Bryan Ardis,CDC,clean water,conspiracy,covid-19,deception,environment,infections,Mike Adams,outbreak,poison,poisoning,snake venom,tap water,toxins,water supply", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2022-04-22-americas-water-supply-poisoned-long-before-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "Brighteon Conversations: America’s water supply has been systematically poisoned long before COVID", "cleaned_text": "Brighteon Conversations: America’s water supply has been systematically poisoned long before COVID\n\nThe Health Ranger Mike Adams was appalled by people criticizing Dr. Bryan Ardis for bringing up the possibility that the water systems across the United States are contaminated with SARS-CoV-2 – the virus behind the Wuhan coronavirus (COVID-19) pandemic.\n\n“I found it a little bit surprising that some people were giving you some pushback on the water issue. It’s as if they’ve forgotten the decades of water fluoridation. The water supply has been meticulously, systematically poisoned with toxic fluoride, which is a neurotoxic chemical,” Adams pointed out during a recent episode of “Brighteon Conversations” featuring Ardis as guest.\n\n“Usually it comes in the form of a powder originally, and then it’s put into solution. Well, in every Municipal Water Center, there is a machine that drips the proper dose of poison into the water supply, folks. So how can anybody say they’re not poisoning us in the water?”\n\nThe funny thing, according to Ardis, is that the water angle is not even the point he is trying to drive home.\n\n“I have said for the from the beginning for the last two years, whatever the bioweapon is – it’s not very good. Because less than one percent of the entire world has died from it. Whatever they’ve been investing billions of dollars into, 99.997 percent of everyone worldwide has survived. That means God’s creation has been way greater than whatever man has weaponized,” Ardis said.\n\n“So even with the water source, if that is the source, I never thought it was dangerous. I never thought it was horrific and demonizing and everyone is gonna look at the water. But I want to make sure the water thing is handled here.”\n\nFor those asking for proof about the water angle of the story, Ardis said: “Look at what the CDC [Centers for Disease Control and Prevention] has been doing; what they’ve been actually looking the whole time is the bioweapon called SARS-CoV-2. They have 400 water testing sites in different cities around the country. And they’re sticking cotton swabs, doing PCR testing on your water looking for SARS-CoV-2.”\n\nAnd with recent reports bringing up the possibility that SARS-CoV-2 has a snake venom component, the idea that Americans are getting poisoned with potable water is suddenly no longer not far-fetched. (Related: PHARMA SNAKES: Thirteen irrefutable FACTS about snake venom, Big Pharma and biological weapons.)\n\nA study from 2021 already looked at the connection of snake venom to COVID-19. Scientists from the University of Arizona have discovered an enzyme similar to one found in rattlesnake venom that could be driving the COVID-19 deaths.\n\n“We found evidence that there was an enzyme, a snake-like enzyme, in the blood of people who were in extraordinarily high levels,” said the senior author of the study, Dr. Floyd Chilton.\n\nScientists have worked on the study for over a year, and the snake-like enzyme has been found in healthy people at low case levels to prevent bacterial infections. In severe cases of COVID-19, however, it’s doing the opposite.\n\nChiton also said that the study could help researchers come up with specific therapeutics that will not care which variant is coming.\n\nAccording to the researchers, current clinical trials on snake bites are helping in those efforts. They hope to repurpose the treatments, which could one day result in a viable option to prevent death in severe COVID patients.\n\nChilton said that this will allow scientists to take a precision medicine approach to the disease. “We can go into clinical trials and choose the people who are at risk of this mechanism and then specifically treat those people,” he said.\n\nResearchers are also set to develop an international multi-center clinical trial, working with global organizations to see how they can make this approach possible. (Related: VenomTech company announces massive library of SNAKE VENOM peptides for pharmaceutical development; “nanocarriers” stabilize snake venom in WATER.)\n\nRattlesnake expert and owner of Rattlesnake Solutions, Bryan Hughes, offered his own take on the study: “For something that is almost as universally loathed as rattlesnakes, it seems fitting, interesting and ironic that the venom that they have in rattlesnakes might be the key in getting out of this situation.”\n\nFollow Pandemic.news for more news related to the COVID-19 pandemic.\n\nWatch the video below to learn more about the “venom theory” as explained by Dr. Bryan Ardis.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nBig Pharma uses snake venom to develop drugs and vaccines: here’s the proof.\n\nVENOM FACTORIES: World Economic Forum celebrates new technology to SYNTHESIZE snake venom peptides using RNA advances for rapid venom “drug” development and deployment.\n\nDr. Bryan Ardis releases huge allegations: The covid-19 virus, vaccines and some treatments are all derived from SNAKE VENOM.\n\nSnake venom company Venomtech announces partnership with Charles River Laboratories, which ran Fauci’s “secret island” of medical experiments on monkeys and beagles.\n\nFACT: The FDA has approved numerous drugs derived from VENOM, including from snakes.", "opengraph": {"title": "Brighteon Conversations: America’s water supply has been systematically poisoned long before COVID", "type": "article", "url": "https://www.pollution.news/2022-04-22-americas-water-supply-poisoned-long-before-covid.html", "site_name": "Pollution News", "description": "The Health Ranger Mike Adams was appalled by people criticizing Dr. Bryan Ardis for bringing up the possibility that the water systems across the United States are contaminated with SARS-CoV-2 – the virus behind the Wuhan coronavirus (COVID-19) pandemic. “I found it a little bit surprising that some people were giving you some pushback on the […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/05/Tap-Water-Flowing-Hot-Use-Bathroom-Faucet.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/14d31e23-e80f-4247-a882-c148ac4ea53f", "http://fluoride.news", "https://www.brighteon.tv", "http://biologicalweapons.news", "https://www.naturalnews.com/2022-04-15-pharma-snakes-thirteen-irrefutable-facts-about-snake-venom-big-pharma-and-biological-weapons.html", "https://www.arizona.edu/", "https://www.10news.com/news/national/coronavirus/study-finds-link-between-covid-19-deaths-and-snake-venom", "https://naturalnews.com/2022-04-13-venomtech-company-announces-massive-library-of-snake-venom-peptides-for-pharmaceutical-deployment.html", "http://Pandemic.news", "https://www.brighteon.com/14d31e23-e80f-4247-a882-c148ac4ea53f", "https://www.brighteon.com/channels/hrreport", "https://newstarget.com/2022-04-15-big-pharma-snake-venom-develop-drugs-vaccines.html", "https://vaccines.news/2022-04-14-wef-celebrates-technology-synthesizing-snake-venom-peptides-rna.html", "https://vaccines.news/2022-04-12-dr-bryan-ardis-releases-huge-allegations-the-covid-19-virus-vaccines-derived-snake-venom.html", "https://newstarget.com/2022-04-14-venomtech-partner-developing-snake-venom-derived-peptides.html", "https://newstarget.com/2022-04-15-fda-approved-numerous-drugs-derived-from-venom.html", "https://www.brighteon.com/14d31e23-e80f-4247-a882-c148ac4ea53f", "https://www.10news.com/news/national/coronavirus/study-finds-link-between-covid-19-deaths-and-snake-venom", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2022-04-22-americas-water-supply-poisoned-long-before-covid.html&linkname=Brighteon%20Conversations%3A%20America%E2%80%99s%20water%20supply%20has%20been%20systematically%20poisoned%20long%20before%20COVID", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}