{"result_id": "242007", "URL": "https://www.pollution.news/2022-04-14-monsanto-tried-kill-biologist-exposed-roundup-dangers.html", "timestamp": "2023-04-25 16:49:27 CEST+0200", "meta": {"description": "French biologist Gilles-Éric Séralini and Robert F. Kennedy, Jr., chairman and chief legal counsel of Children’s Health Defense have something in common: They’ve both devoted a portion of their careers to exposing the toxicity of Monsanto’s Roundup weedkiller. (Article by Susan C. Olmstead republished from ChildrensHealthDefense.org) The two met for the first time on “RFK Jr. The Defender […]", "lang": "en", "keywords": "badcancer,badhealth,badpollution,badscience,Bayer,cancer causes,cancer criminals,chemicals,conspiracy,corruption,crimes,deception,Ecology,environment,evil,glyphosate,GMO,Monsanto,pesticide,products,Roundup,weedkiller", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2022-04-14-monsanto-tried-kill-biologist-exposed-roundup-dangers.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "‘They tried to kill me,’ biologist who exposed dangers of Roundup weed killer tells RFK, Jr.", "cleaned_text": "‘They tried to kill me,’ biologist who exposed dangers of Roundup weed killer tells RFK, Jr.\n\nFrench biologist Gilles-Éric Séralini and Robert F. Kennedy, Jr., chairman and chief legal counsel of Children’s Health Defense have something in common: They’ve both devoted a portion of their careers to exposing the toxicity of Monsanto’s Roundup weedkiller.\n\nThe two met for the first time on “RFK Jr. The Defender Podcast” where they discussed their work.\n\nSéralini is a molecular biologist and an expert on genetically modified organisms (GMOs) and pesticides. He is a professor at the University of Caen and president and chairman of the Committee for Independent Research and Information on Genetic Engineering (CRIIGEN).\n\nSéralini also is the co-author — along with Jérôme Douzelet — of “The Whole Truth About the Monsanto Papers.”\n\nThe book details how Monsanto attacked Séralini and deceived the public after he published groundbreaking findings about Roundup herbicide.\n\nSéralini’s findings were reported in a 2012 Food and Chemical Toxicology article, which the journal’s editor-in-chief, under pressure, retracted in 2013.\n\n“He [did] something nobody else dared to do, which is to take the exact same test [on rats] that Monsanto did for 90 days and do it for two years instead, which is the typical lifespan of a rat. And he found … 80% of the rats that consumed Roundup developed tumors compared to 30% in the control group.\n\n“Not only that, but the tumors in the rats were 130% larger.”\n\nMonsanto mounted a campaign to suppress and discredit Séralini’s research. The infamous Monsanto Papers revealed the company’s strategy.\n\nKennedy was co-counsel on the legal team of Baum, Hedlund, Aristei & Goldman, which acquired the papers.\n\nWhen the Monsanto Papers — hundreds of thousands of documents — were unsealed, Kennedy said, “for the first time we saw Monsanto’s internal communications. We saw their strategy for destroying Professor Séralini’s reputation and getting his article retracted.”\n\nMonsanto employed former intelligence agents and other “hitmen” to destroy the reputations of scientists and to get retractions from the journals, Kennedy said.\n\n“[Monsanto] had a number of strategies. Each one of the strategies was designed to make sure that Monsanto — that Roundup — was not harmed by the science.\n\n“One of the strategies was called ‘Let Nothing Go.’ Another one was called ‘Freedom to Operate’ or FTO. Another was called ‘Whack-a-Mole.’ Every time a scientist would pop his head over the barricades and publish a study that showed that Roundup was unsafe, they would whack him.”\n\n“Project Spruce” was another example, Kennedy said. “And all of them were implemented by these black ops spies, including former members of the CIA and other intelligence agencies.”\n\nSéralini, who said he is “just a researcher,” credited Kennedy with shedding “lots of light in our world.”\n\nCommenting on his research, Séralini said:\n\n“We discovered that [Monsanto] knew that they were [committing] crimes, that they were having toxic products with the Roundup the main herbicide of the world, [and with] GMOs that … were modified in order to contain this pesticide.”\n\nMany people don’t understand that some GMO foods have been modified to be tolerant to Roundup, Séralini said.\n\nKennedy explained that originally, GMO companies claimed genetic modification would reduce the need for pesticides and produce better crops, telling the public, “You’re going to have bigger kernels of corn, larger strawberries, higher-quality food, more meat, more of everything … a cornucopia of the green revolution without chemicals.”\n\nBut, he said, GMOs have been used primarily to make crops that are tolerant of pesticides:\n\n“You can saturate the landscapes from airplanes with this toxin. And the only thing on that landscape that will grow will be the Roundup-ready corn and Roundup-ready soy. Now they have Roundup-ready wheat and barley and sorghum.\n\n“And they’ve actually dramatically increased the use of pesticides and the exposures to our children, rather than reduced them.”\n\n“It’s really devastating to the environment,” said Séralini.\n\nGMO foods survive with large quantities of toxic pesticides in them, and those pesticides are passed to the animals and humans who eat them, he said.\n\nThe consequences to public health include cancer risks — and harm to the immune system, the nervous system and the endocrine system.\n\n“The thing is, people don’t know that when they use pesticides, they eat petroleum waste,” said Séralini. “It is very important … that we shed a new light on this.”\n\nKennedy and Séralini spoke of the tremendous political and legal might behind Monsanto and other big chemical companies.\n\n“Some people linked to [Monsanto] tried to kill me … at least first scientifically, and then physically,” said Séralini. “I have the chance to survive all this system. … Many people didn’t survive.”", "opengraph": {"title": "‘They tried to kill me,’ biologist who exposed dangers of Roundup weed killer tells RFK, Jr.", "type": "article", "url": "https://www.pollution.news/2022-04-14-monsanto-tried-kill-biologist-exposed-roundup-dangers.html", "site_name": "Pollution News", "description": "French biologist Gilles-Éric Séralini and Robert F. Kennedy, Jr., chairman and chief legal counsel of Children’s Health Defense have something in common: They’ve both devoted a portion of their careers to exposing the toxicity of Monsanto’s Roundup weedkiller. (Article by Susan C. Olmstead republished from ChildrensHealthDefense.org) The two met for the first time on “RFK Jr. The Defender […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/04/roundup.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/biologist-exposed-dangers-roundup-weedkiller-rfk-jr/", "https://anchor.fm/rfkjr", "https://childrenshealthdefense.org/defender/new-gmo-food-labeling-laws/", "https://childrenshealthdefense.org/defender/epa-ignores-science-reapprove-deadly-neonicotinoid-pesticides/", "http://www.seralini.fr/the-whole-truth-about-the-monsanto-papers/", "https://childrenshealthdefense.org/defender/monsanto-new-plaintiffs-roundup-weedkiller-cancer/", "https://www.elsevier.com/about/press-releases/research-and-journals/elsevier-announces-article-retraction-from-journal-food-and-chemical-toxicology", "https://childrenshealthdefense.org/defender/the-whole-truth-about-the-monsanto-papers-gilles-eric-seralini-jerome-douzelet-roundup/", "https://www.brighteon.tv", "https://www.baumhedlundlaw.com/documents/pdf/monsanto-documents-2/mongly06721009.pdf", "https://www.baumhedlundlaw.com/documents/pdf/monsanto-documents-2/email-re-freedom-to-operate-and-stewardship_redacted.pdf", "https://www.baumhedlundlaw.com/documents/pdf/monsanto-documents-2/monsanto-execs-playing-whack-a-mole.pdf", "https://www.baumhedlundlaw.com/documents/pdf/monsanto-documents-2/mongly08179950.pdf", "https://childrenshealthdefense.org/defender/biologist-exposed-dangers-roundup-weedkiller-rfk-jr/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2022-04-14-monsanto-tried-kill-biologist-exposed-roundup-dangers.html&linkname=%E2%80%98They%20tried%20to%20kill%20me%2C%E2%80%99%20biologist%20who%20exposed%20dangers%20of%20Roundup%20weed%20killer%20tells%20RFK%2C%20Jr.", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}