{"result_id": "242017", "URL": "https://www.pollution.news/2023-03-22-gmos-linked-increasing-pesticide-use-loss-biodiversity.html", "timestamp": "2023-04-25 16:49:35 CEST+0200", "meta": {"description": "According to the biotech industry, genetically modified (GM) foods would help reduce pesticide use and increase the nutritional content of various food products. They also promised that GM crops could help farmers by boosting their profits and feed the world by increasing crop yields. But data has proven that GM crops have done more harm […]", "lang": "en", "keywords": "agriculture,badpollution,badscience,Bayer,biodiversity loss,biotechnology,crops,Ecology,environment,farming,genetic lunacy,genetically modified,glyphosate,GMO,Monsanto,pesticides,products,science deception,science fraud,soil health,toxic chemicals,toxic ingredients", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2023-03-22-gmos-linked-increasing-pesticide-use-loss-biodiversity.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "GMOs linked to increased pesticide use and loss of biodiversity", "cleaned_text": "GMOs linked to increased pesticide use and loss of biodiversity\n\nAccording to the biotech industry, genetically modified (GM) foods would help reduce pesticide use and increase the nutritional content of various food products. They also promised that GM crops could help farmers by boosting their profits and feed the world by increasing crop yields.\n\nBut data has proven that GM crops have done more harm than good by providing cheap, unhealthy ingredients for ultra-processed ready meals, pre-packaged foods and fast food restaurants.\n\nOver 40,000 people in America have filed lawsuits claiming that exposure to Roundup has caused cancer, specifically non-Hodgkin lymphoma. Once a rare cancer, non-Hodgkin lymphoma is currently the seventh most common cancer in men and women in the country.\n\nDespite these adverse effects on crops, the food industry and public health, the agricultural biotech industry continues to develop a new suite of genetic engineering technologies called gene editing, which includes techniques such as CRISPR, synthetic biology and gene drives.\n\nLike most business that are all about profits, the toxic world of genetically modified organisms (GMOs) and industrial agriculture relies on false promises.\n\nFor nearly 30 years big biotech companies like Monsanto/Bayer, BASF and others have lied about how genetic engineering can help revolutionize farming and food production.\n\nIn the past, GMO crops were sold to reduce on-farm pesticide use.\n\nBut since GM crops were introduced, data has revealed that there had been a significant and alarming increase in pesticide use on the same crops worldwide.\n\nMost GM crops fall into one of two types:\n\nPesticide “resisters ” or “Roundup Ready” crops, which are made up of mostly corn and soya, are genetically engineered to withstand Monsanto’s Roundup herbicide. It’s made with the active ingredient glyphosate.\n\nTo date, pesticide resisters have also been engineered to resist other highly toxic pesticides like 2,4-D and dicamba.\n\nGM crops have turned glyphosate into one of the most widely and dangerously used herbicides in history.\n\nAccording to the United States Department of Agriculture (USDA), more than 90 percent of the soybeans harvested on farms in America are genetically engineered to withstand herbicides like Roundup.\n\nPesticide “producers” or Bt plants include corn, soya and cotton. These crops produce the same toxin as the bacterium Bacillus thuringiensis.\n\nIn other words, the crops produce their own insecticides. In theory, when an agricultural pest eats these crops, it will be poisoned and die.\n\nHowever, weeds and insects rapidly evolve to be immune to these poisons. Many agricultural weeds have become resistant to Roundup, in turn requiring farmers to spray more every year.\n\nThe heavier use of herbicides then produces more “superweeds” and results in higher herbicide use.\n\nThe increase was first observed in pesticide registers. A 2012 study from Washington State University revealed that planting GM crops quickly produced herbicide-resistant “superweeds.” This also increased herbicide use.\n\nIn 2016, research from the University of Virginia verified that glyphosate-resistant weeds have resulted in an alarming 28 percent increase in herbicide use on GM soybeans compared with non-GM soybeans. This rise has also been reported in other countries, particularly Canada, Argentina and Brazil.\n\nExperts also recently reported that insects have begun to become resistant to the insecticides bred into pesticide products. Once again, this has forced farmers to use even more dangerous mixtures of pesticides to keep them under control. (Related: GMO ingredients in “fake meat” Impossible Burgers linked to health issues.)\n\nThe planet needs a healthy, biodiverse and functioning ecosystem, especially one that depends on a “rich diversity of plants, animals and insects.”\n\nThis is crucial because agricultural land that is biodiverse is more productive and more able to cope with unexpected changes, such as climate or cyclical levels of plant diseases or invasive species.\n\nResearch also suggests that healthy soil can absorb and hold more CO2 than damaged soil.\n\nHowever, modern industrial farming usually involves large tracts of land devoted to a single crop, known as monocultures.\n\nIn monocultures, diversity is discouraged through the use of pesticides. These chemicals keep all living things, except the valuable crop, off the land.\n\nIn America, land converted to soy production has typically been pre-existing agricultural land that is not linked to deforestation, unlike in South America.\n\nYet increasing demand for soy is destroying American prairies.\n\nAccording to an analysis of satellite data, between 2006 and 2011, farmers in the Dakotas, Minnesota, Iowa and Nebraska had converted at least 1.3 million acres of grassland into soybean and corn production. Research by the USDA’s Economic Research Service confirmed this finding.\n\nDespite the claims that GMOs can help boost the earnings and crop yields of farmers, monocultures are bad for wildlife.\n\nMonocultures reduce habitats for many wild creatures, from ground-nesting birds to important pollinators like bees and butterflies.\n\nMonocultures also cause trouble for farmers.\n\nAccording to an in-depth investigation published in 2016, genetic modification in America and Canada actually failed to bring the expected increases in crop yields.\n\nThis reflects the findings of a 2016 National Academy of Sciences report that “there was little evidence” the introduction of genetically modified crops in the U.S. resulted in yield gains beyond those already observed in conventional crops.\n\nAccording to recent reports, farmers in America have been suffering from a glut of soy, an issue associated with ongoing trade disputes with China, which then caused low prices and farm bankruptcies.\n\nAdditionally, GMOs have also failed to help address world hunger.\n\nThe main by-products of GMOs are fats and sugars. GMOs, when they’re not being turned into biofuels, are being turned into corn, soya and cottonseed oil. They are also turned into sugars like beet sugar and high-fructose corn syrup.\n\nThis is an issue because GMOs are only used to provide cheap, unhealthy ingredients for ultra-processed ready meals, pre-packaged foods and fast food restaurants.\n\nConsumers are more aware of the dangers of GMOs\n\nSince the first GMO foods and animal drugs, the Flavr Savr tomato and recombinant Bovine Growth Hormone (rBGH), came onto the US market in 1994, the biotech industry has been trying to convince the public to accept genetically engineered food.\n\nFortunately, people are realizing that GMOs cause more harm than good.\n\nStudies also show that the public doesn’t buy it, and no one wants to eat it. Consumers are also concerned about health, which is a good thing.\n\nOther shoppers have also expressed concerns about the damage these crops cause to the environment. These are legitimate concerns, especially since they are about corporate control of food.\n\nIn line with that, there have been some big and consequential mergers in the agri-biotech sector.\n\nSome mergers, like the “Big Six” (Bayer, BASF, Dow, DuPont, Monsanto and Syngenta) became the Big Four (Bayer-Monsanto, DowDuPont/Corteva, ChemChina-Syngenta and BASF). The mergers effectively concentrated the majority of the power and profits of the seed and GM technology market into a smaller group.\n\nThe GMO boom isn’t over yet, and independent testing that reveals how much glyphosate is in consumers’ bodies and foods has become widespread. At the same time, the Non-GMO Verified label is now as important as the organic label for consumers who wish to avoid GMOs in their foods.\n\nVisit GMO.news to learn more about GMOs and GM crops.\n\nWatch the video below to find out how GMO mosquitoes are being turned into vaccines.\n\nThis video is from the Seeking Happiness channel on Brighteon.com.\n\nGMO Food and GMO Vaccines – Humans are becoming disease-manufacturing machines.\n\nGMO mosquitoes now secretly VACCINATING people without their consent.\n\nAttack on food supply: Bill Gates pushing for genetic modification of farm animals.", "opengraph": {"title": "GMOs linked to increased pesticide use and loss of biodiversity", "type": "article", "url": "https://www.pollution.news/2023-03-22-gmos-linked-increasing-pesticide-use-loss-biodiversity.html", "site_name": "Pollution News", "description": "According to the biotech industry, genetically modified (GM) foods would help reduce pesticide use and increase the nutritional content of various food products. They also promised that GM crops could help farmers by boosting their profits and feed the world by increasing crop yields. But data has proven that GM crops have done more harm […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2023/03/Gmo-Corn-Crop-Stalk.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/03/15/the-toxic-world-of-gm-crops/", "https://www.naturalpedia.com/cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "http://geneticlunacy.com/", "http://biotech.news", "https://www.brighteon.tv", "https://www.naturalpedia.com/dicamba-toxicity-side-effects-diseases-and-environmental-impacts-unassigned-discuss-this-to-do.html", "https://byjus.com/biology/bt-crops", "https://wsu.edu/", "https://www.virginia.edu/", "https://naturalnews.com/2022-10-18-gmo-ingredients-impossible-burgers-cause-health-issues.html", "https://www.naturalpedia.com/corn-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.naturalpedia.com/hfcs-high-fructose-corn-syrup-sources-health-risks.html", "https://gmo.news/", "https://www.brighteon.com/306e2bb0-b2c7-41be-9b7a-2b7c8311a5b3", "https://www.brighteon.com/channels/seekinghappiness", "https://naturalnews.com/2021-02-10-gmo-food-and-gmo-vaccines-humans-are-becoming-disease-manufacturing-machines.html", "https://naturalnews.com/2022-09-30-gmo-mosquitoes-secretly-vaccinating-people-without-consent.html", "https://naturalnews.com/2023-01-05-gates-pushing-genetic-modification-of-farm-animals.html", "https://expose-news.com/2023/03/15/the-toxic-world-of-gm-crops/", "https://byjus.com/biology/bt-crops", "https://www.brighteon.com/306e2bb0-b2c7-41be-9b7a-2b7c8311a5b3", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2023-03-22-gmos-linked-increasing-pesticide-use-loss-biodiversity.html&linkname=GMOs%20linked%20to%20increased%20pesticide%20use%20and%20loss%20of%20biodiversity", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}