{"result_id": "242024", "URL": "https://www.pollution.news/2019-04-14-dangers-of-glyphosate-the-endocrine-disrupting-synthetic-herbicide.html", "timestamp": "2023-04-25 16:49:40 CEST+0200", "meta": {"description": "Glyphosate has been getting a lot of attention for its connection to cancer, but that’s far from the only health concern related to the weed killer. There is a long – and growing – list of dangers, but one of the biggest ones that doesn’t get a lot of attention is the fact that it’s […]", "lang": "en", "keywords": "agriculture,badcancer,badfood,badhealth,badmedicine,badpollution,cancer,cancer causes,disease causes,endocrine disruptor,food safety,food supply,glyphosate,gut health,harvest,herbicide,Monsanto,non-Hodgkin lymphoma,research,Roundup,toxic chemicals,toxic ingredients,toxins", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2019-04-14-dangers-of-glyphosate-the-endocrine-disrupting-synthetic-herbicide.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "The dangers of glyphosate, the endocrine-disrupting synthetic herbicide", "cleaned_text": "The dangers of glyphosate, the endocrine-disrupting synthetic herbicide\n\nGlyphosate has been getting a lot of attention for its connection to cancer, but that’s far from the only health concern related to the weed killer. There is a long – and growing – list of dangers, but one of the biggest ones that doesn’t get a lot of attention is the fact that it’s an endocrine disruptor.\n\nIn fact, the glyphosate-based herbicide Roundup can cause damage to the endocrine system at levels that are legally permitted in water. This is according to a study carried out in Australia by researchers at Flinders University, who found that Roundup killed the cells that produce progesterone in women, causing their levels to drop. This is bad news when you consider that Roundup is the most popular herbicide in the U.S., where 250 million pounds of it are used each year.\n\nMoreover, they found that Roundup is more toxic than glyphosate alone, likely due to the synergistic effect of its other ingredients making glyphosate’s effects worse.\n\nAlthough the researchers in that study drew attention to the high levels in drinking water, it’s important to keep in mind that water isn’t most people’s only source of exposure. Glyphosate residues have been found in many of the foods sold in grocery stores, especially cereals and oat-based snacks.\n\nIt is also found on 90 percent of soybeans and corn. In some cases, it’s making its way into our food because it’s used on oats, lentils, wheat, barley and other crops prior to harvest to help dry them out faster.\n\nWhat else is glyphosate doing to us?\n\nWe’ve already established that glyphosate is an endocrine disruptor, and its connection to cancers like non-Hodgkin lymphoma has been getting a lot of attention lately as sufferers win multi-million-dollar lawsuits against Roundup maker Monsanto. The International Agency for Research on Cancer, part of the World Health Organization, has declared it a probable carcinogen to humans.\n\nIt has also been linked to birth defects, reproductive problems and liver disease, and it has been shown to have the potential to and harm the DNA of human umbilical cord, placental and embryonic cells. In one study, more than 90 percent of the women tested had detectable levels of glyphosate in their urine, and their levels were significantly correlated with having shorter lengths of pregnancy.\n\nMeanwhile, an Argentinean study found that in areas where there were higher concentrations of glyphosate in dust and soil, there were also higher rates of congenital abnormalities in children and spontaneous abortion.\n\nGlyphosate can also kill beneficial gut bacteria. One study showed that even low doses that are considered “safe” by regulators were enough to significantly change the gut microbiota of rat pups, while a different study showed that higher levels of glyphosate caused gut microbiota disturbances and depression and anxiety-like behaviors in mice.\n\nIn addition to harming human health, glyphosate is also harming wildlife, especially bees and butterflies.\n\nUnfortunately, the use of glyphosate has been climbing since it was first patented in 1974 by Monsanto. It really took off in 1996, when Roundup Ready GMO crops were first introduced in the U.S.; Americans’ exposure to the chemical grew 500 percent in the years from 1996 to 2017. Around the world, 9.4 million tons of glyphosate have been sprayed on fields, so it’s no wonder we are finding it everywhere.\n\nUnfortunately, as long as companies like Monsanto enjoy a tight relationship with regulators, we will continue to be exposed to health-damaging glyphosate in our food, water, air and soil.", "opengraph": {"title": "The dangers of glyphosate, the endocrine-disrupting synthetic herbicide", "type": "article", "url": "https://www.pollution.news/2019-04-14-dangers-of-glyphosate-the-endocrine-disrupting-synthetic-herbicide.html", "site_name": "Pollution News", "description": "Glyphosate has been getting a lot of attention for its connection to cancer, but that’s far from the only health concern related to the weed killer. There is a long – and growing – list of dangers, but one of the biggest ones that doesn’t get a lot of attention is the fact that it’s […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2019/04/Weed-B-Gon-RoundUp-Spray-Bottles.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://usrtk.org/pesticides/glyphosate-health-concerns/", "https://www.naturalnews.com/049263_Roundup_endocrine_disruptors_drinking_water.html", "https://www.flinders.edu.au/", "http://science.naturalnews.com/Glyphosate.html", "https://www.brighteon.tv", "https://glyphosate.news/", "https://usrtk.org/pesticides/glyphosate-health-concerns/", "https://www.naturalnews.com/049263_Roundup_endocrine_disruptors_drinking_water.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2019-04-14-dangers-of-glyphosate-the-endocrine-disrupting-synthetic-herbicide.html&linkname=The%20dangers%20of%20glyphosate%2C%20the%20endocrine-disrupting%20synthetic%20herbicide", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}