{"result_id": "242003", "URL": "https://www.pollution.news/2018-12-27-93-of-americans-have-glyphosate-in-their-bodies.html", "timestamp": "2023-04-25 16:49:24 CEST+0200", "meta": {"description": "If you think the proliferation of crop chemicals throughout the environment isn’t all that big of a deal, think again. A comprehensive analysis of glyphosate in particular – glyphosate being the main ingredient in Monsanto’s (now Bayer’s) Roundup herbicide – found that a shocking 93 percent of all people have the chemical lingering inside their […]", "lang": "en", "keywords": "agriculture,Atrazine,badcancer,badfood,badhealth,badmedicine,badpollution,Bayer,Big AG,biotechnology,chemicals,comprehensive study,crops,EDCs,endocrine-disrupting chemicals,Europe,genetically modified organisms,glyphosate,GMOs,herbicide,herbicides,hormones,insecticides,male hormones,Monsanto,pesticides,poison,Roundup,toxins", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2018-12-27-93-of-americans-have-glyphosate-in-their-bodies.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "First-ever comprehensive project finds that 93% of Americans have glyphosate in their bodies", "cleaned_text": "First-ever comprehensive project finds that 93% of Americans have glyphosate in their bodies\n\nIf you think the proliferation of crop chemicals throughout the environment isn’t all that big of a deal, think again. A comprehensive analysis of glyphosate in particular – glyphosate being the main ingredient in Monsanto’s (now Bayer’s) Roundup herbicide – found that a shocking 93 percent of all people have the chemical lingering inside their bodies.\n\nThe research project out of the University of California, San Francisco (UCSF) involved conducting urine samples on test subjects from all across the country, including in areas far away from crop fields where glyphosate and other chemicals are applied. What they found is that almost everyone nowadays is contaminated with glyphosate, which has been identified as a contributor to cancer.\n\nLab results for the first 131 test subjects were released in 2015, while more were published in 2016. All of them show that glyphosate is everywhere, including in the general food supply where ingredients like conventional wheat and soy typically harbor substantial levels of not only glyphosate but also atrazine and many other noxious poisons.\n\nAs America uses more glyphosate, Europe is saying enough is enough\n\nThe scientific evidence against glyphosate is substantial and growing, despite its continued use throughout American agriculture. Meanwhile, Europe has begun to implement more restrictions on glyphosate’s use, and may even ban it altogether once the time comes for its re-approval.\n\nThus far, Big Ag has been unsuccessful in convincing Europeans that glyphosate exists for their benefit, and that they should continue to douse their food with it. Repeated efforts to get the stuff approved for an additional nine years have similarly failed, as Europe recognizes that there’s nothing good to be had from glyphosate’s use.\n\nBut in the United States, money still speaks the loudest. Not only is the federal government, including the Environmental Protection Agency (EPA), fully on board with glyphosate’s continued use, but many of the nation’s politicians are in the pockets of agricultural giants like Monsanto that keep them towing the status quo.\n\n“Despite what the U.S. Environmental Protection Agency and the massive agro-chemical industry would have you believe, a safe level of glyphosate ingestion remains unknown,” explains NaturalHealth365.com.\n\n“Neither government-based regulators nor the chemical industry itself has conducted a thorough investigation of low-level exposures on the U.S. human population. However, research conducted elsewhere strongly indicates that the chemical may cause a more toxic, hormone-disruptive effect at these low levels than even high levels can cause.”\n\nA number of independent studies have confirmed glyphosate’s endocrine-disrupting properties, referring to it as a “hormone hacker.” One particular paper out of India that was published in 2015 found that when male rats were exposed to glyphosate, their male hormones were completely thrown out of whack.\n\nIn another paper published in the Journal of Occupational and Environmental Medicine, researchers learned that glyphosate substantially increases one’s risk of developing skin cancer in the form of melanoma. This was specifically linked to farm workers who, while working in open-air sunlight, were developing the disease at much higher rates than others.\n\nSince glyphosate is also sprayed all over public parks and in home gardens to kill weeds, it also affects city-dwellers – this in addition to the glyphosate that everyone is exposed to through the food supply. There’s really no denying it, which is why independent scientists the world over are pushing for an across-the-board ban in the interest of public health.\n\n“Reduction in exposure through foods can be greatly reduced by selecting only certified organic fruits and vegetables,” says NaturalHealth365.com.\n\n“Avoid GMOs and conventionally grown produce which are likely contaminated with glyphosate. And, finally, exposure through water is greatly reduced by using a high quality water filtration system.”\n\nFor more related news, be sure to check out Glyphosate.news and Roundup.news.", "opengraph": {"title": "First-ever comprehensive project finds that 93% of Americans have glyphosate in their bodies", "type": "article", "url": "https://www.pollution.news/2018-12-27-93-of-americans-have-glyphosate-in-their-bodies.html", "site_name": "Pollution News", "description": "If you think the proliferation of crop chemicals throughout the environment isn’t all that big of a deal, think again. A comprehensive analysis of glyphosate in particular – glyphosate being the main ingredient in Monsanto’s (now Bayer’s) Roundup herbicide – found that a shocking 93 percent of all people have the chemical lingering inside their […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2020/02/Harvest-Agriculture-Precision-Soy-Drone-Fall-Glyphosate.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/glyphosate-monsanto-roundup-1856.html", "https://www.ucsf.edu", "http://www.natural.news/2018-10-25-monsanto-bayer-facing-over-8000-lawsuits-roundup-herbicide-causes-cancer.html", "https://www.naturalnews.com/055503_atrazine_prostate_inflammation_reproductive_issues.html", "https://www.brighteon.tv", "http://www.glyphosate.news/", "http://www.roundup.news/", "https://www.naturalhealth365.com/glyphosate-monsanto-roundup-1856.html", "http://www.natural.news/2018-10-25-monsanto-bayer-facing-over-8000-lawsuits-roundup-herbicide-causes-cancer.html", "https://www.naturalnews.com/055503_atrazine_prostate_inflammation_reproductive_issues.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2018-12-27-93-of-americans-have-glyphosate-in-their-bodies.html&linkname=First-ever%20comprehensive%20project%20finds%20that%2093%25%20of%20Americans%20have%20glyphosate%20in%20their%20bodies", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}