{"result_id": "242004", "URL": "https://www.pollution.news/2023-02-17-east-palestine-train-wreck-largest-dioxin-plume.html", "timestamp": "2023-04-25 16:49:25 CEST+0200", "meta": {"description": "The situation in East Palestine, Ohio, is much worse than the media is letting on, particularly as it pertains to the widespread release of chemical dioxins. The 14 some-odd tanker cars carrying vinyl chloride that were intentionally blown up released a massive plume of these deadly chemicals, which were spread far and wide, including up […]", "lang": "en", "keywords": "Agent Orange,badpollution,chemical spill,chemicals,derailment,dioxin,Dioxins,disaster,East Palestine,Love Canal,Niagara Falls,ohio,Ohio River Basin,toxic chemicals,Train,train wreck,Vinyl chloride", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2023-02-17-east-palestine-train-wreck-largest-dioxin-plume.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "East Palestine train wreck may have created largest dioxin plume in world history", "cleaned_text": "East Palestine train wreck may have created largest dioxin plume in world history\n\nThe situation in East Palestine, Ohio, is much worse than the media is letting on, particularly as it pertains to the widespread release of chemical dioxins.\n\nThe 14 some-odd tanker cars carrying vinyl chloride that were intentionally blown up released a massive plume of these deadly chemicals, which were spread far and wide, including up the eastern seaboard through Pennsylvania, New York and beyond.\n\nTens of millions of people stand to be affected by this dioxin release, which by and large appears to be the most disastrous dioxin incident to have ever occurred in world history. Water supplies, food crops, city parks, state forests – all of them stand to become toxified with dioxins due to this disaster.\n\n“Burning vinyl is the most serious source of dioxin in the environment – whether from trash incinerators, house fires or chemical spills,” explained Eric Coppolino, writing for Planet Waves FM – Chiron Return.\n\n“While vinyl chloride is a precursor chemical to making PVC, any time chlorinated compounds burn there will be dioxins created. And dioxin is a manufacturing byproduct of any manufacturing process involving chlorine, from ‘disinfectants’ to the bleaching of paper. There was plenty of dioxin in those tanker cars before they caught fire.”\n\nDioxins are a hormonal toxin that builds up in the food chain\n\nOne of the most concerning things about dioxins is their persistence. They do not biodegrade and tend to remain wherever they lodge themselves for years and years. (Related: The Agent Orange released during the Vietnam War is still a problem in the areas where it was spread.)\n\nMost people are unaware of what dioxins even are because the media rarely talks about them. Back in the day, a small release of them led to the closure of Times Beach, Mo., which was leveled and had its zip code removed over a dioxin release much smaller than the one that just occurred in Ohio.\n\n“It is one of the most serious environmental issues, but the background is not known by nearly anyone (and that’s partly why I have posted the history below),” Coppolino wrote.\n\nSo where do dioxins come from? They are generated when chlorinated chemicals like vinyl chloride burn, explode or degrade. They are never an end product but are rather a contaminant and degradation byproduct.\n\n“They are directly related to PCBs, which are considered dioxin-like compounds,” Coppolino explained.\n\n“Dioxins were the extremely toxic component in the Vietnam War-era defoliant Agent Orange. They were at the Love Canal in Niagara Falls. They were the toxin involved in the evacuation and dissolution of Times Beach, Missouri. They are the cause of toxic shock syndrome from bleached paper tampons.\n\n“Dioxins are acute toxins on one level. There will be a lot of dead fish and animals in the path of the Ohio plume – and people will get very sick immediately. Kids are extremely sensitive due to their low body weight.”\n\nTheir persistence in the environment and hormonal toxicity makes dioxins a very serious problem, especially when released at high levels like what happened in Ohio. We have not even begun to see the effects of what just occurred, which will manifest in the months and years to come as animals, humans and nature suffer over time.\n\n“I guess a new disease is going to be invented soon,” one commenter wrote about how the establishment will probably invent some new made-up disease to explain away all the future cases of dioxin poisoning caused by the controlled explosion.\n\n“And a new ‘virus’ will be invented, too. And new vaccines. And the shame. People being intoxicated being shamed because they can ‘infect’ people.”\n\nMore related news can be found at ChemicalViolence.com.", "opengraph": {"title": "East Palestine train wreck may have created largest dioxin plume in world history", "type": "article", "url": "https://www.pollution.news/2023-02-17-east-palestine-train-wreck-largest-dioxin-plume.html", "site_name": "Pollution News", "description": "The situation in East Palestine, Ohio, is much worse than the media is letting on, particularly as it pertains to the widespread release of chemical dioxins. The 14 some-odd tanker cars carrying vinyl chloride that were intentionally blown up released a massive plume of these deadly chemicals, which were spread far and wide, including up […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2023/02/Dioxin-Icon-Attention-Bones-Cancer-Caution-Chemical.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://planetwavesfm.substack.com/p/palestine-ohio-train-wreck-its-the", "https://naturalnews.com/2018-07-12-global-chemical-giants-knew-about-the-health-dangers-of-dioxins-decades-before-vietnam.html", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://planetwavesfm.substack.com/p/palestine-ohio-train-wreck-its-the", "https://naturalnews.com/2018-07-12-global-chemical-giants-knew-about-the-health-dangers-of-dioxins-decades-before-vietnam.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2023-02-17-east-palestine-train-wreck-largest-dioxin-plume.html&linkname=East%20Palestine%20train%20wreck%20may%20have%20created%20largest%20dioxin%20plume%20in%20world%20history", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}