{"result_id": "242028", "URL": "https://www.pollution.news/2022-05-29-degradation-of-future-generations-via-contaminated-food-water-toxic-medicine.html", "timestamp": "2023-04-25 16:49:43 CEST+0200", "meta": {"description": "Worse than ever before, the US government and regulatory agencies have sped up the process of degrading human health, the environment and the entire supply chain for fuel, energy and food. It’s not only part of a master plan of depopulation, but one that is intended to sicken the populace so pitifully that they cannot […]", "lang": "en", "keywords": "badpollution,generation degradation,glyphosate,insecticides,pesticides,population reduction,vaccine toxins", "favicon": "wp-content/themes/ScienceTheme/images/Pollution-fav.png", "canonical": "https://www.pollution.news/2022-05-29-degradation-of-future-generations-via-contaminated-food-water-toxic-medicine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.pollution.news", "title": "HAPPENING NOW: The degradation of future generations via contaminated food, tainted water, toxic medicine, deadly vaccines and more", "cleaned_text": "HAPPENING NOW: The degradation of future generations via contaminated food, tainted water, toxic medicine, deadly vaccines and more\n\nWorse than ever before, the US government and regulatory agencies have sped up the process of degrading human health, the environment and the entire supply chain for fuel, energy and food. It’s not only part of a master plan of depopulation, but one that is intended to sicken the populace so pitifully that they cannot defend themselves against the communist tyranny, nor can their children, or their children. It’s a multi-faceted war against earth and humanity, and it’s no conspiracy theory, because all of the signs and proof exist right out in plain sight, and have for years.\n\nDeadly and deforming neonicotinoids, herbicides, insecticides, fluoride, pesticides kill us now and kill our children later\n\nNeonicotinoids are insecticides that kill pollinating insects responsible for the growth of 90 percent of all food on planet earth. Chemically similar to nicotine, hence the name, neonicotinoids are wiping out over 100 species of different food-pollinating bees and the EPA knows it. This is and will continue to severely limit or even wipe out the food supply across the globe, causing malnutrition, starvation and depopulation for future generations.\n\nGlyphosate-based herbicides have been proven in peer-reviewed scientific research to be linked to cancer of vital organs, including the liver and kidneys, yet still, the US regulatory agencies won’t limit or ban the use of it, and it’s the most utilized herbicide ingredient on the planet. What’s worse is the other “inactive” ingredients in Roundup make the herbicide even MORE toxic to humans and animals, further degrading the quality of life now and what is passed on through DNA from generation to generation. There are many other pesticides that harm animals and humans, and that’s why the push for organic food has never been more important.\n\nGMOs have pesticide genes embedded in them, so you can’t even wash off the poison. Beware of all conventional produce in this country, because the odds are, it will kill you quietly while also deforming offspring. Even fluoride purposely dripped into municipal tap water all across the USA is known to cause bone cancer and degraded IQ. When will the mayhem be put to a halt?\n\nUS government and our regulatory agencies have colluded with Big Tobacco and alcohol-selling companies for nearly 100 years to poison the populace\n\nDid you know that prolonged nicotine use doesn’t just damage the user, but the effects are passed on through generations in the form of cognitive, reproductive and behavioral defects, including memory, ADHD and autism? It’s true, and science has proven it. Male rodents exposed to nicotine (their water was spiked with it for just 3 months) experienced changes in their sperm genome and produced puppies and grand-pups with abnormal behavior traits. Plus, exposure to babies in the uterus, even from second-hand smoke, causes learning impairments. All of this is published in PLOS Biology Today reports.\n\nHere’s what the head of the whole nicotine study, Florida State University’s Pradeep Bhide, tells us: “Not much had been known about the effects of paternal smoking on their children and grandchildren. Our study shows that paternal nicotine exposure can be deleterious for the offspring in multiple generations.” The babies and their babies had lower levels of neurotransmitters in their brain, and a higher rate of ADHD and autism.\n\nCorporations in America advertise alcohol consumption like its just a normal beverage for everyone to enjoy regularly, with no warnings about the massive health-damaging effects now and for future generations. All they warn you about is drinking and driving, yet, when alcohol is metabolized in the body, acetaldehyde is formed, a highly reactive DNA-damaging metabolite that obstructs protein production and cell division, which increases cancer risk.\n\nNitrosomines come from deadly chemical reactions during food manufacturing and are highly carcinogenic to humans\n\nNitrosomines are used as preservatives in many foods you may recognize and consume regularly, including hot dogs, cured (deli) meats, bacon, beer, certain cheeses, soups, chips and sometimes fish. Extensive scientific research reveals humans are highly susceptible to carcinogenesis by these N-nitroso compounds that cause cancers of the stomach, pharynx and esophagus.\n\nGenetic changes that promote cancer are passed on through generations in reproductive cells called germ cells (eggs and sperm). These genetic mutations are termed “fault” or “mutation” and can makes cells stop working properly, become cancerous, and then divide and grow uncontrollably.\n\nNow we’re finding out that the COVID-19 vaccines are causing damage to organs and cells that may be passed on to children and grandchildren. Insidious mRNA “technology” gives human cells new instructions to create toxic spike protein particles in the blood forever. The human immune system is then instructed to attack those spike proteins that have traveled throughout the vascular system to the heart, brain and vital cleansing organs. These deadly “clot shot” and gene-mutating injections all come highly recommended by our own CDC and FDA. Go figure.\n\nThen there are deadly prescription drugs made from poisonous venom of animals purposely intended to cause psychosis and severe allergic reactions in the humans who take them “as prescribed.” There’s a whole library of these horrific toxins used and exploited by Big Pharma to harm humans now and for degrading our offspring for multiple future generations. Beware!\n\nThis has been a public service announcement from Natural Health News. Tune your internet frequency to Pesticides.news for updates on the corrupt Biden Regime supporting anything and everything that degrades our future generations.", "opengraph": {"title": "HAPPENING NOW: The degradation of future generations via contaminated food, tainted water, toxic medicine, deadly vaccines and more", "type": "article", "url": "https://www.pollution.news/2022-05-29-degradation-of-future-generations-via-contaminated-food-water-toxic-medicine.html", "site_name": "Pollution News", "description": "Worse than ever before, the US government and regulatory agencies have sped up the process of degrading human health, the environment and the entire supply chain for fuel, energy and food. It’s not only part of a master plan of depopulation, but one that is intended to sicken the populace so pitifully that they cannot […]", "image": "https://www.pollution.news/wp-content/uploads/sites/379/2022/05/Pesticide-Spray-Agriculture-Farm-Farmer-Fertilizer-Field.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://naturalnews.com/054797_Seralini_Food_and_Chemical_Toxicology_Monsanto_collusion.html", "https://content.sierraclub.org/grassrootsnetwork/team-news/2018/08/pesticide-damage-dna-found-programmed-future-generations", "https://www.brighteon.tv", "https://www.ecowatch.com/generational-harm-of-pesticides-2596453994.html", "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.2006497", "https://www.the-scientist.com/news-opinion/nicotines-effects-passed-on-through-generations-of-mice-64951", "https://www.sciencedaily.com/releases/2018/01/180103132629.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6195640/#:~:text=This%20review%20predominantly%20concentrates%20on,acid%2C%20nitrosamines%20and%20particulate%20matter.", "https://www.cancerresearchuk.org/about-cancer/causes-of-cancer/inherited-cancer-genes-and-increased-cancer-risk/family-history-and-inherited-cancer-genes", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://naturalnews.com/2022-04-14-venomtech-partner-developing-snake-venom-derived-peptides.html", "https://www.naturalnews.com/2022-05-26-covid-vaccines-caused-millions-of-deaths-worldwide.html", "https://www.pesticides.news/2022-05-26-bayer-big-ag-push-biden-roundup-cancer-lawsuit.html", "https://content.sierraclub.org/grassrootsnetwork/team-news/2018/08/pesticide-damage-dna-found-programmed-future-generations", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6195640/#:~:text=This%20review%20predominantly%20concentrates%20on,acid%2C%20nitrosamines%20and%20particulate%20matter.", "https://www.ecowatch.com/generational-harm-of-pesticides-2596453994.html", "https://www.the-scientist.com/news-opinion/nicotines-effects-passed-on-through-generations-of-mice-64951", "https://www.naturalnews.com/2022-05-26-covid-vaccines-caused-millions-of-deaths-worldwide.html", "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.2006497", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fpollutionnews%2F2022-05-29-degradation-of-future-generations-via-contaminated-food-water-toxic-medicine.html&linkname=HAPPENING%20NOW%3A%20The%20degradation%20of%20future%20generations%20via%20contaminated%20food%2C%20tainted%20water%2C%20toxic%20medicine%2C%20deadly%20vaccines%20and%20more", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}