{"result_id": "243049", "URL": "https://prepareforchange.net/2022/10/25/judge-strikes-down-nyc-vaccine-mandate/?utm_source=rss&utm_medium=rss&utm_campaign=judge-strikes-down-nyc-vaccine-mandate", "timestamp": "2023-04-25 16:50:55 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2022/10/25/judge-strikes-down-nyc-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Judge Strikes Down New York City Vaccine Mandate", "cleaned_text": "Attorney Chad LaVeglia, who announced the verdict outside the Richmond County courthouse, said the mandate was now “null and void.”\n\nA New York Supreme Court judge on Monday struck down New York City’s vaccine mandate, finding the rule to be unconstitutional, arbitrary, and capricious.\n\n“So, we just defeated the vaccine mandate for every single city employee—not just sanitation,” LaVeglia said in a video on Twitter account NYCforYourself.\n\nThe ruling strikes down the mandate that saw over 2,000 city workers fired for not getting a COVID-19 vaccine. LaVeglia said the ruling extends to all public workers, including the New York fire department, the police department, and the Department of Corrections.\n\n“For all the brave men and women who have been our first responders and have been brave through all this are now free, and you should be able to go back to work,” he said.\n\nThe judge’s ruling does not specifically apply to all NYC workers, only those who filed the petition.\n\nGeorge Garvey and 15 others who worked at the New York City Department of Sanitation filed the lawsuit on July 20 after they were terminated for failing to comply with the mandate.\n\nJudge Ralph Porzio ruled against the city and found the mandate, which allowed exceptions, to have been an arbitrary and capricious order. He said that Mayor Eric Adams, a Democrat, “made a different decision for similarly situated people based on identical facts” in his Executive Order No. 62.\n\nHowever, there wasn’t anything in the record to “support the rationality of keeping a vaccination mandate for public employees, while vacating the mandate for private sector employees or creating a carveout for certain professions, like athletes, artists, and performers.”\n\n“This is clearly an arbitrary and capricious action because we are dealing with identical unvaccinated people being treated differently by the same administrative agency,” Porzio said in his ruling (pdf).\n\nThe ruling noted that all but one of the 16 petitioners applied for exemptions and received “generalized and vague denials.” They remained unvaccinated during the time their exemptions were being processed. Porzio said there was “no reason” they couldn’t have been allowed to keep working while submitting to COVID-19 testing.\n\n“There was no reason why the City of New York could not continue with a vaccinate or test policy, like the Mayor’s Executive Order that was issued in August 2021,” the judge said in his ruling.\n\nThe judge affirmed vaccinations but said that public employees shouldn’t have been “terminated for their noncompliance” with the mandate, noting that almost 80 percent of New York City is vaccinated.\n\nPorzio’s ruling noted that “certain classes of people” were granted vaccination exemptions, proving the mandate for public workers “to be arbitrary and capricious.”\n\n“It is clear that the Health Commissioner has the authority to issue public health mandates. No one is refuting that authority. However, the Health Commissioner cannot create a new condition of employment for City employees,” Porzio said in his ruling.\n\nNew York City Mayor Eric Adams’ Executive Order No. 62 “renders all of these vaccine mandates arbitrary and capricious.”\n\n“Being vaccinated does not prevent an individual from contracting or transmitting COVID-19. As of the day of this Decision, CDC guidelines regarding quarantine and isolation are the same for vaccinated and unvaccinated individuals.”\n\nIn his ruling, Porzio said city workers shouldn’t be terminated for choosing “not to protect themselves” with a vaccine, noting that “breakthrough cases occur” even for those who are vaccinated and boosted. He also noted that President Joe Biden has declared “the pandemic is over.”\n\nThe judge noted that New York ended its COVID-19 state of emergency “over a month ago.” He also noted that the first responders named in the lawsuit continued to work without protective gear, and had “created natural immunity” after catching COVID-19.\n\n“They were terminated and are willing to come back to work for the City that cast them aside. The vaccination mandate for City employees was not just about safety and public health; it was about compliance. If it was about safety and public health, unvaccinated workers would have been placed on leave the moment the order was issued.\n\n“If it was about safety and public health, the Health Commissioner would have issued city-wide mandates for vaccination for all residents. In a City with a nearly 80 percent vaccination rate, we shouldn’t be penalizing the people who showed up to work, at great risk to themselves and their families, while we were locked down.\n\n“If it was about safety and public health, no one would be exempt. It is time for the City of New York to do what is right and what is just,” Porzio said in his ruling.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Judge Strikes Down New York City Vaccine Mandate - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2022/10/25/judge-strikes-down-nyc-vaccine-mandate/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2022-10-26T03:48:12+00:00", "article:modified_time": "2022-10-26T07:39:40+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2022/10/GettyImages-1238382541-700x420-1.jpeg", "image:width": "700", "image:height": "420", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/t-nyc?utm_medium=email&utm_source=newsnoe&utm_campaign=breaking-2022-10-25-1", "https://www.theepochtimes.com/t-vaccine-mandate?utm_medium=email&utm_source=newsnoe&utm_campaign=breaking-2022-10-25-1", "https://twitter.com/nycforyourself/status/1584645455459209216?s=20&t=JIgKbXoehjUksYLZTuShTw", "https://www.theepochtimes.com/t-covid-19?utm_medium=email&utm_source=newsnoe&utm_campaign=breaking-2022-10-25-1", "https://iapps.courts.state.ny.us/fbem/DocumentDisplayServlet?documentId=JK5E3gx5XV1/ku37jnWR_PLUS_w==&system=prod", "https://img.theepochtimes.com/assets/uploads/2022/09/06/GettyImages-1346229010-1200x750.jpg", "https://www.theepochtimes.com/judge-strikes-down-nyc-vaccine-mandate-for-all-city-workers_4818407.html?utm_source=newsnoe&src_src=newsnoe&utm_campaign=breaking-2022-10-25-1&src_cmp=breaking-2022-10-25-1&utm_medium=email&est=d724pcDzA%2BgK64rstJyeYnYVhkmGOiQUFn7Eq4hEvYKlcBc3fw2Oaf0LYkwVF3ecuqBnYbqN", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2022-10-26T03:48:12+00:00"}