{"result_id": "243007", "URL": "https://prepareforchange.net/2022/03/06/new-zealand-high-court-ends-jacinda-arderns-vaccine-mandate-its-a-gross-violation-of-human-rights/", "timestamp": "2023-04-25 16:49:55 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2022/03/06/new-zealand-high-court-ends-jacinda-arderns-vaccine-mandate-its-a-gross-violation-of-human-rights/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "New Zealand High Court ENDS Jacinda Ardern’s Vaccine Mandate: “It’s a Gross Violation of Human Rights”", "cleaned_text": "New Zealand Prime Minister Jacinda Ardern was left reeling on Friday after a High Court ruled that her vaccine mandate represented a “gross violation of human rights” for New Zealanders.\n\nThe landmark case means that the police and NZDF cannot be fired for refusing to take the experimental vaccine. This case will be used to overthrow all of Ardern’s illegal mandates in New Zealand.\n\nJustice Francis Cooke ruled that ordering frontline police officers and Defence staff to be vaccinated or face losing their job was not a “reasonably justified” breach of the Bill of Rights.\n\nNzherald.co.nz reports: The lawyer for the police and Defence staff at the centre of the claim is now calling for the suspended workers to return to their jobs immediately, saying many have given decades of service to their community and are still committed to their jobs.\n\nThe challenge, put forward by a group of Defence force and police employees, questioned the legality of making an order under the Covid-19 Public Health Response Act to require vaccination for frontline employees.\n\nThe challenge was supported by a group of 37 employees affected by the mandate, who submitted written affidavits to the court.\n\nMinister of Workplace Relations and Safety Michael Wood, Deputy Police Commissioner Tania Kura and NZDF Chief People Officer Brigadier Matthew Weston filed affidavits defending the mandate.\n\nAs it stands, 164 of the overall police workforce of nearly 15,700 were affected by the mandate after choosing not to be vaccinated. For NZDF, the mandate affected 115 of its 15,500 staff.\n\nThe group relied on two aspects of the Bill of Rights – the right to decline a medical procedure and the right to religious freedom.\n\nOn the religious freedom argument, a number of those who made submissions referred to their fundamental objection to taking the Pfizer vaccine, given that it was tested on the cells that were derived from a human foetus.\n\nJustice Cooke agreed with the claim, saying that “an obligation to receive the vaccine which a person objects to because it has been tested on cells derived from a human foetus, potentially an aborted foetus, does involve a limitation on the manifestation of a religious belief.”\n\nHowever, Justice Cooke disagreed with the claimants’ broader claims that requiring vaccination is inconsistent with holding religious beliefs more generally.\n\n“I do not accept that a belief in an individual’s bodily integrity and personal autonomy is a religious belief or practice. Rather it seems to me, in the circumstances of this case, to be a belief in the secular concept referred to in section 11 of the New Zealand Bill of Rights Act.”\n\nJustice Cooke also agreed with the claim that the mandate impinged on the right to decline a medical procedure.\n\nThe judge said that while it’s clear the government isn’t forcing Police and NZDF employees to get vaccinated against their will and they still have the right to refuse vaccination, the mandate presents an element of pressure.\n\n“The associated pressure to surrender employment involves a limit on the right to retain that employment, which the above principles suggest can be thought of as an important right or interest recognised not only in domestic law, but in the international instruments,” Justice Cooke stated.\n\nBut in considering the two claims, Justice Cooke also considered whether or not the mandate fell within the definitions laid out in the Covid-19 Public Health Response Act.\n\nThe court accepted that vaccination has a significant beneficial effect in limiting serious illness, hospitalisation, and death, including with the Omicron variant. However, it was less effective in reducing infection and transmission of Omicron than had been the case with other variants of Covid-19.\n\n“In essence, the order mandating vaccinations for police and NZDF staff was imposed to ensure the continuity of the public services, and to promote public confidence in those services, rather than to stop the spread of Covid-19. Indeed health advice provided to the government was that further mandates were not required to restrict the spread of Covid-19. I am not satisfied that continuity of these services is materially advanced by the order,” the Judge said.\n\n“Covid-19 clearly involves a threat to the continuity of police and NZDF services. That is because the Omicron variant in particular is so transmissible. But that threat exists for both vaccinated and unvaccinated staff. I am not satisfied that the order makes a material difference, including because of the expert evidence before the court on the effects of vaccination on Covid-19 including the Delta and Omicron variants.”\n\nAn additional claim that the mandate would disproportionately affect Māori was dismissed by Justice Cooke.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "New Zealand High Court ENDS Jacinda Ardern’s Vaccine Mandate: “It’s a Gross Violation of Human Rights” - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2022/03/06/new-zealand-high-court-ends-jacinda-arderns-vaccine-mandate-its-a-gross-violation-of-human-rights/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2022-03-06T13:34:36+00:00", "article:modified_time": "2022-03-05T14:37:43+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2022/03/Screen-Shot-2022-03-05-at-8.26.12-AM.png", "image:width": "1359", "image:height": "765", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nzherald.co.nz/nz/not-demonstrably-justified-high-court-upholds-challenge-to-police-and-nzdf-vaccination-mandates-terminations-suspended/LMAUM7LZWV6FFQWAKKJFLKYLIE/", "https://prepareforchange.net/donations"], "authors": ["Derek Knauss"], "publish_date": "2022-03-06T13:34:36+00:00"}