{"result_id": "243015", "URL": "https://prepareforchange.net/2022/01/09/official-government-data-from-germany-suggests-covid-fully-vaccinated-people-will-develop-aids/", "timestamp": "2023-04-25 16:50:07 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2022/01/09/official-government-data-from-germany-suggests-covid-fully-vaccinated-people-will-develop-aids/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Official government data from Germany suggests covid fully vaccinated people will develop AIDS", "cleaned_text": "By the end of the month, most people who are “fully vaccinated” will have developed full-blown Wuhan coronavirus (Covid-19) injection-induced acquired immunodeficiency syndrome (AIDS), new government data suggests.\n\nGerman government researchers found that the immune systems of the fully vaccinated have already degraded to an average of -87 percent, depending on when they got jabbed. That degradation will only continue until their immune systems are completely gone. (Related: Fauci Flu shots are also spreading prion disease.)\n\nThe Robert Koch Institute (RKI) put out the data, which shows that the fully vaccinated now have, on average, an 87.7 percent lower immune response to the new Omicron (Moronic) variant than the unvaccinated.\n\n“This means that the average German is down to the last 12.3 percent of his or her immune system for fighting certain classes of viruses and certain cancers,” reports the Daily Exposé.\n\nInterestingly, RKI did not produce the normal vaccine effectiveness tables in its December 30 weekly report.\n\n“This may have been due to the holidays (the British gave up completely on December 23) or may have been because the table would be disastrous for the vaccines,” the Exposé added.\n\n“But we can help the Germans out here by doing the calculation for them using Pfizer’s vaccine effectiveness formula: Vaccine effectiveness = immune system effectiveness = (1-8.12)/8.12 = -7.12/8.12 = -87.7%.”\n\nFully vaccinated immune systems are doing WORSE than the predictive models estimated\n\nBack in October, it was projected that this type of thing would occur. Scientists looked at data from the UKHSA Vaccine Surveillance Report, concluding that immune system degradation would become progressively worse in the fully vaccinated.\n\nThose figures were mocked by some for being too “doomsday.” It turns out, however, that they were actually underestimates.\n\nThe fully vaccinated are doing worse in terms of immune strength than even the most “pessimistic” data modelers anticipated.\n\n“So Germany, at 87.7% immune system degradation, has done 6.7% worse than our model which predicted, an 81.0% degradation this year (for over 18s based on 2 doses of the anti-vaccine rather than 3),” the Exposé reported.\n\n“It is the 3rd dose that really kills the immune system as can be seen from the ONS data for Omicron … These figures mean that if you have Covid and you have had 3 doses of the vaccine then you are 4.45x more likely to have Omicron than if you are an unvaxxed Covid case. But the above was merely an estimation.”\n\nBased on the latest data out of Germany, we now know that the fully vaccinated are 812 percent more likely to develop a Moronic infection than the unvaccinated. The unvaccinated are basically eight times better protected from Moronic than people who took the jabs.\n\n“And the more jabs you take the faster the degradation of your immune system progresses,” the Exposé added. “It also looks like the unvaxxed are reaching sub herd immunity against Covid-19 whereas the fully vaxxed are being prevented from reaching it by the vaccines.”\n\n“The German figures have destroyed the case for vaccine passports and by themselves prove instead the case for an immediate gene therapy and spike protein vaccination ban.”\n\nIt turns out that we were right, too. So-called “vaccine immunity” is really just fake immunity. It is flawed, at best. At worst, it destroys the immune system, leaving it unable to naturally fend off infections of any kind.\n\n“By the end of January every fully vaccinated person in both countries over 30 years old will have full blown vaccine mediated AIDS,” the Exposé concluded. “However much of the immune system that is presently left with the ability to fight Omicron will have gone.”\n\nThe latest news about Chinese Virus injections can be found at ChemicalViolence.com.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Official government data from Germany suggests covid fully vaccinated people will develop AIDS - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2022/01/09/official-government-data-from-germany-suggests-covid-fully-vaccinated-people-will-develop-aids/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2022-01-10T04:13:30+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2022/01/Vaccine-Vial-Bottles-Covid-19.jpeg", "image:width": "1000", "image:height": "563", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://dailyexpose.uk/2022/01/02/german-gov-data-suggests-fully-vaccinated-developing-ade/", "https://naturalnews.com/2021-11-29-proof-covid-vaccines-cause-prion-disease.html", "http://chemicalviolence.com/", "https://dailyexpose.uk/2022/01/02/german-gov-data-suggests-fully-vaccinated-developing-ade/", "https://naturalnews.com/2021-11-29-proof-covid-vaccines-cause-prion-disease.html", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2022-01-10T04:13:30+00:00"}