{"result_id": "243003", "URL": "https://prepareforchange.net/2023/04/01/covid-vaccination-knocks-up-to-2-5-decades-off-a-mans-life-according-to-cdc/", "timestamp": "2023-04-25 16:49:46 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2023/04/01/covid-vaccination-knocks-up-to-2-5-decades-off-a-mans-life-according-to-cdc/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Covid Vaccination knocks up to 2.5 Decades off a Man’s life according to CDC", "cleaned_text": "The long-term consequences of Covid-19 vaccination are now being realised…\n\nA year ago, doubly vaccinated Australians were 10.72x more likely to catch Omicron than the unvaxxed. Now they are 20x more likely and the triply or more vaxxed are 35x more likely, as the latest NSW Health stats show (see below).\n\nMeanwhile, the latest Cleveland Clinic Data and the latest US data analysed by Josh Stirling, founder of Insurance Collaboration to Save Livess and former #1 ranked Insurance Analyst, shows a really really disturbing trend.\n\nThe damage to health caused by each vaccine dose does not lessen over time. It continues indefinitely.\n\nIn fact, CDC All-Cause Mortality data show that each vaccine dose increased mortality by 7% in the year 2022 compared to the mortality in year 2021.\n\nSo if you have had 5 doses then you were 35% more likely to die in 2022 than you were in 2021. If you have had one dose then you were 7% more likely to die in 2022 than you were in 2021. If you are unvaxxed then you were no more likely to die in 2022 than you were in 2021.\n\nHere are the Covid infection rates for the 1st 98 days from 2022 September 12, when the bivalent vaccine was first offered to Cleveland Clinic employees. It was not mandated. It was offered.\n\nSo on 2022 September 12, 6199 employees were unvaxxed, 2359 were single jabbed, 13804 were double jabbed, 20798 were triple jabbed and 3538 were quad jabbed or penta jabbed with the original vaccine, which was designed against the Wuhan Hu1 reference virus, which was NOT isolated from a Human but was generated on a computer.\n\nThe results of their study, shown graphically above, demonstrate that the more doses of the original vaccine you took, the more likely you were to catch covid. In other words the original Covid vaccine is not merely ineffective against Omicron. It is actually anti-effective.\n\nIt is therefore not a vaccine against the present strain of Covid. It is an antivaccine. It damages your immune system in a dose-dependent manner. The more shots you took, the more damage you will have done to your immune system.\n\nThe writer first saw this from PHE Vaccine Surveillance reports and published his findings to PHE themselves AND on my website and in The Expose, on 2021 October 10.\n\n‘The Science’ has now been established by the Cleveland Clinic. Genetic vaccines damage your immune system and make you not less likely but more likely to be infected with Covid.\n\nNot only that but they have horrendous side effects on the cardiovascular, neurological and reproductive systems as well.\n\nThey are nothing short of mandatory progressive euthanasia.\n\nCDC All-Cause Mortality Data shows that every year, every vaccinated person becomes more and more likely to die at a rate of 7% PER JAB PER YEAR. That is a slow-acting genetic poison.\n\nIf people were recovering from the 1st jab, then it would not be having precisely the same effect as the 5th jab (namely a 7% increase in mortality). This is the long term problem. People are not recovering from the damage done by the shots in terms of excess mortality.\n\nSo taking 2021 as the base line, a 5 dosed person would be 350% more likely to die in 2031 and 700% more likely to die in 2041 and 1050% more likely to die in 2051 than an unvaxxed person. It is just like compound interest.\n\nUsing this result, we can calculate the loss in life expectancy for a 30 year old male as follows… The life expectancy of a 30 year old unvaxxed male in the UK is around 80 years. So he can expect another 50 years of life.\n\nIn statistical terms, half of his cohort are dead by 80. The life expectancy of a 30 year old quintuply vaxxed person in the UK is 56 years. Assuming UK males respond to the vaccines in the same way as US people. Alternatively quintuply vaxxed US 30 year old males have likewise lost 24 years of life expectancy.\n\nUK life expectancy data is from Statista. In the table below we add the extra 7% mortality per jab per year to the 2020 UK levels shown in Column2. So in a 5 year period, the average increase in expected mortality would be –\n\n1 jab robs 30 year old men of 13 years\n\n 2 jabs robs 30 year old men of 18 years\n\n 3 jabs robs 30 year old men of 20 years\n\n 4 jabs robs 30 year old men of 23 years\n\n 5 jabs robs 30 year old men of 24 years\n\nThat is the price you pay for trusting the NHS, trusting the government and trusting the BBC and the Main Stream Media.\n\nThat is what Media like the Expose have been trying to prevent.\n\nThe population of New South Wales in Australia was 6,505,883 in 2022. the vaccination status is as follows…\n\nNSW Australia data for Hospital and ICU Admissions during the last 6 weeks of 2022 show dose-dependent immune system destruction\n\nThere is the proof of immune system destruction by vaccination mediated spike proteins. We see the same pattern for Hospital admissions in Australia as we see for infection rates in Cleveland. The more shots you take the weaker your immune system becomes. And that is for the target of the therapy! The above graphs do NOT address any of the side effects.\n\nThe population of NSW in Australia is 6½ million people. They are a highly vaccinated group. Looking at the Australian Government data for the last 6 weeks of 2022 we see that.\n\n1. Those with 1 or 2 doses are 20x more likely to be admitted to hospital with Covid than those with no doses.\n\n 2. Those with 3 or 4 or more doses are 35x more likely to be admitted to hospital with Covid that those with no doses.\n\n 3. Being unvaxxed provides 100% protection from having to go to the ICU. Being vaxxed gives you a 6 in 100,000 chance of being hospitalised in the ICU.\n\n 4. Vaccines are unsafe and extremely antieffective.\n\n 5. Covid Vaccination is putting unsustainable pressure on hospitals and ICUs in NSW and by implication all over the world.\n\n 6. The NHS in the UK will be destroyed unless vaccinations are banned immediately. It may already be too late.\n\n 7. The vaccines prevent herd immunity. Herd immunity will never be reached in the vaxxed. It has already been reached in the unvaxxed\n\n 8. The continuation of the pandemic is entirely caused by the anti vaccines.\n\nThe last time I looked at the data in NSW, for the last 6 weeks of 2021, the double vaxxed were 2.18x more likely to catch Omicron than the unvaxxed.\n\nHere were are today, 12 months later in the last 6 weeks of 2022, and the double vaxxed are not 2.18x, but actually 20x more likely to catch the latest variant. And the triple jabbed are 35x more likely!\n\nSo there is the immune system destruction that I predicted in October2021. There is the progressive vaccine mediated AIDS. These are farcical Monty Python kinds of numbers. As I understand it the Australian government is now going to stop classifying hospital data by vax status.\n\nTalk about bury your head in the sand. In any event. It is too late. The cat is out of the bag. These figures are an accelerating immunological catastrophe.\n\nThe data we have analysed are for the disease that the vaccines are supposed to be protecting us from (Covid-19). They do not address the plethora of cardiovascular, neurological, immunological, reproductive and systemic side effects of the genetic anti vaccinations which cause further hospital admissions.\n\nWe have given control of our Health Services big pharma and they have destroyed those services. The day will come, if it has not already, when 50% of the patients in our hospitals are suffering from vaccine-mediated pathology.\n\nThe question then becomes, how many others in addition to the vaccine damaged are suffering from Big Pharma-mediated pathologies resulting from other Big Pharma ‘medications’?\n\nThe credibility and the viability of all health care worldwide is therefore entirely dependent upon the immediate cessation of genetic vaccination.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccination knocks up to 2.5 Decades off a Man’s life according to CDC - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2023/04/01/covid-vaccination-knocks-up-to-2-5-decades-off-a-mans-life-according-to-cdc/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2023-04-01T23:18:11+00:00", "article:modified_time": "2023-04-01T23:22:29+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2023/04/GettyImages-1298520881.jpeg", "image:width": "718", "image:height": "475", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/03/26/pfizergate-worldwide-conspiracy-hide-covid-vaccines-cause-a-i-d-s/", "https://www.theepochtimes.com/josh-stirling-dissecting-excess-death-data-and-how-insurance-industrys-trillions-could-be-deployed-to-help-the-vaccine-injured_5006731.html", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-67.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-68.png?ssl=1", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1.full.pdf", "http://www.truebiblecode.com/", "https://expose-news.com/2021/10/10/comparison-reports-proves-vaccinated-developing-ade/", "https://www.statista.com/statistics/1125118/death-rate-united-kingdom-uk-by-age/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-60.png?ssl=1", "https://www.health.gov.au/our-work/covid-19-vaccines/vaccination-numbers-and-statistics", "https://www.health.nsw.gov.au/Infectious/covid-19/Pages/weekly-reports.aspx", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/weekly-covid-overview-20221231.pdf", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/weekly-covid-overview-20221217.pdf", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/weekly-covid-overview-20221210.pdf", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/weekly-covid-overview-20221203.pdf", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/weekly-covid-overview-20221126.pdf", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/weekly-covid-overview-20221119.pdf", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-63.png?ssl=1", "https://expose-news.com/2022/01/28/vaids-negative-vaccine-effectiveness-equals-damaged-immune-system/", "https://expose-news.com/2023/04/01/covid-vaccination-knocks-25years-off-mans-life-cdc/", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2023-04-01T23:18:11+00:00"}