{"result_id": "243036", "URL": "https://prepareforchange.net/2021/10/03/10-ways-to-detox-from-pharmakeia-deactivate-nanotechnology-and-heal-your-dna/", "timestamp": "2023-04-25 16:50:37 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2021/10/03/10-ways-to-detox-from-pharmakeia-deactivate-nanotechnology-and-heal-your-dna/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "10 Ways to Detox from Pharmakeia, Deactivate Nanotechnology and Heal Your DNA", "cleaned_text": "10 ways to detox from vaccines, deactivate nanotechnology and heal your DNA\n\nThere is much controversy globally around vaccines at present, with strong-arm tactics being employed to coerce people into taking the COVID vaccines – with (or increasingly without) their consent.\n\nGovernments, pharmaceutical companies, mainstream and social media laud the supposed health benefits, and suppress anything to the contrarian truth of vaccines. In reality it is the same people who are orchestrating both the mainstream media and pharmaceutical industry, and attempts to call them out are ruthlessly suppressed.\n\nThe purpose of this article is not to go into the possible motivations for the push to globally vaccinate mankind, but rather to provide some background on how damaging vaccines are from a spiritual perspective – and more importantly, what to do about this and negate and even reverse their negative effects.\n\nThere is a parallel – and more evil – story behind the use of vaccines and the cocktail of harmful ingredients they contain. Let’s begin this with an insightful quote ahead of its time, from a man ahead of his time – Rudolf Steiner (1861-1925):\n\n“In the future, we will eliminate the soul with medicine. Under the pretext of a ‘healthy point of view’, there will be a vaccine by which the human body will be treated as soon as possible directly at birth, so that the human being cannot develop the thought of the existence of soul and Spirit.\n\nTo materialistic doctors, will be entrusted the task of removing the soul of humanity. As today, people are vaccinated against this disease or that disease, so in the future, children will be vaccinated with a substance that can be produced precisely in such a way that people, thanks to this vaccine, will be immune to being subjected to the “madness” of spiritual life. He would be extremely smart, but he would not develop a conscience, and that is the true goal of some materialistic circles.\n\nWith such a vaccine, you can easily make the etheric body loose in the physical body. Once the etheric body is detached, the relationship between the universe and the etheric body would become extremely unstable, and man would become an automaton, for the physical body of man must be polished on this Earth by spiritual will. So, the vaccine becomes a kind of arymanique force; man can no longer get rid of a given materialistic feeling. He becomes materialistic of constitution and can no longer rise to the spiritual.”\n\nLet’s compare Rudolf Steiner’s vision with that of a French energetic healer who shared her experience in treating a recipient of the COVID vaccines:\n\n“I held a session with a person who had received the first and second dose of the vac. I had already treated this person energetically, but I did not know that she had taken the vac. When I started the treatment, I immediately noticed the change, very heavy energy coming from their subtle bodies. The scariest thing was when I worked on the heart chakra, I connected with her soul, so she was detached from the physical body, she had no contact and it was as if she was floating in a state of total confusion. Damage of the consciousness that loses contact with the physical part, so with our biological machine, there is no more communication between them.\n\nDuring the treatment, this soul told me that it no longer felt the body and had the impression of floating in a deep malaise. The energy I was working with, the energy of their energy field, was very heavy and you could feel these substances that are very stressful for the subtle bodies.\n\nI continued the treatment by sending light to the heart chakra, the soul of the person, but it seemed that the soul could not receive any more light, frequency or energy. It was a very powerful experience for me.\n\nThen I understood that this substance is in fact used to detach the consciousness, so that this consciousness can no longer interact through this body that it has in life, where there is no more contact, no more frequency, no more light, no more energetic balance or spirit. Then I started to cry for that soul because it was something that touched me deeply, a very powerful experience. I didn’t say anything to the person because I didn’t know how to say it and if they would have understood.\n\nI realized that it is not only polluting the subtle bodies or the physical body, but it is something to do with our soul. The purpose is to damage and try to destroy the contact with consciousness. What Steiner said is exactly that. It is not just about damaging the immune system.”\n\nUpdate: second treatment of the person:\n\nThere has been another change and again a deterioration, both in the severity and in the energy that their energy field transmits, but most importantly there has been a very significant decrease in frequency. At the moment he is not showing any physical symptoms on the physical body. As for the situation manifesting on the energetic level and especially the soul, it has been confirmed that the soul has been expelled from the physical body, it is still bound by the so-called cord, but it confirms that it no longer interacts with the physical, emotional and mental body, there is no longer any kind of communication. The soul is no longer able to manage these three bodies, to continue its process of incarnation and evolution, precisely because this contact has been broken.”\n\nThe global vaccination program is one of the most advanced spiritual warfare programs against humanity. From a more scientific perspective, governments and those pulling the strings behind the scenes are using vaccines to target individuals and populations who express the God gene (also known as vesicular monoamine transporter 2 (VMAT2)) – and there is a malevolent scientific intent behind this goal. This gene, as detailed by geneticist Dean Hamer in his book The God Gene: How Faith is Hardwired into our Genes, predisposes humans towards spiritual or mystic experiences. An eloquent spiritual explanation of this can be found in this short podcast, which details how mRNA vaccines in particular are designed to subvert the divine genetic code within mankind.\n\nWhile the government argues it is interested in neutralizing terrorists who act on their religious fanaticism, one of the more important goals of those behind the global vaccination program is to stop the spiritual evolution of mankind through stunting the expression of the God gene. This video featuring Bill Gates is a good example of this agenda in practice.\n\nAnother way vaccines and PCR tests are being used to suppress the spiritual potential of mankind is through targeting the pineal and pituitary glands. In addition to production and regulation of critical hormones within the body, these glands (particularly the pineal gland) serve an important role in the unfoldment and expression of spiritual senses. It has been found that DARPA hydrogel and lithium (highly toxic to the pineal gland) as well as graphene oxide contained in PCR test swabs (and also in covid-19 vaccines and others) remain on the nasal mucosa below the pituitary and pineal glands, and this mixture immediately reacts with living structures to form crystals that target the pineal gland, which has been found to have its own electromagnetic field. Aluminum and mercury – widely found in all vaccines – are also highly toxic to the pineal gland, and all of this has a directly destructive impact on mankind’s ability to realize their spiritual potential.\n\nThere are numerous stories from around the world, particularly in cultures that have strong spiritual roots, where vaccines essentially cause “spiritual euthanasia”. Children, for example, lose their second sight and are no longer able to see other dimensions and spiritual phenomena. A classic example of this can be found in this interview between David Icke and one of Africa’s last shamans and traditional healers, Credo Mutwa, in which he explains (skip to 3.20.30) how white men came to his village and forcibly vaccinated everyone. Everyone (especially the children) lost their spiritual sight and ability to perceive spiritual entities and other interdimensional phenomena, but his family helped him avoid the vaccines and he, fortunately, retained his spiritual senses.\n\nHere are 10 ways to detox from vaccines (including the COVID vaccines) and deactivate vaccine nanotechnology. This is a very holistic and spiritual approach to counteracting the negative effects of vaccines (especially COVID vaccines), and the importance of step 10 should not be discounted.\n\nA recent study found nanoparticles in at least 43 market-leading vaccines, so the problem of nanites is not just restricted to COVID vaccines. Scientists from around the world are actively advancing this agenda.\n\nBoron is an indispensable supplement for detoxing heavy metals and one of the few known nanobot replication inhibitors. Boron is a mineral that is essential for all life in plants as well as animals, but unfortunately it has been intentionally depleted in our foods through the use of chemical fertilizers which inhibit the uptake of boron from the soil. This creates health problems due to boron deficiency which is now very common, but very few of us know about it.\n\nBorax (sodium tetraborate hexahydrate or sodium borate) is a naturally occurring mineral composed of sodium, boron, oxygen and water, and has been used as a remedy for over 4000 years as a remedy for a variety of ailments.\n\nOne of the options on the market is liquid ionic boron and there are also many good boron supplements available. Natural borax such as 20 Mule Team is also very effective (and cheap). Borax is meant to be taken in small amounts (the FDA maximum dosage is 1/8 teaspoon per 100 pounds of body weight) so take a small pinch of this in the water every morning, with maybe 3-6 glasses per day for an internal nano detox. This will also help raise your pH which is important for overall health.\n\nFor an external nano detox bath, add one cup of baking soda, one cup of Epsom salts, one cup of pure borax, and one cup of Himalayan sea salt or Redman’s salt (never use table salt), and soak in hot water as long as you can. If you want to take this to the next level, there are also nano baths that use the power of electricity (in a safe way) to assist with the extraction of nanotechnology within the body. For a more intensive experience combining this step with the above, try Tony Pantallesco’s electric nano bucket.\n\nBoron and borax are also very useful in combatting the nanotechnology parasites in Morgellons (for more information listen to this Dana Ashlee video and skip to 23.30, or view this interview with Dr Carrie Madej on the Carnicom Institute website). Nano Morgellons fibers are also widely found in disposable facemasks as well as the COVID swabs (which, in reality, are self-replicating AI conductive graphene nanofibers, which are critical for the dual purpose of a surreptitious DNA harvesting and collection program) and there are many potential solutions to Morgellons here and here.\n\nZeolite is a natural volcanic mineral that has the unique ability to attract, absorb and neutralise heavy metals such as lead, mercury, arsenic, aluminum (thimerosal), cadmium and other pollutants (including radioactive material) – all of which cause a range of detrimental side effects. Zeolite is a biological chelator that binds harmful substances while in the gastrointestinal tract to draw them out of the body via the bowel\n\nZeolite (also known as clinoptilolite) holds a negative electromagnetic charge which attracts toxins throughout the whole body, so it never removes beneficial minerals. It is more effective than activated charcoal and can be taken internally and externally.\n\nMake sure the zeolite is purified and micronized food-grade, like this zeolite in the US or this one in Australia – though there are many good suppliers around the world. Simply mix with good spring water, rainwater or reverse osmosis filtered water. Start off slowly (maybe a quarter to a half teaspoon) and see how your body responds. Dr Sherri Tenpenny, a leading expert on the harm caused by vaccines, recommends hydrated zeolite. There are also many good nano-sized cellular zeolite products on the market.\n\nIf you have not detoxed before it is likely you might feel light-headed as the zeolite works to remove heavy metals and other nanoparticles. The normal protocol is to detox more heavily for a short initial period and then keep up small maintenance doses.\n\nMMS is a water purification antimicrobial compound that was discovered by a man named Jim Humble in 1996. He found MMS was very effective in eradicating malaria, and Humble went on to develop a formula using this substance mixed with a food-grade acid. This substance, also known as chlorine dioxide solution (CDS or ClO2) works by oxidizing pathogens and takes broad-spectrum action against bacteria, viruses, and protozoans. The recipe has been refined over the years and there are a number of products on the market now, so it is worth researching the safest and most effective formulae. MMS also works very well in conjunction with Dimethyl Sulfoxide (DMSO) as a detoxifying agent.\n\nVaccines (especially the covid-19 vaccine) contain a cocktail of viruses and other pathogens, and MMS can work wonders in killing off these foreign bodies. Analyses of COVID vaccines, for example, have found what looks like toxoplasma gondii in them. This interesting analysis looks at how this parasite can potentially change behavior in people (read mind control) who have been vaccinated.\n\nThe good news is that MMS is the perfect antidote for this kind of parasitical organism. MMS also works very well against SARS-CoV-2 and there are many testimonies from doctors with regards to its efficacy in treating and curing patients and reducing the harmful side effects of immunizations.\n\nMMS has been around a long time but has been heavily suppressed as it is a cheap and effective cure (not band-aid) for many ailments. The media and others usually claim chlorine dioxide is dangerous because it is bleach, which is factually incorrect (bleach is sodium hypochlorite). By coincidence, the FDA ordered US Marshals to illegally raid a church in Florida that manufactures and sells large MMS – an agent which effectively kills both SARS-CoV-2 and the pathogens in the COVID vaccines – early on in the “pandemic”.\n\nSuramin is an isolated compound originally derived from an extract of pine needle oil. It was found to be highly effective in killing parasites and viruses of several kinds, and also has a beneficial impact on a large number of other conditions. It was subsequently produced as a drug and used by WHO to treat African sleeping sickness and river blindness.\n\nThis video featuring Dr. Judy Mikovits (of Plandemic fame) explains in this video how suramin is an antidote to the pathogenic ingredients in mRNA vaccines (maybe one of the real reasons why the FDA has also made it illegal to use suramin for therapeutic purposes (such as treating vaccine-induced autism) in the United States). For more information on this, she explains to Dr Joseph Mercola how the COVID “pandemic” has been engineered and discusses potential solutions. Suramin is still produced as the drug germanin, and some of the most potent natural sources of suramin include pinon pine hydrosol as well as Siberian cedar nut oil enriched with resin.\n\nMike Adams explains how to produce pine needle tea (which contains suramin) in this helpful video and also details how pine needle tea contains other important ingredients such as shikimic acid which can also boost the immune system (which will produce natural antibodies) and act against SARS-CoV-2. Some kinds of pine needles are toxic so do your homework before taking any.\n\nOther foods high in shikimic acid include fennel, star anise tea, wheatgrass and wheatgrass juice, while superfoods include schizanfra berry, St John’s wort, comfrey leaf, feverfew, gingko biloba leaf, giant hyssop or horsemint – many of which are good antioxidants.\n\nThe niatonin protocol is fast gaining popularity as a method for detoxing, particularly from COVID vaccines. Developed by Dmitry Kats, who is an epidemiologist and PhD, a combination of flush niacin (nicotinic acid preferably in powder form) with melatonin (no extended release preferably in powder form) has been found to effective at detoxing heavy metals and other harmful ingredients contained in vaccines.\n\nThere are many other benefits to using this protocol, including reducing inflammation, cholesterol, aches and pains, increasing blood oxygen levels and energy, and rejuvenation of lung tissue and vessels.\n\nHis protocol specifically for detoxing from vaccines is flush niacin (up to 750-2000 mg for an adult, 2-3 times per day) combined with up to 15-40mg of melatonin for an adult ) 2-3 times per day). There are different dosages for different age groups, as well as different protocols for different conditions such as “long” COVID recovery.\n\nOne of the most effective weapons against the harmful inorganic nanoparticles contained within vaccines is direct application of mild electric currents to the body. Research has found the right kind and amount of electricity can facilitate remarkable healings.\n\nOnly after a good month or two of detoxing with the above protocols should you consider using electricity, otherwise this could create a cascade of detox sickness that may even lead to toxic epidermal necrolysis. This is a rare, potentially life-threatening skin reaction which is a severe form of “Stevens-Johnson syndrome”.\n\nOne of the best devices for this is the Tesla violet ray which was invented by the famous scientist Nikola Tesla. Most of his creations and patents were suppressed or confiscated by the government following his death and the manufacture of violet rays was prohibited in the US following the Rockefeller-led crackdown on natural medicines and healthcare. Fortunately, the violet ray is one of the few Tesla inventions that managed to survive the crackdown and is publicly available worldwide.\n\nThe violet ray works by passing a mild, healing electrical charge to the site of application as well as through the whole body. This makes it particularly effective against nanotechnology, because it is essentially makes the nanobots inert, so they are then able to be flushed out more easily with the likes of boron, zeolite, NAC and MMS.\n\nDrink good spring water, rainwater or reverse osmosis filtered water before and after to assist with conductivity and remove all jewelry and other metal from the body, so the electricity will be attracted to inorganic elements (such as nanites) in the body. Apply to the body (especially site of vaccines, and other good areas include C7 vertebrae, forehead, around and behind the ears, vagus artery/nerve, EFT tapping points and along the spine). Anywhere you intuitively feel right on the body is fine. Apply for 10-15 minutes per session, three times a day. Doing so will also have more general and significant health benefits for your body.\n\nThere are many other electrotherapy devices that will work well, including the Hulda Clark and Don & Carol Croft zappers as well as the Nano Killer. Jared Rand suggests the nexus orgone zapper, which works on a frequency of 432 Hz (a frequency that seems to counteract nanotechnology parasites such as Morgellons – good to know if you have a Rife machine or therapeutic frequency generator of some kind). Apply two zappers – one to the inside of each wrist – three times a day for 15 minutes at a time for three weeks. As with the violet ray, drink good spring, rain or reverse osmosis filtered water before and after to assist with hydration and conductivity.\n\nThere are also electromagnetic technologies (such as the Ampcoil and Telsa Biohealing devices) on the market. The benefits of such devices are many and extend well beyond their ability to negate the effects of harmful nanotechnology and other parasites.\n\nHowever, direct application of electricity to the body is generally more effective in neutralizing nanites. Even crude forms of electrotherapy are effective. For example, there are stories of farmers who accidentally touched electric fences and the strong electric pulse healed them of viruses with similar symptoms to Lyme disease. Much like the electromagnetic pulse (EMP) that knocks out the AI-controlled sentinel robots in the Matrix movie (truth is sometimes stranger than fiction) the right kind of electrotherapy and electromagnetic energy work wonders on magnetic nanotechnology, magnogenetics and other inorganic and organic parasites within the body.\n\nFood plays a very significant role in the process of detoxifying from vaccines and the harmful ingredients contained therein. There are many foods that can assist with this, but generally, it is preferable to follow a whole-food, plant-based diet – which can also assist with weight loss. The macrobiotic diet is one of the best detox diets in the world, and those who rigorously follow the way of macrobiotics tend to live very healthy, long lives.\n\nWhen it comes to a holistic vaccine detox, one of the best recipes is from Medical Medium with the heavy metal detox smoothie, which consists of bananas, wild blueberries, cilantro (coriander), orange juice, barley grass juice powder, spirulina and Atlantic dulse.\n\nThere are many other good foods (that also have probiotics) that will assist with detoxification, including:\n• Neem (a natural alternative to ivermectin) in combination with turmeric.\n\nWhile a natural detox is good for boosting well-being, and it is also important to eliminate harmful habits from your diet and lifestyle, including heavily processed and refined foods (which usually contain artificial preservatives), smoking (including marijuana), alcohol, drugs (all of which are important if you are also breastfeeding), artificial sweeteners and mainstream media. There is plenty of information online if you are interested to know about how diet can assist with a vaccine detox, assist the immune system and boost any immune response in the process.\n\nIf you are inclined, it is also important to bless your food and ask for it to be purified and made whole for the healing and cleansing of those partaking of it. If you want to take this to the next level, use the technique recommended by Siberian mystic Anastasia for planting and growing food that is uniquely medicinal for your biological needs. This process harnesses the healing power of food in a natural way and emphasizes harmony between man and nature.\n• Take the right supplements\n\nSupplements are also important in the vaccine detoxification process. Similar to diet, there are many options here, including:\n• Organic bee pollen (see more below on bee pollen and healing your DNA)\n• Iodine (such as atomic iodine or Detoxadine\n\nDr Sherri Tenpenny recommends high doses of powdered vitamin C ascorbates (not ascorbic acid), 200-400mg co enzyme Q10 every day (gel caps and not powder) as well as getting Vitamin D and iodine. Colloidal silver can also help with the vaccine detox process and boosting the immune system. One of the more advanced options being Silver Joe Cell water, which you can make yourself with the right technology. Supplements also play an important role in reducing transmission and damage from spike proteins, and many of the supplements listed above can assist in this process.\n\nPaida Lajin is an ancient Chinese self-healing technique which utilises stretching, patting, and slapping of specific external skin areas to draw out and expel toxins in the body. The technique originated from ancient Taoist practitioners, who used it to activate vital energy channels (also called the meridian system).\n\nPaida Lajin works by stimulating the body’s meridian system to increase the circulation of natural energy flows (also called ki, chi, prana and many other names throughout the world), which also increases health and vitality and improves the body’s natural ability to heal itself.\n\nHippocrates, Father of Western medicine (before it was corrupted by the pharmaceutical industry and those who paved the way for allopathic medicine) repeatedly stressed that the body contains within itself the power to rebalance and heal itself. There is an inherent ability in the human body to repair and heal itself through self-healing power, and the immune and self-reparatory functions are part of this self-healing power. The body possesses the ability to naturally detoxify, and the technique of Paida Lajin helps activate and accelerate this ability and improve overall wellness. Paida Lajin goes way beyond other methods such as chiropractic and modalities taught by modern health care providers.\n\nUpon commencing the practice of Paida Lajin, it is common to experience significant detoxification symptoms including red spots, rashes, blisters, dizziness, belching, headaches, nausea, thick phlegm, running nose, flatulence and smelly excrement and urine. Skin discolouration is also very common, and this is essentially the discharge of “sha”, a word unique to the Chinese language which means “poisonous blood” in the body.\n\nAs an aside, the practitioner who helped bring Paida Lajin to the world was recently jailed in a sham trial – which commonly happens with those who brings genuine cures to the world (think Royal Raymond Rife for example).\n\nThis is potentially the most important step when it comes to detoxing from vaccines, particularly when it comes to mRNA gene modification “vaccines”. Supernatural means are usually required to undo this damage, heal your DNA and also assist in the process of spiritual evolution and growth.\n\nThis power has been demonstrated by many through the ages. In the Bible, for example, Mark 16:18 states “They shall take up serpents; and if they drink any deadly thing, it shall not hurt them; they shall lay hands on the sick, and they shall recover.”\n\nA Greek hieromonk discusses this power in action (skip to about 12.00) and recounts the story of a prisoner in a Russian concentration camp. Many of these prisoners were Christians and they were forcibly given psychotropic drugs and other harmful substances. One pious lady was given drugs all day, but they had no effect on her. She was constantly praying “Lord Jesus Christ have mercy on me.” Her captors were confused by this and took the drugs and poisons – and died.\n\nThere are specific prayers that should be given and offered to invoke the power of God (or whatever you choose to call our benevolent, universal Creator). The power of Christ is universal, and it does not matter if you are Buddhist, Hindu, Muslim, Jewish, or even an atheist or satanist. If you pray this prayer with a genuine and penitent heart, God will respond.\n\n“In the name of Jesus Christ: I acknowledge and accept that I am fearfully and wonderfully made in the image and likeness of God. I do not consent to any attempts or actions that would seek to harm or damage my bodily temple and violate my DNA through vaccines or any other means. I pray to our Father Lord God Almighty to intercede and protect mankind from the violation of our bodies with unholy and unclean substances. As your children, we do not consent to this violation of our body temples which house the Christ within our hearts. I ask you God to speed up the day of judgement upon the fallen ones currently working behind the scenes to bring about the fall of mankind and the destruction of the children of the light and planet Earth. We ask in the name of Jesus Christ for our prayer to be heard in the courts of Heaven and for action to be taken. By my own free will I choose to disengage from any complicity or involvement with the fallen one’s plans and I choose to follow God’s plan for my life. According to God’s holy will, Amen.”\n\nIf you’re able, please pray this prayer out loud and preferably with at least one other person (thereby fulfilling Jesus’ promise that “if two of you agree on earth about anything they ask, it will be done for them by my Father in heaven. For where two or three are gathered in my name, there am I among them.”)\n\nThe power of the love is one of the most powerful antidotes to vaccines and the nanotechnology within, as well as the damage they can do to DNA. Step one above discusses the power of electromagnetics in rendering nanites inert, and the heart is the most powerful source of electromagnetic energy in the human body. It produces the largest rhythmic electromagnetic field of any of the body’s organs, with an electrical field about 60 times greater in amplitude than the electrical activity generated by the brain. Simply put, your body has a natural, God-given ability through the power of the heart to suppress inorganic nanotechnology which is harmful to the body.\n\nThere are many ways to stimulate this power and generate more love, and the primary and most effective way to do this is through God. On a spiritual level, there are more advanced techniques available to those who are ready, such as the violet flame (a unique spiritual energy which can transmute negativity in all its forms), sun gazing (an ancient spiritual practice which engages the light and power of the sun), EFT and Psych-K (modern energy psychology techniques which release blockages and facilitate growth), kriya yoga (an ancient meditation technique of energy and breath control) and HeartMath (a spiritual practice which helps you tap into the power and intelligence of your) – just to name a few.\n\nSpiritual practices such as these will also draw more light into the body, which will naturally heal damaged DNA and also activate dormant DNA as the vibration of the body is raised. This approach is the best and most natural one for healing DNA.\n\nSpecific frequencies can also assist in healing and activating DNA. The 528 hertz Solfeggio frequency, for example, is also known as the “528 Miracle” because it can heal and repair DNA within the body. It is the exact frequency that has been used by genetic biochemists and this frequency is understood to be the most significant of the Solfeggio frequencies.\n\nThere are also many foods and supplements you can take to help protect and heal your DNA. One of the most effective supplements in this process is organic bee pollen – which is essentially a concentrate of nature’s building blocks of life. Bee pollen contains nearly all nutrients required by humans, and one of the most interesting facts about bee pollen is that it cannot be synthesized in a laboratory. According to researchers at the Institute of Apiculture, Taranov, Russia: “Honeybee pollen is the richest source of vitamins found in nature in a single food. Even if bee pollen had none of its other vital ingredients, its content of rutin alone would justify taking at least a teaspoon daily, if for no other reason than strengthening the capillaries. Pollen is extremely rich in rutin and may have the highest content of any source, plus it provides a high content of the nucleics RNA [ribonucleic acid] and DNA [deoxyribonucleic acid].” Be sure the source of the bee pollen is from a pristine and pure location, preferably located away from pollutants and potential GMO crops.\n\nThere are a number of foods and other supplements that can assist with the process of healing and protecting your DNA, including retinol palmitate, ascorbic acid, luteolin, quercetin, NAC and niacinamide.\n\nClosing tip: If you’re going to be (or if you’ve just been) vaccinated\n\nVaccines are injected directly into the body and there are steps you can take to minimise their immediate impact and minimize a potential vaccine reaction. You can use apply the above steps beforehand to prepare your body for coerced or forced vaccines beforehand. It is also important to follow these instructions as soon as you can following the injection.\n\nApply a thick paste of zeolite (purified, micronised food grade zeolite mixed with spring water) over the area immediately. Wash off and repeat daily for 2-3 weeks (for more information on zeolite, see point number two above).\n\nOn top of this zeolite paste, place a strong magnet (preferably a neodymium magnet or Q magnets are also good). The magnetic field will work to attract inorganic ingredients such as superparamagnetic iron oxide nanoparticles (SPIONs) from being absorbed into the body. Magnetic fields can also disrupt the ability of nanites to function properly.\n\nAnother important step is electrotherapy (see point one above). Apply a Tesla violet ray to the vaccinated site as soon as you can too (preferably after applying the magnet to draw nanites closer to the skin).\n\nWhile this protocol will help significantly with existing vaccines that you may have received in the past, the best thing you can do is do not consent to any future vaccines. Consent is golden – or binding – depending on your free will choice.", "opengraph": {"locale": "en_US", "type": "article", "title": "10 Ways to Detox from Pharmakeia, Deactivate Nanotechnology and Heal Your DNA - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2021/10/03/10-ways-to-detox-from-pharmakeia-deactivate-nanotechnology-and-heal-your-dna/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2021-10-03T12:13:44+00:00", "article:modified_time": "2021-10-01T03:19:47+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2021/07/external-content.duckduckgo.com_.jpg", "image:width": "474", "image:height": "147", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/blackrock-vanguard-own-big-pharma-media/", "https://www.facebook.com/MessengerofLightandLove/posts/915238445959851", "http://stateofthenation.co/?p=26543", "https://en.wikipedia.org/wiki/God_gene", "https://youtu.be/pc_EiWNPrss", "https://www.podomatic.com/podcasts/freshsound27906/episodes/2021-05-07T06_01_59-07_00", "http://stateofthenation.co/?p=26543", "https://youtu.be/ZygNj_0l03w", "https://christianobserver.net/darpa-covid-shot-test-swabs-the-pineal-gland-and-faith/", "https://odysee.com/@TimTruth:b/Testswabmicroscope:f", "https://www.orwell.city/2021/06/covid-19-is-caused-by-graphene-oxide.html", "https://youtu.be/9qKiz9x8u9M", "https://en.wikipedia.org/wiki/Vusamazulu_Credo_Mutwa", "https://tsg-referendum.ch/en/dangerous-nanoparticles-contaminate-43-leading-vaccines-groundbreaking-study/", "https://www.nature.com/articles/s41565-020-0757-7", "https://www.quantumbalancing.com/borax.htm", "http://www.healthshop101.com/boron.html", "https://www.20muleteamlaundry.com/", "http://www.cytoluminator.com/cancer-photodynamic-therapy/httpwww.health-science-spirit.com%20borax.pdf", "https://youtu.be/yVyfRVq_SC0", "https://www.bibliotecapleyades.net/ciencia/ciencia_morgellons19.htm", "https://www.youtube.com/watch?v=9V1U_hnxEjo", "https://www.carnicominstitute.org/index.html", "https://odysee.com/@TimTruth:b/medic-100-percent-sure-examined-masks-have-living-organisms:a", "https://odysee.com/@TimTruth:b/Blackstrandsupdate-1:8", "https://tottnews.com/2020/11/20/covid-tests-harvesting-dna/", "http://www.metatech.org/wp/conspiracy/cure-morgellons-disease/", "https://bit.ly/39yo6g5", "https://zeonatural.com/nature-and-properties-of-zeolites/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6277462/", "https://www.zpzap.net/zeolites.html", "https://zeonatural.com/", "https://www.drtenpenny.com/", "https://drtenpenny.thegoodinside.com/pbx-trial-offer-10c2020/", "https://jimhumble.co/", "https://mmstestimonials.co/malaria/leaked-proof-the-red-cross-cured-154-malaria-cases-with-mms", "https://andreaskalcker.com/en/", "https://www.mms-supplement.com/dmso", "https://odysee.com/@TimTruth:b/Newleadontoxoparasite-1:4", "https://www.bitchute.com/video/zn0v9kmyI5uY/", "https://www.bitchute.com/video/heTcGy2W7qJ8/", "https://www.naturalnews.com/2020-07-08-us-marshals-raid-church-mark-grenon-genesis-2-church-mms.html", "https://en.wikipedia.org/wiki/Suramin", "https://www.bitchute.com/video/IB3ijQuLkkUr/", "https://www.bitchute.com/video/9JPCaD4awC4t/", "https://www.bitchute.com/video/cSp0VjOP0OKq/", "https://www.ringingcedarsofrussia.org/store.php?id=listof_3cedarpr", "https://www.brighteon.com/7c129e86-7e2b-47a7-bc74-dd19621e4042", "https://niacincurescovid.com/", "https://www.brighteon.com/8013f6d4-a765-46c0-af7f-b910e40fc403", "https://youtu.be/QfA16ff43Kg", "https://cayce.com/health-solutions/edgar-cayce-violet-ray-handy-healing-device/", "https://transportationevolved.com/nikola-tesla/", "https://altered-states.net/barry/newsletter510/", "https://www.zpzap.net/", "http://huldaclark.com/", "https://worldwithoutparasites.com/", "http://morgellonscure.com/", "https://weareonelightforall.org/about", "http://www.orgoneproducts.org/orgone_zapper2.php", "https://ampcoil.com/", "https://www.teslabiohealing.com/products/tesla-biohealer", "https://au1lib.org/book/547906/47263d?dsource=recommend", "http://electrocleansing.com/stories.php", "https://youtu.be/9cVxJMFFsHA", "https://www.sciencedirect.com/science/article/pii/S2095927316302407?via%3Dihub", "https://www.positivehealthwellness.com/diet-nutrition/benefits-macrobiotic-diet-follow/", "https://smarternutrition.com/blogs/news/the-macrobiotic-diet-all-about-balance", "https://www.medicalmedium.com/mm101/medical-medium-heavy-metal-detox.htm", "https://www.organiclifestylemagazine.com/issue/17-how-to-detoxify-and-heal-from-vaccinations-for-adults-and-children", "https://www.revelationsky.org/food/anastasias-planting-method/", "https://pubs.rsc.org/en/content/articlelanding/2019/cc/c9cc00429g#!", "https://www.orwell.city/2021/06/graphene-oxide-in-vaccination-vials.html", "https://www.baar.com/atomic-iodine-2-oz-dropper-bottle", "https://globalhealing.com/products/detoxadine", "https://www.drtenpenny.com/", "http://joecellwaterscience.com/silverjoe_cell_11.html", "https://ambassadorlove.wordpress.com/2021/06/24/summary-of-the-spike-protein-protocol-david-avocado-wolf/", "http://www.paidalajin.com/en/", "http://www.kinesiologysa.com/paida-lajin/paidalajin-healing", "http://www.healthmantra.com/paida-lajin/", "https://cdn.website-editor.net/87b497e2dbe543258766bacfe13a95c9/files/uploaded/TheCureThatWorked.pdf", "https://thenewamerican.com/covid-shots-dna-transhumanism-with-dr-madej-2/", "https://youtu.be/UWcIuYFpoTo", "https://www.heartmath.org/research/science-of-the-heart/energetic-communication/#:~:text=The%20heart's%20electrical%20field%20is,activity%20generated%20by%20the%20brain.&text=The%20heart's%20magnetic%20field%20can,an%20important%20carrier%20of%20information.", "https://thevioletflame.tripod.com/", "http://solarhealing.com/process/", "https://www.emofree.com/eft-tutorial/eft-tapping-tutorial.html", "https://psych-k.com/", "https://yogananda.org/kriya-yoga-path-of-meditation-overview", "https://www.heartmath.com/", "https://attunedvibrations.com/528hz-dna-repair/", "https://nutritionfacts.org/video/fruits-vegetables-boost-dna-repair/", "https://blog.iyannis.com/tonys-show-on-2021-06-17-protection-against-the-scourge/", "https://qmagnets.com/", "https://odysee.com/@TimTruth:b/Magnetspullingparticlesout:9", "https://pubmed.ncbi.nlm.nih.gov/24715289/"], "authors": ["Guest Author"], "publish_date": "2021-10-03T12:13:44+00:00"}