{"result_id": "243012", "URL": "https://prepareforchange.net/2020/08/16/luciferase-chain-reaction-to-id2020/", "timestamp": "2023-04-25 16:50:03 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2020/08/16/luciferase-chain-reaction-to-id2020/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Luciferase Chain Reaction to ID2020", "cleaned_text": "Put down the mask. The mask is a tool of conditioning, a temporary distraction from the new technology.\n\nBioluminescence is a “cold light” that derives from a chemical reaction within a living organism. Cold light means less than 20% of the light generates thermal radiation, or heat. Most bioluminescent organisms are found in the ocean; fish, bacteria, and jellies. Some bioluminescent organisms, including fireflies and fungi, are found on land. There are almost no bioluminescent organisms native to freshwater habitats.\n\nScientists say humans can utilize bioluminescence through a chemical enzyme called Luciferase. Enzymes catalyze biochemical chain reactions in the body to make things happen. The root word lucifer – means lightbringer. Lucifer also happens to be the name of the Vatican’s binocular telescope, atop Mt. Graham in southeastern Arizona, as well as the name of an infamous fallen angel.\n\nResearchers at MIT created a microneedle platform using fluorescent microparticles called quantum dots (QD), which can deliver vaccines and at the same time invisibly encode vaccination history directly in the skin. Bill Gates calls it the Human Implantable Quantum Dot Microneedle Vaccination Delivery System.\n\nThe researchers designed their dye to be delivered by a microneedle patch rather than using a traditional syringe and needle. Such patches are now being developed to deliver vaccines for measles, rubella, and other diseases. The QD are composed of nanocrystals, which also emit near-infrared (NIR) light that can be detected with a specially equipped smartphone using an app. The dots are about 4 nm in diameter, and are encapsulated in biocompatible microparticles that form spheres about 20 µm in diameter. This encapsulation allows the dye to remain in place, under the skin, after being injected.\n\nForget the HIPAA Privacy rules. The MIT team set out to devise a method for recording vaccination information in a way that doesn’t require a centralized database or other infrastructure, rather it is an “on-patient,” decentralized medical record. No mention of adding or subtracting information, or hacking was disclosed. The team wrote:\n\nThis experiment was conducted in rats in the December 2019 journal Science Translational Medicine which concluded:\n\nBiosensing is a new drop sensing method for faster testing of Covid-19, published June of 2020 in ACS Nano.\n\nCOVID19 seems to be an acronym for Coronavirus I.D. 2019. This I.D. will be delivered via quantum dot microneedles, as a digital identification mark. Part of this injectable system will include a human implantable device for buying and selling cryptocurrency. The digital ID will come in the form of something called an Immunity Passport.\n\nIn the Information Age, advertisers claim blockchain-enabled digital “immunity passports could help take the strain off increasingly stretched healthcare systems and help reinvigorate shrinking economies.” But what if the Immunity Passport is also your passport to travel by plane, to buy a car, to purchase food, to see a show?\n\nThe Plandemic is the vehicle for the government to move from a currency system (a dollar in your pocket) to a crypto system, to allow government to get deeply into your business.\n\nThink Smart Meter in your body.\n\nThe Luciferase chain reaction is set up to: 1). inject everyone with a universal shot, 2). create a device for buying and selling currency that’s run on the human body as it’s battery, and 3). attach both those things to a digital identification from ID2020.\n\nUnlike the dollar, which is tied to the oil standard as the petrodollar, the crypto will have a human being as its collateral.\n\nFUN FACT: The publication of this Microsoft patent? #060606\n\nThe US government (Navy) is working with a Danish tech firm to come up with an implantable chip that would integrate with a cryptocurrency called Ripple. The technology being rolled out over the next decade, from life extension technology to new energy systems, to building out space, can create incredible wealth, for some. But there is also a reason to believe in the dumbing down of an entire global population.\n\nThe Covid19 solution being called a “vaccine’ is the Human Implantable Quantum Dot Microneedle Vaccination. It is not a vaccine. It is an implantation to become a part of the Cloud.\n\nThink Star Trek, The Borg. As in: We are the Borg. Your biological and technological distinctiveness will be added to our own. Resistance is Futile, You will be Assimilated.\n\nAccording to a research published in the journal Frontiers in Neuroscience, exponential progress in nanotechnology, nanomedicine, artificial intelligence (AI), and computation will lead this century to the development of a “Human Brain/Cloud Interface” (B/CI).\n\nBeing connected to the Cloud would mean neural nanorobots would provide direct, real-time monitoring and control of signals to and from brain cells to allow Matrix-style downloading of information.\n\nLuciferace is not only a ‘near infrared bioluminescence enzyme’, it is a chain reaction to catalyze an ID tracking system.\n\nNo matter what COVID is, virus, bacterium, fungus, there are natural solutions, which do not include giving up personal freedom and human rights.\n\nKnow what are are consenting to.\n\nKnow what you are connecting to.\n\nKnow you always have a choice.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Luciferase Chain Reaction to ID2020 - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2020/08/16/luciferase-chain-reaction-to-id2020/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2020-08-16T16:28:19+00:00", "article:modified_time": "2020-08-10T06:31:42+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2020/08/face-detection-4791810_1920.jpg", "image:width": "1920", "image:height": "1138", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nationalgeographic.org/encyclopedia/bioluminescence/", "https://redice.tv/news/vatican-tied-mount-graham-observatory-launches-lucifer-telescope", "https://www.genengnews.com/topics/drug-discovery/quantum-dots-deliver-vaccines-and-invisibly-encode-vaccination-history-in-skin/", "https://www.genengnews.com/topics/drug-discovery/quantum-dots-deliver-vaccines-and-invisibly-encode-vaccination-history-in-skin/", "https://www.hhs.gov/hipaa/for-professionals/privacy/laws-regulations/index.html", "https://www.genengnews.com/topics/drug-discovery/quantum-dots-deliver-vaccines-and-invisibly-encode-vaccination-history-in-skin/", "https://stm.sciencemag.org/content/11/523/eaay7162", "https://medicalxpress.com/news/2020-07-droplet-biosensing-method-door-faster.html", "https://pubs.acs.org/doi/10.1021/acsnano.0c04239", "https://www.fodors.com/news/coronavirus/will-i-need-an-immunity-passport-to-travel", "https://www.information-age.com/immunity-passports-blockchains-breakthrough-application-123490283/", "https://www.youtube.com/watch?v=Gv1ITJr3uZw&t=613s&pbjreload=101", "https://www.exposingsatanism.org/category/mark-of-the-beast/", "https://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606&tab=PCTBIBLIO", "https://www.dcforecasts.com/ripple-news/us-navy-chip-development-will-be-made-possible-with-ripple/", "https://www.youtube.com/watch?v=AyenRCJ_4Ww", "https://indianexpress.com/article/technology/science/human-brains-may-directly-connect-to-cloud-networks-in-future-5676627/", "https://indianexpress.com/article/technology/science/human-brains-may-directly-connect-to-cloud-networks-in-future-5676627/", "https://www.youtube.com/watch?v=Gv1ITJr3uZw&t=613s", "https://www.natureofhealing.org/luciferase-id2020-system/", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2020-08-16T16:28:19+00:00"}