{"result_id": "243021", "URL": "https://prepareforchange.net/2023/03/13/biden-administration-prevents-worlds-top-tennis-player-from-entering-country-because-he-refuses-to-take-covid-vaccine/", "timestamp": "2023-04-25 16:50:17 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2023/03/13/biden-administration-prevents-worlds-top-tennis-player-from-entering-country-because-he-refuses-to-take-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Biden Administration Prevents World’s Top Tennis Player from Entering Country Because He Refuses to Take COVID Vaccine", "cleaned_text": "The Biden administration has refused tennis great Novak Djokovic, the world’s number one tennis player, entry into the United States because he refuses to take the COVID-19 vaccine.\n\nMost people thought that the insane mandates related to the COVID vaccine were over, but this apparently isn’t the case.\n\nNovak Djokovic will not participate in the BNP Paribas Open this month after the Biden administration denied his entry to the United States, due to him being unvaccinated against COVID-19. Djokovic, 35, requested a vaccine waiver, which would have allowed him to enter the U.S. unvaccinated, but it was rejected by the Homeland Security Department. The 22-time Grand Slam champion subsequently withdrew from the combined ATP-WTA event, which begins Wednesday at Indian Wells Tennis Garden in Indian Wells, California.\n\nThe communist-like tactics pushed by the Biden regime, forcing people to do or take things that they do not want, are still in effect.\n\nDespite mounting evidence that the vaccines may make individuals more susceptible to COVID and can be dangerous to your health and even deadly, the Biden regime is still mandating foreigners take the vaccine before coming into the country.\n\nDjokovic refuses to take the vaccine mandated by world elites and it has prevented him from playing the game he loves. Djokovic is taking on the tyranny of the elites around the world.\n\nBiden has prevented Djokovic entry the US before. He recently prevented him from competing in the US in January and prevented him from competing last year as well.\n\nDjokovic was prevented from playing in the French Open and the Australian Open. This past month he was finally permitted to play in the Australian Open and he won.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Biden Administration Prevents World’s Top Tennis Player from Entering Country Because He Refuses to Take COVID Vaccine - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2023/03/13/biden-administration-prevents-worlds-top-tennis-player-from-entering-country-because-he-refuses-to-take-covid-vaccine/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2023-03-13T11:53:46+00:00", "article:modified_time": "2023-03-17T01:50:32+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2023/03/tennis.png", "image:width": "1232", "image:height": "792", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.foxnews.com/sports/novak-djokovic-withdraws-bnp-paribas-open-denied-entry-us-covid-vaccine-status", "https://www.foxnews.com/category/person/joe-biden", "https://www.foxnews.com/category/politics/executive/homeland-security", "https://prepareforchange.net/donations"], "authors": ["Derek Knauss"], "publish_date": "2023-03-13T11:53:46+00:00"}