{"result_id": "243022", "URL": "https://prepareforchange.net/2022/07/16/exclusive-uk-gov-admits-covid-vaccine-is-killing-kids-after-publishing-report-proving-vaccinated-children-are-shocking-30200-more-likely-to-die-than-unvaccinated-children/", "timestamp": "2023-04-25 16:50:17 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2022/07/16/exclusive-uk-gov-admits-covid-vaccine-is-killing-kids-after-publishing-report-proving-vaccinated-children-are-shocking-30200-more-likely-to-die-than-unvaccinated-children/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "EXCLUSIVE – UK Gov. admits COVID Vaccine is killing Kids after publishing report proving Vaccinated Children are shocking 30,200% more likely to die than Unvaccinated Children", "cleaned_text": "The U.S. Food & Drug Administration (FDA) has questionably authorised emergency use of both the Pfizer and Moderna mRNA Covid-19 injections for use among children aged 6 months and above despite the UK Government admitting the Covid-19 Vaccine is killing children after it published data via the Office for National Statistics proving children are 82 to 303x more likely to die following Covid-19 vaccination than children who have not had the Covid-19 vaccine.\n\nOn June 17th 2022, the U.S. Food and Drug Administration (FDA) criminally extended the emergency use authorisation of the mRNA Covid-19 injections for use in children as young as 6 months.\n\nThere has never been an emergency in regard to Covid-19 infection among children. Two years of evidence show the alleged disease has only adversely affected the elderly and vulnerable. Children have been unlucky to suffer symptoms more severe than those associated with the common cold.\n\nBut despite this fact, the FDA has decided it is perfectly safe to administer an experimental injection to babies and toddlers, with FDA Commissioner Robert Califf saying –\n\nThe FDA Commissioner will live to regret that last sentence. As will any parent who takes the Commissioners words at face value. Because official data from the UK’s Office for National Statistics show that Covid-19 vaccinated children are between 8,100% and 30,200% more likely to die than unvaccinated children.\n\nOn 16th May 2022, the Office for National Statistics (ONS) published a dataset containing details on ‘deaths by vaccination status in England’ between 1st Jan 2021 and 31st March 2022.\n\nThe dataset contains various tables showing details such as, ‘Monthly age-standardised mortality rates by vaccination status for deaths involving COVID-19’, and ‘Monthly age-standardised mortality rates by vaccination status for non-COVID-19 deaths’.\n\nHere’s an example that has been taken from table 2 of the latest dataset –\n\nAs you can see, the ONS has chosen not to include children in the calculated mortality rates despite the fact children as young as 5 are now eligible for Covid-19 vaccination. They also grouped young adults as a group ranging from age 18 to 39, a period of 22 years, while all other age groups are a period of 10 years (40-49, 50-59 etc).\n\nIt’s things like this that make you believe they must have something to hide, and it turns out they definitely have.\n\nBecause on table 9 of the ‘Deaths by Vaccination Status’ dataset, the ONS have inadvertently provided enough details on deaths among children and teenagers by vaccination status for us to calculate the mortality rates ourselves, and they are horrendous.\n\nHere are the figures published by the ONS in table 9 for 10 to 14-year-olds –\n\nAnd here are the figures published by the ONS in table 9 for 15 to 19-year-olds –\n\nAs you can see, the ONS has given us both the number of deaths and person-years by vaccination status. This means we can perform simple math to calculate the mortality rates per 100K person-years ourselves.\n\nAll we need to now do is divide the person-years by 100,000, and then divide the number of deaths by the answer to that equation.\n\nSo for unvaccinated 10-14 year-olds we perform the following calculation to work out the all-cause death mortality rate –\n\nTherefore, the all-cause mortality rate per 100,000 person-years among unvaccinated 10-14-year-olds is 4.58 deaths per 100,000 person-years between 1st Jan 21 and 31st March 22.\n\nNow all we have to do is use the same formula to calculate the mortality rates per 100K person-years for all vaccination statuses among 10 to 14-year-olds and 15 to 19-year-olds.\n\nHere are the calculated mortality rates by vaccination status among 15-19-year-olds based on the ONS calculated person-years –\n\nAnd here are the calculated mortality rates by vaccination status among 10-14-year-olds based on the number of deaths and ONS calculated person-years –\n\nThese figures are horrifying. The ONS data shows that between 1st Jan 21 and 31st March 22, double vaccinated children aged 10-14 were statistically up to 39 times more likely to die than unvaccinated children, and double vaccinated teenagers aged 15-19 were statistically up to 4 times more likely to die than unvaccinated teenagers.\n\nBut it’s the triple vaccinated figures that are truly frightening when it comes to children.\n\nThe ONS data shows that between 1st Jan 21 and 31st March 22, triple jabbed children aged 10-14 were statistically 303 times more likely to die than unvaccinated children of Covid-19, 69x more likely to die of any cause other than Covid-19 than unvaccinated children, and 82x more likely to die of all-causes than unvaccinated children.\n\nThis suggests that three doses of a Covid-19 injection increase the risk of all-cause death for children by an average of 8,100%, and the risk of dying of Covid-19 by an average of 30,200%. Whilst two doses increase the risk of all-cause death by an average of 3,600%.\n\nBut as things currently stand it’s the other way round for teenagers. Two doses of a Covid-19 injection increase the risk of all-cause death for teens aged 15 to 19 by an average of 300%. Whilst three doses increase the risk of all-cause death by an average of 100%.\n\nThe figures for children though, are in fact even worse than they first appear. This is because the unvaccinated mortality rate among 10-14-year-olds includes children aged 10 and 11 who were only offered the Covid-19 injection from the beginning of April 2022, despite the UK Medicine Regulator questionably granting emergency use authorisation for it to be administered to young children in late December 2021.\n\nWhereas the vaccinated mortality rates include only a handful of 10 and 11 year-olds. We know this from the fantastic news that only 7% of 5 to 11-year-olds have had the Covid-19 injection as of 14th May 2022.\n\nTherefore, if the Covid-19 injections were not causing the untimely deaths of children then we would actually expect to see a mortality rate that is lower among the vaccinated population than the mortality rate among the unvaccinated population, not a mortality rate that is similar, and certainly not a mortality rate between 8,100 % and 30,200% higher.\n\nThe statistics are horrendous, but it’s important to remember that behind those statistics are real people who are suffering and who have lost their lives, and unfortunately this time around they are children. Children who have never been in danger of suffering serious complications due to the alleged Covid-19 disease. Therefore, children who have never, ever needed an experimental, poor-performing, deadly (these statistics prove it) Covid-19 injection.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "EXCLUSIVE – UK Gov. admits COVID Vaccine is killing Kids after publishing report proving Vaccinated Children are shocking 30,200% more likely to die than Unvaccinated Children - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2022/07/16/exclusive-uk-gov-admits-covid-vaccine-is-killing-kids-after-publishing-report-proving-vaccinated-children-are-shocking-30200-more-likely-to-die-than-unvaccinated-children/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2022-07-16T23:44:49+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2022/07/61f96d2c8710b12806f475e7_o_U_v2-scaled.jpeg", "image:width": "2560", "image:height": "1438", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ons.gov.uk/file?uri=%2fpeoplepopulationandcommunity%2fbirthsdeathsandmarriages%2fdeaths%2fdatasets%2fdeathsbyvaccinationstatusengland%2fdeathsoccurringbetween1january2021and31march2022/referencetable20220516accessible.xlsx", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/05/image-216.png?ssl=1", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/05/image-217.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/05/image-218.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/05/image-211.png?ssl=1", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/05/image-212.png?ssl=1", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/05/image-210.png?ssl=1", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/05/image-213.png?ssl=1", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://i0.wp.com/expose-news.com/wp-content/uploads/2022/05/image-219.png?ssl=1", "https://www.theguardian.com/world/2022/may/14/young-children-england-covid-jab-vaccine-rollout-7-per-cent-parents-usefulness", "https://expose-news.com/2022/07/08/ukgov-admits-covid-jab-killing-kids/", "https://es.prepareforchange.net/2022/07/19/el-gobernador-del-reino-unido-admite-que-la-vacuna-covid-esta-matando-a-los-ninos/", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2022-07-16T23:44:49+00:00"}