{"result_id": "243043", "URL": "https://prepareforchange.net/2023/01/07/japan-launches-official-investigation-into-millions-of-covid-vaccine-deaths/", "timestamp": "2023-04-25 16:50:49 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2023/01/07/japan-launches-official-investigation-into-millions-of-covid-vaccine-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Japan Launches Official Investigation Into Millions of COVID Vaccine Deaths", "cleaned_text": "Japan has launched an official investigation into the unprecedented numbers of people dying after receiving the Covid-19 vaccination.\n\nAccording to reports, Japanese researchers have been instructed to investgate the mechanisms by which experimental mRNA jabs could be causing deaths and severe adverse reactions.\n\n“The first concern was that the body temperatures of the corpses were very high when the police performed the autopsy,” Nagao declared.\n\n“The body temperatures were unusually high, such as 33 or 34 degrees celsius (91-93ºF).”\n\nInfowars.com reports: In other bodies, Nagao says “temperatures were very high at the time of death. Their body temperatures were above the normal temperature, more like over 40 degrees celsius (104ºF).”\n\nGraphing the data, Nagao’s research team found there were significant changes to the genetic makeup of vaccinated autopsied patients’ immune systems.\n\nThe research has led Nagao to conclude the vaccine causes immune system abnormalities that prompt inflammation throughout the body, which is likely the cause of the high body temperatures at the time of autopsy.\n\n“Based on the data and the circumstances alone, it is not possible to conclude that the vaccine was the cause of the deaths,” Prof. Nagao said, adding, “However, it is impossible to say that the vaccine was not the cause. We can only say that it is doubtful, but we believe that vaccination was sufficiently related to the immune abnormalities.”\n\nIn another report, dermatology expert Prof. Shigetoshi Sano of the Kochi University School of Medicine discussed discovering spike proteins at the site of skin lesions and other skin problems on patients who were vaccinated.\n\n“The spike protein derived from the vaccine was found in the skin,” Sano explained, highlighting a slide showing a bright green region on a lesion made visible by a special dye.\n\n“Spike proteins are locally suppressing the immune system,” Sano told reporters. “As a result, the spike proteins facilitate in reactivation of the herpesvirus.”\n\nThe process of the spike proteins degrading in the immune system prompts inflammation throughout the body that also leads to blood clots, Sano concluded.\n\n“The function of the spike proteins to produce adverse reactions is formation of blood clots,” Sano explained. “And even worse, spike proteins can also locally induce inflammation.”\n\nAgreeing that a suppressed immune system makes someone more vulnerable to infection, Sano went on to say, “I don’t know if I should say this, but it has been found that vaccinated people are more likely to get coronavirus than unvaccinated people.”\n\n“Sometimes, things that are not good are introduced into the human body. Vaccination may cause our overall immune system to fail to fight against such bad things,” he warned.\n\nThe doctors’ investigations come as Kyoto Univerisity Prof. Emeritus Dr. Masanori Fukushima slammed Japan’s Ministry of Health for refusing to halt its Covid vaccination program, citing data showing a number of adverse reactions and deaths stemming from the jab.\n\n“People are already doing research all over the world,” Fukushima told health ministers during a conference earlier this month. “Japan’s prestige is at stake. You have vaccinated so many people. And yet, only 10% of the members of the Ministry of Health, Labor and Welfare, who are leading members of the vaccine campaign have been vaccinated. Is this a fucking joke?”\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Japan Launches Official Investigation Into Millions of COVID Vaccine Deaths - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2023/01/07/japan-launches-official-investigation-into-millions-of-covid-vaccine-deaths/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2023-01-07T12:37:58+00:00", "article:modified_time": "2023-01-05T22:44:15+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2023/01/japan.png", "image:width": "1383", "image:height": "771", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.infowars.com/posts/japanese-researchers-investigate-link-between-covid-jabs-and-deaths-severe-adverse-reactions/", "https://newspunch.com/japan-launches-official-investigation-into-millions-of-covid-vaccine-deaths/", "https://prepareforchange.net/donations"], "authors": ["Derek Knauss"], "publish_date": "2023-01-07T12:37:58+00:00"}