{"result_id": "243048", "URL": "https://prepareforchange.net/2023/01/06/genvax-technologies-secures-6-5-million-to-advance-novel-vaccine-platform/", "timestamp": "2023-04-25 16:50:54 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2023/01/06/genvax-technologies-secures-6-5-million-to-advance-novel-vaccine-platform/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Genvax Technologies Secures $6.5 Million to Advance Novel Vaccine Platform", "cleaned_text": "Vaccines in our food supply, it is coming!\n\nGenvax Technologies, a startup dedicated to bringing advances in self-amplifying mRNA (saRNA) vaccine production to animal health, has secured $6.5 million in series seed funding.\n\nUnited Animal Health led the financing with participation from Johnsonville Ventures, Iowa Corn Growers Association, Summit Agricultural Group and Ag Startup Engine. This investor coalition represents animal health, nutrition, feed, meat packers and consumer products in the fight against existing and emerging threats to the food supply chain.\n\n“The threat posed to producers and consumers by foreign animal diseases like African swine fever (ASF) and constantly mutating variants of swine influenza is extraordinary,” Joel Harris, CEO and co-founder of Genvax Technologies, said in a release. “The goal is to develop a vaccine that matches 100% to the specific strain when a disease outbreak occurs.”\n\nThis funding moves the company a step forward to USDA and international regulatory approval of its vaccines in anticipation of any foreign animal disease outbreak, Genvax said in a release.\n\n“For ASF, Genvax’s vaccine could be an important tool for eradication efforts and may alleviate any concerns with trading partners abroad. In addition, the financial and public support of multiple stakeholders like United Animal Health and others in the food industry is a huge validation of this technology’s promise,” Harris said in a release.\n\nThe company’s proprietary saRNA platform allows for rapid development of herd-specific vaccines matched 100% to the variant strain circulating in an animal-production operation. By inserting a specific transgene or “gene of interest” (GOI) matched to the variant strain into the platform, the saRNA can generate an antibody response without requiring the whole pathogen, Genvax explained.\n\n“United Animal Health sees Genvax and self-amplifying mRNA vaccines as the cutting edge of technology to protect the industries we serve,” Scott Holmstrom, Ph.D., senior vice president, research and development of United Animal Health, said in a release. “These technologies are critical to food security and protein availability. We are excited to be offering our innovation and research farms to work carefully with Genvax in developing these future products.”\n\nIn April 2022, Genvax received more than $145,000 in grant funding from the USDA-Agricultural Research Services Plum Island Animal Disease Center and the Foundation for Food and Agriculture Research (FFAR) to develop a saRNA vaccine for ASF virus. Genvax, founded in February 2021 by animal health serial entrepreneurs Joel Harris and Hank Harris, DVM Ph.D., has raised $1.9 million in a pre-seed round of funding, the release said, in addition to the USDA and FFAR grant.\n\nASF is a deadly virus of pigs that can cause up to 100% mortality in pigs and could decimate the income of U.S. pork producers and force layoffs, significantly reducing rural employment. Economic models estimate the worst case scenario of an ASF outbreak in the U.S. would result in a $50 billion loss to the domestic pig industry.\n\n“We’ve been impressed with Joel Harris and the Genvax team, in addition to the novel technology they are developing,” Kevin Ladwig, managing director of Johnsonville Ventures, said in a release. “As a stakeholder in the pork industry, we feel this is a necessary step in helping prepare for and protect against African swine fever and other emerging diseases.”\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Genvax Technologies Secures $6.5 Million to Advance Novel Vaccine Platform - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2023/01/06/genvax-technologies-secures-6-5-million-to-advance-novel-vaccine-platform/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2023-01-06T12:25:56+00:00", "article:modified_time": "2023-01-05T22:29:30+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2023/01/Genvax.png", "image:width": "1653", "image:height": "1078", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://prepareforchange.net/donations"], "authors": ["Derek Knauss"], "publish_date": "2023-01-06T12:25:56+00:00"}