{"result_id": "243041", "URL": "https://prepareforchange.net/2021/01/11/nurse-shows-up-on-death-records-days-after-pfizer-vaccination-fainting-episode/", "timestamp": "2023-04-25 16:50:46 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2021/01/11/nurse-shows-up-on-death-records-days-after-pfizer-vaccination-fainting-episode/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Nurse shows up on death records days after Pfizer vaccination fainting episode", "cleaned_text": "A 30-year-old Alabama nurse manager has registered as deceased on public record searches eight days after getting Pfizer’s COVID-19 vaccine and fainting, despite media “fact checkers” and her hospital claiming up until December 21 that she was alive.\n\nNurse Collapses On Live TV During Press Conference Soon After Getting Pfizer’s COVID-19 Vaccine\n\nDeath record searches on SearchQuarry.com (recorded on this video) and another search on December 25 of Ancestry.com and posted on Twitter, show nurse Tiffany Dover (nee Pontes) as deceased. This points to her apparent death happening sometime after she publicly received a COVID-19 vaccination on December 17.\n\nPhotos and a short video posted on Twitter on December 21st by her employer, the CHI Memorial Hospital in Chattanooga, showed Nurse Tiffany standing with a group of her colleagues who were holding various posters supporting COVID vaccines and one specifically supporting Tiffany.\n\nThe local TV station and others ran the same pictures. But the link posted by CHI Memorial Hospital on the 21st failed to work when accessed on December 31.\n\n\n\n Nurse Tiffany was a married mother of two boys and lived in Higdon, Alabama, about 40 minutes’ drive across the state border from Chattanooga. The day after her fainting spell, she told media she had a condition which cause frequent dizzy spells and fainting.\n\nFainting is a common vaccine reaction with the medical name syncope, although in nurse Tiffany’s case it didn’t happen until 17 minutes after she received her shot. The video went viral on the internet and news channels.\n\nAfter the inevitable crazy online claim that nurse Tiffany died on camera, media and “fact checking” sites went into overdrive, denying the obvious.\n\nNo, they pointed out, she just fainted and was alive the next day and that the vaccine “had nothing to do with” her fainting. But these same media channels and sites have now gone silent as has CHI Memorial Hospital, which is refusing access to her, supposedly because of her request for privacy.\n\nThe hospital and Tiffany herself, if she was alive, could easily end all this speculation over a family tragedy, by simply making a public appearance. Instead, it now appears as if Pfizer’s crisis managers have taken over and are covering up the entire episode with a “say nothing and wait” strategy. Equally guilty are the media channels that have gone silent.\n\nPost-vaccination deaths are relatively rare but not uncommon. There were 202 such deaths reported to the Vaccine Adverse Events Reporting Service (VAERS) in 2019 out of a total 60,214 reports. But these reports are provided on a voluntary basis and reflect only a small fraction of all adverse events, so the death count could be higher, especially for children, whose post-vaccination deaths are often recorded as SIDS or SUDI and several other acronyms.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Nurse shows up on death records days after Pfizer vaccination fainting episode - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2021/01/11/nurse-shows-up-on-death-records-days-after-pfizer-vaccination-fainting-episode/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2021-01-12T07:44:11+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2021/01/hospital-shares-video-support-for-chattanooga-nurse-who-fainted-after-receiving-vaccine.png", "image:width": "884", "image:height": "616", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://prepareforchange.net/2020/12/18/nurse-collapses-on-live-tv-during-press-conference-soon-after-getting-pfizers-covid-19-vaccine/", "https://www.bitchute.com/video/as1rvnNFNaQQ/", "http://pic.twitter.com/yGyzKvwn89", "https://cairnsnews.org", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2021-01-12T07:44:11+00:00"}