{"result_id": "243018", "URL": "https://prepareforchange.net/2022/04/10/22000-increase-in-deaths-following-covid-vaccines-for-adults-over-50-as-fda-authorizes-2nd-booster-for-this-age-group/", "timestamp": "2023-04-25 16:50:13 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2022/04/10/22000-increase-in-deaths-following-covid-vaccines-for-adults-over-50-as-fda-authorizes-2nd-booster-for-this-age-group/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "22,000% Increase in Deaths following COVID Vaccines for Adults Over 50 as FDA Authorizes 2nd Booster for this Age Group", "cleaned_text": "The FDA announced today that it has issued another emergency use authorization (EUA) for a second COVID booster vaccine for adults over the age of 50, and as young as 12 years old if they are “immune compromised.”\n\nPfizer had made the request for a second booster shot two weeks ago, but their request was for adults over the age of 65. The FDA, however, lowered that to age 50, and issued the EUA for both the Pfizer and Moderna COVID-19 vaccines.\n\nAmid the ongoing debate over the need for another round of COVID-19 boosters, the FDA has acted quickly on the matter.\n\nOnly two weeks after Pfizer and its partner BioNTech asked the agency for an emergency use authorization (EUA) for a second round of COVID-19 boosters in people 65 and older, the FDA has granted the nod. The new FDA authorization covers those who have already been boosted with any COVID vaccine and are either 50 and older or 12 and older if they are immunocompromised.\n\nAt around the same time on Tuesday morning, Moderna said the FDA had granted its application for a second booster. The Moderna nod covers adults over 50 who have been boosted once, plus immunocompromised adults over 18. Moderna applied for a second booster on March 17. (Full article.)\n\nDo you think the FDA looked at the data in their Vaccine Adverse Event Reporting System (VAERS) regarding COVID-19 vaccines for this age group to see if there were any concerns before authorizing a second booster shot for this age group?\n\nAs we have previously reported, the FDA does no safety oversight on these vaccines, but simply takes the drug manufacturers’ word for it, allowing them to police themselves. See:\n\nJust Released Documents by Pfizer Show BioNTech Paid FDA $2,875,842.00 “Drug User Fee” for COVID-19 Vaccine Approval\n\n So we will review the data on this age group in VAERS as a service to the public.\n\nHere is what VAERS is reporting for people over the age of 50 following COVID-19 vaccines.\n\nThere are currently 14,752 deaths recorded in VAERS for people over the age of 50 following a COVID-19 vaccine, covering a period of 15 months. That’s an average of 983 deaths a month for this age group.\n\nHere are the results for this age group for the previous 30 years following ALL vaccines in VAERS. (Source.)\n\nThere were 1,590 deaths recorded following ALL vaccines for the previous 30 years for people older than 50. So if we divide that number by 360 months we get a monthly average of 4.4 deaths.\n\nSo we have seen a 22,000% increase in deaths for people over the age of 50 following COVID-19 vaccines, and the FDA just authorized another booster for those who are left in this age group.\n\nBut who cares? The corporate media owned by Big Pharma wants everyone to worry about Russia instead right now, while the FDA’s crimes go unpunished and they continue to produce and distribute more deadly shots.\n\nHere is a video I put together last September when the FDA approved the first booster for seniors, which includes whistleblower testimonies from those who saw people die after taking the COVID-19 vaccines.\n\nThis is simply euthanasia and mass murder, and they are getting away with it.\n\nThis is on our Bitchute Channel.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "22,000% Increase in Deaths following COVID Vaccines for Adults Over 50 as FDA Authorizes 2nd Booster for this Age Group - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2022/04/10/22000-increase-in-deaths-following-covid-vaccines-for-adults-over-50-as-fda-authorizes-2nd-booster-for-this-age-group/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2022-04-10T09:02:38+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2022/04/Seniors-euthanized-by-COVID-Vaccines.jpeg", "image:width": "996", "image:height": "529", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fiercepharma.com/pharma/pfizer-moderna-score-fda-nods-second-round-covid-19-boosters-older-adults", "https://www.fiercepharma.com/pharma/pfizer-moderna-score-fda-nods-second-round-covid-19-boosters-older-adults", "https://healthimpactnews.com/2022/22000-increase-in-deaths-following-covid-vaccines-for-adults-over-50-as-fda-authorizes-2nd-booster-for-this-age-group/", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2022-04-10T09:02:38+00:00"}