{"result_id": "243024", "URL": "https://prepareforchange.net/2022/08/17/doctor-discovers-the-vaccinated-emit-electromagnetic-signals-bluetooth-identification-codes/", "timestamp": "2023-04-25 16:50:20 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2022/08/17/doctor-discovers-the-vaccinated-emit-electromagnetic-signals-bluetooth-identification-codes/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Doctor Discovers the Vaccinated Emit Electromagnetic Signals & Bluetooth Identification Codes", "cleaned_text": "For the first time in human history, mRNA gene therapies are being administered throughout the planet. Governments worldwide insist the COVID-19 vaccine is ‘safe and effective’. However, since rollouts began, a host of unprecedented health conditions now plague the inoculated. Mainstream media outlets blame gardening, skipping breakfast, falling asleep with the TV on, climate change, and cold showers as the culprit. Simultaneously, bizarre anomalies continue to unfold behind the scenes. Morticians are extracting peculiar metallic structures from vaccinated corpses. One Argentinian researcher theorizes some of these synthetic objects could be an advanced type of nanoprocessor. Stranger yet, she provides evidence to support her astonishing claims. Dr. Chinda Brandolino is a medical professional specializing in lymphology, phlebology, and disease prevention. In 2021 her typically routine practice was turned upside-down. An alarming number of vaccine recipients suffered from severe and debilitating complications. Growing increasingly concerned, the physician decided to study messenger RNA and its effects on DNA. After speaking with colleagues and conducting numerous experiments, she made a startling discovery. When the Bluetooth setting was activated near immunized individuals, a unique identification code appeared on her smartphone’s screen. Each person seemingly contained an internal technological device. During an interview transcribed by Orwell City, Dr. Brandolino shared her startling findings: Mónica Calcedo: The chip. Is that real or a lie? Dr. Brandolino: It’s a nanoprocessor. I say again that it is in plain view for those who want to see the micrographs of the electron microscope study made by Dr. Kalcker. It’s clearly seen in the magnification: a small, perfect, quadrangular, precise-edged, metallic corpuscle which is the same as any nanoprocessor in nanotechnology-responsive devices. That nanoprocessor is driven from a 4G Plus or 5G antenna. That is, all G technology is the same. The difference lies in that the packet of information that an antenna can transmit is much larger in 4G Plus and 5G, 6G, and 7G. All that compact information is handled by a nanoprocessor— in a device which will be just inside our cells. By having Morgellons in the polyethylene glycol, they’re self-reproducing, it’s self-replicating. But because it’s in graphene… Graphene is a catalyst and, as I explained to you, makes that cell resonate with the 5G antenna and the microwaves of human thought. Can you understand that? There’s a nanoprocessor driven by a 5G antenna that goes directly to the workings of our brain. On the other hand, I have seen that microchips are being inoculated in the northern hemisphere. In one of the hands of many business leaders. That would be annexed information. It would seem to be that this chip would be used… I have seen a lot of signed documents about how managers, high-ranking employees of companies use it as an identification card to open the door of the bank, etc. In it, they would have their medical history as well. All the summary data will be in that microchip, which is already a fact. If you remember, they already wanted to impose it in our countries a few years ago. It was officially manufactured by Motorola in 2000, and already in the northern hemisphere, it is used by all companies. But they are two different things: the microchip for the information and the nanoprocessor managed by the 5G antennas. Diana Schroeder: Doctor, another question. A colleague did a test with wifi. He was in a shopping mall, and codes came up when he put the phone directly on the vaccinated person. Codes came up. Dr. Brandolino: That’s correct. It’s like that. I experimented with some inoculated family members of my patients. If you activate the Bluetooth option, which searches for devices, put it on the arm of the vaccinated person, you’ll get a code of about 10 digits. It’s always the same for that person. And if you put it on the other arm, that code appears again. I think that is the number of the nanoprocessor that was inoculated with the vaccine. Diana Schroeder: So that’s the person’s identification number. Dr. Brandolino: Of the nanoprocessor, of the person. Yes. Dr. Brandolino’s screenshot of the unique codes picked up Bluetooth after scanning vaccinated individuals. While injectable microcomputers sound like the work of science fiction, bioengineers already possess such capabilities. According to an entry from the National Institutes of Health database, molecular robots can program and alter DNA. Scientists from NeuroSWARM3 are currently developing particle-sized biosensors that travel through the blood-brain barrier. They then act as an antenna and wirelessly transmit neural activity to external devices. In other words, a person’s thoughts will be fully accessible. Is it any wonder why the powers-that-be were so desperate to get vaccines inside every man, woman, and child? The era of transhumanism isn’t coming— it’s already here.", "opengraph": {"locale": "en_US", "type": "article", "title": "Doctor Discovers the Vaccinated Emit Electromagnetic Signals & Bluetooth Identification Codes - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2022/08/17/doctor-discovers-the-vaccinated-emit-electromagnetic-signals-bluetooth-identification-codes/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2022-08-17T12:25:57+00:00", "article:modified_time": "2022-08-14T21:30:10+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2022/08/Doctor.png", "image:width": "1257", "image:height": "1245", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://downthechupacabrahole.com/2022/08/02/doctor-discovers-the-vaccinated-emit-electromagnetic-signals-bluetooth-identification-codes/#more-9860"], "authors": ["Derek Knauss"], "publish_date": "2022-08-17T12:25:57+00:00"}