{"result_id": "243005", "URL": "https://prepareforchange.net/2022/03/14/new-study-shows-pfizer-mrna-vaccine-becomes-dna-in-just-6-hours-in-vitro/", "timestamp": "2023-04-25 16:49:53 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2022/03/14/new-study-shows-pfizer-mrna-vaccine-becomes-dna-in-just-6-hours-in-vitro/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "New Study Shows Pfizer mRNA Vaccine Becomes DNA in Just 6 Hours, In Vitro", "cleaned_text": "Since the Pfizer-BioNTech vaccine was first approved under the FDA’s Emergency Use Authorization on Dec. 11, 2020, the world has been told that the mRNA technology used in the vaccine would not integrate into or alter the DNA of those who took it.\n\nThere have been multiple “fact-checks” of this claim in multiple mainstream outlets like Reuters, Factcheck.org, and others. Many of them set out to debunk a Massachusetts Institute of Technology (MIT) pre-print study which made the claim that the novel coronavirus could modify human DNA but was misconstrued online by folks who claimed the vaccines altered DNA.\n\nThe issue became highly controversial as this study was not peer-reviewed and did not say anything about the actual vaccine. It was an easy case to be made by the fact checkers as the authors never set out to study the vaccines in the first place.\n\nNow, however, that has all changed with the publishing of a new study out of Sweden in which the authors of the study claim to have found this very process. The study, titled “Intracellular Reverse Transcription of Pfizer BioNTech COVID-19 mRNA Vaccine BNT162b2 In Vitro in Human Liver Cell Line,” is not a pre-print and was peer-reviewed and published Current Issues in Molecular Biology 44, no. 3.\n\nResearchers pointed out that this is the “first in vitro study on the effect of COVID-19 mRNA vaccine BNT162b2 on human liver cell line.”\n\nAccording to the researchers, “preclinical studies of COVID-19 mRNA vaccine BNT162b2, developed by Pfizer and BioNTech, showed reversible hepatic effects in animals that received the BNT162b2 injection. Furthermore, a recent study showed that SARS-CoV-2 RNA can be reverse-transcribed and integrated into the genome of human cells. In this study, we investigated the effect of BNT162b2 on the human liver cell line Huh7 in vitro.”\n\nThe scientists exposed Huh7 liver cells, donated from a Japanese man, to BNT162b2 (the Pfizer vaccine) and subsequently performed a quantitative PCR test on the RNA extracted from the cells. The PCR test was used to amply the RNA material so the researchers could view the effect, if any, the vaccine had on the liver cells.\n\n“We detected high levels of BNT162b2 in Huh7 cells and changes in gene expression of long interspersed nuclear element-1 (LINE-1), which is an endogenous reverse transcriptase,” the researchers wrote.\n\nTo put this in layman’s terms, the vaccine caused the nucleus of the cells to express, in an abnormal abundance, a LINE-1 gene (commonly referred to as a housekeeping gene due to their roles in the maintenance of basic cellular functions). The gene is Endogenous (meaning found within our bodies) and reverse transcriptase (meaning it can take a piece of RNA and covert that into DNA.)\n\nIn essence, the vaccine caused the liver cells to modify their expression and distribution in order to reverse transcribe the BNT162b2 (the Pfizer vaccine) mRNA into DNA — and it only took 6 hours.\n\n“In this study we present evidence that COVID-19 mRNA vaccine BNT162b2 is able to enter the human liver cell line Huh7 in vitro. BNT162b2 mRNA is reverse transcribed intracellularly into DNA as fast as 6 h after BNT162b2 exposure. A possible mechanism for reverse transcription is through endogenous reverse transcriptase LINE-1, and the nucleus protein distribution of LINE-1 is elevated by BNT162b2.” the authors of the study said.\n\nIn the study, the authors do not draw conclusions as to the harmful effects of such a process but they do warn that is “may give rise to concern” to instances of “genotoxic side effects” and suggest further studies to rule out potentially carcinogenic or toxic effects.\n\n“Our study shows that BNT162b2 can be reverse transcribed to DNA in liver cell line Huh7, and this may give rise to the concern if BNT162b2-derived DNA may be integrated into the host genome and affect the integrity of genomic DNA, which may potentially mediate genotoxic side effects,” warned the researchers.\n\nThey continued, “At this stage, we do not know if DNA reverse transcribed from BNT162b2 is integrated into the cell genome. Further studies are needed to demonstrate the effect of BNT162b2 on genomic integrity, including whole genome sequencing of cells exposed to BNT162b2, as well as tissues from human subjects who received BNT162b2 vaccination.”\n\n“To better understand mechanisms underlying vaccine-related adverse effects, clinical investigations as well as cellular and molecular analyses are needed,” they added.\n\nBelow is a very informative video by Dr. Mobeen Syed (DrBeen), who explains the process more in depth.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "New Study Shows Pfizer mRNA Vaccine Becomes DNA in Just 6 Hours, In Vitro - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2022/03/14/new-study-shows-pfizer-mrna-vaccine-becomes-dna-in-just-6-hours-in-vitro/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2022-03-14T22:25:30+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2022/03/pfizerdna-1050x525-1.jpeg", "image:width": "1050", "image:height": "525", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "696", "height": "392", "embed_code": "<iframe title=\"Pfizer Vaccine Becomes DNA in Liver Cells. (In-vitro Swedish Study)\" width=\"696\" height=\"392\" src=\"https://www.youtube.com/embed/MjxlvduyJyc?feature=oembed&amp;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/MjxlvduyJyc?feature=oembed&enablejsapi=1"}], "links": ["https://www.reuters.com/article/factcheck-coronavirus-vaccines/fact-check-controversial-mit-study-does-not-show-that-mrna-vaccines-alter-dna-idUSL1N2PK1DC", "https://www.mdpi.com/1467-3045/44/3/73", "https://www.drbeen.com/", "https://thefreethoughtproject.com/new-study-pfizer-vaccine-integrate-dna-mrna/", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2022-03-14T22:25:30+00:00"}