{"result_id": "243004", "URL": "https://prepareforchange.net/2023/01/12/us-military-doctor-testifies-she-was-ordered-to-cover-up-vaccine-injuries/?utm_source=rss&utm_medium=rss&utm_campaign=us-military-doctor-testifies-she-was-ordered-to-cover-up-vaccine-injuries", "timestamp": "2023-04-25 16:49:49 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2023/01/12/us-military-doctor-testifies-she-was-ordered-to-cover-up-vaccine-injuries/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "US Military Doctor Testifies She Was Ordered To ‘Cover Up’ Vaccine Injuries", "cleaned_text": "Dr. Theresa Long (pictured), medical officer with the United States military, has testified in court that she was ordered by a superior to suppress Covid-19 vaccine injuries following the Biden regime’s mandate\n\nDr. Long also testified that the data shows that deaths of military members from the vaccines exceed deaths from COVID itself.\n\nDr. Theresa Long, a medical officer with the United States military, has testified in court that she was ordered by a superior to suppress Covid-19 vaccine injuries following the Biden regime’s mandate.\n\nThe DoD downplayed Dr. Long’s conclusions, saying the increase in vaccine injuries was caused by a “glitch in the database.”\n\nOn March 10, Liberty Counsel, the law firm representing thirty members of the military who are fighting the military vaccine mandate, returned to federal court to defend the preliminary injunction Judge Steven Merryday granted two military plaintiffs that allowed them to skirt the military vaccine mandate.\n\nThe Department of Defense (DoD) asked the judge to set aside the injunction while the case was on appeal.\n\nJudge Merryday is a United States District Judge of the United States District Court for the Middle District of Florida.\n\nPer DailyExpose: During the all-day hearing, Liberty Counsel presented compelling testimony from the Navy Commander of a surface warship and three military flight surgeons, Lt. Col. Peter Chambers, Lt. Col. Teresa Long and Col. (Ret.) Stewart Tankersley, M.D. In contrast, the DOD declined to present witnesses.\n\nFounder and Chairman of Liberty Counsel Mat Staver said in an interview with the Blaze’s Daniel Horowitz on Monday that there have been three hearings now in this case, and the DoD has not yet offered a single witness. Instead of witnesses, the government “sends these declarations,” Staver explained. He said the judge has urged them to bring live witnesses to court so they can be cross examined, but they just refuse to do it. “So they send these declarations that some JAG attorney writes, and somebody in the military signs off on them.”\n\nStaver said that the information the DoD has been presenting in court is “outdated, wrong, and would really be subject to dismantling under cross examination.” He added that cross examinations of his witnesses have only made their case stronger. “So they really don’t have anything to cross examine our witnesses with,” he said.\n\nStaver told Horowitz that Judge Merryday has chastised the DoD lawyers during the hearings, telling them they have “a frail case,” and are “acting as though they are above the law.”\n\nDr. Theresa Long, a flight surgeon who holds a master’s degree in Public Health and is specially trained in the DMED, gave emotional testimony on March 10.\n\nShe and two other flight surgeons reviewed DMED last year and made some stunning discoveries about the high incidence of apparent vaccine injuries among members of the military.\n\nAccording to the whistleblowers, certain disorders spiked after the vaccine mandate went into effect, including miscarriages and cancers, and neurological problems which increased by 1000 percent.\n\nDr. Long testified that she was contacted by high level officer the night before the hearing, and told not to discuss her findings regarding the explosive military medical data in court. The whistleblower reportedly said she felt threatened after she tried to get her superiors to address the findings, “fearing for her life and for the safety of her children.”\n\nSince the whistleblowers came forward with the DMED data, the DoD has thrown cold water on their conclusions, saying the increase in vaccine injuries was caused by a “glitch in the database.”\n\nPolitifact contacted Peter Graves, spokesperson for the Defense Health Agency’s Armed Forces Surveillance Division, who said the data for 2021 is correct, but for some reason, the data for the five years prior was inaccurate. Graves told PolitiFact by email that the division reviewed data in the DMED “and found that the data was incorrect for the years 2016-2020.”\n\nIn other words, for five straight years, the data was seriously corrupted and none of the DoD’s data analysts figured this out, and then it fixed itself on its own in 2021. The DoD has since put out new numbers showing more illnesses among the troops for the years prior to 2021.\n\nStaver asked Long a question about the DMED data during the hearing, and she answered: “I have been ordered not to answer that question.”\n\nJudge Merryday reportedly asked Long: “Ordered by who?,” and the doctor explained what happened the night before the hearing.\n\nStaver then asked Long if the information the military ordered her to withhold was relevant and helpful for the court and the public to know. She said, “yes,” and Staver asked her why.\n\nLong reportedly paused and choked back tears as she told the judge: “I have so many soldiers being destroyed by this vaccine. Not a single member of my senior command has discussed my concerns with me … I have nothing to gain and everything to lose by talking about it. I’m OK with that because I am watching people get absolutely destroyed.”\n\nDr. Long also testified that the data shows that deaths of military members from the vaccines exceed deaths from COVID itself.\n\nStaver later told Horowitz that the DoD’s order for her not to discuss DMED amounted to witness tampering, especially since Long has whistleblower protections.\n\n“They not only violated the Whistleblower Act, they potentially intimidated a witness and tried to change that witness’ testimony,” he said during the Conservative Review podcast on Monday.\n\nThe doctor said she is constantly contacted by people who have been injured by the genetic vaccines, and that many of those injured are pilots, who are expected to meet high fitness standards. Long told Staver that in just one afternoon she heard from four pilots who had just gotten MRIs back showing that they had myocarditis.\n\nMorale is tanking in the military, she testified, with soldiers are in despair over the pressure to get the vaccine, and some are even having suicidal thoughts.\n\nLong said she was aware of at least two people who have committed suicide over the pressure, and the threat of punishment for refusal.\n\nShe said the current regime’s policies are undermining “good order and discipline.”\n\nIn addition to Dr. Long, an unnamed Navy commander testified about his commander’s attempts to punish him for refusing the experimental injections.\n\nOn February 2, Judge Merryday issued a temporary restraining order blocking the Navy from punishing the Commander because of his vaccination status. Judge Merryday ruled the Navy violated the federal Religious Freedom Restoration Act (RFRA).\n\nWhen the court ordered the Commodore to comply with the law, he filed an affidavit saying he had “lost confidence” in the Commander because the Commander had not taken the COVID shots.\n\nThe judge then entered a preliminary injunction, and the DOD and the Navy filed a motion asking the court to set aside his injunction, arguing that due to their “lost confidence” in the commander, his ship could not deploy.\n\nHowever, at the time the ship was allegedly unable to be deployed, the commander was actually far out to sea testing the ship and training the crew.\n\nWhile many Commanders fail to complete these operations timely, the Commander completed the mission early and the ship deemed “safe and ready.”\n\nIn a dramatic moment, the Commander said he should not have to be there in court defending religious freedom. “Generals and admirals should be here saying what I am saying today to uphold religious freedom. Our religious freedoms are being attacked.”\n\nAlso testifying last week was Dr. Pete Chambers, a Purple Heart recipient who is in the Texas National Guard defending the southern border where 10,000-20,000 illegal immigrants are flooding through every week. “My job is to keep our soldiers safe,” Chambers said.\n\nChambers was hoping to retire from the military in 2023 after nearly 40 years of service, but his adverse reaction to the Moderna shot derailed his plans.\n\nSee more here substack.com\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "US Military Doctor Testifies She Was Ordered To ‘Cover Up’ Vaccine Injuries - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2023/01/12/us-military-doctor-testifies-she-was-ordered-to-cover-up-vaccine-injuries/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2023-01-12T16:00:48+00:00", "article:modified_time": "2023-01-13T03:28:16+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2023/01/FPqog-GWQAoi6Zp.jpeg", "image:width": "800", "image:height": "493", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://palexander.substack.com/p/us-military-doctor-testifies-she?utm_source=cross-post&publication_id=579356&post_id=51562932&isFreemail=true&utm_campaign=475124&utm_medium=email", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2023-01-12T16:00:48+00:00"}