{"result_id": "243008", "URL": "https://prepareforchange.net/2022/10/08/experts-estimate-20-million-are-already-dead-due-to-covid-vaccination-over-2-billion-injured/", "timestamp": "2023-04-25 16:49:58 CEST+0200", "meta": {"description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "lang": "en", "keywords": "", "favicon": "https://prepareforchange.net/wp-content/uploads/2021/03/favicon.png", "canonical": "https://prepareforchange.net/2022/10/08/experts-estimate-20-million-are-already-dead-due-to-covid-vaccination-over-2-billion-injured/", "encoding": "UTF-8"}, "image": null, "domain": "prepareforchange.net", "title": "Experts estimate 20 million are already dead due to COVID Vaccination & over 2 billion injured", "cleaned_text": "Peeling back the layers of deception and obfuscation reveals a shocking truth that may not be all that shocking to our informed readers: Covid-19 “vaccines” are injuring and killing far more people than the government is letting on.\n\nEstimates compiled from pieced-together data suggest that as many as 20 million people worldwide have died so far from the shots, while another 2.2 billion have suffered injuries – and we are only just getting started.\n\n“Add the EUDRA and VAERS adverse event data on deaths and “events” together, multiply by an under-reporting factor of 40, globalize the EU+US one-eighth share of 12.5 billion global doses.\n\nVAERS (take only the US data) 13,972 deaths and 854,084 adverse reactions to 5 August 2022\n\nEUDRA (ignore the headline and scoot to the first image on the landing page) 46,999 deaths and 4,731,833 injuries\n\n76,789 Deaths 6,089,773 Injuries Reported in U.S. and European Databases Following COVID-19 Vaccines – Vaccine Impact\n\nNumber of US injections = around 600m (increased to 608 million in the last few weeks)\n\nCDC COVID Data Tracker: Vaccinations in the US\n\nNumber of EU injections = around 900m (increased to 915 million in the last few weeks)\n\nNumber of global injections = around 12 billion (increased to 12.5 billion in the last few weeks)\n\nThe Lazarus Report showing less than one in 100 vaccination injuries are reported – see page 6 of 7 that states –\n\nUsing a one in 100 under-reporting factor (URF) would make the injections horribly deadly and injurious (1.4 million deaths and 85 million injuries for the 600 million doses administered).\n\nA more recent attempt at estimating the URF is around 40, here:\n\nand EU+US injuries = 854,084 + 6,089,773 = 6,943,857 (multiple per person, half of which are “serious”).\n\nMultiply by 40 for URF and then by 8 to “globalize”\n\nGlobal deaths are around 19.5 million SO FAR and global injuries are around 2.2 billion.\n\nIn the coming months and years, these figures will balloon even higher as lingering spike proteins progressively damage the bodies of the “fully vaccinated,” leaving them prone not only to every illness that comes along (autoimmune disease) but also to deadly clots (i.e., myocarditis and pericarditis).\n\nIt requires a bit of digging to come up with the aforementioned figures as governments work overtime to keep all pertinent data hidden, or at least confusing. The way post-injection injuries and deaths are calculated varies from country to country and even from municipality to municipality, making it difficult to come up with accurate numbers.\n\nThe safety and effectiveness claims for the shots are also highly skewed, one way being how “cases” of the Fauci Flu are determined. All throughout the alleged pandemic, illnesses and deaths were falsely attributed to the “virus” so that later the injections could be framed as the “cure.”\n\nIn 2020 before the official launch of the vaccines, the annualized rate of covid “cases” was around 70 million – and keep in mind that the official definition of a “case” is still just as murky today as it was at the beginning of the “pandemic”.\n\nFollowing the launch of Operation Warp Speed in the USA, the annualized number of Covid cases increased nearly fivefold to 330 million. The annualized mortality rate also increased from 1.7 million pre-Operation Warp Speed to 2.9 million post-Operation Warp Speed.\n\nThis is significant because it shows that the shots are not “saving lives” as is still being claimed. The opposite is actually true as many more people are getting sick and dying in the injection era.\n\n“Rather than a 95% (or 91% in the trials) reduction in cases and deaths, there has been a 370% INCREASE in the annualized case rate,” writes Peter Halligan on his Substack. “Annualized Deaths have INCREASED by 180%.”\n\nHalligan looked at data in the government’s Vaccine Adverse Event Reporting System (VAERS) to come up with the 20 million dead and 2.2 billion injured figures. Since VAERS only captures a very small percentage of actual vaccine-related adverse events, Halligan extrapolated true figure estimates using multiplication.\n\nThe “butcher’s bill from the battlefield,” as he calls it, points to these figures being far more accurate than anything the government or Big Pharma are admitting. And were these figures to spread widely across the population, there would surely be a whole lot of angry folks with a lot of questions for the powers that be.\n\nDisclaimer: We at Prepare for Change (PFC) bring you information that is not offered by the mainstream news, and therefore may seem controversial. The opinions, views, statements, and/or information we present are not necessarily promoted, endorsed, espoused, or agreed to by Prepare for Change, its leadership Council, members, those who work with PFC, or those who read its content. However, they are hopefully provocative. Please use discernment! Use logical thinking, your own intuition and your own connection with Source, Spirit and Natural Laws to help you determine what is true and what is not. By sharing information and seeding dialogue, it is our goal to raise consciousness and awareness of higher truths to free us from enslavement of the matrix in this material realm.", "opengraph": {"locale": "en_US", "type": "article", "title": "Experts estimate 20 million are already dead due to COVID Vaccination & over 2 billion injured - Prepare For Change", "description": "The “EVENT” is the moment of the “Compression Breakthrough” on earth. COBRA guides us to prepare for change, for the Event and disclosure.", "url": "https://prepareforchange.net/2022/10/08/experts-estimate-20-million-are-already-dead-due-to-covid-vaccination-over-2-billion-injured/", "site_name": "Prepare For Change", "article:publisher": "https://www.facebook.com/prepareforchangelosangeles/", "article:published_time": "2022-10-08T23:55:46+00:00", "image": "https://prepareforchange.net/wp-content/uploads/2022/10/AdobeStock_cemetary-570x416-1.jpeg", "image:width": "570", "image:height": "416", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://peterhalligan.substack.com/p/call-to-arms-the-spike-wars", "https://peterhalligan.substack.com/p/20-million-saved-or-20-million-killed", "https://peterhalligan.substack.com/p/call-to-arms-the-spike-wars", "https://expose-news.com/2022/10/01/20milllion-dead-covid-vaccination/", "https://prepareforchange.net/donations"], "authors": ["Edward Morgan"], "publish_date": "2022-10-08T23:55:46+00:00"}