{"result_id": "245037", "URL": "https://www.prevention.com/health/a34974536/pregnant-women-covid-19-vaccine/", "timestamp": "2023-04-25 16:53:09 CEST+0200", "meta": {"description": "Is the COVID-19 vaccine safe for pregnant women? Experts explain why recommendations have been confusing and whether or not pregnant women should be immunized.", "lang": "en", "keywords": "covid-19, covid-19 vaccine, pregnancy", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a34974536/pregnant-women-covid-19-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Here’s What Experts Want Pregnant Women to Know About the COVID-19 Vaccine", "cleaned_text": "Since the arrival of the COVID-19 vaccines, there’s been confusion around whether they’re safe for pregnant women, but now the CDC has issued a health advisory urging pregnant women to get vaccinated.\n\nEarly clinical trials of the vaccine did not include pregnant or breastfeeding women, making it difficult at the time to know for sure if it was safe for them to be immunized. However, since then, many pregnant women have gotten the COVID-19 vaccine and had no issues. That prompted the Centers for Disease Control and Prevention (CDC), American College of Obstetricians and Gynecologists (ACOG), and Society for Maternal-Fetal Medicine (SMFM) to recommend that women who are pregnant, breastfeeding, or trying to conceive get the COVID-19 vaccine.\n\nThis week, the CDC released even stronger messaging. The health advisory warned pregnant women of the serious consequences of not getting vaccinated against COVID-19. It recommends that pregnant people take “urgent action” to get vaccinated against the virus. The CDC points out that, as of September 27, there have been more than 125,000 laboratory-confirmed COVID-19 cases in pregnant people, leading to 22,000 hospitalizations and 161 deaths. In August alone, 22 pregnant people died of COVID-19.\n\nThe CDC says that data indicate that about 97% of pregnant people who are hospitalized (either for illness or to give birth) and who had a confirmed case of COVID-19 were unvaccinated.\n\nBut the CDC warns that the risk isn’t just to moms—babies can be affected as well, citing a higher risk of preterm birth and admission to the ICU. “Other adverse pregnancy outcomes, such as stillbirth, have been reported,” the CDC says.\n\nThe agency also shared this eye-opening data: As of September 18, just 31% of pregnant people were fully vaccinated against COVID-19 before or during their pregnancy.\n\nIf you’re pregnant, it’s understandable to question anything you put in your body during this time. But every major public health agency has recommended you get vaccinated against COVID-19, and there’s data to support those recommendations. Here’s everything you need to consider.\n\nHow does the COVID-19 vaccine work, again?\n\nBoth the Pfizer-BioNTech and Moderna vaccines use a type of technology called messenger RNA, or mRNA, which is genetic material from the virus, according to the CDC. (Note: It’s not the virus itself—just the genetic coding of the virus. The vaccine will not make you sick with COVID-19.)\n\nThe mRNA tells your body how to make a spike protein, which the novel coronavirus uses to latch onto human cells. When your body starts to pump out spike proteins, your system sees them as foreign and creates antibodies unique to the coronavirus. Your body eventually eliminates both the protein and the mRNA, but the antibodies stick around, providing you with protection from COVID-19 should you get infected in the future.\n\nThe single-dose Johnson & Johnson vaccine works by modifying an existing cold virus with the spike protein. (The resulting adenovirus doesn’t have the ability to reproduce in the human body, meaning it can’t cause COVID-19 or any other illnesses.) Similarly, the spike protein gene is eventually read by your cells, where it’s then copied into mRNA, prompting an immune response.\n\nWhat do public health organizations say about getting the COVID-19 vaccine when you’re pregnant or breastfeeding?\n\nHere’s why things have been confusing. When the vaccines first came out and there wasn’t a lot of data on them, the American College of Obstetricians and Gynecologists (ACOG) and the CDC said that pregnant and breastfeeding women should be able to get the COVID-19 vaccine, if they want it. But both organizations stop short of actually recommending that pregnant women get vaccinated. The World Health Organization (WHO) initially advised women against getting the vaccine. But in late January, the organization revised its recommendation, stating: “Based on what we know about this kind of vaccine, we don’t have any specific reason to believe there will be specific risks that would outweigh the benefits of vaccination for pregnant women.”\n\nBut, as more data was released, organizations shifted to recommend that pregnant people get the vaccine. In July, ACOG and SMFM released a statement urging pregnant women to get vaccinated. “The organizations’ recommendations in support of vaccination during pregnancy reflect evidence demonstrating the safe use of the COVID-19 vaccines during pregnancy from tens of thousands of reporting individuals over the last several months, as well as the current low vaccination rates and concerning increase in cases,” the statement reads.\n\nThe CDC also says this online: “Evidence about the safety and effectiveness of COVID-19 vaccination during pregnancy has been growing. These data suggest that the benefits of receiving a COVID-19 vaccine outweigh any known or potential risks of vaccination during pregnancy.”\n\nWhat does the latest research say about pregnant women and the COVID-19 vaccine?\n\nThere’s now a fair amount of data to support safety of the COVID-19 vaccine for pregnant women.\n\nTwo studies have shown no harmful effects of immunization. A New England Journal of Medicine study that was published in June analyzed data from three COVID-19 safety monitoring systems and did not find any safety concerns for pregnant people who were vaccinated or their babies. In addition, another study found that the mRNA COVID-19 vaccine does not increase the risk of miscarriage; this data is based on pregnant women enrolled in the CDC’s V-SAFE registry and vaccinated before 20 weeks of pregnancy.\n\nThere is some indication that pregnant or breastfeeding women may pass immunity on to their babies as well. A study published in the American Journal of Obstetrics & Gynecology analyzed data from 131 women of reproductive age who were vaccinated. That group included 84 pregnant women, 31 breastfeeding women, and 16 non-pregnant women. The researchers analyzed antibodies in their blood and breast milk (if they were breastfeeding) at baseline, two to six weeks after their second dose of the Moderna or Pfizer-BioNTech vaccine, and after delivery, if they were pregnant.\n\nThe researchers found that the antibodies produced by the vaccine in pregnant and breastfeeding women were “significantly higher” than those created after a COVID-19 infection during pregnancy. The antibodies from the vaccine were also discovered in umbilical cord blood and breast milk samples, suggesting these infection fighters could be passed on to babies.\n\n“The data further supports vaccination of pregnant woman as safe and effective,” says infectious disease expert Amesh A. Adalja, M.D., senior scholar at the Johns Hopkins Center for Health Security. “Getting vaccinated while pregnant is a crucial action to protect yourself and the developing fetus.”\n\nSo, is it safe for pregnant and breastfeeding women to get the COVID-19 vaccine?\n\nExperts agree that pregnant women should be vaccinated against COVID-19. “The data on the safety of this vaccine in pregnant women is very robust and reassuring,” Dr. Adalja says.\n\n“The data is quite clear that a lot of pregnant women are still avoiding the vaccine, but it’s terribly important that they get it,” says William Schaffner, M.D., an infectious disease specialist and professor at the Vanderbilt University School of Medicine. “It’s recommended, approved, and supported by organizations like ACOG, which is made up of doctors who are committed to safe pregnancies for both the mom and baby.”\n\nMichael Cackovic, M.D., a maternal fetal medicine physician at The Ohio State Wexner Medical Center, says he’s seen a dramatic uptick in intubated pregnant women since the Delta variant took hold in the U.S. “Last year, it was few and far between if we saw a pregnant woman who was intubated,” he says. “Now, we have four or five women who are intubated at the same time and, unfortunately, maternal deaths.”\n\nMany pregnant women with COVID-19 who are hospitalized are being delivered very early—sometimes as soon as 26 weeks, says Dr. Cackovic. “The best thing you can do for your family and your baby is to take care of yourself and that includes the vaccine,” he says.\n\nMeanwhile, Dr. Schaffner points out that the vaccination of pregnant women isn’t new—it’s already recommended that pregnant women get the flu and Tdap vaccines during pregnancy. “We now have a vast amount of data that say vaccines during pregnancy are safe,” he says.\n\nIn fact, the COVID-19 vaccine is considered safer for pregnant women than some other types of vaccines, Dr. Cackovic says. “The COVID-19 mRNA vaccine does not contain a live virus, and these types of vaccines are considered more compatible in pregnancy, as they work by inducing an immune response by the host,” he explains.\n\nBottom line: Pregnant women should talk to their doctor about the COVID-19 vaccine.\n\nDr. Schaffner says it’s “perfectly understandable” that pregnant women have concerns about getting vaccinated against COVID-19, but urges them to discuss them with their healthcare provider. “Please talk to your doctor,” he says. “It’s important.”\n\nAnd don’t wait too long to have that conversation: “Pregnant women should be vaccinated against COVID ASAP,” says Dr. Adalja.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Here’s What Experts Want Pregnant Women to Know About the COVID-19 Vaccine", "description": "The CDC has issued a health advisory urging pregnant women to get vaccinated.", "image": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1294483101.png?crop=1.00xw:0.754xh;0,0.0195xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a34974536/pregnant-women-covid-19-vaccine/", "article:section": "Health", "article:modified_time": "2021-11-02T01:27:37Z", "article:published_time": "2021-09-30T17:47:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "https://emergency.cdc.gov/han/2021/han00453.asp", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html", "https://www.acog.org/news/news-releases/2021/07/acog-smfm-recommend-covid-19-vaccination-for-pregnant-individuals", "https://www.acog.org/news/news-releases/2021/07/acog-smfm-recommend-covid-19-vaccination-for-pregnant-individuals", "https://emergency.cdc.gov/han/2021/han00453.asp", "https://www.prevention.com/health/a35002158/pfizer-vs-moderna-covid-19-vaccine-ingredients/", "https://www.prevention.com/health/a34881552/what-is-mrna-covid-19-vaccine-pfizer-moderna/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/mrna.html", "https://www.prevention.com/novel-coronavirus/", "https://www.prevention.com/health/a32957865/how-long-do-coronavirus-antibodies-last/", "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "https://www.jnj.com/our-company/simplifying-the-science-of-covid-19-how-adenovector-vaccines-work", "https://www.acog.org/en/clinical/clinical-guidance/practice-advisory/articles/2020/12/vaccinating-Pregnant-and-Lactating-Patients-Against-COVID-19", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html", "https://www.prevention.com/health/health-conditions/a25100637/flu-shot-pregnancy/", "https://www.who.int/publications/i/item/interim-recommendations-for-use-of-the-moderna-mrna-1273-vaccine-against-covid-19", "https://www.who.int/news-room/feature-stories/detail/the-moderna-covid-19-mrna-1273-vaccine-what-you-need-to-know", "https://www.acog.org/news/news-releases/2021/07/acog-smfm-recommend-covid-19-vaccination-for-pregnant-individuals", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html", "https://www.nejm.org/doi/full/10.1056/nejmoa2104983", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/monitoring-pregnant-people.html", "https://www.researchsquare.com/article/rs-798175/v1", "https://www.ajog.org/article/S0002-9378(21)00187-3/fulltext", "https://www.prevention.com/health/a35550071/delay-second-dose-covid-19-vaccine/", "https://www.jhsph.edu/faculty/directory/profile/3528/amesh-adalja", "https://www.vumc.org/health-policy/person/william-schaffner-md", "https://wexnermedical.osu.edu/find-a-doctor/michael-cackovic-md-46831", "https://www.prevention.com/health/a31286522/how-to-boost-immune-system/", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2021-09-30T17:47:00Z"}