{"result_id": "245032", "URL": "https://www.prevention.com/health/health-conditions/a37759046/how-effective-is-the-flu-vaccine/", "timestamp": "2023-04-25 16:52:57 CEST+0200", "meta": {"description": "Experts explain what they know about how well the flu shot may work, the reasons it's hard to know for sure, and why it's worth getting vaccinated.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/health-conditions/a37759046/how-effective-is-the-flu-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "How Effective Is the Flu Vaccine? Experts Explain What to Expect This Year", "cleaned_text": "Every fall, as Americans roll up their sleeves to get their annual , there’s a lingering question: How effective will the vaccine be ? The answer, according to experts, is we can’t exactly know—but even so, the vaccine is safe and it’s your best protection against becoming seriously ill with influenza.\n\nWhy does the effectiveness fluctuate each year?\n\nIf you look at the numbers for how effective the flu vaccine has been at protecting Americans from getting sick with the flu over the past few decades, there is a fairly wide range, from in 2014-15 to in 2010-11. (These numbers mean that, for instance, in 2010-11, 60 percent fewer healthy adults who were vaccinated got the flu compared with those who were unvaccinated.)\n\nWhy the discrepancy? It’s all a matter of methodically trying to predict the future, according to ., an influenza expert in the Infectious Diseases department at St. Jude Children's Research Hospital. He explains that the World Health Organization (WHO) has a network of around 148 labs in 120 countries, which collect specimens from people with flu-like symptoms over the course of their typical flu season. Then, they analyze the samples and crunch the data. “This group meets a couple of times of year and asks a pretty simple question: Looking at the vaccine strains that we have now, how closely do those match the strains that we think are going to predominate in six months’ time?” he explains.\n\nArmed with that information, each country produces the vaccines they think will be best for their population. In the U.S., all vaccines this year are quadrivalent , meaning they protect against four different strains of the flu, two types of influenza A and two of influenza B, explains , a family doctor with Cooperative Health in Columbia, SC, and chairman of the board of the American Academy of Family Physicians. When that match is good, it reduces the risk of illness for healthy adults somewhere between according to the CDC.\n\nBut sometimes, as we have recently found with COVID, new strains can take us by surprise. “When we’re designing the vaccines, the flu may still be out in another hemisphere, and when it comes back, it may have gone in a slightly different direction than was anticipated, so we don't get that perfect match between what's in the vaccine and the circulating strains,” Dr. Webby explains.\n\nWhat will happen this year?\n\nLast year, thanks to all the hand-washing, social-distancing, and mask-wearing, we had one of the . There were dramatically fewer illnesses, hospitalizations, and deaths (about died from the flu, compared with 22,000 the year before). “I can tell you that as a practicing family physician, I had zero positive flu tests last year,” says Dr. Stewart. In addition to all the safety precautions and lockdowns from the COVID pandemic, there was also a of flu vaccines distributed last season (around 55 percent of adults got the flu shot, compared with 48 percent the previous year).\n\nThis was great news for last year, but it has mixed meaning for this year. While Americans are certainly more used to staying home and staying safe when they feel sick, the minimal flu season last year means that researchers had less data to use to create this year’s flu vaccine. “We have almost 100-fold less virologic information than we have had in the past, so with that there is a little bit more uncertainty,” says Dr. Webby.\n\nEven so, both Dr. Webby and Dr. Stewart urge everyone to get the flu shot: “As we have seen with the COVID vaccine, even if the flu shot doesn’t keep you from getting infected, it certainly decreases your risk of getting severely sick,” says Dr. Webby. And Dr. Stewart adds that even if the flu shot is only 50 percent effective, “that 50 percent is really important, because the flu can kill!” she says. “It can lead to serious illness, especially our vulnerable populations, such as those who are over age 65 or have a history of asthma or COPD, or children under two.”\n\nAnd again, as we have seen with the COVID vaccine, the flu shot can dial down a deadly illness requiring hospitalization to a mild case that can be treated at home. Though the studies range by year, the risk of landing in the ICU with influenza drops anywhere from 26 to 82 percent if you’re vaccinated. A reported that there was a 31 percent reduced risk of death compared with those who were unvaccinated. And even if you are one of the unlucky few who get vaccinated and still land in the ICU, your stay will be shorter. A found that among those admitted to the ICU with flu, vaccinated patients spend 4 fewer days there than the unvaccinated.\n\nWhen you add up the numbers, the flu vaccine is estimated to of flu illnesses, medical visits, and hospitalizations each year—and in a year when hospitals have been overwhelmed with COVID-19 patients, that frees up a lot of resources.\n\nWhy the shot matters, especially this year\n\nFinally, in a year when we are still reeling from the effects of that other highly contagious virus, Dr. Webby urges people who are hesitant to get the flu vaccine to consider their community: “We anticipate that taking the flu vaccine will lower your infectiousness for others as well,” he explains. “So just by taking the flu vaccine you're reducing the likelihood that you'll transmit the virus to someone else, whether you're in a household with someone who's more susceptible to the severe end of the disease spectrum or even just in general to the rest of the population.”\n\nOne last reason to get your flu shot, no matter how effective it may be this year? This year’s flu season may pack an extra punch, says Dr. Webby. “Because we’ve had two seasons of pretty low flu activity here, there is a possibility that as a population, our immunity levels to the flu are lower.” During a typical flu season, upwards of 80 percent of the population is exposed to flu, which helps boost their immunity, he explains. Since we skipped that step last year, “it’s possible that when the flu does come back, it will come with a little bit more heat.”\n\nIf you’re still waiting to get your COVID-19 vaccine—or are considering getting a booster— there’s no need to space out the two shots , says Dr. Stewart. You can even get them in the same appointment. “It’s so important to get both shots,” she says, “because we know flu and COVID can exist together. if you have questions regarding either of the vaccines, talk to your physician—they are a trusted source of information and we have to continue to do what we can to keep our communities healthy.”", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "How Effective Is the Flu Vaccine? Experts Explain What to Expect This Year", "description": "The answer is complicated—but you should get it anyway.", "image": "https://hips.hearstapps.com/hmg-prod/images/flu-shot-in-arm-1632764981.jpg?crop=1.00xw:0.751xh;0,0.158xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/health-conditions/a37759046/how-effective-is-the-flu-vaccine/", "article:section": "Health Conditions", "article:modified_time": "2021-10-04T17:56:37Z", "article:published_time": "2021-10-01T20:30:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a37576226/flu-shot-vaccine-ingredients-2021/", "https://www.prevention.com/health/a37691886/when-is-flu-season/", "https://www.cdc.gov/flu/vaccines-work/past-seasons-estimates.html", "https://www.cdc.gov/flu/vaccines-work/past-seasons-estimates.html", "https://app.qwoted.com/sources/richard-webby-phd", "https://www.cdc.gov/flu/season/faq-flu-season-2021-2022.htm", "https://www.aafp.org/about/meet-our-leadership/board/stewart.html", "https://www.cdc.gov/flu/vaccines-work/vaccineeffect.htm", "https://www.prevention.com/health/health-conditions/a37417888/covid-19-cold-flu/", "https://www.scientificamerican.com/article/flu-has-disappeared-worldwide-during-the-covid-pandemic1/", "https://www.cdc.gov/flu/season/faq-flu-season-2020-2021.htm", "https://www.sciencedirect.com/science/article/pii/S0264410X21005624?dgcid=author", "https://www.sciencedirect.com/science/article/pii/S0264410X18309976?via%3Dihub", "https://www.cdc.gov/flu/vaccines-work/vaccineeffect.htm", "https://www.prevention.com/health/a35644466/covid-19-vaccine-booster-shot/", "https://www.prevention.com/health/a37375072/flu-shot-covid-booster-vaccine-together/", "/author/223801/marisa-cohen/"], "authors": [], "publish_date": "2021-10-01T20:30:00Z"}