{"result_id": "245005", "URL": "https://www.prevention.com/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "timestamp": "2023-04-25 16:52:06 CEST+0200", "meta": {"description": "The CDC now says you can “mix and match” your booster shot. Doctors explain the science of mixed immunity and what it might mean for Omicron.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Should You Mix and Match Your COVID-19 Booster Shot? Doctors Explain", "cleaned_text": "When the Centers for Disease Control and Prevention (CDC) and the United States Food and Drug Administration (FDA) approved for the majority of the country last month, they allowed adults to “ ” booster shots for any of the three available vaccines: mRNA options Pfizer and Moderna and adenovirus option .\n\nHowever, neither agency offered guidance on which vaccine to choose depending on your situation. All of the options protect you against SARS-CoV-2, the virus that causes COVID-19. But why is it possible to mix and match your COVID-19 vaccine booster? And is it better to go with a different option for your next dose? Here’s everything you need to know about boosters and mixed immunity, according to doctors.\n\nFirst, why are booster shots recommended?\n\n“The immune response to all vaccines decreases over time,” explains , M.P.H., associate professor in the department of medicine at the University of Washington and associate medical director of the UW Virology Research Clinic. “Additional doses of COVID-19 vaccines will serve as a reminder to the immune system and will help further develop the immunologic memory, potentially for longer-lasting immunity.”\n\nIf you’re 18 or older and at least two months have passed since your dose of Johnson & Johnson or six months have passed since your final shot of Pfizer or Moderna, the CDC that you receive a booster.\n\nIt’s pretty common for vaccines to require booster doses, Dr. Johnston notes. For example, the requires an annual booster to protect against the latest strains of influenza. On the other end of the scale, adults should receive a tetanus vaccine booster every decade, the CDC .\n\nHowever, the presence of booster doses doesn’t mean that the vaccines don’t work. “We know that the full doses of the [COVID-19] vaccines are incredibly effective at preventing severe disease, hospitalizations, and deaths in almost everybody,” explains , an infectious disease doctor, vaccine researcher, and assistant professor in the department of International Health at Johns Hopkins University.\n\nShould you mix and match your booster shot?\n\n“In general, boosters do improve the immune response, no matter what booster you get,” Dr. Talaat says. But people who receive an adenovector vaccine, such as Johnson & Johnson in the United States or elsewhere, get the most substantial response when they receive an mRNA vaccine, like Pfizer or Moderna, as their booster, she notes.\n\n“Probably, it is going to be more or less the same, except for Johnson & Johnson” as your initial vaccine, explains , professor of medicine at the Johns Hopkins University School of Medicine. “In that case, you want the booster to be mRNA.”\n\n“Personally, I received the same vaccine platform for the booster: Moderna and Moderna,” Dr. Johnston says. “If you received either Pfizer or Moderna initially, I would be happy sticking with the original vaccine. If you received Johnson & Johnson, you may consider doing an mRNA boost, based on the higher antibody levels that were seen in the clinical trials.”\n\n“Some people may have other reasons for choosing one regimen over another, for instance, if people are more concerned about the very rare side effects of the vaccines,” Dr. Johnston continues, “such as for the mRNA vaccines or with the Johnson & Johnson vaccine.” However, it’s important to note that side effects beyond mild flu-like symptoms are extremely uncommon, and getting vaccinated far outweighs the repercussions of contracting COVID-19.\n\nBut it’s unclear so far how the vaccines stack up against the emerging . “We know almost nothing about Omicron,” Dr. Talaat says. “It is possible that boosters will be necessary to help protect against infections with this variant. We just don’t know because we don’t have that data yet.”\n\nWhy can you mix and match vaccines?\n\nThe CDC and the FDA both explain that mix-and-match boosting is perfectly safe (and practical, given that your local pharmacy’s supply might now vary from what it offered six months ago). “You may choose which COVID-19 vaccine you receive as a booster shot,” the CDC . “Some people may prefer the vaccine type that they originally received, and others may prefer to get a different booster.”\n\nThis option is supported by a conducted by the National Institutes of Health (NIH), which tracked people’s antibody responses to multiple combinations of vaccines and boosters. (Dr. Johnston is an investigator on this study.) In short, it found that boosting with any of the authorized vaccines increased the level of antibodies in the blood. Other studies from the and have reported similar results.\n\nHowever, the NIH study also discovered that people who first received an mRNA vaccine had similar antibody production with any booster, while people who first received Johnson & Johnson produced more antibodies with mRNA boosters than a second round of Johnson & Johnson. “Whether this correlates with decreased protection from severe disease is not known,” Dr. Johnston says.\n\nAs for those that think mixing and matching booster shots will give them a leg up on protecting themselves against the virus, well there just might be some science there to back that up—but it's still unclear. “Theoretically, boosting with a different vaccine could produce a broader immune response by stimulating different parts of the immune system,” Dr. Johnston says. “We don’t have evidence of this yet.”\n\nBut above all else, the best way to keep yourself safe is to get vaccinated in the first place. “The most important thing is to get your first series of vaccines,” Dr. Talaat says. “If you haven’t already been vaccinated, this is a really good time to get vaccinated, because is about to surge again. We don’t know what’s going to happen with , and the best way to protect yourself and the people you love around you is to get vaccinated.”", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Should You Mix and Match Your COVID-19 Booster Shot? Doctors Explain", "description": "You can choose to get a different booster—but should you?", "image": "https://hips.hearstapps.com/hmg-prod/images/vials-of-different-tests-of-the-covid-19-vaccine-on-royalty-free-image-1638806820.jpg?crop=0.779xw:0.590xh;0.221xw,0.279xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "article:section": "Health Conditions", "article:modified_time": "2021-12-06T17:19:23Z", "article:published_time": "2021-12-06T17:19:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a35644466/covid-19-vaccine-booster-shot/", "https://www.prevention.com/health/a38002403/covid-fda-mix-and-match-booster-shots/", "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "https://www.prevention.com/health/health-conditions/a37990233/cdc-holiday-guidelines-2021-covid/", "https://aid.uw.edu/faculty/christine-m-johnston-md-mph", "/health/a35644466/covid-19-vaccine-booster-shot/", "/health/health-conditions/a38370247/what-is-omicron-covid-19-variant/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "https://www.prevention.com/health/health-conditions/a25050076/flu-shot-side-effects/", "https://www.cdc.gov/vaccines/adults/rec-vac/index.html", "https://www.hopkinsmedicine.org/profiles/details/kawsar-talaat", "https://www.prevention.com/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "https://www.hopkinsmedicine.org/profiles/details/david-thomas", "https://www.prevention.com/health/a34833921/coronavirus-covid-19-vaccine-side-effects/", "https://www.prevention.com/health/a36520126/myocarditis-heart-inflammation-covid-19-vaccine/", "https://www.prevention.com/health/a36107150/johnson-and-johnson-covid-vaccine-blood-clots/", "https://www.prevention.com/health/a37791734/covid-19-booster-shot-side-effects/", "https://www.prevention.com/health/health-conditions/a38370247/what-is-omicron-covid-19-variant/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "/health/a38400888/omicron-vs-delta-covid-19-variant-comparison/", "/health/health-conditions/a37990233/cdc-holiday-guidelines-2021-covid/", "https://www.medrxiv.org/content/10.1101/2021.10.10.21264827v1.full.pdf", "https://www.ox.ac.uk/news/2021-06-28-mixed-oxfordpfizer-vaccine-schedules-generate-robust-immune-response-against-covid", "https://go.redirectingat.com/?id=74968X1576256&url=https%3A%2F%2Fwww.nature.com%2Farticles%2Fd41586-021-01359-3", "https://www.prevention.com/health/a31286522/how-to-boost-immune-system/", "https://www.prevention.com/health/a37200110/how-contagious-is-delta-variant-covid-19/", "https://www.prevention.com/health/a38400888/omicron-vs-delta-covid-19-variant-comparison/", "/author/224791/jake-smith/"], "authors": [], "publish_date": "2021-12-06T17:19:00Z"}