{"result_id": "245025", "URL": "https://www.prevention.com/health/a40730959/who-is-eligible-monkeypox-vaccine-requirements/", "timestamp": "2023-04-25 16:52:50 CEST+0200", "meta": {"description": "The requirements for the monkeypox vaccine are a little strict right now. Infectious disease experts break the eligibility all down.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a40730959/who-is-eligible-monkeypox-vaccine-requirements/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Who Is Eligible for the Monkeypox Vaccine? What You Need to Know", "cleaned_text": "Monkeypox cases continue to jump up in the U.S., as public health experts warn that it’s important to control the virus.\n\nAnthony Fauci, M.D., director of the National Institute of Allergy and Infectious Diseases, told NPR this week that, while 99% of cases of the virus have been in men who have sex with men, children and pregnant women are also at risk of contracting monkeypox. “There’s really a profound risk,” he said, noting that two children in the U.S. have been diagnosed with monkeypox so far. To date, there have been more than 3,500 monkeypox cases diagnosed in the U.S., according to data from the Centers for Disease Control and Prevention (CDC) in July 2022, and the case counts keep rising.\n\nThe World Health Organization (WHO) has also declared monkeypox a “public health emergency of international concern.”\n\nAll of this raises a huge question: Who is eligible for the monkeypox vaccine and what requirements are in place to get vaccinated against monkeypox? Here’s what you need to know.\n\nWho is eligible for the monkeypox vaccine?\n\nIt’s slightly little complicated. The CDC currently recommends that people whose jobs may expose them to orthopoxviruses like monkeypox get vaccinated to protect them in case of an exposure.\n\nBeyond that, the CDC says that people can be vaccinated after they’re exposed to monkeypox “to help prevent illness from monkeypox virus.” The organization adds, “It is important that states and other jurisdictions identify contacts of confirmed or probable monkeypox cases to offer vaccine for post-exposure prophylaxis and to monitor for any early signs of illness.”\n\nBut individual state health departments are making decisions about how the vaccine they have will be distributed, and some are giving people the monkeypox vaccine before an exposure. The North Carolina Department of Health and Humans Services, for example, recently expanded eligibility for the monkeypox vaccine to state residents to include gay or bisexual men or transgender individuals who have had multiple sex partners or anonymous sex, have been diagnosed diagnosed with an STI, or are receiving medications to prevent HIV infection over the past 90 days.\n\nIn New York state, vaccines are being distributed to people with an exposure to monkeypox over the past 14 days, men who have sex with men who have engaged in “intimate contact” with others in the past 14 days in areas where monkeypox is spreading, and people who have had skin-to-skin contact with someone in a social network that’s experiencing monkeypox activity, like people who meet partners through websites, apps, or at social events like bars or parties.\n\n“The monkeypox outbreak is a rapidly evolving situation,” explains Richard Watkins, M.D., an infectious disease physician and professor of medicine at the Northeast Ohio Medical University. “The CDC is probably wary about potential missteps, given what has happened with COVID-19, and is being cautious with its recommendations.”\n\nWilliam Schaffner, M.D., an infectious disease specialist and professor at the Vanderbilt University School of Medicine, admits that the guidance is “a tad confusing.”\n\n“There’s a limited amount of the vaccine,” he points out. In general, though, “individuals should be vaccinated if they’ve been in close contact with a monkeypox patient who was contagious at the time and those men who have sex with men who engage in intimate skin-to-skin contact with others in communities in which the virus is spreading,” says infectious disease expert Amesh A. Adalja, M.D., a senior scholar at the Johns Hopkins Center for Health Security.\n\nBut Perry N. Halkitis, Ph.D., M.P.H., dean of the Rutgers School of Public Health says that the recommendations around the monkeypox vaccine can be \"very broad,\" \"not overly specified,\" and \"seem to assume that only people who have sex can contract monkeypox.\" He notes that the recommendations are \"being redefined as we speak,\" adding that they often \"fail to recognize that monkeypox can affect everyone, even those who are not having sex.\"\n\nWhy are the requirements for the monkeypox vaccine so specific?\n\nIt has to do with supply and demand. “Most vaccines—virtually all of them—are given before you’re exposed in order to prevent an illness,” Dr. Schaffner says. “But this is a vaccine that can be given post-exposure. Because it’s available in such limited quantities, this is how it’s being used now.”\n\nDr. Schaffner says he expect the vaccine to only be available “in a controlled fashion for some time to come” because there’s only one small company in Denmark that makes it. “Now, many countries around the world are dealing with monkeypox and they all want the vaccine,” he says. “The company has a limited capacity and the global market for this used to be very limited.”\n\nWhat is the monkeypox vaccine again?\n\nThere are two monkeypox vaccines licensed for use in the U.S.—ACAM200 and JYNNEOS (which also go under the names Imvamune or Imvanex). They’re licensed to prevent smallpox but also work to prevent monkeypox, per the CDC. However, JYNNEOS is the preferred vaccine and the one that public health officials are focusing on, Dr. Schaffner says.\n\nThe reason? ACAM2000 is a little more complicated. ACAM2000 is given as a live virus preparation that’s administered by pricking the skin surface, per the CDC. Then, a lesion called a “take” will develop at the site of the vaccination. The virus that grows at the site of the lesion can be spread to other parts of the body or even to other people, making ACAM2000 a little risky to use. People who receive this vaccine have to take special precautions to avoid spreading the virus to themselves and others, but they’re considered fully vaccinated after 28 days.\n\nJYNNEOS is also a live virus vaccine but it can’t spread or make you sick. It’s given as two injections four weeks apart and there’s no visible “take,” per the CDC. People who get the JYNNEOS vaccine are considered fully vaccinated two weeks after they get the second dose of the vaccine, the CDC says.\n\nHow to get the monkeypox vaccine\n\nIf you meet the criteria for the monkeypox vaccine in your state, Dr. Adalja says you can contact your primary care physician or local health department for help. They should be able to guide you on where to go to get vaccinated.\n\n“Because of the nature of monkeypox and the unique characteristics of this outbreak targeting the vaccine only to high-risk individuals is appropriate,” he says.\n\nThis article is accurate as of press time. However, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC and WHO to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Who Is Eligible for the Monkeypox Vaccine? What You Need to Know", "description": "The requirements are a little strict right now.", "image": "https://hips.hearstapps.com/hmg-prod/images/monkeypox-virus-royalty-free-image-1658933487.jpg?crop=1xw:0.88889xh;center,top&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a40730959/who-is-eligible-monkeypox-vaccine-requirements/", "article:section": "Health", "article:modified_time": "2022-07-27T19:25:30Z", "article:published_time": "2022-07-27T19:25:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/monkeypox/", "https://www.npr.org/transcripts/1113810513", "https://www.cdc.gov/poxvirus/monkeypox/response/2022/us-map.html", "https://www.who.int/europe/news/item/23-07-2022-who-director-general-declares-the-ongoing-monkeypox-outbreak-a-public-health-event-of-international-concern", "https://www.cdc.gov/poxvirus/monkeypox/clinicians/smallpox-vaccine.html", "https://www.cdc.gov/poxvirus/monkeypox/considerations-for-monkeypox-vaccination.html", "https://www.ncdhhs.gov/news/press-releases/2022/07/25/ncdhhs-again-expands-eligibility-monkeypox-vaccination-encourages-steps-reduce-spread", "https://www.health.ny.gov/diseases/communicable/zoonoses/monkeypox/vaccine.htm", "/health/a40589298/how-to-get-tested-for-monkeypox/", "/health/a37066284/what-is-monkeypox-virus/", "https://www.cdc.gov/poxvirus/monkeypox/clinicians/smallpox-vaccine.html", "https://www.cdc.gov/poxvirus/monkeypox/index.html", "https://www.who.int/news-room/questions-and-answers/item/monkeypox", "/health/health-conditions/a40104567/how-does-monkeypox-spread/", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-07-27T19:25:00Z"}