{"result_id": "245034", "URL": "https://www.prevention.com/health/a40311432/fda-covid-vaccines-children-under-5/", "timestamp": "2023-04-25 16:53:02 CEST+0200", "meta": {"description": "The FDA has recommended COVID-19 vaccines for children under the age of five. Here's what doctors have to say about this move, plus who should get it.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a40311432/fda-covid-vaccines-children-under-5/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "FDA Now Recommends COVID-19 Vaccines for Children Under 5", "cleaned_text": "The COVID-19 vaccine is expected to finally become available for children as young as six months as early as next week after an advisory panel to the Food and Drug Administration (FDA) recommended the shot for this age group. From here, the data for the Pfizer-BioNTech and Moderna vaccines will go to the Centers for Disease Control and Prevention (CDC), which is expected to sign off on the vaccine for this age group.\n\nThe committee’s 21-0 vote was reached after a review of clinical trial data and suggests that children under five—the only age group in the U.S. who has not yet had access to COVID-19 vaccines—will soon be able to get vaccinated.\n\nDuring the meeting, several experts spoke out about the need for the vaccine. “We have to be careful that we don’t become numb to the number of pediatric deaths because of the overwhelming number of older deaths here,” said Peter Marks, M.D., Ph.D., director of the Center for Biologics Evaluation and Research at the FDA said. “The intervention we’re talking about here is one that is something that we have accepted in the past to try to prevent deaths from influenza.”\n\n“There are so many parents who are absolutely desperate to get this vaccine,” said Jay Portnoy, M.D., a professor of pediatrics at the University of Missouri-Kansas City medical school said. “I think we owe it to them to give them the choice.”\n\nExperts also pointed out that young children were hospitalized at a higher rate than teens and older children during the Omicron wave, and that they tended to have at least as severe illness as their older counterparts. More than half of children hospitalized with COVID-19 also had no underlying medical conditions, they said, noting that CDC estimates show that more than 200 children in this age group have died.\n\nIf you’re a parent to children in this age group or have loved ones in the under-five category, it’s understandable to have questions. Here’s what you need to know.\n\nWhat does the data show about the COVID-19 vaccine for children under five?\n\nBoth the Pfizer-BioNTech and Moderna vaccines have been given the thumbs up from the FDA, but each has its own set of data.\n\nPfizer’s shot will be a three-dose regimen in children, with a 3-microgram dose of the vaccine for each. The vaccine was found to be 80.3% effective at preventing COVID-19 during the Omicron wave, according to Pfizer. Worth noting: The estimate was based on a small number of cases, and FDA officials pointed out that it’s difficult to know how protective the vaccine is in the real world.\n\nModerna’s vaccine is a two-dose regimen with a higher dosage—25 micrograms. According to Moderna, its vaccine is 51% effective at preventing COVID-19 in children aged six months to under two years, and 37% effective in those two to under six.\n\nHow are the shots given?\n\nChildren who get the Pfizer vaccine will receive two doses three weeks apart, along with a third dose given at least two months later.\n\nThe Moderna vaccine is given in two doses spaced four weeks apart.\n\nWhat do doctors think, and is it dangerous?\n\nNo shocker here: Doctors are overwhelmingly in favor of children under five receiving the COVID-19 vaccine.\n\n“It’s long overdue,” says Juan Salazar, M.D., M.P.H. a pediatric infectious disease specialist and physician in chief at Connecticut Children's. “Parents have been asking for this —I’ve gotten a lot of calls over the last six months about why this is taking so long.” Dr. Salazar says he’s “encouraging” the vaccine for patients.\n\n“I think we have become numb to the numbers, thinking that they somehow translates into ‘This is a very mild illness that doesn’t affect children’—that’s not true,” Dr. Salazar says. “For any other disease, we would be panicking.”\n\nThomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo in New York, points out that “the safety signals look good” and “the benefits far outweigh the risks,” when it comes to vaccinating children under five. “I don't have any children in this age group but I would not hesitate to give them the vaccine if I did,” he says.\n\nDanelle Fisher, M.D., a pediatrician and Chair of Pediatrics at Providence Saint John’s Health Center in Santa Monica, Calif., says she’s been talking about this to all families who have a child up to age four. “Those younger than six months are going to be six months at some point,” she says. “We’re excited that there's going to be some protection.”\n\nDr. Fisher says that there are “a lot of families who are excited and a lot who are skeptical\" among her patients. “Any protection is good protection,” she says. “If you have some protection and you still get COVID, you are likely to get a lesser course of disease. That’s why it’s really important to consider this vaccine for every child.”\n\n\n\nAmesh A. Adalja, M.D., a senior scholar at the Johns Hopkins Center for Health Security, says that “every child should get this,” noting that it can be scheduled around other pediatric vaccinations if parents prefer. But he’s not hopeful a lot of younger children will get the vaccine. “I don’t expect to see much uptake of this vaccine in the under-five group because there’s not much uptake in the five to 11 group,” he says.\n\nDr. Salazar urges parents to consider giving their children under five the COVID-19 vaccine. “Anything parents can do to prevent this is important,” Dr. Salazar says. “These vaccines will prevent severe disease, death, and MIS-C. It’s no different than preventing measles and chicken pox, and those diseases are much more rare.”\n\nIt’s also crucial for parents to at least have the choice, Dr. Adalja says. “It is an important option to have and having the entire population eligible for vaccination makes COVID-19 a much more manageable infection,” he says.\n\nAnd, if you have questions about the vaccine for your child, Dr. Fisher recommends talking to your pediatrician. “We understand this is new, and these little ones are little,” she says. “You can also get it with other routine immunizations. If you want to get it all at the same time, that’s totally fine. If you want to stagger it, that’s fine, too. I just wouldn’t wait too long because there's a lot of COVID going around.”\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "FDA Now Recommends COVID-19 Vaccines for Children Under 5", "description": "Here’s what doctors have to say about the move.", "image": "https://hips.hearstapps.com/hmg-prod/images/little-patient-in-face-mask-receiving-coronavirus-royalty-free-image-1655393989.jpg?crop=1.00xw:0.752xh;0,0&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a40311432/fda-covid-vaccines-children-under-5/", "article:section": "Health", "article:modified_time": "2022-06-16T21:17:21Z", "article:published_time": "2022-06-16T21:07:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/novel-coronavirus/", "https://www.fda.gov/advisory-committees/advisory-committee-calendar/vaccines-and-related-biological-products-advisory-committee-june-14-15-2022-meeting-announcement", "/health/g38819435/best-kn95-n95-masks/", "https://covid.cdc.gov/covid-data-tracker/#demographics", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-biontech-covid-19-vaccine-demonstrates-strong-immune", "https://investors.modernatx.com/news/news-details/2022/Moderna-Files-for-Authorization-of-Its-COVID-19-Vaccine-in-Young-Children-Six-Months-to-Under-Six-Years-of-Age/default.aspx", "https://www.providence.org/doctors/profile/200515-danelle-mara-fisher,", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/health/health-conditions/a40179304/omicron-ba-4-ba-5-new-variants-covid-19/", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-06-16T21:07:00Z"}