{"result_id": "245035", "URL": "https://www.prevention.com/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "timestamp": "2023-04-25 16:53:05 CEST+0200", "meta": {"description": "Here’s how AstraZeneca’s COVID-19 vaccine compares to its U.S. counterparts—and how it’s holding up against the Omicron variant.", "lang": "en", "keywords": "Most Popular", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Here’s How the AstraZeneca COVID-19 Vaccine Compares to Those Available in the U.S.", "cleaned_text": "In the fight against the novel coronavirus, the COVID-19 vaccines have emerged as the most important method to keep yourself and your loved ones safe. In the United States, three options are available so far.\n\nPfizer’s and Moderna’s vaccines (marketed as Comirnaty and Spikevax, respectively) have received full approval from the Food and Drug Administration (FDA). Johnson & Johnson’s option has emergency use authorization, but the Centers for Disease Control and Prevention (CDC) recommends receiving the other two options in most cases. As of May 5, 2022, the FDA limited the use of Johnson & Johnson vaccines due to worrying side effects: After conducting an updated analysis, evaluation and investigation of reported cases, the FDA has determined that the risk of thrombosis with thrombocytopenia syndrome (TTS), a syndrome of rare and potentially life-threatening blood clots in combination with low levels of blood platelets with onset of symptoms approximately one to two weeks following administration of the Janssen COVID-19 Vaccine, warrants limiting the authorized use of the vaccine.\n\nBut another COVID-19 vaccine, developed by AstraZeneca and the University of Oxford and marketed as Vaxzevria, is being used throughout much of the rest of the world, bolstering the global immunization effort. First approved in the United Kingdom in late 2020, it received World Health Organization (WHO) approval in February 2021. Over of the vaccine have now been distributed to more than 170 countries throughout the world so far, per the company.\n\nAlthough the vaccine hasn’t been authorized for use in the United States yet, it could one day reach arms domestically. Here’s what we know about it so far, and how it stacks up against Pfizer’s, Moderna’s, and vaccines.\n\nVaxzevria uses adenovirus-vectored technology, a harmless, modified version of a that usually spreads among chimpanzees. The primary series of Vaxzevria consists of spaced eight to 12 weeks apart.\n\nThis altered virus can’t make you sick, but it carries a gene from the novel coronavirus’ spike protein, the portion of the virus that triggers an . This allows the immune system to manufacture antibodies that work against SARS-CoV-2, the virus that causes COVID-19, teaching your body how to respond should you become infected.\n\n“It’s used as a Trojan Horse,” says , an infectious disease expert at Johns Hopkins Medicine. “The beauty of this is that the genetic material of the spike protein is coming into the body like it would if it were part of the SARS-CoV-2 virus, but you don’t have any of the dangers of [catching] the virus.”\n\nThe reason researchers chose a chimpanzee adenovirus is simple: The modified virus needs to be new to the people being vaccinated—otherwise, your body won’t create those all-important, unique antibodies. Johnson & Johnson’s vaccine also relies on similar adenovirus-vectored tech, although only one shot is necessary (boosters aside).\n\nThe Pfizer-BioNTech and Moderna vaccines, meanwhile, rely on , which essentially introduces a piece of genetic code that tricks the body into producing COVID-19 antibodies, no virus required. Both of these vaccines require two shots spaced about a month apart.\n\nHow does AstraZeneca’s vaccine compare to Pfizer’s, Moderna’s, and Johnson & Johnson’s?\n\nBefore variants took over, all four vaccines showed strong efficacy against serious COVID-19, preventing outcomes like hospitalization and death. Against mild illness, (Pfizer) and (Moderna) performed the best, followed by , then Johnson & Johnson’s vaccine. (The annual is usually between ; all four COVID-19 vaccines outperformed it.)\n\nThe , a mutated form of SARS-CoV-2 that appears to be less susceptible to the vaccines, is now causing most cases of COVID-19 throughout the world. A third dose of Vaxzevria administered as a booster offers “increased antibody response to the Omicron variant” in an ongoing trial, per a January AstraZeneca .\n\nof the mRNA vaccines also seem to increase immune response against Omicron, at least in laboratory studies: Pfizer’s Comirnaty effectively “ ” the variant, while Moderna’s Spikevax virus-fighting antibodies by 37 times. The CDC receiving a booster dose two months after getting Johnson & Johnson’s vaccine or five months after receiving your second dose of Comirnaty or Spikevax.\n\nAll four vaccines’ are similar, including potential injection site pain and flu-like symptoms, including fever, fatigue, headaches, and muscle soreness, which are to be expected as your immune system is primed, especially after a second dose. “Vaccines stimulate the immune system, and you do have some side effects from that,” Dr. Durbin explains. Symptoms generally last one to two days.\n\nDoes the AstraZeneca vaccine cause blood clots?\n\nVaxzevria is associated with a very rare condition called , or the formation of clots in blood vessels, according to the European Medicines Agency (EMA). Last March, 13 European nations and Thailand temporarily their rollouts of the AstraZeneca vaccine over concerns over the blood clots, but soon resumed.\n\n\n\nBoth the EMA and the WHO insist that the vaccine is safe. Up to 1 in 10,000 people could be affected by thrombosis following Vaxzevria, the EMA warns, and the risk is greater in people younger than 50. In December, researchers the likely cause of these clots: If the vaccine reaches the bloodstream, some people’s bodies release antibodies, which clump together with blood cells and cause clotting.\n\nJohnson & Johnson’s COVID-19 vaccine, the only adenovirus-vectored option offered domestically, was temporarily paused in the United States last April following rare reports of a new condition called . Part of the reason for the pause, Dr. Durbin explains, is making sure that healthcare providers are prepared to treat these blood clots and to inform people of the risks—however slight—of complications.\n\n“The thought is [incidents of thrombosis] have something to do with the adenovirus vector that’s being used to deliver that spike protein genetic material,” Dr. Durbin says. These cases are so rare that most experts believe that there is a “host component, something about the people who got the clotting disorder that’s different from people who didn’t.”\n\nThese issues were missed in clinical trials, Dr. Durbin says, because they’re so exceedingly rare. No increased likelihood of blood clotting was found among participants in AstraZeneca’s United States trial.\n\nWhich COVID-19 vaccine is the best?\n\n“The best vaccine is the one that’s offered the day you go in for your appointment,” says , chief clinical officer at the Ohio State University Wexner Medical Center. “All of the [available] vaccines are incredibly effective. They’re all safe.” Each vaccine that has received FDA approval and authorization has been proven to decrease severe illness, hospitalization, and death, the worst outcomes of COVID-19.\n\n“If all you got from COVID-19 was a head cold, we wouldn’t be concerned,” Dr. Durbin explains. “That’s what these vaccines are doing: They’re preventing that severe disease that is paralyzing healthcare systems around the world.”\n\nCombined with masks, hand-washing, and social distancing, vaccines have been proven to be incredibly effective at keeping people safe from COVID-19. No matter which COVID-19 vaccine becomes available to you first, you can feel confident in its ability to protect you, as long as you continue being cautious until positive cases, hospitalizations, and deaths are significantly reduced nationwide.\n\n“If you can get a vaccine, get vaccinated,” Dr. Durbin says. “[Take] whatever vaccine that you can get to help us get out of this pandemic.”\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Here’s How the AstraZeneca COVID-19 Vaccine Compares to Those Available in the U.S.", "description": "Could the U.S. have a fourth COVID-19 vaccine in its near future?", "image": "https://hips.hearstapps.com/hmg-prod/images/gloved-hand-holds-a-syringe-and-a-phial-conceptual-royalty-free-image-1643835078.jpg?crop=0.850xw:0.649xh;0.00489xw,0.0572xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "article:section": "Health", "article:modified_time": "2022-05-12T14:31:13Z", "article:published_time": "2022-02-02T22:17:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a35644466/covid-19-vaccine-booster-shot/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-limits-use-janssen-covid-19-vaccine-certain-individuals", "https://www.astrazeneca.com/media-centre/press-releases/2021/two-billion-doses-of-astrazenecas-covid-19-vaccine-supplied-to-countries-across-the-world-less-than-12-months-after-first-approval.html", "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "https://www.prevention.com/health/a34121295/common-cold-caused-by-coronavirus/", "https://www.who.int/news-room/feature-stories/detail/the-oxford-astrazeneca-covid-19-vaccine-what-you-need-to-know", "/health/a38513208/omicron-variant-symptoms-covid-19/", "/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "https://www.prevention.com/health/a36014090/how-long-does-covid-19-vaccine-immunity-last/", "https://www.hopkinsmedicine.org/profiles/details/anna-durbin", "https://www.prevention.com/health/a34881552/what-is-mrna-covid-19-vaccine-pfizer-moderna/", "https://www.bmj.com/content/371/bmj.m4826#:~:text=The%20study%2C%20published%20in%20the,cases%20in%20the%20placebo%20group.", "https://investors.modernatx.com/news/news-details/2020/Moderna-and-Lonza-Announce-Worldwide-Strategic-Collaboration-to-Manufacture-Modernas-Vaccine-mRNA-1273-Against-Novel-Coronavirus-05-01-2020/default.aspx", "https://www.astrazeneca.com/media-centre/press-releases/2021/azd1222-us-phase-iii-primary-analysis-confirms-safety-and-efficacy.html", "https://www.prevention.com/health/a28634992/where-to-get-flu-shot/", "https://www.cdc.gov/flu/vaccines-work/vaccineeffect.htm", "https://www.prevention.com/health/a38513208/omicron-variant-symptoms-covid-19/", "https://www.astrazeneca.com/media-centre/press-releases/2022/new-vaxzevria-data-further-support-its-use-as-third-dose-booster.html", "https://www.prevention.com/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-provide-update-omicron-variant", "https://www.cbsnews.com/news/moderna-booster-shot-covid-vaccine-antibodies-omicron/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "https://www.prevention.com/health/a34833921/coronavirus-covid-19-vaccine-side-effects/", "https://www.ema.europa.eu/en/medicines/human/EPAR/vaxzevria-previously-covid-19-vaccine-astrazeneca", "https://www.nbcnews.com/health/health-news/after-reports-blood-clots-some-countries-pause-use-astrazeneca-covid-n1260888", "https://www.bbc.com/news/health-59418123", "/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "/health/a32006916/mild-coronavirus-symptoms/", "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "https://wexnermedical.osu.edu/find-a-doctor/andrew-thomas-md-3642", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/author/224791/jake-smith/"], "authors": [], "publish_date": "2022-02-02T22:17:00Z"}