{"result_id": "245022", "URL": "https://www.prevention.com/health/a40544611/monkeypox-vaccine-side-effects/", "timestamp": "2023-04-25 16:52:46 CEST+0200", "meta": {"description": "The CDC is urging people in certain groups to get vaccinated against monkeypox. But what are the side effects of the monkeypox vaccines JYNNEOS and ACAM2000? What you need to know.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a40544611/monkeypox-vaccine-side-effects/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "What Are the Side Effects of the Monkeypox Vaccine? Doctors Explain", "cleaned_text": "The monkeypox virus continues to spread across the country and the world. In New York City, cases have doubled in the past week while supply of the monkeypox vaccine “remains low,” according to health officials. People in Dallas County, Texas, who attended the Daddyland Festival over Fourth of July weekend are also being encouraged by public health officials to monitor themselves for signs of monkeypox after someone who went to the event later tested positive for the virus.\n\nThe World Health Organization is planning to reconvene the week of July 18 or sooner to decide whether monkeypox should be declared a global health emergency, the WHO’s highest alert level, Director-General Tedros Adhanom Ghebreyesus said during a virtual news conference on Wednesday.\n\nThe Centers for Disease Control and Prevention (CDC) is urging people who are considered high risk for monkeypox to get vaccinated against the virus, and it’s understandable to have questions about the vaccine, including its side effects. Here’s what you need to know.\n\nWhat is the monkeypox vaccine?\n\nThere are actually two monkeypox vaccines licensed for use in the U.S.—ACAM200 and JYNNEOS (which also go under the names Imvamune or Imvanex). They’re licensed to prevent smallpox but also work to prevent monkeypox, per the CDC.\n\nACAM2000 is given as a live virus preparation that’s given by pricking the skin surface, the CDC explains. A lesion—called a “take”—will develop at the site of the vaccination, but the virus that grows at the site of the lesion can be spread to other parts of the body or even to other people. Because of this, people who are vaccinated with ACAM2000 have to take special precautions to avoid spreading the virus. People who get the vaccine are considered fully vaccinated after 28 days.\n\nJYNNEOS is also a live virus vaccine but it’s non-replicating—meaning, it can’t spread or make you sick. It’s given as two injections four weeks apart and there’s no visible “take,” the CDC says. People who get the JYNNEOS vaccine are not considered vaccinated until two weeks after they get the second dose of the vaccine, the CDC says.\n\nJYNNEOS is the preferred vaccine that’s used in the U.S., says Thomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo. “It’s considered an improvement on ACAM2000 because it doesn’t replicate,” he says. It can also be given to people who are immunocompromised and have eczema, he points out— ACAM2000 can’t.\n\nWhat are the monkeypox vaccine side effects?\n\nIt depends on which monkeypox vaccine you get. In general, the CDC says that the following can be side effects of the JYNNEOS vaccine:\n\nThe following may be side effects of the ACAM2000 vaccine, per the CDC:\n\nJYNNEOS “was designed to be less reactogenic than traditional smallpox vaccines and is comparable to routine vaccines in terms of injection site reactions,” says Amesh A. Adalja, M.D., a senior scholar at the Johns Hopkins Center for Health Security. William Schaffner, M.D., an infectious disease specialist and professor at the Vanderbilt University School of Medicine, agrees, noting that people tend to do “very well” with the JYNNEOS vaccine.\n\nHow do you protect against monkeypox?\n\nExperts say that monkeypox isn’t something the general public should worry about at this point. “It is not very contagious outside of close contact,” Dr. Adalja says. But, he adds, “if someone thinks they are at risk for monkeypox because of their activities and exposures, they should seek vaccination either before they engage in those activities or after they have been exposed.”\n\nThe CDC also recommends the following to protect against monkeypox:\n• Avoid close, skin to skin contact with the monkeypox rash.\n• Don’t touch the rash or scabs of person with monkeypox.\n• Don’t kiss, hug, cuddle, or have sex with someone with monkeypox.\n• Don’t handle or touch the bedding, towels, or clothing of a person with monkeypox.\n• Wash your hands often with soap and water or use an alcohol-based hand sanitizer, especially after contact with sick people.\n\nThe CDC also recommends that the following people be vaccinated against monkeypox:\n• People who are personal contacts of patients with monkeypox\n• People who may have been exposed to the virus\n• People who have increased risk of being exposed to the virus, such as people who perform laboratory testing to diagnose monkeypox\n\nIs there a cure for monkeypox?\n\nThere is not a cure for monkeypox, but there doesn’t really need to be, Dr. Schaffner says. “For the most part, this is a self-limiting infection and all of these lesions resolve over a period of two to four weeks,” he says. “Most people recover without specific therapy.”\n\nHowever, antiviral medications like tecovirimat (TPOXX) may be prescribed for people who are immunocompromised or more likely to get severely ill from monkeypox, he says.\n\nDr. Russo points out that “cases of monkeypox are creeping up a bit” in the U.S., noting that “anyone can get this through close contact.” His advice: “Be cautious about having close contact with anyone with skin lesions and ulcers.”", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "What Are the Side Effects of the Monkeypox Vaccine? Doctors Explain", "description": "People in certain groups are being urged to get vaccinated.", "image": "https://hips.hearstapps.com/hmg-prod/images/syringe-with-injection-or-vaccine-repetition-royalty-free-image-1657209157.jpg?crop=1xw:0.74965xh;center,top&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a40544611/monkeypox-vaccine-side-effects/", "article:section": "Health", "article:modified_time": "2022-07-07T18:28:16Z", "article:published_time": "2022-07-07T18:19:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a37066284/what-is-monkeypox-virus/", "https://www.prevention.com/health/a40395255/monkeypox-vaccine-nyc-clinic/", "https://www1.nyc.gov/site/doh/health/health-topics/monkeypox.page", "https://www.dallascounty.org/departments/dchhs/press-releases/2022-press-releases/07-06-22-dchhs-reports-the-first-monkeypox-viral-infections-transmitted-locally.php", "https://www.prevention.com/monkeypox/.", "https://www.reuters.com/business/healthcare-pharmaceuticals/who-more-than-6000-monkeypox-cases-reported-another-emergency-meeting-set-2022-07-06/", "https://www.cdc.gov/poxvirus/monkeypox/clinicians/smallpox-vaccine.html", "https://www.cdc.gov/poxvirus/monkeypox/clinicians/smallpox-vaccine.html", "https://www.cdc.gov/poxvirus/monkeypox/considerations-for-monkeypox-vaccination.html", "https://www.cdc.gov/poxvirus/monkeypox/considerations-for-monkeypox-vaccination.html", "https://www.cdc.gov/poxvirus/monkeypox/prevention.html", "https://www.cdc.gov/poxvirus/monkeypox/treatment.html", "/health/health-conditions/a40104567/how-does-monkeypox-spread/", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-07-07T18:19:00Z"}