{"result_id": "245026", "URL": "https://www.prevention.com/health/health-conditions/a40869782/what-is-intradermal-injection/", "timestamp": "2023-04-25 16:52:52 CEST+0200", "meta": {"description": "Intradermal injections are given between the layers of the epidermis and the hypodermis. The FDA cleared the monkeypox vaccine to be administered this way.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/health-conditions/a40869782/what-is-intradermal-injection/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "How Intradermal Injections Really Work and What This Method Means for Monkeypox Vaccinations", "cleaned_text": "\n• The Monkeypox vaccine has just been given the green light by the Federal Drug Administration (FDA) to be administered via intradermal injection.\n• This method will allow healthcare professionals to get more doses out of a single vial.\n• Experts explain the efficacy of intradermal injections, and how they stack up against other injection methods.\n\nMonkeypox continues to spread in the U.S., with more than 10,000 cases documented across the country, according to data from the Centers for Disease Control and Prevention (CDC). Still, access to the JYNNEOS monkeypox vaccine has been limited. Now, the Food and Drug Administration (FDA) is offering up a solution: Give the vaccine via an intradermal injection.\n\nThe FDA announced on Tuesday that it has issued an emergency use authorization to allow healthcare providers to give the vaccine via an intradermal injection vs. the previous subcutaneous injection. This, the FDA explained, can stretch out the supply of the vaccine and allow providers to get five doses out of a standard one-dose vial.\n\n“In recent weeks the monkeypox virus has continued to spread at a rate that has made it clear our current vaccine supply will not meet the current demand,” FDA Commissioner Robert M. Califf, M.D., said in a press release. “The FDA quickly explored other scientifically appropriate options to facilitate access to the vaccine for all impacted individuals. By increasing the number of available doses, more individuals who want to be vaccinated against monkeypox will now have the opportunity to do so.”\n\nBut there’s more to it than that, including the fact that the intradermal injection angle is a little different than what you might experience with other types of vaccines.\n\nYou’re probably a little unsure of what, exactly, it means to have an intradermal injection. Here’s what you need to know.\n\nWhat is an intradermal injection?\n\nAn intradermal injection means that the vaccine is injected between the epidermis and the hypodermis, a.k.a. the outer and bottom layers of the skin, according to the CDC. It’s usually given on the inner side of the forearm and it should produce a noticeable elevation of the skin, called a wheal, the CDC says.\n\nThese vaccines are given at a five- to 15-degree angle to the skin. “The angle needs to be pretty flat,” says Thomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo in New York. “You inject a bit to confirm the needle is in the correct position before injecting the rest. It takes some practice.”\n\nThe CDC has even issued an explainer video that breaks everything down, in case you want a visual:\n\n“It takes a lot more skill to successfully do an intradermal injection than it does a subcutaneous injection,” Dr. Russo says.\n\nWilliam Schaffner, M.D., infectious disease specialist and professor at the Vanderbilt University School of Medicine, agrees. “It’s far and away the most difficult way to perform an inoculation,” he says.\n\nWhat are other common types of vaccine injections?\n\nThere are a few different ways vaccines are typically given in the U.S. According to the CDC, those include:\n• Intramuscular: These vaccines are given at a 90-degree angle to the skin and are typically injected into the thigh or deltoid muscle of the upper arm. The flu vaccine and COVID-19 vaccine are given intramuscularly.\n• Subcutaneous: Subcutaneous injections are given at a 45-degree angle, usually in the thigh (for babies under the age of 12 months) or upper-outer triceps area for people over 12 months. The MMR and varicella vaccines are subcutaneous.\n\nWhy is the FDA recommending an intradermal injection for the monkeypox vaccine?\n\nThe FDA is recommending that monkeypox vaccines be given intradermally to try to stretch out the current vaccine supply. Going this route will allow healthcare providers to give five people the vaccine for every one dose they previously were able to give, Dr. Russo explains.\n\nDr. Schaffner says that switching the way that the vaccine is delivered is “scientifically sound,” noting that it “builds on studies that have been done with other vaccines.”\n\nThe FDA specifically cited data from a 2015 clinical study of the JYNNEOS vaccine that evaluated the vaccine being given intradermally compared to subcutaneously. “The results of this study demonstrated that intradermal administration produced a similar immune response to subcutaneous administration, meaning individuals in both groups responded to vaccination in a similar way,” the FDA said in the press release. “The FDA has determined that the known and potential benefits of JYNNEOS outweigh the known and potential risks for the authorized uses.”\n\nWhat are the side effects of an intradermal injection?\n\nAccording to the 2015 study the FDA cited, getting the JYNNEOS vaccine intradermally could lead to the following injection site side effects:\n\nHowever, the FDA notes that people had “less pain” than they did when they received the vaccine via the subcutaneous route.\n\nWhat do experts think of this?\n\nWhile doctors applaud the move to try to make the monkeypox vaccine more accessible to people, they also have some reservations.\n\nIntradermal injections are “difficult” to do and “can be fouled up very easily,” Dr. Schaffner says. He adds, “it takes a lot of training and supervision” to do it properly.\n\n“It requires more training and special needles to get at the right depth, but it causes a better immune response compared to the subcutaneous route, so less vaccine needs to be used,” says Jamie Alan, Ph.D., an associate professor of pharmacology and toxicology at Michigan State University. But, Alan said, it’s not “fully understood” why the vaccine may still be effective when it's given this way.\n\nAnd, if someone does the injection incorrectly and it ends up being a subcutaneous injection, the vaccine may not work as well because they won’t receive a large enough dose, Dr. Schaffner says. “Recommending that this be done widely has a large practical component,” he says.\n\nDr. Russo says it “makes sense” to go this route given the current vaccine supply and demand but also has reservations about how easy it is to mess up this form of injection. “This comes with caveats, but it’s reasonable to do this,” he says.\n\nThis article is accurate as of press time. However, as the Monkeypox outbreak rapidly evolves and the scientific community’s understanding of it develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "How Intradermal Injections Really Work and What This Method Means for Monkeypox Vaccinations", "description": "It’s not your standard vaccine injection, for starters.", "image": "https://hips.hearstapps.com/hmg-prod/images/circle-adhesive-bandage-on-human-skin-royalty-free-image-1660228639.jpg?crop=1xw:0.75035xh;center,top&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/health-conditions/a40869782/what-is-intradermal-injection/", "article:section": "Health Conditions", "article:modified_time": "2022-08-12T12:30:16Z", "article:published_time": "2022-08-12T12:30:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/poxvirus/monkeypox/response/2022/us-map.html", "https://www.prevention.com/health/a40544611/monkeypox-vaccine-side-effects/", "https://www.fda.gov/news-events/press-announcements/monkeypox-update-fda-authorizes-emergency-use-jynneos-vaccine-increase-vaccine-supply", "https://www.fda.gov/news-events/press-announcements/monkeypox-update-fda-authorizes-emergency-use-jynneos-vaccine-increase-vaccine-supply", "https://www.cdc.gov/poxvirus/monkeypox/interim-considerations/jynneos-vaccine.html", "https://journals.lww.com/nursing/Citation/2006/06000/Administering_an_intradermal_injection.16.aspx", "https://www.youtube.com/watch?v=TLv1mR6mECQ", "https://www.cdc.gov/vaccines/hcp/acip-recs/general-recs/administration.html#:~:text=Intramuscular%20injections%20are%20administered%20at,injection%20is%2022%2D25%20gauge.", "https://www.prevention.com/health/health-conditions/a37759046/how-effective-is-the-flu-vaccine/", "https://www.prevention.com/health/a36186576/can-i-get-covid-19-vaccine-when-sick/", "/health/a40730959/who-is-eligible-monkeypox-vaccine-requirements/", "https://www.cdc.gov/poxvirus/monkeypox/index.html", "https://www.who.int/news-room/fact-sheets/detail/monkeypox", "https://www.naccho.org/blog/articles/cdc-updates-monkeypox-virus-infection", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-08-12T12:30:00Z"}