{"result_id": "245006", "URL": "https://www.prevention.com/health/health-conditions/a40436017/flu-vaccination-linked-to-reduced-risk-of-alzheimers-disease-study/", "timestamp": "2023-04-25 16:52:08 CEST+0200", "meta": {"description": "Older adults who got at least one flu vaccination were associated with 40% lower risk of developing Alzheimer’s disease, a new study finds.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/health-conditions/a40436017/flu-vaccination-linked-to-reduced-risk-of-alzheimers-disease-study/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Your Flu Shot May Reduce Your Risk of Alzheimer’s Disease by 40%, Study Shows", "cleaned_text": "\n• A new study has shown a link between the flu vaccine and a reduced risk for Alzheimer’s disease.\n• The study shows people with one flu shot over four years were 40% less likely to develop Alzheimer’s than those who were not vaccinated.\n• Scientists believe more research is needed before coming to a final conclusion.\n\nYour flu shot might do more than protect you from the influenza virus. A is causing a stir in the neuroscience world, showing a link between the flu vaccine and a reduced risk of Alzheimer’s disease.\n\nAccording to the study from , people who received at least one influenza vaccine were 40% less likely than their non-vaccinated peers to develop over the course of four years.\n\nAlzheimer’s is a type of dementia that affects memory, thinking, and behavior. Alzheimer’s is the most common cause of dementia, a general term for memory loss and other cognitive abilities serious enough to interfere with daily life. Alzheimer’s disease accounts for 60-80% of dementia cases.\n\nThe estimates that 6.5 million people of all ages have Alzheimer’s disease in the United States, with the number of affected individuals growing due to the nation’s aging population. The number of Americans ages 65 and older will over the next 40 years, reaching 80 million in 2040.\n\nCurrently, only about 50% of adults in the U.S. get the flu vaccine each season.\n\n​​The new research was led by Avram S. Bukhbinder, M.D., a recent alumnus of McGovern Medical School at UTHealth Houston, and , M.D., the Rick McCord Professor in Neurology at McGovern Medical School, compared the risk of Alzheimer’s disease between patients with and without prior in a large sample across the U.S., consisting of adults aged 65 and older.\n\nIn a press release from , the researchers stated that they “found that flu vaccination in older adults reduces the risk of developing Alzheimer’s disease for several years. The strength of this protective effect increased with the number of years that a person received an annual flu vaccine—in other words, the rate of developing Alzheimer’s was lowest among those who consistently received the flu vaccine every year,” Dr. Bukhbinder said in the press release. “Future research should assess whether flu vaccination is also associated with the rate of symptom progression in patients who already have Alzheimer’s dementia.”\n\nThe study—which comes two years after UTHealth Houston researchers found a possible link between the flu vaccine and reduced risk of Alzheimer’s disease—examined a much larger sample than previous research, including 935,887 flu-vaccinated patients and 935,887 non-vaccinated patients.\n\nDuring four-year follow-up appointments, 8.5% of non-vaccinated patients had developed Alzheimer’s disease. Meanwhile, only about 5.1% of flu-vaccinated patients were found to have developed Alzheimer’s disease.\n\nThese results emphasize the strong effect the flu vaccine may have on Alzheimer’s disease, Dr. Bukhbinder and Dr. Schulz noted in the press release. But, the underlying mechanisms behind this process and the reasons why require further study.\n\n“Since there is evidence that several vaccines may protect from Alzheimer’s disease, we are thinking that it isn’t a specific effect of the flu vaccine,” Dr. Schulz said in the press release. Past studies have found a decreased risk of dementia also associated with prior exposure to various vaccinations, including those for tetanus, polio, and herpes, just to name a few.\n\nAs more time passes since the introduction of COVID-19 vaccines and longer follow-up data becomes available, Dr. Bukhbinder noted in the release that it will be worth investigating whether a similar association exists between COVID-19 vaccination and the risk of Alzheimer’s disease.\n\nDr. Schulz shared that he believes “that the immune system is complex, and some alterations, such as pneumonia, may activate it in a way that makes Alzheimer’s disease worse. But other things that activate the immune system may do so in a different way—one that protects from Alzheimer’s disease. Clearly, we have more to learn about how the immune system worsens or improves outcomes in this disease.”\n\nSo while the jury is still out on whether Alzheimer’s disease risk is reduced by all vaccines out there, it’s safe to say that getting your flu shot is not only a good idea to help prevent serious flu infection, but it might also help stave off Alzheimer’s.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Your Flu Shot May Reduce Your Risk of Alzheimer’s Disease by 40%, Study Shows", "description": "Your seasonal flu shot may be protecting you from more than just the flu.", "image": "https://hips.hearstapps.com/hmg-prod/images/flu-shot-syringes-1632764948.jpg?crop=1xw:0.75xh;center,top&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/health-conditions/a40436017/flu-vaccination-linked-to-reduced-risk-of-alzheimers-disease-study/", "article:section": "Health Conditions", "article:modified_time": "2022-06-28T13:44:52Z", "article:published_time": "2022-06-28T13:44:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://content.iospress.com/articles/journal-of-alzheimers-disease/jad220361", "https://www.prevention.com/health/health-conditions/a37759046/how-effective-is-the-flu-vaccine/", "https://www.uth.edu/", "https://www.prevention.com/health/a22640271/increase-brain-power-prevent-alzheimers/", "https://www.prevention.com/health/memory/a37662830/dementia-vs-alzheimers-differences/", "https://www.alz.org/alzheimers-dementia/what-is-alzheimers", "https://www.urban.org/policy-centers/cross-center-initiatives/program-retirement-policy/projects/data-warehouse/what-future-holds/us-population-aging#:~:text=The%20number%20of%20Americans%20ages,The%20nation%20is%20aging.", "https://med.uth.edu/neurology/faculty/paul-e-schulz-md/", "https://www.prevention.com/health/health-conditions/a24073923/how-to-prevent-the-flu/", "https://www.uth.edu/", "https://www.prevention.com/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "/health/a38884115/what-is-bird-flu/", "/author/246479/madeleine-haase/"], "authors": [], "publish_date": "2022-06-28T13:44:00Z"}