{"result_id": "245012", "URL": "https://www.prevention.com/health/a39588566/second-covid-booster-shot/", "timestamp": "2023-04-25 16:52:26 CEST+0200", "meta": {"description": "The FDA authorized a second COVID-19 booster dose for people over 50. Here, find out if you’re eligible and if you need a second coronavirus vaccine booster.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a39588566/second-covid-booster-shot/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "FDA Authorizes Second COVID-19 Booster Shots for Some Adults—Experts Explain Eligibility", "cleaned_text": "\n• The FDA authorized a second COVID-19 of the Moderna and Pfizer-BioNTech vaccines.\n• Those who are 50 and older or at least 12 years old and immunocompromised are now eligible to receive the second booster shot.\n• Doctors encourage those who are immunocompromised to get the second but are hesitant on recommending it for otherwise healthy individuals.\n\nMore than two years of the COVID-19 pandemic and three vaccinations later, the Food and Drug Administration (FDA) has authorized a second dose for some people. The administration is recommending additional boosters of the Moderna and Pfizer-BioNTech COVID-19 vaccines for adults over 50 and immunocompromised individuals over 12 years old, according to an FDA .\n\nThe FDA had initially approved a back in September for certain populations, and in November for who had received the first two doses of the mRNA vaccines. Now, with the new authorization, some groups will have access to a second booster dose.\n\nBut the second recommendation isn’t due to new health concerns. “Emerging evidence suggests that a second booster dose of an mRNA vaccine improves protection against severe COVID-19 and is not associated with new safety concerns,” the FDA wrote in their release.\n\nThe first booster shot proved to be successful in protecting individuals against hospitalizations and death from COVID-19, specifically with the recent surge. According to the CDC press release, those boosted were 21 times less likely to die from COVID-19 than those who were unvaccinated. Additionally, they were seven times less likely to be hospitalized.\n\nThese updated vaccination recommendations stem largely from new data provided by the Ministry of Health of Israel which provided a second booster dose of the Pfizer-BioNTech COVID-19 vaccine to 700,000 residents. Approximately 600,000 of those who received the second booster dose were 60 years old or older.\n\nAdditionally, a single center in Israel provided the FDA with data from an ongoing, open-label, non-randomized clinical study on healthcare workers. Participants were 18 years of age or older and received a first vaccination and a booster dose with the Pfizer-BioNTech COVID-19 vaccine. They received a second booster dose of Pfizer-BioNTech COVID-19 vaccine or Moderna COVID-19 vaccine at least four months after their first booster. Researchers found after two weeks, participants had a higher level of antibodies against the COVID-19 virus, including and , compared to five months after the first booster dose.\n\n“Current evidence suggests some waning of protection over time against serious outcomes from COVID-19 in older and immunocompromised individuals. Based on an analysis of emerging data, a second booster dose of either the Pfizer-BioNTech or Moderna COVID-19 vaccine could help increase protection levels for these higher-risk individuals,” , director of the FDA’s Center for Biologics Evaluation and Research said in the FDA press release. “Additionally, the data show that an initial booster dose is critical in helping to protect all adults from the potentially severe outcomes of COVID-19. So, those who have not received their initial booster dose are strongly encouraged to do so.”\n\nWho is eligible for a second booster shot?\n\nThose who are now eligible for the second booster dose can get their Pfizer or Moderna shot at least four months after their first booster dose of any COVID-19 vaccine. According to the FDA’s news release, these individuals are now eligible for a second booster shot:\n• Anyone over the age of 50 years old who has already received their first three vaccine doses more than four months ago can now get a second booster dose of the Pfizer-BioNTech COVID-19 vaccine or Moderna COVID-19 vaccine.\n• Individuals 12 years and older who are from a medical condition, organ transplants, or other illness, who have already received their first three vaccine doses more than four months ago are eligible to receive a second booster dose of the Pfizer-BioNTech COVID-19 vaccine.\n• Those 18 years or older who are immunocompromised and received their third COVID-19 vaccine more than four months are eligible for a second booster dose of Moderna COVID-19 vaccine.\n• Anyone who received a Johnson & Johnson vaccine and booster dose at least four months ago may now receive a second booster shot from Moderna or Pfizer-BioNTech, according to a from the Centers for Disease Control and Prevention (CDC).\n\nAt this time, the booster recommendations for other individuals have not changed. The CDC continues to recommend all eligible adults and children five years and older get their COVID-19 vaccines and a booster when eligible.\n\nWhen and where can you get your second booster shot?\n\nSimilar to previous COVID-19 vaccinations, it’s best to check with your local healthcare provider or pharmacy to see when they’ll have second booster shots available for those who are eligible. As of now, if you fall into the above four categories, you are eligible for the second booster dose.\n\nDo you need a second booster shot?\n\nFrom a government policy standpoint, if you are 12 years of age and older with immunodeficiency or 50 years and older, you are eligible for a second COVID-19 booster shot, but it may not be necessary for everyone just yet, says Director of the Institute of Autoimmune and Rheumatic Disease at Saint Joseph Health and author of\n\nHe explains that those who are immunocompromised or have an autoimmune disease can benefit from the booster shot, and he encourages them to speak with their healthcare provider about scheduling an appointment. But, he says he expected the second booster to only be available to those 65 years and older and is unsure why the CDC has recommended the second booster to those as young as 50.\n\nDr. Lahita worries that considering of the country has received their first booster shot and the has been a non-critical disease, it’ll be very difficult to convince people to get the fourth injection now. Dr. Lahita also notes to keep in mind that the pandemic is not over, that we’re unsure if more variants are to come, and importantly, that Omicron is not a mild disease for everyone.\n\n“I think the issue of the second shot is fairly individualized and not a one size fits all,” says , infectious disease specialist with . “If someone has a compromised immune system or is elderly, COVID-19 is still out there, and the booster will help protect them. However, if someone is in their early 50s and is in super shape, then the benefit of the second shot is less certain, and they may want to wait a bit.”\n\nWhat’s more interesting to many doctors is the vaccination that is expected to come this fall. If and when COVID-19 becomes endemic and returns every year like the flu, many medical professionals await what will be a single vaccination that protects again multiple and , Dr. Lahita says.\n\n“Most people who have received two shots and a booster are fully protected until the endemic shots in the fall,” Dr. Lahita says.\n\nIn short: If you are not over the age of 65 and/or are immunocompromised, it’s best to speak to your healthcare provider to determine if a second COVID-19 booster shot is right for you, Dr. Wortmann recommends.\n\n“I think those over 50 with chronic medical problems should strongly consider getting the additional dose, as well as younger patients who have compromised immune systems. In addition, those patients over 65 should consider it,” Dr. Wortmann says. “At this point, the issue is a little less clear for those aged 50 to 60 who are otherwise healthy, and patients should discuss the benefits with their provider.”\n\nAs of today, there are no safety concerns for a second COVID-19 booster based on the data provided to the FDA. But small similar to those of previous vaccinations may occur and vary from person to person, Dr. Lahita says.\n\nThe previously reported that additional side effects may include:\n• swollen lymph nodes in the same arm as the injection\n\nAdditionally, the benefits of the second COVID-19 vaccine booster dose greatly outweigh any of their known or potential risks, according to the FDA press release. So if you fall into any of the above categories and are eligible to get your second dose, it’s worth having the conversation with your healthcare provider.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "FDA Authorizes Second COVID-19 Booster Shots for Some Adults—Experts Explain Eligibility", "description": "Plus, if you really need another boost in the first place.", "image": "https://hips.hearstapps.com/hmg-prod/images/senior-woman-getting-vaccinated-royalty-free-image-1648670488.jpg?crop=1.00xw:0.752xh;0,0.202xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a39588566/second-covid-booster-shot/", "article:section": "Health", "article:modified_time": "2022-04-05T18:53:30Z", "article:published_time": "2022-03-31T11:30:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a35644466/covid-19-vaccine-booster-shot/", "https://www.prevention.com/novel-coronavirus/", "https://www.prevention.com/health/a38002403/covid-fda-mix-and-match-booster-shots/", "https://www.prevention.com/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "https://www.fda.gov/news-events/press-announcements/fda-authorizes-booster-dose-pfizer-biontech-covid-19-vaccine-certain-populations", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-expands-eligibility-covid-19-vaccine-boosters", "https://www.prevention.com/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "https://www.prevention.com/health/a38580337/how-to-know-what-strain-of-covid-you-have/", "https://www.prevention.com/health/health-conditions/a38370247/what-is-omicron-covid-19-variant/", "https://www.prevention.com/health/a38450101/how-deadly-is-omicron-variant-covid-19/", "https://www.prevention.com/health/a38400888/omicron-vs-delta-covid-19-variant-comparison/", "https://www.fda.gov/about-fda/fda-organization/peter-marks", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/immuno.html", "https://www.cdc.gov/media/releases/2022/s0328-covid-19-boosters.html", "https://doctorboblahita.com/", "https://www.amazon.com/dp/1630061956", "https://www.kff.org/coronavirus-covid-19/poll-finding/kff-covid-19-vaccine-monitor-january-2022/?utm_campaign=KFF-2022-polling-surveys&utm_medium=email&_hsmi=2&_hsenc=p2ANqtz--uVnezvk3W0JEyP01fhm1gFbkGL6pO6HxtsSIJo68L61crhP-GjNyA28vSSS79nYE5SdLuIJDcBp8YpGdoTNea6ZjwPg&utm_content=2&utm_source=hs_email", "https://www.prevention.com/health/a38941944/stealth-omicron-symptoms/", "https://www.medstarhealth.org/doctors/glenn-william-wortmann-md", "https://www.medstarhealth.org/", "/health/a37375072/flu-shot-covid-booster-vaccine-together/", "https://www.prevention.com/health/a32491093/what-is-endemic-virus/", "https://ir.novavax.com/2021-09-08-Novavax-Initiates-Phase-1-2-Clinical-Trial-of-Combination-Vaccine-for-COVID-19-and-Seasonal-Influenza", "https://www.prevention.com/health/a38580337/how-to-know-what-strain-of-covid-you-have/", "https://www.prevention.com/health/health-conditions/a22813625/flu-symptoms-prevention/", "https://www.prevention.com/health/a38438664/covid-19-booster-side-effects/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-takes-additional-actions-use-booster-dose-covid-19-vaccines", "/health/a39396644/allergies-or-covid-19-symptoms/", "/author/228309/arielle-weg/"], "authors": [], "publish_date": "2022-03-31T11:30:00Z"}