{"result_id": "245042", "URL": "https://www.prevention.com/health/a35447805/novavax-covid-19-vaccine/", "timestamp": "2023-04-25 16:53:19 CEST+0200", "meta": {"description": "The Novavax COVID-19 vaccine has been given an EUA. Here’s what's in it, how it works and what’s known about efficacy so far.", "lang": "en", "keywords": "covid-19 vaccine, novavax vaccine", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a35447805/novavax-covid-19-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "What’s in the Novavax Vaccine? Experts Break It All Down", "cleaned_text": "The Food and Drug Administration has authorized Novavax’s COVID-19 vaccine for use in the U.S. Health officials at the Centers for Disease Control and Prevention (CDC) plan to meet next week and are expected to decide who the Novavax vaccine will be recommended for.\n\nThe vaccine, which is authorized for people who are 18 and up, has been authorized as a two-dose series and not a booster. Uptake is expected to be fairly low: The Biden administration announced last week that it will buy just 3.2 million doses of the vaccine, which would vaccinated 1.6 million Americans. “This is going to be a boutique vaccine for those individuals that were uncomfortable with the mRNA vaccine and felt that they are were ‘experimental’ in nature and therefore chose not to get vaccinated,” says Thomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo in New York. “This uses a more standard, time-honored technology where you use viral parts injected into your body.”\n\nThe vaccine is now the fourth COVID-19 vaccine authorized for use in the U.S., although it won’t be made available to the public until the CDC gives its recommendations. Currently, two vaccines—Pfizer’s Comirnaty and Moderna’s Spikevax—are approved for use. The Johnson & Johnson COVID-19 vaccine is still available to the public under an emergency use authorization.\n\nA phase 3 clinical trial published in the New England Journal of Medicine found that the Novavax vaccine has a 90.4% efficacy in preventing mild, moderate, or severe COVID-19 infection. None of the people in the trial developed a moderate or severe COVID-19 infection. However, the vaccine was tested from December 2020 through September 2021, which was before the current dominant Omicron strains, like BA.2.12.1, were circulating.\n\nBriefing documents released by the FDA show that, out of 40,000 people who participated in the trial, there were six cases of inflammatory heart conditions myocarditis and pericarditis. The Pfizer-BioNTech and Moderna mRNA vaccines didn’t find any cases of myocarditis or pericarditis in their clinical trials, but some cases surfaced after the vaccines were authorized.\n\nIt could be a little longer before the Novavax COVID-19 vaccine is available for public use, but it’s understandable to have questions. Here’s what you need to know.\n\nHow does the Novavax COVID-19 vaccine work?\n\nSimilar to the Pfizer-BioNTech and Moderna vaccine, the Novavax vaccine requires two shots given three weeks apart. But that’s where the similarities end, as the Novavax vaccine uses a totally different mechanism to provide protection from COVID-19.\n\nHere’s how it works, per infectious disease expert Amesh A. Adalja, M.D., senior scholar at the Johns Hopkins Center for Health Security: The Novavax vaccine is a protein-based vaccine that’s engineered from the genetic sequence of SARS-CoV-2, the novel coronavirus that causes COVID-19. Its spike protein gene is inserted into an insect virus, called a baculovirus. That virus infects insect cells, which pump out the spike protein. Then, the spike proteins are harvested and combined with an adjuvant, i.e. an ingredient that helps the vaccine create a stronger immune response in your body. “It’s very similar to how the flu vaccine works,” Dr. Adalja notes.\n\nThis approach is completely different compared to how the mRNA vaccines work, which give your cells the code to make the spike protein themselves, Dr. Russo explains. Then, your body develops antibodies in response to these cells. “With the Novavax vaccine, the majority of this process occurs [in a lab] outside your body,” he says. (Important to note: The Novavax vaccine will not cause COVID-19.)\n\nThe Novavax COVID-19 vaccine contains the following ingredients, per the FDA:\n• A recombinant form of the SARS-CoV-2 spike protein produced from baculovirus infected Sf9 (fall armyworm) insect cells\n• MatrixMTM adjuvant containing saponins derived from the soapbark tree (Quillaja saponaria Molina)\n\nThe FDA notes that the vaccine may also contain small amounts of baculovirus and insect cell proteins and DNA.\n\nIn general, Dr. Russo says the ingredients in the vaccine are pretty standard for traditional vaccines, with the exception of the adjuvant. An adjuvant, in case you’re not familiar with it, is an ingredient used in some vaccines that helps create a stronger immune response in people receiving the vaccine, per the CDC.\n\n“Not all vaccines have adjuvants, but they tend to be more reactogenic,” Dr. Russo says. Meaning, you could have more side effects with this vaccine than if you were to take a vaccine without an adjuvant.\n\nHow effective is the Novavax vaccine?\n\nThere is data available from a different clinical trials, including the one mentioned above. Novavax’s phase 3 clinical trial enrolled more than 15,000 participants between 18 and 84 years old, including 27% who were over the age of 65. The researchers found that, in the U.K. clinical trial, 56 cases of COVID-19 were observed in the placebo group compared to six cases in the vaccinated group. That led to an efficacy rate of 89.3%.\n\nThe researchers also discovered that the vaccine was 95.6% effective against the original SARS-CoV-2 strain and 85.6% effective against the Alpha strain. A preliminary analysis discovered that B.1.1.7 (the Alpha strain) was detected in more than 50% of the confirmed symptomatic cases.\n\nThe South African phase 2b clinical trial showed that the vaccine was 60% effective at preventing mild, moderate, and severe COVID-19 in study participants who did not have HIV. Overall, there were 29 cases of COVID-19 detected in the placebo group and 15 in the vaccine group.\n\nNovavax points out that about a third of patients enrolled in the South African clinical trial had previously been infected with the original coronavirus strain, while subsequent infections were mostly with the variant virus. “These data suggest that prior infection with COVID-19 may not completely protect against subsequent infection by the South Africa escape variant,” Novavax notes in its press release. “However, vaccination with NVX-CoV2373 provided significant protection.”\n\nThere is also data from a clinical trial in 12- to 17-year-olds that found the vaccine had an 80% efficacy rate against the Delta variant. The vaccine also created immune responses that were about two- to three-times higher in teens than in adults, Novavax pointed out.\n\n“It’s a very promising vaccine,” Dr. Adalja says. “It still prevents severe disease, hospitalization, and death, which means it’s a good vaccine.”\n\nDr. Russo agrees. “The efficacy is not as high as the mRNA vaccines, but it still affords a reasonable level of protection,” he says. “If we convert a lethal disease into a nuisance and keep people out of the hospital, I think that’s OK.”\n\nDoes the Novavax vaccine have side effects?\n\nNovavax has said: “Severe, serious, and medically attended adverse events occurred at low levels and were balanced between vaccine and placebo groups.” However, these were the most common adverse reactions observed during clinical trials:\n\nThere are a few reasons why experts say the Novavax vaccine is needed—despite there already being three COVID-19 vaccines available in the U.S. The Novavax vaccine can be stored and shipped at normal refrigeration temperatures, making distribution much easier, says William Schaffner, M.D., an infectious disease specialist and professor at the Vanderbilt University School of Medicine. “It could be used in doctor’s offices or smaller venues that don’t have the cold storage capacity needed for mRNA vaccines,” Dr. Russo says.\n\nThere’s also a chance that the Novavax vaccine will convince people who have been hesitant to get vaccinated to get the shot, Dr. Russo says. “Some people have said that the mRNA vaccines are ‘too new’ or ‘experimental’—none of which is true—but this is a more traditional type of vaccine platform that may be more appealing,” Dr. Russo says.\n\nIt could also be helpful to use the Novavax vaccine as a booster, Dr. Adalja says. “Having another vaccine using a disparate technology is important for enhancing future mixing-matching booster strategies as different presentations of the spike protein to the immune system may produce extra benefit than repeatedly boosting with the same product,” he says.\n\nWhile there isn’t data yet on how the Novavax vaccine performs against Omicron strains of COVID-19, Dr. Russo doesn’t expect it to do better than the mRNA vaccines. Still, he says, “there is plenty of room in the vaccine space for more vaccines.”\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "What’s in the Novavax Vaccine? Experts Break It All Down", "description": "It also relies on very different tech than its mRNA competitors.", "image": "https://hips.hearstapps.com/hmg-prod/images/corona-virus-covid-19-medical-vaccine-concept-royalty-free-image-1614291324.?crop=0.689xw:0.517xh;0.0224xw,0.252xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a35447805/novavax-covid-19-vaccine/", "article:section": "Health", "article:modified_time": "2022-07-14T15:43:34Z", "article:published_time": "2022-07-14T15:34:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/media/159898/download#:~:text=The%20Novavax%20COVID%2D19%20Vaccine%2C%20Adjuvanted%20contains%20a%20recombinant%20form,tree%20(Quillaja%20saponaria%20Molina).", "https://www.cdc.gov/vaccines/acip/index.html", "https://www.hhs.gov/about/news/2022/07/11/biden-harris-administration-secures-3-2-million-doses-novavax-covid-19-vaccine.html", "http://medicine.buffalo.edu/faculty/profile.html?ubit=trusso", "https://c212.net/c/link/?t=0&l=en&o=3560647-1&h=3880827182&u=https%3A%2F%2Fc212.net%2Fc%2Flink%2F%3Ft%3D0%26l%3Den%26o%3D3407775-1%26h%3D907997649%26u%3Dhttps%253A%252F%252Fwww.nejm.org%252Fdoi%252Ffull%252F10.1056%252FNEJMoa2116185%253Fquery%253Dfeatured_home%26a%3DNew%2BEngland%2BJournal%2Bof%2BMedicine&a=New+England+Journal+of+Medicine", "https://www.prevention.com/health/a39968078/new-variant-explained-symptoms/", "https://www.fda.gov/media/158912/download", "https://www.jhsph.edu/faculty/directory/profile/3528/amesh-adalja", "https://www.prevention.com/novel-coronavirus/", "https://www.cdc.gov/vaccinesafety/concerns/adjuvants.html", "https://www.prevention.com/health/health-conditions/a25050076/flu-shot-side-effects/", "https://www.prevention.com/health/a34881552/what-is-mrna-covid-19-vaccine-pfizer-moderna/", "https://www.prevention.com/health/a32957865/how-long-do-coronavirus-antibodies-last/", "https://www.fda.gov/media/159898/download#:~:text=The%20Novavax%20COVID%2D19%20Vaccine%2C%20Adjuvanted%20contains%20a%20recombinant%20form,tree%20(Quillaja%20saponaria%20Molina).", "https://www.cdc.gov/vaccinesafety/concerns/adjuvants.html", "https://www.prevention.com/health/a31245792/coronavirus-high-risk-groups/", "/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "/health/a35550071/delay-second-dose-covid-19-vaccine/", "https://ir.novavax.com/news-releases/news-release-details/novavax-covid-19-vaccine-demonstrates-893-efficacy-uk-phase-3", "https://ir.novavax.com/2022-06-07-FDA-Advisory-Committee-Recommends-Emergency-Use-Authorization-of-Novavax-COVID-19-Vaccine-for-People-Aged-18-Years-and-Older", "https://www.prevention.com/health/a33658101/vaccine-definition-facts/", "https://www.prevention.com/health/a34701430/covid-19-vaccine-distribution-release-date/", "https://www.vumc.org/health-policy/person/william-schaffner-md", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-07-14T15:34:00Z"}