{"result_id": "245013", "URL": "https://www.prevention.com/health/a40241771/moderna-new-omicron-booster/", "timestamp": "2023-04-25 16:52:28 CEST+0200", "meta": {"description": "Infectious disease doctors say that Moderna's new Omicron booster could lower your risk of getting sick in the future.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a40241771/moderna-new-omicron-booster/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Moderna Has a New, “Well Tolerated” Omicron Booster—Here’s What We Know About It", "cleaned_text": "Moderna shared this week that it has a new booster vaccine candidate that’s specifically targeted at Omicron variants of COVID-19. Moderna’s new Omicron booster contains Moderna’s original vaccine along with a vaccine candidate that targets the Omicron variant.\n\nThe 50-microgram booster—which is a bivalent booster (meaning, it targets two strains)—generated a stronger antibody response against Omicron than the original Moderna vaccine, the company said in a press release.\n\nThe new Omicron booster will be the company’s “lead candidate for a fall 2022 booster,” Stéphane Bancel, chief executive officer of Moderna, said in a statement, adding that the company is submitting preliminary data to regulators “with the hope that the Omicron-containing bivalent booster will be available in the late summer.”\n\nSubvariants of Omicron—BA.2.12.1, BA.2, and more—are currently responsible for the vast majority of COVID-19 cases in the U.S., according to data from the Centers for Disease Control and Prevention (CDC).\n\nBut what does it mean to have an Omicron-specific booster? And is this something we’ll all need to get in the fall? Infectious disease experts weigh in.\n\nWhat is Moderna’s new Omicron booster?\n\nCalled mRNA-1273.214, Moderna’s new Omicron booster specifically targets Omicron strains of COVID-19, along with “the ancestral strain” of SARS-CoV-2, the virus that causes COVID-19, says Thomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo in New York.\n\nThe booster was “well tolerated” during clinical trials with 437 study participants, Moderna said in the press release, adding that the safety profile and side effects were similar to what people had with the first booster dose. Per the Food and Drug Administration (FDA), those included:\n• Redness and swelling at the injection site\n\nWhy is an Omicron booster needed?\n\nDr. Russo points out that, while COVID-19 vaccines have done a good job of keeping most fully vaccinated people from developing severe COVID-19, being hospitalized with the virus, and dying, they’re still “imperfect.”\n\n“The hope is that, if we have variant-specific vaccines, that will do a better job at infection prevention and perhaps a whiff better at preventing hospitalizations and deaths,” Dr. Russo says.\n\nAmesh A. Adalja, M.D., a senior scholar at the Johns Hopkins Center for Health Security, agrees that this is needed. “If the goal is to optimize the vaccine to best protect against circulating variants, updates seem necessary until a universal coronavirus vaccine is developed,” he says.\n\nWhile it seems surprising that we’d need yet another booster, there is precedence for this, says William Schaffner, M.D., an infectious disease specialist and professor at the Vanderbilt University School of Medicine. “This is analogous to what we do actively with the influenza vaccine,” he says. “We update it in order to keep up with the changing influenza viruses.” And, he says, it end up being that people will need to get an annual COVID vaccine or booster, similar to what’s currently done with the flu vaccine.\n\nDr. Schaffner calls the booster “COVID vaccine 2.0,” adding that he and other infectious disease experts “hope that this vaccine will provide even broader protection against COVID going forward.”\n\nWhat happens next with Moderna’s new Omicron booster?\n\nFrom here, it goes off to the FDA and, from there, the CDC. “It hasn’t been authorized yet by the FDA or CDC but we anticipate that Moderna and Pfizer—they’re working on the same thing—will have such a vaccine available this fall,” Dr. Schaffner says.\n\nAnd yes, that means it will likely be recommended that you get another booster come fall. “It will be right about the same time we’re getting our annual flu vaccine,” Dr. Schaffner says. “If that becomes the case, it will be an interesting challenge for public health and medical experts to persuade people to roll up both their sleeves this fall.”\n\nBut Dr. Russo points out that the success of this booster—if it ends up being authorized for use, as expected—depends on whether the Omicron variant of COVID-19 is still circulating in the fall. “Nobody knows where we’ll be at,” he says. “You want to have the booster shot available that will best protect everyone, but there’s been a new variant about every six months.”\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Moderna Has a New, “Well Tolerated” Omicron Booster—Here’s What We Know About It", "description": "Experts say this could lower your risk of getting sick in the future.", "image": "https://hips.hearstapps.com/hmg-prod/images/bandage-on-arm-of-a-female-after-taking-vaccine-royalty-free-image-1654789664.jpg?crop=1xw:0.74965xh;center,top&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a40241771/moderna-new-omicron-booster/", "article:section": "Health", "article:modified_time": "2022-06-09T16:58:41Z", "article:published_time": "2022-06-09T16:18:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/health-conditions/a38370247/what-is-omicron-covid-19-variant/", "https://www.prevention.com/novel-coronavirus/", "https://investors.modernatx.com/news/news-details/2022/Moderna-Announces-Omicron-Containing-Bivalent-Booster-Candidate-mRNA-1273.214-Demonstrates-Superior-Antibody-Response-Against-Omicron/default.aspx", "https://investors.modernatx.com/news/news-details/2022/Moderna-Announces-Omicron-Containing-Bivalent-Booster-Candidate-mRNA-1273.214-Demonstrates-Superior-Antibody-Response-Against-Omicron/default.aspx", "https://www.prevention.com/health/a39968078/new-variant-explained-symptoms/", "https://covid.cdc.gov/covid-data-tracker/#variant-proportions", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-shortens-interval-booster-dose-moderna-covid-19-vaccine-five-months", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/health/health-conditions/a40179304/omicron-ba-4-ba-5-new-variants-covid-19/", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-06-09T16:18:00Z"}