{"result_id": "245038", "URL": "https://www.prevention.com/health/a38951114/novavax-covid-vaccine-eua/", "timestamp": "2023-04-25 16:53:10 CEST+0200", "meta": {"description": "Novavax is asking the FDA for an emergency use authorization for its COVID-19 vaccine, which works slightly differently than other vaccines on the market. Here's what you need to know.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a38951114/novavax-covid-vaccine-eua/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Novavax Is Asking for Emergency Authorization for Its COVID-19 Vaccine", "cleaned_text": "Biotechnology company Novavax announced Monday that it has officially filed for an emergency use authorization (EUA) for its COVID-19 vaccine from the Food and Drug Administration. The news came on the same day that the Moderna COVID-19 vaccine was granted full approval from the FDA, and more than five months after the Pfizer-BioNTech COVID-19 vaccine was fully approved.\n\nNovavax is requesting that its NVX-CoV2373 protein-based vaccine be authorized for people ages 18 and up, pointing out in a press release that its clinical trials show that the vaccine has a 90% efficacy rate and a “reassuring” safety profile.\n\n“We believe our vaccine offers a differentiated option built on a well-understood protein-based vaccine platform that can be an alternative to the portfolio of available vaccines to help fight the COVID-19 pandemic,” Stanley C. Erck, president and CEO of Novavax, said in a statement.\n\nSome people have questioned why another COVID-19 vaccine is needed at this point, but infectious disease doctors argue that this vaccine fills a void. Here’s what you need to know.\n\nHow does the Novavax vaccine work?\n\nThe Novavax vaccine is a protein-based vaccine that’s created from the genetic sequence of the original SARS-CoV-2, the virus that causes COVID-19. The SARS-CoV-2 spike protein gene is inserted into an insect virus, called a baculovirus. That virus infects insect cells, which pump out the spike protein. Then, the spike proteins are harvested and combined with an adjuvant (an ingredient that creates a stronger immune response in your body), explains William Schaffner, M.D., an infectious disease specialist and professor at the Vanderbilt University School of Medicine.\n\n“The vaccine uses a more traditional approach,” Dr. Schaffner says. “It’s taken the critical part of the spike protein and used it to make the vaccine. The body responds to that part of the spike protein and makes antibodies.”\n\nThe vaccine is designed to be given in two 0.5 milliliter doses, delivered 21 days apart.\n\nThe Novavax vaccine works slightly differently from other vaccines. Those include:\n• mRNA vaccines: These vaccines encode a part of the spike protein that's found on the surface of SARS-CoV-2, the Centers for Disease Control and Prevention (CDC) explains. The mRNA vaccines use pieces of that encoded protein to spark an immune response from your body and develop antibodies. Your body eventually eliminates the protein and the mRNA, but the antibodies stick around.\n• Vector vaccines: These vaccines use an inactivated virus as a carrier to deliver proteins that your body recognizes as a threat. As a result, your body makes antibodies against those proteins. The Johnson & Johnson COVID-19 vaccine is an adenovirus vaccine, which means it uses an inactivated common cold virus.\n• Whole killed vaccines: These vaccines use a killed version of the germ that causes a disease, the U.S. Department of Health and Human Services (HHS) explains. These also prompt an immune response in your body but they don’t usually create as much immunity as those that use live viruses. As a result, you may need several doses over time to have ongoing immunity. Common inactivated vaccines include the flu shot, hepatitis A shot, polio vaccine, and rabies vaccine.\n\nWhat does the data say about the Novavax vaccine?\n\nNovavax has done two Phase 3 clinical trials: The PREVENT-19 trial, which enrolled about 30,000 people in the U.S. and Mexico, and another trial that had almost 15,000 participants in the U.K.\n\nIn the U.K. trial, there were 56 cases of COVID-19 in the placebo group and six cases in the vaccinated group, leading an efficacy rate of 89.3%. In the PREVENT-19 trial, 63 people who received a placebo shot got COVID-19 and 14 of those who were vaccinated contracted the virus, giving the vaccine a 90.4% efficacy rate.\n\nThe most common side effects from the trials included:\n\nWhy is the Novavax vaccine needed now?\n\nThere are already two COVID-19 vaccines that are fully approved by the FDA for use—Moderna and Pfizer-BioNTech—and another (Johnson & Johnson) that is operating under an EUA. So why is another COVID-19 vaccine needed?\n\nThomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo in New York, acknowledges that, “we now have enough COVID-19 vaccine to vaccinate everyone we want.” But, he says, “Novavax has a chance to be a niche vaccine for those individuals that believe the mRNA vaccines are ‘experimental.’”\n\nNovavax’s more traditional approach to vaccination “may be more palatable to some,” Dr. Russo says. “As a result,” he adds, “we may be able to move the dial with these people.”\n\nIt’s also just good to have more options, says infectious disease expert Amesh A. Adalja, M.D., a senior scholar at the Johns Hopkins Center for Health Security. “The larger the menu for COVID vaccines, the better,” he says.\n\nDr. Schaffner says the Novavax vaccine can also be a helpful option for “the very small minority” of people who are allergic to ingredients in the mRNA vaccines. And, he says, more ways of fighting COVID-19 are always better.\n\n“In general, we always like to have more vaccine manufacturers, particularly in pandemic circumstances,” he says. “Who knows when a new variant will surface and more options will be needed?”\n\nNovavax's clinical trial data and EUA application has been submitted to the FDA. It's unclear when it will be granted, if it is at all.\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Novavax Is Asking for Emergency Authorization for Its COVID-19 Vaccine", "description": "While other COVID-19 vaccines have been out for months, experts say this is still needed.", "image": "https://hips.hearstapps.com/hmg-prod/images/healthcare-worker-prepares-a-dose-of-covid-19-royalty-free-image-1643729613.jpg?crop=1.00xw:0.753xh;0,0.192xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a38951114/novavax-covid-vaccine-eua/", "article:section": "Health", "article:modified_time": "2022-02-04T20:18:29Z", "article:published_time": "2022-02-01T17:45:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-takes-key-action-approving-second-covid-19-vaccine", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine", "https://ir.novavax.com/2022-01-31-Novavax-Submits-Request-to-the-U-S-FDA-for-Emergency-Use-Authorization-of-COVID-19-Vaccine", "https://ir.novavax.com/2022-01-31-Novavax-Submits-Request-to-the-U-S-FDA-for-Emergency-Use-Authorization-of-COVID-19-Vaccine", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/mrna.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/janssen.html", "https://www.hhs.gov/immunization/basics/types/index.html", "https://c212.net/c/link/?t=0&l=en&o=3428978-1&h=4185830657&u=https%3A%2F%2Fwww.nejm.org%2Fdoi%2Ffull%2F10.1056%2FNEJMoa2116185%3Fquery%3Dfeatured_home&a=New+England+Journal+of+Medicine", "https://c212.net/c/link/?t=0&l=en&o=3428978-1&h=889537351&u=https%3A%2F%2Fwww.nejm.org%2Fdoi%2Ffull%2F10.1056%2FNEJMoa2107659&a=NEJM", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/health/a38941944/stealth-omicron-symptoms/", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-02-01T17:45:00Z"}