{"result_id": "245018", "URL": "https://www.prevention.com/health/a41574869/ebola-virus/", "timestamp": "2023-04-25 16:52:40 CEST+0200", "meta": {"description": "After Uganda’s outbreak, the CDC urges doctors to be on alert for Ebola—also known as Ebola virus disease (EVD) and Ebola hemorrhagic fever (EHF)—a rare but deadly virus.", "lang": "en", "keywords": "embed2022", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a41574869/ebola-virus/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "CDC Says America Needs to Be Ready for Ebola Following Outbreak", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) is urging healthcare workers in the U.S. to consider Ebola when patients have symptoms, while airport officials are also screening passengers from Uganda for the deadly disease.\n\nThe CDC issued a health advisory late last week to raise awareness of an outbreak of Ebola virus disease in Uganda caused by Sudan virus. The alert stresses that there are no suspected, probable, or confirmed cases of Ebola related to the outbreak in the U.S., but the CDC is reminding physicians about best practices around Ebola to “raise awareness” of the outbreak.\n\nThe advisory notes that there is no vaccine licensed by the Food and Drug Administration (FDA) to protect against this strain of Ebola, and that the current Ebola vaccine licensed in the U.S. is “not expected to protect against Sudan virus or other viruses in the Ebolavirus genus.” The advisory also points out that there is currently no FDA-approved treatment for the Sudan virus strain of Ebola.\n\nAs a result of the outbreak in Uganda, CDC officials ordered airport screenings for passengers arriving from Uganda and the state department followed that with a health alert that said all people arriving to the U.S. from Uganda—including Americans—will need to be screened for Ebola “out of an abundance of caution.”\n\nIt’s understandable to have questions about Ebola based on all of this. Here’s what you need to know about Ebola virus.\n\nOn Sept. 20, Uganda’s Ministry of Health declared an outbreak of Ebola virus disease due to Sudan virus in the country’s Mubende District, per the CDC.\n\nThe first confirmed case of Ebola in this outbreak was of a 25-year-old man who was hospitalized and isolated with Ebola-like symptoms that were later confirmed to be from the disease. He died the same day. Once health officials investigated his contacts, they discovered that there were a cluster of unexplained deaths in his community from the previous month.\n\nAs of last week, there have been 44 confirmed cases of Ebola, 10 confirmed deaths, and 20 probable deaths from the virus in Uganda from this outbreak.\n\nThis is actually the fifth outbreak of Ebola from the Sudan virus in Uganda since 2000.\n\n\n\nEbola, aka Ebola Virus Disease (EVD), is a rare and deadly disease that occasionally causes outbreaks that usually happen in Africa, the CDC explains.\n\nEbola causes severe bleeding and organ failure, and is often deadly.\n\nThe virus was first discovered in 1976 in the Democratic Republic of Congo, although scientists aren’t sure where the virus comes from.\n\nSymptoms of Ebola usually show up between eight and 10 days after a person is infected, the CDC says, and they usually progress from “dry” symptoms like a fever, aches, and pains, to “wet” symptoms like diarrhea and vomiting.\n\nThere is a vaccine to prevent Ebola—the FDA approved the Ebola vaccine rVSV-ZEBOV, aka Ervebo, in late 2019. However, the vaccine only targets Zaire ebolavirus, which has caused the biggest and most deadly Ebola outbreaks so far, the CDC points out.\n\nEbola spreads through direct contact with blood or body fluids of a person who is sick or has died from the virus, objects that have been contaminated with body fluids from a person who is sick, infected fruit bats or non-human primates, and sex from a man who recovered from the virus (it can remain in body fluids), the CDC says.\n\nEbola is “not very contagious,” though and “can be halted with simple precautions when dealing with infected, symptomatic patients,” says infectious disease expert Amesh A. Adalja, M.D., senior scholar at the Johns Hopkins Center for Health Security.\n\nA big thing to note: The virus “only becomes contagious one the individual becomes sick,” per William Schaffner, M.D., an infectious disease specialist and professor at the Vanderbilt University School of Medicine. He adds, “it becomes very contagious once the person becomes seriously ill.” A that point, Dr. Schaffner says, personal contact with someone who is sick becomes dangerous.\n\nThe Ebola death rate depends on the strain, Dr. Adalja says. But the average fatality rate for Ebola is around 50%, according to the Pan American Health Organization (PAHO). Meaning, half of people with Ebola die, on average.\n\nHowever, PAHO says that fatality rates have ranged from 25% to 90% in past outbreaks.\n\nTreatment can be tricky. “Ebola is generally treated with supportive care such as IV fluids, fever reduction, and electrolyte replacement,” Dr. Adalja says, noting that there are monoclonal antibody treatments for Zaire ebolavirus—which is different from the current strain fueling the outbreak.\n\nThere are “zero specific treatments” for Ebola due to Sudan virus, Dr. Adalja says.\n\nStill, experts aren’t concerned about an Ebola outbreak happening in the U.S. “It’s very unlikely,” Dr. Schaffner says. “[The world] has had many outbreaks in the past and, although we have had the occasional patient come to the U.S. and develop the illness, there has been no spread in the U.S. worth talking about,” he says.\n\nRichard Watkins, M.D., an infectious disease physician and a professor of internal medicine at the Northeast Ohio Medical University, agrees that people shouldn’t panic. “The average American doesn’t need to be worried at this point,” he says. “They should be thinking about their flu shots and COVID boosters.”", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "CDC Says America Needs to Be Ready for Ebola Following Outbreak", "description": "The rare but deadly virus is currently spreading in Uganda.", "image": "https://hips.hearstapps.com/hmg-prod/images/ebola-virus-royalty-free-illustration-1665417177.jpg?crop=1xw:0.74982xh;center,top&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a41574869/ebola-virus/", "article:section": "Health", "article:modified_time": "2022-11-16T19:30:03Z", "article:published_time": "2022-10-10T16:31:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://emergency.cdc.gov/han/2022/han00477.asp", "https://www.cdc.gov/quarantine/pdf/CDC-EVD-Contact-Tracing-Order_03-02-2021_encrypted-p.pdf", "https://ug.usembassy.gov/health-alert-enhanced-screening-at-designated-u-s-airports-u-s-embassy-kampala-uganda-october-6-2022/", "https://www.cdc.gov/vhf/ebola/about.html", "https://www.cdc.gov/vhf/ebola/symptoms/index.html", "https://www.fda.gov/news-events/press-announcements/first-fda-approved-vaccine-prevention-ebola-virus-disease-marking-critical-milestone-public-health#:~:text=The%20U.S.%20Food%20and%20Drug,years%20of%20age%20and%20older.", "https://www.cdc.gov/vhf/ebola/transmission/index.html", "https://www.paho.org/en/topics/ebola-virus-disease#:~:text=The%20virus%20is%20transmitted%20to,key%20to%20successfully%20controlling%20outbreaks.", "https://www.prevention.com/health/a37375072/flu-shot-covid-booster-vaccine-together/", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-10-10T16:31:00Z"}