{"result_id": "245011", "URL": "https://www.prevention.com/health/a40395255/monkeypox-vaccine-nyc-clinic/", "timestamp": "2023-04-25 16:52:23 CEST+0200", "meta": {"description": "NYC will now be offering the two-dose JYNNEOS vaccine to eligible people who may have had recent exposure to monkeypox, due to the city’s high number of cases.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a40395255/monkeypox-vaccine-nyc-clinic/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "NYC Becomes First Major U.S. City to Offer Monkeypox Vaccine—Here’s What to Know", "cleaned_text": "\n• NYC will begin offering vaccines against monkeypox to at-risk groups.\n• The JYNNEOS vaccine has been approved by the FDA for the prevention of monkeypox for those 18 and older.\n• New York has 22 cases of monkeypox as of today.\n\nNew York City will begin offering vaccination against monkeypox to at-risk groups on Thursday, as public health officials race to contain the global outbreak.\n\nNYC will be the first major U.S. city to offer a monkeypox vaccine, which will be administered at a temporary vaccine clinic in Chelsea. “NYC is following the U.K. in broadening the eligibility for monkeypox vaccine, pivoting from post-exposure ring vaccination to vaccination of high risk individuals,” says Amesh A. Adalja M.D., a board-certified infectious disease doctor at Johns Hopkins University. The move to offer the vaccination also follows similar efforts in Canadian cities including Montreal and Toronto.\n\nThe CDC recently ramped up its monkeypox alert to level 2, and encouraged people to practice “enhanced precautions” to lower their risk of contracting the virus. As of now, the CDC reports that 22 people have tested positive for the virus in the city. Altogether, New York City represents more than 14% of all cases diagnosed nationwide.\n\n“I suspect other areas that have a significant number of cases will follow suit if it becomes difficult to locate contacts of cases to ring vaccinate,” says Dr. Adalja. So other states with a large proportion of monkeypox cases, such as California, Illinois, and Florida, are likely to offer similar vaccination opportunities soon.\n\nIn comparison to the early days of the COVID-19 pandemic, when there were no effective treatment options, there are already several vaccines that work against the orthopoxvirus that causes monkeypox.\n\nWhat do we know about the vaccine for monkeypox?\n\nThe two-dose JYNNEOS vaccine, which has been approved by the FDA for the prevention of monkeypox for those 18 and older, will be administered to eligible people who may have had recent exposure to monkeypox. Although, it’s important to note that the “vaccine is not used to *treat* monkeypox but to prevent it,” Dr. Adalja adds.\n\nAccording to the NYC.gov website, “Gay, bisexual and other men (ages 18 and older) who have sex with men and have had multiple or anonymous sex partners in the last 14 days are eligible to receive the vaccine. Vaccination is free and available regardless of immigration status.” The website also notes, “People who have a fever, rash or sores that may be monkeypox cannot get vaccinated. Instead, they should separate from others and contact a health care provider.”\n\nMonkeypox spreads only by the virus entering the body through broken skin or the eyes, nose, or mouth. It’s also possible to get monkeypox by being bitten or scratched by an infected animal, or by having direct or indirect contact with body fluids or lesions from infected people.\n\nThomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo in New York, recommends that you avoid “close intimate contact” with someone who has monkeypox symptoms or that you know has had contact with someone with monkeypox. “It does take a large exposure to get it,” he says. “This is not something you’ll pick up by passing someone on the street.”\n\nAs of press time, the temporary clinic that will be administering the vaccines will be located at the Chelsea Sexual Health Clinic (303 Ninth Avenue in Manhattan), according to the NYC Health Department. Appointments are recommended and are currently filled through Monday, June 27th, though more appointment slots are expected to open Sunday, June 26th. The clinic will be open on Mondays, Tuesdays, Thursdays, Fridays, and Sundays from 11 a.m. to 7 p.m. moving forward.\n\nWill other states offer the monkeypox vaccine?\n\nWhile information regarding vaccines being offered in other states is not available at this time, we plan to keep readers updated with information from the CDC regarding vaccine availability.\n\nThis article is accurate as of press time. However, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC and WHO to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "NYC Becomes First Major U.S. City to Offer Monkeypox Vaccine—Here’s What to Know", "description": "New York City represents more than 14% of all cases diagnosed nationwide.", "image": "https://hips.hearstapps.com/hmg-prod/images/monkeypox-virus-royalty-free-image-1654529531.jpg?crop=1.00xw:0.892xh;0,0&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a40395255/monkeypox-vaccine-nyc-clinic/", "article:section": "Health", "article:modified_time": "2022-06-23T19:25:29Z", "article:published_time": "2022-06-23T18:50:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a37066284/what-is-monkeypox-virus/", "https://www.prevention.com/health/a40218558/cdc-monkeypox-travel-alert/", "https://www.cdc.gov/poxvirus/monkeypox/response/2022/us-map.html", "https://www.prevention.com/novel-coronavirus/", "https://www.prevention.com/health/a40206906/what-is-orthopox/", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7122e1.htm", "https://www1.nyc.gov/site/doh/health/health-topics/monkeypox.page", "https://www.prevention.com/health/health-conditions/a40104567/how-does-monkeypox-spread/", "https://www1.nyc.gov/site/doh/health/health-topics/monkeypox.page", "https://www.cdc.gov/poxvirus/monkeypox/index.html", "https://www.who.int/news-room/questions-and-answers/item/monkeypox", "/author/246479/madeleine-haase/"], "authors": [], "publish_date": "2022-06-23T18:50:00Z"}