{"result_id": "245043", "URL": "https://www.prevention.com/health/a33658101/vaccine-definition-facts/", "timestamp": "2023-04-25 16:53:20 CEST+0200", "meta": {"description": "Vaccines have a long history of saving millions of lives. These facts about vaccine history, how they are made, and why they work will put any doubts to rest.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a33658101/vaccine-definition-facts/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "10 Important Facts About the Life-Changing Power of Vaccines", "cleaned_text": "With high hopes that a vaccine against COVID-19 will be available soon—and a small but vocal group of vaccine skeptics expressing doubts about the safety of vaccines in general—Prevention wanted to be sure our readers are well-informed. Check out these 10 facts about the way vaccines are made, how they work, and why they save lives.\n\n\n\nWhen bacteria or a virus enters your system, it attacks and multiplies, causing infection and triggering your body to manufacture antibodies to fight the infection. But even after you recover, your body remains armed against reinfection with memory cells that can now defeat this invader. A vaccine builds this antibody arsenal by purposely introducing the invader into your body in a form that is either dead or weakened to the point where it can’t do harm.\n\nPolio, hepatitis A, and rabies vaccines contain dead virus, while the MMR (measles, mumps, rubella), varicella (a.k.a. chickenpox), and rotavirus vaccines are made from weakened virus—strong enough to create an immune response but not powerful enough to make you sick.\n\n“You get the immune response that’s the product of natural infection without having to pay the price of the natural infection,” says Paul Offit, M.D., director of the Center for Vaccine Research at Children’s Hospital of Philadelphia.\n\nVaccines can take decades to make.\n\nThese medications are developed in several stages. “The vaccine and the process of how it’s made need to be absolutely consistent; it can’t be rushed,” says Dr. Offit. Releasing a vaccine too soon can result in more illness and even death. That’s because it needs to be extensively tested in both animals and humans for safety, efficacy, and side effects; plus, we need to know that each batch created will be identical and meet a high standard.\n\nSo how is it possible that a COVID-19 vaccine could be available sooner? If the threat of a virus is seen as greater than the potential threat of a vaccine that hasn’t been out there long, people will accept a degree of uncertainty, says Dr. Offit.\n\nYou may feel crappy for a day or two after a shot.\n\nOr you may not. If you notice anything at all, it may be soreness at the injection site or, at most, feeling funky with a low fever or a headache for a day or two. This is usually a good sign: It means that your body is building immunity to the disease you have been inoculated against. Sometimes a chemical known as an adjuvant, used to enhance immune response so fewer active ingredients or doses are needed, can also produce these symptoms, as with the shingles vaccine. “It can cause headaches and muscle aches severe enough to make you miss a day’s work,” Dr. Offit says. “But that’s still better than getting shingles.”\n\nGetting inoculated safeguards you and everyone around you. “If enough people are protected, then you don’t have to worry about an outbreak if just one person gets sick,” says Maria Elena Bottazi, Ph.D., codirector of the Texas Children’s Hospital Center for Vaccine Development in Houston. This is called “herd immunity”—it doesn’t mean you can skip the vaccine and be sure of staying well, but it does mean the disease won’t spread like wildfire.\n\nVery contagious viruses like measles require 95% of people to be vaccinated to prevent outbreaks. Polio is less contagious and needs 80% to 85% of community inoculation for herd immunity. It can take years to achieve because of how carefully vaccines are rolled out to make sure they are safe, says Bottazzi.\n\nThe first inoculation was developed in China a thousand years ago.\n\nIt was for smallpox, known as “the speckled monster” for its painful pus-filled blisters, soaring fevers, and a 20% to 60% kill rate (up to 98% in infants). In around A.D. 1000, Chinese physicians are thought to have pioneered a technique that involved rubbing fluid from pox pustules into scratches on the arms and legs of healthy people (another technique involved blowing the infected dust from scabs up into the nostrils). Introducing this weakened form of the virus did sometimes cause mild symptoms, but the death rate fell to 3%.\n\nThe first actual injection of a weakened form of smallpox into \n\na healthy person was developed by a British physician in the late 18th century. To this day, smallpox is one of only three diseases, including polio 2 and 3, that have been globally eradicated because vaccines for them were embraced.\n\n“At this point we could also eradicate measles and rubella [German measles],” says Dr. Offit. “You just have to get everyone in the world to take the vaccine. In countries with war or political upheaval, it’s not always easy to get it from tarmac to child.”\n\nNo two vaccines are alike.\n\nThat’s because no two viruses are alike, and some require more than one dose to create an immune response. One shot of the measles vaccine, for instance, is 93% effective, but the MMRV vaccine is less so in a single dose and thus is spread out over two shots. Tetanus too requires several injections to build protective immunity, then a booster every decade. The flu shot is consistently only 50% effective, and that’s because the flu mutates every year, often unpredictably. Still, with 30 million cases of flu a year and 65,000 deaths, Dr. Offit notes, “even at 50%, it has value because it keeps a majority of sufferers out of the hospital and out of the morgue.”\n\nMeasles-related deaths fell by 79% between 2000 and 2014 as a result of global access to the vaccine, sparing 17.1 million lives, according to the World Health Organization. Among children born between 1994 and 2013, the CDC estimates that the measles vaccine will prevent 21 million hospitalizations and 732,000 deaths over the course of their lifetimes. Between 1963 and 2015 in the U.S., vaccines thwarted a total of 200 million cases of polio, measles, mumps, rubella, varicella, adeno­virus, rabies, and hepatitis A. Unfortunately, 2019 saw a huge spike in measles cases, 73% of which were due to people’s not having their children vaccinated.\n\nThere’s no evidence that vaccines cause autism.\n\nScience has taken claims that vaccines cause autism in children seriously enough to have conducted numerous studies worldwide on hundreds of thousands of kids. The three major contentions of vaccine opponents have been that the MMR vaccine has sparked autism in otherwise healthy children; that autism is caused by thimerosal, a mercury-containing preservative that was removed from children’s vaccines two decades ago; and that children are given too many vaccines too soon, overwhelming their bodies and resulting in autism.\n\nAccording to Dr. Offit, in the case of measles, mumps, and rubella, of 18 studies done in seven countries over three continents on hundreds of thousands of children, none have shown a connection between vaccines and autism. As the Autism Science Foundation puts it, “The results of studies are very clear; the data show no relationship between vaccines and autism.”\n\nThere are diseases that vaccines have made us all but forget.\n\nThey include polio, tetanus, hepatitis A and B, rubella, mumps, whooping cough, rotavirus, smallpox, measles, and more. Vaccines save money as well: The CDC estimates that inoculation against measles alone has spared the U.S. $295 billion in hospitalization costs and nearly $1.4 trillion in societal costs over a 15-year span.\n\nMoney often influences which vaccines get made (and which ones don’t).\n\nThe Texas Children’s Hospital Vaccine Research Center has been developing vaccines for hookworm and schistosomiasis, two diseases caused by parasites, for two decades. But lack of funding for advanced clinical trials is holding them up. Both illnesses are known as neglected tropical diseases (NTDs), meaning they afflict people who live in poor and underserved communities; as such, their vaccines have little to no commercial potential.\n\n“There is definitely inequity in vaccine research,” Bottazzi says. “If the vaccine doesn’t impact wealthy, high-income populations, for-profit vaccine manufacturers don’t tend to invest.”\n\nThe U.S. Army and Walter Reed Institute of Research, however, have provided support, Bottazzi adds, as military personnel are stationed in places where illnesses like these are a risk: “Clearly there are a lot of returns because these vaccines will improve the health of populations around the world.”\n\nThis article originally appeared in the August 2020 issue of Prevention.\n\nLike what you just read? You’ll love our magazine! Go here to subscribe. Don’t miss a thing by downloading Apple News here and following Prevention. Oh, and we’re on Instagram too.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "10 Important Facts About the Life-Changing Power of Vaccines", "description": "There are diseases that vaccines have made us all but forget.", "image": "https://hips.hearstapps.com/hmg-prod/images/arrow-hits-and-destroys-the-coronavirus-codiv19-royalty-free-image-1599959291.jpg?crop=1.00xw:0.660xh;0,0.146xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a33658101/vaccine-definition-facts/", "article:section": "Health", "article:modified_time": "2021-11-02T01:29:19Z", "article:published_time": "2020-09-13T13:30:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/novel-coronavirus/", "https://www.prevention.com/health/a32080212/coronavirus-vaccine/", "https://www.prevention.com/health/health-conditions/a33626037/why-get-coronavirus-vaccine/", "https://www.prevention.com/health/a31282500/top-germ-locations/", "https://www.prevention.com/health/a32957865/how-long-do-coronavirus-antibodies-last/", "https://www.chop.edu/centers-programs/vaccine-education-center/making-vaccines/how-are-vaccines-made", "https://www.mayoclinic.org/diseases-conditions/hepatitis-a/symptoms-causes/syc-20367007", "https://www.cdc.gov/measles/index.html", "https://www.prevention.com/health/a31286522/how-to-boost-immune-system/", "https://www.chop.edu/doctors/offit-paul-a", "https://www.prevention.com/health/health-conditions/a25050076/flu-shot-side-effects/", "https://www.prevention.com/health/health-conditions/a27395847/natural-headache-relief/", "https://www.cdc.gov/shingles/index.html", "https://www.bcm.edu/people-search/maria-bottazzi-18431", "https://www.prevention.com/health/a32209398/herd-immunity-coronavirus/", "https://bmcmedicine.biomedcentral.com/articles/10.1186/s12916-019-1413-7", "https://www.cdc.gov/polio/what-is-polio/index.htm#:~:text=Polio%2C%20or%20poliomyelitis%2C%20is%20a,move%20parts%20of%20the%20body).", "https://www.ovg.ox.ac.uk/news/herd-immunity-how-does-it-work", "https://www.cdc.gov/smallpox/about/index.html", "https://pubmed.ncbi.nlm.nih.gov/26636066/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1200696/", "https://www.mayoclinic.org/diseases-conditions/rubella/symptoms-causes/syc-20377310#:~:text=Rubella%20is%20a%20contagious%20viral,mothers%20become%20infected%20during%20pregnancy.", "https://www.cdc.gov/tetanus/index.html", "https://www.prevention.com/health/a28634992/where-to-get-flu-shot/", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019?gclid=Cj0KCQjwvvj5BRDkARIsAGD9vlLj0-vBAKqsBQ5g579Iht2vfiO6Nk6BNFwbdSeT2tB8Kt9IVCm-BeUaAmu1EALw_wcB", "https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6316a4.htm", "https://www.mayoclinic.org/diseases-conditions/rabies/symptoms-causes/syc-20351821#:~:text=Rabies%20is%20a%20deadly%20virus,%2C%20foxes%2C%20raccoons%20and%20skunks.", "https://www.sciencedaily.com/releases/2017/03/170303163208.htm", "https://www.cdc.gov/vaccinesafety/concerns/thimerosal/index.html", "/health/health-conditions/a33626037/why-get-coronavirus-vaccine/", "https://www.chop.edu/centers-programs/vaccine-education-center/video/do-vaccines-cause-autism", "https://autismsciencefoundation.org/what-is-autism/autism-and-vaccines/", "https://www.texaschildrens.org/departments/vaccine-development", "https://www.wrair.army.mil/", "https://subscribe.hearstmags.com/subscribe/splits/prevention/pre_sub_nav_link?source=pre_sub_article", "https://apps.apple.com/us/app/apple-news/id1066498020", "https://www.instagram.com/preventionmag/"], "authors": [], "publish_date": "2020-09-13T13:30:00Z"}