{"result_id": "245028", "URL": "https://www.prevention.com/health/a37375072/flu-shot-covid-booster-vaccine-together/", "timestamp": "2023-04-25 16:52:53 CEST+0200", "meta": {"description": "Here’s what experts say about the side effects and safety of simultaneous administration of this year’s flu shot and a bivalent covid booster.", "lang": "en", "keywords": "Can You Get the Flu Shot and COVID Vaccine or Booster at the Same Time? covid booster, flu shot", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a37375072/flu-shot-covid-booster-vaccine-together/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Can You Get the Flu Shot and Omicron Booster at the Same Time? Experts Weigh In", "cleaned_text": "Earlier this month, the highly anticipated Omicron booster finally rolled out. This COVID-19 booster is specially designed to target Omicron strains of the virus, i.e. what’s circulating right now, making it a good option to have in your COVID-fighting arsenal. But, of course, we’re also entering flu season, making it the right time to get your annual flu shot.\n\nBut this leads us to wonder: can you get your flu shot and Omicron booster at the same time? The short answer is yes, but it’s understandable to be a little wary of doubling up, especially if you’ve had side effects from either shot in the past. Here’s what infectious disease doctors and the Centers for Disease Control and Prevention (CDC) recommend, so you can get both important vaccines, worry free.\n\nIs it safe to get the Omicron booster and flu shot at the same time?\n\nYes. “The influenza vaccine and the COVID-19 booster can be given at the same time,” says Amesh A. Adalja, M.D., a senior scholar at the Johns Hopkins Center for Health Security. “They have been studied in joint administration and there’s no untoward effect.”\n\nWhen the COVID-19 vaccines were first granted emergency use authorization (EUA), the CDC recommended waiting 14 days between getting that and any other vaccine, says Thomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo in New York. This was in order to make sure both vaccines would be effective and to minimize side effects. But the CDC now says that it’s OK to get a COVID-19 vaccine and other vaccines in the same visit.\n\nThe CDC notes that studies done throughout the pandemic “indicate that it is safe to get both a COVID-19 vaccine and a flu vaccine at the same visit.” The CDC specifically cites a JAMA study that suggests that people who got a flu vaccine and an mRNA COVID-19 booster vaccine at the same time were only slightly more likely to say they had side effects—we’re talking a difference of 11% with both shots at once compared to 8% of those who got them separately. \n\n\n\nBut is it a good idea to get the flu vaccine and Omicron booster at once?\n\nAgain, the CDC says you’re perfectly fine to go this route. But doctors say you might want to consider a few things before you roll up both sleeves at once.\n\nAt a very basic level, you could be dealing with two sore arms, says William Schaffner, M.D., an infectious disease specialist and professor at the Vanderbilt University School of Medicine. “You’ll get an inoculation in each arm,” he points out. “It’s OK to do this and your body will deal with it in a perfectly normal way, but do you want to be walking around with two sore arms at once?”\n\nThere’s a slight chance you might have more side effects\n\nAgain, that JAMA study found that there’s a slight chance you might have more side effects if you get both shots at once. According to the study, those included:\n\nWorth noting: Those reactions were mostly mild and went away quickly, per the study.\n\nSide effects will depend on your past reactions to both vaccines\n\nIf you’re worried about worsening potential side effects, like a fever or feeling blah, if you get the vaccines together, Dr. Schaffner says that “a lot will depend on your previous experience with the vaccines.” Meaning, if you tend to get a slight fever after the flu vaccine and you got a fever after your COVID-19 vaccine, there’s a decent chance you’ll experience the same if you get them together—and possibly even more intensely than if you receive one at a time. Ditto for having a sore arm, or any other side effect.\n\nIf you’re nervous about having your flu shot and Omicron booster at once, you can space them out\n\nAgain, you can absolutely get these shots together. But, if you’re concerned and feel more comfortable spacing them out, Dr. Schaffner says you can definitely do that.\n\n\n\n“There’s no rule about how far you should space them apart because you can get them at the same time,” he says. “But I would suggest that, if you want to wait, you get one and then wait a few days to make sure you feel fine. Then, get the other.”\n\nRuss Lampen, D.O., an infectious disease specialist with Spectrum Health, suggests waiting “about a week” between shots “since side effects for either the flu or COVID vaccine rarely last more than two days,” he says.\n\nAs for which one to get first, Dr. Schaffner recommends going with your Omicron booster first. “COVID is out there now, so I would be included to get that booster first,” he says. “Then, get the influenza vaccine.”\n\n“If it’s more convenient for you to get both vaccines at once, then go for it,” Dr. Schaffner says. But, if you’re nervous about that, consider spacing them out a few days.\n\nWhatever you do, doctors recommend getting both the Omicron booster and the flu shot. “The consequences of getting both COVID and the flu are not great,” Dr. Russo says. “You’ll want to get vaccinated.”", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Can You Get the Flu Shot and Omicron Booster at the Same Time? Experts Weigh In", "description": "Plus, what they say about safety and side effects.", "image": "https://hips.hearstapps.com/hmg-prod/images/young-woman-rolled-a-sleeve-royalty-free-image-1631306031.jpg?crop=1.00xw:0.752xh;0,0.0553xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a37375072/flu-shot-covid-booster-vaccine-together/", "article:section": "Health", "article:modified_time": "2022-09-26T17:23:17Z", "article:published_time": "2022-09-26T17:23:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/flu/prevent/vaccinations.htm#when", "https://www.prevention.com/health/health-conditions/a41211574/omicron-covid-booster-vaccine-side-effects/", "https://www.cdc.gov/flu/prevent/vaccinations.htm#when", "https://www.cdc.gov/flu/season/faq-flu-season-2022-2023.htm", "https://www.prevention.com/health/health-conditions/a37759046/how-effective-is-the-flu-vaccine/", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2794318", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2794318", "https://www.prevention.com/health/a41193176/omicron-booster-covid-vaccine-first/", "/health/a41126997/bad-flu-season-winter-2022/", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2022-09-26T17:23:00Z"}