{"result_id": "245017", "URL": "https://www.prevention.com/health/health-conditions/a40531124/covid-19-vaccine-linked-to-short-term-changes-in-menstrual-cycle-length-study-suggests/", "timestamp": "2023-04-25 16:52:38 CEST+0200", "meta": {"description": "A new study shows that your COVID-19 vaccine may temporarily change your menstrual cycle length and regularity. Some report heavier period flows.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/health-conditions/a40531124/covid-19-vaccine-linked-to-short-term-changes-in-menstrual-cycle-length-study-suggests/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "New Study Suggests COVID-19 Vaccine Linked to Short-Term Period Changes", "cleaned_text": "\n• A new study shows that women may experience short-term changes in their menstrual cycles after COVID-19 vaccination.\n• The researchers found that these changes were associated with all COVID-19 vaccine types. But, experts still recommend people who menstruate receive their COVID-19 vaccines.\n• “The good news from the data is that the changes were temporary and short-lived without long-term consequences.”\n\nSince the first wave of COVID-19 vaccinations became available, we have continued to learn more and more about how the shot affects our bodies, most side effects being of little consequence. And while this remains true, a new study suggests that COVID-19 vaccines may affect your period.\n\nSpecifically, medical professionals have now identified a potential link between COVID-19 vaccination and short-term changes in menstrual cycle length and regularity. The study (the largest one to date) was published last week by researchers from the University of Illinois, Urbana-Champaign and its findings have already raised several questions for people who menstruate.\n\nEarly in 2021, many people began sharing that they experienced unexpected menstrual bleeding after receiving their initial COVID-19 vaccine. To investigate this phenomenon further, researchers asked 39,129 individuals who received a two-dose SARS-CoV-2 vaccination a series of questions about period changes and vaccine experiences.\n\nIn this sample, 42% of people with regular menstrual cycles said that they bled more heavily than usual after getting vaccinated, while 44% reported no change. Among respondents who typically do not menstruate, 71% of people on long-acting reversible contraceptives, 39% of people on gender-affirming hormones, and 66% of postmenopausal people reported breakthrough bleeding.\n\nResearchers also found that increased/breakthrough bleeding after vaccination was significantly associated with older age, systemic vaccine side effects (fever and/or fatigue), a lighter typical menstrual flow, having previously been pregnant or given birth, and ethnicity—specifically Hispanic/Latinx. For non-menstruating premenopausal people, breakthrough bleeding was more likely if they had previously been pregnant and/or given birth. For postmenopausal people, breakthrough bleeding was more likely for those who were Hispanic/Latinx. Lastly, regularly menstruating people with endometriosis, menorrhagia, fibroids, and PCOS were slightly more likely to experience heavier bleeding.\n\nUltimately, the results from this study demonstrated that respondents in the sample who menstruate regularly were about equally likely to have no bleeding changes after vaccination at all or to have heavier periods after vaccination. A much smaller proportion of people had lighter periods. The study highlighted that “generally, changes to menstrual bleeding are not uncommon or dangerous, yet attention to these experiences is necessary to build trust in medicine.”\n\nIt’s important to note the limitations of this study as well. Because this study was solely based on personal responses from participants, the results may have been skewed due to self-reporting bias. And, people who are experiencing menstrual changes are more likely to have completed the survey. Additionally, this study did not compare the results with a control group of people who were unvaccinated.\n\nKate White, M.D., Associate Professor of OB/GYN at Boston University School of Medicine, and author of Your Sexual Health: A Guide to Understanding, Loving and Caring for Your Body, agrees that this study is limited by the web-based design. “In addition, a very high percentage of the respondents were white, which may not reflect the experiences of all people. But the size of the study (over 39,000 people) is an incredible strength.”\n\nStill, these findings are in line with smaller studies that have reported menstrual changes after vaccination while utilizing a control group (unvaccinated people).\n\nWhat should we take away from these new findings?\n\n“Many women noticed changes in their menstrual cycle after receiving the Covid vaccine and their concerns were often brushed off or they were told their cycle was impacted by anxiety. This study highlights the fact that women know their bodies best and the changes weren't in their ‘heads,’ but rather a real side effect from the vaccine,” says Jennifer Wider, M.D., a women’s health expert. She adds that “the good news from the data is that the changes were temporary and short-lived without long-term consequences.”\n\nThese new findings will likely affect how medical professionals consider the after-effects of the COVID-19 vaccines, and take further consideration of menstrual health in trials for other vaccines. Dr. Wider says that “this study emphasizes how important it is for researchers to monitor menstrual health in future vaccine trials and to get a better handle on the underlying biological mechanisms at play.”\n\nShould people with periods still get vaccinated?\n\nThe answer is yes. “All people, whether or not they menstruate, should get the COVID vaccine,” says Dr. White. “It’s important for doctors to counsel patients that the vaccine may temporarily disrupt their periods, but there’s no long-term impact on your periods, and the vaccine doesn’t affect your fertility at all.”\n\nDr. White continues, saying “COVID-19 continues to be a serious infection for many people, and everyone is at risk of repeated infection with the new variants (though the vaccine still provides protection from both any infection and from severe infection)...so the protection of the vaccine is worth the short-term mucking with your periods.”\n\nGiven that the menstrual changes seen in the participants of the study were temporary and short-lived, Dr. Wider agrees, saying that “the importance of getting vaccinated far outweighs the short-term risk of having a change in your menstrual cycle.”\n\nDr. Wider adds that this study “should raise awareness for women who have irregular periods or lighter bleeding cycles that they may experience changes or heavier bleeding and that it would be likely caused by the vaccine.” So, ultimately, the study should serve as a potential explanation for heavier menstrual cycles in some, post-vaccination.\n\nCan COVID-19 infection affect menstruation as well?\n\nAccording to Dr. Wider, “women who had COVID have reported a change in their menstrual cycle.” However, more studies are definitely needed to tease out why that may be the case.\n\n“Any infection (or serious stress) can affect your periods,..and early studies have shown that COVID-19 infection can change your periods in multiple ways,” says Dr. White. “The amount of bleeding you see can change—most often, it leads to a lighter period, but some people experience heavier flow. The timing of your bleeding can be altered, too—sometimes your next period comes early, and more often your next period comes late (or not at all). And these disruptions may be present for a long time.”\n\nStill, Dr. Wider points out, despite reports that women who had COVID-19 have reported changes in their menstrual cycles, “more studies are definitely needed to tease out why that may be the case.”\n\nGetting vaccinated is still important. But, it is always a good idea to track your menstrual cycles. And it’s especially prudent to track your period following vaccination. But rest assured that if you do see short-term irregularities in your cycle, there’s no need to be alarmed, says Dr. Wider. “If irregular patterns persist, it would be wise to bring it to the attention of a healthcare provider.\n\n\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "New Study Suggests COVID-19 Vaccine Linked to Short-Term Period Changes ", "description": "But, doctors note that the “vaccine does not affect fertility at all.”", "image": "https://hips.hearstapps.com/hmg-prod/images/nurse-or-doctor-putting-an-adhesive-bandage-on-the-royalty-free-image-1658351296.jpg?crop=1.00xw:0.751xh;0,0.0902xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/health-conditions/a40531124/covid-19-vaccine-linked-to-short-term-changes-in-menstrual-cycle-length-study-suggests/", "article:section": "Health Conditions", "article:modified_time": "2022-07-21T13:36:40Z", "article:published_time": "2022-07-21T13:00:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a35644466/covid-19-vaccine-booster-shot/", "https://www.prevention.com/health/a38438664/covid-19-booster-side-effects/", "https://www.science.org/doi/10.1126/sciadv.abm7201", "https://www.science.org/content/article/thousands-report-unusual-menstruation-patterns-after-covid-19-vaccination", "https://profiles.bu.edu/Katharine.White", "https://www.amazon.com/dp/1893005852", "https://www.sciencedirect.com/science/article/pii/S0002937822005397", "https://drwider.com/", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/health/a34833921/coronavirus-covid-19-vaccine-side-effects/", "/author/246479/madeleine-haase/"], "authors": [], "publish_date": "2022-07-21T13:00:00Z"}