{"result_id": "245027", "URL": "https://www.prevention.com/health/a36186576/can-i-get-covid-19-vaccine-when-sick/", "timestamp": "2023-04-25 16:52:53 CEST+0200", "meta": {"description": "If you feel sick with cold symptoms, get tested to rule out COVID-19 before you get the vaccine, doctors say. You’ll likely need to reschedule your appointment.", "lang": "en", "keywords": "covid-19, covid-19 vaccine, cold", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a36186576/can-i-get-covid-19-vaccine-when-sick/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Can You Get the COVID-19 Vaccine if You’re Sick With Cold-Like Symptoms?", "cleaned_text": "Whether you’re scheduling your first dose of the COVID-19 vaccine or lining up for your booster, taking the most effective step to protect yourself against the novel coronavirus can be exciting. But if you’ve got a cold—or what feels like one, anyway—should you get the COVID-19 vaccine? Or stay at home and reschedule?\n\nSo far, nearly three-quarters of all Americans have received at least one dose of the three available COVID-19 vaccines, per the Centers for Disease Control and Prevention ( ); over 71 million have gotten a booster. But as cold and flu season crests, it’s not always possible to secure an appointment when you’re feeling your best.\n\nTo make matters more confusing, you might not be able to tell if you’re dealing with , , or , especially as all three surge and access to testing remains limited. So, can you get the COVID-19 vaccine or booster if you’re sick? Here’s what infectious disease doctors say.\n\nCan you get the COVID-19 vaccine if you have a cold?\n\n“People with mild illnesses can be vaccinated,” the CDC in its COVID-19 vaccination checklist. (This includes the common cold or an upper respiratory infection, not a “mild” case of COVID-19.) If you’ve got the sniffles, a sore throat, or a headache, you can go ahead with your appointment if you feel up to it—just make sure you’re wearing a mask and taking precautions to protect the people around you.\n\nAlthough there is no evidence that acute illnesses, like the flu, reduce COVID-19 vaccine efficacy or increase adverse reactions, people who feel moderately or severely sick should delay vaccination out of an abundance of caution, the CDC warns. Once you’re feeling better, you can get the vaccine.\n\nIf you’re having upper respiratory symptoms, there’s a chance that your “cold” could actually be , says infectious disease expert , senior scholar at the Johns Hopkins Center for Health Security, so if your symptoms are more moderate or severe, it’s not a bad idea to get tested or wait to get vaccinated until you feel better.\n\n, an infectious disease specialist and professor at the Vanderbilt University School of Medicine, agrees. “In the current environment where there’s so much COVID-19 still being spread, wait until your illness has resolved, just to be safe,” he advises.\n\nIn addition to preventing the spread of COVID-19, you’ll also be doing yourself a favor: “If you have a stuffy nose and are feeling crummy, the vaccine could make you feel even crummier,” Dr. Schaffner explains. Common of the vaccines include fever, fatigue, headache, and muscle aches—not exactly a welcome addition to your existing cold symptoms.\n\nCan you get the COVID-19 vaccine if you have COVID-19?\n\nIf you know you have COVID-19 and are experiencing symptoms, you should not get vaccinated while you’re sick, the CDC . Symptomatic patients should wait until their symptoms have subsided and they are cleared to leave isolation, while asymptomatic people should ensure they are allowed to before rolling up their sleeves.\n\nThis recommendation also applies if you happen to get COVID-19 before your second shot in your primary series of the Pfizer or Moderna vaccines. (This is still possible since you haven’t been without the full series.) You’ll want to wait until you’ve recovered to get your next shot.\n\nAnd if there’s a chance that you have COVID-19, it’s best to get tested before heading to your vaccine appointment. “We don’t want you coming in and infecting other people,” says , an infectious disease expert and professor of medicine at the State University of New York at Buffalo.\n\nCan you get the booster if you’re sick?\n\nSimilar rules apply to the COVID-19 boosters: If you’re experiencing mild symptoms of another illness, you can go ahead with your shot, per the . But those battling more intense infections or SARS-CoV-2 (the virus that causes COVID-19) should reschedule their appointments.\n\nThere are enough available doses for everyone, but vaccine and booster appointments can still be tricky to book when everyone is booking appointments at once. When you’re feeling under the weather and think you should reschedule your appointment, you should seek out COVID-19 testing, explains , an infectious disease specialist and a professor of internal medicine at the Northeast Ohio Medical University.\n\nIn general, though, the experts say it’s really best to put off your vaccine appointment if you have cold-like symptoms—as long as you don’t forget to reschedule your appointment. “We often say that a dose deferred is a dose never received,” Dr. Schaffner says. “Don’t let that happen to you.”\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Can You Get the COVID-19 Vaccine if You’re Sick With Cold-Like Symptoms?", "description": "First, it’s important to remember your “cold” could be something else.", "image": "https://hips.hearstapps.com/hmg-prod/images/its-so-much-more-than-flu-these-days-royalty-free-image-1619540408.?crop=1.00xw:0.751xh;0.00160xw,0.0791xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a36186576/can-i-get-covid-19-vaccine-when-sick/", "article:section": "Health", "article:modified_time": "2022-01-06T17:41:12Z", "article:published_time": "2022-01-06T17:41:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://covid.cdc.gov/covid-data-tracker/#vaccinations_vacc-total-admin-rate-total", "https://www.prevention.com/health/health-conditions/a22498824/cold-vs-flu/", "https://www.prevention.com/health/a38552648/flu-vaccine-may-not-protect-against-main-flu-strain/", "https://www.prevention.com/health/a35727004/breakthrough-covid-19-cases/", "https://www.cdc.gov/vaccines/covid-19/downloads/pre-vaccination-screening-form.pdf", "/health/a35644466/covid-19-vaccine-booster-shot/", "/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "https://www.prevention.com/health/a34304563/covid-19-vs-common-cold/", "https://www.jhsph.edu/faculty/directory/profile/3528/amesh-adalja", "https://www.vumc.org/health-policy/person/william-schaffner-md", "https://www.prevention.com/health/a34833921/coronavirus-covid-19-vaccine-side-effects/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/faq.html", "https://www.cdc.gov/coronavirus/2019-ncov/your-health/quarantine-isolation.html", "https://www.prevention.com/health/a35783134/when-are-you-fully-vaccinated-covid-19/", "http://medicine.buffalo.edu/content/medicine/faculty/profile.html?ubit=jsellick", "https://www.cdc.gov/vaccines/covid-19/downloads/pre-vaccination-screening-form.pdf", "https://www.doximity.com/pub/richard-watkins-md-c3a9ecc0", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/author/216238/korin-miller/", "/author/224791/jake-smith/"], "authors": [], "publish_date": "2022-01-06T17:41:00Z"}