{"result_id": "245033", "URL": "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "timestamp": "2023-04-25 16:53:01 CEST+0200", "meta": {"description": "The CDC now recommends Pfizer and Moderna over the Johnson & Johnson COVID-19 vaccine. As Omicron spreads, here’s what you need to know about Johnson & Johnson.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "What to Know About Johnson & Johnson’s Single-Dose COVID-19 Vaccine", "cleaned_text": "\n• The CDC is limiting the use of the Johnson & Johnson COVID-19 vaccine and recommends the Pfizer and Moderna COVID-19 vaccines over Johnson & Johnson’s due to rare blood clotting complications.\n• Johnson & Johnson has been identified as the cause of a rare blood condition called TTS, which results in clotting and low platelets.\n• The vaccine will still be readily available for those who would otherwise not receive a COVID-19 vaccine.\n\nJohnson & Johnson’s COVID-19 vaccine is still available—but its use is being narrowed. On May 5, 2022, the FDA limited the use of Johnson & Johnson vaccines due to worrying side effects: After conducting an updated analysis, evaluation and investigation of reported cases, the FDA has determined that the risk of thrombosis with thrombocytopenia syndrome (TTS), a syndrome of rare and potentially life-threatening blood clots in combination with low levels of blood platelets with onset of symptoms approximately one to two weeks following administration of the Janssen COVID-19 Vaccine, warrants limiting the authorized use of the vaccine.\n\nThis news comes after a December 16, 2021 updated guidance by the Centers for Disease Control and Prevention (CDC), recommending that eligible people receive mRNA vaccines Pfizer-BioNTech and Moderna over Johnson & Johnson’s single-dose option.\n\nThe decision comes after an influential CDC advisory committee expressed a preference for the mRNA vaccines; since Johnson & Johnson was approved in 2021, 60 cases of a new, rare condition called thrombosis with thrombocytopenia syndrome (TTS), have been confirmed, a rate of about 3.23 cases per million doses administered. Nine of those patients died. The condition, which causes blood clotting and low platelets, has been confirmed by the CDC. TTS is most common in women between ages 30 and 49, at a rate of about one in 100,000 doses administered, per CDC data.\n\n“We recognize that the Janssen COVID-19 Vaccine still has a role in the current pandemic response in the United States and across the global community. Our action reflects our updated analysis of the risk of TTS following administration of this vaccine and limits the use of the vaccine to certain individuals,” said Peter Marks, M.D., Ph.D., director of the FDA’s Center for Biologics Evaluation and Research in a press release.\n\n“Today’s action demonstrates the robustness of our safety surveillance systems and our commitment to ensuring that science and data guide our decisions. We’ve been closely monitoring the Janssen COVID-19 Vaccine and occurrence of TTS following its administration and have used updated information from our safety surveillance systems to revise the EUA. The agency will continue to monitor the safety of the Janssen COVID-19 Vaccine and all other vaccines, and as has been the case throughout the pandemic, will thoroughly evaluate new safety information.”\n\nSupplies of the two-dose Pfizer and Moderna vaccines are high—meaning that there will be no shortage of mRNA options for people getting vaccinated for the first time or rolling up their sleeves for their booster. Johnson & Johnson will remain available for those who do not wish to receive or cannot access the other options. Canada and the United Kingdom have made similar decisions, the CDC says.\n\nThis isn’t the first time Johnson & Johnson has faced controversy: Two months after it first reached the arms of people in the United States, the CDC and Food and Drug Administration (FDA) a 10-day pause over blood-clotting concerns.\n\nNow that it’s officially recommended below the other two COVID-19 vaccines, here’s everything experts know about Johnson & Johnson’s vaccine, including how it works, its efficacy, and its side effects—plus how it compares to the other options.\n\nHow effective is the Johnson & Johnson COVID-19 vaccine?\n\nUnlike its mRNA cousins from , Johnson & Johnson’s option uses a modified virus to spur antibody production. This vaccine is about 66% effective at preventing symptomatic COVID-19 and 85% effective at preventing a severe or critical form of COVID-19 that can lead to hospitalization or death at least 28 days after vaccination, according to data by the company, which was in an FDA analysis.\n\nThe CDC that everyone who received Johnson & Johnson—which, for now, only includes those 18 and older—get a booster shot two months after their shot. Data shows that , or receiving a dose of Pfizer or Moderna instead of a second shot of Johnson & Johnson, leads to the strongest immune response.\n\nAll of the available vaccines offer strong, worthwhile protection, as all of them have been shown to protect against severe illness and death, the two worst outcomes, explains , an infectious disease physician and professor of internal medicine at the Northeast Ohio Medical University. The flu vaccine is usually only up to 60% effective, and that annual shot plays an integral role in decreasing flu-related hospitalizations and deaths every year, he says.\n\nWhat’s really important with the vaccine is “not how well it protects against symptomatic disease, but how well it protects against severe disease,” says infectious disease expert , a senior scholar at the Johns Hopkins Center for Health Security. These vaccines have been approved because they’re proven to work; getting vaccinated helps protect you, your loved ones, and those in .\n\nHow does the Johnson & Johnson COVID-19 vaccine work?\n\nThe Johnson & Johnson vaccine an existing adenovirus, which usually causes colds, with the novel coronavirus’ spike protein, or the piece that latches onto human cells. The resulting adenovirus doesn’t have the ability to reproduce in the human body, meaning it can’t cause COVID-19 or any other illnesses.\n\nWhen you get the Johnson & Johnson vaccine, the modified adenovirus is pulled inside your cells, where it travels to the cell nucleus, home to its DNA. The adenovirus then puts its DNA into the nucleus, the spike protein gene is read by the cell, and it’s then copied into messenger RNA, or . Your cells begin making spike proteins, which are then recognized by your immune system, causing your body to produce antibodies to the perceived threat.\n\nIt’s like a meet-and-greet between your immune system and COVID-19. Your body now knows how to produce antibodies for the illness, but without having to experience all of the side effects that come with a true SARS-CoV-2 infection. The immune system remembers how to respond to the spike protein, and if you come into contact with it in the future, your body will have the capability to fight it more efficiently. However, it’s not yet clear how long this protection lasts or whether the vaccine prevents person-to-person transmission of the virus, per the FDA.\n\nThis technology is unique, but Johnson & Johnson has a lot of experience with it, as it’s already been used for its . “They’ve given hundreds of thousands of doses of this similar vaccine,” which has had no major safety issues, says , an infectious disease specialist and professor at the Vanderbilt University School of Medicine. Other COVID-19 vaccines, like , use similar adenovirus technology.\n\nJohnson & Johnson’s vaccine works differently than the mRNA vaccines available from Pfizer and Moderna, which both introduce a piece of genetic code that essentially tricks the body into producing COVID-19 antibodies, no actual virus required. In a way, these vaccines skip some of the steps that adenovirus-vectored vaccines take. Like Johnson & Johnson’s vaccine, Pfizer’s and Moderna’s options are the first of their kind.\n\nBecause it requires just one dose and has manageable temperature storage requirements, Johnson & Johnson’s vaccine provided a helpful boost to the U.S. immunization effort when supplies of Pfizer and Moderna were more limited.\n\nWhat are the side effects of the Johnson & Johnson COVID-19 vaccine?\n\nThe vaccine was “generally well-tolerated” in study participants, Johnson & Johnson said in a . According to the data so far, the vaccine may cause “mild-to-moderate typically associated with vaccinations,” similar to those expected from the Pfizer and Moderna vaccines. This includes cold-like symptoms, like a headache, body aches, pain at the injection site, and a fever—a normal sign that the body’s immune response is being primed.\n\nTTS, a very rare side effect of the vaccine, is more serious. Again, it’s a condition that causes blood clotting and low plate counts, which could turn deadly; out of 60 confirmed cases, nine of those patients died. TTS is most common in women between 30 and 49 years old; the condition appears in about women in those age groups who receive Johnson & Johnson, per the CDC.\n\nBecause of this rare condition, the CDC now recommends Pfizer and Moderna over Johnson & Johnson. The CDC and the FDA recommend that anyone who received the Johnson & Johnson vaccine monitor for severe headache, abdominal pain, leg pain, and shortness of breath within three weeks of vaccination. If these symptoms develop, contact your healthcare provider for proper diagnosis and treatment.\n\nTo be clear, the experts agree that the vaccines are the best way to protect yourself and your loved ones amid a new surge of COVID-19—and this time, both patients and doctors are more aware of the slight risks involved.\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "What to Know About Johnson & Johnson’s Single-Dose COVID-19 Vaccine", "description": "Here’s a closer look at its technology, efficacy, and potential side effects.", "image": "https://hips.hearstapps.com/hmg-prod/images/vaccination-or-drug-concept-image-royalty-free-image-1610915544.?crop=0.894xw:0.675xh;0.0529xw,0.190xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "article:section": "Health", "article:modified_time": "2022-05-12T14:01:27Z", "article:published_time": "2021-12-17T19:45:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-limits-use-janssen-covid-19-vaccine-certain-individuals", "https://www.cdc.gov/media/releases/2021/s1216-covid-19-vaccines.html", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-limits-use-janssen-covid-19-vaccine-certain-individuals", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-limits-use-janssen-covid-19-vaccine-certain-individuals", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/JJUpdate.html", "https://www.prevention.com/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "https://www.jnj.com/johnson-johnson-covid-19-vaccine-authorized-by-u-s-fda-for-emergency-usefirst-single-shot-vaccine-in-fight-against-global-pandemic", "https://www.fda.gov/news-events/press-announcements/fda-issues-emergency-use-authorization-third-covid-19-vaccine", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "https://www.prevention.com/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "https://www.neomed.edu/directory-profile/watkins-richard-32483/", "https://www.centerforhealthsecurity.org/our-people/adalja/", "https://www.prevention.com/health/a31245792/coronavirus-high-risk-groups/", "https://www.jnj.com/our-company/simplifying-the-science-of-covid-19-how-adenovector-vaccines-work", "https://www.prevention.com/health/a34881552/what-is-mrna-covid-19-vaccine-pfizer-moderna/", "https://www.jnj.com/latest-news/latest-facts-about-johnson-johnson-ebola-vaccine", "https://www.vumc.org/health-policy/person/william-schaffner-md", "https://www.prevention.com/health/a35118263/astrazeneca-vs-pfizer-vs-moderna-covid-19-vaccine/", "https://www.jnj.com/johnson-johnson-covid-19-vaccine-candidate-interim-phase-1-2a-data-published-in-new-england-journal-of-medicine", "https://www.prevention.com/health/a34833921/coronavirus-covid-19-vaccine-side-effects/", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-12-16/04_COVID_Oliver_2021-12-16.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/author/216238/korin-miller/", "/author/224791/jake-smith/"], "authors": [], "publish_date": "2021-12-17T19:45:00Z"}