{"result_id": "245007", "URL": "https://www.prevention.com/health/health-conditions/a40982186/breakthrough-monkeypox-cases-explained/", "timestamp": "2023-04-25 16:52:11 CEST+0200", "meta": {"description": "The WHO has revealed there have been a number of breakthrough cases of monkeypox after preliminary reports detail the efficacy of the vaccine.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/health-conditions/a40982186/breakthrough-monkeypox-cases-explained/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "WHO Reports Breakthrough Monkeypox Infections—Here’s What You Need to Know", "cleaned_text": "\n• The World Health Organization (WHO) has revealed that there have been a number of confirmed breakthrough cases of monkeypox—cases that occur despite vaccination.\n• “The vaccines are thought to be approximately 85% effective in preventing monkeypox,” WHO said.\n• Infectious disease experts weigh-in on ways to protect yourself from the virus.\n\nBreakthrough cases of monkeypox are now a reality. And while there is a vaccine for the virus, it turns out it’s not as effective as you might think.\n\nThe World Health Organization (WHO) has revealed a number of breakthrough cases of monkeypox after preliminary reports detail the efficacy of the vaccine. In a , Rosamund Lewis, M.D., C.M., WHO’s technical lead for monkeypox, discussed reports of breakthrough cases in people who received a preventative vaccine following exposure to the virus.\n\n“We have known from the beginning that this vaccine would not be a silver bullet, that it would not meet all the expectations that are being put on it and that we don’t have firm efficacy data or effectiveness data in this context,” said Dr. Lewis. She continued to explain that what we are beginning to see is that some cases are being reported, perhaps as breakthrough cases, either following post-exposure vaccination, which is meant to reduce disease severity or following preventive vaccination, which is meant to reduce infection.\n\n“We don’t yet have any randomized control trials specifically on that but the fact that we’re beginning to see some breakthrough cases is also really important information because it tells us that the vaccine is not 100% effective in any given circumstance, whether preventive or post-exposure.” Dr. Lewis added that we cannot expect 100% efficacy at the moment based on this emerging information.\n\nDr. Lewis reiterated that what we’re seeing are breakthrough cases and that every person who wishes to lower their own level of risk has many interventions at their disposal, which include vaccination where available, avoiding activities where they may be at risk, reducing their number of sexual partners, avoiding group sex or casual sex, and, specifically, when a vaccine is administered, waiting until that vaccine has the time to produce a maximum immune response.\n\n“In the case of [monkeypox] vaccine, this is two weeks after the second dose…People do need to wait until the vaccine can generate a maximum immune response but we don’t yet know what the effectiveness will be overall,” reminds Dr. Lewis.\n\nHow effective is the monkeypox vaccine?\n\n“The vaccines are thought to be approximately 85% effective in preventing monkeypox,” says Richard Watkins, M.D., an infectious disease specialist and professor of medicine at the Northeast Ohio Medical University.\n\nAccording to the , when properly administered before an exposure, vaccines are effective at protecting people against monkeypox. ACAM2000 and JYNNEOSTM (also known as Imvamune or Imvanex) are the two currently licensed vaccines in the United States to prevent smallpox, which are also being used to prevent monkeypox.\n\nThe CDC explains that past data from Africa suggests that the smallpox vaccine is at least 85% effective in preventing monkeypox.\n\nShould I be worried about breakthrough monkeypox cases?\n\nThere still isn’t enough information to understand how often these breakthrough infections are occurring post-vaccination. But, the efficacy of the vaccines is an indicator that breakthrough cases will happen.\n\n“There needs to be rigorous analysis of data to make sure enough time has elapsed for the vaccine to be expected to be protective,” says Amesh Adalja, M.D., senior scholar at Johns Hopkins Center for Health Security. He adds that many of the breakthrough cases “might’ve occurred in individuals who only received a single dose of the vaccine, which is going to be less efficacious than that approved two-dose regimen.”\n\nDr. Watkins reminds us that “no vaccine is 100% effective, so breakthrough cases from monkeypox are to be expected.” With that being said, he assures that breakthrough cases are uncommon. That said, the monkeypox outbreak is ongoing and how many people will develop breakthrough cases is difficult to predict.\n\nHow can I best protect myself against monkeypox?\n\nThere are basically two things that you can do to best avoid contracting the virus: avoid close contact with infected persons and get vaccinated.\n\n“Vaccination remains the best means of protection against monkeypox for those in the at-risk group,” says Dr. Adalja.\n\nDr. Watkins also strongly recommends avoiding close contact with someone infected with monkeypox. “Those infected need to isolate until the rash is gone and a new layer of skin has formed.”\n\nWhile we are starting to see some breakthrough cases of monkeypox, the vaccine is still highly effective at preventing severe disease and infection. If you belong to an at-risk group or you believe that you have been exposed to someone infected with monkeypox, consult your doctor right away to see if the vaccine is right for you.\n\nThis article is accurate as of press time. However, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the and to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "WHO Reports Breakthrough Monkeypox Infections—Here’s What You Need to Know", "description": "Experts explain everything you need to know to protect yourself against the virus.", "image": "https://hips.hearstapps.com/hmg-prod/images/pox-viruses-illustration-royalty-free-illustration-1626707303.jpg?crop=1.00xw:0.700xh;0,0.166xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/health-conditions/a40982186/breakthrough-monkeypox-cases-explained/", "article:section": "Health Conditions", "article:modified_time": "2022-08-25T12:30:18Z", "article:published_time": "2022-08-25T12:30:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a37066284/what-is-monkeypox-virus/", "https://www.prevention.com/health/a40730959/who-is-eligible-monkeypox-vaccine-requirements/", "https://www.who.int/publications/m/item/monkeypox--covid-19---other-global-health-issues-virtual-press-conference-transcript---17-august-2022", "https://www.neomed.edu/directory-profile/watkins-richard-32483/", "https://www.cdc.gov/poxvirus/monkeypox/clinicians/smallpox-vaccine.html", "https://publichealth.jhu.edu/faculty/3528/amesh-adalja", "https://www.prevention.com/health/a40957193/monkeypox-isolation/", "https://www.cdc.gov/poxvirus/monkeypox/index.html", "https://www.who.int/news-room/questions-and-answers/item/monkeypox", "/health/health-conditions/a40104567/how-does-monkeypox-spread/", "/health/a37066284/what-is-monkeypox-virus/", "/health/a40730959/who-is-eligible-monkeypox-vaccine-requirements/", "/author/246479/madeleine-haase/"], "authors": [], "publish_date": "2022-08-25T12:30:00Z"}