{"result_id": "245030", "URL": "https://www.prevention.com/health/a35644466/covid-19-vaccine-booster-shot/", "timestamp": "2023-04-25 16:52:55 CEST+0200", "meta": {"description": "FDA announced second boosters of COVID-19 vaccines for adults 50 and older, and certain immunocompromised people, who received Moderna and Pfizer vaccines at least 4 months ago.", "lang": "en", "keywords": "COVID-19 vaccines", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a35644466/covid-19-vaccine-booster-shot/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "The FDA Now Recommends a Second COVID-19 Vaccine Booster for Certain Groups", "cleaned_text": "\n• The FDA recently authorized a second booster shot of Moderna or Pfizer-BioNTech COVID-19 vaccines for certain populations.\n• A second booster dose of the Pfizer-BioNTech COVID-19 vaccine or Moderna COVID-19 vaccine may be administered to individuals 50 years of age and older four months after their first booster.\n• A second booster dose of the Pfizer-BioNTech COVID-19 vaccine can be given to immunocompromised individuals aged 12 years and older, and a second dose of the Moderna COVID-19 vaccine may be administered to immunocompromised individuals aged 18 and older—both four months after their first booster.\n\nBig changes are coming to booster doses. On March 29, the Food and Drug Administration (FDA) authorized a second COVID-19 booster shot for certain individuals. In the new statement, the FDA announced that both the Pfizer-BioNTech and Moderna COVID-19 booster vaccines may be issued to adults aged 50 and over who had received their first booster four months ago or longer. Certain individuals who are immunocompromised are also eligible for a second vaccine booster, the FDA says.\n\nMore specifically, immunocompromised individuals aged 12 years and older can get a second booster dose of the Pfizer-BioNTech COVID-19 vaccine four months after their initial booster. A second dose of the Moderna COVID-19 vaccine may be administered to immunocompromised individuals aged 18 and older, also four months after their first booster dose.\n\nThe FDA previously shortened its COVID-19 booster shot recommendations, suggesting a booster five months after the second shot of Moderna’s two-dose vaccine for people ages 18 and up and Pfizer-BioNTech’s two-dose vaccine five months for those ages 12 and up. Now, emerging evidence shows that a second booster offers more robust protection against COVID-19 for high-risk individuals. \n\n\n\nWho is eligible to receive a second COVID-19 booster?\n• Those 50 years old and up who received the initial Pfizer or Moderna booster dose four months ago or longer.\n• Immunocompromised people 12 years old and up can get a second Pfizer booster dose four months after their first booster shot.\n• Immunocompromised people 18 and older who received their initial Moderna booster dose four months ago or longer.\n• If you received the Johnson & Johnson booster vaccine, you are eligible for a second booster, this time the CDC says it should be of an mRNA vaccine, four months after your first booster shot.\n\nIn most cases, experts say mRNA boosters are preferred. (Booster doses of the mRNA Moderna vaccine and the adenovector option by Johnson & Johnson are only approved for those 18 and older.)\n\nAs of now, so-called are allowed, meaning you can elect to get a COVID-19 vaccine booster shot different from the one you already received. But why are boosters necessary in the first place? How effective are boosters against Omicron? And how can you sign up for your dose? Here’s everything you need to know about COVID-19 vaccine boosters, according to doctors.\n\nHow do booster shots for vaccines work?\n\n“For some vaccines, after a while, immunity begins to wear off,” the explains. “At that point, a ‘booster’ dose is needed to bring immunity levels back up.” Booster shots are extra doses of a vaccine administered sometime after an initial dosage has been received, re-upping your body’s immune response.\n\nSome boosters are recommended very infrequently, like one for , which should be received every decade. Others (like the ) are more frequent due to factors like changing pathogens and waning immunity. Different ​​ circulate each year, making an annual shot necessary to protect against the most dominant strains each flu season.\n\n\n\nDo booster shots protect against Omicron and Delta?\n\nAlthough the available vaccines are highly safe and effective, their initial immunity , leading experts to support boosters. Dr. Schaffner explains that the Biden administration has been “very impressed” with the booster shot data from Israel, and it’s easy to see why: A third dose appears to be highly effective in reducing severe COVID-19, hospitalization, and death, according to after .\n\n“When you look at the data from Israel, it’s very clear that [a booster] reverses some of the waning effects that you see in people who have been vaccinated for six months or more,” Anthony Fauci, M.D., the nation’s leading infectious disease expert, said in November on the podcast . In fact, COVID-19 vaccine boosters “are going to be an absolutely essential component of our response. Not a bonus, not a luxury, but an absolutely essential part of the program.”\n\nBooster shots can also address variants like Omicron, explains infectious disease expert , senior scholar at the Johns Hopkins Center for Health Security; the vaccines and boosters have remained unchanged since they were first approved, but future could be tailored to fight variants like Omicron specifically. \n\n\n\nAlthough COVID-19 vaccine boosters to hold up well against Delta, experts say it’s still unclear how effective they are against Omicron; more research is necessary to draw conclusions. But early results are promising: Preliminary studies by found that three doses of its vaccine effectively “neutralize” the Omicron variant of COVID-19, offering 25 times more antibody protection than two doses alone.\n\nSimilar studies from Moderna produced , too. Although two doses of Moderna offered lackluster protection from Omicron, a booster spurred 37 times the antibodies 29 days after it was administered. (A full third dose of the vaccine also triggered about 83 times more antibodies than two doses alone.) At a healthcare conference hosted by Goldman Sachs on Thursday, Moderna's CEO Stéphane Bancel said the efficacy of Moderna's first booster shot is expected to last through the winter, NPR reported.\n\nThe CDC recommends that all eligible Americans receive a booster dose. People 18 and older can choose between any of the three available vaccines, while 12- through 17-year-olds can receive a third dose of the Pfizer vaccine. “Vaccines remain the best public health measure to protect people from COVID-19, slow transmission, and reduce the likelihood of new variants emerging,” the CDC \n\n\n\nIs a COVID-19 vaccine booster shot necessary for full protection?\n\nFor those who are considered highly at-risk (immunocompromised or age 50 and older), the FDA is encouraging a second booster shot following emerging evidence that they can protect against COVID-19, including Delta and Omicron variants.\n\n“Current evidence suggests some waning of protection over time against serious outcomes from COVID-19 in older and immunocompromised individuals. Based on an analysis of emerging data, a second booster dose of either the Pfizer-BioNTech or Moderna COVID-19 vaccine could help increase protection levels for these higher-risk individuals,” said Peter Marks, M.D., director of the FDA’s Center for Biologics Evaluation and Research.\n\nA small, non-randomized clinical study in Israel offered a second booster dose of the Pfizer-BioNTech COVID-19 vaccine or Moderna COVID-19 vaccine to individuals aged 18 years and older who had received the initial vaccine and a first booster dose. Results showed a decrease in antibody levels against COVID-19 just after two weeks of receiving the second booster, as compared to 5 months after the first booster dose.\n\nThe FDA is also continuing to emphasize the importance of receiving an initial booster. “The data show that an initial booster dose is critical in helping to protect all adults from the potentially severe outcomes of COVID-19,” he said. “So, those who have not received their initial booster dose are strongly encouraged to do so.”\n\n\n\nWhy are second boosters for Pfizer and Moderna necessary after four months for high-risk individuals?\n\nDue to “the current state of the pandemic, the latest vaccine effectiveness data over time, and review of safety data from people who have already received a COVID-19 primary vaccine series and booster,” Dr. Walensky earlier in November, those additional doses are worth getting. They’re “an important public health tool to strengthen our defenses against the virus as we enter the winter holidays.”\n\n“The available data make very clear that protection against SARS-CoV-2 infection begins to decrease over time following the initial doses of vaccination, and in association with the dominance of the Delta variant, we are starting to see evidence of reduced protection against mild and moderate disease,” officials from the United States Department of Health and Human Services (including Dr. Walensky and Dr. Fauci) in August.\n\n“Based on our latest assessment, the current protection against severe disease, hospitalization, and death could diminish in the months ahead, especially among those who are at or were vaccinated during the earlier phases of the vaccination rollout,” the announcement continues. “For that reason, we conclude that a booster shot will be needed to maximize vaccine-induced protection and prolong its durability.”\n\nFor example, a of public health data from Israel released in late July estimated that the Pfizer shot was 39% effective at preventing people from COVID-19 infection in June and early July, compared with 95% from January to early April. (However, the vaccine was still more than 90% effective in preventing severe disease in people in June and July.)\n\n\n\n“It is true that if you look at antibody levels produced by the vaccine, by eight months, they’re starting to wane,” Dr. Schaffner says. That’s why officials are recommending booster doses—and why you should receive a COVID-19 vaccine in the first place.\n\nWhere can you get a booster dose?\n\nBoosters are now available just about everywhere, and there should be no shortage of available doses, since the White House has to producing 1 billion doses of the COVID-19 vaccines per year moving forward.\n\nTo sign up for a booster dose, first make sure the correct amount of time has passed since your last dose. Then, use the CDC’s site, contact your primary care provider, or visit your county’s public health website to find a vaccination site near you. Pharmacies like , , and also allow people to check availability and book appointments online.\n\n“The vaccines are so important,” explains , a critical care specialist at Cleveland Clinic. “We need to reach a point of as many people as possible, as quickly as possible. That’s the biggest thing we can do to get back to some degree of normalcy.”\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "The FDA Now Recommends a Second COVID-19 Vaccine Booster for Certain Groups", "description": "The FDA is suggesting a second booster dose for certain groups, four months after receiving their Pfizer or Moderna booster vaccine.", "image": "https://hips.hearstapps.com/hmg-prod/images/covid-19-coronavirus-vaccine-vials-with-syringe-royalty-free-image-1626803938.jpg?crop=1xw:0.75xh;center,top&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a35644466/covid-19-vaccine-booster-shot/", "article:section": "Health", "article:modified_time": "2022-04-04T19:30:46Z", "article:published_time": "2022-04-04T19:30:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-shortens-interval-booster-dose-moderna-covid-19-vaccine-five-months", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "https://www.prevention.com/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "https://www.cdc.gov/vaccines/hcp/conversations/downloads/vacsafe-understand-color-office.pdf", "https://www.cdc.gov/vaccines/adults/rec-vac/index.html", "https://www.prevention.com/health/health-conditions/a25050076/flu-shot-side-effects/", "https://www.cdc.gov/flu/about/viruses/index.htm", "https://abcnews.go.com/Health/fauci-shot-vaccine-standard-warns-winter-double-whammy/story?id=81213958", "https://www.nejm.org/doi/full/10.1056/NEJMoa2114255", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02249-2/fulltext", "/health/a38513208/omicron-variant-symptoms-covid-19/", "/health/a38580337/how-to-know-what-strain-of-covid-you-have/", "https://www.nytimes.com/2021/11/12/podcasts/the-daily/anthony-fauci-vaccine-mandates-booster-shots.html", "https://www.jhsph.edu/faculty/directory/profile/3528/amesh-adalja", "https://www.prevention.com/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "https://www.medrxiv.org/content/10.1101/2021.06.28.21259420v1.full.pdf", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-provide-update-omicron-variant", "https://www.cbsnews.com/news/moderna-booster-shot-covid-vaccine-antibodies-omicron/", "https://www.npr.org/sections/coronavirus-live-updates/2022/01/07/1071249854/fda-shortens-the-wait-time-between-moderna-vaccine-and-booster-to-5-months", "https://www.cdc.gov/coronavirus/2019-ncov/variants/omicron-variant.html", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "https://www.cdc.gov/media/releases/2021/s1119-booster-shots.html", "https://www.hhs.gov/about/news/2021/08/18/joint-statement-hhs-public-health-and-medical-experts-covid-19-booster-shots.html", "https://www.prevention.com/health/a31245792/coronavirus-high-risk-groups/", "/health/a38602689/paxlovid-pfizer-covid-19-pill/", "/health/a35727004/breakthrough-covid-19-cases/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)00947-8/fulltext", "https://www.washingtonpost.com/us-policy/2021/11/17/biden-covid-vaccine-manufacturing/", "https://www.vaccines.gov/", "https://www.jdoqocy.com/click-100816139-13296373?url=http%3A%2F%2Fwww.cvs.com%2Fshop%2Fproduct-detail%2FRevlon-Colorstay-Shadowlinks-Metallic-Eyeshadow-Copper-260%3FskuId%3D945379&sid={subid}-xid-{xid}", "https://go.redirectingat.com/?id=74968X1576256&url=https%3A%2F%2Fwww.walgreens.com%2Ffindcare%2Fvaccination%2Fcovid%2F19%2Flanding", "https://go.redirectingat.com/?id=74968X1576256&url=https%3A%2F%2Fwww.riteaid.com%2Fpharmacy%2Fscheduler", "https://my.clevelandclinic.org/staff/17330-abhijit-duggal", "https://www.prevention.com/health/a36396275/covid-19-vaccine-experiences/", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/author/224791/jake-smith/", "/author/219867/korin-miller/"], "authors": [], "publish_date": "2022-04-04T19:30:00Z"}