{"result_id": "245016", "URL": "https://www.prevention.com/health/a36355216/covid-19-vaccine-for-children/", "timestamp": "2023-04-25 16:52:35 CEST+0200", "meta": {"description": "The CDC recommends Pfizer’s vaccine for kids 5-11, plus its booster for those 12-15. Pediatricians explain when they’ll be able to get the COVID-19 vaccines.", "lang": "en", "keywords": "when can kids get the covid vaccine, when will children get covid vaccine, covid vaccine for kids, pfizer vaccine for kids", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/a36355216/covid-19-vaccine-for-children/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "When Can Kids Get the COVID-19 Vaccine? FDA Now Recommends Boosters for Children 12 to 15", "cleaned_text": "\n• The FDA has approved booster doses of Pfizer’s COVID-19 vaccine for 12- to 15-year-olds; until this week, they were only available to those 16 and up.\n• In November, the CDC added children between the ages of 5 and 11 to the groups of people who can receive Pfizer-BioNTech’s two-dose COVID-19 vaccine.\n• Pfizer released trial data last month showing that its vaccine provides adequate protection for 6- to 24-month-olds, but not in kids between 2 and 4 years old.\n\nThe Food and Drug Administration (FDA) booster doses of the Pfizer-BioNTech COVID-19 vaccine for children between the ages of 12 and 15 this week. In the same announcement, it also allowed for a third primary series dose of Pfizer’s vaccine for immunocompromised 5- to 11-year-olds.\n\nAmid the rise of the —and that additional vaccine doses provide more robust protection against the strain than two doses of the mRNA vaccines alone—this decision expands use of the Pfizer boosters to those under 16 for the first time. (Moderna and Johnson & Johnson boosters are approved for people 18 and up; mRNA options Pfizer and Moderna and recommended over the adenovector .)\n\nKids as young as 5 have been eligible to receive Pfizer’s COVID-19 vaccine since early November, when the Centers for Disease Control and Prevention (CDC) and FDA updated their . But there’s still a big question mark in the ongoing vaccination effort: children under 5, who make up about of the population.\n\nThis cohort might have to wait longer, according to a December 17 from Pfizer and BioNTech. Trial data showed that despite demonstrating adequate protection in the 6- to 24-month-old population, the Pfizer COVID-19 vaccine did not perform as expected in 2- to 4-year-olds. No safety concerns were identified. Now, the companies will “amend” the clinical trials to add a third dose, hoping that might prompt a more robust immune response.\n\nIn November, the CDC and the FDA accepted Pfizer’s among 5- to 11-year-olds, which showed “robust” protection against the SARS-CoV-2 virus in kids, clearing the way for emergency use authorization of the two-dose mRNA vaccine for all Americans aged 5 years and up. The FDA its emergency use authorization of Pfizer’s COVID-19 vaccine for children as young as 12 last May. The vaccine, now marketed as Comirnaty, received for people 16 and older in August.\n\nSo, when will younger children be able to receive their COVID-19 vaccines? Which kids should receive boosters? And will Moderna and Johnson & Johnson eventually be approved for young people, too? Here, doctors explain when kids under age 5 can expect to be vaccinated, plus why it’s crucial children of all ages roll up their sleeves.\n\nWhy did it take so long for children to be approved for the COVID-19 vaccine?\n\nFollowing CDC and FDA authorization, Pfizer vaccinations are underway among children from 5 to 17; 12- to 15-year-olds can now also receive booster doses once five months have passed since their initial vaccine series. Those 5 to 11 receive 10 micrograms of the Pfizer COVID-19 vaccine, the dose that adolescents and adults get; in its ongoing studies, Pfizer has administered 6 micrograms to those 6 months to 4 years old.\n\nAdults were prioritized in clinical trials of the COVID-19 vaccines because they were the most susceptible to , says , a pediatrician at Cleveland Clinic in Wooster, OH. But now that the vaccines have become widely available, children are next in line—just in time to address a massive increase in SARS-CoV-2 cases among kids.\n\nYoung people are distinct enough from adults to warrant separate studies: They’re smaller and lighter, which impacts dose size. And because they’re still growing, their immune systems operate differently at each stage of childhood, says , chairman of the Division of Infectious Disease at Johns Hopkins All Children’s Hospital.\n\n“The older a child gets, the more their bodies are going to behave like a young adult,” Dr. Messina explains. That’s why older children, ages 12 and up, were the second group to be cleared for vaccinations, followed by 5- to 11-year-olds. Younger kids will require even more research, meaning they’ll be the last to receive approval.\n\nThe Pfizer vaccine is remarkably effective among children 5 to 11 years old. The included 2,268 people between the ages of 5 and 11; two-thirds of them received two doses of the mRNA vaccine spaced three weeks apart, while one-third received a placebo. Those who received a 10-microgram dose of the vaccine had a strong immune response. included fever, chills, headache, and injection site pain, identical to those reported in adults.\n\nDespite that trial’s success, Pfizer’s latest trial among even younger children had mixed results; although the vaccine was successful in children between 6 and 24 months, it didn’t spur the expected response in those between 2 and 4. The company is now testing a third dose among those age groups, along with 5- to 12-year-olds and will seek authorization in the first half of 2022 if the results are positive, per its recent announcement. (Three doses appear to be successful at fending off the in adults, although it’s unclear if this will also be the case in kids.)\n\nIn its latest announcement, the FDA no new safety concerns following a booster dose among 12- to 15-year-olds. Zero new cases of the very rare complications myocarditis and pericarditis were reported among trial participants.\n\nModerna, meanwhile, in May that its vaccine is 96% effective in people aged 12 to 17; the company is currently seeking FDA approval for this age group, and clinical trials with kids as young as six months . (Its two-dose mRNA vaccine for adolescents in Canada in August.) Johnson & Johnson has its trials to adolescents ages 12 to 17, with plans to study younger kids in the future.\n\nWhy should children receive the COVID-19 vaccines?\n\nChildren are less likely to get seriously sick from COVID-19, per the —but that doesn’t mean they’re immune. Kids made up of new SARS-CoV-2 infections in the United States the week of December 9, per the American Academy of Pediatrics (AAP). At least 735 children have died from the novel coronavirus, according to the AAP. And amid Omicron’s spread, pediatric COVID-19 cases are .\n\nSome children require hospitalization and , just like adults, and many who have recovered deal with chronic COVID, per a 2020 ; those can be debilitating.\n\n“Most of the time, this is not a severe disease for kids; some of the time, it is a devastating disease, and you don’t want that to be your child,” Dr. Messina says. “It doesn’t matter how rare a disease it is—when your child has it, it’s not rare anymore.”\n\nDr. Keating stresses that the vaccines have been proven to be trustworthy and effective. “It’s important to tell parents that while the vaccine approval happened fast, it wasn’t rushed,” he explains.\n\nGetting kids vaccinated is also crucial to establishing widespread immunity, both experts emphasize. The vaccines are not 100% effective, and even if most adults receive it, unvaccinated kids might still spread COVID-19 to their peers, parents, and anyone else they meet—especially with the rise of highly transmissible variants like and . The virus requires susceptible hosts to spread, and if more and more people are , it won’t have anywhere left to go.\n\nThis article is accurate as of press time. However, as the COVID-19 pandemic rapidly evolves and the scientific community’s understanding of the novel coronavirus develops, some of the information may have changed since it was last updated. While we aim to keep all of our stories up to date, please visit online resources provided by the CDC, WHO, and your local public health department to stay informed on the latest news. Always talk to your doctor for professional medical advice.", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "When Can Kids Get the COVID-19 Vaccine? FDA Now Recommends Boosters for Children 12 to 15", "description": "The FDA has approved booster doses of Pfizer’s vaccine for kids 12 through 15 years old.", "image": "https://hips.hearstapps.com/hmg-prod/images/getting-vaccinated-royalty-free-image-1620332635.?crop=1.00xw:0.755xh;0,0.0817xh&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/a36355216/covid-19-vaccine-for-children/", "article:section": "Health", "article:modified_time": "2022-01-04T16:08:36Z", "article:published_time": "2022-01-04T16:08:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-takes-multiple-actions-expand-use-pfizer-biontech-covid-19-vaccine", "https://www.prevention.com/health/health-conditions/a38370247/what-is-omicron-covid-19-variant/", "https://www.prevention.com/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "https://www.prevention.com/health/a35227295/johnson-and-johnson-covid-19-vaccine/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/children-teens.html", "https://www.census.gov/quickfacts/fact/table/US/POP010220", "/health/a38513208/omicron-variant-symptoms-covid-19/", "/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-provide-update-ongoing-studies-covid-19", "https://www.fda.gov/news-events/press-announcements/fda-authorizes-pfizer-biontech-covid-19-vaccine-emergency-use-children-5-through-11-years-age", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-pfizer-biontech-covid-19-vaccine-emergency-use", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine", "https://www.prevention.com/health/health-conditions/a38077569/fda-pfizer-covid-19-vaccine-kids-5-to-11/", "https://www.prevention.com/health/a32006916/mild-coronavirus-symptoms/", "https://my.clevelandclinic.org/staff/5127-adam-keating", "https://www.hopkinsallchildrens.org/find-a-doctor/practitioner-details/allison--ford--messina", "https://www.nejm.org/doi/full/10.1056/NEJMoa2116298", "https://www.prevention.com/health/a34833921/coronavirus-covid-19-vaccine-side-effects/", "https://www.prevention.com/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "/health/g38462007/best-disposable-face-masks/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-takes-multiple-actions-expand-use-pfizer-biontech-covid-19-vaccine", "https://www.cnbc.com/2021/05/06/covid-moderna-mrna-earnings-q1-2021.html", "https://www.aappublications.org/news/2021/03/16/moderna-covid-trials-children-031621", "https://www.cbc.ca/news/health/moderna-vaccine-adolescents-1.6155876", "https://www.jnj.com/johnson-johnson-expands-phase-2a-clinical-trial-of-covid-19-vaccine-candidate-to-include-adolescents", "https://www.cdc.gov/coronavirus/2019-ncov/groups/families-children.html", "https://www.aap.org/en/pages/2019-novel-coronavirus-covid-19-infections/children-and-covid-19-state-level-data-report/", "https://www.nbcnews.com/health/health-news/covid-warning-symptoms-children-kids-hospitalized-record-numbers-rcna10741", "https://www.prevention.com/health/a33297904/what-is-intubation/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7927578/", "https://www.prevention.com/health/a35218558/what-is-post-covid-syndrome/", "https://www.prevention.com/health/a38513208/omicron-variant-symptoms-covid-19/", "https://www.prevention.com/health/a37130094/delta-variant-symptoms-covid-19/", "https://www.prevention.com/health/a35783134/when-are-you-fully-vaccinated-covid-19/", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019", "https://www.naccho.org/membership/lhd-directory", "/author/224791/jake-smith/"], "authors": [], "publish_date": "2022-01-04T16:08:00Z"}