{"result_id": "245044", "URL": "https://www.prevention.com/health/health-conditions/a38462364/medicago-plant-based-covid-19-vaccine-efficacy/", "timestamp": "2023-04-25 16:53:22 CEST+0200", "meta": {"description": "The first plant-based COVID-19 vaccine from drugmaker Medicago has proven to be more than 75% effective against preventing the Delta variant of the coronavirus.", "lang": "en", "keywords": "", "favicon": "/_assets/design-tokens/prevention/static/images/favicon.d1aa352.ico", "canonical": "https://www.prevention.com/health/health-conditions/a38462364/medicago-plant-based-covid-19-vaccine-efficacy/", "encoding": "utf-8"}, "image": null, "domain": "www.prevention.com", "title": "Everything You Need to Know About the Plant-Based COVID-19 Vaccine That Shows ‘Positive Efficacy’", "cleaned_text": "There’s a new COVID-19 vaccine in the works—and it’s made from plants.\n\nCanadian-based vaccine maker Medicago announced on Tuesday that its plant-based COVID-19 vaccine had “positive efficacy and safety results” from a phase 3 placebo-controlled clinical trial of more than 24,000 people when it was combined with a GlaxoSmithKline adjuvant. (An adjuvant is an ingredient used in some vaccines to help create a stronger immune response in people who receive the vaccine.)\n\nHow effective is the plant-based COVID-19 vaccine?\n\nOverall, the vaccine had a 75.3% efficacy against people developing COVID-19 with the Delta variant, which is the dominant variant circulating right now. While that’s lower than the 94% to 95% efficacy offered by the mRNA COVID-19 vaccines like Moderna and Pfizer-BioNTech, Medicago points out in a press release that those efficacy levels were determined when the original SARS-CoV-2 was circulating, “making direct comparisons impossible.”\n\nResearchers also found that the overall vaccine efficacy rate against all SARS-CoV-2 variants was 71%, and went up to 75.6% in people who had no previous exposure to COVID-19. Efficacy was also 88.6% against the Gamma variant. The Omicron variant wasn’t circulating during the study.\n\nDuring the study period, only a small number of severe COVID-19 cases occurred and none were in the vaccinated group.\n\nThe researchers also found that there were no serious side effects and, when people had symptoms from the vaccine, they only lasted between one and three days. Full results of the study will be released in a peer-reviewed journal “as soon as possible,” the press release says, noting that the company is seeking regulatory approval from Health Canada to get its vaccine out to the masses.\n\n“This is an incredible moment for Medicago and for novel vaccine platforms. The results of our clinical trials show the power of plant-based vaccine manufacturing technology,” Takashi Nagao, CEO and president at Medicago, said in a statement. “If approved, we will be contributing to the world’s fight against the COVID-19 pandemic with the world’s first plant-based vaccine for use in humans.”\n\nOK, but what even is a vaccine from plants? Here’s what you need to know.\n\nHow is the Medicago plant-based COVID vaccine created?\n\nMedicago hasn’t revealed its exact formula, but the company shared that it has been developing its plant-based technology for the past 20 years. It involves producing virus-like particles (VLPs) for its protein vaccines. “VLPs are designed to mimic the native structure of viruses, allowing them to be easily recognized by the immune system,” Medicago explains.\n\nThe VLPs don’t have core genetic material, making them non-infectious and unable to replicate—meaning, they can't give you COVID-19. Once the code for COVID-19 is added to the vaccine, it’s purified and then mixed with an adjuvant for the finished product, explains Thomas Russo, M.D., professor and chief of infectious disease at the University at Buffalo in New York.\n\nWhat are the perks of having a plant-based vaccine?\n\nThere are a few. “This has the potential to be less expensive to make and potentially be adopted by countries in parts of the world that don’t have vaccine capabilities now,” Dr. Russo says. The VLPs are also reportedly more stable than the mRNA and adenovirus vaccines, which could help minimize cold storage issues, he says.\n\nPlant-based vaccines may also be more appealing to people who don’t want to get other vaccines over religious concerns or worries that they’re not “natural” enough, says infectious disease expert Amesh A. Adalja, M.D., a senior scholar at the Johns Hopkins Center for Health Security. “Having multiple vaccines using multiple different technologies makes it less tenable for people to shun all vaccines,” he says. Dr. Russo agrees. \"Image and perception is everything,” he says. “If people didn't want to put the other vaccines in their arms but will use this because it's ‘natural,’ then hallelujah.”\n\nDr. Adalja points out that plant-based vaccines have been in development “for some time,” adding, “it may prove to be an important platform to manufacture this and other vaccines.”\n\nWhat are the cons of the Medicago plant-based COVID vaccine?\n\nThe efficacy isn’t great, Dr. Russo says. “It’s OK,” he says. “I would have liked to have seen higher.” But, he points out, it’s still better than Johnson & Johnson’s 66.3% efficacy, which was enough to get it authorized by the Food and Drug Administration (FDA).\n\nDr. Russo says that the news is “exciting.” But, he says, “is it going to take center stage for COVID vaccines? Not yet. But it may prove to be an important alternative platform in the future.”", "opengraph": {"site_name": "Prevention", "article:publisher": "https://www.facebook.com/preventionmagazine/", "title": "Everything You Need to Know About the Plant-Based COVID-19 Vaccine That Shows ‘Positive Efficacy’", "description": "Yup, it's for real—and so far it has higher efficacy than the J&J vaccine.", "image": "https://hips.hearstapps.com/hmg-prod/images/doctor-making-a-vaccination-in-the-shoulder-of-royalty-free-image-1638982979.jpg?crop=1xw:0.74965xh;center,top&resize=1200:*", "image:width": "1200", "image:height": "600", "url": "https://www.prevention.com/health/health-conditions/a38462364/medicago-plant-based-covid-19-vaccine-efficacy/", "article:section": "Health Conditions", "article:modified_time": "2021-12-09T13:01:17Z", "article:published_time": "2021-12-09T13:00:00Z", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prevention.com/health/a35418316/alcohol-after-covid-19-vaccine/", "https://medicago.com/en/press-release/medicago-and-gsk-announce-positive-phase-3-efficacy-and-safety-results-for-adjuvanted-plant-based-covid-19-vaccine-candidate/", "https://www.cdc.gov/vaccinesafety/concerns/adjuvants.html", "https://www.prevention.com/health/a35002158/pfizer-vs-moderna-covid-19-vaccine-ingredients/", "https://www.prevention.com/health/a37200110/how-contagious-is-delta-variant-covid-19/", "https://medicago.com/en/press-release/medicago-and-gsk-announce-positive-phase-3-efficacy-and-safety-results-for-adjuvanted-plant-based-covid-19-vaccine-candidate/", "/health/health-conditions/a38440170/covid-19-mix-and-match-booster-shots/", "/health/health-conditions/a38461092/omicron-covid-variant-vaccine-booster-efficacy/", "https://www.prevention.com/health/a37545312/biden-vaccine-mandate/", "https://www.prevention.com/food-nutrition/healthy-eating/a31077033/what-is-plant-based-diet/", "https://medicine.buffalo.edu/faculty/profile.html?ubit=trusso", "https://www.prevention.com/health/a34989924/covid-19-vaccine-storage-temperatures/", "https://publichealth.jhu.edu/faculty/3528/amesh-adalja", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/janssen.html", "/author/216238/korin-miller/"], "authors": [], "publish_date": "2021-12-09T13:00:00Z"}