{"result_id": "246018", "URL": "https://principia-scientific.org/fauci-plotted-global-vaccine-action-plan-with-bill-gates-before-pushing-covid-panic/", "timestamp": "2023-04-25 16:53:45 CEST+0200", "meta": {"description": "Dr. Anthony Fauci, who has become a beloved doom prophet fomenting mass hysteria among the American public amidst the coronavirus pandemic, once worked with technocratic oligarch Bill Gates on his “Global Vaccine Action Plan.” Is this why Fauci has been so skeptical of hydroxychloroquine? Naturally, he’ll push back against the Hydroxychloroquine + Azithromycin treatment and", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/fauci-plotted-global-vaccine-action-plan-with-bill-gates-before-pushing-covid-panic/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Fauci Plotted ‘Global Vaccine Action Plan’ with Bill Gates Before Pushing COVID Panic | Principia Scientific Intl.", "cleaned_text": "The “Global Vaccine Action Plan” was announced in 2010 as a public-private partnership of the World Health Organization (WHO), the United Nations Children’s Fund (UNICEF), the National Institute of Allergy and Infectious Diseases (NIAID), and the Bill & Melinda Gates Foundation.\n\n“This plan will build on the successes of current work to achieve key milestones in the discovery, development and delivery of lifesaving vaccines to the most vulnerable populations in the poorest countries over the next decade,” WHO wrote in their press release about the project.\n\nAs the NIAID director, Fauci helped guide the vaccine-pushing project as a member of its Leadership Team. He was joined by other globalist kingpins including Anthony Lake, Executive Director for UNICEF; Margaret Chan, Director General of WHO; Joy Phumaphi, Chair of the International Advisory Committee and Executive Secretary, African Leaders Malaria Alliance; and Tachi Yamada, President of Global Health at the Bill & Melinda Gates Foundation.\n\nThe project was designed to assemble some of the most powerful globalist actors on the planet and encourage them to conspire on ways to peddle vaccines throughout the world.\n\nFauci has been the primary voice in the Trump administration urging the public to be skeptical of hydroxychloroquine, a possible miracle treatment for coronavirus. Fauci has remained a critic of hydroxychloroquine despite indications that it can be effective in helping the afflicted recover from the disease.\n\n“No. The answer is no,” Fauci said last month after he was asked about whether or not there was any evidence showing that hydroxychloroquine can be effective in treating the coronavirus.\n\nWhen it became clear that hydroxychloroquine can be effective in treating the coronavirus, Fauci walked back his comments.\n\n“Although there is some suggestion with the study that was just mentioned by Dr. Oz, granted that there is a suggestion that there is a benefit there, I think we’ve got to be careful that we don’t make that majestic leap to assume that this is a knockout drug,” Fauci said during an appearance on “FOX & Friends” last week.\n\nFauci may be trying to halt the use of hydroxychloroquine as part of the “Global Vaccine Action Plan” that he plotted many years ago. Gates has already talked about digital tracking implants being tagged into people’s skin for authorities to enforce their vaccination schedule. Fauci could be serving as a bureaucratic enabler of Gates’ sociopathic Big Brother ambitions.\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX.\n\nPlease DONATE TODAY To Help Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "article", "title": "Fauci Plotted ‘Global Vaccine Action Plan’ with Bill Gates Before Pushing COVID Panic | Principia Scientific Intl.", "description": "Dr. Anthony Fauci, who has become a beloved doom prophet fomenting mass hysteria among the American public amidst the coronavirus pandemic, once worked with technocratic oligarch Bill Gates on his “Global Vaccine Action Plan.” Is this why Fauci has been so skeptical of hydroxychloroquine? Naturally, he’ll push back against the Hydroxychloroquine + Azithromycin treatment and", "url": "https://principia-scientific.com/fauci-plotted-global-vaccine-action-plan-with-bill-gates-before-pushing-covid-panic/", "image": "https://bigleaguepolitics.com/wp-content/uploads/2020/04/pjimage-2020-04-06T135452.189-1200x630.jpg", "image:secure_url": "https://bigleaguepolitics.com/wp-content/uploads/2020/04/pjimage-2020-04-06T135452.189-1200x630.jpg", "article:published_time": "2020-04-10T13:22:34+00:00", "article:modified_time": "2020-04-10T13:22:34+00:00", "article:publisher": "https://www.facebook.com/johnosullivanpsi"}, "tags": ["https://www.worldbank.org/en/topic/pandemics/brief/pandemic-emergency-financing-facility"], "tweets": [], "movies": [], "links": ["https://www.who.int/immunization/newsroom/press/news_release_decade_vaccines/en/", "https://bigleaguepolitics.com/pharma-insider-first-data-from-clinical-studies-indicates-hydroxychloroquine-kills-the-coronavirus/", "https://www.cnn.com/2020/03/28/health/coronavirus-hydroxychloroquine-trial/index.html", "https://www.realclearpolitics.com/video/2020/04/03/fauci_we_cant_make_that_majestic_leap_and_believe_hydroxychloroquine_is_the_cure_to_coronavirus.html", "https://bigleaguepolitics.com/as-coronavirus-panic-spreads-bill-gates-talks-up-digital-certificates-to-enforce-mandatory-vaccines/", "https://bigleaguepolitics.com/dr-anthony-fauci-plotted-global-vaccine-action-plan-with-bill-gates-before-pushing-covid-panic-and-doubts-about-hydroxychloroquine-treatments/"], "authors": [], "publish_date": "2020-04-10T13:22:34+00:00"}