{"result_id": "246033", "URL": "https://principia-scientific.org/japan-leads-the-way-in-child-health-no-compulsory-vaccines/", "timestamp": "2023-04-25 16:53:59 CEST+0200", "meta": {"description": "In the United States, many legislators and public health officials are busy trying to make vaccines de facto compulsory.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Japan Leads the Way in Child Health: No Compulsory Vaccines | Principia Scientific Intl.", "cleaned_text": "Japan Leads the Way in Child Health: No Compulsory Vaccines\n\nIn the United States, many legislators and public health officials are busy trying to make vaccines de facto compulsory—either by removing parental/personal choice given by existing vaccine exemptions or by imposing undue quarantines and fines on those who do not comply with the Centers for Disease Control and Prevention’s (CDC’s) vaccine edicts.\n\nOfficials in California are seeking to override medical opinion about fitness for vaccination, while those in New York are mandating the measles-mumps-rubella (MMR) vaccine for 6-12-month-old infants for whom its safety and effectiveness “have not been established.”\n\nThe U.S. has the very highest infant mortality rate of all industrialized developed countries, with more American children dying at birth and in their first year than in any other comparable nation—and more than half of those who survive develop at least one chronic illness.\n\nAmerican children would be better served if these officials—before imposing questionable and draconian measures—studied child health outcomes in Japan. With a population of 127 million, Japan has the healthiest children and the very highest “healthy life expectancy” in the world—and the least vaccinated children of any developed country. The U.S., in contrast, has the developed world’s most aggressive vaccination schedule in number and timing, starting at pregnancy, at birth and in the first two years of life. Does this make U.S. children healthier? The clear answer is no. The U.S. has the very highest infant mortality rate of all industrialized countries, with more American children dying at birthand in their first year than in any other comparable nation—and more than half of those who survive develop at least one chronic illness. Analysis of real-world infant mortality and health results shows that U.S. vaccine policy does not add up to a win for American children.\n\nJapan and the U.S.; Two Different Vaccine Policies\n\nIn 1994, Japan transitioned away from mandated vaccination in public health centers to voluntary vaccination in doctors’ offices, guided by “the concept that it is better that vaccinations are performed by children’s family doctors who are familiar with their health conditions.” The country created two categories of non-compulsory vaccines: “routine” vaccines that the government covers and “strongly recommends” but does not mandate, and additional “voluntary” vaccines, generally paid for out-of-pocket. Unlike in the U.S., Japan has no vaccine requirements for children entering preschool or elementary school.\n\nJapan also banned the MMR vaccine in the same time frame, due to thousands of serious injuriesover a four-year period—producing an injury rate of one in 900 children that was “over 2,000 times higher than the expected rate.” It initially offered separate measles and rubella vaccines following its abandonment of the MMR vaccine; Japan now recommends a combined measles-rubella (MR) vaccine for routine use but still shuns the MMR. The mumps vaccine is in the “voluntary” category.\n\nHere are key differences between the Japanese and U.S. vaccine programs:\n• Japan has no vaccine mandates, instead recommending vaccines that (as discussed above) are either “routine” (covered by insurance) or “voluntary” (self-pay).\n• Japan does not vaccinate newborns with the hepatitis B (HepB) vaccine, unless the mother is hepatitis B positive.\n• Japan does not vaccinate pregnant mothers with the tetanus-diphtheria-acellular pertussis (Tdap) vaccine.\n• Japan does not give flu shots to pregnant mothers or to six-month-old infants.\n• Japan does not give the MMR vaccine, instead recommending an MR vaccine.\n• Japan does not require the human papillomavirus (HPV) vaccine.\n\nNo other developed country administers as many vaccine doses in the first two years of life.\n\nIn contrast, the U.S. vaccine schedule (see Table 1) prescribes routine vaccination during pregnancy, calls for the first HepB vaccine dose within 24 hours of birth—even though 99.9% of pregnant women, upon testing, are hepatitis B negative, and follows up with 20 to 22 vaccine doses in the first year alone. No other developed country administers as many vaccine doses in the first two years of life.\n\nThe HepB vaccine injects a newborn with a 250-microgram load of aluminum, a neurotoxic and immune-toxic adjuvant used to provoke an immune response. There are no studies to back up the safety of exposing infants to such high levels of the injected metal. In fact, the Food and Drug Administration’s (FDA’s) upper limit for aluminum in intravenous (IV) fluids for newborns is far lower at five micrograms per kilogram per day (mcg/kg/day)—and even at these levels, researchers have documented the potential for impaired neurologic development. For an average newborn weighing 7.5 pounds, the HepB vaccine has over 15 times more aluminum than the FDA’s upper limit for IV solutions.\n\nUnlike Japan, the U.S. administers flu and Tdap vaccines to pregnant women (during any trimester) and babies receive flu shots at six months of age, continuing every single year thereafter. Manufacturers have never tested the safety of flu shots administered during pregnancy, and the FDA has never formally licensed any vaccines “specifically for use during pregnancy to protect the infant.”\n\nU.S. vaccine proponents claim the U.S. vaccine schedule is similar to schedules in other developed countries, but this claim is inaccurate upon scrutiny. Most other countries do not recommend vaccination during pregnancy, and very few vaccinate on the first day of life. This is important because the number, type and timing of exposure to vaccines can greatly influence their adverse impact on developing fetuses and newborns, who are particularly vulnerable to toxic exposures and early immune activation. Studies show that activation of pregnant women’s immune systems can cause developmental problems in their offspring. Why are pregnant women in the U.S. advised to protect their developing fetuses by avoiding alcohol and mercury-containing tuna fish, but actively prompted to receive immune-activating Tdap and flu vaccines, which still contain mercury (in multi-dose vials) and other untested substances?\n\nJapan initially recommended the HPV vaccine but stopped doing so in 2013 after serious health problems prompted numerous lawsuits. Japanese researchers have since confirmed a temporal relationship between HPV vaccination and recipients’ development of symptoms. U.S. regulators have ignored these and similar reports and not only continue to aggressively promote and even mandate the formerly optional HPV vaccine beginning in preadolescence but are now pushing it in adulthood. The Merck-manufactured HPV vaccine received fast-tracked approval from the FDA despite half of all clinical trial subjects reporting serious medical conditions within seven months.\n\nBest and Worst: Two Different Infant Mortality Results\n\nThe CDC views infant mortality as one of the most important indicators of a society’s overall health. The agency should take note of Japan’s rate, which, at 2 infant deaths per 1,000 live births, is the second lowest in the world, second only to the Principality of Monaco. In comparison, almost three times as many American infants die (5.8 per 1,000 live births), despite massive per capita spending on health care for children (see Table 2). U.S. infant mortality ranks behind 55 other countries and is worse than the rate in Latvia, Slovakia or Cuba.\n\nIf vaccines save lives, why are American children dying at a faster rate, and…dying younger compared to children in 19 other wealthy countries—translating into a 57 percent greater risk of death before reaching adulthood?\n\nTo reiterate, the U.S. has the most aggressive vaccine schedule of developed countries (administering the most vaccines the earliest). If vaccines save lives, why are American children “dying at a faster rate, and…dying younger” compared to children in 19 other wealthy countries—translating into a “57 percent greater risk of death before reaching adulthood”? Japanese children, who receive the fewest vaccines—with no government mandates for vaccination—grow up to enjoy “long and vigorous” lives. International infant mortality and health statistics and their correlation to vaccination protocols show results that government and health officials are ignoring at our children’s great peril.\n\nAmong the 20 countries with the world’s best infant mortality outcomes, only three countries (Hong Kong, Macau and Singapore) automatically administer the HepB vaccine to all newborns—governed by the rationale that hepatitis B infection is highly endemic in these countries. Most of the other 17 top-ranking countries—including Japan—give the HepB vaccine at birth only if the mother is hepatitis B positive (Table 1). The U.S., with its disgraceful #56 infant mortality ranking, gives the HepB vaccine to all four million babies born annually despite a low incidence of hepatitis B.\n\nIs the U.S. Sacrificing Children’s Health for Profits?\n\nMerck, the MMR vaccine’s manufacturer, is in court over MMR-related fraud. Whistleblowers allege the pharmaceutical giant rigged its efficacy data for the vaccine’s mumps component to ensure its continued market monopoly. The whistleblower evidence has given rise to two separate court cases. In addition, a CDC whistleblower has alleged the MMR vaccine increases autism risks in some children. Others have reported that the potential risk of permanent injury from the MMR vaccine dwarfs the risks of getting measles.\n\nWhy do the FDA and CDC continue to endorse the problematic MMR vaccine despite Merck’s implication in fraud over the vaccine’s safety and efficacy? Why do U.S. legislators and government officials not demand a better alternative, as Japan did over two decades ago? Why are U.S. cities and states forcing Merck’s MMR vaccine on American children? Is the U.S. government protecting children, or Merck? Why are U.S. officials ignoring Japan’s exemplary model, which proves that the most measured vaccination program in the industrialized world and “first-class sanitation and levels of nutrition” can produce optimal child health outcomes that are leading the world?\n\nA central tenet of a free and democratic society is the freedom to make informed decisions about medical interventions that carry serious potential risks. This includes the right to be apprised of benefits and risks—and the ability to say no. The Nuremberg Code of ethics established the necessity of informed consent without “any element of force, fraud, deceit, duress, over-reaching, or other ulterior form of constraint or coercion.” Forcing the MMR vaccine, or any other vaccine, on those who are uninformed or who do not consent represents nothing less than medical tyranny.\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX. Telephone:\n\nPlease DONATE TODAY To Help Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "Japan Leads the Way in Child Health: No Compulsory Vaccines | Principia Scientific Intl.", "description": "In the United States, many legislators and public health officials are busy trying to make vaccines de facto compulsory.", "url": "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/", "image": "https://proxy.duckduckgo.com/iu/?u=http%3A%2F%2Fvaccines.procon.org%2Ffiles%2F1-vaccines-images%2Fbaby_vaccination.PNG&f=1", "image:secure_url": "https://proxy.duckduckgo.com/iu/?u=http%3A%2F%2Fvaccines.procon.org%2Ffiles%2F1-vaccines-images%2Fbaby_vaccination.PNG&f=1"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/news/corruption-in-government-senator-richard-pan-of-ca/", "https://childrenshealthdefense.org/news/nyc-mandatory-measles-vaccination-violates-ny-state-law-chd-challenges-legality/", "https://www.merck.com/product/usa/pi_circulars/m/mmr_ii/mmr_ii_pi.pdf", "https://www.today.com/health/secrets-worlds-healthiest-children-6-longevity-lessons-japan-t48251", "https://www.healthaffairs.org/doi/abs/10.1377/hlthaff.2017.0767?journalCode=hlthaff", "https://www.sciencedirect.com/science/article/pii/S1876285910002500", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3824286/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6059295/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4300546/", "https://www.japantimes.co.jp/life/2014/10/04/lifestyle/vaccination-choice-two-unknowns/", "https://www.dailymail.co.uk/health/article-17509/Why-Japan-banned-MMR-vaccine.html", "https://www.jpeds.or.jp/uploads/files/20180801_JPS%20Schedule%20English.pdf", "https://www.jpeds.or.jp/uploads/files/20180801_JPS%20Schedule%20English.pdf", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://www.ncbi.nlm.nih.gov/pubmed/29805248", "https://www.bmj.com/content/351/bmj.h5966/infographic", "https://childrenshealthdefense.org/news/cdcs-universal-recommendations-for-infant-hep-b-vaccine-not-based-on-science-but-assumptions/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3509507/", "https://www.nejm.org/doi/full/10.1056/NEJM199705293362203", "https://childrenshealthdefense.org/news/fda-admits-that-government-is-recommending-untested-unlicensed-vaccines-for-pregnant-women/", "https://www.japantimes.co.jp/opinion/2016/07/29/editorials/dispute-over-hpv-vaccinations/", "https://www.ncbi.nlm.nih.gov/pubmed/30719604", "https://www.globalresearch.ca/how-vaccine-hysteria-could-spark-totalitarian-nightmare/5430900", "https://vaccine-schedule.ecdc.europa.eu/Scheduler/ByDisease?SelectedDiseaseId=15&SelectedCountryIdByDisease=-1", "https://ahrp.org/public-health-gone-awry-birth-dose-of-hepatitis-b-vaccine/", "https://www.sciencedirect.com/science/article/pii/S0889159107002553", "https://childrenshealthdefense.org/news/maternal-immune-activation-and-autism/", "https://www.ncbi.nlm.nih.gov/pubmed/22310921", "https://www.japantimes.co.jp/opinion/2016/07/29/editorials/dispute-over-hpv-vaccinations/", "https://www.ncbi.nlm.nih.gov/pubmed/30719604", "https://www.businessinsider.com/r-only-three-us-states-mandate-recommended-hpv-vaccine-2015-7", "https://www.cdc.gov/hpv/parents/vaccine.html", "https://www.fda.gov/NewsEvents/Newsroom/PressAnnouncements/ucm622715.htm", "https://childrenshealthdefense.org/wp-content/uploads/02-26-19-Final-3-Gardasil-9-ACIP-2-25-19.pdf", "https://www.cdc.gov/reproductivehealth/maternalinfanthealth/infantmortality.htm", "https://www.cia.gov/library/publications/the-world-factbook/rankorder/2091rank.html", "https://www.healthaffairs.org/doi/abs/10.1377/hlthaff.2017.0767?journalCode=hlthaff", "https://www.theatlantic.com/health/archive/2016/12/why-are-so-many-americans-dying-young/510455/", "https://www.usnews.com/news/best-countries/articles/2018-01-11/us-has-highest-child-mortality-rate-of-20-rich-countries", "https://www.today.com/health/secrets-worlds-healthiest-children-6-longevity-lessons-japan-t48251", "https://www.cia.gov/library/publications/the-world-factbook/rankorder/2091rank.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1398037/", "https://www.albertadoctors.org/Advocacy/Hepatitis_B_Endemic_Countries.pdf", "https://www.jpeds.or.jp/uploads/files/20180801_JPS%20Schedule%20English.pdf", "https://childrenshealthdefense.org/news/vaccines/mmr-vaccines-poison-pill-mumps-after-puberty-reduced-testosterone-and-sperm-counts/", "https://www.huffingtonpost.ca/lawrence-solomon/merck-whistleblowers_b_5881914.html", "https://childrenshealthdefense.org/video/rfk-jr-taking-on-big-pharma-the-vaccine-industry/", "https://physiciansforinformedconsent.org/wp-content/uploads/2018/05/MeaslesVRS.pdf", "https://www.japantimes.co.jp/life/2014/10/04/lifestyle/vaccination-choice-two-unknowns/", "https://physiciansforinformedconsent.org/wp-content/uploads/2018/05/MeaslesVRS.pdf", "https://history.nih.gov/research/downloads/nuremberg.pdf", "https://www.globalresearch.ca/japan-no-vaccine-mandates-no-mmr-vaccine-healthier-children/5675901", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=twitter", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=facebook", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=telegram", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=custom-1654796357", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=linkedin", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20Japan%20Leads%20the%20Way%20in%20Child%20Health%3A%20No%20Compulsory%20Vaccines&body=https%3A%2F%2Fprincipia-scientific.com%2Fjapan-leads-the-way-in-child-health-no-compulsory-vaccines%2F&share=email", "#", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=pinterest", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=pocket", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=tumblr", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=skype", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/?share=jetpack-whatsapp", "https://principia-scientific.com/japan-leads-the-way-in-child-health-no-compulsory-vaccines/#print"], "authors": [], "publish_date": "May 10, 2019"}