{"result_id": "246013", "URL": "https://principia-scientific.org/europe-going-for-the-vaccination-gun/", "timestamp": "2023-04-25 16:53:41 CEST+0200", "meta": {"description": "Pressured by Big Pharma Europe is moving closer to mandatory vaccination", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/europe-going-for-the-vaccination-gun/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Europe going for the vaccination gun | Principia Scientific Intl.", "cleaned_text": "Europe going for the vaccination gun\n\nEurope is moving closer to mandatory vaccination. The drive is spearheaded by a collaboration between the European Union (EU) and Big Pharma companies. Many citizens of EU member countries aren’t even aware of what is happening. Key high-level meetings are being held in secret.\n\nThose who are aware, and object to what is on the planning table, are being ignored.\n\nRobert F Kennedy Jr. and the World Mercury Project have a report:\n\n“European Union (EU) residents have less confidence in vaccine safety than people in any other region in the world. From the perspective of the powerful pharmaceutical industry and its bought politicians, this growing skepticism about vaccine orthodoxy cannot be permitted to gain further momentum.”\n\n“Ignoring massive protests by citizens and municipal authorities, the governments of France, Italy and other EU nations (with the help of Big-Pharma lobbyists) have begun methodically and paternalistically proposing and/or enacting new vaccine laws. These laws aim to erase any remaining ability for citizens to weigh risk-benefit information and make vaccine decisions for themselves.”\n\n“And now, the European Parliament (the EU’s law-making body) has thrown its considerable weight into the fray to promote EU-wide coordination of vaccination policies and programs. Not content to let vaccination policy remain ‘a competence of national authorities,’ the Parliament’s committee on the Environment, Public Health and Food Safety adopted a resolution in March 2018 to promote stricter policies both ‘within and outside the EU.’ To carry out this aim, the European Commission (the EU’s executive arm) will present, in 2018, a Joint Action to increase vaccination coverage and address ‘vaccine hesitancy’.”\n\n“According to a commentary on the resolution in The British Medical Journal (BMJ), European Parliament members are unwilling to brook any dissent, characterizing all licensed vaccines as safe and dismissing information to the contrary as ‘unreliable, misleading and unscientific.’ A query that one might legitimately pose in return, however, is whether massive lobbying by the pharmaceutical industry has rendered parliamentarians incapable of impartiality.”\n\nThe EU-Pharma claw is squeezing tighter. The citizens of Europe are in the grip. Freedom of choice is at stake. Health is at stake. The official iron-fisted stance on vaccines—“safe and effective beyond question or doubt”—is fascism personified.\n\nThe EU will not back down. Therefore, the answer is: exit the EU. Leave it in the dust.\n\nThe EU vision of a United Europe is the old Nazi plan in a new suit. First came the common market, which eventually morphed into a political framework of governance of European nations from above. That is now a reality.\n\nAs predicted by many analysts, this structure—friendly and encouraging on the surface—has enacted a tidal wave of rules and regulations to choke the population.\n\nAnd now, injection of toxic substances (e.g., aluminum, formaldehyde) in the bodies of millions. Ordered. Mandated. If the EU has its way.\n\nLine up. Take your shots.\n\nOne of Europe’s most important 20th-century political analysts, Ivan Illich, wrote these explosive words in 1977: “The combined death rate from scarlet fever, diphtheria, whooping cough and measles among children up to fifteen shows that nearly 90 percent of the total decline in mortality between 1860 and 1965 had occurred before the introduction of antibiotics and widespread immunization. In part, this recession may be attributed to improved housing and to a decrease in the virulence of micro-organisms, but by far the most important factor was a higher host-resistance due to better nutrition.” (Medical Nemesis, Bantam Books)\n\nIllich is only one of the many critics of vaccination the EU has studiously chosen to ignore, in its pursuit of establishing a pharmaceutical empire.\n\nThe EU also chooses to trample on freedom without a second thought—on its own continent, where once a struggle of centuries birthed freedom in the West.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "Europe going for the vaccination gun | Principia Scientific Intl.", "description": "Pressured by Big Pharma Europe is moving closer to mandatory vaccination", "url": "https://principia-scientific.com/europe-going-for-the-vaccination-gun/", "image": "https://principia-scientific.com/wp-content/uploads/2018/05/gun.jpg", "image:secure_url": "https://principia-scientific.com/wp-content/uploads/2018/05/gun.jpg", "image:width": "792", "image:height": "420"}, "tags": [], "tweets": [], "movies": [], "links": ["https://worldmercuryproject.org/news/big-pharmas-stranglehold-on-vaccination-policy-in-europe/", "https://jonrappoport.wordpress.com/2018/05/08/europe-under-the-vaccination-gun-an-expanding-tragedy/", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=twitter", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=facebook", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=telegram", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=custom-1654796357", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=linkedin", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20Europe%20going%20for%20the%20vaccination%20gun&body=https%3A%2F%2Fprincipia-scientific.com%2Feurope-going-for-the-vaccination-gun%2F&share=email", "#", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=pinterest", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=pocket", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=tumblr", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=skype", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/?share=jetpack-whatsapp", "https://principia-scientific.com/europe-going-for-the-vaccination-gun/#print"], "authors": [], "publish_date": "May 17, 2018"}