{"result_id": "246038", "URL": "https://principia-scientific.org/californias-forced-vaccinations-a-violation-of-nuremberg-code/", "timestamp": "2023-04-25 16:54:03 CEST+0200", "meta": {"description": "Scientists fear new mandatory vaccination law in California for men, women and children is first step towards universal compulsory vaccination.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "California's Forced Vaccinations a Violation of Nuremberg Code | Principia Scientific Intl.", "cleaned_text": "Concerns are mounting among scientists that the recent implementation of SB277 making vaccinations mandatory law in California for men, women and children is a chilling step towards universal compulsory vaccination.\n\nCoupled with the fact governments and multi-national pharmaceutical companies are being prosecuted and convicted over poorly-tested and administered vaccines, suggests a crisis is coming.\n\nVaccine activists are citing the notorious post Second World War Nuremberg Trials in which Nazi doctors were convicted of forced experiments on humans. Fears are that seemingly once benign governments are now resorting to forcing medication into the bodies of the unwilling masses and their children without their consent.\n\nHere is a short video discussing the ethical questions raised by many concerned parents during the debates leading up to the implementation of SB277 in California. The focus here is the concerns of these educated parents who were very aware of the possibilities of vaccine damage, wanting to know who gets to decide if the (possible) gains outweigh the (known) risks …\n\nVaccines are scientifically proven to have side-effects ranging from mild to catastrophic. These may include anything from a mild rash, a compromised immune system, sterility, cognitive dysfunction (brain damage), paralysis, cancer, to … death and many more “proven” issues not mentioned here.\n\nWe are constantly being told by the healthcare personnel we trust that the chance of vaccine damage is “Less than one in a million”, yet statistics prove over and over again that this is a totally erroneous and massively understated number, with the actual occurrences of harm caused by vaccines being massively higher, and in fact … very common.\n\nEven with the cases reported being well in excess of the laughable quote stated above, we must also consider that the CDC itself states that as few as 1 – 10{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of vaccine damage incidents are ever reported as such, making the possible total ‘Magnitudes Higher’ than what we are made aware of via the CDC or the Vaccine Adverse Event Reporting System (VAERS). National Vaccine Information Center (NVIC) is stating Proposed Changes Restrict Vaccine Reaction Reporting, making these incidences of vaccine damage even more difficult to track or tally (intentionally).\n\n\n\nNow lets consider that the vaccine court (VICP) in this country has already paid out well over $3 BILLION in damages, and this is to only a very small percentage of possible claimants who actually get their cases heard, and can prove damage to a (known) biased system of supposed justice.\n\nSo how rare can vaccine damage actually be … ???\n\nApproximately thirty thousand (30,000) VAERS reports are filed annually, and again the CDC states that only 10{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} (on the high side) of actual cases are ever reported … Yea do the math (300,000)! Now not all of these are life threatening, but how many are life wrecking? If even 10-20{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} are life threatening, wrecking, or stealing (30,000 – 60,000 a year), that is still a huge number, and magnitudes above “one in a million.” That would actually equate to less than 320 adverse reactions nation wide if EVERYONE in the country (about 320 million people) is vaccinated in a calendar year … But the fact is only about 25{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of the public is vaccinated each year (all vaccinations combined) making the actual number about 80 cases of vaccine damage … if these doctors are correct (BULL SH#T)!\n\nNow take the above numbers and plot probable vaccine damage with 10{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} reported over just the last decade … 300,000 x 10 = 3,000,000, and if we use 1{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} reported … 30,000,000! Now try to imagine the damage to the American society, or the entire vaccinated global community over the last century of ever increasing vaccine proliferation, and you will come to understand that vaccines may very well be responsible for more death and human suffering than ANY or maybe ALL wars in human history.\n\nWe can easily see, with even the most rudimentary research, the possible incidence of vaccine damage is mind bending and so far above the lies and platitudes fed to us by those we are conditioned to trust, that it is almost inconceivable. Please understand that if the above statement (less than one in a million) were true … Vaccines would be among the safest mechanisms on this planet, but all data points Blatantly to Exactly the Opposite.\n\nWhen all is said and done We The People (more every day) are becoming painfully aware of the frequency and magnitude of Vaccine damage and we are horrified and angry!\n\nHow is this Medical Experimentation?\n\nWith the many proven side-effects, and NO long term Proven Efficacy or Harm Study on vaccines (or multiple dose vaccinations) ever accomplished or even commissioned by the CDC, that we are made aware of in a century of use in the USA (try to find one), they can have no scientific or factual claim to being an effective or safe mechanism. Thus by default, HOW can this be considered or categorized as anything more than Medical Experimentation?\n\nPlease watch as Dr. Russell Blaylock connects the vaccine industry today to violations of the Nuremberg Code …\n\nThe Nuremberg trials where 23 defendants, all medical doctors, were accused of having been involved in the horrors of Nazi human experimentation, procedures and exposures without the consent of those experimented on. The trial lasted eight months, from December 9, 1946, to August 20, 1947. Of the 23 defendants, five were acquitted, seven received death sentences, and the remaining received prison sentences ranging from 10 years to life imprisonment. Those sentenced to death were hanged on June 2, 1948, in Landsberg Prison, Bavaria.\n\nWhat resulted from this was the ten points of the Nuremberg Code. Of these ten points the following are most germane to this discussion, those being:\n\nThe voluntary consent of the human subject is absolutely essential. This means that the person involved should have legal capacity to give consent; should be so situated as to be able to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, over-reaching, or other ulterior form of constraint or coercion; and should have sufficient knowledge and comprehension of the elements of the subject matter involved as to enable him/her to make an understanding and enlightened decision. This latter element requires that before the acceptance of an affirmative decision by the experimental subject there should be made known to him the nature, duration, and purpose of the experiment; the method and means by which it is to be conducted; all inconveniences and hazards reasonable to be expected; and the effects upon his health or person which may possibly come from his participation in the experiment. The duty and responsibility for ascertaining the quality of the consent rests upon each individual who initiates, directs or engages in the experiment. It is a personal duty and responsibility which may not be delegated to another with impunity.\n\nNo experiment should be conducted where there is a prior reason to believe that death or disabling injury will occur; except, perhaps, in those experiments where the experimental physicians also serve as subjects.\n\nProper preparations should be made and adequate facilities provided to protect the experimental subject against even remote possibilities of injury, disability, or death.\n\nDuring the course of the experiment the human subject should be at liberty to bring the experiment to an end if he has reached the physical or mental state where continuation of the experiment seems to him to be impossible.\n\nDuring the course of the experiment the scientist in charge must be prepared to terminate the experiment at any stage, if he has probable cause to believe, in the exercise of the good faith, superior skill and careful judgment required of him that a continuation of the experiment is likely to result in injury, disability, or death to the experimental subject.\n\nWith forced or mandated vaccinations, the known side-effects of vaccines, the total lack of consideration (research) of either efficacy or harm, the lack of full (true) disclosure of any of the information stated above prior to application, the total immunity from prosecution of the entire chain from production to administration, and the denial or cover-up of known causality … ALL … of these above (Nuremberg Code) points are Grossly Violated.\n\nIf one stops to consider the testimony of individuals such as Dr. Thompson and other learned CDC whistle-blowers, the ethics question is a total and disastrous failure. If one also stops to consider the untold number of high level research scientists globally who have dedicated their lives and staked their professional reputations on proving the harm and danger of vaccines … proof gone unnoticed, ignored, or intentionally buried, by governments and health agencies, the morals question is also a catastrophic failure.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "California's Forced Vaccinations a Violation of Nuremberg Code | Principia Scientific Intl.", "description": "Scientists fear new mandatory vaccination law in California for men, women and children is first step towards universal compulsory vaccination.", "url": "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/", "image": "https://principia-scientific.com/wp-content/uploads/2018/11/consent.jpg", "image:secure_url": "https://principia-scientific.com/wp-content/uploads/2018/11/consent.jpg", "image:width": "652", "image:height": "541"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "680", "height": "380", "embed_code": "<iframe src=\"https://www.youtube.com/embed/91k1A5huwBg\" width=\"680\" height=\"380\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/91k1A5huwBg"}, {"embed_type": "iframe", "provider": "youtube", "width": "680", "height": "380", "embed_code": "<iframe src=\"https://www.youtube.com/embed/Pgufs-B2Llg\" width=\"680\" height=\"380\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/Pgufs-B2Llg"}], "links": ["https://principia-scientific.com/u-s-government-defeated-in-vaccine-safety-lawsuit/", "http://www.nvic.org/NVIC-Vaccine-News/January-2015/CDC-Changes-Restrict-Vaccine-Reaction-Reports.aspx", "http://vaers.hhs.gov/index", "http://www.nvic.org/", "http://www.nvic.org/NVIC-Vaccine-News/January-2015/CDC-Changes-Restrict-Vaccine-Reaction-Reports.aspx", "http://www.hrsa.gov/vaccinecompensation/index.html", "http://www.nvic.org/NVIC-Vaccine-News/January-2015/CDC-Changes-Restrict-Vaccine-Reaction-Reports.aspx", "http://www.thelibertybeacon.com/mandatoryforced-vaccinations-a-blatant-violation-of-the-nuremberg-code/", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=twitter", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=facebook", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=telegram", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=custom-1654796357", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=linkedin", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20California%27s%20Forced%20Vaccinations%20a%20Violation%20of%20Nuremberg%20Code&body=https%3A%2F%2Fprincipia-scientific.com%2Fcalifornias-forced-vaccinations-a-violation-of-nuremberg-code%2F&share=email", "#", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=pinterest", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=pocket", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=tumblr", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=skype", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/?share=jetpack-whatsapp", "https://principia-scientific.com/californias-forced-vaccinations-a-violation-of-nuremberg-code/#print"], "authors": [], "publish_date": "November 12, 2018"}