{"result_id": "246037", "URL": "https://principia-scientific.org/the-truth-about-the-1918-viral-influenza-pandemic/", "timestamp": "2023-04-25 16:54:02 CEST+0200", "meta": {"description": "It Started with the Rockefeller Institute's Crude Bacterial Meningitis Vaccination Experiment on US Troops. The 1918-19 bacterial vaccine experiment may have killed 50-100 million people. “During the war years 1918-19, the US Army ballooned to 6,000,000 men, with 2,000,000 men being sent overseas. The Rockefeller Institute for Medical Research took advantage of this new pool", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "The Truth About the 1918 ‘Viral Influenza’ Pandemic | Principia Scientific Intl.", "cleaned_text": "The Truth About the 1918 ‘Viral Influenza’ Pandemic\n\nIt Started with the Rockefeller Institute’s Crude Bacterial Meningitis Vaccination Experiment on US Troops. The 1918-19 bacterial vaccine experiment may have killed 50-100 million people.\n\n“During the war years 1918-19, the US Army ballooned to 6,000,000 men, with 2,000,000 men being sent overseas. The Rockefeller Institute for Medical Research took advantage of this new pool of human guinea pigs to conduct vaccine experiments.” “During WW1, the Rockefeller Institute also sent its experimental anti-meningococcal serum to England, France, Belgium, Italy and other countries, helping spread the epidemic worldwide.” “The Rockefeller Institute and its experimental bacterial meningococcal vaccine, contrary to the accepted mythology may have killed 50-100 million people in 1918-1919.” “The crude anti-bacterial vaccine used in the Fort Riley experiment on soldiers was made in horses.” “According to a 2008 National Institute of Health paper, bacterial pneumonia was the killer in a minimum of 92.7{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of the 1918-19 Pandemic autopsies reviewed.” “Clean water, sanitation, flushing toilets, refrigerated foods and healthy diets have done and still do far more to protect humanity from infectious diseases than any vaccine program.” “In 1918, the vaccine industry experimented on soldiers…with disastrous results—but in 2018, the vaccine industry experiments on infants every day. The vaccine schedule has never been tested as it is given. The results of the experiment are in: 1 in 7 of America’s fully vaccinated children is in some form of special education and over 50{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} have some form of chronic illness.”The “Spanish Flu” killed an estimated 50-100 million people during a pandemic 1918-19.”\n\nWhat if the story we have been told about this pandemic isn’t true? What if, instead, the killer infection was neither the flu nor Spanish in origin?\n\nNewly analyzed documents reveal that the “Spanish Flu” may have been a military vaccine experiment gone awry.\n\nSummary\n\n The reason modern technology has not been able to pinpoint the killer influenza strain from this pandemic is because influenza was not the killer.\n\nMore soldiers died during WWI from disease than from bullets.\n\nThe pandemic was not flu. An estimated 95{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} (or higher) of the deaths were caused by bacterial pneumonia, not an influenza virus.\n\nThe pandemic was not Spanish. The first cases of bacterial pneumonia in 1918 trace back to military bases, the first one in Fort Riley, Kansas.\n\nFrom January 21 – June 4, 1918, an experimental bacterial meningitis vaccine cultured in horses by the Rockefeller Institute for Medical Research in New York was injected into soldiers at Fort Riley.\n\nDuring the remainder of 1918 as those soldiers – often living and traveling under poor sanitary conditions – were sent to Europe to fight, they spread bacteria at every stop between Kansas and the frontline trenches in France.\n\nOne study describes soldiers “with active infections (who) were aerosolizing the bacteria that colonized their noses and throats, while others—often, in the same “breathing spaces”—were profoundly susceptible to invasion of and rapid spread through their lungs by their own or others’ colonizing bacteria.” (1)\n\nThe “Spanish Flu” attacked healthy people in their prime. Bacterial pneumonia attacks people in their prime. Flu attacks the young, old and immunocompromised.\n\nWhen WW1 ended on November 11, 1918, soldiers returned to their home countries and colonial outposts, spreading the killer bacterial pneumonia worldwide.\n\nDuring WW1, the Rockefeller Institute also sent its experimental anti-meningococcal serum to England, France, Belgium, Italy and other countries, helping spread the epidemic worldwide.\n\nDuring the pandemic of 1918-19, the so-called “Spanish Flu” killed 50-100 million people, including many soldiers.\n\nMany people do not realize that disease killed far more soldiers on all sides than machine guns or mustard gas or anything else typically associated with WWI.\n\nI have a personal connection to the Spanish Flu. Among those killed by disease in 1918-19 are members of both of my parents’ families.\n\nOn my father’s side, his grandmother Sadie Hoyt died from pneumonia in 1918. Sadie was a Chief Yeoman in the Navy. Her death left my grandmother Rosemary and her sister Anita to be raised by their aunt. Sadie’s sister Marian also joined the Navy. She died from “the influenza” in 1919.\n\nOn my mother’s side, two of her father’s sisters died in childhood. All of the family members who died lived in New York City.\n\nI suspect many American families, and many families worldwide, were impacted in similar ways by the mysterious Spanish Flu.\n\nIn 1918, “influenza” or flu was a catchall term for disease of unknown origin. It didn’t carry the specific meaning it does today.\n\nIt meant some mystery disease which dropped out of the sky. In fact, influenza is from the Medieval Latin “influential” in an astrological sense, meaning a visitation under the influence of the stars.\n\nWhy is What Happened 100 Years Ago Important Now?\n\n Between 1900-1920, there were enormous efforts underway in the industrialized world to build a better society. I will use New York as an example to discuss three major changes to society which occurred in NY during that time and their impact on mortality from infectious diseases.\n\n1. Clean Water and Sanitation\n\n In the late 19th century through the early 20th century, New York built an extraordinary system to bring clean water to the city from the Catskills, a system still in use today. New York City also built over 6000 miles of sewer to take away and treat waste, which protects the drinking water. The World Health Organization acknowledges the importance of clean water and sanitation in combating infectious diseases. (2)\n\n2. Electricity\n\n In the late 19th century through the early 20th century, New York built a power grid and wired the city so power was available in every home. Electricity allows for refrigeration. Refrigeration is an unsung hero as a public health benefit. When food is refrigerated from farm to table, the public is protected from potential infectious diseases. Cheap renewable energy is important for many reasons, including combating infectious diseases.\n\n3. Rockefeller’s Pharmaceutical Industry\n\n In the late 19th century through the early 20th century, New York became the home of the Rockefeller Institute for Medical Research (now Rockefeller University). The Institute is where the modern pharmaceutical industry was born. The Institute pioneered many of the approaches the pharmaceutical industry uses today, including the preparation of vaccine serums, for better or worse. The vaccine used in the Fort Riley experiment on soldiers was made in horses.\n\nUS Mortality Rates data from the turn of the 20th century to 1965 clearly indicates that clean water, flushing toilets, effective sewer systems and refrigerated foods all combined to effectively reduce mortality from infectious diseases BEFORE vaccines for those diseases became available.\n\nHave doctors and the pharmaceutical manufacturers taken credit for reducing mortality from infectious disease which rightfully belongs to sandhogs, plumbers, electricians and engineers?\n\n If hubris at the Rockefeller Institute in 1918 led to a pandemic disease which killed millions of people, what lessons can we learn and apply to 2018?\n\nThe Disease Was Not Spanish\n\n While watching an episode of American Experience on PBS a few months ago, I was surprised to hear that the first cases of “Spanish Flu” occurred at Fort Riley, Kansas in 1918. I thought, how is it possible this historically important event could be so badly misnamed 100 years ago and never corrected?\n\nWhy “Spanish”?\n\n Spain was one of a few countries not involved in World War I. Most of the countries involved in the war censored their press.\n\nFree from censorship concerns, the earliest press reports of people dying from disease in large numbers came from Spain. The warring countries did not want to additionally frighten the troops, so they were content to scapegoat Spain. Soldiers on all sides would be asked to cross no man’s land into machine gun fire, which was frightening enough without knowing that the trenches were a disease breeding ground.\n\nOne hundred years later, it’s long past time to drop “Spanish” from all discussion of this pandemic. If the flu started at a United States military base in Kansas, then the disease could and should be more aptly named.\n\nIn order to prevent future disasters, the US (and the rest of the world) must take a hard look at what really caused the pandemic.\n\nIt is possible that one of the reasons the Spanish Flu has never been corrected is that it helps disguise the origin of the pandemic.\n\nIf the origin of the pandemic involved a vaccine experiment on US soldiers, then the US may prefer calling it Spanish Flu instead of The Fort Riley Bacteria of 1918, or something similar. The Spanish Flu started at the location this experimental bacterial vaccine was given making it the prime suspect as the source of the bacterial infections which killed so many.\n\nIt would be much more difficult to maintain the marketing mantra of “vaccines save lives” if a vaccine experiment originating in the United States during the years of primitive manufacturing caused the deaths of 50-100 million people.\n\n“The American Rockefeller Institute for Medical Research and its experimental bacterial meningococcal vaccine may have killed 50-100 million people in 1918-19” is a far less effective sales slogan than the overly simplistic ‘vaccines save lives’.” – Kevin Barry\n\nThe Disease Which Killed so Many was not Flu nor was it a Virus. It was Bacterial\n\n During the mid-2000’s there was much talk about “pandemic preparedness.” Influenza vaccine manufacturers in the United States received billions of taxpayer dollars to develop vaccines to make sure that we don’t have another lethal pandemic “flu,” like the one in 1918-19.\n\nCapitalizing on the “flu” part of Spanish flu helped vaccine manufacturers procure billion-dollar checks from governments, even though scientists knew at the time that bacterial pneumonia was the real killer.\n\nIt is not my opinion that bacterial pneumonia was the real killer – thousands of autopsies confirm this fact.\n\nAccording to a 2008 National Institute of Health paper, bacterial pneumonia was the killer in a minimum of 92.7{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of the 1918-19 autopsies reviewed. It is likely higher than 92.7{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}.\n\nThe researchers looked at more than 9000 autopsies, and “there were no negative (bacterial) lung culture results.”\n\n“… In the 68 higher-quality autopsy series, in which the possibility of unreported negative cultures could be excluded, 92.7{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of autopsy lung cultures were positive for ≥1 bacterium. … in one study of approximately 9000 subjects who were followed from clinical presentation with influenza to resolution or autopsy, researchers obtained, with sterile technique, cultures of either pneumococci or streptococci from 164 of 167 lung tissue samples.\n\n “There were 89 pure cultures of pneumococci; 19 cultures from which only streptococci were recovered; 34 that yielded mixtures of pneumococci and/or streptococci; 22 that yielded a mixture of pneumococci, streptococci, and other organisms (prominently pneumococci and nonhemolytic streptococci); and 3 that yielded nonhemolytic streptococci alone. There were no negative lung culture results.” (3)\n\nPneumococci or streptococci were found in “164 of (the) 167 lung tissue samples” autopsied. That is 98.2{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}. Bacteria was the killer.\n\nWhere Did the Spanish Flu Bacterial Pneumonia of 1918-19 Originate?\n\n When the United States declared war in April 1917, the fledgling Pharmaceutical industry had something they had never had before – a large supply of human test subjects in the form of the US military’s first draft.\n\nPre-war in 1917, the US Army was 286,000 men. Post-war in 1920, the US army disbanded, and had 296,000 men.\n\nDuring the war years 1918-19, the US Army ballooned to 6,000,000 men, with 2,000,000 men being sent overseas. The Rockefeller Institute for Medical Research took advantage of this new pool of human guinea pigs to conduct vaccine experiments.\n\nA Report on Anti-meningitis Vaccination and Observations on Agglutinins in the Blood of Chronic Meningococcus Carriers as Recorded by Frederick L. Gates, MD in 1918\n\nFrom the Base Hospital, Fort Riley, Kansas and The Rockefeller Institute for Medical Research, New York. Received July 20, 1918\n\nBetween January 21st and June 4th of 1918, Dr. Gates reports on an experiment where soldiers were given 3 doses of a bacterial meningitis vaccine. Those conducting the experiment on the soldiers were just spit-balling dosages of a vaccine serum made in horses.\n\nThe vaccination regime was designed to be 3 doses.\n\n4,792 men received the first dose, but only 4,257 got the 2nd dose (down 11{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}), and only 3702 received all three doses (down 22.7{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}).\n\nA total of 1,090 men were not there for the 3rd dose. What happened to these soldiers? Were they shipped East by train from Kansas to board a ship to Europe? Were they in the Fort Riley hospital? Dr. Gates’ report doesn’t tell us.\n\nAn article accompanying the American Experience broadcast I watched sheds some light on where these 1,090 men might be. Gates began his experiments in January 1918.\n\nBy March of that year, “100 men a day” were entering the infirmary at Fort Riley.\n\nAre some of these the men missing from Dr. Gates’ report – the ones who did not get the 2nd or 3rd dose?\n\n“… Shortly before breakfast on Monday, March 11, the first domino would fall signaling the commencement of the first wave of the 1918 influenza.\n\n“Company cook Albert Gitchell reported to the camp infirmary with complaints of a “bad cold.”\n\n“Right behind him came Corporal Lee W. Drake voicing similar complaints.\n\n“By noon, camp surgeon Edward R. Schreiner had over 100 sick men on his hands, all apparently suffering from the same malady…” (5)\n\nGates does report that several of the men in the experiment had flu-like symptoms: coughs, vomiting and diarrhea after receiving the vaccine.\n\nThese symptoms are a disaster for men living in barracks, travelling on trains to the Atlantic coast, sailing to Europe, and living and fighting in trenches.\n\nThe unsanitary conditions at each step of the journey are an ideal environment for a contagious disease like bacterial pneumonia to spread.\n\nFrom Dr. Gates’ report:\n\n “Several cases of looseness of the bowels or transient diarrhea were noted. This symptom had not been encountered before. Careful inquiry in individual cases often elicited the information that men who complained of the effects of vaccination were suffering from mild coryza, bronchitis, etc., at the time of injection.\n\n“Sometimes the reaction was initiated by a chill or chilly sensation, and a number of men complained of fever or feverish sensations during the following night.\n\n“Next in frequency came nausea (occasionally vomiting), dizziness, and general “aches and pains” in the joints and muscles, which in a few instances were especially localized in the neck or lumbar region, causing stiff neck or stiff back. A few injections were followed by diarrhea.\n\n“The reactions, therefore, occasionally simulated the onset of epidemic meningitis and several vaccinated men were sent as suspects to the Base Hospital for diagnosis.” (4)\n\nAccording to Gates, they injected random dosages of an experimental bacterial meningitis vaccine into soldiers. Afterwards, some of the soldiers had symptoms which “simulated” meningitis, but Dr. Gates advances the fantastical claim that it wasn’t actual meningitis.\n\nThe soldiers developed flu-like symptoms. Bacterial meningitis, then and now, is known to mimic flu-like symptoms. (6)\n\nPerhaps the similarity of early symptoms of bacterial meningitis and bacterial pneumonia to symptoms of flu is why the vaccine experiments at Fort Riley have been able to escape scrutiny as a potential cause of the Spanish Flu for 100 years and counting.\n\nHow did the “Spanish Flu” Spread so Widely and so Quickly?\n\n There is an element of a perfect storm in how the Gates bacteria spread. WWI ended only 10 months after the first injections. Unfortunately for the 50-100 million who died, those soldiers injected with horse-infused bacteria moved quickly during those 10 months.\n\nAn article from 2008 on the CDC’s website describes how sick WWI soldiers could pass along the bacteria to others by becoming “cloud adults.”\n\n“Finally, for brief periods and to varying degrees, affected hosts became “cloud adults” who increased the aerosolization of colonizing strains of bacteria, particularly pneumococci, hemolytic streptococci, H. influenzae, and S. aureus.\n\n“For several days during local epidemics—particularly in crowded settings such as hospital wards, military camps, troop ships, and mines (and trenches)—some persons were immunologically susceptible to, infected with, or recovering from infections with influenza virus.\n\n“Persons with active infections were aerosolizing the bacteria that colonized their noses and throats, while others—often, in the same “breathing spaces”—were profoundly susceptible to invasion of and rapid spread through their lungs by their own or others’ colonizing bacteria.” (1)\n\nThree times in his report on the Fort Riley vaccine experiment, Dr. Gates states that some soldiers had a “severe reaction” indicating “an unusual individual susceptibility to the vaccine”.\n\nWhile the vaccine made many sick, it only killed those who were susceptible to it. Those who became sick and survived became “cloud adults” who spread the bacteria to others, which created more cloud adults, spreading to others where it killed the susceptible, repeating the cycle until there were no longer wartime unsanitary conditions, and there were no longer millions of soldiers to experiment on.\n\nThe toll on US troops was enormous and it is well documented. Dr. Carol Byerly describes how the “influenza” traveled like wildfire through the US military. (substitute “bacteria” for Dr. Byerly’s “influenza” or “virus”):\n\n“… Fourteen of the largest training camps had reported influenza outbreaks in March, April, or May, and some of the infected troops carried the virus with them aboard ships to France …\n\n“As soldiers in the trenches became sick, the military evacuated them from the front lines and replaced them with healthy men.\n\n“This process continuously brought the virus into contact with new hosts—young, healthy soldiers in which it could adapt, reproduce, and become extremely virulent without danger of burning out.\n\n“… Before any travel ban could be imposed, a contingent of replacement troops departed Camp Devens (outside of Boston) for Camp Upton, Long Island, the Army’s debarkation point for France, and took influenza with them.\n\n“Medical officers at Upton said it arrived “abruptly” on September 13, 1918, with 38 hospital admissions, followed by 86 the next day, and 193 the next.\n\n“Hospital admissions peaked on October 4 with 483, and within 40 days, Camp Upton sent 6,131 men to the hospital for influenza. Some developed pneumonia so quickly that physicians diagnosed it simply by observing the patient rather than listening to the lungs…” (7)\n\n“The United States was not the only country in possession of the Rockefeller Institute’s experimental bacterial vaccine.\n\n“A 1919 report from the Institute states: “Reference should be made that before the United States entered the war (in April 1917) the Institute had resumed the preparation of anti-meningococcic serum, in order to meet the requests of England, France, Belgium Italy and other countries.”\n\n“The same report states: “In order to meet the suddenly increased demand for the curative serums worked out at the Institute, a special stable for horses was quickly erected …” (8)\n\nAn experimental anti-meningoccic serum made in horses and injected into soldiers who would be entering the cramped and unsanitary living conditions of war … what could possibly go wrong?\n\nIs the bacterial serum made in horses at the Rockefeller Institute which was injected into US soldiers and distributed to numerous other countries responsible for the 50-100 million people killed by bacterial lung infections in 1918-19?\n\nThe Institute says it distributed the bacterial serum to England, France, Belgium, Italy and other countries during WWI. Not enough is known about how these countries experimented on their soldiers.\n\nI hope independent researchers will take an honest look at these questions.\n\nThe Road to Hell is Paved with Good Intentions\n\n I do not believe that anyone involved in these vaccine experiments was trying to harm anyone.\n\n Some will see the name Rockefeller and yell. “Illuminati!” or “culling the herd!”\n\nI do not believe that’s what happened.\n\nI believe standard medical hubris is responsible – doctors “playing God”, thinking they can tame nature without creating unanticipated problems.\n\nWith medical hubris, I do not think the situation has changed materially over the past 100 years.\n\nWhat Now?\n\n The vaccine industry is always looking for human test subjects. They have the most success when they are able to find populations who not in a position to refuse.\n\nSoldiers (9), infants, the disabled, prisoners, those in developing nations – anyone not in a position to refuse.\n\nVaccine experimentation on vulnerable populations is not an issue of the past. Watch this video clip of Dr. Stanley Plotkin where he describes using experimental vaccines on orphans, the mentally retarded, prisoners, and those under colonial rule.\n\nThe deposition was in January 2018. The hubris of the medical community is the same or worse now than it was 100 years ago.\n\nWatch as Dr. Plotkin admits to writing:\n\n “The question is whether we are to have experiments performed on fully functioning adults and on children who are potentially contributors to society or to perform initial studies in children and adults who are human in form but not in social potential.”\n\nPlease watch the horrifying video clip of Dr. Stanley Plotkin testifying under oath about the experiments that the pharmaceutical industry has done on unaware, uninformed patients. https://youtu.be/yevV_slu7Dw (10)\n\nIn part because the global community is well aware of medical hubris and well aware of the poor record of medical ethics, the Universal Declaration on Bioethics and Human Rights developed international standards regarding the right to informed consent to preventative medical procedures like vaccination.\n\nThe international community is well aware that the pharmaceutical industry makes mistakes and is always on the lookout for human test subjects. The Declaration states that individuals have the human right to consent to any preventative medical intervention like vaccination.\n\n1. Human dignity, human rights and fundamental freedoms are to be fully respected.\n\n 2. The interests and welfare of the individual should have priority over the sole interest of science or society.\n\nArticle 6 – Consent\n\n 1. Any preventive, diagnostic and therapeutic medical intervention is only to be carried out with the prior, free and informed consent of the person concerned, based on adequate information. The consent should, where appropriate, be express and may be withdrawn by the person concerned at any time and for any reason without disadvantage or prejudice. (11)\n\nClean water, sanitation, flushing toilets, refrigerated foods and healthy diets have done and still do far more to protect humanity from infectious diseases than any vaccine program.\n\nDoctor and the vaccine industry have usurped credit which rightfully belongs to plumbers, electricians, sandhogs, engineers and city planners.\n\nFor these reasons, policy makers at all levels of government should protect the human rights and individual liberties of individuals to opt out of vaccine programs via exemptions.\n\nThe hubris of the medical community will never go away. Policy makers need to know that vaccines like all medical interventions are not infallible.\n\nVaccines are not magic. We all have different susceptibility to disease. Human beings are not one size fits all.\n\nIn 1918-19, the vaccine industry experimented on soldiers, likely with disastrous results.\n\nIn 2018, the vaccine industry experiments on infants every day. The vaccine schedule has never been tested as it is given. The results of the experiment are in: 1 in 7 of America’s fully vaccinated children is in some form of special education and over 50{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} have some form of chronic illness. (12)\n\nIn 1918-19, there was no safety follow up after vaccines were delivered.\n\nIn 2018, there is virtually no safety follow up after a vaccine is delivered.\n\nWho exactly gave you that flu shot at Rite Aid? Do you have their cell number of the store employee if something goes wrong?\n\nIn 1918-19, there was no liability to the manufacturer for injuries or death caused by vaccines.\n\nIn 2018, there is no liability for vaccine manufacturers for injuries or death caused by vaccines, which was formalized in 1986. (13)\n\nIn 1918-19, there was no independent investigative follow up challenging the official story that “Spanish Flu” was some mystery illness which dropped from the sky. I suspect that many of those at the Rockefeller Institute knew what happened, and that many of the doctors who administered the vaccines to the troops knew what happened, but those people are long dead.\n\nIn 2018, the Pharmaceutical industry is the largest campaign donor to politicians and the largest advertiser in all forms of media, so not much has changed over 100 years.\n\nThis story will likely be ignored by mainstream media because their salaries are paid by pharmaceutical advertising.\n\nThe next time you hear someone say “vaccines save lives” please remember that the true story of the cost/benefit of vaccines is much more complicated than their three-word slogan. Also remember that vaccines may have killed 50-100 million people in 1918-19. If true, those costs greatly outweighed any benefit, especially considering that plumbers, electricians, sandhogs and engineers did, and continue to do, the real work which reduces mortality from disease.\n\nVaccines are not magic. Human rights and bioethics are critically important. Policy makers should understand the history of medical hubris and protect individual and parental human rights as described in the Universal Declaration on Bioethics and Human Rights.\n\n ——\n\n Kevin Barry is the President of First Freedoms, Inc. a 501.c.3. He is a former federal attorney, a rep at the UN HQ in New York and the author of Vaccine Whistleblower: Exposing Autism Research Fraud at the CDC. Please support our work at www.firstfreedoms.org\n\nReferences\n\n 1. Deaths from Bacterial Pneumonia during 1918–19 Influenza Pandemic\n\n John F. Brundage* and G. Dennis Shanks†\n\n Author affiliations: *Armed Forces Health Surveillance Center, Silver Spring, Maryland, USA; †Australian Army Malaria Institute, Enoggera, Queensland, Australia\n\n https://wwwnc.cdc.gov/eid/arti cle/14/8/07-1313_article\n\n 2. World Health Organization: Unsafe drinking water, sanitation and waste management\n\n http://www.who.int/sustainable -development/cities/health- risks/water-sanitation/en/\n\n 3. J Infect Dis. 2008 Oct 1; 198(7): 962–970.\n\n Predominant Role of Bacterial Pneumonia as a Cause of Death in Pandemic Influenza: Implications for Pandemic Influenza Preparedness\n\n David M. Morens, Jeffery K. Taubenberger, and Anthony S. Fauci\n\n https://www.ncbi.nlm.nih.gov/p mc/articles/PMC2599911/\n\n 4. PDF of Fort Riley Study (1918)\n\n https://www.ncbi.nlm.nih.gov/p mc/articles/PMC2126288/pdf/449 .pdf\n\n 5. American Experience, “The First Wave”, PBS\n\n https://www.pbs.org/wgbh/ameri canexperience/features/influen za-first-wave/\n\n 6. Mayo Clinic: Meningitis\n\n www.mayoclinic.org/diseases-co nditions/meningitis/symptoms- causes/syc-20350508\n\n 7. Public Health Rep. 2010; 125(Suppl 3): 82–91.\n\n The U.S. Military and the Influenza Pandemic of 1918–1919\n\n Carol R. Byerly, PhD\n\n https://www.ncbi.nlm.nih.gov/p mc/articles/PMC2862337/\n\n 8. Rockefeller Institute pamphlet PDF (1919)\n\n https://digitalcommons.rockefe ller.edu/cgi/viewcontent.cgi? article=1005&context= rockefeller-institute-descript ive-pamphlet\n\n 9. Is Military Research Hazardous to Veterans’ Health? Lessons Spanning Half a Century, A Staff Report Prepared for the Committee on Veterans’ Affairs, United States Senate, December 1994\n\n https://www.hsdl.org/?abstract &did=438835\n\n 10. Dr. Stanley Plotkin: vaccine experiments on orphans, the mentally retarded, and others (January 2018)\n\n https://youtu.be/yevV_slu7Dw\n\n 11. Universal Declaration on Bioethics and Human Rights (19 October 2005)\n\n http://portal.unesco.org/en/ev .php-URL_ID=31058&URL_DO=DO_TO PIC&URL_SECTION=201.html\n\n 12. CDC Offers New Stats On Disability Prevalence\n\n https://www.disabilityscoop.co m/2016/03/14/cdc-disability-pr evalence/22034/\n\n 13. 1986 Vaccine Injury Compensation Act\n\n https://worldmercuryproject.or g/news/childhood-vaccine-injur y-act-protect/\n\nAbout the author: Dr. Gary G. Kohls is a medical doctor working for most of his career as a rural, full-service family practice physician. In 1984 he was awarded a Bush Foundation Medical Fellowship. In the early 1990s Dr. Kohls worked at a Regional Treatment Center as a physician for psychiatric inpatients and later worked at a psychological services clinic. Now retired, he continues to present lectures and seminars to healthcare professionals and the general public, as well as editing the popular e-newsletter Preventive Psychiatry E-Newsletter (PPEN).\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX.\n\nPlease DONATE TODAY To Help Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "article", "title": "The Truth About the 1918 ‘Viral Influenza’ Pandemic | Principia Scientific Intl.", "description": "It Started with the Rockefeller Institute's Crude Bacterial Meningitis Vaccination Experiment on US Troops. The 1918-19 bacterial vaccine experiment may have killed 50-100 million people. “During the war years 1918-19, the US Army ballooned to 6,000,000 men, with 2,000,000 men being sent overseas. The Rockefeller Institute for Medical Research took advantage of this new pool", "url": "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/", "image": "https://principia-scientific.com/wp-content/uploads/2020/05/bbbb-2.jpg", "image:secure_url": "https://principia-scientific.com/wp-content/uploads/2020/05/bbbb-2.jpg", "image:width": "600", "image:height": "219", "article:published_time": "2020-05-18T20:08:24+00:00", "article:modified_time": "2020-05-18T20:10:39+00:00", "article:publisher": "https://www.facebook.com/johnosullivanpsi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://youtu.be/yevV_slu7Dw", "http://www.firstfreedoms.org/", "https://wwwnc.cdc.gov/eid/article/14/8/07-1313_article", "http://www.who.int/sustainable-development/cities/health-risks/water-sanitation/en/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2599911/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2126288/pdf/449.pdf", "https://www.pbs.org/wgbh/americanexperience/features/influenza-first-wave/", "http://www.mayoclinic.org/diseases-conditions/meningitis/symptoms-causes/syc-20350508", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2862337/", "https://digitalcommons.rockefeller.edu/cgi/viewcontent.cgi?article=1005&context=rockefeller-institute-descriptive-pamphlet", "https://www.hsdl.org/?abstract&did=438835", "https://youtu.be/yevV_slu7Dw", "http://portal.unesco.org/en/ev.php-URL_ID=31058&URL_DO=DO_TOPIC&URL_SECTION=201.html", "https://www.disabilityscoop.com/2016/03/14/cdc-disability-prevalence/22034/", "https://worldmercuryproject.org/news/childhood-vaccine-injury-act-protect/", "http://mindbodymedicineduluth.com/about.html", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=twitter", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=facebook", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=telegram", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=custom-1654796357", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=linkedin", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20The%20Truth%20About%20the%201918%20%27Viral%20Influenza%27%20Pandemic&body=https%3A%2F%2Fprincipia-scientific.com%2Fthe-truth-about-the-1918-viral-influenza-pandemic%2F&share=email", "#", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=pinterest", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=pocket", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=tumblr", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=skype", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/?share=jetpack-whatsapp", "https://principia-scientific.com/the-truth-about-the-1918-viral-influenza-pandemic/#print"], "authors": [], "publish_date": "2020-05-18T20:08:24+00:00"}