{"result_id": "246028", "URL": "https://principia-scientific.org/why-the-elite-do-not-vaccinate-their-children/", "timestamp": "2023-04-25 16:53:54 CEST+0200", "meta": {"description": "Evidence shows a disproportionate number of the wealthy and educated in society are refusing vaccinations for their children.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Why the Elite Do Not Vaccinate Their Children | Principia Scientific Intl.", "cleaned_text": "Why the Elite Do Not Vaccinate Their Children\n\nEvidence shows a disproportionate number of the wealthy and educated in society are refusing vaccinations for their children. Meanwhile, elitists, like Bill Gates, see vaccines as an important tool in population control.\n\nClaims for and against vaccines are redolent. But why does it appear that highly-informed and privileged members of society are urging vaccination of ‘the herd’, yet they are not doing the same for their kids?\n\nVaccine exemption percentages were highest in mostly white, high-income neighborhoods such as Orange County, Santa Barbara and parts of the Bay Area, according to CNN.\n\nOne famous parent that typifies this hypocrisy among the global elite: billionaire Bill Gates.\n\nAccording to the Gates’ family physician: “I don’t know if he had them vaccinated as adults, but I can tell you that he refused to vaccinate them as children,” the physician said at a behind closed doors medical symposium in Seattle.\n\nCertainly, a conscientious parent would feel it reasonable to visit their local doctor and for each vaccine request a copy of a comparable study of unvaccinated and vaccinated populations. Moreover, what are the risks for young children when multiple vaccines are administered in a chemical cocktail?\n\nWhen it comes to trying to uncover some of the dark secrets behind some vaccines, United States citizens are ill-served by government. The FDA abandoned the testing of vaccines more than 15 years ago – therefore we have no way of knowing whether every dose of vaccine is contaminated or not.\n\nAre the rich and famous among us realizing we are being kept in the dark about the disturbing events unf0lding elsewhere in the world?\n\nStatistics show the H1N1 flu vaccine is 60 times more likely to cause a miscarriage than regular seasonal flu vaccines according to VAERS (Vaccine Adverse Event Reporting System).\n\nDr. Suzanne Humphries, author of ‘Dissolving Illusions: Disease, Vaccines, and the Forgotten History,’ is a nephrologist and expert researcher on vaccines. She was accustomed to giving vaccinations to her patients with kidney disease, including those on dialysis, until she realized that hospital patients were experiencing worsening kidney function and kidney failure after being vaccinated.\n\nDr. Jack Wolfson, an Arizona cardiologist, told CNN he did not vaccinate his two sons and that he could live with himself if his unvaccinated child got another child gravely ill.\n\nAccording to a study published in the American Journal of Public Health into 6,200 California schools, vaccine exemptions were twice as common among kindergartners attending private institutions.\n\nDo the Super Rich know something the rest of us don’t?\n\nIn 2010 TED talk video, Bill Gates, while preaching about the dangers of man-made global warming, digressed to tell his audience that population control was a good thing to “save the planet.”\n\nIn the first clip you will hear Gates state in plain language that he considers VACCINES to be desirable to bring down the future population number. Keep in mind, Gates has three children with his wife Melinda – Jennifer, Rory and Phoebe – born between 1996 and 2002 – all unvaccinated and healthy.\n\nIn other words, Gates is being widely interpreted here to be implicitly advocating that vaccines can be used to foster infertility, sterility and (early onset) senility (autism).\n\nRelating ALL the facts and joining the dots is simply what a corrupt MSM refuses to do. In 2015 snopes.com tried to discredit the above video. But it conspicuously failed to mention Bill Gates did not vaccinate his OWN children.Why?\n\nIn India the Bill & Melinda Gates Foundation has been feeling the wrath of Indian doctors in a lawsuit claiming it sponsored the illegal vaccine testing of tribal children. [1]\n\nThe Economic Times India published their report August 2014. They stated that in 2009, tests had been carried out on 16,000 tribal school children in Andhra Pradesh, India, using the human papiloma virus (HPV) vaccine, Gardasil.\n\nIn the unlawful tests 120 girls were taken ill, suffering from a variety of symptoms, including “epileptic seizures, severe stomach aches, headaches and mood swings.” Seven died. [2]\n\nSome may claim globalists are actively looking to cull the human herd. But we don’t need to claim malice or a nefarious conspiracy when old fashioned negligence can explain much.\n\nFor example, Peter Collignon, Professor of Infectious Diseases at the Australian National University insisting errors with vaccines been made. He is on record citing a recent clinical trial uncovered issues with the swine flu vaccine – adverse effects that are identical to those suffered by the children who reacted to the seasonal vaccine – but that the results of this trial appear to have been completely ignored.\n\nAnother example is ‘Japan Sues Merck Over Vaccine Injuries—But We Can’t.’ Here’s an excerpt:\n\nIn China, where industry regulations are some of the most lax in the world, we are seeing contaminated and expired vaccines slipping through the net and exported world-wide to unsuspecting doctors. While dozens of arrests have already been made, it is worrying that the WHO has only made a sheepish response.\n\nPerhaps elitist NGO’s are happy to continue with the appearance of negligence despite, even while clearly cognisant of the deep-rooted concerns.\n\nIn 2011 Australia temporarily banned their seasonal flu vaccines after one death and 23 children experienced convulsions and were hospitalized following their vaccination.Also, in 2011, Sweden found the Pandemrix swine flu vaccine increased the chance of children under 19 years old developing narcolepsy by 400%.\n\nIf 400% wasn’t bad enough, Finland’s study found the same vaccine increased a child’s risk of developing narcolepsy by 900%!\n\nThankfully, those countries took action and banned the vaccine for younger children. But why was this ban never widely reported in the US mainstream media? Isn’t it their job to inform the public of these sorts of health dangers, especially when Americans rely so much on imported Chinese vaccines?\n\nDo Your Own Research!\n\nThese waters have gotten well and truly muddied by misinformation and so few reliable test studies to which we can refer. What can reasonably be inferred is that it is axiomatic that a well-nourished human being is less prone to preventable illnesses than an ill-fed one. As such, with the rise in living standards in the last century it would be easy to conflate the benefits of better nutrition with vaccine efficacy.\n\nA fair and reasonable question that may be asked, is to request to view the vaccine disclosure label that comes with the treatment. As with any medicine, it can be shocking to see such documentation because there is a long list of known vaccine “side effects.”\n\nToday, around 20 or more ‘routine’ vaccinations are recommended for our children often taken in combination; a risky chemical cocktail when compared to only 20 years ago, when around five shots were the norm. Because of their professional insight, doctors are among the most concerned skeptics demanding urgent answers.\n\nIn 2013, a JAMA Pediatrics study evaluated aluminum levels in 2-month-old infants following the administration of three vaccines at once, which is given per usual according to the infant vaccine schedule.\n\nThis exposes the child to 1,200 micrograms of aluminum. Urine and blood were collected, but no significant changes in levels of aluminum were seen after vaccination. Researchers described the finding as “reassuring,” but where did the aluminum go? [3]\n\nBut medical experts are pointing that if it wasn’t excreted and blood levels didn’t rise, it means this toxic metal was retained in tissues.\n\nFor certain, no government or independent entity has ever performed any published research into the risks of multiple vaccine damage over the long term.\n\nSurely, there could be unknown long-term side effects in the child’s body from the cumulative cocktail of chemicals from all these shots. If a shot may offer 10 years and sometimes, lifetime immunity, what is to say side effects cannot also be long-lasting, or that adverse reactions might take many years to be manifested.\n\nDespite all this, infants are routinely vaccinated without regard for their immature kidney function.\n\nAccording to another report:\n\nAnother expert, Dr. Philip Incao, provided testimony for the Ohio State House of Representatives on this matter:\n\nThe fact remains that independent, verifiable studies are urgently needed to determine if vaccines are safe for sick people, babies and in many other special cases. For too long governments have allowed pharmaceutical companies off the hook of accountability.\n\nA ‘One-Size-Fits-All’ Vaccine Policy Isn’t Right for Everyone\n\nThere is also another important facet ill-considered and that is, wherever you stand in the vaccination debate, most rational souls would agree that when it comes to medical care, one size does not fit all. Some vaccines may well be unsafe for some people. So, it would follow that multiple vaccines (untested as a mixture) could potentially inflict real harm in groups of the population.\n\nWhat may work for your child (or yourself) may not work for others. Today we know, however, that some children, like those with mitochondrial disorders, are at increased risk from vaccinations. The same applies to a whole host of individual pre-existing conditions that are not tested for by Big Pharma.\n\nThe debate is not a simple ‘black and white’ argument over whether vaccines per se are good or bad. Certainly, as a society we generally accept vaccination against serious diseases is mostly a good thing. The real debate is more nuanced than that.\n\nThat argument boils down to how accountable should medical companies be when bringing new medicines and vaccines to market? What tests and safeguards are reasonable to apply?\n\nThe numbers of recipients who suffer long-term and irreparable harm need to quantified so we can – as a society – make an informed decision on where the balance should be struck.\n\nIn the crudest terms: how many deaths per thousand can be considered reasonable ‘collateral damage’ to achieve herd immunity.\n\nCertainly, it appears the United States has the balance wrong at the moment insofar as no one who suffers injury or death from a vaccine is allowed to seek redress in the courts. If there is no legal accountability for Big Pharma on vaccines, then surely, that is an unsafe place for American citizens to be.\n\nJohn O’Sullivan is CEO of PRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX.\n\nHelp Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "Why the Elite Do Not Vaccinate Their Children | Principia Scientific Intl.", "description": "Evidence shows a disproportionate number of the wealthy and educated in society are refusing vaccinations for their children.", "url": "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/", "image": "https://proxy.duckduckgo.com/iu/?u=https%3A%2F%2Fi.pinimg.com%2Foriginals%2Fcf%2Fdf%2F2f%2Fcfdf2fe863081ded4c669a083e250b55.jpg&f=1", "image:secure_url": "https://proxy.duckduckgo.com/iu/?u=https%3A%2F%2Fi.pinimg.com%2Foriginals%2Fcf%2Fdf%2F2f%2Fcfdf2fe863081ded4c669a083e250b55.jpg&f=1"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "375", "embed_code": "<iframe width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/6WQtRI7A064?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/6WQtRI7A064?feature=oembed"}], "links": ["https://edition.cnn.com/2015/12/30/health/california-vaccine-refusers-white-and-wealthy/index.html", "http://activismcode.com/2018/03/02/bill-gates-former-family-doctor-claims-that-the-billionaire-refused-to-vaccinate-his-children/", "http://medalerts.org/analysis/archives/263", "https://www.amazon.com/Dissolving-Illusions-Disease-Vaccines-Forgotten/dp/1480216895", "http://ajph.aphapublications.org/doi/abs/10.2105/AJPH.2015.302926", "https://www.snopes.com/fact-check/bill-gates-vaccinations-depopulation/", "http://www.abc.net.au/am/content/2010/s2884330.htm", "http://jama.ama-assn.org/cgi/content/full/303/1/37", "https://constitutionalhealth.com/health-policy/japan-sues-merck-over-vaccine-injuriesbut-we-cant.stml", "https://www.activistpost.com/2016/03/mandatory-vaccines-in-china-contaminated-dozens-arrested-who-responds.html", "https://www.couriermail.com.au/news/toddler-ashley-jade-epapara-2-dies-after-flu-vaccination/news-story/4085d22ae1572a7feb6aa5942ba85303", "http://www.healingourchildren.org/there-is-no-evidence-vaccines-work/", "https://articles.mercola.com/sites/articles/archive/2015/06/09/vaccine-kidney-health.aspx", "https://articles.mercola.com/sites/articles/archive/2012/06/25/mmr-vaccine-caused-autism.aspx", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=twitter", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=facebook", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=telegram", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=custom-1654796357", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=linkedin", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20Why%20the%20Elite%20Do%20Not%20Vaccinate%20Their%20Children&body=https%3A%2F%2Fprincipia-scientific.com%2Fwhy-the-elite-do-not-vaccinate-their-children%2F&share=email", "#", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=pinterest", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=pocket", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=tumblr", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=skype", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/?share=jetpack-whatsapp", "https://principia-scientific.com/why-the-elite-do-not-vaccinate-their-children/#print"], "authors": [], "publish_date": "April 5, 2019"}