{"result_id": "246011", "URL": "https://principia-scientific.org/impact-of-vaccines-on-mortality-decline-since-1900/", "timestamp": "2023-04-25 16:53:38 CEST+0200", "meta": {"description": "Since 1900, there’s been a 74% decline in mortality rates in developed countries, largely due to a marked decrease in deaths from infectious diseases.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Impact of Vaccines on Mortality Decline Since 1900 | Principia Scientific Intl.", "cleaned_text": "Impact of Vaccines on Mortality Decline Since 1900\n\nSince 1900, there’s been a 74% decline in mortality rates in developed countries, largely due to a marked decrease in deaths from infectious diseases. How much of this decline was due to vaccines? The history and data provide clear answers that matter greatly in today’s vitriolic debate about vaccines.\n\nCHICAGO, Illinois —Since 1900, the mortality rate in America and other first-world countries has declined by roughly 74%, creating a dramatic improvement in quality of life and life expectancy for Americans.\n\nThe simple question: “How did this happen?”\n\nWhy did the mortality rate decline so precipitously? If you listen to vaccine promoters, the answer is simple: vaccines saved us. What’s crazy about this narrative is how easy it is to disprove, the data is hiding in plain sight. The fact that this easily-proven-false narrative persists, however, tells us a lot about the world we live in, and I hope will encourage parents to reconsider the veracity of many of the narratives they’ve been fed about vaccines, and do their own primary research.\n\nStanding before his colleagues on October 19, 1970, Harvard’s Dr. Edward H. Kass gave a speech to the annual meeting of the Infectious Diseases Society of America that would likely get him run out of this same profession today. At the time, Dr. Kass was actually the President of the organization, which made the things he had to say about vaccines and their impact on the reduction in American mortality rates even more shocking, at least by today’s standards. Forty-eight years after Dr. Kass’ speech, vaccines have taken on a mythological status in many corners of our world, hyped up by the people who benefit the most from their use. Of course vaccines saved the world. Of course every child should get every vaccine. If you don’t vaccinate, you will enable the return of deadly childhood diseases. If you don’t vaccinate, your child will die. If you question vaccines, even a little, you’re an “anti-vaxxer” who should be shunned and dismissed!\n\nBut what if most of the history about the role vaccines played in declining mortality isn’t even true?\n\nIn his famous speech, Dr. Kass took his infectious disease colleagues to task, warning them that drawing false conclusions about WHY mortality rates had declined so much could cause them to focus on the wrong things. As he explained:\n\nDr. Kass then shared some eye-opening charts with his colleagues. I’m trying to imagine a President of the Infectious Diseases Society of America sharing one of these charts today at a meeting of public health officials. I picture someone turning the power off for the room where he’s presenting and then he gets tackled and carried off the stage…here’s the first example of a chart Dr. Kass shared in 1970:\n\nBut wait a minute, Dr. Kass’ chart doesn’t even include the measles vaccine…what gives? Well, in 1970, the measles vaccine was just beginning to be rolled out, and as you can clearly see, measles had long since experienced a dramatic decline in mortality. With Pertussis (Whooping Cough), he produced a similar chart:\n\nIn this case, you can actually see when the Pertussis vaccine was introduced. He also showed a chart for Scarlett Fever, which furthers the confusion about the role of vaccines, because there’s never been a Scarlett Fever vaccine, and yet the chart of a huge decline in mortality from Scarlett Fever looks very similar to measles and pertussis:\n\nDr. Kass was trying to make a simple point to his colleagues, but one with profound implications for public health. His point was so important, I’m going to quote him in really big font to try and drive it home:\n\nDr. Kass pled with his colleagues to be open to understanding WHY infectious diseases had declined so dramatically in the U.S. (as well as other first world countries). Was it nutrition? Sanitary methods? A reduction in home crowding? (We’ve since learned the answer to all three questions is, “Yes.”) He encouraged his colleagues to be careful not to jump to conclusions prematurely and to maintain objectivity and “devote ourselves to new possibilities.”\n\nLuckily for us, Dr. Kass’ speech that day has been saved for posterity, as it was printed in its entirety in a medical journal. In fact, it’s a journal that Dr. Kass himself founded, The Journal of Infectious Diseases, and his speech is called, “Infectious Disease and Social Change.” There are a number of things about Dr. Kass’ speech that I found breathtaking, especially given that he was the President of the Infectious Diseases Society of America. Namely:\n• He never referred to vaccines as “mankind’s greatest invention” or one of the other many hyperbolic ways vaccines are described all the time by vaccine promoters in the press today. Vaccines weren’t responsible for saving “millions of lives” in the United States, as Dr. Kass well knew.\n• In fact, he never gave vaccines much credit AT ALL for the developed world’s dramatic mortality decline. Which makes sense, because none of the data he had would have supported that view. Which made me wonder, “has anyone tried to put the contribution of vaccines to the decline in human mortality in the 20th century in context?” Said differently, is there any data that measures exactly how much impact vaccines had in saving humanity? Yes, indeed there is. Read on.\n\n1977: McKinlay & McKinlay: The most famous study you’ve never heard of\n\nt won’t be the world’s easiest read, but I hope you take the time to read every word. In 1977, Boston University epidemiologists (and husband and wife) John and Sonja McKinlay published the seminal work on the role vaccines (and other medical interventions) played in the massive decline in mortality seen in the twentieth century, that 74% number I talked about in my opening paragraph. Not only that, but their study warned against the very behavior we are now seeing in the world of vaccines. Namely, they warned that a group of profiteers might take more credit for the results of an intervention (vaccines) than the intervention deserves, and then use those fake results to create a world where their product must be used by everyone. Seriously, they predicted that this would happen. (It’s worth noting that the McKinlay Study used to be required reading at every medical school.)\n\nYou can read the document pictured below below, HERE.\n\nPublished in 1977 in The Millbank Memorial Fund Quarterly, the McKinlay’s study was titled, “The Questionable Contribution of Medical Measures to the Decline of Mortality in the United States in the Twentieth Century.” The study clearly proved, with data, something that the McKinlay’s acknowledged might be viewed by some as medical “heresy.” Namely:\n\nBy “medical measures,” the McKinlay’s really meant ANYTHING modern medicine had come up with, whether that was antibiotics, vaccines, new prescription drugs, whatever. The McKinlay’s 23-page study really should be read cover to cover, but in a nutshell the McKinlay’s sought to analyze how much of an impact medical interventions (antibiotics, surgery, vaccines) had on this massive decline in mortality rates between 1900 and 1970:\n\nHere are some of the major points their paper made:\n• 92.3% of the mortality rate decline happened between 1900 and 1950 [before most vaccines existed]\n• Medical measures “appear to have contributed little to the overall decline in mortality in the United States since about 1900–having in many instances been introduced several decades after a marked decline had already set in and having no detectable influence in most instances.”\n\nAnd, here’s the two doozies…\n\nThe paper makes two points that I really want to highlight, because they are so important. The first one concerns vaccines. They write:\n\nIn plain English: of the total decline in mortality since 1900, that 74% number I keep mentioning, vaccines (and other medical interventions like antibiotics) were responsible for somewhere between 1% and 3.5% of that decline. Said differently, at least 96.5% of the decline (and likely more than that since their numbers included ALL medical interventions, not ONLY vaccines) had nothing to do with vaccines.\n\nAnd then the McKinlay’s wrote something that made me laugh out loud, because it’s the thing we are seeing every day in today’s vaccine-hyped world:\n\n2000: the CDC puts the final nail in the coffin\n\nIn 1970, Dr. Kass raised the idea that public health officials need to be careful to not give the wrong things credit for the twentieth century’s massive mortality rate decline in the developed world. In 1977, Drs. McKinlay & McKinlay put data around Dr. Kass’ ideas, and showed that vaccines (and other medical interventions) were responsible for between 1-3.5% of the total decline in mortality since 1900. In 2000, CDC scientists reconfirmed all this data, but also provided more insight into the things that actually have led to declines in mortality.\n\nPublished in September 2000 in the journal Pediatrics and titled, “Annual Summary of Vital Statistics: Trends in the Health of Americans During the 20th Century,” epidemiologists from both Johns Hopkins and the Centers for Disease Control reaffirmed what we had already learned from McKinlay and McKinlay:\n\nThe study went on to explain the things that actually were responsible for a massive decline in mortality:\n\n“water treatment, food safety, organized solid waste disposal, and public education about hygienic practices.” Also, “improvements in crowding in US cities” played a major role. Clean water. Safe food. Nutrition. Plumbing. Hygiene. These were the primary reasons mortality declined so precipitously. At least according to the data and published science.\n\nI get really strong reactions when I share this chart, compiled from CDC data:\n\nThis chart is compiled from this dataset provided by the CDC. You can see that nine vaccines we give children today didn’t even exist in the mid-1980s. Moreover, the vaccination rates for the three vaccines that did exist were hovering near 60% or less as late as the mid-1980s. Today, vaccination rates are all well north of 90% for American children. I think it’s fair to ask, “why so much panic”? If you think about this chart for long enough, it makes you realize how silly the oft-invoked notion of “herd immunity” really is, since we obviously couldn’t have been anywhere near vaccine-induced herd immunity in the mid-1980s. In fact, we’re really no closer today, because adult vaccination rates remain so low, and vaccines wane over time.\n\nAs McKinlay and McKinlay warned, if the wrong intervention (like vaccines) is singled out as the reason Americans and the rest of the first world experienced such a dramatic decrease in mortality in the 20th century, that misinformation can be abused to do things like:\n• Rapidly expanding the number of vaccines given to children\n• Browbeating parents who chose to follow a different vaccine schedule and making them feel guilty\n• Speaking about vaccines in such reverential terms that even questioning them (like I’m doing in this article) is viewed as sacreligious and irresponsible.\n• And, denying that vaccines injuries happen at high rates, to keep the whole machine moving in the right direction. (By the way, the best guess of vaccine injury rate is about 2% of people who receive vaccines, according to this study commissioned and paid for by the CDC when they actually automated the tracking of vaccine injuries. The “one in a million” figure thrown around by vaccine promoters is simply an unsupportable lie.)\n\nAfrica, and other third world countries\n\nVaccine promoters will often quote statistics about present-day deaths from infectious diseases that sound deeply alarming. Using examples of a disease like measles, they might explain how many children still die from measles every year, and therefore its gravely important that EVERY American parent vaccinate their child for measles. Of course, what they don’t mention is that these infectious disease deaths are happening in places that still have quality of life conditions akin to American children of the early 1900s. Poor nutrition. No plumbing or refrigeration. Bad hygiene practices. Crowded living conditions. All the things that ACTUALLY impacted the mortality rate the most haven’t yet been addressed in certain parts of Africa and other third world countries, and JUST implementing vaccines won’t change the facts. This was Dr. Kass’ point in the first place: know what actually led to the mortality rate decline, and do more of that!\n\nIn fact, we now have some data that shows vaccinating children living in situations where they have poor nutrition and lack of sanitation can actually do more harm than good:\n\nPublished in the peer-reviewed journal EBioMedicine in 2017, the study is titled, “The Introduction of Diphtheria-Tetanus-Pertussis and Oral Polio Vaccine Among Young Infants in an Urban African Community: A Natural Experiment.” Researchers from the Research Center for Vitamins and Vaccines, Statens Serum Institut (Denmark), and Bandim Health Project looked closely at data from the West African nation of Guinea-Bissau. The scientists in this study closely explored the concept of NSEs, “nonspecific effects” of vaccines, which is a fancy way of saying vaccines may make a child more susceptible to other infections. They found that the data for African children who had been vaccinated with the DTP vaccine:\n\nIn lay terms, this means that giving an African child the DTP vaccine may make the child sick from other infections. It appears that in Africa, the living conditions are more important than the vaccine (as you would very much expect from Dr. Kass’ and the Drs. McKinlay’s work), and the DTP vaccine did indeed do more harm than good. (It’s worth noting that Dr. Aaby was a highly regarded vaccine researcher until he published this study in 2017. It’s my understanding that he has since lost his funding sources. Welcome to today’s world of vaccine “science.”)\n\nWe have another real world example of this phenomenon from the late 1970s. Dr. Archie Kalokerinos made a simple discovery, as he explains:\n\n“ At first it was just a simple clinical observation. I observed that many infants, after they received routine vaccines like tetanus, diphtheria, polio, whooping cough or whatever, became ill. Some became extremely ill, and in fact some died. It was an observation, It was not a theory. So my first reaction was to look at the reasons why this happened. Of course I found it was more likely to happen in infants who were ill at the time of receiving a vaccine, or infants who had been ill recently, or infants who were incubating an infection. Of course in the early stages of incubation there is no way whatsoever that anyone can detect the disease. They turn up later on. Furthermore, some of the reactions to the vaccines were not those that were listed in the standard literature.\n\nThey were very strange reactions indeed. A third observation was that with some of these reactions which normally resulted in death I found that I could reverse them by giving large amounts of vitamin C intramuscularly or intravenously. One would have expected, of course, that the authorities would take an interest in these observations that resulted in a dramatic drop in the death rate of infants in the area under my control, a very dramatic drop. But instead of taking an interest their reaction was one of extreme hostility. This forced me to look into the question of vaccination further, and the further I looked into it the more shocked I became. I found that the whole vaccine business was indeed a gigantic hoax. Most doctors are convinced that they are useful, but if you look at the proper statistics and study the instance of these diseases you will realise that this is not so.”\n\nDr Kalokerinos also said something in 1995 that it appears Dr. Aaby’s study was able to corroborate in 2017:\n\n“And if you want to see what harm vaccines do, don’t come to Australia or New Zealand or any place, go to Africa and you will see it there.”\n\nWe actually knew the truth in the early 1900s, even before the rapid decline in mortality Well ahead of his time, Englishman John Thomas Biggs was the sanitary engineer for his town of Leicester and had to actively respond to outbreaks of smallpox. He quickly learned that the public health outcomes from sanitation vastly outweighed the impact of vaccination (where he saw dramatic vaccine injury and ineffectiveness). He wrote a definitive work in 1912, Leicester: Sanitation versus Vaccination. More than one hundred years ago, Mr. Biggs discovered what the CDC reaffirmed in 2000: Nothing protects from infectious disease like proper sanitation. He explained:\n\nDr. Andrew Weil, the oft-quoted celebrity doctor, reenforces the point, explaining that “medicine has taken credit it does not deserve for some advances in health. Most people believe that victory over the infectious diseases of the last century came with the invention of immunizations. In fact, cholera, typhoid, tetanus, diphtheria, and whooping cough, and the others were in decline before vaccines for them became available — the result of better methods of sanitation, sewage disposal, and distribution of food and water.”\n\nVaccines didn’t save humanity. Their impact was somewhere between 1-3.5% of the total decline in mortality rates. Improvement in sanitation and standards of living really did (nutrition, living conditions, etc.). Did vaccines contribute to a small decrease of certain acute illnesses? Yes, but their relative benefit is often exaggerated to an extreme, and then used to browbeat, guilt, and scare parents.\n\nSo am I saying no one should vaccinate? No, I’m not. Vaccines provide temporary protection from certain acute illnesses. Some matter more than others. I personally think we give way too many vaccines, and I think the risk/benefit equation of each vaccine is often obscured. Worse, the lie that vaccines saved humanity in the twentieth century has turned many vaccine promoters into zealots, even though their narratives are simply not supported by the facts. But, by all means, get as many vaccines as you want, I respect your right to make your own medical care choices.\n\nIn late 2017, it was reported that Emory University scientists were developing a common cold vaccine. Professor Martin Moore bragged that his research “takes 50 strains of the common cold and puts it into one shot” and that the monkeys who served as test subjects “responded very well.” You should expect to see this vaccine at your pediatrician’s office in the next five years, which will likely be rolled out soon after the stories start to appear in the media about the common cold causing childhood deaths, and that millions of lives will be saved, much as vaccines saved the world in the twentieth century…parents beware, and do your own research!", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "Impact of Vaccines on Mortality Decline Since 1900 | Principia Scientific Intl.", "description": "Since 1900, there’s been a 74% decline in mortality rates in developed countries, largely due to a marked decrease in deaths from infectious diseases.", "url": "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/", "image": "https://cdn1.collective-evolution.com/assets/uploads/2019/03/arrow.jpg", "image:secure_url": "https://cdn1.collective-evolution.com/assets/uploads/2019/03/arrow.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/1990/01/19/obituaries/edward-h-kass-72-researcher-on-toxic-shock.html", "http://vaccinesafetycommission.org/pdfs/Kass%201971.pdf", "http://vaccinesafetycommission.org/pdfs/McKinlay%201977.pdf", "http://vaccinesafetycommission.org/pdfs/McKinlay%201977.pdf", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/G/coverage.pdf", "https://healthit.ahrq.gov/ahrq-funded-projects/electronic-support-public-health-vaccine-adverse-event-reporting-system", "https://www.ebiomedicine.com/article/S2352-3964(17)30046-4/fulltext", "https://www.amazon.com/Every-Second-Child-Archie-Kalokerinos/dp/0879832509", "https://archive.org/details/leicestersanitat00biggrich", "https://www.collective-evolution.com/2019/03/14/the-impact-of-vaccines-on-mortality-decline-since-1900-according-to-published-science/", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=twitter", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=facebook", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=telegram", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=custom-1654796357", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=linkedin", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20Impact%20of%20Vaccines%20on%20Mortality%20Decline%20Since%201900&body=https%3A%2F%2Fprincipia-scientific.com%2Fimpact-of-vaccines-on-mortality-decline-since-1900%2F&share=email", "#", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=pinterest", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=pocket", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=tumblr", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=skype", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/?share=jetpack-whatsapp", "https://principia-scientific.com/impact-of-vaccines-on-mortality-decline-since-1900/#print"], "authors": [], "publish_date": "March 19, 2019"}