{"result_id": "246006", "URL": "https://principia-scientific.org/12-scientific-reasons-to-reject-vaccination/", "timestamp": "2023-04-25 16:53:33 CEST+0200", "meta": {"description": "New England Journal of Medicine: Chief Editor Marcia Angell MD., “It is simply no longer possible to believe much of the clinical research that is published, or to rely on the judgement of trusted physicians or authoritative medical guidelines.” Lancet Chief Editor Richard Horton, “...much of the scientific literature, perhaps half, may simply be untrue", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "12 Scientific Reasons to Reject Vaccination | Principia Scientific Intl.", "cleaned_text": "New England Journal of Medicine: Chief Editor Marcia Angell MD., “It is simply no longer possible to believe much of the clinical research that is published, or to rely on the judgement of trusted physicians or authoritative medical guidelines.” Lancet Chief Editor Richard Horton, “…much of the scientific literature, perhaps half, may simply be untrue … flagrant conflicts of interest … science has taken a turn towards darkness.”\n• Manufacturers warn vax cause polio, cot death [SIDS], encephalitis, bleeding, paralysis, cancer, neuritis, convulsions, death, multiple sclerosis [MS] etc. Claiming vax protects us from disease is contradicted as authorities report that vaxed patients can catch disease from, and infect, people both vaxed or unvaxed. Impossible if vax work.\n• Vax have never been scientifically tested (double blind & inert placebo) to show: a) if vax work, b) safety, and c) which group is healthier long-term. The US Health Dept was exposed in a major 2018 court loss after falsely claiming for 32 years that vax were safe without ever once doing the vital yearly safety studies Congress ordered them to do.\n• Vax ignores 18 critical, life-saving, medical, ethical, legal and common sense requirements. Before any vax injection, the patient’s medical history, age, allergies, sex, weight, medications, race and illnesses should be examined. Doctors must disclose ingredients, harmful effects & get informed consent. Prescriptions are essential and must be in writing for a specific patient (never groups), disease, vax, dose and duration.\n• Autism exploded from 1 in 10,000 to 1 in 25 (2020) since MMR [Measles/Mumps/Rubella] vax began in the US in 1974. Drug Co. Sanofi Pasteur warned: “Adverse events include autism.” Dr H. Wang, Director Special Needs Children, reported in 2005: “The autism rate for Amish [who don’t vax] in Ohio was 1 in 15,000.” In 2004, CDC [Centres for Disease Control] researchers found a huge rise in autism in African Ameri-can boys under age 3 after MMR vax. Sen/Scientist Dr W. Thompson revealed his CDC team falsified and tried to erase this proof that vax causes autism.\n• Medicine and vax are based on a refuted theory about germs by Louis Pasteur who plagiarised [stole from] and misinterpreted brilliant scientist Dr. Antoine Bechamp who demonstrated dis-ease is caused by toxaemia [a build up of metabolic waste/toxins]. Professor (Sir) Alexander Ross MD., Fellow of the Royal Society of England, “I do not question the existence of infinitesimal micro-organisms [germs] but they are the result, not the cause, of disease. They are the scavengers; their legitimate work is to clean out the sewers of our bodies. Wherever there is decay, pus or decomposing matters, these little lifesavers are doing their work of neutralisation, sanitation and purification…”. Three crucial questions medicine has never reasonably answered; 1. How can we have germs and not the disease they allegedly cause? 2. How can we have a disease but not the germs claimed to cause it? 3. How can germs change? e.g. polio to smallpox? The answer? Our bodies create germs to heal. Germs do not attack healthy tissue. Without germs we would die.\n• A US Health Dept study by Harvard Medical School found less than 1{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of vax caused injuries/deaths are reported. Whistle blowing Drs who expose vax harm are vilified, defund-ed & persecuted despite 200 years of medical disasters: mercury, asbestos, DDT, thalidomide, Vioxx, lead, Prozac, childbed fever carnage (doctors refusing to wash), dioxin, DES, etc. All were alleged, as are vax, to be safe & effective; despite proof of injury and death to millions of people & multi-billions in public costs. In Australia, authorities reveal at least 18,000 deaths & 320,000 injuries are caused each year by doctors, drugs and in hospitals. Only we can decide if we or our children take drugs: confirmed by the Commonwealth Constitution S. 51xxiiiA.\n• Dis-ease has one cause: toxaemia/ blood poisoning from ingesting drugs and chemical-ised, denatured, processed, lifeless, artificial/imitation food & drink. As our bodies are self healing the remedy to dis-ease is rest, sunlight, pure water/air, exercise, fresh organic food, sleep, fasting and a positive outlook: none offered by the trillion dollar medico/pharma deception. These traditional laws of health and disease contrast medical training based on supp-ressing & removing symptoms with perilous, costly chemotherapy, surgery, radiation and drugs, not on understanding, preventing and correcting poisoned bodies. Your decisions choose either vibrant health or sickness.\n• Worldwide government statistics show infectious diseases [chickenpox, smallpox, Flu, polio, TB, measles, etc.] were in major decline decades before widespread vax, due to improvements in hygiene: Medical historians record dis-ease causes asrats, slums, fouled water (animal/human waste), diseased milk, poverty, child labour, putrid air and despair. Rectified with new building/ labor laws, sanitation, isolation, clean-ing, electricity, nutrition etc. Not vax. Vaxers usually hide this with graphs showing statistics after vax not before.\n• In declaring vax “unavoidably unsafe”, the US Congress established that as there are no guaranteed vax benefits, all vaccines are experimental. Vaccines destroy the life-long natural immunity gained by exposure to the usual mild childhood diseases. After vax, such diseases in adults can be life-threatening. Australia’s 2020 Vaccine Schedule is: 50 by age six; 73 by age 18 and 150 vaccines by age 65.\n• Every vax injects/ infects you with disease. The result is that disease epidemics occur almost exclusively in vaxed regions. Independent studies show herd immunity claims that epidemics cannot occur if 95{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of people are vaxed, remain untrue: England, 1871-72: with 98{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of ages two to 50 vaxed with smallpox, 45,000 died of smallpox: Germany had 96{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} vaxed and 125,000 smallpox deaths. In 1940, Germany made Diphtheria vax compulsory. By 1945 diphtheria cases had soared from 40,000 to 250,000.\n• Aust. Federal Treasury (under FOI law) revealed the Australian government is a US Company. Like Coles, no company has law-ful power to compel anything. Protect families from force/ penalties/ injury/ death. Search ‘10 Commercial Maxims’, ‘Affidavits’; ‘Notices’; ‘Private Administrative Processes’ & ‘Commercial Liens’ [each with] +‘strawman’. These true laws hold vaxers/ all company agents, personally liable financially & under penalty of perjury, who quickly become un-willing to support unlawful forced vax.\n\nDownload the free interactive eBook ‘1200 Studies’. 2. Network: build teams. 3. Run a ‘Save Lives’ education campaign. 4. Tell every-one: letterbox, notice boards, street tables, hand-outs, fundraise, full-page newspaper ad, shop windows. 5. Buy the NZ Journal of Natural Medicine. 6. View the brilliant series ‘Every vax causes harm’ by Dr. Andrew Moulden. 7. Ask friends, “Is there any point you disagree with?” 8. Support pro freedom-of-choice Drs/MP’s. 9. Get healthy. 10. Call a vax Royal Commission or ‘People’s Court’. 11. Introduce a Binding Citizens Initiated Referendum law [BCIR] as the Swiss successfully did 150 years ago.\n• This page is for education. It does not give medical, legal or psychiatric advice. ©2020 Blog: 12 reasons (to come\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX.\n\nPlease DONATE TODAY To Help Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "article", "title": "12 Scientific Reasons to Reject Vaccination | Principia Scientific Intl.", "description": "New England Journal of Medicine: Chief Editor Marcia Angell MD., “It is simply no longer possible to believe much of the clinical research that is published, or to rely on the judgement of trusted physicians or authoritative medical guidelines.” Lancet Chief Editor Richard Horton, “...much of the scientific literature, perhaps half, may simply be untrue", "url": "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/", "image": "https://principia-scientific.com/wp-content/uploads/2020/07/454.jpg", "image:secure_url": "https://principia-scientific.com/wp-content/uploads/2020/07/454.jpg", "image:width": "600", "image:height": "399", "article:published_time": "2020-07-15T11:27:03+00:00", "article:modified_time": "2020-07-15T11:27:03+00:00", "article:publisher": "https://www.facebook.com/johnosullivanpsi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=twitter", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=facebook", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=telegram", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=custom-1654796357", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=linkedin", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%2012%20Scientific%20Reasons%20to%20Reject%20Vaccination&body=https%3A%2F%2Fprincipia-scientific.com%2F12-scientific-reasons-to-reject-vaccination%2F&share=email", "#", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=pinterest", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=pocket", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=tumblr", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=skype", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/?share=jetpack-whatsapp", "https://principia-scientific.com/12-scientific-reasons-to-reject-vaccination/#print"], "authors": [], "publish_date": "2020-07-15T11:27:03+00:00"}