{"result_id": "246023", "URL": "https://principia-scientific.org/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/", "timestamp": "2023-04-25 16:53:49 CEST+0200", "meta": {"description": "A Centers for Disease Control (CDC) senior scientist has made an unprecedented admission: he and his colleagues--he says-- committed scientific misconduct to cover up a meaningful link between vaccines and autism in black boys. [PSI editor note: this article was first published in June 2016] Just as startling, the CDC scientist, Dr. William Thompson, says", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "CDC Scientist: We tried to ‘destroy vaccine-autism study documents’ | Principia Scientific Intl.", "cleaned_text": "CDC Scientist: We tried to ‘destroy vaccine-autism study documents’\n\nA Centers for Disease Control (CDC) senior scientist has made an unprecedented admission: he and his colleagues–he says– committed scientific misconduct to cover up a meaningful link between vaccines and autism in black boys.\n\n[PSI editor note: this article was first published in June 2016]\n\nJust as startling, the CDC scientist, Dr. William Thompson, says the study co-authors “scheduled a meeting to destroy documents related to the study. The remaining four co-authors all met and brought a big garbage can into the meeting room, and reviewed and went through all the hardcopy documents that we had thought we should discard, and put them into a huge garbage can.”\n\nDespite this whistleblower testimony, which Dr. Thompson provided to Rep. Bill Posey, R-Florida, there is little chance of a meaningful hearing or investigation.\n\nIn an untainted news environment, the allegations would make headlines in most legitimate publications and would trigger federal inquiries. However, the interests of the powerful pharmaceutical industry reach deeply into Congress and the news media through lobbyists, propaganda and advertising dollars.\n\n“The omitted data suggested that African American males who received the MMR vaccine before age 36 months were at increased risk for autism.” –CDC Senior Scientist Dr. William Thompson\n\nThat’s why Congressman Posey resorted to simply reading some of Dr. Thompson’s statement today on the House floor…including the part in which Dr. Thompson says he retained the evidence that had been thrown in the garbage can, in the unlikely event that a neutral investigative or scientific body would like to see it today.\n\n“[B]ecause I assumed it was illegal and would violate both FOIA [Freedom of Information Act] and DOJ [Department of Justice] requests, I kept hardcopies of all documents in my office, and I retain all associated computer files,” Posey quotes Dr. Thompson as reporting.\n\nThe CDC and Thompson’s co-author Dr. Frank DeStefano, CDC Director of Immunization Safety, have defended the controversial study as originally published. Dr. DeStefano explains why here in detail.\n\nOne final note: Rep. Posey unequivocally states that he is pro-vaccine. However, the propaganda campaign typically falsely portrays anyone who addresses vaccine safety issues as “anti-vaccine.”\n\nListen to Rep. Posey’s statement by pasting the link below into your browser and going to 1:02:24\n\n“I rise today on matters of scientific integrity and research. To begin with, I am absolutely, resolutely, pro-vaccine. Advancements in medical immunization have saved countless and greatly benefitted public health. That being said, it’s troubling to me that in a recent Senate hearing on childhood vaccinations, it was never mentioned that our government has paid out over $3 billion through a vaccine injury compensation program for children who have been injured by vaccinations.\n\n“Regardless of the subject matter, parents making decisions about their children’s health deserve to have the best information available to them. They should be able to count on federal agencies to tell them the truth. For these reasons, I bring the following matter to the House floor.\n\n“In August 2014, Dr. William Thompson, a senior scientist at the Centers for Disease Control and Prevention, worked with a whistleblower attorney to provide my office with documents related to a 2004 CDC study that examined the possibility of a relationship between [the] mumps, measles, rubella vaccine and autism. In a statement released in August, 2014, Dr. Thompson stated, ‘I regret that my co-authors and I omitted statistically significant information in our 2004 article published in the journal Pediatrics.’\n\n“Mr. Speaker, I respectfully request the following excepts from the statement written by Dr. Thompson be entered into the record.\n\n“‘My primary job duties while working in the immunization safety branch from 2000 to 2006, were to later co-lead three major vaccine safety studies. The MADDSP, MMR autism cases control study was being carried out in response to the Wakefield-Lancet study that suggested an association between the MMR vaccine and an autism-like health outcome. There were several major concerns among scientists and consumer advocates outside the CDC in the fall of 2000, regarding the execution of the Verstraeten Study. One of the important goals that was determined up front, in the spring of 2001, before any of these studies started, was to have all three protocols vetted outside the CDC prior to the start of the analyses so consumer advocates could not claim that we were presenting analyses that suited our own goals and biases. We hypothesized that if we found statistically significant effects at either 18 or 36 month thresholds, we would conclude that vaccinating children early with MMR vaccine could lead to autism-like characteristics or features. We all met and finalized the study protocol and analysis plan. The goal was to not deviate from the analysis plan to avoid the debacle that occurred with the Verstraeten thimerosal study published in Pediatrics in 2003.\n\n‘At the Sept 5th meeting we discussed in detail how to code race for both the sample and the birth certificate sample. At the bottom of table 7, it also shows that for the non-birth certificate sample, the adjusted race effect statistical significance was huge.\n\n‘All the authors and I met and decided sometime between August and September 2002, not to report any race effects from the paper. Sometime soon after the meeting, we decided to exclude reporting any race effects. The co-authors scheduled a meeting to destroy documents related to the study. The remaining four co-authors all met and brought a big garbage can into the meeting room, and reviewed and went through all the hardcopy documents that we had thought we should discard, and put them into a huge garbage can. However, because I assumed it was illegal and would violate both FOIA and DOJ requests, I kept hardcopies of all documents in my office, and I retain all associated computer files. I believe we intentionally withheld controversial findings from the final draft of the Pediatrics paper.’\n\n“Mr. Speaker, I believe it is our duty to insure that the documents that Dr. Thompson are not ignored. Therefore I will provide them to members of Congress and the House Committees upon request. Considering the nature of the whistleblower’s documents as well as the involvement of the CDC, a hearing and a thorough investigation is warranted.\n\n“So I ask, Mr. Speaker, I beg, I implore my colleagues on the appropriations committees to please, please take such action.”\n\nAbout the author: Sharyl Atkisson is an American writer and host of the TV show Full Measure with Sharyl Attkisson. She is a five-time Emmy Award winner, and an Radio Television Digital News Association Edward R. Murrow Award recipient.\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX.\n\nPlease DONATE TODAY To Help Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "article", "title": "CDC Scientist: We tried to ‘destroy vaccine-autism study documents’ | Principia Scientific Intl.", "description": "A Centers for Disease Control (CDC) senior scientist has made an unprecedented admission: he and his colleagues--he says-- committed scientific misconduct to cover up a meaningful link between vaccines and autism in black boys. [PSI editor note: this article was first published in June 2016] Just as startling, the CDC scientist, Dr. William Thompson, says", "url": "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/", "image": "https://principia-scientific.com/wp-content/uploads/2020/06/77-3.jpg", "image:secure_url": "https://principia-scientific.com/wp-content/uploads/2020/06/77-3.jpg", "image:width": "600", "image:height": "427", "article:published_time": "2020-06-25T11:31:27+00:00", "article:modified_time": "2020-06-25T11:34:53+00:00", "article:publisher": "https://www.facebook.com/johnosullivanpsi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://sattkisson.wpengine.com/audio-cdc-addresses-allegations-on-vaccine-autism-link-omission/", "https://sattkisson.wpengine.com/audio-cdc-addresses-allegations-on-vaccine-autism-link-omission/", "https://sattkisson.wpengine.com/cdc-possibility-that-vaccines-rarely-trigger-autism/", "http://www.cdc.gov/vaccinesafety/index.html", "https://sattkisson.wpengine.com/medical-vaccine-links/", "https://en.wikipedia.org/wiki/Sharyl_Attkisson", "https://sharylattkisson.com/2016/06/cdc-scientist-we-scheduled-meeting-to-destroy-vaccine-autism-study-documents/", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=twitter", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=facebook", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=telegram", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=custom-1654796357", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=linkedin", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20CDC%20Scientist%3A%20We%20tried%20to%20%27destroy%20vaccine-autism%20study%20documents%27&body=https%3A%2F%2Fprincipia-scientific.com%2Fcdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents%2F&share=email", "#", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=pinterest", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=pocket", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=tumblr", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=skype", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/?share=jetpack-whatsapp", "https://principia-scientific.com/cdc-scientist-we-tried-to-destroy-vaccine-autism-study-documents/#print"], "authors": [], "publish_date": "2020-06-25T11:31:27+00:00"}