{"result_id": "246016", "URL": "https://principia-scientific.org/censoring-peer-review-using-political-correctness/", "timestamp": "2023-04-25 16:53:43 CEST+0200", "meta": {"description": "According to many governments and the mainstream media there is no association of ASD and Aluminum Adjuvants in vaccines, because “any link between immunization and autism has been completely discredited” [1]. The Establishment tells us: “concern in the community about a possible link between the measles, mumps, rubella (MMR) vaccine and autism was generated by", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/censoring-peer-review-using-political-correctness/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Censoring peer review using political correctness | Principia Scientific Intl.", "cleaned_text": "According to many governments and the mainstream media there is no association of ASD and Aluminum Adjuvants in vaccines, because “any link between immunization and autism has been completely discredited” [1].\n\nThus, the possible link between AlAd and ASD was only a wrong hypothesis proposed in the past for interest that has been dismissed following novel extensive research that is free of any bias.\n\nAccording to [1] “Extensive research conducted globally for a decade did not establish any link between vaccines and autism.”\n\nThis very subjective interpretation of the scientific evidence and the possible biases of the scientific debate builds on the denial of the published works that do not fit the narrative, overrating the smearing campaigns organized against the authors of the most inconvenient works published, and negating the obvious fact that if there is a conflict of interest, this is certainly towards those who negate every link in between AlAd and ASD rather than the opposite field, being the link between big governments, big pharma companies and big finance quite evident.\n\nDespite statements such as those by [1] do not leave any space to the more than legitimate doubts about the lack of any downfall of the use in vaccines of neurotoxic substances such as Aluminium (Al), a search for the relevant scientific literature show a growing body of evidence that AlAd may be harmful. The healthy scientific debate has been so far negated.\n\nWhile a few works have been quickly labeled “discredited works”, the other works have been simply ignored.\n\nIn recent years, a couple of other papers linking ASD and AlAd in vaccines have been withdrawn by the editors.\n\nThese withdrawals do not constitute proof that AlAd is perfectly safe. In 2010, the “Lancet” retracted a 1998 paper [2] linking vaccine and autism, the infamous “Wakefield study”. [2] This suggested that there could have been a connection between autism and a triple vaccine for measles, mumps, and rubella (MMR).\n\nOther researchers were unable to reproduce the findings, [3], [4].\n\nThe replication crisis is a global methodological issue affecting the most part of the scientific studies, that are difficult or impossible to replicate or reproduce.\n\nThe final blow to the Wakefield et al. paper was a mainstream media investigation that identified undisclosed financial conflicts of interest. It was claimed that Wakefield was funded through solicitors seeking evidence against the vaccine.\n\nWhile being funded to prove a scientific theory of interest to the funding party is the norm, rather than the exception, and the most part of the intergovernmental scientists paid with public money to serve vested and non-vested interests in medicine, energy or climate change studies never declare their open conflicts of interests, this discovery permitted in this case to kill the message and the messenger. The paper was retracted and the main author registration as a doctor was canceled.\n\nMore recently, the “Journal of Inorganic Biochemistry” retracted a 2017 paper [5] reporting of an animal study in mice linking Al-adjuvants and behavioral disorders.\n\nThe retraction comes after readers of the website PubPeer, claimed to have found image alterations in the paper.\n\nSimilarly to [5], the 2016 paper [6] by the same group was withdrawn from “Vaccines”.\n\nHere the reasons for retraction were much weaker than the previous cases, and the article was then published in “Immunologic research”, where it is still available [7]. According to [7], Gardasil via its AlAd and HPV antigens may trigger neuroinflammation and autoimmune reactions leading to behavioral changes.\n\nThese cases evidence biases in the scientific process.\n\nQuality assurance of scientific findings is a major issue with double standards being routinely applied. [8] repeated the experiments documented in eight previous studies from the Australian Research Council Centre of Excellence for Coral Reef Studies, on the effect of climate change on the coral reef that attracted significant mainstream media coverage.\n\nThey found 100% replication failure. None of the findings were correct. Nobody in the mainstream media has commented [8], and the eight works have not been retracted by the authors or the editors.\n\nFor another study with manipulated photos of reef fish also from James Cook Universities Coral Reef Centre, it was actually only the whistleblower to get sacked, even if the paper was then withdrawn [9] and other more serious countries started proper investigations for the misconduct of those who manufactured the results and not the whistleblower.\n\nIt is evident that a center that receives greater government funding, the greater the alarmism produced by the scientific findings echoed in the mainstream media has evident conflicts of interest.\n\nRegarding these conflicts of interest, conflicts of interest are common not only in between the authors but also in between those who criticize them. Regarding the paper [5] questioned by pub peer, there is a clear opportunity of a conflict of interest in Pub Peer.\n\nAccording to [10], the about page of Pub Peer is not transparent, but “opaque”.\n\nThe Californian company, founded by Brandon Stell, an employee of the French government, covering a full time, permanent job, in the French National Centre for Scientific Research (CNRS), received significant amount of money from John D. Arnold, a former Enron trader, and an American hedge fund manager, that, as written in Wikipedia.\n\nThe founder of Pub Peer, that we believe is a smearing campaign organization supporting big governments, big finance, and big greens play pretending to care about the rigor of the peer review, Brandon Steel, a “brilliant scientists” with 11 papers in Scopus, does not seem to care too much about the conflicts of interests. In the latest paper of 2016, Calcium Imaging Reveals Coordinated Simple Spike Pauses in Populations of Cerebellar Purkinje Cells,\n\nThere is no mention of possible conflicts of interests. If his LLC received disclosed funds for several hundred thousand dollars only in 2015 from John D. Arnold, a former Enron trader, and an American hedge fund manager, that, as written in Wikipedia,\n\nConflicts of interest are only claimed, correctly or incorrectly, when somebody not a member of “the party” publishes something inconvenient.\n\nThere is a growing concern about the role of the many non-for-profit organization, that behind the claim of serving noble interests, in the end, produce outcomes welcomed to those that appear in the list of their donors.\n\nWhile rules should apply equally to everyone, this does not seem the case anymore in the peer review. While the association between AlAd and ASD is being denied by governments, and the mainstream media despite the opposite evidence proposed in the scientific literature, there are cases, for example, the association between glyphosate and non-Hodgkin’s lymphoma, that is being promoted by governments and mainstream media no matter the lack of any evidence, not even ecological, outlined in the literature [11], [12], [13], [14].\n\nThe use of the herbicide glyphosate (roundup) has certainly brought immense benefits to humanity, allowing to feed a growing number of peoples thanks to an increased yield.\n\nSimilarly, immense have been the benefits of the use of vaccines. This does not mean that herbicides or vaccines have no issue whatsoever, as this does not mean that herbicides and vaccines cannot be improved. Singular is the support by the mainstream media and many governments to the extremely unlikely opportunity that glyphosate produces non-Hodgkin lymphoma, and otherwise the complete denial of the much more likely opportunity that Al adjuvants may cause ASD.\n\nThe manufacture of consent is described in [18], who defines the mass corporate media as “effective and powerful ideological institutions that carry out a system-supportive propaganda function”.\n\n[3] Madsen, K.M., Hviid, A., Vestergaard, M., Schendel, D., Wohlfahrt, J., Thorsen, P., Olsen, J. and Melbye, M., (2002), A population-based study of measles, mumps, and rubella vaccination and autism. New England Journal of Medicine, 347(19), pp.1477-1482.\n\n[4] Black, C., Kaye, J.A. and Jick, H., (2002), Relation of childhood gastrointestinal disorders to autism: nested case-control study using data from the UK General Practice Research Database. Bmj, 325(7361), pp.419-421.\n\n[5] D. Li, L. Tomljenovic, Y. Li, C.A. Shaw, (2017), Subcutaneous injections of aluminum at vaccine adjuvant levels activate innate immune genes in mouse brain that are homologous with biomarkers of autism, J. Inorg. Biochem., 177, pp. 39-54\n\n[6] Inbar, R., Weiss, R., Tomljenovic, L., Arango, M.T., Deri, Y., Shaw, C.A., Chapman, J., Blank, M. and Shoenfeld, Y., (2016), Behavioral abnormalities in young female mice following administration of aluminum adjuvants and the human papillomavirus (HPV) vaccine Gardasil. Vaccine, pp.00016-5.\n\n[7] Inbar, R., Weiss, R., Tomljenovic, L., Arango, M.T., Deri, Y., Shaw, C.A., Chapman, J., Blank, M. and Shoenfeld, Y., (2017), Behavioral abnormalities in female mice following administration of aluminum adjuvants and the human papillomavirus (HPV) vaccine Gardasil. Immunologic research, 65(1), pp.136-149.\n\n[8] Clark, T.D., Raby, G.D., Roche, D.G. et al. (2020), Ocean acidification does not impair the behaviour of coral reef fishes. Nature doi:10.1038/s41586-019-1903-y\n\n[9] Enserink, M., (2019), Can you spot the duplicates? Critics say these photos of lionfish point to fraud,\n\n[10] Teixeira da Silva, J., (2018), The opacity of the PubPeer Foundation: what PubPeer’s “About” page tells us, Online Information Review, 42(2), pp. 282-287.\n\n[11] Acquavella, J., Garabrant, D., Marsh, G., Sorahan, T. and Weed, D.L. (2016), Glyphosate epidemiology expert panel review: a weight of evidence systematic review of the relationship between glyphosate exposure and non-Hodgkin’s lymphoma or multiple myeloma. Critical reviews in toxicology, 46(sup1), pp.28-43.\n\n[12] Andreotti, G., Koutros, S., Hofmann, J.N., Sandler, D.P., Lubin, J.H., Lynch, C.F., Lerro, C.C., De Roos, A.J., Parks, C.G., Alavanja, M.C. and Silverman, D.T., (2017), Glyphosate use and cancer incidence in the agricultural health study. JNCI: Journal of the National Cancer Institute, 110(5), pp.509-516.\n\n[13] Salzberg, S., (2019), Does The Herbicide RoundUp® Cause Cancer? , www.forbes.com/sites/stevensalzberg/2019/02/18/does-the-herbicide-roundup-cause-cancer/#4239e1b521b4\n\n[14] Williams, G.M., Aardema, M., Acquavella, J., Berry, S.C., Brusick, D., Burns, M.M., de Camargo, J.L.V., Garabrant, D., Greim, H.A., Kier, L.D. and Kirkland, D.J., (2016), A review of the carcinogenic potential of glyphosate by four independent expert panels and comparison to the IARC assessment. Critical reviews in toxicology, 46(sup1), pp.3-20.\n\n[15] Herman, E.S. and Chomsky, N., (2010), Manufacturing consent: The political economy of the mass media. Random House.\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX.\n\nPlease DONATE TODAY To Help Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "Censoring peer review using political correctness | Principia Scientific Intl.", "description": "According to many governments and the mainstream media there is no association of ASD and Aluminum Adjuvants in vaccines, because “any link between immunization and autism has been completely discredited” [1]. The Establishment tells us: “concern in the community about a possible link between the measles, mumps, rubella (MMR) vaccine and autism was generated by", "url": "https://principia-scientific.com/censoring-peer-review-using-political-correctness/", "image": "https://external-content.duckduckgo.com/iu/?u=http%3A%2F%2Fstatic.parade.com%2Fwp-content%2Fuploads%2F2016%2F04%2FiStock_000081591205_Medium.jpg&f=1&nofb=1", "image:secure_url": "https://external-content.duckduckgo.com/iu/?u=http%3A%2F%2Fstatic.parade.com%2Fwp-content%2Fuploads%2F2016%2F04%2FiStock_000081591205_Medium.jpg&f=1&nofb=1"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.sciencedirect.com/topics/earth-and-planetary-sciences/measles", "https://www.sciencedirect.com/topics/medicine-and-dentistry/mumps", "https://www.sciencedirect.com/topics/earth-and-planetary-sciences/rubella", "https://www.sciencedirect.com/science/article/pii/S2211124716316497", "http://www.betterhealth.vic.gov.au/health/conditionsandtreatments/autism-spectrum-disorder-asd", "https://www.sciencedirect.com/science/article/pii/S0946672X1830498X?via%3Dihub#bbib0005", "https://www.sciencedirect.com/science/article/pii/S0946672X1830498X?via%3Dihub#bbib0010", "https://www.sciencemag.org/news/2019/09/can-you-spot-duplicates-critics-say-these-photos-lionfish-point-fraud", "http://www.forbes.com/sites/stevensalzberg/2019/02/18/does-the-herbicide-roundup-cause-cancer/#4239e1b521b4", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=twitter", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=facebook", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=telegram", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=custom-1654796357", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=linkedin", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20Censoring%20peer%20review%20using%20political%20correctness&body=https%3A%2F%2Fprincipia-scientific.com%2Fcensoring-peer-review-using-political-correctness%2F&share=email", "#", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=pinterest", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=pocket", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=tumblr", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=skype", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/?share=jetpack-whatsapp", "https://principia-scientific.com/censoring-peer-review-using-political-correctness/#print"], "authors": [], "publish_date": "February 27, 2020"}