{"result_id": "246003", "URL": "https://principia-scientific.org/top-pathologist-no-one-has-died-from-the-coronavirus/", "timestamp": "2023-04-25 16:53:30 CEST+0200", "meta": {"description": "A high-profile European pathologist is reporting that he and his colleagues across Europe have not found any evidence of any deaths from the novel coronavirus on that continent. Dr. Stoian Alexov called the World Health Organization (WHO) a “criminal medical organization” for creating worldwide fear and chaos without providing objectively verifiable proof of a pandemic. Another stunning", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Top pathologist: ‘NO ONE has died from the coronavirus!’ | Principia Scientific Intl.", "cleaned_text": "Top pathologist: ‘NO ONE has died from the coronavirus!’\n\nA high-profile European pathologist is reporting that he and his colleagues across Europe have not found any evidence of any deaths from the novel coronavirus on that continent.\n\nDr. Stoian Alexov called the World Health Organization (WHO) a “criminal medical organization” for creating worldwide fear and chaos without providing objectively verifiable proof of a pandemic.\n\nAnother stunning revelation from Bulgarian Pathology Association (BPA) president Dr. Alexov is that he believes it’s currently “impossible” to create a vaccine against the virus.\n\nHe also revealed that European pathologists haven’t identified any antibodies that are specific for SARS-CoV-2.\n\nThese stunning statements raise major questions, including about officials’ and scientists’ claims regarding the many vaccines they’re rushing into clinical trials around the world.\n\nThey also raise doubt about the veracity of claims of discovery of anti-novel-coronavirus antibodies (which are beginning to be used to treat patients).\n\nNovel-coronavirus-specific antibodies are supposedly the basis for the expensive serology test kits being used in many countries (some of which have been found to be unacceptably inaccurate).\n\nAnd they’re purportedly key to the immunity certificates coveted by Bill Gates that are about to go into widespread use — in the form of the COVI-PASS — in 15 countries including the UK, US, and Canada.\n\nDr. Alexov made his jaw-dropping observations in a video interview summarizing the consensus of participants in a May 8, 2020, European Society of Pathology (ESP) webinar on COVID-19.\n\nThe May 13 video interview of Dr. Alexov was conducted by Dr. Stoycho Katsarov, chair of the Center for Protection of Citizens’ Rights in Sofia and a former Bulgarian deputy minister of health. The video is on the BPA’s website, which also highlights some of Dr. Alexov’s main points.\n\nWe asked a native Bulgarian speaker with a science background to orally translate the video interview into English. We then transcribed her translation. The video is here and our English transcript is here.\n\nAmong the major bombshells Dr. Alexov dropped is that the leaders of the May 8 ESP webinar said no novel-coronavirus-specific antibodies have been found.\n\nThe body forms antibodies specific to pathogens it encounters. These specific antibodies are known as monoclonal antibodies and are a key tool in pathology. This is done via immunohistochemistry, which involves tagging antibodies with colours and then coating the biopsy- or autopsy-tissue slides with them. After giving the antibodies time to bind to the pathogens they’re specific for, the pathologists can look at the slides under a microscope and see the specific places where the coloured antibodies — and therefore the pathogens they’re bound to – are located.\n\nTherefore, in the absence of monoclonal antibodies to the novel coronavirus, pathologists cannot verify whether SARS-CoV-2 is present in the body, or whether the diseases and deaths attributed to it indeed were caused by the virus rather than by something else.\n\nIt would be easy to dismiss Dr. Alexov as just another crank ‘conspiracy theorist.’ After all many people believe they’re everywhere these days, spreading dangerous misinformation about COVID-19 and other issues.\n\nIn addition, little of what Dr. Alexov alleges was the consensus from the May 8 webinar is in the publicly viewable parts of the proceedings.\n\nBut keep in mind that whistleblowers often stand alone because the vast majority of people are afraid to speak out publicly.\n\nAlso, Dr. Alexov has an unimpugnable record and reputation. He’s been a physician for 30 years. He’s president of the BPA, a member of the ESP’s Advisory Board and head of the histopathology department at the Oncology Hospital in the Bulgarian capital of Sofia.\n\nOn top of that, there’s other support for what Dr. Alexov is saying.\n\nFor example, the director of the Institute of Forensic Medicine at the University Medical Center Hamburg-Eppendorf in Germany said in media interviews that there’s a striking dearth of solid evidence for COVID-19’s lethality.\n\n“COVID-19 is a fatal disease only in exceptional cases, but in most cases it is a predominantly harmless viral infection,” Dr. Klaus Püschel told a German paper in April. Adding in another interview:\n\nAlso, one of us (Rosemary) and another journalist, Amory Devereux, documented in a June 9 Off-Guardian article that the novel coronavirus has not fulfilled Koch’s postulates.\n\nThese postulates are scientific steps used to prove whether a virus exists and has a one-to-one relationship with a specific disease. We showed that to date no one has proven SARS-CoV-2 causes a discrete illness matching the characteristics of all the people who ostensibly died from COVID-19. Nor has the virus has been isolated, reproduced and then shown to cause this discrete illness.\n\nIn addition, in a June 27 Off-Guardian article two more journalists, Torsten Engelbrecht and Konstantin Demeter, added to the evidence that “the existence of SARS-CoV-2 RNA is based on faith, not fact.”\n\nThe pair also confirmed “there is no scientific proof that those RNA sequences [deemed to match that of the novel coronavirus] are the causative agent of what is called COVID-19.”\n\nDr. Alexov stated in the May 13 interview that:\n\nDr. Alexov also observed there is no proof from autopsies that anyone deemed to have been infected with the novel coronavirus died only from an inflammatory reaction sparked by the virus (presenting as interstitial pneumonia) rather than from other potentially fatal diseases.\n\nAnother revelation of his is that:\n\nAs pointed to above, the inability to identify monoclonal antibodies for the virus suggests there is no basis for the vaccines, serological testing and immunity certificates being rolled out around the globe at unprecedented speed and cost. In fact, there is no solid evidence the virus exists.\n\nDr. Alexov made still more important points. For example, he noted that, in contrast to the seasonal influenza, SARS-CoV-2 hasn’t been proven to kill youth:\n\nAmong the myriad ways the WHO is creating that chaos is by prohibiting almost all autopsies of people deemed to have died from COVID-19. As a result, reported Dr. Alexov, by May 13 only three such autopsies had been conducted in Bulgaria.\n\nAlso, the WHO is dictating that everyone said to be infected with the novel coronavirus who subsequently dies must have their deaths attributed to COVID-19.\n\n“That’s quite stressful for us, and for me in particular, because we have protocols and procedures which we need to use,” he told Dr. Katsarov. “…And another pathologist 100 years from now is going to say, ‘Hey, those pathologists didn’t know what they were doing [when they said the cause of death was COVID-19]!’ So we need to be really strict with our diagnoses, because they could be proven [or disproven], and they could be checked again later.”\n\nHe disclosed that pathologists in several countries in Europe, as well as in China, Australia and Canada are strongly resisting the pressure on them to attribute deaths to COVID-19 alone:\n\nDrs. Alexov and Katsarov agreed that yet another aspect of the WHO-caused chaos and its fatal consequences is many people are likely to die soon from diseases such as cancer because the lockdowns, combined with the emptying of hospitals (ostensibly to make room for COVID-19 patients), halted all but the most pressing procedures and treatments.\n\nThey also observed these diseases are being exacerbated by the fear and chaos surrounding COVID-19.\n\nIn addition, posited Dr. Alexov, as another direct and dire result of the pandemic panic many people are losing faith in physicians.\n\nWe emailed Dr. Alexov several questions, including asking why he believes it’s impossible to create a vaccine against COVID-19.\n\nHe didn’t answer the questions directly. Dr. Alexov instead responded:\n\nWe also emailed five of Dr. Alexov’s colleagues in the European Pathology Society asking them to confirm Dr. Alexov’s revelations. We followed up by telephone with two of them. None responded.\n\nWhy didn’t Dr. Alexov or his five colleagues answer our questions?\n\nWe doubt it’s due to lack of English proficiency.\n\nIt’s more likely because of the pressure on pathologists to follow the WHO’s directives and not speak out publicly. (And, on top of that, pathology departments depend on governments for their funding.)\n\nNonetheless, pathologists like Drs. Alexov and Püschel appear to be willing to step out and say that no one has died from a novel-coronavirus infection.\n\nPerhaps that’s because pathologists’ records and reputations are based on hard physical evidence rather than on subjective interpretation of tests, signs and symptoms. And there is no hard physical evidence that COVID-19 is deadly.\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX.\n\nHelp Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "article", "title": "Top pathologist: ‘NO ONE has died from the coronavirus!’ | Principia Scientific Intl.", "description": "A high-profile European pathologist is reporting that he and his colleagues across Europe have not found any evidence of any deaths from the novel coronavirus on that continent. Dr. Stoian Alexov called the World Health Organization (WHO) a “criminal medical organization” for creating worldwide fear and chaos without providing objectively verifiable proof of a pandemic. Another stunning", "url": "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/", "image": "https://principia-scientific.com/wp-content/uploads/2020/07/4444.jpg", "image:secure_url": "https://principia-scientific.com/wp-content/uploads/2020/07/4444.jpg", "image:width": "600", "image:height": "368", "article:published_time": "2020-07-11T20:30:52+00:00", "article:modified_time": "2020-07-11T20:30:52+00:00", "article:publisher": "https://www.facebook.com/johnosullivanpsi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://investor.lilly.com/news-releases/news-release-details/lilly-begins-worlds-first-study-potential-covid-19-antibody", "https://directorsblog.nih.gov/2020/05/21/enlisting-monoclonal-antibodies-in-the-fight-against-covid-19/", "https://www.gov.uk/government/publications/covid-19-laboratory-evaluations-of-serological-assays", "https://www.fda.gov/medical-devices/emergency-situations-medical-devices/eua-authorized-serology-test-performance", "https://www.independent.co.uk/news/uk/home-news/coronavirus-test-antibody-kit-uk-china-nhs-matt-hancock-a9449816.html", "https://off-guardian.org/2020/04/04/did-bill-gates-just-reveal-the-reason-behind-the-lock-downs/", "https://www.mintpressnews.com/mass-tracking-covi-pass-immunity-passports-slated-roll-15-countries/269006/", "https://www.covipass.com/", "https://bpa-pathology.com/esp-webinar-video-recordings-covid-19-unprecedented-daily-challenges-in-pathology-departments-across-europe-2/", "https://www.euractiv.com/section/data-protection/video/why-are-authorities-in-bulgaria-hiding-the-results-of-serological-tests/", "https://bpa-pathology.com/horata-umirat-s-a-ne-ot-koronavirus/", "https://vimeo.com/430519792", "https://off-guardian.org/wp-content/medialibrary/Transcription-of-translation-of-videointerview-of-Dr-Alexov-Rosemary-Frei.rtf", "https://www.britannica.com/science/antibody", "https://www.prosci-inc.com/resources/antibody-development-guide/what-is-immunohistochemistry/", "https://thecic.org/event/lie-machines-how-to-save-democracy-from-social-media/", "https://www.nature.com/articles/d41586-020-01452-z", "https://bpa-pathology.com/esp-webinar-video-recordings-covid-19-unprecedented-daily-challenges-in-pathology-departments-across-europe-2/", "https://bpa-pathology.com/about-us/", "https://www.esp-pathology.org/about-esp/structure-governance/advisory-board.html", "https://off-guardian.org/2020/04/17/8-more-experts-questioning-the-coronavirus-panic/", "https://www.mopo.de/hamburg/rechtsmediziner--ohne-vorerkrankung-ist-in-hamburg-an-covid-19-noch-keiner-gestorben--36508928", "https://www.abendblatt.de/hamburg/article228828787/rechtsmedizin-pueschel-hamburg-corona-virus-infektion-covid-19-coronavirus-krise-patienten-krankenhaeuser-kliniken-infektionsrate-krankheit-pandemie-test-lungenkrankheit-sars-cov-epidemie-sars-cov-2.html", "https://off-guardian.org/2020/06/09/scientists-have-utterly-failed-to-prove-that-the-coronavirus-fulfills-kochs-postulates/", "https://off-guardian.org/2020/06/27/covid19-pcr-tests-are-scientifically-meaningless/", "https://www.nejm.org/doi/full/10.1056/NEJMc2009787", "https://academic.oup.com/jpids/advance-article/doi/10.1093/jpids/piaa061/5842067", "https://www.who.int/classifications/icd/Guidelines_Cause_of_Death_COVID-19-20200420-EN.pdf?ua=1", "https://www.globalresearch.ca/no-one-has-died-coronavirus/5717668?fbclid=IwAR25iR0Kndmd8nAZCckULglwkXoZNOvLvG22rUpu_yiroi5CW_r7xQnl3Mk", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=twitter", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=facebook", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=telegram", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=custom-1654796357", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=linkedin", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20Top%20pathologist%3A%20%E2%80%98NO%20ONE%20has%20died%20from%20the%20coronavirus%21%E2%80%99&body=https%3A%2F%2Fprincipia-scientific.com%2Ftop-pathologist-no-one-has-died-from-the-coronavirus%2F&share=email", "#", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=pinterest", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=pocket", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=tumblr", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=skype", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/?share=jetpack-whatsapp", "https://principia-scientific.com/top-pathologist-no-one-has-died-from-the-coronavirus/#print"], "authors": [], "publish_date": "2020-07-11T20:30:52+00:00"}