{"result_id": "246025", "URL": "https://principia-scientific.org/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/", "timestamp": "2023-04-25 16:53:51 CEST+0200", "meta": {"description": "In the 90’s, Dr. Antonietta Gatti discovered the relationship between micro- and nano-particles as well as a great number of pathologies:", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "World Renowned Lab Silenced After Disturbing Vaccine Discovery | Principia Scientific Intl.", "cleaned_text": "Currently, she is the coordinator of the Italian Institute of Technology’s Project of Nanoecotoxicology, called INESE.\n\nShe is also a selected expert of the FAO/WHO for the safety in nanotechnological food, and a Member of the NANOTOX Cluster of the European Commission and the author of a book titled “Nanopathology: the health impact of nanoparticles,” and on the Editorial Board of Journal of Biomaterials Applications and a member of the CPCM of the Italian Ministry of Defense.\n\nFurthermore, her and her husband Dr. Stefano Montanari founded a laboratory called Nano-diagnostics for the evaluation of the pathological tissues of patients, it’s presently at the University of Modena and Reggio Emilia, Italy.\n\nRecently, the Italian police raided their home, the police took all digital assets that were owned by the the two nanopathologists, including laptops, computers, and flash-drives, basically years of work and research.\n\nJames Grundvig via the World Mercury Project describes what happened quite well:\n\nThe scientists published their work in January of 2017, titled, New Quality‐Control Investigations on Vaccines: Micro‐ and Nanocontamination. If science wasn’t plagued by corruption, an investigation should have started, healthcare agencies would have become involved and vaccine safety policies would have come under intense scrutiny, but that never happened.\n\nBelow is a recent interview with the two, done by Surêté Vaccins, the quick description of the video reads,\n\nNano particles are very small bits of matter, and they can enter into the human body, as the pair of scientist discovered in the 90’s. This is why we have so much published research linking various chemical products, like cleaning agents, to the destruction of human health.\n\nThese nano particles are produced by waste incinerators, car traffic, and many other different ways. Because they float in the air, we can inhale them, which means they enter our lungs and then enter into the blood within minutes. This leads to a number of problems. These particles are carried by the blood to every district of the body, as they explain in the video below. When they enter into the tissues, the body cannot get rid of them, and so those particles stay there forever and are the cause of various diseases we see today.\n\nThey explain how they’ve been analyzing and studying vaccines for the past 15 years.\n\nWhen all said and done, they analyzed 44 different vaccines. All of them contained these harmful particles, which are foreign bodies entering into the body. Whenever this happens, the body has a reaction, and it’s not good.\n\nIn it, they talk a little bit about the study and what’s currently going on.\n\nThis Is Simply The Truth About Modern Day Science That Continues To Be Ignored\n\nThere are three quotes I love to use to illustrate best what I’m trying to get across here,\n\nIn the case of medicine, a lot of information has emerged showing just how much corruption really goes on in the industry. The Editors-in-Chiefs of several major medical journals have been quite blunt, with perhaps one of the best examples coming from Dr. Richard Horton, the current Editor-in-Chief of The Lancet, who says:\n\nDr. Marcia Angell, a physician and longtime Editor-in-Chief of the New England Medical Journal (NEMJ), also considered one of the most prestigious peer-reviewed medical journals in the world, alongside The Lancet, has said that:\n\nJohn Ioannidis, an epidemiologist at the Stanford University School of Medicine, published an article titled “Why Most Published Research Findings Are False,” which subsequently became the most widely accessed article in the history of the Public Library of Science (PLoS). (source)\n\nHere is another great quote by Arnold Seymour Relman (1923-2014), Harvard professor of medicine and former Editor-in-Chief of The New England Medical Journal:\n\nIn 2016, a group of scientists in 2016 at the CDC named, SPIDER (Scientists Preserving Integrity, Diligence and Ethics), put out a list of complaints in the form of a letter to the CDC’s Chief of Staff, where they say,\n\nThis was covered by several activists, from Robert F. Kennedy Jr. to another article from the Huffington Post, but unfortunately it received little to no mainstream media attention.\n\nShortly before this, and perhaps even more shockingly, is the whistleblower testimony from a senior CDC scientist, who has authored multiple commonly cited studies that show no link whatsoever between the MMR vaccine and autism. In fact, one of his studies, published in 2004, is the most commonly cited study used to debunk the link between the MMR vaccine and autism.\n\nHis name is Dr. William Thompson, and he bravely told the world that it was “the lowest point” in his career that he “went along with that paper.” He said that the authors “didn’t report significant findings” and that he is “completely ashamed” of what he did, that he was “complicit and went along with this, and that he regrets that he has “been part of the problem.” (source)(source)(source)\n\nHere is an official statement from Dr. Thompson describing the situation in his own words. This is perhaps the best source of information regrading this matter.\n\nThese are a few examples out out of many.\n\nWe are living in a time of great transparency, a lot of new information is coming out that’s completely countering what we’ve been told, and some rather ghastly examples of scientific fraud have been made, it’s not just with vaccines.\n\nInformation like this, unfortunately, can create a divide among the population, with one side spewing venom at the other, using terms like “anti-vax” or “pro-vax.” At the end of the day, these labels and the way we argue over them doesn’t really solve anything. If all we do is react with emotions when it comes to such important topics, we might as well not even have a conversation about them at all.\n\nAll of us have to wake up and realize that nothing is set in stone, and the way we do things here is constantly changing. There is no denying the that fact that corporate/government funded media is severely fraudulent and basically presents one side of the coin.\n\nThe media pays absolutely no attention to vaccine research that does not fit the narrative of their owners. Something is seriously wrong here, and there are more than enough opportunities to see it.\n\nThe key here is to disseminate information in a peaceful manner, and remember, you still have the choice with regards to the decisions you make about your health, and the health of your child.\n\nDon’t be afraid to think for yourself.\n\n“The main reason we take so many drugs is that drug companies don t sell drugs, they sell lies about drugs. This is what makes drugs so different from anything else in life… Virtually everything we know about drugs is what the companies have chosen to tell us and our doctors… the reason patients trust their medicine is that they extrapolate the trust they have in their doctors into the medicines they prescribe. The patients don’t realize that, although their doctors may know a lot about diseases and human physiology and psychology, they know very, very little about drugs that’ve been carefully concocted and dressed up by the drug industry… If you don t think the system is out of control, please email me and explain why drugs are the third leading cause of death… If such a hugely lethal epidemic had been caused by a new bacterium or a virus,or even one-hundredth of it, we would have done everything we could to get it under control.”\n\n – Dr. Peter Gotzsche, co-founder of the Cochrane Collaboration", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "World Renowned Lab Silenced After Disturbing Vaccine Discovery | Principia Scientific Intl.", "description": "In the 90’s, Dr. Antonietta Gatti discovered the relationship between micro- and nano-particles as well as a great number of pathologies:", "url": "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/", "image": "https://principia-scientific.com/wp-content/uploads/2018/04/gatti.jpg", "image:secure_url": "https://principia-scientific.com/wp-content/uploads/2018/04/gatti.jpg", "image:width": "792", "image:height": "424"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "300", "height": "150", "embed_code": "<iframe id=\"fitvid0\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/Bvtz3iNTx60?start=0&amp;modestbranding=1&amp;showinfo=0&amp;theme=light\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/Bvtz3iNTx60?start=0&modestbranding=1&showinfo=0&theme=light"}], "links": ["http://www.jamgrundvig.com/", "https://worldmercuryproject.org/news/the-third-digital-revolution-to-unleash-the-power-of-anti-censorship/", "http://www.greenmedinfo.com/toxic-ingredient/nanoparticles", "http://info.cmsri.org/the-driven-researcher-blog/dirty-vaccines-new-study-reveals-prevalence-of-contaminants", "http://www.greenmedinfo.com/anti-therapeutic-action/vaccination-all", "http://www.greenmedinfo.com/toxic-ingredient/aluminum", "http://www.greenmedinfo.com/toxic-ingredient/industrial-copper-inorganic-0", "http://www.greenmedinfo.com/disease/heavy-metal-toxicity", "http://medcraveonline.com/IJVV/IJVV-04-00072.php", "https://www.youtube.com/channel/UCKtMxXREktdBFNJjSIotp_A", "http://www.collective-evolution.com/2018/03/02/new-study-cleaning-products-are-as-damaging-as-smoking-20-cigarettes-a-day/", "http://www.thelancet.com/pdfs/journals/lancet/PIIS0140-6736{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}2815{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}2960696-1.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2964337/", "http://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.0020124", "http://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.0020124", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1126053/#ref15", "https://www.ecowatch.com/cdc-corruption-robert-kennedy-jr-2096438139.html", "https://www.huffingtonpost.com/carey-gillam/spider-bites-cdc-ethics-c_b_12525012.html", "https://www.youtube.com/watch?v=LhpckzxVEoc#t=381", "http://www.cnn.com/2014/08/27/health/irpt-cdc-autism-vaccine-study/", "http://legislature.vermont.gov/assets/Documents/2016/WorkGroups/House{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Health{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Care/Bills/H.98/Witness{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Testimony/H.98~Jennifer{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Stella~William{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Thompson{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Statement~5-6-2015.pdf", "http://legislature.vermont.gov/assets/Documents/2016/WorkGroups/House{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Health{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Care/Bills/H.98/Witness{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Testimony/H.98~Jennifer{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Stella~William{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Thompson{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}20Statement~5-6-2015.pdf", "http://www.collective-evolution.com/2017/11/03/why-were-not-anti-vax-and-why-we-all-need-to-stop-choosing-sides-in-the-vaccine-debate/", "http://www.collective-evolution.com/2017/11/26/one-doctor-out-of-many-explains-how-prescription-drugs-are-killing-us/", "http://www.collective-evolution.com/2018/04/17/world-renowned-scientists-have-their-lab-shut-down-after-troublesome-vaccine-discovery/", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=twitter", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=facebook", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=telegram", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=custom-1654796357", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=linkedin", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20World%20Renowned%20Lab%20Silenced%20After%20Disturbing%20Vaccine%20Discovery&body=https%3A%2F%2Fprincipia-scientific.com%2Fworld-renowned-lab-silenced-after-disturbing-vaccine-discovery%2F&share=email", "#", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=pinterest", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=pocket", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=tumblr", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=skype", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/?share=jetpack-whatsapp", "https://principia-scientific.com/world-renowned-lab-silenced-after-disturbing-vaccine-discovery/#print"], "authors": [], "publish_date": "April 20, 2018"}