{"result_id": "246031", "URL": "https://principia-scientific.org/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/", "timestamp": "2023-04-25 16:53:57 CEST+0200", "meta": {"description": "The “Spanish Flu” killed an estimated 50-100 million people during a pandemic 1918-19. What if the story we have been told about this pandemic isn’t true? What if, instead, the killer infection was neither the flu nor Spanish in origin? Newly analyzed documents reveal that the “Spanish Flu” may have been a military vaccine experiment", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Was a Military Experimental Vaccine The Cause of ‘Spanish Flu’? | Principia Scientific Intl.", "cleaned_text": "Was a Military Experimental Vaccine The Cause of ‘Spanish Flu’?\n\nThe “Spanish Flu” killed an estimated 50-100 million people during a pandemic 1918-19. What if the story we have been told about this pandemic isn’t true?\n\nWhat if, instead, the killer infection was neither the flu nor Spanish in origin? Newly analyzed documents reveal that the “Spanish Flu” may have been a military vaccine experiment gone awry.\n• The reason modern technology has not been able to pinpoint the killer influenza strain from this pandemic is because influenza was not the killer.\n• More soldiers died during WWI from disease than from bullets.\n• The pandemic was not flu. An estimated 95{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} (or higher) of the deaths were caused by bacterial pneumonia, not influenza/a virus.\n• The pandemic was not Spanish. The first cases of bacterial pneumonia in 1918 trace back to a military base in Fort Riley, Kansas.\n• From January 21 – June 4, 1918, an experimental bacterial meningitis vaccine cultured in horses by the Rockefeller Institute for Medical Research in New York was injected into soldiers at Fort Riley.\n• During the remainder of 1918 as those soldiers – often living and traveling under poor sanitary conditions – were sent to Europe to fight, they spread bacteria at every stop between Kansas and the frontline trenches in France.\n• One study describes soldiers “with active infections (who) were aerosolizing the bacteria that colonized their noses and throats, while others—often, in the same “breathing spaces”—were profoundly susceptible to invasion of and rapid spread through their lungs by their own or others’ colonizing bacteria.” (1)\n• The “Spanish Flu” attacked healthy people in their prime. Bacterial pneumonia attacks people in their prime. Flu attacks the young, old and immunocompromised.\n• When WW1 ended on November 11, 1918, soldiers returned to their home countries and colonial outposts, spreading the killer bacterial pneumonia worldwide.\n• During WW1, the Rockefeller Institute also sent the antimeningococcic serum to England, France, Belgium, Italy and other countries, helping spread the epidemic worldwide.\n\nDuring the pandemic of 1918-19, the so-called “Spanish Flu” killed 50-100 million people, including many soldiers.\n\nMany people do not realize that disease killed far more soldiers on all sides than machine guns or mustard gas or anything else typically associated with WWI.\n\nI have a personal connection to the Spanish Flu. Among those killed by disease in 1918-19 are members of both of my parents’ families.\n\nOn my father’s side, his grandmother Sadie Hoyt died from pneumonia in 1918. Sadie was a Chief Yeoman in the Navy. Her death left my grandmother Rosemary and her sister Anita to be raised by their aunt. Sadie’s sister Marian also joined the Navy. She died from “the influenza” in 1919.\n\nOn my mother’s side, two of her father’s sisters died in childhood. All of the family members who died lived in New York City.\n\nI suspect many American families, and many families worldwide, were impacted in similar ways by the mysterious Spanish Flu.\n\nIn 1918, “influenza” or flu was a catchall term for disease of unknown origin. It didn’t carry the specific meaning it does today.\n\nIt meant some mystery disease which dropped out of the sky. In fact, influenza is from the Medieval Latin “influential” in an astrological sense, meaning a visitation under the influence of the stars.\n\nWHY IS WHAT HAPPENED 100 YEARS AGO IMPORTANT NOW?\n\nBetween 1900-1920, there were enormous efforts underway in the industrialized world to build a better society. I will use New York as an example to discuss three major changes to society which occurred in NY during that time and their impact on mortality from infectious diseases.\n\nIn the late 19th century through the early 20th century, New York built an extraordinary system to bring clean water to the city from the Catskills, a system still in use today. New York City also built over 6000 miles of sewer to take away and treat waste, which protects the drinking water. The World Health Organization acknowledges the importance of clean water and sanitation in combating infectious diseases. (2)\n\nIn the late 19th century through the early 20th century, New York built a power grid and wired the city so power was available in every home. Electricity allows for refrigeration. Refrigeration is an unsung hero as a public health benefit. When food is refrigerated from farm to table, the public is protected from potential infectious diseases. Cheap renewable energy is important for many reasons, including combating infectious diseases.\n\nIn the late 19th century through the early 20th century, New York became the home of the Rockefeller Institute for Medical Research (now Rockefeller University). The Institute is where the modern pharmaceutical industry was born. The Institute pioneered many of the approaches the pharmaceutical industry uses today, including the preparation of vaccine serums, for better or worse. The vaccine used in the Fort Riley experiment on soldiers was made in horses.\n\nUS Mortality Rates data from the turn of the 20th century to 1965 clearly indicates that clean water, flushing toilets, effective sewer systems and refrigerated foods all combined to effectively reduce mortality from infectious diseases BEFORE vaccines for those diseases became available.\n\nHave doctors and the pharmaceutical manufacturers taken credit for reducing mortality from infectious disease which rightfully belongs to sandhogs, plumbers, electricians and engineers?\n\nIf hubris at the Rockefeller Institute in 1918 led to a pandemic disease which killed millions of people, what lessons can we learn and apply to 2018?\n\nTHE DISEASE WAS NOT SPANISH\n\nWhile watching an episode of American Experience on PBS a few months ago, I was surprised to hear that the first cases of “Spanish Flu” occurred at Fort Riley, Kansas in 1918. I thought, how is it possible this historically important event could be so badly misnamed 100 years ago and never corrected?\n\nSpain was one of a few countries not involved in World War I. Most of the countries involved in the war censored their press.\n\nFree from censorship concerns, the earliest press reports of people dying from disease in large numbers came from Spain. The warring countries did not want to additionally frighten the troops, so they were content to scapegoat Spain. Soldiers on all sides would be asked to cross no man’s land into machine gun fire, which was frightening enough without knowing that the trenches were a disease breeding ground.\n\nOne hundred years later, it’s long past time to drop “Spanish” from all discussion of this pandemic. If the flu started at a United States military base in Kansas, then the disease could and should be more aptly named.\n\nIn order to prevent future disasters, the US (and the rest of the world) must take a hard look at what really caused the pandemic.\n\nIt is possible that one of the reasons the Spanish Flu has never been corrected is that it helps disguise the origin of the pandemic.\n\nIf the origin of the pandemic involved a vaccine experiment on US soldiers, then the US may prefer calling it Spanish Flu instead of The Fort Riley Bacteria of 1918, or something similar. The Spanish Flu started at the location this experimental bacterial vaccine was given making it the prime suspect as the source of the bacterial infections which killed so many.\n\nIt would be much more difficult to maintain the marketing mantra of “vaccines save lives” if a vaccine experiment originating in the United States during the years of primitive manufacturing caused the deaths of 50-100 million people.\n\nTHE DISEASE WHICH KILLED SO MANY WAS NOT FLU OR A VIRUS. IT WAS BACTERIAL.\n\nDuring the mid-2000’s there was much talk about “pandemic preparedness.” Influenza vaccine manufacturers in the United States received billions of taxpayer dollars to develop vaccines to make sure that we don’t have another lethal pandemic “flu,” like the one in 1918-19.\n\nCapitalizing on the “flu” part of Spanish flu helped vaccine manufacturers procure billion dollar checks from governments, even though scientists knew at the time that bacterial pneumonia was the real killer.\n\nIt is not my opinion that bacterial pneumonia was the real killer – thousands of autopsies confirm this fact.\n\nAccording to a 2008 National Institute of Health paper, bacterial pneumonia was the killer in a minimum of 92.7{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117} of the 1918-19 autopsies reviewed. It is likely higher than 92.7{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}.\n\nThe researchers looked at more than 9000 autopsies, and “there were no negative (bacterial) lung culture results.”\n\nPneumococci or streptococci were found in “164 of (the) 167 lung tissue samples” autopsied. That is 98.2{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}. Bacteria was the killer.\n\nWHERE DID THE SPANISH FLU BACTERIAL PNEUMONIA OF 1918-19 ORIGINATE?\n\nWhen the United States declared war in April 1917, the fledgling Pharmaceutical industry had something they had never had before – a large supply of human test subjects in the form of the US military’s first draft.\n\nPre-war in 1917, the US Army was 286,000 men. Post-war in 1920, the US army disbanded, and had 296,000 men.\n\nDuring the war years 1918-19, the US Army ballooned to 6,000,000 men, with 2,000,000 men being sent overseas. The Rockefeller Institute for Medical Research took advantage of this new pool of human guinea pigs to conduct vaccine experiments.\n\nA REPORT ON ANTIMENINGITIS VACCINATION AND OBSERVATIONS ON AGGLUTININS IN THE BLOOD OF CHRONIC MENINGOCOCCUS CARRIERS\n\n by Frederick L. Gates\n\n From the Base Hospital, Fort Riley, Kansas, and The Rockefeller Institute for Medical Research, New York.\n\n Received 1918 Jul 20\n\nBetween January 21st and June 4th of 1918, Dr. Gates reports on an experiment where soldiers were given 3 doses of a bacterial meningitis vaccine. Those conducting the experiment on the soldiers were just spitballing dosages of a vaccine serum made in horses.\n\nThe vaccination regime was designed to be 3 doses. 4,792 men received the first dose, but only 4,257 got the 2nd dose (down 11{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}), and only 3702 received all three doses (down 22.7{154653b9ea5f83bbbf00f55de12e21cba2da5b4b158a426ee0e27ae0c1b44117}).\n\nA total of 1,090 men were not there for the 3rd dose. What happened to these soldiers? Were they shipped East by train from Kansas to board a ship to Europe? Were they in the Fort Riley hospital? Dr. Gates’ report doesn’t tell us.\n\nAn article accompanying the American Experience broadcast I watched sheds some light on where these 1,090 men might be. Gates began his experiments in January 1918.\n\nBy March of that year, “100 men a day” were entering the infirmary at Fort Riley.\n\nAre some of these the men missing from Dr. Gates’ report – the ones who did not get the 2nd or 3rd dose?\n\nGates does report that several of the men in the experiment had flu-like symptoms: coughs, vomiting and diarrhea after receiving the vaccine.\n\nThese symptoms are a disaster for men living in barracks, travelling on trains to the Atlantic coast, sailing to Europe, and living and fighting in trenches.\n\nThe unsanitary conditions at each step of the journey are an ideal environment for a contagious disease like bacterial pneumonia to spread.\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX.\n\nPlease DONATE TODAY To Help Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "article", "title": "Was a Military Experimental Vaccine The Cause of ‘Spanish Flu’? | Principia Scientific Intl.", "description": "The “Spanish Flu” killed an estimated 50-100 million people during a pandemic 1918-19. What if the story we have been told about this pandemic isn’t true? What if, instead, the killer infection was neither the flu nor Spanish in origin? Newly analyzed documents reveal that the “Spanish Flu” may have been a military vaccine experiment", "url": "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/", "image": "https://principia-scientific.com/wp-content/uploads/2020/04/3-7.jpg", "image:secure_url": "https://principia-scientific.com/wp-content/uploads/2020/04/3-7.jpg", "image:width": "600", "image:height": "310", "article:published_time": "2020-04-22T11:21:52+00:00", "article:modified_time": "2020-04-22T11:21:52+00:00", "article:publisher": "https://www.facebook.com/johnosullivanpsi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://wwwnc.cdc.gov/eid/article/14/8/07-1313_article", "http://www.who.int/sustainable-development/cities/health-risks/water-sanitation/en/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2599911/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2126288/pdf/449.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2126288/pdf/449.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2126288/pdf/449.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2126288/pdf/449.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2126288/pdf/449.pdf", "https://www.pbs.org/wgbh/americanexperience/features/influenza-first-wave/", "https://vaccineimpact.com/2018/did-military-experimental-vaccine-in-1918-kill-50-100-million-people-blamed-as-spanish-flu/", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=twitter", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=facebook", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=telegram", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=custom-1654796357", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=linkedin", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20Was%20a%20Military%20Experimental%20Vaccine%20The%20Cause%20of%20%E2%80%98Spanish%20Flu%E2%80%99%3F&body=https%3A%2F%2Fprincipia-scientific.com%2Fwas-a-military-experimental-vaccine-the-cause-of-spanish-flu%2F&share=email", "#", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=pinterest", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=pocket", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=tumblr", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=skype", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/?share=jetpack-whatsapp", "https://principia-scientific.com/was-a-military-experimental-vaccine-the-cause-of-spanish-flu/#print"], "authors": [], "publish_date": "2020-04-22T11:21:52+00:00"}