{"result_id": "246019", "URL": "https://principia-scientific.org/id2020-alliance-will-combine-vaccinations-implantable-id-microchips/", "timestamp": "2023-04-25 16:53:46 CEST+0200", "meta": {"description": "Big Pharma is officially partnering with the tech industry to pair “immunization” with digital biometrics, meaning humans will soon be microchipped, tracked, and ultimately controlled", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/id2020-alliance-will-combine-vaccinations-implantable-id-microchips/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "‘ID2020 Alliance’ Will Combine Vaccinations & Implantable ID Microchips | Principia Scientific Intl.", "cleaned_text": "Big Pharma is officially partnering with the tech industry to pair “immunization” with digital biometrics, meaning humans will soon be microchipped, tracked, and ultimately controlled through a global identification matrix.\n\nFor years we’ve been watching as Microsoft founder Bill Gates, now retired from the company he founded, use his billions to give ‘free vaccinations‘ to people in third world countries. Now Bill has become a founding partner in another company, this one is called the ID2020 Alliance, and its goal is to give every human being on Earth a digital id. How do they plan on accomplishing this feat? By combining mandatory vaccinations with implantable microchips. Genius, isn’t it? And coming soon to a theater near you, as the saying goes.\n\nSo now you know what Bill Gates and his wife Melinda were really doing over the past 10 years, travelling to third word countries and giving ‘free vaccinations’ to the poor, downtrodden natives. Those ‘free vaccinations‘ was research and a live testing lab to conduct the necessary experiments required to form ID2020.\n\nAnd as you will see today, this unholy hybrid of vaccinations and implantable microchips is already happening in Bangladesh, soon it will be Boston. A page on the Gates Foundation website says that Bill and Melinda have so far invested over $2.5 billion dollars to this project, with no end in sight.\n\nCan the man who put the world behind a personal computer now put a vaccination microchip digital ID into the global population? Bill Gates is absolutely positive he can, and indeed is well on his way to achieving that goal.\n\n“Let no man deceive you by any means: for that day shall not come, except there come a falling away first, and that man of sin be revealed, the son of perdition; Who opposeth and exalteth himself above all that is called God, or that is worshipped; so that he as God sitteth in the temple of God, shewing himself that he is God.” 2 Thessalonians 2:3,4 (KJV)\n\nWe have been warning you about this for the past 10 years, and now it is happening. Are you ready for what comes next? I hope you are. Keep looking for that Blessed Hope, and thank God it comes before the time of Jacob’s trouble. If only my friend, Carl Sanders, the man who first revealed the inner-workings of the team that created the RFID microchip, had lived long enough to see this day.\n\nVaccines now being used to harvest biometric identities of everyone; Big Brother merges with Big Pharma\n\nFROM NATURAL NEWS: The ID2020 Alliance, as it’s being called, is a digital identity program that aims to “leverage immunization” as a means of inserting tiny microchips into people’s bodies. In collaboration with the Global Alliance for Vaccines and Immunizations, also known as GAVI, the government of Bangladesh and various other “partners in government, academia, and humanitarian relief,” the ID2020 Alliance hopes to usher in this mark of the beast as a way to keep tabs on every human being living on Earth.\n\nSimilar to how cattle are marked with ear tags, this globalist alliance wants all humans to be “vaccinated” with digital tracking chips that will create a seamless monitoring system for the New World Order to manage the populations of the world with ease.\n\n“The government of Bangladesh recognizes that the design of digital identity systems carries far-reaching implications for individuals’ access to services and livelihoods, and we are eager to pioneer this approach,” he adds.\n\nWhile the ID2020 program’s testing grounds are primarily in the Third World, the group says it’s also now working with governments here in the United States to start microchipping people through vaccination.\n\n“The City of Austin, ID2020, and several other partners are working together with homeless people and the service providers who engage with them to develop a blockchain-enabled digital identity platform called MyPass to empower homeless people with their own identity data,” writes Chris Burt for BiometricUpdate.com.\n\nID2020 is also jabbing refugees with its microchip vaccinations through two inaugural pilot programs known as iRespond and Everest. According to reports, iRespond has “improved continuity of care” for more than 3,000 refugees receiving drug treatments for chronic illness. Everest, on the other hand, has “assisted with the provision of access to critical energy subsidies and a range of additional services with secure and user-centric digital identities without relying on a smartphone,” Burt writes.\n\nAll of this is priming the public for an eventual mandate of microchip vaccinations, which will be required for every individual in order to buy and sell goods. Chowdhury openly admitted this in stating that digital identity systems will be necessary for “individuals’ access to services and livelihoods.”\n\nIn other words, the Bible is right: A global identification system is in the works that will eventually be required for people to function in society, and ultimately survive. Without these microchips in their bodies, people won’t be able to work, let alone eat, and it’s all happening right before our very eyes.\n\nKeep in mind that ID2020 is a part of the so-called “REAL ID,” which will soon be required for those who wish to travel. REAL ID will also be used as a backdoor method of implementing mandatory vaccination policies for adults. READ MORE\n\nWe believe the ability to prove one’s identity is a fundamental and universal human right. ID2020 Alliance partners jointly define functional requirements, influencing the course of technical innovation and providing a route to technical interoperability, and therefore trust and recognition.\n\nThe ID2020 Alliance is a public-private partnership committed to improving lives through user-centric, portable, privacy-protecting digital identity. This year’s Summit, convened by ID2020 Alliance, brought together leaders and innovators in the field to discuss the technical and non-technical requirements to yield a collective roadmap that moves us towards broad adoption of “good” digital identity for all.\n\nCarl Sanders was an engineer on the world’s first implantable microchip, and in the process of working on this incredible end times device, Carl got saved and spent the rest of his life warning people about what was coming. What you will hear in this video clip is taken from a cassette tape that was sent around churches back in the 1990’s, I had one of those copies. When the Lord had me start NTEB, Bro. Carl and I became friends and he was a guest on our program many times. This is the audio from that cassette tape. I had the privilege of interviewing Bro. Carl back in 2013, and you can listen to that interview here.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "‘ID2020 Alliance’ Will Combine Vaccinations & Implantable ID Microchips | Principia Scientific Intl.", "description": "Big Pharma is officially partnering with the tech industry to pair “immunization” with digital biometrics, meaning humans will soon be microchipped, tracked, and ultimately controlled", "url": "https://principia-scientific.com/id2020-alliance-will-combine-vaccinations-implantable-id-microchips/", "image": "https://www.nowtheendbegins.com/wp-content/uploads/2019/10/digital-id2020-alliance-vaccinations-implantable-rfid-nfc-microchips-mark-beast-end-times-bioidentification-nteb-bill-gates-microsoft-nteb-933x445.jpg", "image:secure_url": "https://www.nowtheendbegins.com/wp-content/uploads/2019/10/digital-id2020-alliance-vaccinations-implantable-rfid-nfc-microchips-mark-beast-end-times-bioidentification-nteb-bill-gates-microsoft-nteb-933x445.jpg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe src=\"https://www.youtube.com/embed/X5qwH45Ar4w\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/X5qwH45Ar4w"}, {"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe src=\"https://www.youtube.com/embed/ghJBVrS48q4\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/ghJBVrS48q4"}, {"embed_type": "iframe", "provider": "youtube", "width": "950", "height": "534", "embed_code": "<iframe src=\"https://www.youtube.com/embed/VDF2bsNoARc\" width=\"950\" height=\"534\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/VDF2bsNoARc"}], "links": ["https://www.gatesfoundation.org/what-we-do/global-development/vaccine-delivery", "https://www.gatesfoundation.org/what-we-do/global-development/vaccine-delivery", "popverse://bible+av/2Th_2:3,4", "https://www.nowtheendbegins.com/category/mark-of-the-beast/", "https://www.nowtheendbegins.com/category/pretribulation-rapture/", "https://www.nowtheendbegins.com/rapture-church-must-take-place-start-time-jacobs-trouble/", "https://www.patheos.com/blogs/religionprof/2019/10/revelation-spam.html", "https://www.naturalnews.com/035777_GAVI_immunization_children.html", "https://id2020.org/alliance", "http://biometricupdate.com/", "https://id2020.org/alliance", "https://www.naturalnews.com/2019-02-04-real-id-laws-are-a-backdoor-to-adult-vaccine-mandates.html", "https://www.naturalnews.com/2019-10-23-vaccines-used-global-biometric-identities-for-surveillance.html", "https://www.sermonaudio.com/sermoninfo.asp?SID=12221412762", "https://www.investmentwatchblog.com/big-pharma-and-microsoft-are-teaming-up-in-something-called-the-id2020-alliance-that-will-combine-vaccinations-with-implantable-microchips-to-create-your-digital-id/?utm_source=MostRead&utm_medium=newsletter&utm_campaign=Oct-29"], "authors": [], "publish_date": "October 31, 2019"}