{"result_id": "246022", "URL": "https://principia-scientific.org/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/", "timestamp": "2023-04-25 16:53:48 CEST+0200", "meta": {"description": "In a recent article, I accepted public health stats on ordinary flu and COV, and showed the insane contradictions in numbers and in government containment strategies. In this article, I take another angle. The CDC has been lying about ordinary flu for decades. So why wouldn’t they continue their fine tradition of lying about COV?", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_eat_wp/favicon.ico", "canonical": "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/", "encoding": "UTF-8"}, "image": null, "domain": "principia-scientific.org", "title": "Coronavirus: if they lied then, why wouldn’t they lie now? | Principia Scientific Intl.", "cleaned_text": "Coronavirus: if they lied then, why wouldn’t they lie now?\n\nIn a recent article, I accepted public health stats on ordinary flu and COV, and showed the insane contradictions in numbers and in government containment strategies.\n\nIn this article, I take another angle. The CDC has been lying about ordinary flu for decades. So why wouldn’t they continue their fine tradition of lying about COV?\n\nWhy should you believe ANYTHING they say about COV? Why should you accept their case numbers, their ominous warnings, their insistence on lockdowns which wreck economies?\n\nIt’s simple. If a boy shows up at a grocery store the first six days of the week and steals an apple every time, when he shows up on the seventh day, why wouldn’t he steal an apple? And if that boy were the de facto president of the United States—enabling him to impose draconian measures on the population—should you trust him?\n\nThe first issue is: how many people in the US die every year from the flu?\n\nThe CDC reshuffles its estimates. It used to parrot an annual figure of 36,000. Recently, it claimed 12,000-61,000 deaths per year.\n\nIn December of 2005, the British Medical Journal (online) published a shocking report by Peter Doshi, which created tremors through the halls of the CDC.\n\nHere is a quote from Doshi’s report, “Are US flu death figures more PR than science?” (BMJ 2005; 331:1412):\n\nYou see, the CDC created one overall category that combines both flu and pneumonia deaths. Why do they do this? Because they disingenuously assume the pneumonia deaths are complications stemming from the flu.\n\nThis is an absurd assumption. Pneumonia has a number of causes.\n\nBut even worse, in all the flu and pneumonia deaths, only 18 revealed the presence of an influenza virus.\n\nTherefore, the CDC could not say, with assurance, that more than 18 Americans died of influenza in 2001. Not 36,000 deaths. 18 deaths.\n\nDoshi continued his assessment of published CDC flu-death statistics: “Between 1979 and 2001, [CDC] data show an average of 1348 [flu] deaths per year (range 257 to 3006).” These figures refer to flu separated out from pneumonia.\n\nThis death toll is obviously far lower than the parroted 36,000 figure.\n\nHowever, when you add the sensible condition that lab tests have to actually find the flu virus in patients, the numbers of flu deaths would plummet even further.\n\nIn other words, it’s promotion and hype.\n\n[Note: Prior to Doshi publishing the above piece about flu deaths, I engaged in a series of emails with him about that issue, and independent researcher, Martin Maloney, made a major contribution to uncovering the CDC deception.]\n\nThe second big issue is: how many people diagnosed with the flu really have the flu?\n\nPeter Doshi again, writing in the online BMJ (British Medical Journal), reveals another monstrosity.\n\nAs Doshi states, every year, hundreds of thousands of respiratory samples are taken from flu patients in the US and tested in labs. Here is the kicker: only a small percentage of these samples show the presence of a flu virus.\n\nThis means: most of the people in America who are diagnosed by doctors with the flu have no flu virus in their bodies.\n\nSo they don’t have the flu.\n\nTherefore, even if you assume the flu vaccine is useful and safe, it couldn’t possibly prevent all those “flu cases” that aren’t flu cases.\n\nThe vaccine isn’t designed to prevent fake flu, unless pigs can fly.\n\nHere’s the exact quote from Doshi’s BMJ review, “Influenza: marketing vaccines by marketing disease” (BMJ 2013; 346:f3037):\n\nBecause most diagnosed cases of the flu aren’t the flu.\n\nSo even if you’re a true believer in mainstream vaccine theory, you’re on the short end here. They’re conning your socks off.\n\nLet me give you a gigantic example of this massive flu-case-counting deception. It involved a flu “epidemic” you might remember called Swine Flu.\n\nIn the late summer of 2009, the Swine Flu epidemic was hyped to the sky by the CDC. The Agency was calling for all Americans to take the Swine Flu vaccine.\n\nThe problem was, the CDC was concealing a scandal.\n\nAt the time, star CBS investigative reporter, Sharyl Attkisson, was working on a Swine Flu story. She discovered that the CDC had secretly stopped counting US cases of the illness—while, of course, continuing to warn Americans about its unchecked spread.\n\nUnderstand that the CDC’s main job is counting cases and reporting the numbers.\n\nWhat was the Agency up to?\n\nHere is an excerpt from my 2014 interview with Sharyl Attkisson:\n\nRappoport: In 2009, you spearheaded coverage of the so-called Swine Flu pandemic. You discovered that, in the summer of 2009, the Centers for Disease Control, ignoring their federal mandate, [secretly] stopped counting Swine Flu cases in America. Yet they continued to stir up fear about the “pandemic,” without having any real measure of its impact. Wasn’t that another investigation of yours that was shut down? Wasn’t there more to find out?\n\nAttkisson: The implications of the story were even worse than that. We discovered through our FOI efforts that before the CDC mysteriously stopped counting Swine Flu cases, they had learned that almost none of the cases they had counted as Swine Flu was, in fact, Swine Flu or any sort of flu at all! The interest in the story from one [CBS] executive was very enthusiastic. He said it was “the most original story” he’d seen on the whole Swine Flu epidemic. But others pushed to stop it [after it was published on the CBS News website] and, in the end, no [CBS television news] broadcast wanted to touch it. We aired numerous stories pumping up the idea of an epidemic, but not the one that would shed original, new light on all the hype. It [Attkisson’s article] was fair, accurate, legally approved and a heck of a story. With the CDC keeping the true Swine Flu stats secret, it meant that many in the public took and gave their children an experimental vaccine that may not have been necessary.\n\nIt was routine for doctors all over America to send tissue samples from patients they’d diagnosed with Swine Flu, or the “most likely” Swine Flu patients, to labs for testing. And overwhelmingly, those samples were coming back with the result: not Swine Flu, not any kind of flu.\n\nThat was the big secret. That’s what the CDC was hiding. That’s why they stopped reporting Swine Flu case numbers. That’s what Attkisson had discovered. That’s why she was shut down.\n\nBut it gets even worse.\n\nBecause about three weeks after Attkisson’s findings were published on the CBS News website, the CDC, obviously in a panic, decided to double down. If one lie is exposed, tell an even bigger one. A much bigger one.\n\nHere, from a November 12, 2009, WebMD article is the CDC’s response: “Shockingly, 14 million to 34 million U.S. residents — the CDC’s best guess is 22 million — came down with H1N1 swine flu by Oct. 17 [2009].” (“22 million cases of Swine Flu in US,” by Daniel J. DeNoon).\n\nAre your eyeballs popping? They should be.\n\nIn the summer of 2009, the CDC secretly stops counting Swine Flu cases in America, because the overwhelming percentage of lab tests from likely Swine Flu patients shows no sign of Swine Flu or any other kind of flu.\n\nThere is no Swine Flu epidemic.\n\nThen, the CDC estimates there are 22 MILLION cases of Swine Flu in the US.\n\nSo…the premise that the CDC would never lie about important matters like, oh, a vaccine causing autism…you can lay that one to rest.\n\nThe CDC will lie about anything it wants to. It will boldly go where no person interested in real science will go.\n\nIt will completely ignore its mandate to care about human health, and it will get away with it—as long as people are willing to accept falsehoods instead of the truth, as long as people would rather cling to what authority figures tell them.\n\nAnd now, with the CDC spearheading the operation called COVID-19—from confirmation of the discovery of a “new virus,” to guidelines for diagnostic testing in patients, to case number counts, to containment policies, lockdowns that wreck economies and lives—do you really want to believe what they say?\n\nThey went to the grocery store and stole an apple every day. Then they turned around and said the grocery store could only admit ten people at a time. Then they shut down the city around the grocery store.\n\nThey sit high above the city looking out the window while they eat the apples.\n\nAbout the author: Jon Rappoport is the author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe.\n\nPRINCIPIA SCIENTIFIC INTERNATIONAL, legally registered in the UK as a company incorporated for charitable purposes. Head Office: 27 Old Gloucester Street, London WC1N 3AX .\n\nPlease DONATE TODAY To Help Our Non-Profit Mission To Defend The Scientific Method.", "opengraph": {"locale": "en_US", "site_name": "Principia Scientific Intl. | A science-based community", "type": "blog", "title": "Coronavirus: if they lied then, why wouldn’t they lie now? | Principia Scientific Intl.", "description": "In a recent article, I accepted public health stats on ordinary flu and COV, and showed the insane contradictions in numbers and in government containment strategies. In this article, I take another angle. The CDC has been lying about ordinary flu for decades. So why wouldn’t they continue their fine tradition of lying about COV?", "url": "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/", "image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fupload.wikimedia.org%2Fwikipedia%2Fcommons%2Fthumb%2F7%2F71%2FUS_CDC_logo.svg%2F1200px-US_CDC_logo.svg.png&f=1&nofb=1", "image:secure_url": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fupload.wikimedia.org%2Fwikipedia%2Fcommons%2Fthumb%2F7%2F71%2FUS_CDC_logo.svg%2F1200px-US_CDC_logo.svg.png&f=1&nofb=1"}, "tags": [], "tweets": [], "movies": [], "links": ["https://blog.nomorefakenews.com/2020/03/26/corona-the-case-number-game/", "https://www.cdc.gov/flu/about/burden/index.html", "https://blog.nomorefakenews.com/2020/03/26/corona-if-they-lied-then-why-wouldnt-they-lie-now/", "http://marketplace.mybigcommerce.com/the-matrix-revealed/", "http://marketplace.mybigcommerce.com/exit-from-the-matrix/", "http://marketplace.mybigcommerce.com/power-outside-the-matrix/", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=twitter", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=facebook", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=telegram", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=custom-1654796357", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=linkedin", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=reddit", "mailto:?subject=%5BShared%20Post%5D%20Coronavirus%3A%20if%20they%20lied%20then%2C%20why%20wouldn%E2%80%99t%20they%20lie%20now%3F&body=https%3A%2F%2Fprincipia-scientific.com%2Fcoronavirus-if-they-lied-then-why-wouldnt-they-lie-now%2F&share=email", "#", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=pinterest", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=pocket", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=tumblr", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=skype", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/?share=jetpack-whatsapp", "https://principia-scientific.com/coronavirus-if-they-lied-then-why-wouldnt-they-lie-now/#print"], "authors": [], "publish_date": "March 31, 2020"}