{"result_id": "249036", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5725", "timestamp": "2023-04-25 16:54:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5725", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Digital ID Will Merge Your Identity & Reputation Into Trust Scores", "cleaned_text": "\"Trust Scores\" or reputational scores are aspects of having a digital identity that haven't been discussed much. By default, everyone who accepts a digital identity, whether decentralised or not, will receive a Trust Score.\n\nWith the introduction of trusted digital identities, social credit systems are reaching the West.\n\nThe tagline of many digital identity advertisements is \"At the heart of all digital identity is trust.\" But what does that even mean?\n\nOne current definition of trust is that it is \"a confident relationship with the unknown.\"\n\n\"Digital identity is a collage of up-to-date digital data that defines an individual, dynamic, multipurpose, and reusable, a system for verifying information to establish eligibility to access a service, perform a task, or receive a benefit, resulting from a dynamic network of distributed, data sources (such as financial institutions, mobile network providers, governments) that verifies identity in real time.\"\n\nDigital identity solutions are being rolled out under the title \"Trusted Digital Identity\", which enables people, businesses, and governments to have confidence in digital interactions.\n\nAt both ends of the interaction, digital identity is about establishing confidence and trust. Both parties must be confident that the other party is who they claim to be. Both require trust in the system that mediates the interaction.\n\nWhen a new customer registers for a digital identity (officially called onboarding) such as mobile identity provider Prove, they enter their mobile number.\n\nUsing mobile networks, Prove's mobile authentication checks if the activity is coming from the expected device using the mobile number.\n\nBy checking the following: Mobile Network, Device Status, Prepaid Sim, Sim Velocity, Device and Sim Tenure and finally Port Date, Prove's Trust Score determines the dynamic contextual and behavioural risk level of the mobile number.\n\nTrust Scores range from 0-1000, with a higher number indicating a higher Trust Score. Scores over 630 are considered 'high', and scores below 300 are considered 'low'.\n\nA Trust Score risk model examines phone intelligence signals such as phone tenure (SIM tenure, device tenure), line attributes (active number, number porting, mobile status, available network status, and line type), account activity (change event occurrence velocity), and device activity (device ownership tenure) to determine risk level.\n\nA new customer's identity is also verified by verifying their mobile number with parameters such as their name, address, date of birth, and email address.\n\nAt the end, the process compares against data sources such as phone intelligence signals and Consumer Reporting Agencies like Credit Reporting Agencies, Banks, Utilities, Telcos, and Mobile Network Operators.\n\nIn summary, there are three steps: Mobile Auth, Trust Score, and Identity Verification.\n\nIdentity validation has traditionally been a yes or no decision, whereas new digital identity systems use Trust Scores, which act as identity quotients.\n\nWhen one needs to fly across the globe during a trip, you most likely share identity with several organizations, leaving you vulnerable to identity theft.\n\nFurthermore, not all organizations have systems to validate the authenticity of the documents provided, so Earth ID allows you to share specific information securely.\n\nThe level of a Trust Score allows organizations to make better decisions whether at the airport check-in, security, car rental, or even at the hotel.\n\nThe score goes up if other people have had a positive experience with a given user. The opposite is true if prior partners have not enjoyed their interactions.\n\n\"By 2030, we'll see, for example, credit scoring expanding into 'life scoring'. Identity and reputation will be digitized & analyzed in minute detail, shaping a future where a personal 'trust score' will be the norm.\n\nThe WEF calls it a 'life score': They wrote in \"Trust in 2030 - from institutions to individuals\":\n\n\"By 2030, we'll see, for example, credit scoring expanding into 'life scoring'. Identity and reputation will be digitized and analyzed in minute detail, shaping a future where a personal 'trust score' will be the norm, with all the benefits and drawbacks that might bring.\"\n\nThe WEF say that:\n\n\"It's already underway in China, where, in a pilot scheme, citizens are being given a Social Citizen Score based on individual actions. Their simple everyday choices - from their shopping selections or patterns of bill payment to their choice of friend - all go towards influencing that score, whether the person is aware of it or not.\"\n\n\"Fair or unfair, the results will be on permanent record.\"\n\nAdding: \"It's easy to imagine a similar system becoming universal.\"\n\nFujitsu is also developing a blockchain-based Decentralized Identity (DID) platform to boost trust in digital transactions.\n\nFujitsu say they will convert those Trust scores into a simple graph, making it easy for people to assess the trustworthiness of another party before performing an exchange.\n\nEach digital identity and transaction comes with a Trust Score by default.\n\nAs part of these digital identity systems, citizens are given an individual score based on their behaviors and actions, with non-state approved behavior potentially preventing citizens from doing basic tasks like buying a ticket if their trust score is too low.\n\nDigital Identity and Attributes Trust Framework is what it is called. Framework for trust. The framework paves the way for a digital identity trust framework.\n\n\"It has become increasingly important in this digital age to be able to establish trust, particularly online. This is the foundation thriving markets are built on. Having an agreed digital identity that you can use easily and universally will be the cornerstone of future economies.\"\n\n\"I want the trust framework to help facilitate a clear understanding between people using identity products, the organizations relying on the service and the service providers, letting each party know data is being used appropriately and kept safe.\" - he added.\n\nAccording to Mastercard its about:\n\n\"A world where trust can be easily established, and people can be easily recognized in order to gain access to the services or experiences they desire.\"\n\nWith Onfido, another digital identity provider, again they run identity record checks, watch-list checks, and automated ongoing monitoring using a library of trusted sources of data.\n\nWatchlist Checks? Yes Onfido's solution is \"constantly drawing from multiple sanctions, politically exposed persons (PEPs), and other data sources.\"\n\nThe trust scores will be checked and recorded using AI and machine learning and permanently recorded on the blockchain. No recourse or complaint procedure is available.\n\nWe have heard the word Trust associated with digital identity and vaccine passports, but where else?\n\nRemember the Trust Stamp program which was launched in late 2018? As part of the GAVI-Mastercard initiative \"Wellness Pass\", Trust Stamp's advanced digital identification technology was integrated.\n\nThe Trust Stamp was funded by Bill Gates and implemented by Mastercard and GAVI to link your biometric digital identity to your vaccination records. People who do not wish to be vaccinated may be locked out of the system based on their trust score.\n\nThe Government of India's DigiYatra programme will facilitate paperless travel and eliminate multiple identity checks at the airport, enabling seamless and hassle-free travel. It is a Biometric Enabled Seamless Travel Experience (BEST) based on Facial Recognition Technology.\n\nSince the DigiYatra Biometric Boarding System is integrated with the identity document, passengers will no longer need to show their tickets / boarding passes and their physical Identity cards at the checkpoints of the Airport.\n\nEach passenger will need less than three seconds at each touchpoint, which will make the boarding process significantly faster and more seamless.\n\n\"Their face would act as their documents, like ID proof, Vaccine proof and act as boarding pass. At each checkpoint your trust score is examined by biometric face scans.\"\n\nThere is a lot of talk about reducing identity fraud, but what happens if you have a low trust score, what happens when you are refused services based on your trusted digital identity score? What happens if you become the victim of identity fraud and are no longer able to access so-called vital trusted services?\n\nThe default configuration of digital identity networks creates a threat like Matrix ID that brings together data such as risk associated with the identity, what is normal behavior and what is unusual behavior, and aims to create a trust score.\n\nTrust ratings will most likely be a reincarnation or a revamped version of the Chinese Social Credit System. There will be a merger between digital identity and new social credit systems.\n\nWe are on the road to Beijing, and we should all be apprehensive.", "opengraph": {"title": "Digital ID Will Merge Your Identity & Reputation Into Trust Scores", "type": "article", "description": "According to the WEF: ", "image": "images/recent/digitalidentity1.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/digitalidentity1.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/2022/08/digital-identity-whats-your-trust-score.html", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}