{"result_id": "249027", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4872", "timestamp": "2023-04-25 16:54:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4872", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Vaccine Mandate To Purge Conservatives From Federal Government?", "cleaned_text": "The fateful decision that Joe Biden just made will have consequences for many years to come. On Thursday, we learned that the Biden administration is going to require all employees of the federal government to either be vaccinated or to \"submit to regular testing and mitigation requirements\".\n\nNeedless to say, there are large numbers of federal employees that will never take a COVID vaccine under any circumstances, and most of them are Republicans.\n\nIn fact, a recent Washington Post survey found that less than 5 percent of Democrats say that they will definitely not get a COVID vaccine, but for Republicans the number was nearly 40 percent. So as federal employees start quitting over this new mandate, the vast majority of those that will be leaving will be conservatives.\n\nAnd we aren't talking about a small number of people. Today, there are millions of Americans that work directly for the federal government...\n\nThe federal government numbers include active duty military personnel and U.S. Postal Service workers. The U.S. military has about 1.4 million active duty service members and another 800,000 reserve forces. There are approximately 800,000 postal workers.\n\nBeyond the military and the postal service, 2 million people--just over 1% of the U.S. workforce or 0.6% of the total population--are permanently employed by the federal government. More than 70% of the federal workforce serves in defense and security agencies like the Department of Defense, the intelligence community agencies, and NASA.\n\nWhen I first learned about this, I was stunned that the Biden administration would be willing to go this far.\n\nBut apparently this is really happening.\n\nThe president's comments, which echoed those of his press secretary hours earlier, came one day after the Department of Veterans Affairs announced it will require its front-line health care workers to be vaccinated against COVID-19.\n\nThis is how the Biden administration operates.\n\nFirst they float something to evaluate public reaction, and then they do it.\n\nSo how many federal employees will quit their jobs due to this new mandate?\n\nWill it be thousands?\n\nWill it be tens of thousands?\n\nCould it be hundreds of thousands?\n\nWhat we do know is that the number of Republicans that will quit will be far greater than the number of Democrats that will quit, and that could fundamentally alter the composition of the federal workforce for many years to come.\n\nI think that it will all come down to the nature of the \"regular testing and mitigation requirements\". If those requirements are not too burdensome, the number of federal workers that quit may be relatively low. But if those requirements turn out to be quite painful, I could see very large numbers of employees quitting.\n\nOn Tuesday we also learned that the CDC has decided that it is time for all Americans to start wearing masks again...\n\nThe Centers for Disease Control and Prevention recommended Tuesday that fully vaccinated people begin wearing masks indoors again in places with high Covid-19 transmission rates. The agency is also recommending kids wear masks in schools this fall.\n\nFederal health officials still believe fully vaccinated individuals represent a very small amount of transmission. Still, some vaccinated people could be carrying higher levels of the virus than previously understood and potentially transmit it to others.\n\nThis seems rather odd, because we were promised that life would go back to normal for those that got their shots.\n\nBut it turns out that vaccinated individuals that catch COVID \"have just as much viral load as the unvaccinated\"...\n\nCDC Director Rochelle Walensky said recent studies had shown that those vaccinated individuals who do become infected with Covid have just as much viral load as the unvaccinated, making it possible for them to spread the virus to others. Based on that finding, Walensky said the CDC is also recommending that all school children wear masks in the fall.\n\nAnd in California, officials have discovered a very curious pattern...\n\nA new analysis finds several counties with above-average vaccination rates also have higher COVID case rates, while case rates are falling in counties with below-average vaccination rates.\n\nStatewide data analyzed by the Bay Area News Group found five counties, Los Angeles, San Diego, Alameda, Contra Costa, and San Francisco, have both a higher percentage of people who are fully vaccinated than the state average and a higher average daily case rate.\n\nAll of this appears to directly contradict a lot of the promises that our leaders were making.\n\nSo what is the truth?\n\nThis pandemic is far from over, and it is just a matter of time before even more \"pestilences\" come along.\n\nSadly, global leaders have responded to this current \"pestilence\" by resorting to full-blown tyranny.\n\nThe Biden administration knows that there are huge numbers of conservatives that would quit their jobs rather than be bullied into taking a COVID vaccine.\n\nBut they are going ahead with this mandate anyway.\n\nAnd now that the federal government has done this, it is probably inevitable that countless other employers will follow suit.", "opengraph": {"title": "Vaccine Mandate To Purge Conservatives From Federal Government?", "type": "article", "description": "A recent Washington Post survey found that less than 5 percent of Democrats say that they will definitely not get a COVID vaccine, but for Republicans the number was nearly 40 percent.  So as federal employees start quitting over this new mandate, the vast majority of those that will be leaving will be conservatives.", "image": "images/recent/bidencovidjuly312021.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/bidencovidjuly312021.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://endoftheamericandream.com/are-we-about-to-see-the-biggest-purge-of-conservatives-from-all-levels-of-the-federal-government-in-u-s-history/", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}