{"result_id": "249003", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4003", "timestamp": "2023-04-25 16:54:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4003", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Will 'Immunity Passports' Become Mandatory In Our Future?", "cleaned_text": "Bill Gates has inserted himself into the national dialogue as a self-proclaimed coronavirus sage who will lead the world out of dark times through a digitally-assisted brave new world of testing, contact tracing, and of course - a vaccine.\n\nOf course, some of this might not be such a bad idea if it wasn't coming from Gates, who's written an op-ed in the Washington Post to elaborate on his thoughts - which makes the whole thing seem even more nefarious.\n\n'Sure, my Dad was on the board of planned parenthood - an organization founded by a eugenicist, and yes, I've talked about the need for population reduction for years. And sure, I want you to take my vaccines and get chipped. And yeah, there was that whole 'coronavirus pandemic' war-game simulation my foundation spearheaded late last year which modeled 65 million dead. BUT, hear me out...'\n\nAll jokes aside, here's what Gates proposes in his WaPo Op-Ed in order to 'reopen the economy.'\n\nWidespread, at-home testing - \"We can't defeat an enemy if we don't know where it is,\" says Gates, who advocates home testing kits which \"produces results that are just as accurate\" as nasal swabs performed by healthcare professionals. Ok, not evil. Probably a good idea.\n\nChoosing who to test - Essential workers and symptomatic people, or those who have been in contact with someone who tested positive, should be prioritized, otherwise \"we're wasting a precious resources and potentially missing big reserves of the virus.\" Asymptomatic people who aren't in the above categories should not be tested until there are enough tests, according to Gates. Again, not a terrible idea.\n\nUsing technology to enable a surveillance state - ah, here we go. Gates says the United States needs to follow Germany's example; \"interview everyone who has tested positive and use a database to ensure someone follows up with all their contacts.\" And how to ensure accuracy? Digital big brother tools!\n\nAn even better solution would be the broad, voluntary adoption of digital tools. For example, there are apps that will help you remember where you have been; if you ever test positive, you can review the history or choose to share it with whoever comes to interview you about your contacts.\n\nAnd some people have proposed allowing phones to detect other phones that are near them by using Bluetooth and emitting sounds that humans can't hear. If someone tested positive, their phone would send a message to the other phones, and their owners could get tested. If most people chose to install this kind of application, it would probably help some. -Bill Gates\n\nGates suggests this would be voluntary, unlike South Korea - which forces COVID-19 positive patients to self-isolate and install a tracking app on their smartphones which will alert authorities when an infected person has left their home, while warning them to return immediately. Admittedly, South Korea - which also employed widespread testing and the use of face masks, has had just under 11,000 confirmed cases and 240 deaths.\n\nTreatment options - Gates notes that while hydroxychloroquine has 'received a lot of attention,' his foundation is funding a clinical trial which will determine if it works on COVID-19 by the end of May, and that \"it appears the benefits will be modest at best,\" despite overwhelming anecdotal evidence of its efficacy by doctors using it in the field.\n\nWe're guessing Gates' trial doesn't include the use of zinc, much like most of the other studies which are 'proving' that the anti-malaria drug doesn't work. This is disingenuous science, as HCQ acts as an 'iononpore' which allows zinc into infected cells, disrupting virus replication. On its own, HCQ only allows low levels of zinc to enter cells, vs. the high-dose cocktail employed by doctors such as Vladimir Zelenko, who claims he's cured over 700 patients with the combination.\n\nGates, meanwhile, is promoting the use of plasma therapy, which involves \"drawing blood from patients who have recovered from covid-19, making sure it is free of the coronavirus and other infections, and giving the plasma (and the antibodies it contains) to sick people. Several major companies are working together to see whether this succeeds.\"\n\nAnother treatment he's proposing is synthesizing antibodies that are \"most effective against the novel coronavirus,\" which may face manufacturing constraints.\n\nIf you want to get back to large gatherings, we need a vaccine! Perhaps, but immeasurably more creepy coming from Gates considering his history.\n\nEvery additional month that it takes to produce a vaccine is a month in which the economy cannot completely return to normal.\n\nThe new approach I'm most excited about is known as an RNA vaccine. (The first covid-19 vaccine to start human trials is an RNA vaccine.) Unlike a flu shot, which contains fragments of the influenza virus so your immune system can learn to attack them, an RNA vaccine gives your body the genetic code needed to produce viral fragments on its own. When the immune system sees these fragments, it learns how to attack them. An RNA vaccine essentially turns your body into its own vaccine manufacturing unit. -Bill Gates\n\nGates then says that distributing vaccines will be the next hurdle - and that governments which fund vaccine development, countries which test the vaccines, and hardest-hit regions \"will all have a good case that they should receive priority,\" and that \"Ideally, there would be a global agreement about who should get the vaccine first.\"\n\nIn short - get tracked, don't trust hydroxychloroquine, and take the shot.", "opengraph": {"title": "Will 'Immunity Passports' Become Mandatory In Our Future?", "type": "article", "description": "Bill Gates has inserted himself into the national dialogue as a self-proclaimed coronavirus sage who will lead the world out of dark times through a digitally-assisted brave new world of testing, contact tracing, and of course - a vaccine.", "image": "images/recent/passportapril272020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/passportapril272020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/2020/04/bill-gates-continues-to-push-immunity-passports-and-tech-enabled-surveillance-state-to-combat-covid.html", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}