{"result_id": "249010", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4448", "timestamp": "2023-04-25 16:54:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4448", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "The Government May Not Make Covid Vaccinations Mandatory But Your Employer Might", "cleaned_text": "A COVID vaccine is not even available yet, but the mainstream media is already full of stories about whether or not it is legal for employers to fire employees that refuse to take it. To me, this is not even a debate that we should be having. It would be fundamentally anti-American and morally reprehensible for any employer to fire someone for choosing not to get vaccinated.\n\nUnfortunately, the mainstream media does not see things that way, and they are interviewing lots of legal experts that are assuring employers that it is perfectly legal to fire people that don't want to get vaccinated. For example, the following comes from a CNBC article...\n\n\"In general, yes, employers are able to mandate the vaccine when it becomes available with, of course, a bunch of caveats,\" says employment lawyer Lindsay Ryan, listing possible exemptions for those with specific medical conditions and those with sincerely held religious convictions.\n\nIf religious convictions really did protect employees, that would be great.\n\nFrom my perspective, any employee that refuses to get vaccinated based on a sincerely held religious conviction should definitely be shielded from being fired under federal law.\n\nUnfortunately, the CNBC article goes on to explain why federal law is probably not going to protect any person of faith from mandatory vaccination requirements...\n\nRyan emphasizes that state laws regulating what constitutes reasonable accommodations for religious groups vary significantly, but that \"under federal law, employers don't have to grant a religious accommodation if doing so would result in more than a de minimis cost to the operation of the business.\"\n\n\"De minimis\" is Latin for \"of minimum importance\" and is used in law to refer to a total so small that it is not even recognized. Given how significantly the pandemic has impacted businesses, Ryan says \"this is a pretty low standard.\" Meaning, many employers will likely have legal ground to require vaccination.\n\nIn other words, under federal law there is hardly any protection at all for workers that wish to refuse the COVID vaccine.\n\nOther major news outlets have been publishing similar stories. This excerpt comes from a piece that was published by Reuters...\n\nGostin and five other health law experts said private companies in the United States have broad liberties to set health and safety standards, which would allow them to mandate vaccinations as a condition of employment with some exceptions.\n\nIt is almost as if there is a coordinated effort to make employers across the country aware that they can issue such mandates.\n\nA little over a decade ago, the U.S. Occupational Safety and Health Administration ruled that employers could make vaccines mandatory during the swing flu pandemic, but of course that crisis faded rather rapidly and so very few employers actually went in that direction.\n\nBut now it appears that COVID-19 is going to be with us for quite a while, and some employers have already decided that they are going to make vaccination mandatory for all employees...\n\nJust a few months into the coronavirus pandemic, Holly Smith had already made up her mind. She was not going to reopen her restaurant to diners until there was a vaccine. She just didn't think it was safe. When she shared the decision with her staff, they asked: Would the vaccine be mandatory?\n\nYes, she said. It would be.\n\n\"I'm not going to open until I can indeed be sure that everyone on my staff is vaccinated,\" says Smith, chef and owner of Cafe Juanita in Kirkland, Wash. \"The immediate people on the team -- you've got to take care of them. If you don't take care of them, they cannot help you take care of business.\"\n\nIf some of her employees do not want to take the vaccine, they will be hitting the bricks.\n\nAnd as I have detailed repeatedly in recent weeks, it is not easy to find another job in this economy.\n\nThe good news is that most employers will likely be hesitant to mandate vaccines because of the potential of pushback from their employees. According to a recent Gallup survey, 42 percent of all Americans do not plan to get a COVID-19 vaccine...\n\nAmericans' willingness to be vaccinated against COVID-19 rebounded a bit in October, as seen in Gallup polling conducted before Pfizer/BioNTech and Moderna made promising announcements about the likely effectiveness of their coronavirus vaccines.\n\nFifty-eight percent of Americans in the latest poll say they would get a COVID-19 vaccine, up from a low of 50% in September.\n\nIt is estimated that there are 328 million people living in the United States right now, and 42 percent of 328 million is 137 million.\n\nIf those 137 million people stand up for their God-given rights, we almost certainly will not see widespread vaccine mandates.\n\nBut will they?\n\nWe shall see.\n\nIn the months ahead, there is going to be so much public pressure to get vaccinated, and the CDC plans to aggressively promote their vaccination campaign.\n\nThey even plan to distribute \"buttons or stickers\" so that people that have been injected can advertise that fact to others...\n\nThe Centers for Disease Control and Prevention is planning to offer health care providers a template they can use to print buttons or stickers that would advertise a person's vaccination status. The idea is that the button would be handed out to patients after they receive their vaccination shots.\n\nThe effort is part of a \"toolkit\" that the CDC plans to provide healthcare systems to \"educate and promote vaccination,\" a CDC spokesperson told ABC News.\n\nIn addition, within the past few days Barack Obama, George W. Bush, Bill Clinton and Joe Biden have all committed to being vaccinated publicly...\n\nPresident-elect Joe Biden said he would publicly take a vaccine when it's available to encourage the public to get vaccinated, joining three former presidents who recently pledged to do the same.\n\nBiden said he'd \"be happy\" to join former Presidents Barack Obama, George W. Bush and Bill Clinton in getting the vaccine in public to prove it is safe.\n\nThat would seem to be quite a public relations coup for the pharmaceutical companies, but if any of them has any sort of an adverse reaction to the vaccine it will rapidly transform into a public relations nightmare.\n\nOf course the truth is that nobody really knows what the long-term side effects of taking COVID vaccines will be for the population as a whole.\n\nAs I have discussed previously, this entirely new class of mRNA vaccines has never been tried before, and those that line up first to get a COVID vaccine will be the guinea pigs.", "opengraph": {"title": "The Government May Not Make Covid Vaccinations Mandatory But Your Employer Might", "type": "article", "description": "A COVID vaccine is not even available yet, but the mainstream media is already full of stories about whether or not it is legal for employers to fire employees that refuse to take it.", "image": "images/recent/vaccinedec072020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/vaccinedec072020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://theeconomiccollapseblog.com/archives/can-employers-fire-any-of-their-workers-that-decide-not-to-take-the-covid-vaccine", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}