{"result_id": "249006", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5100", "timestamp": "2023-04-25 16:54:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5100", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "It Begins - Merging Vaccine Passports With Implantable Microchips", "cleaned_text": "Things are starting to get really weird. What I am about to share with you sounds very strange, but it is all true. Before I get into it, let me ask you a question. If you could have a vaccine passport permanently embedded into your hand, would you do it?\n\nAmazingly, some people in Sweden are willingly doing this to themselves. They are putting microchips that contain their vaccine passport information into their hands, and they are raving about how convenient this is.\n\nYou can actually watch a video of this being done to someone right here. The video is not in English, but you will be able to understand what is happening.\n\nI was absolutely floored when I first watched that.\n\nDo they not understand where this could lead?\n\nSociety is increasingly being divided into two classes of people, and the class of people that is willingly conforming is being granted many \"privileges\" that the other group is being denied.\n\nMany believe that this is \"just a phase\" and that things will eventually go back to normal.\n\nBut the truth is that this is not \"just a phase\" at all.\n\nFor a long time, health authorities were promising us that if we all did exactly what they asked that the pandemic would come to an end.\n\nUnfortunately, now they are openly admitting that COVID is going to be with us permanently...\n\nThe White House's chief medical adviser, Anthony Fauci, says it's unlikely that the Covid-19 coronavirus will ever be wiped out, and insists the world is just going to have to start living with it.\n\nDuring an interview with CBS's 'Face the Nation' on Sunday, Fauci said he didn't believe Covid-19 was ever going to entirely go away. He noted that the world had only ever eliminated one infection completely: smallpox.\n\n\"We're going to have to start living with Covid. I believe that's the case because I don't think we're going to eradicate it,\" Fauci told CBS.\n\nIf we are \"going to have to start living with COVID\", that means that all of the infrastructure that they are now putting in place will be with us from now on.\n\nThat means that there isn't going to be an end to the vaccine passports, the mandates or the injections.\n\nIn fact, the CEO of Pfizer says that \"we're going to have an annual revaccination\"...\n\n\"I think we're going to have an annual revaccination and that should be able to keep us really safe.\"\n\nYou are going to keep getting shots year after year after year in order to keep earning the \"privileges\" that you have been granted.\n\nThey want to make their authoritarian measures a permanent part of our lives, and this is what our society is going to look like from now on unless we take a stand.\n\nThe good news is that some courts here in the United States are starting to reject the mandates that Joe Biden tried to implement. On Monday, a federal court blocked Biden's mandate for health care workers in 10 states, and on Tuesday a different court blocked that same mandate on a nationwide basis...\n\nA federal court has issued a nationwide injunction protecting health care workers across the country from Joe Biden's COVID vaccine mandate.\n\nYesterday, in response to a multi-state lawsuit led by Missouri, a federal court barred the Biden administration from enforcing a vaccine mandate for health care workers in 10 states who are employed at federally-funded health care clinics. That means they doctors and nurses can't be fired for refusing the COVID vaccine despite Biden's federal mandate requiring them to get it.\n\nToday, a federal court in Louisiana expanded on that ruling and blocked the vaccine mandate nationwide.\n\nBut just because they have a legal setback or two does not mean that they are going to stop trying.\n\nOver in Germany, it is being reported that incoming Chancellor Olaf Scholz wants to impose a vaccine mandate on every single German starting in February...\n\nGermany's incoming Chancellor Olaf Scholz is in favor of introducing mandatory coronavirus vaccination for all Germans as early as February, an official close to Scholz said.\n\nDuring a crisis meeting Tuesday between the outgoing government of Chancellor Angela Merkel and the premiers of the German federal states, Scholz \"signaled his sympathy for such a regulation,\" the official told POLITICO.\n\nSuch a measure would have to be approved by the German Bundestag, the official said, adding that the mandatory vaccination could come \"at the beginning of February.\"\n\nOther major industrialized nations are considering similar measures.\n\nOnce vaccines become mandatory for an entire population, vaccine passports will be absolutely necessary for anyone that still wants to live anything that even resembles a \"normal life\".\n\nWhether it is on your phone, on a card that you show or actually embedded in your skin, you will need to take it with you wherever you go in case you are stopped by law enforcement authorities.\n\nDoes any of this sound eerily familiar? It should. The Book of Revelation describes a similar system whereby the people of the world are forced to receive a mark on their right hand or forehead. Those who refuse to comply will be unable to buy or sell. They'll effectively be cut off from society.\n\nAre COVID vaccines the mark of the beast written about in the Book of Revelation? No. The mark of the beast will involve a conscious decision to give one's allegiance to the Antichrist. No one will accept it by mistake or for purely health reasons alone.\n\nNevertheless, vaccine mandates and passports create a social system enabling the mark of the beast. If they are allowed to stand, they will create a mark of the beast system indistinguishable in impact from the true mark of the beast. In doing so, they'll pave the way for the rise of the Antichrist and the mark of the beast as outlined in the Book of Revelation.", "opengraph": {"title": "It Begins - Merging Vaccine Passports With Implantable Microchips", "type": "article", "description": " If you could have a vaccine passport permanently embedded into your hand, would you do it? \r\n Amazingly, some people in Sweden are willingly doing this to themselves and they are raving about how convenient this is.  ", "image": "images/recent/markofthebeastmarch282019.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/markofthebeastmarch282019.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prophecynewswatch.com/product.cfm?product_id=16", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}