{"result_id": "249039", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5855", "timestamp": "2023-04-25 16:54:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5855", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Global Elites Plan For Next Pandemic At Davos With Digital Vaccination Tracking", "cleaned_text": "The World Economic Forum’s Davos discussions often require some 'reading between the lines' to understand what is really being said by the globalist participants, but not much interpretation is needed these days.\n\nEver since the pandemic event, along with the lockdowns and the attempts to introduce vaccine passports, establishment representatives have been far more open about their agenda and their intentions for the future.\n\nAfter all, it was Klaus Schwab who called covid a 'rare but narrow window of opportunity' to implement the 'Great Reset' of the current economic and political order. The past few years have shown that the Davos crowd still clings to the fading pandemic panic as the “good old days” when they could have had anything they wanted, including total centralization.\n\nThe globalists continue to refuse to address their many failures, but panels like the following say it all – They realize that the truth has hit the mainstream and far too many people are now questioning the validity of the restrictions, mandates, masks and the mRNA vaccines.\n\nAll of these measures have proven to be mostly useless in preventing viral spread, and now the negative side effects of the vaccines are being admitted to, at least to a point. All in all, the pandemic was not the golden opportunity that Klaus Schwab and the WEF expected.\n\nTheir hopes and dreams now turn to a future pandemic, perhaps one with a far higher death rate that creates more exploitable public fear.\n\nOf special note in this panel, which includes former British PM Tony Blair and current head of Pfizer Albert Bourla, are comments made about the lack of unified agreement on political response. They do not go into detail here, but they may be referring to the refusal of some governments to pursue ongoing mandates and vaccine passports.\n\nPublic resistance to such actions led directly to apprehension among government officials as to how far they could push their luck. Clearly, they decided they were playing with fire because many of these leaders backed off. It was as if someone flipped a switch and the covid doom mongering suddenly slowed to a mere flicker of its former intensity.\n\nThe group concludes that global institutions in the future need to put constant pressure on governments and, ostensibly, constant pressure on national populations in order to get the results they desire.\n\nBy extension, Africa is mentioned a few times during the panel as an example of the need for “equity” in pandemic response. What they don’t talk about is Africa’s lack of covid deaths despite around 65% of the continent being unvaccinated according to the New York Times world vaccine tracker. The African example as a control group for the unvaccinated has been a thorn in the side of globalists for the past couple years and obviously they want to change that.\n\nAnother very interesting comment is made by Tony Blair, who calls for national digital infrastructure for tracking vaccinations. Blair suggests that to keep various national governments on board with the agenda, they would have to be convinced pandemic issues are 'continuing issues.'\n\nAlbert Bourla addresses the possibility and challenges of producing vaccines in an even faster time frame to respond to new viral events. His conclusion? That regulators need to continue to keep doors open for Big Pharma in terms of expediency even when there is not a pandemic in play.\n\nThe average vaccine takes at least 10 years of study for safety and long-term side effects; the covid vaccines were developed and administered in less than a year under emergency authorization. This new standard of minimized safety obstacles is what Big Pharma and the WEF want for all vaccines and drugs in the future.\n\nBourla then admits to something, in an offhanded way, that many people have suspected: that the biggest challenge in the enforcement of mandates and widespread vaccination was public skepticism. Bourla and others refer to this as the 'politicizing' of the mandates, but it was really just resistance to authoritarianism, and it is something that frustrated globalist planning at every step. This can only be a good thing.\n\nAt no point do the panel participants acknowledge the numerous studies showing the ineffectiveness of masking, the ineffectiveness of the lockdowns, the ineffectiveness of the vaccines, and the risks they entail. The reasons for public resistance are not important to them, only the ways in which they can gain greater compliance during the next viral event.", "opengraph": {"title": "Global Elites Plan For Next Pandemic At Davos With Digital Vaccination Tracking", "type": "article", "description": "The World Economic Forum’s Davos discussions often require some “reading between the lines” to understand what is really being said by the globalist participants, but not much interpretation is needed these days as establishment representatives have been far more open about their agenda and their intentions for the future.\r\n", "image": "images/recent/tracker1b.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/tracker1b.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/2023/01/davos-plans-for-the-next-pandemic-suggests-national-digital-infrastructures-to-track-vaccination.html", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}