{"result_id": "249013", "URL": "http://prophecynewswatch.com/article.cfm?recent_news_id=5108", "timestamp": "2023-04-25 16:54:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "http://prophecynewswatch.com/article.cfm?recent_news_id=5108", "encoding": "UTF-8"}, "image": null, "domain": "prophecynewswatch.com", "title": "The Great Realignment: Millions Of Americans Relocating For Ideological Reasons", "cleaned_text": "We are rapidly becoming two very different nations with two very different cultures. At one time we truly were the \"United\" States of America, but now we have been split into two opposing camps that deeply hate one another.\n\nAs a result, in recent years we have watched millions of Americans relocate for ideological reasons. This has caused \"red states\" to become even redder and \"blue states\" to become even bluer.\n\nAt this point, there are just a handful of \"purple states\", and it is in those states where our presidential elections are determined. It is really not healthy for just a few states like Pennsylvania and Michigan to have such power, but that is a topic for another article.\n\nIn this article, I want to discuss why the mass exodus from blue states to red states is actually going to accelerate in 2022.\n\nRight now, there is no issue in the United States that is more divisive than the COVID vaccine.\n\nMost conservatives want to be able to have the freedom to choose whether to take the injections or not, while many on the left want to use the power of government to compel people to get injected.\n\nIt has truly been frightening to watch many on the left embrace authoritarianism so eagerly, and many leftist politicians just continue to tighten down the screws.\n\nFor example, New York City Mayor Bill de Blasio just decided to impose a very strict vaccine mandate on all private employers in his entire city...\n\nMayor Bill de Blasio announced what he called a first-in-the-nation vaccine mandate for private companies Monday.\n\nHe said the combination of the Omicron variant and holiday gatherings forced him to take \"bold\" steps. He's giving businesses just three weeks to make sure their workers are vaccinated.\n\nIf you don't get the jab, you won't be allowed to keep your job.\n\nThere will not be a \"testing option\" under this new mandate, and so anyone that refuses to comply will be kicked to the curb two days after Christmas...\n\nDe Blasio said the city will release specific rules on Dec. 15, before the mandate takes effect Dec. 27. He said it will apply to in-person employees, but would not provide any details about enforcement. He also said there will not be a weekly testing option.\n\nWe are being told that this new mandate will apply to approximately 184,000 businesses, and that means that vast numbers of New Yorkers will soon be forced to search for greener pastures.\n\nOne of them is a woman named Cynthia. She told a reporter that this mandate gave her yet another reason \"to get the hell out of New York\"...\n\nCynthia, an employee at a Midtown marketing firm who refused to share her last name due to fear of blowback, told the Post that the new requirement is 'another reason' to leave the city.\n\n'Just terrific. Bill de Blasio just gave me another reason I need to get out of New York, or at least find a job that lets me work remotely,' she said.\n\nWhere will thousands upon thousands of displaced New Yorkers like Cynthia go?\n\nOne conservative member of Congress that represents New York fears that many of them will head to \"the free state of Florida\"...\n\n'Mayor de Blasio can't leave fast enough. He has crushed small business, the economy and quality of life. How many more New Yorkers does he want to see move to the free state of Florida?' said US Rep. Nicole Malliotakis, who represents Staten Island and Brooklyn.\n\nSo New York is going to get even bluer in 2022, and Florida will be getting even redder.\n\nDown in Massachusetts, hundreds of hospital workers were just ruthlessly canned because they refused to comply with a vaccine mandate...\n\nAbout 200 UMass Memorial Health employees are out of a job because they missed the health care system's COVID vaccination deadline.\n\nUMass Memorial announced the mandate over the summer with a deadline to get vaccinated or receive an exemption by November 1.\n\nEmployees were let go on December 1 if they did not get the vaccine.\n\nMany of those displaced health workers aren't going to be able to find similar work in Massachusetts, and so they will head to red states.\n\nAs for UMass Memorial Health, I am not sure exactly what they plan to do. You can't just pull people off the streets to be medical professionals. They will probably be short-handed for a long time to come, and that is just going to hurt the people that they are supposed to be serving.\n\nIn Oregon, a different sort of mandate has people thinking that it may be time to relocate.\n\nIf you can believe it, officials in Oregon are actually thinking of making their indoor mask mandate permanent...\n\nThe Oregon Health Authority (OHA) assembled a Rules Advisory Committee (RAC) earlier this week to address a permanent indoor mask mandate in the state. Oregon is one of a few states that still retain one nearly two years into the pandemic.\n\nThe committee included several community stakeholders, including representatives from the hospitality industry, the business sector, and faith communities, according to local ABC affiliate KATU.\n\nI cannot understand why any rational decision maker would want to do such a thing, but apparently they are quite serious.\n\nThere are a whole lot of very conservative people that live in eastern Oregon, and I think that even more of them are going to be moving over the border into Idaho in 2022.\n\nBefore I end this article, I want to mention what Canada has just done.\n\nBeginning November 30th, all unvaccinated individuals are now banned from using any form of public transportation...\n\nIn Canada, any travelers older than 12 years old must show proof of full vaccination to take any form of public transportation including domestic and international flights as well as trains.\n\n\"Starting November 30 at 3:01 am EST, vaccination will be required for travel within and to depart Canada,\" the Canadian travel website states. \"A valid COVID-19 molecular test will no longer be accepted as an alternative to vaccination unless you're eligible for one of the limited exemptions.\"\n\nThe Canadian province of New Brunswick has even allowed grocers to ban unvaccinated food shoppers with the slogan \"No Jab, No Food\".\n\nTrudeau and his minions have completely gone off the deep end, and I feel so sorry for freedom-loving Canadians that are deeply suffering under his regime.\n\nOf course the Biden administration is considering something similar for domestic travel inside the United States.\n\nLet us hope that they never pull the trigger on such a move.\n\nAll over the globe we are seeing governments become more authoritarian\n\nHere in the U.S., countless numbers of freedom-loving Americans are fleeing to red states as they seek to escape the oppression that they have been experiencing in blue states.\n\nUnfortunately, blue state tyrants have no intention of backing down, and this is going to create a tremendous amount of tension in our nation as we head into 2022 and beyond.", "opengraph": {"title": "The Great Realignment: Millions Of Americans Relocating For Ideological Reasons", "type": "article", "description": "In recent years we have watched millions of Americans relocate for ideological reasons.  This has caused ", "image": "images/recent/americadivided2a.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/americadivided2a.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://theeconomiccollapseblog.com/the-great-realignment-countless-more-americans-will-be-moving-from-blue-states-to-red-states-in-2022/", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}