{"result_id": "249045", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5157", "timestamp": "2023-04-25 16:54:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5157", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Covid Passport Microchip Developer Says There Is No Stopping Human Chipping", "cleaned_text": "Towards the end of last year, tech start-up Dsruptive Subdermals announced a microchip installed under the skin that can be scanned to reveal Covid vaccination status.\n\nThe technology was criticized, with many calling it 'invasive.'\n\nIn an interview with Express, the company’s managing director doubled down on the technology and told critics the technology was here to stay.\n\nThe technology is a pre-programmed and scannable implant about the size of a grain of rice. It stores the vaccination information, displaying a person’s Covid-19 vaccine passport when scanned.\n\nSpeaking to Express, Hannes Sjobald, the company’s managing director, said:\n\nThis technology exists and is used whether we like it or not.\n\nI am happy that it is brought into the public conversation.\n\nNew technologies must be broadly debated and understood.\n\nThat is what we are building at Dsruptive and our goal is to transform healthcare on a global scale.\n\nSjobald said the technology makes the vaccine passports more 'accessible.'\n\nThis means it is always accessible for me or for anyone else, really, who wants to read me.\n\nFor example, if I go to the movies or go to a shopping center, then people will be able to check my status even if I don’t have my phone.\n\nOnce vaccines become mandatory for an entire population, vaccine passports will be absolutely necessary for anyone that still wants to live anything that even resembles a \"normal life\".\n\nWhether it is on your phone, on a card that you show or actually embedded in your skin, you will need to take it with you wherever you go in case you are stopped by law enforcement authorities.\n\nDoes any of this sound eerily familiar? It should. The Book of Revelation describes a similar system whereby the people of the world are forced to receive a mark on their right hand or forehead. Those who refuse to comply will be unable to buy or sell. They'll effectively be cut off from society.\n\nAre COVID vaccines the mark of the beast written about in the Book of Revelation? No. The mark of the beast will involve a conscious decision to give one's allegiance to the Antichrist. No one will accept it by mistake or for purely health reasons alone.\n\nNevertheless, vaccine mandates and passports create a social system enabling the mark of the beast. If they are allowed to stand, they will create a mark of the beast system indistinguishable in impact from the true mark of the beast.\n\nIn doing so, they'll pave the way for the rise of the Antichrist and the mark of the beast as outlined in the Book of Revelation. Combine such a system with modern technology including microchip implants and you have a scary combination.", "opengraph": {"title": "Covid Passport Microchip Developer Says There Is No Stopping Human Chipping", "type": "article", "description": "Towards the end of last year, tech start-up Dsruptive Subdermals announced a microchip installed under the skin that can be scanned to reveal Covid vaccination status. The technology was criticized, with many calling it “invasive.” The company’s managing director doubled down on the technology and told critics the technology was here to stay.", "image": "images/recent/markofthebeastmarch282019.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/markofthebeastmarch282019.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prophecynewswatch.com/product.cfm?product_id=16", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}