{"result_id": "249029", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5316", "timestamp": "2023-04-25 16:54:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5316", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Are We On The Verge Of The Tribulation Described In The Book Of Revelation?", "cleaned_text": "After two years of global turmoil, people are starting to realize we aren't going to \"return to normal.\" We've endured a global pandemic, widespread social unrest, vaccine passports, and compounding global supply chain issues. Now, we have a major war in Eastern Europe, fuel and food price inflation, and rumors of an impending global financial crisis. Everywhere you look, it seems as though the end is near. Is it? What does the Bible say? How close are the end times, the Tribulation, and the rapture of the church?\n\nFortunately, we don't have to guess. Jesus Himself told us how to recognize the general timeframe of His return. When the disciples said, \"Tell us the signs of your coming and the end of the age\" (Matthew 24:3), Jesus told them a number of things to look for. He then said, \"When you see all these things, you can know my return is near. I'm right at the door\" (Matthew 24:33). He also said, \"When all these things begin to happen, look up for your salvation is near!\" (Luke 21:28).\n\nThis means the #1 indication Jesus will return soon is all the signs appearing together. Both Jesus and the prophets told us what those signs are, and the appearance of just one is reason enough to take notice. But the arrival of one sign after another demands your attention. It's the sign Jesus said to look for. This convergence of signs is confirmation our generation will witness the Second Coming - not according to me, but according to Jesus.\n\nSo what are these signs? This article will only cite a few. These signs are undeniable, and their convergence should convince you the return of the Lord is close at hand. They include:\n\nIsrael Back in the Land - God promised to bring the Jewish people back into the land of Israel before He returned (Jeremiah 23:7-8). He said He would call them from \"among the nations\" (Ezekiel 39:28), from \"the farthest corners of the earth\" (Isaiah 11:12), and from \"north, south, east, and west\" (Psalm 107:3). He promised to welcome them home from the lands where they were scattered (Ezekiel 20:34). When they did, He promised to return and establish His everlasting kingdom (Isaiah 11:11-12).\n\nThe Jewish People in Control of Jerusalem - Jesus said armies would surround Jerusalem, destroy the city, and enslave its citizens. The Roman legions fulfilled this prophecy in A.D. 70. Jesus then said people other than the Jewish people will control Jerusalem for a time, until the Jewish people once again control Jerusalem. When they did, Jesus promised to return (Luke 21:24-28). Since 1967, the Jewish people have controlled Jerusalem.\n\nThe Gospel Preached Throughout the World - When asked about the end of the age and the signs of His coming, Jesus said to look for a very specific sign. He said the Gospel will be preached throughout the entire world. Every nation will hear it. And then? And then, the end will come (Matthew 24:14). For centuries after the crucifixion, the Gospel was confined to a small area surrounding the Mediterranean Sea. In the past two centuries, Christians have brought the Gospel to every nation in the world. Today, missionaries are in every nation. The Bible is translated in hundreds of languages, and the message of Jesus is sent around the world by radio, TV, satellite, and the Internet. For the first time in history, this generation is on the verge of spreading the Gospel to every last person on earth.\n\nAn Increase in Travel and Knowledge - Six hundred years before Jesus, an angel gave Daniel a special message. He said \"travel and knowledge\" will increase in the end times (Daniel 12:4). For centuries of human history, dramatic gains in travel and knowledge did NOT take place. Yet the last two hundred years have seen explosions in the speed and frequency of travel as well as the amount and availability of knowledge.\n\nArrival of the Exponential Curve - Jesus said a variety of global signs will come before His return and the end of the age. These signs will be spiritual, natural, societal, and political in nature. He said they will appear in a distinct way - \"like birth pains\" (Matthew 24:3‐8). This means the frequency and intensity of these signs will increase as we near His return. Our generation has seen the exponential increase in war and famine Jesus said to look for. In the 20th Century alone, more people died from war and famine than lived on the earth when Jesus spoke these words.\n\nIsrael Surrounded by Enemies - The Bible says enemies will surround Israel in the end times. Those enemies will say \"Come, let us wipe away the nation of Israel. Let's destroy the memory of its existence\" (Psalm 83:4) and \"Let us take for ourselves these pasturelands of God\" (Psalm 83:12). Ezekiel said Israel's neighbors will say \"God has given their land to us\" (Ezekiel 11:14‐17), and \"Israel and Judah are ours. We will take possession of them. What do we care if their God is there?\" (Ezekiel 35:10). Ever since the rebirth of Israel in 1948, the daily headlines have included these Bible verses. Israel's Muslim neighbors claim the land of Israel for themselves, and they have no regard for the God of Israel.\n\nIsrael's Exceedingly Great Army - Ezekiel said, in the end times, Israel will field \"an exceedingly great army\" (Ezekiel 37:10). Zechariah said Israel will be like a fire among sheaves of grain, burning up the neighboring nations (Zechariah 12:6) and even the weakest Israeli soldier will be like David (Zechariah 12:8). Since 1948, Israel has fought no less than four conventional wars against its neighbors. Despite being outnumbered more than 50 to 1, Israel has achieved overwhelming victory every time.\n\nRise of the Gog of Magog Alliance - The Bible says a military alliance that includes Russia, Iran, Turkey, and a number of Muslim nations will attack Israel \"in the latter days\" (Ezekiel 38:8) when God brings His people home from among the enemy nations (Ezekiel 39:27). Today, we see those very nations coming together for the first time - an alliance that has never existed in world history.\n\nRise of a United Europe - The Bible says a revived Roman Empire will come to power in the end times (Daniel 2, Daniel 7, Revelation 17). According to Daniel, it will be a ten nation alliance of weak and strong nations. Some parts will be as strong as iron, while other parts will be as weak as clay (Daniel 2:42). We see the beginning of this alliance in the European Union - a coalition of weak and strong nations struggling to stay together.\n\nThe Rise of Global Government - The Bible says a single government will rule the world politically (Revelation 13:7), religiously (Revelation 13:8), and economically (Revelation 13:16‐17) in the last days. It will rule over \"all people, tribes, and languages\" on the face of the earth (Revelation 13:7). Its authority will be so complete no one will be able to buy or sell anything without its permission (Revelation 13:16‐17). For centuries, a true global government was impossible. Today, world leaders openly discuss it.\n\nDenial of the Signs - Almost two thousand years ago, Peter issued a warning. He said in the last days people will mock the idea of Jesus returning. They will make fun of those who believe in the Second Coming and say exactly what we hear today - things like, \"I thought Jesus was coming back? What happened to His promise? Generation after generation has said He's coming. Yet, since the beginning of the world, everything has remained the same!\" (2 Peter 3:3‐4).\n\nKeep in mind, these signs haven't always been present. Generations of Christians lived and died without witnessing any of these signs. For centuries of Christian history, none of these signs were present. Today, they all are. Jesus said when you see these signs, you can know His return is near. He's right at the door (Matthew 24:33). In fact, Jesus said the generation witnessing these signs will not pass away before He returns (Matthew 24:34). So despite the skeptics and naysayers, Jesus is coming, and ours is the generation that will witness His return. The convergence of all these signs confirm it.\n\nAre We on the Verge of the Tribulation?\n\nFor many years now, we've seen the convergence of the signs Jesus and the prophets said to look for. Now, in 2022, we see a specific alignment of events that could lead to the outbreak of the Tribulation at any moment. These specific events are identical in nature to the events the Bible says will occur during the Tribulation. Whether or not these events are merely a preview of the events to come, or the actual events the Bible describes for the Tribulation, remains to be seen. However, keep in mind these events will roll out in the midst of the very season when Jesus said He would return.\n\nSo what are these possible Tribulation events in the making? Here are just a few:\n\nCentral Bank Digital Currencies - Over the past couple of years, central banks have openly discussed the introduction Central Bank Digital Currencies (CBDCs). The central banks wield power over some of the largest economies in the world - the United Kingdom, Canada, China, the European Union, and the United States. Despite these public discussions, conventional wisdom says the rollout of CBDCs remains years in the future. The conventional wisdom is wrong. China has already released a digital yuan, and recently released digital yuan wallets for both Android and iOS smartphones.\n\nIn March, President Biden signed an Executive Order titled \"Ensuring Responsible Development of Digital Assets.\" The order requires federal agencies to submit to the President within 180 days:\n\n\"a technical evaluation of the technological infrastructure, capacity, and expertise that would be necessary at relevant agencies to facilitate and support the introduction of a CBDC system should one be proposed. The evaluation should specifically address the technical risks of the various designs, including with respect to emerging and future technological developments, such as quantum computing.\"\n\nBy September 2022, this technical evaluation will be complete. Then, have no doubt about it - once the next crisis hits, the U.S. will roll out its own CBDC to replace the dollar.\n\nWhy does this matter? CBDCs will be centralized, government-controlled programmable currency. This means if the government decides it doesn't like you for whatever reason (think Canadian truckers), they can cut off your access. In other words, you won't be able to buy or sell. Sound familiar? The Bible says the Antichrist will implement this same system. Those who refuse the mark of the beast will be unable to buy or sell (Revelation 13:17). We're now on the verge of a global rollout of a technology identical in ability to the mark of the beast technology the Bible says will dominate the world during the Tribulation.\n\nWorld War III - The Bible says there will be a World War III (Revelation 6:4), and we're much closer to it today than when 2022 started and probably the closest we've been since the Cuban Missile Crisis in 1962. Every day seems to bring a new escalation between NATO and its allies and Russia over the latter's invasion of Ukraine. NATO has sanctioned Russia, is providing arms to the Ukrainian resistance, and many of its members have called for direct intervention in Ukraine.\n\nEven if NATO avoids a direct military conflict, all it takes is for Russia to make one mistake which leads to a deadly strike in Poland, Slovakia, Hungary, or Romania (all NATO members bordering Ukraine), and all of NATO will be obligated to respond. A full-blown war between Russia and NATO means World War III and the likely use of nuclear weapons. In 2019, the U.S. ran a war game to simulate what would happen in the event of a Russian invasion of Ukraine. The result was nuclear war with over a billion people dead. It's a stark reminder that, at any moment, the war in Ukraine could escalate into World War III.\n\nHyperinflation - In 2022, inflation has become a serious problem for almost every major economy in the world. The March 2022 headline inflation number for the U.S. was 8.5% - the highest since 1981. For the EuroZone, it came in at 7.5%. In Germany, wholesale prices rose 22.6% year-over-year. EU natural gas prices increased six-fold. Global oil prices rose 67%, wheat prices doubled, and corn prices went up 50%. Fuel and food riots have erupted in Peru, Sri Lanka, and Pakistan. And unrest is brewing in countless other countries as well.\n\nCould we be on the brink of hyperinflation? Maybe. Maybe not. But the Bible says the whole world will one day experience hyperinflation. When that happens, an entire day's wages will only buy enough food to barely survive (Revelation 6:6).\n\nGlobal Famine - As we entered 2022, the world already faced a major food crisis, both in terms of supply and price. Since then, the situation has only gotten worse. The Russian invasion of Ukraine cut off Russian and Ukrainian exports via the Black Sea. Together, they account for 12% of all global calories consumed. The sanctions against Russia have compounded ongoing supply chain issues, and many countries have banned agricultural exports. Add in poor harvests, rampant fertilizer shortages, and an avian flu plague destroying millions of chickens and turkeys, and it becomes clear we're heading toward the worst food crisis in modern times.\n\nIn fact, it's worse than that. Famine is coming on a mass scale. We simply aren't going to grow enough food in 2022. The result will be a biblical famine. The only question is whether it will be one of the famines Jesus spoke about in Matthew 24:7 or the Tribulation famine of Revelation 6:5-8.\n\nIf the world stage is now set for the Tribulation, how close must the rapture be? The Bible says the rapture will take place before the Tribulation. Jesus promised His church, \"I will keep you from the hour of trial that is going to come upon the whole world to test the inhabitants of the earth\" (Revelation 3:10). If you're reading this and you're a Christian, your time on this earth is short. Your race (1 Corinthians 9:24-27) is nearing its end, so make sure to finish well.\n\nLive a holy, godly life as you look forward to the day of His coming (2 Peter 3:11-12). Take advantage of every opportunity to spread the Gospel. Go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything Jesus has commanded (Matthew 28:19-20). The day will come when you will lose the opportunity to share the Good News of Jesus Christ. So do it now while you still can. Jesus is coming soon.", "opengraph": {"title": "Are We On The Verge Of The Tribulation Described In The Book Of Revelation?", "type": "article", "description": "We've endured a global pandemic, widespread social unrest, and compounding global supply chain issues. Now, we have a major war in Eastern Europe, fuel and food price inflation, and rumors of an impending global financial crisis. Everywhere you look, it seems as though the end is near. Is it?", "image": "images/recent/beholdhecomes1.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/beholdhecomes1.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Racing-Toward-Armageddon-Advanced-Technology/dp/1981968709", "http://www.amazon.com/Coming-Jesus-Search-Truth-Purpose-ebook/dp/B00JRNPGSM", "https://www.amazon.com/Signs-Second-Coming-Reasons-Lifetime/dp/1500792780", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}