{"result_id": "249042", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4481", "timestamp": "2023-04-25 16:54:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4481", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Covid Vaccinations Are Already Creating A Two Tier Caste System", "cleaned_text": "As the world stumbles into 2021 in a matter of days, life, as we know it, will never be normal again, referring to good ol' days of the pre-pandemic.\n\nFor months, readers may have heard us discuss \"COVID passports,\" \"immunity passports,\" or at least speak on the subject of those who don't get tested for COVID-19 or vaccinated will face travel restrictions.\n\nWell, from conspiracy theory to conspiracy fact, Singapore Airlines this week is the first major carrier to introduce a digital health certificate to verify passengers' testing history and vaccination status.\n\nOn Dec. 23, the new digital health verification process was rolled out for passengers traveling on flights operated by the carrier from Jakarta or Kuala Lumpur to Singapore, according to a Singapore Airlines press release.\n\nThe airline explains passengers will take COVID-19 tests at local clinics in Jakarta and Kuala Lumpur and be issued \"digital or paper health certificates with a QR code.\" These forms of immunity passes will be checked by airport security and Singapore's immigration authority.\n\n\"This is a faster and more secure way to validate a passenger's health credentials than the existing protocols, speeding up both the airport check-in process and the immigration entry process into Singapore. It would make it easier for SIA customers to control their information, reduce friction during their travel journey, and result in a more seamless experience with the aid of digital technologies in the new normal,\" the airline said.\n\nJoAnn Tan, Acting Senior Vice President Marketing Planning, Singapore Airlines, said the rollout of immunity passports \"will be an integral part of air travel for the foreseeable future.\"\n\nIn October, passengers flying from London's Heathrow Airport to Newark on a United Airlines flight were part of a pilot program to test passengers for the virus.\n\nJust weeks ago, Lance Gokongwei, President and CEO of Cebu Pacific, the Philippines' largest budget airline, announced health passports would be \"essential\" for travel.\n\nIn the April and May time frame, the mayor of the French city of Nice and Bill Gates were among the most prominent voices discussing health passports.\n\nEven after the virus pandemic ends, these health passports will be sticking around and could offer evidence that a traveler has been vaccinated - not just for COVID-19, but any other disease.\n\nHowever it doesn't end just there. The elites are looking to tighten their control and surveillance of the masses and that includes a register of those who have been offered the vaccine and refused.\n\nSpain has announced that it will now create a register of people who refuse the Covid vaccine.\n\nThe vaccine will not be mandatory, said Health Minister Salvador Illa, but whoever decides not to do so will be included in a \"register\" which will then be shared with other European Union countries.\n\nThe fact that it will be shared with other EU countries may lead to a ban on travel for those who refuse the drug. Not to mention the fact that Spain's decision could pave the way for similar measures in other European countries.\n\nThere is already speculation in the UK that those who refuse to be vaccinated will be denied access to certain otherwise normal activities including restaurants, bars, cinemas and sports venues which could block entry to those who don't have proof they are inoculated.\n\nOne of the growing fears is the vaccine may become mandatory to work at some jobs and if employers have the right to fire those that refuse.\n\nA number of dystopian sci-fi novels predict the eventual establishment of a two-tier society, the \"acceptables\" and the \"unacceptables\", however one look no farther than China's current social credit system which blocks or restricts everything from job opportunities to travel based on one's obedience to government edicts about societal well being.", "opengraph": {"title": "Covid Vaccinations Are Already Creating A Two Tier Caste System", "type": "article", "description": "From conspiracy theory to conspiracy fact, Singapore Airlines this week is the first major carrier to introduce a digital health certificate to verify passengers’ testing history and vaccination status while Spain has announced that it will now create a register of people who refuse the Covid vaccine.", "image": "images/recent/covidvdec092020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/covidvdec092020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}