{"result_id": "249002", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4933", "timestamp": "2023-04-25 16:54:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4933", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Covid Vaccination Tattoos, Biometrics & The Mark Of The Beast", "cleaned_text": "What was intended as a grab for attention may have much deeper ramifications after a student in Italy went viral on Tiktok for tattooing the barcode of his covid certificate on his arm.\n\nTwenty-two year old Andrea Colonnetta's left arm now bears a matrix of black squares from the QR code of his official Italian green pass.\n\nHe said he had received both doses of a coronavirus vaccine.\n\nThe pass gives proof of coronavirus status -- that you are vaccinated, have recovered from the virus, or tested negative in the last 48 hours.\n\nIt has been required in Italy since August 6 to get into cinemas, museums and indoor sports venues or to eat indoors at restaurants.\n\nThe barcode tattoo has apparently become much more than just a novelty as it actually works for scanning. Colonnetta was able to show a video of himself entering a McDonalds after a security guard scanned his tattoo.\n\nMany people are greatly concerned about how the future of covid passports will affect their freedoms and even the technological aspects of how such passports might be enforced in the future. There is already a very large black market for fake covid certificates and some believe the only way to crack down on such forgeries will be biometric enforcement which leads to the necessity of biometric surveillance.\n\nThe recent fall of Afghanistan is a lesson in what happens when the bad guys get access to biometric databases.\n\nAfter years of a push to digitize databases in the country, and introduce digital identity cards and biometrics for voting, activists warn these technologies will now be used by the Taliban to track down people who worked with the previous government or Americans by checking their fingerprints or iris scans against a database.\n\nThere are already several reports from Afghanistan that the Taliban have been using biometric readers when going from house to house for security checks.\n\nWith access to such data, it will be much more difficult to hide one's identity as well as that of your family's identities, and the data can also be used to flesh out your contacts and network,\" said Welton Chang, chief technology officer at Human Rights First.\n\nIt could also be used \"to create a new class structure - job applicants would have their bio-data compared to the database, and jobs could be denied on the basis of having connections to the former government or security forces.\n\nFor most Americans the biggest biometric decision they currently have to worry about is how much info to let their fitness watch gather.\n\nHowever what happens when you are required a mandatory bracelet so an employer or institution can access continuous data about your movement and health due to Covid regulations. Such actions are already being considered by many large corporations.\n\nMany sports teams and schools are already experimenting with wearable technologies that help detect coronavirus in combination with other biometric technologies but wearables have limits. Perhaps a more permanent and universal solution will be necessary to provide enforcement across all specters of society.\n\nAustralia is already trialing a smartphone app that will use facial recognition and geolocation to help authorities monitor compliance with the state's mandatory isolation requirements.\n\nIndividuals will be sent random location checks which they will be required to respond to within a 15-minute time frame to prove they are at their registered quarantine address by showing their face alongside current geolocation data.\n\nWhile it is unlikely that we will all be getting QR code tattoo's anytime soon, it does show one what is possible. That a digital code or outward \"mark\" might be given to people as a means of convenience to demonstrate \"vaccination compliance\" - and that without that \"mark\" it won't be possible to conduct certain types of activities and commerce.\n\nIf this sounds eerily familiar to what is described in the Book of Revelation you are right. It is important to recognize that vaccination certificates/passports do not meet the requirements of scripture to be the Mark of The Beast, commonly associated with the numbers 666. The mark described in Revelation 13 is more than just receiving a mark that gives one the ability to conduct commerce but it is an act of worship & allegiance to the Antichrist. Without an Antichrist figure in power there can be no \"mark of the beast\".\n\nHowever, what we are seeing is a preconditioning for such types of social compliance and acceptance of technological advancements that could pave the way for what will one day lead to this mark described in Revelation.\n\nMany Bible prophecy scholars warn that we are seeing a foreshadowing of what is to come in the end times and while scripture is silent on any type of worldwide health crisis linkage to the mark of the beast - Revelation also warns that there will be further disease and plagues that could exacerbate the issues we are currently seeing.\n\nImagine if future Covid variants (or other disease types) brought even more death and suffering, resulting in the collapse of the worldwide economy. Now imagine someone coming on the scene who offers a cure/solution to both dealing with Covid and the economic turmoil.\n\nWould many worship this man as if he was God? Would they accept his \"mark\" if presented as a solution to the crisis that had both political, technological, economic and potential health benefits?\n\nThe current health crisis has shown just how desperate people are for normalcy and what they would give up to return to live normal lives. A return to more restrictions this Fall will once again send many on a roller coaster of emotions and make us all more susceptible to \"worship\" someone who could bring real solutions.\n\nThe Bible says that one day the world will worship a man scripture calls the \"Antichrist - who essentially is a false Messiah. He is a lion in sheep's clothing and will offer answers to the worlds problems that will make people love him. However, he is a deceiver. Instead of saving the world, he helps to bring about it's destruction.\n\nHow today's world events might play into the events Revelation describes remains to be seen. But a great place to start for the average person is to understand what the Book of Revelation says is coming. Without that knowledge you will be caught off guard and not be able to see how the the events of today are leading to the final fulfillment of prophecies predicted by Scripture.\n\nWe highly recommend the DVD series on Revelation called \"Decoding The Future\". This DVD series may very change the way you understand how these last-days will unfold and explains why these things must inevitably take place.", "opengraph": {"title": "Covid Vaccination Tattoos, Biometrics & The Mark Of The Beast", "type": "article", "description": "What was intended as a grab for attention may have much deeper ramifications after a student in Italy went viral on Tiktok for tattooing the barcode of his covid certificate on his arm.", "image": "images/recent/scantatoo1.jpeg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/scantatoo1.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prophecynewswatch.com/product.cfm?product_id=16", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}