{"result_id": "249001", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4886", "timestamp": "2023-04-25 16:54:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4886", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Digital Health Passports - Trojan Horse For A Cashless Society?", "cleaned_text": "Several new technologies that appear separate and unrelated will soon converge, creating a giant digital trap that will easily entice the uninformed masses.\n\nThe digital trap has already been set and globalist elites are using COVID to speed up the process of convergence. Most people will sleep-walk right into the trap, which will ultimately reduce them to a human QR code - trackable, traceable, and 100 percent dependent on Big Tech and big government for their existence.\n\nI'm going to unpack each of these seemingly separate threads that will be gradually merged into a single overarching socio-financial control grid.\n\nThe most imminent agenda item needed to jumpstart this system is a successful launch of digital health passports.\n\nFrance, Italy, Ireland, Germany, Greece and many other nations have started mandating these passports on their citizens, many of whom are flooding into the streets to protest.\n\nThe movement toward digital health passports in the U.S. is happening more gradually but it's picking up steam.\n\nIn a briefing Monday, Aug. 2, Biden's Coronavirus Response Coordinator Jeffrey Zients announced \"it's time to impose some requirements\" where COVID vaccines are concerned.\n\nWhen asked for clarification on exactly what COVID rules might be implemented, White House Press Secretary Jen Psaki said nothing is off the table.\n\nRemember that phrase: Nothing is off the table.\n\nAn academic consortium consisting of six universities already has a contract with the U.S. Department of Homeland Security to provide training for government, law enforcement, healthcare and private-sector stakeholders on how to quarantine \"large portions\" of rural communities.\n\nBut the drive to digitize the lives of Americans will start in the cities and move outward.\n\nNew York Mayor Bill de Blasio became the first politician to jump at the opportunity to demand vaccine passports.\n\nDespite what anyone tries to tell you, separating Americans by vaccine status is a historic first. It has never before been tried, not through the polio or smallpox outbreaks of the 1920s, '30s and '40s, not during the Spanish Flu. Not ever.\n\nDe Blasio ordered businesses to deny service to the unvaccinated, which accounts for 30 percent of the city's population. It remains to be seen how de Blasio will enforce this edict. Will he call out the police to shut down businesses not demanding a show of papers from their customers?\n\nNew York Gov. Andrew Cuomo is also shooting for vaccine passport mandates statewide but knows he has to be a little more diplomatic in his approach.\n\n\"Private businesses, I am asking them and suggesting to them, go to vaccine-only admission. Go to vaccine-only admission,\" Cuomo said in an Aug. 2 press conference.\n\n\"I believe it's in your own business interest,\" he said, \"to run a vaccine-only establishment.... We have apps, just say, 'you have to show that you were vaccinated when you walk in the door.'\"\n\nIn other words, \"Show your papers.\"\n\nThink about what Cuomo is saying here.\n\nHe is very forcefully \"asking\" business owners to eliminate 30 percent the state's population from their field of potential customers and treat them as non-persons.\n\nThis is pure fascism and reminds one of the Nazi propaganda that coerced Germans to refuse to do business with Jews.\n\nIf New York's business owners listened to Cuomo, they would make it impossible for non-vaxxed people to feed their children.\n\nThe digital passports require people to download a scannable QR code on their cellphone that will allow businesses to know they've been vaxxed before they are allowed to enter and receive service [buy or sell].\n\nThat leads us to the second leg of the digital trap that is baking in the technological oven - a new global digital ID system that is capable of working in conjunction with the digital health passports and the new medical-vaccination complex.\n\nThe leader in this stream of tech is the ID2020 Alliance, a collaborative of more than 35 members including Accenture, Microsoft, the Rockefeller Foundation, MasterCard, IBM, the International Chamber of Commerce, MIT SafePaths and Bill Gates' GAVI Global Vaccines Alliance.\n\nIn February 2021, ID2020 launched the Good Health Pass Collaborative to encourage a seamless convergence of all the COVID-19 vaccine credentialing apps being developed by many different organizations.\n\n\"Paper vaccine certificates can be easily forged,\" the ID2020 Alliance warns in a press release. \"The purpose of health credentials is to securely prove that a person has received a vaccine or PCR test. The new alliance is particularly targeting travel to ensure credentials work cross-border, cross-industry and are frictionless.\"\n\nThe alliance has published a white paper on the topic for those seeking more details.\n\nYet another piece to the evolving techno-fascist puzzle is the new digital currency.\n\nThe world's central banks are working on a programmable digital currency based on block chain technology. This means they will be able to track your spending and shut you off for any reason.\n\nThe International Monetary Fund posted an article on its website in July lauding India as a global leader in the drive to eliminate cash. And of course COVID was mentioned as expediting the move away from paper money. The IMF noted:\n\n\"COVID-19 has accelerated the use of contactless digital payments for small transactions as people try to protect themselves from the virus. These advances build on the India Stack--a comprehensive digital identity, payment, and data-management system that we write about in a new paper (Carrière-Swallow, Haksar, and Patnam 2021).\"\n\nAs you can see in the above statement, the goal is a comprehensive digital identity, combining one's health data and vaccine status with banking and other personally identifiable data.\n\nKlaus Schwab warned us ahead of time about the trap he and his elitist buddies were setting for us.\n\n\"The Fourth Industrial Revolution will lead to a fusion of our physical, biological and digital identities,\" Schwab told the Chicago Council on Global Affairs in November 2020.\n\nEven before that, in his 2018 book, Shaping the Future of The Fourth Industrial Revolution, Schwab wrote:\n\n\"Fourth Industrial Revolution technologies will not stop at becoming part of the physical world around us--they will become part of us.\n\n\"Indeed, some of us already feel that our smartphones have become an extension of ourselves. Today's external devices--from wearable computers to virtual reality headsets--will almost certainly become implantable in our bodies and brains.\"\n\nWhen he penned these grandiose ideas in 2018, it seemed like the pie in the sky musings of an out of touch futurist and few paid attention. Post COVID, it's in our faces and ready to be implemented.\n\nThe final leg of the technological program to control humanity is the Big Tech giants working together to scrub all dissident voices from the Internet. Their ultimate goal is to create a system where all users have an Internet passport, subject to periodic review of your online activity.\n\nThe Big Tech giants have already said they actively share information in an effort to crack down on \"white supremacists\" under the Global Internet Forum to Counter Terrorism, a body previously reserved for targeting the Taliban and al-Qaeda.\n\nPayPal announced it will be working with the notoriously Marxist Anti-Defamation League to scour the Internet, looking for \"extremists\" and \"anti-government\" voices in order to shut off their PayPal donation buttons.\n\nUnder this Chinese-style social scoring system, those guilty of online infractions get publicly shamed and silenced. Information collectors are paid to snitch on their neighbors and family members. Once your social credit score dips below a certain level, you become so discredited that it gets tougher and tougher to find a job, travel by plane, train, bus or car, get loans or put your kids in the better schools.\n\nThose providing counter-narrative information will be flagged, given a warning, and eventually blocked as disseminators of \"disinformation.\"\n\nYou lose your freedom of speech, but that's not all.\n\nIn today's society, being removed from the Internet means you won't be able to buy or sell online or work a job that requires an internet connection.\n\nSo the health passports, currently being rolled out worldwide, will block you from in-person shopping for food and necessities while the coming Internet passport will block you from ordering your necessities online. You will essentially be left with the black market, assuming one will spring up for those deemed \"unclean\" and \"unfit\" for the modern world because of their dissident views.\n\nAll of these technologies will merge at the intersection of Big Data, big banks, Big Tech and big government. Your social credit score will now be tied in not only to your Internet activity but to your bank account and your vaccine status. Welcome to the Great Reset, a/k/a New World Order.\n\nAdd in advances in AI and facial recognition and millions of surveillance cameras and you are talking about a lockdown slave state that makes George Orwell's 1984 look like a picnic in the park.\n\nBut don't complain. It's all \"for our safety.\"\n\nPeople cannot be trusted to do the right thing, to believe the true facts, to lead the kind of life that results in a peaceful, happy society. All must conform to the new masters.\n\nNow is the time to fight this system. But in order to fight it, you must recognize its existence and stay one step ahead of the cabal's evil game plan.\n\nAt some point the trap door will shut. It will be too late to opt out. You either comply or become a non-person. An enemy of the state.\n\nThese separate avenues of evolving technology will eventually be merged to create a society in which everything, and every person, is digitally tracked. Not just the movement of their physical bodies, but their actions, behaviors, even their thoughts.\n\nThe elites are counting on us accepting this system in its early, fragmented stages. Most people think compartmentally. They don't connect dots. They will be deceived.\n\nThe elites are not going to tell you upfront what all is involved in the Fourth Industrial Revolution. They're just going to tell you the parts that sound good - convenience, inclusion, safety, security.\n\nOnce this trap door is shut, it will be very difficult to get out of its clutches.", "opengraph": {"title": "Digital Health Passports -  Trojan Horse For A Cashless Society?", "type": "article", "description": "Several new technologies that appear separate and unrelated will soon converge, creating a giant digital trap that will easily entice the uninformed masses and reduce them to a human QR code - trackable, traceable, and 100 percent dependent on Big Tech and big government for their existence.", "image": "images/recent/cashlessvisajuly192017.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/cashlessvisajuly192017.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/2021/08/digital-health-passports-are-trojan-horse-for-cashless-society.html", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}