{"result_id": "249040", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4294", "timestamp": "2023-04-25 16:54:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4294", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "The Great Reset - Are We Being Conditioned For The Rise Of The Antichrist?", "cleaned_text": "When 2020 began, who could have imagined that a virus from China would take us closer to the tribulation? However, COVID-19 has done exactly that.\n\nSince the virus first appeared in the United States, the goal line for easing government restrictions, lockdowns, quarantines, and face masks has continually changed. They have gone from flattening the curve, which the CDC said would take two to four weeks, to reduced hospital admissions, to everyone receiving a vaccination, and to Dr. Fauci recently stating that people can return to movie theaters only after the vaccine has been available for an entire year.\n\nBut will the arrival of a vaccine mark a return to normal? According to Tucker Carlson's August 26th report on The Fox News Channel, the goal line has moved yet again. He quoted the World Health organization (WHO) Director General, Dr. Tedros Adhanom Ghebreyesus as stating that finding a vaccine for COVID-19 is not the final goal. No, the ultimate aim is the \"reordering of society.\" He quoted the WHO director as also saying this, \"We will not, we cannot go back to the way things were.\"\n\nDr. Ghebreyesus of the WHO summed it up this way, \"The COVID-19 pandemic has given new impetus to the need to accelerate efforts to respond to climate change.\" Tucker Carlson quoted Bill Gates as saying that the COVID-19 pandemic signifies \"that the rest of us will have to sacrifice even more to save the earth from warming.\"\n\nSo, what's the connection between the virus and climate control? Tucker Carlson nails it with these words, \"both are pretexts for mass social control.\"\n\nThis \"social control\" is paving the way for the coming world government. The global warming alarm and the fear generated by COVID-19 are prepping society for the arrival of the antichrist.\n\nTHE GREAT RESET IS THE GOAL\n\nOne need not look any further than to the World Economic Forum (WEF) website to see how the global elite seek to use these \"crises\" to reorder society for what they call \"The Great Reset.\"\n\nBelow are a couple of the opening quotes from the \"The Great Reset\" page of the WEF website.\n\nThere is an urgent need for global stakeholders to cooperate in simultaneously managing the direct consequences of the COVID-19 crisis. To improve the state of the world, the World Economic Forum is starting The Great Reset initiative.\n\nThe Covid-19 crisis, and the political, economic and social disruptions it has caused, is fundamentally changing the traditional context for decision-making. The inconsistencies, inadequacies and contradictions of multiple systems -from health and financial to energy and education - are more exposed than ever amidst a global context of concern for lives, livelihoods and the planet. Leaders find themselves at a historic crossroads, managing short-term pressures against medium- and long-term uncertainties.\n\nThe push for the Great Reset has reached the United Nations. António Guterres, the UN's Secretary-General, added this to the call for the reordering of the world governments on the basis of both the \"pandemic\" and \"climate change:\"\n\nThe Great Reset is a welcome recognition that this human tragedy must be a wake-up call. We must build more equal, inclusive and sustainable economies and societies that are more resilient in the face of pandemics, climate change and the many other global changes we face.\n\nCOVID-19 and climate change constitute \"a wake-up call\" for \"global changes,\" which further the need for the Great Reset, the coming world order of the tribulation over which the antichrist will someday rule. The elite who operate the WEF do not hide their intention to use climate change and the virus as the pretext for a one-world government.\n\nPeter Koenig wrote this about how COVID-19 is advancing the agenda of the elite toward the one world government, which he calls \"the Beast.\"\n\nWe have become enslaved to the Beast. The Beast calls the shots on boom or bust of our economies, on who should be shackled by debt, when and where a pandemic should break out, and on the conditions of surviving the pandemic, for example, social confinement. And to top it all off - the instruments the Beast uses, very cleverly, are a tiny-tiny invisible enemy, called a virus, and a huge but also invisible monster, called FEAR. That keeps us off the street, off reunions with our friends, and off our social entertainment, theatre, sports, or a picnic in the park.\n\nI find it quire remarkable that although Mr. Koenig does not claim any knowledge of Bible prophecy, he uses the terminology of Daniel and the book of Revelation in describing the kingdom of the antichrist.\n\nI provide these quotes to show how climate change and COVID-19 lie behind the push for the Great Reset.\n\nWe see evidence of this in the United Nations' Agenda 2030, which lists goals for a one world government that it hopes to put in place by 2030. The New Green Deal in the United States mirrors the goals of Agenda 2030 with its agenda for a Marxist totalitarian world order (AKA the Beast).\n\nTHE CONDITIONING OF SOCIETY FOR THE GREAT RESET\n\nHow are the elite globalists of our world preparing the world to follow their lead in establishing a Marxist government? Below I list some of the ways they use the coronavirus as well as climate change for their demonic purposes to bring about the Great Reset that will pave the way for the rule of the antichrist during the tribulation.\n\n1. Fear: The first tool in the arsenal of the globalists is fear and they have succeeded in creating a great deal of it both in the United States and throughout the world.\n\nThey advanced the horrors of climate change for decades, but this alone has not caught the attention of the masses that they had hoped it would do. An abundance of failed predictions along with an army of scientists who now dispute the dire warnings of impending doom have diminished the impact of climate alarm on many people. It consistently ranks low on the lists of concerns for voters.\n\nThe globalists needed a crisis that would impact everyone in the world and thus COVID-19 arrived on the scene. They still issue dire warnings regarding climate change for those who will listen and buy into that contrived panic. However, the elite have added the coronavirus to their plans to generate the widespread alarm they require to make people willing to accept their demonic Marxist solution for both crises.\n\n2. Tell people to submit for their own well-being: The combination of fear and the great deception of our time have made vast numbers of people willing to submit to the government, which they now regard as the protector of their health. As a result, they have willingly given up many of their rights and freedoms for the sake of remaining healthy, a trend sure to continue.\n\nThe New World Order (AKA the beast) cannot exercise its dominion over people apart from their willingness to submit to dictates of a government they trust for their well-being and health.\n\nAnd, very few pastors stand up against the restriction regarding the freedom of religion imposed on them by socialist governors. I thank the Lord for the courage of John MacArthur in this regard.\n\n3. Lawlessness and violence: Billionaire globalists fund the violence and lawlessness we witness throughout the United States. The result of this will be the exact opposite of what those rioting believe they will accomplish with the fires, vicious attacks on the innocent, and the killing of law enforcement officials.\n\nThose behind the Great Reset intend to use the breakdown of law and order to bring about a much more rigid \"police state\" where those enforcing the rules of the state will pledge loyalty to a tyrannical world government rather than to one's city or state or country.\n\nThe protests against police cruelty will result in a totalitarian rule where everyone, regardless of race, nationality, or gender will shake in fear at the sight of those enforcing the draconian rules of an all-powerful socialistic government.\n\n4. Establish a need for government control: In order for the elite to achieve their ultimate goal of a one world government, they must convince people of the need for more government control of their lives. This explains their devotion to the contrived climate emergency and why they will not let go of the increased control over our lives that they have achieved through the Covid-19 crisis.\n\nPresident Donald Trump and the United States represent their greatest obstacles in achieving their objective, which is why we see the rioting and the nonstop media lies about our President. In 2016, Trump interrupted their march to world dominance, and they cannot allow for another delay in their effort to convince the world of its need for more government control.\n\nPowerful forces in our world, led by the devil himself, seek to put in place a one-world government and they will use everything they can to make it happen. They will not let go of the COVID-19 health \"crisis\" until they have accomplished their goal to subject the entire world to the slavery of a Marxist regime.\n\nTucker Carlson was spot on with his assessment of climate change and COVID-19, \"both are pretexts for mass social control.\" The wearing of masks, the bowing of knees to the Black Lives Matter movement, and the vaccines consist of preconditioning people to both receive the mark of the beast during the tribulation and worship the antichrist (Rev. 13:16-18). This is the end game of what Satan seeks to accomplish through the Great Reset.\n\nThe prophet Daniel, writing 2,600 years ago, wrote about the Great Reset of the WEF. He called it a \"beast\" with \"horns\" (Dan. 7:23-25). The apostle John, in Revelation 13, added more details to this beast whom the antichrist will someday personify. He is the \"man of lawlessness whom the Lord will destroy at His second coming (2 Thess. 2:3-8).\n\nSince God long ago foretold the rise of this beast with the detail that we now see taking shape in our world, we can absolutely trust His Word as to the coming destruction of this beast, both the government and the antichrist who will personify the beast (Dan. 2:44-45; 7:26-27; Rev. 19:17-20:3). Jesus will destroy both at His second coming.\n\nFor those of us who belong to Christ, the good news of the Gospel is that Jesus will come for us before the start of the tribulation and the culmination of the Satanic plans of the globalists.\n\nWe do not watch in fear for the Great Reset; but we eagerly await the appearance of our great Savior who take us back to the place He has prepared for us (John 14:1-3). We await our speedy departure from this world to heaven.\n\nYes, the news about our world today is more than a little disconcerting, but our hope is more glorious than we can imagine.\n\nJesus is coming to take us home; we need not buy into the fear of our time.\n\nThe lawlessness and violence of our day tell us that the prophesied tribulation is ever so near. But before that can happen, we will reside in paradise with Jesus.", "opengraph": {"title": "The Great Reset - Are We Being Conditioned For The Rise Of The Antichrist?", "type": "article", "description": "World Health organization Director General, Dr. Tedros Adhanom Ghebreyesus has declared that finding a vaccine for COVID-19 is not the final goal. No, the ultimate aim is the ", "image": "images/recent/resetjune242020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/resetjune242020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.jonathanbrentner.com/https/jonathan-brentner-g8fgsquarespacecom/config/2020/9/15/the-prepping-of-society-for-the-antichrist", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}