{"result_id": "249023", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5348", "timestamp": "2023-04-25 16:54:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5348", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Christian Leftists Support Of Abortion Draws Biblical Backlash", "cleaned_text": "\"When words are many, transgression is not lacking\" (Proverbs 10:19), so it's little surprise that among all the ink spilled over the leaked Dobbs decision draft, there were at least a few shockingly poor takes.\n\nOne such take came from Leftist pastor Brandan Robertson, \"God has given all human beings authority and autonomy over our own bodies. And if Roe v Wade is struck down, this will be yet another assault on women's authority and autonomy over their own bodies.\"\n\nNo Psalm 139 for him. I guess consistency requires anyone ignoring \"you knitted me together in my mother's womb\" (verse 14) to also ignore \"you hem me in, behind and before, and lay your hand upon me\" (verse 5) and \"search me, O God, and know my heart! Try me and know my thoughts!\" (verse 23) -- not to mention the rest of the Bible.\n\n\"It's difficult to even call him a 'Christian' pastor,\" said David Closson, Director of FRC's Center for Biblical Worldview. \"At one level, yes,\" we do have autonomy over our own bodies, he noted. \"That's one of the reasons I was against the vaccine mandates.... But do we have unlimited autonomy? No. And do we have the unlimited right to do something with someone else's body? Absolutely not.\"\n\nClosson explained Robertson's beliefs track with the worldly perspective identified by Carl Trueman in his mighty book, The Rise and Triumph of the Modern Self. That worldview lauds \"being able to do whatever you want, whenever you want. You follow the dictates of your feelings, your emotions, your desires. And so it's disconnected from any understanding of accountability or responsibility to God.\"\n\n\"The secular world says, 'my body, my choice,' Added Joseph Backholm, host of Friday's Worldview Conversation on \"Washington Watch.\" \"Scripture says the opposite.\" Christians are called to live as if their body belongs to Jesus, not themselves.\n\nPaul says, \"It is no longer I who live, but Christ who lives in me\" (Galatians 2:20), and \"present your bodies as a living sacrifice\" (Romans 12:1), and \"you are not your own, for you were bought with a price. So glorify God in your body\" (1 Corinthians 6:19-20). \"The starting assumption is that I am submitted to Christ,\" Backholm explained.\n\nIn previous eras, even non-Christians in America understood that each person is accountable to God; this assumption undergirded oath requirements for holding certain offices or testifying in court. Accountability and rights are two sides of the same coin -- a coin God minted. Today, people pick and choose which parts of religion to believe (a.k.a. inventing their own), embracing rights and jettisoning responsibility.\n\nSo, President Joe Biden could say (in defense of abortion), \"I believe I have the rights that I have not because the government gave them to me, which you believe, but because I'm just a child of God, I exist.\" Rights do come from God, remarked Closson, but \"President Biden doesn't really believe that.\" If he did, he would show more fear wielding such an argument to justify denying unborn children the rights God gave them.\n\nRobertson had another zinger, \"If we are going to bend the moral arc of this nation towards God's vision of justice and equity, we must demand that women's rights are protected and abortion is health care.\" Backholm warned that Robertson employed \"buzzwords\" to \"generate sympathy,\" and \"linguistic maneuvers like that can be persuasive unless we have a framework\" for understanding what the Bible actually teaches. \"When that's our framework, then we can look at somebody who's well intentioned [but wrong]... and we can say, 'well, maybe a nice guy, but the things that he's saying are not true.'\"\n\nAbortion activists \"have an idea of what they think justice or equity should look like,\" which they \"superimpose... on holy scripture,\" said Closson. \"We don't start with out own ideas of justice.... We want to go to the Bible first and foremost and ask, what is God's idea of justice?\"\n\nSomeone who fixes up cars in his spare time won't get hoodwinked by a dishonest mechanic because he knows what he's talking about. In the same way, a Christian who studies the Bible regularly, and understands it, won't be misled by someone trying to twist it to mean something it doesn't.\n\n\"The Bible is not a philosophical textbook\" where \"we go just to debate.... It's God's revealed word, and so we go to it for belief and obedience,\" said Closson. He has authored a publication on Biblical Principles for Pro-Life Engagement that starts with what the Bible teaches, not what man's faulty reason has invented.\n\n\"Emotional manipulation... ad hominem attack... these tactics are employed so often in public policy debates,\" said Backholm. But \"[blessed is the man whose] delight is in the law of the Lord, and on his law he meditates day and night. He is like a tree planted by streams of water that yields its fruit in its season, and its leaf does not wither. In all that he does, he prospers\" (Psalm 1:2-3). How firmly are you planted on God's word?", "opengraph": {"title": "Christian Leftists Support Of Abortion Draws Biblical Backlash", "type": "article", "description": "We don't start with out own ideas of justice.... We want to go to the Bible first and foremost and ask, what is God's idea of justice?", "image": "images/recent/prolife2.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/prolife2.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.frc.org/", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}