{"result_id": "249034", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5912", "timestamp": "2023-04-25 16:54:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5912", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Deadly Delusions: 5 Lies The Globalists Want You To Believe", "cleaned_text": "The books of Daniel and Revelation tell us that in the years prior to the Second Coming, a vicious and exceedingly evil world empire will emerge and briefly rule over the nations. The Apostle Paul describes its leader as the \"man of lawlessness\" who will defile a Jewish temple in Jerusalem before Jesus destroys him at His at His return to earth (2 Thessalonians 2:3-10).\n\nDo we see evidence today of Satan's minions preparing the way for the antichrist to enslave humanity? Absolutely! It's like a bear coming out of hibernation.\n\nThe beast kingdom is gaining strength throughout the world, just as Scripture said would happen in the last days. For over a century, the globalists have been putting the pieces in place for the coming new world order. Now it's coming to fruition.\n\nThe majority of people do not want the luciferin agenda of the elite powerbrokers of our day, but that doesn't matter. They will impose their will on the unsuspecting, slowly but surely.\n\nThey will do so through many dangerous delusions that will turn deadly:\n\nPeter Koenig, a geopolitical analyst and a former Senior Economist at the World Bank and the World Health Organization (WHO), wrote the following about the January 2023 World Economic Forum (WEF) meeting in Davos:\n\nCriticism and even ridicule of the WEF's dictatorial and dystopian approach to the world's problems has reached in 2023 a new pinnacle. Though the words \"democracy\" and \"freedom\" are always in the forefront, they are hardly applied. They are merely the deed of nonstop propaganda for something that isn't. And as Goebbels, Hitler's Propaganda Minister, said already almost 80 years ago, \"If a lie is often enough repeated, it becomes the truth\".\n\nThis false truth has brainwashed almost every Western citizen. We are being gradually enslaved while still believing we are living in a democracy. The WEF is part of the steady flow of propaganda but also a master tyrant, in the person of Klaus Schwab and his Israeli top adviser, \"You useless eaters\", Mr. Yuval Noah Harari.\n\nThe elite of our day tell us their true aim is \"democracy\" and \"freedom.\" However, their true intent is a totalitarian Marxist one world government.\n\nA video appeared on the WEF website that I watched many times in the past. It pictured a happy young man as a voice told us that in the future, \"You will own nothing and be happy.\" That's the true objective of the globalists and it rings of servitude, not freedom.\n\nTen nations have already implemented digital currencies with another one hundred considering such a move. Many predict that a central bank digital currency (CBDC) will arrive in America during 2023.\n\nDuring their initial appearing, the elite will showcase the advantages of CBDCs. They will increase the speed and accuracy of electronic financial transactions and provide much improved protection against fraud. Many will welcome the introduction of a CBDC, especially during its initial, and perhaps limited, implementation. It may seem like using a debit card.\n\nHowever, there's a huge downside to CBDCs via their programable feature. This will not only give the state access to all financial transactions, but also enable it, perhaps at a later date, to penalize people for spending their allotted funds in socially unacceptable ways.\n\nThe CBDCs are a trap; many who bemoan the idea of a totalitarian state will find themselves subjected to one against their will as they discover far too late that a future government entity decides the amount of funds available to them and prescribes how they spend them.\n\nAnother item high on the agenda at the January WEF gathering was the matter of vaccine passports. The objective of the attendees is to have the vaccine status of everyone in the world digitally available in the form of a passport.\n\nThis might seem reasonable to a few, but it's also a ruse for the globalists to gather data on everyone and then later use that information to control them.\n\nThe ultimate goal of the globalists' is to combine ones vaccine information with all other personal data including financial transactions from the CBDCs. The passport will connect everyone to a massive database where all there is to know about everyone will be readily available to the elite.\n\nBelow is a quote from a Townhall article concerning vaccine passports:\n\nEven liberal author Naomi Wolf understands the dangers that vaccine passports represent. She says that if these plans are implemented, it will mean \"the end of human liberty in the West.\" Wolf believes the real threat is the government's access to the personal data of millions of Americans. According to Wolf, a vaccine passport will lead to the \"the end of civil society....it has the power to turn off your life, or to turn on your life, to let you engage in society or be marginalized.\"\n\nWhat the globalists peddle as \"democracy\" will lead to the end of \"human liberty\" and vaccine passports will play a key role in the loss of freedoms.\n\nThe abusive use of information will become especially nightmarish for those left behind after the Rapture. Vaccine passports, along with the CBDC's, will enable the \"man of lawlessness\" to control all buying and selling throughout the world.\n\nDELUSION #4: THE PANDEMIC TREATY WILL BE BENEFICIAL IN STOPPING PANDEMICS\n\nThe World Health Organization (WHO) met a week before the 2,700 powerbrokers descended upon Davos, Switzerland. High on their agenda was discussion of a Pandemic Treaty. They sell this as something that will result in a prompt and unified response to future pandemics.\n\nHowever, if approved by member nations during their May 2023 meeting, it would give the WHO and its head absolute control over member nations in regard to what he deems as a health emergency.\n\nShould the WHO declare such a crisis, they would prescribe a mandatory course of action for everyone. It wouldn't matter if the president of a nation disagreed, the dictates of the WHO would become law in his or her country. Should a U.S. governor say \"No!\" to the WHO mandates, that also wouldn't matter. The WHO would have the power to militarily enforce compliance with its health dictates.\n\nThose not deceived by the agenda and techniques of the WEF won't be able to resist the mandates of the WHO. Make no mistake: the globalists are liars and coldhearted murderers just like the spirit that's leading them (John 8:44). The Pandemic Treaty, if approved, will kill many more people than it will protect.\n\nDELUSION #5: DEFEATING RUSSIA IN UKRAINE WILL LEAD TO PEACE\n\nThe globalists tell us we must defeat Russia in Ukraine, but don't explain why that's better than directly attacking them. Why put its people in the middle of such a conflict?\n\nCould it be that real reason for the conflict is to weaken American, which is an outcome celebrated in many posts on the WEF website?\n\nThe war in Ukraine has already drained America's supply of military assets and greatly weakened its ability to respond if attacked. President Biden, just this week, announced that the U.S. will send thirty-one advanced Abrams tanks to Ukraine, which will further agitate an already furious Putin. What better way to provoke WW III and appear to be the victim rather than the aggressor?\n\nLeo Hohmann recently wrote an excellent article entitled America 2023: Sleepwalking into World War III. Here's a quote from it:\n\nChina and Russia are both in full-on war mode, mobilizing their economies, their armies and navies for World War III with America.\n\nNotice I said \"America.\" Not \"NATO.\" NATO is America and America is NATO along with its vassal states.\n\nNATO has always been built upon American power. The problem is America has lost its power and any that remains is largely about perception, not reality.\n\nOnce the world figures this out, it's game over. Once they see that the Emperor has no clothes, that it's all smoke and mirrors -- and the balloon incident has started to open people's eyes -- they will be shocked at how weak America actually is.\n\nWhile it might sound reasonable to many, the ruse that we must defeat Russia in Ukraine has become a key factor in the weakening of America's military and an invitation for a much greater conflict.\n\nHow much longer can the U.S. president keep poking Putin in the eye without a devastating response for both America and Europe?\n\nFor those of us in Christ, we have joyous hope! I cannot end such an ominous post without turning all our eyes upward.\n\nPlease remember that God controls all the outcomes of those plotting to destroy humanity. What the Bible long ago said would happen in the last days is happening before our eyes. The Lord declares the \"end from the beginning\" and He \"will accomplish\" His \"purpose\" despite the deadly and vile agenda of the wicked (Isaiah 46:8-11).\n\nI believe the Lord is warning mankind (and the church) that He's coming soon. He's giving the world glimpses of what the devastation will look like during the Tribulation.\n\nWith everything that's happened in 2023, or even in just the past two weeks, I can't imagine we will have to wait much longer for Jesus' appearing, but as always, the timing rests in God's sovereignty.\n\nDuring these perilous times when deadly delusions increase in popularity and biblical truth seems nowhere to be found, it's vital that we keep our hope focused on Jesus' imminent appearing.\n\nIt's passages such as 1 Corinthians 15:50-55, 1 Thessalonians 4:13-5:11, Philippians 3:20-21, and Colossians 3:1-4 that encourage me on almost a daily basis and keep me from despair as I watch what's happening in America and around the world.", "opengraph": {"title": "Deadly Delusions: 5 Lies The Globalists Want You To Believe", "type": "article", "description": "For over a century, the globalists have been putting the pieces in place for the coming new world order. Now it's coming to fruition and most of it is based upon deceiving the masses.", "image": "images/recent/globaljan212016.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/globaljan212016.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.jonathanbrentner.com/", "https://www.jonathanbrentner.com/https/jonathan-brentner-g8fgsquarespacecom/config/2023/2/15/deadly-delusions", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}