{"result_id": "249008", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5921", "timestamp": "2023-04-25 16:54:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5921", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Biden Moves To Bind U.S. To Future WHO Pandemic Policies", "cleaned_text": "Over the weekend, reports surfaced that the Biden administration was preparing to enter the United States into a \"legally binding\" agreement with the World Health Organization (WHO) that would grant the entity authority to mandate America's health care policies in the event of a future pandemic.\n\nExperts say the proposed plan would be an unprecedented violation of the Constitution, which grants the Senate the authority to approve international treaties.\n\nIn order for the proposed treaty to be enacted, it would need to be ratified by all 194 WHO member countries. A meeting is scheduled for February 27 in order to work out the final terms of the treaty.\n\nAccording to The Epoch Times, after a global health emergency is declared, the agreement would grant the WHO the authority to determine \"treatments, government regulations such as lockdowns and vaccine mandates, global supply chains, and monitoring and surveillance of populations\" of all 194 member countries. The WHO is based in Geneva, Switzerland and is a subsidiary of the United Nations.\n\n\"There's never been a bigger power grab than this power grab,\" said former Congresswoman Michele Bachmann on Monday's edition of \"Washington Watch with Tony Perkins.\" \"It's counterintuitive because normally a nation doesn't want to give away its power.\"\n\nBachmann, who currently serves as dean of the Robertson School of Government at Regent University, went on to observe that the proposed treaty would take away governmental sovereignty regarding health care decisions from the top down in the U.S.\n\n\"This means that our politicians in the United States would have no power,\" she said. \"We would lose our voice as a people. Attorney[s] general would lose their voice. Our Supreme Court, federal courts, and state courts would lose authority. Even your local doctor that you go to would lose authority because the executive director of the World Health Organization would be empowered to make decisions over vaccines, masks, lockdowns, and supply chains.\"\n\nAs far back as 2013, the WHO has been embroiled in controversy over its decisions regarding disease outbreaks. The organization \"took five months to declare a public health emergency of international concern (PHEIC) over Ebola [in West Africa], a delay that 'undoubtedly contributed to the unprecedented scale of the outbreak,' according to one academic assessment.\"\n\nSince the beginning of the global COVID pandemic in January 2020, the WHO continued to make controversial decisions. Appearing to take the lead of China during the initial outbreak, the WHO declared that there was \"no clear evidence of human-to-human transmission\" of the virus on January 14, before reversing itself a week later.\n\nWHO Director-General Tedros Adhanom Ghebreyesus also commended China's \"transparency\" and \"leadership\" during the initial outbreak, despite evidence that Chinese authorities attempted to cover it up.\n\nNevertheless, the Biden administration is reportedly moving ahead with agreeing to the \"zero draft\" of the WHO's pandemic treaty. Bachmann pointed to church closures as an example of what can happen when single entities are given expanded authority over local jurisdictions.\n\n\"We saw churches being closed because the CDC was making recommendations at the U.S. federal level,\" she noted. \"We pushed back, and states were trying to push back. Now there would be no difference. There couldn't be a Florida or a Texas or a red state that could opt for freedom. The WHO would have the power to monitor all of our states and surveil us. And this also creates digital passports for our health care. We would lose our power over our health care decisions.\"\n\nBachmann further predicted future consequences of the proposed treaty that could reach far beyond health care.\n\n\"There is no precedent, because the bottom line impact of what this means is this would create a platform for global governance,\" she underscored. \"That's never happened before. The UN has wanted that for years. A number of organizations like the World Economic Forum are advocating a form of global government. The Biden administration is trying to do it through what we call a global pandemic treaty, but they call an accord.\n\nThey're trying to bypass the U.S. Senate, but they're also trying to do it by changing the rules at the WHO. They're going down two tracks because they're determined to reach their goal, which is giving away U.S. sovereignty. In effect, this would create a medical police state, not just for the United States, but for all countries of the world.\"", "opengraph": {"title": "Biden Moves To Bind U.S. To Future WHO Pandemic Policies", "type": "article", "description": "The Biden administration is preparing to enter the United States into a ", "image": "images/recent/who2a.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/who2a.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://washingtonstand.com/news/no-precedent-biden-moves-to-bind-us-to-future-who-pandemic-policies-", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}