{"result_id": "249018", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5478", "timestamp": "2023-04-25 16:54:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5478", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Preparing For The Next Collapse - Central Bank Digital Currency Is Coming", "cleaned_text": "The Office of Financial Research (OFR) is the independent bureau within the United States Department of the Treasury which was formed in response to the financial crisis of 2007-08 -- and the subsequent Great Recession that ensued. The OFR's responsible for collecting financial data and making recommendations to the Treasury's Financial Stability Oversight Council (FSOC) based on that data, who then \"responds to emerging risks to the stability of the United States' financial system.\"\n\nThis is the same department, who for the last 2 years, oversaw one of the largest transfers of wealth in the history of the world -- and they approved every bit of it. Their influence in the global economy cannot be overstated, which is why the OFR's recent white paper is particularly troublesome.\n\nOn July 11, 2022, the OFR published a working paper advocating for a Central Bank Digital Currency. In their abstract, the authors claim that a CBDC will counter against bank runs by \"monitoring the flow of funds into CBDC\" which \"allows policymakers to identify and resolve weak banks sooner, which also decreases depositors' incentive to run.\"\n\nWhile this may seem like a good way to prevent a bank run, the fact that a bank run is happening at all should send chills down your spine. The fact that the OFR is preparing for one is unsettling enough, but the fact that their answer is a CBDC should make everyone start to pay attention.\n\nRemember in February when Canada's Prime Minister began freezing the bank accounts of protesters who stood against tyrannical mandates and arresting them? Not only did they go after the protesters, but the government went after the bank accounts of those who provided monetary support in the form of donations as well.\n\nFor practicing their free speech, Canadians were persecuted and driven into financial ruin by the government who claims to protect them. This was all carried out with zero due process, without any democratic input at all, and with zero resistance from the banks, who later apologized.\n\nThink about the ease with which this was done using the Canadian dollar and real money inside real banks and then consider the implications had the Canadians already adopted the federated digital ID system with a digital asset controlled by the central bank and the state. Sounds like a conspiracy theory, doesn't it? Unfortunately, it's not and it will be here before you know it.\n\nBut don't take my word for it, listen to Neil Parmenter, the President and CEO of the Canadian Bankers Association explain how this new system, supported by the World Economic Forum, will work. Plastic credit cards, ID cards, and cash are a thing of the past. Under the Great Reset, your entire financial portfolio will be controlled by the central bank and your assets relegated to a Central Bank Digital Currency (CBDC), that can be turned off in a split second by the tyrannical regime you dare to criticize.\n\n\"Canada's banks are perfectly situated to help lead the creation of a federated digital ID system between government and the private sector.\n\nWe just witnessed Canada seize the assets of its citizens for peaceful protest, and now they are pushing a new system in which the state and central banks literally control everything. And it's spreading -- to America.\n\nOn top of this month's working paper, in February, Federal Reserve Board Governor Lael Brainard laid out plans for the United States to adopt a similar system.\n\n\"It is essential that policymakers, including the Federal Reserve, plan for the future of the payment system and consider the full range of possible options to bring forward the potential benefits of new technologies, while safeguarding stability,\" Brainard said in remarks prepared for delivery to the U.S Monetary Policy Forum in New York. \"A U.S. CBDC may be one potential way to ensure that people around the world who use the dollar can continue to rely on the strength and safety of U.S. currency to transact and conduct business in the digital financial system.\"\n\nDon't let the rhetoric about competing in the digital currency age fool you. Bitcoin and other decentralized cryptocurrencies are a threat to the global banking cartel because they cannot control it. The anonymity and independence fostered by cryptocurrencies on the blockchain are enemies to the ruling class who seek to maintain control through centralization.\n\nThis is why China, last year, banned cryptocurrency trading and mining. It is a threat to their totalitarian grip over its citizens. It is also why they have ushered in the digital yuan. China has been working on their own digital currency since 2014 and the e-CNY is already being pushed on its citizens.\n\nThe e-CNY is completely controlled by the People's Bank of China (PBOC), the country's central bank and the Chinese Communist Party who exclusively leads the People's Republic of China. Every single transaction conducted with the e-CNY is a matter of state record.\n\nGiven China's Orwellian social credit system which punishes people for smoking, bad driving, shining a negative light on the CCP, and wasting money on \"frivolous purchases,\" the idea of the state controlling the whole of an individual's assets is chilling. Yet this is exactly what has been unravelling in China for the last 8 years. And others are now following suit.\n\nOne indicator that CBDCs are an ominous ploy by the banking cartel and the state to take over our lives is the fact that the Atlantic Council is a lead proponent of them. For those who may be unaware, the Atlantic Council is the think tank contracted by Facebook and Twitter to conduct censorship operations on their platforms.\n\nTheir censorship arm, known as the Digital Forensic Research Lab, was suspected to have played a large role in the removal of hundreds of anti-establishment pages in 2018 and the years after.\n\nOn their website, the Atlantic Council advocates for central bank-controlled digital currencies, and notes how 87 countries - which account for over 90% of the world's gross domestic product - are exploring a digital currency, and five countries have already launched one.\n\nOne of the main reasons the council and others advocate for such a centralization of power is to limit or prevent \"illicit activity.\" This is a prominent selling point from both the Atlantic Council and the equally dubious World Economic Forum.\n\nIn their White Paper Series on a Digital Currency Governance Consortium, the WEF outlines a plan for private entities, i.e. central banks, and the state to work together to prevent any activity the two deem \"illicit\" -- like protesting forced vaccinations, for example.\n\nAn outspoken opponent to the CBCDs is Maajid Nawaz who recently appeared on the Joe Rogan podcast and laid out in shocking detail the implications for such a system, which as illustrated above is being pushed by all the world's power players. In his example, he notes that the vaccine passport system is the gateway through which the digital currency will be pushed.\n\n\"So the vaccine passport infrastructure is in place. But now we know that the vaccine doesn't stop infection or transmission but the Checkpoint Charlie exists everywhere. They bring in digital banking, central banking, digital currencies. You've got a scenario now that you're checking in and out everywhere you go, using vouchers that are programmed and you can only spend where you're told you can spend them.\n\n\"There's another word for that. That's called the Chinese social credit system. That's what it's called. And anyone who watches Black Mirror will know what I'm talking about,\" Nawaz said.\n\n\"So what they are telling us, and when I say they, who's they, people in power, that's the head of our economy, the Chancellor of the Exchequer, the second most powerful person other than the prime minister, and maybe the foreign secretary in the UK, right?\n\n\"He's telling us I just played it there for you. He's telling us that's what he, as the UK, the head of the G7 want to bring in for the G7. So a scenario where like in New York at the moment, because the passport infrastructure is in place, you bring in that digital currency, and you've got this total control. And if I'm speaking to you the way I'm speaking now, and my employer or government... deems me as saying or doing something inappropriate, suddenly, I can't actually pay to come here and speak to you anymore. My digital currency won't even pay for the ticket. Because it will be known that I'm coming to speak to you, 'sorry, your vouchers don't allow you to purchase that ticket to go and speak to Joe.'\"\n\nThis is a system that Hitler, Stalin, or Mao would have relished. Imagine a dictator having global transaction censorship across their empires, and at the touch of a button they could silence their political enemies and propel them into financial ruin. That is what's coming.", "opengraph": {"title": "Preparing For The Next Collapse - Central Bank Digital Currency Is Coming", "type": "article", "description": "Imagine a dictator having global financial transaction censorship across their empires, and at the touch of a button they could silence their political enemies and propel them into financial ruin. That is what's coming.", "image": "images/recent/digitalcashmay032016.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/digitalcashmay032016.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/2022/07/us-treasury-just-published-a-working-paper-pushing-for-central-bank-digital-currency-to-counter-bank-runs.html", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}