{"result_id": "249030", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4464", "timestamp": "2023-04-25 16:54:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4464", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Will Vaccine Refusal Result In A Two-Tier Society?", "cleaned_text": "In the wake of reports from the UK that those who refuse to be vaccinated will be denied access to certain otherwise normal activities, concerns are ramping up that refusing the jab will result in being relegated to the societal trash heap.\n\nAs reported recently in Reuters regarding Great Britain, \"People who refuse a vaccine for COVID-19 could find normal life curtailed as restaurants, bars, cinemas and sports venues could block entry to those who don't have proof they are inoculated...\"\n\nAs reported here the vaccine may become mandatory to go to work and as well as to travel in and from the UK.\n\nA number of dystopian sci-fi novels predicted the eventual establishment of a two-tier society, the \"acceptables\" and the \"unacceptables.\"\n\nIn Yevgeny Zamyatin's classic WE, the \"unacceptables\" live outside the city limits, behind what is called the \"Green Wall.\" Those living outside the wall have, in fact, grown fur, a further demarcation of their social distance from their walled-in brethren.\n\nIn Eric Gonzalez-Payne's as yet unpublished and eerily current dystopian science fiction manuscript, Ola Credit, we see an invocation of a social credit system, very much akin to what has been rolled out in China and is being covertly rolled out in the US, which is resulting in certain people being blocked from financial and medical services.\n\nThe revocation of services by PayPal for numerous independent media websites, including this one, is also redolent of the creation of tiers--the fully vested and those who are not.\n\nSo let's take a look at the US situation vis-à-vis the vaccination and see where we stand.\n\nTrump's Executive Order, signed on December 8, 2020, clearly makes the shots optional. However, recent reports from the Pentagon indicate that there may be an impetus at some point in time to make them mandatory.\n\nAccording to Defense Department spokesman Jonathan Hoffman, the voluntary nature of the immunizations could change as time goes on. Once the FDA fully licenses a vaccine, \"at that point voluntariness may change to mandatory,\" Hoffman said. \"That's a possibility in the future.\"\n\nThe fact is that certain Americans are already being denied - well, what would you call sending and receiving money via Western Union or PayPal? What would you call being refused medical services which you are positioned to pay for? Are these rights or privileges? And does the invocation of denial of services point to the creation of a two-tier society, the entitled and the disenfranchised?\n\nIn China, which has a publicly acknowledged social credit system, a low social credit score can impact your employment prospects as well as those of your children. As US whistleblowers and others are now being hit with denial of services, it does appear that a two-tier system is in the process of a roll out here, as well.\n\nAccording to polls, approximately half of the US population is reluctant to take the Covid vaccine, an mRNA vaccine which is entirely new and has no track record. Some of these folks are most likely \"on the fence\" and will be swayed by the threat of loss of work and the concomitant ugly realities of homelessness and hunger.\n\nAs reported recently in The Washington Post, the Executive Vice-President of the Kaiser Family Foundation, Larry Levitt, stated that \"The success of Biden's presidency likely rests in large part on tamping down the pandemic and having a successful vaccine rollout....The Biden administration is going to need to bring red America and blue America together. If the vaccine is a repeat of masks, our efforts to end the pandemic will be stymied.\"\n\nWhile President-elect Joseph Biden has declared that he will not make vaccinations mandatory, some of his other comments indicate that he believes there are other ways to \"get people on board\" to be vaccinated.\n\n\"The Public's Role in COVID-19 Vaccination\", a July 2020 report from Johns Hopkins Center For Health Security and Texas State University suggested that public health agencies \"bundle vaccination with other safety-net services\" like food stamps. This report sparked a wave of concern that food stamps and other safety-net services would be tied to receiving the vaccine.\n\n\"I will do everything in my power as president to encourage people to do the right thing and when they do it, demonstrate that it matters,\" Biden has said. If Biden has been subtly equivocating on vaccine mandates, he has come down firmly in support of mandating masks, saying that for his first hundred days in office,\n\n\"Every American to wear a mask when they are around people outside their household.\" He has also called upon Governors to mandate mask wearing in their states and for \"Local authorities to also make it mandatory to buttress their state orders.\"\n\nWhat that means, folks, is arrests, jail time and/or fines for those defying the mandate.\n\nAmericans are already feeling the devastating financial effects of lockdowns. The stick has been wielded. Now it is time for the carrot to appear.\n\nIf the trend in the UK to make second class citizens of vaccine refuseniks is exported to America, expect to see the finances of the vaccinated improve while those refusing to take the shot end up on the streets, fighting over a bowl of soup or a cot in a homeless shelter.", "opengraph": {"title": "Will Vaccine Refusal Result In A Two-Tier Society?", "type": "article", "description": "People who refuse a vaccine for COVID-19 could find normal life curtailed as restaurants, bars, cinemas and sports venues could block entry to those who don't have proof they are inoculated.", "image": "images/recent/covidvdec092020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/covidvdec092020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/2020/12/will-vaccine-refusal-result-in-a-two-tier-society.html", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}