{"result_id": "249031", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4547", "timestamp": "2023-04-25 16:54:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4547", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "What Catholics should know about Covid vaccine", "cleaned_text": "Like every other innovative solution to the world’s problem, the Covid vaccine has received its own fair share of criticism across all levels, ranging from religion to politics to personal ideologies to even science.\n\nIn this article, we would not only debunk false assumptions on the covid vaccines, we would also enlighten Catholics on what they should know about the vaccines. This piece promises to be entertaining and informative at the same time. Enjoy your reading.\n\nAs a way of beginning, let’s take a dive into what Covid is and why people need vaccines. According to WHO, “Covid-19 is an infectious disease caused by the coronavirus. Most people infected with this virus will experience mild to moderate respiratory illnesses and may recover without treatment while other people or those with underlying medical problems are more likely to develop serious illnesses.”\n\nCovid vaccines help to build immunity in a vaccinated person against the Covid virus. Vaccination ensures that there is a reduced chance of getting infected by the virus. There are a number of Covid vaccines out there, such as Pfizer, Johnson & Johnson, Moderna.\n\nNext, we address some misconceptions about the Covid vaccine;\n\nOne of the most popular myth affecting the acceptance of Covid vaccine amongst Catholics is the belief that the vaccines are a way of identifying with the devil. They claim that taking Covid vaccine is taking on the mark of the beast. This is wrong on all grounds, as taking the vaccine is simply protecting oneself against the risk of coronavirus. The vaccines have no inclination to any spiritual group. In fact, Pope Francis and the United States Conference of Catholic Bishops have openly endorsed its usage by all people, especially Catholics.\n\n2.) They claim they used stem line cells from abortion either during testing or in production of the vaccines and the Catholic Church is against abortion, therefore it’s morally wrong to take the vaccine.\n\nThe Catholic tradition strongly advises against abortion but in a note issued in December 2020, the Vatican Congregation for the Doctrine of the Faith says that “vaccination is not obligatory, it must be voluntary, however the common good may recommend vaccination specially to protect the weakest and most exposed”. Also, Pope Francis says that because of the danger Covid-19 poses to the Catholic congregation and the world at large, it is not morally wrong to use vaccines.\n\n3.) Researchers hurriedly produced the vaccines;therefore, its effectiveness is uncertain.\n\nWhile there are quite several reasons they developed the vaccines in record time, we would consider two; one is the processes used in developing the Pfizer and Moderna vaccines have being existing for years, so it was easier to improve on the method. Second, China helped the research process by sharing genetic information to fast track the entire process of producing a vaccine in record time.\n\nThis is completely false on all grounds. When a woman takes the Covid vaccine, there is a spike in protein that is produced in her body. This spike helps the body to create a resistance against the virus. There was once a report on social media that claimed that when you take the Covid vaccine that there is a protein spike called syncitin-1 that is produced in the body and resists pregnancy. These two spikes are completely different. The latter doesn’t occur in women after taking the Covid vaccine. Pfizer, during its vaccine test trial, injected 23 women volunteers and 22 of them got pregnant. The exception had not taken the Covid vaccine.\n\nNow we can proceed to discovering facts about the Covid vaccine that every Catholics should know:\n\n1.) The Covid vaccines available can effectively protect the body against severe diseases and the eventuality of death that can arise from contacting the variants of Covid-19 that are plaguing the world.\n\n2.) After vaccination, the use of , sanitizers, washing of hands and the practice of observing social distancing should still be continued. Activities that you embarked on pre-Covid could continue, but we should ensure safety precautions at all times.\n\n3.) After vaccination, it is possible that there can be side effects such as sore arm from the shots, body weakness or tiredness, headache, feeling sick. Note that these symptoms are peculiar to people. Some people take the vaccines and show no side effects, while others take it and show extreme symptoms. It all depends on the body system. These side effects should fade off after a few days.\n\n4.) They can administer covid vaccine from the ages of 12 and above. Health practitioners give vaccines at no cost. The entire process of taking a vaccine should take about five minutes or fewer, therefore vaccination is fast, easy and free.\n\n5.) If in the past you have contracted the virus, you would still need to get the vaccine. There is no concrete study to show how long natural immunity could last after full recovery from Covid, therefore it is advisable to take the vaccine even if you contracted the virus in the past.\n\n6.) The Covid vaccine does not affect your body's DNA. These vaccines help the body effectively fight coronavirus. In doing that, the RNA messenger enters the cells. The mRNA then ensures the cells produce enough protein to build a strong immune system. In all this, the RNA messenger does not enter the nucleus of the cell where the DNA is located.\n\n7.) COVID-19 vaccines were not made with controversial or inferior materials, such as microchips and tracking devices. Instead, they are made from basic vaccine ingredients, mRNA, negligible quantities of sugar, salt, and many more. Therefore, vaccines are safe to be used.\n\n8.) Another important fact about the Covid vaccine is that you can take your two shots even if you have an existing health condition as long as there was no severe reaction to the first dose of the vaccine or any of its ingredients. Whichever category you fall into reaction or not, once you are sure you have an existing condition, speak to your doctor before taking the vaccine.\n\n9.) Study has shown that only a small percentage of people might contact the virus after complete vaccination. Sometimes, some people show symptoms while others don’t. The risk of death or severe illnesses by the virus is reduced once vaccinated. Therefore, safety precautions must be strictly adhered to as much as possible.\n\n10.) Covid vaccine boosts the immune system of all blood types from the risk of suffering severely once in contact with the virus. Research has not proven that a particular blood type would suffer severely than others therefore, people of all blood types need to take the vaccine. Also, even if an individual doesn’t have any underlying illness or health complications, it is important they take the vaccine. It is doing yourself, family and community good.\n\nIn this article, we have learnt about everything a Catholic should know about the Covid vaccines and have debunked false and untrue claims about the vaccines. So, if you haven’t been vaccinated, do yourself, family and community good by getting a vaccine.", "opengraph": {"title": "What Catholics should know about Covid vaccine", "type": "article", "description": "Like every other innovative solution to the world’s problem, the Covid vaccine has received its own fair share of criticism across all levels, ranging from religion to politics to personal ideologies to even science.", "image": "images/recent/covidvdec092020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/covidvdec092020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.holyart.com/liturgical-accessories/protection-and-safety-devices", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}