{"result_id": "249016", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4679", "timestamp": "2023-04-25 16:54:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4679", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Digital Vaccine Passports Are Coming Whether We Like It Or Not", "cleaned_text": "In my past articles I wrote about Digital Vaccine Passport pilot programs in New York, global announcements and along the same lines, health passports and vaccine passport apps in which a traveler (or event goer, employee, or shopper) uploads their COVID-19 test results or vaccination status.\n\nUnless the EU Parliament suddenly became enamored with conspiracy theorists, that is exactly what is going to happen.\n\nIn March, the European Commission opened a proposal to create a \"Digital Green Certificate\" to allow travel inside the EU during the \"pandemic.\"\n\nThis Digital Green Certificate would serve as a documentation that a person has been vaccinated for COVID, received a negative test for COVID, or has recovered from it. It will include a QR Code to ensure the authenticity and security of the certificate and will be made free of charge in paper or digital form.\n\nThe Digital Green Certificate will have three certificates included within it including:\n\nVaccination certificates, stating brand of the vaccine used, data and place of inoculation and number of doses administered.\n\nNegative test certificates (either a NAAT/RT-PCR test or a rapid antigen test). Self-tests will be excluded for the time being.\n\nMedical certificates for people who have recovered from COVID-19 in the last 180 days.\n\n\"Where member states accept proof of vaccination to waive certain public health restrictions such as testing or quarantine, they would be required to accept, under the same conditions, vaccination certificates issued under the Digital Green Certificate system,\" the Commission said in a statement.\n\nThe instrument will be valid in all EU countries and will be open for Iceland, Liechtenstein, Norway as well as Switzerland. It will be issued to EU citizens and their family members, regardless of their nationality.\n\nOther countries are following suit in the Digital Vaccine Passport scheme\n\nBut while the EU debates what sort of technology to use and what parameters will be included, various European countries are taking matters into their own hands, choosing instead to create their own versions of a vaccine passport, all varying between each country. For instance, Estonia is planning to launch its own pilot program at the end of April. France is doing the same.\n\nIn addition, the World Health Organization, who recently opposed the creation of a vaccine passport, is now working to do just that. And they are all working with the usual suspects - Google, Apple, Microsoft, IBM and a host of other corporations.\n\nWhat is more likely is that European countries will all implement different versions of the passport and, in the midst of chaos, the EU will have to step and standardize the process. The WHO will likely lead the charge in implementing the process worldwide.\n\nWhat does a Vaccine Passport mean for you as an American? A lot, actually\n\nFirst, if you plan on traveling to or through Europe anytime soon (and possibly forever) you may have to grab yourself one of these passports. Of course, the EU Commission has stated that the move is temporary. Once the World Health Organization (now owned by Bill Gates) declares an end to the global health emergency the digital passports will be suspended. So they say.\n\n\"The Digital Green Certificate will not be a pre-condition to free movement and it will not discriminate in any way. A common EU-approach will not only help us to gradually restore free movement within the EU and avoid fragmentation,\" explained Commissioner Reynders. Except that a \"pre-condition to free movement\" is the whole point and \"discrimination\" is at the core of the passport.\n\nBut back to America. There are already plans to introduce a similar scheme in the United States. In fact, \"coincidentally\" the United States is now discussing a similar vaccine passport. As tens of millions of Americas, having been terrorized for a year, line up like cattle for their \"vaccines,\" the United States is planning to develop a \"vaccine passport\" that will allow those vaccinated to travel and \"enjoy other aspects of pre-pandemic life.\"\n\nIn other words, freeze the unvaccinated out of normal life altogether.\n\nDigital Vaccine Passports in the US are up for debate\n\nA senior advisor to the White House has signaled that the government will be taking a hands-off approach to the whole ordeal saying \"it's not the role of the government to hold that data and to do that.\"\n\nSo with that in mind, it's likely that private corporations will be enlisted to act as the new feudal overlords that Carroll Quigley predicted years ago. More than likely, it will be companies like RAND who are involved in developing and implementing the vaccine passport scheme. In fact, RAND analysts are already making public comments on the type of scheme that will be implemented.\n\n\"Inevitably I think there are going to be these passports because people are eager to go back to a sense of normalcy,\" said Dr. Mahshid Abir, a senior physician policy researcher for the RAND Corp. \"From both the supply and demand side, there is impetus to get tourism and traveling back on track, and go back to some semblance of normalcy.\"\n\nUS News and World Report quotes Abir further when it writes \"One other potential benefit of requiring a vaccine passport to travel, eat out or attend a rock concert might be that it would pressure some vaccine-hesitant folks into getting their inoculation, Abir said.\"\n\nSome states, however, have refused to participate in this gross violation of civil liberties. Florida and South Carolina have been clear they are opting out. But some Communist controlled states like New York are already implementing the passport scheme. As USA Today wrote,\n\nStarting Friday, New Yorkers will be able to pull up a code on their cellphone or a printout to prove they've been vaccinated against COVID-19 or recently tested negative for the virus that causes it.\n\nThe first-in-the-nation certification, called the Excelsior Pass, will be used first at large-scale venues like Madison Square Garden. But next week, the pass will be accepted at dozens of event, arts and entertainment venues statewide. It already lets people increase the size of a wedding party, or other catered event.\n\nStill don't believe Digital Vaccine Passports are coming?\n\nSo there you have it. A vaccine passport being rolled out in the EU (\"temporarily\" of course) and simultaneously in the United States. Still think this is not a coordinated effort to restrict travel and civil liberties? If you do, then I have some oceanfront property in Arizona to sell you. But, unless you've been vaccinated, you won't be able to travel to see it.", "opengraph": {"title": "Digital Vaccine Passports Are Coming Whether We Like It Or Not", "type": "article", "description": "The first-in-the-nation certification, called the Excelsior Pass, will be used first at large-scale venues like Madison Square Garden. But next week, the pass will be accepted at dozens of event, arts and entertainment venues.", "image": "images/recent/passportapril272020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/passportapril272020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theorganicprepper.com/", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}