{"result_id": "249012", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5052", "timestamp": "2023-04-25 16:54:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5052", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "The Power Of Digital Surveillance To Create Social Credit Style Scores", "cleaned_text": "Patent and trademark attorneys Dr. Gal Ehrlich and Maier Fenster of Ehrlich & Fenster recently had a US patent approved for a technology that aims to surveil people via their digital activity, give them a score that defines \"the potential level of super-spreading activity of each individual,\" and then vaccinate people based on this score.\n\nThe patent proposes collecting a wide range of personal information from sources such as mobile devices, apps, social media, web browsing records, payment records, medical records, employment records, the government, and surveillance cameras.\n\nIt also suggests collecting highly specific personal information via these sources such as:\n\n- The length of time people spend at the locations they visit\n\n- The ventilation rate of the places people visit\n\n- Images of people looking at the screen of their mobile phone\n\n- Sounds from the microphones in personal devices\n\nThe patent proposes numerous potential surveillance applications for this data which include detecting when people are using public transport by using \"geolocation and/or regular start-stop movement that matches a public transportation profile,\" monitoring when people are washing their hands by \"analyzing sounds of water running or movement by a smartwatch,\" and checking whether people are wearing a mask by \"analyzing images taken during calls or other looking at screen of cellphone.\"\n\nOnce the data has been gathered, the technology outlined in the patent analyzes the data and assigns a \"score\" to their electronic device. It suggests using this score to predict the \"the potential level of super-spreading activity of each individual\" and recommends \"vaccinating according to score.\"\n\nNot only does the patent suggest mass electronic surveillance of people to create a social credit style score that determines when they should be vaccinated but it also proposes that the technology could be deployed as part of a \"dedicated mandatory app\" where \"the government may order the citizens to install a dedicated application on their smartphones (or other smart devices like tablets, smartwatches, smart glasses, etc.) to help the government with the logistics of the vaccination procedures.\"\n\nThe patent adds that \"in some embodiments\" of this mandatory system, \"the app and/or the smart device is configured to inform on the user's location at all times and to communicate with adjacent smart devices (via Bluetooth for example) to assess the interactions between users, for example, vicinity between users, movement of users, etc.).\"\n\nWhen it comes to factors that determine an individual's score, the patent suggests that a person's profession, medical data, the nature and type of locations they visit, their frequently visited locations, and the length of time they spend at locations should be used as part of the calculation.\n\n\"In some embodiments, subjects that are prone to frequent religious or secular events, like in a synagogue, a church or a mosque or a dancing venue, where the people are in close proximity to each other, and talk, pray, sing and/or breathe deeply and/or mingle more, will receive a higher score (e.g., for such a contact event) than those who do not frequent religious events,\" the patent adds.\n\nThe patent was approved on August 31 and follows governments around the world implementing increasingly far-reaching surveillance measures amid the coronavirus such as vaccine passports that aim to exclude people from economic and social activities and apps that use geolocation and face recognition to police quarantine.", "opengraph": {"title": "The Power Of Digital Surveillance To Create Social Credit Style Scores", "type": "article", "description": "A new US patent as been approved for a technology that aims to surveil people via their digital activity, give them a score that defines ", "image": "images/recent/surveillancedigital1.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/surveillancedigital1.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/2021/11/new-patent-proposes-digital-surveillance-to-vaccinate-people-based-on-social-credit-style-scores.html", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}