{"result_id": "249024", "URL": "https://www.prophecynewswatch.com/article.cfm?popular_news_slot=3L", "timestamp": "2023-04-25 16:54:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?popular_news_slot=3L", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Recruitment Plummets As Biden Military Becomes Indoctrination Zone", "cleaned_text": "The military is struggling mightily to meet their recruitment goals. In August, reports came in that the Army had only \"recruited about 52% of its goal for fiscal year 2022 and is likely to wind up short by as many as 15,000 recruits.\" Significant shortages in personnel are also being reported by the Air Force and Navy. Meanwhile, Biden's military leaders continue to flounder in woke ideologies that are being pushed on servicemembers.\n\nWhile a shrinking pool of potential recruits due to increasing trends in obesity, drug use, and poor academic performance is partially to blame for the recruitment shortfall, what cannot be ignored are the woke policies being forced onto our servicemembers by the Biden administration and Democrats, which damage morale, increase the number of troops voluntarily leaving, and scare away potential recruits.\n\n\"Young Americans are observing what's happening in our military services and they don't like what they see,\" Lt. Gen. (Ret.) Jerry Boykin told The Washington Stand. \"They see a military that spends far more time on being woke than on winning the nation's wars. Furthermore, they see how the chain of command treats people who have religious objections to taking a vaccine that they do not want and therefore should not be required to take.\"\n\nThe Biden administration indeed continues to refuse to back off of their onerous requirements for all servicemembers to receive the COVID-19 shot, despite Biden declaring on Sunday that \"the pandemic is over,\" and despite multiple court losses after the mandate was challenged by troops.\n\nStill, even with massive recruiting shortfalls and a military that is being increasingly stretched thin across the U.S. and the globe, the Biden administration is on the verge of dismissing upwards of 60,000 troops (the actual number of unvaccinated troops could be as high as 500,000, or a quarter of the military) and seemingly not caring.\n\nTo make matters worse, Biden's military leaders are also failing at taking care of their servicemembers' most basic needs. The Post Millennial reported on September 10 that the Army is now advising military families to apply for food stamps in the midst of rising inflation. As the report pointed out, \"Somehow, the $175 billion that the Army received in funding from taxpayers in the 2022 fiscal year does not cover the costs of even feeding soldiers' families.\"\n\nWith unprecedented shortfalls in recruiting numbers, with servicemembers' families struggling to put food on the table, with Russia mobilizing an additional 300,000 troops to Ukraine, and with China breathing down the neck of Taiwan, what is the Left's biggest military concern? Apparently, it's that 128 military bases around the country are not sufficiently close enough to abortion facilities, as Rep. Jackie Speier (D-Calif.) helpfully pointed out on the House floor Tuesday.\n\nOther top military concerns on the Left include \"diversity and inclusion\" training, which, as Fox News reported Thursday, includes the U.S. Air Force Academy \"instructing cadets to use words that 'include all genders' and to refrain from saying things like 'mom' and 'dad.'\"\n\nThis was a bridge too far for Rep. Doug Lamborn (R-Colo.), Ranking Member of the House Armed Service's Strategic Forces Subcommittee, who sent a letter to the superintendent of the Air Force Academy on Tuesday, echoing the sentiments of millions of Americans greatly troubled by the downward trajectory of the world's most powerful and important fighting force.\n\n\"The purpose of your institution is to make our future Airmen and Guardians more lethal, not more politically correct,\" Lamborn underscored. \"This is exactly the kind of woke virtue signaling that has undermined public confidence by millions of Americans in our Armed Forces. Military effectiveness depends on cohesion -- not division. I ask that you seriously reconsider the military education you are conferring onto our future servicemembers and vigilantly protect those under your watch from being subjected to exaggerated diversity indoctrination and woke political agendas.\"\n\nAs if to drive home Lamborn's point, the Pentagon issued a 200-page report Thursday celebrating the repeal of the \"Don't Ask, Don't Tell\" policy, which is yet another example of the kinds of activities that the military is spending its time and tax dollars on instead of training for, fighting, and winning wars.\n\nThe United States Air Force Academy also recently circulated promotional information among its cadets for the Brooke Owens Fellowship, which specifically bans 'cisgender men' from applying.\n\nThe email sent on September 14, encourages cadets to apply to the program, which states: 'If you are a cisgender woman, a transgender woman, non-binary, agender, bigender, two-spirit, demigender, genderfluid, genderqueer, or another form of gender minority, this program is for you.\n\n'If you are a cisgender man, this program isn't for you...\n\nA concerned Air Force cadet shared the email because, he told Fox News, 'It's a little worrying that we have more briefs about D&I than briefs about foreign adversaries, emerging technologies or current events across the world.'\n\nWe must pray for the conversion of the Biden administration, for our military leaders, and for fortitude for our fighting men and women who must endure such misguided and reckless leadership.", "opengraph": {"title": "Recruitment Plummets As Biden Military Becomes Indoctrination Zone", "type": "article", "image": "images/popular/wokemilitary2a.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/popular/wokemilitary2a.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://washingtonstand.com/commentary/as-recruitment-plummets-bidens-military-brass-double-down-on-wokeness-"], "authors": [], "publish_date": null}