{"result_id": "249046", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4910", "timestamp": "2023-04-25 16:54:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4910", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Ominous New Definitions For What Constitutes 'Domestic Terrorism'", "cleaned_text": "Are you a potential domestic terrorist? You may not think so, but the Department of Homeland Security may see things quite differently. A brand new terrorism advisory has just been issued, and some of the things that it identifies as \"potential terror threats\" should chill us to the core.\n\nYou see, the truth is that the definition of a \"terrorist\" is constantly evolving. In the old days, a Middle Eastern male that dresses in traditional Islamic attire, that grows opium in his field and that carries around an AK-47 would have been considered a \"potential terrorist\" by U.S. authorities.\n\nBut now we have lost the war in Afghanistan and the Taliban are partying like it is 1999 in the presidential palace in Kabul. As a result, our spooks need a new group of \"potential terrorists\" to send to Guantanamo Bay, and so they are setting their sights on you.\n\nYou may be tempted to think that I am exaggerating.\n\nI truly wish that I was.\n\nNBC News is telling us that a \"terror alert\" has just been issued by Homeland Security, and during their report on this new \"terror alert\" a very alarming graphic was shown to the viewers.\n\nUnder the heading \"POTENTIAL TERROR THREATS\", the following three categories were listed...\n\n-\"CLAIMS OF ELECTION FRAUD, BELIEF TRUMP CAN BE REINSTATED\"\n\nWe have never seen anything quite like this before.\n\nNow \"opposition to COVID measures\" is something that can make you a \"potential terrorist\"?\n\nSo precisely what does that mean?\n\nDoes someone become a \"potential terrorist\" if they speak out against masks, lockdowns or vaccines?\n\nWhat about sharing information that contradicts the official narratives about COVID? Will that make someone a \"potential terrorist\" as well?\n\nIf that is the case, then researchers at the Mayo Clinic may soon get hauled off to Guantanamo Bay...\n\nResearchers from the Mayo Clinic in Rochester, Minnesota, found that the Pfizer-BioNTech vaccine - the most commonly used shot in the U.S. - was only 42 percent effective against infection, while the Moderna vaccine was only 76 percent effective in July.\n\nFor the study, published on pre-printer server medRxiv.org - meaning it has not yet been peer review - the team gathered data on more than 25,000 Minnesotans from January to July.\n\nWhen Dr. Fauci was asked about that study, he quickly dismissed it as bad information.\n\nAnd whatever Fauci says must be the gospel truth, because we have been told that any criticism of Fauci is an attack on science itself...\n\n\"Attacks on me, quite frankly, are attacks on science,\" Fauci said Wednesday. \"All of the things I have spoken about, consistently, from the very beginning, have been fundamentally based on science. Sometimes those things were inconvenient truths for people.\"\n\nSome have even gone so far as to suggest that any \"far-right extremists\" that dare to criticize Fauci should be treated like terrorists.\n\nSo be very careful about what you say about beloved Lord Fauci.\n\nAt one time we actually had freedom of speech in America, but now those days are long gone.\n\nEven if you don't get into trouble with the government, the big tech companies may decide to censor you into oblivion if you start saying the wrong things.\n\nAnd most Americans can never actually keep up with the latest speech standards, because they are constantly in a state of evolution.\n\nFor example, earlier today I was absolutely shocked to learn that you can get banned on YouTube for offering to pray for someone that has COVID. Apparently that can qualify as \"content\" that encourages people to avoid needed medical treatment...\n\n\"Content that encourages the use of home remedies, prayer, or rituals in place of medical treatment such as consulting a doctor or going to the hospital\"\n\nWe really are becoming a \"1984 society\", and it is only going to get worse.\n\nIf your goal is to conform as much as possible, you are in luck, because the Department of Homeland Security has issued some key information guidelines for you to follow so that you can \"stay safe\" while you are online...\n\nRely on trusted sources. For situational updates on COVID-19 and stay-at-home guidelines, rely on information provided by state and local health officials, as well as the Centers for Disease Control and Prevention (CDC) at coronavirus.gov and the Cybersecurity and Infrastructure Security Agency (CISA) atcisa.gov/coronavirus.\n\nThink before you link. Slow down. Don't immediately click to share posts, memes, videos, or other content you see online. Some of the most damaging disinformation spreads rapidly via shared posts. Check your sources before sharing.\n\nBe careful what you post. The information you share online can be misunderstood or repurposed via manipulation. Do a privacy check on your social media accounts and make sure you are not sharing content broadly that you mean only for close family and friends. Be aware that agents of disinformation often steal identities of real people, profile photos, and other information.\n\nBe wary of manipulative content. Agents of disinformation are known to create or repurpose emotional videos and photos, and to use sensational terms to divide us. Be especially careful of content that attempts to make people angry or sad or create division.\n\nIn other words, embrace whatever they tell you to believe, and don't you dare share anything online that even looks like it might contradict any of their narratives.\n\nPersonally, I am stunned at how rapidly our society is changing. As I discussed a few days ago, a bill has actually been introduced in Congress which would permanently ban those that have not been fully vaccinated from ever flying again.\n\nHopefully that bill never becomes a law, but the Biden administration has already pushed things way too far. Each week we take even more steps into authoritarianism, and that should deeply alarm all of us.\n\nIf our leaders are willing to get so extreme during a relatively minor crisis like this pandemic, what are they going to do when things start getting really, really crazy?\n\nFreedom is such a fragile and precious thing.\n\nPrevious generations of Americans understood this, and they were extremely diligent to make sure that future generations of Americans would live free too.\n\nBut now dark times are here, and if you express your love for freedom too loudly you may soon discover that authorities have identified you as a \"potential terrorist\" too.", "opengraph": {"title": "Ominous New Definitions For What Constitutes 'Domestic Terrorism'", "type": "article", "description": "Are you a potential domestic terrorist?  You may not think so, but the Department of Homeland Security may see things quite differently.  A brand new terrorism advisory has just been issued, and some of the things that it identifies as ", "image": "images/recent/threatsaug172021.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/threatsaug172021.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://endoftheamericandream.com/they-have-come-up-with-some-ominous-new-definitions-for-what-constitutes-domestic-terrorism/", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}