{"result_id": "249011", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5037", "timestamp": "2023-04-25 16:54:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=5037", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Why The Stage Is Set For The End Times", "cleaned_text": "As a student of bible prophecy for almost 30 years, and specifically end times bible prophecy, no other time has seemed as close to the end times as right now. Why do I say this? Because, particularly in the past year, the geopolitical and economic stage has been set for the fulfillment of several end times prophecies.\n\nWe now have several potential crises on the horizon. And those potential crises are the same ones the Bible says we'll experience either in the Tribulation or the days immediately preceding the Tribulation. Below are just a few:\n\nThe Bible points to a future attack on Israel known as the Gog of Magog War (Ezekiel 38-39). It says a military alliance that includes Russia, Iran, Turkey, and a number of Muslim nations will attack Israel \"in the latter days\" (Ezekiel 38:8) when God brings His people home from among the enemy nations (Ezekiel 39:27).\n\nToday, we see those nations forming an alliance for the first time - an alliance that has never existed in world history. Russia, Iran, and Turkey all have an active military presence in Syria, meaning they're right on Israel's northern border at this moment. Why is this important? Because Ezekiel specifically says this alliance will attack Israel from the north (Ezekiel 38:15; Ezekiel 39:2). In addition, the ancient territory of Magog covers a number of modern day nations, one of which is Afghanistan.\n\nUp until recently, it was difficult to imagine U.S. occupied Afghanistan joining the Gog of Magog invasion. But now? With the Taliban back in control, it would be odd if they didn't join this invading alliance. The way nations are aligned today, the Gog of Magog invasion could take place tomorrow. All the pieces are in place. Even just a few years ago, that wasn't the case.\n\nWhile \"rumors of war\" have been common since the end of World War II, the current situation is different. The world is in the midst of an energy crisis. Europe has seen natural gas prices surge in the past month. China and India are experiencing rolling blackouts of electrical service. Not only will this create problems in an already broken global supply chain, but these are the conditions which often give rise to war. And energy resource issues could provide the spark that ignites the next world war.\n\nFor example, China threatens to invade Taiwan on an almost daily basis. If China does invade, the United States claims it will defend Taiwan. If it occurs, such a conflict will devastate the world. Both China and the U.S. are nuclear powers, and both likely have high-tech space weapons, cyberwarfare capabilities, and innovative weapons never before seen on a battlefield. Such a conflict could easily erupt into World War III. Even if it doesn't, the global economy would collapse and the global supply chain would be irreparably broken if the two largest economic powers went to war.\n\nThe same is true in regard to Israel and Iran. Both nations have been engaged in a type of \"cold war\" for years, and with each passing month, the prospect of all-out war only increases. A conflict between the two could pull the Middle East and the entire world into a cataclysmic war.\n\nThrow in India's border disputes with China and Pakistan as well as North Korea's belligerence toward its neighbors and the United States, and the prospects of global war are probably the highest they've been in the post-Cold War era. At any moment, a flare up in any one of several hotspots could cascade into a global war. Yet, contrary to popular belief, the world will survive World War III.\n\nThe death toll will be enormous, but the human race won't be annihilated (Revelation 6:4). The Bible says a global war will kick off the Tribulation and precede the global rule of the Antichrist. Right now, the odds of a devastating global war appear high.\n\nShutdowns, travel regulations, and other COVID restrictions have wreaked havoc on the global supply chain since early 2020, and it's only getting worse. Lack of shipping containers, global port congestion, and a lack of workers to produce, transport, and stock goods have led to shortages in everything from toilet paper and microprocessors to chicken wings and tractor tires.\n\nMeanwhile, central bank and government policies creating low interest rates and instituting rent/mortgage moratoriums, student loan moratoriums, stimulus checks, and tax credits have only added to demand. Basic economics says if you lower supply and increase demand, you get higher prices. We're seeing that right now, especially at the grocery store. Don't expect it to get better.\n\nThe Bible says the world will experience an unprecedented hyperinflation during the Tribulation. Following the global war outlined in Revelation 6:4, the world experiences a time when an entire day's wages will barely buy enough food to survive (Revelation 6:5-6).\n\nGiven the inflation and shortages we're already seeing, how bad will it get if a major war breaks out anywhere in the world, much less an all-out global war like the one foretold in Revelation 6?\n\nThe Rising Mark of the Beast System\n\nThroughout the world, governments are pushing COVID vaccines. Those who refuse the jab face a long list of penalties, including loss of employment, healthcare, freedom of movement, and liberty in general. Those pushing vaccine mandates and vaccine passports seek to coerce people into compliance. The goal is to ostracize the unvaccinated from society.\n\nIf these coercive policies remain in place, they'll create a mark of the beast system indistinguishable in impact from the true mark of the beast (Revelation 13:16). In doing so, they'll pave the way for the rise of the Antichrist and the actual mark of the beast as outlined in the Book of Revelation.\n\nThe Bible says those who refuse the mark of the beast will be shut out of the global economy. They'll be unable to buy or sell anything without it (Revelation 13:17).\n\nToday, we see the stage being set for the fulfillment of this prophecy. In some places, vaccine passports are required to appear anywhere in public, including grocery stores. Is it really hard to believe they'll one day be required to engage in any buy/sell transactions?\n\nThe Days of Noah and Lot\n\nJesus said when He returns, the world will be \"like it was in the days of Noah\" (Matthew 24:37). Jesus said, \"In those days before the flood, the people were enjoying banquets and parties and weddings right up to the time Noah entered his boat. People didn't realize what was going to happen until the flood came and swept them all away. That is the way it will be when the Son of Man comes.\" Matthew 24:38-39 (NLT)\n\nIs this what we see in the world today? I think so. Even after 19 months of a global pandemic, a global supply chain crisis, and threats of war, people are still enjoying banquets and parties and weddings. In other words, much of life remains normal. After a series of events that should have shaken the world from its slumber, most people continue to go about their daily lives unaware of the times in which we live.\n\nThe times in which we live are clear to anyone who knows the Bible. We are living in the days just before the Tribulation takes place. Jesus will soon return to take His church (1 Corinthians 15:51-53; 1 Thessalonians 4:15-18). How can I be so sure? Because Jesus says so. Jesus said when you see all the signs He and the prophets said to look for, you should look up (Luke 21:28), and we see those signs right now.\n\nSo what are these signs? Jesus and the prophets pointed to dozens and dozens of signs. This article only cites a few, but each one is undeniable. Their convergence for the first time in history tells us the return of the Lord is close at hand. In addition to the events already mentioned, these signs include:\n• The Jewish People in Control of Jerusalem (Luke 21:24-28)\n• The Gospel Preached Throughout the World (Matthew 24:14)\n• An Increase in Travel and Knowledge (Daniel 12:4)\n\nJesus commanded us to watch for these signs (Matthew 24:42). He scolded the Pharisees and religious leaders when they failed to recognize the signs of His first coming (Matthew 16:3). Will He do any different for those who fail to recognize the signs of His second coming? Jesus warned us not to be caught sleeping when He returns (Mark 13:36).\n\nNow is the time to point out these signs to others and warn them the end is near. If you've been waiting to share the Gospel with someone, don't wait any longer. You may not have another opportunity. Jesus is coming. The signs are all around us.", "opengraph": {"title": "Why The Stage Is Set For The End Times", "type": "article", "description": "In the past year, the geopolitical and economic stage has been set for the fulfillment of several end times prophecies. We now have several potential crises on the horizon. And those potential crises are the same ones the Bible says we'll experience either in the Tribulation or the days immediately preceding the Tribulation.", "image": "images/recent/4horsemenfinaljan102016.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/4horsemenfinaljan102016.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Racing-Toward-Armageddon-Advanced-Technology/dp/1981968709", "http://www.amazon.com/Coming-Jesus-Search-Truth-Purpose-ebook/dp/B00JRNPGSM", "https://www.amazon.com/Signs-Second-Coming-Reasons-Lifetime/dp/1500792780", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}