{"result_id": "249007", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4434", "timestamp": "2023-04-25 16:54:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4434", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "Digital Passports That Confirm Your Vaccination Status Are Coming", "cleaned_text": "International travel will soon look far different than it once did. Now that multiple vaccines for COVID-19 have been rushed through the development process, it is just a matter of time before they start being widely distributed. In fact, we are being told that the rollout for COVID-19 vaccines here in the United States will likely begin some time in the middle of December.\n\nThere will be millions of people that will be quite eager to rush out and get injected, but of course there will be millions of others that never intend to get vaccinated under any circumstances. Unfortunately, those that choose not to get vaccinated could soon find themselves being unable to travel internationally.\n\nFor months, there has been speculation about the possibility of some sort of \"COVID passport\" for international travel, but now it is being reported that such a thing is actually \"in the final development phase\"...\n\nThe International Air Transport Association (IATA) said Monday it's \"in the final development phase\" of a mobile \"digital passport\" app that would tell airlines if international travelers had been vaccinated against COVID-19. The app would help \"get people traveling again safely,\" IATA's Nick Careen said in a statement, by \"giving governments confidence that systematic COVID-19 testing can work as a replacement for quarantine requirements.\"\n\nNeedless to say, the International Air Transport Association will be strongly urging all carriers to use this new \"digital passport\" in the months ahead.\n\nBut will the airlines go along?\n\nIn Australia, Qantas Chief Executive Alan Joyce has already made it quite clear that he expects international travelers to prove that they have been vaccinated...\n\n\"We are looking at changing our terms and conditions to say for international travelers, that we will ask people to have the vaccination before they get on the aircraft,\" Joyce told Australia's Network Nine television.\n\nJill Chung, a spokesperson for Korean Air, said Tuesday there's a real possibility that airlines will require that passengers be vaccinated. She said that's because governments are likely to require vaccinations as a condition for lifting quarantine requirements for new arrivals.\n\nHere in the United States, the major airlines are not committing one way or the other just yet...\n\nWhen asked if American Airlines would implement such a policy, a company spokesperson said that while the airline is pleased that vaccine development is moving forward, it's too early to comment on policies related to a COVID-19 vaccine. A spokesperson from Delta couldn't share specifics either, and noted that the entire pandemic has been unpredictable.\n\nA spokesperson for Southwest said that the airline \"will continue monitoring public health information from the CDC, the latest scientific research, and insights from our internal and external experts to guide our operational policies as we work to support the well-being of our customers and employees during the COVID-19 pandemic.\" Jet Blue and United did not respond to a request for comment.\n\nBut if the federal government ultimately decides to order the airlines to go along with this new program, you know that they will fall in line.\n\nAnd once \"COVID passports\" are in place for international travel, how long will it be before they start being required for domestic travel?\n\nPrior to the pandemic, talking about such a thing would have been unimaginable, but at this point we are seeing unimaginable measures being instituted all over the world.\n\nFor example, we just learned that police will be going door to door in Belgium to enforce COVID restrictions even during the holidays...\n\nBelgian Interior Minister Annelies Verlinden has warned her fellow countrymen that police will knock on doors at Christmas if needed to enforce Wuhan coronavirus measures.\n\nThe Interior Minister stated that law enforcement would make sure to enforce the strict Wuhan coronavirus lockdown measures even on Christmas Day, saying that \"If necessary, if there is a lot of noise, for example, the police will knock on doors.\"\n\nOn our side of the Atlantic, things are becoming increasingly draconian as well.\n\nOut in Oregon, Governor Kate Brown is actually encouraging residents to spy on their neighbors and to report any infractions to law enforcement authorities...\n\n\"Look, this is no different than what happens if there's a party down the street and it's keeping everyone awake,\" Brown told KGW8 last week. \"What do neighbors do? They call law enforcement because it's too noisy. This is just like that. It's like a violation of a noise ordinance.\"\n\n\"Honestly, they shouldn't have to. This is about saving lives and it's about protecting our fellow Oregonians.\"\n\nTo me, that sounds like the sort of thing they used to do in East Germany at the height of the Cold War.\n\nIn New York City, they have decided to set up \"vehicle checkpoints\" at important bridges and crossings in order to enforce the new restrictions which were just put in place...\n\nNew York City will have vehicle checkpoints at key bridges and crossings, and will strictly enforce the travel quarantine, Sheriff Joseph Fucito said.\n\nThe sheriff's office will conduct spot checks when out-of-state buses drop riders off at the curb. Test and tracing teams will be on the ground to direct individuals to testing sites and provide education on quarantine, Fucito said.\n\nIf things are this bad already, can you imagine what they will do if this pandemic gets a lot worse or if an even more dangerous pandemic eventually comes along?\n\nThe good news is that there has been a lot of resistance to absurd restrictions here in the United States, and that is going to make it difficult for the politicians to push things too far.\n\nAnd surveys have shown that approximately two-thirds of the U.S. population is against mandatory vaccinations, and other surveys have shown that only a minority of all Americans plan to get a COVID vaccine right away.\n\nWith so few Americans getting vaccinated, that is going to make it really hard for the airlines to make it a requirement for their passengers.\n\nAlso, it is going to take more than one trip to the doctor to be fully \"vaccinated\", and those trips won't be pleasant. This week, one prominent member of the AMA even admitted that some people may not want to come back for a second shot because \"they are probably not going to feel wonderful\" after the first shot...\n\nDr. Sandra Fryhofer of the American Medical Association said both Pfizer's and Moderna's Covid-19 vaccines require two doses at varying intervals. As a practicing physician, she said she worries whether her patients will come back for a second dose because of the potentially unpleasant side effects they may experience after the first shot.\n\n\"We really need to make patients aware that this is not going to be a walk in the park,\" Fryhofer said during a virtual meeting with the Advisory Committee on Immunization Practices, or ACIP, an outside group of medical experts that advise the CDC. She is also a liaison to the committee. \"They are going to know they had a vaccine. They are probably not going to feel wonderful. But they've got to come back for that second dose.\"\n\nIn addition, in previous articles I have discussed the fact that COVID antibodies fade very rapidly, and so to have any sort of lasting immunity people would need to go back to the doctor every few months for more shots.\n\nOn top of everything else, if a new strain of COVID that does not respond to the vaccines becomes dominant, the shots that people get may not even do them any good in the long run.\n\nA lot of the \"experts\" out there are anticipating that these vaccines will allow our lives to \"return to normal\" soon, but I don't think that is going to happen.\n\nInstead, I am expecting even more draconian measures to be instituted all over the globe in 2021, and that is extremely unfortunate.", "opengraph": {"title": "Digital Passports That Confirm Your Vaccination Status Are Coming", "type": "article", "description": "For months, there has been speculation about the possibility of some sort of ", "image": "images/recent/passportapril272020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/passportapril272020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://endoftheamericandream.com/archives/they-are-developing-a-digital-passport-for-international-travel-that-will-show-if-you-have-been-vaccinated", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}