{"result_id": "249035", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=3965", "timestamp": "2023-04-25 16:54:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=3965", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "From Global Government To Global Tax - A New World Order Is Upon Us", "cleaned_text": "Last week it was former UK Prime Minister Gordon Brown who called on world leaders to form a \"temporary\" global government in response to the coronavirus pandemic.\n\nThe ex Labour prime minister, stressed the need for a task force comprised of world leaders, health experts as well as leaders of the international organisations that could have executive powers to execute the response.\n\nBrown would like to see the G20 lead this charge in co-operation with the UN Security Council while giving more resources and power to the International Monetary Fund and the World Bank.\n\nThis week it was the United Nations Secretary-General, António Guterres, asking nations to contribute at least 10 percent of their annual income of the entire world to fund a \"stimulus package\" that would be administered at an international level.\n\nIf countries were to accept the plan, the United Nations or some similar coordinating agency would be given the equivalent of approximately 8.7 trillion USD, an unprecedented amount that would be 2,900 times greater than the UN's annual budget of 3 billion USD.\n\nThe proposed plan would effectively place a global agency, presumably the UN itself, in charge of propping up the economies of the world during the coronavirus crisis, placing it in charge of 10% of global income.\n\nWhile neither the call for global government or acceptance of a global tax is likely to get much traction at this point in time... that could change one day. The fact that such measures are being called for openly by people in high places is of significance and is setting a precedent for future conversations on these issues.\n\nThere are many global changes that are going to come about for years to come as a result of this pandemic. While it is too early to tell what it might look like, there will no doubt be a push at the global level to prepare ourselves for such a crisis in the future. A global response to global problems will be the battle cry as many will push for global unity so no individual country can risk infecting another.\n\nScripture alludes to the political future of our world in which a one world leader (Antichrist) rules over a system of global government and enforces his rule with a \"mark\" that is required to buy or sell. While many Bible commentators have rightly pointed out the economic factor in this mark of allegiance, is it possible there will also be a health component to this \"mark\" that approves you to publicly conduct commerce?\n\nVaccinations have already been a hot topic, especially at schools where many students are now not allowed to attend unless they have been vaccinated. Bill Gates, one of the wealthiest men in the world, is already leading the charge to fund the construction of factories that will be looking for a vaccine for this new virus and has suggested \"larger public gatherings may not resume until broad vaccination has taken place.\"\n\nGates has also previously indicated his support for the ID2020 Alliance whose goals include giving everyone a digital ID while using vaccinations as a platform to collect that biometric data.\n\nLast year the ID2020 Alliance launched a new digital identity program at its annual summit in New York, in collaboration with the Government of Bangladesh and Vaccine Alliance Gavi. Bangladesh is serving as a test model for future use in other countries.\n\nThe digital identity is a computerized record of who a person is, stored in a registry. It is used, in this case, to keep track of who has received vaccination but there is no reason it could not be used for multiple other functions.\n\nBiometric data, ID technology, health ratings/vaccination records, and digital commerce are all merging and advancing to the next level. While we don't ultimately know what final form the \"Mark of the Beast\" described in the Book of Revelation will take - these trends cannot be ignored.", "opengraph": {"title": "From Global Government To Global Tax - A New World Order Is Upon Us", "type": "article", "description": "Last week it was former UK Prime Minister Gordon Brown who called on world leaders to form a ", "image": "images/recent/revelationvirusapril09.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/revelationvirusapril09.jpg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}