{"result_id": "249038", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=6007", "timestamp": "2023-04-25 16:54:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=6007", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "The World Economic Forum's 'AI Enslavement' Is Coming for You!", "cleaned_text": "When Sir Thomas More wrote his socio-political satire about a fictional island society in the New World, he gave it the fabricated name, Utopia, derived from simple Greek and meaning, \"no-place.\" Although More was humorously telling his audience that his idealized community existed nowhere, centuries of central planners chasing the fantasy of utopian societies have failed to get the joke. Worse, for every peaceful religious community seeking separation from modern civilization, there is a power-hungry tyrant seeking to impose his will upon everyone else.\n\nIt seems as if not a generation goes by when some megalomaniac does not rise to proclaim, \"If only the world does exactly as I demand, I will deliver you paradise here on Earth.\" Usually, these same narcissists go down in history remembered as either vainglorious buffoons or bloodthirsty tyrants -- often both.\n\nToday, Klaus Schwab rises as leader of the World Economic Forum (WEF) to promise a \"Great Reset\" for the human race. He envisions a future Utopia achieved through technological precision, centralized management of Earth's resources, careful observation of citizens, the merger of human and artificial intelligence, and the monopolization of government power by a small professional class with recognized expertise.\n\nAlthough the WEF has spent the last 50 years organizing conferences, publishing policy proposals, and connecting global leaders in industry, banking, information technology, intelligence gathering, military strategy, and politics, its mission objective is remarkably simple: the smartest, best people in the world should rule everyone else.\n\nSeparated from all its pretensions about \"saving the world\" from unchecked population growth and climate apocalypse, the WEF is nothing new. Its foundations have been around at least since the time of Plato, when two and a half millennia ago the Greek philosopher proposed that the ideal city-state would be ruled by \"philosopher kings.\" Just as Plato surveyed the world and predictably concluded that people from his own vocation should logically govern everyone else, the World Economic Forum's global \"elites\" have come to a strikingly similar determination.\n\nFar from advancing anything forward-looking or modern, Schwab and his acolytes walk in the footsteps of an ancient Greek. For a half-century, the WEF's members have been on a quest to devise the perfect global government without any say from Western nations' voting populations, and to no-one's surprise, those same \"philosopher kings\" have nominated themselves to do the ruling. How convenient.\n\nAs is true of almost all visions of Utopia, the WEF's new world order will be remarkably centralized. \"Experts\" on climate change will determine what kinds of energy may be used by businesses and consumers. \"Experts\" on sustainability will determine what foods humans (at least the non-\"elite\" variety) may eat. \"Experts\" on disinformation will determine what kinds of news and which side of a debate may be known and promoted. \"Experts\" on healthcare will determine how many times each citizen must be injected with ever-newer \"vaccines,\" whether citizens must be kept in lockdown \"for their own good,\" and whether face masks must be worn to prove continuing compliance.\n\n\"Experts\" on extremism will determine what kinds of speech are \"harmful.\" \"Experts\" on racism will determine which groups in society have unfair \"privilege.\" \"Experts\" in inequality will determine whose property must be taken and which groups the State should reward. \"Experts\" in whatever the State requires will determine that the State is acting reasonably every step of the way. However, freedom of thought, freedom of speech, individual rights, and other personal liberties will mean little in a WEF-constructed future running on philosopher-king-approved expertise. At no time can an individual's needs, wants or concerns be allowed to obstruct the \"greater good.\" This is Schwab's drab vision of Utopia.\n\nShould he and the WEF clan pull it off, they will do so by using technology to enfeeble, rather than empower, the human race. Already, people have become familiar with the new terms of their future enslavement. Central bank digital currencies will allow governments not only to track every citizen's income and purchase history in real time but also to limit what a person may spend depending upon government-determined social credit scores, perceived infractions of the \"common good,\" or perhaps unfair possession of \"systemic privilege.\"\n\nDigital vaccine passports will not only provide universal tracking of every person's movements but also ensure stick-and-carrot compliance with future mandatory orders during declared \"health emergencies.\" Personal carbon footprints measuring each individual's \"culpability\" for so-called man-made climate change will have the effect of recording everything a person eats and everywhere a person goes, while constantly \"nudging\" each citizen with digital rewards or penalties to modify behavior toward the government's preferred standards. It should go without saying that when any government possesses such omnipotent powers, invasions of privacy will only expand, declared \"health emergencies\" will become only more numerous, and government \"nudging\" will become only more intrusive.\n\nIf this sounds more dystopian than utopian and every bit like an unwanted prison overseen by unaccountable government agents, that is precisely what it is. WEF zealots do not even hide their intentions anymore, already going so far as to push the construction of \"Smart Cities\" or \"Fifteen Minute Cities\" in which tens of millions of people can be relocated, live side-by-side in small apartment complexes, and move through a constant maze of entrances and exits accessed solely through digital ID verification and approval.\n\nIn essence, the goal is to create a digital panopticon implementing all of the surveillance programs above, to provide future rulers with absolute control, while leaving everyone else in a permanent state of docile incarceration. In WEF parlance, such schemes of total supervision and behavioral modification will create a \"sustainable\" future for humanity. No doubt prison wardens feel much the same way when convicts are kept behind bars in rows of secured cages. The difference is that in the WEF's Utopia, no crime must be committed to reap Schwab's unjust \"rewards.\"\n\nNow, if Westerners appreciated just what is coming their way, they might go apoplectic and resist the WEF's new world order. For this very reason, the most important war being waged today is one that is never discussed openly in the press: the covert war over information. When people are allowed to openly debate ideas in the public square (including the digital square of social media and web pages free from search engine shadowbans), that \"free market of ideas\" will go where the people debating those ideas take them.\n\nFor government \"narratives\" not only to survive but also to dominate all dissenting opinion, government-allied platforms must tilt the scales of free speech in their favor by ridiculing, censoring or outright criminalizing the thoughts and words of dissident minds. In any other market, such intentional interference would be considered anticompetitive collusion in violation of antitrust laws, but because the World Economic Forum's acolytes treat competing free speech as dangerous \"misinformation,\" the \"free market of ideas\" has been transformed into a controlled \"safe space\" for the government's friends.\n\nWhat happens when government ambivalence toward free speech is combined with the amoral technocratic force behind the WEF's plans for global Utopia? Well, as Herr Schwab recently proclaimed at the World Government Summit in Dubai when discussing artificial intelligence (AI), chatbots, and digital identities: \"Who masters those technologies -- in some way -- will be the master of the world.\" (After that, is one-world-government still considered a \"conspiracy theory\"?) If the WEF controls the digital world, then it will essentially control the people. Once the stuff of science fiction, WEF technocrats even have a plan to \"hack\" into employees' minds by monitoring and decoding their brainwaves.\n\nGoogle is onboard with such thought control: it has declared its intent to expand a \"pre-bunking\" program meant to \"immunize\" people against what Google sees as \"propaganda\" or \"misinformation\" by indoctrinating unsuspecting Internet users with Google's own home-brewed yet approved propaganda. By manipulating Google's users without their knowledge, the search engine behemoth can ward off competing ideas -- brilliant!\n\nMicrosoft founder Bill Gates feels the same way. In an interview with German newspaper Handelsblatt, the self-styled vaccine expert argues that AI technologies should be used as powerful tools to combat \"digital misinformation\" and \"political polarization.\" This comes on the heels of a recent discovery that Microsoft has already been using a British think tank, Global Disinformation Index (GDI), to secretly blacklist conservative media companies in the United States and prevent them from generating advertising revenue.\n\nThe kicker? The U.S. State Department has been funding GDI's \"disinformation\" work through taxpayer funds to the National Endowment for Democracy and its own Global Engagement Center, which are then transferred to GDI before GDI launders the tawdry viewpoint discrimination back to Microsoft and other companies behind a thin veil of \"objectivity.\"\n\nFollowing the WEF model of creating an all-powerful partnership between private industry and government authority, Microsoft and the State Department have figured out how to undermine dissent by having third-party organization, GDI, label all such speech as \"harmful disinformation\" on its \"Dynamic Exclusion List.\"\n\nLikewise, publicly funded news outlets throughout the West -- including Germany, Canada, Switzerland and Belgium -- are working together to \"develop online-based solutions\" to target \"hate comments and increasing disinformation.\" What could possibly go wrong when State-controlled institutions collude to control the dissemination of information? As former Twitter \"Trust and Safety\" executive Yoel Roth testified before Congress, \"Unrestricted free speech paradoxically results in less speech, not more.\"\n\nFrom this Orwellian doublespeak standard, the clear line separating protections for free speech from outright censorship is whether the speaker articulates points of view in agreement with the WEF's ruling coalition of Big Tech titans and government authorities or not. In Schwab's Utopia, there is no room for truly free speech.\n\nWhat happens when the job of censoring the public is placed entirely in the digital hands of artificial intelligence? Even though some political leaders have cautioned that AI could be an \"existential threat\" to humanity, and even as technology pioneers such as former Google chief Eric Schmidt admit that AI-powered computer systems should be seen as every bit as powerful as nuclear weapons, the rush toward AI-constructed Utopia is full speed ahead. That should give anyone of sound mind troubling pause. After all, the cognitive biases of Big Tech \"elites\" such as Gates, Schmidt, and others will almost certainly translate into digital biases for any artificial intelligence.\n\nChatGPT, an AI software program launched late last year, is already scaring the bejesus out of people with its overt political bias. In one instance, the AI concluded that using a racial slur was worse than allowing a city to be annihilated by a nuclear bomb. In another, the AI justified the suppression of Trump voters as necessary to \"defend democracy\" and prevent the spread of \"dangerous speech,\" while simultaneously arguing that \"AI should not be used to suppress the free speech\" of Biden supporters. Meanwhile, no sooner had some experimenters gained access to Microsoft's new AI-powered chatbot than the synthetic brain started threatening people.\n\nThese troubling early signs give credence to Schmidt's warning that AI should be regarded as equally and inherently dangerous as nuclear bombs. Where he and other WEF-allied global \"elites\" differ from the scientists involved in the Manhattan Project, however, is in their seemingly urgent desire to turn these awesome AI weapons directly against Western peoples.\n\nClearly, if Schwab's World Economic Forum intends to usher in an AI-powered Utopia where he can be the \"master of the world,\" then he has little use for human beings. In a very real sense, humans become nothing more than \"things\" to be counted, shuffled, categorized, tagged, monitored, manipulated, and controlled.\n\nThey become nothing more than cogs in the WEF's great trans-humanist, technocratic machine -- useful for a time, perhaps, but ultimately a burden to feed and house and logically expendable. If artificial intelligence can do the thinking that Schwab needs and support the ideas that Schwab adores, then humans are just in the way. Should the World Economic Forum get its centralized Utopia, the \"thingification\" of the human race will be a giant step toward its eventual disposal.", "opengraph": {"title": "The World Economic Forum's 'AI Enslavement' Is Coming for You!", "type": "article", "description": "Although the WEF has spent the last 50 years organizing conferences, publishing policy proposals, and connecting global leaders in industry, banking, information technology, intelligence gathering, military strategy, and politics, its mission objective is remarkably simple: the smartest, best people in the world should rule everyone else.", "image": "images/recent/globaljan212016.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/globaljan212016.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.gatestoneinstitute.org/19427/ai-enslavement-wef", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}