{"result_id": "249017", "URL": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4037", "timestamp": "2023-04-25 16:54:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "favicon.png", "canonical": "https://www.prophecynewswatch.com/article.cfm?recent_news_id=4037", "encoding": "UTF-8"}, "image": null, "domain": "www.prophecynewswatch.com", "title": "ID2020 & Agenda 2030: Pathway To A Global Government & New World Order", "cleaned_text": "I try to write a thoughtful post at least once a month, where I take time to research and vet various developments that relate to Bible prophecy. As I was looking over past articles something hit me. In terms of Bible prophecy and end-time developments, I believe that we will watch and wait in a new way. We will think in terms of \"before Covid-19\" and \"after Covid-19.\" And there is a major difference.\n\nIn the world of TV and feature film production there is a tradition followed by the main crew once principle photography (shooting all the scenes) is done. After the last shot of the final episode (or the final movie sequence) is done, time is taken to honor the crew, the project, and the friendships formed.\n\nThe director will typically bring everyone together and individually acknowledge each person by name--followed by the phrase, \"that's a wrap.\" Finally, after each person's contribution is acknowledged the director will state the name of the project (whether TV show or movie) and say, \"that's a wrap.\" It is an extremely emotional moment for all involved in the production.\n\nAt this point, there is still much to be done before the show airs or the movie is released. All of the editing and post-production still needs to be done, but the key content is shot and \"in the can\". Every one of the critical \"must-have\" milestones has been reached.\n\nI sense that is where we are on the prophetic schedule of things. The health, economic, and globalist effects of Covid-19 have moved us into a new (and perhaps final) era of the birth-pain period Jesus talked about in Matthew 24. In that chapter, Jesus responds to his disciples' questions about the timing of Jerusalem (and the temple) being destroyed, the end of the Church age, and the return of Jesus.\n\nAfter describing the chronology of the temple destruction of AD70 (24:2), and the bulk of church history of which Jesus said \"the end is still to come\" (24:4-6), he shifts gears to a time period known as the birth pains (24:8). I, and many other prophecy teachers, believe we are nearing the end of this birth pain period before the world is \"delivered into tribulation (24:9).\" In between the birth pain period and the tribulation period will be the rapture of the church.\n\nEverything related to Covid-19 has me thinking, \"that's a wrap.\" I'm not saying the rapture will happen tomorrow. No man knows the day or hour. But I am saying that all principle photography has been shot. In other words, all of the conditions for the tribulation to start are in place--right now. Whether those conditions are geopolitical, cultural, spiritual, technological, or biblical/prophetic--everything is \"in the can.\" We're now (using a video production term) in post-production. It's only a matter of time before the end of the church age.\n\nThe number of examples I could give--specifically as a result of Covid-19--are overwhelming (including draconian power grabs, attempts to silence the church, anti-Semitic actions from some state governments, prophetic geopolitical developments, false and contradictory information on the news, and much more), so I'll stick to just three specific developments with strange numbers.\n\nOnce you see how these are connected, it should get your attention. Let me request from the outset, don't take my word for these. Vet them yourself. They are 100% true and legitimate, but I don't want you to take my word without looking into them yourself.\n\nThis UN manifesto of sorts was ratified and adopted on September 25, 2015. It calls for (and has been forcefully moving toward) radical plans that will affect everything by the year 2030. Of course it sounds fluffy and nice, but If you read between the lines (and if you understand human nature and the God-less foundations of the UN) you'll see that it is the culmination of a decades long push toward a Global Government and a New World Order.\n\nBill and Melinda Gates pledged $10 billion in a call for a decade of vaccines. That is the title of a press release from the Bill & Melinda Gates foundation website. So, what's wrong with that? If you're like me you have always known Bill Gates as the Microsoft computer genius who competed head-to-head with Steve Jobs and Apple. Bill is a globalist. His dad was a globalist.\n\nAgain, vet what I am saying. Last year Bill stepped down from Microsoft to pursue his new initiatives--among them ID2020 that seeks to give everyone on the planet a digital ID, and vaccinations. Neither of those are evil in themselves, but when you look at the big picture, the world view of the players, and what the Bible says will happen in the future tribulation period--everything is lining up.\n\nSo, let me connect a few dots. Bill Gates (a computer entrepreneur) has been heavily involved with the UN and the World Health Organization/W.H.O. (the global health arm of the UN) for quite some time. (If you are wondering why a computer entrepreneur is involved in world health and vaccines you're not alone.)\n\nThe UN officially adopts a plan to change everything by 2030 with the promise that \"no one will be left behind.\" Bill Gates pledges a \"decade of vaccines\" that culminates in the year 2030, and at the same time funds ID2020 with a manifesto that says (among many other things), \"everyone should be able to assert their identity across institutional and national borders, and across time,\" and that they want to provide \"an alternative to individuals lacking safe and reliable access to state-based systems.\"\n\nIn other words, vaccines and digital ID are merging together. But how?\n\nEnter quantum dot technology. This new technology is well known, freely discussed in various online tech articles, and is the next step beyond microchipping. As I understand it, visible and invisible ink can be tattooed on someone as they are receiving a vaccine.\n\nEmbedded in this tattoo is digital technology that verifies they have had said vaccine. Presumably, this could also be technology used to give everyone/anyone a permanent digital ID. Are you wondering who funded (and initiated) this project? You guessed it--the Bill and Melinda Gates Foundation (see 3rd link below).\n\nAgain, please vet what I am saying. Research the terms: quantum dot vaccine; quantum dot technology.\n\nNow, here is the third--and strangest--number I want to bring to your attention. A short time after Bill Gates stepped down from Microsoft's board of directors, the company filed an international patent for a \"cryptocurrency system using body activity data.\" In layman's terms this means, \"a cashless financial system connected to individual people.\"\n\nSome argue that this could just be a patent for technology which allows for smart phones, smart watches, and other wearable technology to connect with a cashless payment system. Of course, that is one logical application. But, when you look at this in view of end-time Bible prophecy, one can't help but connect a few dots. The bottom line is this emerging technology connects individual humans to a database and a cashless system. That is a fact.\n\nThe future mark of the beast described in Revelation--and implemented at the mid-point of said period--necessarily requires a cashless system, a data-base driven digital tracking capability, and a mark \"on\" the skin (not embedded underneath it) that seems to have health/DNA effects associated with it. Think of that in light of everything mentioned above. In my view all of these details are converging and accelerating due to the global effects of Covid-19.\n\nNow here's the rub. And you can vet this for yourself. The patent number is WO/2020/060606. Many have suggested it stands for World Order, 2020, 666--which is of course, the specific number mentioned in the passage in Revelation regarding the mark of the beast. Coincidence? I think not.\n\nBefore you call me a conspiracy theorist for even mentioning those details, let's look at the possibilities of how this number came about.\n\nPossibility 1--The number generated was completely random. I don't buy this, but even if it were true, what are the chances that a technology that closely mirrors the biblical mark of the beast would have three sixes in a row? Not to mention a number that is the same year as Gates' iD2020.\n\nPossibility 2--The patent applicants requested this specific number because it has inherent meaning. I tend to believe this is the case. When connected to someone as globally powerful as Bill Gates, this is not far fetched. And if this number was requested, it obviously has meaning to those who filed the global patent.\n\nPossibility 3--The patent applicants requested this specific number to poke fun at Christians and to intentionally get Bible prophecy teachers all bent out of shape. If this is the case, it still fits into end-time Bible prophecy when mockers will abound (2 Peter 3:4) and raises additional concerns.\n\nThe bottom line of all of this is that due to Covid-19, the end-time convergence of signs and conditions has been shifted into overdrive. The birth pains described by Jesus in Matthew 24 are increasing with frequency and intensity--globally--right before our eyes. We have yet to see the full effects of the virus upon the world's health, wealth, freedoms, and fall out.\n\nWe should be ready for--not just a new normal, but a new-world-order normal. If \"it's a wrap\" and all we're waiting for is a heavenly trumpet sound--let's sprint to the finish line, occupy until He returns, patiently serve Jesus and others, and share the Gospel as far and wide as we can while there is time. Even so, come Lord Jesus!\n\nWhether the Lord returns in our lifetime as we suspect or not, we have nothing to fear and should be full of hope, joy, and courage. Our new normal is just as secure as it has always been. God is still on the throne and his Word is true.\n\nPS. And if the 3 strange numbers above weren't enough--how about this one (just brought to my attention by a reader):\n\nH.R. 6666--a proposed bill in congress that allows contract tracing to--and Covid-19 testing at--your house (\"and for other purposes\" ) by various funded entities. Check it out for yourself and keep an eye on this one as well.", "opengraph": {"title": "ID2020 & Agenda 2030: Pathway To A Global Government & New World Order ", "type": "article", "description": "The bottom line of all of this is that due to Covid-19, the end-time convergence of signs and conditions has been shifted into overdrive. The details of ID 2020 & Agenda 2030 are not secret - they are just hidden in plain sight.", "image": "images/recent/globalidmay112020.jpg", "article:author:image": "https://www.prophecynewswatch.com/images/recent/globalidmay112020.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://sustainabledevelopment.un.org/post2015/transformingourworld", "https://www.sciencealert.com/an-invisible-quantum-dot-tattoo-is-being-suggested-to-id-vaccinated-kids", "http://news.mit.edu/2019/storing-vaccine-history-skin-1218", "https://bioengineering.rice.edu/news/quantum-dot-tattoos-hold-vaccination-record", "https://id2020.org", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2010/01/Bill-and-Melinda-Gates-Pledge-$10-Billion-in-Call-for-Decade-of-Vaccines", "https://www.congress.gov/bill/116th-congress/house-bill/6666/text", "http://toddhampson.com/", "https://www.prophecynewswatch.com"], "authors": [], "publish_date": null}