{"result_id": "250005", "URL": "http://news.prophecytoday.com/2021_01_04_archive.html", "timestamp": "2023-04-25 16:54:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://news.prophecytoday.com/favicon.ico", "canonical": "http://news.prophecytoday.com/2021_01_04_archive.html", "encoding": "UTF-8"}, "image": null, "domain": "news.prophecytoday.com", "title": "Jimmy DeYoung's News Update", "cleaned_text": "KT: To me that is the biggest question because you had all this anti Russian propaganda which for the most part was baseless during these past four years. Russia was painted as the evil empire of the Old Soviet days and in fact Russia is a tired power. Their population is declining. Their economy is declining. They have a far far smaller economy than Communist China. So Russia I believe is a spent power and not a terrific threat to the United States as long as we do not engage in aggressive nuclear saber rattling.\n\nJD: And then we want to look at China who has a desire to be number one economically and militarily in the world in a couple of years. What about this year 2021?\n\nKT: The Chinese are on the march. They have successfully maneuvered with Covid. Remember the very beginning of the outbreak they closed their own borders internally but they allowed travelers from Wuhan to go to Los Angeles and to New York and other places and Europe where they spread the disease. So China managed to spread the virus overseas while containing it at home. They are now in a position to reap the benefits of that economically. Diplomatically they have their own Covid vaccine they are going to require Chinese citizens to take. They may have stolen secrets of the vaccine because we know they have a very sophisticated and broad base effort to steal bio technical secrets from these big companies who have been developing vaccines.\n\nChina is on the march. They are going to see no opposition from the United States. I believe we will see them increasingly active against Taiwan and in the South China Sea at the very early stages of 2021.\n\nJD: Ken Timmerman with a look at Russia and China in the new year 2021.\n\nWe report this information because it is setting the stage for Bible prophecy to be fulfilled.\n\nKen's look at Russia and China and what these two nations may have on their agenda in 2021 sounds like a page out of Bible prophecy. Russia according to Ezekiel 38 will be a major player on the world scene in the last days at the beginning of the seven year Tribulation period. According to Revelation 16:12 it mentions the kings of the east including China as key to the prophetic scenario at the end of the Tribulation period. Russia and China, major actors in God's end time drama.", "opengraph": {"url": "http://news.prophecytoday.com/2021_01_04_archive.html", "title": "Jimmy DeYoung's News Update", "description": "Jimmy DeYoung's daily report on current events as they set the stage for Bible prophecy to be fulfilled."}, "tags": [], "tweets": [], "movies": [], "links": ["http://media.prophecytoday.com/PT_Daily/headline.mp3"], "authors": ["Shofar Communications"], "publish_date": null}