{"result_id": "250003", "URL": "http://news.prophecytoday.com/2020/12/some-are-asking-is-new-corona-virus_18.html", "timestamp": "2023-04-25 16:54:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://news.prophecytoday.com/favicon.ico", "canonical": "http://news.prophecytoday.com/2020/12/some-are-asking-is-new-corona-virus_18.html", "encoding": "UTF-8"}, "image": null, "domain": "news.prophecytoday.com", "title": "Some are asking, \"Is the new Corona Virus Vaccine connected to the \"mark of the Beast\"?", "cleaned_text": "DJ: So later on in the email our listener wrote this: It also appears the Covid - 19 vaccine will be mandatory or possibly not mandatory but without it people won't be able to fly, shop and etc. Jimmy I think this is where it gets even trickier when combined with moral concerns about some of the vaccines. Also side effects are another complicating factor. These have included pain, fever, Bell's palsy and even anaphylactic shock. We have no idea what the long term effects might be.\n\nJD: David I've got one final point that involves whether or not the corona virus vaccine could be tied to the mark of the beast in Revelation 13.\n\nDJ: I see that come up a lot on social media along with people constantly saying we're seeing prophecy being fulfilled before our eyes. The fulfillment of biblical prophecy doesn't begin until the Rapture of the church which is the next event on God's prophetic calendar as you often say and then the remaining fulfillment starts to kick in.\n\nOur listener wrote this, sounds like Revelation 13, 16 and 17 is nearing fulfillment and we're seeing the shadows of it. So she's not suggesting the vaccine is the mark of the beast or the fulfillment of prophecy as some are. In my email reply to her I said this, concerning the mark of the beast I doubt there is any connection and the mark is post Rapture which makes it a non issue for those who are currently believers. For those during the Tribulation to become believers it looks like it won't necessarily be taken unwittingly but is a conscious decision to accept the beast system. And we know Jimmy the beast system will involve worship the antichrist who will declared himself to be God and see people through false signs and wonders, that's II Thessalonians 2. As with all state setting the entire Covid crisis makes even more clear how all prophecy will be fulfilled quite literally in ways we might not even been able to imagine a few years ago.\n\nJD: David James with insight into the corona virus vaccine and why many are asking could it be connected to the mark of the beast.\n\nWe report this information because it is setting the stage for Bible prophecy to be fulfilled.\n\nDave gave us the prophetic passages that is the prophecy pertaining to the antichrist and the mark of the beast found in Revelation 13. As David said that mark of the beast comes into play at the mid way point of the seven year Tribulation period. Therefore no Christians should worry about the mark of the beast since all Christians leave earth at the Rapture three and a half years before the mark comes into play. As to whether you take the corona virus vaccine that will be a personal decision.", "opengraph": {"url": "http://news.prophecytoday.com/2020/12/some-are-asking-is-new-corona-virus_18.html", "title": "Some are asking, \"Is the new Corona Virus Vaccine connected to the \"mark of the Beast\"?", "description": "Listen to Today's Program  JD: David another issue was the question of how we should respond to a government mandate as believers. DJ:  So l...", "image": "https://lh3.googleusercontent.com/blogger_img_proxy/AByxGDQwDRrQTsDguqIlKeQLc9HqYs0l-c1pgQM9uTXFzEHE9lrzBSoKHhnlyi1Q5DTaQXzrn0UXhwPeJl_sQ74op62MZCfvWsHiV5EigRhbpA=w1200-h630-p-k-no-nu"}, "tags": [], "tweets": [], "movies": [], "links": ["http://media.prophecytoday.com/PT_Daily/headline.mp3"], "authors": ["Shofar Communications"], "publish_date": null}