{"result_id": "252037", "URL": "https://www.randpaul.news/2021-08-11-rand-paul-resist-the-great-reset.html", "timestamp": "2023-04-25 16:55:50 CEST+0200", "meta": {"description": "Republican Sen. Rand Paul (R-KY) has released a statement calling on patriotic Americans to rise up against Joe Biden’s tyrannical government to “resist” the “Great Reset” through mass civil disobedience. (Article by Jay Greenberg republished from NeonNettle.com) Senator Paul has called on the public to stand up against unconstitutional lockdowns, mandates, and harmful policies being imposed by “power-hungry” elites. In an op-ed for […]", "lang": "en", "keywords": "big government,COVID,democrats,freedom,great reset,Joe Biden,Liberty,medical fascism,Nancy Pelosi,pandemic,Rand Paul,Resist,tyranny,US Constitution", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2021-08-11-rand-paul-resist-the-great-reset.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Rand Paul: ‘Resist’ the ‘Great Reset’ – ‘They can’t arrest us all’", "cleaned_text": "Republican Sen. Rand Paul (R-KY) has released a statement calling on patriotic Americans to rise up against Joe Biden’s tyrannical government to “resist” the “Great Reset” through mass civil disobedience.\n\nSenator Paul has called on the public to stand up against unconstitutional lockdowns, mandates, and harmful policies being imposed by “power-hungry” elites.\n\nIn an op-ed for Fox News, Paul slammed Democrat leaders Biden and House Speaker Nancy Pelosi as “tyrants.”\n\n“They can’t arrest us all,” Paul declared as he urged patriots to “resist” the Democrats’ attempts to “destroy America.”\n\n“They can’t keep all your kids home from school,” he added.\n\n“They can’t keep every government building closed – although I’ve got a long list of ones they should.”\n\nPaul then tore into the Biden administration and Democratic Party for being “drunk on power” and attempting to sabotage the U.S. Constitution.\n\n“Speaker Nancy Pelosi — you will not arrest or stop me or anyone on my staff from doing our jobs.\n\n“We have all either had COVID, had the vaccine or been offered the vaccine.\n\n“We will make our own health choices.\n\n“We will not show you a passport, we will not wear a mask, we will not be forced into random screening and testing so you can continue your drunk with power rein over the Capitol.\n\n“President Biden — we will not accept your agencies’ mandates or your reported moves toward a lockdown.\n\n“No one should follow the CDC’s anti-science mask mandates.\n\n“And if you want to shutdown federal agencies again — some of which aren’t even back to work fully — I will stop every bill coming through the Senate with an amendment to cut their funding if they don’t come to work.\n\n“Local bureaucrats and union bosses — we will not allow you to do more harm to our children again this year.\n\n“Children are not at any more risk from COVID than they are for the seasonal flu.\n\n“Every adult who works in schools has either had the vaccine or had their chance to.\n\n“There is no reason for mask mandates, part-time schools, or any lockdown measures.\n\n“Children are falling behind in school, and are being harmed physically and psychologically by the tactics you have used to keep them from the classroom last year.\n\n“We won’t allow it again.\n\n“If a school system attempts to keep the children from full-time, in-person school, I will hold up every bill with two amendments. One to defund them, and another to allow parents the choice of where the money goes for their child’s education.\n\n“Do I sound fed up to you? That’s because I am.\n\n“I graduated from Duke Medical School, worked in emergency rooms, studied immunology and virology, and ultimately chose to become a surgeon.\n\n“I have been telling everyone for a year now that Dr. Anthony Fauci and other public health officials were NOT following science, and I’ve been proven right time and time again.\n\n“But I’m not the only one who is fed up.\n\n“I can’t go anywhere these days — from work, to events, to airports and Ubers, restaurants and stores, without people coming up to me thanking me for standing up for them.\n\n“For standing up for actual science. For standing up for freedom. For standing against mandates, lockdowns, and bureaucratic power grabs.\n\n“I think the tide has turned, and more and more people are willing to stand up.\n\n“I see stories from across the country of parents standing up to teacher unions and school boards.\n\n“I see members of Congress refusing to comply with Petty Tyrant Pelosi.\n\n“We are at a moment of truth and a crossroads.\n\n“Will we allow these people to use fear and propaganda to do further harm to our society, economy, and children?\n\n“Or will we stand together and say, absolutely not.\n\nRead more at: NeonNettle.com and Resist.news.", "opengraph": {"title": "Rand Paul: ‘Resist’ the ‘Great Reset’ – ‘They can’t arrest us all’", "type": "article", "url": "https://www.randpaul.news/2021-08-11-rand-paul-resist-the-great-reset.html", "site_name": "Rand Paul News", "description": "Republican Sen. Rand Paul (R-KY) has released a statement calling on patriotic Americans to rise up against Joe Biden’s tyrannical government to “resist” the “Great Reset” through mass civil disobedience. (Article by Jay Greenberg republished from NeonNettle.com) Senator Paul has called on the public to stand up against unconstitutional lockdowns, mandates, and harmful policies being imposed by “power-hungry” elites. In an op-ed for […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2021/08/Editorial-Use-Rand-Paul-Podium.jpg"}, "tags": ["pandemic", "Joe Biden", "great reset", "big government", "Liberty", "medical fascism", "Rand Paul", "Nancy Pelosi", "Resist", "COVID", "democrats", "tyranny", "US Constitution", "freedom"], "tweets": [], "movies": [], "links": ["https://neonnettle.com/news/16215-rand-paul-resist-the-great-reset-they-can-t-arrest-us-all-", "https://www.foxnews.com/opinion/mask-mandates-lockdown-choose-freedom-sen-rand-paul", "https://neonnettle.com/news/16215-rand-paul-resist-the-great-reset-they-can-t-arrest-us-all-", "http://resist.news"], "authors": [], "publish_date": null}