{"result_id": "252043", "URL": "https://www.randpaul.news/2022-12-16-ron-paul-social-unrest-violence-economic-crisis.html", "timestamp": "2023-04-25 16:55:55 CEST+0200", "meta": {"description": "Everything former Texas congressman Ron Paul has been saying throughout his career is finally coming to a head as the makings of the “mother of all economic crises” manifests before our very eyes. Citing former advisor to the International Monetary Fund and member of President Clinton’s Council of Economic Advisors Nouriel Roubini, Paul warned in […]", "lang": "en", "keywords": "collapse,crisis,currency crash,currency reset,debt bomb,dollar demise,economy,government debt,inflation,money supply,national debt,Ron Paul,social unrest,violence", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2022-12-16-ron-paul-social-unrest-violence-economic-crisis.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Ron Paul says “social unrest and violence” to follow “mother of all economic crises”", "cleaned_text": "Ron Paul says “social unrest and violence” to follow “mother of all economic crises”\n\nEverything former Texas congressman Ron Paul has been saying throughout his career is finally coming to a head as the makings of the “mother of all economic crises” manifests before our very eyes.\n\nCiting former advisor to the International Monetary Fund and member of President Clinton’s Council of Economic Advisors Nouriel Roubini, Paul warned in a recent piece for his The Ron Paul Institute for Peace & Prosperity that the amount of debt currently held by individuals, businesses, and the government is now so high – and still growing – that the only thing left to happen is a massive pop of the fiat bubble. (Related: Roubini is the same guy who said that Bitcoin has “zero intrinsic value” and is “much worse” than tulip bubble mania.)\n\nAmerican “money” is backed by absolutely nothing, in case you did not know. After our country was taken off the gold standard, the Federal Reserve, a private central bank, put the paper printers on full blast and it has been an exponentially growing debt party ever since.\n\nWe are reaching the end, however, as a debt-based economy can only last for so long before it eventually implodes. We stand at the precipice of that implosion, which is probably why world powers are gearing up for World War III as we speak.\n\n“The inevitable result of the zero-interest and quantitative easing policies is price inflation wreaking havoc on the American people,” Paul writes. “The Fed has been trying to eliminate price inflation with a series of interest rate increases. So far, these rate increases have not significantly reduced price inflation. This is because rates remain at historic lows.”\n\n“Yet the rate increases have had negative economic effects, including a decline in the demand for new homes. Increasing interest rates make it impossible for many middle- and working-class Americans to afford a monthly mortgage payment for even a relatively inexpensive home.”\n\nThe American financial Ponzi scheme is on its last legs\n\nThe number-one priority of the American government in the current economic paradigm is staying afloat through the managing of debt. In order to do this, the powers that be cannot allow for a free market, which would inhibit the Ponzi scheme from continuing the way it has been since 1913 when the Federal Reserve was first created.\n\n“According to the Congressional Budget Office (CBO), interest on the national debt is already on track to consume 40 percent of the federal budget by 2052 and will surpass defense spending by 2029!” Paul further explains. “A small interest rate increase can raise yearly federal debt interest rate payments by many billions of dollars, increasing the amount of the federal budget devoted solely to servicing the debt.”\n\nBy 2035, the nation’s two major entitlement programs, the Social Security “Trust Fund” and the Medicare Trust Fund, will run deficits and go bankrupt. And there is no way to stop this no matter what the Fed tries to do at this point, which will ultimately lead to the world’s rejection of the dollar as the world reserve currency.\n\n“If it raises rates to the levels needed to really combat price inflation, the increase in interest payments will impose hardships on individuals and businesses, as well as raise federal interest payments to unsustainable levels,” Paul says about the Fed. “Also, if the Fed continues to facilitate federal deficits by monetizing the debt, the result will be an economic crisis caused by a collapse in the dollar’ value and rejection of the dollar’s world reserve status.”\n\nIn the end, Paul warns, it will be mass chaos, unrest, and violence as the entire Ponzi scheme falls to ashes. Then comes the escalation of tyranny, the erasure of what remains of the Constitution, and a total collapse of the current order, followed by whatever comes next to replace it.\n\nMore of the latest news about the economy can be found at Collapse.news.", "opengraph": {"title": "Ron Paul says “social unrest and violence” to follow “mother of all economic crises”", "type": "article", "url": "https://www.randpaul.news/2022-12-16-ron-paul-social-unrest-violence-economic-crisis.html", "site_name": "Rand Paul News", "description": "Everything former Texas congressman Ron Paul has been saying throughout his career is finally coming to a head as the makings of the “mother of all economic crises” manifests before our very eyes. Citing former advisor to the International Monetary Fund and member of President Clinton’s Council of Economic Advisors Nouriel Roubini, Paul warned in […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2022/12/Ron-Paul.png"}, "tags": ["currency reset", "debt bomb", "collapse", "dollar demise", "inflation", "crisis", "economy", "national debt", "currency crash", "social unrest", "violence", "government debt", "Ron Paul", "money supply"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/markets/ron-paul-mother-all-economic-crisis-will-lead-social-unrest-violence", "https://naturalnews.com/2018-02-18-roubini-bitcoin-is-much-worse-than-tulip-bubble-mania-zero-intrinsic-value.html", "http://collapse.news", "https://www.zerohedge.com/markets/ron-paul-mother-all-economic-crisis-will-lead-social-unrest-violence", "https://naturalnews.com/2018-02-18-roubini-bitcoin-is-much-worse-than-tulip-bubble-mania-zero-intrinsic-value.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Frandpaulnews%2F2022-12-16-ron-paul-social-unrest-violence-economic-crisis.html&linkname=Ron%20Paul%20says%20%E2%80%9Csocial%20unrest%20and%20violence%E2%80%9D%20to%20follow%20%E2%80%9Cmother%20of%20all%20economic%20crises%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}