{"result_id": "252030", "URL": "https://www.randpaul.news/2022-09-19-two-tiered-system-destroying-credibility-american-judiciary.html", "timestamp": "2023-04-25 16:55:45 CEST+0200", "meta": {"description": "Attorney Tom Renz pointed out that the two-tiered justice system in the U.S. is destroying the credibility of the country’s judiciary. The Ohio-based lawyer made this assertion on the Sept. 13 episode of his program “Lawfare with Tom Renz” on Brighteon.TV.  According to Renz, the corruption in the U.S. – including the politicization of the […]", "lang": "en", "keywords": "Anthony Fauci,biased,Brighteon.tv,corruption,credibility,deception,Donald Trump,fascism,gain-of-function research,judiciary,justice system,Lawfare with Tom Renz,lies,Rand Paul,SARS-CoV-2,Steve Bannon,Tom Renz,two-tiered,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2022-09-19-two-tiered-system-destroying-credibility-american-judiciary.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Lawfare with Tom Renz: Two-tiered system destroying the credibility of America’s judiciary – Brighteon.TV", "cleaned_text": "Lawfare with Tom Renz: Two-tiered system destroying the credibility of America’s judiciary – Brighteon.TV\n\nAttorney Tom Renz pointed out that the two-tiered justice system in the U.S. is destroying the credibility of the country’s judiciary.\n\nThe Ohio-based lawyer made this assertion on the Sept. 13 episode of his program “Lawfare with Tom Renz” on Brighteon.TV. According to Renz, the corruption in the U.S. – including the politicization of the justice system – is mind-blowing. He added that the incidents involving former President Donald Trump and former White House Chief Strategist Steve Bannon reflected this “unacceptable” politicization of the courts.\n\n“It’s mind-blowing to me,” Renz said. “It’s bad enough that the politicization of the justice system is occurring, [and] it’s worse that some of the Republicans are capitulating and allowing it.”\n\nThe Ohio lawyer also lamented the inaction of Senate Minority Leader Mitch McConnell (R-KY). He accused the lawmaker from the Bluegrass State of not calling for hearings against the injustice. Renz also rebuked other Republicans for not speaking out about what is going on.\n\n“What are they going to do here? Do they just want to admit this as a two-tiered justice system? Do they want to just put it out there for people? This is destroying the credibility of the judicial system and the justice system in this country, criminal and judicial. The criminal justice and judicial aspects of this are being destroyed, and it’s on display for everyone to see.”\n\nRenz pointed out that the solution lies in the courts themselves. He called on magistrates to step in and do something about the two-tiered justice system and politicization of the justice process in America if they don’t want the judicial system to lose its credibility. (Related: Lawfare with Tom Renz: The American justice system urgently needs reform – Brighteon.TV.)\n\nAccording to the Brighteon.TV host, everybody should be treated equally under the American justice system, with no regard to their socioeconomic status and skin color. However, this does not appear to be the case nowadays as Americans who are not favored in the political world are being targeted.\n\nRenz: Congress should go after Fauci\n\nElsewhere in the show, Renz also touched on Dr. Anthony Fauci and how the infectious disease expert lied under oath. According to the Ohio-based lawyer, the White House chief medical advisor perjured when he testified before lawmakers in July 2021 regarding gain-of-function research in China’s Wuhan province.\n\n“As you’re aware, it is a crime to lie to Congress,” said Sen. Rand Paul (R-KY).\n\n“On May 11, 2021, you stated that the National Institutes of Health (NIH) has not ever, and does not now fund gain-of-function research and the Wuhan Institute of Virology (WIV). And yet, gain-of-function research was done entirely in the [WIV] and was funded by NIH.”\n\nDespite this revelation, Fauci refused to retract his statement. He shot back at the GOP senator: “You do not know what you are talking about, quite frankly, and I want to say that officially.”\n\n“You are implying that what we did was responsible for the deaths of individuals. I totally resent that, and If anyone is lying here senator, it is you.”\n\nRenz, however, insisted that Fauci was the liar in that exchange. Aside from funding and supporting gain-of-function research, the infectious disease expert himself engaged in it. Moreover, Renz expressed belief that Fauci knew everything that was going on – and that he lied to Congress about it intentionally.\n\nThe Ohio-based lawyer ultimately concluded that if gathered evidence proves that Fauci funded the creation of SARS-CoV-2 in Wuhan, Congress should go after him.\n\nFollow Corruption.news for more about the corruption in America’s justice system.\n\nWatch the Sept. 13 episode of “Lawfare with Tom Renz” below. “Lawfare with Tom Renz” airs every Tuesday at 11:30 a.m.-12 p.m. and Saturday at 12:30-1 p.m. on Brighteon.TV.\n\nAttorney Joseph Tully exposes California’s tarnished justice system in his book, “California: State of Collusion.”\n\nUtah citizen Mike Brown tells Ann Vandersteel: Justice system has once again failed its citizens – Brighteon.TV.\n\nCourt clerk fired for helping a wrongfully accused man after 34 years at job, proving the judicial system could care less about justice.", "opengraph": {"title": "Lawfare with Tom Renz: Two-tiered system destroying the credibility of America’s judiciary – Brighteon.TV", "type": "article", "url": "https://www.randpaul.news/2022-09-19-two-tiered-system-destroying-credibility-american-judiciary.html", "site_name": "Rand Paul News", "description": "Attorney Tom Renz pointed out that the two-tiered justice system in the U.S. is destroying the credibility of the country’s judiciary. The Ohio-based lawyer made this assertion on the Sept. 13 episode of his program “Lawfare with Tom Renz” on Brighteon.TV.  According to Renz, the corruption in the U.S. – including the politicization of the […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2022/09/Justice-Gavel.jpg"}, "tags": ["deception", "Anthony Fauci", "credibility", "lies", "corruption", "biased", "gain-of-function research", "Donald Trump", "Brighteon.tv", "Wuhan coronavirus", "Tom Renz", "judiciary", "justice system", "Steve Bannon", "fascism", "Rand Paul", "Lawfare with Tom Renz", "SARS-CoV-2", "two-tiered"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/18b8efbd-b3b2-46ac-b296-65c97d71c00f", "https://brighteon.tv", "https://naturalnews.com/2022-08-12-tom-renz-american-justice-system-needs-reform.html", "https://brighteon.tv", "https://news.yahoo.com/rand-paul-accused-anthony-fauci-173755306.html", "http://english.whiov.cas.cn/", "https://corruption.news/", "http://www.brighteon.com/18b8efbd-b3b2-46ac-b296-65c97d71c00f", "https://brighteon.tv/", "https://naturalnews.com/2022-06-01-attorney-tully-exposes-tarnished-california-justice-system.html", "https://naturalnews.com/2022-04-01-justice-system-has-again-failed-its-citizens.html", "https://naturalnews.com/042229_court_clerk_wrongfully_accused_judicial_system.html", "https://www.brighteon.com/18b8efbd-b3b2-46ac-b296-65c97d71c00f", "https://news.yahoo.com/rand-paul-accused-anthony-fauci-173755306.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Frandpaulnews%2F2022-09-19-two-tiered-system-destroying-credibility-american-judiciary.html&linkname=Lawfare%20with%20Tom%20Renz%3A%C2%A0Two-tiered%20system%20destroying%20the%20credibility%20of%20America%E2%80%99s%20judiciary%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}