{"result_id": "252035", "URL": "https://www.randpaul.news/2022-09-16-rand-paul-fauci-head-to-head-vaccines.html", "timestamp": "2023-04-25 16:55:49 CEST+0200", "meta": {"description": "Senator Rand Paul interrogated Dr. Anthony Fauci on Wednesday, September 14, regarding his promotion of the Wuhan coronavirus (COVID-19) vaccines for all Americans, regardless of whether or not they have already obtained natural immunity from a previous infection. Paul played a video of Fauci from back in 2004 at a Senate Health, Education, Labor and Pensions […]", "lang": "en", "keywords": "Anthony Fauci,badhealth,badmedicine,badscience,big government,conspiracy,corruption,covid-19,pandemic,Rand Paul,Republicans,science deception,science fraud,traitors,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2022-09-16-rand-paul-fauci-head-to-head-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Senator Rand Paul goes head-to-head with Anthony Fauci over COVID-19 vaccines", "cleaned_text": "Senator Rand Paul goes head-to-head with Anthony Fauci over COVID-19 vaccines\n\nSenator Rand Paul interrogated Dr. Anthony Fauci on Wednesday, September 14, regarding his promotion of the Wuhan coronavirus (COVID-19) vaccines for all Americans, regardless of whether or not they have already obtained natural immunity from a previous infection.\n\nPaul played a video of Fauci from back in 2004 at a Senate Health, Education, Labor and Pensions Committee hearing, where he confirmed that natural immunity has the same effect as a vaccination, which means that those who have been previously infected with a virus would no longer need to receive an additional vaccine.\n\nIn the video Paul presented, Fauci was asked whether someone who got the flu should still get the flu shot, to which he responded no. Those who have gotten the flu are as protected as anybody can be because “the best vaccination is to get infected yourself,” Fauci said at the time.\n\nAfter playing the clip, Paul asked Fauci why he has chosen to ignore the effectiveness of natural immunity during the COVID-19 pandemic.\n\n“We’ve had ever-evolving opinions from you, Dr. Fauci,” Paul pointed out. “Currently, antibody surveys show that 80 percent of children – approximately 80 percent of children – have had COVID, and yet there are no guidelines coming from you or anybody in the government to take into account their naturally-acquired immunity.”\n\n“You seem quite certain of yourself in 2004, but in 2022 there’s a lot less certainty. So when we look at this, we wonder why you seem to really embrace basic immunology back in 2004 and how you, or why you, seem to reject it now,” he continued.\n\nFauci struggled to find the words to defend his choices or his change of opinion, and instead, insisted that the vaccination following the infection gives an added, extra boost.\n\nHe also tried to claim that there wasn’t enough context in the 2004 video clip – the woman who called in for advice about getting the flu shot previously explained that she had an adverse reaction to one. While this could explain Fauci’s recommendation against getting the flu vaccine, this does not explain his promotion of the benefits of natural immunity at the time.\n\n“When you’re trying to tell us that kids need a third or a fourth vaccine, are you including the variability or the variable of the previous infection in the studies? No, you’re not,” Paul shot back.\n\n“You can give kids hundreds of jabs and they’ll make antibodies every time, but that does not prove efficacy. Almost none of your studies, from the CDC or from the government, have the variable of whether or not you’ve been previously infected,” the senator went on.\n\nAfter grilling Fauci about his stance on the vaccines, the senator also lambasted him for failing to be transparent about royalties that he or others in the public health sector may or may not have received from health companies.\n\n“We’ve been asking you, and you refuse to answer whether anybody on the vaccine committees gets royalties from the pharmaceutical companies. I asked you last time, and what was your response? ‘We don’t have to tell you,'” Paul said.\n\nFauci previously said federal regulations do not require individuals to divulge royalties under the Bayh-Dole act, but publicly disclosed some of the royalties he received during the hearing anyway.\n\nPaul then explained that he sought information via the Freedom of Information Act about possible payments to Fauci and others received from companies, but was unsuccessful in this endeavor.\n\nInstead, he dropped a warning that Republicans would get to the bottom of any possible conflicts of interest if they get the chance to retake control of Congress. (Related: Sen. Rand Paul: Dr. Fauci should testify under oath about money given to Wuhan lab.)\n\n“I’ll tell you this: When we get in charge, we’re going to change the rules, and you will have to divulge where you get your royalties from, from what companies, and if anybody on the committee has a conflict of interest. We’re going to learn about it. I promise you that,” he told Fauci.\n\nVisit Vaccines.news for more stories about the dangers of COVID-19 vaccines.\n\nWatch the video below to know more about the conflict between Sen. Paul and Dr. Fauci.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nVideo: Rand Paul calls for “five years in jail” for Fauci lying to congress.\n\nVideo: Rand Paul warns “authoritarian” Fauci’s “casual disdain” for rights is “recipe for totalitarianism.”\n\nSen. Rand Paul vows to probe Anthony Fauci if GOP wins back Senate in 2022.", "opengraph": {"title": "Senator Rand Paul goes head-to-head with Anthony Fauci over COVID-19 vaccines", "type": "article", "url": "https://www.randpaul.news/2022-09-16-rand-paul-fauci-head-to-head-vaccines.html", "site_name": "Rand Paul News", "description": "Senator Rand Paul interrogated Dr. Anthony Fauci on Wednesday, September 14, regarding his promotion of the Wuhan coronavirus (COVID-19) vaccines for all Americans, regardless of whether or not they have already obtained natural immunity from a previous infection. Paul played a video of Fauci from back in 2004 at a Senate Health, Education, Labor and Pensions […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2022/09/Rand-Paul.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "covid-19", "vaccine wars", "science deception", "Rand Paul", "Republicans", "vaccines", "Anthony Fauci", "traitors", "corruption", "science fraud"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/sen-rand-paul-shows-dr-fauci-2004-video-where-he-claims-natural-immunity-is-the-most-potent-vaccination-then-destroys-him-at-hearing-for-lying-to-the-american-people-video/", "http://faucitruth.com", "https://www.washingtonexaminer.com/policy/healthcare/watch-rand-paul-grills-fauci-threatens-new-rules", "https://naturalnews.com/2021-09-04-fauci-should-testify-about-funding-wuhan-lab.html", "http://Vaccines.news", "https://www.brighteon.com/b2993df8-bc25-47ce-bfc1-09361bcc0b54", "https://www.brighteon.com/channels/infowarsnetwork", "https://newstarget.com/2021-09-20-five-years-in-jail-for-fauci-lying.html", "https://newstarget.com/2021-11-21-rand-paul-warns-authoritarian-fauci-recipe-for-totalitarianism.html", "https://newstarget.com/2022-02-08-paul-wants-fauci-investigated-if-gop-wins.html", "https://100percentfedup.com/sen-rand-paul-shows-dr-fauci-2004-video-where-he-claims-natural-immunity-is-the-most-potent-vaccination-then-destroys-him-at-hearing-for-lying-to-the-american-people-video/", "https://www.washingtonexaminer.com/policy/healthcare/watch-rand-paul-grills-fauci-threatens-new-rules", "https://www.brighteon.com/b2993df8-bc25-47ce-bfc1-09361bcc0b54", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Frandpaulnews%2F2022-09-16-rand-paul-fauci-head-to-head-vaccines.html&linkname=Senator%20Rand%20Paul%20goes%20head-to-head%20with%20Anthony%20Fauci%20over%20COVID-19%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}