{"result_id": "252041", "URL": "https://www.randpaul.news/2021-11-15-david-martin-talks-about-covid-criminal-conspiracy.html", "timestamp": "2023-04-25 16:55:53 CEST+0200", "meta": {"description": "“Steel Truth” host Ann Vandersteel featured Dr. David Martin’s revelation about the Wuhan coronavirus (COVID-19) criminal conspiracy. Her show’s Nov. 10 episode on Brighteon.TV recapped Martin’s lecture at the WeCANAct Liberty Conference last month in Salt Lake City, Utah. “We heard a lot of truth tellers talk about the diabolical plans of the Deep State […]", "lang": "en", "keywords": "Ann Vandersteel,Anthony Fauci,badhealth,badmedicine,badscience,bioweapon,Brighteon.tv,conspiracy,covid-19 pandemic,David Martin,depopulation,genocide,Peter Daszak,spike protein,Steel Truth,vaccines,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2021-11-15-david-martin-talks-about-covid-criminal-conspiracy.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Steel Truth: Dr. David Martin talks about the COVID criminal conspiracy – Brighteon.TV", "cleaned_text": "“Steel Truth” host Ann Vandersteel featured Dr. David Martin’s revelation about the Wuhan coronavirus (COVID-19) criminal conspiracy. Her show’s Nov. 10 episode on Brighteon.TV recapped Martin’s lecture at the WeCANAct Liberty Conference last month in Salt Lake City, Utah.\n\n“We heard a lot of truth tellers talk about the diabolical plans of the Deep State – in conspiracy with Big Pharma, Big Government and Big Tech. None was more alarming than the truth from Dr. David Martin,” Vandersteel said.\n\nMartin outlined three important points during his lecture. “No. 1: There is no SARS-CoV-2. [Instead,] there is a bio-weapon that in 1999 was paid for by [Dr.] Anthony Fauci. [It] was patented at the University of North Carolina at Chapel Hill in 2002. It was the recombinant coronavirus, which was actually a bioweapon created by the National Institute of Allergy and Infectious Diseases for this very moment. This bioweapon was engineered to destroy humanity.\n\n“No. 2: There is no COVID-19. There is ‘influenza-like illness,’ and that has been around for a long time. The World Health Organization (WHO) invented the notion [of] COVID-19. It is the first disease in human history to have no clinical diagnostics, none. We had to make up the term ‘asymptomatic carrier,’ which does not exist. You are healthy. You are not an asymptomatic carrier of anything other than their nonsense.\n\n“[No. 3] and most importantly: There is no vaccine. There is [however] a bioweapon that is being injected, which was engineered.” (Related: Fauci KNEW COVID-19 is a biological weapon created in Wuhan lab but chose not to tell Trump – Brighteon.TV.)\n\nMartin also referenced statements by EcoHealth Alliance (EHA) President and zoologist Peter Daszak, who said back in 2015: “Until an infectious disease crisis is very real, present and at the emergency threshold – it is often largely ignored to sustain public funding. [Beyond] the crisis … we need to increase public understanding of the need for medical countermeasures such as a pan-influenza or pan-coronavirus vaccine. A key driver is the media, and the economics follow the hype. We need to use that hype to our advantage to get to the real issues. Investors will respond if they see profit at the end of process.”\n\nMartin said of the EHA president’s remarks: “Do you hear him say ‘to sustain public health?’ No – to sustain public funding. ‘The economics?’ I thought we were talking about public health. You guys think this started in December of 2019 when a bat and a pangolin walked into a bar in Wuhan, hung out and went on a bender? You’re supposed to believe that story, except the conspiracy [that] was published.”\n\nAn admission of felony way before the pandemic began\n\nMartin pointed out in his October 2021 lecture that Daszak’s remarks constituted an admission of multiple felonies. “Not a single governor, Department of Justice member, U.S. attorney, attorney general [or] elected official in this country will actually allow this quote to go into the public record. This is an admission of a felony, criminal conspiracy, to kill and maim Americans.”\n\nMartin also said that on Sept. 18, 2019, the WHO met for its Global Preparedness Monitoring Board (GPMB) meeting. The GPMB meeting attendees agreed to create a “global simulation of the release of a respiratory pathogen” to last from September 2019 until September 2020.\n\nThe next day, former President Donald Trump signed Executive Order 13887, which sought to modernize flu vaccines. “I want you to read what’s in this executive order. These vaccine platform technologies include DNA, mRNA, virus-like S particles, vector based and self-assembling nanoparticle vaccines,” Martin said. “Trump signed an executive order actually mandating that the toxin be released on the public. [But did] he premeditate that? No.”\n\nMartin also mentioned Kentucky Sen. Rand Paul’s exchanges with Fauci during the latter’s appearances before Congress. He told the audience: “Do not donate another dollar to Rand Paul, and I’m telling you why. Paul, on three occasions, has the criminal evidence against Fauci in his possession. Three times he has actually cross-examined Fauci. He has actually gotten Fauci to lie to Congress – and not one time has Paul delivered a knockout blow by presenting the felony evidence.”\n\n“Paul is using his fight with Fauci as a way to raise money for his campaign. That’s monetizing an act of terror, that’s not being a patriot. If you want to get really clear on this, send the Paul campaign a little note saying ‘Happy to donate when you deliver the knockout blow.'” (Related: Dr. Rand Paul doubles down, takes on Dr. Fauci and the coronavirus gain-of-function coverup.)\n\nWatch the full Nov. 10 episode of “Steel Truth” featuring Dr. David Martin’s talk below. “Steel Truth” with Ann Vandersteel airs weekday evenings at 8-10 p.m. on Brighteon.TV.\n\nConspiracy.news has more articles about the plan to kill and maim Americans through the COVID-19 vaccine.", "opengraph": {"title": "Steel Truth: Dr. David Martin talks about the COVID criminal conspiracy – Brighteon.TV", "type": "article", "url": "https://www.randpaul.news/2021-11-15-david-martin-talks-about-covid-criminal-conspiracy.html", "site_name": "Rand Paul News", "description": "“Steel Truth” host Ann Vandersteel featured Dr. David Martin’s revelation about the Wuhan coronavirus (COVID-19) criminal conspiracy. Her show’s Nov. 10 episode on Brighteon.TV recapped Martin’s lecture at the WeCANAct Liberty Conference last month in Salt Lake City, Utah. “We heard a lot of truth tellers talk about the diabolical plans of the Deep State […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2022/05/Covid-19-Coronavirus-America.jpg"}, "tags": ["conspiracy", "Peter Daszak", "David Martin", "Brighteon.tv", "covid-19 pandemic", "genocide", "depopulation", "spike protein", "Steel Truth", "Anthony Fauci", "bioweapon", "vaccines", "Ann Vandersteel", "Wuhan coronavirus"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/8a67445c-820e-4aab-938c-31e78bbfc633", "https://brighteon.tv/", "https://www.unc.edu/", "http://biologicalweapons.news", "https://www.naturalnews.com/2021-11-11-fauci-knew-covid-bioweapon-created-wuhan-lab.html", "https://pandemictimeline.com/2015/03/peter-daszak-addresses-workshop/", "http://genocide.news", "https://www.federalregister.gov/documents/2019/09/24/2019-20804/modernizing-influenza-vaccines-in-the-united-states-to-promote-national-security-and-public-health", "https://www.naturalnews.com/2021-05-18-dr-rand-paul-takes-on-dr-fauci-coronavirus-gain-of-function-coverup.html", "https://www.brighteon.com/8a67445c-820e-4aab-938c-31e78bbfc633", "https://brighteon.tv/", "https://conspiracy.news/", "https://www.brighteon.com/8a67445c-820e-4aab-938c-31e78bbfc633", "https://pandemictimeline.com/2015/03/peter-daszak-addresses-workshop/", "https://www.federalregister.gov/documents/2019/09/24/2019-20804/modernizing-influenza-vaccines-in-the-united-states-to-promote-national-security-and-public-health", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Frandpaulnews%2F2021-11-15-david-martin-talks-about-covid-criminal-conspiracy.html&linkname=Steel%20Truth%3A%20Dr.%20David%20Martin%20talks%20about%20the%20COVID%20criminal%20conspiracy%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}