{"result_id": "252011", "URL": "https://www.randpaul.news/2022-11-03-sen-rand-paul-could-lead-nuremberg-2-0-investigation-covid-crimes.html", "timestamp": "2023-04-25 16:55:31 CEST+0200", "meta": {"description": "Sen. Rand Paul is not about to let federal officials responsible for the country’s response to COVID-19 off the hook after botching much of it, which led to needlessly enduring lockdowns, business closures, and kids being kept out of school for a year and a half. Paul has vowed to hold investigations into the government’s […]", "lang": "en", "keywords": "Anthony Fauci,awakening,cancel Democrats,conspiracy,covid-19,investigation,justice,Justice Democrats,lies,oversight,pandemic,Rand Paul,Resist,Senate hearings,truth,Vote Republican", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2022-11-03-sen-rand-paul-could-lead-nuremberg-2-0-investigation-covid-crimes.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "If Republicans take the Senate, Sen. Rand Paul could lead “Nuremberg 2.0” investigation into COVID crimes", "cleaned_text": "If Republicans take the Senate, Sen. Rand Paul could lead “Nuremberg 2.0” investigation into COVID crimes\n\nSen. Rand Paul is not about to let federal officials responsible for the country’s response to COVID-19 off the hook after botching much of it, which led to needlessly enduring lockdowns, business closures, and kids being kept out of school for a year and a half.\n\nPaul has vowed to hold investigations into the government’s response, dating back to the early days of the pandemic with the country’s lead immunologist, Dr. Anthony Fauci, who flip-flopped on the wearing of masks and implored then-President Donald Trump to keep the country locked down for months on end.\n\n“If you help me win, I promise to subpoena every last document of Dr. Fauci’s unprecedented coverup,” said a Paul fundraising email sent Oct. 20, the Washington Post reported.\n\nHis pledge comes as Republicans are poised to at least win back the House, if not the evenly divided Senate. Should the latter fall into GOP hands, Paul, a Kentucky Republican, would be able to lead an investigation.\n\nAn ophthalmologist by training, Paul is set to be the most senior Republican on the Health, Education, Labor and Pensions Committee, better known as HELP, which oversees the nation’s health and education agencies as part of its expansive portfolio.\n\nThe possibility has rattled health-care leaders and trade groups, worried that Paul will follow through on his criticism of “Big Pharma, the medical establishment and public health officials” for their stances on covid. Paul has argued that those groups wrongly quashed disagreements about how to fight the pandemic.\n\nIn December, Paul said that Fauci should be tried and found guilty of “lying” to Congress for claiming that the agency he has run since the early 1980s, the National Institute for Allergies and Infectious Diseases, did not fund “gain-of-function” research.\n\nHe told Fox Business that he did not “have a lot of hope” that Fauci would be charged by Joe Biden’s politicized Justice Department and attorney general, Merrick Garland, who he said would not be “objectively looking” at the chief White House medical adviser’s testimony to lawmakers.\n\n“We’ve referred him to the Department of Justice, but then again, Merrick Garland is the one now going after parents that go to school board meetings,” Paul said.\n\n“So I don’t have a lot of hope that Merrick Garland is objectively looking at Fauci’s lying,” Paul continued, followed by a pointed additional statement about the long-serving bureaucrat: “Fauci should go to prison for five years for lying to Congress.”\n\n“They have prosecuted other people. They have selectively gone after Republicans, but in no way will they do anything about him lying. But he should be prosecuted for lying,” Paul said.\n\nHe added that “at the very least,” Fauci ought to be “taken out of position because I think he cost people lives through misinformation.”\n\n“Every time he tells people, ‘Oh, wear a cloth mask,’ he is actually endangering people. If you are around someone with COVID, you don’t want to wear a mask, because they don’t work,” he said.\n\nLast month, during congressional testimony, Paul grilled Fauci on royalty earnings and pledged to launch an investigation if the GOP wins the Senate.\n\n“We’ve been asking you and you refused to answer whether anybody on the vaccine committees gets royalties from the pharmaceutical companies,” Paul said. “I asked you last time, and what was your response? We don’t have to tell you. We’ve demanded them through the Freedom of Information Act. And what have you said? We’re not going to tell you. But I tell you this, when we get in charge, we’re going to change the rules and you will have to divulge where you get your royalties from, from what companies, and if anybody in the committee has a conflict of interest, we’re going to learn about it. I promise you that.”\n\n“They are not my committees,” Fauci responded.\n\n“If we win in November, if I’m chairman of a committee, if I have subpoena power, we’ll go after every one of [Fauci’s] records,” Paul said. “We’ll have an investigator go through this piece-by-piece because we don’t need this to happen again.”", "opengraph": {"title": "If Republicans take the Senate, Sen. Rand Paul could lead “Nuremberg 2.0” investigation into COVID crimes", "type": "article", "url": "https://www.randpaul.news/2022-11-03-sen-rand-paul-could-lead-nuremberg-2-0-investigation-covid-crimes.html", "site_name": "Rand Paul News", "description": "Sen. Rand Paul is not about to let federal officials responsible for the country’s response to COVID-19 off the hook after botching much of it, which led to needlessly enduring lockdowns, business closures, and kids being kept out of school for a year and a half. Paul has vowed to hold investigations into the government’s […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2022/11/Editorial-Use-Rand-Paul-Microphone.jpg"}, "tags": ["pandemic", "conspiracy", "covid-19", "Rand Paul", "cancel Democrats", "oversight", "Resist", "Justice Democrats", "investigation", "Vote Republican", "truth", "Anthony Fauci", "awakening", "lies", "justice", "Senate hearings"], "tweets": [], "movies": [], "links": ["https://www.msn.com/en-us/news/politics/rand-paul-says-us-botched-covid-he-could-soon-lead-probes-of-it/ar-AA13Dx5U", "https://conservativebrief.com/rand-55803/", "http://www.pandemic.news", "https://conservativebrief.com/rand-55803/", "https://www.msn.com/en-us/news/politics/rand-paul-says-us-botched-covid-he-could-soon-lead-probes-of-it/ar-AA13Dx5U", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Frandpaulnews%2F2022-11-03-sen-rand-paul-could-lead-nuremberg-2-0-investigation-covid-crimes.html&linkname=If%20Republicans%20take%20the%20Senate%2C%20Sen.%20Rand%20Paul%20could%20lead%20%E2%80%9CNuremberg%202.0%E2%80%9D%20investigation%20into%20COVID%20crimes", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}