{"result_id": "252019", "URL": "https://www.randpaul.news/2018-10-09-rand-paul-family-receiving-death-threats-democrat-cory-booker-intimidation.html", "timestamp": "2023-04-25 16:55:37 CEST+0200", "meta": {"description": "The wife of Republican Senator Rand Paul of Kentucky has written an open letter to Democrat Senator Cory Booker of New Jersey, expressing deep anguish over the horrifying death threats that she and her family have been receiving ever since Booker told his followers to commit “acts of intimidation” against supporters of President Trump. In […]", "lang": "en", "keywords": "Alison Lundergan Grimes,attack,Bette Midler,Brett Kavanaugh,Cher,Christine Blasey Ford,civil war,conservatives,Cory Booker,death threats,democrats,domestic terrorism,doxxed,Kelley Paul,left cult,Left-wing,Leftists,liberalism,liberals,Maxine Waters,open letter,politics,Rand Paul,Republicans,Resist,Resistance,security,violence", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2018-10-09-rand-paul-family-receiving-death-threats-democrat-cory-booker-intimidation.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Sen. Rand Paul’s family receiving death threats after Democrat Cory Booker urged his followers to commit “acts of intimidation” against Trump supporters", "cleaned_text": "Sen. Rand Paul’s family receiving death threats after Democrat Cory Booker urged his followers to commit “acts of intimidation” against Trump supporters\n\nThe wife of Republican Senator Rand Paul of Kentucky has written an open letter to Democrat Senator Cory Booker of New Jersey, expressing deep anguish over the horrifying death threats that she and her family have been receiving ever since Booker told his followers to commit “acts of intimidation” against supporters of President Trump.\n\nIn her letter, Kelley Paul tells of how her family has had to turn their home into a residential prison, of sorts, complete with armed police patrols that make sure nobody tries to harm them. In addition to having their home address “doxxed,” Rand’s personal cell phone number was also made public, she says, noting that the threats they’ve faced have been relentless over the past year and a half.\n\n“I now keep a loaded gun by my bed,” Kelley writes. “Our security systems have had to be expanded. I have never felt this way in my life.”\n\nLast November, Sen. Paul was attacked in his own backyard while gardening, his attacker leaving him with six broken ribs, a damaged lung, and several bouts of pneumonia. We now know that the attacker, 59-year-old Rene Boucher, was an “avowed socialist” who frequently got into fights with his neighbors over government-run health care and other leftist issues.\n\n“In the last 18 months, our family has experienced violence and threats of violence at a horrifying level,” Kelley adds. “I will never forget the morning of the shooting at the congressional baseball practice, the pure relief and gratitude that flooded me when I realized that Rand was okay.”\n\nKentucky Secretary of State Alison Lundergan Grimes cracks jokes about Rand Paul being attacked\n\nRegardless of one’s political stance, violence is typically where any rational-thinking person would draw the line. But not in Democrat land, where both threats and acts of violence are now actively condoned as just another mode of political “discourse.”\n\nIt’s hardly surprising that well-known leftist celebrities like Cher and Bette Midler were quick to defend Sen. Paul’s attacker for being some kind of “hero.” But Kentucky Secretary of State Alison Lundergan Grimes was similarly supportive, even going so far as to crack a joke about it at a speech she gave back in August.\n\nIt’s almost as if violence against Republicans and conservatives has now officially been enshrined as a key tenet of the Democratic Party platform. It actually fits quite well with the amorality of leftism at large, which includes “virtues” like limitless, taxpayer-funded murder of unborn babies and “free stuff” for everyone.\n\nAnd the reason that Democratic figureheads like Cory Booker and Maxine Waters refuse to condemn acts of violence against conservatives and Republicans is because they’re the ones that have been inciting it all along.\n\n“I would call on you to condemn violence, the leaking of elected officials’ personal addresses (our address was leaked from a Senate directory given only to senators), and the intimidation and threats that are being hurled at them and their families,” Kelley concluded in her letter to Booker.\n\nAs all of this has been going on, U.S. Capitol Police have reportedly arrested yet another Democrat agitator who was discovered to have been the culprit who doxxed the addresses of several Republican senators who refused to support the baseless allegations of “sexual assault” that were levied against Judge Brett Kavanaugh by Christine Blasey Ford.\n\nAccording to reports, Jackson A. Cosko had worked for leftist Sens. Maggie Hassan of New Hampshire and Barbara Boxer of California, his most recent designated title in the Senate directory phone book being “legislative correspondent/systems administrator.”\n\nTo keep up with the latest news about Sen. Rand Paul, check out RandPaul.news.", "opengraph": {"title": "Sen. Rand Paul’s family receiving death threats after Democrat Cory Booker urged his followers to commit “acts of intimidation” against Trump supporters", "type": "article", "url": "https://www.randpaul.news/2018-10-09-rand-paul-family-receiving-death-threats-democrat-cory-booker-intimidation.html", "site_name": "Rand Paul News", "description": "The wife of Republican Senator Rand Paul of Kentucky has written an open letter to Democrat Senator Cory Booker of New Jersey, expressing deep anguish over the horrifying death threats that she and her family have been receiving ever since Booker told his followers to commit “acts of intimidation” against supporters of President Trump. In […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2022/05/Editorial-Use-Rand-Paul-Fist.jpg"}, "tags": ["liberalism", "left cult", "Resist", "conservatives", "death threats", "civil war", "Christine Blasey Ford", "Alison Lundergan Grimes", "Republicans", "Maxine Waters", "Leftists", "domestic terrorism", "liberals", "politics", "Kelley Paul", "Brett Kavanaugh", "Cory Booker", "attack", "Rand Paul", "security", "Left-wing", "open letter", "Cher", "doxxed", "Bette Midler", "violence", "democrats", "Resistance"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/big-government/2018/10/05/rand-pauls-wife-open-letter-cory-booker-family-facing-horrifying-threats/", "https://www.naturalnews.com/2017-11-08-man-who-attacked-rand-paul-and-broke-five-of-his-ribs-was-an-avowed-socialist-medical-doctor.html", "https://www.courier-journal.com/story/news/politics/2018/08/06/republicans-lash-out-alison-grimes-desperate-joke-rand-paul-assault/912707002/", "https://www.randpaul.news/", "https://www.breitbart.com/big-government/2018/10/05/rand-pauls-wife-open-letter-cory-booker-family-facing-horrifying-threats/", "https://www.naturalnews.com/2017-11-08-man-who-attacked-rand-paul-and-broke-five-of-his-ribs-was-an-avowed-socialist-medical-doctor.html", "https://www.courier-journal.com/story/news/politics/2018/08/06/republicans-lash-out-alison-grimes-desperate-joke-rand-paul-assault/912707002/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Frandpaulnews%2F2018-10-09-rand-paul-family-receiving-death-threats-democrat-cory-booker-intimidation.html&linkname=Sen.%20Rand%20Paul%E2%80%99s%20family%20receiving%20death%20threats%20after%20Democrat%20Cory%20Booker%20urged%20his%20followers%20to%20commit%20%E2%80%9Cacts%20of%20intimidation%E2%80%9D%20against%20Trump%20supporters", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}