{"result_id": "252014", "URL": "https://www.randpaul.news/2021-09-04-fauci-should-testify-about-funding-wuhan-lab.html", "timestamp": "2023-04-25 16:55:34 CEST+0200", "meta": {"description": "On Wednesday, May 26, Republican Sen. Rand Paul of Kentucky called on National Institute of Allergy and Infectious Diseases (NIAID) Director Dr. Anthony Fauci to testify under oath about whether the NIAID funded scientists at the Wuhan Institute of Virology (WIV) to do gain-of-function research. This is a risky area of study that makes viruses even […]", "lang": "en", "keywords": "Anthony Fauci,anthrax,bat coronaviruses,biological weapons,coronavirus,covid-19,Fauci,gain-of-function,lab-leak theory,mainstream media,MERS-CoV,Rand Paul,SARS outbreak,SARS virus,SARS-cov,SARS-like pandemic,spike protein,Wuhan Institute of Virology,Wuhan lab", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2021-09-04-fauci-should-testify-about-funding-wuhan-lab.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Sen. Rand Paul: Dr. Fauci should testify under oath about money given to Wuhan lab", "cleaned_text": "Sen. Rand Paul: Dr. Fauci should testify under oath about money given to Wuhan lab\n\nOn Wednesday, May 26, Republican Sen. Rand Paul of Kentucky called on National Institute of Allergy and Infectious Diseases (NIAID) Director Dr. Anthony Fauci to testify under oath about whether the NIAID funded scientists at the Wuhan Institute of Virology (WIV) to do gain-of-function research. This is a risky area of study that makes viruses even more contagious.\n\nThe NIAID, a sub-agency under the National Institutes of Health (NIH), awarded a grant to the nonprofit group EcoHealth Alliance to study Chinese bat coronaviruses. The grant apparently ended up funding scientists conducting gain-of-function research.\n\n“I think Dr. Fauci should be made to testify under oath about the money that was given to the lab,” said Paul. “I passed an amendment on the Senate floor that says no more gain-of-function money can be sent to China. This is very important because this could happen again. I mean, they are experimenting with the SARS virus, which is 15 times more deadly than COVID-19.”\n\nPaul noted that there were 11 labs in the U.S. where gain-of-function research could be done.\n\n“The bottom line is he [Fauci] cannot investigate himself. He was responsible for giving this money, so he has every incentive to cover it up and not reveal the truth about it because if the pandemic did come from the lab he would have great culpability in this,” Paul said. (Related: Dr. Rand Paul doubles down, takes on Dr. Fauci and the coronavirus gain-of-function coverup.)\n\nAccording to Fauci, the NIH earmarked $600,000 for the WIV, over a five-year period, to study whether bat coronaviruses could be transmitted to humans.\n\nFauci told the House Appropriations Committee during a hearing that the money was funneled to the Chinese lab through EcoHealth Alliance to fund “a modest collaboration with very respectable Chinese scientists who were world experts on coronavirus.”\n\nBut Fauci denied that the money went toward gain-of-function research. “That categorically was not done,” he said.\n\nEarlier in the hearing, NIH Director Dr. Francis Collins said that researchers at the Wuhan lab “were not approved by NIH for doing gain-of-function research” before adding “we are, of course, not aware of other sources of funds or other activities they might have undertaken outside of what our approved grant allowed.”\n\nThe NIH cut off funding to EcoHealth Alliance in April last year. NIH Deputy Director for Extramural Research Michael Lauer told the group in a letter that the agency “does not believe that the current project outcomes align with the program goals and agency priorities.”\n\nFauci traced the NIH’s interest in bat coronaviruses to the SARS outbreak from nearly two decades ago.\n\n“We had a big scare with SARS-CoV-1 back in 2002, 2003 where that particular virus unquestionably went from a bat to an intermediate host to start an epidemic and a pandemic that resulted in 8,000 cases and close to 800 deaths,” he said. “It would have been almost a dereliction of our duty if we didn’t study this, and the only way you can study these things is you’ve got to go where the action is.”\n\nOn Dec. 19, 2017, the NIH announced that they would resume funding gain-of-function experiments involving influenza, Middle East respiratory syndrome coronavirus (MERS-CoV) and severe acute respiratory syndrome coronavirus (SARS-CoV).\n\nCarrie Wolinetz, head of the NIH Office of Science Policy, said: “Gain-of-function experiments allow us to understand how pandemic viruses evolve, so that we can make predictions, develop countermeasures, and do disease surveillance.”\n\nFour years prior, the NIH had suspended funding gain-of-function studies involving influenza, MERS-CoV and SARS-CoV. Back then, over 200 scientists signed the Cambridge Working Group declaration arguing for a cessation of experiments creating potential pandemic pathogens “until there has been a quantitative, objective and credible assessment of the risks, potential benefits, and opportunities for risk mitigation, as well as comparison against safer experimental approaches.”\n\nThe signing of the declaration came after lab workers were accidentally exposed to anthrax by the Centers for Disease Control and Prevention (CDC).\n\nGain-of-function experiments are typically done in biosafety level 3+ facilities. Such facilities have excellent records and are long-accustomed to handling dangerous material.\n\nThe WIV is a biosafety level 4 laboratory, which is the highest level biocontainment certification, but U.S. Embassy officials issued two diplomatic cables warning about inadequate safety at the lab after a visit in 2018. According to the Washington Post, one of the cables warned that the lab’s work on bat-based coronaviruses represented the risk of a new SARS-like pandemic.\n\nFollow Pandemic.news for more news and information related to the coronavirus pandemic.", "opengraph": {"title": "Sen. Rand Paul: Dr. Fauci should testify under oath about money given to Wuhan lab", "type": "article", "url": "https://www.randpaul.news/2021-09-04-fauci-should-testify-about-funding-wuhan-lab.html", "site_name": "Rand Paul News", "description": "On Wednesday, May 26, Republican Sen. Rand Paul of Kentucky called on National Institute of Allergy and Infectious Diseases (NIAID) Director Dr. Anthony Fauci to testify under oath about whether the NIAID funded scientists at the Wuhan Institute of Virology (WIV) to do gain-of-function research. This is a risky area of study that makes viruses even […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2021/09/Fauci-Committee-Hearing-Coronavirus.jpg"}, "tags": ["SARS-cov", "Anthony Fauci", "Wuhan Institute of Virology", "covid-19", "spike protein", "coronavirus", "SARS virus", "SARS-like pandemic", "mainstream media", "Fauci", "Wuhan lab", "gain-of-function", "anthrax", "biological weapons", "MERS-CoV", "SARS outbreak", "Rand Paul", "bat coronaviruses", "lab-leak theory"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/clips/2021/05/26/rand-paul-fauci-should-be-made-to-testify-under-oath-about-wuhan-lab-funding/", "http://english.whiov.cas.cn/", "https://www.naturalnews.com/2021-05-18-dr-rand-paul-takes-on-dr-fauci-coronavirus-gain-of-function-coverup.html", "https://www.foxnews.com/politics/fauci-gain-of-function-wuhan-collaboration-spillover", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(18)30006-9/fulltext", "https://pandemic.news/", "https://www.breitbart.com/clips/2021/05/26/rand-paul-fauci-should-be-made-to-testify-under-oath-about-wuhan-lab-funding/", "https://www.foxnews.com/politics/fauci-gain-of-function-wuhan-collaboration-spillover", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(18)30006-9/fulltext"], "authors": [], "publish_date": null}