{"result_id": "252034", "URL": "https://www.randpaul.news/2020-09-04-rand-paul-left-wing-mobs-paid-organized-terrorists-hire.html", "timestamp": "2023-04-25 16:55:48 CEST+0200", "meta": {"description": "Were it not for the police officers who were present at the time when Sen. Rand Paul (R-KY) and his wife left the White House following President Donald Trump’s acceptance speech during the Republican National Convention, Antifa and Black Lives Matter (BLM) terrorists probably would have committed murder. This is the claim of Sen. Paul […]", "lang": "en", "keywords": "anarchy,chaos,left cult,Left-wing mobs,lunatics,mob,paid,Rand Paul,riots,terrorism,terrorists-for-hire,thugs,violence,well-organized", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2020-09-04-rand-paul-left-wing-mobs-paid-organized-terrorists-hire.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Sen. Rand Paul says left-wing mobs are PAID, well-organized thugs, confirming they are terrorists-for-hire", "cleaned_text": "Sen. Rand Paul says left-wing mobs are PAID, well-organized thugs, confirming they are terrorists-for-hire\n\nWere it not for the police officers who were present at the time when Sen. Rand Paul (R-KY) and his wife left the White House following President Donald Trump’s acceptance speech during the Republican National Convention, Antifa and Black Lives Matter (BLM) terrorists probably would have committed murder.\n\nThis is the claim of Sen. Paul himself, who told “Fox & Friends” that the angry “mob” of violent thugs that was waiting for him outside the White House likely would have taken his life, and possibly the life of his wife, had law enforcement not been there to protect them.\n\n“It was horrific,” the Republican senator stated, explaining that he already had to have part of his lung removed due to a complication arising from a 2017 assault by his neighbor. This latest incident, Sen. Paul told Steve Doocy, was a whole new level of “unhinged,” revealing the true heart and soul of the Democrat Party.\n\n“They’re attempting to push the police over to get to me, so at one point they push a policeman backwards, he stumbles and he’s trying to catch his balance and I catch the back of his flak jacket to stabilize him to make sure he’s OK because he’s our defense,” Sen. Paul explained.\n\n“If he’s down, the mob’s loose on us.”\n\nSen. Paul went on to thank law enforcement for protecting him and his wife, emphasizing that this is exactly why we need police officers present in order to keep the peace and save lives.\n\n“I truly believe this with every fiber of my being, had they gotten at us they would have gotten us to the ground, we might not have been killed, might just have been injured or been kicked in the head, or kicked in the stomach until we were senseless.”\n\nIf police are abolished, expected to be “kicked in the head and left senseless on the curb”\n\nMany an entitled leftist, observing what is going on from the comfort of her luxury home far away from all the chaos, now believes that abolishing the police is a great way to achieve “social justice” while ending racism. But as Sen. Paul learned first-hand, the endgame is actually lawlessness, destruction and endless violence.\n\n“You’ve seen the pictures of what they do to you,” Sen. Paul explained soberly. “If the police are not there, if you defund the police, if we become Portland, if America becomes Portland, what’s going to happen is people are going to be pummeled and kicked in the head and left senseless on the curb.”\n\n“That would have happened to us, I promise you, had we not had the D.C. Police to support us, we are thankful we have police, and we’ve got to wake up,” Sen. Paul went on to state.\n\nShould Joe Biden and Kamala Harris capture the White House and further this anti-police agenda, the whole country will basically burn to the ground, even worse than it already is currently.\n\n“We can’t have the whole country, we can’t have Joe Biden rule the country and have no police,” Sen. Paul warns. “I mean, we can’t walk down the street in D.C. safely now. That’s how bad it is.”\n\nSen. Paul, who for years has fought against government encroachments such as the “Patriot Act,” says he has authored 22 criminal justice reforms with President Trump and former President Barack Obama, recognizing that law enforcement does needs some reforms.\n\nStill, BLM and Antifa terrorists were out for blood, yelling at Sen. Paul that horrific evening:\n\n“We’re not going to let you go alive unless you’ll say you’re for criminal justice reform.”\n\nFor more related news about Black Lives Matter and Antifa terrorism, check out CivilWar.news.", "opengraph": {"title": "Sen. Rand Paul says left-wing mobs are PAID, well-organized thugs, confirming they are terrorists-for-hire", "type": "article", "url": "https://www.randpaul.news/2020-09-04-rand-paul-left-wing-mobs-paid-organized-terrorists-hire.html", "site_name": "Rand Paul News", "description": "Were it not for the police officers who were present at the time when Sen. Rand Paul (R-KY) and his wife left the White House following President Donald Trump’s acceptance speech during the Republican National Convention, Antifa and Black Lives Matter (BLM) terrorists probably would have committed murder. This is the claim of Sen. Paul […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2022/05/Editorial-Use-Rand-Paul-Microphone.jpg"}, "tags": ["Left-wing mobs", "chaos", "mob", "anarchy", "Rand Paul", "terrorism", "left cult", "paid", "lunatics", "terrorists-for-hire", "thugs", "violence", "well-organized", "riots"], "tweets": [], "movies": [], "links": ["https://www.foxnews.com/politics/rand-paul-attack-police-arrest-investigation-white-house-rnc-protests", "https://www.naturalnews.com/049783_rand_paul_patriot_act_filibuster.html", "http://civilwar.news", "https://www.foxnews.com/politics/rand-paul-attack-police-arrest-investigation-white-house-rnc-protests", "https://www.naturalnews.com/049783_rand_paul_patriot_act_filibuster.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Frandpaulnews%2F2020-09-04-rand-paul-left-wing-mobs-paid-organized-terrorists-hire.html&linkname=Sen.%20Rand%20Paul%20says%20left-wing%20mobs%20are%20PAID%2C%20well-organized%20thugs%2C%20confirming%20they%20are%20terrorists-for-hire", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}