{"result_id": "252031", "URL": "https://www.randpaul.news/2022-11-10-paul-massie-win-kentucky-house-investigations-fauci.html", "timestamp": "2023-04-25 16:55:46 CEST+0200", "meta": {"description": "It was a clean sweep in Kentucky where Sen. Rand Paul and Rep. Thomas Massie were both reelected with flying colors. Now begins the important work of holding the covid criminals accountable for their crimes against humanity, something that Sen. Paul has long promised to do. (Related: Sen. Paul led the first ever congressional hearing […]", "lang": "en", "keywords": "accountability,campaign promises,conspiracy,COVID,deception,deep state,election,Fauci,investigation,Kentucky,midterms,Rand Paul,thomas massie,transparency,Vote Republican", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2022-11-10-paul-massie-win-kentucky-house-investigations-fauci.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Paul and Massie win Kentucky in landslide; will House investigations into Fauci begin in January?", "cleaned_text": "Paul and Massie win Kentucky in landslide; will House investigations into Fauci begin in January?\n\nIt was a clean sweep in Kentucky where Sen. Rand Paul and Rep. Thomas Massie were both reelected with flying colors.\n\nNow begins the important work of holding the covid criminals accountable for their crimes against humanity, something that Sen. Paul has long promised to do. (Related: Sen. Paul led the first ever congressional hearing on gain-of-function research.)\n\n“I promise you: the covid cover-up will end,” Sen. Paul vowed to the country.\n\nSen. Paul also promised to subpoena “every last document of Dr. [Anthony] Fauci,” as well as unearth anything and everything else there is to know that traces the Wuhan coronavirus (Covid-19) to lab research in communist China.\n\n“I will not only hold Dr. Fauci accountable, we will finally investigate why your tax dollars were sent to fund dangerous research in Wuhan,” Sen. Paul is quoted as saying.\n\nSen. Paul announces plans to restore constitutional government in America; Rep. Massie also on board\n\nSen. Paul further promised to deal with the incredible division and partisanship being pushed by fake president Joe Biden, who continues to drive a wedge between Americans with his far-left policies.\n\nAmericans of all political stripes are fed up with all the transgender madness, runaway inflation, and fossil fuel industry demolition, to name just a few key areas where Biden is destroying America.\n\n“It is my hope that as our nation moves forward, the anger, the vitriol and even the death threats will abate,” Sen. Paul is quoted as saying.\n\n“Surely there is common cause in the concept that a limited, constitutional government allows people from all walks of life to live peacefully together.”\n\nRep. Massie has conveyed similar rhetoric to his constituents and to the entire country. He has made numerous noteworthy attempts at ending forced vaccination at schools and putting a lid on any further lockdowns, mask mandates, or other anti-science restrictions.\n\n“Thank a Democrat if your child received a bogus PHD … Pandemic High-School Diploma,” Rep. Massie tweeted on October 30.\n\n“Children were robbed of crucial educational, social, and physical development during the shutdowns. Never let them do this to our kids again.”\n\nBoth Sen. Paul and Rep. Massie are outspoken critics of Biden’s handling of the Ukraine-Russia war, including the endless cash payments being made to the Zelensky regime.\n\nFollowing Rep. Massie’s reelection, the incumbent voted to continue the “fight for personal liberty, economic freedom and constitutionally limited government.” Sen. Paul indicated much the same.\n\n“It’s going to be very exciting to be in the majority,” Rep. Massie said optimistically before the votes were even fully counted.\n\n“And to keep a check on this administration that has done so many hurtful things to our economy and the people of this country.”\n\nNot everyone is thrilled by all this rhetoric, though, because after all: it is just rhetoric. While Sen. Paul and Rep. Massie say a lot of the right things, actually doing them is another story.\n\n“Blowhard politician claims he will get to the bottom of mass murder when he has not gotten anything done in the swamp since he got there,” one commenter wrote, though it is unclear which politician he is referring to.\n\n“Just another distraction from the massive ballot fraud yesterday and into today,” remarked another. “Red wave, eh?”\n\nOn a more positive note, another commenter called Sen. Paul “one great representative in government.”\n\nThis guy took a huge hit, which wasn’t far from killing him, and he still fights harder than any of the others,” this person added. “Bless him.”\n\nThe latest news about Sen. Paul’s probes into the covid conspiracy can be found at Pandemic.news.", "opengraph": {"title": "Paul and Massie win Kentucky in landslide; will House investigations into Fauci begin in January?", "type": "article", "url": "https://www.randpaul.news/2022-11-10-paul-massie-win-kentucky-house-investigations-fauci.html", "site_name": "Rand Paul News", "description": "It was a clean sweep in Kentucky where Sen. Rand Paul and Rep. Thomas Massie were both reelected with flying colors. Now begins the important work of holding the covid criminals accountable for their crimes against humanity, something that Sen. Paul has long promised to do. (Related: Sen. Paul led the first ever congressional hearing […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2022/11/rand-paul.jpg"}, "tags": ["campaign promises", "conspiracy", "Kentucky", "Rand Paul", "deep state", "Fauci", "COVID", "midterms", "deception", "investigation", "thomas massie", "election", "transparency", "accountability", "Vote Republican"], "tweets": [], "movies": [], "links": ["https://headlineusa.com/in-blow-to-covid-cover-up-gops-paul-massie-sweep-ky/", "https://naturalnews.com/2022-08-03-rand-paul-congressional-hearing-gain-function-research.html", "http://pandemic.news", "https://headlineusa.com/in-blow-to-covid-cover-up-gops-paul-massie-sweep-ky/", "https://naturalnews.com/2022-08-03-rand-paul-congressional-hearing-gain-function-research.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Frandpaulnews%2F2022-11-10-paul-massie-win-kentucky-house-investigations-fauci.html&linkname=Paul%20and%20Massie%20win%20Kentucky%20in%20landslide%3B%20will%20House%20investigations%20into%20Fauci%20begin%20in%20January%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}