{"result_id": "252016", "URL": "https://www.randpaul.news/2021-05-26-rand-paul-wont-get-covid19-vaccine.html", "timestamp": "2023-04-25 16:55:35 CEST+0200", "meta": {"description": "Sen. Rand Paul (R-Ky.) says that he won’t get vaccinated against COVID-19, explaining that he already contracted the virus last year and has “natural immunity.” (Article by Jack Phillips republished from TheEpochTimes.com) Paul, who is an ophthalmologist, said that he hasn’t seen evidence proving the vaccine is more effective than having survived the CCP virus, so he won’t get […]", "lang": "en", "keywords": "CDC,coronavirus,COVID,health freedom,immunization,Liberty,Medical Tyranny,natural immunity,pandemic,Rand Paul,Resist,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.randpaul.news/2021-05-26-rand-paul-wont-get-covid19-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.randpaul.news", "title": "Rand Paul says he won’t get COVID-19 vaccine: ‘Show me evidence’", "cleaned_text": "Rand Paul says he won’t get COVID-19 vaccine: ‘Show me evidence’\n\nSen. Rand Paul (R-Ky.) says that he won’t get vaccinated against COVID-19, explaining that he already contracted the virus last year and has “natural immunity.”\n\nPaul, who is an ophthalmologist, said that he hasn’t seen evidence proving the vaccine is more effective than having survived the CCP virus, so he won’t get the shot.\n\n“Until they show me evidence that people who have already had the infection are dying in large numbers, or being hospitalized or getting very sick, I just made my own personal decision that I’m not getting vaccinated because I’ve already had the disease, and I have natural immunity,” Paul, who appears to be the first senator to announce he won’t get vaccinated, told WABC 770 AM on May 23, according to news reports.\n\nPaul has made similar remarks in the past when interviewed about vaccines. Sen. Ron Johnson (R-Wis.), who also recovered from COVID-19, suggested he wouldn’t get the vaccine earlier this year.\n\nPaul tested positive for COVID-19 in March 2020, becoming the first senator to contract the virus. At the time, Paul said he didn’t develop any notable symptoms and wasn’t hospitalized.\n\nThe senator also noted that the pressure from various institutions to get vaccinated flies in the face of individual liberty.\n\n“In a free country, you would think people would honor the idea that each individual would get to make the medical decision, that it wouldn’t be a big brother coming to tell me what I have to do,” Paul said in the interview, suggesting that the pressure campaign around vaccines could be an attempt to manufacture consent for other power grabs.\n\n“Are they also going to tell me I can’t have a cheeseburger for lunch? Are they going to tell me that I have to eat carrots only and cut my calories?” he added. “All that would probably be good for me, but I don’t think big brother ought to tell me to do it.”\n\nThe Centers for Disease Control and Prevention (CDC) has recommended that people who have recovered from the CCP virus should get vaccinated, arguing that health officials don’t know how long natural immunity lasts.\n\n“Even if you have already recovered from COVID-19, it is possible—although rare—that you could be infected with the virus that causes COVID-19 again,” the CDC says on its website.\n\nPaul’s comments come as some states and municipalities have attempted to place pressure on businesses trying to reopen by ascertaining whether their employees have been vaccinated.\n\nLast week, Oregon became the first state to require that individuals in workplaces, businesses, and houses of worship show proof of vaccination before entering facilities without wearing masks. And in Santa Clara County, California, health officials issued an order that stipulated businesses are now required to determine the vaccination status of employees.\n\nRead more at: TheEpochTimes.com and HealthFreedom.news.", "opengraph": {"title": "Rand Paul says he won’t get COVID-19 vaccine: ‘Show me evidence’", "type": "article", "url": "https://www.randpaul.news/2021-05-26-rand-paul-wont-get-covid19-vaccine.html", "site_name": "Rand Paul News", "description": "Sen. Rand Paul (R-Ky.) says that he won’t get vaccinated against COVID-19, explaining that he already contracted the virus last year and has “natural immunity.” (Article by Jack Phillips republished from TheEpochTimes.com) Paul, who is an ophthalmologist, said that he hasn’t seen evidence proving the vaccine is more effective than having survived the CCP virus, so he won’t get […]", "image": "https://www.randpaul.news/wp-content/uploads/sites/390/2021/05/rand-paul.jpg"}, "tags": ["pandemic", "immunization", "Liberty", "Rand Paul", "natural immunity", "Resist", "COVID", "vaccine", "Medical Tyranny", "coronavirus", "health freedom", "CDC"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/t-rand-paul", "https://www.theepochtimes.com/rand-paul-first-senator-to-announce-he-wont-get-covid-19-vaccine_3826973.html", "https://www.theepochtimes.com/giving-the-right-name-to-the-virus-causing-a-worldwide-pandemic-2_3277200.html", "https://nypost.com/2021/05/23/rand-paul-wont-get-vaccinated-because-he-already-had-covid/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/faq.html", "https://www.theepochtimes.com/oregon-first-state-to-require-vaccination-proof-for-maskless-entry-into-businesses-workplaces-and-churches_3825230.html", "https://www.theepochtimes.com/california-countys-order-requires-businesses-to-track-covid-19-vaccination-status-of-all-employees_3825265.html", "https://www.theepochtimes.com/rand-paul-first-senator-to-announce-he-wont-get-covid-19-vaccine_3826973.html", "http://healthfreedom.news"], "authors": [], "publish_date": null}