{"result_id": "256002", "URL": "http://www.realnews24.com/msnbc-host-says-newborn-infants-dont-count-as-alive-unless-parents-decide-they-do-infanticide-is-the-new-abortion/", "timestamp": "2023-04-25 16:57:28 CEST+0200", "meta": {"description": "Today Natural News denounces Melissa Harris-Perry, the latest talking head \"death worshipper\" to publicly imply that she supports the murder of living, breathing newborn children. According to Harris-Perry, life begins when the parents feel like life begins. And together with some twisted new \"ethics\" arguments from the radical left, this can include months or years after a child is born.", "lang": "en", "keywords": "Activism,Life,News,Rights,murder,babies,melissa,alternative news,free,media,technology,politics,science,video,videos,documentaries,clips", "favicon": "http://1098967983.rsc.cdn77.org/wp-content/uploads/2014/06/favicon.png", "canonical": "http://www.realnews24.com/msnbc-host-says-newborn-infants-dont-count-as-alive-unless-parents-decide-they-do-infanticide-is-the-new-abortion/", "encoding": "UTF-8"}, "image": null, "domain": "www.realnews24.com", "title": "MSNBC host says newborn infants don’t count as ‘alive’ unless parents decide they do; infanticide is the new abortion", "cleaned_text": "Today Natural News denounces Melissa Harris-Perry, the latest talking head “death worshipper” to publicly imply that she supports the murder of living, breathing newborn children. According to Harris-Perry, life begins when the parents feel like life begins. And together with some twisted new “ethics” arguments from the radical left, this can include months or years after a child is born.\n\nThat’s why I need to premise this article with a disclaimer: This article is not about abortion. It’s about the murder of children after they are born. Because once a child is born alive, terminating that life is no longer a “choice” … it’s murder by every legal and moral standard. Because while abortion friends and foes can argue about when life begins in the womb, no one disagrees that a child born alive is, well, ALIVE… do they?\n\nIndeed, they do. MSNBC talking head Melissa Harris-Perry insists that life only begins when the parents have a “feeling” that it begins. “When does life begin? I submit the answer depends an awful lot on the feeling of the parents. A powerful feeling — but not science,” Harris-Perry said to nationwide astonishment on her July 21 MSNBC show.\n\nAnd in one stroke, she simultaneously condones the murder of newborn infants (i.e. “post-birth abortion”) while attacking the science of biology which unambiguously states that a living, breathing infant with a heartbeat and brain function is alive, not dead.\n\nBut don’t tell that to the radical abortion whackos. Far beyond arguing for the “right” to abort a baby in the first or second trimester, many abortion advocates who run in the same circles as Melissa Harris-Perry are now publicly arguing that it is okay for parents to kill their children up to age three. This is now being promoted as a “post-birth abortion.”\n\nIt was also called a “fourth trimester abortion” by a clever pollster who recently took to the streets of George Mason University to find out if summertime college students would sign a petition legalizing fourth-trimester abortions. Nearly all who were asked to sign the petition did so! One of the college students even asked whether the procedure would “cause harm to the child.”\n\n“Well the child wouldn’t be there anymore,” responded the pollster, after which the college student then proceeded to sign the petition.\n\nWatch this video yourself at:\n\nAnd yes, this is how incredibly stupid many of today’s college students really are. Then again, I remember a guy back in college who walked in on a group of us watching a football game and asked, “How many quarters are there in a football game?” His lack of mathematical prowess would have made him a ripe target for the “fourth trimester abortion” gimmick, I’ll bet.\n\nMurdering live babies under the label of “abortion”\n\nLet’s be clear about where all this is headed. This is not about arguing over a woman’s right to have a first- or second-trimester abortion. This isn’t even a debate about a third-trimester abortion, the kind of abortion that was recently outlawed in Texas, much to the despair of late-term abortion advocates across the country, some of whom actually chanted “Hail Satan” in unison at the Austin abortion rally.\n\nThis is really about the zealous desire of the radical left to legalize the “aborting” of babies after they are born alive so that parents can have the legal right to kill living babies they suddenly decide they don’t want to raise.\n\nGetting back to Harris-Perry, according to her radical brand of death culture ideology, a parent can “decide” that a baby born alive isn’t really alive yet. That parent can wait to see whether the baby is well-behaved, or cute, or has the right skin color, or whatever, before deciding whether to keep it or kill it. If such an ideology were fronted by someone like George Bush, it would be wildly derided as barbaric and anti-human, but because the idea of murdering newborn babies is being pushed by liberals, it is met with silence instead of outrage.\n\n“When a pregnancy is wanted . . . It is easy to think of the bump as a baby,” says Melissa Harris-Perry, implying that when a pregnancy is not wanted, that bump isn’t a baby at all. Somehow it’s just a mass of dead tissue that you can dispose of at will. The fact that the “bump” results in a live childbirth is never admitted by people like Harris-Perry. The baby isn’t “alive” until you decide it is!\n\nRecently, two black parents were shocked to find that the woman gave birth to a white baby. According to Melissa Harris-Perry, these two black parents can now “decide” their white baby isn’t alive at all and therefore commit infanticide that’s rephrased as a “post-birth abortion.”\n\nThis is the position embraced by the radical left: babies are not humans, and it is okay to murder them even up to age three.\n\nNewborn babies have no “moral right to life”\n\nA study published in the Journal of Medical Ethics argues that newborn babies have no “moral right to life,” and are thus not actually “persons.” Alberto Giubilini, from The University of Milan, and Francesca Minerva, a post-doctoral fellow at The University of Melbourne’s Centre for Applied Philosophy and Public Ethics, are heroes of the radical left. They argue that infanticide should be legal but renamed “post-birth abortion.”\n\nThey insist that newborn babies have no right to life and that parents can simply “decide” to kill their children for all sorts of reasons, including feeling like the child will be too expensive to raise, or suddenly discovering the fact that newborn babies cry a lot.\n\n“Rather than being actual persons, newborns were potential persons,” write the study authors. They don’t really count as human beings until the parents decide they do.\n\nThis appears to be the same argument being made by MSNBC’s Melissa Harris-Perry, who expressed extreme outrage over the murder of Trayvon Martin but seems to openly embrace the murder of countless black infants who are born alive and healthy but are “unwanted” by their parents. Life begins based “on the feeling of the parents,” she submits. So it’s utterly unscientific and subject to (liberal) interpretation, which in this case seems to favor infanticide and even eugenics. (By far most aborted babies in America are Black and Hispanic. If post-birth abortion is openly embraced, most of the murdered infants will also be Black and Hispanic.)\n\nAnd so the violent contradiction of radical leftist ideology is exposed in the raw: Liberals claim to support “equality” but then they consider living babies to be “non-persons.” Liberals claim to support racial minorities, yet they endorse and even encourage the murder of the young babies of their own minority race. Liberals claim that all life is sacred, but their glaring exception is the life of a newborn child, which should be the most sacred of all but is instead considered worthless.\n\nWhen it comes to taking a life, pro-abortion liberals are all for it. But when it comes to defending your life with a legal firearm, liberals are aggressively opposed to it.\n\nSo let me get this straight: Murder is okay but self defense is evil?\n\nOr better yet, if Trayvon Martin had been an “unwanted” newborn just six months old, would his murder have been celebrated by the left instead of mourned? Help me figure this out, please, because I’m trying to understand at what age, exactly, the murder of a young black baby invokes racially-charged marches across the nation vs. receiving applause from people like Melissa Harris-Perry. Apparently if Trayvon Martin had been murdered by his own parents 16 years earlier, that would have been perfectly acceptable to these people.\n\nAt the risk of being accused of making sense, let me state the obvious here: People like Melissa Harris-Perry are the new holocaust deniers. They are anti-human agenda pushers who literally inspire others to murder their own children.\n\nI don’t know about you, but I cannot accept, as a spiritual human being and a responsible member of society, the legalization of the murder of babies who are born alive and breathing. Yet that is precisely what the radical left is pushing for: the “right” to murder their own children up to the age of three. (Oh yeah, they’re also pushing for the “right” to kill elderly people, but that’s another article altogether.)\n\nSuch an agenda is despicable, if not downright demonic. And the fact that people like Harris-Perry spew this death cult violence on MSNBC — the propaganda branch of the White house — only further proves that MSNBC has lost all credibility and is now being run as a Hitler-style holocaust support network that tolerates hosts who effectively endorse the mass murder of babies all across America.\n\nThere is evil in this nation, and wicked women like Harris-Perry are steeped in it. Mainstream media networks like MSNBC thrive on it, and the destructive forces that currently occupy the White House gain power from it. Everywhere you turn, there are efforts under way to sow racial hatred, murder innocent babies, poison the food supply, chemically lobotomize children with vaccines and enslave the masses medically and economically.\n\nI hereby denounce this wickedness, on the record, as a statement of principle for the world to witness. I will forever oppose these merchants of death and their sick, demented eugenics schemes. I will fight to protect the lives of the innocent for as long as I am alive, even if those innocent lives include two-day-old black babies who have just been brought into this world through the miracle of gestation and childbirth.\n\nI call for all Natural News readers and supporters to take steps each and every day to resist evil and overcome the forces of death and destruction that now dominate our society through witch-hearted minions like Melissa Harris-Perry, a traitor to humanity and an endorser of the murder of children.\n\nThis woman should be immediately blackballed by the entire media and yanked off the air to return to her own little world of tampon earrings and dead newborns. Or maybe she will murder her own baby in the near future and feature it on the set of MSNBC in a special celebration broadcast complete with pentagrams etched on the desk and a chorus of hooded Satan worshippers drinking the blood of the dead fetus while Melissa Harris-Perry reads the names of sponsors. Sadly, it would probably get record ratings and be heralded by the death culture media as “pioneering television.” And it would most certainly be cheered by the radical left as a “choice.”\n\nThis article first appeared on Natural News.", "opengraph": {"type": "article", "title": "MSNBC host says newborn infants don’t count as ‘alive’ unless parents decide they do; infanticide is the new abortion", "description": "Today Natural News denounces Melissa Harris-Perry, the latest talking head \"death worshipper\" to publicly imply that she supports the murder of living, breathing newborn children. According to Harris-Perry, life begins when the parents feel like life begins. And together with some twisted new \"ethics\" arguments from the radical left, this can include months or years after a child is born.", "url": "http://www.realnews24.com/msnbc-host-says-newborn-infants-dont-count-as-alive-unless-parents-decide-they-do-infanticide-is-the-new-abortion/", "image": "http://1098967983.rsc.cdn77.org/wp-content/uploads/2013/11/166472458_c9f480195e_z.jpg", "article:published_time": "2013-11-18", "article:modified_time": "2016-11-02", "article:author": "http://www.realnews24.com/author/admin/", "article:tag": "Rights", "site_name": "Real News 24: Breaking Alternative News Source"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe src=\"//www.youtube.com/embed/4v8--9R0I2Q\" height=\"360\" width=\"640\" allowfullscreen=\"\" frameborder=\"0\"/>", "src": "//www.youtube.com/embed/4v8--9R0I2Q"}], "links": ["http://www.naturalnews.com/", "http://www.naturalnews.com/abortion.html", "http://www.naturalnews.com/post-birth_abortion.html", "http://www.naturalnews.com/child.html", "http://www.naturalnews.com/041102_abortion_activists_Hail_Satan_post-birth_abortions.html", "http://www.naturalnews.com/Melissa_Harris-Perry.html", "http://www.sowetanlive.co.za/news/world/2011/05/17/black-parents-shocked-when-son-was-born-white", "http://www.naturalnews.com/infanticide.html", "http://www.naturalnews.com/035539_Medical_ethics_newborn_babies_abortion.html", "http://www.naturalnews.com/murder.html", "http://www.campusreform.org/blog/?ID=4872", "http://www.cafemom.com/group/1021/forums/read/18835909/Abortion_backer_Melissa_Harris_Perry_Life_begins_whenever_you_feel_like_it_does", "http://www.naturalnews.com/041398_post-birth_abortion_infanticide_Melissa_Harris-Perry.html", "http://www.youtube.com/user/MRCTVdotOrg?feature=watch"], "authors": [], "publish_date": "2013-11-18"}