{"result_id": "256001", "URL": "http://www.realnews24.com/australia-determined-to-forcibly-vaccinate-by-intentional-and-controlled-release-of-aerosolized-gmo-vaccine/", "timestamp": "2023-04-25 16:57:27 CEST+0200", "meta": {"description": "The Office of the Gene Technology Regulator (OGTR) is on its way to approve a licence application from PaxVax Australia (PaxVax) for the intentional release of a GMO vaccine consisting of live bacteria into the environment in Queensland, South Australia, Western Australia and Victoria.", "lang": "en", "keywords": "Environment,Health,News,wnv,aerial,virus,alternative news,free,media,technology,politics,science,video,videos,documentaries,clips", "favicon": "http://1098967983.rsc.cdn77.org/wp-content/uploads/2014/06/favicon.png", "canonical": "http://www.realnews24.com/australia-determined-to-forcibly-vaccinate-by-intentional-and-controlled-release-of-aerosolized-gmo-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.realnews24.com", "title": "Australia Determined To Forcibly Vaccinate By Intentional and Controlled Release of Aerosolized GMO Vaccine", "cleaned_text": "The Office of the Gene Technology Regulator (OGTR) is on its way to approve a licence application from PaxVax Australia (PaxVax) for the intentional release of a GMO vaccine consisting of live bacteria into the environment in Queensland, South Australia, Western Australia and Victoria.\n\nAccording to the regulator, it qualifies as a limited and controlled release under section 50A of the Gene Technology Act 2000 (the Act).\n\nPaxVax is seeking approval to conduct the clinical trial of a genetically modified live bacterial vaccine against cholera. Once underway the trial is expected to be completed within one year, with trial sites selected from local government areas (LGAs) in Queensland, South Australia, Victoria and Western Australia. PaxVax has proposed a number of control measures they say will restrict the spread and persistence of the GM vaccine and its introduced genetic material, however there is always a possiblity of these restrictions failing and infecting wildlife and ecosystems.\n\nAerial vaccines have used in the United States directed towards animals by the use of plastic packets dropped by planes or helicopters. Sanofi(who is one of the largest vaccine manufacturers in the world) has subsidiary companies such as Merial Limited who manufactureRaboral, an oral live-virus poisonous to humans yet distributed wildlife in the masses.\n\nIn 2006 Michael Greenwood wrote an article for the Yale School of Public Health entitled, “Aerial Spraying Effectively Reduces Incidence of West Nile Virus (WNV) in Humans.” The article stated that the incidence of human West Nile virus cases can be significantly reduced through large scale aerial spraying that targets adult mosquitoes, according to research by the Yale School of Public Health and the California Department of Public Health.\n\nUnder the mandate for aerial spraying for specific vectors that pose a threat to human health, aerial vaccines known as DNA Vaccine Enhancements and Recombinant Vaccine against WNV may be tested or used to “protect” the people from vector infection exposures. DNA vaccine enhancements specifically use Epstein-Barr viral capside’s with multi human complement class II activators to neutralize antibodies. The recombinant vaccines against WNV use Rabbit Beta-globulin or the poly (A) signal of the SV40 virus. In early studies of DNA vaccines it was found that the negative result studies would go into the category of future developmental research projects in gene therapy. During the studies of poly (A) signaling of the SV40 for WNV vaccines, it was observed that WNV will lie dormant in individuals who were exposed to chicken pox, thus upon exposure to WNV aerial vaccines the potential for the release of chicken pox virus would cause a greater risk to having adult onset Shingles.\n\nIn February 2009 to present date, aerial spraying for the WNV occurred in major cities within the State of California. During spraying of Anaheim, CA a Caucasian female (age 50) was exposed to heavy spraying, while doing her daily exercise of walking several miles. Heavy helicopter activity occurred for several days in this area. After spraying, she experienced light headedness, nausea, muscle aches and increased low back pain. She was evaluated for toxicological mechanisms that were associated with pesticide exposure due to aerial spraying utilizing advanced biological monitoring testing. The test results which included protein band testing utilizing Protein Coupled Response (PCR) methods were positive for KD-45. KD-45 is the protein band for SV-40 Simian Green Monkey virus. Additional tests were performed for Epstein-Barr virus capside and Cytomeglia virus which are used in bioengineering for gene delivery systems through viral protein envelope and adenoviral protein envelope technology. The individual was positive for both; indicating a highly probable exposure to a DNA vaccination delivery system through nasal inhalation.\n\nIn the Quarterly FunVax Review in June, 2007, the report lists the objective of a project listed as ID: 149AZ2 as a preparation of a viral vector that will inhibit/decrease the expression of a specific disruption gene (VMAT2) within a human population. It further indicates in the abstract that six method of virus dispersal were tested including high altitude release, water supply release, insect transmission, and various methods of diffusion.\n\n \n\n Sources:\n\n ogtr.gov.au\n\n vactruth.com\n\n cdc.gov\n\nThis article first appeared on Prevent Disease.", "opengraph": {"type": "article", "title": "Australia Determined To Forcibly Vaccinate By Intentional and Controlled Release of Aerosolized GMO Vaccine", "description": "The Office of the Gene Technology Regulator (OGTR) is on its way to approve a licence application from PaxVax Australia (PaxVax) for the intentional release of a GMO vaccine consisting of live bacteria into the environment in Queensland, South Australia, Western Australia and Victoria.", "url": "http://www.realnews24.com/australia-determined-to-forcibly-vaccinate-by-intentional-and-controlled-release-of-aerosolized-gmo-vaccine/", "image": "http://1098967983.rsc.cdn77.org/wp-content/uploads/2013/11/An-2_plane_spraying_wheat_crops.jpg", "article:published_time": "2013-11-17", "article:modified_time": "2013-11-17", "article:author": "http://www.realnews24.com/author/admin/", "article:tag": "News", "site_name": "Real News 24: Breaking Alternative News Source"}, "tags": [], "tweets": [], "movies": [], "links": ["http://preventdisease.com/", "http://www.ogtr.gov.au/internet/ogtr/publishing.nsf/Content/dir126ebnotific-htm", "http://en.sanofi.com/", "http://www.merial.com/Pages/default.aspx", "http://www.raboral.com/pdf/raboralfaq.pdf", "http://www.wanttoknow.info/health/funvax070601.pdf", "http://www.ogtr.gov.au/internet/ogtr/publishing.nsf/Content/dir126ebnotific-htm", "http://vactruth.com/2010/05/11/polio-aerial-nano-delivery-systems/", "http://www.cdc.gov/mmwr/preview/mmwrhtml/mm5843a2.htm", "http://preventdisease.com/news/13/111513_Australia-Determined-To-Forcibly-Vaccinate-By-Intentional-and-Controlled-Release-Aerosolized-GMO-Vaccine.shtml"], "authors": [], "publish_date": "2013-11-17"}