{"result_id": "258009", "URL": "https://redoubtnews.com/?nltr=MTMxOzQ4MztodHRwczovL3d3dy53bmRuZXdzY2VudGVyLm9yZy90aGUtY3VscHJpdC1pbi1jb3ZpZC1hbmQtdmFjY2luZS1oYXJtLW1pY3JvLWJsb29kLWNsb3RzLzs7Y2IzMGRlZWYyOTFkNzMwYzBlMGI4ZWViYzZhN2IzZmI%3D", "timestamp": "2023-04-25 16:57:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.wndnewscenter.org/the-culprit-in-covid-and-vaccine-harm-micro-blood-clots/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "The culprit in COVID and vaccine harm: Micro blood clots – WND News Center", "cleaned_text": "What should receive far greater attention today is the formation of microscopic blood clots throughout COVID-infected bodies, caused by spike proteins. These clots are not found through conventional medical scanning and imaging technologies.\n\nKnow this: This results from COVID spike proteins that screw up fine blood vessels, causing micro blood clots. The spike protein molecules from COVID infection are the same as what happens when COVID vaccines pump huge numbers of them into the body. So, vaccines create the same blood clot problem as COVID itself in many people.\n\nThis article cites micro blood clots as an explanation of three important pandemic problems:\n\n1. vaccine adverse health impacts, including deaths;\n\n 2. a broad array of COVID infection illnesses and deaths;\n\n 3. millions of people with “long” COVID suffering diverse health problems.\n\nWhat can these micro blood clots cause? That is the key question. There is nothing but bad news that very few people are aware of. Understand this: You do not want micro blood clots throughout your body – and finding proof that you have them is difficult.\n\nBlood clots that occur in the tiniest blood vessels are referred to as microvascular thromboses and reduce blood flow. The clinical symptoms depend on the organs that are most strongly affected.\n\nHere is the main point: Many patients can experience micro blood clotting that isn’t visible to the naked eye or normal scans, but it still produces bad impacts. When pumped to the lungs they may be diagnosed as pulmonary embolisms. If they reach the brain, they can cause a stroke or confusion. If they lodge in the heart, they can cause a heart attack or promote inflammation. If they lodge in the smaller blood vessels that provide oxygen to the hands or feet, they can cause those limbs to go numb and possibly require amputation. Clots in other organs, such as the liver or the kidneys, could cause those organs to fail.\n\nThe diagnosis from the clotting depends largely on where the clots end up lodging, which explains why people who take spike protein “vaccine” shots experience such a wide array of injuries and deaths. Over 1 million injuries are now reported in VAERS CDC database, with estimates of hundreds of thousands of deaths so far in the U.S. alone.\n\nThe eminent Dr. Peter McCollough, a truly great medical expert, has addressed micro clots. Early in the pandemic he noted that “the spike protein itself caused coagulation or blood clotting. And a unique type of coagulation. It caused the red blood cells to stick together. At the same time the platelets stick together. So, this is a very different type of blood clotting than we would see with major blood clots in the arteries and veins. For instance, blood clots involved in stroke and heart attack. Blood clots involved in major blood vessels in the legs. This was a different type of clotting, and in fact the Italians courageously did some autopsies and found micro blood clots in the lungs. And so, we understood in the end, the reason why the lungs fail is not because the virus is there. It is because micro blood clots are there. When people can’t breathe, the problem is micro-blood clotting in the lungs. The spicule on the ball of the virus itself damages blood vessels [and] that causes blood clotting.”\n\nProbably most people who have late-stage COVID and die have severe lung problems, and micro clots are a likely cause.\n\nNow we get to the key and mostly ignored point. COVID vaccines can insert spike proteins just like the ones created by COVID infection. Should we expect health problems from COVID vaccines just like ones from COVID infection? Yes!\n\nCanadian doctor blew the whistle about micro clots from vaccines\n\nMonths ago, in July 2021, a brave and smart Canadian doctor, Charles Hoffe, went public with his findings on COVID-vaccinated patients. Using the d-dimer test of blood, he found that 62% of hundreds of his vaccinated patients had high numbers indicating the presence of micro blood clots. A d-dimer test measures the amount of degraded fibrin in the blood.\n\nHe did more than just release that finding. He said that the use of mRNA vaccines would “kill most people through heart failure.”\n\nNote that in April 2021, Dr. Hoffe wrote an open letter to the Provincial Health Officer for British Columbia trying to get the Canadian government to recognize the bad vaccine impacts related to micro blood clots. He was not successful in stopping use of the COVID vaccines.\n\nTrying to get media attention, the doctor worked to warn the public and the medical community that the vast majority of people who are getting injected with the genetic experimental vaccines will die within a few short years from heart failure.\n\nHe explained that he observed in his patients who took an mRNA (messenger RNA) “vaccine” from either Pfizer-BioNTech or Moderna that their capillaries were now plugging up, which he says will eventually lead to a serious cardiovascular event.\n\nIn plain language he said that the mRNA shots are programmed to turn a person’s body into a spike protein “factory,” and that over time these mass-produced spike proteins cause progressive blood clotting.\n\nHe said what other medical experts have expressed, namely that only 25% of the “vaccine” injected into a person’s arm actually stays in the arm. The other 75% is collected by your lymphatic system and literally fed into your circulation so these little packages of messenger RNA invade your body. And in a single dose of Moderna “vaccine” there are literally 40 trillion mRNA molecules.\n\nDr. Hoffe said that while these packages were designed by Big Pharma to be absorbed directly into people’s cells, the only place they can actually be absorbed is around the blood vessels and into capillary networks, which are the tiniest blood vessels where blood flow is slow and where genes are released.\n\n“Your body then gets to work reading and then manufacturing trillions and trillions of these spike proteins,” he said. “Each gene can produce many, many spike proteins. The body then recognizes these are foreign bodies so it makes antibodies against it so you are then protected against COVID. That’s the idea.” Now we know that this theory does not assure destruction of the virus or transmission of it, nor effective immunity.\n\nHere is what you need to understand: Though the claim has long been that these spike proteins act as a deterrent to viral infection after being injected into a person’s body, the reality is that they actually become part of the cell wall of a person’s vascular endothelium or linings of the blood vessels. In very small diameter blood vessels, the spikes have a big impact on blood flow.\n\nYour blood vessels are supposed to be smooth so that your blood flows smoothly. After spike proteins invade your body the small blood vessels have these little spikey bits sticking out which impede blood flow and can cause clots. And if you get a lot of clots, then your blood platelet count can greatly decrease, and this can lead to bleeding problems.\n\nDr. Hoffe says it is an inevitability that the vaccine injected will develop blood clots because as the vaccine-inserted spike proteins embed themselves within blood vessels and capillaries, blood platelets circulate around trying to fix the problem by creating increasingly more clots.\n\n“So, when the platelet comes through the capillary it suddenly hits all these COVID spikes and it becomes absolutely inevitable that blood clots will form to block that vessel,” he writes. “Therefore, these spike proteins can predictably cause blood clots. They are in your blood vessels (if mRNA ‘vaccinated’) so it is guaranteed.”\n\nWhat must be remembered is that these blood clots are different than the “rare” ones spoken about by physicians that show up on CT scans and MRIs or even ultrasound images. These are microscopic and do not show up on tests, as they can only be detected using a blood test known as d-dimer. And nearly all doctors do not routinely use this test.\n\nDr. Hoffe performed d-dimer tests on his mRNA “vaccinated” patients, which led him to the discovery that at least 62% of them have these microscopic blood clots. Why some people do not get the clots is not entirely clear.\n\n“The most alarming part of this is that there are some parts of the body like the brain, spinal cord, heart and lungs which cannot [regenerate],” he said. “When those tissues are damaged by blood clots, they are permanently damaged.” That is the deadly issue for understanding why there are huge numbers of vaccinated people who have suffered death or a broad array of serious health impacts from COVID vaccines.\n\nWhile there has been very limited medical research on micro clots from vaccines, there has been much more on micro clots in COVID patients. Here are some findings from a key study in August 2021 with the title “Study identifies micro clots as cause of death in some severely ill COVID-19 patients.”\n\nLoma Linda University Health researchers found that severely ill COVID-19 patients likely die as the result of micro clots formed in the lungs that spread to cause deadly damage to organs throughout the body. This finding differed from the current view that the COVID-19 virus travels to the body’s organs and damages blood vessel lining in those organs.\n\nAccording to this research, once the clotting process begins, the body is no longer fighting against the virus but mostly against the clotting process instead.\n\n“This could change our approach to fighting this disease because we may have been looking in the wrong place,” saids Brian Bull, M.D., a pathologist, former dean of the Loma Linda University School of Medicine, and the study’s first author. “We have been looking for a treatment against a viral disease, but we should now also look for therapy for a viral disease that has transformed into a clotting disorder.”\n\nIn another study, “A macrophage attack culminating in microthromboses characterizes COVID-19 pneumonia,” published in the Journal of Immunity, Inflammation and Disease, proposes an explanation for why COVID-19 patients die from a vast array of conditions such as strokes, heart attacks, kidney failure, or failure of several organs at the same time.\n\n“We face the problem of not yet understanding the physiological disorders well enough to explain how a viral disease like COVID-19 kills people in such a diverse and difficult-to-predict fashion,” Dr. Bull said.\n\nBull and co-author Karen Hay contend that showers of tiny clots form and block micro-blood vessels in the bodies of many severely ill COVID-19 patients. Though invisible to the naked eye, the micro clots can damage and kill tiny portions of whichever organ tissue – brain, heart, liver, kidney, lung, etc. – the blocked blood vessels feed.\n\n“Clotting in really sick COVID-19 patients is not something trivial and unimportant – it may well be fundamental to what is going on,” said Dr. Bull.\n\nBut how do these micro clots form and travel throughout the body? Bull provides a broad overview of this disease process:\n\nWhen the body senses a COVID-19 infection, large white blood cells called monocytes respond and gather in the air sacs of the lungs.\n\nOver the course of a few days, the monocytes transform into macrophages – the “demolition and cleanout crew” for infected and damaged tissue in the body. The macrophages attack the virus-laden cells that line the inside of the air sacs. Unfortunately, macrophages may also chew right through the virus-laden air sac lining to the blood vessels that surround each air sac. This is the place in the body where the blood picks up oxygen when we breathe. If the macrophages puncture these blood vessels, the air sac will fill up with blood.\n\nA protein produced by the macrophages on their surfaces causes the blood to clot. When a clot forms an enzyme, thrombin, interacts with a protein in the blood known as fibrinogen to produce fibrin strands or fibrils. When these fibrin strands accumulate, they become a clot. These fibrils can be still soluble if they remain short enough (about 25 molecules or less). Anything longer than that becomes insoluble and will appear as tiny clots.\n\nShort chains of fibrin, still soluble, can travel in the blood supply to all of the body’s organs. As long as the fibrin chains remain short, this will cause no problems, but if more thrombin is coming from clots in the lungs, then more fibrin is continually being fed into the blood. This makes the chains of fibrin grow longer; they grow too long to remain in solution, and showers of micro clots will form.\n\nThese micro clots will block the tiny blood vessels that nourish the tissue making up each of the body’s organs, making the organs less able to perform their necessary function. The organs (heart, kidney, brain, etc.) with little patches of dead and dying tissue throughout will, sooner or later, fail.\n\nIndeed, when Bull and Hay monitored three COVID-19 patients hospitalized in an intensive care unit for tell-tale clotting biomarkers – the still soluble fibrin chains – they found that in a matter of four days, all of the fibrinogen in the patients’ bodies had transformed into soluble fibrin chains at levels five times higher than normal. Body organs were severely damaged in all three patients. Two of them died in the hospital, and the third survived but suffered severe brain damage.\n\nAlthough Bull and Hay found blood clotting was taking place by tracking the bio-markers and performing clotting tests, no visible clots were detected in any of the three patients. The likeliest explanation, Bull states, is that those clots were present but were too small to be seen.\n\n“Here in this study we have three patients in which clearly a massive clotting disorder occurred over a very short period,” Bull said.\n\nBull said in a year and a half of searching for therapeutic modalities, the medical community has not come up with any anti-viral medications that have had a significant beneficial effect on COVID-19. Yet, heparin, an anti-clotting drug, not an anti-viral medication, has proven highly beneficial and is now being given to virtually all hospitalized, severely ill COVID-19 patients.\n\n[This writer has also researched the use of ivermectin for late-stage COVID and concluded that it can work because of its anti-inflammatory property.]\n\n“Clotting in really sick COVID-19 patients is not something trivial and unimportant – it may well be fundamental to what is going on,” Bull said.\n\nThe point of giving all these details is to show that what spike proteins cause in ill COVID patients can also be what is happening in many vaccinated people. Just as Dr. Hoffe had predicted. And why a few million people worldwide have had adverse health impacts from vaccines, including probably a few hundred thousand deaths.\n\nGerman research (Microvascular dysfunction in COVID-19: the MYSTIC study) made several important observations about small capillaries impacted by micro clots. The loss of small capillaries correlated with high d-dimer levels. And the velocity of red blood cells in the smallest capillaries was significantly lower in those patients with severe lung problems who were mechanically ventilated. Low blood flow means less oxygen getting to where it is most needed.\n\nNow we come to the third area of medical research that has also found micro clots as the likely cause of what is being called “long” COVID, which refers to people who seem to have successfully recovered from COVID but live with serious residual health problems that are related to their previous COVID infection. Sadly, some doctors have said these persistent health problems are psychological in nature.\n\nSummarized here is some new research that finds the cause of persistent health problems are micro blood clots.\n\nIn October 2021, the material in this article was originally published in the journal Cardiovascular Diabetology in August 2021.\n\nThe October article is entitled, “Inflammatory micro clots in blood of individuals suffering from Long COVID.” The research was done at Stellenbosch University in South Africa. Researchers found an overload of various inflammatory molecules, “trapped” inside insoluble microscopic blood clots (micro clots), in the blood of individuals suffering from lingering symptoms experienced by individuals with long COVID.\n\nThis important finding was made by professor Resia Pretorius, a researcher in the Department of Physiological Science at Stellenbosch University. She started looking at micro clots and their molecular content in blood samples from individuals with long COVID. The findings have since been peer-reviewed and published in the journal.\n\n“We found high levels of various inflammatory molecules trapped in micro clots present in the blood of individuals with Long COVID. Some of the trapped molecules contain clotting proteins such as fibrinogen, as well as alpha(2)-antiplasmin,” Pretorius explained.\n\nAlpha(2)-antiplasmin is a molecule that prevents the breakdown of blood clots, while fibrinogen is the main clotting protein. Under normal conditions, the body’s plasmin-antiplasmin system maintains a fine balance between blood clotting (the process by which blood thickens and coagulate to prevent blood loss after an injury) and fibrinolysis (the process of breaking down the fibrin in the coagulated blood to prevent blood clots from forming).\n\nWith high levels of alpha(2)-antiplasmin in the blood of COVID-19 patients and individuals suffering from long COVID, the body’s ability to break down the clots are significantly inhibited.\n\nThe insolubility of the micro clots became apparent through specific analysis of blood plasma samples from individuals with acute COVID and long COVID; they continued to deposit insoluble pellets in collection devices.\n\nThis is the first research group to have reported on finding micro clots in the blood samples from individuals with long COVID, using fluorescence microscopy and proteomics analysis, thereby solving yet another puzzle associated with the disease.\n\n“Of particular interest is the simultaneous presence of persistent anomalous micro clots and a pathological fibrinolytic system,” they write in the research paper. “This implies that the plasmin and antiplasmin balance may be central to pathologies in Long COVID, and provides further evidence that COVID-19, and now Long COVID, have significant cardiovascular and clotting pathologies.”\n\nIn other words, this research connects with what has been found in COVID patients with micro blood clots.\n\nTo date they have collected blood from 100 long COVID sufferers who participated in the long COVID registry that launched in May 2021, as well as from 30 healthy individuals.\n\nThis research was seen as a very important development in a January 2022 article in The Guardian with the heading: “Could microclots help explain the mystery of long Covid?” It was written by Resia Pretorius, one of the senior South African researchers. “My lab has found significant microclot formation in long Covid patients. Unfortunately, these are missed in routine blood tests.”\n\nHere are more excerpts from this article that was aimed at informing the world about the importance of micro clots.\n\n“One of the biggest failures during the Covid-19 pandemic is our slow response in diagnosing and treating long Covid. As many as 100 million people worldwide already suffer from long Covid. That staggering number will eventually be much higher, if we take into account that diagnoses are still inadequate, and that we still do not know what the impact of Omicron and future variants will be.”\n\n“Patients with long Covid complain of numerous symptoms, the main ones being recurring fatigue and brain fog, muscle weakness, being out of breath and having low oxygen levels, sleep difficulties and anxiety or depression. Some patients are so sick that they cannot work or even walk a few steps. There is possibly also an elevated risk of stroke and heart attacks. One of the biggest sources of concern is that even mild and sometimes asymptomatic initial Covid-19 infection may lead to debilitating, long-term disability.” [That last sentence is especially important.]\n\n“Since early 2020, we and other researchers have pointed out that acute Covid-19 is not only a lung disease, but actually significantly affects the vascular (blood flow) and coagulation (blood clotting) systems.”\n\n“In blood from patients with long Covid, persistent microclots are resistant to the body’s own fibrinolytic processes. We found high levels of various inflammatory molecules trapped in the persistent microclots, including clotting proteins like plasminogen, fibrinogen and Von Willebrand factor (VWF), and also Alpha-2 antiplasmin (a molecule that prevents the breakdown of microclots).”\n\n“The presence of persistent microclots and hyperactivated platelets (also involved in clotting) perpetuates coagulation and vascular pathology, resulting in cells not getting enough oxygen in the tissues to sustain bodily functions (known as cellular hypoxia). Widespread hypoxia may be central to the numerous reported debilitating symptoms.”\n\nAnd here is what long COVID victims need to know: “So why can long Covid patients not go to their nearest clinic or health care practitioner to find treatment options? Currently there are no general pathology tests readily available to diagnose these patients. Desperately ill patients are told that their pathology test results are within normal/healthy ranges. Many are then told that their symptoms are possibly psychological and they should try meditation or exercise. The main reason the traditional lab tests do not pick up any of the inflammatory molecules is that they are trapped inside the fibrinolytic-resistant microclots (visible under a fluorescence or bright-field microscope, as our research has shown). When the molecular content of the soluble part of the plasma is measured, the inflammatory molecules, including auto-antibodies, are simply missed.”\n\nRemember that Dr. Hoffe used the d-dimer test to confirm the presence of micro blood clots, and this test can be ordered by your physician. Also, many pro-ivermectin articles invoke not merely the anti-viral property that works to address initial COVID infection, but also its anti-inflammatory property more important after the initial viral replication phase.\n\nThere is also a fairly large medical literature with findings of micro blood clots from autopsies. Here is just one example, published in 2020 by Dr. Amy Rapkiewicz, the chairman of the department of pathology at NYU Langone Medical Center.\n\nDescribing the work in a news story was this: “The clotting was not only in the large vessels but also in the smaller vessels. And this was dramatic, because though we might have expected it in the lungs, we found it in almost every organ that we looked at in our autopsy study,” the researcher said.\n\nThis too was noted in another news story: “We knew that clinical people were finding clots in these [COVID] patients,” she said. “So although I knew that that was going to be there, I didn’t expect it at the microscopic level to the degree that I saw it.” Her autopsy study found blood clots in small vessels of the patients’ lungs, hearts, kidneys and livers.\n\nIn another news story this was noted in 2020 about research at Harvard University: “Researchers also noted that patients with the novel coronavirus suffered many microscopic blood clots. In a stark difference with lungs infected with the flu, the micro-clots were nine times as present in areas of the lungs that allow the passage of oxygen into the patient’s bloodstream while carbon dioxide is emitted.”\n\nThis is the title of a May 2020 medical article: “Pathophysiology of SARS-CoV-2: Targeting of endothelial cells renders a complex disease with thrombotic microangiopathy and aberrant immune response. The Mount Sinai COVID-19 autopsy experience.” Here is the summary of the findings; note the word micro:\n\n“Autopsies were performed at the Mount Sinai Hospital on 67 COVID-19 positive patients and data from the clinical records were obtained from the Mount Sinai Data Warehouse. The experimental design included a comprehensive microscopic examination carried out by a team of expert pathologists. …\n\n“We report a comprehensive autopsy series of 67 COVID-19 positive patients revealing that this disease, so far conceptualized as a primarily respiratory viral illness, also causes endothelial dysfunction, a hypercoagulable state [an increased tendency to develop blood clots], and an imbalance of both the innate and adaptive immune responses. Novel findings reported here include an endothelial phenotype of ACE2 in selected organs, which correlates with clotting abnormalities and thrombotic microangiopathy, addressing the prominent coagulopathy and neuropsychiatric symptoms. Another original observation is that of macrophage activation syndrome, with hemophagocytosis and a hemophagocytic lymphohistiocytosis-like disorder, underlying the microangiopathy [disorder involving small blood vessels]and excessive cytokine release.” In other words, this study also found evidence of micro clots in COVID victims.\n\nLastly, is the work of Dr. Sucharit Bhakdi. He has noted “immune and blood-related categories of risks from vaccines: (1) Clotting from the direct action of spike protein in the bloodstream; (2) Further clotting from the immune system attacking spike-producing endothelial cells.” This too was said: “The RNA injected into your body are going to enter the cells that line blood vessels. He points to spiny spike protein that these cells will generate and protrude outwards to attract blood platelets and form micro-clots. Days after vaccination, white blood cells known as lymphocytes as well as antibodies will begin to mount an attack against these cells. If you dare to repeat this (get the second jab), ‘God help you,’ warns Dr Bhakdi.” He warned about the blood clot side effects months before the roll-out of the mRNA vaccines.\n\nMicro blood clots are linked to spike proteins coming from COVID infection OR vaccines that introduce them into the body or cause the body to produce them.\n\nMicro blood clots seem to be the likely cause of many millions of health impacts and deaths from COVID infection as well as from COVID vaccines, and even many millions of long COVID victims suffering diverse health problems with no apparent medical solution.\n\nHave you heard any government or public health official speak of micro blood clots? Probably not – but not because they are insignificant. Now, you probably know more than they do. Now you realize that there has been a scandal of enormous proportions: The suppression of so much negative information about spike protein induced micro blood clots.\n\nContent created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected].\n\nSUPPORT TRUTHFUL JOURNALISM. MAKE A DONATION TO THE NONPROFIT WND NEWS CENTER. THANK YOU!\n\nThis article was originally published by the WND News Center.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.fivedoves.com/letters/june2021/luisv613-2.htm", "https://luis46pr.wordpress.com/2021/07/14/dr-charles-hoffe-mrna-vaccines-will-kill-most-people-through-heart-failure-62-already-have-microscopic-blood-clots/", "https://vaccinechoicecanada.com/in-the-news/open-letter-to-dr-bonnie-henry-from-bc-physician-re-moderna-vaccine-reactions/", "https://www.naturalnews.com/2021-05-21-christiane-northrup-explains-risks-covid-vaccine-shedding.html", "https://news.llu.edu/research/study-identifies-micro-clots-cause-of-death-some-severely-ill-covid-19-patients", "https://onlinelibrary.wiley.com/doi/10.1002/iid3.482", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7556767/", "https://www.sciencedaily.com/releases/2021/10/211004104134.htm", "https://cardiab.biomedcentral.com/articles/10.1186/s12933-021-01359-7", "https://www.theguardian.com/commentisfree/2022/jan/05/long-covid-research-microclots", "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(20)30178-4/fulltext", "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(20)30178-4/fulltext", "https://health.usnews.com/hospital-heroes/articles/pathologist-discovers-coronavirus-causes-extensive-blood-clotting", "https://www.fox6now.com/news/study-finds-covid-19-attacks-lining-of-blood-vessels-in-lungs-causes-microscopic-blood-clots", "https://www.researchgate.net/publication/341582169_Pathophysiology_of_SARS-CoV-2_Targeting_of_endothelial_cells_renders_a_complex_disease_with_thrombotic_microangiopathy_and_aberrant_immune_response_The_Mount_Sinai_COVID-19_autopsy_experience", "https://doctors4covidethics.org/prof-sucharit-bhakdi-md-meeting-address-17-june-2021/", "https://truthundercover.com/detailed-assessment-of-vaccine-micro-clots-treatment/#:~:text=The%20D-dimer%20test%20only%20reveals%20recently-formed%20micro-clots.%20Critics,RNA-vaccine%20immunized%20patients%20have%20an%20abnormal%20D-dimer%20test.", "/cdn-cgi/l/email-protection#f09c9993959e83999e97b0879e949e95878393959e849582de9f8297", "https://wndnewscenter.nationbuilder.com/support_wnd_news_center", "https://www.wndnewscenter.org/"], "authors": [], "publish_date": "February 3, 2022"}