{"result_id": "258008", "URL": "https://redoubtnews.com/2021/11/crony-iaci-lobbyist-begs-idaho-lawmakers-to-keep-vaccine-mandates-in-place/", "timestamp": "2023-04-25 16:57:41 CEST+0200", "meta": {"description": "Crony IACI Lobbyist Begs Idaho Lawmakers To Keep Vaccine Mandates In Place, IACI celebrates the idea of a command-and-control world", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2021/11/crony-iaci-lobbyist-begs-idaho-lawmakers-to-keep-vaccine-mandates-in-place/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "Crony IACI Lobbyist Begs Idaho Lawmakers To Keep Vaccine Mandates In Place", "cleaned_text": "Crony IACI Lobbyist Begs Idaho Lawmakers To Keep Vaccine Mandates In Place\n\nDon’t be fooled by the rhetoric coming from the Idaho Association of Commerce and Industry. They’re not on the side of freedom — not now, not ever.\n\nWhen IACI starts throwing around words like “conservative” and “freedom,” you know you’re being bamboozled.\n\nNo organization in Idaho has done more than IACI to promote socialism, rent-seeking, and cronyism. So you know IACI President Alex LaBeau is dripping in dishonesty with the statement he put out Tuesday expressing concern that the Legislature’s return to Boise next week is “socialism … wrapped up in a facade of freedom.”\n\nRemember, IACI is the same organization that promoted the state’s early adoption of Obamacare. It pushed hard for the state to open an Obamacare insurance exchange. It later joined with leftist organizations to promote Medicaid expansion.\n\nToday, IACI is pushing for the expansion of the government education system. IACI wholeheartedly embraces socialism. The organization’s record on this point is more than clear. It is the most special of all of Idaho’s special interest groups.\n\nThe real reason IACI is opposed to the Legislature recovening is that the organization would love nothing more than for businesses to be free to strip employees of their health freedom. Sure, IACI says it applauds the state for having joined lawsuits in opposition to the Biden administration’s vaccination requirements. But it’s not because IACI opposes vaccine mandates. The truth is, IACI’s members include Idaho’s big hospitals and corporations that are implementing vaccine requirements, threatening to fire employees who fail to surrender their medical autonomy.\n\nThat makes IACI exactly like the Biden administration. If it has any objection to the president’s tyranny, it’s that the organization wants to reserve the right for its corporate members to issue authoritarian edicts.\n\nAt the Idaho Freedom Foundation, we’ve always said that the issue of vaccine mandates extends well beyond being an employee-employer issue. This is about Americans losing their freedoms at the hands of health autocrats. Sometimes the enforcement of medical tyranny is being done directly by the government. Other times, it’s being done by businesses enacting government medical protocols. The end result is the same: Americans are systematically being denied jobs, travel, or their right to life, liberty, and property unless they go along with what government experts recommend or demand.\n\nAmerica is quickly becoming the “show us your papers” medical police state where disobedience to authority ultimately leads to poverty and death. Indicate that you’ve obeyed government-sanctioned protocols or requirements, or starve. Obey the requirements and live. This is the side IACI is really on. This is our future if the state Legislature does not act.\n\nBoth IACI and the Biden administration celebrate the idea of a command-and-control world in which vaccines are mandated and people who disobey are persecuted, shunned, and impoverished for failure to conform to the so-called science of the day.\n\nConservatives are on the right side of this issue, and they should fight like mad to preserve individuals’ right to medical freedom, autonomy, and privacy.\n\nWayne Hoffman is president of the Idaho Freedom Foundation.\n\nThe views, opinions, or positions expressed by the authors and those providing comments are theirs alone, and do not necessarily reflect the views, opinions, positions of Redoubt News. Social Media, including Facebook, has greatly diminished distribution of our content to our readers’ newsfeeds and is instead promoting Main Stream Media sources. This is called ‘Shadow-banning’. Please take a moment and consider sharing this article with your friends and family. Thank you. Please support our coverage of your rights. Donate here", "opengraph": {"locale": "en_US", "type": "article", "title": "Crony IACI Lobbyist Begs Idaho Lawmakers To Keep Vaccine Mandates In Place - Redoubt News", "description": "Crony IACI Lobbyist Begs Idaho Lawmakers To Keep Vaccine Mandates In Place, IACI celebrates the idea of a command-and-control world", "url": "https://redoubtnews.com/2021/11/crony-iaci-lobbyist-begs-idaho-lawmakers-to-keep-vaccine-mandates-in-place/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2021-11-11T04:42:49+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2021/11/IACI.jpg", "image:width": "800", "image:height": "533", "image:type": "image/jpeg"}, "tags": ["forced vaccinations", "Leftwing", "Socialism", "Democratic Socialist", "IACI", "Medicaid Expansion", "Alex LaBeau", "Government Mandates", "Idaho Association of Commerce and Industry", "cronyism", "Public Education", "Covid-19(84)", "Obamacare"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Wayne+Hoffman", "https://redoubtnews.com/2021/09/idaho-assoc-of-commerce-industry-iaci-is-promoting-agenda-2030/", "http://idahofreedom.org/", "https://www.paypal.com/paypalme/RedoubtNews", "https://redoubtnews.com/donations/", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2021-11-11T04:42:49+00:00"}