{"result_id": "258019", "URL": "https://redoubtnews.com/2022/01/16-defendants-named-nuremberg-trials-2-0-coming-soon/", "timestamp": "2023-04-25 16:57:53 CEST+0200", "meta": {"description": "16 Defendants Named, Nuremberg Trials 2.0 Coming Soon? Will These People Be Charged With Genocide? 10 standards to which doctors must conform", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2022/01/16-defendants-named-nuremberg-trials-2-0-coming-soon/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "16 Defendants Named, Nuremberg Trials 2.0 Coming Soon?", "cleaned_text": "Will These People Be Charged With Genocide?\n\nAccording to The Desert Review, a slew of high-power figures in the COVID-19 pandemic and the push to mandate experimental COVID jabs have been accused of several crimes, including crimes against humanity, war crimes and crimes of aggression in the U.K.:1\n\nIn all, the 16 defendants named in the legal filing are:\n• None Tedros Adhanhom Ghebreyesus, director-general of the WHO\n• None Matthew Hancock, former U.K. secretary of state for Health and Social Care\n• None Medicines and Healthcare, current U.K. secretary of state for Health and Social Care\n\nThe victims, on behalf of whom the complaint was filed, are “the peoples of the United Kingdom.” One of the seven applicants is Dr. Michael Yeadon, a former vice president and chief scientist of allergy and respiratory research at Pfizer.\n\nAt the end of 2020, he expressed deep concerns about the COVID jabs becoming mandatory, as he could find no medical rationale for their use. In 2021, as we all know, mandates were rolled out around the world. In April 2021, Yeadon went public with concerns that the shots were part of a depopulation agenda.\n\n“I believe [COVID-19 booster shots] are going to be used to damage your health and possibly kill you. I can see no sensible interpretation other than a serious attempt at mass depopulation,” he said in a “Planet Lockdown” interview published in late April 2021.3\n\nWhat Is the International Criminal Court?\n\nThe International Criminal Court4,5 (ICC) is an intergovernmental organization and international tribunal located in The Hague, Netherlands. Its activities are governed by an international treaty called the Rome Statute, which has been ratified by more than 120 countries, including the U.S.\n\nThe ICC is a permanent, independent court that investigates crimes that concern the international community, such as claims of genocide, war crimes, crimes against humanity and crimes of aggression. In theory, member states are supposed to cooperate with the court, but that doesn’t always happen.\n\nIf warranted, the court can prosecute and try individuals charged with these types of crimes, but it will typically only do so if the member state fails to take the appropriate legal actions against the perpetrator, which can happen if a government tries to shield the individual in question from criminal responsibility. As noted in the complaint:6\n\nStill, the ICC relies on the states’ national law enforcement to arrest individuals, so a member state can still restrict the court’s ability to bring a criminal to justice. The ICC does not have its own police force to carry out warrants or arrests. In this case, defendants are scattered across several countries. According to the ICC complaint, the 16 defendants have violated the Nuremberg Code and four articles of the Rome Statute.\n\nThe Nuremberg Code is a set of medical research ethics principles that grew out of the “Doctors Trial” in Nuremberg following World War II. The war crimes tribunal at Nuremberg established 10 standards to which doctors must conform when performing experiments on human subjects.7\n\nForemost among these codes of ethics is the necessity of informed consent to participate in medical experimentation. The Nuremberg Code has also been the basis for other medical ethics guidance and laws, including the Helsinki Declaration of 1965, which binds practicing physicians to “act in the patient’s best interest when providing medical care.”\n\nWhile not a binding law, the complaint argues that the Nuremberg Code qualifies as a source of international law by way of Article 21(1)(b) of the Rome Statute, which recognizes international law, international treaties, international custom and principles of law recognized by civilized nations as being of equal value.\n\nArticle 6 of the Rome Statute refers to acts of genocide, i.e., acts intended to destroy, in whole or in part, a national, ethnical, racial or religious group. Here, the group in question is the British population in its entirety, and by extension the world, starting with the elderly, chronically ill and disabled. Genocide can include the acts of:\n• None Deliberately inflicting conditions of life, calculated to bring about whole or partial destruction\n\nAll of these definitions apply in this case, and details are provided to support each charge. For example, with regard to “conditions of life calculated to bring about destruction,” this includes both the destruction of businesses and transfer of wealth through imposed lockdowns, and damaging people’s immune systems through the refusal to offer early treatment, mask mandates and coercing people to take the COVID jab.\n\nArticle 7 of the Rome Statute covers crimes against humanity, which includes:\n\nThe specific charges under each are detailed in the complaint, with data to support them.\n\nWar crimes are covered in Article 8 of the Rome Statute. The complaint argues that “a covert war has been waged against the people of the United Kingdom (and the world) through the release of the biological weapon SARS-Cov-2 and the additional bioweapon, m-RNA gene therapy ‘vaccines.” They also include a charge of Mens Rea, meaning the intent to commit a crime, stating that:\n\nWillful killing by way of the experimental COVID jabs, the use of lethal doses of midazolam in nursing home patients diagnosed with COVID, and the inclusion of graphene hydroxide in the shots. Not only are they asking for a full investigation into the inclusion of graphene hydroxide in some of the COVID shots, they also want a full investigation into the suspected assassination of Dr. Andreas Noack, a German chemist and a top graphene expert. Noack’s doctoral thesis described the conversion of graphene oxide into graphene hydroxide. According to the complaint: “Professor Dr. Pablo Campra comes from the university of Almeria, and alongside Dr. Andreas Noack he examined the covid ‘vaccines’ for the presence of graphene oxide with the Micro-Raman Spectroscopy, the study of frequencies. According to both doctors, the vaccines don’t contain graphene oxide but do contain graphene hydroxide. On November 23, 2021, Dr. Andreas Noack released a video explaining what graphene hydroxide is and how the nano structures injected into the human body act as ‘razor blades’ inside the veins of ‘vaccine’ recipients … On 18th November 2020 Dr. Andreas Noack was on a ‘livestream’ on YouTube discussing the dangers of the Covid-19 ‘vaccines’ when he was arrested on camera by armed German police (Appendix 41). On 26th November 2021, just hours after publishing his latest video about graphene oxide and graphene hydroxide (Appendix 42) he was attacked and murdered. We request a full investigation be done into the inclusion of Graphene hydroxide in theCovid-19 ‘vaccines’ and into the assassination of Dr. Andreas Noack.” Torture by way of forced mask wearing, the use of test swabs containing carcinogenic chemicals, and the release of a manmade bioweapon. Willfully causing great suffering or serious injury to body or health — Examples include the forced use of masks, the closing of doctors’ offices, the COVID jab mandates, the use of psychological warfare, the use of economic warfare, the use of biological warfare, denial of effective medicines, suppression of alternative treatments, use of ventilators despite evidence of harm, and euthanizing elderly COVID patients with midazolam. Extensive destruction and appropriation of property, not justified by military necessity and carried out unlawfully and wantonly. Intentionally directing attacks against civilians, including those not taking direct part in any hostilities. Intentionally launching an attack, knowing it will cause loss of life, injury to civilians, damage to civilian objects, and/or widespread, long-term and severe damage to the natural environment.\n\nThe last violation is crimes of aggression against the British population, covered under Article 8 bis3 of the Rome Statute. According to the complaint:\n\n“This is a global criminal conspiracy, which has been planned for several decades. It is now obvious that ‘the plan’ involves the ultrarich and leaders of most nation states, with a few exceptions. It is also clear that powerful think-tanks including WEF [World Economic Forum] in Davos as well as the Club of Rome, and other NGOs like WHO and GAVI among others, are at the centre of this draconian criminal conspiracy. Under the official slogan; ‘BUILD BACK BETTER,’ used by the President of WHO, the President of USA, as well as the President of WEF, the Prime Minister of the UK as well as countless other world leaders. The goal of this activity is to create a new world order, through the UN ‘s Agenda 2030, by dismantling all the Democratic Nation States, step by step, controlled by an un-elected elite and to destroy the freedoms and basic human rights of the peoples of the Earth. In addition to this, the aim is to destroy small and medium sized businesses, moving the market shares to the largest corporations, owned by the Global Elite. The fulfilment of this goal will most likely lead to full enslavement of mankind. This is being done by means of the threat from both a dangerous biological weapon, the virus, the vaccines, the testing test pins, the mask mandates and all other measures. All of which constitute not only a breach of National laws, but also a fundamental breach of the Charter of the United Nations and the Treaty of Rome and our Fundamental Human rights. It is of the utmost urgency that ICC take immediate action, taking all of this into account, to stop the rollout of COVID vaccinations, introduction of unlawful vaccination passports and all other types of illegal warfare mentioned herein currently being waged against the people of the United Kingdom by way of a court injunction.”\n\nNew Findings Will ‘Dismantle the Entire Vaccine Industry’\n\nIn a January 1, 2022, video announcement (featured at the top of this article), Dr. Reiner Fuellmich8 — a U.S.-German consumer protection trial lawyer and cofounder of the German Corona Extra-Parliamentary Inquiry Committee (Außerparlamentarischer Corona Untersuchungsausschuss)9,10,11 launched July 10, 2020 — announced the data they now have in their possession is “enough to dismantle the entire vaccine industry.”\n\nFuellmich is heading up the committee’s corona crisis tort case. Initially, the committee focused on exposing the PCR test fraud, but now they also have evidence that the vaccine makers were using different lot numbers to carry out an experiment within an experiment, unbeknownst to the public.\n\nAccording to Fuellmich, it looks like an experiment to determine the dosage needed to kill and/or maim people. In other words, people have not been getting identical products. Different lots or batches contain different dosages and even different ingredients.\n\nAccording to Dr. Wolfgang Wodarg, former chair of the Parliamentary Assembly of the Council of Europe Health Committee, they have “hard evidence” of this. He points to an investigation published in late 2021 showing only 5% of the lots were responsible for 100% of the rapid deaths.12\n\nIn the video, Wodarg also shows a graph of 9,500 different Pfizer jab batches, with some having a toxicity, as evidenced by deaths, that is 3,000 times above the baseline. Others have a toxicity that is 2,500 times higher than baseline. Between them are batches with no deaths attributed to them.\n\nWodarg also claims to have data showing that the vaccine makers appear to have coordinated and synchronized their experimentation, so that only one of them is releasing a potentially deadly batch at a time. But they’re all doing this. They’re all experimenting with dosages and ingredients, Wodarg insists, and the reason they’re able to do this is because there are no review boards overseeing any of them.\n\nThere’s now an interesting site where you can search the U.S. Vaccine Adverse Event Reporting System (VAERS) data based on your lot number, to see if you got one of the more dangerous batches. You can find that dashboard here.13 The video below explains how to use the dashboard.\n\nHow to use Dashboard here: https://www.bitchute.com/video/lAd325e6nF6n/\n\n“There is inescapable evidence, in my view as a lawyer, of there being premeditation,” Fuellmich says. And if premeditation can be proven, then there is no legal immunity for anyone anymore. They can all be held liable for injuries and deaths.\n\nWithout doubt, the legal battles will be incredibly difficult to pursue, as there are so many powerful people working together on this, protecting each other. But that doesn’t mean we don’t try. On the contrary, we must do everything in our power to bring the criminals behind this global takeover to justice, and hold them accountable for everything that has been done to our economies, our livelihoods, our families, our health and our children’s futures.\n\nDr. Joseph Mercola is the founder of Mercola.com. An osteopathic physician, best-selling author and recipient of multiple awards in the field of natural health, his primary vision is to change the modern health paradigm by providing people with a valuable resource to help them take control of their health.\n\nHis latest book, “The Truth About COVID-19,” is an instant bestseller. With over 1,600 reviews, it has a nearly perfect 5-star rating so grab your copy of the #1 bestselling book on Amazon today before Biden bans it.\n\nThe views, opinions, or positions expressed by the authors and those providing comments are theirs alone, and do not necessarily reflect the views, opinions, positions of Redoubt News. Social Media, including Facebook, has greatly diminished distribution of our content to our readers’ newsfeeds and is instead promoting Main Stream Media sources. This is called ‘Shadow-banning’. Please take a moment and consider sharing this article with your friends and family. Thank you. Please support our coverage of your rights. Donate here", "opengraph": {"locale": "en_US", "type": "article", "title": "16 Defendants Named, Nuremberg Trials 2.0 Coming Soon? - Redoubt News", "description": "16 Defendants Named, Nuremberg Trials 2.0 Coming Soon? Will These People Be Charged With Genocide? 10 standards to which doctors must conform", "url": "https://redoubtnews.com/2022/01/16-defendants-named-nuremberg-trials-2-0-coming-soon/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2022-01-23T05:20:04+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2022/01/Nuremberg-2.jpg", "image:width": "800", "image:height": "501", "image:type": "image/jpeg"}, "tags": ["International Criminal Court", "Nuremberg Code", "Bill Gates", "Boris Johnson", "Genocide", "Pfizer", "Anthony Fauci", "Covid-19(84)", "World Economic Forum", "Dr. Peter Daszak"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Dr.+Joseph+Mercola", "https://public.tableau.com/app/profile/alberto.benavidez/viz/WelcomeTheEaglesVAERSDashboardDec24/LotSearch", "https://www.bitchute.com/video/lAd325e6nF6n/", "https://www.thedesertreview.com/opinion/columnists/gates-fauci-and-daszak-charged-with-genocide-in-court-filing/article_76c6081c-61b8-11ec-ae59-7718e6d063ed.html", "https://www.docdroid.com/WUjv6iw/icc-complaint-7-1-pdf", "https://www.PlanetLockdownFilm.com/", "https://www.icc-cpi.int/about", "https://www.icc-cpi.int/resource-library/documents/uicceng.pdf", "https://media.tghn.org/medialibrary/2011/04/BMJ_No_7070_Volume_313_The_Nuremberg_Code.pdf", "https://www.fuellmich.com/dr-reiner-fuellmich/", "https://acu2020.org/", "https://acu2020.org/english-versions/", "https://www.algora.com/Algora_blog/2020/10/04/german-corona-investigative-committee", "https://dailyexpose.uk/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/", "https://public.tableau.com/app/profile/alberto.benavidez/viz/WelcomeTheEaglesVAERSDashboardDec24/LotSearch", "https://www.mercola.com/", "https://www.amazon.com/Truth-about-Covid-19-Lockdowns-Passports/dp/1645020886", "https://www.paypal.com/paypalme/RedoubtNews", "https://redoubtnews.com/donations/", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2022-01-23T05:20:04+00:00"}