{"result_id": "258011", "URL": "https://redoubtnews.com/2021/12/covid-19-vaccine-engineered-synthesized/", "timestamp": "2023-04-25 16:57:45 CEST+0200", "meta": {"description": "Covid-19 Vaccine: Engineered & Synthesized, WEF has put together a Global Future Council on Synthetic Biology for purpose of engineering life", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2021/12/covid-19-vaccine-engineered-synthesized/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "Covid-19 Vaccine: Engineered & Synthesized", "cleaned_text": "Vaccine technology has dramatically shifted from the of a virus to foster immunity, to now what is called gene . Much concern has been expressed about this new technology, does it change one’s genetic code, what are the long term effects given no long term studies have been done, and since a vaccinated individual can become infected with Covid-19, what is the purpose of getting one? Even though this is new technology we are assured it is and can be given . Are technocrats and scientists just messing with God’s creation of humans?\n\nWhile there are that the Covid-19 vaccine is not gene therapy, in looking at the scientific it is described as just that. Even this describes one vaccine as using “double-stranded inserted into a common, but inert virus called an adenovirus. This DNA also contains the instructions for building the spike protein. Once inside the cell, these instructions are read and translated into mRNA (messenger RNA).” It goes on, “The mRNA chains are basically work orders that spell out the instructions for making the spike proteins that stud the outside of the that causes COVID-19.” Ok, both genetic , DNA and mRNA, are being used. In the case of one Covid-19 vaccine, the spike of the Covid-19 virus is used to “into the host cell the genetic information needed to express the recombinant ” which evokes an immune response. It just leaves out one detail, that mRNA genetic material is .\n\nBeing a highly technical and very complicated process, most of the nuances are not discussed here. The focus will be just on the issue of this vaccine actually being an and synthetically produced product. Links to the scientific information discussing this are provided for those who want to do a deeper dive.\n\nHistorically, it takes years to a vaccine with many stages in the process. In the case of the Covid-19 it took less than one year. The virus is inactivated or weakened in traditional vaccines, and is called an because it evokes an immune response. However, the Covid-19 mRNA vaccine is a Nucleic acid where a strand of a corona virus DNA is used to make a template that is engineered for the mRNA, which does the same, evokes an immune response.\n\nThe complete process in this is far more than what is explained here but through an engineering technique called a genetic system, it is “ engineering specific sequences (within DNA or RNA).” More simply, a DNA sequence from a Covid-19 virus strand is used. DNA sequence information is readily available to technocrats through among many available genome data . As of May, 2020 “more than 200 complete and partial genome sequences of SARS-CoV-2” were and deposited in the Global Initiative on Sharing All Influenza . Scientists can easily pick and choose from these sources for vaccine experimentation.\n\nThrough a process called In vitro transcription ( ), encoded information in the spike protein DNA is and encoded into mRNA, synthetically creating the spike protein, which produces the viral antigen. Using to make the genetic copy for a Nucleic acid , mRNA “can be rapidly at large scale” using a “ mRNA format”. “Synthetic mRNA” vaccines are “safer” than the more traditional attenuated virus vaccines while even claiming it will “bring a halt to the coronavirus pandemic.” Because it is synthetic it is easy to , and can be manufactured at great speed for vaccine development.\n\nIn these vaccines the SARS-CoV-2 S , called the “spike protein” and found in corona , is targeted as the one which causes Covid-19. It “is an important target site for neutralizing antibodies and a key target for vaccine .” 1286 amino make up the spike protein while genomic of the virus is shared worldwide. This amino acid sequence was with other coronavirus structural proteins, with concern about how this would work in future .\n\nThere continues to be controversy as to whether or not an actual Covid-19 virus has been isolated, however the SARS-CoV-2 proteins share high similarity to SARS-CoV and MERS-CoV which to the development of SARS-CoV-2 vaccine design. Interestingly, through Covid-19 DNA protein manipulation several vaccines were tested.\n\nOnce the DNA or RNA sequence of a virus is known it becomes a rapid way in which to engineer a synthetic vaccine. Being a messenger RNA, this engineered vaccine alerts our immune system to produce a specific antibody to the virus, just as the virus itself would do. Post injection the mRNA material itself hangs around long enough to evoke an immune response then disintegrates. By all reports this occurs within just a few days.\n\nThese “computer-driven ” create “a synthetic vaccine…consisting mainly of synthetic peptides”. These vaccines produced by “chemical synthesis” are considered safer “because they do not involve cell-derived material or biological processes for production. Their purity can be controlled”. “Creating vaccines synthetically…has the ability to increase the speed of production and to retune and fine tune the solution to combat new variations in pathogens.” “Synthetic vaccines also have the advantage that they can be seen as cartridge vaccines, meaning that they contain bits and pieces that can readily be replaced by others to update the vaccine in order to combat new strains of pathogen.” In other words, DNA strands can easily be manipulated with different protein structures, an advantage to created vaccines for future mutations.\n\nWithout going into the specifics on vectors, Johnson & Johnson and Oxford-AstraZeneca are DNA/Viral-vector which deliver the spike protein DNA material into the cells. Pfizer and Moderna are mRNA vaccines. The introduction of these genetic materials causes the cell to create the viral antigen. Regardless, both are gene therapy in that , synthetic genetic viral material is introduced into the human cell to make the viral spike protein. This is short, explains the immune system, traditional vaccines, and this new gene therapy. Rather than the virus injecting its RNA into a cell to make copies of it, through mRNA vaccines this viral process is replaced synthetically to create an immune response as explained in this . The synthetically created Covid-19 RNA is telling the cell genetically to produce the spike protein, clearly a form of gene .\n\nUp to this point, it is now understood that selected DNA from the virus is used to make mRNA that is carried into the cell, evoking an immune response. But the beauty in all of this, since the viral genetic component can be picked over, copied, and manufactured, it is possible to “tweak’ the genetic sequence in any new mutation. As a result, new vaccines can be made just as rapidly by altering the protein sequence to match the mutated variant. Regardless, these technocrats that vaccine development will continue until more clinical trials are completed and that “the first round of vaccines will have waning immunity and require boosting using improved second-generation COVID-19 vaccines”…with those who have recovered from COVID-19 with poor or waning immunity may also require vaccination”.\n\nAs the second concerning mutation has emerged, , the reality is that there are “thousands of ” that have accumulated. Even a local doctor this virus will continue with mutations. Is this the cart before the horse or the other way around? Are these mRNA vaccines created because of the ability to manipulate them for any virus thus creating more experimentation and unending profit, or are the viruses being used to create more vaccines that come to the same end?\n\nThe major pharmaceutical companies making these vaccines, , , and Johnson & are all World Economic Forum (WEF) members. WEF is to see this new technology as part of its 4th Industrial Revolution to change our healthcare but doesn’t see it replacing other vaccines, , in its ongoing move towards . After all, the “ability to genes is in its infancy.” As part of its corporatism plan, one could conjecture that someday the only option for vaccination provided to the masses will be these gene therapy experiments, whether wanted or not.\n\nAs explained in the video in this WEF within the first ten minutes, synthetic , which includes mRNA vaccines, is bringing together individuals with expertise in biology, engineering, computer science, social sciences, and humanities to collectively trying to make biology easier to engineer, enabling the design and re-design of systems using the building blocks (DNA) of life. It is also programming functions in DNA and using new engineering tools in learning to engineer life. And mRNA vaccines are part of that engineering. The WEF has put together a Global Future on Synthetic Biology just for the purpose of engineering life. If it is too unbelievable, keep in mind it is currently being done through vaccines and will soon invade other aspects of life.\n\nCorporations are entering a dangerous area here, using humans and nature as lab rats, perhaps falsely believing help is on the way for mankind. As the old saying goes, It’s not nice to Mother Nature, she is smarter than you think. As a society based on the foundation of Christian principles attention needs to be paid to the direction we are being taken, starting with these vaccines.\n\nRelated: Omicron: We Warned You The Covid Farce Would Never End\n\nRelated: You Will Get Vaccinated!\n\nThe views, opinions, or positions expressed by the authors and those providing comments are theirs alone, and do not necessarily reflect the views, opinions, positions of Redoubt News. Social Media, including Facebook, has greatly diminished distribution of our content to our readers’ newsfeeds and is instead promoting Main Stream Media sources. This is called ‘Shadow-banning’. Please take a moment and consider sharing this article with your friends and family. Thank you. Please support our coverage of your rights. Donate here", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid-19 Vaccine: Engineered & Synthesized - Redoubt News", "description": "Covid-19 Vaccine: Engineered & Synthesized, WEF has put together a Global Future Council on Synthetic Biology for purpose of engineering life", "url": "https://redoubtnews.com/2021/12/covid-19-vaccine-engineered-synthesized/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2021-12-05T19:18:48+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2021/12/Engineered.jpg", "image:width": "648", "image:height": "464", "image:type": "image/jpeg"}, "tags": ["WEF", "Big Pharma", "Moderna", "experimental gene therapy", "Pfizer", "spike protein", "mRNA vaccine", "vaccine passport", "Synthetic Biology", "Covid-19(84)", "World Economic Forum", "Omicron"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Karen+Schumacher", "https://www.historyofvaccines.org/content/articles/different-types-vaccines", "https://academic.oup.com/intimm/article/33/10/521/6194108", "https://www.sciencedirect.com/science/article/pii/S0169409X20302933?via%3Dihub", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5906799/", "https://www.webmd.com/lung/news/20210719/covid-19-vaccines-not-gene-therapy", "https://pubmed.ncbi.nlm.nih.gov/33772572/", "https://www.webmd.com/lung/news/20210719/covid-19-vaccines-not-gene-therapy", "https://www.webmd.com/a-to-z-guides/dna-fingerprinting-overview", "https://www.webmd.com/lung/coronavirus", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7789827/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8326314/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8538930/", "https://www.merriam-webster.com/dictionary/antigen", "https://pubmed.ncbi.nlm.nih.gov/27236789/", "https://pubmed.ncbi.nlm.nih.gov/33001626/", "https://www.fda.gov/vaccines-blood-biologics/development-approval-process-cber/vaccine-development-101", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8071766/", "https://www.merriam-webster.com/dictionary/antigen", "https://academic.oup.com/intimm/article/33/10/521/6194108", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7293463/", "https://pubmed.ncbi.nlm.nih.gov/33514944/", "https://www.news-medical.net/health/What-is-Reverse-Genetics.aspx", "https://www.news-medical.net/life-sciences/What-is-Nucleic-Acid.aspx", "https://www.ncbi.nlm.nih.gov/genbank/", "https://pubmed.ncbi.nlm.nih.gov/28573592/", "https://www.ncbi.nlm.nih.gov/genome/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7218962/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5388101/", "https://pubmed.ncbi.nlm.nih.gov/30067354/", "https://www.youtube.com/watch?v=JQIwwJqF5D0", "https://pubmed.ncbi.nlm.nih.gov/30067354/", "https://academic.oup.com/intimm/article/33/10/521/6194108", "https://pubmed.ncbi.nlm.nih.gov/30067354/", "https://pubmed.ncbi.nlm.nih.gov/33572452/", "https://www.mdpi.com/1999-4915/13/2/270/htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8071766/", "https://pubmed.ncbi.nlm.nih.gov/33514944/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8326314/", "https://en.wikipedia.org/wiki/Coronavirus_spike_protein", "https://jkms.org/DOIx.php?id=10.3346/jkms.2021.36.e124", "https://socratic.org/questions/what-is-an-amino-acid-and-how-do-they-make-up-proteins", "https://www.prosci-inc.com/ProductLeaflet/file/getpdf/name/SARS_CoV-2_full_length_spike_protein_in_DIBMA_Glycerol.pdf?fileId=125823", "https://nextstrain.org/sars-cov-2/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7789827/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7151553/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7749647/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7151553/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8168329/", "https://pubmed.ncbi.nlm.nih.gov/33514944/", "https://www.youtube.com/watch?v=osRo-yz1VQ8", "https://www.youtube.com/watch?v=WOvvyqJ-vwo", "https://medlineplus.gov/genetics/understanding/therapy/genetherapy/", "https://www.mdpi.com/1999-4915/13/2/270/htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7472682/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8634699/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8252702/", "https://idahonews.com/news/local/local-doctor-on-covid-19-we-expect-this-virus-to-continue-to-mutate", "https://www.weforum.org/organizations/pfizer", "https://www.weforum.org/organizations/moderna-therapeutics", "https://www.weforum.org/organizations/johnson-johnson", "https://www.weforum.org/agenda/2021/07/everything-you-need-to-know-about-mrna-vaccines/", "https://www.weforum.org/agenda/2021/09/why-mrna-wont-replace-other-vaccine-types-just-yet/", "https://www.weforum.org/agenda/2018/01/africa-lead-healthcare-fourth-industrial-revolution/", "https://www.weforum.org/agenda/2018/11/how-the-biological-century-will-transform-healthcare/", "https://www.weforum.org/agenda/2021/11/synthetic-biology-can-benefit-all-expert-explains-how/", "https://www.technocracy.news/wef-says-synthetic-biology-is-the-key-to-reset-living-systems/", "https://www.weforum.org/communities/gfc-on-synthetic-biology", "https://www.youtube.com/watch?v=ijVijP-CDVI", "https://redoubtnews.com/2021/12/omicron-we-warned-you-the-covid-farce-would-never-end/", "https://redoubtnews.com/2021/11/you-will-get-vaccinated/", "https://www.paypal.com/paypalme/RedoubtNews", "https://redoubtnews.com/donations/", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2021-12-05T19:18:48+00:00"}