{"result_id": "258002", "URL": "https://redoubtnews.com/2021/07/door-to-door-vaccine-strike-forces/", "timestamp": "2023-04-25 16:57:34 CEST+0200", "meta": {"description": "White House announces vaccine “strike forces” go door-to-door, targeting anti-vaxxers in their homes, forcing Americans to take KILL SHOTS", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2021/07/door-to-door-vaccine-strike-forces/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "Door-To-Door Vaccine “Strike Forces”", "cleaned_text": "White House officially announces vaccine “strike forces” that will go door-to-door,\n\n targeting anti-vaxxers in their homes, forcing Americans to take KILL SHOTS\n\nIt’s official: The White House has publicly and un-apologetically announced the deployment of “strike forces” — a military term — to go door-to-door across America, targeting unvaccinated people in their own homes. This was proudly announced yesterday by Jen Psaki.\n\nThe goal of the program — which has already been denounced by numerous state governors and U.S. senators — is to coerce people into taking “kill shots” of spike protein bioweapons, which are deliberately mislabeled “vaccines.” Very quickly, this program will be ramped up to full mandatory status, which means gunpoint enforcement of deadly shots, essentially meaning the U.S. government is unleashing death squads across America.\n\nAnd they aren’t even hiding it anymore.\n\nMy best advice on how to handle this is:\n• None If they come to your door, don’t answer it.\n• None If they keep knocking, call the police.\n• None If they break in your door, defend yourself.\n• None At all times, video record whatever is happening. And upload your video to Brighteon.com or other free speech platforms.\n\nEvery human being has the right to self-defense. An assault with an experimental vaccine that has already killed at least 9,000 Americans (according to VAERS.HHS.gov) is, of course, an assault with a deadly weapon.\n\nAnyone attempting to assault you with a deadly weapon is committing a criminal act and should be arrested.\n\nHere’s what Jen Psaki said this week:\n\n“Our work doesn’t stop there and we are going to continue to press to get 12-18-year olds vaccinated… that’s one of the reasons why we initiated these strike forces to go into communities…”\n\nWatch her say it here:\n\nThe Biden regime just declared war on American civilians\n\n“Strike forces” is a military term that refers to armed squads who intend to destroy their target. In this case, the target is every American who refuses to be injected with spike protein bioweapons. The government has declared war on the American people.\n\nDeployed domestically, these militarized “strike forces” will consist of FEMA enforcers and almost certainly armed federal agents. These might be more accurately called “death squads,” and their goal is to either inject people with deadly bioweapons or medically kidnap them and take them away to FEMA’s covid death camps where they can be exterminated quietly, without making a scene on the street.\n\nAnyone who resists this with a firearm will likely be executed on sight and labeled a “domestic terrorist.”\n\nThis has gone beyond merely “authoritarian.” The goal of the government is extermination. Mass depopulation by any means necessary. This is a declared way against humanity. Psaki didn’t use the phrase, “strike forces” by accident. That’s not a phrase to be used lightly, either. It has a very specific meaning that’s all about using militarized squads to destroy intended targets.\n\nListen to my full Situation Update podcast for the horrifying details on what the criminal Biden regime plans to unleash across America — a wave of executions, medical kidnappings and mass death:\n\nThe views, opinions, or positions expressed by the authors and those providing comments are theirs alone, and do not necessarily reflect the views, opinions, positions of Redoubt News. Social Media, including Facebook, has greatly diminished distribution of our content to our readers’ newsfeeds and is instead promoting Main Stream Media sources. This is called ‘Shadow-banning’. Please take a moment and consider sharing this article with your friends and family. Thank you. Please support our coverage of your rights. Donate here: paypal.me/RedoubtNews", "opengraph": {"locale": "en_US", "type": "article", "title": "Door-To-Door Vaccine “Strike Forces” - Redoubt News", "description": "White House announces vaccine “strike forces” go door-to-door, targeting anti-vaxxers in their homes, forcing Americans to take KILL SHOTS", "url": "https://redoubtnews.com/2021/07/door-to-door-vaccine-strike-forces/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2021-07-11T19:41:50+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2021/07/strike-force.jpg", "image:width": "650", "image:height": "366", "image:type": "image/jpeg"}, "tags": ["government", "Joe Biden", "Bill of Rights", "death squads", "Medical Tyranny", "mRNA vaccine", "bioweapon", "anti-vaxxers", "jen psaki", "white house", "Covid-19(84)", "strike forces", "Tyranny"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Mike+Adams", "http://Brighteon.com/", "https://childrenshealthdefense.org/defender/cdc-vaers-deaths-reported-covid-vaccines/", "http://VAERS.HHS.gov/", "https://naturalnews.com/", "http://paypal.me/redoubtnews", "http://paypal.me/redoubtnews", "http://paypal.me/redoubtnews", "http://paypal.me/redoubtnews", "http://paypal.me/redoubtnews", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2021-07-11T19:41:50+00:00"}