{"result_id": "258012", "URL": "https://redoubtnews.com/2022/02/trudeau-fail/", "timestamp": "2023-04-25 16:57:47 CEST+0200", "meta": {"description": "Trudeau Fail ! Canada Freedom Convoy, Freedom is breaking out all over as public backlash has grown against harsh COVID restrictions", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2022/02/trudeau-fail/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "Trudeau Fail !", "cleaned_text": "Here is how Canadian Prime Minister Justin Trudeau responded on Twitter to the massive protest by truckers against the vaccine mandates and other regulations that are destroying their livelihoods – a protest enjoying broad public support:\n\n“Today in the House, members of Parliament unanimously condemned the antisemitism, Islamophobia, anti-Black racism, homophobia and transphobia that we’ve seen on display in Ottawa over the past number of days. Together, let’s keep working to make Canada more inclusive.”\n\nWow, you can tell how desperate he is by the fact that he threw the entire kitchen sink of the left’s white supremacy pejoratives at his critics. Usually, they try to parcel out the groundless accusations, but Trudeau is so panicky that he hurled all his worn-out “isms” to see if any of them would stick.\n\nFYI: they didn’t. In fact, take a look at photos of Canada’s truckers and protesters. You’ll note that they’re unlikely “white supremacists,” since most of them are Sikh immigrants from India.\n\nSikhs, who represent major share of truckers, protest against Canada’s vaccine mandates as Trudeau and his family leave their Ottawa home\n\nAlso from that article: “The increasing number of protesters prompted police to prepare for the possibility of violence. As of now, no injuries or deaths have been reported.” Yes, that’s what an actual “peaceful protest” looks like. You don’t have to overlook any widespread arson to qualify it as “mostly peaceful.”\n\nThe only way Trudeau is making Canada more inclusive is that he’s bringing so many people together to support the truckers and reject his vacuous woke nonsense.\n\nThe good news is that while Trudeau obviously fails to get the message, others can sense which way the wind is blowing, and it’s blowing away from governments seizing more power and trampling on people’s rights with destructive “health emergency” measures that aren’t even helping. The premier of Saskatchewan wrote a letter of support for the truckers and set a target date of this month to end vaccination requirements, saying they’re no longer reducing transmission of the Omicron variant. And Quebec’s premier, surprised by the huge public backlash, dropped his plans to tax the unvaccinated.\n\nAnd it’s not just in Canada: freedom is breaking out all over as public backlash has grown against harsh COVID restrictions that have done little or nothing to reduce COVID deaths.\n\nDenmark becomes first EU country to lift all Covid-19 restrictions\n\nWatching Trudeau spew all those empty “isms” and seeing that they no longer intimidate people into silence is one of the best pieces of news that Western civilization has seen in years. If for nothing else, those Canadian truckers have earned a big salute from everyone who cares about freedom of thought and speech, limited government and the rights of the individual.\n\nFinally, some perfect illustrations of what I hope is the last gasp of mindless, unscientific COVID compliance theater by our hypocritical elites, check out this photo courtesy of the Gun Free Zone blog.\n\nOne picture that captures the utter insanity of COVID compliance\n\nIt’s a group of professional cheerleaders posing with basketball legend Magic Johnson. The young gymnasts in peak physical condition (a group at lowest risk from COVID) are all wearing masks. The only one not wearing a mask is the rich and famous 62-year-old overweight retiree who’s had HIV for 31 years.\n\nMagic also wasn’t wearing a mask in these photos with COVID lockdown fanatics, L.A. Mayor Eric Garcetti, San Francisco Mayor London Breed and California Gov. Gavin Newsom. But then, neither were any of them.\n\nAt least Garcetti had an excuse: he held his breath for two seconds. Take that, virus!\n\nThis article may contain statements that reflect the opinion of the author. Consider sharing this article with your friends and family. Please support our coverage of your rights. Donate here", "opengraph": {"locale": "en_US", "type": "article", "title": "Trudeau Fail ! - Redoubt News", "description": "Trudeau Fail ! Canada Freedom Convoy, Freedom is breaking out all over as public backlash has grown against harsh COVID restrictions", "url": "https://redoubtnews.com/2022/02/trudeau-fail/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2022-02-04T22:40:47+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2022/02/Trudeau.jpg", "image:width": "800", "image:height": "468", "image:type": "image/jpeg"}, "tags": ["forced vaccinations", "Liberal agenda", "Canadian Freedom Convoy", "Gov. Gavin Newsom", "Justin Trudeau", "supply shortages", "Quebec", "Omicron", "Government Mandates", "Denmark", "mRNA vaccine", "Sweden", "Covid-19(84)", "Magic Johnson"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Mike+Huckabee", "https://www.tribuneindia.com/news/diaspora/sikhs-who-represent-major-share-of-truckers-protest-against-canadas-vaccine-mandates-as-trudeau-and-his-family-left-their-downtown-ottawa-home-365812", "https://legalinsurrection.com/2022/02/quebec-dumps-plans-to-tax-unvaccinated/", "https://bnonews.com/index.php/2022/02/sweden-to-drop-all-covid-19-restrictions/", "https://www.gwinnettdailypost.com/news/denmark-becomes-first-eu-country-to-lift-all-covid-19-restrictions/article_2dcfc1d3-6fab-59f2-8f1d-a9ea326baee5.html", "https://legalinsurrection.com/2022/02/virginias-largest-public-universities-drop-vax-mandate-for-students/", "https://gunfreezone.net/one-picture-that-captures-the-utter-insanity-of-covid-compliance/", "https://www.foxnews.com/politics/los-angeles-garcetti-mocked-for-response-to-maskless-picture", "https://www.paypal.com/paypalme/RedoubtNews", "https://redoubtnews.com/donations/", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2022-02-04T22:40:47+00:00"}