{"result_id": "258017", "URL": "https://redoubtnews.com/2021/06/prom-students-treated-like-prisoners-in-nazi-germany/", "timestamp": "2023-04-25 16:57:51 CEST+0200", "meta": {"description": "Prom Students Treated Like Prisoners In Nazi Germany, children numbered, black sharpie marker, info if they were vaccinated on table outside", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2021/06/prom-students-treated-like-prisoners-in-nazi-germany/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "Prom Students Treated Like Prisoners In Nazi Germany", "cleaned_text": "The High School in Exeter, New Hampshire went too far this week by shaming the unvaccinated students attending the prom.\n\nIt was reported by a State Representative from Brentwood and School Board Member that parents had contacted her about their children being numbered with a black sharpie marker if they had not received the experimental mRNA shots.\n\nThese deadly injections are experimental treatments that cannot be mandated or forced onto people under U.S. law and FDA regulations. Coercion is not only morally and ethically wrong, it’s illegal.\n\nEven worse, children should not be shamed or coerced through peer pressure to do anything against their will, or against their family values. Schools and governments around the world are putting so much pressure on these children that many of them are reacting beyond all reason.\n\nMaine teen dies by suicide after struggling with COVID-19 isolation\n\n Online classes woes push Albay HS student to kill himself\n\nMelissa Litchfield reported on Facebook, and Ann Marie Banfield picked it up for Granite Grok, the following quotes and photos:\n\n” ….was pretty fired up today after learning that kids who weren’t vaccinated had a number written on them in Sharpie at the EHS prom last night. If they were on the dance floor they had to raise their hands after every three songs so their numbers could be recorded by other underclass students for contact tracing purposes. There’s even more to the story, but this alone is surprising to us. We truly feel they are literally branding our kids if they don’t get this experiential “emergency” approved vaccine…”\n\n” They also left the list of student names (first and last) with the info on whether they were vaccinated or not on a table outside after the prom. I found it the next morning. This information should 1. Not have been shared and 2. Should never be left where anyone can have access to it. I have a photo of the list.”\n\n” … I find it absolutely unbelievable that ” ” and ” ” was allowed to treat the kids like prisoners in Nazi Germany. Marking them, thus singling them out, and then having to raise their hands is beyond tolerable. First the school could be looking at lawsuits for violation of Hippa rights. They have no business asking for a vaccine card….last Thursday masks were no longer required outside and if this is in effect it should not have mattered if they were vaccinated or not.” Nowhere does … state that if you aren’t vaccinated you need to wear it. Instead we will brand you with the scarlet letter for all the kids to see. I hope, and I am sure you will bring this to the SB and higher if need be. This should NEVER been allowed….”\n\nPhoto header source: How IBM Helped The Nazis Carry Out The Holocaust\n\n Remaining photos source: granitegrok.com\n\nThe views, opinions, or positions expressed by the authors and those providing comments are theirs alone, and do not necessarily reflect the views, opinions, positions of Redoubt News. Social Media, including Facebook, has greatly diminished distribution of our content to our readers’ newsfeeds and is instead promoting Main Stream Media sources. This is called ‘Shadow-banning’. Please take a moment and consider sharing this article with your friends and family. Thank you. Please support our coverage of your rights. Donate here: paypal.me/RedoubtNews", "opengraph": {"locale": "en_US", "type": "article", "title": "Prom Students Treated Like Prisoners In Nazi Germany - Redoubt News", "description": "Prom Students Treated Like Prisoners In Nazi Germany, children numbered, black sharpie marker, info if they were vaccinated on table outside", "url": "https://redoubtnews.com/2021/06/prom-students-treated-like-prisoners-in-nazi-germany/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2021-06-10T20:31:44+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2021/06/tattoo.jpg", "image:width": "800", "image:height": "569", "image:type": "image/jpeg"}, "tags": ["Nazi", "Melissa Litchfield", "Contact Tracing", "FDA", "Nazi Germany", "mRNA vaccine", "prom", "Covid-19(84)", "Holocaust", "Exeter New Hampshire"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Shari+Dovale", "https://nypost.com/2020/12/08/maine-teen-commits-suicide-amid-pandemic-isolation/", "https://mb.com.ph/2020/06/18/online-classes-woes-push-albay-hs-student-to-kill-himself/", "https://redoubtnews.com/wp-content/uploads/2021/06/tattoo2.jpg", "https://granitegrok.com/blog/2021/06/unvaccinated-students-at-high-school-prom-numbered-with-a-sharpie-tracked-all-night", "https://www.facebook.com/melissalitchfieldforamerica/", "https://www.breitbart.com/politics/2021/06/09/report-unvaccinated-students-numbered-sharpie-tracked-high-school-prom/", "https://allthatsinteresting.com/ibm-nazis-ww2", "https://granitegrok.com/", "https://www.americasfrontlinedoctors.com/wp-content/uploads/Vaccine-PP.pdf", "http://paypal.me/redoubtnews", "http://paypal.me/redoubtnews", "http://paypal.me/redoubtnews", "http://paypal.me/redoubtnews", "http://paypal.me/redoubtnews", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2021-06-10T20:31:44+00:00"}