{"result_id": "258013", "URL": "https://redoubtnews.com/2021/12/unvaxxed-may-soon-be-shipped-to-quarantine-camps/", "timestamp": "2023-04-25 16:57:48 CEST+0200", "meta": {"description": "Unvaxxed May Soon Be Shipped to Quarantine Camps, Australia is building its 2nd camp, the U.S. already has 800 FEMA camps ready for action", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2021/12/unvaxxed-may-soon-be-shipped-to-quarantine-camps/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "The Unvaxxed May Soon Be Shipped to Quarantine Camps", "cleaned_text": "The Unvaxxed May Soon Be Shipped to Quarantine Camps\n• None According to President Biden, “a winter of death” awaits anyone who rejects the experimental COVID jab. If we are to go by actual science and data, the warning Biden issued should have gone out to the vaccinated, because everything points to the double and triple jabbed being at increased risk for infection, especially with the Omicron variant\n• One reason for this is because the COVID jab reprograms your innate and adaptive immune systems, causing immune depletion. Data also show that the more heavily “vaccinated” a population is, the higher the case rate gets\n• As predicted, we are rapidly approaching a time when the unvaccinated might be imprisoned for no other reason than their refusal of an experimental gene transfer injection\n• In early January 2021, a New York bill (A416) was introduced that would give the governor and his or her delegates the power to remove and/or indefinitely detain anyone suspected of being a threat to public health. Detainees would be kept in a “medical facility or other appropriate facility” — in other words, a medical prison camp — for a maximum of 60 days, although a court could extend the detention in 90-day increments, indefinitely\n• None In Australia, medical incarceration is already underway. Anyone who has come in close contact with someone who tests positive must spend 14 days in the quarantine camp, even if they are triple jabbed and test negative for COVID\n\nAccording to President Biden, “a winter of death” awaits anyone who rejects the experimental COVID jab which, by the way, has been consistently shown to do far more harm than good.\n\nA December 16, 2021, White House statement reads: “For the unvaccinated, we are looking at a winter of severe illness and death. For themselves, their family and the hospital they’ll soon overwhelm.” That exact sentence was reiterated the next day by COVID-19 response coordinator Jeff Zients during a virtual press conference.\n\nAs reported by MSN’s Claire Goforth,1 the “prediction” didn’t go over well with the public. “Most people hate it. They feel it’s callous and cruel,” Goforth said, quoting a number of Twitter responses, including one from John D. Davidson:\n\nA Twitter user by the name Martyr Made noted, “The aggressive Us/Them language in this White House message is insane.”2 Olivia Nuzzi, a Washington, D.C., reporter for New York Magazine tweeted, “Who is this for? Unvaccinated Americans are not going to be persuaded by messaging like this.”3\n\nWhite House Chief of Staff Ronald Klain defended Biden saying “we have a duty to warn people what they are facing if unvaccinated.”4 But from my perspective, the rub is that they continue to pretend that lies are truth and truth is lies. Everything is upside-down, and many are rejecting this “winter of woe” message for the simple fact that they know the opposite is true.\n\nIf we are to go by actual science and data, the warning Biden issued should have gone out to the vaccinated, because everything points to the double and triple jabbed being at increased risk for infection, especially with the Omicron variant.\n\nOne reason for this is because the COVID jab reprograms your innate and adaptive immune systems, causing immune depletion.5 Data also show that the more heavily “vaccinated” a population is, the higher the case rate gets.6 And even this fails to account for the massive increase risk of dying from the jab or becoming permanently disabled, as many jabbed millions have already suffered.\n\nFormer WHO Adviser Tells Vaccinated to Quarantine Over Winter\n\nBack in August 2021, the U.K. Column interviewed professor Christian Perronne, a French infectious disease expert, long-time vaccine policy chief and former vice president of the World Health Organization’s European Advisory Group, who issued the opposite — and likely far more accurate — warning:7\n\nNot surprisingly, despite impeccable credentials, Peronne has been censored and shunned for his contrarian views on COVID countermeasures, the COVID gene transfer shots in particular. During his interview, he didn’t mince words, referring to the European COVID-19 policy as “completely stupid.”\n\nAre Prison Camps for the Unjabbed Next?\n\nAs predicted, we are rapidly approaching a time when the unvaccinated might be imprisoned for no other reason than their refusal of an experimental gene transfer injection. In early January 2021, a New York bill (A416) was introduced that would give the governor and his or her delegates the power to remove and/or indefinitely detain anyone suspected of being a threat to public health.\n\nDetainees would be kept in a “medical facility or other appropriate facility” — in other words, a medical prison camp — for a maximum of 60 days, although a court could extend the detention in 90-day increments, indefinitely. As reported by Reason:8\n\nThe bill comes up for a vote in the New York Senate and Assembly sometime in the next legislative session, which begins January 5, 2022.9 In addition to indefinite detention for poorly specified reasons, the bill would “require an individual who has been exposed to or infected by a contagious disease to complete an appropriate, prescribed course of treatment, preventive medication or vaccination.”\n\nIn other words, this bill legalizes the forced vaccination of anyone who is detained under the mere suspicion of being infected with something or having been in close proximity to someone suspected of being infected. As reported by Rights and Freedoms:10\n\nAustralia Among the First to Test Medical Imprisonment Model\n\nIf you think being tossed into a prison camp without cause or recourse is impossible — after all, this is the United States of America, the land of the free, home of the brave — think again. Australia, another shining star of democracy, has backslidden into totalitarianism at a speed that has everyone’s head spinning.\n\nThe Australian government has gone full speed ahead, building a massive COVID quarantine camp, complete with barbed wire fences, guards and video surveillance. Once you’re in, you can’t just waltz out whenever you want to. In the video above, Hayley Hodgson describes what it was like to be detained and transferred to a COVID internment camp, even though she wasn’t sick.\n\nVideo surveillance placed her with a friend who had tested positive. They ran her license plate to retrieve her address and showed up at her house, telling her she had to quarantine. Even if you test negative, you still have to spend 14 days in a quarantine camp if you’ve been in close contact with someone who has tested positive. If you refuse, you’re fined $5,000 and forcibly taken there by police anyway.\n\nIf someone can threaten to extend your stay in this “health hotel,” just what kind of medicine are we dealing with? Clearly, this is a prison model, not a health care model. When have you ever been in a hospital and the nurse tells you, “If you don’t eat your pudding, we’re keeping you here another three months”?\n\nBased on Hodgson’s description of the camp, you don’t get much in terms of medical attention. One shudders to think what would happen to someone who actually had a severe case of COVID in there. Will hazmat suit-equipped police drop you at your room and then you don’t see them again unless you’re caught breaking some rule?\n\nFood is delivered and dropped outside your door once a day. Each room has a 2×2 meter deck where you can go, but if you step outside your room or designated outdoor area without a mask, you’re fined $5,000. She was also told that additional infractions would result in her stay being extended past the 14 days — even though she wasn’t sick and there was no reason to keep her there in the first place.\n\n“You’re literally treated like a prisoner in there,” she says. If you’re triple jabbed and think that means you’ll never see the inside of one of these prisons, think again. It doesn’t matter whether you’ve been double or triple jabbed.\n\nIf you’re found to have been in close contact with someone who tests positive, in you go. And there’s no legal process you can turn to for help if you disagree with the decree to quarantine. During her stay, three teenagers — all of whom had tested negative — managed to escape the camp. The manhunt that ensued is further evidence that we’re dealing with a prison model and nothing else.\n\nUS Has Hundreds of Ready-Made Prison Camps\n\nWhile Australia is building its second camp, the U.S. already has 800 FEMA camps ready for action. As reported by AMG News:12\n\nThe article goes on to list the many executive orders that can work together to suspend the Constitution and the Bill of Rights, effectively allowing government to seize control over all aspects of life, from food production and transportation to communications and health care functions.\n\nThere’s even an executive order that allows the government to mobilize civilians into “work brigades” to carry out whatever functions are deemed necessary, and one that allows the Housing and Finance Authority to relocate entire communities. To find the FEMA camp nearest you, check out the state listings in the AMG News article.13 Most states have three or more.\n\nInterpret the Media Narrative — They Want Civil War\n\nIf you’ve been paying attention over the past couple of years, you may have noticed that you can almost always predict what the next phase of the narrative is going to be. They “advertise” or pave the way for the evolving narrative by putting out articles slanted in a given direction.\n\nBased on recent headlines, I suspect “the powers that be” are hoping to incite a civil war. “CIA Advisor: US Is ‘Closer to Civil War’ Than Thought Possible,” the Daily Mail claims.14 “We’re Edging Closer to Civil War,” an opinion columnist at The New York Times declares.15 “US Closer to Civil War Than Most Would Like to Believe, New Book Says,” announces The Guardian.16\n\nAccording to Dr. Barbara Walter, a political science professor who serves on the Political Instability Task Force, the U.S. meets several criteria that historically have served as indicators that an “open insurgency” may be imminent. In her book, “How Civil Wars Start,” she writes:17\n\nGovernment Has Designated the Enemy, and It’s Us\n\nThe problem here is that while authoritarian politicians keep paying lip service to “democracy,” their own actions are anything but. Just who is undermining democracy? If you believe the news and CIA advisers, it’s the people who want the Constitution to stand and be adhered to that are the enemies of democracy. Never mind the mental gymnastics required to get to that conclusion.\n\nIt’s not hard to predict a scenario in which authoritarian leaders, acting on a falsely constructed narrative that a civil war is imminent, might start rounding up “dissidents.” And that’s in addition to the already existing, thinly veiled threat of tossing the unvaccinated into indefinite detention.\n\nI agree with Walter’s assessment that we’re in dangerous territory, but not for the same reasons as she suggests. I would also argue that just about every country is a powder keg ready to blow, and for the same reason — people are being tyrannized by their governments and by unelected health authorities that claim powers they do not legally have.\n\nTake England, for example. Entrepreneur and COVID blogger Steve Kirsch was recently notified that an anti-COVID restrictions campaign member had been detained for 28 days under the Mental Health Act for not wearing a mask to a dentist appointment.18 Normally, it’s quite difficult to get a person sectioned under the Mental Health Act, but not anymore.\n\nRefusing to wear a mask apparently qualifies as an acute mental health disorder warranting a month-long stay in a psych ward.\n\nThe man, Charlie Cunningham, is reportedly being held at Littlemore Mental Hospital in Oxford, “where he’s being deprived of sleep under the pretext of being suicidal,” according to the woman who contacted Kirsch. She added, “He’s now going to be detained over Christmas and New Year — [he’s] very upset as he feels he’s been kidnapped and being held against his will …”\n\nWhile all the articles mentioned earlier that warn of civil war blame the decline in democracy on the Trump administration, the Trump administration can hardly be blamed for the civil rights abuses and power grabs that are occurring today. It’s time to judge each tree by its fruit. That said, knowing that a civil war would serve the totalitarian takeover agenda, it would be wise to make sure our resistance remains a peaceful one.\n\nDr. Joseph Mercola is the founder of Mercola.com. An osteopathic physician, best-selling author and recipient of multiple awards in the field of natural health, his primary vision is to change the modern health paradigm by providing people with a valuable resource to help them take control of their health.\n\nHis latest book, “The Truth About COVID-19,” is an instant bestseller. With over 1,600 reviews, it has a nearly perfect 5-star rating so grab your copy of the #1 bestselling book on Amazon today before Biden bans it.\n\nThe views, opinions, or positions expressed by the authors and those providing comments are theirs alone, and do not necessarily reflect the views, opinions, positions of Redoubt News. Social Media, including Facebook, has greatly diminished distribution of our content to our readers’ newsfeeds and is instead promoting Main Stream Media sources. This is called ‘Shadow-banning’. Please take a moment and consider sharing this article with your friends and family. Thank you. Please support our coverage of your rights. Donate here", "opengraph": {"locale": "en_US", "type": "article", "title": "The Unvaxxed May Soon Be Shipped to Quarantine Camps - Redoubt News", "description": "Unvaxxed May Soon Be Shipped to Quarantine Camps, Australia is building its 2nd camp, the U.S. already has 800 FEMA camps ready for action", "url": "https://redoubtnews.com/2021/12/unvaxxed-may-soon-be-shipped-to-quarantine-camps/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2021-12-31T21:03:47+00:00", "article:modified_time": "2021-12-31T21:19:09+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2021/12/mercola.jpg", "image:width": "799", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["FEMA camp", "Follow the Science", "vaccinated", "medical prison camp", "Israel", "Resident Biden", "Covid-19(84)", "Unvaccinated"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Dr.+Joseph+Mercola", "https://www.amazon.com/Truth-about-Covid-19-Lockdowns-Passports/dp/1645020886/", "https://www.mercola.com/", "https://www.amazon.com/Truth-about-Covid-19-Lockdowns-Passports/dp/1645020886", "https://www.paypal.com/paypalme/RedoubtNews", "https://redoubtnews.com/donations/", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2021-12-31T21:03:47+00:00"}