{"result_id": "258010", "URL": "https://redoubtnews.com/2022/11/florida-the-new-capital-of-red-state-america/", "timestamp": "2023-04-25 16:57:44 CEST+0200", "meta": {"description": "Future of Republican Party is not hard to find. National Republicans need to let Florida and its transformational governor show them the way.", "lang": "en", "keywords": "", "favicon": "https://redoubtnews.com/wp-content/uploads/2018/08/cropped-REDOUBT-PROFILE-600x600-1-32x32.jpg", "canonical": "https://redoubtnews.com/2022/11/florida-the-new-capital-of-red-state-america/", "encoding": "UTF-8"}, "image": null, "domain": "redoubtnews.com", "title": "Florida, the New Capital of Red State America", "cleaned_text": "Florida, the New Capital of Red State America\n\nIn what, overall, was a frustrating election night for Republicans, in which the oft-predicted “red wave” failed to materialize nationally, there was one state above all that provided a clear beacon of hope. That would be my adopted state of Florida.\n\nIn the Sunshine State Tuesday evening, Governor Ron DeSantis cruised to a second term with an astounding near-20-point margin of victory over former Gov. Charlie Crist, and Republican Senator Marco Rubio routed Democratic challenger Rep. Val Demings by more than 16 points. Both DeSantis and Rubio won the state’s most populous county, 70-plus percent Hispanic Miami-Dade County—DeSantis by double digits. Both Republican standard-bearers also won majority-Hispanic Osceola County, in the Orlando area, and DeSantis also flipped Palm Beach County from blue to red.\n\nAll other Florida Republicans running statewide also won, and Republicans also secured supermajority status in both the state senate and the state house. U.S. congressional races in Florida that were labeled before the election as toss-ups, such as the 13th and 27th congressional districts, uniformly broke for Republicans—and often not in particularly close fashion. Some other states, such as Texas and Iowa, also had good election nights for Republicans; but in no state did the GOP perform better, up and down the ballot, than in Florida.\n\nAll of this is simply astonishing from Florida, the one-time paradigmatic “swing” state that famously decided the 2000 presidential election by a paltry 537 votes out of nearly 6 million cast. Indeed, just four years ago, DeSantis eked out his first statewide victory over Democrat Andrew Gillum by a margin of 0.4 percent. And DeSantis’ victory over Gillum was not even the closest statewide race in Florida that cycle; Rick Scott won his U.S. Senate race over Bill Nelson that same year by a microscopic 0.12 percent margin.\n\nYet, just four years later, Florida is no longer a purple state. It is a red state—in fact, a dark red state. Consider, as but one more data point, that DeSantis won reelection by a larger statewide margin than did Oklahoma Governor Kevin Stitt, who won his reelection race Tuesday night by just under 14 percent. Oklahoma is perhaps the nation’s single reddest state; in every presidential election since George W. Bush’s reelection in 2004, every single Oklahoma county has voted for the Republican presidential candidate. But in 2022, DeSantis won in former “swing” state Florida by a wider margin than Stitt did in ruby red Oklahoma.\n\nThe bottom line is as straightforward as it would have been jarring to hear just a handful of years ago: Florida, the nation’s third-most populous state, has surpassed Texas, the nation’s second-most populous state, as the capital of red state America.\n\nAs Republicans lick their wounds from Tuesday’s various disappointments and engage in some deep introspection about what went wrong at the national level, one key question thus becomes: What lessons can Florida Republicans impart to Republicans elsewhere?\n\nPresident Donald Trump’s 1.2 percent victory margin in Florida in the 2016 presidential election was prescient as a leading indicator; indeed, in the razor-thin DeSantis and Scott 2018 victories, both Republicans ran well ahead of national Republicans, who had a down cycle. But the “Florida miracle” story is impossible to understand without the context of the COVID-19 pandemic and the Floridian who shepherded the Sunshine State through it: Ron DeSantis.\n\nDeSantis repudiated, far quicker than did others, the noxious lockdowns, mask requirements, school shutdowns and (eventual) vaccine passports that characterized those dark days of full-on COVID hysteria. In taking on what he has called the “biomedical security state” so aggressively, DeSantis appealed to both individual liberty and innate human dignity, pertaining to the choice of whether to take a novel vaccine and the ability to work and earn a living. DeSantis understood, from the get-go, that the national policy overreaction to COVID implicated not merely liberty concerns but also a blatant attempt by the American ruling class to subjugate “wrong-thinking” “deplorables.”\n\nThe more populist hue of DeSantis’ COVID-related policy also manifested itself in his approach to vaccine passports, where Florida resisted the “let every business decide for itself” mantra of chamber of commerce/libertarian Republicanism and instead opted for a statewide ban on vaccine passports. Outside of COVID, DeSantis has similarly shown a willingness to wield government power for the benefit of good and the detriment of decadence, such as his move to strip The Walt Disney Company of extra-legal tax benefits for its strident opposition to Florida’s law protecting children from teachers seeking to indoctrinate youngsters in vogue gender ideology. Furthermore, Florida’s Stop WOKE Act, an anti-“woke capitalism” measure that was championed by DeSantis and should ultimately be vindicated by the courts, is representative of the more “muscular” mentality Republicans must now take to issues of political economy.\n\nThe results speak for themselves. During the first year of COVID, from 2019 to 2020, Florida had four times the net income migration as the next closest state, Texas ($24 billion to $6 billion). And the individuals and companies moving to Florida seem to be those who are voting with their feet: Registered Republicans now outnumber registered Democrats in Florida by over 300,000, a shift of nearly 600,000 since DeSantis’ minuscule 2018 victory over Gillum. As the website Florida Politics reported last week, of the 394,000 active voters who have moved to Florida since the onset of COVID, they are twice as likely to be registered Republicans as registered Democrats. The Sunshine State’s brand of Republicanism has also made further inroads with the state’s Hispanic community; as mentioned, DeSantis and Rubio won not merely heavily Cuban (and to a lesser extent, Venezuelan) Miami-Dade County but also Osceola County, whose Hispanic population is majority Puerto Rican.\n\nThe future of the Republican Party is not hard to find. National Republicans need to simply let Florida and its transformational governor show them the way.\n\nThis article may contain statements that reflect the opinion of the author. Consider sharing this article with your friends and family. Please support our coverage of your rights. Donate here", "opengraph": {"locale": "en_US", "type": "article", "title": "Florida, the New Capital of Red State America - Redoubt News", "description": "Future of Republican Party is not hard to find. National Republicans need to let Florida and its transformational governor show them the way.", "url": "https://redoubtnews.com/2022/11/florida-the-new-capital-of-red-state-america/", "site_name": "Redoubt News", "article:publisher": "https://www.facebook.com/RedoubtNews/", "article:published_time": "2022-11-13T22:07:26+00:00", "image": "https://redoubtnews.com/wp-content/uploads/2022/11/desantis.jpg", "image:width": "800", "image:height": "533", "image:type": "image/jpeg"}, "tags": ["constitution", "elections", "Bill of Rights", "Florida", "politics", "Republican", "Gov. Ron DeSantis", "Vote", "Covid-19(84)", "margin"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://redoubtnews.com/?s=Josh+Hammer", "https://amgreatness.com/", "https://redoubtnews.com/donations/", "#", "#", "#", "#"], "authors": ["Shari"], "publish_date": "2022-11-13T22:07:26+00:00"}