{"result_id": "260028", "URL": "http://www.renegadetribune.com/depopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths/", "timestamp": "2023-04-25 16:59:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/depopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Depopulation Agenda – Most Vaccinated Countries Are All Suffering an Extraordinary Rise in Excess Deaths", "cleaned_text": "Question– Why is mortality in Scotland higher in 2021 than 2020?\n\nAnswer– Because more people are dying. And the reason more people are dying is because more people have been vaccinated. In other words, there’s a link between rising mortality and the Covid-19 vaccine.\n\nAnswer– You’re right, I can’t. The evidence is all circumstantial. But it is compelling, all the same. For example, rising mortality isn’t just happening in Scotland. It’s happening in many of the countries that launched mass vaccination campaigns earlier in the year. They’re all seeing a significant uptick in all-cause mortality. Why is that? What are they doing differently in 2021 than they did in the years before?\n\nQuestion– I can see what you’re getting at, but I still don’t think you have enough evidence to make your case.\n\nAnswer– Okay, then you tell me: Why are more people dying in 2021 than 2020? And, keep in mind, all-cause mortality isn’t just up a bit; it’s smashing the five-year average. Check out this recent post from Alex Berenson at Substack:\n\nQuestion– But how can you build a case on data from just one country? It’s ridiculous.\n\nAnswer– But it’s not just Scotland. The same rule applies to many of the countries that launched vaccination campaigns earlier in the year. Here’s more from Berenson:\n\nAnd then there’s this is from Data Analyst’s Twitter account (check out the charts):\n\n Data Analysis @Data_is_Louder\n\n ·\n\n​Denmark ––“5 months is a row 2021 has broken the 10-year record of people dying from all causes…..Covid-19 deaths close to zero during the same period.”\n\nThe same is true in Ireland, UK and Israel. Take a look at England (Ages 10 to 59 years old.)\n\nThat’s something you’re not going to read in the media, and for good reason, too. Because it would undermine their lethal objective to continue hyping the vaccine.\n\nThe examples are everywhere across the Internet. You don’t have to look very far. Wherever mass vaccinations took place, there, too, morality has risen. And–once again–these are not Covid deaths. These are mainly heart attacks, strokes, blood clots, circulatory diseases and neurological issues; the same vaccine-induced ailments we were warned about by the physicians and scientists who’ve been telling us the truth from the start. Turns out they were right after all.\n\nSimply put, the vaccines are increasing fatalities, not reducing them. They are making matters worse not better. They are perpetuating the crisis not ending it. And that is why the red line in the chart is pointing upward. It’s an indication that the death toll will continue to rise as long as we continue to do what we are doing now, inoculating millions of people with a cytotoxic pathogen that triggers blood clots, inflammation and autoimmunity. Here’s another chart of Scotland with a short comment from The Daily Skeptic:\n\nHave you noticed how the media is trying to cover-up the sudden surge in mortality? Here’s a good example from an article at the UK Telegraph:\n\nSo, according to the article, there were:\n\nAll of these cerebrovascular, cardiac and circulatory ailments didn’t suddenly drop from the sky in 2021. They are vaccine-generated injuries. Can you see that?\n\nAnd they are all linked to the spike protein which is the “biological mechanism of action” that “damages blood vessels, organs, and causes blood clots, and that can kill a human being?” (Quote: Dr Peter McCullough)\n\nHave you wondered why more people died this year of Covid than in all of 2020? According to Johns Hopkins, Covid killed 353, 000 people in the United States in 2020. But in just 10 months in 2021, 390,000 people have died. How can that be? After all:\n• Many of the extremely vulnerable have already died\n• The experts say Delta is not as lethal as the original Wuhan infection\n• 100 million people (according to the CDC) have already survived Covid and now have natural immunity\n• And 190 million people have been double-vaxxed\n\nThese are four reasons why deaths should be decreasing. But they’re not decreasing, they’re increasing.\n\nAnd why are the countries with the highest Covid-19 death rates, also the most vaccinated countries?\n\nIt’s because “there is a massive positive correlation between vaccination percentage and deaths.”\n\nBut don’t take my word for it. Check it out for yourself. Do your own research.\n\nJust recently, Professor Norman Fenton at Queen Mary London University sifted through the government’s statistics (ONS) to see if he could “determine the overall risk-benefit of Covid-19 vaccines” by comparing “the all-cause mortality rates between the vaccinated and unvaccinated in each age category.”\n\nHis thinking on the matter was simple:\n\nSimple, right? In other words, if the vaccine is so great, then it should be clear from the data. But that’s not what Fenton found. What he found was the opposite. He found that all-cause mortality is higher among vaccinated people than the unvaccinated. (And depending how you interpret the data, it could be significantly higher.) Fenton hoped that his analysis would impact the debate on the ongoing vaccination program, but instead, he’s been viciously denounced as a right-wing extremist, which is what happens to anyone who dares to to challenge the official narrative. Here’s more from NPR:\n\nRepeat: “abdominal pain, respiratory problems, blood clots, heart conditions.” In other words, the overcrowding in Emergency Rooms could as easily be linked to vaccine-induced injuries as they could to “delayed treatments”. And notice how the author seems genuinely concerned about the burgeoning ERs but never once mentions the elephant in the room; the vaccine. Was that just a slip-up on his part or was his real intention to bamboozle his readers from the start?\n\nThen, there’s this gem in the New York Post that tries to prepare the public for the onslaught of “thromboembolic” disorders we’ll be facing in the very near future. The article is appropriately titled “The little-known heart attack that’s striking ‘fit and healthy’ women as young as 22.” Here’s a clip from the article:\n\nGot that? So –according to the Post– it’s perfectly normal for a fit 22 year-old to be struck-dead by a heart attack. Do you think, perhaps, the author is trying to soften attitudes towards vaccine-induced injuries before they hit us like a ton of bricks? Indeed, he is, just like the article in the Times of India about celebrity superstar and fitness nut, Puneeth Rajkumar, who died just days ago from cardiac arrest. He was 46. According to The Times of India:\n\nDoes it seem like the media has accepted its role as accomplice to mass extermination or is that an exaggeration?\n\nIn any event, we can expect to see a deluge of similar articles popping up everywhere in the near future. Articles like this:\n\nCan you see what’s going on? These cookie cutter articles were all concocted with the same goal in mind, to hoodwink the public into believing that the extraordinary wave of deaths among healthy young people is completely normal. (“Nothing to see here. Move along.”) But, of course, none of this is normal. It’s all appallingly weird and shocking which is why we are so focused on excess deaths and all-cause mortality. Because, we think, these will provide the evidence we need to show that the vaccine is a critical part of the elite’s depopulation agenda aimed at slashing global population by billions of people. We still believe that’s what’s really going on. The big money guys have decided to eradicate a few billion of us cockroaches so they have more room to park their Learjets. As it happens, they settled on the vaccine as a “less messy” alternative to mowing us down in the streets with machine guns. Not that they’d lose any sleep over it.\n\nSo, how’s the plan going, you ask? Check it out:\n\nAnd here’s a clip from an article that extracted its data from more divers reseach. Take a look:\n\nIn contrast– in countries where there’s alot of viral spread– the damaging effects of the vaccine are much less visible. But no matter how you cut it, the spike protein erodes the body’s vital infrastructure weakening the vascular system, killing healthy cells and mitochondria, depleting the killer lymphocytes, and short-circuiting the immune system. The knock-on effects of this ferocious attack can be any of the myriad ailments that inevitably evolve from a pathogen-ravaged circulatory system, including cardiac arrest, stroke, pulmonary embolism, autoimmunity and a host of others. At present, heart attacks appear to top the list. Check out this brief post by Dr Peter McCullough:\n\nA pandemic of heart attacks that is brought on by a cytotoxic injection that inflicts damage on its victims whether they die or not. Is that an accurate summary of the Covid-19 vaccine?\n\nIt is. Here’s more from The Expose:\n\n“Data available from the Centre for Disease Control in the USA shows that since the Covid-19 vaccination programme got underway in the US, deaths due to ‘abnormal clinical findings not elsewhere classified’ have increased exponentially compared to pre-Covid-19 vaccination levels… Deaths in this category include cases for which no more specific diagnosis could be made…or symptoms were hard to determine… or cases were referred elsewhere.) “…the number of deaths due to abnormal clinical findings … maintained a steady average of just over 1,000 a week since February 2020, and was also at these levels prior to the alleged pandemic hitting the USA. However, around the end of March / early April 2021 there was a sudden uptick in the number of abnormal deaths registered per week, suddenly climbing … to over 7,000 a week by the middle of September, representing a 600% increase on the average seen every week prior to the start of the Covid-19 vaccination roll-out. The question of course is, why? …The one thing that millions of people have in common since abnormal deaths began to rise against the expected average, is that millions of people have been given an experimental injection, for which there is no long term safety data to know what the consequences of that will be. The official CDC data suggests that the consequences of a mass experimental vaccination roll-out are a shockingly steep rise in the number of deaths due to abnormal unidentified causes…” (“Investigation: Official CDC data shows a shockingly large increase of deaths due to abnormal mystery causes since Covid-19 Vaccinations began”, The Expose)\n\nThe article is consistent with the many stories we have heard from nurses reporting on patients presenting with unusual ‘oddball’ symptoms that elude traditional diagnosis. This should not be surprising given the unique properties of the spike protein whose stealthy attack on the vascular system has already touched off a tsunami of cardiovascular, neurological and immunological diseases unlike anything we’ve ever seen before. All of these deaths can be traced back to a “poison-death shot” that is relentlessly pushing all-cause mortality higher while killing people that are younger and younger. If you doubt this, then take a look at how many athletes are dropping dead shortly after they’ve been injected. It’s a story that’s bound to depress the hell out of any normal human being.\n\nAlso, check out this illuminating 2-minute video dealing with cardiac arrest and our phony vaccine injury reporting system. (VAERS)\n\nDr. Mike Yeadon summarized recent developments in a comment he posted on the Robin Monotti Channel recently. He said:​\n\nIndeed, it does.\n\nThis article originally appeared on The Expose.", "opengraph": {"title": "Depopulation Agenda – Most Vaccinated Countries Are All Suffering an Extraordinary Rise in Excess Deaths", "description": "“I think it’s highly likely that the next phase will involve death on a scale which will dwarf the claims of “covid-19 deaths” to date.” Dr. Mike Yeadon, former Pfizer Vice President", "image": "http://www.renegadetribune.com/wp-content/uploads/2021/11/home-g36ed12c42_1280.jpg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/depopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths/", "site_name": "Renegade Tribune", "article:published_time": "2021-11-22T17:24:49+00:00", "article:modified_time": "2021-11-22T13:13:21+00:00", "image:width": "1280", "image:height": "853"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.unz.com/author/mike-whitney/", "https://alexberenson.substack.com/p/scotland-is-87-adult-vaccinated-weekly/comments", "https://alexberenson.substack.com/p/its-not-just-the-uk-all-cause-deaths/comments", "https://twitter.com/phive26/status/1453859102866685952/photo/1", "https://i1.wp.com/www.unz.com/wp-content/uploads/2021/11/EnglandMortality-MW.jpg?ssl=1", "https://www.lifesitenews.com/blogs/the-real-pandemic-has-just-begun-and-its-covid-shot-induced-heart-attacks-in-the-young", "https://twitter.com/RealJoelSmalley/status/1453380202864721921/photo/1", "https://i0.wp.com/www.unz.com/wp-content/uploads/2021/11/CovidMortality-ScotlandMW.png?ssl=1", "https://dailysceptic.org/2021/11/04/are-vaccines-driving-excess-deaths-in-scotland-a-professor-of-biology-asks/", "https://www.telegraph.co.uk/news/2021/09/24/analysis-thousands-usual-dying-not-covid/", "https://theexpose.uk/2021/11/03/worldwide-data-proves-highest-covid-19-death-rates-are-in-most-vaccinated-countries/", "http://www.eecs.qmul.ac.uk/~norman/papers/inconsistencies_vaccine.pdf", "https://www.npr.org/sections/health-shots/2021/10/26/1046432435/ers-are-now-swamped-with-seriously-ill-patients-but-most-dont-even-have-covid", "https://nypost.com/2021/10/26/the-little-known-heart-attack-thats-striking-fit-and-healthy-women-as-young-as-22/", "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/kannada-actor-puneeth-rajkumar-dies-at-46-suffered-from-a-serious-cardiac-arrest-while-working-out/articleshow/87362644.cms", "https://www.irishtimes.com/news/health/physical-activity-may-increase-heart-attack-risk-study-suggests-1.4679205", "https://www.thehindu.com/news/cities/bangalore/heart-attacks-among-youngsters-on-the-rise/article37244462.ece", "https://www.cnbctv18.com/views/heart-attack-instances-rose-in-2021-with-age-no-bar-heres-what-led-to-it-10937832.htm", "https://www.citizensjournal.us/are-the-covid-jabs-responsible-for-rising-mortality-trends/", "https://theexpose.uk/2021/10/12/cdc-data-shows-shocking-increase-deaths-abnormal-mystery-causes-since-covid-vaccinations/", "https://www.notonthebeeb.co.uk/post/surge-of-sports-people-worldwide-suffering-unexpected-ill-health", "https://video.twimg.com/ext_tw_video/1456372913804824581/pu/vid/640x360/cW-rFkxO4NdcQnXH.mp4?tag=12", "https://t.me/s/robinmg", "https://dailyexpose.uk/2021/11/21/depopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths/", "http://www.renegadetribune.com/support-with-cryptocurrencies/", "https://gab.com/compose?url=http%3A%2F%2Fwww.renegadetribune.com%2Fdepopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths%2F&text=Depopulation%20Agenda%20%E2%80%93%20Most%20Vaccinated%20Countries%20Are%20All%20Suffering%20an%20Extraordinary%20Rise%20in%20Excess%20Deaths", "https://parler.com/new-post?message=Depopulation%20Agenda%20%E2%80%93%20Most%20Vaccinated%20Countries%20Are%20All%20Suffering%20an%20Extraordinary%20Rise%20in%20Excess%20Deaths&url=http%3A%2F%2Fwww.renegadetribune.com%2Fdepopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths%2F", "http://reddit.com/submit?url=http%3A%2F%2Fwww.renegadetribune.com%2Fdepopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths%2F&title=Depopulation%20Agenda%20%E2%80%93%20Most%20Vaccinated%20Countries%20Are%20All%20Suffering%20an%20Extraordinary%20Rise%20in%20Excess%20Deaths", "https://telegram.me/share/url?url=http%3A%2F%2Fwww.renegadetribune.com%2Fdepopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths%2F&text=Depopulation%20Agenda%20%E2%80%93%20Most%20Vaccinated%20Countries%20Are%20All%20Suffering%20an%20Extraordinary%20Rise%20in%20Excess%20Deaths", "http://www.renegadetribune.com/depopulation-agenda-most-vaccinated-countries-are-all-suffering-an-extraordinary-rise-in-excess-deaths/", "https://cash.app/$thekylehunt", "http://www.renegadetribune.com/as-reports-of-injuries-after-covid-vaccines-near-1-million-mark-cdc-fda-clear-pfizer-moderna-boosters-for-all-adults/", "http://www.renegadetribune.com/sweet-potatoes-and-maple-syrup-a-medicinal-food-pairing/"], "authors": [], "publish_date": "2021-11-22T17:24:49+00:00"}