{"result_id": "260039", "URL": "http://www.renegadetribune.com/official-u-k-lab-report-confirms-covid-19-vaccines-definitely-contain-graphene-oxide/", "timestamp": "2023-04-25 16:59:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/official-u-k-lab-report-confirms-covid-19-vaccines-definitely-contain-graphene-oxide/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Official U.K. Lab Report Confirms Covid-19 Vaccines Definitely Contain Graphene Oxide", "cleaned_text": "The Covid-19 vaccines have been forensically examined in the United Kingdom and a laboratory report confirms they contain graphene nanomaterials that can penetrate the body’s natural barriers and damage the central nervous system, and Graphene Oxide which can damage internal organs, destroy blood health, trigger cancer, and cause changes in gene function among a host of other ill effects.\n\nFollowing her own experience with patients who had suffered apparent vaccine injury and adverse reactions, a British Medical Practitioner came forward in December 2021 offering to assist in an investigation to ascertain whether the results discovered by Dr’s Noack and Campra could be replicated in the UK and also to examine the COVID-19 injection vials for discovery of toxins or unexpected contents.\n\nThe medical practitioner seized an injection vial from the fridge housed in the surgery in which she works and handed it to an independent investigator assisting in investigating cases relating to injury sustained as a result of injections given as part of the roll out.\n\nFurther vials have since been obtained which cover the three main manufacturers in the UK: Pfizer, Moderna and AstraZeneca.\n\nThe contents of the injection vials have been forensically examined and a laboratory report has now been officially published.\n\nThe report titled “Qualitative Evaluation of Inclusions In Moderna, AstraZeneca and Pfizer Covid-19 vaccines” has been presented to the Police involved in the UK Criminal Case, 6029679/21, which is said to provide them with more than enough reasonable suspicion that serious indictable offences have been committed regarding the administration of experimental treatments.\n\nThe report contains the toxicology reports of injection vials that have been forensically examined, with findings that provide “more than enough grounds” for the Police to apply for the Police and Criminal Evidence Act 1984 Warrant and seize injection vials for themselves.\n\nThe Police will then be able to submit them to a Home Office Laboratory with a view to replicate the findings and will enable them to possess their own hard evidence to support serious indictable offences.\n\nAdditionally, the police, in line with the duty of care to the public, have been asked to request the immediate cessation of the experimental treatment rollout.\n\nThe Report: Qualitative Evaluation of Inclusions In Moderna, AstraZeneca, and Pfizer Covid-19 vaccines – by UNIT\n\nFour vaccine vials were the subject of the investigation.\n\nTwo Moderna samples, and 1 AstraZeneca, and 1 Pfizer sample were collected for examination in order to analyse the contents and identify if undeclared components were present in them.\n\nHere is the list of declared ingredients in each vaccine by the manufacturers –\n\nThe inclusions that are not declared by the manufacturers were the focus for this particular analysis, primarily graphene and carbon-related nanostructures in form of carbon or graphene composites, graphene in association with polyethylene glycol, graphene oxide, iron oxide compounds, and calcite.\n\nThe analysis of all four vial contents identified objects that are similar and have been defined and illustrated within the report individually.\n• Graphene Nano Form with and without fluorescence\n\nThe first sample that was evaluated was the Moderna 01 which was examined by Raman spectroscopy. The investigation clearly showed that all the inclusions within the vaccine have a strong carbon signal with confirmed graphene compositions of some representative forms.\n\nTwo clear signals were obtained from two objects. The flat ribbon-like inclusions exhibited clear graphene spectra integrated with the spectrum of glycol and other minor compounds. The other clear signal was obtained from a calcite microcrystalline form and Carbon composite forms also had a clear graphene signal.\n\nIt is important to point out that some nano amorphous carbon forms showed a clear Graphene signal, however, these forms also exhibited fluorescence which masked the Graphene peak.\n\nParticles that carry the mRNA load were clearly seen and Graphene composite 01 was prominently present even at low resolution and Graphene Nano objects were present in “great abundance.” within the vial sample.\n\nAstraZeneca was the third vaccine that was evaluated for its inclusion, and as it was almost transparent it made “spotting of inherent colours slightly easier”. Under wet microscopic observation, the solution exhibited instantaneous movement of nanoscopic particulate material which when observed closely seemed to be driven by convection current.\n\nWhen dry, the particles exhibited traction movement. In figure, 3.21. the microscopic form is clearly visible as it is lying on top of the solid film while the nanoparticles are still in motion in the background as can be seen by the shifting position of the shadow. A clear output of this mechanism was that as the medium solidified, it became more difficult for the nanoparticles to navigate through the viscous material.\n\nConfirmed inclusions within AstraZeneca were of the presence of Graphene in all the identified representative forms. The carbon composites are of two forms as they are in the Moderna vaccines. These two forms showed distinct graphene signatures. Also, besides Graphene the spectrum is dominated by iron oxide and other forms of carbon associations.\n\nPfizer was the fourth vaccine vial that was evaluated for its inclusions. The pipette specimen showed some extremely interesting inclusions. As the material was sucked into the pipette, distinct translucent to transparent sheets were seen floating about as seen in figure 3.28.\n\nThree of these samples showed carbon composite signatures with possible graphene in. The signals of amorphous carbon-like materials were extremely complex with carbon along with iron oxide and several other compounds in them.\n\nRibbon forms of nearly transparent microforms are found in fair numbers in the slide. These are often half embedded in the solution with one end projecting outside the material. The carbon composites of both form 1 and 2 also are present in great numbers. Form 1 settles on top of the material while form 2 is found at mid-levels of the solidified medium. Graphene nanoforms are present in fair numbers within the slide material along with some scrolls. Figure 3.32. Representative inclusions found within Pfizer vaccine.\n\nThe signals of amorphous carbon-like materials were extremely complex with carbon along with iron oxide and several other compounds in them. The graphene complex 1 is graphene with polyethylene glycol signal forming the bulk of the spectrum. Though, for initial assessments, this study can confirm the presence of graphene in Pfizer.\n\nNotably, one of the samples that was shot, displayed a fair influence of fluorescence.\n\nAll three vaccines commonly employ the self-assembling lipid nanoparticles as drug delivery mechanisms. Where the central find of this project has been the confirmation of the presence of graphene in all four samples, it is important to evaluate this find in the context of the subject itself.\n\nIt is also important to mention, that the source of fluorescence within the samples was unknown while the investigations were underway, and due to tight timescales were not able to be investigated at the time.\n\nAn Open Access review highlighting the toxicity of the graphene family nanoparticles can be viewed here.\n\nIn conclusion, it can be stated that the four samples of vaccines (Moderna 1, Modern 2, AstraZeneca, Pfizer) all contain significant amount of carbon composites, graphene compounds, and iron oxide.\n\nThese ingredients were undeclared by the manufacturers and are absent from the list of ingredients for the vaccines. However, studies show how dangerous the Graphene family is, yet individuals have not been made aware that they are being injected with the deadly substance.\n\nThe lab report can be read in full here.\n\nThis article originally appeared on The Expose.", "opengraph": {"title": "Official U.K. Lab Report Confirms Covid-19 Vaccines Definitely Contain Graphene Oxide", "description": "These ingredients were undeclared by the manufacturers and are absent from the list of ingredients for the vaccines.", "image": "http://www.renegadetribune.com/wp-content/uploads/2021/10/VAERS-Healthy-16-Year-Old-Boy-Dies-During-Online-Class-Following-Second-Pfizer-Covid-19-Vaccine-scaled-e1634464313870.jpeg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/official-u-k-lab-report-confirms-covid-19-vaccines-definitely-contain-graphene-oxide/", "site_name": "Renegade Tribune", "article:published_time": "2022-02-14T13:18:32+00:00", "article:modified_time": "2022-02-14T12:26:51+00:00", "image:width": "810", "image:height": "540"}, "tags": [], "tweets": [], "movies": [], "links": ["http://ukcitizen2021.org/Case_Briefing_Document_and_lab_report_Ref_AUC_101_Report%20.pdf", "http://ukcitizen2021.org/Case_Briefing_Document_and_lab_report_Ref_AUC_101_Report%20.pdf", "http://ukcitizen2021.org/Case_Briefing_Document_and_lab_report_Ref_AUC_101_Report%20.pdf", "http://ukcitizen2021.org/Case_Briefing_Document_and_lab_report_Ref_AUC_101_Report%20.pdf", "https://particleandfibretoxicology.biomedcentral.com/articles/10.1186/s12989-016-0168-y", "https://particleandfibretoxicology.biomedcentral.com/articles/10.1186/s12989-016-0168-y", "http://ukcitizen2021.org/Case_Briefing_Document_and_lab_report_Ref_AUC_101_Report%20.pdf", "https://dailyexpose.uk/2022/02/13/uk-lab-confirms-graphene-in-covid-vaccines/", "http://www.renegadetribune.com/support-with-cryptocurrencies/", "https://gab.com/compose?url=http%3A%2F%2Fwww.renegadetribune.com%2Fofficial-u-k-lab-report-confirms-covid-19-vaccines-definitely-contain-graphene-oxide%2F&text=Official%20U.K.%20Lab%20Report%20Confirms%20Covid-19%20Vaccines%20Definitely%20Contain%20Graphene%20Oxide", "https://parler.com/new-post?message=Official%20U.K.%20Lab%20Report%20Confirms%20Covid-19%20Vaccines%20Definitely%20Contain%20Graphene%20Oxide&url=http%3A%2F%2Fwww.renegadetribune.com%2Fofficial-u-k-lab-report-confirms-covid-19-vaccines-definitely-contain-graphene-oxide%2F", "http://reddit.com/submit?url=http%3A%2F%2Fwww.renegadetribune.com%2Fofficial-u-k-lab-report-confirms-covid-19-vaccines-definitely-contain-graphene-oxide%2F&title=Official%20U.K.%20Lab%20Report%20Confirms%20Covid-19%20Vaccines%20Definitely%20Contain%20Graphene%20Oxide", "https://telegram.me/share/url?url=http%3A%2F%2Fwww.renegadetribune.com%2Fofficial-u-k-lab-report-confirms-covid-19-vaccines-definitely-contain-graphene-oxide%2F&text=Official%20U.K.%20Lab%20Report%20Confirms%20Covid-19%20Vaccines%20Definitely%20Contain%20Graphene%20Oxide", "http://www.renegadetribune.com/official-u-k-lab-report-confirms-covid-19-vaccines-definitely-contain-graphene-oxide/", "https://cash.app/$thekylehunt", "http://www.renegadetribune.com/new-paper-emphasizes-the-dangers-harms-of-mandatory-covid-vaccination-policy/", "http://www.renegadetribune.com/why-you-should-incorporate-fenugreek-in-your-diet/"], "authors": [], "publish_date": "2022-02-14T13:18:32+00:00"}