{"result_id": "260004", "URL": "http://www.renegadetribune.com/20-of-deaths-reported-after-covid-vaccines-related-to-cardiac-disorders-cdc-data-show/", "timestamp": "2023-04-25 16:58:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/20-of-deaths-reported-after-covid-vaccines-related-to-cardiac-disorders-cdc-data-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "20% of Deaths Reported After COVID Vaccines Related to Cardiac Disorders, CDC Data Show", "cleaned_text": "In the U.S., 597 million COVID-19 vaccine doses had been administered as of July 6, including 353 million doses of Pfizer, 225 million doses of Moderna and 19 million doses of Johnson & Johnson (J&J).\n\nOf the 13,604 U.S. deaths reported as of July 8, 15% occurred within 24 hours of vaccination, 19% occurred within 48 hours of vaccination and 58% occurred in people who experienced an onset of symptoms within 48 hours of being vaccinated.\n\nForeign reports are reports foreign subsidiaries send to U.S. vaccine manufacturers. Under U.S. Food and Drug Administration (FDA) regulations, if a manufacturer is notified of a foreign case report that describes an event that is both serious and does not appear on the product’s labeling, the manufacturer is required to submit the report to VAERS.\n\nExcluding “ foreign reports ” to VAERS, 842,576 adverse events , including 13,604 deaths and 85,731 serious injuries , were reported in the U.S. between Dec. 14, 2020, and July 8, 2022.\n\nOf the 29,460 reported deaths, 19,066 cases are attributed to Pfizer’s COVID-19 vaccine, 7,770 cases to Moderna and 2,563 cases to Johnson & Johnson (J&J).\n\nThe data included a total of 29,460 reports of deaths — an increase of 187 over the previous week — and 243,466 serious injuries , including deaths, during the same time period — up 1,566 compared with the previous week.\n\nVAERS is the primary government-funded system for reporting adverse vaccine reactions in the U.S.\n\nThe Centers for Disease Control and Prevention (CDC) today released new data showing a total of 1,341,608 reports of adverse events following COVID-19 vaccines were submitted between Dec. 14, 2020, and July 8, 2022, to the Vaccine Adverse Event Reporting System (VAERS). That’s an increase of 12,473 adverse events over the previous week.\n\nVAERS data released Friday by the Centers for Disease Control and Prevention show 1,341,608 reports of adverse events from all age groups following COVID-19 vaccines, including 29,460 deaths and 243,466 serious injuries between Dec. 14, 2020, and July 8, 2022\n\nEvery Friday, VAERS publishes vaccine injury reports received as of a specified date. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\nHistorically, VAERS has been shown to report only 1% of actual vaccine adverse events.\n\nU.S. VAERS data from Dec. 14, 2020, to July 8, 2022, for 6-month-olds to 5-year-olds show:\n• 2,105 adverse events, including 71 cases rated as serious and 3 reported deaths.\n• 4 reports of myocarditis and pericarditis (heart inflammation).\n\n The CDC uses a narrowed case definition of “myocarditis,” which excludes cases of cardiac arrest, ischemic strokes and deaths due to heart problems that occur before one has the chance to go to the emergency department.\n\nU.S. VAERS data from Dec. 14, 2020, to July 8, 2022, for 5- to 11-year-olds show:\n• 11,868 adverse events, including 305 rated as serious and 8 reported deaths.\n\n The latest reported death (VAERS I.D. #2359520) occurred in an 11-year-old boy from Texas who received two doses of Pfizer’s COVID-19 vaccine. According to his report, the boy died 54 days after his second dose from “COVID-19 infection resulting in Hemorrhagic myocarditis and death.”\n\nU.S. VAERS data from Dec. 14, 2020, to July 8, 2022, for 12- to 17-year-olds show:\n• 32,609 adverse events, including 1,845 rated as serious and 44 reported deaths.\n• 62 reports of anaphylaxis among 12- to 17-year-olds where the reaction was life-threatening, required treatment or resulted in death — with 97% of cases attributed to Pfizer’s vaccine.\n• 656 reports of myocarditis and pericarditis with 644 cases attributed to Pfizer’s vaccine.\n• 166 reports of blood clotting disorders with all cases attributed to Pfizer. VAERS reported 167 cases of blood clotting disorders in the 12- to 17-year-old age group last week.\n• 20 cases of postural orthostatic tachycardia syndrome (POTS) with all cases attributed to Pfizer’s vaccine.\n\nU.S. VAERS data from Dec. 14, 2020, to July 8, 2022, for all age groups combined, show:\n• 20% of deaths were related to cardiac disorders.\n• 54% of those who died were male, 41% were female and the remaining death reports did not include the gender of the deceased.\n• The average age of death was 73.\n• As of July 8, 5,643 pregnant women reported adverse events related to COVID-19 vaccines, including 1,765 reports of miscarriage or premature birth.\n• Of the 3,624 cases of Bell’s Palsy reported, 51% were attributed to Pfizer vaccinations, 40% to Moderna and 8% to J&J.\n• 900 reports of Guillain-Barré syndrome, with 42% of cases attributed to Pfizer, 30% to Moderna and 27% to J&J.\n• 2,291 reports of anaphylaxis where the reaction was life-threatening, required treatment or resulted in death.\n• 14,200 reports of blood-clotting disorders in the U.S. Of those, 6,348 reports were attributed to Pfizer, 5,088 reports to Moderna and 2,717 reports to J&J.\n• 4,263 cases of myocarditis and pericarditis with 2,612 cases attributed to Pfizer, 1,448 cases to Moderna and 187 cases to J&J.\n• 14 cases of Creutzfeldt-Jakob disease with 8 cases attributed Pfizer, 5 cases to Moderna and 1 case to J&J.\n• 269 cases of POTS with 165 cases attributed to Pfizer, 86 cases to Moderna and 17 cases to J&J.\n\nChildren’s Health Defense (CHD) asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.\n\nThe FDA on Wednesday granted Emergency Use Authorization (EUA) to the Novavax COVID-19 vaccine for adults 18 and over.\n\nThe EUA is for a two-dose primary series targeting the original Wuhan SARS-CoV-2 virus — limiting the vaccine’s use, as about two-thirds of Americans already have completed a primary series of either the Pfizer, Moderna or J&J vaccines.\n\nThe CDC still needs to sign off on the Novavax vaccine before pharmacies and other healthcare providers can start administering the product.\n\nThe Biden administration on Monday announced a deal with Novavax to purchase 3.2 million doses of the vaccine contingent on both the FDA and CDC signing off on the new shot.\n\nThe Novavax vaccine relies on a protein-based technology used for decades, leading some media outlets to portray it as a “traditional” vaccine compared with other COVID-19 vaccines that use newer technologies — which might make it appeal to unvaccinated people who are allergic to components of the mRNA vaccines, or just skeptical of the newer technologies.\n\nBut according to Dr. Meryl Nass, an internist with a special interest in vaccine-induced illnesses, chronic fatigue syndrome and toxicology, the media’s portrayal of Novavax as a more traditional vaccine is not accurate.\n\nNass, a member of the CHD scientific advisory committee, pointed out that the Novavax shot contains a novel adjuvant, Matrix-M, “so it is not really an old-fashioned shot.”\n\nNass raised safety concerns specific to the adjuvant, while others voiced concerns about Novavax being linked to heart inflammation and blood clots, and the fact that the vaccine was designed for use against the original Wuhan strain of SARS-CoV-2 — not the Omicron variants that are dominant today.\n\nIn a move CHD President Mary Holland called “head-spinning,” the FDA on July 10 granted full approval of Pfizer-BioNTech’s Comirnaty COVID-19 vaccine for adolescents 12 through 15 years old.\n\nIn an FDA press release, the agency said full approval of Comirnaty follows a “rigorous analysis and evaluation of the safety and effectiveness data,” and the Pfizer-BioNTech vaccine “has been, and will continue to be authorized for emergency use in this age group since May 2021.”\n\nPfizer’s press release announcing the approval said the Comirnaty vaccine has been available under EUA since May 2021 for the adolescent age group.\n\nYet, Comirnaty is not available in the U.S for any age group and is not the same formula as the Pfizer-BioNTech vaccine currently authorized under EUA and being distributed as a “fully approved” vaccine.\n\nPfizer-BioNTech COVID-19 vaccine documents released in July by the FDA reveal three more reports of deaths among vaccine trial participants and further instances of Pfizer downplaying serious adverse events sustained by participants and listing the injuries as “not related” to the vaccine.\n\nOf the approximately 80,000 pages released this month, a 3,611-page “confidential” document contains information about clinical trial participants who died, sustained adverse events during the trial or contracted COVID-19 during the trial.\n\nIn all three cases of reported deaths, the investigator ruled out the possibility that the deaths were related to Pfizer’s vaccines.\n\nOne instance pertains to a 56-year-old white female who suffered cardiac arrest within two months of her second Pfizer dose. The second reported death involves a 60-year-old white male who received one dose of the vaccine and died within three days of atherosclerotic disease. The participant’s death was attributed to a “suspected” cause, while the possibility that it was vaccine-related in any way was dismissed.\n\nThe third death was listed under the section in the document where trial participants withdrew. A 72-year-old man developed vasovagal syncope after receiving the vaccine, was transferred to the intensive care unit and then withdrawn from the study. He died three days after being withdrawn.\n\nAccording to the documents, investigators attributed the vaccine to serious adverse events in four cases, however, Pfizer disagreed with the investigators’ conclusions in three out of the four cases.\n\nAccording to Alexandra Latypova, an ex-pharmaceutical industry executive, documents obtained from the U.S. Department of Health and Human Services on Moderna’s COVID-19 vaccine suggest the FDA and Moderna colluded to bypass regulatory and scientific standards used to ensure products are safe.\n\nAfter analyzing 699 pages of studies and test results “supposedly used by the FDA to clear Moderna’s mRNA platform-based mRNA-1273, or Spikevax,” Latypova told The Defender she believes U.S. health agencies are lying to the public on behalf of vaccine manufacturers and subverting the regulatory and scientific standards of drug safety testing.\n\n“They accepted fraudulent test designs, substitutions of test articles, glaring omissions and whitewashing of serious signs of health damage by the product, then lied to the public on behalf of the manufacturers,” she said.\n\nLatypova disclosed six findings from her assessment of Moderna’s documents raising serious questions about the safety and efficacy of the company’s COVID-19 vaccine, as well as conflicts of interests that she says allowed Moderna to sidestep drug development standards.\n\nTennis champ Djokovic has ‘no plans’ to get vaccinated as US Open tournament nears\n\nTennis champion Novak Djokovic, who last weekend won his fourth straight title at Wimbledon, said he has no plans to get vaccinated in order to bypass restrictions to enter the U.S. in August for the US Open.\n\nDjokovic said he doesn’t think an exemption is “realistically possible.” It’s just a matter of whether or not the U.S. removes the requirement in time for him to attend the tournament, he said.\n\nU.S. COVID-19 vaccination requirements for foreigners bar Djokovic’s entry into the country where he would normally compete at the US Open.\n\nSerbia’s Djokovic, 35, has been dominant at Wimbledon for the past couple of years, according to Tennis World USA. He is regarded by some as the world’s greatest tennis player ever.\n\nPhillies catcher will miss two-game series in Canada rather than comply with vaccine mandate\n\nPhillies catcher J.T. Realmuto said he refuses to get vaccinated against COVID-19, even it if means missing Philadelphia’s two-game series against the Toronto Blue Jays this week.\n\nPlayers who have not been vaccinated against COVID-19 are not allowed to enter Canada due to the country’s restrictions. In addition, players will not be paid for the games they miss as part of Major League Baseball’s new collective bargaining agreement.\n\nRealmuto will lose about $262,000 for missing the series, which he called “a little bit of money,” the Philadelphia Inquirer reported. Realmuto signed a five-year, $115.5 million contract with the Phillies in January 2021.\n\nRealmuto said he is a 31-year-old professional athlete who had COVID-19 several times with mild symptoms. After speaking with doctors, he didn’t think he needed it and wasn’t going to get vaccinated just because he was told to.", "opengraph": {"title": "20% of Deaths Reported After COVID Vaccines Related to Cardiac Disorders, CDC Data Show", "description": "The Centers for Disease Control and Prevention (CDC) today released new data showing a total of 1,341,608 reports of adverse events following COVID-19 vaccines.", "image": "http://www.renegadetribune.com/wp-content/uploads/2022/01/skull-g7dd3d26f9_1280.jpg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/20-of-deaths-reported-after-covid-vaccines-related-to-cardiac-disorders-cdc-data-show/", "site_name": "Renegade Tribune", "article:published_time": "2022-07-29T16:09:52+00:00", "article:modified_time": "2022-07-29T11:06:44+00:00", "image:width": "1280", "image:height": "720"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://childrenshealthdefense.org/defender/autopsies-vaccinating-teens-covid-heartbreaking/", "https://childrenshealthdefense.org/defender/joseph-keating-autopsy-death-myocarditis-pfizer-covid-vaccine/", "https://www.stroke.org/en/about-stroke/types-of-stroke/ischemic-stroke-clots", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+artery+thrombosis+%2810008092%29&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Pulmonary+venous+thrombosis+%2810037459%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Seizure+%2810039906%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=2359520", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+artery+thrombosis+%2810008092%29&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Pulmonary+venous+thrombosis+%2810037459%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Seizure+%2810039906%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Anaphylactic+reaction+%2810002198%29&SYMPTOMS%5b%5d=Anaphylactic+shock+%2810002199%29&SYMPTOMS%5b%5d=Anaphylactoid+reaction+%2810002216%29&SYMPTOMS%5b%5d=Anaphylactoid+shock+%2810063119%29&SYMPTOMS%5b%5d=Anaphylaxis+prophylaxis+%2810049090%29&SYMPTOMS%5b%5d=Anaphylaxis+treatment+%2810002222%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Anaphylactic+reaction+%2810002198%29&SYMPTOMS%5b%5d=Anaphylactic+shock+%2810002199%29&SYMPTOMS%5b%5d=Anaphylactoid+reaction+%2810002216%29&SYMPTOMS%5b%5d=Anaphylactoid+shock+%2810063119%29&SYMPTOMS%5b%5d=Anaphylaxis+prophylaxis+%2810049090%29&SYMPTOMS%5b%5d=Anaphylaxis+treatment+%2810002222%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+artery+thrombosis+%2810008092%29&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Pulmonary+venous+thrombosis+%2810037459%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS%5b%5d=Abnormal+labour+%2810000153%29&SYMPTOMS%5b%5d=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS%5b%5d=Aborted+pregnancy+%2810000209%29&SYMPTOMS%5b%5d=Abortion+%2810000210%29&SYMPTOMS%5b%5d=Abortion+complete+%2810061614%29&SYMPTOMS%5b%5d=Abortion+early+%2810052846%29&SYMPTOMS%5b%5d=Abortion+spontaneous+%2810000234%29&SYMPTOMS%5b%5d=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS%5b%5d=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS%5b%5d=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS%5b%5d=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS%5b%5d=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS%5b%5d=Foetal+damage+%2810016852%29&SYMPTOMS%5b%5d=Foetal+death+%2810055690%29&SYMPTOMS%5b%5d=Foetal+disorder+%2810061157%29&SYMPTOMS%5b%5d=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS%5b%5d=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS%5b%5d=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS%5b%5d=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS%5b%5d=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS%5b%5d=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS%5b%5d=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS%5b%5d=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS%5b%5d=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS%5b%5d=Foetal+movement+disorder+%2810077576%29&SYMPTOMS%5b%5d=Foetal+movements+decreased+%2810016866%29&SYMPTOMS%5b%5d=Haemorrhage+%2810055798%29&SYMPTOMS%5b%5d=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS%5b%5d=Placental+calcification+%2810082008%29&SYMPTOMS%5b%5d=Placental+disorder+%2810035132%29&SYMPTOMS%5b%5d=Placental+insufficiency+%2810035138%29&SYMPTOMS%5b%5d=Placental+necrosis+%2810035139%29&SYMPTOMS%5b%5d=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS%5b%5d=Placenta+praevia+%2810035119%29&SYMPTOMS%5b%5d=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS%5b%5d=Pregnancy+test+positive+%2810036575%29&SYMPTOMS%5b%5d=Premature+baby+%2810036590%29&SYMPTOMS%5b%5d=Premature", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Aborted+pregnancy+%2810000209%29&SYMPTOMS%5b%5d=Abortion+%2810000210%29&SYMPTOMS%5b%5d=Abortion+spontaneous+%2810000234%29&SYMPTOMS%5b%5d=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS%5b%5d=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS%5b%5d=Abortion+threatened+%2810000242%29&SYMPTOMS%5b%5d=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS%5b%5d=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS%5b%5d=Foetal+damage+%2810016852%29&SYMPTOMS%5b%5d=Foetal+death+%2810055690%29&SYMPTOMS%5b%5d=Foetal+disorder+%2810061157%29&SYMPTOMS%5b%5d=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS%5b%5d=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS%5b%5d=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS%5b%5d=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS%5b%5d=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS%5b%5d=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS%5b%5d=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS%5b%5d=Foetal+hypokinesia+%2810068461%29&SYMPTOMS%5b%5d=Foetal+malformation+%2810060919%29&SYMPTOMS%5b%5d=Foetal+malpresentation+%2810058013%29&SYMPTOMS%5b%5d=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS%5b%5d=Foetal+movement+disorder+%2810077576%29&SYMPTOMS%5b%5d=Foetal+movements+decreased+%2810016866%29&SYMPTOMS%5b%5d=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS%5b%5d=Placental+disorder+%2810035132%29&SYMPTOMS%5b%5d=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS%5b%5d=Premature+baby+%2810036590%29&SYMPTOMS%5b%5d=Premature+baby+death+%2810076700%29&SYMPTOMS%5b%5d=Premature+delivery+%2810036595%29&SYMPTOMS%5b%5d=Premature+labour+%2810036600%29&SYMPTOMS%5b%5d=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS%5b%5d=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS%5b%5d=Stillbirth+%2810042062%29&SYMPTOMS%5b%5d=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Anaphylactic+reaction+%2810002198%29&SYMPTOMS%5b%5d=Anaphylactic+shock+%2810002199%29&SYMPTOMS%5b%5d=Anaphylactoid+reaction+%2810002216%29&SYMPTOMS%5b%5d=Anaphylactoid+shock+%2810063119%29&SYMPTOMS%5b%5d=Anaphylaxis+prophylaxis+%2810049090%29&SYMPTOMS%5b%5d=Anaphylaxis+treatment+%2810002222%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Myocardial+infarction+%2810028596%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Creutzfeldt-Jakob+disease+%2810011384%29&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Creutzfeldt-Jakob+disease+%2810011384%29&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Creutzfeldt-Jakob+disease+%2810011384%29&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Creutzfeldt-Jakob+disease+%2810011384%29&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://childrenshealthdefense.org/defender/fda-authorize-traditional-novavax-covid-vaccine-safety-claims/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.nytimes.com/2022/07/11/science/novavax-covid-vaccine.html", "https://www.cnet.com/health/medical/what-to-know-about-novavax/", "https://childrenshealthdefense.org/defender/jeanie-evans-died-allergic-reaction-moderna-covid-vaccine-autopsy/", "https://merylnass.substack.com/p/i-have-to-eat-my-words-sorta-the", "https://childrenshealthdefense.org/defender/fda-grants-full-approval-pfizer-comirnaty-vaccine-adolescents/", "https://www.fda.gov/news-events/press-announcements/fda-roundup-july-8-2022", "https://www.trialsitenews.com/a/fda-signs-off-on-new-formula-of-pfizers-covid-vaccine-for-kids-and-adults-what-about-safety-or-efficacy-studies", "https://childrenshealthdefense.org/defender/mainstream-media-fda-approval-pfizer-vaccine/", "https://phmpt.org/pfizers-documents/", "https://childrenshealthdefense.org/defender/deaths-injuries-pfizer-vaccine-trial-document-dump/", "https://pdata0916.s3.us-east-2.amazonaws.com/pdocs/070122/125742_S1_M5_5351_c4591001-fa-interim-narrative-sensitive.pdf", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.mayoclinic.org/diseases-conditions/arteriosclerosis-atherosclerosis/symptoms-causes/syc-20350569", "https://childrenshealthdefense.org/defender/fda-moderna-bypass-covid-vaccine-safety-standards-documents/", "https://childrenshealthdefense.org/defender/fda-cdc-approval-moderna-spikevax-vaccine/", "https://childrenshealthdefense.org/defender/fda-moderna-bypass-covid-vaccine-safety-standards-documents/", "https://childrenshealthdefense.org/defender/covid-vaccine-tennis-champion-novak-djokovic-us-open-tournament/", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/proof-of-vaccination.html", "https://www.tennisworldusa.org/tennis/news/Novak_Djokovic/117078/alex-corretja-reflects-on-novak-djokovic-impressive-run-to-wimbledon-title-/", "https://childrenshealthdefense.org/defender/covid-vaccine-tennis-champion-novak-djokovic-us-open-tournament/", "https://childrenshealthdefense.org/defender/canada-covid-vaccine-phillies-catcher-jt-realmuto/", "https://www.inquirer.com/sports/phillies-realmuto-bohm-nola-gibson-covid--20220712.html"], "authors": [], "publish_date": "2022-07-29T16:09:52+00:00"}