{"result_id": "260042", "URL": "http://www.renegadetribune.com/military-whistleblowers-sound-alarm-on-devastating-consequences-of-pentagons-vaccine-mandate/", "timestamp": "2023-04-25 16:59:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/military-whistleblowers-sound-alarm-on-devastating-consequences-of-pentagons-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Military Whistleblowers Sound Alarm On 'Devastating' Consequences Of Pentagon’s Vaccine Mandate", "cleaned_text": "Whistleblower service members are speaking out on behalf of thousands of service members whose careers have been jeopardized for objecting to Secretary of Defense Lloyd Austin’s 2021 military COVID-19 vaccine mandate. They’ve expressed concern over the vaccine mandate’s legality, as well as its health effects.\n\nAlongside three members of the Armed Forces, attorney and former Marine Corps Capt. Dale Saran participated in a live-streamed military whistleblowers press conference on Oct. 18 to highlight concerns about the military vaccine mandate. The video has garnered more than 40,000 views, to date.\n\nSaran once defended service members involved in a fight against the Pentagon’s mandatory anthrax vaccination program. He is also challenging the Pentagon’s vaccine mandate in a class-action lawsuit. He noted in the press conference the current case bears striking similarities to the legal battle against the anthrax vaccine program almost 20 years ago.\n\nSaran said that “at the heart of most of the legal claims” against today’s military COVID-19 vaccine mandate is the fact that “there is no licensed vaccine” available to service members.\n\nThe attorney and many service members argue that the Pentagon’s vaccine mandate, which covers “COVID-19 vaccines that receive full licensure from the Food and Drug Administration (FDA), in accordance with FDA-approved labeling and guidance,” does not apply to any vaccines issued under emergency use authorization (EUA), such as the Pfizer-BioNTech vaccine.\n\nThey say that the military has mainly offered service members EUA Pfizer-BioNTech vaccine, rather than the FDA-approved Cominarty vaccine, and thus cannot compel personnel to take them. They also argue that a Pentagon policy that says the Cominarty and EUA Pfizer-BioNTech vaccines are interchangeable is illegal.\n\nSaran said the continued push to vaccinate service members is “done just to break them.”\n\nAt the press conference, Air Force First Lieutenant John Bowes, an F-16 student pilot, pointed out various reports that have been sent to congress concerning the military vaccine mandate’s effect on military readiness and the health of service members.\n\n“We were there to advocate for the 80,000 service members who aren’t being heard,” Bowes told The Epoch Times after the conference.\n\n“We’re making a call for help to both Congress and the American people to stand up for us and give us some protection from the Department of Defense so that we can continue to serve—which is all we want to do,” he said.\n\nThe press conference allowed active-duty service members and “an exceptional lawyer” to speak out against the military vaccine mandate, Bowes said. And according to him, each is risking their career in order to bring awareness to “the absolutely dire problem that we’re facing right now.”\n\nLike Saran, Bowes considers the current COVID-19 vaccine mandate to be “almost a carbon copy of what happened with anthrax nearly two decades ago.” He added that “anthrax ended up being ruled as a vaccine that couldn’t be forced on service members because it was experimental.”\n\n“It’s shocking to see this exact same thing happen 20 years later.”\n\nBowes added that the whistleblower service members involved in the press conference “will continue to respectfully bring up the devasting consequences [of the vaccine mandate] to both national security and the health and safety of our force at every opportunity they are given.”\n\nThe officer emphasized that his views do not reflect those of the Department of Defense or Air Force.\n\nNavy Cmdr. Olivia Degenkolb, who has served for 20 years, also participated in the press conference.\n\nEarly on, Degenkolb had “significant concerns” regarding the vaccine’s effect on fertility and its carcinogenicity prior to the military vaccine mandate, which she said were dismissed by military medical staff, she told The Epoch Times, emphasizing that her views do not represent those of the Department of Defense or Navy.\n\nShe pointed out that the Comirnaty package insert reads: “COMIRNATY has not been evaluated for the potential to cause carcinogenicity, genotoxicity, or impairment of male fertility. In a developmental toxicity study in rats with COMIRNATY there were no vaccine-related effects on female fertility”.\n\nIn addition to health concerns, Degenkolb also raised concerns with military leadership about the legality of mandating EUA products, as well as the legality of compelling COVID-19 testing, and mask wearing.\n\n“These EUA products are not formally licensed by the FDA and by federal law, they cannot be mandated,” she said.\n\nShe said the Navy ignored those concerns.\n\nDegenkolb’s initial religious accommodation request was denied in December 2021, but her appeal is still pending. Her religious and legal objections have resulted in the loss of an assignment in China, denial of leave, loss of training opportunities, lack of access to her family’s belongings, and other family hardships, she said.\n\n“On top of that, I received a career-ending performance evaluation in August 2022 and have been recommended for a show cause board to terminate my service with the Navy,” Degenkolb said.\n\nLike others who oppose the vaccine mandate, Degenkolb said that the policy has harmed military readiness, at a time when the United States faces increased threats.", "opengraph": {"title": "Military Whistleblowers Sound Alarm On 'Devastating' Consequences Of Pentagon’s Vaccine Mandate", "description": "Like others who oppose the vaccine mandate, Degenkolb said that the policy has harmed military readiness, at a time when the United States faces increased threats.", "image": "http://www.renegadetribune.com/wp-content/uploads/2022/10/Screen-Shot-2022-10-26-at-8.01.29-AM.png", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/military-whistleblowers-sound-alarm-on-devastating-consequences-of-pentagons-vaccine-mandate/", "site_name": "Renegade Tribune", "article:published_time": "2022-10-26T23:22:10+00:00", "article:modified_time": "2022-10-27T01:17:16+00:00", "image:width": "930", "image:height": "543"}, "tags": [], "tweets": [], "movies": [], "links": ["https://rumble.com/v1olu7o-military-whistleblowers-press-conference.html", "https://www.theepochtimes.com/pentagons-vaccine-mandate-challenged-in-class-action-lawsuit_4512615.html", "https://www.fda.gov/media/154834/download", "https://www.theepochtimes.com/military-whistleblowers-sound-alarm-on-devastating-consequences-of-pentagons-vaccine-mandate_4815284.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": "2022-10-26T23:22:10+00:00"}