{"result_id": "260014", "URL": "http://www.renegadetribune.com/deadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators/", "timestamp": "2023-04-25 16:58:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/deadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Deadline Passes For Pfizer To Submit Results Of Post-Vaccination Heart Inflammation Study To US Regulators", "cleaned_text": "By Zachary Stieber via The Epoch Times (emphasis ZH)\n\nThe deadline has passed for Pfizer to submit the results of a study exploring the frequency of heart inflammation following receipt of the company’s COVID-19 vaccine.\n\nPfizer was required by the U.S. and Food and Drug Administration (FDA) to conduct multiple studies on its vaccine after the FDA approved the shot in August 2021 because regulators determined that without the studies, there would not be sufficient data to assess the “known serious risks of myocarditis and pericarditis,” or heart inflammation and a related condition.\n\nRegulators were also concerned about the potential risk of subclinical myocarditis, or heart inflammation without typical symptoms.\n\nThe FDA told Pfizer to carry out six studies, with various deadlines for completion and reporting final results to the agency. The first final deadline arrived on Dec. 31, 2022.\n\nPfizer was required to submit a report on the study, which was to assess the incidence of subclinical myocarditis following administration of a third dose of Pfizer’s vaccine, or a booster shot, in people aged 16 to 30.\n\nIt’s unclear whether Pfizer met the deadline. The company and the FDA did not respond to requests for comment, and neither have issued any information about the study or its results since the deadline passed.\n\nAccording to the FDA, Pfizer had until June 30, 2022, to complete the study and then another six months to prepare and submit the final results.\n\nIn a Dec. 8, 2022, memorandum explaining why the FDA authorized Pfizer’s bivalent booster without any clinical data, FDA officials noted that Pfizer was “conducting additional safety-related post-authorization/post-marketing studies for the PfizerBioNTech COVID-19 Vaccine, including post-marketing requirements to assess known serious serious risks of myocarditis and pericarditis and an unexpected serious risk of subclinical myocarditis..”\n\nThe results of the study should be shared promptly, according to Jessica Adams, a former regulatory officer at the FDA.\n\n“We shouldn’t have to ask or demand this information. We should expect that it’d be promptly shared by default,” Adams wrote on Twitter.\n\nDr. Janet Woodcock, the agency’s principal deputy director, told Adams in an email that the FDA is “not allowed to comment on potential actions on regulated products.”\n\nIt’s not clear how reporting results on a study relates to potential regulatory actions.\n\nIn light of the growing amount of evidence related to post-vaccination adverse events, some others are questioning the FDA’s delay in sharing information on the study.\n\n“Why are FDA officials dragging their feet on making Pfizer’s prospective study data on subclinical myocarditis available to the public when evidence has been published in the medical literature that Pfizer’s pre-EUA clinical trials revealed ‘a 36 percent higher risk of serious adverse events in vaccinated participants in comparison to placebo recipients,’” Barbara Loe Fisher, co-founder and president of the National Vaccine Information Center, told The Epoch Times via email.\n\nShe was citing a reanalysis of the original trial data that found vaccinated participants had a higher risk of serious adverse events.\n\n“With 79 percent of Americans having received at least one COVID shot and so many vaccinated young adults, especially physically fit athletes suffering heart attacks and sudden deaths, public health officials should insist that the company with the biggest market share of the COVID vaccine business in the U.S. be completely transparent about what it knows about the biological mechanisms of heart inflammation induced by the mRNA COVID vaccine Pfizer maintains is both safe and effective,” Fisher added.\n\nThe FDA added a warning about myocarditis following Pfizer and Moderna vaccination to patient and health care provider fact sheets in June 2021. Both vaccines utilize messenger RNA (mRNA) technology. Prospective vaccine recipients were told the risk of myocarditis was increased after vaccination, particularly after the second dose of the two-dose primary series.\n\nIf certain symptoms appeared after vaccination, such as chest pain or shortness of breath, people were told to immediately seek medical care.\n\nU.S. authorities, and some officials elsewhere, have since acknowledged that the vaccines cause heart inflammation.\n\n“The current evidence supports a causal association between mRNA COVID-19 vaccination and myocarditis and pericarditis,” Dr. Tom Shimabukuro, a top CDC official, said during a meeting in 2022.\n\nSome cases of the post-vaccination inflammation have ended in death.\n\nSome 5,163 reports of post-vaccination myocarditis, pericarditis, or myopericarditis have been filed with the Vaccine Adverse Event Reporting System (VAERS), a passive early warning system that alerts officials to possible side effects from vaccines. The reports don’t prove a connection with a vaccine but are an undercount of the true number of cases, research has found and authorities have acknowledged.\n\nMore than 800,000 other adverse events following receipt of the Pfizer vaccine have been lodged with the system.\n\nThe FDA also required Moderna to conduct post-approval studies after approving the company’s shot in early 2022.\n\nModerna was told to carry out six studies, the same number as Pfizer, focusing on assessing the incidence of myocarditis and pericarditis, the long-term impact of myocarditis, and the occurrence of subclinical myocarditis.\n\nTwo studies were due to be completed by Dec. 31, 2022, but the deadlines for submission of the results to the FDA aren’t until June 30, 2023.\n\nOther deadlines for the Moderna and Pfizer studies stretch months or even years into the future, including one in 2025 and one in 2028.", "opengraph": {"title": "Deadline Passes For Pfizer To Submit Results Of Post-Vaccination Heart Inflammation Study To US Regulators", "description": "The deadline has passed for Pfizer to submit the results of a study exploring the frequency of heart inflammation following receipt of the company’s COVID-19 vaccine.", "image": "http://www.renegadetribune.com/wp-content/uploads/2023/01/Pfizer-vaccine-Boston-GettyImages-1231204466-870x522-1.jpeg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/deadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators/", "site_name": "Renegade Tribune", "article:published_time": "2023-01-13T20:19:22+00:00", "article:modified_time": "2023-01-13T13:26:18+00:00", "image:width": "870", "image:height": "522"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/deadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators_4974856.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "https://www.documentcloud.org/documents/23569895-fda-approval-letter-to-pfizer", "https://www.theepochtimes.com/t-food-and-drug-administration", "https://www.theepochtimes.com/fda-deviated-from-normal-process-in-pfizer-vaccine-approval-documents-show_4968812.html", "https://www.theepochtimes.com/us-drug-regulators-approve-pfizers-covid-19-vaccine_3961021.html", "https://www.documentcloud.org/documents/23569896-fda-memorandum-on-pfizer-bivalent-booster", "https://www.theepochtimes.com/trial-data-for-newly-authorized-covid-19-boosters-based-on-mice-not-humans_4704068.html", "https://www.theepochtimes.com/vaccinated-at-higher-risk-of-serious-adverse-events-reanalysis-of-original-trial-data_4707356.html", "https://www.theepochtimes.com/fda-adds-warning-about-heart-inflammation-to-covid-19-mrna-vaccines_3876245.html", "https://www.theepochtimes.com/health/heart-inflammation-can-be-lethal-after-covid-19-vaccination-study_4900037.html", "https://vaers.hhs.gov/data/dataguide.html", "http://www.renegadetribune.com/support-with-cryptocurrencies/", "https://gab.com/compose?url=http%3A%2F%2Fwww.renegadetribune.com%2Fdeadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators%2F&text=Deadline%20Passes%20For%20Pfizer%20To%20Submit%20Results%20Of%20Post-Vaccination%20Heart%20Inflammation%20Study%20To%20US%20Regulators", "https://parler.com/new-post?message=Deadline%20Passes%20For%20Pfizer%20To%20Submit%20Results%20Of%20Post-Vaccination%20Heart%20Inflammation%20Study%20To%20US%20Regulators&url=http%3A%2F%2Fwww.renegadetribune.com%2Fdeadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators%2F", "http://reddit.com/submit?url=http%3A%2F%2Fwww.renegadetribune.com%2Fdeadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators%2F&title=Deadline%20Passes%20For%20Pfizer%20To%20Submit%20Results%20Of%20Post-Vaccination%20Heart%20Inflammation%20Study%20To%20US%20Regulators", "https://telegram.me/share/url?url=http%3A%2F%2Fwww.renegadetribune.com%2Fdeadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators%2F&text=Deadline%20Passes%20For%20Pfizer%20To%20Submit%20Results%20Of%20Post-Vaccination%20Heart%20Inflammation%20Study%20To%20US%20Regulators", "http://www.renegadetribune.com/deadline-passes-for-pfizer-to-submit-results-of-post-vaccination-heart-inflammation-study-to-us-regulators/", "https://cash.app/$thekylehunt", "http://www.renegadetribune.com/second-high-school-student-dies-suddenly-within-a-week-in-las-vegas-after-suffering-cardiac-arrest/", "http://www.renegadetribune.com/20-year-old-colorado-college-tennis-player-dies-unexpectedly-in-his-sleep/"], "authors": [], "publish_date": "2023-01-13T20:19:22+00:00"}