{"result_id": "260041", "URL": "http://www.renegadetribune.com/confidential-pfizer-documents-state-covid-19-vaccine-associated-enhanced-disease-is-a-real-possibility/", "timestamp": "2023-04-25 16:59:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/confidential-pfizer-documents-state-covid-19-vaccine-associated-enhanced-disease-is-a-real-possibility/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Confidential Pfizer Documents State ‘Covid-19 Vaccine-Associated Enhanced Disease Is a Real Possibility’", "cleaned_text": "Pfizer, the company hit with the largest healthcare fraud settlement and criminal fine to date in 2009; which also happens to be the same company behind the first every mRNA gene therapy injection administered to the general public under emergency use authorisation in the name of Covid-19, has admitted in confidential documents, that it desperately tried to keep from going public, that its Covid-19 mRNA gene therapy may cause Vaccine-Associated Enhanced Disease.\n\nSince the year 2000, Pfizer have been hit with fines to the amount of at least £7.5 billion, including a single £331.5 million fine for kickbacks and bribery offences, £1.1 billion in fines for false claims offences, and a record breaking individual £1.7 billion fine in 2009 for engaging in fraud by mispromoting a now withdrawn painkiller.\n\nBut despite all this the company was still trusted enough by medicine regulators around the world to be granted emerged use authorisation for its experimental Covid-19 injection. Perhaps the company may be incurring some more large fines for kickbacks and bribery offences in the near future?\n\nBut we doubt they’ll care much when they made approximately $36 billion dollars in 2021 thanks to Governments worldwide using the hardworking tax payers money to purchase enough doses of their Covid-19 “vaccine” to vaccinate every citizen seven times.\n\nNow, according to confidential documents authored by Pfizer that it wanted to deperately keep secret, the company hasn’t just caused damage to the public purse, it appears it has also caused damage to the publics health, because Pfizer admit that Vaccine-Associated Enhanced Disease is a a very real theoretical risk for its Covid-19 vaccine.\n\nThe confidential document titled ‘5.3.6 CUMULATIVE ANALYSIS OF POST-AUTHORIZATION ADVERSE EVENT\n\n REPORTS OF PF-07302048 (BNT162B2) RECEIVED THROUGH 28-FEB-2021‘, was submitted by Pfizer-BioNTech as part of its Biological License Application (BLA) to the U.S. Federal Drug Administration (FDA)\n\nTable 5, found on page 11 of the document shows an ‘Important Potential Risk’, and that risk is listed as ‘Vaccine-Associated Enhanced Disease (VAED), including Vaccine-Associated Enhanced Reporatory Disease (VAERD)’.\n\nPfizer writes in the description section that –\n\nConsidering the fact this document was approved on 30th April 2021, and based on data on adverse reactions received up to 28th Feb 2021, this sentence should concern even the most loyal pharmaceutical worshippers.\n\nIn the UK the Pfizer jab was granted emergency use authorisation on the 8th Dec 20, and the first injection was administered the following day. By April 2021, 5 months later, Pfizer was admitting that it did not have a clue if its Covid-19 injections caused VAED, and that they will only know once they have more data.\n\nThis confirms in black and white that the general public have been taking part in possibly the largest experiment ever conducted, and it’s an experiment that has made a select few extremely rich.\n\nPfizer continues in the description section to state –\n\nWhat Pfizer is admitting here is that up to 28th Feb 21, 138 people had reported adverse events that were markers of Vaccine-Associated Enhanced Disease.\n\nThese markers were limited to –\n\nAccording to Pfizer those 138 cases reporting 317 VAED relevant events included –\n• and 9 incidents from 9 different countries\n\nOf the 138 cases, 71 were deemed ‘medically significant’ of which 8 were left with serious disabilities Non-fatal / non-life threatening hospitalisation was required for 16 cases of which 1 was left with serious disabilities. 17 cases were deemed life threatening of which 7 were deemed serious for hospitalisation, and 38 cases resulted in death.\n\nAt the time of the report which was based on data submitted up to the end of February 2021, apart from the 38 cases that were known to have resulted in death at the time, just a further 26 cases were listed as resolved, with 65 not resolved, 1 not resolved with sequelae, and 8 with unknown outcomes.\n\nPfizer go on to state in the confidential document that –\n\nPfizer concludes in its document that –\n\nThis seems to be an admittance from Pfizer that its vaccine isn’t very good at protecting recipients of its experimental It’s important to remember that these injections do not prevent infection or transmission, they are only supposed to protect against hospitalisation and death. Therefore, with 75 of the 101 confirmed Covid-19 cases being severe (69%), this seems to be an admittance from Pfizer that its vaccine isn’t very good at actually doing that.\n\nHere we have Pfizer admitting that Vaccine-Associated Enhanced Disease is a theoretical risk associated with its experimental Covid-19 gene therapy, which has been injected into the arms of hundreds of millions of people around the world several times since December 2020.\n\nThere are no appropriate words that could possibly convey how unbelievably stupid and dangerous the decision to give this injection to millions of people, including children was and still is.\n\nThe problem Pfizer now has, is that real-world data from various Public Health institutions around the world shows that the risk of Vaccine-Associated Enhanced Disease is no longer theoretical, it’s been occurring en masse since at least December 2021.\n\nOne example of this is data published by Public Health Scotland which shows that the fully vaccinated are up to 4 times more likely to die of Covid-19 than the unvaccinated, suggesting Vaccine-Associated Enhanced Disease is to blame.\n\nThe following graph shows the age standardised Covid-19 death rates per 100,000 individuals by vaccination status in Scotland. The data has been extracted from table 15, found on page 50 of the PHS Covid-19 Statistical report published Wednesday 26th Jan 22.\n\nThe highest death-rate in the past month among the fully vaccinated was recorded as 14.05 per 100,000 individuals in the week beginning 8th Jan 22.\n\nBut at the same time the rate per 100,000 unvaccinated individuals was recorded as being 10.4. Meaning during this week the fully vaccinated were statistically 1.4 times more likely to die of Covid-19 than the unvaccinated.\n\nHowever, the most concerning figures came in the week beginning 18th Dec 21. During these seven days the death-rate per 100,000 was recorded as 6.55 in the fully vaccinated, but just 1.69 in the unvaccinated. Therefore, during this week the fully vaccinated were statistically 4 times more likely to die of Covid-19 than the not-vaccinated.\n\nThe 4 week average age-standardised death rates per 100,000 individuals equates to 6.2 among the not-vaccinated, but 10 among the fully vaccinated, meaning on average the fully vaccinated have been 1.6 times more likely to die of Covid-19 than the not-vaccinated between 18th Dec 21 and 14th Jan 22.\n\nIf Vaccine-Associated Enhanced Disease leading to antibody-dependent enhancement is not to blame for these figures then can somebody please explain what is?", "opengraph": {"title": "Confidential Pfizer Documents State ‘Covid-19 Vaccine-Associated Enhanced Disease Is a Real Possibility’", "description": "This confirms in black and white that the general public have been taking part in possibly the largest experiment ever conducted, and it’s an experiment that has made a select few extremely rich.", "image": "http://www.renegadetribune.com/wp-content/uploads/2021/10/VAERS-Healthy-16-Year-Old-Boy-Dies-During-Online-Class-Following-Second-Pfizer-Covid-19-Vaccine-scaled-e1634464313870.jpeg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/confidential-pfizer-documents-state-covid-19-vaccine-associated-enhanced-disease-is-a-real-possibility/", "site_name": "Renegade Tribune", "article:published_time": "2022-03-05T17:18:35+00:00", "article:modified_time": "2022-03-05T14:28:00+00:00", "image:width": "810", "image:height": "540"}, "tags": [], "tweets": [], "movies": [], "links": ["https://violationtracker.goodjobsfirst.org/prog.php?parent=pfizer", "https://violationtracker.goodjobsfirst.org/prog.php?parent=pfizer", "https://drtrozzi.org/wp-content/uploads/2022/01/Pfizer-Cumulative-Analysis-of-Post-authorization-Adverse-Event-Reports.pdf", "https://drtrozzi.org/wp-content/uploads/2022/01/Pfizer-Cumulative-Analysis-of-Post-authorization-Adverse-Event-Reports.pdf", "https://drtrozzi.org/wp-content/uploads/2022/01/Pfizer-Cumulative-Analysis-of-Post-authorization-Adverse-Event-Reports.pdf", "https://drtrozzi.org/wp-content/uploads/2022/01/Pfizer-Cumulative-Analysis-of-Post-authorization-Adverse-Event-Reports.pdf", "https://drtrozzi.org/wp-content/uploads/2022/01/Pfizer-Cumulative-Analysis-of-Post-authorization-Adverse-Event-Reports.pdf", "https://drtrozzi.org/wp-content/uploads/2022/01/Pfizer-Cumulative-Analysis-of-Post-authorization-Adverse-Event-Reports.pdf", "https://dailyexpose.uk/2022/01/23/world-government-data-shows-covid-vaccinated-suffering-ade/", "https://dailyexpose.uk/2022/01/27/bbc-news-wont-tell-you-vaccinated-suffering-ade/", "https://publichealthscotland.scot/media/11318/22-01-26-covid19-winter_publication_report.pdf", "https://publichealthscotland.scot/publications/covid-19-statistical-report/covid-19-statistical-report-26-january-2022/"], "authors": [], "publish_date": "2022-03-05T17:18:35+00:00"}