{"result_id": "260044", "URL": "http://www.renegadetribune.com/researching-for-the-truth-about-vaccination-programs-in-the-third-reich/", "timestamp": "2023-04-25 16:59:53 CEST+0200", "meta": {"description": "German health authorities introduced vaccination programmes slowly compared to international standards (for the following see Suess 1998b, pp. 241–250). Until 1939–1940 German health authorities still favoured older forms of state intervention, relying on isolation and disinfection. After 1939, immunisation programmes were conducted at the local level, and only in the fall of 1941 did the Reich ministry of the interior finally recommend that communities experiencing diphtheria epidemics carry out vaccination programmes.", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/?p=127342", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Researching For The Truth About Vaccination Programs In The Third Reich", "cleaned_text": "Doing some research for the VAXX Report 2020 I stumbled upon this information regarding vaccine programs during the Third Reich. I remember sending an email to a well-known radio host asking her if she had any further information on the subject. She told me that she did not, though she congratulated me on my findings. I also sent same email to Charles Giuliani for the sake of historical accuracy in the aforementioned report.\n\nThe excerpt next is taken from the PDF “Autarchy, Market Disintegration, and Health: The Mortality and Nutritional Crisis in Nazi Germany, 1933-1937” by Jörg Baten and Andrea Wagner (pages 11 to 12 | 13/14 on PDF) which can be downloaded HERE, or directly from the Renegade Tribune’s database. Notice that the two authors of this research are not Hitler fans by any stretch.\n\n“As mentioned above, morbidity rates from diphtheria increased after 1925 in Germany, as in many other countries. However, German health authorities introduced vaccination programmes slowly compared to international standards (for the following see Suess 1998b, pp. 241–250). Until 1939–1940 German health authorities still favoured older forms of state intervention, relying on isolation and disinfection. After 1939, immunisation programmes were conducted at the local level, and only in the fall of 1941 did the Reich ministry of the interior finally recommend that communities experiencing diphtheria epidemics carry out vaccination programmes. In contrast, countries such as the United States had introduced already in the 1930s immunisation programmes with a new diphtheria toxoid that was available in Germany by 1936. However, it took another few years for the vaccine to be administered on a broad scale.”\n\nHardly a plan of “mandatory vaccines” if we compare it with other countries such as the UK and The USA during that time I’d say.\n\nHere there is an article from The National Library of Medicine from which I extracted this excerpt:\n\nWhich means that vaccination laws already existed way before the Third Reich (just like with gun control laws). Many people in Germany know that the most serious mandatory-vaccination period in German history was during the FRG (during the Cold War Era so-called).\n\nJust like many other people reading this I have seen a rise in incriminatory comparisons between the current “elites”, pushing their mandatory vaccination agenda, and those “evil-Nazis” when in reality as we have seen history proofs that the Third Reich was extremely lax as for “vaccination programmes” was concerned (to the point of these two authors in the pamphlet making the Third Reich look like “vaccine-incompetent” in my view). Why don’t these people ever mention the Swine Flu vaccine program of 1976 in which American soldiers died as guinea pigs and the health of thousands of American citizens was damaged for life? Were “the Nazis” behind that too?\n\nMeanwhile in the US during WWII:\n\nI simply challenge these “truth-tellers” -who like comparing the current plandemic with whatever happened during the Third Reich- to show me documented proof of “Nazis” pushing massive vaccination programs on their population like the so-called “authorities” of the day did back in the US during WWII and the current “authorities” all over the place are doing right now.\n\nOf course this does not matter because historical accuracy does not matter anymore. This is the same worn-out smear campaign of atrocity propaganda against Germans. It’s disgusting.\n\nSo I will leave it at that. I have contributed with my findings (which I admit are not that much anyway) using basic mainstream sources. I reckon I could still be far from the real truth though. Regardless I would invite people who have done a much more extensive research than me on this subject to contribute with whatever finds they might have. Of course citing sources will be strictly required as anyone can come up with made up stories in the comment section.\n\nI’m currently working (albeit at a very slow pace) on what is going to be an “update” on the VAXX Report this year. For those who have not gotten a copy of this PDF yet I would recommend to download and share it far and wide whenever the situation arises. Have a good one.", "opengraph": {"title": "Researching For The Truth About Vaccination Programs In The Third Reich", "description": "German health authorities introduced vaccination programmes slowly compared to international standards (for the following see Suess 1998b, pp. 241–250). Until 1939–1940 German health authorities still favoured older forms of state intervention, relying on isolation and disinfection. After 1939, immunisation programmes were conducted at the local level, and only in the fall of 1941 did the Reich ministry of the interior finally recommend that communities experiencing diphtheria epidemics carry out vaccination programmes.", "image": "http://www.renegadetribune.com/wp-content/uploads/2021/01/Adolf-Hitler-with-children-at-the-Berghof-his-alpine-home-of-choice-public-domain.jpeg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/?p=127342", "site_name": "Renegade Tribune", "article:author": "https://www.facebook.com/JBelenger", "article:published_time": "2021-01-20T23:29:14+00:00", "article:modified_time": "2021-01-20T12:59:30+00:00", "image:width": "1024", "image:height": "640"}, "tags": ["swine flu", "Third Reich", "Federal Republic of Germany", "German Democratic Republic", "vaccines", "diphtheria"], "tweets": [], "movies": [], "links": ["http://www.renegadetribune.com/the-vaxx-report-2020-free-pdf/", "https://www.ifo.de/DocDL/cesifo_wp800.pdf", "http://www.renegadetribune.com/wp-content/uploads/2021/01/Autarchy-Market-Disintegration-and-Health-The-Mortality-and-Nutritional-Crisis-in-Nazi-Germany-1933-1937.pdf", "https://pubmed.ncbi.nlm.nih.gov/23114451/", "https://nationalvanguard.org/2019/09/the-myth-of-gun-control-under-hitler/", "https://www.youtube.com/watch?v=wIFnmuiW7I8", "http://www.renegadetribune.com/wp-content/uploads/2021/01/School-children-waiting-in-line-for-immunization-shots-at-a-child-health-station-in-New-York-City-during-World-War-II.-Library-of-Congress.jpeg", "https://link.springer.com/article/10.1057/palgrave.jphp.3200064", "http://www.renegadetribune.com/the-vaxx-report-2020-free-pdf/", "http://www.renegadetribune.com/support-with-cryptocurrencies/", "https://gab.com/compose?url=http%3A%2F%2Fwww.renegadetribune.com%2Fresearching-for-the-truth-about-vaccination-programs-in-the-third-reich%2F&text=Researching%20For%20The%20Truth%20About%20Vaccination%20Programs%20In%20The%20Third%20Reich", "https://parler.com/new-post?message=Researching%20For%20The%20Truth%20About%20Vaccination%20Programs%20In%20The%20Third%20Reich&url=http%3A%2F%2Fwww.renegadetribune.com%2Fresearching-for-the-truth-about-vaccination-programs-in-the-third-reich%2F", "http://reddit.com/submit?url=http%3A%2F%2Fwww.renegadetribune.com%2Fresearching-for-the-truth-about-vaccination-programs-in-the-third-reich%2F&title=Researching%20For%20The%20Truth%20About%20Vaccination%20Programs%20In%20The%20Third%20Reich", "https://telegram.me/share/url?url=http%3A%2F%2Fwww.renegadetribune.com%2Fresearching-for-the-truth-about-vaccination-programs-in-the-third-reich%2F&text=Researching%20For%20The%20Truth%20About%20Vaccination%20Programs%20In%20The%20Third%20Reich", "http://www.renegadetribune.com/researching-for-the-truth-about-vaccination-programs-in-the-third-reich/", "https://www.facebook.com/BelengersMusik/?ref=settings", "https://twitter.com/J.Belenger", "https://www.facebook.com/JBelenger", "http://www.renegadetribune.com/california-health-officials-call-for-pause-on-moderna-vaccine-batch-due-to-reports-of-allergic-reactions/", "http://www.renegadetribune.com/all-10-of-bidens-high-profile-appointees-are-jews/"], "authors": [], "publish_date": "2021-01-20T23:29:14+00:00"}