{"result_id": "260026", "URL": "http://www.renegadetribune.com/new-survey-reveals-significant-doubts-about-masks-and-vaccines/", "timestamp": "2023-04-25 16:59:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/new-survey-reveals-significant-doubts-about-masks-and-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "New Survey Reveals Significant Doubts About Masks And Vaccines", "cleaned_text": "(ZH) Asked to look back at the pandemic and assess public health recommendations aimed at limiting Covid-19 spread, only about half of Americans now think masks and vaccines have been very effective or extremely effective.\n\nThat’s the finding of a new Pew Research survey of more than 10,000 adults, which provides insights into Americans’ thinking about many aspects of the pandemic.\n\nOnly 48% think “wearing masks around other people indoors” has been extremely or very effective; 23% give masks a lukewarm “somewhat effective” grade. Defying two years of public health preaching, 28% say they’re either “not too” or “not at all effective.”\n\nWe wonder…what percent of Americans know that the holes in surgical masks are up to 1,000 times larger than Covid-19 particles?\n\nGiven rampant breakthrough infections and a regime that’s pushing fourth injections on people, it’s not surprising that just 55% of Americans say vaccines have been extremely or very effective in limiting Covid spread. Indeed, it’s a testament to the public health apparatus and its major media stenographers that the number isn’t lower—yet.\n\nAmericans have serious concerns about the effect of the pandemic and public health interventions on schoolchildren: 62% say that too little priority has been given to meeting the educational needs of K-12 students.\n\nOver the course of the pandemic and its associated school closures, Americans have witnessed not only severe “learning loss,” but also sharp increases in juvenile anxiety, depression and suicide attempts. Even when schools opened for in-person instruction, the damage to learning continued with the pointless masking of children, which impedes communication and harms social interactions.\n\nWhen asked to evaluate “public health officials, such as those at the CDC,” only about half of Americans say they’ve done an excellent or good job.\n\n72% of Democrats and Democrat-leaning independents say public health officials have done an excellent or good job, compared to just 29% of Republicans and Republican-leaners. (Below, we’ll use just each party name to reference both party members and leaners.)\n\nSimilarly, 75% of Democrats say vaccines have been extremely or very effective, compared to just 32% of Republicans…while 71% of Democrats give those high marks to masking, compared to just 21% of Republicans.\n\nIt’s interesting to note that, in the first month of the outbreak, Republicans actually gave public health officials higher marks than Democrats did. That probably reflects Republicans reflexively approving of the government’s performance when a Republican was in the White House; the grades quickly plummeted though, and kept falling over the balance of his tenure.\n\nOn the other side of the aisle, where Fauci fandom is woven into the ideology, support for public health officials is essentially unchanged.\n\nHere’s a grab-bag of other findings from the Pew survey:\n• From April 2020 to today, the percent concerned they’ll be hospitalized for Covid has fallen by more than half, from 79% to 34%\n• 46% of Americans have either tested positive for Covid-19 or are pretty sure they had it\n• 49% of Americans are fully vaccinated and boosted within the last six months\n• 56% of fully-vaxxed Republicans have boosted, compared to 75% of fully-vaxxed Democrats\n• 60% of Republicans are fully vaccinated, compared to 85% of Democrats\n\nThis article originally appeared on Zero Hedge.", "opengraph": {"title": "New Survey Reveals Significant Doubts About Masks And Vaccines", "description": "Asked to look back at the pandemic and assess public health recommendations aimed at limiting Covid-19 spread, only about half of Americans now think masks and vaccines have been very effective or extremely effective. ", "image": "http://www.renegadetribune.com/wp-content/uploads/2021/09/Screenshot-2021-09-25-at-08-34-08-30k_Women_in_UK_Report_Menstrual_Problems_After_COVID_Shots-But_Menstrual_Issues_Not_List....png", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/new-survey-reveals-significant-doubts-about-masks-and-vaccines/", "site_name": "Renegade Tribune", "article:published_time": "2022-07-12T14:16:36+00:00", "article:modified_time": "2022-07-12T16:28:41+00:00", "image:width": "900", "image:height": "472"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/political/new-survey-reveals-significant-doubts-about-masks-and-vaccines", "https://www.pewresearch.org/science/2022/07/07/americans-reflect-on-nations-covid-19-response/", "https://starkrealities.substack.com/p/the-pointless-drive-to-make-masks", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "https://starkrealities.substack.com/p/public-health-erred-on-the-side-of?s=w", "https://starkrealities.substack.com/p/public-health-erred-on-the-side-of?s=w", "https://www.pewresearch.org/science/2022/07/07/americans-reflect-on-nations-covid-19-response/", "https://www.zerohedge.com/political/new-survey-reveals-significant-doubts-about-masks-and-vaccines", "http://www.renegadetribune.com/support-with-cryptocurrencies/", "https://gab.com/compose?url=http%3A%2F%2Fwww.renegadetribune.com%2Fnew-survey-reveals-significant-doubts-about-masks-and-vaccines%2F&text=New%20Survey%20Reveals%20Significant%20Doubts%20About%20Masks%20And%20Vaccines", "https://parler.com/new-post?message=New%20Survey%20Reveals%20Significant%20Doubts%20About%20Masks%20And%20Vaccines&url=http%3A%2F%2Fwww.renegadetribune.com%2Fnew-survey-reveals-significant-doubts-about-masks-and-vaccines%2F", "http://reddit.com/submit?url=http%3A%2F%2Fwww.renegadetribune.com%2Fnew-survey-reveals-significant-doubts-about-masks-and-vaccines%2F&title=New%20Survey%20Reveals%20Significant%20Doubts%20About%20Masks%20And%20Vaccines", "https://telegram.me/share/url?url=http%3A%2F%2Fwww.renegadetribune.com%2Fnew-survey-reveals-significant-doubts-about-masks-and-vaccines%2F&text=New%20Survey%20Reveals%20Significant%20Doubts%20About%20Masks%20And%20Vaccines", "http://www.renegadetribune.com/new-survey-reveals-significant-doubts-about-masks-and-vaccines/", "https://cash.app/$thekylehunt", "http://www.renegadetribune.com/new-york-reinstates-mask-advisory-as-6th-wave-hits-the-fully-vaccinated-city/", "http://www.renegadetribune.com/fauci-admits-covid-vaccines-dont-protect-overly-well/"], "authors": [], "publish_date": "2022-07-12T14:16:36+00:00"}