{"result_id": "260015", "URL": "http://www.renegadetribune.com/groundbreaking-analysis-covid-vaccines-caused-300000-excess-deaths-147-billion-in-damage-to-economy-in-2022-alone/", "timestamp": "2023-04-25 16:58:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/groundbreaking-analysis-covid-vaccines-caused-300000-excess-deaths-147-billion-in-damage-to-economy-in-2022-alone/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Groundbreaking Analysis: COVID Vaccines Caused 300,000 Excess Deaths, $147 Billion in Damage to Economy in 2022 Alone", "cleaned_text": "In the U.S., COVID-19 vaccines injured 26.6 million people, disabled 1.36 million people, caused more than 300,000 excess deaths and cost the economy an estimated $147 billion in damage — in 2022 alone — according to a new analysis by Humanity Projects, a wing of Portugal-based research firm Phinance Technologies\n\nIn the U.S., COVID-19 vaccines injured 26.6 million people, disabled 1.36 million people, caused more than 300,000 excess deaths and cost the economy an estimated $147 billion in damage — in 2022 alone — according to a new analysis by Humanity Projects, a wing of Portugal-based research firm Phinance Technologies.\n\nThe researchers behind “The Vaccine Damage Project,” released this month, said they sought to “estimate the human cost,” including “deaths caused or hastened by the vaccines,” as well as “the impact on the overall economy of each aspect of the vaccine damage.”\n\nPhinance Technologies was founded by former BlackRock portfolio manager Edward Dowd, along with Yuri Nunes, Ph.D., and Carlos Alegria, Ph.D.\n\nDowd, who came out as a whistleblower against the COVID-19 shots and Big Pharma corruption, is the author of “‘Cause Unknown‘: The Epidemic of Sudden Deaths in 2021 and 2022.”\n\nAccording to the project’s authors:\n\n“Each aspect of the vaccine damage investigation will have economic agents that will benefit and others that will suffer. For instance, it seems obvious that mortuary companies would benefit from excess mortality and life insurers will be harmed. This will lead to a reallocation of resources and re-pricing of risk by the different economic agents.\n\n“A broader approach is to estimate the impact on the overall economy of each aspect of the vaccine damage. A drop in the number of working-age individuals would lead to a drop in GDP. We believe this impact is negligible for now.\n\n“A greater impact will likely arise from an increase in disabilities in the labour force in the medium to long term.”\n\nUtilizing data from the U.S. Bureau of Labor Statistics and other official government sources, Humanity Projects split the impact of the COVID-19 vaccines into four categories of human cost: no effect/asymptomatic, injuries (mild to moderate), disabilities (severe injury) and death.\n\nAccording to the project’s findings, approximately 81% of the population falls into the “no effect or asymptomatic” group, which “comprises those individuals who did not experience adverse events following the COVID-19 inoculations.” However, the project notes that the actual size of this group cannot be known with certainty.\n\nThe researchers noted that the four categories “are not static and could interact with each other,” including “individuals who had no visible effects after vaccination but nonetheless could still be impacted.”\n\nA substantial portion of the population — 18% — falls into the mild-to-moderate injury category. This category refers to those “who experienced mild to moderate adverse effects after vaccination” that “could be temporary in nature, or long-term or even permanent,” leading to “lower productivity at work.”\n\nUsing the “excess rate of related adverse events in vaccinated individuals (23.90%) obtained from the Centers for Disease Control and Prevention’s V-safe database, versus the placebo baseline (5.98%) in the Pfizer clinical trial,” the researchers concluded, “the pool of possibly injured individuals due to the vaccine is about 18% of the population.”\n\nGeneral findings for this category include a 50% increase in lost work time between 2019 and 2022, a 28.6% increase in absence rates — an 11 standard deviation variation from 2019 — and an estimated 26.6 million Americans affected.\n\nApproximately 1% (0.93%) of the population fell into the “disabilities-severe outcome” category. This figure refers to the “estimated pool of the Civilian Labor force aged 16-64 that were disabled since 2021.”\n\nThe team drew from previous research it conducted on disability claims in the U.S. labor force, and from “the excess rate of Serious and Severe Adverse Events in vaccinated individuals versus the placebo baseline in the Pfizer and Moderna clinical trials,” the rise in disabilities at the population level in the U.S., and the hospitalization rate as derived from the V-safe database.\n\nIn all, the researchers found a 24.6% rise in disabilities since 2021, affecting an estimated 1.36 million individuals.\n\nAs of November 2022, statistics from the Bureau of Labor Statistics and the Federal Reserve Bank of St. Louis showed the number of disabled individuals in the U.S. ranged between 29.974 million in April 2016 and 30.612 million in April 2017 — compared to 5.811 million in October 2015 and 6.335 million in June 2017.\n\nHowever, by October 2021, these figures increased to 31.195 million and 6.987 million, respectively. And by October 2022, the figures were 32.819 million and 7.797 million.\n\nThe fourth category, referring to those who died, affected an estimated 0.05% to 0.1% of the population ages 25-64, according to the researchers.\n\n“This group of individuals died as a consequence of mortality,” the group said, noting that “from the summer of 2021, with the introduction of mass vaccination, with the rise in natural immunity by exposure to the virus, and the emergence of milder and more contagious virus strains … it is difficult to argue that COVID-19 had a significant role in excess mortality.”\n\nIn all, the researchers found 23% excess mortality and an estimated 310,000 excess deaths at the population level in this age group in 2021 and 2022.\n\nOn Feb. 24, Sweden, a country that eschewed lockdowns, vaccine and mask mandates and strict COVID-19 countermeasures, reported its total excess deaths during the first two years of the pandemic were among the lowest in Europe.”\n\nThe other component of the Humanity Projects’ research focused on the economic impact of the COVID-19 vaccines by estimating “the direct economic cost from the mass COVID-19 inoculations on individuals.”\n\nAccording to the researchers, they drew from gross domestic income data obtained from the Federal Reserve Bank of St. Louis and applied those figures to the data from their human costs analysis, including statistics on excess deaths, disabilities and lost work time.\n\nThey then estimated economic costs for each of their four categories of individuals.\n\nIn looking at the mild-to-moderate injury category, the researchers used “the absolute excess lost worktime rates in 2022 … to estimate the economic cost in terms of lost productivity.”\n\nApplying those figures to gross domestic income statistics, they found that the direct economic cost from the increase in lost work time rates is $89.9 billion.\n\nIn the severe injury (disabilities) category, the researchers found an 0.93% absolute rise in disabilities since 2021 for the 16- to 64-year-old civilian labor force. Applying that data to gross domestic income figures, they found a $52.2 billion direct economic cost resulting from the rise in disabilities.\n\nThe researchers noted that “this cost is expected to be ongoing in the coming years, as these individuals are likely to have a permanent disability.”\n\nFinally, the researchers found an 0.05% average yearly absolute rise in excess deaths since 2021 for the 25- to 64-year-old population, resulting in a direct economic cost of $5.6 billion, when calculated against gross domestic income data.\n\nIn all, this results in a total economic cost of $147.8 billion dollars just for 2022 alone. According to the researchers, “Milder damage is associated with larger economic cost, as it affects a larger portion of the population.”\n\nIn a tweet, Dowd also noted that these figures represent just “what we can measure” at present, and do not include knock-on effects such as workers who continue to be employed but are operating at a lower productivity level.\n\n“We need to monitor the longer-term impact of the vaccine damage as they amount to an important economic impact,” the researchers concluded, adding:\n\n“Individuals with mild injuries from the inoculations could, over time, develop severe injuries to the extent of being disabled, or an extreme outcome such as death.”", "opengraph": {"title": "Groundbreaking Analysis: COVID Vaccines Caused 300,000 Excess Deaths, $147 Billion in Damage to Economy in 2022 Alone", "description": "In the U.S., COVID-19 vaccines injured 26.6 million people, disabled 1.36 million people, caused more than 300,000 excess deaths and cost the economy an estimated $147 billion in damage -- in 2022 alone -- according to a new analysis by Humanity Projects.", "image": "http://www.renegadetribune.com/wp-content/uploads/2022/09/Skull-and-Bones-Vaccine-Vial-Needle-Covid-1984.jpeg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/groundbreaking-analysis-covid-vaccines-caused-300000-excess-deaths-147-billion-in-damage-to-economy-in-2022-alone/", "site_name": "Renegade Tribune", "article:published_time": "2023-04-06T11:40:35+00:00", "article:modified_time": "2023-04-06T11:48:33+00:00", "image:width": "1480", "image:height": "832"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/covid-vaccine-injury-deaths-economic-damage/", "https://greenmedinfo.com/disease/coronavirus-disease", "http://www.phinancetechnologies.com/HumanityProjects/The%20VDamage%20Project.htm", "https://childrenshealthdefense.org/defender/cause-unknown-edward-dowd-sudden-deaths-covid-vaccines/", "https://www.researchgate.net/profile/Yuri-Nunes", "https://www.freedomdefenseresourcecenter.com/phinance-technologies/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://www.amazon.com/Cause-Epidemic-Sudden-Childrens-Defense/dp/1510776397/ref=sr_1_1", "https://twitter.com/DowdEdward/status/1640734879355682816", "http://www.phinancetechnologies.com/HumanityProjects/Resources/Report%20on%20measuring%20death%20rates%20-%20V3%20-%20US.pdf", "https://childrenshealthdefense.org/defender_category/covid/", "http://www.phinancetechnologies.com/HumanityProjects/The%20VDamage%20Project%20-%20Human%20%20Cost.htm", "https://greenmedinfo.com/anti-therapeutic-action/vaccination-all", "https://childrenshealthdefense.org/defender/women-covid-vaccine-injuries-v-safe-data/", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part6.htm", "https://www.nlm.nih.gov/nichsr/stats_tutorial/section2/mod8_sd.html", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part1.htm", "http://www.phinancetechnologies.com/HumanityProjects/SAE%20mRNA%20Clinical%20Trials.htm", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part5.htm", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part6.htm", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part7.htm", "https://childrenshealthdefense.org/defender/workers-compensation-covid-vaccine-injury-victims/", "https://fraser.stlouisfed.org/title/employment-situation-144/april-2017-546977/employment-status-civilian-population-sex-age-disability-status-seasonally-adjusted-521233", "https://fraser.stlouisfed.org/title/employment-situation-144/april-2017-546977/employment-status-civilian-population-sex-age-disability-status-seasonally-adjusted-521233", "https://fraser.stlouisfed.org/title/employment-situation-144/october-2016-535274/employment-status-civilian-population-sex-age-disability-status-seasonally-adjusted-518808", "https://fred.stlouisfed.org/release/tables?rid=50&eid=1460&od=2018-06-01", "https://www.bls.gov/news.release/empsit.t06.htm", "https://www.bls.gov/news.release/empsit.t06.htm", "https://twitter.com/SupraNovaBoom/status/1632511067782893569", "http://www.phinancetechnologies.com/HumanityProjects/Resources.htm#ExcessDeathsMethodology.htm", "https://www.thelancet.com/article/S0140-6736(21)02796-3/fulltext", "https://ec.europa.eu/eurostat/statistics-explained/index.php?title=Excess_mortality_-_statistics", "https://www.who.int/data/stories/global-excess-deaths-associated-with-covid-19-january-2020-december-2021", "https://twitter.com/DowdEdward/status/1640735049661202439", "http://www.phinancetechnologies.com/HumanityProjects/The%20VDamage%20Project%20-%20Economic%20Impact.htm", "https://fred.stlouisfed.org/series/A4102C1Q027SBEA", "https://twitter.com/DowdEdward/status/1640735076110716928"], "authors": [], "publish_date": "2023-04-06T11:40:35+00:00"}