{"result_id": "260025", "URL": "http://www.renegadetribune.com/big-pharma-president-caught-with-a-fake-vaccine-passport/", "timestamp": "2023-04-25 16:59:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/big-pharma-president-caught-with-a-fake-vaccine-passport/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Big Pharma President Caught With A Fake Vaccine Passport", "cleaned_text": "José María Fernández Sousa-Faro, who founded pharmaceutical giant PharmaMar in 1986, has been listed alongside more than 2000 other people who obtained a fake COVID-19 vaccine passport in Spain. His in particular was for the booster dose.\n\nOthers on the list include Australian tennis player Álex de Miñaur and other prominent Spanish celebrities and citizens with the means and access to obtain the fake passes.\n\nThe news was leaked by El Periódico, a daily newspaper based in Barcelona, Catalonia, Spain. The investigation by Spanish police was called “Operation Jenner,” named after Dr. Edward Jenner, who is credited with being one of the pioneers of vaccines.\n\nThe effort by Spanish police to expose false vaccine passports has been active since its inception in September 2021. In April of 2022, ‘Jenner’ was credited with the dismantling network that provided false COVID passports in the European Union, with the arrest of a nurse and an assistant as those in charge of fraudulently entering people into the National Vaccination Registry.\n\nPeople of all backgrounds and means have been quite hesitant to receive their COVID-19 jabs. This includes networks of tens and thousands of doctors and scientists as well, many of whom have been subjected to censorship and ridicule for sharing evidence and opinion. We’ve seen this with other measures like lockdowns and mask mandates too.\n\nThe censorship has become quite obvious, and the evidence presented that questions COVID-19 vaccine safety and efficacy has not had its fair share in the limelight.\n\nInstead of total transparency, propaganda replaced science under clever slogans like “trust the science” and political rhetoric claiming this is a “pandemic of the unvaccinated.” Granted, an argument can be made and heard for the good that COVID-19 vaccines have done, but the number of serious vaccine injuries including deaths and permanent disabilities have been brushed off as “false conspiracy theories.” The fact that these vaccines do not reduce the transmission of the virus was also ignored. The complete lack of acknowledgement of the science regarding natural immunity was also concerning and didn’t make sense to many.\n\nThe main takeaway here is that many people simply do not agree with government mandates. Earlier this year, an Angus Reid poll showed that more than half of Canadians, many of whom are still not allowed to leave their country, wanted all mandates to end, yet these numbers are not represented within the mainstream.\n\nThose who disagree with mandates have always been made to feel as if they are in a minority of extremists, when in actuality they may be in the majority, and the complete opposite of extremists.\n\nWhat does it tell you when a number of celebrities, the head of a major pharmaceutical company, and more decided to obtain a fake vaccine passport certificate?\n\nHow do we know other prominent figures, like various presidents and politicians have not done the same? Did these people really receive their COVID-19 vaccine, and is it crazy to think they may have not? Were those clips of politicians getting their COVID-19 jabs on television actually COVID-19 jabs, or a saline solution?\n\nThese are all reasonable questions to ask.\n\nWhat do you expect when so much information, science and expert opinion calls into question COVID-19 vaccine safety? What makes this rabbit hole even more interesting is the fact that “fact-checkers” were censoring information leaked by the British Medical Journal, and various prominent doctors and epidemiologists as well. It simply brought more attention and intrigue as to why so many people refuse and did refuse to comply.\n\nWhat does it say about our world when our rights and freedoms are taken away by governments if we don’t do what they tell us? What does it say about our governments when they ignore and censor all of the holes that have been poked in their narrative, and punish those who have legitimate concerns?\n\nThis article originally appeared on The Pulse.", "opengraph": {"title": "Big Pharma President Caught With A Fake Vaccine Passport", "description": "What does it tell you when a number of celebrities, the head of a major pharmaceutical company, and more decided to obtain a fake vaccine passport certificate?", "image": "http://www.renegadetribune.com/wp-content/uploads/2022/06/pres-800x500-1.jpeg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/big-pharma-president-caught-with-a-fake-vaccine-passport/", "site_name": "Renegade Tribune", "article:published_time": "2022-06-11T14:28:17+00:00", "article:modified_time": "2022-06-11T11:48:21+00:00", "image:width": "800", "image:height": "500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thepulse.one/author/arjunw/", "https://www.elperiodico.com/es/sucesos/20220524/presidente-pharmamar-investigado-falsos-vacunados-13699139", "https://thepulse.one/2022/03/07/researchers-examine-autopsies-of-two-boys-who-died-days-after-covid-vaccine/", "https://thepulse.one/2022/04/28/12-year-old-girl-severely-injured-after-pfizer-jab-told-its-all-in-her-head/", "https://thepulse.one/2022/01/12/vaccines-that-dont-stop-transmission-can-promote-more-virulent-pathogens/", "https://thepulse.one/2022/02/11/natural-covid-immunity-discovered-in-unvaccinated-adults-20-months-after-infection/", "https://thepulse.one/2022/02/04/new-poll-more-than-20-million-canadians-54-want-all-covid-restrictions-to-end-now/", "https://thepulse.one/2021/12/19/british-medical-journal-editor-in-chief-calls-out-incompetent-facebook-fact-checkers/", "https://thepulse.one/2022/06/09/big-pharma-president-caught-with-a-fake-vaccine-passport/", "http://www.renegadetribune.com/support-with-cryptocurrencies/", "https://gab.com/compose?url=http%3A%2F%2Fwww.renegadetribune.com%2Fbig-pharma-president-caught-with-a-fake-vaccine-passport%2F&text=Big%20Pharma%20President%20Caught%20With%20A%20Fake%20Vaccine%20Passport", "https://parler.com/new-post?message=Big%20Pharma%20President%20Caught%20With%20A%20Fake%20Vaccine%20Passport&url=http%3A%2F%2Fwww.renegadetribune.com%2Fbig-pharma-president-caught-with-a-fake-vaccine-passport%2F", "http://reddit.com/submit?url=http%3A%2F%2Fwww.renegadetribune.com%2Fbig-pharma-president-caught-with-a-fake-vaccine-passport%2F&title=Big%20Pharma%20President%20Caught%20With%20A%20Fake%20Vaccine%20Passport", "https://telegram.me/share/url?url=http%3A%2F%2Fwww.renegadetribune.com%2Fbig-pharma-president-caught-with-a-fake-vaccine-passport%2F&text=Big%20Pharma%20President%20Caught%20With%20A%20Fake%20Vaccine%20Passport", "http://www.renegadetribune.com/big-pharma-president-caught-with-a-fake-vaccine-passport/", "https://cash.app/$thekylehunt", "http://www.renegadetribune.com/uk-considers-vaccine-passports-for-5-year-olds/", "http://www.renegadetribune.com/fake-salmon-made-in-israel-thanksjews/"], "authors": [], "publish_date": "2022-06-11T14:28:17+00:00"}