{"result_id": "260013", "URL": "http://www.renegadetribune.com/will-vaccines-be-the-end-of-us/", "timestamp": "2023-04-25 16:58:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/will-vaccines-be-the-end-of-us/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "Will Vaccines Be the End of Us?", "cleaned_text": "It may seem ludicrous for an author to write a glowing review of his own book, but we’re living in a world gone mad where anything goes, so let me tell you why I think Will Vaccines Be the End of Us?, a product of thirty years of part-time research, is the last word on the subject.\n\nFirst, some background. I’m 68, and along with countless millions around the world, consider myself a victim of vaccines, though in a very unusual sense. In the 1980s I traveled around Africa, Asia and South America, two to three months each year on average, and got numerous routine “travel shots” spread out over six years as protection against various tropical diseases. I’d never heard a bad word about vaccines, and took it for granted that they could only help me, and in no way harm me. I never had an adverse reaction to any of them, but I learned of their dark side in a chance conversation with two Australian women I met in Nepal in January 1987. I became obsessed with the subject and began reading up on it. A few years later, I realized that one or more of these vaccines had impaired my fertility, which began a chain of events resulting in my ex-wife giving birth to twins, a boy and a girl, three months premature, in 1994. They survived but had serious problems, and are handicapped today, my daughter severely so.\n\nIn 2008, after nearly twenty years of researching vaccines in my spare time, I decided to write a book. There are many fine books exposing various aspects of this filthy business, but I wanted to write something original, something that tied the important contributions of other authors together, while placing vaccination in the framework of all human experience, including my own, and showing how it fits in with the whole sorry history of human delusion, inertia and criminality. I had no interest in charts, graphs, statistics and studies, even those that supported my position. Anyone can jerk numbers around and skew or falsify studies according to one’s bias. It happens all the time. In this world of lies we live in, I’ve learned that the only things I can rely on as solid facts are first and foremost, what I see with my own eyes, and second, what no one disputes.\n\nWhat I saw with my own eyes, while attending elementary school in the early 1960s, when children got only five or six vaccine doses from infancy to age eight (which was five or six too many), was that many kids came down with chickenpox or measles, missed class for a week or so, then were back at their desks as good as new. In those six years I never heard of a single child in my school who didn’t make a quick recovery from any illness, nor one with any of the chronic physical and emotional afflictions so common today, obviously caused by the insane CDC schedule, which calls for 72 vaccine doses from the day of birth to age eighteen. The thrust of my book – what motivated me to write it in the first place – was the great harm being done to our children, so many of whom will never have children of their own because of vaccine damage. Hence the title.\n\nWhat’s indisputable is that the anti-vax movement began practically on the day, May 14, 1796, when Edward Jenner administered the first smallpox vaccine. Then, as now, with the Covid-19 shot, there was violent disagreement among the populace over this new “medical” procedure. Many were horrified by the idea of injecting cow pus into a child’s arm, many bought into it, and Jenner was able to sell this flimflam to the British government, which long after his death made it compulsory in 1853. All vaccines have been controversial, but the public outcry over the smallpox jab, with its terrible side effects, including death, and its lack of efficacy, lasted well into the twentieth century. It was discontinued in the U.S. in 1971.\n\nThis pseudo-science has always been stained by every vice known to man, and has always attracted the sort of twisted people who, for example, during the rat race to come up with a polio vaccine in the 1950s, subjected 100,000 monkeys to gruesome experiments leading to death, and then discarded them like used paper towels. These same people, including the media-invented hero Jonas Salk, had no compunction about using institutionalized American children and African children as guinea pigs, and vaccine experiments on Third World kids continues to this day. Bill Gates would know about that. In the last eighty years or so, the vaccine establishment has been heavily Jewish, with all the sickening corruption that signifies. I wrote a separate chapter on this, tying it in with Jewish blood rituals going back to the Middle Ages, a connection which no other author has touched. Nor has anyone else mentioned the similarity between vaccination and the degradation of the bestial Mau Mau oath which took root in Kenya after the Second World War.\n\nMy book is an eclectic scrapbook, with many photographs and reproductions from a wide variety of sources. I’ve confronted the vaccine dogma from every conceivable angle, leaving nothing unsaid, including what these evil shots have done to our pets. (I tell the story of a cat I lost to feline leukemia several years ago, almost certainly due to routine vaccination before we adopted him.) It’s a serious book, but I wrote a lighthearted chapter on all the stupid, useless travel shots I got in the 1980s, and the times I got sick in my travels far and wide. Actually, there’s some solid advice here, learned from personal experience and observation, that would benefit anyone heading off to the Third World for the first time.\n\nThere’s no question in my mind that eventually, this barbaric practice will go the way of other medical delusions like bloodletting and variolation. The whole thing has been ridiculous since day one, and now, with the obviously genocidal Covid-19 jab, we’ve reached the edge of the cliff. I completed Will Vaccines Be the End of Us? in October 2019, two months before the first news about Covid came out of China, but due to unforeseen problems and delays, it was not printed until November 2021. This allowed me to write an afterword about the Covid hoax and the subsequent global injection massacre. I can say with satisfaction that the events of the last two years have validated everything I wrote about, and the book’s title as well.\n\nIn January my website endtheshots.com went up. It’s a diversified site, with articles written on some of my more exotic travels, and on the intensifying race war against Whites, but the main focus is on vaccines. You can read my entire book for free on the site, and you may copy and distribute any portion of it without my permission; I only ask that you give proper attribution. If you log on, you’ll see that I offer $30,000 to anyone who can name one vaccine developer, beginning with Jenner, who wasn’t or isn’t a failure, swindler or psychopath, or tell me of one authoritative pro-vaccine book published since 1796. (I read twelve pro-vax books just to hear out both sides, and found most to be laughable, and all of them a mishmash of errors or lies or both.) I also sent out a bunch of letters and emails to obnoxious or brain-dead Covid jab pushers, some famous some not, as well as packets of information on the millions of Covid jab casualties to all fifty state public health commissioners, asking for their comment. I received only two absurd replies that didn’t even address my letter. All of this can be read on the $30,000 offer page; it’s pretty amusing.\n\nSelf-publishing is a tough gig, as I found out 23 years ago after writing a book on an unrelated subject. Like so many other things wrong with this country, mainstream book publishing, reviewing, and distribution is largely a Jewish censorship racket, and It’s nearly impossible for a controversial book by an obscure author to get a fair hearing. This time I had only a thousand copies printed, and so far have sold or given away only about a hundred, but I’ve received some very nice feedback. If you’re attuned to this site, I can practically guarantee that you’ll enjoy my book. It’s large, 8.5 X 11 format, softcover, 290 pages. You can order directly from me, John Massaro, P.O. Box 45, Jeffersonville, NY 12748. The cost is $20, cash, check or money order (shipped only within the USA). All proceeds go to Kyle to help support his stellar work at Renegade.", "opengraph": {"title": "Will Vaccines Be the End of Us?", "description": "In this world of lies we live in, I've learned that the only things I can rely on as solid facts are first and foremost, what I see with my own eyes, and second, what no one disputes.", "image": "http://www.renegadetribune.com/wp-content/uploads/2022/06/cropped-endtheshots.jpg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/will-vaccines-be-the-end-of-us/", "site_name": "Renegade Tribune", "article:published_time": "2022-06-26T14:09:03+00:00", "article:modified_time": "2022-06-26T15:51:05+00:00", "image:width": "2000", "image:height": "1200"}, "tags": [], "tweets": [], "movies": [], "links": ["http://endtheshots.com", "http://www.renegadetribune.com/support-with-cryptocurrencies/", "https://gab.com/compose?url=http%3A%2F%2Fwww.renegadetribune.com%2Fwill-vaccines-be-the-end-of-us%2F%3Fdoing_wp_cron%3D1682434724.9595749378204345703125&text=Will%20Vaccines%20Be%20the%20End%20of%20Us%3F", "https://parler.com/new-post?message=Will%20Vaccines%20Be%20the%20End%20of%20Us%3F&url=http%3A%2F%2Fwww.renegadetribune.com%2Fwill-vaccines-be-the-end-of-us%2F%3Fdoing_wp_cron%3D1682434724.9595749378204345703125", "http://reddit.com/submit?url=http%3A%2F%2Fwww.renegadetribune.com%2Fwill-vaccines-be-the-end-of-us%2F%3Fdoing_wp_cron%3D1682434724.9595749378204345703125&title=Will%20Vaccines%20Be%20the%20End%20of%20Us%3F", "https://telegram.me/share/url?url=http%3A%2F%2Fwww.renegadetribune.com%2Fwill-vaccines-be-the-end-of-us%2F%3Fdoing_wp_cron%3D1682434724.9595749378204345703125&text=Will%20Vaccines%20Be%20the%20End%20of%20Us%3F", "http://www.renegadetribune.com/will-vaccines-be-the-end-of-us/?doing_wp_cron=1682434724.9595749378204345703125", "http://www.renegadetribune.com/new-bill-would-punish-doctors-who-point-out-scientific-facts-challenging-established-narrative/", "http://www.renegadetribune.com/turmeric-a-wellness-promoting-tonic-at-low-doses-research-reveals/"], "authors": [], "publish_date": "2022-06-26T14:09:03+00:00"}