{"result_id": "260008", "URL": "http://www.renegadetribune.com/the-complicity-of-the-music-industry-in-the-vaccination-program/", "timestamp": "2023-04-25 16:58:30 CEST+0200", "meta": {"description": "Just about a year ago, before the public started really getting aware of the vaccine-damage situation that is plaguing the world right now at this point in time, moguls in the music industry were basically coercing fans to take the jab in order for them to be able to access their venues. I believe they are still pushing this thing - right now as I write this.", "lang": "en", "keywords": "", "favicon": "http://www.renegadetribune.com/wp-content/uploads/2017/05/cropped-Black_Sun.svg_-32x32.png", "canonical": "http://www.renegadetribune.com/the-complicity-of-the-music-industry-in-the-vaccination-program/", "encoding": "UTF-8"}, "image": null, "domain": "www.renegadetribune.com", "title": "The Complicity of The Music Industry in The Vaccination Program", "cleaned_text": "Just about a year ago, before the public started really getting aware of the vaccine-damage situation that is plaguing the world right now at this point in time, moguls in the music industry were basically coercing fans to take the jab in order for them to be able to access their venues. I believe they are still pushing this thing – right now as I write this – but I also suspect that, as people are getting awaken en-mass about the threat of the aforementioned “vaccines”, that the media is trying to minimize, or just sweep under the rag, the whole issue altogether. At least that is the impression I get when getting search-results, trying to find out how many of these venues are still pushing the clot-shot agenda. It would be impossible for me to add a list of ALL venues in the US (let alone in the entire world) who are involved in the same game. Maybe someone in the comment section can help.\n\nSuffice to say that I am only concentrating on the alternative rock (and “legacy rock”) side of things, not only because I am more familiar with this type of entertainment myself, but also because covering EVERY single genre in popular music regarding this issue would take me several articles (which is something I am obviously not going to do), but again readers can chip in the comment section. I also want to illustrate the blatant hypocrisy that these “alternative” people display in public without any dissimulation.\n\nMind you I am not talking about only rock-concert venues here. I am also referring to the musicians themselves who, rather than setting an example by basically disproving/ignoring/questioning all the draconian regulations which have been mandated on the public (especially young folks), are to the contrary COERCING fans to take the jab, if they ever so wish to attend any of their concerts.\n\nNot many outlets on the Internet have called these people out. Here there is an article entitled Foo Fighters Vaccine Requirements at Shows Prompt Outrage: ‘Shame on Them’ published by Newsweek on August 18, 2021 which somewhat sheds some light on the whole thing. Now… how many of these articles are out on the Interwebs exposing this abuse? Here are a couple of paragraphs from said article:\n\nAnother quote from the article Concert promoter AEG mandates vaccines for fans; Live Nation allows artists to decide by USA Today (published on July 2021) reads as follows:\n\nNext are some of the images (+ bonuses) featured in another article entitled Here Are The Bands Requiring Fans To Provide Proof Of Vaccination Or A Negative Covid Test To Attend Their Shows published August 12, 2021 by Forbes. Fortunately they are not that many bands featured there, but I think they are kind of significant regardless. Take a look:\n\nOne only has to guess how many young people must have taken the clot-shot just because individuals like this Dave Growl have been coercing them to do it: “If you want to see us play you’ll have to get the shot buddy”. Thanks Dave Growl! that shows once more, and without any shadow of doubt, that there never was such thing as “alternative rock” or “indie rock”. “Alternative side of the mainstream” perhaps, that definitively sounds much more reasonable. What a bunch of rock heroes, right?\n\nThe Needle and The Damage Done\n\n\n\nThe whole Nirvana phenomenon in the early 1990s was just an extension of the psy-op known as the so-called (C.I.A. orchestrated) “counter-culture” of the 1960s, which went along with the hard-drugs’ agenda that they fostered on a depressed and destitute generation of young people (i.e. Generation X) during that aforementioned time-period. Now they want the new generation jabbed. It is all about getting “the poisoned needle” one way or another, regardless of the “ingredients” contained therein.\n\nRock musicians of this kind practically forcing fans to take the jab or else is just as “cool”, “alternative” and “edgy” as Jello Biafra (of Dead Kennedys’ fame) talking trash about “The Fourth Reich” while wearing a face-mask, being on his own… indoors!\n\nI wonder if Mr. Biafra forces fans to wear the face-diaper concerts. It must be a tad difficult to do the “stage-dive” with that thing on one’s face while fainting due to lack of oxygen-intake. Those people in front of the stage keeping six feet apart from each other must be a bit challenging for that task I guess. Sooo punk.\n\nSaid all this I do not care how many concert-goers have suffered the side-effects of these “vaccines” after having been told to get them. If just one person -one person only- has gotten maimed or just died as a consequence of this issue, that is already way too many people in my estimation. I do not care if they were too young to know or too stupid for having taken the shot.\n\nI am inviting here those people who might have any “influence” or contacts of any kind in the music industry in general (if they happen to be reading this article by any chance) to simply call these individuals out for their criminal behavior. All the people that I have been able to feature in the gallery (plus the infinite number of concert venue owners who have not been forced to push any vaccine agendas but have proceeded willingly with it for some ulterior motive) they are accessories to a crime of epic proportions, and as accomplices they have aided the perpetrators of this crime by pushing the same vaccine agenda on young folks.\n\nI do not care if these young concert-goers have supposedly been given a “choice”, i.e. the choice of getting the jab to access these venues or basically tell these clowns, both promoters and bands altogether, to F*CK OFF.\n\nObviously none of these (in)famous individuals is going to issue any “apology” any time soon, let alone “go to jail” for it… god forbid (even if that is what they actually deserve given the current situation), however there is some direct action people can take:\n\nBoycott all these venues, but most of all, boycott these specific bands by not showing up at their concerts. Do not give these people either your hard-earned money or your attention as they do not deserve any of it WHATSOEVER – no excuses. They have crossed the line with their “demands”, so it is just reasonable that now they face the consequences of their actions. These clowns have to be held accountable.", "opengraph": {"title": "The Complicity of The Music Industry in The Vaccination Program", "description": "Just about a year ago, before the public started really getting aware of the vaccine-damage situation that is plaguing the world right now at this point in time, moguls in the music industry were basically coercing fans to take the jab in order for them to be able to access their venues. I believe they are still pushing this thing - right now as I write this.", "image": "http://www.renegadetribune.com/wp-content/uploads/2022/08/Dave-Grohl-Boosted-Covid-1984-Vaccine-Jabs-Syringes-Thumbs-Up.jpg", "locale": "en_US", "type": "article", "url": "http://www.renegadetribune.com/the-complicity-of-the-music-industry-in-the-vaccination-program/", "site_name": "Renegade Tribune", "article:published_time": "2022-08-31T22:18:24+00:00", "article:modified_time": "2022-09-02T12:03:54+00:00", "image:width": "1485", "image:height": "989"}, "tags": ["Maroon 5", "Forbes", "2021", "Death", "Nirvana", "Foo Fighters", "vaccine", "Rage Against the Machine", "Music Industry", "indie rock", "Harry Styles", "Michael Rapino", "Dead Kennedys", "Jello Biafra", "The Killers", "Generation X", "Live Nation", "Dead & Co", "Eagles", "Dave Growl", "Lollapalooza", "AEG", "punk rock", "Alternative Rock"], "tweets": [], "movies": [], "links": ["http://www.renegadetribune.com/the-great-culling-of-the-vaccinated/", "https://duckduckgo.com/?q=LIST+of+rock+concert+venues+which+required+vaccination+to+enter&t=ha&va=j&ia=web", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Anthem-Got-Vaxx-Vacci-Nation.jpg", "https://www.newsweek.com/foo-fighters-vaccine-requirement-test-negative-result-shows-prompt-outrage-alaska-tour-1619671", "https://eu.usatoday.com/story/entertainment/music/2021/08/06/live-nation-concerts-artists-vaccine-requirement-proof-negative-test/5518426001/", "https://www.forbes.com/profile/michael-rapino/", "https://www.forbes.com/sites/tommybeer/2021/08/12/here-are-the-bands-requiring-fans-to-provide-proof-of-vaccination-or-a-negative-covid-test-to-attend-their-shows/?sh=7f02f3643ecd", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Foo-Fighters-with-recently-deceased-drummer-Taylor-Hawkins-second-left.jpg", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Guests-are-asked-to-show-proof-of-vaccination-against-COVID-19-as-they-arrive-for-the-first-day-of-Lollapalooza-July-29-2021-Chicago.jpg", "http://www.renegadetribune.com/wp-content/uploads/2022/08/The-Killers-Living-up-to-their-name-by-pushing-the-clot-shot-I-guess.jpg", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Singer-Harry-Styles-attends-the-2021-Grammy-Awards-in-Los-Angeles-Robert-Gauthier-Los-Angeles-Times.jpg", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Maroon-5-featuring-some-Levine-upfront-token-black-so-edgy.jpg", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Eagles-Will-Require-Vaccination-For-Fans-At-Newly-Added-Tour-Date.jpg", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Dead-Co-Do-they-mean-Dead-by-vaccine-requirement-Grateful-Masons.jpg", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Rage-Against-the-Machine-looking-pretty-much-like-commitards.jpg", "https://www.youtube.com/shorts/0hSuvGMOOsg", "http://www.renegadetribune.com/wp-content/uploads/2022/08/Music-fans-in-Barcelona-had-rapid-COVID-19-test-to-observe-non-social-distancing.jpg", "http://www.renegadetribune.com/support-with-cryptocurrencies/", "https://gab.com/compose?url=http%3A%2F%2Fwww.renegadetribune.com%2Fthe-complicity-of-the-music-industry-in-the-vaccination-program%2F&text=The%20Complicity%20of%20The%20Music%20Industry%20in%20The%20Vaccination%20Program", "https://parler.com/new-post?message=The%20Complicity%20of%20The%20Music%20Industry%20in%20The%20Vaccination%20Program&url=http%3A%2F%2Fwww.renegadetribune.com%2Fthe-complicity-of-the-music-industry-in-the-vaccination-program%2F", "http://reddit.com/submit?url=http%3A%2F%2Fwww.renegadetribune.com%2Fthe-complicity-of-the-music-industry-in-the-vaccination-program%2F&title=The%20Complicity%20of%20The%20Music%20Industry%20in%20The%20Vaccination%20Program", "https://telegram.me/share/url?url=http%3A%2F%2Fwww.renegadetribune.com%2Fthe-complicity-of-the-music-industry-in-the-vaccination-program%2F&text=The%20Complicity%20of%20The%20Music%20Industry%20in%20The%20Vaccination%20Program", "http://www.renegadetribune.com/the-complicity-of-the-music-industry-in-the-vaccination-program/", "http://www.renegadetribune.com/henri-bivas-realistic-landscapes/", "http://www.renegadetribune.com/germanys-legal-cleansing-of-parasitic-jewry-and-the-subsequently-profitable-holocaust-lie/"], "authors": [], "publish_date": "2022-08-31T22:18:24+00:00"}