{"result_id": "261013", "URL": "https://rense.com/general87/historic.htm", "timestamp": "2023-04-25 17:00:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general87/historic.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Historical FACTS On Dangers, Ineffectiveness Of Vaccines", "cleaned_text": "* In 1871-2, England, with 98% of the population aged between 2 and 50 vaccinated against smallpox, it experienced its worst ever smallpox outbreak with 45,000 deaths. During the same period in Germany, with a vaccination rate of 96%, there were over 125,000 deaths from smallpox. (http://www.soilandhealth.org/02/0201hyglibcat/020119hadwin/020119hadwin.toc.html)\n\n The Hadwen Documents * In Germany, compulsory mass vaccination against diphtheria commenced in 1940 and by 1945 diphtheria cases were up from 40,000 to 250,000. (Don't Get Stuck, Hannah Allen) * In the USA in 1960, two virologists discovered that both polio vaccines were contaminated with the SV 40 virus which causes cancer in animals as well as changes in human cell tissue cultures. Millions of children had been injected with these vaccines. (Med Jnl of Australia 17/3/1973 p555) * In 1967, Ghana was declared measles free by the World Health Organisation after 96% of its population was vaccinated. In 1972, Ghana experienced one of its worst measles outbreaks with its highest ever mortality rate. (Dr H Albonico, MMR Vaccine Campaign in Switzerland, March 1990) * In the UK between 1970 and 1990, over 200,000 cases of whooping cough occurred in fully vaccinated children. (Community Disease Surveillance Centre, UK) * In the 1970's a tuberculosis vaccine trial in India involving 260,000 people revealed that more cases of TB occurred in the vaccinated than the unvaccinated. (The Lancet 12/1/80 p73) * In 1977, Dr Jonas Salk who developed the first polio vaccine, testified along with other scientists, that mass inoculation against polio was the cause of most polio cases throughout the USA since 1961. (Science 4/4/77 \"Abstracts\" ) * In 1978, a survey of 30 States in the US revealed that more than half of the children who contracted measles had been adequately vaccinated. (The People's Doctor, Dr R Mendelsohn) * In 1979, Sweden abandoned the whooping cough vaccine due to its ineffectiveness. Out of 5,140 cases in 1978, it was found that 84% had been vaccinated three times! (BMJ 283:696-697, 1981) * The February 1981 issue of the Journal of the American Medical Association found that 90% of obstetricians and 66% of pediatricians refused to take the rubella vaccine. * In the USA, the cost of a single DPT shot had risen from 11 cents in 1982 to $11.40 in 1987. The manufacturers of the vaccine were putting aside $8 per shot to cover legal costs and damages they were paying out to parents of brain damaged children and children who died after vaccination. (The Vine, Issue 7, January 1994, Nambour, Qld) * In Oman between 1988 and 1989, a polio outbreak occurred amongst thousands of fully vaccinated children. The region with the highest attack rate had the highest vaccine coverage. The region with the lowest attack rate had the lowest vaccine coverage. (The Lancet, 21/9/91) * In 1990, a UK survey involving 598 doctors revealed that over 50% of them refused to have the Hepatitis B vaccine despite belonging to the high risk group urged to be vaccinated. (British Med Jnl, 27/1/1990) * In 1990, the Journal of the American Medical Association had an article on measles which stated \" Although more than 95% of school-aged children in the US are vaccinated against measles, large measles outbreaks continue to occur in schools and most cases in this setting occur among previously vaccinated children.\" (JAMA, 21/11/90) * In the USA, from July 1990 to November 1993, the US Food and Drug Administration counted a total of 54,072 adverse reactions following vaccination. The FDA admitted that this number represented only 10% of the real total, because most doctors were refusing to report vaccine injuries. In other words, adverse reactions for this period exceeded half a million! (National Vaccine Information Centre, March 2, 1994) * In the New England Journal of Medicine July 1994 issue a study found that over 80% of children under 5 years of age who had contracted whooping cough had been fully vaccinated. * On November 2nd, 2000, the Association of American Physicians and Surgeons (AAPS) announced that its members voted at their 57th annual meeting in St Louis to pass a resolution calling for an end to mandatory childhood vaccines. The resolution passed without a single \"no\" vote. http://www.wellnesschiro.com/physicians_group_end_mandatory_vaccines.htm", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}