{"result_id": "261017", "URL": "https://rense.com/general57/ddee.htm", "timestamp": "2023-04-25 17:00:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general57/ddee.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Death By Lethal Vaccine Infection", "cleaned_text": "Today is my daughter's sweet 16th birthday but we will not be celebrating. Instead I will light a candle and when I blow it out I will make a wish in my daughter's memory. My wish is for all mother's worldwide, that you will educate yourselves and that you make informed choices so that you may prevent unnecessary tragedy and be spared from my pain. After 41 weeks of pregnancy, on July 27th, 1986, a perfect and healthy little baby, Laura Marie, made her entrance into the world. We were welcomed home by family and friends anxiously waiting to meet the new family member. They showered her with so many beautiful, little tiny, pink dresses, we joked that she would never be able to wear them all in one lifetime. Our lives changed completely and now revolved around stroller walks in the park, visiting friends, changing diapers, night feedings and shopping for more little pink dresses. We were parents now, we had a family and life was absolutely perfect. I took Laura for several baby check-ups at the pediatrician. She was a kind and gentle older woman. At 3 months old, the pediatrician was very pleased with Laura's development and weight gain and vaccinated her with DPT OPV. I didn't even question her, I knew that all my friend's babies had this same vaccine and \"all good mothers\" vaccinated their children to protect them. I left the pediatrician's office and walked home. Laura was very fussy, which was unusual. She was crying loudly all the way home in the stroller. When we got home, I realized she had urinated so heavily she wet everything in the stroller. Then her cry turned into screaming and she developed a fever, her leg was very swollen and red, and felt hot. I called the pediatrician who told me this was \"normal\" and to give her Tempra. I gave her baby Tempra and I felt better, the pediatrician had assured me this was normal. Laura continued to scream and I could no longer console her. My every instinct told me this was not normal but I was young with my first child and trusted the doctor. I could not hold Laura in my arms because she screamed louder as any movement of her leg seemed to cause her terrible pain. I put her in the swing and she cried herself to sleep. I was so relieved, the Tempra was working and the doctor must have been right. I began to feel silly for all my worrying. A short time later, Laura woke up screaming and spent the evening screaming and sleeping on and off. She had no appetite and nothing made her stop crying. Finally it was bedtime and she cried in her crib, until she fell asleep. She had never cried herself to sleep before and I felt very bad for letting her but if I held her, she screamed louder. My husband came home from work and I told him about everything that had happened that day. Laura was sleeping soundly in her crib and we were both relieved that she seemed to be feeling better and decided not to worry... I should have worried. In the morning I awoke and was startled to realize my husband had slept in for work. I immediately knew something was wrong and the worry from the previous night came rushing back to me. I quickly ran to her crib, with a feeling of dread. She did not look right. I closed my eyes tight and opened them again, and considered the possibility that this was a dream, but when I opened my eyes she looked dead. I went into shock and after that, much of this day remains a blur. I touched her and she was very warm. I screamed for my husband to call 911. I watched as he performed CPR, my body was frozen and I couldn't move. He tried to revive our child to no avail. He was shouting for me to open the door for the paramedics, I was temporarily jolted back to reality and I went and opened the door. I could now move but couldn't speak. I just stood there numbly shaking my head, feeling completely helpless as dozens of paramedics, police and firemen rushed past me into our home. I didn't cry, and I wanted to scream at them to leave her alone but I couldn't speak. She was on the floor and they were shocking her tiny body, in the little bedroom with the yellow painted walls and clown wallpaper. I stood there praying in my head that they would just leave her alone, that they would get out of her bedroom and that I would wake up from this horrible dream. Then I heard someone saying there was a faint pulse and I suddenly felt hopeful. She was rushed from the house in an ambulance. It was then that the homicide detectives led us into another room and the interrogation began. They decided that my husband and I needed to be questioned in separate rooms. I immediately realized they suspected that we had done this to our child. We all know that perfect children do not suddenly die for no reason. I was silent, I had already decided in my own mind that this was somehow all my fault and although I wasn't quite sure what I had done to kill her, I was convinced that I had somehow caused this to happen. Perhaps, I was being punished by god for a sin or perhaps it happened because I had let her cry herself to sleep that night. The fact remained that my child was dead and \"good mothers\" do not have dead children. My husband began to protest loudly about the line of questioning and he demanded we be taken immediately to the hospital, to see our child. The detectives finally took us to the hospital and put us in the \"bad news room.\" The doctor came and insisted we sit down before he spoke to us. He began telling us that they had tried this and that and then finally he said the words that would echo in my ears for a lifetime: The pediatrician whom I so respected and adored broke down and cried when I gave her the news on the phone. She went back and forth defending the vaccine that she was told was safe, and blaming it for killing my child and those who told her it was safe. She then told me that she also had another patient, an infant boy, die after this same vaccination. Then the detectives took us home for more questions, often repeating the same questions several times until they grew tired of asking them. The questions constantly centered around our involvement, then they searched the house and checked for signs of forced entry. My husband repeatedly told them that he thought the vaccine had killed our child and told them over and over about her unusual behavior since she was vaccinated. Everyone we knew arrived at our house. I made coffee and tidied the house, like it was any other day and we were having \"guests\". Shock is a strange and wonderful thing and of course you don't know you are in it. My parents finally insisted on taking me to their house for a few days, while my husband and his friends had the horrendous task of packing up the nursery because I couldn't stand to look at it any longer. The room I had so lovingly made was now empty and a source of great pain. Several days later, after the funeral and the tiny white coffin that was so small my husband carried it alone, I finally came out of shock and allowed myself to cry a river. I cried for all the things I would never do with my daughter. All the ballet classes I would never take her to, the wedding I would never attend, the grandchildren I would never know and all the dreams I would never realize with her. I cried for all that was and all that would never be. There was an emptiness inside of me that threatened to swallow me up whole, as I fell into the depths of grief during the darkest days of my life. The detectives eventually became satisfied that we had not harmed our daughter in any way and the investigation into her death ended. We were then left without answers. The doctors did not want to talk about her death being related in any way to the vaccine and, one after the other, refused to answer our many questions. I was repeatedly told that vaccines were for \"the greater good.\" I was even told that loss of life through immunization was \"expected\" in the war against disease but these losses were considered to be at \"acceptable\" levels. However, this did not feel very acceptable or good to me as a mother with empty arms that ached for my child. The coroner finally told us months later that the cause of death was determined to be \"SIDS\" (sudden infant death syndrome), meaning \"no known cause,\" and refused to release a copy of the autopsy report to us. It took almost a year for us to obtain this report and to our great horror, we realized that the autopsy summery was copied directly from the vaccine product monograph under the heading \"Contraindications\" as follows: \"Sudden infant death syndrome has been reported following administration of vaccines containing Diphtheria, tetanus toxoids, and pertussis vaccine. However, the significance of these reports is not clear. One common factor is the age where primary immunization was done between the age of 2 to 6 months, a period where most sudden infant death syndromes are found to 1occur with a peak incidence being at 2 to 4 months.\" There was no toxicology testing performed and the pediatrician never filed an adverse vaccine reaction report with health authorities. I later learned that most vaccine-induced deaths in this country are listed as SIDS and SIDS statistics are NOT included in vaccine adverse reaction data, even if a child dies only a few hours after receiving inoculation. This data is presented to physicians and the public to reassure them that vaccines are safe. The government's own literature advises that there has been little or no testing in the area of vaccine safety or efficacy. Essentially, our children are the test. According to their literature, immunization is \"the most cost effective\" way to prevent disease. Nowhere in their literature does it claim to be the safest. We are trading our children's lives to save the government money. We are told that the benefits outweigh the risks but many of the diseases that we vaccinate for are not even life threatening; however, the vaccine itself has the potential to kill. Vaccines kill at a much higher rate than we are led to believe. We play vaccine roulette with our children's lives and we never know which child will fall victim next. If the odds are 1 in 500 thousand for death, 1 in 100 thousand for permanent brain injury, 1 in 1700 for seizures and convulsions or one in 100 for adverse reaction, are you willing to take that chance? Are any odds acceptable enough to convince you to gamble with your child's life? I can assure you that death from vaccination is neither quick nor painless. I helplessly watched my daughter suffer an excruciatingly slow death as she screamed and arched her back in pain, while the vaccine did as it was intended to do and assaulted her immature immune system. The poisons used as preservatives seeped through her tiny body, overwhelming her vital organs one by one until they collapsed. It is an image that will haunt me forever and I hope no other parent ever has to witness it. A death sentence considered too inhumane for this county's most violent criminals was handed down to my beautiful, innocent, infant daughter, death by lethal injection. Today, on my daughter's birthday, I will grieve not only for the loss of my own child but for all the innocent children for which the benefits of vaccines do not outweigh the risks and are unnecessarily sentenced to death by lethal injection, under the guise of \"the greater good.\" The true war is not against disease; we have somehow become our own worst enemy by putting our faith in science instead of nature. Today, I call on all mothers across the world to join me in putting an end to this senseless slaughter of our most precious resource, our children. I am forwarding this ... as a tribute to baby Laura and all the other children who have been injured or killed by a vaccine so that parents can learn another side to the vaccine story. When I was almost 8 months pregnant with one of my daughters, I had volunteered to go to the Travis County Morgue with Karin Schumacher who, for years before she went to Law School, ran the NVIC news-list. Karin asked me to help her go through autopsy reports of infants listed as SIDS deaths and look at vaccination information. I will never forget the experience. We sat there in this basement buried in infant autopsy reports as my own baby kicked and turned inside of me. Here were two of our observations: 1) A highly disproportionate amount of SIDS deaths clustered at 2, 4, and 6 months -- which are the very times infants are vaccinated. If vaccines had nothing to do with these, the numbers should have been randomly spread throughout the first 6 months of life. Not so. I challenge the naysayers to go to any morgue in the country and to be honest and see what I'm talking about. 2) It was shocking at how rare it was for the vaccine information to be recorded and how little investigating into the cause of death of these babies was actually done. It floored me that the when the vaccine information was even mentioned, it was often so incomplete. Medical examiners routinely missed asking for this indispensable information and failed to note the correlation of the date when the child died to even raise the question. One of the things that struck me when reading Christine's story ... is that here we are 16 years later and so many doctors are still downplaying and denying the risks of vaccines and healthy babies are still dying after being vaccinated. One of the most offensive things that http://www.senate.gov/%7Efrist/Contact/contact.html Senator Frist has in his vaccine bill which shields the drug companies from all liability when a vaccine injures or kills someone is that he is proposing that the federal government increase the amount of money that a parent receives from the government compensation program when their child is killed by a vaccine. Parents are not willing to be bought off with this blood money. Elected officials like Frist who want to eliminate the financial responsibility of the drug companies all together and throw the bone to parents that the government will pay them more if the government mandated vaccine kills their kid need to be voted out of Congress. If you haven't sent your email notes to your senators to http://www.vaccineinfo.net/national_issues/oppose_Frist_bill_s2053.htmoppose S 2053 yet - PLEASE do! If drug companies have ZERO threat of liability, the one thing we can be certain of is that stories like [Laura's] will become far more common. The key to change is education. Fortunately, the Internet allows parents to educate parents. Please stop for a quiet moment after reading the note and say a prayer for all the babies whose lives were ended before they even got a chance to really start ... and then take the time to forward this on to other parents. I strongly urge you to forward this particular piece to everyone -- parents, expecting parents, women in their childbearing years, and anyone who may know such individuals - and ask them to forward it on, too. One of the greatest powers of the Internet is that we can spread important information quickly; another is that we are not (yet!) restricted from doing so by government or corporate bodies. Laura's tragic story is, sadly, anything but new. For years, as you can see via the links below or by searching on Mercola.com, I have http://www.mercola.com/article/vaccines/death.htm warned against vaccines, as have other credentialed physicians. The good they may do is overwhelmed by the harm they inflict, from the trauma of being stuck with endless needles to inflicting the very disease they are supposed to guard against to, as this story shows, death. There are alternate and vastly safer methods that all begin with a truly healthy diet as outlined in my http://www.mercola.com/nutritionplan/index.htm Eating Plan; of course, drug manufacturers and the government they have purchased don't want you to believe that the foods you consume and the habits you adopt are the primary solution to establishing immunity to diseases and living longer. They want you to believe that their pharmaceuticals, including vaccines, are essential to your existence, and your children's. Their wealth relies on your dependency, and so they will do everything to crush the notion of \"natural\" - meaning they don't profit from it, and you take back the control - health. They will http://www.mercola.com/2002/jul/31/hoax.htm spend three billion dollars this year alone in advertisements for their pharmaceuticals, preying on unsuspecting consumers' hopes and fears with these carefully crafted campaigns. Apparently, they will not even stop at killing our children to feed their greed. Again, I encourage you to check out the links below, and to use the powerful search feature on Mercola.com, using terms such as \"vaccine\" or \"pharmaceutical manufacturer,\" to find out how the traditional medical establishment is putting your life and the lives of those you love at risk -- and how to take back your health. Vaccine Insanity \"You were created to live in perfect health your entire life... Naturally!\"", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}