{"result_id": "261016", "URL": "http://rense.com/general15/lab.htm", "timestamp": "2023-04-25 17:00:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://rense.com/general15/lab.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "The Anthrax Vaccine Labyrinth", "cleaned_text": "Which of the following is dissembling about the anthrax vaccine, The Department of Defense (DOD), the Food and Drug Administration (FDA), Bioport, or the news media? Answer, all of the above.\n\n \n\n Get comfortable in your chair as you read this because it gets pretty complicated.\n\n \n\n In an earlier article (The Anthrax Vaccine Snafu) this writer detailed how Bioport has changed the recipe (formula) of its anthrax vaccine. This was done in anticipation of receiving a huge contract from the DOD for enough vaccine to vaccinate all of the men and women in the armed forces.\n\n \n\n Although Bioport had received several warnings from the FDA that it needed to improve the quality of its laboratory processes, Bioport voluntary shut down its lab to install new equipment and renovations. The news media erroneous reported that the FDA had shut them down.\n\n \n\n Bioport announced yesterday that it had completed all the paperwork necessary to obtain FDA approval of its improved processing and expected to start shipping vaccine again (after a three-year delay) within six months.\n\n \n\n Approval of a vaccine involves two licenses. One, a product license, establishes the chemical composition of the drug. The other is a site license, which controls the procedures used on the production line.\n\n \n\n Bioport, The FDA, and DOD are all proceeding as if the lab conditions (site license) were the only problem to be resolved. Consider the following facts uncovered in an in-depth review of all the available material on the subject.\n\n \n\n In the original formula, (which had FDA approval) two principal ingredients (formaldehyde and benzethonium chloride have not been evaluated for human consumption. Actually, The FDA never tested the stateís vaccine for human consumption. The license issued to the state lab was based on evaluation of a sample made by another manufacturer (Merke, Sharpe and Dohme) The vaccine is only effective against cutaneous (skin contact) anthrax. It has never been tested against inhaled anthrax (the deadliest form that would be used in biological weapons). Thus, neither Bioportís \"old\" formula nor the new formula (being ignored by virtually everyone) has ever been evaluated for human consumption.\n\n \n\n When the Pentagon decided to vaccinate all the troops, it acknowledged that the vaccine (old formula) had not been tested or approved for those under 18 years of age, over 65 and for pregnant women. It contemplated using both the vaccine and antibiotics to treat those exposed to anthrax (evidently not understanding or not making the distinction between cutaneous and inhaled anthrax).\n\n \n\n When the State of Michigan decided to sell its anthrax lab, two employees of the lab formed a company to buy it. However, another company, Bioport, put together by Fuad El-Hibri persuaded the two to join with Bioport, which purchased the assets of the lab basically with promissory notes to the state.\n\n \n\n When El-Hibri testified before a congressional subcommittee in June of 1999 (in conjunction with an increase in Bioportís prices to the DOD for the vaccine) he described the ownership of Bioport.\n\n \n\n Bioportís stock was split into two classes, 80% of the shares were voting, 20% non-voting. The non-voting shares were distributed to lab employees. The controlling shareholder of the voting stock is Intervac LLC. That company is owned by El-Hibri, his wife Nancy and Admiral William Crowe.\n\n \n\n Bioport owes money to the State of Michigan for royalties and promissory notes in conjunction with the purchase. It also owes several million dollars advanced to it by \"I & F Holdings\" (remember that name).\n\n \n\n When Michigan State authorities were contemplating awarding the purchase to Bioport, concern was raised about a federal law that prohibits giving a sole source contract to a foreign controlled company (Intervac). El-Hibri was a German citizen at the time although he had applied for American citizenship\n\n \n\n El-Hibri was known to have facilitated shipments of anthrax vaccine from a British company he was affiliated with to Saudi Arabia after the Saudiís had been turned down by the Pentagon. It was feared he might also ship vaccine to Iraq. In order to develop vaccines, companies must first possess live anthrax bacteria.\n\n \n\n Since Mrs. El-Hibri and Admiral Crowe were both U.S. citizens, and in view of Croweís \"service to the country,\" national security considerations were dismissed. Crowe later testified that he had made no investment in Intervac although some shares are in his name.\n\n \n\n To further complicate matters, last week it was announced that Avant Immunootherapeutics Inc. was licensing its vaccine producing technology to a defense contractor that is working to improve anthrax vaccines. The contractor was identified as Dynport Vaccine Company LLC, a subsidiary of Dyncorp a major defense contractor.\n\n \n\n Dyncorp of course has been in the news in recent years as the hirer of mercenary soldiers for various uses under state department contracts and working with the CIA.\n\n \n\n Dnycorp hired former police officers (and some current ones who took leaves of absence from their departments) to train the KLA narco-terrorists in Kosovo to perform the police function. Officers were paid as much as $101,000 per year for this service.\n\n \n\n It was also Dyncorp employees who flew the CIA plane that \"fingered\" the missionary plane that was shot down in Peru. Its employees are also involved in the crop eradication programs in Colombia and Peru reminiscent of the Agent Orange fiasco in Vietnam.\n\n \n\n However, a perusal of Dyncorpís website reveals that Dynport is not exactly a subsidiary, it is a joint venture between Dyncorp and Porton Products Ltd. (Porton) in the United Kingdom.\n\n \n\n Porton is the British equivalent of Bioport, in several respects. It is the \"privatization\" of a laboratory owned by the British government. The private buyout was organized by no other person than Fuad El-Hibri who, as a director of Speywood Holdings Ltd. (the owner of Porton) exercised oversight responsibility over Porton. It was in that capacity that he oversaw shipment of anthrax vaccine to at least Saudi Arabia.\n\n \n\n In turn, Speywood Holdings is a subsidiary of I & F Holdings (thereís that name again), an investment firm incorporated in the Netherland Antilles, a notorious haven for money laundering. In his congressional testimony, Fuad El-Hibri said I & F Holdings is owned by his father, Ibrihim El-Fuad. He did not say \"sole\" owner and no further questions were asked.\n\n \n\n The British have their share of problems with the anthrax vaccine they used on their troops during the Gulf War. The military had discovered that combining the drug with the vaccine for whooping cough significantly sped up the reaction in the anthrax procedure. This was done despite warnings by the civilian health authorities that such a combination would greatly magnify the side effects. Just as a side note, the former director of the British lab was arrested for evading over 500,000 pounds (Sterling) in value added taxes (VAT).\n\n \n\n At this point, we should take note of Fuad El-Hibriís stint at CitiGroup, the dominant investment banking fir in New York.. Fuad, at one time, was in charge of the groupís operations and credit arrangements in Saudi Arabia. Although the name of bin Laden was not the household word is today, it beggars belief not to think that Fuad had extensive dealings with the bin Laden family. Aside from the royal family, the bin Laden construction empire is one of the dominant forces in Saudi Arabia.\n\n \n\n We know from other sources that the bin Laden family had chosen Citibank and CitiGroup to handle its banking and investment interests in the United States and elsewhere.\n\n \n\n The situation today screams for an investigation into who really controls the production of anthrax vaccines, both in the U.S. and Britain, and what is in them.\n\n \n\n Donít hold your breath waiting for such an investigation. There are too many oxen to be gored. ___ Permission is granted to reproduce this article in its entirety. The author is a free lance writer based in Romulus, Michigan. He is a former newspaper editor and investigative reporter, a retired customs administrator and accountant, and a student of history and the U.S. Constitution. If you would like to receive Medium Rare articles directly, please contact us at jimrarey@provide.net. Although not necessary, we would appreciate an indication of the city and/or state or country (If outside the USA) in which you are located to give us an idea as to where our articles are being received.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}