{"result_id": "261022", "URL": "https://rense.com/general41/merc.htm", "timestamp": "2023-04-25 17:00:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general41/merc.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Vaccine Mercury 'Likely' Damaged Thousands Of Children", "cleaned_text": "(U.S. Newswire) -- A study published this month in the International Journal of Toxicology, the official journal of the American College of Toxicology, provides the strongest clinical evidence to date supporting the theory that mercury exposure is tied to autism. The study, co-authored by Mark Blaxill, a director of Safe Minds, suggests a biological mechanism for the hypothesis first advanced by Safe Minds that autism is a form of mercury poisoning and that exposure to the mercury-based preservative thimerosal in vaccines has likely caused neurological damage to thousands of children. Blaxill, along with co-investigators Amy Holmes, MD and Boyd Haley, PhD, assessed mercury exposure levels among 94 autistic children and 45 normally developing controls. They found higher pre- and postnatal exposures in the autistic group. Then they took a novel approach to measuring mercury distribution in the study subjects during infancy: they collected the first lock of baby hair that had been taken years earlier from each child to determine its mercury content. In a result that appears surprising at first, they found that the autistic hair mercury levels were only a fraction of the controls'. \"Our findings might seem counter-intuitive,\" says Blaxill, \"but if you take into account the higher exposures of the autistic children, you quickly see that these reduced hair levels suggest that less mercury was being excreted by these babies. This is because mercury must be in the blood in order to be taken up by the hair follicle, and mercury must be in the blood in order to be eliminated from the body. If it's not in the hair, then it is not in the blood. And if it's not in the blood to be eliminated, more mercury is retained and available to cause neurological damage in infants who subsequently develop autism.\" One finding of the study that will be sure to draw attention is the relatively high levels of mercury in the hair of normal infants. These levels appear to be a direct result of the number of mercury-containing amalgam fillings in the mother, as well as the mother's fish consumption, during pregnancy. Many popular fish species contain high levels of mercury. These results appear consistent with the notion that mercury levels in women of child-bearing age are already dangerously high. Thimerosal-containing infant vaccines can then push vulnerable children over the edge. \"This study provides the clearest proof we have seen so far,\" said Sallie Bernard, executive director of Safe Minds, \"that small differences in mercury exposure and detoxification ability can drive huge differences in the brain development of small children. Recent studies sponsored by vaccine health officials that have attempted to reassure parents about the safety of so-called \"low dose\" mercury exposures from vaccines have completely failed to assess individual sensitivity to this neurotoxin. It only takes one child in 100 to have reduced excretion capacity and you can have an epidemic of neurological disease on your hands.\" Safe Minds renews its call for action based on this latest report. The group calls for the following measures. - The NIH must implement and fund the Institute of Medicine's research recommendations on thimerosal, mercury and neuro-developmental disorders, including autism. - The CDC must be removed from any supervisory role in vaccine safety research. Such research should be undertaken by independent researchers without ties to the CDC or to vaccine manufacturers. - The Food and Drug Administration (FDA) should issue an immediate recall of all thimerosal-containing vaccines. The FDA and the World Health Organization should require the immediate production of thimerosal-free formulations and the investments in sterile production required to make these vaccines safe. - The Bush administration should hold a summit on the autism epidemic and encourage large-scale investigation into the environmental causes of autism, a public health crisis that dwarfs the threats from infectious diseases like SARS and the West Nile virus. - The CDC should make available its internal data from vaccine safety records to independent researchers in order to investigate the likely role of thimerosal in causing neurodevelopmental disorders in children exposed to thimerosal-containing vaccines. -- Safe Minds (Sensible Action For Ending Mercury Induced Neurological Disorders) is a non-profit parents organization founded to investigate the continuing risks to infants and children of exposure to mercury from medical products, including thimerosal in vaccines. Its Web site is http://www.safeminds.org.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}