{"result_id": "261007", "URL": "https://rense.com/general25/vacc.htm", "timestamp": "2023-04-25 17:00:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general25/vacc.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "CDC Has Plans To Force Mandatory Smallpox Vaccine On The US", "cleaned_text": "The CDC held a meeting in Atlanta on May 30, 2002 in which there were over 300 \"invited guests\" -- including the Head of the National Police Association and the Head of National Fireman's Association -- and will be conducting a series of meetings over the next two weeks to \"solicit comments on the use of smallpox vaccine before and aftera potential smallpox outbreak or bioterroist attack.\" (http://www.cdc.gov/od/oc/media/pressrel/a020530.htm) When did the CDC ever care what the general public thinks about its policies? The general public does not know the dangers of smallpox vaccine and has been conditioned to think that it is \"just another vaccine.\" Meetings will be held June 6 in NYC and SF; June 8 in St. Louis; June 11 in San Antonio. The Nat. Academy of Science will meet in Washington, D.C. on June 15 and then on June 19-20, the AdvisoryCommittee of Immunization Practices (ACIP) will meet in Atlanta and will allow 4 hours of public comment. Then ACIPwill vote on recommendations for starting smallpox vaccination.....or not. After the CDC submits its final recommendations to The White House, TommyThompson and Tom Ridgewill have the ,Äúfinal say,Äù including veto power on the recommendations. Imagine that: they are politicians -- not doctors or scientists. So, the CDC is trying to find a medium between being \"politically correct\" and public safety. Insider word has it that Tom Ridge wants to start vaccinating First responders. This has the potential to be a major disaster. The smallpox virus would be released back into the general circulation -- as a preemptive move based only on a perceived threat of potential terrorism. There are serious, potentially fatal side effects associated with this vaccine, especially for patients who are immuno-suppressed: those with diagnosed and undiagnosed HIV/AIDS; on steroids such as Prednisone; have cancer; have had an organ transplant; or have eczema. The virus can easily be passed from someone who has been vaccinated to one of these people. The CDC is suggesting \"ring vaccination\" as a means of containment in the event of an attack, butthere is a caveat: 100% compliance is necessary to make it work...meaning, that even those with medical contraindications will most likely be vaccinated. This truly has the potential for deadly consequences. Once the virus is released, no one really knows what will happen. And the risk of spreading it around the world is nearly 100%. Reintroducing this vaccine has the potential for having greatest adverse effect on the health of Americans in our history. I will be testifying in St. Louis as one of the national experts on the adverse effects of vaccination and I planto attend the ACIP meeting in Atlanta. Please let your friends and family members know that this is NOT 'just another vaccine' and the risk of the vaccine is still much greater than the risk of the disease.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}