{"result_id": "261006", "URL": "https://rense.com/general11/vacc.htm", "timestamp": "2023-04-25 17:00:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general11/vacc.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "California Senate Says NO To Two New Vaccine Mandates", "cleaned_text": "An historic action was taken this week by the California Legislature by defeating two bills that would have added six new shots to the already overcrowded childhood immunization schedule (currently 39 doses of various vaccines by the age of two years old). The action on Wednesday was the first time in the history of California that legislation adding new vaccines to the mandatory childhood immunization list have been defeated. The two new required immunizations were for Hepatitis A and Prevnar, a vaccine that has been falsely promoted as an ear ache preventative vaccine. If these two vaccines were added to the Childhood Immunization Schedule, it would have required two doses of Hep A and four doses of Prevnar. Both bills passed the State Assembly without opposition and on nearly unanimous votes. Although strongly supported by the vaccine manufacturers and the public health community before the Senate Health and Human Services Committee on Wednesday, it was the testimony of two parents, a mother whose baby was killed by vaccines, and the father of a vaccine induced autistic son whose testimony before the committee resulted in the bills failing passage. It was a classic case of David vs. Goliath (or in this case David and Dawn vs. Goliath). The Committee also voted to hold hearings on the bills to ascertain if there was any justification to subject millions of children in California to these six new shots, and to establish a scientifically based process to review the process and approval of any new vaccine mandates before bills are introduced to require their use. The Committee has placed a moratorium on adding any new vaccines until that process has been completed. Opposition testimony centered on the facts that: 1. There are over 300 new vaccines in the pipeline 2. California children are already subjected to 39 doses of vaccines by the age of two years old 3. That vaccines contain mercury, formaldehyde, aluminum, MSG, live viruses, killed bacteria, and other potent toxic agents 4. That there has never been a single safety study on the interaction of any of these vaccines or any long term safety studies; 5. That the need to mandate that all of California's children be vaccinated with Hep. A vaccine was unfounded and unnecessary 6. That Prevnar has only been in use for less than one year, resulting in large numbers of adverse reactions including death.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}