{"result_id": "261042", "URL": "https://rense.com/general62/inno.htm", "timestamp": "2023-04-25 17:00:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general62/inno.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Innoculations - The True Weapons Of Mass Destruction Causing VIDS (Vaccine Induced Diseases) An Epidemic Of Genocide", "cleaned_text": "\"One basic truth can be used as a foundation for a mountain of lies, and if we dig down deep enough in the mountain of lies, and bring out that truth, to set it on top of the mountain of lies; the entire mountain of lies will crumble under the weight of that one truth. And there is nothing more devastating to a structure of lies than the revelation of the truth upon which the structure of lies was built, because the shock waves of the revelation of the truth reverberate, and continue to reverberate throughout the Earth for generations to follow, awakening even those people who had no desire to be awakened to the truth.\" (by Delamar Duvaris as written in the preface of \"Behold the Pale Horse\" by William Cooper). The basic truth that served as the foundation for the mountain of lies known as vaccinations was the observation that mammals who recover from infection with microorganisms acquire natural immunity from further infections. Whenever T cells (the little packman cells which kill viruses, bacteria, and cancer cells, thus conferring cellular immunity) and B cells (antibody producing cells which confer humoral immunity) are activated by various substances foreign to the body called antigens, some of the T and B cells become memory cells. Thus, the next time the individual meets up with that same antigen, the immune system can be quickly triggered to demolish it. This is the process known as immunity. This truth gave birth to a beLIEf that if a foreign antigen was injected into an individual, that individual would then become immune to a future infection. This beLIEf, (you see the lie in the middle), was given the name, \"vaccinations\". What the promoters of vaccination failed to realize is that the respiratory tract of ALL mammals (since animals are just as devastated by these inoculations with disease as are humans) contain secretory IgA (an antibody which initiates the natural God given immune response) within the respiratory tract mucosa. Bypassing this mucosal aspect of the immune system by directly injecting organisms into the bloodstream leads to a corruption in the immune system itself. As a result, the pathogenic viruses or bacteria cannot be eliminated by the immune system and remain in the body, where they will further grow and/or mutate as the individual is exposed to ever more antigens and toxins in the environment which continue to assault the immune system. The mechanism by which the immune system is corrupted can best be realized when you understand that the two poles of the immune system (the cellular and humoral mechanisms) have a reciprocal relationship. Thus, when one is stimulated, the other is inhibited. Since vaccines activate the B cells to secrete antibody, the T cells are subsequently suppressed. This suppression of the cell mediated response is a key factor in the development of cancer and life threatening infections. In fact, the \"prevention\" of a disease via vaccination is, in reality, an inability to expel organisms due to the suppression of the cell-mediated response. Thus, rather than preventing disease; they actually prevent the disease from ever being resolved. The organisms continue circulating through the body, mutating and transforming into other organisms (as demonstrated by the work of Professor Antoine Bechamp), depending on the acidity and toxicity of the internal terrain of the body. Note that Bechamp proved that Louis Pasteur's \"germ theory\" of disease was incorrect due to this ability of organisms to transform and mutate based on the body's internal terrain (as Pasteur admitted on his deathbed). Thus, treatment of infection with antibiotics as well as \"prevention\" of disease with vaccines are both just examples of cutting off the branches of dis-ease, when the root of the cause is a toxic internal environment. However, since Pasteur's germ theory was conducive to the profits of the burgeoning pharmaceutical companies who only manage dis-ease, no mention of the work of Professor Bechamp has been made in medical school curricula. To make matters worse than the suppression of cellular immunity which occurs when vaccines are injected, adjuvants (which are substances added to vaccines to enhance the antibody response) can actually lead to serious side effects themselves. Adjuvants include oil emulsions, mineral compounds (which may contain the heavy metal aluminum), bacterial products, liposomes (which allow delayed release of substances), and squalene. The side effects of adjuvants themselves include hyperactivity of B cells leading to pathologic levels of antibody production, as well as allergic reaction to the adjuvants themselves (as demonstrated in Gulf War I soldiers injected with vaccines containing the adjuvant squalene, to which antibodies were found in many soldiers). Note that the pathologically elevated hyperactivity of antibody production caused by adjuvants also results in a distraction from the other antigens that the immune system encounters \"naturally\", which must be addressed to maintain health. This hyperactivity of the humoral (antibody producing) pole of the immune system is, in this author's opinion, the sole cause of all autoimmune diseases. The only thing which determines which autoimmune disease you develop is which tissues in your body are attacked by auto-antibodies. If the inside lining of the gastrointestinal tract (the mucosa) is attacked by auto-antibodies you develop leaky gut syndrome (which leads to food allergies when partially digested food particles are released into the bloodstream, are recognized as antigens foreign to the body, and elicit an antibody response against those food particles that becomes heightened every time that same food is eaten and released into the bloodstream partially digested again). Crohn's disease and colitis are also caused by auto-antibody attack on the mucosa of the GI tract itself. If the islet (insulin producing) cells of the pancreas are attacked by auto-antibodies, you develop insulin dependent (juvenile) diabetes. If the respiratory mucosa is attacked by auto-antibodies, you develop \"leaky lung\" syndrome where, just as with leaky gut, antigens recognized as foreign to the body which are inhaled are able to traverse the lining of the respiratory tract, causing the creation of antibodies against those antigens (usually dust, mold, pet or pollen antigens). When these substances are inhaled again, the allergic response producing constriction of the bronchioles is called asthma. If the components of the articular surface of the joints are attacked by auto-antibodies, you develop rheumatoid (or juvenile) arthritis. If the skin is attacked, you develop \"leaky skin\" syndrome, where contact antigens which could not otherwise traverse the skin are allowed in, leading to skin allergies to contact antigens. Additionally, depending on which level of the skin is attacked by auto-antibodies, (i.e., the epidermis or dermis), you develop eczema, psoriasis or scleroderma. If the kidney tissue is attacked by auto-antibodies, you develop one of the many types of nephritis, depending on which component of renal tissue is attacked (for example, with glomerulonephritis, the basement membrane of the glomerular apparatus within the kidney (which filters blood to form urine) is attacked by auto-antibodies, thus allowing protein to escape from the serum into the urine). If you develop auto-antibodies against thyroid gland tissue, you develop Grave's disease. If you develop auto-antibodies against the tissue of the thymus gland (which is crucial in T cell production and function), you develop myasthenia gravis. If you develop auto-antibodies against the very DNA in the nucleus of all cells, you develop systemic Lupus (thus, the potential autoimmune potential of DNA vaccines being developed now is self evident; worse yet, DNA components from these vaccines can be incorporated into your DNA, leading to actual genetic changes which could cause extinction of all (vaccinated) life on the Earth). And on, and on, and on. The brain and spinal cord can also be attacked with auto-antibodies (which this author refers to as vaccine induced encephalitis), leading to a variety of neurological diseases. The most severe of these, leading to death, are sudden infant death syndrome (SIDS) and most cases of \"shaken baby syndrome\". If components of the myelin sheath (the insulating covering of nerve fibers which allows proper nerve conduction) or the actual neurofilaments themselves are attacked by auto-antibodies, the resultant condition is determined solely by the location of the damage done. Such neurological conditions include but are not limited to minimal brain dysfunction, ADD/ADHD, learning disabilities, mental retardation, criminal behavior, the spectrum of pervasive developmental disorders (including autism), multiple sclerosis, Parkinson's, Lou Gehrig's disease, Guillen Barre,, seizure disorders, etc., etc. etc. (Please note that other toxins are also sometimes involved, such as: aspartame, Lymes and mercury in cases of MS; aspartame in seizures; or pesticides in cases of Parkinson's). Thus, when detoxing to reverse these diseases, these other substances must also be detoxed to obtain a full recovery. However, the corruption of the immune system caused by the injection of vaccines is a key component in these disease states leading to immune malfunction, and is the reason why an autistic child may also have leaky gut or eczema, etc. Note that myelin production, for the most part, does not begin until after birth. Most myelin is apparently laid down by age 5 years and usually completed by age 10 years, judging by the level of success at various ages in reversing autistic and other neurological VIDS symptoms that this author has observed in hundreds of children by detoxing the viruses with homeopathic nosodes, and repairing the immune corruption by simultaneous administration of bovine colostrum (i.e., after 10 years of age, the ability to stop and repair auto-antibody induced damage in the myelin sheath and neurofilaments themselves is dramatically decreased). Thus, the hyperactivity of the humoral arm of the immune system in autoimmune disease is caused by adjuvants added just for that purpose. However, the autoimmunity itself (i.e., antibody against self) has several mechanisms, including the following: 1. The antigens present in the culture media itself cannot be completely filtered and separated from the organisms cultured thereon. Thus, any antibodies formed against antigens from the culture cells themselves (for example myelin basic protein from chick embryos or the 13 vaccines which now contain aborted fetal cells) can cross-react to form an autoimmune reaction against the myelin basic protein in your myelin sheath, etc. 2. Molecular mimicry is due to similarity of proteins contained in organisms and mammals. (For example, the measles virus is made up of proteins similar to myelin basic protein; thus, antibodies formed against the measles virus antigens subsequently also cause an auto-antibody attack against myelin basic protein in the myelin sheath due to cross reactivity of these antibodies). 3. intentional inclusion of antigens in vaccines to cause formation of antibodies that attack specific hormones or races (for example, experiments done on women of childbearing age in the Philippines and probably other locations where HCG (human chorionic gonadotropin, the hormone produced when women first become pregnant) placed into vaccines given these women resulted in antibodies against the HCG hormone, and subsequent spontaneous abortion thus occurred when the women became pregnant. It is also this author's hypothesis that the epidemic of vitiligo in people of color (hypo pigmentation of skin caused by auto-antibody attack on melanocytes (melanin producing cells) in skin) is also occurring due to intentional inclusion of melanin in vaccines given to people of color. In addition to the above phenomena which lead to simultaneous depression of cellular immune function and hyperactivity of humoral immune function, vaccines also contain other toxic substances which can cause serious side effects themselves. The following ingredients are actually listed on the CDC website with this introductory statement: \"Many things in today's world, including food and medicines, have chemicals added to them to prevent the growth of germs and reduce spoilage.\" Translation: you,re already toxic, so what's the big deal with adding more poison? This author's answer to that question is that any immunotoxin can end up being the \"straw that breaks the immune system's back\" in that individual, leading to dis-ease. This is where genetics is key; i.e., not that what disease you develop is actually caused by some \"gene\" in most cases; but rather that your genes determine the strength of your immune system (i.e., how many assaults your immune system can take before it reaches critical mass, and you develop a dis-ease). Some additional ingredients in vaccines (as listed by the CDC on their website) include antibiotics, aluminum gels, formaldehyde, monosodium glutamate (MSG), egg protein, and sulfites. Thus, we have antibiotics (which you could be allergic to); aluminum (highly involved in causing Alzheimer's disease); formaldehyde (a toxic carcinogenic substance used to pickle dead people); MSG ( a potent excitotoxin which, like aspartame, can cause seizures, brain tumors, etc.); egg protein (to which you could have a life threatening anaphylactic reaction); and sulfites (another toxin which we are advised not to consume much of orally, but in vaccines, it is injected directly into the blood stream). Is this not a veritable witch's brew of chemicals, organisms, and animal or human (aborted fetus) body parts? Note in this list that they do not mention the ethyl-mercury containing preservative thimerosol, which has been the only dangerous substance in vaccines to receive mainstream media attention (albeit most of that being disinformation) after the explosion in the rate of occurrence of autism in the last generation became self-evident proof that vaccines are the causative factor. For, although the scientists working for the medical mafia continue to use statistics to twist and spin their data to make us beLIEve that vaccines are not the cause, too many thousands of parents have watched their children enter the downward spiral into autism after their children received the vaccine which was the straw that broke the back of their child's immune system. No matter what the \"white coats\" tell these parents; they know the truth! Mercury (also in dental amalgam fillings) is a highly toxic heavy metal, has been documented to cause cancer, and can be absorbed through the digestive track, skin, and respiratory track. Mercury is 1,000 times more toxic than lead, and is second only to uranium as the most toxic metal. If children receive all recommended vaccines, they will receive 2,370 times the \"allowable safe limit\" for mercury in the first two years of life (as if there is such a thing as a \"safe\" amount of a toxic poison). Yet, even after Congressional hearings instigated by Congressman Dan Burton (whose own grandchild became autistic after receiving vaccines) resulted in the FDA requesting (not ordering) vaccine manufacturers to remove this toxic heavy metal from their products, mercury is still present in many vaccines. Although the symptoms of mercury poisoning are identical to the symptoms of autism, it should be noted that most children who descend into the hellish state known as autism do so after the MMR vaccine. The MMR vaccine is one of the few vaccines that do not contain mercury. Thus, it is self-evident that the removal of mercury will not make vaccines \"safe\". (This is why the mercury is the only thing being addressed at all; because when the people reading this paper realize that the very mechanism by which vaccines corrupt the immune system means that NO vaccine is safe and effective; there will be an evolution of consciousness where the structure of lies telling us vaccines are safe and effective disintegrates.) In the autistic community, this will lead to an exodus from the multiple autism groups saying it is all about the mercury or worse yet, that autism genes are \"inherited\", to the only group which has their focus on the actual problem. This group is named TAAP (the Autism Autoimmunity Project at www.taap.info/), and is led by April Oakes. In this author's opinion, it will be TAAP in alliance with the vaccine damaged soldiers and vets of the American Gulf War Veterans Association at www.agwva.org led by Peter Kawaja which, working together, will stop this holocaust on humanity called VIDS. The good news is that these VIDS can be reversed using natural remedies contained in the Hippocrates Protocol (www.drcarley.com). This \"surgical strike\" detoxification approach which has the potential to reverse ALL of the aforementioned conditions under the VIDS umbrella as long as detoxification is started early enough (before age 10 for neurological VIDS) will be the one truth put on top of the mountain of lies (that vaccines are safe and effective) that will cause the entire mountain of vaccine lies to crumble. Combined with a massive outpouring of public support to these two organizations, the root of the tree of vaccine evil will be exposed. Thus, the holocaust on humanity (where instead of people being put in concentration camps, the concentration camps are being put into the people) will finally be put to an end. Unfortunately, we can no longer pretend that this epidemic of VIDS is merely a \"mistake\" made by good intentioned, albeit misguided mad scientists. Because it's even worse than the above, folkswe are talking TREASON and CRIMES AGAINST HUMANITY, PETS, and even PLANTS, (which are also being genetically modified to create vaccines). The evidence for this is as follows: As concern for population growth started to grow and the final plans to bring in the New World Order were put in place, this lie called vaccines was transformed into pure evil, as it was realized that such delivery systems could be used to intentionally cause disease, which is now being done under the US Code, Title 50, Chapter 32, § 1520 and 1524. You can read it for yourself at your local library, or go to This law has been in place since the 1960's, and it was last modified in April of 2000. The only stipulation made for experimentation on human subjects is that local civilian officials be notified 30 days before the experiment is started. Section 1524 adds that the Secretary of Defense may enter into agreements with the Secretary of Health and Human Services to provide support for vaccination programs through use of excess peacetime biological weapons (i.e., weapons of mass destruction). In April 2000, § 1520 (a) was passed to put alleged restrictions on the use of human subjects for testing of chemical or biological agents after a caller on C Span mentioned this law in 1999, which revealed this treasonous law to a huge audience of listeners (including this author, who has been including it in lectures and written materials since that call came into \"Washington Journal\"). However, the exceptions written to Title 50, chapter 32 under § 1520 subsection (b) in the 2000 law passed by our aiders and abettors of treason in Congress not only loophole back in a test carried out for \"any peaceful purpose that is related to a medical, therapeutic, pharmaceutical, agricultural, industrial, or research activity\"; but add that such biological and chemical warfare agents can now be also used for any law enforcement purpose, including \"any purpose related to riot control\" (just in case those C Span listeners should actually get off the couch at the horror of what the traitors in Washington, D.C. are doing to God's people). Subsection (c) of this law now mandates that \"informed consent\" be required. In reality, not a single vaccine has ever been tested for its long term side effects (including carcinogenic potential). Additionally, the intentional introduction of stealth viruses, (including man-made viruses that cause cancer, mycoplasma and the HIV virus), antigens which target certain races, (and surely a microchip in the future) into vaccines makes it self evident that informed consent is impossible, as it would initiate impeachment proceedings and war crimes trials against every \"public servant\" involved in perpetrating these crimes against the American people, in violation of the Nuremberg Code (which was written after the end of WW II to prevent the barbaric experiments that occurred in the Nazi concentration camps) . What most people don't know is that the top level mad scientists from Nazi Germany were actually brought to the United States through \"Operation Paperclip\", and have been continuing their work to this day in places like Brookhaven labs, Cold Spring Harbor and Plum Island in this author's backyard on Long Island. (To see the document proving that American scientists created the HIV virus, this author refers you to p. 442 of Death in the Air by Dr. Leonard G. Horowitz, where you can read the 1969 document in which the U.S. military/CIA and Rockefeller directed National Academy of Sciences-National Research Council (NAS-NRC) announced that a research program to explore the feasibility of \"creating a new infective microorganismwhich would be refractory to the immunological and therapeutic processes upon which we depend to maintain our relative freedom from infectious disease\" could be completed at a total cost of $10 million.) Yes, this is what your tax dollars are going towards, folks. But hang on to your hat, because it only gets worse. The most heinous, bone chilling and evil piece of this puzzle has been revealed to the world by an American hero named Peter Kawaja, who worked in the late 1980's as a security and counter terrorism expert for the United States government (a service for which he has been rewarded with the murder of his wife, torching of his home, issuance of a war crimes subpoena to (they thought) confiscate all his evidence, illegal IRS liens on all subsequent income, and multiple attempts on his own life, all funded by YOUR tax dollars). Please go to www.agwva.org/mission.htm and read some of the 34 counts that Mr. Kawaja brought against the domestic traitors to America (in both their individual and governmental capacities) in a federal lawsuit in which the perpetrators, again, used your tax dollars to hire themselves attorneys from the Department of \"Justice\" whose defense of their war criminal clients was that they are \"immune, under color of law\". (You can listen to Mr. Kawaja on one of his multiple internet radio shows, including \"What's Ailing America?\" which he co-hosts with this author at www.highway2health.net every Wednesday at 10 PM, EST. Dr. James R. Shannon, former director of the National Institute of Health reported in December, 2003 that \"the only safe vaccine is one that is never used\". However, the reverberating truth, \"the shot heard round the world\" which will lead to the evolution of consciousness necessary to stop the holocaust against humanity known as vaccinations, will be that not only are vaccinations not safe or effective, but that they are actually weapons of mass destruction being perpetrated upon humanity in the name of health, for the purpose of genocide and to bring in the New World Order. Part 2 of the genocidal plan could drop anytime with activation of the Model State Health Emergency Powers Act whenever the next fabricated terrorist attack using biological agents occurs. Worse yet, the Congressional traitors in Washington posing as public \"servants\" are doing all they can to pass \"Codex\" legislation which will make the natural remedies and supplements used in the Hippocrates Protocol developed by this author to reverse all dis-eases only available by prescription. So, you didn't hear about that on your local news station either? Please go to the site of another American hero, John Hamill of the International Alliance for Health Freedom (who reversed his schizophrenia symptoms with these natural supplements and has dedicated his life to stop Codex from passing) at www.iahf.com . Wake up, America-it's getting very late.it is time for the mountain of lies to crumble. Please spread the world to everyone you know we can make it happen. The time to stop chopping at branches and get to the root of this evil is now.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.surfingtheapocalypse.net/cgi-bin/forum.cgi?read=51420"], "authors": [], "publish_date": null}