{"result_id": "261035", "URL": "https://rense.com/general37/moreproof.htm", "timestamp": "2023-04-25 17:00:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general37/moreproof.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "More Proof Childhood Vaccines Cause Diabetes", "cleaned_text": "(PRNewswire) -- The prestigious peer reviewed journal, Journal of Pediatric Endocrinology and Metabolism published a study this week by Dr. J. Bart Classen, an immunologist at Classen Immunotherapies, and David Carey Classen, an infectious disease specialist at the University of Utah, providing support for a causal relationship between several common pediatric vaccines and the development of insulin dependent diabetes. Their previously published work proved the hemophilus vaccine, a common pediatric vaccine, caused a 25% rise in insulin dependent diabetes in children under the age of 7. Classen's research indicates most cases of diabetes caused by vaccines occur between 24 to 48 months after immunization of young children but the delay can be shorter in older children with prior damage to their pancreas. The time delay between vaccination and diabetes corresponds exactly to work from several independent groups which showed a similar delay between the initiation of autoimmunity to the insulin secreting islet cells and the development of diabetes. \"Our results conclusively prove there is a causal relationship between immunization schedules and diabetes. We believe immunization schedules can be made safer,\" stated Dr. Bart Classen. \"Our findings help identify those who have been injured by vaccines and are eligible for compensation.\" Parents who think their children may have developed diabetes or any other autoimmune disease from vaccines must file a claim with the US government within 3 years of the onset of the disease in order to ensure eligibility for compensation. There is generally no cost for filing a claim.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}