{"result_id": "261024", "URL": "https://rense.com/general96/most-who-take-the-vaccine-will-die.php", "timestamp": "2023-04-25 17:00:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general96/most-who-take-the-vaccine-will-die.php", "encoding": "iso-8859-1"}, "image": null, "domain": "rense.com", "title": "Dr. Judy Mikovits Says That It's Likely That Most Who Take The Vaccine Will Die...50 Million", "cleaned_text": "This may be one of the most important articles I've ever written. With all the fear mongering about the corona virus plague it has obviously been known this was intentional as its been advertised by Bill Gates it would come at this time and it was funded. No need to add all the volume of videos and emails you can google but here's one for reference https://goldenageofgaia.com/ 2020/04/18/dr-rashid-buttar- exposes-bill-gates-dr-fauci- and-falsified-pandemic- numbers/ \n\n \n\n I'm concerned that every single person who tested the vaccine, 100%, had reactions and now Dr. Judy Mikovits says in this video probably all who take the vaccine, especially if mandated, 50 million people, will die. You may remember in developing this virus she was asked to make it more dangerous where it would kill faster and when she refused to sign manipulated data was thrown in jail. When released she was told she would be returned if she told anyone. Instead she wrote the book and set up an organization to educate physicians. They tried to silence her by trying to discredit her. She is a brave woman, a virologist, and simply came out stronger making a documentary, \"Plandemic\" and constantly being interviewed. Here is the video about the vaccine. \n\n \n\n https ://video.search.yahoo.com/yhs/ search?fr=yhs-iba-1&hsimp=yhs- 1&hspart=iba&p=dr.+judy+ mikovits#action=view&id=22& vid= 44450d01e0f4d62897d02313788212 6e \n\n \n\n Two days ago I released a video from the front line physicians saying they had a cure for the corona virus and one physician said she was outraged by the censorship and they were curing all their patients and nobody died and no one was wearing a mask. She was appalled she was threatened for giving the facts and letting people know there was a cure. Meanwhile Big Pharma wants it off the market. The video was going viral and immediately was censored, even the one I had. Today all the doctors who had the original press conference came back and said they would not put up with the censorship and told who censored and again said they had the cure for the corona virus. They were infuriated because they are on the front line and curing the corona virus. One doctor said you can't shut up all the doctors, and even ask your own physician. Here is the video today from all these physicians: https://www.youtube.com/watch? v=cY0TH-DTYEI&feature=youtu.be What is the cure? HYDROXYCHLOROQUINE and zinc they mentioned. You may remember that Dr. Russell Blaylock listed the things you take and it included zinc because it stops mutation. \n\n \n\n Here is an interesting subject completely apart from the subject of the plague. I have an anticancer cure I used and published in two of Dr. Leonard Coldwell's books: \"The Only Answer to Cancer\" and \"The Only Answer to The Only Cancer Patient Cure\". It's mainly herbs but it has one drug - Quinine. You use to be able to get it in the drug store without a prescription. People used it for things like leg cramps. Once the FDA found out about the formula Quinine could only be gotten by prescription. That was no problem as patients just asked their physician for an Rx. Then a note came out that you could only prescribe it for malaria and other devastating diseases. I wondered what was the big deal about Quinine. \n\n \n\n Of interest is that Hydroxychloroquine is an antimalarial drug derived from quinine. Herbalist Earl Rayburn had 800 letters from victims who were dying of cancer who were cured on my formula. The FDA found out he supplied the herbs to make the formula so they sent the Forestry to kill his acreage of herbs. It's a small town and so many people know each other. One of the men from the Forestry came to Earl and said: \"I have to apologize for what we did. The FDA made us do it, Big Pharma said they couldn't have cancer cured.\" They were basically trying to kill black snake root that grows there and Earl tried to buy it on the Internet but it turned out to be Rhubarb. Earl bought herbs trying to keep the formula going but the FDA fined him $75,000 and then made him sign a paper he wouldn't tell anyone. Then they expunged the record. \n\n \n\n Earl is dead today. His wife didn't know why he died but I told her I had promised him I would expose the FDA for what they did and published it so his children would know what a great man their father was trying to help all he met. I named the formula for my mother, Eve Geller, who died of breast cancer. Simply, cancer cannot live in purified blood. Big Pharma pushes chemotherapy even though studies show all it does is spread the disease. It killed my mother. \n\n \n\n Hydroxychloroquine is also used for Lupus and Rheumatoid Arthritis, This is where aspartame is a connection. As Dr. James Bowen said: \" The ability of methyl alcohol/formaldehyde to create antigenicity, especially as combined in APM molecules is so great as to cause severe autoimmune reactions to the tissues deformed by formaldehyde polymerization, adduct formation. The immune system turns against the victim's tissues: Lupus.\" \n\n \n\n I also wrote a paper on aspartame and the corona virus: https://rense.com/general96/ aspartame-inflames- coronavirus.php \n\n \n\n Today the aspartame pandemic is called Rumsfeld's Plague. The medical text on it is \"Aspartame Disease: An Ignored Epidemic\" by H. J. Roberts, M.D., Other texts are \"While Science Sleeps: A Sweetener Kills\" by Dr. Woodrow Monte and \"Excitotoxins: The Taste That Kills by Dr. Russell Blaylock. \n\n \n\n I sincerely hope the above information will help the public. You no longer can just accept what people say, you must do your own research. Scientific fraud so many times results in death. In reading about the plague of 1918 an article exclaimed it was the cure that killed so many. Dr. Cameron Kyle- Sidell of New York is warning that critically ill coronavirus patients are being inadvertently harmed by the very same breathing machines being used to keep them alive. He said 50% died. \n\n \n\n In the case of the corona virus they have censoring of information that may save your life and threatening of physicians. You must do your own research. Here is a report from \"No Fake News\" on the drug: https://blog.nomorefakenews. com/2020/07/30/hcq-covid-fda- and-pharma-and-all-its-whores/ \n\n \n\n Stephen Fox, (Mission Possible New Mexico and Founder, United Nations Santa Fe) has filed a brief with the International Court of Justice on aspartame. https://www.opednews.com/ articles/Brief-Submission-for- Inter-by-Stephen-Fox-92- Aspartame-Poisoning-Symptoms- According-To-Fda_Arthur-Hull- Hayes-Fda-Commissioner- Approved-Aspart_Donald- Rumsfeld_Dr-Betty-Martini- Founder-Mission-Possible- 200729-410.html \n\n \n\n The Aspartame Pandemic or Rumsfeld's Plague is pure genocide, and is being used unlabeled. People have been dropping dead, going blind and suffering with methanol poisoning for 40 years from aspartame. The FDA is blaming it on a small amount of methanol in hand sanitizers: https://www.dermatologytimes. com/view/fda-expands-toxic- hand-sanitizer-list \n\n \n\n Look for the facts. If you see someone calling people names, trying to discredit them and making them out as a conspiracy theorist its usually the modus operandi of industry. \n\n \n\n Sincerely, \n\n \n\n Dr. Betty Martini, D.Hum, Founder \n\n Mission Possible World Health Intl \n\n 9270 River Club Parkway \n\n Duluth, Georgia 30097 \n\n 770 242-2599 \n\n www.mpwhi.com \n\n More information on www.wnho.net and www.holisticmed.com/aspartame", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.truehealthfacts.com/homozon/homozon_home.html", "http://www.truehealthfacts.com/remag-magnesium.html", "https://www.barnesandnoble.com/w/dark-horizons-glenn-allen-becker/1129540700?ean=9781948858571", "http://www.truehealthfacts.com/liquid-zeolite.html", "https://www.rense.com/products/ac1.htm", "https://goldenageofgaia.com/2020/04/18/dr-rashid-buttar-exposes-bill-gates-dr-fauci-and-falsified-pandemic-numbers/", "https://video.search.yahoo.com/yhs/search?fr=yhs-iba-1&hsimp=yhs-1&hspart=iba&p=dr.+judy+mikovits#action=view&id=22&vid=44450d01e0f4d62897d023137882126e", "https://video.search.yahoo.com/yhs/search?fr=yhs-iba-1&hsimp=yhs-1&hspart=iba&p=dr.+judy+mikovits#action=view&id=22&vid=44450d01e0f4d62897d023137882126e", "https://www.youtube.com/watch?v=cY0TH-DTYEI&feature=youtu.be", "https://rense.com/general96/aspartame-inflames-coronavirus.php", "https://blog.nomorefakenews.com/2020/07/30/hcq-covid-fda-and-pharma-and-all-its-whores/", "https://www.opednews.com/articles/Brief-Submission-for-Inter-by-Stephen-Fox-92-Aspartame-Poisoning-Symptoms-According-To-Fda_Arthur-Hull-Hayes-Fda-Commissioner-Approved-Aspart_Donald-Rumsfeld_Dr-Betty-Martini-Founder-Mission-Possible-200729-410.html", "https://www.dermatologytimes.com/view/fda-expands-toxic-hand-sanitizer-list", "http://www.mpwhi.com/", "http://www.wnho.net/", "http://www.holisticmed.com/aspartame"], "authors": [], "publish_date": null}