{"result_id": "261034", "URL": "https://rense.com/general11/aidsvac.htm", "timestamp": "2023-04-25 17:00:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general11/aidsvac.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Report Predicts Massive US Resistance To Mandatory AIDS Vaccine", "cleaned_text": "- A new report predicts massive resistance to a mandatory AIDS vaccine is coming in the U.S. in the next few years. Millions of parents would refuse to have their children vaccinated by any variation of an HIV/AIDS shot, the Committee to Protect Medical Freedom said at a news conference Wednesday. The paper, titled \"If AIDS doesn't kill you, the AIDS vaccine will,\" declared an AIDS vaccine would have HIV in it. Among those supporting the findings of the study was Dr. Howard Umovitz, a prominent member of a group of scientists calling for an HIV/AIDS vaccine moratorium. Jim Turner, a Washington attorney and expert on the swine flu vaccine scandal of the 1970s, lent his support, as did Barbara Lee Fisher, co-founder and president of the National Vaccine Information Center. Redmond Handy, an opponent of the military's mandatory anthrax vaccination program, also warned of what he sees as the dangers of rushing into a mandatory AIDS vaccine program. The thrust of the report, written by Clifford Kincaid, is that there's big money in rushing the an AIDS vaccine to market, some of it tied up in conflict-of-interest questions involving the promoters and their connections with companies that stand to benefit. More to the point, he says, there are indications that the vaccine, possibly to be administered to 11- to 12-year-old children, or perhaps earlier, contains a risk of inflicting the very disease it is intended to prevent. Promoting the idea of a mandatory AIDS vaccine is United Nations Secretary-General Kofi Anan, along with high-tech magnate Bill Gates. Kincaid challenges them to take the vaccine themselves if they are so certain it is safe. Some of the discussions on radio talk shows around the country indicate \"the U.S. could witness massive civil disobedience against a massive mandatory HIV/AIDS vaccine. Parents want to know what is in the vaccine, and they should be told that it is a form of HIV that the government says can cause AIDS,\" the report alleges. Jon Cohen, author of \"Deep Denial,\" published by the New York Academy of Sciences earlier this year, is quoted as saying that \"medical products sometimes do the opposite of what they are supposed to do, causing illness rather than alleviating it. Such risk, of course, is common to all drugs, but at least many sick patients accept that they would have fared poorly even without the ill-fated drug treatment. Vaccines, in contrast, are administered to [healthy] people, often children.\" Which means the vaccine would be targeted at those without AIDS. Further, AIDS is most likely to be avoided by choosing a healthful way of life. The study asks: Does it make sense to subject innocent children or AIDS-free military personnel to a risk that could be greater than the that of the disease, depending on the habits chosen as they go forward in their lives? Polio and smallpox, for example, could strike without warning. The public has been warned about AIDS and how to avoid it. In anticipation of Wednesday's news conference, various health agencies have told Gannett News Service there was no plan to make the AIDS vaccine mandatory for any American. But Kincaid, the director of the Committee to Protect American Freedoms, says the proof is available at the Web site of the U.S. Military HIV research program, where it is openly stated that AIDS vaccines under development will be \"licensed and used to protect military personnel.\" These shots are not voluntary in the military service, he says. Kincaid added that Dr. Deborah Brix, who runs the program, could have made the denial in the 30 days since he asked her in writing a series of questions about the program. His question included: \"Who made the decision to use and mandate this vaccine on U.S. military personnel?\" Barbara Loe Fisher, co-founder of the National Vaccine Information Center, reports that a member of the federal committee that recommends vaccine for children had said that an AIDS vaccine would be tested and then forced on all 12-year-old children. Neal Halsey, M.D., chairman of the American Academy of Pediatrics (AAP) Committee on Infectious Diseases, reminded HIV vaccine researchers and developers at a meeting in February 1997 of an advisory committee of the federal Centers for Disease Control that CDC plans to target 11- to 12-year-old children for \"universal application\" of an HIV vaccine. The Kincaid study says \"babies are being used as guinea pigs now.\" The National Institute for Allergy and Infectious Diseases, under the auspices of the federal Department of Health and Human Services, is sponsoring an HIV vaccine test on babies born to HIV-infected women. A spokesman for this program, where mothers have no ability to provide informed written consent, has admitted that \"a small percentage of our trial applicants have become infected\" and now have access to \"the best medical care available.\" One cannot get any details as to who the \"guinea pigs\" are. Have they chosen to remain anonymous? \"Or are their identities being concealed because they are dead or dying?\" Dr. Umovitz, a member of a group of scientists calling for a moratorium on all HIV vaccine research, says coverage of \"promising\" vaccines is extremely misleading, and those being tested so far appear harmful and dangerous. Some undergoing trials increase the likelihood of infection and accelerate the disease. In a paper, he quotes Dr. Albert Sabin as saying the available data \"provide no basis for testing any HIV vaccine in humans.\" U.N. leader Anan and Dr. Anthony Fauci, who has engaged in extensive research on AIDS, think an AIDS vaccine just may be a \"secret weapon.\" But the Committee to Protect Medical Freedom concludes: \"What if the theory driving the vaccine research is scientifically bankrupt? . What if their war on AIDS proves to be a no-win war in which millions more die? Then the world will move on to the next crisis and the same people may still be in charge.\"\n\n From Jon Eisen \n\n jon.boy@ihug.co.nz \n\n Author of Suppressed Inventions & Other Discoveries http://www.geocities.com/Area51/Shuttle/5604/cancerbook.html \n\n 6-24-1 This report takes its place among the mounting evidence of US and multinational corporate incursions on the fundamental rights of the human race - to survival itself. The pattern is clear for anyone and everyone who has cared enough to go beyond the drivel from mainstream media and access the wealth of information that has been coming through the pipeline for decades now, to wit: that there is in fact a decision that was taken by a small number of this planet's power elite (yes, a conspiracy) radically to depopulate the planet of all but around 300 million people. This is detailed in a document called \"The Strecker Memorandum\" and it is available elsewhere to anyone who wants to look for it. By now it has become a very well known document among people who have spent some time researching the origin of AIDS. Robert Strecker was one of the first to identify the true nature of the AIDS epidemic. He and Leonard Horowitz (who wrote a great book entitled \"EMERGING VIRUSES: AIDS AND EBOLA\" ) have, in my view, correctly identified the true nature of the conspiracy, and the fact of the matter is that Strecker actually found the memorandum, the smoking gun, from The World Health Organisation. The World Health Organisation (WHO) (and others) actually in 1972 called for the CREATION of a virus that would attack the immune system itself, and which has all the attributes of the AIDS virus ... Leonard Horowitz, PhD, actually discovered the interm \"progress\" reports filed by Dr Gallo et al, as to his efforts to create the AIDS (HTLV 1) virus spliced from the bovine leukemia virus and the sheep visna virus. Gallo was to be hailed as the co-discoverer of the AIDS virus in 1982. For those who have been following the debate and who believe with virologist Dr Peter Deusberg (who had CIA connections himself) that AIDS is the result of a confluence of co-factors, and that the actual AIDS virus has never been identified - that is plain disinformation designed to take the heat and light off the people who actually put it together. See my book SUPPRESSED INVENTIONS AND OTHER DISCOVERIES for more details. That there is mass genocide going on RIGHT NOW is indisputable, except, perhaps, by a few system apologist diehards who also think that global overheating is still \"unproven\". The AIDS pandemic was designed to depopulate Africa, (and elsewhere) - which it is now doing. The assumption of the power elite is that the world is over populated, which it very well may be, but that is another story. Regardless, they think that the best way to bring down the population is through the dissemination of killer viruses, rather than through birfth control, education, or rising living standards. Anyhow, how is the development of an AIDS vaccine tied in with this conspiracy? Why, you may well ask, if they want everyone to get AIDS, would they develop a vaccine against it? The answer is that NO VACCINE THAT I HAVE INVESTIGATED ACUALLY WORKS AGAINST THE DISEASE IT IS SUPPOSED TO WORK AGAINST. Moreover, if you wanted to spread a disease to millions of people, what better way than to \"immunise\" them against it. If you think that this is just \"conspiracy theory\" nonsense, consider this: 1. Reputable research indicates that the early polio vaccine campaign in Africa was one of the first and main transmission vehicles for AIDS. It perfectly fits the epidemiology, and the vaccine is an acknowledged source of SV-40, a virus which is known to produce brain and other cancers. In fact even today, there is no guarantee whatever that any vaccine you may be allowing to be injected into your or your child's body won't be contaminated by a species-jumping virus. As for the assumption that the polio vaccine stopped the polio epidemic, think (and look) again. The research is there. Salk said that the Sabin vaccine was dangerous and Sabin said the same about the Salk vaccine. Robert Mendelshon MD said that they were both right.In fact, early studies made in the 1950s showed that given adequate vitamin C, NO CASE OF POLIO EVER BECAME PARALYTIC. It's all in Katherine Smith's new book THE CANCER PREVENTION HANDBOOK. Needless to say, this study was suppressed. 2. The more vaccines that are being created ... the worse our health is becoming. Is there a causal connection? You'd better believe it. Most vaccines contain a cocktail not only of viruses, live and \"attenuated\" but other garbage as well, including mercury as a preservative. Mercury is the most toxic non radioactive element on the Periodic Table. How much does a child get? Any amount is too much, and the actual amounts vary. However, shot into the body of a days or weeks old baby, it can and does cause \"adverse reactions\". Do the manufacturers know all this. Of course they do. Do the doctors? Many of them do these days because it has been hard to keep the population completely ignorant, but vaccines actually help their long term \"business\": they contribute to chronic illnesses. A sick population is also a more compliant. 3. What are some of the \"adverse reactions\" to vaccines? These can range from mild fevers to autism, brain damage and death. Less than 10% of these are ever reported. Doctors just hate to report \"adverse reactions\". However, there are millions of adverse reactions every year. There is now an autism epidemic, reliably associated with the MMR and other vaccines. In some places 1 in 150 children are developing this debilitating disease, usually shortly after receiving their vaccinations. Most doctors still call this \"coincidence\". 4. We are being dumbed down, and quickly, the better to establish the Brave New World of Multinational Corporationism. Here in New Zealand where there is a controlled press, it is difficult to get the real skinny, unless you're on the Net. Consequently most people still think that the pharmaceutical companies and the government have our best interests at heart, rather than money and power. To them I say \"good luck to you\". Fact is, pharmaceutical companies and governments seem to like killing, maiming or just making millions and millions of people sick. It's just kind of pathetic how many people still trust them. 5. Don't think that the killing will stop with Africa, either. I think that those who would dramatically reduce the world's population are working to do that on a number of different levels. One of them is the cancer epidemic, helped along by known environmental carcinogens, vaccines and the super carcinogen of them all: fluoride. But the human race is proving to have a stronger immune system that I believe the Controllers at first thought. People are not dying off as fast at the schedule called for. So now comes Plan B, the vaccine against AIDS. Only you see, this vaccine not going to be voluntary. It is going to be mandatory. Compulsory. And if that happens, my friends, be careful. Be very very careful. This kind of thing must be stopped now, in its lethal tracks. In fact ALL VACCINES must now be put on hold as having proven themselves positively dangerous, indeed profoundly debilitating and a menace to the future health of the entire human race. We have been brainwashed, ladies and gentlement, into believing that vaccines are good for the health of our children, when all the impartial evidence indicates the contrary. We have sacrificed our health and the health of millions of our children on the alter of corporate profit and professional greed. Let it stop now.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}