{"result_id": "261047", "URL": "https://rense.com/general79/vaxcc.htm", "timestamp": "2023-04-25 17:00:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general79/vaxcc.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Vaccinations Designed To Sterilize Women?", "cleaned_text": "Women are being drawn into a medical trap.The outcome is toxication and health erosion. The tool is vaccinations ­ presented as a solution to \"fight\" an ever growing number of dangers from the world of microbes. The medical world has got its own Al Qaeda ­ the invisible army of viruses. With exactly the same attributes: Unknown, being everywhere and nowhere. Invincible. The answer is also approximately the same: More fear, more death. And now, with growing clarity, targeting women. We have for more than a decade had the campaigns for mandatory HIV-tests of pregnant women. Only women. In the Third World, we have had numerous vaccination campaigns targeting women in their fertile age. Only women. Recently, in Denmark, the great drug donor, Bill Gates, has donated USD 10m to a Copenhagen university to further studies on a Malaria vaccine ­ target group: Women of the Third World. And then, the latest stunt: Vaccination of 12 year old girls in many countries ­ allegedly against the HPV virus which might (or might not) eventually cause Cervical Cancer. Target group: Girls in the age of just becoming fertile. In some states mandatory, in others just heavily propagandized. What is all this about? Money? Of course but that doesn't account for the focusing on women. Special care for women? Nice. But in fatal opposition to the agenda of \"women's lib\". Women's lib doesn't include reproduction and is uninterested in the female sex. Could it be ? Yes, it could be exactly the opposite, and I'll tell you why. First, \"women's lib\" is not a population movement fostered by women being sick-and-tired of oppression. It it a masculine invention, defined in policy papers back from the 1950's, most eagerly promoted by the Rockefeller all-seeing-everywhere-being dynasty and it's political operators. Approximately at the same time when the first feminists surfaced, and already up and run as the project culminated. That happened with the 1974 Henry Kissinger <i>National Security Study Memorandum 200</i> about \"the consequences of the global population growth for the US security and overseas interests\". This paper, which should be given much much more attention , states that Urgent immediate measures must be taken to reduce fertility. The memo recommends Zero growth rate in the developed countries by 1985 and Zero growth rate in Lesser Developed Countries by 2000. Notice: Defertilization first in the West, then down to the poor. It also recommends the tools. For the industrialized world: Reproductive health - a nicer word for abortion, use of condoms etc. Sex education Improved health Women' equality Day care Government participation Improved social security Reduced infant mortality Well, in Europe, we used to call this \"welfare\". It now seems, it was just a means to make us stop reproducing ourselves. A great success: Today, we find declining birth rates all over the Western World ­ only Albania (the poorest country of Europe ­ no \"welfare\") is maintaining the size of of its population. The picture becomes clearer when we learn that our Rockefeller-friend John D. the Third back in the 1950's also began advocating that all vaccines should have added Mercury. That served a tripple purpose: Mercury works as a preservative. It can help the chemical industry get rid of a highly toxic waste product (just like Fluoride in toothpaste did). And, most important, the Mercury is absorbed in our body, is not automatically excreted and has various toxic effects. One of the effects is that it destroys the cilia inside the female sex, removing the ability of the mucous membrane to transport men's semen to the egg cells. Which obviously impedes natural conception. Another effect is that children who are born become autistic - the frequency of autistic children increases clearly with the amount of Mercury consumed. And there are other effects of this additive which is called <i>thiomesal</i> - such as diabetes. So, any vaccine containing Mercury, is a defertilization drug. That means almost all vaccines almost all over the world. We get another clue by studying simple facts on HIV and AIDS. As shown in many papers and documentaries, the existence of a virus destroying our immune system has never been documented ­ to this day it remains a rumour having obsessed most of the medical world and, by being backed up by deeply corrupt statal medical authorities, a fully controlled political layer and a centralized media network loving the \"scary setup\", it has also obsessed most common people. The facts are that as well as there is no disease-causing HIV virus, there is no test which can prove it's presence in human blood. The so-called HIV-tests test the presence of antibodies and antibodies belong in a functioning immune system. The tests are known to crossreact with many conditions having nothing to do with any particular virus. One of these conditions is you better sit down pregnancy. That's where the AIDS swindle becomes a depopulation tool. For the next step from a positive HIV test is prescription of deadly toxic drugs (charmingly named \"Life Prolonging Medication\") destroying the immune system and the intestine's ability to absorb nutrients - and causing defective children. These drugs are the most toxic chemicals ever invented by the pharmaceutical industry. In Africa, HIV tests are only performed on pregnancy clinics. And guess where the deadly drugs go. Another clue becomes clear when we look at the WHO vaccination campaigns in the Third World. Most famous are the campaigns from the mid nineties against Tetanus. Despite the fact that 70% of all Tetanus occurred in men, the vaccinations were only given to women. And only women between 14 and 44 years old. The vaccines were mixed with hCG Gonadotropine. Now, hCG is a hormone which is naturally formed in the foetus within the first few days, and which is necessary for it's continued life and growth. When the mixture of vaccine and hCG is inoculated in a woman's blood, her immune defence will not only produce antibodies to the Tetanus bacteria but also to the hCG. As a result, she looses her foetus. These vaccination campaigns were performed on millions and millions of women in Nicaragua, Mexico, Nigeria, Tanzania and the Philippines. Other vaccination campaigns have had other effects. In Uganda, a polio vaccination was performed, killing 600 children in just one month and just one village (Mbarara) - in which there was by coincidence a counting. In Nigeria, polio vaccine was distributed, contaminated with estradiol and a number of carcinogen (cancer generating) agents. How many more of these criminal campaigns have been performed through the years? Then we have the bogus on the Malaria vaccine. Malaria is no microbe disease, so what has a vaccine to do with this? Nothing. But the funny scientist came up with a funny story on a \"certain molecule\" being necessary for the Malaria parasite to fix on the inside of women's uterus. It's the molecule the vaccine is supposed to target. But only in women. The average age of women getting Cervical Cancer is 50 ­ as Dr. Tim O'Shea writes in his excellent article \"HPV - The First Cancer Vaccine\" on Rense.com (http://www.rense.com/general78/hpv.htm). The creator of the HPV vaccine, company Merck, promises an effect-time of five years. So, what the point of vaccinating 12 years old girls? I have no doubt anymore: This has nothing to do with medicine. It has nothing to do with anything based on science. It has nothing to do with diseases. It is a money machine, yes, but it is more. We have another war, and this war is moving from covert to overt. We have a global war on women. ------- Heising is a Danish Men's activist. He can be reached at kjeld@heising.dk", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}