{"result_id": "261036", "URL": "https://rense.com/general96/advice-on-rights.php", "timestamp": "2023-04-25 17:00:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general96/advice-on-rights.php", "encoding": "iso-8859-1"}, "image": null, "domain": "rense.com", "title": "Advice For Those Mandated To Take The Shots Your Rights To Fully-Informed Consent", "cleaned_text": "If you are being forced to Vax in order to keep your job, here's a great way to handle it. \n\n\n\n The secret is NOT to refuse it... \n\n\n\n A friend in the NHS is being pressured to take the jab. \n\n\n\n 'I write with regard to the matter of potential covid vaccine and my desire to be fully-informed and appraised of ALL facts before going ahead. \n\n\n\n I'd be most grateful if you could please provide the following information, in accordance with statutory legal requirements: \n\n\n\n 1. Can you please advise me of the approved legal status of any vaccine and if it is experimental? \n\n\n\n 2. Can you please provide details and assurances that the vaccine has been fully, independently and rigorously tested against control groups and the subsequent outcomes of those tests? \n\n\n\n 3. Can you please advise of the full list of contents of the vaccine I am to receive and if any are toxic to the body? \n\n\n\n 4. Can you please fully advise of all the adverse reactions associated with this vaccine since it's introduction? \n\n\n\n 5. Can you please confirm that the vaccine you are advocating is NOT 'experimental mRNA gene altering therapy'? \n\n\n\n 6. Can you please confirm that I will not be under any duress from yourselves as my employers, in compliance with the Nuremberg Code? \n\n\n\n 7. Can you please advise me of the likely risk of fatality, should I be unfortunate to contract Covid 19 and the likelihood of recovery? \n\n\n\n Once I have received the above information in full and I am satisfied that there is NO threat to my health, I will be happy to accept your offer to receive the treatment, but with certain conditions - namely that: \n\n\n\n 1. You confirm that I will suffer no harm. \n\n\n\n 2. Following acceptance of this, the offer must be signed by a fully qualified doctor who will take full legal and financial responsibility for any injuries occurring to myself, and/or from any interactions by authorized personnel regarding these procedures. \n\n\n\n 3. In the event that I should have to decline the offer of vaccination, please confirm that it will not compromise my position and that I will not suffer prejudice and discrimination as a result? \n\n\n\n I would also advise that my inalienable rights are reserved.' \n\n\n\n .................. \n\n\n\n The point is they CANNOT provide that information...and you've NOT refused...", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}