{"result_id": "261003", "URL": "https://rense.com/general86/bang.htm", "timestamp": "2023-04-25 17:00:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general86/bang.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Readying Americans For Dangerous, Mandatory Vaccinations", "cleaned_text": "At least three US federal laws should concern all Americans and suggest what may be coming - mandatory vaccinations for hyped, non-existant threats, like H1N1 (Swine Flu). Vaccines and drugs like Tamiflu endanger human health but are hugely profitable to drug company manufacturers. The Project BioShield Act of 2004 (S. 15) became law on July 21, 2004 \"to provide protections and countermeasures against chemical, radiological, or nuclear agents that may be used in a terrorist attack against the United States by giving the National Institutes of Health contracting flexibility, infrastructure improvements, and expediting the scientific peer review process, and streamlining the Food and Drug Administration approval process of countermeasures.\" In other words, the FDA may now recklessly approve inadequately tested, potentially dangerous vaccines and other drugs if ever the Secretaries of Health and Human Services (HHS) or Defense (DOD) declare a national emergency, whether or not one exists and regardless of whether treatments available are safe and effective. Around $6 billion or more will be spent to develop, produce, and stockpile vaccines and other drugs to counteract claimed bioterror agents. The Public Readiness and Emergency Preparedness (PREP) Act slipped under the radar when George Bush signed it into law as part of the 2006 Defense Appropriations Act (HR 2863). It lets the HHS Secretary declare any disease an epidemic or national emergency requiring mandatory vaccinations. Nothing in the Act lists criteria that warrant a threat. Also potential penalties aren't specified for those who balk, but very likely they'd include quarantine and possible fines. The HHS web site also says the Secretary may \"issue a declaration....that provides immunity from tort liability (except for willful misconduct) for claims of loss caused, arising out of, relating to, or resulting from administration or use of (vaccine or other pharmaceutical) countermeasures to diseases, threats and conditions determined by the Secretary to constitute a present, or credible risk of a future public health emergency....\" The industry-run US Food and Drug Administration (FDA) notoriously rushes inadequately tested drugs to market, putting their efficacy and safety into question, and turning those who use them into lab rats. It includes everyone if a mass vaccination is ordered on the mere claim of a public emergency - no proof required. The Pandemic and All-Hazards Preparedness Act (S. 3678) is the other worrisome law, effective December 19, 2006. It amended \"the Public Health Service Act with respect to public health security and all-hazards preparedness and response, and for other purposes.\" Even its supporters worry about issues of privacy, liability, and putting profits over public health. Critics express greater concerns about dangerous remedies for exaggerated or non-existant threats as well as mass hysteria created for political purposes. At least one other measure is also worrisome - The Model State Emergency Health Powers Act (MSEHPA). So far it's just a proposal by the Center for Law and the Public's Health - \"A Collaborative at Johns Hopkins and Georgetown Universities (as) a primary, international, national, state, and local resource on public health law (and) policy for public health practitioners, judges, academics, policymakers, and others.\" MSEHPA is now \"track(ing) legal responses to the emerging international response to the 2009 H1N1 (swine flu) outbreak, including declarations of public health emergency at the international, national, state, and local levels....\" even though forensic evidence can't confirm any H1N1 deaths. No emergency exists anywhere, and reporting one is all hype to sell dangerous drugs to unsuspecting people globally. On its web site, the ACLU says this about MSEHPA: It's \"written in a way that doesn't adequately protect citizens against the misuse of the tremendous powers that it would grant in an emergency. (It's) replete with civil liberties problems. Its three top flaws are that: (1) It fails to include basic checks and balances (by) grant(ing) extraordinary emergency powers (that) should never go unchecked. (It) could have serious consequences for individuals' freedom, privacy, and equality.\" (2) \"It goes well beyond bioterrorism (with) an overbroad definition of 'public health emergency\" that may be anything a local or national authority declares for any reason with no conclusive evidence for proof. (3) \"It lacks privacy protections (and) undercut(s) existing protections for sensitive medical information.\" MSEHPA worries other organizations besides the ACLU, both conservative and progressive - including the Free Congress Foundation, American Legislative Exchange Council, conservative association of state legislators, Human Rights Campaign, and Health Privacy Project. In the wake of the hyped Swine Flu scare, media reports suggest mass vaccinations are coming. The May 6 Kimberly Kindy - Ceci Connolly Washington Post one, for example, headlined \"US May Add Shots for Swine Flu to Fall Regimen\" without saying they'll be mandatory but reading between the lines suggests the possibility this year or later. The writers report that \"The Obama administration is considering an unprecedented fall vaccination campaign\" to include regular and Swine Flu shots, the latter because it's \"spreading across the globe.\" HHS' Dr. Robin Robinson said \"We are moving forward with making a vaccine,\" and if the government proceeds with a national program, enough supply will be produced to provide two doses for all Americans with spokespersons like National Institute of Allergy and Infectious Diseases, Anthony Fauci, claiming adverse reactions aren't to be expected and adding another shot for Swine Flu \"should not present a problem.\" The New York Times also hypes the scare with reports of city schools closed after unconfirmed Swine Flu cases, a few adult deaths blamed on H1N1 bringing the claimed total in the city to seven, and the World Health Organization (WHO) saying on June 3 that it's moving closer to declaring a worldwide (Level 6) Swine Flu pandemic - even though none exists. With all the hype, misinformation, and willful lies WHO's Dr. Keiji Fukuda, in charge of flu, said only 117 deaths globally have been \"blamed\" on Swine Flu and any warning may include the caveat that the virus isn't very lethal. A more accurate statement would explain that no forensic evidence links any deaths to H1N1, and influenza annually kills about 30,000 people in America alone - something the major media never report or that scattered accounts of any type flu deaths worldwide are no cause for alarm or reason for scary headlines. It's also unconscionable for the WHO, US and other nations' officials to spread lies, deception, and hysteria so major pharmaceutical companies can foist dangerous vaccines and other drugs on unsuspecting people, harming their health and making them vulnerable to later diseases and possible early deaths. Massachusetts May Be A Forerunner of What's to Come On April 28, the Massachusetts Senate unanimously passed a pandemic flu preparation bill that rises to the level of martial law. If approved by the House and signed into law, it will mandate among other measures: -- \"vaccination, treatment, examination, or testing of\" all individuals involved in providing health care - as perhaps step one before ordering the same process for all state residents; -- owners or occupiers of all premises \"to permit entry into and investigation of the premises;\" -- closure, evacuation, and decontamination of all suspected facilities; and Other states may be planning similar measures as precursors to mandatory nationwide vaccinations and overall suspension of civil liberty protections. Before deploying to the Persian Gulf in 1990 - 91 (and thereafter to the present), all US troops got a standard series of inoculations against infectious diseases - the same ones given to all US citizens traveling to the region. After arriving, 150,000 also got anthrax vaccinations and 8000 botulinum toxoid ones even though concerns were raised about adverse long-term health consequences. A National Academy of Sciences' Institute of Medicine (IOM) study was conducted to assess them with results released in September 2000. In December 1997, the Department of Defense (DOD) announced that all US military forces would receive anthrax vaccinations. The Anthrax Vaccine Immunization Program (AVIP) began in March 1998 even though IOM found little published peer-reviewed scientific information on its safety. In its study, IOM reported evidence of an association between vaccinations studied and transient acute common health effects, including redness, swelling, and fever commonly associated with other vaccinations. However, conclusive proof of long-term problems wasn't determined - likely because study findings were skewed not to find them. More on that below. IOM also studied botulinum toxoid vaccines and found evidence of an association between the vaccine and transient acute local and systemic effects similar to anthrax vaccinations. Again, conclusive proof of long-term adverse health effects wasn't found - another very dubious conclusion as evidence below explains. Military personnel usually get multiple vaccinations. IOM studied their effects but didn't prove or disprove any long-term adverse effects. However several independent studies of British Gulf War veterans found some link between multiple vaccinations and later health problems. Gary Matsumoto is a New York-based award-winning investigative journalist. His 2004 book, \"Vaccine A: The Covert Government Experiment That's Killing Our Soldiers and Why GIs are Only the First Victims\" took sharp issue with IOM results and the Pentagon's denial of Gulf War syndrome. Investigating the shadowy vaccination development world, he discovered US military-employed doctors and scientists conducted secret medical experiments on US citizens in violation of the Nuremberg Code and fundamental medical ethics. For its part, Nuremberg established legal medical experimental standards now incorporated into ethical medical codes, including: -- requiring voluntary consent of human subjects without coercion, fraud, deceit, and with full disclosure of known risks; -- experiments should avoid \"all unnecessary physical and mental suffering and injury;\" -- experiments should never be conducted if there's \"an a priori reason to believe death or disabling injury will occur;\" -- risk \"should never exceed that determined by the humanitarian importance of the problem to be solved..;\" and -- experiments should be terminated if there's reason to believe they'll cause \"injury, disability, or death to the experimental subject.\" According to Matsumoto, the Pentagon violated these and other standards, betrayed the troops, and the fundamental duty of military and civilian leaders to protect them. Since at least 1987, biowarfare development trumped the welfare of tens of thousands of GIs used as human guinea pigs for inoculation with experimental unlicensed anthrax vaccines containing squalene - an oil-based adjuvant (to enhance immunity) known for decades to cause severe autoimmune diseases in lab animals, yet administered involuntarily without disclosure of its harmful effects to human health. Matsumoto wrote: \"The unethical experiments detailed in this book are ongoing, with little prospect of being self-limiting because they have been shielded from scrutiny and public accountability by national security concerns.\" He suggested the \"writing (was) on the wall\" of what's to come with prospects now it may be soon. \"When UCLA Medical School's Michael Whitehouse and Frances Beck injected squalene combined with other materials into rats and guinea pigs back in the 1970s, few oils were more effective at causing the animal versions of arthritis and multiple sclerosis.\" In 1999, immunologist Dr. Johnny Lorentzen at Sweden's Karolinska Institute found that on injection, an \"otherwise benign molecule like squalene can stimulate a self-destructive immune response,\" even though it occurs naturally in the body. Other research shows that squalene is the experimental anthrax vaccine ingredient that caused devastating autoimmune diseases and deaths for many Gulf War veterans from the US, UK, and Australia, yet it continues in use today and for new vaccines development in labs. There's a \"close match between the squalene-induced diseases in animals and those observed in humans injected with this oil: rheumatoid arthritis, multiple sclerosis and systemic lupus erythematosus.\" Other autoimmune diseases are also linked to humans injected with squalene. \"There are now data in more than two dozen peer-reviewed scientific papers, from ten different laboratories in the US, Europe, Asia and Australia, documenting that squalene-based adjuvants can induce autoimmune diseases in animals...observed in mice, rats, guinea pigs and rabbits. Sweden's Karolinska Institute has demonstrated that squalene alone can induce the animal version of rheumatoid arthritis. The Polish Academy of Sciences has shown that in animals, squalene alone can produce catastrophic injury to the nervous system and the brain. The University of Florida Medical School has shown that in animals, squalene alone can induce production of antibodies specifically associated with systemic lupus erythematosus.\" Micropaleontologist Dr. Viera Scheibner conducted research into the adverse effects of adjuvants in vaccines and wrote: Squalene \"contributed to the cascade of reactions called \"Gulf War syndrome. (GIs developed) arthritis, fibromyalgia, lymphadenopathy, rashes, photosensitive rashes, malar rashes, chronic fatigue, chronic headaches, abnormal body hair loss, non-healing skin lesions, aphthous ulcers, dizziness, weakness, memory loss, seizures, mood changes, neuropsychiatric problems, anti-thyroid effects, anaemia, elevated ESR (erythrocyte sedimentation rate), systemic lupus erythematosus, multiple sclerosis, ALS, Raynaud's phenomenon, Sjorgren's syndrome, chronic diarrhea, night sweats and low-grade fever.\" Matsumoto's book includes numerous case studies of GIs afflicted with one or more of the above syndromes, their devastating effects, and the outlandish US government reaction - failing to acknowledge their existence or a connection between them and administered vaccines. Also denying the effects of other toxic Gulf theater exposures (like depleted uranium) as well as withholding meaningful treatments or protocols. US Army Captain George L. Skypeck spoke eloquently for many when he said: \"Was the character of my valor less intense than those at Lexington? Was the pain of my wounds any less severe than those at Normandy? And was my loneliness any less sorrowful than those at Inchon? Then why am I forgotten amonst those remembered as 'heros?' \" If mass vaccinations are ordered, millions of Americans may ask: Why do you keep using unsafe vaccines and other drugs when clear evidence shows their dangers? Why do you jeopardize all Americans by unleashing a future plague of serious illnesses, diseases, and disabilities? Why have you willfully and maliciously ruined my health? Immunologist Dr. Pamela Asa first recognized autoimmune diseases showing up in GIs that mirrored those in lab animals injected with oil formulated squalene adjuvants. By 1997, hundreds of millions of dollars had been spent testing vaccines containing them, in animal studies since 1988 and human clinical trials since 1991 - by leading research institutes like NIH, the National Cancer Institute, and the National Institutes of Allergy and Infectious Diseases (NIAID). According to Matsumoto, today, \"Squalene adjuvants are a key ingredient in a whole new generation of vaccines intended for mass immunization around the globe\" even though researchers at Tulane Medical School and the Walter Reed Army Institute of Research proved \"that the immune system responds specifically to the squalene molecule.\" The immune system \"see(s) and recognizes it as an oil molecule native to the body. Squalene is not just a molecule found in a knee or elbow - it is found throughout the nervous system and the brain.\" When injected in the body, the immune system attacks it as an enemy to be eliminated. Eating and digesting squalene isn't a problem. But injecting it \"galvanize(s) the immune system into attacking it, which can produce self-destructive cross reactions against the same molecule in the places where it occurs naturally in the body - and where it is critical to the health of the nervous system.\" Once self-destruction begins, it doesn't stop as the body keeps making the molecule that the immune system is trained to attack and destroy. Immunologist Dr. Bonnie Dunbar also did extensive research on hepatitis B-inflicted illnesses and found similar autoimmune processes involved in molecular mimicry in people with devastating neuroimmune syndromes after getting vaccine injections. Matsumoto says \"Squalene is a kind of trigger for (a) real biological weapon,\" what Soviet researchers called \"a biological time bomb!!\" and Matsumoto says is \"the immune system.\" When its \"full repertoire of cells and antibodies (attack) tissues they are supposed to protect, the results can be catastrophic.\" He and Dr. Pam Asa conclude that \"Oil adjuvants are the most insidious chemical weapon ever devised,\" including ones with squalene - something the Soviets knew could be used as a weapon in the 1980s. Matsumoto says that \"the real problem with using squalene (isn't) that it mimics a molecule found in the body; it is the same molecule. So what American scientists conceived as a vaccine booster (or what's now being developed in labs) was another 'nano-bomb,' instigating chronic, unpredictable and debilitating disease. When the NIH....argued that squalene would be safe because it is native to the body, just the opposite was true,\" and, of course, still is. \"Squalene's natural presence in the body made it one of the most dangerous molecules ever injected into man\" and using it in vaccines is outlandish and criminal. So why does Washington sanction its use? According to Matsumoto: \"scientists in the United States are now literally invested in squalene. Army scientists who developed the second generation anthrax vaccine have reputations to protect and licensing fees to reap (as well as) worldwide rights to develop and commercialize the new recombinant vaccine for anthrax\" and ones for other health threats. Disturbingly, \"Many of the cutting-edge vaccines currently in development by the NIH and its corporate partners contain squalene in one formulation or another. There is squalene in the prototype recombinant vaccines for HIV, malaria, herpes, influenza (including the swine strain), cytomegalovirus and human papillomavirus.\" Some of these \"are intended for mass immunization(s) around the globe\" and that possibility should terrify everyone enough to refuse any mandate or doctor's prescription to take them. Another problem is that \"Autoimmunity (takes) years to diagnose\" because early symptoms (headaches, joint pain, etc.) are so vague they can easily be from other causes. From inception, vaccines have always been dangerous enough for some experts to call them biological weapons undermining health, manipulating and crippling the immune system, and creating the possibility of future debilitating diseases. So Big Pharma's solution is new, more potent genetically engineered vaccines and drugs that may end up harming or killing many who take them, especially people with weakened immune systems. Matsumoto and others sounded the alarm to alert everyone to avoid these poisons masquerading as protective drugs. In fact, they benefit only the bottom lines of companies that manufacture them and scientists reaping generous royalties. Stephen Lendman is a Research Associate of the Centre for Research on Globalization. He lives in Chicago and can be reached at <mailto:lendmanstephen@sbcglobal.net>lendmanstephen@sbcglobal.net. Also visit his blog site at sjlendman.blogspot.com and listen to The Global Research News Hour on RepublicBroadcasting.org Monday - Friday at 10AM US Central time for cutting-edge discussions with distinguished guests on world and national issues. All programs are archived for easy listening.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}