{"result_id": "261030", "URL": "https://rense.com/general87/vaccin.htm", "timestamp": "2023-04-25 17:00:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general87/vaccin.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Russell Blaylock, MD - What To Do If Force Vaccinated", "cleaned_text": "Dr Blaylock's List of suggestions on How to Reduce the Toxic Effects of the A/H1N1 Vaccine, is as follows: 1. Number one on the list says Dr Blaylock, is to bring a cold pack with you and place it on the site of the injection as soon as you can, as this will block the immune reaction. Once you get home, continue using a cold pack throughout the day. If you continue to have immune reactions the following day, have cold showers and continue with the cold press. 2. Take fish oil. Eicosapentaenoic acid (EPA), one of the omega 3 fatty acids found in fish oil supplements, is a potent immune suppressant. If you take high dose EPA you will be more susceptible to infections, because it is a powerful immune suppressant. However, in the case of an immune adjuvant reaction, you want to reduce it. Studies show that if you take EPA oil one hour before injecting a very powerful adjuvant called lipopolysaccharide (LPS), it would completely block the ability of the LPS to cause brain inflammation. Take a moderate dose everyday and more if needed to tame a cytokine storm. 3. <http://lpi.oregonstate.edu/f-w00/flavonoid.html>Flavonoids are third on the list, namely curcumin, quercetin, ferulic acid and ellagic acid, particularly in a mixture. The curcumin and quercetin in particular have been found to block the ability of the adjuvants to trigger a long-term immune reaction. If you take it an hour before the vaccination, it should help dampen the immune reactions says Dr Blaylock. 4. Vitamin E, the natural form that is high in gamma-E will help dampen the immune reactions and reduces several of the inflammatory cytokines. 5. An important ingredient on the list is Vitamin C at a dose of 1000 mg, taken four times a day between meals. It is a very potent anti-inflammatory and should be taken in a buffered form, not as absorbic acid, says Dr Blaylock. 6. <http://www.naturalnews.com/002156.html> Also use astaxanthin as it's an anti-inflammatory. According to Dr Blaylock, fatal reactions to vaccines in aboriginal and African children occurred in those who were deficient in carotinoids, like astaxanthin. It is a good protection against the toxic effects of the vaccine. 7. Likewise, it was found that children who were deficient in zinc had a high mortality rate. Zinc is very protective against vaccine toxicity. (Do not use zinc mixed with copper however, as copper is a major trigger of free-radical generation according to Dr Blaylock). 8. Ensure you avoid all immune-stimulating supplements, such as mushroom extracts, whey protein and <http://www.betaglucan.org/>beta-glucan. 9. Take a multivitamin-mineral daily ­ one that does not contain iron. This multivitamin-mineral is to make sure your body has plenty of B vitamins and selenium. Selenium, said Dr Blaylock, is very important for fighting viral infections and it reduces the inflammatory response to vaccines. 10. Magnesium citrate/malate 500 mg of elemental magnesium two capsules, three times a day. (This was not mentioned during the show, but was posted at Dr Deagle's website, <http://www.clayandiron.com/news.jhtml?method=view&news.id=2103>ClayandIron.com). 11. What is very important is vitamin D3, which is the only 'vitamin' the body can manufacture from sunlight (UVB). It is a neural hormone, not really a vitamin says Dr Blaylock and helps if you are over-reacting immunologically by cooling down the reaction. Similarly, if you are under-reacting, it helps to boost your immune response. In addition it also protects against microorganism invasion. Black people and those in colder climates are particularly deficient, so they will almost certainly require supplementation. Dr Blaylock recommends that following vaccination it will help to keep the immune reaction under control if: i) All children get 5,000 units a day for two weeks after the vaccine and then 2,000 a units a day thereafter; ii) Adults get 20,000 units a day after the vaccine for two weeks, then 10,000 units a day thereafter; iii) And with that adults should take 500-1000 mg of calcium a day and children under the age of 12 years should take 250 mg a day, as vitamin D works more efficiently in the presence of calcium. 12. Ensure you avoid all mercury-containing seafood or any other sources of mercury, as the heavy metal is a very powerful inducer of autoimmunity, is known to make people more susceptible to viral infections and will be in H1N1 vaccines. 13. Avoid the oils that significantly suppress immunity and increase inflammation - such as corn, safflower, sunflower, soybean, canola and peanut oils. 14. Drink very concentrated white tea at least four times a day. It helps to prevent abnormal immune reactions. 15. Pop parsley and celery in a blender and drink 8 ounces of this mixture twice a day. Dr Blaylock says the parsley is very high in a flavonoid called apigenin and that celery is high in <http://www.dietaryfiberfood.com/antioxidants/flavonoid-antioxidant.php>luteolin. Both are very potent in inhibiting autoimmune diseases, particularly the apigenin, so go and plant some parsley in your garden now.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}