{"result_id": "261041", "URL": "https://rense.com/health/vaccinationfacts.htm", "timestamp": "2023-04-25 17:00:26 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "", "canonical": "https://rense.com/health/vaccinationfacts.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "SIGHTINGS:", "cleaned_text": "FACT: Vaccines trick the body into focusing on only one aspect, antibody production, of the many normally available to the immune system. When the vaccine virus is injected directly into the blood stream, it gains access to all of the major tissues and organs of the body without triggering a normal immune response. 5Ý Antibodies that do respond to the invading vaccine germs become committed to those germs and are unable to react to other viruses. 6,7 FACT: The immune system is designed to help the organism discriminate \"self\" from potentially dangerous \"nonself\". Alien viruses injected into the body fuse with healthy cells, and continue to replicate along with those cells. 8Ý Under these circumstances, the immune system is likely to either invade its own cells (cancer), or ignore danger signs all together, leaving the body vulnerable. 9Ý FACT : The thymus gland plays an essential role in the immune response against germs and non-human proteins, making T-cells, protecting against diseases. When autopsies were performed on vaccinated Americans, it was found that the thymus gland had shrunk after puberty, while there was little deterioration in the thymus gland of adults in poorly vaccinated countries. Thymus gland abnormalities are associated with many diseases and tumours. 10Ý FACT: The Simian monkey kidneys, used as the bases for the polio vaccine in the 1950's and 1960's, were found to be contaminated with the SV-40 virus. 11Ý SV-40 is a powerful immunosuppressor and trigger for HIV - the name given to the AIDS virus. Researchers consider it to be a cancer-causing virus. 12,13,14Ý The greatest spread of HIV coincides with the most intense and recent smallpox vaccination campaigns, which activated the dormant contaminated polio vaccine. 15Ý The polio vaccine today can still be contaminated with an undetected strain of monkey virus. 16Ý FACT: The principle cause of encephalitis in the USA and other industrialised countries, is the childhood vaccination programme. 17Ý Encephalitis is the inflammation of the brain affecting the central nervous systems. Subtle and often overlooked reactions to the vaccine (a slight fever, fussiness, drowsiness) can be a case of encephalitis which is capable of causing severe neurological complications months or even years later. 18Ý FACT: Medicine accepts that the rubella vaccine can cause long or short-term arthritis. Wellcome notes in The Datasheet Compendium that the rubella vaccine causes arthritis in 3% of the children and 12-20% of adult women who receive it. 19Ý As many as 26% of children receiving rubella vaccinations in national testing programs developed arthritis. Some were hospitalised to test for rheumatic fever and rheumatoid arthritis. 20Ý FACT: In the Philippines, the largest smallpox epidemic occurred between 1917 and 1919, in which there were 162,503 cases and 71,453 deaths. All cases were vaccinated. 21Ý FACT: In England, smallpox vaccinations were made compulsory in 1853. Between 1863 and 1865, the population rose 7% and the death rate rose by 41%. Between 1870 and 1872, the population rose 9% and the death rate from smallpox rose 123%. 22Ý FACT: Following the introduction of compulsory immunisation, the incidence of diphtheria increased by 30% in France, 55% in Hungary, 200% in Switzerland and 625% in Germany. In Sweden, diphtheria virtually disappeared without immunisation. 23Ý FACT : Germany began compulsory diphtheria vaccinations in 1939. After that country was thoroughly vaccinated, cases of the disease skyrocketed to 150,000. 24Ý France initially rejected diphtheria vaccinations because of the disasters she witnessed in other countries due to its use. But after the German occupation, France was forced into submitting to the shots. By 1943, cases of diphtheria in that country had soared to nearly 47,000. 25Ý At the same time in nearby Norway, which refused vaccinations, there were only 50 cases. 26Ý FACT: Toxic materials (vaccines) injected into the infants bloodstream at only two months old, destroy critical nutrient stores and can catastrophically damage the babyís still developing central nervous system. 27Ý By the mid-1970ís, Japanese officials realised early DPT shots were in fact killing babies. 28Ý FACT: Cot Death or SIDS (Sudden Infant Death Syndrome), has been linked to the DPT vaccine. 29Ý Dr William Torch, of the Nevada School of Medicine, issued a report showing that two-thirds of 103 children who died of SIDS had been immunised with DPT vaccine in the 3 weeks before their deaths, many dying within a day of the vaccine. 30Ý FACT: It is generally recognised that there is no satisfactory cholera vaccine. The product available up to the present has been largely a public relations gambit. So distrusted is the current vaccine that the medical authorities didnít bother to rush the drug to Peru during the outbreak there in 1991. 31Ý FACT: Certain vaccine such as that given to cholera are known to be of no value, and the emphasis in general practice should really shift more towards proper advice, which can often be more time consuming than injections. 32Ý FACT: In England, the National Health Service pays a \"bonus\" to doctors with documented vaccination rates above specified percentages. 33Ý Doctors who vaccinate the largest percentage of patients on their books stand to gain the most, whilst those who exercise greater discretion in the administration of vaccines, or who are willing to support parents who do not wish their children to be immunised are financially penalised. 34Ý FACT: Scientific literature recommends not giving the pertussis vaccine if i) the child is ill with anything, including a runny nose, cough, ear infection, diarhea, or has recovered from an illness within one month before a scheduled DPT shot, ii) the child has a personal or family history of severe allergies (i.e., cowís milk, asthma, eczema). 36Ý FACT: The Department of Health admitted that if a person has been vaccinated, it determines the diagnosis of subsequent diseases. This means that a person vaccinated against has been vaccinated, it determines the diagnosis of subsequent diseases. will be diagnosed as something else (examples include chickenpox, pustular eczema, varioloid and monkeypox). 36Ý 1.Neil Z Miller, \"Vaccines: Are They Really Safe And Effective?\", (New Atlantean Press, 1994), ISBN 1-881217-10-8 2.Randeall Neustaedter, \"The Immunization Decision\", (North Atlantic Books, 1990), ISBN 1-55643-071-X 3.Leon Chaitow, \"Vaccination And Immunisation: Dangers, Delusion and Alternatives\", (The C.W. Daniel Co. Ltd. 1994), ISBN 0-85297-191-4 4. Trevor Gunn, \"Mass Immunisation, A Point in Question\", (Cutting Edge Publications, 1992), ISBN 0-9517657-1-X 5.Walene, James, \"Immunisation: The Reality Behind the Myth\", (Bergin & Garvey, 1988), pp. 14-15. 6.Drs Kalokerinos and Dettman, \"A Supportive Submission\", The Dangers of Immunisation, (Warburton, Victoria, Australia: Biological Research Institute, 1979), p.49. 7.Harold E Buttra, MD and John Chriss Hoffman, \"Bringing Vaccines Into Perspective\", Mothering, (Winter 1985), p.32 8. Richard Moskowitz, MD, \"The Case Against Immunizations\", (Washington, DC: The National Centre for Homeopathy, 1983), p.15. 9.See Note 5, p.32. 10.See Note 5, pp. 16-17 11.B.L. Horvath, et al., \"Excretion of SV-40 virus after oral administration of contaminated polio vaccine,\" Acta Microbiologica Hungary, 11, pp. 271-275. And others. 12.See Note 5, p. 101. 13.Tom Curtis, \"The Origin of AIDS: A Startling New Theory Attemps to Answer the Question ëWas it an Act of God or an Act of Man,í\" Rolling Stone, (March 19, 1992), p. 57. 14.Robert Mendelsohn MD, \"How To Raise a Healthy Child ... In Spite of Your Doctor\", (Chicago: Contemporary Books, 1984), pp. 73, 79. 15.London Times, (May 11, 1987), p. 1. 16.See Note 13, pp.58-59. 17.Harris L. Coulter, \"Vaccination, Social Violence, and Criminality: The Medical Assault on the American Brain\", (Berkely, CA: North Atlantic Books, 1990), p. xiv. 18.See Note 17, pp. 120-121. 19.See What Doctors Don't Tell You, \"The WDDTY Vaccination Handbook\", The Wallace Press 1991, pp. 6-7. 20.Science, 26 March 1977. 21.See Note 4, p 15. 22.See Note 1, p 45. 23.P. Airola N.D., PhD. \"Everywomans Book\", Health Plus, Phoenix, Arizona. 24.Eleanor McBean, PhdD., \"Vaccinations Do Not Protect\", (Manachaca, TX: Health Excellence Ssytems, 1991), p. 8. 25.Eleanor McBean, \"The Poisoned Needle\", (Mokelumne Hill, CA: Health Research, 1974), p. 142. 26.See Note 24. 27. Scientific American, April, 1955, p.98. 28.See Note 5 29.H.L. Coulter and B.L. Fisher \"DPT - A Shot in the Dark\" 30.See Note 14. 31.See Note 19, p. 27. 32.See Note 19, p. 27. 33.Richard Moskowitz, MD, \"Vaccination: A Sacrement of Modern Medicine.\" Presented in a speech at the Annual Conference of the Society of Homeopaths, (Manchester, England, September 1991). 34.See Note 4, p. 23. 35.Whooping Cough, the DPT Vaccine and Reducing Vaccine Reactions (Viena, VA., National Vaccine Information Centre 1989), pp. 7-10. 36.See Note 5.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.alanlam.demon.co.uk/vac2.htm"], "authors": [], "publish_date": null}