{"result_id": "261029", "URL": "https://rense.com/general86/legl.htm", "timestamp": "2023-04-25 17:00:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general86/legl.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "How To Legally Say 'NO' To All Vaccines", "cleaned_text": "Millions of Americans have come to distrust vaccines and mainstream medicine's vaccine agenda. There is a growing movement in this country and around the world that questions the safety and effectiveness of all vaccines for obvious reasons. Many childhood disorders such as autism, ADD/ADHD, SIDS and others have been linked to vaccines. Thousands of soldiers who served in the military have been severely disabled or in some cases even died after receiving their mandated shots. Vaccines are the most controversial subject in all of medicine. The standard line heard from most parents once their eyes are open to the risks of vaccines is, \"How will I get my child into day care or in school without their shots.\" Those working in the healthcare field or soldiers in the military are faced with similar questions. To help educate the people further about how to legally avoid all vaccines, Dr. Sherri Tenpenny has put together a brand new book that is absolutely necessary to have in your possession if you or a loved one don't want to vaccinate but are not sure how to get around it. As Dr. Tenpenny says on the back cover of her book, \"Saying No To Vaccines is not intended to be a balanced view of vaccination literature. Pro-vaccine information is readily accessible through the American Academy of Pediatrics, the CDC, healthcare and government-sponsored organizations. This book balances the debate.\" Below is a copy of an interview Crusador editor Greg Ciola conducted with Dr. Tenpenny shortly after the release of her new book. Crusador: What was the impetus for writing your new book \"Saying NO To Vaccines\"? Parents needed a tool that did their homework for them. The evidence is there to support their decision to not vaccinate; you just have to do a little work to find it. Everyone seems to be so afraid of \"bugs\" and their potential ability to make us sick. But the reality is that we swim in \"bugs\" every day and we are not dropping over like flies.. The only \"bugs\" we seem to obsess over are associated with vaccines. Only two generations ago, measles, mumps and chickenpox were normal experiences of childhood. Why we have complete fear of these infections is media and money driven and unfounded. If the focus of Public Health was on sleep, exercise, clean water and safe, non-GMO food, we would have a healthy society without vaccinesbut we would not have billion dollar industries employing millions of people to keep us \"healthy.\" The fact is, we are a very UNhealthy society with vaccines, so the Public health and argument that we must vaccinate 'for greater good' is a failure. I put a large body of research into my first book, FOWL! and my two DVDS, documenting the dangers of vaccination. \"Saying No To Vaccines\" was the next logical step. It answers the question, \"I've decided not to vaccinate, now what do I do?\" Crusador: What are some of the issues you cover in the book that aren't covered in your two DVD's \"Vaccines: The Risks, The Benefits, The Choices\" and \"Vaccines: What CDC Documents and Science Reveal\"? There is very little overlap between Saying No to Vaccines and the DVDs. The foundational premise of the book is to give answers refuting the 25 most common arguments used to promote vaccination. For example, parents are often told the vaccine-preventable diseases of childhood can be serious and if their child is not vaccinated, their child could die. I tell them how to refute that argument and give documentation from the medical literature to demonstrate that statement is nothing more than fear mongering. Parents are told by pediatricians there is \"no evidence that vaccination harms the immune system\" and there is \"no evidence that vaccination can lead to chronic disease.\" I used the medical literature to prove the opposite is true. Crusador: What are the most common questions you get about vaccines? The most frequently-asked question I get is about vaccination exemption, meaning, \"How do I refuse the vaccine and still get my kids into school or keep my job,\" so by design a large part of the book covers exemptions. I included a lot of detail on how to avoid vaccinations for school situations, including college, professional situations where a job may require certain vaccines, if you are in a nursing home, foreign adoption, the military, even if you are incarcerated. I have also included a chapter on frequently- asked questions about vaccination. Saying No To Vaccines has an entire section on \"most frequently asked questions.\" Crusador: There is a huge divide in this country between those who think you should vaccinate versus those who feel you shouldn't. The majority is still on the side of thinking that vaccines are THE answer to long-term immunity. When you do speaking engagements or radio interviews or simply talk to a pregnant woman about the need to question the safety of vaccines further, how do you present your information to make someone think twice? Even though I strongly believe that vaccines cause more harm than the \"good\" they supposedly do, it is important for people to see the evidence of harm ­ from a scientific perspective ­ and not just take my word for it. All of my information, every slide and every paragraph in my book, is referenced from a highly reputable medical journal or from the Centers for Disease Control, the CDC. People can see for themselves the one-sided, biased view of the vaccine industry, promoting that vaccines are \"safe\" and \"protective.\" Almost 100% of the time, once people pull back the veil and see the rest of the story, they know that vaccination is not what the drug companies claim it to be. Crusador: Do you feel that there is such a thing as a \"safe\" vaccine? If there isn't, how do you counter the mainstream medical mentality that vaccines may not be entirely without risks, but those risks are far less than the risks we would face without vaccines at all? I really felt that parents needed strong answers for when they decided to not vaccinate. Very few people are willing to say something. The risk of the vaccine is greater than the risk of the disease. The \"Green Our Vaccines\" movement was partially behind the reason I wrote this book. Many activists, people with very good intentions, hedge and put their support behind \"safer\" vaccines which are a chemical impossibility. People just need to SAY NO. Crusador: Tell our readers a little more about the exemption clauses you discuss in your book. The medical establishment has done a terrific job of intimidating people into thinking they have to take vaccines and yet, rarely if ever will you hear about the ways to exempt yourself and family from taking vaccines. A medical exemption is available in all 50 states but must be recommended by a doctor. The exemption can be difficult to obtain and often, it only excuses future vaccination with a shot that has already caused a severe reaction. There are three exemptions available in this country ­ medical, religious and philosophical. As of now, 19 states accept a philosophical exemption. It is the easiest of the three to use. You request a form from the school nurse, state the reasons you don't want to vaccinate your child, sign it and give it to the school. Generally, that's it. However, different school systems have different rules. Some require the form annually, some require both parents to sign the exemption form, some require it to be notarized and so forth. You can find links to your state laws and more information by going to <http://www.DrTenpenny.com>www.DrTenpenny.com . Religious exemptions are available in all other states except West Virginia and Mississippi (which only have medical exemptions). Religious exemptions can be tricky and in some states, very difficult to obtain and defend. I often recommend that people consult an attorney for this type of exemption. Some states, such as New York and New Jersey, are difficult. New York has been known to use something called a \"sincerity test.\" Parents are literally interrogated by an attorney representing the school district regarding how sincere their religious assertions are for refusing a vaccine. A panel then decides if you are sincere enough in your beliefs to allow you to refuse vaccination on religious ground. I find these tactics absolutely appalling and akin to Inquisitioners of the Middle Ages. Crusador: Where do you see the whole pro-vaccine movement going and what threats to our Constitutional freedoms do you see coming down the pike? The dogged determination of those who oppose vaccines, and in particular mandatory vaccination, has gained traction at a grass roots level and garnered a lot of attention from the media. I feel that we have the pro-vaccinators on the ropes. Our arguments are hard to deny and the global autism epidemic can no longer be ignored. Pro-vaccinators are using manipulation, threats and fear tactics, trying to convince everyone that vaccines are not only safe but absolutely necessary. I see the vaccine industry like a wounded Tyrannosaurus Rex, gnashing its teeth and flailing its ugly head. It won't die quickly and it will probably get worse before it gets better. Crusador: There are many people in this country, myself included, who are concerned that there is an evil agenda to mass vaccinate the entire planet in the event of a health emergency. Do you feel that there are genuine reasons to be concerned and what might we expect to see unfold in an emergency? Executive orders and recommendations from the Department of Health and Human Services (HHS) have been written that stop just short of allowing government-enforced mandatory vaccination for anthrax, smallpox and bird flu. The only way to change these policies is by standing together and boldly saying no. Crusador: Are you still confident that with enough knowledge about the risks and dangers of vaccines enough people will wake up and say NO before Big Pharma forces its will upon the populace? I'm not sure. People tend to be sheep ­ Americans in particular. Look what we have allowed a small number in the White House and 545 people in Congress to do to our country. And even those people who want to effect a change have little time and few resources to do so. No one wants to stand out, speak up and challenge authority. Whatever happened to those bra-burning activists of the 1960s? However, people really are involved now, more than ever. It only takes a small, vocal minority to really make a difference. As stated years ago by Margaret Mead, \"Never doubt that a small group of thoughtful, committed citizens can change the world; indeed it is the only thing that ever has.\" Crusador: Thank you for your time, Sherri. These are excellent answers. I encourage everyone reading this interview to make every effort they can to get a copy of your new book and share it with their friends and loved ones because it is a great tool to give the average person confidence to \"SAY NO TO VACCINES\". Thank you, Greg for helping me get this message out to more people.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}