{"result_id": "261009", "URL": "https://rense.com/general25/worldsaidnotready.htm", "timestamp": "2023-04-25 17:00:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general25/worldsaidnotready.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "World Said 'Not Ready' For An AIDS Vaccine", "cleaned_text": "Despite scientists' optimism about the possibility of developing an AIDS vaccine, the world is \"not ready\" to make and distribute such a vaccine should it become available soon, according to Seth Berkley, president of the International AIDS Vaccine Initiative (IAVI). \"Most of the decisions that need to be taken to get the world ready for a vaccine are political rather than scientific. The manufacture and distribution of the vaccine are issues of political will,\" Berkley told delegates at the World Economic Forum's Africa Summit in Durban yesterday(thurs). \"Vaccines are developed on the basis of empirical science. While there are no perfect animal models, we know that we can fully protect primates (from Simian Immuno-Deficiency Virus). We also know that some people have immune protection from HIV despite having been repeatedly exposed to it. \"So the scientific community believes an AIDS vaccine is a possibility,\" said Berkley. \"But access to the vaccine is an issue of policy not science.\" One AIDS vaccine candidate is in final phase (phase III) trials, and the results will be known within six months. The results of another phase III trial will be known in two to three years, while the results of a third phase III trial will be known in about five to six years' time. \"But if one of these works, will we have the manufacturing and distribution capacity and the regulatory frameworks to reach the people they need to as soon as possible?\" asked Berkley, adding that during the course of the three-day summit 45 000 people worldwide would have been infected with HIV. In the past, vaccines had taken 15 to 20 years to reach those who needed them in the developing world, and this was \"unacceptable\", he added. Dr Tim Tucker, head of South Africa's Vaccine Initiative (SAVI), described ensuring access to the AIDS vaccine as \"the greatest ethical challenge of our time\". \"South Africa will start human trials in 2003. We have a mandate from Cabinet, the trial facilities, laboratories, dedicated ethics groups, community education and mobilisation groups,\" said Tucker. \"But we need to strengthen our financial base. Manufacturing costs are significant. Distribution issues are complex and challenging. We want to ensure that there is not the division in distribution between the developed and developing world with the AIDS vaccine that we have seen with anti-retroviral drugs and every other vaccine.\" Archbishop Njongonkulu Ndungane urged government to \"use faith-based organisations to prepare communities for a vaccine\". \"We have a presence in every square inch of this country, and in SADC as well,\" said Ndungane. \"Our core business is care and compassion.\" Other delegates suggested tax incentives for businesses who invested in vaccine research, which is far more costly and less profitable than drug development. Health Minister Dr Manto Tshabalala-Msimang said legislatures could also play an important role as representatives had \"direct links with the constituencies that have elected them\".", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.health-e.org.za/view.php3?id=20020603"], "authors": [], "publish_date": null}