{"result_id": "261012", "URL": "https://rense.com/general90/BILL.HTM", "timestamp": "2023-04-25 17:00:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general90/BILL.HTM", "encoding": null}, "image": null, "domain": "rense.com", "title": "Bill Gates On 'Vaccines To Reduce Population'", "cleaned_text": "Microsoft founder and one of the world's wealthiest men, Bill Gates, projects an image of a benign philanthropist using his billions via his (tax exempt) Bill & Melinda Gates Foundation, to tackle diseases, solve food shortages in Africa and alleviate poverty. In a recent conference in California, Gates reveals a less public agenda of his philanthropy-population reduction, otherwise known as eugenics. Gates made his remarks to the invitation-only Long Beach, California TED2010 Conference, in a speech titled, \"Innovating to Zero!.\" Along with the scientifically absurd proposition of reducing manmade CO2 emissions worldwide to zero by 2050, approximately four and a half minutes into the talk, Gates declares, \"First we got population. The world today has 6.8 billion people. That's headed up to about 9 billion. Now if we do a really great job on new vaccines, health care, reproductive health services, we lower that by perhaps 10 or 15 percent.\" (author's emphasis). In plain English, one of the most powerful men in the world states clearly that he expects vaccines to be used to reduce population growth. When Bill Gates speaks about vaccines, he speaks with authority. In January 2010 at the elite Davos World Economic Forum, Gates announced his foundation would give $10 billion (circa ¤7.5 billion) over the next decade to develop and deliver new vaccines to children in the developing world. The primary focus of his multi-billion dollar Gates Foundation is vaccinations, especially in Africa and other underdeveloped countries. Bill and Melinda Gates Foundation is a founding member of the GAVI Alliance (Global Alliance for Vaccinations and Immunization) in partnership with the World Bank, WHO and the vaccine industry. The goal of GAVI is to vaccinate every newborn child in the developing world. Now that sounds like noble philanthropic work. The problem is that the vaccine industry has been repeatedly caught dumping dangerous-meaning unsafe because untested or proven harmful-vaccines onto unwitting Third World populations when they cannot get rid of the vaccines in the West. Some organizations have suggested that the true aim of the vaccinations is to make people sicker and even more susceptible to disease and premature death. Dumping toxins on the Third World In the aftermath of the most recent unnecessary Pandemic declaration of a global H1N1 swine flu emergency, industrial countries were left sitting on hundreds of millions of doses of untested vaccines. They decided to get rid of the embarrassing leftover drugs by handing them over to the WHO which in turn plans to dump them for free on select poor countries. France has given 91 million of the 94 million doses the Sarkozy government bought from the pharma giants; Britain gave 55 million of its 60 million doses. The story for Germany and Norway is similar. As Dr. Thomas Jefferson, an epidemiologist with the Cochrane Research Center in Rome noted, \"Why do they give the vaccines to the developing countries at all? The pandemic has been called off in most parts of the world. The greatest threat in poor countries right now is heart and circulatory diseases while the virus figures at the bottom of the list. What is the medical reason for donating 180 million doses?\" As well, flu is a minor problem in countries with abundant sunshine, and it turned out that the feared H1N1 Pandemic \"new great plague\" was the mildest flu on record. The pharmaceutical vaccine makers do not speak about the enormous health damage from infant vaccination including autism and numerous neuro-muscular deformities that have been traced back to the toxic adjuvants and preservatives used in most vaccines. Many vaccines, especially multi-dose vaccines that are made more cheaply for sale to the Third World, contain something called Thimerosal (Thiomersol in the EU), a compound (sodium ethylmercurithiosalicylate), containing some 50% mercury, used as a preservative. In July 1999 the US' National Vaccine Information Center declared in a press release that, \"The cumulative effects of ingesting mercury can cause brain damage.\" The same month, the American Academy of Pediatrics (AAP) and the Centers for Disease Control and Prevention (CDC) alerted the public about the possible health effects associated with thimerosal-containing vaccines. They strongly recommended that thimerosal be removed from vaccines as soon as possible. Under the directive of the FDA Modernization Act of 1997, the Food and Drug Administration also determined that infants who received several thimerosal-containing vaccines may be receiving mercury exposure over and above the recommended federal guidelines. Gates' interest in inducing population reduction among black and other minority populations is not new unfortunately. As I document in my book, Seeds of Destruction, since the 1920's the Rockefeller Foundation had funded the eugenics research in Germany through the Kaiser-Wilhelm Institutes in Berlin and Munich, including well into the Third Reich. They praised the forced sterilization of people by Hirtler Germany, and the Nazi ideas on race \"purity.\" It was John D. Rockefeller III, a life-long advocate of eugenics, who used his \"tax free\" foundation money to initiate the population reduction neo-Malthusian movement through his private Population Council in New York beginning in the 1950's. The idea of using vaccines to covertly reduce births in the Third World is also not new. Bill Gates' good friend, David Rockefeller and his Rockefeller Foundation were involved as early as 1972 in a major project together with WHO and others to perfect another \"new vaccine.\" The results of the WHO-Rockefeller project were put into mass application on human guinea pigs in the early 1990's. The WHO oversaw massive vaccination campaigns against tetanus in Nicaragua, Mexico and the Philippines. Comite Pro Vida de Mexico, a Roman Catholic lay organization, became suspicious of the motives behind the WHO program and decided to test numerous vials of the vaccine and found them to contain human Chorionic Gonadotrophin, or hCG. That was a curious component for a vaccine designed to protect people against lock-jaw arising from infection with rusty nail wounds or other contact with certain bacteria found in soil. The tetanus disease was indeed, also rather rare. It was also curious because hCG was a natural hormone needed to maintain a pregnancy. However, when combined with a tetanus toxoid carrier, it stimulated formation of antibodies against hCG, rendering a woman incapable of maintaining a pregnancy, a form of concealed abortion. Similar reports of vaccines laced with hCG hormones came from the Philippines and Nicaragua. The Bill and Melinda Gates Foundation, along with David Rockefeller's Rockefeller Foundation, the creators of the GMO biotechnology, are also financing a project called The Alliance for a Green Revolution in Africa (AGRA) headed by former UN chief, Kofi Annan. Accepting the role as AGRA head in June 2007 Annan expressed his \"gratitude to the Rockefeller Foundation, the Bill & Melinda Gates Foundation, and all others who support our African campaign.\" The AGRA board is dominated by people from both the Gates' and Rockefeller foundations. Monsanto, DuPont, Dow, Syngenta and other major GMO agribusiness giants are reported at the heart of AGRA, using it as a back-door to spread their patented GMO seeds across Africa under the deceptive label, 'bio-technology,' a euphemism for genetically engineered patented seeds. The person from the Gates Foundation responsible for its work with AGRA is Dr. Robert Horsch, a 25-year Monsanto GMO veteran who was on the team that developed Monsanto's RoundUp Ready GMO technologies. His job is reportedly to use Gates' money to introduce GMO into Africa. To date South Africa is the only African country permitting legal planting of GMO crops. In 2003 Burkina Faso authorized GMO trials. In 2005 Kofi Annan's Ghana drafted bio-safety legislation and key officials expressed their intentions to pursue research into GMO crops. AGRA is being used to create networks of \"agro-dealers\" across Africa, at first with no mention of GMO seeds or herbicides, in order to have the infrastructure in place to massively introduce GMO. GMO crops have never been proven safe for human or animal consumption. Moreover, they are inherently genetically 'unstable' as they are an unnatural product of introducing a foreign bacteria such as Bacillus Thuringiensis (Bt) or other material into the DNA of a given seed to change its traits. Perhaps equally dangerous are the 'paired' chemical herbicides sold as a mandatory part of a GMO contract, such as Monsanto's Roundup, the most widely used such herbicide in the world. It contains highly toxic glyphosate compounds that have been independently tested and proven to exist in toxic concentrations in GMO applications far above that safe for humans or animals. Tests show that tiny amounts of glyphosate compounds would do damage to a human umbilical, embryonic and placental cells in a pregnant woman drinking the ground water near a GMO field. One long-standing project of the US Government has been to perfect a genetically-modified variety of corn, the diet staple in Mexico and many other Latin American countries. The corn has been field tested in tests financed by the US Department of Agriculture along with a small California bio-tech company named Epicyte. Announcing his success at a 2001 press conference, the president of Epicyte, Mitch Hein, pointing to his GMO corn plants, announced, \"We have a hothouse filled with corn plants that make anti-sperm antibodies.\" Hein explained that they had taken antibodies from women with a rare condition known as immune infertility, isolated the genes that regulated the manufacture of those infertility antibodies, and, using genetic engineering techniques, had inserted the genes into ordinary corn seeds used to produce corn plants. In this manner, in reality they produced a concealed contraceptive embedded in corn meant for human consumption. \"Essentially, the antibodies are attracted to surface receptors on the sperm,\" said Hein. \"They latch on and make each sperm so heavy it cannot move forward. It just shakes about as if it was doing the lambada.\" Hein claimed it was a possible solution to world \"over-population.\" The moral and ethical issues of feeding it to humans in Third World poor countries without their knowing it countries he left out of his remarks. Spermicides hidden in GMO corn provided to starving Third World populations through the generosity of the Gates' foundation, Rockefeller Foundation and Kofi Annan's AGRA or vaccines that contain undisclosed sterilization agents are just two documented cases of using vaccines or GMO seeds to \"reduce population.\" Gates' TED2010 speech on zero emissions and population reduction is consistent with a report that appeared in New York City's ethnic media, Irish.Central.com in May 2009. According to the report, a secret meeting took place on May 5, 2009 at the home of Sir Paul Nurse, President of Rockefeller University, among some of the wealthiest people in America. Investment guru Warren Buffett who in 2006 decided to pool his $30 billion Buffett Foundation into the Gates foundation to create the world's largest private foundation with some $60 billions of tax-free dollars was present. Banker David Rockefeller was the host. The exclusive letter of invitation was signed by Gates, Rockefeller and Buffett. They decided to call themselves the \"Good Club.\" Also present was media czar Ted Turner, billionaire founder of CNN who stated in a 1996 interview for the Audubon nature magazine, where he said that a 95% reduction of world population to between 225-300 million would be \"ideal.\" In a 2008 interview at Philadelphia's Temple University, Turner fine-tuned the number to 2 billion, a cut of more than 70% from today's population. Even less elegantly than Gates, Turner stated, \"we have too many people. That's why we have global warming. We need less people using less stuff (sic).\" Others attending this first meeting of the Good Club reportedly were: Eli Broad real estate billionaire, New York's billionaire Mayor Michael Bloomberg and Wall Street billionaire and Council on Foreign Relations former head, Peter G. Peterson. In addition, Julian H. Robertson, Jr., hedge-fund billionaire who worked with Soros attacking the currencies of Thailand, Indonesia, South Korea and the Asian Tigen economies, precipitating the 1997-98 Asia Crisis. Also present at the first session of the Good Club was Patty Stonesifer, former chief executive of the Gates foundation, and John Morgridge of Cisco Systems. The group represented a combined fortune of more than $125 billion. According to reports apparently leaked by one of the attendees, the meeting was held in response to the global economic downturn and the numerous health and environmental crises that are plaguing the globe. But the central theme and purpose of the secret Good Club meeting of the plutocrats was the priority concern posed by Bill Gates, namely, how to advance more effectively their agenda of birth control and global population reduction. In the talks a consensus reportedly emerged that they would \"back a strategy in which population growth would be tackled as a potentially disastrous environmental, social and industrial threat.\" Gates and Buffett are major funders of global population reduction programs, as is Turner, whose UN Foundation was created to funnel $1 billion of his tax-free stock option earnings in AOL-Time-Warner into various birth reduction programs in the developing world. The programs in Africa and elsewhere are masked as philanthropy and providing health services for poor Africans. In reality they involve involuntary population sterilization via vaccination and other medicines that make women of child-bearing age infertile. The Gates Foundation, where Buffett deposited the bulk of his wealth two years ago, is also backing introduction of GMO seeds into Africa under the cloak of the Kofi Annan-led 'Second Green Revolution' in Africa. The introduction of GMO patented seeds in Africa to date has met with enormous indigenous resistance. Health experts point out that were the intent of Gates really to improve the health and well-being of black Africans, the same hundreds of millions of dollars the Gates Foundation has invested in untested and unsafe vaccines could be used in providing minimal sanitary water and sewage systems. Vaccinating a child who then goes to drink feces-polluted river water is hardly healthy in any respect. But of course cleaning up the water and sewage systems of Africa would revolutionize the health conditions of the Continent. Gates' TED2010 comments about having new vaccines to reduce global population were obviously no off-the-cuff remark. For those who doubt, the presentation Gates made at the TED2009 annual gathering said almost exactly the same thing about reducing population to cut global warming. For the mighty and powerful of the Good Club, human beings seem to be a form of pollution equal to CO2. Bill Gates, \"Innovating to Zero!, speech to the TED2010 annual conference, Long Beach, California, February 18, 2010, accessed in \"http://www.ted.com/talks/bill_gates.html\" http://www.ted.com/talks/bill_gates.html. Louise Voller, Kristian Villesen, WHO Donates Millions of Doses of Surplus Medical Supplies to Developing countries, Danish Information, 22 December 2009, accessed http://www.theflucase.com/index.php?option=com_content&view=article&id=2419%3Awhos One is the Population Research Institute in Washington, http://pop.org/ Noted in Vaccinations and Autism, accessed in http://www.mercurypoisoningnews.com/vacautism.html F. William Engdahl, Seeds of Destruction: The Hidden Agenda of Genetic Manipulation, Global Research ( \"http://www.globalresearch.ca\" www.globalresearch.ca), Montreal, 2007, pp. 79-84. James A. Miller, Are New Vaccines Laced With Birth-Control Drugs?, HLI Reports, Human Life International, Gaithersburg, Maryland; June-July 1995. Cited in F. William Engdahl, \"Doomsday Seed Vault\" in the Arctic: Bill Gates, Rockefeller and the GMO giants know something we don't, Global Research, December 4, 2007, accessed in http://www.globalresearch.ca/index.php?context=va&aid=7529 Mariam Mayet, Africa's Green Revolution rolls out the Gene Revolution, African Centre for Biosafety, ACB Briefing Paper No. 6/2009, Melville, South Africa, April 2009. Nora Benachour and Gilles-Eric Seralini, Glyphosate Formulations Induce Apoptosis and Necrosis in Human Umbilical Embryonic, and Placental Cells, Chemical Research in Toxicology Journal, American Chemical Society, 2009, 22 (1), pp 97­105. Robin McKie, GMO Corn Set to Stop Man Spreading His Seed, London, The Observer, 9 September 2001. Ibid. McKie writes, \"The pregnancy prevention plants are the handiwork of the San Diego biotechnology company Epicyte, where researchers have discovered a rare class of human antibodies that attack spermthe company has created tiny horticultural factories that make contraceptivesEssentially, the antibodies are attracted to surface receptors on the sperm,\" said Hein. \"They latch on and make each sperm so heavy it cannot move forward. It just shakes about as if it was doing the lambada.\" Ted Turner, cited along with youTube video of Turner in Aaron Dykes, Ted Turner: World Needs a 'Voluntary' One-Child Policy for the Next Hundred Years, Jones Report.com, April 29, 2008. Accessed in \"http://www.jonesreport.com/article/04_08/28turner_911.html\" http://www.jonesreport.com/article/04_08/28turner_911.html John Harlow, Billionaire club in bid to curb overpopulation, London, The Sunday Times", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}