{"result_id": "261015", "URL": "https://rense.com/general31/horowitzVacInjuryhomeland.htm", "timestamp": "2023-04-25 17:00:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general31/horowitzVacInjuryhomeland.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Horowitz - Vaccine Injury, Homeland Security And Culpability", "cleaned_text": "If you are still processing shock in the wake of the virtually unanimous passage of the Bush administration's Homeland Security Bill with its \"license to kill\" from vaccine injuries without liabilities, you have likely yourself to blame most. I don't relish blaming victims, for we have all been victimized by this legislation. But for more than six years, since the publication of Emerging Viruses: AIDS & Ebola-Nature, Accident or Intentional? (Tetrahedron Press, 1996) my colleagues and I tried to alert you to the increasing attacks on health freedoms and human rights directed by special interest groups representing the multi-national military-medical/pharmaceutical- petrochemical cartel. We provided proof of their power over most elected officials, and the mainstream media, but you thought we were delusional. We predicted unprecedented civil rights violations reflecting past history, international developments, unbridled corporate greed, and ongoing global genocide concomitant with totalitarian legislation. But you turned a deaf ear. We heralded the \"Model State Emergency Health Powers Act\" years before it was announced and even showed you documents and official testimonies concerning the \"quarantine camps\" being established, but you closed your eyes and said we were \"paranoid.\" We explained Machiavellian theory in the common political practice of administering \"managed chaos\"-creating public frights for which expensive solutions had previously been prepared. As an example we solved the anthrax mailings mystery and identified its sole beneficiaries, particularly the British oligarchy-controlled anthrax vaccine maker, Bioport. We provided reams of data proving vaccines deliver biotoxic ingredients leaving recipients chronically ill and virtually enslaved to drug companies and their \"life-saving\" formulas. But you said this was \"inconceivable,\" and asked \"Don't you trust any vaccines?\" So you took your children to \"medical deities\" for \"routine childhood immunizations\" because \"they said it was mandatory,\" and you watched your children get sick, if not crippled. Then as you were wondering why you were so trusting, you sought other doctors to prescribe other drugs, made by the subsidiaries of the vaccine manufacturers. Soon after your child became ill you reached out to leaders in the \"vaccine risk awareness\" movement to report your grief and horror. They touched your hand, or told you they empathized. They asked that you send them money. Then they professed that most vaccines were \"pretty safe.\" \"Only some vaccines have problems that require our ongoing vigilance,\" they assured. They informed you to beware of those of people like me in the \"anti-vaccination\" camp. They labeled us \"radicals\" for our conviction that vaccines were principally made to deliver genocide. The effectively character assassinated our messengers rather than refuting the messages. You shook your head as if to say \"how could the 'radicals' be so stupid.\" Then you gave these leaders and their organizations more money and your volunteered time in support of their outstanding efforts. One such leader and group comes to mind as an exquisite example. I adequately exposed the National Vaccine Information Center (NVIC) directed by Barbara Loe Fisher and Kathy Williams in previous writings. This leading \"vaccine risk awareness\" group's developmental history documents formidable formative financial and administrative ties to drug industrialists and pharmaceutical lobbyists. When my colleagues and I pointed this out to you, you silenced us and told us to \"Stop it! We all need to work together.\" When I then relayed NVIC's large investment in sponsoring the passage of the National Childhood Vaccine Injury Act of 1986, which gave precedent to the Homeland Security Bill's drug industry indemnity clause, you still would not listened. The \"superfund\" that was set up for injured families through NVIC collusion with vaccine-makers' \"was a good idea,\" you said somewhat unconvinced and unconvincing. The fact that the vast majority of the hundreds of thousands of vaccine-victimized families got nothing more than a bureaucratic shuffle and legal nightmare didn't alter your optimism toward these \"political moderates.\" \"They put out good information too, from time to time,\" you defended. Then I told you what the Bible says about half truths-\"They are complete lies,\" I warned. \"Unless you are willing to see and expose the 'big picture,' the whole truth, including the links between the vaccine makers and the Nazis of I.G. Farben and holocaust fame, you're misleading people, and your karma will be judged. 'As you sow, so shall you reap.'\" In response you thought, There he goes again with his spiritual speak. Incredulously you asked, \"You can't possibly believe that all vaccines are bad, do you? They eradicated illnesses didn't they?\" I replied honestly and affirmatively, \"No they didn't, hygiene and nutritional improvements did.\" But you could not accept my rationale. You heard me tell of my family's miraculous escape from the Nazis. \"They lined millions of 'sheeple' up and marched them, with few protesting, to their early demise in the concentration camp gas chambers for allegedly 'showers.' Showers fo what? 'Public health' and 'disinfection,'\" I recalled and continued. \"Today's physicians' offices, hospitals, and public health units are much like the 'concentration camps' of yesteryear, and today's vaccines are the 'gas.' Don't you get the similarity?\" You said it frightened you, and you preferred not to think about it again. You told me that although you \"really respected\" me for what I was doing, \"calling the 'global beast' a 'global beast,'\" you felt a less politically disturbing option, a more moderate approach, was more appropriate, at least for you. I begged you to get in touch with the whole horrific truth. Not let fear or denial get in your way. I said the greatest risk to \"homeland security\" is civilian complacency as we are all being challenged by \"white collar terrorists\" directing political agendas and public health policies. \"They use fear to command compliance with back-room shady dealings that put deadly agendas and profits before people while neglecting the scientific facts,\" I explained. A glimmer of light appeared for a moment in your eyes, but you blinked and it was gone. We finally agreed to disagree and you walked away. Now, with the passage of the Homeland Security Bill, the most egregious violation of the faith and trust we have placed in our governing officials-a direct physical and financial assault on the American people-maybe you will wake up. If you haven't already, please read \"Disease Deities on Capitol Hill Address Autism\" (Published in The Spirit of Health Newsletter, Fall-Winter 2002, also freely downloadable from www.healingcelebrations.com.), and the complete written testimony I presented to the Government Reform Committee last April. You will see that I warned you about misplaced faith and trust in elected officials in Washington. I even warned our elected officials about this form of pork barrel politics, what amounts to mutual masturbation for financial gratification. If you had heeded my words, or read my works, you would not be in shock now, nor even mildly surprised by the grave injustice Congress perpetrated by passing this bill. You would understand why even Rep. Dan Burton (R-IN), who chairs the Government Reform Committee hearings into skyrocketing autism rates, voted for the bill. He told us he simply failed to read the last minute inclusions. What a good excuse. He said he knew nothing about the vaccine injury indemnity clause before voting to pass this act. And you still believe him? You believe him despite your knowledge that he, like many of us, reviewed the CDC-secreted scientific reports linking vaccines and mercury to brain damaged children. Hundreds of thousands of behaviorally impaired youth, Dan Burton bellowed from the dais, have resulted from the now widespread toxicity. Still, he argued, we need to give more money to the CDC to study the problem. Now that this horrific bill has passed, foreshadowing even more devastating impacts on the nation's health and civil rights, you lament your loss and the tragedy befalling the medicated masses of children with autism. You think of the time and energy you wasted in futile pursuit of class action lawsuits and legal claims against now fully indemnified vaccine makers. You question your own sanity in this political reality as you find yourself stuck between the rock of disappointment and the hard place of hopelessness. You lament the additional ramifications of this \"license to kill\" given to vaccine makers. It dawns on you that this trash legislation not only impacts the millions of young victims of mercury poisoning, but equally guarantees helplessness, if not hopelessness, for those struggling, now and in future years, with myriad cancers attributed to polio vaccine viral contaminations; for Gulf War Syndrome victims made ill by vaccines and drug interactions; for military personnel recently inoculated with anthrax vaccine with up to 85% made ill; for more than a hundred thousand Lyme vaccine injured people; for claimants who cite recent studies that will soon prove early hepatitis B vaccines triggered the international AIDS pandemic; and for the millions of forthcoming smallpox vaccine injured persons who you are told to accept as simply unfortunate casualties of America's new war. Finally, did you know that the opposition's effort to strip the bill of this disgusting provision fell short by only 5 votes. The final tally was 52-47. In my humble opinion, if you had spent the last six years researching the facts available to you, not pandering to deceitful politicians but confronting them, including self- proclaimed industry-financed \"leaders\" of the \"vaccine risk awareness\" movement, or playing political games/pussy-footing around the issues so as not to offend people with news of vaccination injuries as they reflect well orchestrated global genocide, you might have been able to persuade enough people in your sphere of influence to effectively pressure one more politician each year for six years to stand against this Bill. But, instead, you preferred to live in denial about the \"big political picture\" that includes genocide. With your justifications and rationalizations you get to be right in perceiving me as \"radical,\" if not \"insane.\" Now congress has passed the Homeland Security Bill, and you remain numbed by the weight of your personal contribution to this premeditated and exposed conspiratorial outcome. Is there any comfort now in your tormented reflection on how you once called me a \"foolish conspiracy theorist?\" You have now no one more than yourself to blame. Health Science Communications for People Around the World", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.tetrahedron.org/", "http://www.healingcelebrations.com/"], "authors": [], "publish_date": null}