{"result_id": "261023", "URL": "https://rense.com/general87/clueless.htm", "timestamp": "2023-04-25 17:00:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general87/clueless.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Horowitz - US H1N1 Scientists Clueless About Vax Side Effects", "cleaned_text": "Los Angeles--America's leading promoter of getting vaccinated for the H1N1 flu, Dr. Anthony Fauci, Director of the National Institute for Allergies and Infectious Diseases (NIAID), has admitted knowing nil about how human immunity responds to vaccinations, according an interview published by Bloombert. (See: http://www.bloomberg.com/apps/news?pid=email_en&sid=a_VExSafuJY4). Dr. Fauci's stunning admission came in response to questions raised by a study of 16,000 volunteers vaccinated against HIV with results alleged to be promising, but for reasons unknown. The unexpected outcome \"tells us that we don't even know what the correlates of immunity are,\" Dr. Fauci said, referring to the measurable signs that a person has developed immunity to genetically-engineered surrogate viruses now used in the new flu vaccines. \"This is what honest intelligent vaccine critics have been saying all along,\" said Dr. Leonard Horowitz, a Harvard-trained emerging diseases expert that has condemned vaccinations as \"outlandishly barbaric and horrific, with risks far worse than using blood-letting leeches.\" \"Dr. Fauci's statement evidences the fraud and ignorance underlying vaccination programs in general,\" Dr. Horowitz said. \"Fauci admits being clueless about the fundamentals of immunity operating bioenergetically or electro-genetically, not chemically, that vaccine proponents criminally neglect to prosper by poisoning people.\" Dr. Horowitz recommends vitamins C and D, and covalently-bonded silver hydrosols that safely electrocute viruses, parasites, and pathogenic bacteria, instead of using intoxicating vaccines and drugs that produce horrible side effects. He also recommends healthy lifestyles beyond hand-washing and mask-wearing. He says that alkalizing diets with good pH8 hydration can protect people completely against the flu and most chronic diseases. Government health \"experts\" leading \"biopreparedness\" campaigns, including Dr. Fauci, neglect these common sense, highly effective, low cost, no risk alternatives to deadly vaccinations. They exclusively promote flu vaccines \"fast-tracked\" for administration this fall; falsely claiming their safety and efficacy. \"There's no possible way these \"fast-track trials,\" lasting only six weeks, can assure safety,\" Dr. Horowitz warns. \"Most vaccine injuries occur months, not weeks, following injection.\" In evidencing Dr. Fauci's fraud, Dr. Horowitz encourages everyone to discern author reliability. Fauci is the senior author of a recent article in the New England Journal of Medicine that neglected important historical facts concerning the genetics of this novel H1N1 virus. (See: http://content.nejm.org/cgi/content/full/361/3/225 ; NEJM Vol. 361;3:225-229, July 16, 2009) Other authors in the same publication provided more thorough disclosures supporting Dr. Horowitz's claim that \"laboratory sourced\" outbreaks occurred in 1977 and probably by military experiment in 1976. (See: http://content.nejm.org/cgi/content/full/NEJMra0904322) \"This H1N1 flu virus was also \"laboratory sourced,\" Dr Horowitz says. It is clearly a combination of Asian bird, Mexican pig, and human corpse virus from the 1918 Spanish flu that vaccine-makers dug up despite protests by scientists worldwide.\" In Horowitz's view, Fauci is guilty of \"gross criminal negligence\" and \"drug prostitution\" with direction from the Central Intelligence Agency (CIA). It is material fact that the CIA, David Rockefeller, and associates in the Partnership for New York City (PNYC) including Co-Chairman Rupert Murdoch, news releases and dissemination of intelligence by Fauci's agency, the NIAID, and \"biopreparedness\" policies generally, for \"national security\" according to their own documents and the Washington Post. \"Pro-vaccine propagandists, like Fauci, never openly discuss the risk of bioengineered \"live\" viruses for vaccines that might mutate further. The H1N1 vaccine's virus was designed to mutate easily for splicing together deadly genes. More recombination is assured as new mutants circulate through live-bodies worldwide,\" Dr. Horowitz said. \"This is a compelling reason to stop vaccinating people immediately,\" Dr. Horowitz explains. \"People need to wake up and reject these vaccinations. It's insane to advance this H1N1 vaccine program knowing the likelihood of creating worse pandemics, unless your intention is depopulation.\" Last week Dr. Horowitz sent the FBI an official AFFIDAVIT. (See:http://www.fluscam.com/Affidavit.html) Legal groups are using this to petition courts for injunctions against the FDA and state health officials that are certifying the new flu vaccines\" safety. Toxicology science proves otherwise. Dr. Horowitz's AFFIDAVIT provides several indicting disclosures regarding Dr. Fauci, including his close friendship with the infamous AIDS researcher Dr. Robert Gallo, credited for allegedly co-discovering HIV. Dr. Fauci is a co-patent holder on an ingredient used in the new vaccines for AIDS and H1N1 flu. The chemical is called interkeukin-2 (IL-2) and it is thought to boost cellular immunity. (See http://www.patentstorm.us/patents/5696079/claims.html patent No. 5,696,079; Dec. 9, 1997) Fauci credits Gallo for his co-discoveries in the field advancing IL-2, the \"immunologic enhancement\" of vaccines and other \"geneto-pharmaceuticals.\" This discovery is central to all gene therapies and the future of vaccines. The assignee on this patent is \"The United States of America as represented by the Department of Health\" that licensed IL-2 to CHIRON Corporation for use with other vaccine additives called \"adjuvants.\" (See: http://www.fluscam.com/Medical_Manchurian_Candidates.html) The Associated Press reported that Fauci received at least $45,072.82 in royalties when the government licensed IL-2 to CHIRON, the drug industry's major supplier of chemicals. The IL-2 adjuvant is formulated with other toxic chemicals including nonoxynol-9, a spermicide and HIV-killer linked to spontaneous abortions, and thimerosal, causing brain damage and widespread autism in children. Fauci, allegedly, donated his IL-2 royalties to charity to avoid conflict-of-interest charges. But he admitted it was his decision to withhold disclosures to patients and reporters researching IL-2 in the trials that he supervised. (See: http://www.capitolhillblue.com/artman/publish/article_6009.shtml) CHIRON Corporation makes the leading adjuvant for the H1N1 \"swine flu\" vaccine named \"MF59.\" The product also contains a tremendously toxic \"oil in water\" immuno-poison called squalene. Substantial scientific evidence and US Congressional testimonies condemned squalene's link to Gulf War Syndrome following its use in anthrax vaccines. Squalene is even more concentrated in the H1N1 flu vaccines produced for sales overseas by the American-based Baxter Corporation. \"I am aware that IL-2 is the \"common denominator\" among immune system functions, and can cause severe side effects,\" Dr. Horowitz wrote for FLUscam.com. Dr. Horowitz remains concerned that CHIRON may be adding IL-2 in is \"proprietary\" formula secreting this knowledge so that Fauci's conflicting interests, and close ties to leading drug industrialists, go unnoticed. (See: http://www.aegis.com/pubs/bala/1996/BA960809.html> In a recent study, IL-2 caused no benefit whatsoever stimulating the immune systems of 5,800 subjects at a cost of $85 million. CHIRON and taxpayers paid the tab. Yet, more money and time will be spent researching Fauci's co-discovery to advance next generation vaccines and \"geneto-pharmaceuticals.\" (See: http://www.nih.gov/news/health/feb2009/niaid-10.htm) Fauci's ignorance, knowing nil about the \"correlates of immunity\" affected by vaccine toxicity is unnerving. NOTE TO JOURNALISTS: Dr. Horowitz is the author of sixteen books including the best-selling, Emerging Viruses: AIDS & Ebola--Nature, Accident or Intentional? credited by Barack Obama's estranged minister, Rev. Jeremiah Wright, for evidencing Anglo-American genocide. For more information about the dangers of flu vaccinations, see Dr. Horowitz's comprehensive website FLUscam.com. Dr. Horowitz's recommendations for flu prevention and prompt remediation are in the \"FLU To Dos\" section of FLUscam.com, along with links to his endorsed silver hydrosol formulated to make vaccinations and antibiotics unnecessary. (See: OxySilver.com or call toll free, 1-888-KO-GERMS, for more information.)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}