{"result_id": "261018", "URL": "https://rense.com/general86/dangg.htm", "timestamp": "2023-04-25 17:00:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general86/dangg.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Dangerous, Mandatory Vaccinations Coming?", "cleaned_text": "Stephen Lendman covers the history behind some dangerous vaccines and how the government plans to begin some form of mandatory vaccination--probably through the public schools (another reason to leave sooner rather than later). \"Squalene was in the experimental anthrax vaccine and is believed to have been the cause of devastating autoimmune diseases and deaths for many Gulf War veterans. Now, squalene is to be an ingredient in virtually all forthcoming vaccines. At least three US federal laws should concern all Americans and suggest what may be coming - mandatory vaccinations for hyped, non-existent threats, like H1N1 (Swine Flu). Vaccines and drugs like Tamiflu endanger human health but are hugely profitable to drug company manufacturers.\" Actually, he points out four laws: The Project BioShield Act of 2004, The Public Readiness and Emergency Preparedness (PREP) Act, and The Pandemic and All-Hazards Preparedness Act and The Model State Emergency Health Powers Act (MSEHPA). Together they provide immunity from tort liability for vaccine makers and drug companies and grant excessively broad emergency powers to the federal government that can easily be construed to include mandatory quarantines and vaccinations. Lendman says they are \"written in a way that doesn't adequately protect citizens against the misuse of the tremendous powers that it would grant in an emergency. (It's) replete with civil liberties problems. It goes well beyond bioterrorism (with) an overbroad definition of 'public health emergency that may be anything a local or national authority declares for any reason with no conclusive evidence for proof.\" Adverse Vaccination Effects on Gulf War Troops: \"Before deploying to the Persian Gulf in 1990 - 91 (and thereafter to the present), all US troops got a standard series of inoculations against infectious diseases - the same ones given to all US citizens traveling to the region. After arriving, 150,000 also got anthrax vaccinations and 8000 botulinum toxoid ones even though concerns were raised about adverse long-term health consequences. \"Military personnel usually get multiple vaccinations. [The politicized] National Academy of Sciences' Institute of Medicine (IOM) studied their effects but didn't prove or disprove any long-term adverse effects. However several independent studies of British Gulf War veterans found some link between multiple vaccinations and later health problems. \"Gary Matsumoto is a New York-based award-winning investigative journalist. His 2004 book, 'Vaccine A: The Covert Government Experiment That's Killing Our Soldiers--And Why GI's Are Only The First Victims'took sharp issue with IOM results and the Pentagon's denial of Gulf War syndrome. \"Investigating the shadowy vaccination development world, he discovered US military-employed doctors and scientists conducted secret medical experiments on US citizens in violation of the Nuremberg Code and fundamental medical ethics. \"According to Matsumoto, the Pentagon violated these and other standards, betrayed the troops, and the fundamental duty of military and civilian leaders to protect them. Since at least 1987, biowarfare development trumped the welfare of tens of thousands of GIs used as human guinea pigs for inoculation with experimental unlicensed anthrax vaccines containing squalene - an oil-based adjuvant (claimed to enhance immunity) known for decades to cause severe autoimmune diseases in lab animals, yet administered involuntarily without disclosure of its harmful effects to human health. Matsumoto wrote: \"Other research shows that squalene is the experimental anthrax vaccine ingredient that caused devastating autoimmune diseases and deaths for many Gulf War veterans from the US, UK, and Australia, yet it continues in use today and for new vaccines development in labs. There's a 'close match between the squalene-induced diseases in animals and those observed in humans injected with this oil: rheumatoid arthritis, multiple sclerosis and systemic lupus erythematosus.' \"Matsumoto says that 'the real problem with using squalene (isn't) that it mimics a molecule found in the body; it is the same molecule. So what American scientists conceived as a vaccine booster (or what's now being developed in labs) was another 'nano-bomb,' instigating chronic, unpredictable and debilitating disease. When the NIH....argued that squalene would be safe because it is native to the body, just the opposite was true,' and, of course, still is. 'Squalene's natural presence in the body made it one of the most dangerous molecules ever injected into man' and using it in vaccines is outlandish and criminal. \"'The immune system 'see(s) and recognizes it as an oil molecule native to the body. Squalene is not just a molecule found in a knee or elbow - it is found throughout the nervous system and the brain.' When injected in the body, the immune system attacks it as an enemy to be eliminated. Eating and digesting squalene isn't a problem. But injecting it 'galvanize(s) the immune system into attacking it, which can produce self-destructive cross reactions against the same molecule in the places where it occurs naturally in the body - and where it is critical to the health of the nervous system.' Once self-destruction begins, it doesn't stop as the body keeps making the molecule that the immune system is trained to attack and destroy.\" World Affairs Brief - Commentary And Insights On A Troubled World.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}