{"result_id": "261026", "URL": "https://rense.com/general86/vacci.htm", "timestamp": "2023-04-25 17:00:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general86/vacci.htm", "encoding": null}, "image": null, "domain": "rense.com", "title": "Vaccination Myths And Truths", "cleaned_text": "Alan G. Philips is an attorney with the following credentials: -- he's one of the few American lawyers whose practice includes vaccine exemption and waiver issues; -- he advises other attorneys seeking help for their own clients on vaccine exemptions; -- he co-founded Citizens for Healthcare Freedom (CHF) as \"a grassroots, nonprofit organization supporting an exciting new Consumer Health Freedom Act in North Carolina\" where he lives and practices law; -- he \"may be the only attorney in the US with a website dedicated to vaccine exemptions\" - vaccinerights.com; -- he authored \"The Authoritative Guide to Vaccine Legal Exemptions;\" and -- he's written numerous articles and publications on vaccinations and immunizations, including \"Dispelling Vaccination Myths: An Introduction to the Contradictions Between Medical Science and Immunization Policy,\" published in 1996 and most recently updated in 2007. Given the possibility of universally mandated untested, experimental, toxic, and extremely dangerous Swine Flu vaccinations this fall, Philips' work is especially relevant and vital. In its entirety, it can be accessed at vaccinerights.com/dispellingvaccinationmythsx.pdf. A brief account follows below, focusing on 10 myths and truths he explains plus some additional information. More than ever, information is vital for protection against vaccines that can cause annoying to life-threatening autoimmune diseases, even the illnesses they're designed to prevent. Of special concern is their affect on children. In America and elsewhere, they're over-immunized enough to destroy their immune systems, leaving them vulnerable to a lifetime of serious health disorders. No one should voluntarily or otherwise take any vaccine, let alone one as untested and dangerous as for H1N1. But make no mistake. The dominant global media are readying a high intensity fear-mongering campaign to convince the unwary to jeopardize their health and well-being by doing it. Just say NO!! In America, laws in place empower the Health and Human Services and/or Defense secretaries to declare a national emergency and order mass vaccinations. Legally, individual states can resist, but not likely when enough pressure is applied. Under the proposed, but not enacted, October 2001 Model State Emergency Health Powers Act (MSEHPA), states are advised on how to exercise extraordinary emergency powers without regard to civil liberties issues. Individual ones have adopted some of its provisions and may add more later given the power of Washington and the media to force them. The WHO is also empowered under the 2005 International Health Regulations (IHR) to address but not mandate global vaccinations. But it has enough influence to compel nations to go along in case of a \"declared\" pandemic threat, even without evidence to prove one. \"Health officials are investigating a never-before-seen form of the flu that combines pig, bird and human viruses.... (It's) a growing medical mystery because it's unclear how (affected people) caught the virus. None (of seven cited had) contact with pigs.\" Nor had others reportedly affected in other US cities. The \"intercontinental\" mixture included North American Swine Flu, North American Avian Flu, human H1N1 flu, and a fourth H3N2 strain found in Asia and Europe. Suspicions about a synthetic laboratory-made virus have surfaced. Writing in NewsMax.com, Dr. Russell Blaylock quoted an unnamed viroligist saying: \"Where the hell it got all these genes we don't know.\" According to Blalock: \"Debate continues over the possibility that swine flu is a genetically engineered virus.\" Dallas County Medical Director Dr. John Carlo voiced concern about the possibility that: \"This strain of swine influenza (may have been) cultured in a laboratory....something that's not been seen anywhere actually in the United States and the world....\" Recently interviewed on Russia Today TV, investigative journalist Wayne Madsen cited a University of Wisconsin lab conducting joint influenza vaccine research with drug company FluGen. On March 24, Reuters reported that: \"FluGen, Inc., an emerging leader in the development, production and delivery of influenza vaccines and related products, today announced it has secured exclusive rights to a novel, patent-protected vaccine-delivery technology (that) painlessly delivers seasonal and pandemic influenza vaccines.\" Madsen believes \"the Swine Flu virus began in a lab,\" the objective being profits for vaccine makers with products \"that may not actually be safe.\" Many noted experts share that view about all vaccines. NutriMedical founder Dr. William Deagle reported that 6-8% of Swine Flu DNA matches no virus on record. He believes more lethal strains may appear in the fall. Project Camelot \"provide(s) a vehicle for researchers and whistleblowers to get their stories out.\" Interviewed on its Whistleblower Radio show, Burk Elder Hale claimed that a senior drug company biochemist (unnamed to protect him) told him: \"....an aerosoled precursor has been put into the air and almost everyone has breathed it into their lungs. (When Swine Flu) vaccines (are) administered in the fall, (they'll) be activated when (their) constituents come into contact with the aerosoled precursor in the body and will cause a rapid spread of the H1N1 influenza A virus. The biochemist is very upset about the matter....and is a very reliable source that needs our utmost protection.\" Catherine Austin Fitts is a former high-level US government official and Wall Street insider. She's now the editor of Solari.com and runs Solari, Inc. as an \"online media company focusing on ethical investment and preserving family wealth.\" Admitting she's no expert, she wrote this about Swine Flu on July 22: \"I believe one of the goals of the swine flu vaccine is depopulation. Perhaps it is the goal of a swine flu epidemic as well, whether bio-warfare or hype around a flu season....Lowering immune systems and increasing toxicity levels combined with poor food, water and terrorizing stress will help do the trick....a plague can so frighten and help control people that they will accept the end of their current benefits....without objection. And a plague with proper planning can be highly profitable. Whatever the truth (about) swine flu and related vaccines....it can be used (to) control (a) situation that is quickly shifting out of control.\" \"In short, an epidemic can be used to offset the inflation of capital with increasing deflation of the value and income of labor and continual demand destruction. (What's coming next is the) meaner face of 'the establishment against the rest of society.' \" The possibility of a diabolical depopulation scheme can't be dismissed. The idea's been around for decades, including from the 1974 Henry Kissinger project - National Security Study Memorandum 200 (NSSM 200). It was backed by Rockefeller interests to cull the world population of useless feeders so corporate giants could exploit world resources unimpeded. Kissinger's scheme was to make birth control a prerequisite for US aid. He wanted the annual death rate doubled and for a population decline in the hundreds of millions by 2000. Poor third world women in countries like Brazil were involuntarily sterilized. Millions were harmed then. Perhaps today's toll from mandatory global Swine Flu vaccinations will be billions. Yet US laws were passed to prevent it. In 1986, the National Childhood Vaccine Injury Act (NCVIA) required: -- giving parents written information on vaccine benefits and risks so they could decide on what was safe for their children; -- maintaining a permanent record of all vaccines given children, including producer names and lot numbers; -- keeping up to date medical records of all vaccinations given children; and -- recording all serious health problems after vaccinations were administered and notifying the federal Vaccine Adverse Event Reporting System (VAERS) immediately. At issue is whether federal laws and constitutional and Nuremberg protections will help. Nuremberg requires voluntary consent with full disclosure of known risks and avoidance of experimental treatments if there's any reason to believe harm may result. The Fifth Amendment protects against abusive government authority in stating that \"No person shall....be deprived of life, liberty or property, without due process of law....\" The Eighth Amendment prohibits \"cruel and unusual punishments.\" Harming human health is cruel and abusive. Mandating suspect drugs violates Nuremberg, the US Constitution, and other protective laws. Whether they'll be enforced is another matter. Under the 1986 National Childhood Vaccine Injury Act, VAERS (Vaccine Adverse Reporting System) was established. Annually, it reports about 11,000 serious vaccine reactions, including up to 200 deaths and many more permanent disabilities. Far more alarming is the following; -- the FDA estimates that only 1% of serious adverse reactions are reported; -- medical school students testified before Congress that they're told not to report these incidents; -- according to the National Vaccine Information Center (NVIC), only one in 40 New York doctors reported adverse vaccine reactions or deaths; -- international studies show vaccines cause up to 10,000 US SIDS (Sudden Infant Death Syndrome) deaths annually, and at least half of them are from vaccines; -- another study determined that 3000 US children die annually from vaccines; -- poor reporting in America suggests that annual adverse vaccine reactions, in fact, number from 100,000 - one million; -- since 1988, the government's National Vaccine Injury Compensation Program (NVICP) paid families of affected children $1.2 billion in damages; -- as authorized by the 2006 Public Readiness and Emergency Preparedness (PREP) Act, HHS Secretary Sebelius, granted drug companies legal immunity (except for impossible to prove willful misconduct) to proliferate dangerous, untested Swine Flu vaccines globally; -- vaccines are legally mandated in all 50 US states, though legally avoidable in most (under normal circumstances) as explained below; -- in settling vaccine damage suits, drug companies impose gag orders to keep vital information from the public; and -- insurers refuse to cover adverse vaccine reactions because of the high potential liability they'd face. Vaccinations cause high numbers of severe reactions, permanent disabilities, and deaths as well as an enormous personal and public cost. Virtually none of this gets reported. Myth No. 2: Vaccines are very effective Medical literature documents significant numbers of vaccine failures for measles, mumps, small pox, pertussis, polio and Hib-causing bacterial meningitis and pneumonia. In 1989, Oman experienced a widespread polio outbreak six months after completing a population-wide immunization program. In Kansas (in 1986), 90% of 1300 reported pertussis cases were \"adequately vaccinated,\" and 72% of Chicago pertussis incidents in 1993 had been as well. Evidence shows that vaccinations are an unreliable and dangerous way to prevent illness and disease. Myth No. 3: Low US disease rates are attributable to vaccines From 1850 - 1940, well before mandatory vaccination programs, the British Association for the Advancement of Science reported a 90% decrease in childhood diseases due to improved sanitation and hygiene practices. By 1945, US medical authorities noted a 95% drop in deaths from the leading childhood infectious diseases (diphtheria, pertussis, scarlet fever and measles), well before mass-immunizations began. A recent WHO report found that third world disease and mortality rates had no direct correlation with immunization programs, but closely relate to hygiene and diet standards. No evidence links vaccines with infectious disease declines. Proper hygiene and diet practices may be far more effective. Myth No. 4: Sound immunization theory and practice prove the effectiveness of vaccines Although vaccines stimulate antibody production, no evidence suggests that alone assures immunity. A 1950 British Medical Council-published study found no relationship between antibody count and disease incidence. Natural immunization involves many bodily organs and systems. Artificially producing antibodies can't achieve it. Research also shows how squalene adjuvants harm the human immune system, making it susceptible to numerous illnesses and diseases ranging from very annoying to life threatening. In addition, the \"herd immunity\" notion of mass-immunizations effectiveness is largely discredited. Just the opposite is true as evidence shows that fully vaccinated populations have experienced epidemics numerous times in the past. Further, vaccine effectiveness \"remains scientifically unproven\" because no double blind studies have been conducted to do it. Significantly, recent disease outbreaks have affected more vaccinated children than unvaccinated ones. And the common practice of \"one size fits all\" is troublesome. It lets tiny new-borns get the same dosage as a five year old. It tolerates dubious quality control practices producing what's known as \"Hot Lots\" - ones associated with disproportionately high death and disability rates. Shockingly, the FDA refuses to act preventatively against them. In fact, individual vaccine lots have almost never been recalled even when associated with severe adverse reactions. Instead, they're administered under the assumption that all recipients respond the same, regardless of race, ethnicity, genetic makeup, or other characteristics. A recent New England Journal of Medicine-reported study found that a significant number of Romanian children receiving polio vaccine contracted the disease. Evidence linked antibiotic injections to it. One innoculation raised the polio risk eight-fold; two - nine shots, 27-fold, and 10 or more 182-fold. New research may reveal other unknown hazards, but public safety won't be addressed until government health officials act responsibly, report accurately, and adequately protect their populations from vaccines they never should allow. Many supposed vaccine truths have, in fact, been proved false. False. Even CDC data show a 99.8% pertussis recovery rate during the 1992-94 period. One Cincinnati Children's Hospital infectious diseases expert said at the time: \"The disease was very mild, no one died, and no one went to the intensive care unit.\" Nearly always, childhood infectious diseases \"are benign and self-limiting. They usually impart lifelong immunity, whereas vaccine-induced immunization (when achieved) is only temporary.\" In fact, it can increase vulnerability later on by postponing better tolerated childhood illnesses until adulthood when death rates (though still low) are far higher. Most important is that nearly all common infectious diseases are rarely dangerous, and, in fact, can develop strong, healthy adult immune systems when they're most needed. In addition, few people know that children who didn't contract measles have a higher incidence of skin diseases, degenerative bone and cartilage ones, and tumors while ovarian cancer is higher among mumps-free adult women. The human immune system benefits from common childhood infectious diseases. Freedom from them may be harmful later on. Childhood disease dangers are greatly exaggerated to scare parents into getting their children vaccinated with unsafe drugs. Myth No. 6: Polio vaccinations were very successful False again. In 1955, when the Salk vaccine was introduced, polio was considered the most serious post-war public health problem. A year later, six New England states reported sharp rises ranging from more than double in Vermont to a 642% increase in Massachusetts. Other states also were badly impacted enough for Idaho and Utah to halt immunizations due to increased incidence and death rates. In his 1962 congressional testimony, Dr. Bernard Greenberg, Biostatistics Department head at the University of North Carolina, reported sharp polio increases from 1957 to 1959 and a Public Health Service whitewash that suppressed it. In 1985, the CDC reported that 87% of US cases between 1973 and 1983 were caused by the vaccine. Later it added that it caused nearly all imported cases, and most of the victims were fully vaccinated. Further, misdiagnosing, poor reporting, and cover-ups suggest that the actual number of vaccine-associated paralytic polio (VAPP) cases \"may be 10 to 100 times higher than that cited by the CDC.\" In 1977, even Jonas Salk admitted that mass inoculations caused most polio cases since 1961. The Salk vaccine proved highly dangerous. Information about it was suppressed, and declines in the disease were well underway when mass-immunizations were begun. In Europe, they occurred in countries that used, then rejected the vaccine proving it was never needed in the first place. Showing also that the same is true for other diseases, including Swine Flu with the WHO and CDC admitting that most cases are mild, unthreatening, and generally pass without treatment, let alone risking dangerous unneeded vaccines. Myth No. 7: Lack of an initial adverse reaction proves vaccines are safe Documented long-term health problems include arthritis, chronic headaches, rashes indicative of disease, non-healing skin lesions, seizures, autism, anemia, multiple sclerosis, ALS, cancer, and many others. Ingredients common to all vaccines are at issue. Squalene adjuvants are a biological time bomb that can harm or destroy the human immune system. Other ingredients are known toxicants and carcinogens, including thimersol (a mercury derivative), aluminum phosphate, formaldehyde, phenoxyethanol, and numerous gastrointestnal toxicants like liver toxicants, cardiovascular and blood toxicants, and reproductive toxicants. \"Chemical ranking systems rate many vaccine ingredients among the most hazardous substances\" known, even in microscopic doses. \"Millions of children (and adults) are partaking in an enormous crude experiment, and no sincere, organized effort is being made to track the negative side effects or to determine the long-term consequences.\" Dr. Bart Classen's epidemiological research found vaccines as the cause of 79% of insulin type I diabetes cases in children under 10. The sharp rise in numerous other diseases may also be linked with mass-immunizations. California's autism rate skyrocketed 1000% in the last 20 years. In the 1990s, MMR vaccine usage in Britain (for measles, mumps and rubella) occurred at the same time autism rose sharply. The January 2000 Journal of Adverse Drug Reactions reported that no adequate testing was done, so the vaccine never should have been licensed. The Autism Society says: \"Autism is a complex developmental disability that typically appears during the first three years of life and is the result of a neurological disorder that affects the normal functioning of the brain....\" According to the CDC and National Vaccine Information Center, one in every 150 US children develop the disease. Tens of millions are affected worldwide, making it more common than pediatric cancer, incurable type 1 (juvenile-onset) diabetes and AIDS combined. In the early 1940s, prior to mass immunizations, autism was so rare that few doctors ever encountered it. Today it's a global pandemic. Long-term vaccination reactions have been suppressed and ignored in spite of the alarming correlation between their use and the rise of autoimmune and other diseases. Vaccines aren't for protection. They're for profit and other nefarious purposes. Avoiding them is essential to protecting human health and well-being. Myth No. 8: Vaccines are the only available disease prevention option \"Historically, homeopathy has proven many times...more effective than allopathic (conventional) medicine in the treatment and prevention of disease.\" During the 1849 US cholera outbreak, homeopathic hospitals documented a 3% death rate compared to 48 - 60% in conventional ones. It's as true today, and recent epidemiological studies show homeopathic remedies far superior to vaccines in preventing diseases. They're safe, effective, and toxin and side effect-free, yet most insurers won't cover them. Alternative treatments and remedies have been safe and effective for generations, yet the medical establishment and governments attack and spurn them. Myth No. 9: \"Vaccinations are legally mandated and unavoidable...\" All states require them. However, laws vary by state, legal exemptions exist, and all states offer one or more of the following: -- all states allow medical exemptions for persons susceptible to adverse reactions; parents can cite this for their children based on family history; -- 48 states offer religious exemptions but may require membership in an established religious organization; \"according to federal precedent, personal religious beliefs may be sufficient for a religious exemption regardless of which religious organization you belong to, or whether or not you belong to an organized religion at all;\" in addition, the Supreme Court defined religion broadly for legal purposes; and All public and private schools must comply with federal and state vaccination laws and permit legal exemptions. Some vaccines are mandated, but most, perhaps all, US citizens may use legal exemptions to avoid them. In a recent article, however, Phillips states: \"All non-medical exemptions in the US are ultimately provided conditionally. That is, states have the right to require immunization for everyone, legally exempt or not, during an (emergency) outbreak, other than (for) those\" with medical exemptions. Myth No. 10: Governments place public health concerns above all others Vaccination history shows \"documented instances of deceit portraying vaccines as mighty disease conquerors, when in fact vaccines have had little or no discernible impact - or have even delayed or reversed - pre-existing disease declines....Conflicts of interest are the norm in the vaccine industry.\" Government agencies like the FDA and CDC are stacked with corporate officials who return to high-paying industry jobs provided they place profit considerations over public health and safety. In November 2000, concern over this and adverse reactions got the American Association of Physicians and Surgeons (AAPS) to pass a unanimous resolution at its 57th meeting calling for a moratorium on mandatory childhood vaccinations and for doctors to insist on \"truly informed consent for (their) use....\" In October 1999, Dr. Bart Classen, founder and CEO of Classen Immunotherapies, told Congress: \"It is clear....that the government's immunization policies are driven by politics and not by science. I can give numerous examples where employees of the US Public Health Service....appear to be furthering their careers by acting as propaganda officers to support political agendas. In one case....employees of a foreign government, who were funded and working closely with the US Public Health Service, submitted false data to a major medical journal. The true data indicated the vaccine was dangerous; however, the false data\" indicated no risk. In addition, \"four letters from the FDA/Public Health Service....clearly reveal(ed) that the anthrax vaccine\" approved for US military personnel was done \"without the manufacturer performing a single controlled clinical trial.\" They're essential to determine safety and effectiveness. Failure to conduct them proved devastating to the health and well-being of recipients and still does today. Besides, all vaccines are unsafe and some are extremely dangerous. US military forces receive many or all of the following vaccinations: -- annually for influenza so all military personnel will get Swine Flu shots;", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}