{"result_id": "261025", "URL": "https://rense.com/general96/the-story-on-the-vaccine.php", "timestamp": "2023-04-25 17:00:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://rense.com/general96/the-story-on-the-vaccine.php", "encoding": "iso-8859-1"}, "image": null, "domain": "rense.com", "title": "Dr. Russell Blaylock, Jeff Rense, Dr. Sherrie Tenpenny - The story on the Vaccine", "cleaned_text": "Under the audios is a transcript of Dr. Blaylock's interview. Also, here are the audio's of the interviews. This is one that should be read by everyone on planet earth. As Jeff Rense says, \"when you go after the children you don't deserve to be on planet earth\". There will be new diseases that aren't even named. We call the injection the Jab or the vaxx because it is not a vaccine. it's a deadly nano bioweapon. Remember aspartame is a biochemical warfare weapon so they have identical symptoms. Dr. Blaylock talks about brain tumors with reference to the vaxx, and aspartame breaks down to diketopiperazine a brain tumor agent that caused brain tumors in original studies. It's discussed in Dr. Blaylock's book \"Excitotoxins: The Taste That Kills\" and also Dr. H. J. Roberts medical text, \"Aspartame Disease: An Ignored Epidemic\" Now consider the interaction of the vaxx in people who use aspartame which also can cause you to be chemically hypersensitive for life. If you want to read about the reactions and diseases of the vaxx just read books on aspartame including \"While Science Sleeps: A Sweetener Kills\" by Dr. Woodrow Monte and even a new one, \"Double Blind: Science, Corruption & The Diseases of Civilization\" by Dr. Ralph Walton. \n\n \n\n Let's make the point stronger. Now in the news is the fact that athletes and pilots are dropping dead from the vaxx. Now go back some years and read Dr. Blaylock's Aspartame Athlete Alert: http://www.wnho.net/aspartame_ msg_scd.htm He wrote this before the so-called pandemic back in 2005. Here is his Aspartame Pilot Alert: http://www.mpwhi.com/pilot_ aspartame_alert_with_letters. htm It was just posted over ten years ago. Do you see the point, pilots and athlete's were dropping dead years ago when aspartame was approved. Why are the symptoms identical? Because they are both systemic poisons. \n\n \n\n This vaxx erodes DNA repair and the immune system collapses. Consider the virulent cancers continue to be produced at an increased rate. It produces spike protein in every cell in your body. There is no off switch and the immune system has disintegrated. Aspartame causes cancer too, even admitted by the FDA to the Senate on 8/1/1980. FDA scientist Dr. Adrian Gross said Aspartame violates the Delaney Amendment forbidding any cancer causing ingredient from being introduced into foods. He testified aspartame causes brain cancer and is therefore illegally on the market. \n\n \n\n You think there has been a trial on this vaxx ? Listen below to Dr. Blaylock telling the stories of the participants! Do some of your own research. This jab was patented 22 years ago as a nano bioweapon. Why would anyone be willing to take a jab of a product that has a blank ingredient list which is an admission the ingredients are too harmful to make public. According to Professor Dolores Cahill, a document has been recently published, which uses the CDC's own data to show that - if a woman is jabbed within the first 12 weeks of a pregancy ... then there is a NINETY PERCENT CHANCE that the UNBORN BABY WILL DIE ... following the injection. In other words, only ONE in TEN babies will survive a mother being jabbed in the first trimester. This analysis is the source of this information: https://www. australiannationalreview.com/ wp-content/uploads/2021/11/ science-public-health-policy. pdf As you can see (if you read), it relies on the CDC's own data ... but creates a more stringent scrutiny of that data, in order to come to that conclusion. If this doesn't convince you this vaxx is deadly the FDA has just admitted they won't release the records on the Jab for 75 years, when most are dead. \n\n \n\n Most who have been vaxxed and found out later the real facts want to know what to do. I would recommend at least these two books, \"Plague of Corruption\" by Dr. Judy Mikovits telling you how they got away with this genocidal crime and more. A couple of months ago she said at least 20 million are dead in the US. Her last book is \"Ending Plague\". This will help you to know what to do. In it she also tells you that spike protein cannot penetrate ozone. Suramin is the antidote. In some of Dr. Blaylock's articles he recommends Vitamin D, zinc, magnesium and IV Vitamin C. On Rense.com is Allicin C . \n\n \n\n Here are the audios and below the actual transcript so you can make copies for all your friends and acquaintances. Simply forward this email. \n\n \n\n https://mediaarchives.gsradio. net/rense/special/rense_ 120821_hr3.mp3\n\n Jeff and Erica: Dr. Russell Blaylock and Hidden Danger of Deadly Spike Protein, Micro-clotting - And The Raging New Bioweapon Cancer Pandemic \n\n \n\n https://mediaarchives.gsradio. net/rense/special/rense_ 120621_hr3.mp3 \n\n Jeff & Erica - Dr. Russell Blaylock On The \n\n BioWeapon Injection And Latest On The \n\n Graphene Oxide Flap \n\n \n\n \n\n Jeff & Erica - Dr. Russell Blaylock \n\n On The BioWeapon Injection - Pt 2 \n\n \n\n There have been some problems opening URL's with all the censoring going on so if you have any trouble try these: \n\n \n\n \n\n Jeff & Erica - Dr. Russell Blaylock On The BioWeapon Injection - Pt 2 \n\n https://mediaarchives.gsradio. net/rense/special/rense_ 120821_hr2.mp3 \n\n \n\n \n\n Jeff & Erica - Dr. Russell Blaylock And The Hidden Danger \n\n Of Deadly Spike Protein Micro-Clotting - And The Raging \n\n New BioWeapon Cancer Pandemic \n\n https://mediaarchives.gsradio. net/rense/special/rense_ 120821_hr3. mp3 \n\n \n\n Dr. Betty Martini, D.Hum, Founder \n\n Mission Possible World Health Intl \n\n www.mpwhi.com 770 242-2599 \n\n Also www.wnho.net , www.holisticmed.com/aspartame \n\n www.dorway.com that was hacked is now on www.mpwhi.com \n\n \n\n Dr. Tenpenny Interviews World Renowned Neurosurgeon, Dr. Russell Blaylock .docx \n\n \n\n \n\n Neurosurgeon, Dr. Russell Blaylock \n\n \n\n \n\n \n\n Related to the COVID-19 Tyrannical, Fascist Dictatorship Put in Place by the Pharmaceutical Industry and Hospitals \n\n \n\n \n\n Dr. Russell Blaylock is a nationally recognized board-certified neurosurgeon, He attended the Louisiana State University School of Medicine and completed his internship and neurological residency at the Medical University of South Carolina. For 26 years, he practiced neurosurgery. In addition to having a nutritional practice, he has written four chapters for several medical texts and has published more than 60 articles in the scientific literature. \n\n\n\n In this important interview, we spoke in detail about new research that exposes how the COVID shots are going to lead to massive increases in all types of cancer and the devastating effects the COVID shots are going to have on the developing brains of young children. \n\n \n\n whether it was a covid infection, a covid \"transmission\" or the covid shot. \n\n \n\n \n\n Link to the Podcast of the interview is here: \n\n \n\n Go to Dr. Sherri Tenpenny's Podcast Page and Scroll Down to the 8 th or more Podcast Here: https://www.drtenpenny.com/ thisweekwithdrt \n\n\n\n \n\n Following Transcript of the Interview of Audio Transcribed \n\n \n\n by Tom Armstrong \n\n\n\n Interview Begins: \n\n \n\n \n\n \n\n Dr. Tenpenny : Today's important guest is Dr. Russell Blaylock. Dr. Russell Blaylock is a nationally recognized board-certified neurosurgeon. He attended Louisiana State University School of Medicine and completed his internship and neurological residency at the Medical University of South Carolina. For 26 years he practiced neurosurgery in addition to having a nutritional practice. He's written chapters for several medical textbooks and has published more than 60 articles in the medical literature. Since retiring from his Neurosurgical clinical practice, he has devoted his full attention to nutritional and Neuroscience research. His most recent work the liver cure is soon-to-be-released. Welcome Dr. Blalock. Welcome back to this week with Dr. T. We did a deep dive conversation with you a couple of weeks ago which is posted for our premium members today. We want to talk a little bit more about the science and your current research. And you started by saying before we started the recording that you really wanted to talk about, some of the recent science. It's come out about how these COVID shots suppress the immune system, and we just start from there. \n\n\n\n Dr. Blaylock : Yes. That would be great, because we've discussed privately that's some of the most critical things we're seeing so far. Your immune system is your main protection against not just infection, but also against cancer, was immune surveillance. It's constantly surveilling yourselves to make sure they're not dangerously impaired and their DNA and have a high risk of converting to a carcinogenic propensity. And this is mainly in your stem cells. Stem cells are the main source of these cancers, not the daughter cells. And so, when we start discussing this important research that you've uncovered and others of talk about. What we're saying as that sounds have a protective system a couple of overlapping protective systems. And what happens if a cell is damaged significantly it has a chance to repair itself. It has a series of hundreds of DNA repair enzymes. And they go along and try to fix this damage that's occurred to the DNA to try to salvage the cell. But if the damage was too extensive it will signal what's called suicide genes like p53-p21. And what they do is they will trigger a series of reactions inside the cell to go ahead and kill if to keep it from becoming a cancer cell. Particularly your stem cell, your cancer stem cell. \n\n\n\n So this repair system is your first line of defense that if it can't repair it, then it triggers the suicide gene. What we discovered is that this vaccine by producing huge numbers of Spike protein is interfering with both processes. It's interfering with some key DNA repair enzymes like the Bracco 1, Bracco 2, and we see that in cases where you see a high incidence of breast cancer for instance in women. Prostate cancer in men if those repair jeans are defective. And we see in about half the cases, where thirty to fifty percent cases of cancer, the p53 p21 suicide genes are mutated and impaired. What this vaccine appears to be producing that very scenario. It's producing paralysis of both of those protective systems which opens up your body to spontaneous generation of a numerous types of cancer. Lung cancer, thyroid cancer, pancreatic cancer, colon cancer, prostate, breast. On and on. Because these all these come from stem cells and the damage to the stem cells caused by the vaccine. You have to remember, the vaccine has been shown to be highly inflammatory. It triggers an inflammatory response it's intense and seems to be just as intense as you see with the infection itself. That is producing the DNA damage in those stem cells. Now you can't repair it. So the vaccine, by stimulating inflammation, is the setting the stage for an uncontrollable cancer. And the other thing is, when we look at cancers, the most aggressive cancers are the ones with paralyzed p53 p21 genes. Your suicide genes, and the ones that have paralyzed DNA repair. So you're not only increasing your incidence of cancer, but you're increasing the incidence of the highly aggressive forms of these cancers, which is the worst case scenario. There's a pathologist, I think it's in Idaho. . . \n\n\n\n Dr. Tenpenny : Would be Dr. Ryan Cole probably. \n\n\n\n Dr. Blaylock : Right. And he has observed, he as a huge, huge pathology business and he is looked at the cancer slides that are coming into his lab and he says it just enormous. He's never seen such a dramatic and rapid increase in a numerous type of cancer. He says about 24 increase, which we go along with this. So when you have it collaborated with your molecule studies of what this vaccine is doing, and then you see it in the real world situation, that's what we're seeing. Other have written about the fact that they're seeing the people who already had cancer, their cancer seems to become uncontrollable, becomes highly aggressive. Originally it was hypothesized well maybe just because they're not getting good hospital care. But it appears to be far, far greater than that. So if you convert every cancer to compared suicide genes, we're going to have an enormous, enormous explosion of cancers of every kind, every tissue. \n\n\n\n Dr. Tenpenny : A nd I think that you know in addition to that of shutting off those suppressor cells, like what you just mentioned, you know the messenger RNA also suppresses toll-like receptors which are our bodies vigilant, our bodies vigilant receptors that tell the difference between self and non self, and the difference between all of the bacteria and viruses that are supposed to be in our body versus the ones that aren't supposed to be there. And they are there and are they are our initial step in blocking infection so the messenger RNA shots of Pfizer and Moderno shut those off. And I got to study that was sent to me about a week ago, it was published in, it was published about, it was published on October 8 th . So it's real new information. I'm sorry it was accepted on October it was published on October 13 th . So it's only a couple what weeks old. That goes along with what you were saying about the explosion of cancer and with this study, actually showed was that the spike proteins, and I've spoken a lot about Spike proteins. In fact, the two eBooks, the 20 mechanisms of injury, and the 20 more mechanisms of injury eBooks that go into great detail about the spike proteins and the antibodies to the spike proteins which are available at our store at drTenpenny.com . I have spoken a lot about the spike proteins and what this particular study says is that I'm going to read the sentence, that we found that the spike protein localizes in the nucleus of the cell and inhibits DNA damage repair by blocking proteins that would, that would repair the damage of DNA from being recruited to the damage site. So the spike proteins block the Bracco 1 a protein and the 53 BP one protein that are there to repair damaged DNA. And we could damage DNA all the time from being out in the sun or being exposed to radiation or micro frequencies or sometimes chemotherapy will damage our DNA. Sometimes trauma will damage our DNA and we've got these God-given enzymes and proteins in our bodies that go in and repair those damaged sites, now we find out that the spike protein that is induced by the shots and to a lesser degree perhaps the spike protein from the SARS-Cov-2 to infection, they block these proteins from repairing the DNA and the Bracco 1 gene is there to repair damaged DNA in the breast tissue and the 53 bp1 protein is there to repair damage to DNA in the colon and in blood. So with these shots work to see a massive increase in my opinion of breast colon and blood cancers. And what's interesting Dr. Blalock, is when I posted this study and a commentary that I wrote about it that it seems as though that this is going to lead to an explosion of cancers. I posted this on my telegram page. the Dr. Tenpenny telegram page with my little comment about what I just said and within literally within 45 minutes I had 168 comments of people saying, yeah my sister who had a normal mammogram 3 months ago, got her second covid shot and now she's got a breast lump and she just was diagnosed with metastatic breast cancer. We know like what you said Dr. Ryan Cole is reported an explosion of endometrial cancer, we've had urologist say that men that have had just slowly very controlled very can't a benign prostate cancer that suddenly after they got one of the covid shots its exploded into metastatic prostate cancer. \n\n\n\n And so now we're finding out that these shots not only are killing people directly by anaphylaxis or blood clots pulmonary embolism cardiac events, they're also going to kill people long-term by a long list of autoimmune diseases in in multiple different areas of the body and now an explosion of cancer. There is no benefit to anyone. It's all all risks and there's full court press and now they're wanting to start giving this to our five-year-old children Dr. Blaylok, I know that you're a Christian man and I'm a Christian woman and we see this devastating thing that's happening. What would we, what do we need to tell parents to just say no to stop this from happening to their children? \n\n\n\n Dr. Blaylock : Well you know the interesting thing is, is this obsession, and if you listen to fallacy saying, \"We got to get to those five year old kids, those 10 and 9 year old kids.\" Virtually everything, even the ones who say \"well, we agree with the vaccination\" for the at risk, it's universal. Anyone not connected to making lots of money off this back thing is the worst idea you could ever have. That these children are not at risk. They do not transmit the virus and so there is absolutely no reason, no reason to say there should be vaccinated. Even if you believe the other hype. There's not a single expert in virology, epidemiology, infectious disease, are ah, pediatrics that would dare say, \"that's a good idea.\" No, it's going to kill these kids the ones that don't die or going to have their lives ruined forever. We're going to see further explosion of cancer among these kids. And brain cancer. primary malignancies of the brain of the number one cancer in children. And what people don't understand, the polio vaccine is probably played a huge role in that. Because it is transmitted vertically that means it goes from parents to children, to grandchildren. It passes down the line that fires its carcinogenic contaminated the SV40 virus that was in the polio vaccine, is being transmitted vertically to each generation. And there's generations that are at risk. Now here you have a buyer that would take what's already and these two these hundreds of millions of people that SB45 and are going to turn their cells into highly vulnerable cells that can no longer resist of the carcinogenicity of those SV40 viruses, because you've knocked out your p53 p21 for calculus suicide genes and you've knocked out your DNA repair genes. So just from the other observation, we have hundreds of oncogenic viruses circulating. Large percentage of population in America, about thirty percent have cytomegaly virus. A single protein produced by cytomegaly virus can produced cancer. So most people have carcinogenic viruses already in their body. But they're kept at bay by your immune system. This vaccine has been shown to erode your immune ability against these viruses and now we see that you can't protect yourself against carcinogenicity of these viruses, so you are producing the worst scenario in your starting a little child 5 6 7 8 years old, his that his life is doomed. You can't take the viruses out of it. You can't unvaccinated people. And parents need to understand that. Resist it with everything you can resist. I would never vaccinate one of these children with these dangerous vaccines. \n\n\n\n Dr. Tenpenny : You know it's interesting that you should say that about like the oncogenic viruses because I remember back in the 60s and 70s there was a lot of discussion about viruses being the cause of cancer. There was a lot of research into that and then it just sort of went by the wayside. And now we're getting reported anecdotal cases of people who are taking Ivermectin either prophylactically or they're taking it out because they've been sick and that their tumors are going away. One of them was that I read just the other day in brief was actually about a glioblastoma. And I said, \"well it doesn't surprise me because Ivermectin has been shown by 23 different mechanisms of action that it can inhibit replication of any RNA type of virus.\" You know and for the listener there are lots of different types of viruses. One is at DNA virus and RNA viruses. There are other subsets of that. But those are the primary ones. And if I ever Ivermectin can inhibit RNA viruses and that RNA viruses tend to be ankle genic, it would appear that Ivermectin can also treat or be an adjuvant of treatment for cancers or maybe even prevention of precancers, which at once more one more time Dr. Blaylock says to me why the powers-that-be the FDA the government all of the stupid ignorant Physicians who say bad things about Ivermectin because they don't bother to read one single paper, why they want to pull it off the market because it's just way too beneficial. Have you been reading some, some of these anecdotal reports and papers similarly? \n\n \n\n \n\n \n\n Dr. Blaylock : Oh yeah, yeah. And I've written several detailed scientific papers on oncogenic viruses. We know for instance, with glioblastoma, if you give those patients and antiviral that actually works against the virus you get a very prolonged survival. Glioblastoma, most die within a year to 18 months. And that death rate has not changed in the last 30 years of treatment, no matter what they use. But when they used to antiviral finally a number of these people were living ten years. When they gave some of them vitamin D, which is also antiviral, they begin to live longer. There's a natural substance called baicalein which has an ability to kill a great number of viruses and does kill the SARS-Cov-2 virus. It is also has anti-cancer ability. So, yes. Anything that would suppress the growth of these viruses and the of the virus to invade the DNA is going to reduce cancer, even though I already established cancer. So Ivermectin in being a substance that is safe and it has this antivirals ability working, yeah, I'm not surprised at all these cases are beginning to show up where you starting to see tumors shrinking, and cancer improving. Far better than any traditional chemotherapy which is essentially useless once the tumor has metastasized. Yeah. I have written a book on cancer. Written a number of articles for scientific journals on how viruses produce cancer. And how these antiviral natural substances can reverse that and improve the survivability of these terrible cancers. Some of the worst in the world. And the childhood brain tumors of the worst tumors of all. I mean megaloblast Oma is number one on the list. It's a horrible killer. And ah, fact that you're going to vaccinate these children with this virus is carcinogenic, that's immune suppressants, that interferes with DNA repair, and suicide gene. When these kids develop these malignancies, they're just going to be the most virulent vicious malignancies you've ever seen. These kids are all going to die very early. But they are going to blame it on everything but the vaccine. And you say, and what this study has shown with the immune suppressing ability, the back pain is doing the exact same thing as the infection. That's what's important to take home from this intense study that was done in China. I mean they did, they used the most sophisticated analysis of immune cells. They found that it's suppressed all of the immune cells that are antiviral. And it increases inflammation by triggering this nf-kappa B and it damaged the kidney, the blood sugar came out of control. The coagula ability increased. Everything you see with the infection happened with the vaccine. Why? Because the toxic elements is the spike protein. \n\n\n\n You're putting a substance into the child's body, into everyone's body that continuously produces spike protein, and floods the tissue directly with it. You know, the virus has to get from the site of entry to your organ. And it could be killed all the way during that track. This this vaccine makes sure that the messenger RNA producing the spike protein is protected till it gets to your organ, so your organs are infiltrated with this Nano-Lipid carrier containing this deadly spike protein generator. Then it's generating directly in your in your brain, in your heart, and your lungs, in your pancreas, and colon. And that's what makes this inflamingly dangerous. You're putting the, the most destructive part of the virus and all your tissues in high concentrations and it continues to produce it. It's not just like it's a one-time entry. It sets there and continuously produces this at an increase rate, the spike protein. And we don't know how long it does. You see. And the interesting thing is that Pfizer knew this. And the way we know they knew it, it's because they hid it. They did the only bio distribution study in the world before the vaccine was released. They knew that it did not stay at the site of injection which Malone and the others thought. That's why Malone was for it. He thought, well, it stays at the site of injection and most of it will go to the regional lymph node to introduce immunity. He had no idea where it was distributed. Well this, when they finally forced the release of this study by Freedom of Information law suit, what the study showed was shocking beyond belief, is that within 48 Hours it was distributed all over the body including the brain, spinal cord, all the organs. Everywhere, saturated with his Nano carrier massively producing the spike protein. Everywhere directly in the tissues. Well, the immune system by being suppressed by the spike protein cannot react to it appropriately, it reacts to it inappropriately, and we know that's how you develop autoimmune disease. What we're saying and what you described, we're going to see every kind of syndrome thing we have never seen before are going to crop up. We're going to see neurological diseases no one has ever heard of. Never seen. Never been described because of the way this is distributed. Because of the way it is continuously pouring us spike protein into the tissues. We're going to see new disease. Brand new disease. And they are going to blame it on \"variants\" and everything else but the vaccine. \n\n\n\n Dr. Tenpenny : You know it's so interesting (25:14) that they would plead ignorance that this injectable product would go into your, would go subcutaneous against your arm and stay there since we've known since the 1940s that they needed to add an adjutant such as aluminum to as a depot to make the viral, the viral particles in say, like any of the other like, like pneumococcal, like a Prevnar vaccine, or a hepatitis vaccine, that they had to have the aluminum to make it stay in the arm long enough to get it exposed to the B cells to start to make the antibodies, cuz if they didn't put aluminum with it what happened? Well, it's suddenly just dispersed through the entire body. So the fact that they would claim ignorance to say that \"while we're pretty sure if we just put this little messenger RNA wrapped in nanoparticle nanotechnology lipids and polyethylene glycol right there in your muscle, we're sure it would stay there.\" I mean like seriously; these people are smart people. They have access to the top scientists in the entire world that is the most stupid ignorant thing. And now we've been training people, you and I, and a whole bunch of other people that have been educating people over the last 20 years about adjectives, and about all the different things of what they do. I mean these people, we've got a general public that have paid attention that are pretty smart too and saying well like now, \"yeah, no kidding.\" Why would they ever think that that was just going to stay there? So Robert Malone is saying, \"Oh well. I thought it was safe cuz it would just stay in the arm.\" Like seriously. Have you not read any other vaccine literature ever? And you claim to be, that this has been your whole life. And that you're all about you're a pro-vaccine person and all about vaccinology that's what you study for 50 years of your life, and you didn't know that? How can that possibly be true? \n\n\n\n Dr. Blaylock : Well, the thing about Malone. He wasn't a vaxonologist. He was someone who was working with cancer. \n\n\n\n Dr. Tenpenny : Yes, But he's. . . .his own thing says it. \"I have been studying these things for a long time.\" So it goes back to what you said. I'm just confirming what you said that Doctor Malone said \"if we injected it should stay in the arm so it should be okay.\" Really! Really! \n\n\n\n Dr. Blaylock : Right. Well, what he was doing was to put it in a nano lipid carrier and has a messenger RNA go all over the body to treat cancer. Well, like you say, \"why did you say \"if it will carry the messenger RNA to treat cancer when it also can carry the message RNA to produce spike protein? \n\n\n\n Dr. Tenpenny : Another variance. \n\n\n\n Dr. Blaylock : The shocking thing is that Pfizer knew this. They had done the study. And the FDA knew it. And the CDC knew it. All these people knew this. \n\n \n\n \n\n \n\n Dr. Tenpenny : Yap! \n\n\n\n Dr. Blaylock : And the FDA should have said \"we will not allow you to release this vaccine until we know exactly where that lipid nano carrier goes and how long it produces spike protein. We don't want to hear said \"I think.\" Because they all say \"well, we think it won't last long. Well, we think it will disappear. Well we think\". . I am not interested in \"we think.\" If you're going to vaccinate hundreds of millions of people, you better know exactly what it does. Where it goes. How long it last. How much spike protein it produces? What is the spike protein? Is it toxic itself? You need to know everything about before its released. And that's why the real vaccine experts said, with a new technology like this, the minimum time spent studying should be 10 years. \n\n \n\n \n\n \n\n Dr. Tenpenny : Exactly! \n\n\n\n Dr. Blaylock : A minimum. The FDA recommended two years and the vaccine companies said, \"to hell with you. We're releasing it after two months. And we would have released it immediately accept, we had to put on this charade that we, we studied it for 2 months. They didn't study anything. Most of these people that I've heard from that were in the study group said, \"they didn't follow us. They wouldn't answer our questions. And when we develop complications they wouldn't pay for it even though the contract said they would. What kind of intense study did they do on this study participants before it was approved for released when the participant said that they wouldn't study any of us. They wouldn't call us. They wouldn't answer our calls when we were complaining with complications, side-affects. They wouldn't talk to us! So obviously, there was no intense study. So it wasn't just they didn't do an intense study, you didn't hardly do anything. You just released it. \n\n\n\n Dr. Tenpenny : You know, I want to change gears. I want to change gears just a little bit because I want your experience as a neurosurgeon. Dr. Blaylock on this, on this question. Because I want to ask you just a little bit about cerebral venous sinus thrombosis which is a blood clot that forms in the brain. We knew that this is massively forming from AstraZeneca. We knew that it was . . . we've also seen case reports of this in all three of the approved shots here in the US. In the J&J shot in the Moderna shot and also with Pfizer shot. And I think it's pretty interesting that just a few weeks before they approved the shots for five-year-old children, they also approved a blood thinner for children that have never been approved before that suddenly we have this new blood thinner that's approved all the way down to 5-year-old's, because I believe they are anticipating the same level of blood clotting and myocarditis in children that we have seen in adults. So my question about cerebral venous sinus thrombosis is when, is just for the listener, that this is a blood clot that forms in in the very complex veins inside of the brain. And there been thousands of deaths from this. And when this was first happening, and we were talking about it I contacted a lot of friends of mine. You know as a as a former emergency medicine physician, and I was the director of a level 2 Trauma Center for 12 years and I saw a lot of patients. I talked to all of, all of us in the D's. Dr. Palevsky, Dr. Carrie Madej, Dr. Christiane Northrup, and particularly with Dr. Lee Merritt who's an orthopedic surgeon who worked in the military, and also work closely with neurosurgeons. And collectively amongst the five of us, we have probably 100 years of experience. We've never seen one case of this. So you, is a neurosurgeon, if they're, if these cases evolve that, and actually you were called in to do the surgery. In your 26 years career as a neurosurgeon how prevalent was this type of condition, cerebral venous sinus thrombosis? And how often did you see it compared to what we're seeing now? \n\n\n\n Dr. Blaylock : Well, I saw it. I've seen two cases I can think of off the top of my head. . . \n\n\n\n Dr. Tenpenny : Two. Two. Two in twenty-six years. Two. Oh, my goodness. \n\n\n\n Dr. Blaylock : Well, it's very rare. One was a transverse sinus thrombosis and other was in a young girl who had a sedulous sinus thrombosis which is absolutely devastating. But hers was because she also was on birth control pills which is hypercoagulation blood. You know, it's associated with complications with birth control pills. And he had an infection in his ear which goes to that sinus thrombosis. So you, you don't see it but when you do it's devastating I mean a sedulous sinus thrombosis, it's in parts of both sides of the brain. It's like having a double stroke. And so they have Paralysis on both sides of their body. They have all sorts of problems if they don't recover from. So it's devastating but beyond that what to me was really shocking, with the incidence with micro thrombi. That's not getting enough attention. And the brain and number of these people who died of COVID, is they found the brain was filled with micro thrombi. And so what happens small vessels in the brain are thrombosing. And it's like having multiple hundreds of thousands of strokes. Tiny strokes throughout the brain and collectively produced dementia or produce paralysis and all four limbs incontinence. All kinds of problems. It's devastated. And most physicians don't recognize it because it's not a large thrombosis. If you get a MRI scan on one of these patients early on when they first developing problems, you might not see anything cuz they're microthrombi. But one of the physicians in Canada started doing D-dimer on his patients and he found that, something like 68% had microthrombi. So a large percentage of the people being vaccinated are developing microthrombi. And since it's not an acute devastating event like what you're describing, its being overlooked. People just say what I have trouble memories. I have trouble speaking. I lose my balance. I have a tremor in my hands. Burning in my hands, whatever. And they can't explain. And the doctor looks at him understand. He doesn't see much because it's microthrombi. And if you have microthrombi on your brain stem or your basal ganglia it can produce some devastating neurological effects. Because there's a crowding of those neurological pathways in those parts of the brain. And what we see the part of the brain most affected by the spike protein is in the basal ganglia and the brain stem. When I look at these people on the videos on YouTube and stuff that is having neurological having neurological symptoms, something what I see mostly is brain stem and basal ganglia. And of course, the, the other part of the brain is affected lot of the hippocampus which is where you have memory. Where you have emotions. So these, these effects are going to accumulate. They're being overlooked now because they're not obvious strokes. They, and they call them functional. Well, you know people under stress and they just worried that . . . no they're not. They're having actual neurological effects of microthrombi. And it's being ignored. Now if you do this in children, and you have little five-year-old who have numerous microthrombi and they're developing brain at age 5, the brain is still undergoing a tremendous amount of the development. It's going to be devastating for that kid. They'll have learning difficulties, seizures, ticks, loss of gate, weakness, visual problems. All sorts of things can occur. And for a long time, it's going to be called functional, psychological, and they are not going to treat it seriously. Jus like they did with chronic fatigue. Just like they did with autism. ADHD. All of it was initially called, oh! These are just called refrigerator models. Nothing is wrong with the kids. It's just momma's not paying enough attention to it. And we go through this, and go through this, and go through this until they finally prove, No, it's really a neurological symptom and there's no logical syndrome because you're vaccinating too many kids, were too many vaccines during the most intense period of brain formation. That we know that. We know in experimental animals if you vaccinate or stimulate immune system during that brain formation you're going to have an abnormal brain formed. It's, it's well known. When you stimulate the immune system systemically, somewhere in the body other than the head, we know it activates within minutes the microglia immune cell in the brain which starts pouring out inflammatory cytokines an excitotoxin immediately, it starts damaging the brain. That's what happens when you developed the flu. That's why you feel bad. That's why it's hard to think. And you don't want to socialize with people until you get well. Because if you get well quickly all this repaired quickly. But with this constantly producing toxic spike protein in your brain and peripherally, you're not going to recover because your recovery system is also paralyzed by this vaccine. And so you're going to have problems from then on unless you do something to protect yourself. And that's what I'm doing now is trying to figure out what's the best way to protect yourself against the spike protein. With the nano curcumin, one of the things that they discovered in clinical studies and in their molecular studies was that it blocks the ability of the spike protein to interact with the H2 receptor and prevents replication of the virus inside of the neuron or of the microglial immune cell in the brain. And so it's something that it is highly valuable that is not being added to these protocols. And I wrote an article. And it's a detailed article on immuno excitotoxicity with a cytokine storm. What happens in the brain is a cytokine storm. Everybody's forgetting the excitotoxicity arm of this. That's the final most destructive arm is excitotoxicity. No one is talking about it. No one's doing anything to block it. And a number these people are admitted to the hospital because they are given intravenous and feeding tubes, diets that are very high in glutamate and other excitotoxins. Their brain is pouring out excitotoxins. Excitotoxins damage every organ in the body. If you have myocarditis, your heart is filled with levels of excitotoxins which is damaging not only the neural systems in the heart, but the heart cells themselves. It triggers inflammation. I tried to contact some of these guys like Dr. McCullough to tell him. You put on your protocol Quercetin 250 mg once a day. You might as well just pour it out on the floor. You don't hardly absorb and Quercetin and one dose at 250 mg is hardly nothing. You need the nano Quercetin at 250 or 500 mg three times a day. And the nano curcumin. The studies that were done with nano curcumin, that even in the serious ill patients, they get significantly better. Because it is blocking these entries of the virus and the toxicity of the spike protein. These things that you put on the protocol. I also have written article which I went through virtually everything known about nutrition and blocking the immuno excitotoxicity which I would be glad to give them if they would read it. But I don't think they will look at it. They will just look at it. \n\n\n\n Dr. Tenpenny : Well, send it to me Dr. Blaylock. I would love to read that. Please send it to me. \n\n\n\n Dr. Blaylock : I will. Who is he? I've never heard of him. (Both laugh) You see. They are doing to me what they claim the others did to them. (Laughs) Actually I went through all of that when I did all the work on Autism. When I started out on Autism talking about this as an excitotoxicity disorder, an immuno excitotoxicity disorder. Nobody would talk to me. Now it's proven. Now all the literature has come out about excitotoxicity in Autism. In showing how the glutamate levels in cerebral spinal fluid in the brain. Microglial activation which I hammered for over a decade trying to get them to look at Microglial activation. They would not look at it. Now others are looking at what we just exactly found. It's the microglial activation. Well, that's what this virus does in the brain. This virus and this vaccine produce microglial activation throughout the brain. The early stages of showing it. And that's what's triggering excitotoxicity. That's what I know about blocking. That's what I do my research and I published a number of articles on it. A number of studies in research journals. You know, just people I know that followed my advice got a lot better. You know, my sister had it. And I put her on all this stuff and within three days she was well. \n\n\n\n Dr. Tenpenny : Wow. Well, it's . . . I really hope that you will send me that study. And really I think that that's really, really important in protecting the brain. And there's two questions. One comment I want to make and then I want to have one follow up question before we close out for today. You know back when you said that on looking at this Central Venous Thrombosis, you said in your 26 years as a neurosurgeon that you've seen two cases. But let's say that you forgot a couple and let's say there were four. Let's say in 26 years, I just did a quick search on VAERS and since as of October 22nd there been 668 cases of cerebral venous sinus thrombosis or Cerebral Venous Thrombosis. So 668 cases in eight months of use of these shots. And in a 26-year career as a neurosurgeon, let's be generous and say that maybe there where ten. And now we've got six hundred and sixty-eight cases induced by these shots causing blood clots in the brain. And these are big, massive blood clots in addition to the ongoing micro thrombi that you've been talking about that we can identify by doing a D-dimer test. So, so I think that that's really important. So I just wanted to Circle back and close the close the wagons on that question I asked earlier. So one additional question that comes up and in, I hoping that perhaps you know the answer to this because we know that people are having symptoms from what we are calling transmission. I'm shedding is, is spewing live viruses on other people, are whole attenuated viruses on the other people for which they can track that particular infection. This transmission that I think is spike proteins that are being spread either by physical contact or we know that the spike protein in the virus concentrates in the mouth of fully vaccinated people 251 times greater than unvaccinated people. And if you've got a tran . . . and people that have had a transmission of that. Let's say that they been around fully vaccinated people and they come down with symptoms they get irregular periods, they get headaches, they get some blood clotting issues, they get coughing, they get sick. Do you think these types of these types of Technologies you were talking about with the with a nano the nanocurcumin and the Nano quercetin at much higher doses, do you think that that will help to neutralize the spike protein that have, that you've been contaminated with by being around these super spreaders? \n\n\n\n Dr. Blaylock : Oh yeah! I take them every day. Since I started nano curcumin, for the last few years I have never got a cold, the flu. I used to get the flu every year. It's a mild case. I don't get anything. My wife doesn't get anything either. We take it all the time. I have talked to a lot of people. They have quit having them. If you look at the literature, all these things are anti-viral. They affect numerous viruses. Ah, you know the most powerful anti-cytomegalic virus substances, when you even count anti-viral medication is Biloculine. It's fine. It kills Dengue virus. I mean some of the worse viruses. It kills. So . . . and yes! Another thing is keeping your immune system boosted. You know like myoinositol produces a general immune stimulation, so your immune system stays healthy. And if you add IP6, it will wipe out most anything. It really works well. So what you want to do, if you think you have been exposed, you're having early symptoms, you want to stimulate you immune system to kill off the viruses as quickly as possible. And then you get what? You get sick. And you're getting sick because your body is fighting the virus. If it has to fight for eight days, you get real sick. If it has to fight for three days, you're not that sick. If you fight it for twenty-four hours, you hardly know you got infected. And of course, the level of your immune system kills it. All these things are entering through the mucosa. If your IGA level is really healthy, and your tissue mycophagy is healthy, the virus will never get in you. And that's what a lot of these a-symptomatic cases, the virus can never get inside. And so they have immunity. The mycophagy establishes their memory by carrying it to the regional lymph node. And so, if you stay healthy and eat right, and don't eat things that are known to suppress the immunity, like sugar. Omega-6 oil. Omega-6 oil is a powerful immune system suppressor. One thing that has been totally overlooked is we have tens of millions of Americans taking statin drugs. Statins are powerfully immune suppressors. In fact, they put in on treatment for Cytokine storm because it such a powerful immune suppressant. You have, you probably have forty or fifty million Americans or more taking statins every day. It's suppressing their immunity. So when they get exposed, they are going to have a devastating effect because they don't have proper immunity. So don't take statins. Don't take immune suppressants. Many antibiotics are immune suppressants. Minocycline , tetracycline group or drug. They're immune suppressants. \n\n\n\n Dr. Tenpenny : Wow. \n\n\n\n Dr. Blaylock : A lot of doctors don't know that. \n\n\n\n Dr. Tenpenny : Most doctors don't know that. \n\n\n\n Dr. Blaylock : When we treat autoimmune disease they put them on Minocycline. Blocks the excess of energy. And so the other thing I would emphasize we need next. We need to use the protocols magnesium orally and when in the hospitals, infusions. Magnesium protects the endothelia cell against clotting factor. And it's anti-inflammatory. It improves blood flow through the micro vessels. Prevents these microthrombi. I have never in my life been able to convince any physician to give magnesium. And in my practice I gave magnesium to every surgical patient I had. I never had a thromboembolism. I had several of my colleagues lose patients in simple surgeries from thromboembolism. I could not convince them to just put the magnesium in the IV and they won't happen. I never had a case. \n\n\n\n Dr. Tenpenny : Wow. \n\n\n\n Dr. Blaylock : Because it works. And they've shown it in COVID. The places that have added magnesium, they say \"yes it does.\" It improves blood flow and prevents thrombosis. You cannot get them to put it on protocols. And every patient that is in the hospital is on it. \n\n\n\n Dr. Tenpenny : Just one more sad statement about our Healthcare System for sure. You know, I mean it's just really a, a really despicable thing of what has happened to it is supposed to be the noble profession that it seems as though the first thing that we have done is our oath to \"first to do no harm.\" We've thrown that underneath the bus. Well, in closing today Dr. Blalock, cuz unfortunately we're up against the end of our time here. I mean we could talk for another several hours, I'm sure about your vast wealth of knowledge of things that you shared, and we've had some really great results; are really great suggestions that I'll put down into the show notes for people can actually start to take better care of their brain and their circulation and things like that. As we are exposed to these transmission events and as we are trying to keep our children away from these vaccinators, in the last couple of minutes, last two or three minutes, what would you like to leave our audience with you here today? \n\n\n\n Dr. Blaylock : Well, one thing you need to understand the medical profession has changed. What's happened during this corona non-sense, is we have medicine changed drastically. Suddenly, for the first time in the history of medicine, we have bureaucrats who are telling physicians how they will practice medicine. You will not use Ivermectin, you will not use hydroxychloroquine and you will use this drug the Remdesivir, put them on respirators, or you will lose your license. Or we will throw you out of the hospital. That's unprecedented. The relationship between his doctor and patient, I make the decision on how I treat my patients. Not the hospital administrator. Not some bureaucrat from the FDA or the CDC. CDC set the protocol for every hospital in the United States. And they told physicians that \"if you don't follow it, we will throw you out of the hospital.\" And if you talk about it, we will take your license away. I mean this is unprecedent. People should be terrified that their doctor no longer has control of their care. So you can tell your doctor I want Ivermectin, some will say, \"I can't get it.\" I want magnesium in IV. \"I can't do it.\" \"I won't do it.\" And some will just say, \"I will not do it.\" And they follow protocol. So we have a new form of medical practice that we follow protocol set up by bureaucrats. Nobody at the CDC has ever treated a single case of COVID. But they set the protocol. And that should terrify them. And I hear more people say now, \"don't go to the hospital. They're death houses.\" And it's becoming true. Hospital is a death house. You can't visit you dying relative. You can't enter the hospital without permission. And you have no control over how you loved one is treated. And I tell people, \"get your\" . . . When I had a friend of mine, his mother was in the hospital with heart failure. And she just kept getting worse and he said, \"what do you think I should do?\" And I said to get her the hell out of there before they kill her. They sent her home, and she was put on some stuff, and she recovered completely. They would have killed her. I am terrified. I wouldn't go to the damn hospital. I just had my nephew die in the hospital from thromboembolism because they wouldn't give him magnesium. He died of a massive pulmonary embolism. \n\n\n\n Dr. Tenpenny : Wow. And we hear so many cases of this Dr. Blalock. We hear it over and over every single day. And I'm sure that you're aware about a month ago now when they post, when this television station out of Detroit posted a thing on their Facebook page and says, \"hey, if you know anybody who was unvaccinated that died of covid please let us know. We want to run a story on it.\" And they had more than 180,000 comments saying, \"we don't know anybody who was unvaccinated that died of COVID, but we can tell you about a whole lot of friends that died from the shot from the shot.\" And sadly, I want to say one last thing as we close out here today, that I think that this is an important term that people need to get familiar with. And it's a term called, that the term, we talked about this being genocide. Genocide is really by the strictest definition, removing a particular group of people like removing if, if you wanted to kill off all the black people or kill off all the gay people. That would be genocide. Democide is more important as we see what is really happening now. And I want to read this very quickly as we close here today. Democide is the murder of any person or people by their government including mass murder. Democide is not necessarily the elimination of an entire cultural group but rather groups in the country that the government feels the need to be eradicated. Democide is a concept proposed by U.S. political scientist, Rudolph Rummel to describe the intentional killing of an unarmed or disarmed the person by government agents acting in their authoritative capacity [which I would say the CDC falls in line with that] pursuant to government policy or high command according to Rummel this definition covers a wide range of death, including forced labor or concentration camps, killings of unofficial private groups that would be children, extrajudicial summary killings, and mass deaths due to governmental acts of criminal omission or neglect such as, in deliberate famines [which we are now seeing food water shortages. I was told yesterday in an interview that people in Canada who go to soup kitchens are being denied food if they're not fully vaccinated.] and these killings are by the facto government Civil War killings. This definition covers any murder of any number of persons by a government. It's called democide. D-e-m-o-c-i-d-e. And I read that directly off of Wikipedia which I'll put into our show notes here because people sleep need to start recognizing things for what is happening. And quite frankly, in my opinion every physician who knows nothing about this, and every physician and nurse and pharmacists who advocates for people to get these shots, of particularly children, they should all be complicit in murder. And I think that that's something that sounds harsh, but I think it's a harsh reality that we need to get her head around or we're not going to have any human beings left to tell the story going forward. So Dr. Blaylock, I want to thank you so much for spending your extra time here with us today and all of your brilliant knowledge. I'm going to write a lot of this into the show notes as we post this for this for this week with Doctor T. So as we close today I'm so grateful to learn all these additional things and additional tools that we can put into people's toolbox to help them during this horrible time of, of tyrannical assault on our immune systems. So I want to say a special thanks to all of you who've joined us here this week on our this week with Doctor T recorded broadcast and to support Dr. Blaylock and what he's doing his newsletters, in his new book that's going to be coming out \"The Liver Cure\" soon-to-be-released. And I want to thank everybody for coming here again today. All of my recorded, and all of my life recordings I always end with one of my favorite verses from the Bible which is Romans 12:12: \"Rejoice and hope. Be patient in trouble and be persistent in prayer.\" And Heaven knows and the good Lord knows, we need all of those hope, persistence, and patience. Until the next time remember, to lean on to God. Trust him for everything. He'll give. He. . .he will never let you down. Thank you again Dr. Blaylock spending all this time with us here today and to everyone else until we see you again next week. Have a good rest of your week. \n\n \n\n \n\n I have followed Dr. Russell Blaylock, world renowned neurosurgeon, for many years. I have heard many of his interviews on important health issues that affects us all, but more than often ignored by the medical field by physicians, who once in practice, don't keep themselves very informed on ever changing field on better methods of treatment. Others that no longer think for themselves, but let the pharmaceutical industry do their thinking for them. Then since the planned so-called COVID Pandemic, doctors allowing hospital administrations and/or health insurance companies, including Medicare and Medic-Aid, take decisions of patient treatment away from the doctors and making decisions themselves. These dictatorial institutions are now legally to practice medicine without a license, let alone not even having a medical degree. Now, among the hospital administrations, hospital profits and their stockholders profit take precedence over patient care as priority. So especially, during this declared pandemic situation, hospitals are becoming execution facilities, being instructed to put patients of the Unvaxxed and the Vaxxed on hospital protocols dictated by the NIH and the CDC that has a death rate of 90%. In the past decades, more people unnecessarily die in the hands of the hospital institutions by ways of unsanitary conditions, accidents, or malpractice than most all other death event unrelated to hospitals. But that has all changed now, as the bureaucrats now control every aspect of the health industry. It has come to the point that any doctor who voices their opinions or puts out any evidence that challenges the narrative of those in control are in danger of losing their job or their license, or both. When Dr. Fauci said \"there will never be a new normal\" or \"we will never go back to normal,\" he is proving to be correct in his prediction that has been in the planning stages for decades. Now we are seeing a growing situation of healthcare rationing. And with the release globally of a \"gain of function\" weaponized virus, and the global release of a weaponized fake so- called vaccine consisting of the deadly spike protein of the XMRV, SARS, and HIV proteins that is a huge game changer for the life expectancy of those who took the jab. Both adults, children, and children in their mother's womb. More and more people are waking up every day to the situations they are facing regarding their health now and in the days ahead. Taking control of your health with good eating habits. Take good supplements that support and strengthen yours, your wife, and children(s) immune system, and avoid foods that weaken or destroy the immune system with likes of sugar, artificial sweeteners (such as aspartame), monosodium glutamate (MSG) and all statin drugs, to name a few. It has now come to the choice if you want to be suicided or not. Your free choice. Please listen and read this interview transcript of the audio attached. And most important, share with family, adult children, adult grandchildren, friends, and especially physicians and other health care workers to hopefully bring them back to the \"world of reality\" that we are now living under a global dictatorship gone rogue.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.wnho.net/aspartame_msg_scd.htm", "http://www.mpwhi.com/pilot_aspartame_alert_with_letters.htm", "https://www.australiannationalreview.com/wp-content/uploads/2021/11/science-public-health-policy.pdf", "http://rense.com/", "https://mediaarchives.gsradio.net/rense/special/rense_120821_hr3.mp3", "https://mediaarchives.gsradio.net/rense/special/rense_120621_hr3.mp3", "https://mediaarchives.gsradio.net/rense/special/rense_120621_hr3.mp3", "https://mediaarchives.gsradio.net/rense/special/rense_120821_hr2.mp3", "https://mediaarchives.gsradio.net/rense/special/rense_120821_hr2.mp3", "https://mediaarchives.gsradio.net/rense/special/rense_120821_hr3.mp3", "https://mediaarchives.gsradio.net/rense/special/rense_120821_hr3.mp3", "http://www.wnho.net/", "http://www.holisticmed.com/aspartame", "http://www.dorway.com/", "http://www.mpwhi.com/", "https://www.drtenpenny.com/thisweekwithdrt", "http://drtenpenny.com/"], "authors": [], "publish_date": null}