{"result_id": "262031", "URL": "https://returntonow.net/2016/02/24/the-caveman-cure-for-depression/", "timestamp": "2023-04-25 17:00:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2016/02/24/the-caveman-cure-for-depression/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Depression is A Disease of Civilization: Hunter-Gatherers Hold the Key to the Cure", "cleaned_text": "Depression is not a natural disease. It’s a disease caused by our high-stress, industrialized lifestyle, psychologist argues.\n\nDepression is a global epidemic. It is the main driver behind suicide, which now claims more than a million lives per year worldwide. One in four Americans will suffer from clinical depression within their lifetimes, and the rate is increasing with every generation.\n\nIt robs people of sleep, energy, focus, memory, sex drive and their basic ability to experience the pleasures of life, says psychology professor and author of The Depression Cure Stephen Ildari. It can destroy people’s desire to love, work, play and even their will to live. If left unchecked it can cause permanent brain damage.\n\nDepression lights up the pain circuitry of the brain to such an extent that many of Ildari’s psychiatric patients have called it torment, agony and torture. “Many begin to look to death as a welcome means of escape,” he said in a Ted Talks presentation.\n\nBut depression is not a natural disease. It is not an inevitable part of being human. Ildari argues, like many diseases, depression is a disease of civilization. It’s a disease caused by a high-stress, industrialized, modern lifestyle that is incompatible with our genetic evolution.\n\nDepression is the result of a prolonged stress-response, Ildari said. The brain’s “runaway stress response” – as he calls it – is similar to the fight or flight response, which evolved to help our ancestors when they faced predators or other physical dangers. The runaway stress response required intense physical activity for a few seconds, a few minutes, or – in extreme cases – a few hours.\n\n“The problem is for many people throughout the Western world, the stress response goes on for weeks, months and even years at a time, and when it does that, it’s incredibly toxic,” Ildari said.\n\nLiving under continually stressful conditions – as many modern humans do – is disruptive to neuro-chemicals like dopamine and seratonin, which can lead to sleep disturbance, brain damage, immune dysregulation and inflammation, Ildari says.\n\nEpidemiologists have now identified a long list of other stress-related diseases as “diseases of civilization” – diabetes, atherosclerosis, asthma, allergies, obesity and cancer. These diseases are rampant throughout the developed world, but virtually non-existent among modern-day aboriginal peoples.\n\nIn a study of 2000 Kaluli aborigines from Papua New Guinea, only one marginal case of clinical depression was found. Why? Because the Kaluli lifestyle is very similar to our hunter-gatherer ancestors’ lifestyle that lasted for nearly 2 million years before agriculture, Ildari said.\n\n“99.9 percent of the human experience was lived in a hunter-gatherer context,” he added. “Most of the selection pressures that have sculpted and shaped our genomes are really well adapted for that environment and that lifestyle.”\n\nIn view of nearly 3 million years of hominid existence, since homo habilis first began use of stone tools, our genus has undergone rapid environmental change since the advent of agriculture about 12,000 years ago. And in the last 200 years, since the industrial revolution, our species has had to cope with what Ildari calls “radical environmental mutation.”\n\nWhile our environment has radically mutated, our human genome is essentially the same as it was 200 years ago, Ildari says. “That’s only eight generations. It’s not enough time [for significant genetic adaptations].”\n\n“There’s a profound mismatch between the genes we carry, the bodies and brains that they are building, and the world that we find ourselves in,” he said. “We were never designed for the sedentary, indoor, socially isolated, fast-food-laden, sleep-deprived frenzied pace of modern life.”\n\nThough he’s not entirely opposed to medication, Ildari says we can throw all the drugs in the world at the depression epidemic, and it won’t make a dent.\n\nAnti depressant use has gone up 300 percent in the last 20 years, but the rate of depression has continued to increase. One in nine Americans over age 12 is currently taking an antidepressant, and one in five have been on them at some point.\n\nThe answer, Ildari says, is a change in lifestyle. He says the results of his six step program have exceeded his wildest dreams:\n\nIldari emphasizes the importance of exercise and social connection, as they are two of the hardest parts of the program for modern Americans.\n\nIldari says the results of exercise on depression are so powerful that if they could be reduced into a pill, it would be the most expensive pill on earth. The problem is 60 percent of American adults get no regular physical activity. Ildari says it’s not their fault. Between long days at work and household and family responsibilities to attend to, who has the time or energy to hit the gym?\n\nThe dirty little secret about exercise, Ildari says, is “it is not natural.” We are designed to be physically active “in the service of adapted goals,” not to exercise on a hamster wheel.\n\nHunter gatherers get four or more hours of vigorous physical activity every day, but if you ask them they will tell you they don’t exercise, Ildari says. “They don’t work out. Working out would be crazy to them. They live.”\n\n“When you put a lab rat on a treadmill … it will squat down on it’s haunches, and the treadmill starts to rub the fur and the skin right off it’s back side,” he said. “When you stare at a piece of exercise equipment, there is a part of your brain that’s screaming out ‘Don’t do it! You’re not going anywhere!’”\n\nIf you can’t go out gathering your own nuts and berries or hunting your own meat, Ildari recommends brisk walking with a friend. Walking for 30 minutes, three times a week, has better effects on depression than Zoloft, he said.\n\nAnother huge factor in modern depression is the lack of social connection in our modern nuclear-family bubbles. “Face-time with our loved ones puts the breaks on our stress response,” Ildari says.\n\nThe problem is we’ve replaced face-time with screen-time. “Our hunter gatherer ancestors spent all day every day in the company of their loved ones.”\n\nUnfortunately illness, including mental illness, triggers people to isolate themselves, which only makes depression worse.\n\n“Resist the urge to withdraw,” Ildari says, “because when you’re ill, your body tells you to shut down and pull away. When you have the flu, that’s adaptive. When you have depression, it’s the worst thing in the world you could do.”\n\nWhat Ildari didn’t mention in his Ted Talk is how difficult his cure is for most modern humans to attain. Sure, we’d all like more fresh air, sunlight, exercise, a better diet, better sleep, less monotonous work, and more interaction with loved ones, but who has time for all that?\n\nI’m stuck here staring at my screen typing about it in an effort to make a living for myself, and many of you don’t even have time to read this article because you have 50+ hours-a-week jobs of your own. Meanwhile, immediate-return hunter-gatherers work an average of 17 hours a week. In this world, we certainly can’t just quit our jobs to be less stressed, when the financial stress would create more stress.\n\nIn my opinion, the answer lies in baby steps. Baby steps away from dependence on civilization, and toward nature, earth skills, and self-sustaining communal living. These are things I plan to learn more about while building this website. I’m excited to share what I learn with you, and hope you’ll share your knowledge with me.", "opengraph": {"locale": "en_US", "type": "article", "title": "Depression is A Disease of Civilization: Hunter-Gatherers Hold the Key to the Cure", "description": "Depression is not a natural disease. It’s a disease caused by our high-stress, industrialized lifestyle, psychologist argues. Depression is a global epidemic. It is the main driver behind suicide, which now claims more than a million lives per year worldwide. One in four Americans will suffer from clinical depression within their lifetimes, and the rate […]", "url": "https://returntonow.net/2016/02/24/the-caveman-cure-for-depression/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2016-02-24T00:40:16+00:00", "article:modified_time": "2018-11-15T13:49:04+00:00", "image": "https://returntonow.net/wp-content/uploads/2016/02/depression-title-image_tcm7-188201.jpg", "image:width": "730", "image:height": "330", "image:type": "image/jpeg"}, "tags": ["Gatherer-Hunters", "Rethinking Civilization", "Uncategorized", "Natural Health", "Depression"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "300", "height": "150", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/drv3BP0Fdi8\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/drv3BP0Fdi8"}], "links": ["http://www.amazon.com/gp/product/0738213888/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0738213888&linkCode=as2&tag=polyamorydiar-20&linkId=QCP73ZGCVWPEJKRJ", "https://www.youtube.com/watch?v=drv3BP0Fdi8&feature=youtu.be", "http://www.amazon.com/gp/product/0738213888/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0738213888&linkCode=as2&tag=returntonow-20&linkId=7WYQW33AFD34I225", "http://www.amazon.com/gp/product/0738213888/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0738213888&linkCode=as2&tag=polyamorydiar-20&linkId=QCP73ZGCVWPEJKRJ", "https://returntonow.net/"], "authors": ["Sara Burrows"], "publish_date": "2016-02-24T00:40:16+00:00"}