{"result_id": "262009", "URL": "https://returntonow.net/2017/12/16/trump-administration-overturns-rule-requiring-outdoor-space-organic-egg-laying-hens/", "timestamp": "2023-04-25 17:00:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2017/12/16/trump-administration-overturns-rule-requiring-outdoor-space-organic-egg-laying-hens/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "USDA Overturns Rule Requiring Outdoor Space for Organic Hens", "cleaned_text": "A rule change under the Obama Administration, required egg producers using the label “USDA Organic” to provide real outdoor space for hens, rather than enclosed porches. The Trump administration just reversed that.\n\nThe U.S. Department of Agriculture has long required organic egg producers to give their hens “access” to the outdoors. Many large brands have created a loophole to this requirement by providing tiny doors leading to small, enclosed outdoor “porches.”\n\nMany of these “organic” chickens — packed in barns with up to 200,000 other chickens — never see the light of day. In other words, about half the organic eggs in the country come essentially from factory farms.\n\n\n\n A new USDA rule passed under the Obama administration closed this loophole, clarifying that organic hens must be given real outdoor space, at least two square feet per chicken, and that porches don’t count.\n\nThis means farms like Herbruck’s Poultry Ranch in Michigan (which “houses” 2 million hens) and Cal-Maine Foods (“home” to 36 million hens) had 5 years to find outdoor space for their chickens or to change their label from “organic” to “cage-free” eggs.\n\nThe Trump administration is now announcing plans to overturn the rule-change.\n\nShortly after Trump came into office, the U.S. Department of Agriculture put the rules on hold. Both Kansas Republican Pat Roberts, chairman of the Senate Agriculture Committee, and the committee’s senior Democrat, Debbie Stabenow, have called on the USDA to revise the new rules. Stabenow, who represents Michigan, has received thousands of dollars in campaign contributions from members of the Herbruck family.\n\nNow the administration says that it plans to withdraw the regulation entirely because it “would exceed USDA’s statutory authority.”\n\nSmall organic chicken farmers whose chickens are given real earth to roam on promise to fight the move in court. They and the Organic Trade Association pushed for the rule amendment in the first place, claiming it wasn’t fair that large-scale factory farms got to use the same label — organic — that they work so hard for.", "opengraph": {"locale": "en_US", "type": "article", "title": "USDA Overturns Rule Requiring Outdoor Space for Organic Hens", "description": "A rule change under the Obama Administration, required egg producers using the label “USDA Organic” to provide real outdoor space for hens, rather than enclosed porches. The Trump administration just reversed that. The U.S. Department of Agriculture has long required organic egg producers to give their hens “access” to the outdoors. Many large brands have […]", "url": "https://returntonow.net/2017/12/16/trump-administration-overturns-rule-requiring-outdoor-space-organic-egg-laying-hens/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2017-12-16T16:45:10+00:00", "article:modified_time": "2018-11-13T14:22:05+00:00", "image": "https://returntonow.net/wp-content/uploads/2017/12/fd78809d1fdf0af8ab96f664f7fe0c5f85b5cfa3.jpg", "image:width": "960", "image:height": "540", "image:type": "image/jpeg"}, "tags": ["Rethinking Agriculture", "Rules", "Trump", "Organic eggs", "Factory Farming", "Uncategorized", "Outdoor space"], "tweets": [], "movies": [], "links": ["http://www.chicagotribune.com/business/ct-egglands-best-organic-herbruck-farm-20170713-story.html", "https://www.herbrucks.com/", "http://calmainefoods.com/company/", "https://www.npr.org/sections/thesalt/2017/09/13/550607440/organic-industry-sues-to-push-animal-welfare-rules", "https://www.npr.org/sections/thesalt/2017/12/15/571187112/trump-administration-moves-to-kill-rules-for-organic-eggs", "https://www.agriculture.senate.gov/newsroom/rep/press/release/bipartisan-senators-to-usda-address-organic-livestock-poultry-concerns-before-publishing-rule"], "authors": ["Sara Burrows"], "publish_date": "2017-12-16T16:45:10+00:00"}