{"result_id": "262001", "URL": "https://returntonow.net/2018/06/17/fragrance-is-the-new-secondhand-smoke/", "timestamp": "2023-04-25 17:00:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2018/06/17/fragrance-is-the-new-secondhand-smoke/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Fragrance is the New Second-Hand Smoke", "cleaned_text": "Hundreds of studies over the last two decades are finding “fragrance” in beauty products and household cleaners are just as bad or worse for our health than secondhand smoke. Is it time for fragrance-free workplaces, hotel rooms and sections in restaurants?\n\nFragrance in the Workplace is the New Second-hand Smoke. “But once the dangers were finally public, it only took a few years before smoke-free workplace laws were enacted across the nation.” “It took decades for the workplace to acknowledge the deadly effects of exposure to second-hand smoke,” write researchers in a 2009 meta-analysis of studies on fragrance titled. “But once the dangers were finally public, it only took a few years before smoke-free workplace laws were enacted across the nation.”\n\nWhen a few people began complaining about second-hand smoke in the 1960s — a time when nearly half of American adults smoked — the general public and businesses considered it a fringe movement not likely to go anywhere. But by 1985, smoke-free city ordinances began popping up, and by 2007, 30 states had passed comprehensive smoke-free laws. “We propose that fragrance is following the same trajectory,” write the lead authors of the paper, Loyola University Maryland management professor Christy Devader and University of Maryland nursing professor Paxson Barker. The average U.S. consumer today is as uneducated about the dangers of synthetic fragrances as the average American was to the dangers of second-hand smoke in the 1960s, Devader and Barker argue. Those dangers include chemicals that are known neurotoxins, carcinogens, endocrine disruptors, DNA mutagens, allergens, hepatotoxins and reproductive toxins all hidden under the simple ingredient label “fragrance.” Manufacturers of beauty and cleaning products don’t have to disclose the hundreds of potential chemicals that could be used to make their fragrance, because they are considered “trade secrets” by the FDA.\n\nA 2008 analysis of 6 top selling laundry products and air fresheners found “nearly 100 volatile organic compounds were emitted from the products, and five of the six products emitted one or more carcinogenic hazardous air pollutants which the Environmental Protection Agency considers to have no safe exposure level.” A 2017 Australian study found synthetic fragrances trigger respiratory problems such as coughing and shortness of breath in 1 out of 5 people and migraines in 1 out of 10. Another 10 percent experience rashes or other skin problems when exposed, and 8 percent said they’ve missed work or lost a job due to fragrance-related illness in the workplace. A 2016 study found 1/3 of Americans report adverse health effects when exposed to artificial fragrances.\n\nBreathing problems such as hay fever and asthma, found in 15-20% of North Americans, are also exacerbated by synthetic fragrance.\n\nPeople with multiple chemical sensitivity can have even more severe reactions, making it difficult for them to hold a job or even go out in public.What makes fragrance even more insidious than secondhand smoke is the difficulty in detecting it. If you’re sensitive to cigarettes, you can walk in the other direction when you see a cloud of smoke or someone holding a cigarette on the street. With fragrance, it’s hard to identify where it might be coming from until it’s too late. Some fragrance products are designed to be slow release, so people wearing them continue to emit a “bubble” of toxins for hours to come. Plus, they’re in everything, so they’re difficult to avoid. Products that typically contain “fragrance” chemicals include:\n\nAfter many of the public and private organizations in Nova Scotia went fragrance-free, perfume sales dropped over 30 percent.\n\nAs for household cleaners, baking soda and vinegar work better than just about any product on the market, are cheaper and non-toxic.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fragrance is the New Second-Hand Smoke", "description": "Hundreds of studies over the last two decades are finding “fragrance” in beauty products and household cleaners are just as bad or worse for our health than secondhand smoke. Is it time for fragrance-free workplaces, hotel rooms and sections in restaurants? “It took decades for the workplace to acknowledge the deadly effects of exposure to […]", "url": "https://returntonow.net/2018/06/17/fragrance-is-the-new-secondhand-smoke/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2018-06-17T19:20:56+00:00", "article:modified_time": "2018-06-17T19:24:55+00:00", "image": "https://returntonow.net/wp-content/uploads/2018/06/canstockphoto15488985.jpg", "image:width": "800", "image:height": "566", "image:type": "image/jpeg"}, "tags": ["Natural Health", "Uncategorized", "second-hand smoke", "Fragrance"], "tweets": [], "movies": [], "links": ["https://www.national-toxic-encephalopathy-foundation.org/fragsmoke.pdf", "https://en.wikipedia.org/wiki/Neurotoxin", "https://en.wikipedia.org/wiki/Carcinogen", "https://en.wikipedia.org/wiki/Endocrine_disruptor", "https://en.wikipedia.org/wiki/Mutagen", "https://en.wikipedia.org/wiki/Hepatotoxicity", "https://en.wikipedia.org/wiki/Reproductive_toxicity", "https://www.national-toxic-encephalopathy-foundation.org/fragsmoke.pdf", "https://www.huffingtonpost.com/entry/fragrance-sensitivities-can-actually-be-very-severe_us_58c99c3fe4b07112b6472a41", "https://link.springer.com/article/10.1007/s11869-016-0442-z", "http://www.chemicalsensitivityfoundation.org/", "https://www.washingtonpost.com/lifestyle/home/bothered-by-fragrances-this-story-will-be-a-breath-of-fresh-air/2018/03/19/ace83e8a-26cd-11e8-b79d-f3d931db7f68_story.html?noredirect=on&utm_term=.8ccfd833e75a"], "authors": ["Sara Burrows"], "publish_date": "2018-06-17T19:20:56+00:00"}