{"result_id": "262017", "URL": "https://returntonow.net/2020/10/01/half-a-million-sharks-could-be-killed-for-covid-19-vaccine/", "timestamp": "2023-04-25 17:00:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2020/10/01/half-a-million-sharks-could-be-killed-for-covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Half a Million Sharks Could Be Killed for CoVid 19 Vaccine", "cleaned_text": "GlaxoSmithKline wants to kill 500,000 sharks to use their liver oil in its first round of coronavirus vaccines\n\nConservationists warn GlaxoSmithKline and other big pharma companies are endangering sharks so for coronavirus vaccines.\n\nThe company just announced it would manufacture billion doses of squalene – an natural compound found in shark liver oil – for use in the first round of coronavirus vaccines.\n\nAround 3 million sharks are already killed each year for the flu, other vaccines and cosmetics, so this number would be on top of that.\n\n“The supply chain has never been tested at the scale that a coronavirus vaccine would demand,” Shark Allies says in a petition.\n\nThe populations of most shark species are already at critically low levels and “will not withstand an increase in demand for a global vaccine,” the organization warns.\n\n“There’s so many unknowns of how big and how long this pandemic might go on … the numbers of sharks taken for this product could be really high, year after year after year,” founder of Shark Allies Stefanie Brendl told Sky News.\n\n“Harvesting something from a wild animal is never going to be sustainable, especially if it’s a top predator that doesn’t reproduce in huge numbers,”\n\nThe group argues there are more sustainable options for squalene such as plants and algae, though more expensive to acquire.\n\nOthers argue it’s dangerous to add squalene, in any form, to vaccines.\n\n“In humans, the immune system recognizes squalene as an oil molecule native to your body,” says pharmacist and patient safety advocate “It is found throughout your nervous system and brain. In fact, you can consume squalene in olive oil and not only will your immune system recognize it, you will also reap the benefits of its antioxidant properties.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Half a Million Sharks Could Be Killed for CoVid 19 Vaccine", "description": "GlaxoSmithKline wants to kill 500,000 sharks to use their liver oil in its first round of coronavirus vaccines Conservationists warn GlaxoSmithKline and other big pharma companies are endangering sharks so for coronavirus vaccines. The company just announced it would manufacture billion doses of squalene – an natural compound found in shark liver oil – for […]", "url": "https://returntonow.net/2020/10/01/half-a-million-sharks-could-be-killed-for-covid-19-vaccine/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2020-10-01T14:13:03+00:00", "article:modified_time": "2020-10-01T14:22:23+00:00", "image": "https://returntonow.net/wp-content/uploads/2020/10/external-content.duckduckgo.com_.jpeg", "image:width": "2000", "image:height": "1000", "image:type": "image/jpeg"}, "tags": ["Coronavirus", "Vaccines", "Uncategorized", "Natural Health", "Sharks", "squalene"], "tweets": [], "movies": [], "links": ["https://nationalpost.com/news/world/covid-19-vaccine-could-see-half-a-million-sharks-killed-for-key-oil-conservationists-say", "https://www.change.org/p/us-fda-food-and-drug-administration-of-the-united-states-of-america-stop-using-sharks-in-covid-19-vaccine-use-existing-sustainable-options", "https://news.sky.com/story/coronavirus-half-a-million-sharks-could-be-killed-for-vaccine-experts-warn-12083167", "https://www.sciencedirect.com/science/article/abs/pii/S0014480002924299"], "authors": ["Sara Burrows"], "publish_date": "2020-10-01T14:13:03+00:00"}