{"result_id": "262004", "URL": "https://returntonow.net/2017/07/19/fasting-fountain-youth/", "timestamp": "2023-04-25 17:00:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2017/07/19/fasting-fountain-youth/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Why Modern Humans Need to Fast, Scientists Explain", "cleaned_text": "Why agricultural humans need to mimic the eating and non-eating patterns of hunter-gatherers\n\nFor hundreds of thousands of years, our hunter-gatherer ancestors ate food only intermittently. When they killed a large animal, the tribe feasted for days, when they didn’t, they might go a day or two without eating much or anything at all.\n\nIn the modern world, it is almost inconceivable for people to skip more than one meal. While we might think of it as a great advantage, our continual supply of calories actually comes along with many disadvantages.\n\nMark Mattson, a neuroscientist at the National Institute on Aging and professor at Johns Hopkins University, says our bodies need occasional breaks from eating for optimal health.\n\nIntermittent fasting boosts brain function, wards off Alzheimer’s and Parkinson’s and makes us live longer by speeding up the regeneration of our cells, Mattson says in Ted Talk titled Why Fasting Bolsters Brain Power below.\n\n“It’s been known for a long time that one way to extend the lifespan of laboratory animals is simply to reduce their [calorie] intake,” he says.\n\nThe lifespan of lab rats has been increased by up to 40 percent by feeding them less. Mattson suggests humans could do the same by adopting a lifestyle of intermittent fasting.\n\n“We started looking at the effects of energy restriction on the brain in the context of age-related neuro-degenerative disorders and found we could slow down … Alzheimer’s and Parkinson’s,” Mattson said.\n\nMattson said fasting improves brain function by challenging it. “Your brain responds to the challenge of not having food by activating pathways that help it cope with stress and resist disease.”\n\nLike vigorous exercise, intermittent fasting promotes neuron growth, strengthens synapses and increases production of new nerve cells. Fasting also increases the number of mitochondria in nerve cells, which improves cognition, memory and mood, and increases the ability of nerve cells to repair DNA, he says.\n\nWhen you fast, your metabolism shifts so that you start burning fats, he explains. “Every time you eat a meal the energy is stored your liver in the form of glycogen [sugar]. That’s always tapped into first. It takes 12 hours before you deplete the glycogen stores in your liver.”\n\n“When you eat three or four meals a day you never deplete the glycogen stores in your liver. You can’t start burning fat until those stores are depleted.”\n\nWhen you burn fats you produce ketone bodies, which are very good for your brain, he says.\n\nFasting makes sense from an evolutionary perspective, Mattson says. “Our hunter-gatherer ancestors would not have survived unless their brain was functioning at a high level when they were hungry. If you’re hungry and haven’t found food, you better figure out how to find food. You don’t want your brain to shut down.”\n\nThis may explain why nerve cell circuits become more active when we’re hungry.\n\nDirector of USC Longevity Institute Valter Longo‘s research has led him to similar conclusions.\n\nIn his own Ted Talk called Fasting: Awakening Rejuvenation From Within, he explains how fasting triggers the body to regenerate itself.\n\nIt started with the discovery that fasting protects mice against the damaging effects of chemotherapy. After six sessions of chemo, only the mice who fasted were able to restore their white blood cell count back to normal, Longo said.\n\nLongo and his fellow researchers wondered how this was possible.\n\n“We started thinking about regeneration. Is it possible that fasting is telling the body to generate new cells and regenerate the immune system?” Longo asked himself.\n\nSo they took middle-aged mice, put them on a fast, and found it reversed the effect of aging on the white blood cell count.\n\n“Something in fasting creates gene protection,” he said.\n\nIt works by activating our stem cells and temporarily reducing the number of immune cells during the fast. Then when we start eating again, the activated stem cells go to work creating new immune cells.\n\n“After just a couple days your body completely reprograms itself,” Longo said.\n\nHe and his team also conducted studies showing fasting drastically reduces risk factors associated with diabetes, cancer and heart disease, while increasing the number of circulating stem cells.\n\nSo why is the standard Western diet three meals a day plus snacks?\n\nNot surprisingly, Mattson said it boils down to money. The food industry doesn’t make money when people skip breakfast. Neither does pharmaceutical industry.\n\nMattson says there are two basic ways to experience the health benefits of calorie restriction — eat less at each meal, or reduce the frequency of the meals, aka intermittent fasting.\n\n1. Long water-only fasts — two days a month or two weeks a year\n\n2. Alternate day fasting — less than 600 calories, or no food, every other day\n\n3. 5:2 diet — eating normally 5 days a week, less than 600 calories the other two days\n\n4. Daily time-restricted fasting — food is only consumed during a 4-8 hour period each day\n\n\n\n \n\n \n\n \n\n Your brain, which is typically run by sugar, switches to fat for fuel during fasting. “This is why people usually get a headache after they fast for the first time,” Longo warns.\n\nBut not to worry, he says, most of us can go 60 days without food. Some people can actually go for 6 months.\n\n“Fasting is the greatest remedy — the physician within.” Philippus Paracelsus\n\n“A little starvation can really do more for the average sick man than the best medicines and the best doctors.” Mark Twain\n\n“Humans live on one-quarter of what they eat; on the other three quarters lives their doctor.” Egyptian pyramid inscription, 3800 BC", "opengraph": {"locale": "en_US", "type": "article", "title": "Why Modern Humans Need to Fast, Scientists Explain", "description": "Why agricultural humans need to mimic the eating and non-eating patterns of hunter-gatherers For hundreds of thousands of years, our hunter-gatherer ancestors ate food only intermittently. When they killed a large animal, the tribe feasted for days, when they didn’t, they might go a day or two without eating much or anything at all. In […]", "url": "https://returntonow.net/2017/07/19/fasting-fountain-youth/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2017-07-19T20:21:38+00:00", "article:modified_time": "2018-02-18T21:42:28+00:00", "image": "http://returntonow.net/wp-content/uploads/2017/07/nutritionist-portland-or-evolve-nutritional-therapy-holistic-nutritionist-paleo-nutrition-primal-holistic-health-fitness-fat-loss-weston-price-nutritional-therapy-association-nutr.jpeg"}, "tags": ["Gatherer-Hunters", "Natural Health", "Uncategorized", "Intermittent Fasting"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "300", "height": "150", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/4UkZAwKoCP8\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/4UkZAwKoCP8"}, {"embed_type": "iframe", "provider": "youtube", "width": "300", "height": "150", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/dVArDzYynYc\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/dVArDzYynYc"}], "links": ["https://en.wikipedia.org/wiki/Ketone_bodies", "http://gero.usc.edu/faculty/longo/", "https://www.amazon.com/gp/product/B075824XCB/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B075824XCB&linkCode=as2&tag=returntonow-20&linkId=bf434cacb551fc83cdccbee220998388"], "authors": ["Sara Burrows"], "publish_date": "2017-07-19T20:21:38+00:00"}