{"result_id": "262003", "URL": "https://returntonow.net/2021/10/23/southwest-drops-medical-mandate-after-losing-75-million-in-cancelled-flights/", "timestamp": "2023-04-25 17:00:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2021/10/23/southwest-drops-medical-mandate-after-losing-75-million-in-cancelled-flights/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Southwest Drops Medical Mandate After Losing $75 Million in Cancelled Flights", "cleaned_text": "Hundreds of Southwest employees protest and pilot’s union sues over mandate\n\n\n\nSouthwest appears to be back-pedaling on its threat to fire employees for not getting COVID 19 shots.\n\nWhen nearly 2000 flights were suddenly cancelled between October 9 and 10, the airline insisted it was due to weather and traffic control issues, despite rumors it was due to a strike – or “sick out” – over the medical mandate.\n\nA week later, hundreds of Southwest employees and former employees gathered in front of the airline’s headquarters in Dallas holding signs saying “Terminate the mandate,” “Freedom not force” and “No jabs for jobs:”\n\nWhatever the real reason, the airline announced Thursday it would not fire anyone after all, one day after the Southwest Airlines Pilots Association (union) filed a lawsuit against the airline over the vaccine mandate.\n\nThe announcement also came right after the company’s quarterly report showed it lost $75 million due to flight cancellations over Columbus Day weekend.\n\n“I’m not going to fire anybody,” CEO Gary Kelly said in an interview with CBS News. “It makes no sense.”\n\nThe airline risks losing federal contracts if all its employees haven’t had at least two doses of the vaccine by December 8.\n\nBut so far only half of the company’s 56,000 employees have reported their vaccination status.\n\n“This is an evolving process working with the government in terms of what they expect, and very clearly, we wanted our employees to know that nobody is going to lose their job on December the 9th if we’re not perfectly in compliance,” Kelly said.\n\nBut the airline may not be even close to “perfect compliance,” according to one pilot.\n\nSouthwest pilot and founder of the U.S. Freedom Flyers organization Joshua Yoder told Fox 30% of pilots are ready to lose their jobs over the mandate.\n\n“We have all the control,” he said.\n\n“If you have flights reduced by 30% because 30% of pilots are fired because they won’t take the vaccine, this is going to affect how your goods get here from overseas, how they are distributed to the store.\n\nThe same thing is happening with the truckers, it’s happening in the shipping industry. Those Amazon boxes that typically show up in two days, you might be looking at three weeks.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Southwest Drops Medical Mandate After Losing $75 Million in Cancelled Flights", "description": "Hundreds of Southwest employees protest and pilot’s union sues over mandate Southwest appears to be back-pedaling on its threat to fire employees for not getting COVID 19 shots. When nearly 2000 flights were suddenly cancelled between October 9 and 10, the airline insisted it was due to weather and traffic control issues, despite rumors it […]", "url": "https://returntonow.net/2021/10/23/southwest-drops-medical-mandate-after-losing-75-million-in-cancelled-flights/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2021-10-23T19:02:25+00:00", "article:modified_time": "2021-10-23T19:24:19+00:00", "image": "https://returntonow.net/wp-content/uploads/2021/10/external-content.duckduckgo.com_.jpg", "image:width": "2500", "image:height": "1667", "image:type": "image/jpeg"}, "tags": ["Natural Health", "Uncategorized"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">DALLAS TX: Southwest employees chant “LET’S GO BRANDON” in front of the South West headquarters to protest the airline vaccine mandate</p>\n<p>Get More News: <a href=\"https://t.co/u7URmoOvPT\">https://t.co/u7URmoOvPT</a> <a href=\"https://t.co/JwSKXrzqaa\">pic.twitter.com/JwSKXrzqaa</a></p>\n<p>— Drew Hernandez (@DrewHLive) <a href=\"https://twitter.com/DrewHLive/status/1450108114964033541?ref_src=twsrc%5Etfw\">October 18, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://t.co/u7URmoOvPT", "https://t.co/JwSKXrzqaa", "https://twitter.com/DrewHLive/status/1450108114964033541?ref_src=twsrc%5Etfw", "https://news.yahoo.com/southwest-ceo-says-im-not-204500747.html", "https://simpleflying.com/southwest-vaccine-mandate-delay-requested/", "https://news.yahoo.com/southwest-lost-75-million-four-164233757.html", "https://news.yahoo.com/southwest-ceo-says-im-not-204500747.html", "https://www.theepochtimes.com/mkt_breakingnews/makes-no-sense-southwest-airlines-says-it-wont-fire-workers-who-dont-get-covid-vaccine_4063579.html", "https://www.usfreedomflyers.org/", "https://www.foxnews.com/media/pilot-biden-vaccine-mandate-southwest-we-have-all-control"], "authors": ["Sara Burrows"], "publish_date": "2021-10-23T19:02:25+00:00"}