{"result_id": "262007", "URL": "https://returntonow.net/2022/12/08/rod-stewarts-son-heart-attack/", "timestamp": "2023-04-25 17:00:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2022/12/08/rod-stewarts-son-heart-attack/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Rod Stewart Bans \"Unboosted\" Guests from Christmas Party, 11 Year Old Son Has Suspected Heart Attack", "cleaned_text": "Last year Stewart said only triple-boosted guests were allowed at his Christmas party\n\nWe don’t normally report about the clot shot, as it gets us hidden from your newsfeed for at least 90 days, but every once in a while, the irony is too thick to pass up.\n\nLast Christmas, “Sir” Rod Stewart made headlines for banning un-vaccinated guests from an annual Christmas party at his house.\n\n“It’s dead simple. If you haven’t been tested, if you haven’t got the two vaccines and the booster, you can’t come,” he told The Metro.\n\nA year later, yesterday, his 11-year-old son collapsed in the middle of a football match and was rushed to the hospital for a suspected heart attack.\n\n“We thought my boy had a heart attack,” Stewart said. “He was going blue and was unconscious until he calmed down. It was scary, but it turned out to be a panic attack.”\n\n“Another boy fell backwards and banged his head – he’s still not back. In all of my days watching football, that’s the only time two ambulances had been called,” Stewart added.\n\nGuess the other boy was having a “panic attack” too.\n\nThese young, previously healthy boys aren’t the only ones collapsing in ways that look like a cross between a heart attack and a seizure.\n\nNearly 1000 collapsed on the field (many on live TV) from apparent cardiac issues the first year after the Covid vaccine rollout.\n\nOn a normal year, there are 5-8 heart related issues among competing athletes, according to Wikipedia.\n\nA recent investigation shows the number of sudden cardiac deaths among athletes has risen 1700% since the rollout of the Covid vaccines in January of 2021.\n\nAnd, as of last summer, the numbers for 2022 were on target to be 4000% higher.\n\nThese numbers are compared to a 2006 Swiss study of sudden cardiac deaths in athletes dating back to 1966.\n\nIf you haven’t watched the banned-yet-still-viral documentary Died Suddenly yet, the first 20 minutes of footage of embalmers pulling enormous blood clots, over 3-feet long, from the vaccinated deceased, might explain why blood stops has a hard time circulating when athletes are exerting themselves.", "opengraph": {"locale": "en_US", "type": "article", "title": "Rod Stewart Bans \"Unboosted\" Guests from Christmas Party, 11 Year Old Son Has Suspected Heart Attack", "description": "Last year Stewart said only triple-boosted guests were allowed at his Christmas party   We don’t normally report about the clot shot, as it gets us hidden from your newsfeed for at least 90 days, but every once in a while, the irony is too thick to pass up. Last Christmas, “Sir” Rod Stewart made […]", "url": "https://returntonow.net/2022/12/08/rod-stewarts-son-heart-attack/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2022-12-08T15:41:03+00:00", "article:modified_time": "2022-12-08T16:21:26+00:00", "image": "https://returntonow.net/wp-content/uploads/2022/12/Screen-Shot-2022-12-08-at-10.38.52-AM-1024x672.png", "image:width": "1024", "image:height": "672", "image:type": "image/png"}, "tags": ["Uncategorized"], "tweets": [], "movies": [], "links": ["https://metro.co.uk/2021/12/03/rod-stewart-only-triple-vaccinated-guests-can-come-to-christmas-do-15709339/", "https://www.dailymail.co.uk/tvshowbiz/article-11511667/Rod-Stewart-reveals-son-Aiden-rushed-hospital-ambulance.html", "https://childrenshealthdefense.org/defender/athletes-collapsed-during-competition-cola/", "https://pennybutler.com/athletes-collapsing/", "https://yournews.com/2022/06/11/2357621/study-finds-athlete-deaths-are-1700-higher-than-expected-since/", "https://pubmed.ncbi.nlm.nih.gov/17143117/", "https://rumble.com/v1wac7i-world-premier-died-suddenly.html"], "authors": ["Sara Burrows"], "publish_date": "2022-12-08T15:41:03+00:00"}