{"result_id": "262016", "URL": "https://returntonow.net/2018/12/16/ineffective-flu-vaccine-contributed-to-50000-deaths-last-winter-british-government-says/", "timestamp": "2023-04-25 17:00:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2018/12/16/ineffective-flu-vaccine-contributed-to-50000-deaths-last-winter-british-government-says/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Ineffective Flu Vaccine Contributed to 50,000 Deaths Last Winter, British Government Says", "cleaned_text": "More than 50,000 people died of the flu after receiving the flu shot in the UK last year\n\nThe flu vaccine’s failure to protect against key strains of the virus contributed to 50,000 “extra” deaths in England and Wales last winter, according to the Office of National Statistics.\n\nThe problem, according to The Independent, is that the most commonly administered flu shot does not offer protection against the most common strain of the flu.\n\nDuring the worst flu season in 40 years, the government agency Public Health England, warned that the “trivalent” flu shot given to most British citizens does not protect against Influenza B/Yamagata, which accounted for the vast majority of Influenza B cases reported by labs.\n\nThe shot contained only three strains of the flu virus, two types of Influenza A and one type of Influenza B.\n\nThere is a “quadrivalent” flu strain that would’ve included the Yamagata strain, but it is more expensive and therefore not commonly offered.\n\nThe most commonly used flu shots protect no more than 60% of people who receive them; some years, effectiveness plunges to as low as 10%, says Michael Osterholm, an epidemiologist at the University of Minnesota.\n\n“It’s a terribly inadequate vaccine for a serious public health threat,” he tells Science Magazine.\n\nThat’s because vaccine manufacturers, working months ahead of flu season, incorrectly guess which strains will end up spreading, Osterholm says.\n\nOn top of that, the vaccine may fail even when the right strains were used to make it, because of how it’s produced or the quirks of individual immune systems.\n\nThe vaccine teaches the body to produce antibodies against the the virus’s surface protein, but the protein is constantly mutating, Osterholm explains.\n\n“It’s much more complicated than we thought,” he says.\n\nFor alternative remedies for treating the flu, check out this Weston A. Price Foundation article.\n\nRELATED: Study: Elderberry Cuts Duration of Colds and Flu in Half", "opengraph": {"locale": "en_US", "type": "article", "title": "Ineffective Flu Vaccine Contributed to 50,000 Deaths Last Winter, British Government Says", "description": "More than 50,000 people died of the flu after receiving the flu shot in the UK last year The flu vaccine’s failure to protect against key strains of the virus contributed to 50,000 “extra” deaths in England and Wales last winter, according to the Office of National Statistics. The problem, according to The Independent, is that the […]", "url": "https://returntonow.net/2018/12/16/ineffective-flu-vaccine-contributed-to-50000-deaths-last-winter-british-government-says/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2018-12-16T15:22:12+00:00", "image": "https://returntonow.net/wp-content/uploads/2018/12/766x415_Flu_Shot_Side_Effects.jpg", "image:width": "766", "image:height": "415", "image:type": "image/jpeg"}, "tags": ["flu", "vaccine", "Uncategorized", "flu shot", "ineffective", "Natural Health"], "tweets": [], "movies": [], "links": ["https://www.independent.co.uk/topic/OfficeOfNationalStatistics", "https://www.independent.co.uk/news/health/flu-jab-nhs-warning-winter-ineffective-a8142376.html#", "https://www.independent.co.uk/news/health/flu-vaccine-deaths-nhs-ineffective-crisis-bad-weather-illness-2017-a8660496.html", "https://www.gov.uk/government/organisations/public-health-england", "https://www.sciencemag.org/news/2017/09/why-flu-vaccines-so-often-fail", "https://www.westonaprice.org/health-topics/homeopathy/homeopathic-treatment-for-influenza/", "https://returntonow.net/2018/11/18/study-elderberry-cuts-duration-of-colds-and-flu-in-half/"], "authors": ["Sara Burrows"], "publish_date": "2018-12-16T15:22:12+00:00"}