{"result_id": "262029", "URL": "https://returntonow.net/2021/03/30/floridas-governor-signs-executive-order-forbidding-vaccine-passports/", "timestamp": "2023-04-25 17:00:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2021/03/30/floridas-governor-signs-executive-order-forbidding-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Florida's Governor Signs Executive Order Forbidding Vaccine Passports", "cleaned_text": "Florida governor says requiring vaccine passports “to simply participate in normal society” is “completely unacceptable”\n\nFlorida Governor Ron DeSantis is forbidding local governments and businesses from requiring “vaccine passports” for entry.\n\n“It’s completely unacceptable for the government or the private sector to impose upon you the requirement that you show proof of vaccine to just simply be able to participate in normal society,” he said in a press conference yesterday.\n\nHis comments came a day after a Washington Post report titled “Vaccine Passports are on the Way,” which revealed the Biden administration is busily working out federal legislation could require proof of vaccination in order to do anything from running a business, to attending work or school, traveling, or even entering restaurants and grocery stores.\n\n“It’s a very, very bad idea,” DeSantis said of requiring COVID-19 passports. “Look, if you want to go to a movie theater or a concert or all this stuff, go. If you don’t, don’t. But, to require someone to show some type of proof of vaccination is completely unacceptable. It’s not something we are going to support here in any way.”\n\n“We always said we want to provide it for all, but mandate it for none,” DeSantis said, “Particularly if you were vulnerable, we were not going to force you to do it.”\n\n“We will not have COVID vaccines mandated in Florida.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Florida's Governor Signs Executive Order Forbidding Vaccine Passports", "description": "Florida governor says requiring vaccine passports “to simply participate in normal society” is “completely unacceptable” Florida Governor Ron DeSantis is forbidding local governments and businesses from requiring “vaccine passports” for entry. “It’s completely unacceptable for the government or the private sector to impose upon you the requirement that you show proof of vaccine to just […]", "url": "https://returntonow.net/2021/03/30/floridas-governor-signs-executive-order-forbidding-vaccine-passports/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2021-03-30T15:57:32+00:00", "image": "https://returntonow.net/wp-content/uploads/2021/03/Screen-Shot-2021-03-30-at-11.51.56-AM.png", "image:width": "1191", "image:height": "831", "image:type": "image/png"}, "tags": ["vaccine passports", "governor", "Florida", "ron desantis", "Uncategorized", "Natural Health", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.washingtontimes.com/news/2021/mar/29/ron-desantis-florida-governor-executive-order-ban-/", "https://www.washingtonpost.com/health/2021/03/28/vaccine-passports-for-work/", "https://www.fox13news.com/news/florida-governor-to-forbid-covid-19-vaccine-passports", "https://www.herald.ng/florida-governor-promises-to-take-executive-action-against-covid-19-vaccine-passports/"], "authors": ["Sara Burrows"], "publish_date": "2021-03-30T15:57:32+00:00"}