{"result_id": "262024", "URL": "https://returntonow.net/2016/02/19/age-breastfeeding-become-pedophilia/", "timestamp": "2023-04-25 17:00:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2016/02/19/age-breastfeeding-become-pedophilia/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Why I Still Breastfeed My 5-Year-Old", "cleaned_text": "A couple of years ago, I came across a story about a mother who still breastfeeds her 5-year-old daughter. I’m not really sure why it was newsworthy, but people were shocked to discover a woman feeding her small child the same way all mammals have for millions of years.\n\nAll kinds of bloggers picked up the story, and busybodies left comments calling the dedicated mother every name in the book — “gross” … “disgusting” … “indecent” … “unnatural” … “sinister” … “perverse” … “what’s wrong with the world.”\n\nThe most disturbing accusations hurled at this woman were those of “pedophilia” and “child abuse.”\n\nAt what age does the most natural, motherly act of nourishing and nurturing a child suddenly transform into pedophilia and child abuse? 3? 4? 5? 6? 7? If it’s 5, put me on trial with Sharon Spink, because I’m “guilty” as charged.\n\nThere was a time I could not have imagined breastfeeding a child this old. I didn’t know it was even possible. When Nora was about 4 months old, an older, conservative coworker of mine told me she breastfed her youngest for three years.\n\nI was shocked. She was so proper, she didn’t seem like the type who would “put up with” such a thing. She revealed her secret only after I asked, “She can’t go longer than 12 months… right?”\n\nI had no plans of weaning her. I just figured she’d definitely wean herself by then. I’d never heard of anyone breastfeeding longer than that.\n\nToday, I laugh at my naivete. I think it’s safe to say breast milk was still 90 percent of Nora’s diet at 2.5 years old. She simply refused to take more than two bites of practically anything other than ice cream until she was almost 3.\n\nI want to pull my hair out when I see people comment that this woman is “psychologically damaging” her child by “forcing her breasts down her throat.” The only thing I ever tried to force down Nora’s throat was solid food – I even tried yogurt in a medicine dropper once – and trust me, it couldn’t be done.\n\nNora actually seemed to nurse even more vigorously around 2 and a half, as if it were her last, desperate attempt to ward off solid food. The more I pushed her away, the more she demanded “baba.” She would try to nurse all night to make up for insufficient calories from daytime hunger strikes.\n\nMy partner Brad and I would wake up to screaming and crying every morning, after I’d finally roll away from her. I’d beg her to let me sleep, and she’d scream “make more milk in the babas!” and then resort to pathetically whimpering – “pleeeaase Mama… I really need baba.”\n\nHow could I say no to that? By this time each morning, even Brad was begging me to “just give it to her!”\n\nAnd then one day, out of the blue, she ate one and a half bison hot dogs. I almost cried for joy. It’s like it finally clicked that Mom no longer had enough milk to sustain her growing body and she just gave in.\n\nBy age 4, she was down to nursing only to fall asleep at night and wake up in the morning… and for an occasional nap or injury. She would’ve loved to have it more often, but I limited it for my own sanity.\n\nNow, at 5.5 years old, she occasionally falls asleep without it, but still insists on “just a little bit” in the morning.\n\nDoes that make me a pedophile?\n\nThe World Health Organization recommends breastfeeding for “up to 2 years and beyond.” Does that mean a child should stop on her second birthday? Or is 2.5 acceptable? Can we still give into our children’s demands at 3?\n\nI wish someone – preferably someone who’s never breastfed at all, or someone who cut it off before the baby could protest too loudly – would please tell me exactly which day we should let our toddlers cry it out and tell them – “deal with it, you’re never having Mama’s milk again.”\n\nAnd then, I wish these experts would tell me what we should do with these small children after that day, when they continue to cry for milk, any kind of milk, for months on end. Because every young child I know wants milk, and most parents give into that need in one form or another – whether it’s soy, almond, coconut or factory-farmed, pasteurized, homogenized cow’s milk. (Of course there’s the occasional, lucky bastard who gets raw, grass-fed cow’s or goat’s milk, but that is rare.)\n\nFinally, I wish these “experts” would do a little research before they start telling nursing mothers what is best for their babies. They can start by looking up the “natural age of weaning.” Better yet, I’ll do it for them.\n\nAccording to Katherine Dettwyler – anthropology professor and author of “Breastfeeding: Biocultural Perspectives ” – the natural age of weaning is anywhere between 2.5 and 7. She determines this by looking at what other primates do in nature. Her findings include the following:\n\n1. Most monkeys and apes wean when they get their first permanent molars, which happens in humans between age 5.5 and 6.\n\n2. Chimpanzees and gorillas nurse their young at least six times the length of gestation. In humans that would be at least 4.5 years of nursing.\n\n3. One study of primates showed that the offspring were weaned when they had reached about 1/3 their adult weight. This happens in humans at about 5 to 7 years.\n\n4. Most primates wean at about half the age of sexual maturity. In humans, this would be 6 or 7.\n\n5. Studies have shown that a child’s immune system doesn’t completely mature until about 6 years of age. It is well established that breast milk helps develop the immune system, passing on maternal antibodies as long as breast milk is produced. (Maybe that’s why my unvaccinated daughter’s never needed a doctor or dentist).\n\n“The non-human primate data suggest human children are designed to receive all of the benefits of breast milk and breastfeeding for an absolute minimum of two and a half years, and an apparent upper limit of around seven years,” Dettwyler says in her book.\n\n“Natural selection has favored those infants with a strong, genetically coded blueprint that programs them to expect nursing to continue for a number of years after birth and results in the urge to suckle remaining strong for this entire period.“\n\nAccording to The Natural Child Project, true child-led weaning is unlikely to take place before age 4.\n\n“For the few who leave behind this part of their babyhood very early it will be in some other behavior that parents will likely see signs of their immaturity for some time yet. They will continue to need babying, but they will need it in other ways … Often they will wean from the breast and cling to other comfort objects.”\n\nEver wondered why your 3-year-old can’t let go of her pacifier, or why your 6-year-old can’t stop sucking her thumb, or why your 7-year-old freaks out when he can’t find his “blankie” or teddy bear?\n\nHunter-gatherers never weaned before age 4, as they didn’t have mushy GMO cereal grains and synthetic Flinstone vitamins to “shove down their kids’ throats.” Meat had to be pre-chewed and couldn’t be digested in large enough amounts to satisfy little people without adult teeth. Why do you think “baby” teeth used to be called “milk” teeth?\n\nIn pre-industrial peoples – such as Australian aborigines, Greenlanders, Hawaiians, the East Bhutanese, and the Inuit – where traditional diets are still observed, this is still the norm.\n\nConveniently, breastfeeding full-time also serves as a pretty effective birth control, allowing hunter-gatherers to naturally spread their children at least 4 years apart.\n\nSo, let’s get one thing straight – if you breastfed for less than 2.5 years, you’re the “freak of nature,” not Sharon Spink. If you stuck a bottle, a pacifier, or a thumb in your blankie-holding-baby’s mouth at 6 or 12 or 18 months – you are “unnatural” one, not the lady nursing her 5-year-old.\n\nI’m not saying you’re a bad person. I’m just saying your culturally conditioned behavior is contrary to nature.\n\nThe brave women who are still breastfeeding their 5, 6 and 7-year-olds in this screwed up, high-tech, “high-efficiency” world are the most natural women out there, producing the healthiest children, physically and emotionally. Good for them for listening to their children and their instincts instead of their corporate programming.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why I Still Breastfeed My 5-Year-Old", "description": "A couple of years ago, I came across a story about a mother who still breastfeeds her 5-year-old daughter. I’m not really sure why it was newsworthy, but people were shocked to discover a woman feeding her small child the same way all mammals have for millions of years. All kinds of bloggers picked up […]", "url": "https://returntonow.net/2016/02/19/age-breastfeeding-become-pedophilia/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2016-02-19T17:50:58+00:00", "article:modified_time": "2018-05-14T19:50:21+00:00", "image": "https://returntonow.net/wp-content/uploads/2016/02/17974305_10158698564895106_1987057557_n.jpg", "image:width": "960", "image:height": "720", "image:type": "image/jpeg"}, "tags": ["Natural Health", "Uncategorized", "Natural Parenting"], "tweets": [], "movies": [], "links": ["http://www.amazon.com/gp/product/0202011925/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0202011925&linkCode=as2&tag=returntonow-20&linkId=QQE577QNACNSRDZM", "http://www.whale.to/a/dettwyler.html", "https://returntonow.net/2017/02/10/photo-of-breastmilk-killing-bacteria-goes-viral/", "http://www.naturalchild.org/guest/norma_jane_bumgarner2.html", "http://www.naturalchild.org/guest/priscilla_colletto.html", "http://www.dailymail.co.uk/news/article-2613012/You-wouldnt-childs-favourite-teddy-away-Mother-breastfeeds-five-year-old-daughter-says-WONT-stop-Charlotte-asks-mummy-milk.html"], "authors": ["Sara Burrows"], "publish_date": "2016-02-19T17:50:58+00:00"}