{"result_id": "262018", "URL": "https://returntonow.net/2018/09/13/nc-hurricane-manure-lagoons/", "timestamp": "2023-04-25 17:00:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2018/09/13/nc-hurricane-manure-lagoons/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Hurricane Will Likely Cover North Carolina in Hog Feces, As Manure \"Lagoons\" at Factory Farms Overflow", "cleaned_text": "Smithfield’s hog farmers are scrambling to drain thousands of toxic manure lagoons, some the size of lakes, before they overflow into drinking water and the growing “dead zone” off the North Carolina coast\n\nOne of the little discussed horrors of factory farming are manure lagoons — giant cesspools of chemically-treated, bacteria-laden, liquid feces — built to contain the massive amount of waste produced by the cows, pigs and chickens imprisoned in concentrated animal feeding operations, or CAFOs.\n\nAs the nation’s top turkey producer, second largest pork producer, and third largest chicken producer, North Carolina’s factory farms produce more than 10 billion pounds — or 15,000 Olympic swimming pools’ worth — of wet animal waste per year.\n\nThe worst offender is Smithfield, which owns the pigs (but slyly not the manure) at over 2000 North Carolina factory farms like the one below:\n\nWhen these open-air pits of toxic sludge get full, they are sprayed on surrounding crop fields as fertilizer. Every time it rains, the runoff flows into surrounding streams, rivers and eventually into the ocean, where it kills fish.\n\nSmithfield hog farms are creating a “dead zone” off the coast of North Carolina that will soon rival Tyson’s dead zone off the Gulf Coast, says North Carolina’s Neuse Riverkeeper Katy Langly.\n\nAnd when hurricanes hit, the problem is magnified exponentially.\n\n“Animal waste is rich in nutrients,” Langly told me in an interview. “When applied to crops in appropriate amounts, it can be very good for them.”\n\n“Unfortunately it’s over-applied, so the nutrients, along with fecal bacteria like e.coli, gets washed into our rivers.”\n\nThe nutrients lead to algal blooms. “The algae explodes and then dies, depleting oxygen and suffocating the fish.”\n\nLangly says the fish kills hurt tourism along North Carolina’s coast. “When people come to visit and there are a bunch of dead fish along the river, people don’t want to come back.”\n\nDuring Hurricane Floyd, in 1999, there were more than dead fish floating down the coastal River; there were dead pigs floating all the way out into the ocean.\n\n“Thousands of pigs drowned,” Langly said. “There are pictures where you can barely see the roof of the barns. The entire lagoon had to be scooped out, and all of the waste held in it was dumped onto the surrounding area or washed into the river.”\n\n“We have 62 hog farms that still remain in our 100-year flood plain, along the Neuse River, which are always at risk of flooding anytime a major storm comes through.”\n\nAnd with Florence projected to be the biggest storm in at least 30 years, it won’t be pretty.\n\nLangly says there are technologies that can somewhat decrease the amount of pollution coming from factory farms, but they don’t go far enough.\n\n“The true solution is to … move back toward sustainable agriculture.”\n\nRaising animals on grass, in fresh air and sunshine isn’t subsidized by the government the way factory farming is, so pasture-raisedmeat costs a bit more, but for Langly the extra cost is worth it.\n\n“You can taste the difference,” she says. “I don’t mind spending a little more for something that’s been raised ethically and sustainably.”\n\n“The CAFO method for growing animals — it’s not raising them — it’s literally growing them — is just a conveyer belt away from being a true factory.”\n\nLangly and her fellow riverkeepers at the environmental non-profit Sound Rivers advocate a “swine buyout” program, in which the state of North Carolina would buy hog farmers in the flood plain out of their contracts with and debts to Smithfield (i.e. set them free from indentured servitude) in exchange for promising never to use their land for industrial animal production again (small, pasture-based farms would be permissible).", "opengraph": {"locale": "en_US", "type": "article", "title": "Hurricane Will Likely Cover North Carolina in Hog Feces, As Manure \"Lagoons\" at Factory Farms Overflow", "description": "Smithfield’s hog farmers are scrambling to drain thousands of toxic manure lagoons, some the size of lakes, before they overflow into drinking water and the growing “dead zone” off the North Carolina coast One of the little discussed horrors of factory farming are manure lagoons — giant cesspools of chemically-treated, bacteria-laden, liquid feces — built […]", "url": "https://returntonow.net/2018/09/13/nc-hurricane-manure-lagoons/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2018-09-13T01:10:07+00:00", "article:modified_time": "2018-09-15T12:30:56+00:00", "image": "https://returntonow.net/wp-content/uploads/2018/09/33.jpg", "image:width": "1624", "image:height": "866", "image:type": "image/jpeg"}, "tags": ["Rethinking Agriculture", "CAFO", "Hurricane Florence", "Factory Farming", "Manure Lagoon", "Uncategorized", "Smithfield", "Dead Zone"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "300", "height": "150", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/ayGJ1YSfDXs\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/ayGJ1YSfDXs"}], "links": ["https://waterkeeper.org/fields-of-filth-landmark-report-maps-feces-laden-hog-and-chicken-operations-in-north-carolina/", "https://civileats.com/2016/06/28/north-carolinas-cafos-produce-15000-olympic-size-pools-worth-of-waste/", "https://returntonow.net/2017/11/01/study-names-tyson-foods-1-culprit-largest-dead-zone-u-s-history/", "https://soundrivers.org/"], "authors": ["Sara Burrows"], "publish_date": "2018-09-13T01:10:07+00:00"}