{"result_id": "262038", "URL": "https://returntonow.net/page/105/", "timestamp": "2023-04-25 17:00:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/page/105/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Return to Now", "cleaned_text": "\n• Prior to agriculture, humans lived happier, healthier, freer and easier lives, claims one of the world’s top scientists and thinkers. In an article published in Discover Magazine nearly 30 years ago, Pulitzer Prize winning anthropologist and evolutionary biologist Jared Diamond calls agriculture “a catastrophe from which we have never recovered.”\n• Beautiful Photos of Mammals Safely “Co-Sleeping” with Their Babies, As We’ve Done for Millions of Years The term “co-sleeping” has always seemed strange to me. It implies parents are doing something special or out-of-the-ordinary by doing what mammals have always done for millions of years – sleep with their babies. “Are you going to co-sleep?” people asked when I was pregnant. “What kind of co-sleeper are you going to buy?” At […]\n• It’s as bad as female circumcision Imagine what would happen in this country if a doctor strapped a young girl’s arms and legs to his exam table and began cutting away at her genitals, while she was writhing and screaming at the top of her lungs, trying to break free.\n• One in five Americans suffer from sleep disorders or sleep deprivation, and two-thirds get less than the recommended 7 to 9 hours of sleep, according to the CDC. As a result, nearly 9 million Americans were on prescription sleeping pills as of 2013. With side effects including “dizziness, memory loss, confusion, depression, anxiety, aggressive behavior, […]\n• Jarawa Hunter-Gatherers Say They Don’t Want to Be Part of Our World World’s oldest hunter-gatherers are being forced into civilization and treated like animals in a zoo Sign the petition telling the government to leave them alone Like the Hadza of East Africa, the Jarawa hunter-gatherers of the Andaman Islands also face extinction, thanks to the ever-expanding nature of agriculture and civilization.\n• How GMO Corn Could Be Contributing to the “Leaky Gut” Epidemic Bt insecticide kills bugs by “breaking open their stomachs.” Monsanto has genetically engineered this insecticide into our corn. Could it be busting holes in our guts as well? It has been estimated that nearly 80 percent of the U.S. population has some degree of leaky gut syndrome – a condition where holes in our intestines […]\n• A French beekeeper who goes by the name of Nicholas Trainer has trained his bees to develop the first ever cannabis-infused honey for him and his friends.\n• The people behind the knife should be behind bars for life Baby boys are being brutally tortured every 25 seconds in the United States. Let’s not mince words about it. That’s what circumcision is – torture, sexual assault, genital mutilation, unconscionable child abuse, and possibly the worst violation of human rights in history. The mother […]", "opengraph": {"locale": "en_US", "type": "website", "title": "Return to Now", "url": "https://returntonow.net/", "site_name": "Return to Now"}, "tags": [], "tweets": [], "movies": [], "links": ["https://returntonow.net/2016/05/29/agriculture-worst-mistake-humans-ever-made/", "https://returntonow.net/2016/05/13/mammals-safely-co-sleeping/", "https://returntonow.net/2016/05/13/mammals-safely-co-sleeping/", "https://returntonow.net/2016/05/10/circumcision-male-genital-mutilation/", "https://returntonow.net/2016/05/05/banana-peel-tea-for-insomnia/", "https://returntonow.net/2016/05/05/banana-peel-tea-for-insomnia/", "https://returntonow.net/2016/04/16/jarawas/", "https://returntonow.net/2016/04/16/jarawas/", "https://returntonow.net/2016/03/31/vaccine-myths/", "https://returntonow.net/2016/03/31/vaccine-myths/", "https://returntonow.net/2016/03/28/kids-spend-less-time-outdoors-than-prisoners/", "https://returntonow.net/2016/03/28/kids-spend-less-time-outdoors-than-prisoners/", "https://returntonow.net/2016/03/10/526/", "https://returntonow.net/2016/03/10/526/", "https://returntonow.net/2016/03/06/bees-love-cannabis/", "https://returntonow.net/2016/03/06/bees-love-cannabis/", "https://returntonow.net/2016/03/02/circumcision-is-child-abuse-and-torture/"], "authors": [], "publish_date": "May 29, 2016"}