{"result_id": "262020", "URL": "https://returntonow.net/2016/02/27/hidden-camera-chicken-hatchery/", "timestamp": "2023-04-25 17:00:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2016/02/27/hidden-camera-chicken-hatchery/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Hidden Cameras at Chicken Hatchery Shed New Light on Horrors of Factory Farming", "cleaned_text": "The video, produced by Animal Equality, an international animal rights organization, has gone viral with 35 million views on Facebook.\n\nAnimal Equality’s investigators have infiltrated industrial hatcheries, where factory-farmed chickens spend the first nightmarish day of their short, miserable lives.\n\nUnlike the barnyard pictures in storybooks, there are no hens, waiting to gather them under their wings when they’re born.\n\n\n\nInstead, the baby chicks are cooked out of their shells in industrial incubators.\n\nIn an evolutionary attempt to keep their protective mothers nearby, they start chirping the moment they hatch. But their desperate cries for help are never heard.\n\nInstead they are immediately dumped onto a conveyor belt, separated from their shells, and processed like auto parts in an assembly line.\n\nSick and weak chicks are thrown into dumpsters with the shells and brutally crushed.\n\n“What awaits for those who survive is even worse,” the film’s narrator says.\n\nAfter being vaccinated, they’re shot through chutes into crates, packed like sardines into trucks, and transported all across the country to fattening farms.\n\n\n\nIf a human baby grew at the same pace as these selectively bred baby chickens, it would weigh 600 pounds in two months.\n\nMany of them can’t handle the pace at which their muscles grow. Their legs are crushed beneath their own weight and they become immobilized. They die in agony or are thrown away alive.\n\n\n\nAt just over a month old, they are sent to slaughter, where they are handled violently, breaking their legs and wings in the process.\n\nThe video ends by asking viewers to go vegan or eat less chicken. We’d like to add the options of pasture-raised chicken and eggs, backyard chickens, grass-fed and wild meats, and/or producing fewer humans.", "opengraph": {"locale": "en_US", "type": "article", "title": "Hidden Cameras at Chicken Hatchery Shed New Light on Horrors of Factory Farming", "description": "  Undercover footage of baby chickens hatching on conveyor belts, stabbed with giant needles, thrown down chutes, or deemed too weak and crushed, goes viral. The video, produced by Animal Equality, an international animal rights organization, has gone viral with 35 million views on Facebook. Animal Equality’s investigators have infiltrated industrial hatcheries, where factory-farmed chickens […]", "url": "https://returntonow.net/2016/02/27/hidden-camera-chicken-hatchery/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2016-02-27T20:12:04+00:00", "article:modified_time": "2018-02-07T15:24:48+00:00", "image": "https://returntonow.net/wp-content/uploads/2016/02/31992D7200000578-0-image-a-63_1456538034885.jpg", "image:width": "634", "image:height": "354", "image:type": "image/jpeg"}, "tags": ["Rethinking Agriculture", "Hatchery", "Chicks", "Factory Farming", "Uncategorized", "Animal Rights"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "300", "height": "150", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/x2y3vLwrF6s\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/x2y3vLwrF6s"}], "links": ["https://www.facebook.com/gary.yourofsky/videos/947308528657729/", "https://returntonow.net/2017/10/02/population-bomb/"], "authors": ["Sara Burrows"], "publish_date": "2016-02-27T20:12:04+00:00"}