{"result_id": "262002", "URL": "https://returntonow.net/2020/04/17/posting-anti-vaccine-propaganda-on-social-media-could-become-a-criminal-offense/", "timestamp": "2023-04-25 17:00:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2020/04/17/posting-anti-vaccine-propaganda-on-social-media-could-become-a-criminal-offense/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Posting Anti-Vaccine “Propaganda” on Social Media Could Become a Crime in the U.K.", "cleaned_text": "Posting “false information” about vaccines on Facebook could soon land you in jail in England\n\nIt could soon be a criminal offense to publish anything critical of vaccines in the United Kingdom.\n\n“Posting anti-vaccine propaganda on social media could become a criminal offence – even if those promoting it believe the pseudoscience,” reports The Telegraph.\n\nThe UK’s new criminal Law Commissioner Penney Lewis is considering “lowering the threshold of criminality for posting false information online that endangers lives,” she tells the British newspaper.\n\nCurrently, people are protected from prosecution if they “sincerely believe the misinformation they publish,” but under Lewis’s proposal, posting “internet health conspiracies” — such as “anti-vaccination posts and people advocating cancer patients treat themselves with the apricot extract” —would be criminal offenses.\n\nCitizens of the UK can already be prosecuted for posting “false information” — such as bomb threats — with the intent of causing “annoyance, inconvenience or needless anxiety”, but Lewis wants to prosecute no matter what the intent.\n\nEven “if their purpose is actually not to cause annoyance or anxiety, but they think they are doing the right thing by posting false information about a vaccine, for example, it is then should there be a recklessness-based fault element or even a lower [criminal] threshold?” she said in an interview with The Telegraph.\n\n“So where they’ve really not done their homework and they’ve been negligent in the way they have spread this false information or disseminated it … I think we need to look into whether there is a role [for criminal law] in relation to false health information.”\n\nLewis’s announcement comes right on the heels of an announcement by the UK’s Health Secretary that he was “looking very seriously” at making vaccinations mandatory for all public school students.\n\nThe UK’s Law Commission will also be considering whether online “glorification of self-harm” should also be made a criminal offense, Lewis said.", "opengraph": {"locale": "en_US", "type": "article", "title": "Posting Anti-Vaccine “Propaganda” on Social Media Could Become a Crime in the U.K.", "description": "Posting “false information” about vaccines on Facebook could soon land you in jail in England  It could soon be a criminal offense to publish anything critical of vaccines in the United Kingdom. “Posting anti-vaccine propaganda on social media could become a criminal offence – even if those promoting it believe the pseudoscience,” reports The Telegraph. […]", "url": "https://returntonow.net/2020/04/17/posting-anti-vaccine-propaganda-on-social-media-could-become-a-criminal-offense/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2020-04-17T09:06:46+00:00", "article:modified_time": "2020-04-17T09:11:46+00:00", "image": "https://returntonow.net/wp-content/uploads/2020/04/7D881016-200F-4C5D-97C8-8D6779DF3774.jpeg", "image:width": "1920", "image:height": "1200", "image:type": "image/jpeg"}, "tags": ["Coronavirus", "mandatory vaccines", "Uncategorized", "Vaccines", "Natural Health"], "tweets": [], "movies": [], "links": ["https://www.telegraph.co.uk/news/2020/02/01/posting-anti-vaccine-propaganda-social-media-could-become-criminal/"], "authors": ["Sara Burrows"], "publish_date": "2020-04-17T09:06:46+00:00"}