{"result_id": "262026", "URL": "https://returntonow.net/2019/03/29/swat-team-raids-home-to-rescue-aka-kidnap-toddler-with-a-fever/", "timestamp": "2023-04-25 17:00:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2019/03/29/swat-team-raids-home-to-rescue-aka-kidnap-toddler-with-a-fever/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "SWAT Team Breaks Into Family Home to \"Rescue,\" AKA Kidnap, Toddler With a Fever", "cleaned_text": "Lawmaker says CPS has gone “too far,” knocking down family’s door with guns drawn because parents didn’t take toddler with fever to the emergency room after doctor’s visit\n\n\n\n \n\n \n\n \n\n An Arizona lawmaker is calling for an investigation of child protective services, after a SWAT team kicked down a family’s door with guns drawn to remove three young children with the flu in the middle of the night.\n\nParents Sarah Beck and Brooks Bryce took their 2-year-old son to a naturopathic doctor when his fever reached 105 degrees. Because the child had not been vaccinated, the doctor feared he might have meningitis and ordered the parents to take him to the emergency room.\n\nShortly after leaving the doctor’s office Beck says her son started feeling better.\n\n“He was acting normal,” she told Inside Edition. “His temperature was 102.”\n\nSo she decided not to take him to the ER, in part because she was afraid of how they would react to him not being vaccinated, according to CNN.\n\nAfter she put her sick kids to bed later that night, she was in for a rude awakening:\n\nWhen the doctor found out they never made it to the ER, she called the Department of Children’s Services, who called the Chandler police department, who came and attempted to check on the child.\n\nFrightened, the parents did not let them in, and instead spoke to the police through windows and by phone.\n\n“As I was on the phone with the police officer, I checked his temperature. It was 100 degrees. There’s no reason for me to give up my kid because he has a temperature of 100 degrees.”\n\nLater that night, after obtaining a warrant, a SWAT team came back, kicked in the door, guns drawn, and removed the 2-year-old boy and his two sisters, age 4 and 6, who had also sick and vomiting.\n\n“It’s the type of stuff you see when there’s a hostage shootout, violent criminals, the cartel, not when a child has a fever,” the family’s attorney Nicolas Boca said.\n\n“It’s the middle of the night. The children are sleeping. They’ve already had a day where they had to go to the doctor. They wanted to rest.”\n\nState representative Kelly Townsend, who helped pass legislation requiring DCS to get a search warrant before removing children from a home in a non-emergency situation, is troubled by the video.\n\nShe never expected the legislation to be used like this, she tells ABC News.\n\n“The doctor chose to use DCS to remove the child, and DCS chose to use the police, and the police chose to use the SWAT team,” she said. “That is not the country that I recognize.”\n\n“At that point, who now owns control over the child? It seems like we’ve now given that to the doctor, and the parent no longer has a say or they risk the SWAT team taking all of the children and potentially the newborn.”\n\nThe children are now in the temporary custody of their grandparents until the matter is settled in court.", "opengraph": {"locale": "en_US", "type": "article", "title": "SWAT Team Breaks Into Family Home to \"Rescue,\" AKA Kidnap, Toddler With a Fever", "description": "Lawmaker says CPS has gone “too far,” knocking down family’s  door with guns drawn because parents didn’t take toddler with fever to the emergency room after doctor’s visit An Arizona lawmaker is calling for an investigation of child protective services, after a SWAT team kicked down a family’s door with guns drawn to remove three […]", "url": "https://returntonow.net/2019/03/29/swat-team-raids-home-to-rescue-aka-kidnap-toddler-with-a-fever/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2019-03-29T21:44:42+00:00", "article:modified_time": "2019-03-30T14:26:21+00:00", "image": "https://returntonow.net/wp-content/uploads/2019/03/SWAT-x-Fever-1.jpg", "image:width": "1000", "image:height": "563", "image:type": "image/jpeg"}, "tags": ["Uncategorized"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "400", "height": "200", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/i398OApFApw\" width=\"400\" height=\"200\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/i398OApFApw"}], "links": ["https://www-m.cnn.com/2019/03/28/us/arizona-police-toddler-with-fever/index.html?r=https%3A%2F%2Fwww.google.com%2F", "https://abc7.com/swat-team-with-guns-drawn-raids-home-for-toddler-with-fever/5220780/?fbclid=IwAR35AXhMy7wlGjY-FuzihVsj9s1UoZy6saHYMznYLEoU1DvTrg8Bgk0vNcI"], "authors": ["Sara Burrows"], "publish_date": "2019-03-29T21:44:42+00:00"}