{"result_id": "262005", "URL": "https://returntonow.net/2017/11/15/dark-side-led-lighting/", "timestamp": "2023-04-25 17:00:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2017/11/15/dark-side-led-lighting/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "The Dark Side of LED Lighting", "cleaned_text": "LED lights are ruining our eyesight and wreaking havoc on our endocrine systems, peer-reviewed studies show… Leading photobiologist recommends switching back to sunlight, candles and incandescent bulbs\n\nOne of the world’s top photobiologists has been trying to warn us about the dangers of the government-mandated phasing out of incandescent lighting for years.\n\nWhile LEDs (light-emitting diodes) are up to 95 percent more energy efficient than incandescent bulbs, we are paying for that savings with our health, he says.\n\nA physician and professor at Wismar University in Germany, Alexander Wunsch is an international consultant to governments, medical facilities and the lighting industry.\n\nHis message, though often ignored, is clear: blue light, isolated from all the other colors on the light spectrum, is damaging our retinas and disrupting our endocrine systems, resulting in all sorts of physical and mental illness.\n\nIt’s not a message the LED industry, governments looking to cut carbon emissions, or consumers saving money on electricity want to hear. But, as this Harvard Medical School report says, it is “backed up by study after study.”\n\nNatural light gives off all the colors (wavelengths) of the rainbow in a somewhat continuous manner, Wunsch explains in an interview.\n\nThis fluorescent coating transforms part of the blue light into longer wavelengths, creating a yellowish “looking” light, but most of the wavelengths emitted are still invisible blue light.\n\nBlue light is high-energy, short-wave length “aggressive” light, responsible for keeping us awake and alert.\n\nWhile present in sunlight, and a necessary ingredient for life, blue light needs to be balanced by all other colors of light, particularly its opposite color of light – red.\n\nAs you can see below, red light is absent in traditional fluorescent and LED lights:\n\nWunsch says most of us are severely deficient in near-infrared light, which has a wavelength of between 700 and 2500 nanometers.\n\nThe heat generated by incandescent light bulbs is infrared radiation. While this heat requires more electricity, the red light it generates is actually beneficial to your health, and therefore worth the extra cost, in Wunsch’s opinion.\n\nNear-infrared light – like that generated by a candle or fire – primes the cells in your retina for rest, repair and regeneration, which is why Wunsch uses it as a therapy on his patients.\n\nNear-infrared is also a crucial energy source for humans. According to Wunsch, only about one-third of our bodies’ thermodynamic energy comes from food. A much larger portion comes from “photonic energy” from the sun.\n\nThe more near-infrared radiation we get, the less food is required for maintaining thermal homeostasis (body temperature), he says.\n\n \n\n \n\n \n\n\n\nLED lighting is one of the largest sources of non-native electromagnetic radiation we are exposed to on a daily basis.\n\nIn addition to lighting our houses, office buildings, schools, stores and streets, LEDs have become the dominant technology for back-lighted tablet displays, such as ipads, iphones and e-readers, and LCD TVs.\n\nVirtually all reading these days involves staring directly at LEDs.\n\nMany optometrists have spoken out about the damage this is doing to our eyes, one estimating 100,000 Americans will become legally blind due to blue-light damage over the next decade.\n\nA recent study published in the peer-reviewed journal Molecular Vision says prolonged exposure to blue light with a wavelength between 400–470 nanometers can “induce severe damage to the retina.”\n\nEven brief periods of exposure to blue light in this range can damage the retinal pigment epithelium. Damaged RPE eventually leads to photoreceptor cell death,” the study says. If enough photoreceptor cells die, total blindness can occur.\n\nIn addition to damaging our eyesight, blue light after sunset disrupts our endocrine system.\n\n“Study after study has linked working the night shift and exposure to light at night to several types of cancer (including breast and prostate), diabetes, heart disease, and obesity, says an article published by Harvard Medical School.\n\nThese diseases may be related to the fact that light suppresses melatonin, a hormone that influences circadian rhythms, the article says:\n\n“While light of any kind can suppress the secretion of melatonin, blue light does so more powerfully. Harvard researchers and their colleagues conducted an experiment comparing the effects of 6.5 hours of exposure to blue light to exposure to green light of comparable brightness. The blue light suppressed melatonin for about twice as long as the green light and shifted circadian rhythms by twice as much (3 hours vs. 1.5 hours).”\n\nIn addition to suppressing melatonin, Dr. Wunsch says excessive exposure to blue light creates “oxidative stress” that damages lipids, proteins and DNA and is linked to a myriad of pathologies.\n\nWhat to Do\n\nWhile cool LED bulbs emit more blue light than warm LED bulbs, the label “warm” can be deceptive. They give out a warmer “looking” light because the blue light is masked with a yellow or orange filter, but they do not emit a red wavelength. When buying bulbs, look at their CRI or color rendering index, Wunsch says. Sunlight, which is the gold standard, has a CRI of 100. So do incandescent bulbs and candles. If you must buy LED bulbs, look for a CRI of 97, which is the closest they come to natural light. LEDs are the most dangerous at night, Wunsch says, as there is no counterbalancing red light. The biological risks of artificial light are somewhat mitigated if you have plenty of sunlight streaming through windows, but if that’s the case, why have lights on at all? Wunsch says being in darkness after sunset is optimal. Candle light is enough for orientation, he says, but if we must do activities that require more light, he highly recommends getting our hands on incandescent bulbs. While you won’t find them at most department stores, you can still buy “vintage” incandescent bulbs on Amazon. Just make sure they are crystal clear, not coated, so as not to block the beneficial red light:\n\n \n\n For a more energy-efficient incandescent light, you can buy low-voltage halogen bulbs Just make sure you operate halogen on DC rather than AC to prevent electrosmog, Munsch says. And, if you must be exposed to blue light after dark, definitely wear blue-light blocking glasses:", "opengraph": {"locale": "en_US", "type": "article", "title": "The Dark Side of LED Lighting", "description": "LED lights are ruining our eyesight and wreaking havoc on our endocrine systems, peer-reviewed studies show… Leading photobiologist recommends switching back to sunlight, candles and incandescent bulbs One of the world’s top photobiologists has been trying to warn us about the dangers of the government-mandated phasing out of incandescent lighting for years. While LEDs (light-emitting […]", "url": "https://returntonow.net/2017/11/15/dark-side-led-lighting/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2017-11-15T18:56:25+00:00", "article:modified_time": "2023-03-12T15:45:34+00:00", "image": "https://returntonow.net/wp-content/uploads/2017/11/bulb.jpg", "image:width": "640", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["LED lights", "Melatonin", "Circadian Rhythm", "Uncategorized", "Blue Light", "Blindness", "EMF radiation", "Natural Health"], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Phase-out_of_incandescent_light_bulbs", "https://www.health.harvard.edu/staying-healthy/blue-light-has-a-dark-side", "https://articles.mercola.com/sites/articles/archive/2016/10/23/near-infrared-led-lighting.aspx", "https://en.wikipedia.org/wiki/Light-emitting_diode#White_LEDs_and_the_illumination_breakthrough", "https://returntonow.net/2017/10/10/shoud-never-stare-screen-without-weird-looking-yellow-glasses/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4734149/", "https://en.wikipedia.org/wiki/Retinal_pigment_epithelium", "https://en.wikipedia.org/wiki/Photoreceptor_cell", "https://en.wikipedia.org/wiki/Retinal_degeneration_(rhodopsin_mutation)", "https://www.health.harvard.edu/staying-healthy/blue-light-has-a-dark-side", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4055301/", "https://en.wikipedia.org/wiki/Color_rendering_index", "https://www.amazon.com/gp/offer-listing/B01HEDN8N6/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B01HEDN8N6&linkCode=am2&tag=returntonow-20&linkId=1f6d8c8c63d1e54aceacf701503684b9", "https://www.amazon.com/gp/offer-listing/B01HEDN8N6/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B01HEDN8N6&linkCode=am2&tag=returntonow-20&linkId=1f6d8c8c63d1e54aceacf701503684b9", "https://www.amazon.com/gp/product/B01HEDN8N6/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B01HEDN8N6&linkCode=as2&tag=returntonow-20&linkId=5d87fc7530f1adeba93c990e01bf1670", "https://www.amazon.com/gp/offer-listing/B00BCHYUM4/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B00BCHYUM4&linkCode=am2&tag=returntonow-20&linkId=75716a5621a07d63cfcb53ff4b5aa6fc", "https://www.amazon.com/gp/product/B00BCHYUM4/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B00BCHYUM4&linkCode=as2&tag=returntonow-20&linkId=8044531da67a65c82c4e34946799f856", "http://www.nbcnews.com/id/34509513/ns/health-cancer/t/electrosmog-harming-our-health/", "https://www.amazon.com/gp/offer-listing/B01AHK7LMW/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B01AHK7LMW&linkCode=am2&tag=returntonow-20&linkId=2db6be4bd46e65fbea94f48aa690bfce", "https://www.amazon.com/gp/product/B01AHK7LMW/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B01AHK7LMW&linkCode=as2&tag=returntonow-20&linkId=8a2e5e93f96e7dda5e75b7d86e60282b", "https://returntonow.net/category/uncategorized/", "https://returntonow.net/tag/blindness/", "https://returntonow.net/tag/blue-light/", "https://returntonow.net/tag/circadian-rhythm/", "https://returntonow.net/tag/emf-radiation/", "https://returntonow.net/tag/led-lights/", "https://returntonow.net/tag/melatonin/", "https://returntonow.net/tag/natural-health/", "https://returntonow.net", "https://wordpress.org"], "authors": ["Sara Burrows"], "publish_date": "2017-11-15T18:56:25+00:00"}