{"result_id": "262037", "URL": "https://returntonow.net/2022/01/28/truckers-raise-7-million-on-gofundme-to-organize-50000-truck-freedom-convoy-to-u-s-canadian-border/", "timestamp": "2023-04-25 17:00:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2022/01/28/truckers-raise-7-million-on-gofundme-to-organize-50000-truck-freedom-convoy-to-u-s-canadian-border/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Truckers Raise $7 Million to Organize a 50,000-Truck \"Freedom Convoy\" to U.S.-Canadian Border", "cleaned_text": "Tens of thousands of Canadian and American truckers are on their way to the border to form the largest “truck stop” in history until their demands for health freedom are met. Grocery shelves might be sparse for a while, but rest assured it’s for a good cause!\n\nBiden and Trudeau told them they couldn’t cross the border without a vaccine passport, so tens of thousands of truckers are on their way to the border to form the largest “truck stop” in history. And they say they won’t budge until their demands for health freedom are met… so grocery shelves might be sparse for a while, but rest assured it’s for a good cause!\n\nAccording to Google Maps, the traffic jam caused by the convoy was 60 miles long yesterday. Organizers, who have collected $7 million on GoFundMe to reimburse truckers for travel expenses, estimate 50,000 semi-trucks are participating.\n\nThe big rigs are on their way to camp out in Ottawa and other U.S.-Canadian border check points until Trudeau and Biden drop the vaccine mandates, which went into effect January 15 for truckers to enter Canada and January 22 for truckers to enter the United States.\n\nThousands of supporters wait at truck stops along the way to cheer them on, as they honk their horns and flash their lights, slowly trudging on through ice and snow, playing songs like “we’re not going to take it… no, we ain’t going to take it… we’re not going to take it anymore!”\n\nEven Canadian farmers are forming a smaller tractor convoy in support of the trucker convoy!\n\nHundreds of citizen journalists are documenting the freedom convoy and posting it to independent media outlets like Bitchute and Rumble to prove how large it is in spite of the mainstream media’s denial.\n\nAn estimated 12,000 American truckers are on their way to meet the Canadian truckers in Ottawa tomorrow, January 29.\n\nIt’s hard to see them all from the ground level without filming for an hour, but here’s some aerial footage of the trucks gathering at a rest stop with flashing lights.\n\nOrganized by grassroots groups Freedom Fighter Nation and Canada Unity, volunteers from around the country are pointing truckers along the right routes, while truckers keep each other updated about any obstacles on two-way radios (channel 1 for Canadian truckers, and channel 19 for American truckers).\n\nA GoFundMe for the freedom fighting convoy is rapidly gaming steam, increasing from $6 million to $7 million in the last 24 hours. The funds will be used to front or reimburse truckers for gas, food and any accommodations they might need on their transcontinental journeys (some are coming all the way from Brazil!). The money will also cover the cost of large signage and flags affixed to many of the trucks.\n\nPlease support our independent journalism by buying two of the most important books of our time through the links below:", "opengraph": {"locale": "en_US", "type": "article", "title": "Truckers Raise $7 Million to Organize a 50,000-Truck \"Freedom Convoy\" to U.S.-Canadian Border", "description": "Tens of thousands of Canadian and American truckers are on their way to the border to form the largest “truck stop” in history until their demands for health freedom are met. Grocery shelves might be sparse for a while, but rest assured it’s for a good cause! Biden and Trudeau told them they couldn’t cross […]", "url": "https://returntonow.net/2022/01/28/truckers-raise-7-million-on-gofundme-to-organize-50000-truck-freedom-convoy-to-u-s-canadian-border/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2022-01-28T15:30:13+00:00", "article:modified_time": "2022-01-28T18:23:07+00:00", "image": "https://returntonow.net/wp-content/uploads/2022/01/external-content.duckduckgo.com_-1.jpg", "image:width": "1024", "image:height": "544", "image:type": "image/jpeg"}, "tags": ["Uncategorized"], "tweets": [], "movies": [], "links": ["https://canada-unity.com/bearhug/", "https://www.gofundme.com/f/taking-back-our-freedom-convoy-2022?utm_source=widget&utm_medium=referral&utm_campaign=p_cp+share-sheet", "https://www.facebook.com/permalink.php?story_fbid=110053964919379&id=100286905896085", "https://www.bitchute.com/video/nPxKSvdLpZ4n/", "https://www.bitchute.com/video/xN9JvXMPRVUq/", "https://www.bitchute.com/video/EJuRQVvKwhHm/", "https://www.bitchute.com/video/lF3arT7BP8UK/", "https://www.bitchute.com/search/?query=trucker%20convoy%20&kind=video", "https://www.bitchute.com/video/A36NYa0vrujm/", "https://www.bitchute.com/video/ZfULGhWdgOOz/", "https://www.bitchute.com/video/y96BhCR6nUJV/", "https://www.bitchute.com/video/L0hNHu9NGShP/", "https://www.bitchute.com/video/kZKDfxAtNK85/", "https://freedomfighternation.org/freedom-convoy/", "https://canada-unity.com/bearhug/", "https://www.gofundme.com/f/taking-back-our-freedom-convoy-2022?utm_source=widget&utm_medium=referral&utm_campaign=p_cp+share-sheet"], "authors": ["Sara Burrows"], "publish_date": "2022-01-28T15:30:13+00:00"}