{"result_id": "262040", "URL": "https://returntonow.net/2016/11/14/cribs-cause-brain-damage/", "timestamp": "2023-04-25 17:00:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2016/11/14/cribs-cause-brain-damage/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Parents Should Sleep With Babies At Least 3 Years for Optimal Brain Development, Pediatrician Says", "cleaned_text": "Babies who co-sleep in cribs have bigger brains and more secure attachment, neuroscientist says\n\nLike all mammals, humans have been sleeping with their babies for millions of years. Babies have an innate desire to stay in constant contact with their caregivers for survival.\n\nIn most of the world, it’s still the norm for children to sleep with their parents and/or grandparents all the way up until adolescence.\n\nBut in the Western world, parents are encouraged by doctors to let their babies “cry it out” in their cribs at as young as 2-months.\n\nBut Dr. Nils Bergman, a specialist in perinatal neuroscience and founder of the Kangaroo Mother Care movement, says being separated from their mothers all night is extremely stressful for babies and young children and stunts their brain development.\n\nEven after babies have “cried it out” and appear to be sleeping through the night, they are not getting restful sleep, which is essential for brain development.\n\nBergman monitored 16 infants while they slept on their mother’s chest and while they slept in a cot by her bed. Their heart rate and irregular breathing revealed they were in three times as much stress when they slept alone.\n\nA baby is able to respond in a healthy way to short periods of stress, says Bergman’s website:\n\nThe stress can be quite severe, but if mother is there all the time to comfort and soothe, there is no harm to the baby’s brain. This is called “tolerable stress.”\n\nThen there is “toxic stress.” High levels of stress hormones for long periods of time are toxic to the neurons that make the brain work. The stress hormone cortisol makes more neurons die off at a faster rate. This disrupts and disturbs developing pathways and circuits. With prolonged stress after birth, the brain is measurably smaller one year later.\n\nThe only difference between toxic and tolerable stress is the absence or presence of mother or father.\n\nWhen babies are separated from their mothers for a noticeable period of time, they interpret it as a state of emergency, Bergman says. Their heart rate and blood pressure increases and they wave their arms and legs and cry to get their mom’s attention. This uses a lot of energy which the baby should be using to grow.\n\nBabies separated by only one meter from their mothers, in a crib at the bottom of the bed, showed double the levels of cortisol. Stress hormones cause wear and tear over time, damaging cells and organs.\n\n“But more ominous is that the baby feels abandoned, and feels that he must learn to fend for himself,” Bergman says. The baby’s brain wires the ‘avoid’ pathways as no one is meeting his needs.”\n\n“If the baby’s protest signals are not heeded, the baby may go into an energy-conserving defense mode which lowers heart rate and temperature for prolonged survival,” Bergman’s wife Jill Bergman writes for an article published in Breastfeeding Today. “This state of ‘freeze’ may look like the baby is asleep, but recent neuroscience research has shown that baby can be firing avoidance pathways in the brain. A final stage of defense is called dissociation in which the baby essentially tunes out. The brain of the baby is wiring emotional pathways, adapting to cope with ‘a dangerous world, where nobody loves me.’”\n\nA Psychology Today article argues that letting babies cry in cribs damages neuronal interconnections – or synapses – and makes them less intelligent, less heathy, more anxious, uncooperative and more alienated later in life.\n\nThe modern Western recommendations for sleep training, crying-it-out and self-soothing come from the also Western idea that children need to be taught independence. “But forcing independence on a baby leads to greater dependence,” says professor of psychology Darcia Narvaez.\n\nIn small-band hunter-gatherer societies, parents attended to every need of babies and young children immediately. As a result toddlers felt confident and competent enough to walk into the bush on their own, Narvaez pointed out.\n\nShe also pointed to a study of rats with high and low nurturing mothers – “There is a critical period for turning on genes that control anxiety for the rest of life. If for the first 10 days of life you have a low nurturing rat mother (the equivalent of the first 6 months of life in a human), the gene never gets turned on and the rat is anxious toward new situations for the rest of its life, unless drugs are administered to alleviate the anxiety.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Parents Should Sleep With Babies At Least 3 Years for Optimal Brain Development, Pediatrician Says", "description": "Babies who co-sleep in cribs have bigger brains and more secure attachment, neuroscientist says  Like all mammals, humans have been sleeping with their babies for millions of years. Babies have an innate desire to stay in constant contact with their caregivers for survival. In most of the world, it’s still the norm for children to […]", "url": "https://returntonow.net/2016/11/14/cribs-cause-brain-damage/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2016-11-14T19:51:08+00:00", "article:modified_time": "2019-07-20T16:59:16+00:00", "image": "https://returntonow.net/wp-content/uploads/2016/11/co-sleeping-425ce-1-1.jpg", "image:width": "700", "image:height": "445", "image:type": "image/jpeg"}, "tags": ["Brain Development", "Uncategorized", "Natural Parenting", "Cosleeping", "Natural Health", "Attachment Parenting"], "tweets": [], "movies": [], "links": ["https://returntonow.net/2016/05/13/mammals-safely-co-sleeping/", "http://www.naturalchild.org/james_mckenna/cosleeping_world.html", "http://www.today.com/parents/sleep-training-2-months-cry-it-out-recommendation-raises-eyebrows-t90251", "http://www.skintoskincontact.com/abstract-morgan.aspx", "https://en.wikipedia.org/wiki/Autonomic_nervous_system", "http://www.kangaroomothercare.com/separation-stress.aspx", "https://www.amazon.com/gp/product/192041133X/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=192041133X&linkCode=as2&tag=returntonow-20&linkId=cf97ca23dcb6b4f7531898bcfe8977e4", "http://www.kangaroomothercare.com/jill-articles.aspx", "https://www.psychologytoday.com/blog/moral-landscapes/201112/dangers-crying-it-out"], "authors": ["Sara Burrows"], "publish_date": "2016-11-14T19:51:08+00:00"}