{"result_id": "262013", "URL": "https://returntonow.net/2017/10/05/baby-foreskins-sold-vaccine-companies-injected-back-babies/", "timestamp": "2023-04-25 17:00:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2017/10/05/baby-foreskins-sold-vaccine-companies-injected-back-babies/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "BREAKING: Baby Foreskins Secretly Sold to Vaccine Companies For Decades, Foreskin Cells Now Injected Back into Babies", "cleaned_text": "In case you needed another reason to not vaccinate your child, but it could save another child from being brutally tortured.\n\nWhile the danger and ineffectiveness of vaccines already has a growing number of parents opting out, now they have another reason to avoid shooting their children up with pathogens and toxins.\n\nBy vaccinating your child, you are propping up the circumcision industry. Even creepier, soon you could be injecting your child with another child’s foreskin cells.\n\nHidden in the fine print of circumcision consent forms, is a line allowing the protective covering of the baby’s penis to be sold for medical research.\n\nFor this reason foreskins have been secretly sold to vaccine companies for research and development for decades.\n\nAccording to VacTruth.com, certain microorganisms used by vaccine companies need living human cells to replicate. Foreskin cells can be used to turn a microorganism found in nature into a genetically modified microorganism for use in vaccines.\n\nBaby foreskin cells are used for research in some vaccines like rubella, varicella and human papillomavirus (HPV), and will soon be one of the ingredients in at least one vaccine.\n\nThe cytomegalovirus vaccine, which pharmaceutical companies have been working on for decades, is made with foreskin cells. The DNA of the child who the foreskin was stolen from cannot be fully removed from the vaccines prior to administration. Cytomegalovirus vaccine clinical trials have already begun.\n\nForeskin stem cells are also being used in immunotherapy research.\n\nThese companies prefer baby foreskin over adult foreskin because baby cells survive longer.\n\nClick here for a more detailed and graphic description of how foreskin cells are used in vaccines.\n\n\n\n \n\n \n\n \n\n With over 10 million vaccines administered annually, this creates a huge market for foreskin, giving the medical industry more incentive to mutilate baby penises.\n\nBetween the surgery and the foreskin’s resale value, each foreskin is worth approximately $100,000.\n\nIn the most common circumcision procedure, the foreskin is sliced open vertically, ripped away from the glans (head), sliced around the circumference of the penis about halfway down the shaft, and then removed.\n\nIt’s extremely painful, and, since babies can’t receive general anesthesia, it’s done while they’re wide awake. It removes at least half of the penile skin tissue along with tens of thousands of nerve endings, diminishing sexual pleasure later in life.\n\nThe psychological trauma of circumcision is also severe. A baby who might appear to be “sleeping” after his operation is actually in a shock-induced semi-coma that can last for days or even weeks. The semi-coma is the body’s last resort to protect itself against death from the rush of cortisol and central nervous system overload.\n\nCanadian researchers found circumcision caused “significant trauma” and brain damage after examining the brain of a baby boy before and after the surgery using Magnetic Resonance Imaging (MRI) and Positron Emission Tomography (PET). The event severely altered the boy’s limbic system — responsible for motivation, emotion, learning, and memory — and the amygdala, which is the emotion center of the brain.\n\nFollow-up examinations were conducted the next day, the next week and the next month. The research team concluded the changes to the brain were likely permanent.\n\nIf physical pain and emotional turmoil aren’t enough, one baby dies every other day because of trauma, blood loss, infection or – possibly most the heartbreaking – their little lungs bursting from crying. Please get the word out and stop the abuse.", "opengraph": {"locale": "en_US", "type": "article", "title": "BREAKING: Baby Foreskins Secretly Sold to Vaccine Companies For Decades, Foreskin Cells Now Injected Back into Babies", "description": "In case you needed another reason to not vaccinate your child, but it could save another child from being brutally tortured. While the danger and ineffectiveness of vaccines already has a growing number of parents opting out, now they have another reason to avoid shooting their children up with pathogens and toxins. By vaccinating your […]", "url": "https://returntonow.net/2017/10/05/baby-foreskins-sold-vaccine-companies-injected-back-babies/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2017-10-05T15:40:15+00:00", "article:modified_time": "2017-10-06T00:06:57+00:00", "image": "http://returntonow.net/wp-content/uploads/2017/10/vaccineintro_1280x720_0-1024x576.jpg"}, "tags": ["Natural Living", "Vaccines", "Uncategorized", "Natural Parenting", "Circumcision", "Natural Health"], "tweets": [], "movies": [], "links": ["https://returntonow.net/2016/03/02/circumcision-is-child-abuse-and-torture/", "https://returntonow.net/2016/03/31/the-most-important-decision-parents-will-ever-make/", "https://vactruth.com/2017/09/28/foreskin-used-in-vaccines/", "https://vactruth.com/2017/09/28/foreskin-used-in-vaccines/", "https://thetyee.ca/News/2006/07/25/Circumcision/", "http://www.cirp.org/library/birth/emde/", "https://www.naturalnews.com/2017-10-04-medical-shocker-baby-foreskin-from-circumcisions-being-used-to-manufacture-vaccines-that-are-injected-into-other-babies.html"], "authors": ["Bradley Jordan"], "publish_date": "2017-10-05T15:40:15+00:00"}