{"result_id": "262033", "URL": "https://returntonow.net/2022/02/09/military-tells-ottawa-to-find-someone-else-to-evict-the-truckers/", "timestamp": "2023-04-25 17:00:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2022/02/09/military-tells-ottawa-to-find-someone-else-to-evict-the-truckers/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Military Tells Ottawa to Find Someone Else to Evict the Truckers", "cleaned_text": "Canadian Defense Minister says the military “has no plans to get involved” after Ottawa police ask for help breaking up the freedom convoy occupying the country’s capital city.\n\n\n\n \n\n \n\n \n\n The Canadian military is refusing to help the country’s capitol police remove the thousands of semi trucks and millions of protestors, who’ve been occupying the streets of Ottawa for over a week.\n\nThere are simply too many to arrest and jail and tow for the Ottawa police, and not enough support within the military to start a civil war against Canadian citizens.\n\n“The Canadian Armed Forces are not involved in law enforcement in this situation, and there are no plans for such CAF involvement,” Defense Minister Anita Anand’s press secretary told Canadian correspondent for the Wall Street Journal Paul Vieria yesterday.\n\nThe statement was made in response to comments by Ottawa’s police chief that he may need to ask for the military’s help in evicting the truckers and their fans, who dance and party in the streets all night.\n\n“Ottawa police Chief Peter Sloly said all options to bring the protest to an end are on the table, including the ‘extremely rare’ step of bringing in the Canadian Armed Forces,” the Toronto Star reported.\n\n“While that decision would carry significant risks, Sloly said all options to end the protests — from negotiation to enforcement — could lead to riots, injuries and deaths.”\n\nMeanwhile, the Freedom Trucker Convoy’s new GiveSendGo crowdfunding account is on its way to $8 million on its 4th day, after GoFundMe closed their $10 million account.\n\nThe freedom truckers may be too big to fail! Presidents Trudeau and Biden may have no choice but to drop the mandates (in this case, the mandate that truckers show a vaccine passport to cross the U.S. Canadian border) and back off the CoVid tyranny altogether.\n\nThe writers and publishers of ReturnToNow.net have started a GiveSendGo fundraiser of our own, to help us survive Facebook’s shadow-censorship and save our Garden of Eden Food Forest. Please donate even a dollar if you can, or share our campaign, to help us rebuild our audience on another social media platform and continue to bring you real news <3", "opengraph": {"locale": "en_US", "type": "article", "title": "Military Tells Ottawa to Find Someone Else to Evict the Truckers", "description": "Canadian Defense Minister says the military “has no plans to get involved” after Ottawa police ask for help breaking up the freedom convoy occupying the country’s capital city. The Canadian military is refusing to help the country’s capitol police remove the thousands of semi trucks and millions of protestors, who’ve been occupying the streets of […]", "url": "https://returntonow.net/2022/02/09/military-tells-ottawa-to-find-someone-else-to-evict-the-truckers/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2022-02-09T16:55:04+00:00", "article:modified_time": "2022-02-09T17:02:01+00:00", "image": "https://returntonow.net/wp-content/uploads/2022/02/x.jpg", "image:width": "1024", "image:height": "576", "image:type": "image/jpeg"}, "tags": ["Uncategorized"], "tweets": [], "movies": [], "links": ["https://twitter.com/paulvieira/status/1489061536287105037", "https://www.thestar.com/politics/federal/2022/02/02/ottawa-police-may-seek-military-assistance-as-freedom-convoy-protesters-dig-in.html", "https://www.givesendgo.com/FreedomConvoy2022", "https://twitter.com/paulvieira/status/1489061536287105037", "https://givesendgo.com/gardenofedenfoodforest", "https://www.facebook.com/gardenofedenfoodforest"], "authors": ["Sara Burrows"], "publish_date": "2022-02-09T16:55:04+00:00"}