{"result_id": "262039", "URL": "https://returntonow.net/2016/05/13/mammals-safely-co-sleeping/", "timestamp": "2023-04-25 17:00:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2016/05/13/mammals-safely-co-sleeping/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "Beautiful Photos of Mammals Safely \"Co-Sleeping\" with Their Babies, As We've Done for Millions of Years", "cleaned_text": "The term “co-sleeping” has always seemed strange to me. It implies parents are doing something special or out-of-the-ordinary by doing what mammals have always done for millions of years – sleep with their babies.\n\n“Are you going to co-sleep?” people asked when I was pregnant. “What kind of co-sleeper are you going to buy?”\n\nAt first, I had no idea what they were talking about. Then I became aware of the vast market of overpriced baskets parents could buy to ensure they didn’t “roll over and kill their babies:”\n\nCo-sleepers, apparently, were the “humane” alternative to cribs for newborns. They enabled mothers to keep their brand new babies close, but not too close.\n\n“Hmm, that seems like a good idea,” I thought, during my baby-shower-wishlist frenzy, but luckily no one wasted their money.\n\nLooking back, the idea of babies sleeping in cribs or co-sleepers seems absurd.\n\nI had a crib – only because it matched the changing table and dresser – but it quickly became a laundry basket. I thought maybe I’d use it now and then for naps, but that never happened.\n\nWhy would I? My baby was 100-percent breastfed and slept best pressed up against me. To this day, at age 6, she sleeps that way. If her father and I roll away, she gravitates to whichever of us is closer, until she’s snuggled up against someone’s warm body.\n\nI never once feared rolling over on her – our bodies were too in tune. One of us couldn’t wake without the other waking, and neither of us could sleep without the constant contact we evolved to crave from one another :\n\nThere are dozens of scientific studies suggesting “co-sleeping” — like breastfeeding — is best for baby and mother, and I’ll link to a few of them here, here and here, but how many studies do we need to prove what our instincts make so obvious?\n\n\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n This is not natural:", "opengraph": {"locale": "en_US", "type": "article", "title": "Beautiful Photos of Mammals Safely \"Co-Sleeping\" with Their Babies, As We've Done for Millions of Years", "description": "The term “co-sleeping” has always seemed strange to me. It implies parents are doing something special or out-of-the-ordinary by doing what mammals have always done for millions of years – sleep with their babies. “Are you going to co-sleep?” people asked when I was pregnant. “What kind of co-sleeper are you going to buy?” At […]", "url": "https://returntonow.net/2016/05/13/mammals-safely-co-sleeping/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2016-05-13T20:11:57+00:00", "article:modified_time": "2018-02-11T19:31:01+00:00", "image": "https://returntonow.net/wp-content/uploads/2016/05/orangutan-baby.jpg", "image:width": "620", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["Natural Health", "Uncategorized", "Natural Parenting"], "tweets": [], "movies": [], "links": ["http://www.amazon.com/gp/product/0201050714/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0201050714&linkCode=as2&tag=returntonow-20&linkId=P672F2Y2BTZW4V6S", "http://www.telegraph.co.uk/news/health/children/8854674/Babies-should-sleep-in-mothers-bed-until-age-three.html", "http://www.naturalchild.org/guest/tami_breazeale.html", "https://neuroanthropology.net/2008/12/21/cosleeping-and-biological-imperatives-why-human-babies-do-not-and-should-not-sleep-alone/", "http://www.amazon.com/gp/product/0201050714/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0201050714&linkCode=as2&tag=returntonow-20&linkId=HVTDFVXFQ63SYFBJ", "https://returntonow.net/2016/11/14/cribs-cause-brain-damage/"], "authors": ["Sara Burrows"], "publish_date": "2016-05-13T20:11:57+00:00"}