{"result_id": "262025", "URL": "https://returntonow.net/2020/09/03/largest-crowd-in-german-history-rises-up-against-bill-gates-and-big-pharma/", "timestamp": "2023-04-25 17:00:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://returntonow.net/2020/09/03/largest-crowd-in-german-history-rises-up-against-bill-gates-and-big-pharma/", "encoding": "UTF-8"}, "image": null, "domain": "returntonow.net", "title": "'Largest Crowd in German History' Rises Up Against Bill Gates and Big Pharma", "cleaned_text": "Robert F. Kennedy Jr. spoke to an enormous crowd of “plandemic” protestors in Berlin on Saturday.\n\nIn his speech, Kennedy mentioned a million protestors (he may have been referring to the global total, who were gathered in at least 25 cities around the world. The BBC reported 38,000 in Berlin.\n\nThe crowd took over the streets signs reading “masks are muzzles,” “stop corona-madness” and “new normal = new fascism.”\n\nKennedy said that “the corrupt American mainstream media” were telling people he came to Berlin “to speak to about five thousand Nazis.”\n\n“But I look at this crowd and I see the opposite of Nazism. I see people of democracy. People who want open government …\n\nWe want health officials who don’t have financial entanglements with the pharmaceutical industry, who are working for us, not Big Pharma.”\n\n“We found out when we started fighting the pharmaceutical companies that they had a lot of people on their team. They had the Telecom companies, who were trying to put in 5g. They had Google on their side – and Google is a vaccine company. Google makes vaccines – it makes flu vaccines and Covid vaccines.\n\nWe were wondering why is Google censoring us? Why won’t Google let us put any truth about the pharmaceutical industry. Facebook began censoring us. Instagram. Vimeo. Youtube.”\n\nThese are all international companies.\n\nThey want to use this pandemic to inspire us with fear so we will accept control and obedience.\n\nFor 15 years, I have not been able to go on television in the United States. The TV stations won’t let me, because their revenues come from the pharmaceutical companies.\n\nOut of 22 ads during the evening news station, 17 are paid for by pharma. Anderson Cooper works for Merck… All of the news anchors that call themselves journalists are actually pharmaceutical reps.”", "opengraph": {"locale": "en_US", "type": "article", "title": "'Largest Crowd in German History' Rises Up Against Bill Gates and Big Pharma", "description": "Forty thousand gather in Berlin to protest tyrannical, economy-destroying coronavirus restrictions. Robert F. Kennedy Jr. spoke to an enormous crowd of “plandemic” protestors in Berlin on Saturday. In his speech, Kennedy mentioned a million protestors (he may have been referring to the global total, who were gathered in at least 25 cities around the world. […]", "url": "https://returntonow.net/2020/09/03/largest-crowd-in-german-history-rises-up-against-bill-gates-and-big-pharma/", "site_name": "Return to Now", "article:publisher": "https://www.facebook.com/returntonow.net/", "article:published_time": "2020-09-03T14:29:09+00:00", "article:modified_time": "2020-09-03T14:43:20+00:00", "image": "https://returntonow.net/wp-content/uploads/2020/09/p08q0h4c.jpg", "image:width": "720", "image:height": "405", "image:type": "image/jpeg"}, "tags": ["Uncategorized"], "tweets": [], "movies": [], "links": ["https://newspunch.com/biggest-crowd-in-german-history-rises-up-against-bill-gates-and-big-pharma-in-berlin/?fbclid=IwAR2_o59RtvLY0c6GCO1gEUztpKxIFqpFkdLl9Lgvf1trNLBZE6b_gVu7xLw", "https://www.bbc.com/news/world-europe-53959552"], "authors": ["Sara Burrows"], "publish_date": "2020-09-03T14:29:09+00:00"}