{"result_id": "263009", "URL": "http://revolutionradio.org/2020/12/05/5-ways-americans-could-be-encouraged-to-get-a-covid-vaccine/", "timestamp": "2023-04-25 17:01:03 CEST+0200", "meta": {"description": "by Daisy Luther\r\nTheOrganicPrepper.com\r\nDecember 5, 2020\r\n\r\nAs Pfizer and Moderna both rush a vaccine to market to fight the Covid-19 virus, will promises ...", "lang": "en", "keywords": ",", "favicon": "http://revolutionradio.org/wp-content/uploads/2017/07/cropped-RR-favicon-32x32.jpg", "canonical": "http://revolutionradio.org/2020/12/05/5-ways-americans-could-be-encouraged-to-get-a-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "revolutionradio.org", "title": "5 Ways Americans Could Be “Encouraged” to Get a Covid Vaccine", "cleaned_text": "As Pfizer and Moderna both rush a vaccine to market to fight the Covid-19 virus, will promises of returning to “normal” be enough to persuade people to take the quickly developed injection?\n\nThis article isn’t about persuading you one way or the other about whether you should be vaccinated. That is a matter for you, your family, and your physician to discuss. It’s about the opinions of Americans, the legalities of mandating cooperation, what we know about the vaccine, and the tactics that could be used to “encourage” your cooperation.\n\nIt’s expected that the new coronavirus vaccines will be approved any day now. Each vaccine is said to require two shots to confer immunity to the virus. Pfizer requires two doses three weeks apart, and Moderna requires two doses four weeks apart.\n\nAbout half of Americans are eager to be vaccinated.\n\nAccording to a poll conducted by Pew Research, 51% of American adults would immediately get a vaccine if it were available. That, of course, means that nearly half of all American adults aren’t convinced this is something that they want to do right now. This number has decreased from the first time the poll was taken. Back in May, 72% of American adults were on board with rolling up their sleeves as soon as possible.\n\nOf course, this poll assumes that people will have a choice whether or not to be inoculated.\n\nWhile half of the people surveyed want the injection, the other half do not. And that’s where the controversy lies – should we have a choice what medical treatments we undergo? Dr. Ron Paul spoke to The Huffington Post back in 2008 and said something as meaningful today as it was a dozen years ago.\n\n“If we accept this notion that the federal government is going to dictate what we can put into our bodies, then it leads to the next step: that the government is going to regulate everything that is supposedly good for us. That’s where they are. They have an FDA that won’t allow somebody who’s dying to use an experimental drug which might speed up the process of finding out which drugs are good and which drugs are bad and the federal government comes in and dictates that they want complete control over vitamins and nutritional products and I just think the whole principal of government telling us what we can take in or not take in is just a dangerous position to take… it’s related to the drug industry because they’d like to control all of this.” (source)\n\nThis entry was posted on Saturday, December 5th, 2020 at 4:34 pm and is filed under Civil Unrest, Health. You can follow any responses to this entry through the RSS 2.0 feed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://Of course, this poll assumes that people will have a choice whether or not to be inoculated.  While half of the people surveyed want the injection, the other half do not. And that’s where the controversy lies – should we have a choice what medical treatments we undergo? Dr. Ron Paul spoke to The Huffington Post back in 2008 and said something as meaningful today as it was a dozen years ago.  “If we accept this notion that the federal government is going to dictate what we can put into our bodies, then it leads to the next step: that the government is going to regulate everything that is supposedly good for us. That’s where they are. They have an FDA that won’t allow somebody who’s dying to use an experimental drug which might speed up the process of finding out which drugs are good and which drugs are bad and the federal government comes in and dictates that they want complete control over vitamins and nutritional products and I just think the whole principal of government telling us what we can take in or not take in is just a dangerous position to take… it’s related to the drug industry because they’d like to control all of this.” (source)", "https://preparewith.com/revolution.radio", "http://revolutionradio.org/category/civil-unrest/", "http://revolutionradio.org/category/health/", "http://revolutionradio.org/2020/12/05/5-ways-americans-could-be-encouraged-to-get-a-covid-vaccine/feed/"], "authors": [], "publish_date": null}