{"result_id": "263019", "URL": "http://revolutionradio.org/2020/08/18/breaking-childrens-health-defense-sues-facebook-and-fake-fact-checkers-for-government-collusion-and-censorship-to-silence-voices-of-truth/", "timestamp": "2023-04-25 17:01:12 CEST+0200", "meta": {"description": "by: Mike Adams\r\nNaturalNews.com\r\nTuesday, August 18, 2020\r\n\r\nChildren’s Health Defense has just launched a new legal strategy to go after Facebook’s ma...", "lang": "en", "keywords": ",", "favicon": "http://revolutionradio.org/wp-content/uploads/2017/07/cropped-RR-favicon-32x32.jpg", "canonical": "http://revolutionradio.org/2020/08/18/breaking-childrens-health-defense-sues-facebook-and-fake-fact-checkers-for-government-collusion-and-censorship-to-silence-voices-of-truth/", "encoding": "UTF-8"}, "image": null, "domain": "revolutionradio.org", "title": "BREAKING: Children’s Health Defense sues Facebook and fake “fact checkers” for government collusion and censorship to silence voices of truth", "cleaned_text": "Children’s Health Defense has just launched a new legal strategy to go after Facebook’s malicious censorship and fraudulent “fact-checker” schemes which are nothing more than left-wing propagandists pretending to be the high priests of “truth.”\n\nToday, CHD has announced they are suing Facebook and three fact-checkers for fraud and defamation, pointing out that Facebook’s censorship of truthful speech about the coronavirus (or vaccines) is essentially run by the CDC, a government organization. This means Facebook’s censorship violates the First Amendment, which specifically prohibits the government from interfering in free speech.\n\nVia their official announcement:\n\nWashington, DC—August 18, 2020—Children’s Health Defense (CHD) filed a lawsuit on Monday in San Francisco Federal Court charging Facebook, Mark Zuckerberg, and three fact-checking outfits with censoring truthful public health posts and for fraudulently misrepresenting and defaming CHD. CHD is a non-profit watchdog group that roots out corruption in federal agencies, including Centers for Disease Control and Prevention (CDC), the World Health Organization (WHO), and the Federal Communications Commission (FCC), and exposes wrongdoings in the Pharmaceutical and Telecom industries. CHD has been a frequent critic of WiFi and 5G Network safety and of certain vaccine policies that CHD claims put Big Pharma profits ahead of public health. CHD has fiercely criticized agency corruption at WHO, CDC and FCC.\n\nAccording to CHD’s Complaint, Facebook has insidious conflicts with the Pharmaceutical industry and its captive health agencies and has economic stakes in telecom and 5G. Facebook currently censors CHD’s page, targeting its purge against factual information about vaccines, 5G and public health agencies.\n\nThis entry was posted on Tuesday, August 18th, 2020 at 6:47 pm and is filed under Communists, Media Lies, New World Order. You can follow any responses to this entry through the RSS 2.0 feed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2020-08-18-childrens-health-defense-sues-facebook-and-fake-fact-checkers-collusion-censorship.html", "https://www.naturalnews.com/2020-08-18-childrens-health-defense-sues-facebook-and-fake-fact-checkers-collusion-censorship.html", "https://preparewith.com/revolution.radio", "http://revolutionradio.org/category/communists/", "http://revolutionradio.org/category/media-lies/", "http://revolutionradio.org/category/new-world-order/", "http://revolutionradio.org/2020/08/18/breaking-childrens-health-defense-sues-facebook-and-fake-fact-checkers-for-government-collusion-and-censorship-to-silence-voices-of-truth/feed/"], "authors": [], "publish_date": null}