{"result_id": "263014", "URL": "http://revolutionradio.org/2020/12/05/north-korean-hackers-target-virus-vaccine-makers-as-ibm-warns-of-cyber-attack-on-supply-chain/", "timestamp": "2023-04-25 17:01:07 CEST+0200", "meta": {"description": "by EDWIN MORA\r\nBreitBart.com\r\n4 Dec 2020\r\n\r\nNorth Korean hackers have reportedly launched coordinated cyberattacks against at least six drug makers working...", "lang": "en", "keywords": ",", "favicon": "http://revolutionradio.org/wp-content/uploads/2017/07/cropped-RR-favicon-32x32.jpg", "canonical": "http://revolutionradio.org/2020/12/05/north-korean-hackers-target-virus-vaccine-makers-as-ibm-warns-of-cyber-attack-on-supply-chain/", "encoding": "UTF-8"}, "image": null, "domain": "revolutionradio.org", "title": "North Korean Hackers Target Virus Vaccine Makers as IBM Warns of Cyber Attack on Supply Chain", "cleaned_text": "North Korean hackers have reportedly launched coordinated cyberattacks against at least six drug makers working on developing coronavirus vaccines and therapeutics in America, the United Kingdom, and South Korea.\n\nIn mid-September, FBI Director Christopher Wray warned U.S. lawmakers that foreign hackers, particularly from China and Russia, are trying to steal U.S. coronavirus vaccine research and testing technology and engaging in efforts to disrupt the American government’s response to the ongoing pandemic.\n\nThe U.S. intelligence community’s annual Worldwide Threat Assessment has long listed North Korea’s cyber capabilities as a threat to America.\n\nCiting unnamed people familiar with the matter, the Wall Street Journal revealed Wednesday that the attackers wanted sensitive coronavirus research information that the rogue North Korean regime could weaponize or sell on the black market.\n\n“It wasn’t known whether the hackers succeeded in swiping useful information. But North Korea has coordinated attacks on the six companies since August, the people said,” the Journal noted, adding:\n\nThe [potentially hacked] firms include previously unreported targets in the U.S.: Johnson & Johnson and Maryland-based Novavax Inc., which are both working on experimental vaccines, the people said. The list also includes three South Korean companies with Covid-19 [Chinese coronavirus] drugs in earlier clinical trials, Genexine Inc., Shin Poong Pharmaceutical Co. and Celltrion Inc., they added.\n\nNorth Korea had also tried infiltrating U.K.-based AstraZeneca PLC, whose vaccine co-developed with the University of Oxford, has been shown to be as much as 90% effective and is seeking emergency approval, the people said. On Friday, Reuters reported that suspected North Korean hackers had tried to break into the systems of AstraZeneca, citing unnamed sources.\n\nTwo days after the Journal’s revelations, IBM reportedly cautioned that hackers from a potential “nation-state” targeted the coronavirus supply chain, without naming the suspect.\n\nThis entry was posted on Saturday, December 5th, 2020 at 6:40 pm and is filed under Conspiracy, Corruption, North Korea, Technology. You can follow any responses to this entry through the RSS 2.0 feed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/health/2020/12/04/north-korean-hackers-target-virus-vaccine-makers-ibm-warns-cyber-attack-supply-chain/", "https://www.breitbart.com/health/2020/12/04/north-korean-hackers-target-virus-vaccine-makers-ibm-warns-cyber-attack-supply-chain/", "https://preparewith.com/revolution.radio", "http://revolutionradio.org/category/conspiracy/", "http://revolutionradio.org/category/corruption/", "http://revolutionradio.org/category/north-korea/", "http://revolutionradio.org/category/technology/", "http://revolutionradio.org/2020/12/05/north-korean-hackers-target-virus-vaccine-makers-as-ibm-warns-of-cyber-attack-on-supply-chain/feed/"], "authors": [], "publish_date": null}