{"result_id": "263013", "URL": "http://revolutionradio.org/2020/10/27/the-virus-that-has-destroyed-the-american-economy-and-weakened-the-military-was-foretold-by-another-predictive-program/", "timestamp": "2023-04-25 17:01:06 CEST+0200", "meta": {"description": "by Dave Hodges \r\nTheCommonSenseShow.com\r\nTuesday, October 27, 2020\r\n\r\nAgain, the proper interpretation of predictive programming allows to predict what is ...", "lang": "en", "keywords": ",", "favicon": "http://revolutionradio.org/wp-content/uploads/2017/07/cropped-RR-favicon-32x32.jpg", "canonical": "http://revolutionradio.org/2020/10/27/the-virus-that-has-destroyed-the-american-economy-and-weakened-the-military-was-foretold-by-another-predictive-program/", "encoding": "UTF-8"}, "image": null, "domain": "revolutionradio.org", "title": "The Virus That Has Destroyed the American Economy and Weakened the Military Was Foretold by Another Predictive Program", "cleaned_text": "Again, the proper interpretation of predictive programming allows to predict what is coming and in the case of the virus, the causal link between PERCEIVED pandemic and setting the condition for civil war and World War III are in motion, thanks to the catalyst event, the scamdemic known as CV-19.\n\nPhase One of the attack of the Chinese Pandemic on America has been successful. It’s mortality rate was limited to overwhelmingly elderly with comorbidity factors (eg asthma, diabetes, etc). This limited impact of the coronavirus on the average American, allowed the Deep State minions of the Democratic party to continue to kill the economy and allow allies such as Antifa and BLM to continue their domestic, nation-killing terrorism, unabated and largely unaffected by the virus. When Cuomo stated that protesters (ie rioters) were immune to CV-19 he was largely correct. Most people are largely immune to the effects. That is why this level of viral intervention was accomplished. The virus hurt the military and the economy. It was the neutron bomb of viruses. This is highly significant because in order for the United States to successfully wage a long-term war with a numerically superior opponent, the peace time conversion of business must be transferred to wartime production. The Democrats have succeeded in achieving this military goal on behalf of their communist China (CHICOMS) allies.\n\nEven though the CV-19 threat was very minimal, the mainstream media was able to successfully induce a state of fear upon the people in which for the first time in history, we quarantined our healthy and in doing so, we killed our economy. This accomplishment cannot be overstated, The Chinese know this. However, there is a problem. Over half of the Americans have awakened to the fact that we are living in a scamdemic and they are going to refuse the DNA-altering vaccines. Subsequently, Phase two is about to be introduced and this time, the scamdemic will be sufficiently lethal.\n\nAccording to Border Patrol and DHS agents I speak with, over half of those detained trying to cross our Southern border, are communist Chinese. In my humble opion and in the opinion of others, they are importing not just a more deadly form of the coronavirus, they are bringing in other lethal diseases which will paralyze this country.\n\nThe health risks on our southern border with Mexico has reached a critical level of concern for federal employees stationed, or about to be stationed at the border. However, this is not a new danger, it is just a bigger version from what we have learned before as this has been going on for sometime. In other words America, the CSS is stating that this bio-attack on United States has been in process for years.\n\nPhoenix’s ABC affiliate, Channel 15, ran a story on June 6, 2014 in which the producers reported from McCallen, Texas. The news story expressed a serious and growing concern with regard to illegal immigrants crossing into the United States and the potential deadly health concerns associated with this mass migration. The report interviewed several U.S. Border Patrol agents who are gravely concerned about what’s coming over the border. What is coming according to Border Patrol agents are not just immigrants, but pathogens, constituted in the form of a viral outbreak, which could cause serious harm in the United States.\n\nThis entry was posted on Tuesday, October 27th, 2020 at 5:40 pm and is filed under China, Communists, Conspiracy, Corruption, Government Evil, Health, New World Order, Population Control. You can follow any responses to this entry through the RSS 2.0 feed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://thecommonsenseshow.com/activism-agenda-21-conspiracy/virus-has-destroyed-american-economy-and-weakened-military-was-foretold-another-predictive-program", "https://thecommonsenseshow.com/activism-agenda-21-conspiracy/virus-has-destroyed-american-economy-and-weakened-military-was-foretold-another-predictive-program", "https://preparewith.com/revolution.radio", "http://revolutionradio.org/category/china/", "http://revolutionradio.org/category/communists/", "http://revolutionradio.org/category/conspiracy/", "http://revolutionradio.org/category/corruption/", "http://revolutionradio.org/category/government-evil/", "http://revolutionradio.org/category/health/", "http://revolutionradio.org/category/new-world-order/", "http://revolutionradio.org/category/population-control/", "http://revolutionradio.org/2020/10/27/the-virus-that-has-destroyed-the-american-economy-and-weakened-the-military-was-foretold-by-another-predictive-program/feed/"], "authors": [], "publish_date": null}