{"result_id": "263011", "URL": "http://revolutionradio.org/2020/06/23/infant-vaccination-rates-plummeted-during-the-lock-down-so-why-did-infant-mortality-rates-also-plummet-to-historic-lows/", "timestamp": "2023-04-25 17:01:05 CEST+0200", "meta": {"description": "by: Lance D Johnson\r\nNaturalNews.com\r\nTuesday, June 23, 2020\r\n\r\nVaccines are praised as the golden standard for saving millions of lives worldwide. That’...", "lang": "en", "keywords": ",", "favicon": "http://revolutionradio.org/wp-content/uploads/2017/07/cropped-RR-favicon-32x32.jpg", "canonical": "http://revolutionradio.org/2020/06/23/infant-vaccination-rates-plummeted-during-the-lock-down-so-why-did-infant-mortality-rates-also-plummet-to-historic-lows/", "encoding": "UTF-8"}, "image": null, "domain": "revolutionradio.org", "title": "Infant vaccination rates plummeted during the lock down, so why did INFANT mortality rates also plummet to historic lows?", "cleaned_text": "Vaccines are praised as the golden standard for saving millions of lives worldwide. That’s the promise that we are led to believe as parents ritualistically submit their infant sons and daughters to a cornucopia of state-sanctioned injections. Well-baby visits are designed to introduce up to 26 liability-free vaccinations in the baby’s first year of life, during six or more visits to a pediatrician.\n\nHowever, during the covid-19 lockdowns, well-baby visits were cancelled and vaccination rates plummeted as a result. More parents stayed home, nursed their babies, watched them closely, and kept them away from pediatricians.\n\nWhen the national emergency order was declared, provider orders for routine pediatric vaccines dropped significantly. The Vaccines for Children Program and the Vaccine Safety Data link reported a drop-off in vaccination coverage starting in the third week of March, as hundreds of thousands of parents stayed home and skipped well-baby visits. The downward trend was observed from March 23rd to the end of April for all non-influenza vaccines, especially measles-containing vaccines.\n\nSo why did infant mortality rates drop to historic lows as vaccination coverage fell?\n\nIf vaccines are so important for an infant to live, then why didn’t the infant death rate dramatically increase as vaccination coverage fell? The data shows that the opposite effect occurred; infant deaths actually plummeted to historic lows! In the U.S., infants mortality occurs at roughly 700 babies per week. This trend of infant death and sacrifice remained steady from 2014 to 2019. In 2020, this all changed. From early March to mid-April, infant deaths fell by 30 percent on average each week! Throughout April and into mid May, the infant mortality rate had declined to 500 on average per week.\n\nDeaths among children under 18 are relatively rare when compared to deaths from other age groups. For the average death rate to change by 30 percent in the youngest age group (infants) – that is unprecedented!\n\nThe main causes of death for infants is congenital malformation (birth defects), representing 32 percent of all infant deaths. On average, accidents account for 31 percent of infant deaths. Circulatory complications (9 percent) and homicide (7 percent) are also contributing causes. The biggest grey area for infant death is “sudden infant death syndrome” which accounts for roughly 32 percent of infant deaths. This is when an otherwise healthy infant suddenly dies in their sleep, through suffocation, poisoning, or from an undiagnosed condition or adverse reaction.\n\nInfant mortality rates fall when less vaccine doses are administered\n\nAn important study found that infant mortality rates regressed against the number of vaccine doses routinely given. The study asks: Is there a biochemical or synergistic toxicity? After all, the cumulative safety of the entire U.S. vaccine schedule has never been studied.\n\nInfant mortality rate is defined as the number of infant deaths per 1000 live births. The infant mortality rate for the US is an abysmal 6.22. Singapore, Sweden, and Japan have an infant mortality rate that is less than half that of the US (2.80). There were major differences in infant mortality for nations that gave 12-14 doses in the first year of a baby’s life compared to those that gave 21-23 and 24-26 doses. As of 2009, the five nations with the lowest infant mortality rate only require 12 vaccine doses in the infant’s first year, compared to 24-26 doses required by the US. The US pathetically has the highest infant mortality rate out of the 33 developed nations in the study.\n\nThe covid-19 lockdowns of 2020 provided more insight into how a nation can lower the infant mortality rate. As a nation that cares for the lives of its citizens, the American Academy of Pediatrics (AAP) and Centers for Disease Control (CDC) must rethink the purpose of well-baby visits and the necessity of pumping infants full of numerous vaccinations. If the US can save 200 or more babies on average each week by simply foregoing well-baby visits and vaccinations, then how many more babies can be saved if pediatric care was reformed entirely, and vaccine doses were lessened? How many babies can be saved if pediatric care adopted a more comprehensive and integrative approach to infant immunology and neurodevelopment? Finally, what if vaccine manufacturers were held liable in a court of law?\n\nThis entry was posted on Tuesday, June 23rd, 2020 at 1:00 pm and is filed under Health. You can follow any responses to this entry through the RSS 2.0 feed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2020-06-23-infant-vaccination-rates-plummeted-lockdown-mortality.html", "https://preparewith.com/revolution.radio", "http://revolutionradio.org/category/health/", "http://revolutionradio.org/2020/06/23/infant-vaccination-rates-plummeted-during-the-lock-down-so-why-did-infant-mortality-rates-also-plummet-to-historic-lows/feed/"], "authors": [], "publish_date": null}