{"result_id": "263003", "URL": "http://revolutionradio.org/2020/11/27/executing-the-10-solution-is-the-only-way-to-avoid-the-final-solution/", "timestamp": "2023-04-25 17:00:57 CEST+0200", "meta": {"description": "by Dave Hodges \r\nTheCommmonSeneShow.com\r\nFriday, November 27, 2020\r\n\r\nI am well aware of the work that Steve Quayle, Gary Heavin and Mike Adams have done w...", "lang": "en", "keywords": ",", "favicon": "http://revolutionradio.org/wp-content/uploads/2017/07/cropped-RR-favicon-32x32.jpg", "canonical": "http://revolutionradio.org/2020/11/27/executing-the-10-solution-is-the-only-way-to-avoid-the-final-solution/", "encoding": "UTF-8"}, "image": null, "domain": "revolutionradio.org", "title": "Executing the 10% Solution Is the Only Way to Avoid the “Final Solution”", "cleaned_text": "I am well aware of the work that Steve Quayle, Gary Heavin and Mike Adams have done with regard to what’s in tne vaccine and what the real purpose is the ushering in of the transhumanism age which also requires the parallel event of depopulation.\n\nThe vaccine is the first major step in acquiring compliance. What we are going through now is systematic conditioning using both operant and classical conditioning strategies to comply to nonsensical lock down procedures and policies. Of course, the destroying what little spiritual value of what’s left of the church is central to their plan because the Holy Spirit could inspire resistance to this Satanic plot to murder nearly every human being on the planet and to also for Satan’s minions to profit on humanity’s demise.\n\nRight now, the public opinion polls say that 67% of all Americans will NOT take the vaccine which allows for complete mind control, destroys the God-part of the brain and will eventually serve as the death switch ala the movie The Kingsman, where their heads blow up for noncompliance.\n\nI admire the abovementioned trio and right now, on the surface, it looks like vaccine compliance is on the side of the people and the globalists will not have the means to overcome noncompliance. I wish that were true, however, if we simply look at what has happened in recent weeks, I can state in my professional opinion, that around 80% of the people will eventually take the vaccine. No….don’t get me wrong in that Steve, Gary and Mike should do more shows on the chance that we can raise public awareness to the point where the tipping point resides with the public. How does one reach the tipping that is necessary to get the public to stand down accept no directions from a corrupt Biden, then Harris, administration.\n\nThe only path to victory is to achieve the 10% factor spoken of by psychologists.\n\nScientists from the prestigious Rensselaer Polytechnic Institute have determined that if just 10% of any given population holds to an unshakable idea, that the idea will become adopted by the majority of the country. However, the scientists who belong to the Social Cognitive Networks Academic Research Center (SCNARC) found that if the ideas are shared by less than 10% of the population, the idea will not progress and will eventually die out. The research was first published in a peer reviewed E Journal in an article titled “Social consensus through the influence of committed minorities.” Computational and analytical methods were used to discover the tipping point where an obscure idea eventually becomes the majority opinion. The finding has dramatic implications for those of us trying to wake up the sheep in this country. The SNARC scientists found that the 10% figure was applicable whether they were talking about the spread of innovations or to advance a political ideal. There is evidence that nearly 10% of the sheep have been awakened and this is why the globalists are introducing us to our newest friend, Ebola. The release of CV-19 is an act of desperation by the globalists. To use an athletic analogy, the wakening masses are forcing the elite to keep their starters in the game a lot longer than they want to.\n\nThis entry was posted on Friday, November 27th, 2020 at 6:33 pm and is filed under BioWeapon, Brave New World, Civil War II, Communists, Conspiracy, Corruption, Government Evil, New World Order. You can follow any responses to this entry through the RSS 2.0 feed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://thecommonsenseshow.com/agenda-21-conspiracy-economics/executing-10-solution-only-way-avoid-final-solution", "https://thecommonsenseshow.com/agenda-21-conspiracy-economics/executing-10-solution-only-way-avoid-final-solution", "https://preparewith.com/revolution.radio", "http://revolutionradio.org/category/bioweapon/", "http://revolutionradio.org/category/brave-new-world/", "http://revolutionradio.org/category/civil-war-ii/", "http://revolutionradio.org/category/communists/", "http://revolutionradio.org/category/conspiracy/", "http://revolutionradio.org/category/corruption/", "http://revolutionradio.org/category/government-evil/", "http://revolutionradio.org/category/new-world-order/", "http://revolutionradio.org/2020/11/27/executing-the-10-solution-is-the-only-way-to-avoid-the-final-solution/feed/"], "authors": [], "publish_date": null}