{"result_id": "263024", "URL": "http://revolutionradio.org/2020/04/08/god-help-us-all-dr-fauci-knows-exactly-what-hes-doing/", "timestamp": "2023-04-25 17:01:17 CEST+0200", "meta": {"description": "By Michael Thau\r\nAmericanThinker.com\r\nApril 8, 2020\r\n\r\nLast Thursday, the scientific mastermind behind the economic carnage and spirit-crushing isolation n...", "lang": "en", "keywords": ",", "favicon": "http://revolutionradio.org/wp-content/uploads/2017/07/cropped-RR-favicon-32x32.jpg", "canonical": "http://revolutionradio.org/2020/04/08/god-help-us-all-dr-fauci-knows-exactly-what-hes-doing/", "encoding": "UTF-8"}, "image": null, "domain": "revolutionradio.org", "title": "God Help Us All: Dr. Fauci Knows Exactly What He’s Doing", "cleaned_text": "Last Thursday, the scientific mastermind behind the economic carnage and spirit-crushing isolation now constituting the two main pillars of America’s ingenious new public health strategy delivered some bad news. Dr. Fauci says we’ll have to keep living like this until the virus is eradicated.\n\nEven if “virus” isn’t his nickname for the American people, following his advice still means a long, grueling haul. The economic shutdown and social confinement oppressing us have to continue for at least the minimum estimated 18 months it will take to develop a vaccine for COVID-19. Longer, since the stipulation that our rights don’t get restored until new infections cease means we have to manufacture and distribute enough to inoculate 60% of the population. All told, we’re talking God only knows how many years.\n\nNo remotely similar brutal experiment in tough love has ever been tried. So it’s anyone’s guess how bad things will get. The Great Depression saw just three consecutive years averaging around a 9% decline in GDP. Unemployment peaked at 25%. Much worse is already projected in just the coming months.\n\nBut even if our hardship snowballs into a catastrophe rivaling the crash of ’29, we’re at least likely to avoid its infamous breadlines. Impoverished people lining up for food would wreak havoc on Dr. Fauci’s social distancing scheme. So he’s likely to insist that any rations be delivered. The upside to house arrest during an economic meltdown is not having to wear the malodorous rags to which your clothes will be reduced in public.\n\nNor, thankfully, will you have to worry about how Dr. Fauci is faring. Rest assured: his high-level position in the federal bureaucracy provides ample insulation from any hardship inflicted on you. He’s already acquired a security detail because some ingrates reacted to a suspension of our most basic rights, which makes the taxes George III imposed on our founding fathers look utterly minor, by subjecting poor Dr. Fauci to the same threats and insults literally every public figure gets. If things get bad, his new bodyguards will make sure he enjoys the decent food he’s bound to have first dibs on undisturbed. That’s probably why he remains so disturbingly cheerful whenever he has to push our faces a little farther into the dirt for our own good.\n\nYou needn’t worry about Dr. Fauci missing any paychecks as so many Americans already have, either. Unlike us, in times of crisis, bureaucrats get to declare themselves “essential.” No matter how much misery they rain down, we never have to worry they won’t be compensated.\n\nDr. Fauci, in particular, is guaranteed never to miss a penny of his very nice salary since he’s the most “essential” bureaucrat of all. His three decades of no experience whatsoever outside the federal bureaucracy means that neither his record of wildly exaggerating the threat of AIDS nor the disastrous job he did crafting a response negatively affected his career. In fact, results matter so little for “essential” people like Dr. Fauci that he still openly brags about his risibly false prediction that “AIDS would not stay confined to the populations where it first appeared” and become “a disaster for society.” Dr. Fauci’s bold lack of concern for epidemiological reality is exactly what’s needed to guide us through this crisis.\n\nHe’s also understandably proud that, after years of being vilified by AIDS activists for “killing people with red tape,” he eventually realized that “much of their criticism was absolutely valid” and held off on killing any more. Who said noblesse oblige was dead?\n\nDr. Fauci’s completely bogus scare-mongering and deadly policy recommendations the last time he directed our efforts against a new pathogen aren’t the only reason we need to blindly follow his advice about this one. Though curing AIDS was his number-one priority, it was left to scientists in Europe to discover an effective treatment. But you know what they completely failed to do? Spend unimaginably large sums of money. Their successful treatment barely cost a dime compared to the tens of billions of your tax dollars Dr. Fauci pried from Congress to fund his failure. That’s the true measure of success for any “essential” bureaucrat.\n\nWithout Dr. Fauci, who’ll save you the next time some computer model produces scary numbers that its designers explicitly admit depend on “very large uncertainties”? Who’ll destroy the economy and confine you to house arrest based on the work of people explicitly warning that it’s “not at all certain” such measures will even accomplish anything?\n\nOne shudders to think what someone lacking Dr. Fauci’s expertise might have done upon learning that the predicted number of hospitalizations solely responsible for generating the scary death rate he’s putting us through hell to avoid were inflated almost tenfold. A lesser man might stupidly think eliminating any rationale for the misery he’s inflicting on us means we need to reverse course immediately instead of wisely insisting that his pointlessly destructive policies continue indefinitely.\n\nBesides, despite Dr. Fauci’s lack of candor, the open-endedness of the dystopian nightmare he’s inflicted on us has always been clear. Though who had time to bother looking carefully at the justification for peremptorily shutting down our businesses and confining us to our homes once we were given an awesome slogan like “flatten the curve” to mindlessly regurgitate? Not since “Where’s the beef?” appeared to challenge and transform our conceptual framework has American intellectual life been so enlivened. But if we hadn’t been diverted by the essential task of relentlessly barking “flatten the curve” at each other like trained seals, we might have noticed something.\n\nNormally, this new coronavirus should start disappearing after a few months. When the percentage of people who’d been infected, recovered, and gained immunity got high enough, there would no longer be enough carriers for it to spread. So even those who hadn’t acquired biological immunity nonetheless would become protected through herd immunity.\n\nRemember those researchers whose computer model is motivating Dr. Fauci’s restrictions? You know, the ones who said their projections could be totally wrong, and, even if not, the certain misery Dr. Fauci is inflicting on us still might not accomplish anything? Well, they’ve also repeatedly said one consequence of successfully slowing down the infection rate is preventing herd immunity. Hence, they warned that restoring our rights before herd immunity is artificially created through vaccination would put us right back where we started, rendering the hardship caused by suspending them in the first place pointless.\n\nAnother related consequence Dr. Fauci has been careful not to mention is that, because we’re making the virus linger for many years instead of mere months, despite slowing down how fast it spreads, the restrictions strangling our lives won’t decrease the number of people ultimately infected. We’re only decreasing your chances of becoming infected now. Your overall chances of getting the virus at some point aren’t any lower than if we’d let the infection rate remain high and not vastly increased how long the virus will be active by treating it like the severe flu Dr. Fauci admits it’s likely to clinically resemble when addressing his peers.\n\nBut perhaps your unaware that on March 26, Dr. Fauci himself said in the New England Journal of Medicine that “the overall clinical consequences of Covid-19 may ultimately be more akin to those of a severe seasonal influenza (which has a case fatality rate of approximately 0.1%).”\n\nSo, don’t let what Dr. Fauci tells the inessential people he’s inflicting misery on fool you. He’s known from the beginning that the measures he allowed us to believe might be short-lived make sense only if they’re maintained for at least several years and that they weren’t going to reduce anyone’s chances of catching COVID-19. He’s fully aware that the projections about hospitalization rates justifying their implementation proved to be completely bogus and that we’re barreling toward an economic catastrophe because of a virus akin to a seasonal flu.\n\nDr. Fauci may have completely bungled our response to AIDS through incompetence. But this time, he knows exactly what he’s doing.\n\nGod help us all.\n\nThis entry was posted on Wednesday, April 8th, 2020 at 4:53 pm and is filed under Conspiracy, Corruption, God Help Us, Government Evil, Health, Pandemic. You can follow any responses to this entry through the RSS 2.0 feed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.americanthinker.com/articles/2020/04/god_help_us_all_dr_fauci_knows_exactly_what_hes_doing.html", "https://preparewith.com/revolution.radio", "http://revolutionradio.org/category/conspiracy/", "http://revolutionradio.org/category/corruption/", "http://revolutionradio.org/category/god-help-us/", "http://revolutionradio.org/category/government-evil/", "http://revolutionradio.org/category/health/", "http://revolutionradio.org/category/pandemic/", "http://revolutionradio.org/2020/04/08/god-help-us-all-dr-fauci-knows-exactly-what-hes-doing/feed/"], "authors": [], "publish_date": null}