{"result_id": "263020", "URL": "http://revolutionradio.org/2020/11/19/the-fox-news-psyop-upon-america/", "timestamp": "2023-04-25 17:01:13 CEST+0200", "meta": {"description": "by Dave Hodges \r\nTheCommonSenseShow.com\r\nThursday, November 19, 2020\r\n\r\nDid you hear about the 43 South Koreans that died from flu vaccinations that the ma...", "lang": "en", "keywords": ",", "favicon": "http://revolutionradio.org/wp-content/uploads/2017/07/cropped-RR-favicon-32x32.jpg", "canonical": "http://revolutionradio.org/2020/11/19/the-fox-news-psyop-upon-america/", "encoding": "UTF-8"}, "image": null, "domain": "revolutionradio.org", "title": "The Fox News Psyop Upon America", "cleaned_text": "Did you hear about the 43 South Koreans that died from flu vaccinations that the mainstream media just continues to bury? There are medical treatments that help and that hurt. The ones that hurt humanity are buried and covered up in the mainstream media (MSM). The MSM is least trusted organization in America today. Such is the way of the MSM as they obfuscate the truth for personal gain.\n\nDuring the election cycle and the immediate aftermath, Fox News showed the world what I have been saying forever. Fox News is controlled opposition as they are a psyop upon America?\n\nThe Murdock sons are morally bankrupt and they want to be at globalist parties proclaiming what they are doing to suppress liberty. As an aside, when it comes to the welfare of the American people and their liberties, American people would be better off with Fox News going broke than even CNN who has already been thoroughly discredited. If President Trump were to be on Fox, I would watch, but there will be little else that will every lead me to watch the most deceptive network in the World. Occasionally, I will drop into to see what evil is up to, so you don’t have to. If I had my way, all of America would turn away from the 6 corporations that controls 95% of the media and bankrupt them as we turn to the alternatives. Unfortunately, half of our country is dumber than a box of rocks and are taken in by fake polls and fake news that is ultimately designed to get people to give up their freedom of choice in a manner that sacrifices our freedoms and the fruits of our labor.\n\nIn addition to the loss of freedom and revenue, America is being attacked on a spiritual level where pedophilia is being normalized and the acceptance of all Satanic perversion is the order of the day. This is who Fox News, NBC, C(the)BS and MSDNC supports. In the universe of the spirit realm, these people support Satanism in their worst form and their followers are being put on a path that will eventually culminate with them being rightfully thrown into the Lake of Fire. I only wonder if God will permit us to cheer as devil worshippers like Hillary have terrorized their last person…\n\nFox News is backtracking on its election coverage, but the psyop is obvious. The average person is saying to me “What about Tucker, Hannity and Laura?” Let’s take a look at Satan’s trinity. Tucker Carlson sounds like you and me. I have no idea what is in his heart. However, if he had any morality, or Christian decency in his being, he would have already left Fox for pro-American broadcasting service such as One American News Network. Come on Tucker put your money ($25 million annual salary) where your mouth is. He can’t, or better yet, he will not for the root of all evil is the love of money. This is Carlson’s defining trait. The Presidency of his nation has been stolen. And as will be exposed on the CSS, tomorrow, millions of Americans are going to die (Deagel Report). And Tucker pretends to be your prosecutor against Satanic, Leftist-inspired evil, while he is being paid to say what he is saying five times per week by Satanic, Leftist-inspired evil. Whether Tucker Carlson realizes this or not, he is being controlled by the most evil forces on the Earth and I therefore, have to ask, we are still listening to him because…?\n\nThen there is Hannity, the Fox News one-trick-pony. It is always the same message in different forms each and every night. The virtuous President is being falsely assailed by the Democrats. “OMG” the President had the election stolen, but like his persona, the depth of his coverage is extremely superficial and they never get their great guests, like S. Powell, to really get into in depth coverage of how the 2020 election was stolen. Fox News ratings fell into the toilet and the pretend outrage they are now expressing on a nightly basis, is pretend PR of this network. As I have analyzed Hannity (net worth $250 million) in the aftermath of the greatest theft in American History, I can accurately say “If you have seen one Hannity show, you have seen them all”.\n\nThen of course is Laura and her infamous “angle”, the angle of deception. She has Kamala Harris’ morals as she is clearly a pretend journalist that is for sale to the highest bidder, which is Fox News at the moment. In the clear aftermath of unprecedented voter fraud, she called on President Trump to acquiesce and conceded! This is the moment that Fox News ratings collapsed. Now, this Jezebel of journalism has backtracked with poorly defined examples of election theft. What a total sellout! I cannot imagine having to be so tied to your multi-million dollar salary, that one has to forfeit all integrity in their life. This woman, plus Carlson, plus Hannity, are Leftist actors pretending to be journalists. It is fortunate that we have seen enough beneath the covers that we know that that they are really political prostitutes. Do you know why these “presstitutes” are allowed to hang out their journalistic red light? The answer is simple….they take the legitimate discoveries and headlines of the alt media, take the headlines as their own and then lead us down the path of disinformation. They are also trying to take market share away from the alt media.\n\nIn the event that any, or all of the three Fox News media figures depart from their network, I will apologize. However, the longer they wait, the softer the apology.\n\nThis entry was posted on Thursday, November 19th, 2020 at 3:33 pm and is filed under Conspiracy, Corruption, Media Lies, New World Order. You can follow any responses to this entry through the RSS 2.0 feed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://thecommonsenseshow.com/conspiracy-economics-education/fox-news-psyop-upon-america", "https://thecommonsenseshow.com/conspiracy-economics-education/fox-news-psyop-upon-america", "https://preparewith.com/revolution.radio", "http://revolutionradio.org/category/conspiracy/", "http://revolutionradio.org/category/corruption/", "http://revolutionradio.org/category/media-lies/", "http://revolutionradio.org/category/new-world-order/", "http://revolutionradio.org/2020/11/19/the-fox-news-psyop-upon-america/feed/"], "authors": [], "publish_date": null}