{"result_id": "264022", "URL": "https://www.rumormillnews.com/cgi-bin/forum.cgi?read=218288", "timestamp": "2023-04-25 17:01:37 CEST+0200", "meta": {"description": "Alternative News and Views, Reported by Agents Around the World, 24 hours a day", "lang": "en", "keywords": "Insurance, Lawyers, Banks, UFOs, The Apocalypse, New World Order, Politics, Natural Health, Armageddon, Conspiracies, Prophecies, Spirituality, Home Schooling, Mortgages", "favicon": "", "canonical": "https://www.rumormillnews.com/cgi-bin/forum.cgi?read=218288", "encoding": null}, "image": null, "domain": "www.rumormillnews.com", "title": "\"Vaccine-Induced AIDS\" - Military Records 500% Increase in HIV after COVID-19 Vax", "cleaned_text": "The Armed Forces of the United States recorded a five hundred percent (500%) increase in AIDS after administering the COVID-19 Vaccine to US Troops. The COVID-19 Vaccine is implicated.\n\nWhite Blood Cells (WBC) fight-off infection in the human body. NORMALLY, the level of White cells in blood is usually about 5,000 cells per milliliter. During an infection, that level jumps - perhaps as high as twenty-thousand (20,000) -- until the body kills the invading bacteria or virus. Once the invader is dead, the WBC count returns to the normal range of about 5,000.\n\nAfter getting the COVID-19 \"vaccine\" many (very many) people started noticing they were becoming sick more often, and taking far longer to fight-off whatever bug they caught. Moreover, people with Cancer that had been in remission, suddenly found the cancer was not only back, but had metastasized and spread everywhere.\n\nDoctors performing routine tests on people began noticing the level of WBC was lower than usual. Instead of having 5,000 WBC as a baseline, Doctors began seeing patients with 4,000, or 3,000, and some as low as 2,000 WBC. At those levels, the human body does not have enough of its front-line troops to fight-off infection very well.\n\nWhen the level drops below 1,000, a person gets sick from their own natural gut bacteria, which gets out into the blood stream and they become Septic. This leads to death.\n\nNow, US military Doctors are seeing AIDS-like levels of WBC in our troops. They cannot fight off infections. Doctors are calling this \"Vaccine Acquired Immune Deficiency Syndrome \"VAIDS.\"\n\nIt turns out that the COVID-19 \"vaccine\" contains three proteins found in the HIV virus!\n\nSo it now appears that those who got the COVID-19 \"vaccines\" gave themselves AIDS and will die from it.\n\nThe British Boradcasting Corporation (BBC) did a special TV show in the United Kingdom last year about this. In that show, they revealed that a segment of HIV *** WAS *** used to manufacture the vaccine! Here is that segment:\n\nSo they knew. They actually KNEW they were giving a part of the HIV virus to everyone who got their \"vaccine.\"\n\nOh, and the people who developed this \"vaccine\" and others who pushed it off on the public as \"safe and effective\" . . . they're all still out walking free on our streets.\n\nWhere are the arrests?\n\nIf this pattern of VAIDS continues, then it would seem the COVID-19 \"vaccines\" will ultimately wipe out about six billion people on the planet. Death on a scale this planet has never seen before.\n\nWhy are the people who did this still out walking free? Sounds like Criminally Negligent Homicide to me.\n\nWhere are the police?\n\nWhere are the lawyers, suing? Or are they just preparing to die like the rest after taking the \"vaccine?\" Or maybe THEY didn't actually take it? Maybe THEY knew all along what this \"vaccine\" actually was?\n\nIf so, that's the crime of premeditated murder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://halturnerradioshow.com/index.php/en/news-page/world/vaccine-induced-aids-military-records-500-increase-in-hiv-after-covid-19-vax"], "authors": [], "publish_date": null}