{"result_id": "265043", "URL": "https://sanevax.org/gardasil/", "timestamp": "2023-04-25 17:02:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/gardasil/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "Gardasil", "cleaned_text": "Gardasil, manufactured by Merck Sharp & Dohme Co., is aggressively marketed as a vaccine that prevents cervical cancer. In fact, it is a vaccine to prevent four types of the sexually transmitted disease, HPV (human papillomavirus). Gardasil is said to protect against four types of HPV, two of which are associated with cervical cancer. These two types of HPV are present in only 3.2% of the cases. At this time, Gardasil has not been proven to prevent cervical cancer. Scientific data indicates that the vaccine may not last longer than five years, if that long. The drug is indicated for young women and men from the age of nine years old up to 26 years old, though the vaccine is primarily given to girls. The Vaccine Adverse Event Reporting System has over 21,000 reports of adverse events related to the administration of this vaccine including more than 90 deaths. Serious adverse events include multiple sclerosis, blindness, Guillain-Barré Syndrome, lupus, rheumatoid arthritis, paralysis, blood clots and death. The vaccine is recommended to most young girls in their early teens. Parents should proceed with caution before allowing their daughters (and sons) to be vaccinated. We are currently investigating cases with documented use of Gardasil and a diagnosis of multiple sclerosis, Guillain-Barré Syndrome, blindness, lupus, paralysis, rheumatoid arthritis and death.", "opengraph": {"locale": "en_US", "type": "article", "title": "Gardasil - SaneVax, Inc.", "description": "Jere Beasley Report Lawyer: P. Leigh O’Dell Primary Contact: Melisa Bruner June 27, 2011 Gardasil, manufactured by Merck Sharp & Dohme Co., is aggressively marketed as a vaccine that prevents cervical cancer. In fact, it is a vaccine to prevent four types of the sexually transmitted disease, HPV (human papillomavirus). Gardasil is said to protect […]", "url": "https://sanevax.org/gardasil/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2011-06-29T21:48:18+00:00", "article:modified_time": "2018-12-29T01:15:30+00:00"}, "tags": ["vaccinations", "Lawyer", "vaccine adverse events", "HPV vaccine", "Vaccine Adverse Reactions", "Gardasil"], "tweets": [], "movies": [], "links": ["https://www.beasleyallen.com/attorneys/", "https://www.beasleyallen.com/matter/gardasil-and-cervarix/"], "authors": ["Jonathan"], "publish_date": "2011-06-29T21:48:18+00:00"}