{"result_id": "265025", "URL": "https://sanevax.org/a-parents-guide-what-to-do-if-your-child-dies-after-vaccination/", "timestamp": "2023-04-25 17:02:28 CEST+0200", "meta": {"description": "Guidelines to Autopsy Medical Tests [A Parent's Guide]. Parents Immediately Should Require an Autopsy That Includes Certain Tests", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/a-parents-guide-what-to-do-if-your-child-dies-after-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "A Parent's Guide: What to do if your child dies after vaccination", "cleaned_text": "Parents Immediately Should Require an Autopsy That Includes Certain Tests\n\nOver the years various medical doctors, attorneys, and parents have contacted the authors of this Guide seeking information about medical tests that could indicate a causal relationship between vaccines and their ingredients and the severe reactions in previously healthy infants, toddlers, or teenagers, many of whom succumbed after either: 1) receiving vaccination(s), or 2) experiencing protracted adverse events due to vaccines.\n\nSince these requests are coming more frequently, apparently there is a need for such information. This Guide was vetted for accuracy, including omission of relevant information needed in the attempt to determine whether a child died as a result of neurotoxins and/or hazardous chemicals in vaccines. Some are listed in Vaccine Excipient & Media Summary / Excipients Included in US Licensed Vaccines: E-1 thru E-5; Vaccine-Production Media: E-6 & E-7 at the Centers for Disease Control and Prevention’s http://wayback.archive.org/ web/*/http://www.cdc.gov/ vaccines/pubs/pinkbook/ downloads/appendices/B/ excipient-table-1.pdf .\n\nAnother source of vaccine chemical ingredients is each vaccine’s package insert, which can be accessed at U.S. FDA Vaccines, Blood & Biologics website at:\n\nWith the current practice of injecting several multi-valent vaccines [often as many as 9 separate vaccines] into an infant or toddler during the same office visit, some recipients’ central nervous systems (CNS) apparently becomes overloaded and/or the brain suffers dramatic injury from multiple neurotoxins and other toxic chemicals crossing the blood brain barrier (BBB); others experience severe allergic reactions to one or more of the vaccine components. Encephalopathy or anaphylaxis can occur with fatal results.\n\nConventional ‘wisdom’ claims vaccines are not harmful. However, it is becoming increasingly apparent this is not the case for all recipients. The information and tests discussed in this Guide can potentially help document vaccine damage, if parents and their attorneys secure pathologists who will perform those tests.\n\nParents should realize their gut instincts most often are correct, especially about their child whom they have been taking care of since birth. No one knows a child better than his/her mother. Ideally, parents will have documented any new health conditions their child experienced after receiving vaccinations, e.g., screaming fits, seizures, fevers, etc. That documentation will be most helpful later on.\n\nThere is nothing a parent can experience that is more traumatic than the death of a child. But, when a death tragically occurs shortly after vaccination, time is of the essence. Usually, the coroner is appointed by government authorities. Parents need to know they have every right to request the pathologist perform post mortem blood and tissue assays/analyses, and to preserve the samples and data they reveal. Parents may need an attorney’s legal help and/or intervention to get the proper tests performed. Nevertheless, parents have every legal right to request an autopsy be performed, including certain tests looking for toxins, similar to what is done in drug overdose deaths. Parents also have the right to request storage of samples for future tests that are developed as new scientific discoveries are made.\n\nGrieving parents must remember this is a time to rely on loving family and friends to help provide support in their quest to ascertain the child’s cause of death, which can be determined in most cases via proper post mortem examination.\n\nParents must remember physicians and emergency room personnel are typically not trained to recognize adverse reactions from vaccines. Therefore, it is common practice for child abuse/neglect, or Shaken Baby Syndrome (SBS) legal charges to be filed against parents of children who die from vaccine damage to the brain, especially if there are no visible trauma marks on the child’s body. That’s when certain blood tests can be most helpful disproving such allegations. This Guide tells which tests should be performed as soon as possible after death to disprove SBS.\n\nAttorneys are not prepared, in most cases, to deal with vaccine damage cases. Tort law does not apply to vaccine damages. The National Childhood Vaccine Injury Act of 1986 (Public Law 99-660) created the National Vaccine Injury Compensation Program under which claims must be filed. However, the more medical documentation, e.g., post mortem test results, attorneys can present with your client’s claim, the more likely the case you file will get attention from the Special Masters of the United States Court of Federal Claims. Various post mortem tests can disprove SBS, SIDS, etc., which this Guide discusses later. Attorneys should report the death by filing a VAERS report to the HHS at http://vaers.hhs.gov/helpinstructions\n\nAs every pathologist knows, it is important to ascertain cause of death. Chemicals, either legal drugs/medications (prescription drugs and their amounts in the body) or street drugs commonly are assayed. Since there are numerous neurotoxins, heavy metals (Hg, Al in 4 formulations), even recombinant DNA (rDNA), and industrial use chemicals in the formulation of vaccines, it should be incumbent upon the pathologist to perform extensive panels/assays of both post mortem blood and key organ tissue samples, e.g., brain, liver, spleen, heart, and small intestine.\n\nPLOS (“public library of science”) online published the Ken Tsumiyama, Yumi Miyazaki, Shunichi Shiozawa paper “Self-Organized Criticality Theory of Autoimmunity” [1] wherein their\n\nThe Tsumiyama, etal paper contains information pathologists may find helpful.\n\nQiagen’s Sample & Assay Technology is available at www.qiagen.com with ordering information, Fax numbers, and technical support phone numbers for the following countries: Australia, Austria, Belgium, Canada, China, Denmark, Finland, France, Germany, Hong Kong, Ireland, Italy, Japan, Luxembourg, The Netherlands, Norway, South Korea, Sweden, Switzerland, UK, USA.\n\nQiagen offers Gentra® Puregene® Handbook Second Ed. 2007–For purification of archive-quality DNA from: human whole blood, bone marrow, buffy coat, buccal cells, body fluids, cultured cells, tissue, mouse tail, yeast, bacteria\n• Test for CRP (C-reactive protein: if inflammation is high, that would indicate vaccines were to blame as a small infant or toddler could not generate such results) This would indicate severe brain inflammation.\n• Test blood serum levels for histamine and tryptase. Elevated levels of either are an indication of unrecognized anaphylaxis\n• Test for heavy metals, especially Hg and Al in blood and brain tissue\n• Test for formaldehyde and Formalin—in particular–which would come from vaccines. Even though the body manufactures a little formaldehyde, large amounts would implicate formaldehyde, or Formalin especially in vaccines.\n• If brain tissue is taken, check for Hg and Al, which would indicate those metals crossed the blood brain barrier and may have been the precipitating factor in the child’s demise, as they are potent neurotoxins and can cause encephalopathy.\n• Interleukin-1 beta (IL-1β) — IL-1beta is one of the key mediators of the inflammatory response to physical stress.\n• Tumor necrosis factor alpha (TNF-α) TNF-α is a growth factor for immune cells and osteoclasts, the cells that break down bone.\n• Titer levels on all the vaccines. If they are sky high, that could make a case for molecular mimicry causing death.\n\nEach of the 3 injections contains 225 ug of aluminium hydroxyphosphate sulfate, plus sodium borate (a pesticide), and polysorbate 80, an emulsifier linked with anaphylaxis, convulsions, collapse. Post mortem blood and tissue findings should prevail in court if these substances were in the system at the time of death, since vaccines are one of the primary sources.\n• Parents should construct a retrospective timeline of the child’s last week before vaccination, e.g., did child have a fever, cold, asthma, allergy incident, influenza, or other health anomaly, plus a timeline of events occurring after vaccination.\n• Were those events reported to the MD/pediatrician who administered the vaccine and what was the advice given?\n• Before administering the vaccinations to the child, did the MD inquire as to the child’s general health at the time of the vaccination?\n• Parents need to obtain a complete copy of their child’s medical records as soon as possible and keep it for their records.\n• Parents need to make sure a report is filed with the Vaccine Adverse Event Reporting System.\n• When a vaccine is administered to your child, make sure the doctor/nurse records the vaccine lot number and expiration date on your child’s medical records.\n\nNote: Children should not be given vaccinations if there is any immune response manifesting, e.g., seasonal allergies, food allergies, common cold, flu symptoms, etc.\n\nWere parents questioned about or charged with Shaken Baby Syndrome? If so, a Bone Density Test can prove/disprove SBS. See this very well documented paper regarding that.\n\nMatthew B. Seeley, JD, paper “Unexplained Fractures in Infants and Child Abuse: The Case for Requiring Bone-Density Testing Before Convicting Caretakers,” published in the Brigham Young University Law Review Dec. 20, 2011.\n\nThis Guide will be updated periodically as pathologists and MDs report back to us what they feel is necessary to ascertain cause of death revolving around vaccine issues.\n\nA copy to download and print here.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Parent's Guide: What to do if your child dies after vaccination - SaneVax, Inc.", "description": "Guidelines to Autopsy Medical Tests [A Parent's Guide]. Parents Immediately Should Require an Autopsy That Includes Certain Tests ", "url": "https://sanevax.org/a-parents-guide-what-to-do-if-your-child-dies-after-vaccination/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2017-07-01T06:04:42+00:00", "article:modified_time": "2019-04-29T21:33:53+00:00", "image": "https://i0.wp.com/sanevax.org/wp-content/uploads/2012/06/Sanevax-square-e1432966594443.jpg?fit=119%2C101&ssl=1", "image:width": "119", "image:height": "101", "image:type": "image/jpeg"}, "tags": ["death", "parents guide", "vaccination"], "tweets": [], "movies": [], "links": ["http://web.archive.org/web/*/http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-1.pdf", "https://vaers.hhs.gov/", "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0008382", "https://www.qiagen.com:443/us/", "https://sanevax.org/wp-content/uploads/2012/08/A-Parents-Guide-Revised-FINAL-8-15-121.pdf"], "authors": ["Norma"], "publish_date": "2017-07-01T06:04:42+00:00"}