{"result_id": "265028", "URL": "https://sanevax.org/cervarix-transformed-my-life/", "timestamp": "2023-04-25 17:02:31 CEST+0200", "meta": {"description": "Lucy tells her story to help people in similar circumstances raise awareness of a situation people don’t want to acknowledge. She says, \"While vaccines save more lives than they damage it doesn’t make us any less important.\"", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/cervarix-transformed-my-life/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "Cervarix Transformed My Life", "cleaned_text": "Before I took ill, I had a good attendance at school and was hardly ever poorly apart from tonsillitis that I got every year. As a baby, I was ill following the MMR vaccine. They thought I had meningitis so I was admitted to hospital, but it turned out to be a bad reaction to the vaccine. So, I never had the second MMR. At school I got top grades and I was always proud of myself for that. I was a shy quiet girl and did not have many friends. At the age of 10, I had it pretty rough when my next-door neighbour died suddenly. She was my best friend and like a grandma to me, so I found the grief overwhelming. Later that year her husband was diagnosed with lung cancer and I was scared I was going to lose him as well. Luckily the doctors were able to operate and remove his lung and he survived. But because of the poor support in my community, I never had any help going through the\n\ngrieving process. Mentally I struggled with this but physically I was healthy.\n\nFrom an early age, I knew the way I wanted my life to go – I would finish school, move onto sixth form and then go to university. It never occurred to me that this would not happen, or not be possible.\n\nI had my first injection of the HPV vaccine in October 2010, the second in November, and the third dose in May 2011. When the consent form came though we questioned whether it was safe for me after the reaction I had to the MMR, but we were assured it was a safe vaccine. Looking back, I had symptoms of not being well that winter, but this was put down to flu, so I kept pushing myself.\n\nOn the 4th of July 2011, I can remember waking up exhausted with a massive headache that would not go away. Over the next few days, the tiredness and headaches got worse, so my mum took me to the doctor. I had bloods done but they came back ok. The tiredness was getting worse and I had pain in both sides. We went back to the doctor and he suspected I had an enlarged liver and spleen most likely due to Glandular fever. I was told to go home and rest but as we were making an appointment for the following week, I passed out in the waiting room. Over the next hour I passed out every time we tried to leave, so my dad came to help my mum and eventually we were able to get home.\n\nAnother week went by and I was getting worse, so I was admitted to the paediatric ward where I had numerous blood tests carried out. All the tests came back negative and we left hospital a few days later with a probable diagnosis of glandular fever and the advice to try and go for a short walk every day. So, with my mum’s help that is what we did but within days I was struggling to walk, my balance had gone, and I could no longer walk safely.\n\nA month after I had taken ill, I was back in hospital waiting to have an MRI scan to check for a brain tumour or encephalitis. Luckily the results came back negative and through a process of elimination I was given a probable diagnosis of ME probably caused by the vaccine. Things rapidly deteriorated after this, the stress of being in hospital and worrying about what they might find had taken its toll. By the end of August, I was sleeping for more than 20 hours per day.\n\nSchool started back at the beginning of September, but I was so ill and in a wheelchair by now, so I was unable to go. I wanted to keep up with my friends and school work so it was agreed that I could visit school for 20 minutes on the 16th September. I did this but really struggled due to feeling so ill and energy-wise it drained me. I got in the car to go home and fell asleep.\n\nThe next thing I remember is the Christmas decorations being up. It was on the 16th of December. I have no recollection of those 3 months. The only information I have is what my mum and dad have told me. Things had been really bad, and no one seemed to know how to treat me. I know my mum went against doctor’s advice and did not wake me every hour as she had been told to do as it was making me worse. Instead, she let me sleep on the understanding that I would not sleep if I didn’t need it. I had to be spoon fed my food with great difficulty and after 3 months I had lost 1/3 of my body weight. I could not walk or talk, and I did not open my eyes for 13 weeks.\n\nMy dad did lots of research and through it, he discovered Fiji water which is really high in silica and helps remove the toxins in the body from the vaccine. Local papers heard about us and eventually, my mum agreed we could share our story in the hope that we would get some help. Once this was shared locally the national papers reported it, from this the principal from a large teaching homeopath hospital in London contacted us and eventually visited us at home just before I woke up.\n\nAfter I woke up, I spent days looking around confused. Getting used to the idea that I had lost 3 months of my life was overwhelming. I started taking the homeopath medicine that Marcus had recommended. I had to wear sunglasses every day due to light sensitivity and not opening my eyes for 3 months. I still could not walk, talk or feed myself. A week later it was Christmas day, while there was a slight improvement, I spent most of it asleep.\n\nThings continued to improve slowly, I was able to wear my normal glasses, my voice changed from a whisper to a soft-spoken tone and I was able to move around by myself as long as I could hold things to keep me steady. I was desperate to get some of my independence back. Between wanting to get some control of my life back, the effect being ill had on me mentally and the body dysmorphia from losing so much weight, this is when I developed anorexia. I took control of what I was eating but I was only truthfully eating one meal a day. Two months later I was referred to the children’s mental health service and given the diagnosis of anorexia.\n\nHomeopathy has been the only thing that has worked for me. I know people are skeptical, especially the NHS, but I know this is what helped me.\n\nThe children’s mental health services weren’t very helpful. They did not know how to help me, they did not believe or understand how ill I had been. They wanted me admitted to a Psychiatric Unit away from home which my parents fought hard to prevent.\n\nWe made plans to go to Tenerife in May 2012 as my mum had promised me when I was ill. The week before we were due to fly, I told my psychiatrist and while she expressed concern about flying, she said she could not stop us. As our flight to Tenerife was early morning, we made plans to stay in a hotel the night before. Just before we were due to leave mum got a phone call from Social Services. My psychiatrist had waited until the last minute to ring social services and tell them that I was at risk. She had told lies and said that I could not walk upstairs without being out of breath. A social worker and police officer came to speak with my mum and dad to prevent us from going. I demonstrated that I had no problems with the stairs and initially they had no problem with us leaving. However, when they rang their manager the psychiatrist had put in a first stage referral which meant they could not allow me to leave. I was distraught as was my sister. I had been working towards this holiday for weeks.\n\nWe spent several hours in discussion with the social worker, police and my doctor. Eventually, they were able to get in contact with my Paediatrician who made arrangements for me to have my bloods done and if they came back within normal limits, we would be able to go on holiday. As my dad and I left for the hospital my mum had to sign a form which stated that if they took me on holiday without consent from the hospital both my sister and I would be taken into care.\n\nLuckily, we got to go on holiday, but the consequences of what my psychiatrist did were massive. I developed trust issues and refused to go back to see her again. I was eventually referred to a children’s mental health service further afield, but the damage had been done. I did not trust anyone. I could not speak to them as I was frightened, they would use it against us, and I no longer felt safe in my own house.\n\nLater that year just by chance my parents found out that they had been investigated twice for Fabricated and Induced Illness. They tried to protect me from what they discovered but I understood enough. After that, I stopped trusting any of the medical professionals.\n\nDuring 2014 my mental health suffered greatly. The stress of trying to do my end of school exams and the realization that I would have to do them over 2 years while everyone else in my year moved to college or 6th form had a huge impact on me. For the previous 2 years, I had maintained a low weight, but things started to go downhill. My intake took a hit even though it was already low and as prom came around both my weight and mental health deteriorated.\n\nProm was not a great experience. What should have been a special occasion made me realize how alone I was. It made me realize how much my friends had moved on, grown up and grown away from me. I was with old friends, but I felt isolated. I didn’t know what they were talking about or what they had been doing. I hadn’t spent much time with them since I took ill. That night I left crying. For me this is the hardest part of being ill, friends move on and you get left behind.\n\nMy mental health started to deteriorate even further. Doctors were concerned but my sister and I were part of my brother’s wedding and I needed something to keep going. The week of the wedding I hit an all-time low. I joined in on the day, got ready with everyone else and spent the day celebrating but through it all, I barely ate or drank.\n\nAfter the wedding I crashed big time. I don’t remember the 4-hour journey home. A wheelchair was needed for me to leave the hotel. Living off adrenaline on the day of the wedding had wiped me out. I was back to sleeping 20+ hours a day. My weight was so low that my parents had to get nutrition into me. It would take them an hour to wake me up and I would suffer awful leg cramps and a new symptom appeared – retching. Every time I was woken up I would retch and have cramps. My dad would rub my legs and my mum would use fizzy sips or ice cubes to help.\n\nWith an enormous amount of help and time off my mum my weight stabilised. However, during this period my sleep took on a different stage, I turned night into day. I would get up at 10pm when my sister was going to bed and go to bed at 7 am when she was getting ready for school and I couldn’t control it. For 6 months my mum stayed up with me every night because I was struggling with my walking again but also to supervise my food intake. By the time I had my days back to normal I had reached a healthy weight. We went on holiday, got a new puppy and I kept myself busy with crafts. I still needed daytime naps but it was about 2-3 hours which was manageable.\n\nThings did not remain stable for long. Loneliness paid a huge part in my mental health going downhill again. My nephew was born at 27 weeks, we lived too far away to help, and we did not know if he would live. My 18th birthday was coming and we were moving to a new house. People who I had been with at school with were having uni interviews. I needed to be in control again so my food intake dropped and things deteriorated quickly. My mum tried to get me help but was unsuccessful. Due to my age, I was in a crossover period from children’s services to adult services, so my psychiatrist did not see me. It was as if I had been forgotten about.\n\nBy Christmas, things were really bad. I was put on antidepressants over the telephone but Christmas was spent crying and tense for all the family. It got to the point where I didn’t care if I lived or died.\n\nFor several months we asked for help. My mum and my GP managed me at home but by May 2016 my weight was critical and my mum had me admitted to hospital where everyone was surprised it had been allowed to go on as long.\n\nThe hospital admission was to a busy medical acute ward. For someone with ME, this was the worst thing that could happen. The noise, light, early mornings, constantly being woken up had a huge impact on me. By the time I had been there a week, things had become very scary. I don’t remember much about it.\n\nOnce I started refeeding, I developed refeeding syndrome and my cognitive abilities deteriorated. I suffered from severe hallucinations and my mum and dad were called out during the nights to settle me down. I was detained under section 2 of the mental health act. As I wasn’t medically stable enough to be admitted to an eating disorder ward, I remained on the general medical ward for 4 weeks. I was then moved to an acute mental health ward to continue to stabilize and wait for a bed to become available at a specialist eating disorder unit.\n\nWhen I went to the eating disorder ward I really struggled. It was nearly 3 hours away from home and for someone who has been housebound and only with my parents for years the change felt impossible. The routine is so strict that I couldn’t sleep the way I needed to. Whilst there I was detained under section 3 of the mental health act and put on continuous feed through an NG tube. The months there were tough, to say the least. It was only after a scare with my iron level which happened when a feeding tube was pushed back in and I had to be transferred to a general ward with a stomach bleed and severe anemia that things turned around. I decided that I had to do whatever was needed to get better. I missed a family wedding and my grandad’s birthday. I was determined to get home and stop missing out on life.\n\nIt got to the point where I did not want any more tests because every test came back negative and this knocked me further down. It got to the point where the doctors had me questioning myself as to whether I was subconsciously making it up. It was only after the pain in my foot got so bad that I couldn’t walk that I finally went to the doctors. I was sent for an x-ray and was seen by orthopedics. I have a damaged knuckle and cartilage in my second toe on my left foot, not helped by my low bone density. I’d had it for 18 months before it was diagnosed. It was a huge relief to discover I was not making it up.\n\nOther things are now getting looked at, people are now taking me seriously. I have problems with my shoulder, I am being investigated for milk intolerance, waiting for a referral to a neuro-physio for problems with my hips and legs. After a sleep study I had done, my neurologist diagnosed me with an ‘atypical narcolepsy type sleep disorder’ and started me on medication to help my energy levels. I have now been taking the new medication for just over 2 months. Already there has been a noticeable increase in my energy levels and how much I am able to do.\n\nI was told that I was tired all the time because of my lack of nutrition and that I was probably sleeping to avoid eating. While I am now able to manage my tiredness, I still have days where I can struggle to find the energy to get off the couch. Days where I need naps and even days where I have to go back to bed. Now I know that if I take that day or a few days and listen to my body and either rest or sleep then I’ll stop a full-blown relapse which is what happens when I try to continue as normal\n\nSince my discharge from hospital, I have taken my driving test and passed the first time. To be able to achieve something that people my age are doing felt amazing. I have bought myself a dog, a Shih Tzu called Mia who gives me a reason to keep fighting and to stay well.\n\nI was cleared to do some form of exercise and decided to try and see if working out would give me an outlet for my mental health and if by getting stronger it would make me feel better. I had to take breaks during it but I quickly found that I enjoyed the feeling of getting stronger. Every time I progressed it gave me a sense of accomplishment and mentally that made me feel good.\n\nFor the past 2 years, I have been consistent with working out, advancing as I can. I have had weeks where I could not do any because of being ill, but I have always got back into it because mentally it keeps me on track.\n\nIn May, a year after going into hospital, I started my own small baking business. I created a website and started taking a few orders. I do what I know I am capable of and some weeks I can’t do much but it’s something to keep me going. We got back to Tenerife and finally had some good family holidays.\n\nLast year we spent 10 days in Toronto and visited Niagara Falls. It was an incredible experience and the fact that both mentally and physically I was able to do it was life-changing. I used to stick to the same place as I don’t like change. The anxiety of the unknown was too much and while it was scary at first, being able to experience a new place, to get to see Niagara Falls and travel, which is one of the biggest things I want to accomplish in life, made me realize that if I could push through that anxiety there would be so much more for me to experience.\n\nI was able to attend concerts with my sister and I even met Demi Lovato last June. Last year I started an online course in Event Planning and I’m now nearly finished and thinking of what’s next in terms of my education.\n\nIn December my sister and I got a tattoo in memory of my neighbor who was like a grandma. It had been 10 years since she died, and it felt right for my first tattoo to mean something significant.\n\nFor my 21st birthday, we took a trip to Iceland, another new place and just as scary, but once again it was amazing. While it was too cloudy to see the northern lights, we experienced a snowstorm, took a trip around the golden circle and visited the blue lagoon. It is somewhere I plan on returning to.\n\nNow I am in Chicago another place I have never been. It was important to me when I agreed to tell my story that I included every aspect of it, including my mental health problems. While this is just a brief overview, it’s not something I’ve really talked about. For a long time, I felt ashamed and weak for how bad things got.\n\nBut I know of people who are like me, who struggle with mental health problems as well. The effect being ill has on people’s mental health is significant. I know of people who suffer with really bad anxiety, depression, eating disorders and some people who have even tried to take their own lives. It’s something that needs to be talked about so people know they are not alone and it does get better.\n\nFor me, the treatment by health professionals made my mental health worse, and I’m sure it is the same with many others. None of us choose to be ill and the life we have to lead now can be difficult to cope with, but it won’t always be that way. I spent so many days endlessly crying and feeling numb and wanting things to end that I never thought I would smile or laugh again.\n\nIt’s taken me 8 years to get where I am now. I still have a long way to go, but I now have a smile on my face most days. It took me a long time to accept that while it wasn’t the life I thought I would have, it was still possible to have a life and not just exist.\n\nI wanted to help people who are like me to raise awareness of a situation people don’t want to acknowledge.\n\nWhile vaccines save more lives than they damage it doesn’t make us any less important.\n\nI also did this in the hope that by telling my story it would help me accept it a bit better. I still struggle with the fact that this is my life. Every relapse, every time I’m ill and I struggle to recover it knocks me mentally. So, while I don’t have the life I thought I would, I’m working to build a life around my illness, to manage my illness and get the most out of life that I can.", "opengraph": {"locale": "en_US", "type": "article", "title": "Cervarix Transformed My Life - SaneVax, Inc.", "description": "Lucy tells her story to help people in similar circumstances raise awareness of a situation people don’t want to acknowledge. She says, \"While vaccines save more lives than they damage it doesn’t make us any less important.\" ", "url": "https://sanevax.org/cervarix-transformed-my-life/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2019-08-29T03:19:46+00:00", "image": "https://i1.wp.com/sanevax.org/wp-content/uploads/2019/08/Lucy-102-1.jpg?fit=350%2C350&ssl=1", "image:width": "350", "image:height": "350", "image:type": "image/jpeg"}, "tags": ["cervarix", "Cervarix injuries"], "tweets": [], "movies": [], "links": ["https://i0.wp.com/sanevax.org/wp-content/uploads/2019/08/Lucy-101.jpg?ssl=1", "https://i0.wp.com/sanevax.org/wp-content/uploads/2019/08/Lucy-103-1.jpg?ssl=1", "https://i0.wp.com/sanevax.org/wp-content/uploads/2019/08/Lucy-102-1.jpg?ssl=1"], "authors": ["Norma"], "publish_date": "2019-08-29T03:19:46+00:00"}