{"result_id": "265027", "URL": "https://sanevax.org/media-about-sanevax/who/", "timestamp": "2023-04-25 17:02:30 CEST+0200", "meta": {"description": "Who We Are,The SaneVax Team. To promote only Safe, Affordable, Necessary & Effective vaccines and vaccination practices through education and information.", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/media-about-sanevax/who/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "Who We Are", "cleaned_text": "Who We Are – The SaneVax Team\n\nThe Sane Vax Mission is to promote only Safe, Affordable, Necessary & Effective vaccines and vaccination practices through education and information. We believe in science-based medicine. Our primary goal is to provide the information necessary for you to make informed decisions regarding your health and well-being. We also provide referrals to helpful resources for those unfortunate enough to have experienced vaccine-related injuries.\n\nNorma Erickson, President of SaneVax (2010-pres), was once a freelance writer and independent business consultant. Her primary concentration was providing information surrounding the vaccination controversy. Being a firm believer in fair and balanced journalism, research and fact-finding were always top priorities. The discoveries made during that research led directly to the concept and creation of SANE Vax, an organization dedicated to creating a world where only Safe, Affordable, Necessary and Effective vaccines are allowed.\n\nShe strongly believes every medical consumer has the right to complete and accurate information regarding the risks as well as the benefits of vaccines prior to deciding whether a particular vaccine is right for them. Her personal mission is to provide that information in a clear, concise, easy to understand format, so people are able to make informed decisions about their health and well-being. She can be reached at admin@sanevax.org\n\nFreda Birrell, Secretary of SaneVax (2010-pres), was private secretary/executive officer to a Professor at the University of Edinburgh before re-marrying and settling down on a farm in the Scottish Borders. She worked part-time just to keep busy in a small agricultural seed merchant’s office close to her home but is now officially retired. Her mission is to educate people in the United Kingdom about the harm HPV vaccines are causing throughout the world. She also works to educate politicians as to the need for formal investigations regarding the safety and efficacy of HPV vaccines. Freda’s primary concern is for the safety and well-being of all children and young women who have suffered adverse events following HPV vaccination.\n\nShe can be reached at info@sanevax.org\n\nLinda Thompson, Treasurer of SaneVax, Inc. (2010-pres) Linda has been the treasurer of a non-profit organization for several years. Her familiarity with the rules and regulations a corporation organized under the IRS 501 (c)(3) guidelines is an invaluable asset to the SaneVax Team. Her personal mission is to help make sure everyone around the world has adequate information with which to make an informed choice when it comes to any medical intervention, vaccines included.\n\nSteve Hinks, Director (2018-pres), Retired UK Health, Safety, Environment & Corporate Social Responsibility Manager for an international blue-chip manufacturing company. He is the father of a daughter who was very seriously injured by HPV vaccine in 2011. His family was unjustly accused of fabricating/inducing her illness (FII) and subsequently investigated by Social Services, twice. He is also the Vice Chair and co-founder of the UK Association of HPV Vaccine Injured Daughters (AHVID) together with Freda Birrell (Chair), an organization with over 560 members, all with an injured child. Steve is dedicated to helping parents worldwide avoid the experiences his family has endured after participating in an HPV vaccination program.\n\nAll content featured or displayed on https://sanevax.org and any of its domains, including, but not limited to text, graphics, photographs, images, moving images, sound, illustrations and software (i.e. “content”) is owned by S.A.N.E. Vax Inc, its licensors, and/or its content providers. All elements of the site(s), including, but not limited to, the general design and content are protected by copyright, moral rights, and other laws relating to intellectual property rights. Except as explicitly permitted by SaneVax, no portion or element of the site(s), or its content may be copied or retransmitted via any means. The site(s) their content and all related rights shall remain the exclusive property of SaneVax, unless otherwise expressly agreed. Content downloaded for personal non-commercial use and not for further distribution/dissemination in any medium, is permitted.\n\nCopying and use of the content of any linked site is subject to the control of the owner of that site. Links to third party sites are provided only as a convenience and do not imply endorsement by SaneVax, affiliation with SaneVax, or endorsement of SaneVax by the owner of the linked site. SaneVax is not responsible for the content of any linked site, or any consequences of making the link.", "opengraph": {"locale": "en_US", "type": "article", "title": "Who We Are - SaneVax, Inc.", "description": "Who We Are,The SaneVax Team. To promote only Safe, Affordable, Necessary & Effective vaccines and vaccination practices through education and information.", "url": "https://sanevax.org/media-about-sanevax/who/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:modified_time": "2018-10-09T04:44:34+00:00", "image": "https://i0.wp.com/sanevax.org/wp-content/uploads/2012/06/norma_011.jpg?fit=200%2C182&ssl=1", "image:width": "200", "image:height": "182", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/sanevax.org/wp-content/uploads/2012/06/norma_011.jpg?ssl=1", "mailto:admin@sanevax.org", "mailto:info@sanevax.org", "https://i0.wp.com/sanevax.org/wp-content/uploads/2011/07/Linda-Thompson-06.2011.jpg?ssl=1", "https://sanevax.org/"], "authors": [], "publish_date": null}