{"result_id": "265021", "URL": "https://sanevax.org/vaccine-safety-news-from-finland-to-sanevax/", "timestamp": "2023-04-25 17:02:21 CEST+0200", "meta": {"description": "Citizens disagree with Finnish health authorities regarding the safety profile of vaccines based on an internet-based questionnaire conducted by a local patient support group.", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/vaccine-safety-news-from-finland-to-sanevax/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "Vaccine Safety News from Finland to SaneVax", "cleaned_text": "Citizens disagree with Finnish health authorities regarding the safety profile of vaccines based on an internet-based questionnaire conducted by a local patient support group.\n\nA support group comprised of vaccine-injured and their families in Finland circulated an internet-based questionnaire to find out if there could be an association between vaccinations and healthy children or adolescents/adults falling ill. Once the results were compiled and analyzed, it was impossible for them to find a medical professional willing to help them get the results published in a peer-reviewed medical journal.\n\nThey contacted academics from their own country and abroad. All of those contacts agreed that the study has been conducted well and that it deserved to be published, but none of them were willing to co-author the manuscript because of the controversial nature of the topic. In other words, they were afraid of being bullied and losing their position.\n\nIn addition, the parents contacted and shared their results with leading health officials and politicians in order to promote honest public scientific discussion regarding vaccine safety in Finland. Since this did not lead to any concrete actions, the parents completed a literature search on their own as well as translating their abstract and full study report to English by themselves. Both are attached below.\n\nIn short, 129 injured persons, or their caretaker completed the questionnaire (incl. 33 items of detailed, multiple-choice questions). Results of the survey concluded:\n\n”Based on this questionnaire survey the temporal association between vaccinations and the onset of multifaceted neurological and neuropsychiatric symptoms is evident. It is unlikely that this finding would be only a coincidence since similar cases as observed in this study (around all parts of Finland) have been reported also elsewhere in the world (1-6). The true causality is supported also by the emerging number of research papers published the medical literature (e.g. 7, 8) according to which aluminum and other vaccine ingredients may cause multi-path autoimmune diseases.”\n\nFinnish authorities denied even the possibility of true causality and, thus, have not considered necessary any public discussions or actions that would help the injured in any way. They claim e.g. that HPV-vaccines are safe based on their own nationwide register cohort study and neglect the results of the internet-based questionnaire conducted by Finnish parents, who have questioned the reliability of the authorities’ study, published in Vaccine Journal (https://www.ncbi.nlm.nih.gov/pubmed/30115524).\n\nThe injured and their families have heavily criticized the authority driven register-based study stating HPV-vaccines are safe. Instead of counting how many previously healthy persons become seriously sick after vaccination the authorities chose only selected diagnoses for their statistical analyses. Taken that most of the affected persons suffer from several different symptoms with varying severity along time and that the persons experiencing similar symptoms may have different diagnoses, the negative association found by the authorities did not come as a surprise to the parents. In parents opinion, this kind of study design and statistical analysis is not reliable.\n\nThe peer support group of Finnish families have undergone a fierce debate with their national authorities and main policymakers as they wrote in the following letter to SaneVax:\n\nWe are writing to you on behalf of over 200 Finns, who signed the complaint on the poor management of suspected vaccine injuries to our national authorities. The report of our internet-based questionnaire was attached to the complaint and by now it is available also in English language (attached to this letter). Next, we try to explain in short what we have done to get help to hundreds of persons with ’mysterious’ symptoms. On May 2018 we sent a letter (with over 200 signatures) to all authorities that are responsible for the situation of vaccine-injured people and their maltreatment. We asked them to help these families. Our mission was to show with the results of our Questionnaire, how similar the affected persons’ situations and symptoms are, and also how nobody gets help. Doctors don´t admit vaccine injury, they don´t know how to diagnose those symptoms and they don´t give any treatments or compensation, either. We also asked questions, how ethical is it to give HPV-vaccine without informed consent and to advertise it is safe and effective and leave the decision to 12 years old girls? We asked for a meeting where we could come together to start a conversation and try to find some solutions. The leader of National Institute for Health and Welfare, The Minister of Social Welfare and Health, The Minister of Family Affairs and Social Services, The Director-General of Finnish Social Insurance Institution and The Director of Finnish Medicines Agency got our letter. They answered to us that there is nothing to worry about, everything is under control and that they have just made a big study, where they have proven that the HPV-vaccine is very safe and effective. They pointed to their nationwide register-based cohort study (https://www.ncbi.nlm.nih.gov/pubmed/30115524). It was a very shameful answer, not only because we didn´t talk only about HPV-vaccine injured children and adolescents, but also about healthy adults, who were injured after numerous different vaccinations. When we got their last email, we decided to send a complaint to Finnish Chancellor of Justice. We complained regarding these authorities and problems in the National Vaccine program. The complaint was left on the 2nd of November 2018. A few weeks ago, we got a very disappointing answer from the Chancellor of Justice; He is not going to take our case under his investigation!! He gave a statement, that he can´t estimate the safety of vaccines and he hasn´t noticed any procedure that could be against the law or any failures of duty. Nevertheless, we are not going to give up, since our own lives and our children’s lives are at stake. We wish to do our part to increase the general awareness among ordinary people by sharing our story and the results of our survey with as many people as possible. Thus, we would be grateful if the English version of our study report would be published on Sanevax site. The original report (written in the Finnish language) will be published in Finnish social media. With kind regards on behalf of over 200 signers,\n\nAccess the questions included in the survey here.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Safety News from Finland to SaneVax", "description": "Citizens disagree with Finnish health authorities regarding the safety profile of vaccines based on an internet-based questionnaire conducted by a local patient support group.", "url": "https://sanevax.org/vaccine-safety-news-from-finland-to-sanevax/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2019-09-08T23:59:45+00:00", "article:modified_time": "2020-06-02T18:51:34+00:00", "image": "https://i1.wp.com/sanevax.org/wp-content/uploads/2013/02/vaccine-fix.jpg?fit=216%2C216&ssl=1", "image:width": "216", "image:height": "216", "image:type": "image/jpeg"}, "tags": ["vaccine safety"], "tweets": [], "movies": [], "links": ["https://pubmed.ncbi.nlm.nih.gov/30115524/", "https://pubmed.ncbi.nlm.nih.gov/30115524/", "https://sanevax.org/wp-content/uploads/2019/09/Questionnaire-Abstract-2019.pdf", "https://sanevax.org/wp-content/uploads/2019/09/Complete-questionnaire-paper-2019.pdf", "https://sanevax.org/wp-content/uploads/2019/09/Questions-on-the-survey-2019.pdf"], "authors": ["Norma"], "publish_date": "2019-09-08T23:59:45+00:00"}