{"result_id": "265007", "URL": "https://sanevax.org/anti-vaccination-is-expected-consumer-behaviour/", "timestamp": "2023-04-25 17:02:06 CEST+0200", "meta": {"description": "Anti-vaccination in India? The authorities are now in a quandary as social media in India is abuzz with parents discussing the risks of vaccination and the many scandals associated with it.", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/anti-vaccination-is-expected-consumer-behaviour/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "Anti-vaccination is expected consumer behaviour", "cleaned_text": "How would you act if you have decided to buy a car? You would probably visit the car showrooms, talk to the salesmen, collect literature on the cars, visit other showrooms, search the internet, talk to people who have purchased cars, exchange ideas with your friends, talk to the mechanics, and find out more from people who have faced problems with a particular brand. You would also be concerned about the performance and the safety features and wonder if they are up to the advertisements and sales pitch. Pretty much normal, is it not?\n\nCar manufacturers take it on their stride. They know that this is a typical consumer behavior pattern. The consumers are choosy, picky, and try to have the best value for money. They have distinct individual needs and choices that have to be met in order to stay afloat and be profitable. The manufacturers respond by manufacturing quality cars that are better than the competitors’ and take great care to ensure that both performance and safety aspects are above reproach.\n\nWhat if complainants are arrested?\n\nBut what if the car manufacturers had an association and a huge well paid political lobby that ensured there was no competition? What if they were connected to the service industry that is wholly dependent on faulty cars? What if the car mechanics were taught by the marketing wing of the industry and not by engineers? What if all the salesmen and mechanics were given licenses that could be revoked if they did not speak the same language? What if the car accidents and lives lost due to that brand are assigned other causes? What if there is a long list of such crashes and casualties that are never acted upon?\n\nWhat if regular wrongdoings and serious lapses within its factories are regularly exposed by whistle-blowers? What if the way they bribe and cajole key decision-makers become public? What if the highest court of the country delivered its decision that the car was unavoidably unsafe and therefore granted the company absolute indemnity from lawsuits? What if the manufacturer claimed the car would work properly only if more than 95% of the population purchased it? What if those who have faced serious problems with the brand are forbidden to speak out? What if those who speak against the brand are arrested? What if there is a gag order on mechanics perceiving trouble and who are eager to point it out? What if those who fought against this system be dubbed anti-car, anti-science and demonized?\n\nYou would then be dealing with a cartel: a cartel that would take the decisions and force them upon you. You would end up with products you do not want. Products that would neither perform nor be safe, for these would not be ensured in such a situation, simply because they would not matter.\n\nThe movement against vaccinations, both by victims as well as by discerning doctors, is based upon this consumer behavior pattern. The adverse effects can no longer be hidden. There is no incentive to ensure safety or efficacy. The rush to fulfill targets has thrown caution to the winds. An inherently risky product is being sold like chocolates in the private sector. Monitoring committees and institutions have always abdicated their responsibilities. Voices of doctors and scientists are being ignored. Everything that can possibly go wrong has happened.\n\nAlarmed by developments, people are now comparing products, reading the package inserts, logging on to the internet and discussion boards, social media; they are talking to parents whose children have suffered adverse reactions, and they are reading books and watching films that give a glimpse beyond the hype. Doctors and caregivers of affected children are trying to reach out to stem the rot and are conducting research and studies that try to pinpoint the truth and objectively address the problem.\n\nAs a result, parents and the public are finding out more than they bargained for. They are reluctant to subject themselves and wards to serious risks but are facing mandates. Censorship is being imposed. Books and videos critical of vaccines are being pulled out. As a result, protests are ensuing. What is wrong with this scenario? Need we be worried? For the industry and its marketing wing, it would be a problem no doubt but others should welcome this trend. The spirit of inquiry has at last reached the common population.\n\nIt has been pointed out that the anti-vaccine crowd is mostly a bunch of panicked ill-informed mothers. That allegation is partially true. The mothers have panicked and they are asking questions. The questions they ask stem from innate common sense, gut feeling and unconditional love for their children. They also observe and believe their eyes and ears. These are strange parameters for the scientific community who are trained to believe statistics; statistics that emanate from chosen institutions and not from their own studies and observations.\n\nWhat questions are these mothers asking?\n\nThey want to know what is being injected into their children. They want to know if it is safe to inject studied and well-known poisons into pregnant women, preemies, infants, and children. They want to know if unbiased safety studies have been conducted on vaccines; if the 69 to 72 shots routinely recommended have been studied for their combined impact. They want to know if the persons recommending and mandating them are objective and free from conflict of interest; whether the doctors injecting them are profiting from them. They want to know if the industries manufacturing them have a track record of honest dealings and safe manufacturing practices.\n\nThey want to know if children are getting hurt. They want to know if those incidents are being acknowledged and corrective actions being taken. They want to know the nature and frequency of such injury; whether there is any protocol to treat such children. They want to know the long term impacts. They want to know how the parents of injured children are faring. They want to know if the epidemics of serious chronic diseases and disabilities being observed in children and adults alike are in any way connected to the increasing list of vaccines being forced upon them.\n\nSome among them with a science background are also asking other common-sense oriented questions. What is natural immunity? What is cellular immunity? Is wild infection and vaccination the same? Do preemies and infants produce antibodies? At what age does the immune system mature? At what age does the myelin sheath develop fully to try and protect from neurotoxins? Can vaccine immunity last a lifetime and can a mother pass on the artificial immunity to her child?\n\nVaccines create antibodies. Do antibodies protect from disease? There are many ingredients in vaccines. So what happens to the antibodies to the other ingredients and can they disrupt the functioning of the body? Why do vaccinated populations come down with the diseases they are vaccinated against? Why booster shots are regularly needed? Is herd immunity real or is it a marketing gimmick? Do the diseases vaccines exist for present a grave threat or do they serve some purpose? Is the incidence really so extensive or is it hyped? Are there other less controversial and safer means to tackle them?\n\nWhy do we need to be frightened of only those diseases for which vaccines exist? How can an unvaccinated child who does not have the disease pass it on to a vaccinated child? Whether a recently vaccinated child can carry and shed the virus or bacteria and infect another and thus be a real problem? If health has to be ensured why are we not mandating nutrition and exercise instead? What do doctors and medical scientists critical of vaccines have to say?\n\nWhat is wrong with questions?\n\nThese are questions that every medical undergraduate ought to ask. If they are not then is there something wrong with the education system?\n\nMothers are not interested in compensation. No mother would like to be in a situation where they have to demand compensation for a dead or injured child.\n\nAnd from whom are they asking questions? From a system that takes great pains to point out ad nauseam that it is immaculate and scientific; the governments they vote for; and doctors who have pledged to do no harm.\n\nWhat is the situation on the ground that troubles Indian parents? The Indian crowd has been oblivious to the worldwide anti-vaccination movement due to its inherent trust of both the government and the scientific community post-independence. The intense controversy over the smallpox vaccination deaths and adverse effects died down with a disgusted Gandhi who exposed the vaccine and declared himself “anti-vaccine”. The 15-year-old ICMR trial prompted by a questioning Governor-General that found the BCG vaccine was 0% effective, and the spate of encephalopathy, neurological disorders, and spasticity associated with the DPT vaccine was kept away from the public gaze.\n\nIt was with the OPV vaccination, widely condemned by concerned doctors and medical scientists in India and which received media attention that first stirred the complacent crowd. The doctors of the country were aghast that 32,419 cases of polio worldwide, around 12,000 in India, was inflated to 350,000 to justify a vaccine that was clearly linked to paralysis and had been blamed for causing cancers being associated with simian virus contamination. They woke up to vaccine politics that had already been pointed out by vaccine activists.\n\nThe public concerns over vaccination really began when children started dropping dead like fleas following the introduction of the Pentavalent vaccine in India. Doctors calculated that around 8,100 children could be dying annually from this vaccine alone. Parents began avoiding vaccination drives alarmed by reports of deaths. They were in for a rude shock when doctors revealed that the WHO had changed its reporting protocol such that the deaths could not be ascribed to the vaccine. The Indian media, most reluctant to highlight vaccination issues, began writing on them after a senior editor of the Times of India was awakened by the death of his brother to the yellow fever vaccine.\n\nConcern over measles vaccination deaths and the surprising inaction grabbed media headlines. The unjustified closure of Indian public sector units producing vaccinations stirred up a controversy. Doctors alleged this move was to favor private vaccine manufacturers. The introduction of the Hep-B vaccine for a disease that infected promiscuous adults and drug addicts into the childhood schedule was opposed. It was also pointed out how a vaccine for Hib was unwarranted as the disease incidence was very low in the country. Doctors warned parents that the chickenpox vaccine being advertised for “relief from pockmarks” was unnecessary. News stories about spastic and autistic children alarmed parents but they were never exposed to the huge uproar over the Wakefield GMC trial in the UK which grabbed headlines worldwide.\n\nThe introduction of a tetanus vaccine aimed at women and girls of childbearing age and the discovery of the hcg hormone in it prompted NGO’s working in the health sector to start looking at vaccines with suspicion. They filed a case against it in Court but no action emerged from it. The illegal HPV vaccine trial in the states of Andhra Pradesh and Gujarat that resulted in the death of 9 tribal girls further deepened their worries. A Parliamentary Committee Report found the agencies responsible, PATH and ICMR, to be callous and guilty but the case filed in the Supreme Court moves at a snail’s pace and is yet to pronounce justice. It was then that activists turned to what was happening in other countries and became aware that the concern over deaths and serious disability, including infertility after the vaccine was spread across USA, UK, Asia and Europe and had prompted a slew of court cases. The US-based Vaccine Adverse Effects Reporting System records 61,552 adverse effects reported from the vaccine that include 480 deaths, 464 cases of cervical cancer, 6160 hospitalizations, and 9070 serious adverse events from the vaccine up to 14th March 2019.\n\nThis was followed by an era of enforced school-based vaccination campaigns. The JE vaccine campaign in Odisha followed by the MR vaccine campaign across India witnessed child deaths and hospitalizations on an extensive scale. News that a similar campaign is slated to begin with the newly introduced diphtheria and tetanus vaccine has angered parents who retort, “Are our children pin cushions?” The parents were already wary that their wards required vaccine compliance for school admissions.\n\nMany were privy to whisper campaigns that autism which was spreading its tentacles among children in India is linked to the many vaccinations that are administered in infancy and childhood. It was to counter this that doctors began infiltrating autism groups and started assuring them that autism was in no way connected to vaccines and that it was purely genetic. NGO’s workings with the affected children are influenced by funds that flow in their direction and they are forced to toe the official line.\n\nIndependent parents resented this imposition and joined social media platforms to know more on the issue. They were taken aback by what they found. The fact that the US vaccine court regularly compensates vaccine injuries and deaths and has so far paid more than $ 4.06 billion only confirmed their suspicion. Many responded by beginning to home school children to stay away from vaccine mandates.\n\nIndian doctors chipped in by revealing that the culprit was probably the presence of mercury in vaccines. They also pointed out how vaccines were being introduced into the country without any cost-benefit analysis and without regard for the epidemiological trends in the country. The way the CMC Vellore suppressed clinical trial data on the Rotavirus vaccine which was causing an extremely painful and potentially lethal intestinal obstruction in children, and the Government defence that the data could not be released as it would “alarm the public” came as a rude shock which made parents realize that the government was not on their side and that there was an extensive vaccination lobby that cared little about the impacts on children.\n\nThe Indian Academy of Paediatrics has always been very pro-vaccine and perceived to be very close to the vaccine manufacturers. It was tainted by a media sting that revealed it was heavily financed by donations from the vaccine industry. However, it was thoroughly exposed when its senior executive committee member Dr. Vipin Vashistha who is also the principal author of its books on vaccines wrote a public letter to the President alleging that vaccines were being pushed for monetary gains and profits. The media published an article that revealed 15 additional vaccines were pushed privately by doctors and that commissions ranging from 30 to 300% earning Rs. 150 to 2600 from a single vaccine, helped them to an income of Rs. 8100 crores annually as they charge every parent Rs. 25,000 to 30,000 for the shots. Dr. Vashistha was promptly expelled from the IAP after being physically assaulted in one of its programmes.\n\nAn RTI in the year 2018 was even more shocking. The Government had to concede that 10,612 deaths occurred after vaccination during the period 2008 to 2018 and that there were more than 600,000 adverse effects every year. What is worse, it was conceded that no sincere efforts are made to analyze the findings of the reporting system. Upon questioning it was revealed that the revised WHO protocol that left little chance of any death being attributed to the vaccine was being followed; it was insinuated that the deaths and adverse effects were probably coincidental in nature.\n\nWhile the oral polio vaccine is being credited with the eradication of polio in India the steep rise in cases of acute flaccid paralysis, a condition clinically indistinguishable from polio has been a thorn in the side of the establishment. A recent study has analyzed the available data and uncovered that the vaccine has caused 491,704 cases of paralysis in Indian children in the 17 years from 2000 to 2017. While the findings were challenged, the authors of the study have convincingly refuted every allegation thrown at it. The vaccine also courted controversy when it was found contaminated with a strain of the poliovirus that was not supposed to be in it. The steep increase in the incidence of cancers among children and the epidemic of encephalopathy among them that appeared after intensive vaccination drives are yet to be explained.\n\nSensing the mood of the people the vaccine manufacturers of India have launched a campaign roping in the services of popular Bollywood actress Kareena Kapoor. The involvement of high profile celebrities in the country’s vaccination programme is not new but what raised eyebrows was when an eminent member of the IAP declared, “If Kareena Kapoor says vaccines are safe, they are safe.” Is there no other method to ensure the safety of vaccines being produced?\n\nParents in Kerala appealed to the High Court seeking an injunction on the vaccine. The Court responded by ordering that children be vaccinated only after parental consent and that proper records be kept of vaccine batches being used and names of children being vaccinated. A similar case in the Delhi High Court led to a sterner decision that the Government should advertise the risks associated with the vaccine and express written consent is obtained from parents. The vaccine programme had to be kept in abeyance as health officials confessed obtaining the consent of 95% of parents would not be possible if risks are divulged.\n\nWhat is the solution?\n\nThe authorities are now in a quandary as social media in India is abuzz with parents discussing the risks of vaccination and the many scandals associated with it. It feels helpless that the pressures from agencies like the WHO, BMGF and the Unicef stipulating that children be indiscriminately vaccinated with all available vaccines will no longer be so easy to implement. India needs to be extremely wary of the WHO decision to start a grassroots level vaccination campaign involving all players with the slogan “No Right to Refuse” as its imposing agenda.\n\nWhat is the solution? The warnings of discerning doctors have to be heeded and cost-benefit assessment protocols they have proposed to the government from time to time have to be implemented. There should be a strict method of examining all vaccine batches for objectionable ingredients and contamination. Vaccine safety should be a top priority and a compensation system put in place. Vaccine deaths and adverse effects should be actively probed, culprits punished and lapses fixed. Written parental consent after revealing all risks associated with vaccines is a non-negotiable priority. The system should be responsible, transparent, free from conflict of interest, and be answerable to the public.\n\nIt is extremely easy to counter the anti-vaccination movement. Answer the questions. Address the concerns raised. Follow the decisions of the Court. Stay aloof from pressures from international agencies. There is absolutely no need to panic and go into media engineered over-hype.", "opengraph": {"locale": "en_US", "type": "article", "title": "Anti-vaccination is expected consumer behaviour - SaneVax, Inc.", "description": "Anti-vaccination in India? The authorities are now in a quandary as social media in India is abuzz with parents discussing the risks of vaccination and the many scandals associated with it.", "url": "https://sanevax.org/anti-vaccination-is-expected-consumer-behaviour/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2019-08-29T01:54:19+00:00", "image": "https://i2.wp.com/sanevax.org/wp-content/uploads/2011/07/india11-e1378410931484.png?fit=218%2C200&ssl=1", "image:width": "218", "image:height": "200", "image:type": "image/png"}, "tags": ["vaccine risks", "anti-vaccine movement"], "tweets": [], "movies": [], "links": [], "authors": ["Norma"], "publish_date": "2019-08-29T01:54:19+00:00"}