{"result_id": "265045", "URL": "https://sanevax.org/hpv-vaccine-controversy-danish-perspective/", "timestamp": "2023-04-25 17:02:55 CEST+0200", "meta": {"description": "Dr. Gerdes wrote this letter hoping to shed some light on the very real consequences many Danish families were forced to deal with post-HPV vaccine use.", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/hpv-vaccine-controversy-danish-perspective/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "HPV Vaccine Controversy: A Danish Doctor's Perspective", "cleaned_text": "[Note from SaneVax: The HPV vaccine controversy has been raging since the FDA approved Gardasil in 2006 in virtually every country utilizing this new medical intervention. Dr. Stig Gerdes wrote this open letter to Danish Health authorities, the medical community, and local journalists hoping to shed some light on the very real consequences many Danish families were forced to deal with post-HPV vaccine use. Unfortunately, for medical consumers, the letter below was written well over two years ago. HPV vaccine stakeholders are still trying to deny the facts Dr. Gerdes was courageous enough to put in writing. The letter is printed in its entirety below with permission from the author. The SaneVax team would like to thank Mie Thorsen for providing the translation to English.]\n\nThe pharmaceutical industry, The Danish Health and Medicines Authority, The Ministry of Health, The Minister of Health, Cancer Inc., Statens Serum Institute and The Regions are panicked at the low coverage of the HPV vaccine, which is now below 25%. Cancer Inc. has hired a company “Focus” to make phone calls to parents with the following message: “Your daughter is turning 12 years old this year, and she must have the HPV vaccine.”\n\nThe Minister of Health recently announced that something must be done to raise the vaccination coverage. This is the same Minister of Health who was against the HPV vaccine before she became the minister.\n\nDo all of these agencies not understand that Danes can think for themselves? No one will let their children or themselves vaccinate and risk being destroyed by the side effects caused by a totally unnecessary and sparsely documented vaccine.\n\nThe HPV vaccine damaged are ridiculed, ignored, viewed with suspicion, and left to stand completely alone with their disease without help from our health care system.\n\nThe 5 HPV centers release the sick girls quickly while referring them to the Center for Functional Disorders without investigation or treatment. It’s a huge “blunder” that the health service in Denmark relegates the HPV vaccine injured to the psychiatric category of enfant terrible “Functional Disorders”! (Note: Enfant terrible means a child whose inopportune remarks cause embarrassment.) By doing so, the authorities avoid potential compensation because the disease is psychological, not triggered by the vaccine!\n\nIt should be known that Merck, the manufacturer of the HPV vaccine Gardasil, has stated in their Gardasil Product Information Leaflet, that there are over 45 side-effects which may be experienced after Gardasil injections and that this occurs in 3.2% of those injected and that 1/3 of these are serious (life-threatening) side effects. Despite this, The Danish Health Authority wants concrete medical evidence that it’s Gardasil that triggers these serious side effects in some of the vaccine users. Merck’s own figures correspond to Denmark’s experience in that about 20.000 youngsters have side effects, including around 6-7000 so serious that the survivors end up confined to bed 24-7.\n\nThe proponents continue to argue that the FDA and EMA (National Board of Health in the US and Europe) claim there are no serious side effects caused by Gardasil. But, their statements are based on a false premise. Furthermore, they keep saying that the advantages outweigh the disadvantages, despite all evidence to the contrary.\n\nGardasil contains among other things aluminum adjuvant nanoparticles, and it is this that promotes negative side effects by hitting the mitochondria, triggering autoimmune reactions, and interfering with the body’s hormones which regulate metabolism and menstruation. One of the symptoms frequently exhibited is severe tiredness. The pregnant have an increased tendency to miscarriages and often give birth early in the week from 24 to 28. Furthermore, the risk of experiencing cell changes in the cervix is increased by 45%, when you get vaccinated, if you have HPV virus in the body before vaccinated.\n\nThe nano-adjuvanted aluminum particles are so small they can pass through the blood vessels into the tissue, pass through the blood-brain barrier and destroy the sections of the brain resulting in neurological failure symptoms such as Guillain-Barré. The particles can also pass from the pregnant mother to the placenta to the fetus. Babies can be born with side effects such as increased irritability, poor sucking ability, severe fatigue, skin changes, and other sequelae. Aluminum nano-particles also can be transmitted through breast milk to the child, so the child’s symptoms gradually get worse if it has side effects at birth.\n\nThe HPV vaccine is not required to prevent cervical cancer. There is no evidence that the HPV vaccines prevent cervical cancer. The HPV vaccine is not tested to see if it causes cancer itself. All women should instead take a pap smear every 3 years from 23 years of age until they die, and a pap smear if they experience unusual bleeding.\n\nIt is possible with current techniques to replace the side effect-causing aluminum adjuvant nano-particles with organic material, for example, leukocytes. HPV vaccines would then have no serious adverse events. This applies not only to the HPV vaccine but all vaccines in the Danish vaccination program. The HPV vaccine incidence of adverse events is 100 fold higher than the other vaccines.\n\nThe disease the HPV vaccine induces is Myalgic Encephalomyelitis (ME), a physical disease triggered by viral infections, bacterial infections, heavy metals, vaccines, trauma and fungi of various kinds. It is important to point out that patients with ME, triggered by heavy metals and vaccines, should not be vaccinated later in life. If they are, it could trigger relapse and/or exacerbation of ME disease.\n\nA lot of research is going on with the HPV vaccine and there will be earth-shattering results for the next 3-6 months. A world congress in Leipzig in March 2016 related to autoimmune diseases revealed this.\n\nThe vaccine should be stopped immediately! There are so many unanswered questions that should be answered before we continue to vaccinate. With each injection, there is a risk of incapacitating a previously young strong human.\n\nChairman of the Civil Rights Movement and General Practitioner", "opengraph": {"locale": "en_US", "type": "article", "title": "HPV Vaccine Controversy: A Danish Doctor's Perspective - SaneVax, Inc.", "description": "Dr. Gerdes wrote this letter hoping to shed some light on the very real consequences many Danish families were forced to deal with post-HPV vaccine use.", "url": "https://sanevax.org/hpv-vaccine-controversy-danish-perspective/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2018-10-10T04:08:32+00:00", "image": "https://i2.wp.com/sanevax.org/wp-content/uploads/2018/10/Stig-Gerdes_2.jpg?fit=300%2C300&ssl=1", "image:width": "300", "image:height": "300", "image:type": "image/jpeg"}, "tags": ["Gardasil", "Denmark", "HPV VACCINES"], "tweets": [], "movies": [], "links": ["https://i0.wp.com/sanevax.org/wp-content/uploads/2018/10/Stig-Gerdes_2.jpg?ssl=1"], "authors": ["Norma"], "publish_date": "2018-10-10T04:08:32+00:00"}