{"result_id": "265024", "URL": "https://sanevax.org/hpv-vaccine-controversy-in-the-uk/", "timestamp": "2023-04-25 17:02:26 CEST+0200", "meta": {"description": "A teenager from the United Kingdom sent the following letter to her headmaster after seeing a huge poster promoting the use of HPV vaccines in her school.", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/hpv-vaccine-controversy-in-the-uk/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "HPV Vaccine Controversy in the UK - % %", "cleaned_text": "[Note from the SaneVax Team: We would like to thank Chloe and Lisa for granting us permission to publish their story. This account should help people remember that every major improvement in the human condition began with a single voice. Hopefully, it will be circulated widely to encourage all those who believe their voice will not be heard.\n\nA teenaged girl from Hertfordshire in the United Kingdom sent the following letter to the headmaster of her school after seeing a huge poster promoting the use of HPV vaccines in her school. Chloe had been suffering a multitude of new medical conditions after taking the full series of HPV vaccines, nearly three years. She viewed the poster, not only as a personal insult, but one that could put her classmates at risk of having an experience similar to hers.\n\nThink about it: How many times have you been confronted with an issue that seemed too big for you to tackle? How many times have you said to yourself, “I am only one person, what can I do?”\n\nHow many times have you remained silent when you felt compelled to speak?\n\nMuch to her credit, Chloe did not stand idly by. She took action. By doing so, Chloe proved to the world that one single voice can make a huge difference. Not only did her headmaster listen, he responded with compassion and concern for Chloe as well as her fellow students.\n\nChloe’s headmaster response shows that when openly communicated with, there are people who listen and respond appropriately.\n\nThis story proves the only voice not heard is the one that is silent.]\n\nMy name is Chloe & I’m one of your Year 11 students. My reason for this email is to tell you that I’ve been extremely upset & feel very hurt that my feelings haven’t been considered regarding having the extremely large promoting HPV vaccine poster up in school. As far as I’m aware everyone in school as in teaching staff & my group of friends know what caused me to become ill. I first saw this poster on Friday & it has been on my mind ever since, I told my parents that I was going to ask who was responsible for advertising within the school & how it had upset me. I felt I needed to deal with this situation myself & not just getting them to call the school. So, I went to pastoral this afternoon, as I wasn’t in this morning as didn’t feel great Sunday afternoon or yesterday at school & hadn’t slept so I came in at break. Mr. ******** saw me in there he came & looked at the poster & said he would talk to you & the caretakers about it. So, I’ve taken it upon myself to email you.\n\nYou probably don’t know me or my background but since having the HPV vaccine in July 2017(when I was in Year 8) I became unwell straight after that vaccine. When I walked in that room to have it, that was the last time I felt 100% well. I kept fainting & feeling constantly dizzy, mum phoned the Doctors to ask if it was a side-effect the following day & was told no by the receptionist. I got worse so went to the Doctors, said my blood pressure was very low but my heart rate was fast & instead of doing a blood test as I hate needles to leave it a few weeks once the vaccine was out of body & hopefully, I would feel better. This didn’t happen I just got worse. Had blood tests & hospital appointments, but still I got worse. I remember my Dad asking the cardiologist at the hospital if I could possibly have POTS as they had been looking into my symptoms & found many girls suffered the same as me after the vaccine & had reached out to others. She basically laughed saying no & to go back in 4 months if no improvement but to drink at least 3liters of water & 10g of salt (this is what people with POTS are told to do) I was so upset as she didn’t help, it wasn’t long after my mum took me back to the see a Doctor as I was getting worse still. He was the best I had seen since our family GP had retired & agreed it was possible that all my symptoms were pointing to POTS so said he would start treating me instead of waiting for tests as I would have to suffer longer & hopefully, I would improve.\n\nI will never forget my Dad talking to the cardiologist after she returned his call when he said he wasn’t happy & that she was lucky he wasn’t putting in a formal complaint about the way she treated us. She said what the GP gave me is what she would have given me if I had I gone back in 4 months to see her. She kept saying sorry to my Dad & asked how he knew so much. He told her had you had a fit & healthy child then they had a vaccine & suddenly became ill straight after & no Doctors are really helping or giving answers wouldn’t u look for answers yourself (I remember my mum looking online while sitting up with me during the nights when I would sit there & cry when I felt so ill & had enough)\n\nWhen Dad asked her if my symptoms were linked to the HPV vaccine, she said it’s thought to be linked but she can’t comment & wouldn’t put it in writing.\n\nWhat hope do people like me have when even Doctors treat us like this???\n\nI lost my last two summer holidays as I was in bed. Before this I was a very active person, I love to dance, do sport & generally be active. But I had to stop dancing which I was really good at & loved doing, I could no longer go to the Gym 2/3 times a week & I loved doing PE but now I have to just sit & watch as my friends all get to do it.\n\nA list of my symptoms (when it started)\n\n*Constantly dizzy (having to hold myself up on furniture as couldn’t stand up)\n\n*Fainting (would lose count this happened lots but I learnt when it was going to happen & sit down)\n\n*Heart palpitations (swear my heart was coming out of my chest & would hurt)\n\n*Tremors in my legs & arms (remember one of the office ladies thought I was cold but it was my tremors)\n\n*Chronic fatigue (literally couldn’t stay awake at my worst point or hold my own head up off the pillow)\n\n*Heat intolerance (I can’t cope with temperature change when I get hot I instantly feel rough & it knocks me back, can take days to get back on track)\n\n*Pale in the face (unable to get a tan at all now)\n\n*No awareness of what’s going on around me, like I go off in my own world\n\n*Unable to stand for anytime (when I’m in science doing experiments, I have to either sit down or lean on the side as it makes me feel rough)\n\nHaving to live with this is hard & I do get upset but I try not to show how upset I am & I’ve not long started seeing the school counsellor, but I haven’t seen her for a while for some reason.\n\nI try to be in school as much as I can. I’m not one of these people that will happily miss school & finger crossed I haven’t for some time. I love being there with my group of friends & when I’m not there I feel more upset. But sometimes it’s been impossible when I’m so ill, I know mum has told school before they are more than welcome to come & see me when I’ve been off really ill.\n\nI’ve been seeing a lady called Rita since July 2018, who specializes in girls like me, damaged from the HPV vaccine. She’s treated hundreds of us. It’s only because I was so ill my mum was searching for something that might help as she didn’t know what else to do & joined a support group & they were recommending Rita. The following day my Dad contacted her & I got a cancellation appointment.\n\nShe’s so lovely & understands how I feel & believes me.\n\nI’m lucky my parents can afford my homeopathy appointments & treatments as some parents can’t.\n\nThere are so many other girls like me, not just in the UK but around the world. And boys also in other countries. I have to remember when I’m down that I’m lucky as I’m not as worse off as others, some paralyzed & others have died after this vaccine.\n\nThere’s a UK Association of HPV vaccine injured daughters (AHVID) they have over 640 UK families on their database, all have injured daughters this includes me.\n\nSomeone I know in another school didn’t have the HPV vaccine, because of what it did to me. A close family member of hers is a GP too.\n\nIt annoys me that my parents get called anti-vaxxers or accused of scaremongering as they aren’t, they have given me every vaccine that’s been on offer & my sisters too. I didn’t want to have the HPV vaccine as I hate needles but my mum thought it was for the best as she had a friend with cervical cancer who’s since lost their fight & she thought I wouldn’t ever get it then, but now we know this isn’t true. There are women that have had the vaccine & got cervical cancer at a very young age, just we don’t really get told about this. My mum now gets so angry with herself that she didn’t look into this vaccine first before making me have it.\n\nAs my parents tell people they’re not telling them not to have the vaccine but to look into it first, although this is now being proved very difficult to look into as many of these sites are being shut down which is very sad, scary & frustrating to me.\n\nThe amount of times I’ve been called faking being ill or people just haven’t believed me is really hard for me to deal with. If only that was true, I would love to feel normal.\n\nNot only do I have to live with the effects but I’m now being reminded of it when I’m in school having this poster in my face.\n\nI cannot stress how much I really want this poster taken down, as I’ve said it’s not nice for me to see & if it’s not I can get some posters made up regarding side effects that I will quite happily print off & stick next to this poster and any others I see around school as I believe people deserve to know both sides of this vaccine. I did say to Mr. ******* if I made some of my own posters would I be allowed to put them up, but he didn’t comment.\n\nThis is something I feel very passionate about & you can’t blame me I’ve lost so much time being ill & even now “I’m ok” (when I say I’m ok I’m not, I’m just the best I have been since being injured by this vaccine & have to get on with it, as I’m sure not everyone wants to hear I’m not ok)\n\nI spoke about this for my English language exam at the end of yr. 10 because I feel people deserve the right to know it’s not all good. I was really proud of it & would have liked you to have heard it, it contained information about the manufacturer of the drug & their previous drugs that got banded.\n\nI’ve got my notes if you would be interested in reading it?\n\nSadly, we all get told it’s a coincidence that we all have pretty much the same set of symptoms after the vaccine.\n\nI hope you can understand where I’m coming from, if not imagine if this happened to your daughter or family member. I just want you to be aware of what your allowing to be advertised in your school as I’m sure if someone was to become ill like me you would feel bad after I have informed you of what has happened to me. Not everyone puts two & two together to realize why their child is suddenly ill.\n\nI’m sorry if you think this email is having a go or comes across harsh or rude to you because that is not my intention, I’m just trying to get my point across. And I’m having to do it in an email as if I just spoke to you the likelihood of me forgetting what I want to say is very likely as my memory or lack of it is one of my symptoms I’ve been left with.\n\nThis email has taken ages from when I got in from school until late & I’ve been very emotional writing it, I’ve cried every time I’ve read back through it.\n\nSo please don’t just ignore it.\n\nBelow I’ve put some links. There’s so much more I could add but thought that was enough for now.\n\nAnyway, thank you for reading this sorry it’s so long & if you would like to talk to me, I would be more than happy too.\n\nA lot of the articles I wanted to add are now unavailable https://www.facebook.com/REGRET.ie/videos/308821073232329?sfns=mo Please, please watch this it has Doctors, parents & girls talking. I think it will help you understand it more. If you can’t view it here look on YouTube for “Our Girls Are Not Rumours” (2018, Ireland)\n\nWhile on YouTube see if it still allows you to watch Sacrificial Virgin documentaries which includes families in UK and Europe as well.\n\nhttp://rita-kara-robinson.com/vaccine-detox-therapy/ This is the lady that is treating me.\n\nhttps://www.independent.co.uk › th…Web results Thousands of teenage girls report feeling seriously ill after routine school cancer vaccination | The Independent Another girl like me\n\nWww.sanevax.org there you will find others like me.\n\nOr click on the link if you have Facebook for their page\n\nThere are case studies of young girls who were seriously injured shortly after the HPV vaccine.\n\nThis is something that my mum needs to do as no Doctor as we are aware has filed a yellow card report for me to date. So how many other people like me, haven’t either so this doesn’t show a true reading. I read somewhere that fewer than 1% of reactions get reported.\n\nGoogle Colton Berrett he was so ill he took his own life https://livelovefruit.com/colton-berrett-another-teen-sacrificed-gardasil-hpv-vaccine-died/\n\n& also look at Christopher Bunches https://christopherbunch.org/christopher-s-story\n\nThere is also a legal case in Maryland, USA which was won by the mum Emily Tarsell whose daughter died. http://www.gardasil-and-unexplained-deaths.com/\n\nhttps://www.chroniclelive.co.uk/news/north-east-news/amy-anderson-cervical-cancer-gateshead-16281350 this lady had the vaccines & still got cancer\n\nWHO Global database of HPV statistics: as of 26thJanuary 2019, the number of Adverse Drug Reactions is 335,580. Now according to the MHRA and VAERS who state openly that reports of adverse reactions to a vaccine may only represent between 1% and 10% of ADR’s being reported. Therefore, we could be looking at a total of 3,355,800 or 33,558,000 ADR’s – that could be the reality. I am giving you a copy of these statistics for you to check out for yourself.https://mail.google.com/mail/u/0/s/?view=att&th=16d432347d31b1b5&attid=0.1&disp=attd&safe=1&zw\n\nAfter my daughter sent her email to the headmaster, she had a meeting with him & we spoke to him over the phone.\n\nThe poster was removed, which we all feel was a massive win for her as she was really upset & felt she was having it rubbed in her face.\n\nHe told us that the poster is given to the school from the nursing team & he can categorically say the school doesn’t get paid anything to put up the poster or anything of its kind.\n\nHe has removed the poster & will not put it back up unless he is forced to do so by the powers above him, but if that was to be the case he would want answers to some of his questions that he has about it due to us bringing it to his attention as he didn’t know there were issues with it. Also, he would forward us the contact details of whoever it was that tells him to put it up so we could also take it up with them.\n\nAnd if it had to go back up, he would talk to us about it first & walk around the school with Chloe to find somewhere in the school that she doesn’t go, so that she doesn’t have to see it.\n\nHe also said he didn’t feel the poster needed to be there, as the parents had already had the consent letters.\n\nAlso, if a child decided they didn’t want the vaccine even after parents have given their consent, they wouldn’t be made to have it (which is good to hear)\n\nHe was very apologetic that Chloe was upset about the poster being up & that she felt nobody considered her feelings about putting up the poster.\n\nHe said that he would have to have a talk with the team who deals with PSHCE days (personal social help and citizen education) to see if it would be possible to have a discussion about reactions to vaccines alongside the topic of climate change, etc.… that they do on these days.\n\nBut he didn’t want Chloe to feel that she was being belittled at all.\n\nPlease remember: The only voice that is not heard is the one that is silent.", "opengraph": {"locale": "en_US", "type": "article", "title": "HPV Vaccine Controversy in the UK - SaneVax, Inc. % %", "description": "A teenager from the United Kingdom sent the following letter to her headmaster after seeing a huge poster promoting the use of HPV vaccines in her school.", "url": "https://sanevax.org/hpv-vaccine-controversy-in-the-uk/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2020-03-26T00:59:54+00:00", "article:modified_time": "2020-04-06T09:02:16+00:00", "image": "https://i1.wp.com/sanevax.org/wp-content/uploads/2020/03/Chloe.jpeg?fit=344%2C500&ssl=1", "image:width": "344", "image:height": "500", "image:type": "image/jpeg"}, "tags": ["marketing", "UK", "HPV vaccine"], "tweets": [], "movies": [], "links": ["https://i0.wp.com/sanevax.org/wp-content/uploads/2020/03/Chloe.jpeg?ssl=1", "https://www.facebook.com/REGRET.ie/videos/308821073232329?sfns=mo", "https://rita-kara-robinson.com/vaccine-detox-therapy/", "https://sanevax.org/", "https://www.facebook.com/1637034089889113/posts/2020254238233761?sfns=mo", "https://accounts.google.com/ServiceLogin?service=mail&passive=true&continue=https://mail.google.com/mail/s/?view%3Datt%26th%3D16d404157ef41074%26attid%3D0.2%26disp%3Dattd%26safe%3D1%26zw&scc=1&ltmpl=ecobh&nui=5&btmpl=mobile&emr=1&osid=1", "https://livelovefruit.com/colton-berrett-another-teen-sacrificed-gardasil-hpv-vaccine-died/", "https://christopherbunch.org/christopher-s-story", "http://www.gardasil-and-unexplained-deaths.com/", "https://www.chroniclelive.co.uk/news/north-east-news/amy-anderson-cervical-cancer-gateshead-16281350", "https://accounts.google.com/ServiceLogin?service=mail&passive=true&continue=https://mail.google.com/mail/s/?view%3Datt%26th%3D16d432347d31b1b5%26attid%3D0.1%26disp%3Dattd%26safe%3D1%26zw&scc=1&ltmpl=ecobh&nui=5&btmpl=mobile&emr=1&osid=1", "https://lookaside.fbsbx.com/file/Email%20to%20Daily%20Mirror%20Readers%20Editor%205th%20April%202019.docx?token=AWzXWcZREu2zAKBBxs2dAa_5CPG6U8K7N0NbpG6twjSVQQBZQYMjEMahF5ReCKOebYcsS7y4qzdh1cZaJcAzqd8LTV_z-DWCBVg2kbh1ttZt5i8BgrgpAc0gKidC8bi7qzh8T6L_mEb_fFRqsR8hbx4FjsgxeAXCxzGS_uL1cgBIyLjHddMNNeKf14ybZEnGtO7c41hPCGFViPiykHSR6yA4"], "authors": ["Norma"], "publish_date": "2020-03-26T00:59:54+00:00"}