{"result_id": "265009", "URL": "https://sanevax.org/medical-professional-listing/", "timestamp": "2023-04-25 17:02:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/medical-professional-listing/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "Medical Professional Listing", "cleaned_text": "The SaneVax Team knows just how devastating vaccine injuries can be. Most medical professionals are not fully aware of the side effects that can be associated with vaccination. When they are aware that vaccine injuries occur, often they do not know how to treat them. The following is a list of medical professional listing of those who have had some success treating vaccine injuries. If they are not located in your geographic area, they may be able to refer you to a medical professional near you who is experienced with vaccine injuries.\n\nDr. Mark Flannery is a functional medicine practitioner and clinical nutritionist who has helped Gardasil victims from around the world. Based in the Los Angeles area, he consults long distance with his patients and uses the most cutting-edge, scientifically backed methods to support a return to wellness.\n\nFunctional medicine focuses on correcting physiological function versus overriding the problem with drugs or surgery. Because vaccine injury typically triggers brain inflammation, functional medicine offers many tools to tame brain inflammation and restore neurological and metabolic function.\n\nOther principles of functional medicine Dr. Flannery uses for vaccine injury include regulating the immune response, repairing the immune barriers, balancing hormone function, and supporting neurological function.\n\nAlthough Dr. Flannery provides professional, experienced guidance using some of the most advanced lab testing today, success in recovering from a vaccine injury depends primarily upon the patient. Recommendations include dietary and lifestyle changes that initially can seem drastic. For example, eliminating common and well-loved foods may be necessary to reduce inflammation and allow neurological function to return. The patient may also need to follow a customized nutritional therapy protocol that includes specific nutraceuticals.\n\nAlthough it has been heartbreaking for Dr. Flannery to witness the physical, emotional, and financial toll this vaccine has brought upon so many families, it also has been extremely rewarding for him to help so many young people get their lives back.\n\nIn 2005 Dr. Clark became one of less than 1,000 board-certified Chiropractic Neurologists in the world. Chiropractic Neurology is the newest, state of the art diagnostic and treatment technique. It brings together current research findings from fields such as psychology, neuropsychiatry, neurology, neurophysiology and nutrition—and uses this knowlege to bring hope to the sick, unhappy and hurting of all ages.\n\nDr. Clark combines functional neurology, endocrinology, blood chemistry analysis, immunology, vestibular rehabilitation and clinical nutrition to treat the patient, not their symptoms.\n\nThe Hyperbaric Medical Center of New Mexico—a place where you and your family can find answers and hope for your child with brain injury or developmental issues.\n\nDr. Stoller is currently consulting on patients with brain injury and children misdiagnosed as having autism, PDD-NOS, ADHD, etc. These labels are incorrect in most cases as affected children have a mitochondrial dysfunction and damaged detoxification kinetics. It would be better to call what they have Mitochondrial Neuro-Gastro-Immune Encephalopathy/Encephalomyopathy (MNE). Dr. Stoller will not be the primary care physician for your child, but many times will work with your primary care physician to provide the best possible care for your child.\n\nDr. Stoller has personally overseen the treatment of a young girl left with serious brain injury after Gardasil vaccination. This girl has recovered more than half of her original abilities.\n\nThe physicians and staff at the Natural Healing & Wellness Center believe optimal wellness requires you to be a proactive agent for your body. You need to treat it well and not wait until you hurt before you decide to take care of it. Health is not merely the absence of disease any more than wealth is an absence of poverty. Health is not simply ‘feeling fine’, for we know that problems may progress for years without causing any symptoms whatsoever.\n\nThis clinic was referred to SaneVax by a young woman suffering from severe adverse effects after vaccination with Gardasil. She was pleased enough with her treatment here that she went the extra mile to refer them to the SaneVax team.\n\nChristof Plothe is an Osteopath and Naturopath who is treating HPV vaccine victims from all over Europe. His focus is on scientific research into the mechanisms of actions regarding the potential side effects of vaccines, hoping to discover more effective treatment models.\n\nHe is in touch with Researchers and Practitioners from all over the world working to establish integrative treatment modalities. All of which start from nutrition, orthomolecular agents, detoxification concepts, gut specific treatments, neurological protection, anti-inflammatory agents, herbs, isobathic dilutions, etc..\n\nTests he uses in his clinic include genotype testing, inflammatory markers, specific antibody testing, testing specific immune response to the vaccine, specific GUT test, food sensitivities, etc…\n\nHis prior work Involved integrative models of medicine. He was cofounder of a Society Which Involved leading researchers, holistic dentists and medical practitioners from various disciplines. He has published books and DVDs on the subject and appeared on TV, Radio and Film explaining his work.\n\nHe is the founder of an HPV Vaccine Website in Germany with the hope of generating awareness that the relationship of the symptoms of so many young women can be traced back to HPV vaccine reactions. He also hopes to gain additional insights into effective treatment modalities.\n\nMary Coyle is a certified homeopathic practitioner who consults with families of children with chronic health issues for over 10 years. Applying the model of Homotoxicology, Mary explains the benefits of using European drainage remedies, low-potency homeopathic detoxification remedies, and supplementation to assist the body in regaining health. She has a practice in New York City, and has presented at Autism One, National Autism Organization – NYC, LIA, and TACA. Mary has also hosted a radio show on Autism One Radio on the benefits of Homotoxicology.\n\nJeff Korentayer, DMH, and Allyson McQuinn DHHP practice together at Arcanum Wholistic Clinic, where they use the advanced system of natural medicine called ‘Heilkunst’, which includes a sequential homeopathic approach to the removal of biological and psychological shocks and traumas. These protocols include a thorough approach to the removal of vaccine shocks, as well as any medical condition which has arisen as a result (such as autism, for example). Not only are the specific toxins of the vaccines addressed, but also the underlying genetic disease tendencies which are often activated by vaccinosis. They also offer a safe and effective protocol of alternative homeopathic vaccinations (homoprophylaxis) to parents who choose to avoid the conventional shots. They see patients at their clinic, or by phone or Skype.\n\nAlan is a homeopath with personal experience in recovering from vaccine-damage. He now specialises in treating children on the autistic spectrum, 70% of which he believes to be vaccine-injured. The vaccine-detox protocol that he developed can also be used to treat HPV vaccine-damage gently and effectively, by removing the toxins and often repairing any damage caused. With HPV vaccine-damage cases, he typically sees rapid improvements in symptoms within a few months.\n\nAlan has clinics in both Central London and Clapham Junction, but has clients all over the world that he treats over Skype and Facetime.\n\nPlease visit his informative website which has an active blog containing lots of useful information, as well as a growing testimonials page.\n\nDr. Carley was trained as a surgeon, but left traditional medicine after her only child was brain damaged from vaccines. She started studying how vaccines corrupt the immune system, and came to realize that all autoimmune diseases, non-traumatic seizures, cancer and genetic damage, in people and in pets, are actually VIDS (Vaccine Induced Diseases; the biggest epidemic the world has ever known). She subsequently developed the Hippocrates Protocol which uses homeopathics and natural supplements to reduce the effects of vaccine injuries.\n\nDr. Carley no longer practices medicine, and does NOT give medical advice. Rather, she teaches her students what she would do if she were you after reviewing your individual history of assaults to your body’s immune system.\n\nSin Hang Lee M.D., F.R.C.P. (C), FCAP has over 50 years’ experience in general/surgical pathology and clinical microbiology. He is qualified to practice in the U.S., Canada, and the United Kingdom.\n\nDr. Lee is currently a practicing pathologist at Milford Hospital, in Milford CT, and the Director of Milford Medical Laboratory, which is an industry leader in the development of molecular diagnostic procedures. One of their goals is to facilitate the transfer of advanced PCR/direct DNA sequencing technology into community hospital laboratories.\n\nMilford Medical Laboratory’s (MML) molecular diagnostics department has introduced the nation’s first routine DNA sequencing-based no-false positive HPV genotyping, Neisseria gonorrhoeae opa gene DNA amplification assay, and Chlamydia trachomatis cryptic plasmid DNA amplification assay for women’s health care management. MML also assists CLIA-certified laboratories establish their own in-house molecular sequencing programs.\n\nDoctor Lee is quite concerned about the potentialo negative consequences of replacing an already safe and effective method of preventing cervical cancer with vaccinations that may, or may not be safe or effective. He will be happy to answer any questions on safe cervical cancer prevention methods. He is also available for advice on what to do should you experience an abnormal pap smear after HPV vaccination.\n\nPlease email any questions you may have to sanevax@gmail.com. We will forward them to Dr. Lee for his response.\n\nBecca has over fifteen year’s experience of working within the Health and Nutrition industry and has a BSc in Nutritional Medicine. She believes that good nutrition is the foundation of good physical and mental well being and maintains that, very often, just a few simple changes are all that are needed to bring the body back into balance, increasing energy and overall health.\n\nThe most common tests performed under her care are food sensitivity and hair testing. Food sensitivity testing consists of allergy and intolerance testing which speeds up the identification of possible food and inhalant allergens that may be contributing to a variety of health symptoms. Hair testing consists of a mineral analysis to provide indications of imbalances, deficiencies or excesses of essential minerals and toxic metals. It also acts as an excellent indicator of many metabolic processes occurring within the body.\n\nFunctional testing of blood, urine and saliva using the most up-to-date technology can sometimes help to get to the root of a persons health problems very quickly by identifying imbalances and dysfunctions in normal physiology.\n\nBecca works closely with clients on a one to one basis, either within one of her city centre clinics or at their home, to tailor programmes that meet their individual needs and gain maximum results.\n\nLaura is a Biologist and a practitioner of Natural Medicine, she is a qualified Naturopath, Homeopath, Herbalist and Nutritionist. Her passion is natural medicine, especially in regard to cancer, but, the scientist in her likes to see the evidence.\n\nLaura gives lectures and educational seminars worldwide in addition to treating patients. She handles many consultations and referrals via phone.\n\nI live 4 miles from Donegal town, with my wife and 5 children and I practice from home. My first training in health care was in my home city of Stuttgart where I did a Heilpracktiker degree. This is a full medical training qualification similar in standard to a Junior doctor’s degree. This is a legal requirement in Germany in order to become a licenced health practioner.\n\nThe capacity of Homeopathic remedies to restore order on many levels make them a very useful tool in treating all kinds of ailments. On the physical level, the immune system starts working normally, healing processes are sped up, and allergic reactions stop. Acute problems are dealt with fast and effectively. In conditions which have a longer history such as asthma and all types of chronic pain, remedies are slower to act, but they steadily reverse the symptoms and restore health.\n\nOn a mental/emotional level, blocks are removed, depressions are lifted and emotions balanced. The mind becomes clearer more focused and less affected by day to day problems.\n\nRecently I have been treating the after effects of the HVP vaccine, including symptoms like seizures, severe depression, anxiety, self harming, and chronic pain and chronic fatigue. These cases can be challenging but I can confidently say that it is possible to treat these symptoms successfully.\n\nIf you would like to know more about homeopathy, my clinics, or me as a person, have a look at the following pages:\n\nwww.whatclinic.com, search for: Homeopathy/Ireland. Go to: Hans Weitbrecht. www.facebook.com, key in – Rational Homeopathy International, this will bring you to the group I run, which promotes the highest standards in Homeopathy.", "opengraph": {"locale": "en_US", "type": "article", "title": "Medical Professional Listing - SaneVax, Inc.", "description": "Medical Professional Listing for Treating Vaccine Injuries The SaneVax Team knows just how devastating vaccine injuries can be. Most medical professionals are not fully aware of the side effects that can be associated with vaccination. When they are aware that vaccine injuries occur, often they do not know how to treat them.  The following is a list […]", "url": "https://sanevax.org/medical-professional-listing/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2011-07-30T16:01:33+00:00", "article:modified_time": "2020-05-14T00:07:16+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/sanevax.org/wp-content/uploads/2011/07/medical-professionals1.jpg?ssl=1", "https://drflannery.com/services/gardisil-vaccine-damage-treatment/", "tel:818-704-5685", "https://doctordavidclark.com/", "mailto:plothe@ostmed.net", "https://arcanum.ca/", "mailto:alan.homeopath@gmail.com", "mailto:http://info@atouchofmedicine.com/", "https://web.archive.org/web/20150428052736/http://www.atouchofmedicine.com:80/", "http://www.reversingvaccineinduceddiseases.com/cgi-sys/suspendedpage.cgi", "https://www.bridgeporthospital.org/locations/milford-300-seaside-avenue-campus.aspx", "mailto:sanevax@gmail.com", "http://www.benutrition.co.uk/", "http://evidencebasednaturalhealth.weebly.com/index.html", "https://conscioushealthnaturaltherapy.weebly.com/", "http://dangerousprescriptiondrugs.weebly.com/index.html", "https://www.whatclinic.com/", "https://www.facebook.com/"], "authors": ["Norma"], "publish_date": "2011-07-30T16:01:33+00:00"}