{"result_id": "265011", "URL": "https://sanevax.org/uk-association-of-hpv-vaccine-injured-daughters-ahvid/", "timestamp": "2023-04-25 17:02:11 CEST+0200", "meta": {"description": "UK AHVID: These are real people, real families who all share one thing in common – their daughters became ill following HPV vaccines, Gardasil or Cervarix.", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/uk-association-of-hpv-vaccine-injured-daughters-ahvid/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "UK Association of HPV Vaccine Injured Daughters (AHVID)", "cleaned_text": "Who we are – What we do – Why we do it\n\nWho we are:\n\nOur UK Association of HPV Vaccine Injured Daughters (AHVID) was established at the beginning of 2015. Families and their daughters from the north of Scotland to the south of England, Wales and Northern Ireland have joined together to give support to each other and raise awareness of the dangers of the HPV vaccines, Cervarix and Gardasil. The primary focus of this organisation is to assure our members that they are no longer on their own and by working together we can achieve so much more. In our opinion, these vaccines have caused many serious health issues which need immediate investigation.\n\nOur facebook group ‘Parents of sons and daughters suffering long term side effects following HPV vaccination’ is an established group for families whose young people have suffered adverse events following vaccination. Members are from countries worldwide who give each other valuable support and comfort in times of crisis. They understand what the families are going through and they share their experiences, good and bad, giving comfort and advice to one another when required. They have become an international family doing their best to cope when the world outside ignores them. Their aim is to be there for one another.\n\nPlease see the photos of some of our family members – this only represents a small section of our association – but these are real people, real families who all share one thing in common – their daughters became ill following HPV vaccination and these illnesses have lasted for many years.\n\nWhat we do:\n• To give support to one another and raise awareness of the dangers of the HPV vaccines;\n• To highlight how these vaccines, in our opinion, have caused serious health issues for many girls here in the UK;\n• To get our governments and the medical profession to realise that thousands of girls worldwide are also suffering from post-vaccination disorders;\n• To reassure our members that they are no longer on their own and by working together, we can achieve greater goals and gain support;\n• To encourage all families to share their experiences with their MPs and meet them face to face in the hope of eventually getting an open debate on this issue in the House of Commons and in the devolved parliaments in Scotland, Wales and Northern Ireland;\n• To highlight that UK parents are being advised by medical professionals, that in many cases, their daughters’ illnesses are either “psychosomatic” or a “coincidence” and yet these young people were fit and healthy prior to vaccination;\n• To establish proper in-depth investigations into why previously healthy and very active young girls are experiencing personality changes and multiple adverse health events following HPV vaccinations;\n• To ask that the sick girls and their parents in the UK get treated with greater respect, are believed and given the opportunity to be healed within our own National Health Service – this is not occurring at the moment;\n• To highlight and request the Department of Education to investigate the great loss of education which has occurred following HPV vaccination;\n• And to recognise that all of this affects the whole family who experience high levels of stress and in many cases financial loss since their daughters became ill following HPV vaccination.\n\nWhy we do it\n• Quite simple – to protect our children who have become sick following HPV vaccination and to get them made well again;\n• And to try and prevent other girls from being damaged in the same way as has been occurring since the HPV vaccination programme was introduced into the UK in September 2008.\n• To ask all families to investigate and research the HPV vaccine before giving consent – it is important they know all of the facts before they make this important decision.\n\nFor further information, please contact Freda Birrell at jeanfreda8@btinternet.com; (Chair), or Steve Hinks at steve@hinksfamily.co.uk (Vice Chair and Press Officer)", "opengraph": {"locale": "en_US", "type": "article", "title": "UK Association of HPV Vaccine Injured Daughters (AHVID)", "description": "UK AHVID: These are real people, real families who all share one thing in common – their daughters became ill following HPV vaccines, Gardasil or Cervarix.", "url": "https://sanevax.org/uk-association-of-hpv-vaccine-injured-daughters-ahvid/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:published_time": "2015-09-15T20:29:55+00:00", "article:modified_time": "2018-09-14T22:25:22+00:00", "image": "https://i2.wp.com/sanevax.org/wp-content/uploads/2015/09/collage-UK-e1442345943760.jpg?fit=700%2C460&ssl=1", "image:width": "700", "image:height": "460", "image:type": "image/jpeg"}, "tags": ["HPV VACCINES", "AHVID", "injuries", "cervarix", "Gardasil"], "tweets": [], "movies": [], "links": ["https://i0.wp.com/sanevax.org/wp-content/uploads/2015/09/collage-UK.jpg?ssl=1", "https://i0.wp.com/sanevax.org/wp-content/uploads/2015/09/New-Collage2.jpg?ssl=1", "mailto:jeanfreda8@btinternet.com", "mailto:steve@hinksfamily.co.uk"], "authors": ["Norma"], "publish_date": "2015-09-15T20:29:55+00:00"}