{"result_id": "265020", "URL": "https://sanevax.org/media-about-sanevax/about/", "timestamp": "2023-04-25 17:02:19 CEST+0200", "meta": {"description": "SaneVax is about promoingy Safe, Affordable, Necessary & Effective vaccines and vaccination practices through education and information.", "lang": "en", "keywords": "", "favicon": "https://sanevax.org/wp-content/themes/lifestyle-pro-elf/images/favicon.ico", "canonical": "https://sanevax.org/media-about-sanevax/about/", "encoding": "UTF-8"}, "image": null, "domain": "sanevax.org", "title": "About Us", "cleaned_text": "The SaneVax Mission is about promoting only Safe, Affordable, Necessary & Effective vaccines and vaccination practices through education and information. We believe in science-based medicine. Our primary goal is to provide the information necessary for you to make informed decisions regarding your health and well-being. We also provide referrals to helpful resources for those unfortunate enough to have experienced vaccine-related injuries.\n\nAdverse events experienced after HPV vaccines have brought the issue of vaccine safety to the forefront around the world. SaneVax, Inc. is a place to find the answers to questions you may have regarding vaccine safety and efficacy.\n\nSaneVax, Inc. is a non-profit organization established to provide a single site for information to help you:\n\nThe SaneVax Website Provides the latest news on vaccines, including those currently being developed and tested, with links to scientific studies on their potential safety, efficacy and need. Our intent is to cover the vaccine issue on a global scale.\n\nSaneVax, Inc. Provides Links to vaccine-injury physicians and medical practitioners, vaccine-injury attorneys, and other vaccine-related groups. We will provide instructions on how to become politically active, should you wish to do so, along with links to political action groups representing thousands of vaccine-injured victims and their families.\n\nSaneVax, Inc. Provides pre-vaccination HPV PCR DNA sequencing to help insure you do not increase your risk of developing precancerous lesions or cancer by consenting to HPV vaccination. Should you experience an abnormal Pap test after HPV vaccination, we also offer post-vaccination HPV PCR DNA sequencing to help you find out why the vaccine did not protect you.\n\nLearn more about SaneVax and our activities here.", "opengraph": {"locale": "en_US", "type": "article", "title": "About Us - SaneVax, Inc.", "description": "SaneVax is about promoingy Safe, Affordable, Necessary & Effective vaccines and vaccination practices through education and information.", "url": "https://sanevax.org/media-about-sanevax/about/", "site_name": "SaneVax, Inc.", "article:publisher": "https://www.facebook.com/sanevax.inc/", "article:modified_time": "2018-09-14T22:26:18+00:00", "image": "https://sanevax.org/images/banner.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://sanevax.org/resources/medical-professionals-resources/", "https://sanevax.org/resources/vaccine-injury-attorneys/", "https://sanevax.org/resources/vaccine-groups/", "https://sanevax.org/resources/political-action-groups/", "https://sanevax.org/pre-vac-hpv-testing-2/", "https://sanevax.org/post-hpv-vaccination-tests/", "https://sanevax.org/wp-content/uploads/2011/08/SaneVax-who-we-are.pdf"], "authors": [], "publish_date": null}