{"result_id": "266003", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://www.santeplusmag.com/111121954-pourquoi-faut-il-eviter-de-dormir-avec-son-animal-de-compagnie-animaux-21-03-2023/&prev=search&pto=aue", "timestamp": "2023-04-25 17:03:00 CEST+0200", "meta": {"description": "Découvrez pourquoi il est déconseillé de dormir avec son animal de compagnie la nuit. Les experts nous fournissent des explications à ce sujet.", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/111121954-pourquoi-faut-il-eviter-de-dormir-avec-son-animal-de-compagnie-animaux-21-03-2023/", "encoding": "utf-8"}, "image": null, "domain": "translate.google.com", "title": "Dormir dans le lit avec un chien ou un chat est une mauvaise idée : voici pourquoi", "cleaned_text": "La présence d’un animal près de soi a un effet apaisant, certes. Mais différentes opinions entourent le cododo avec les chiens et les chats. Certains experts sont formels : il faut éloigner son animal de compagnie de votre lit. Mais après tout, il s’agit d’une affaire personnelle, car le tout est d’accorder une attention particulière à votre animal en matière d’hygiène. On vous explique !\n\nDormir avec son chat : quels sont les risques ?\n\n« J’aime tellement mon chat que je ne peux pas m’imaginer dormir sans lui ». C’est ce que tous les amoureux des félins diront, si on leur pose la question. Ils sont prêts à supporter les désagréments liés au co-sleeping avec leur animal favori, du moment qu’ils peuvent se réveiller le matin avec sa douce fourrure qui les berce de sa douceur. Mais est-ce une bonne idée ?\n\nLire aussi : Comment empêcher votre chien de faire pipi à la maison ?\n\nPourquoi il ne faut pas dormir avec son chat ?\n\nBruno Chomel, professeur en médecine vétérinaire de l’université de Davies aux Etat-Unis et Ben Sun, responsable en santé publique en Californie, ont effectué une recherche publiée dans un article des Centers for Disease Control and Prevention (CDC). Ces chercheurs détaillent plusieurs maladies : parasites, autres mauvaises bactéries et, oui, fièvre des griffes du chat que les humains risquent de contracter en dormant à côté ou en se faisant lécher par les animaux domestiques.\n\nFaut-il s’inquiéter ? Possible, bien que la zoonose qui est une maladie transmise des animaux aux humains soit rare, déclare Bruno Chomel. De son côté, le docteur Jeanne Brugère-Picoux, professeur de pathologie médicale du bétail et des animaux de basse-cour à l’école vétérinaire d’Alfort, estime que « Les zoonoses dans la chambre sont peu fréquentes, mais le risque est réel ».\n\nSans oublier le risque d’allergie et l’aggravation de l’asthme chez les personnes qui en souffrent. En effet, selon Katherine Pankratz, comportementaliste vétérinaire certifiée, il est tout à fait tentant de dormir avec son animal de compagnie, mais cela peut comporter des risques pour la santé...Des problèmes respiratoires, des allergies et des morsures et griffures. Il est donc important d’éviter de dormir avec son animal de compagnie pour prévenir ces problèmes.\n\nQuels sont les autres risques à dormir avec un chat ou un chaton ?\n\nSi les mises en garde évoquées plus haut ne vous suffisent pas, vous devez aussi savoir que votre boule de poils n’a pas sa place dans votre lit pour les raisons suivantes :\n• Il peut perturber votre sommeil : Un chat, ça dort toute la journée et ça se réveille la nuit. Au programme de la soirée : jeux, chasse et recherche d’attention. Vous l’aurez deviné, avoir un chat c’est pas du repos. Si vous pensez que dormir avec filou dans le lit est apaisant. Hmmm ! Oui et non ! Si vous voulez savoir, il n’a que faire de votre cycle de sommeil réparateur de huit heures ! Il est avec vous dans la chambre, et qu’à cela ne tienne ! Il vous mordille les orteils, prend de la place et vous empêche de vous allonger confortablement, il vous lèche et vous réveille à 2 heures du matin pour jouer ou réclamer des caresses. Ça vous suffit ? S’il vous fait subir tous ces supplices, et que vous n’en pouvez plus, il est conseillé de le laisser dans une autre chambre où il pourra se dépenser comme bon lui semble.\n• Dites adieu à votre intimité : Si vous êtes en couple, et que vous avez un chat, on vous conseille fortement de l’éloigner de votre lit conjugal. Il ne se gênera pas pour s’immiscer entre vous et votre partenaire et vous jeter un regard bizarre : « Vous faites quoi ? ». Un tue-l’amour garanti ! Habituez-le à dormir dans une autre chambre pour qu’il s’occupe de ses petites affaires et qu’il vous laisse tranquille.\n\nEn résumé, qualité du sommeil altérée, exposition à des allergies et des germes…Vos félins doivent s’éloigner de votre chambre et de vos draps.\n\nPourquoi il ne faut pas dormir avec son chien ?\n\nOn l’a vu, dormir avec un chat comporte des risques. Avec un chien aussi…\n\nZoonoses, maladies du système respiratoire ou nerveux…Selon SantéVet, ce sont des risques à ne pas prendre à la légère. Toutefois, il ne faut pas verser dans le drame ou l’exagération. La gravité de ces maladies qui demeurent rares, dépendent de l’état de santé du propriétaire. S’il souffre d’un système immunitaire, s’il s’agit d’immunodéprimés, de jeunes enfants, de personnes âgées ou de femmes enceintes, la prudence est de mise.\n\nN’oublions pas par ailleurs, le ronflement de certains chiens qui vous réveillent ou vous font sursauter en plein rêve…Et les poils ! le cauchemar de votre lit et de votre canapé !\n\nMais dormir avec son animal de compagnie, c’est aussi du bonheur…\n\nVous avez investi dans le panier le plus confortable pour permettre à votre chat ou chien de se reposer dans le luxe…Mais déception ! Il préfère malgré tout se lover sous votre couette la nuit. Cette pratique vous le savez, a du mauvais mais pas que…Ca a aussi du bon.\n\nEst-ce sain de dormir avec son chien ou son chat ?\n\nNe nous méprenons pas, dormir avec son animal de compagnie génère également des bienfaits cachés pour la santé et le moral. Cette petite source de chaleur est tout de même réconfortante et puis le ronronnement de nos amis les chats permet une meilleure relaxation et favorise le bien-être. Un véritable pouvoir thérapeutique, comme l’explique le Dr Thompson, directeur du Center for Neuroacoustic Research. Le chat trouve son plaisir dans les bras de son maître et celui-ci retrouve paix et sérénité. C’est gagnant-gagnant!\n\nEt ce n’est pas tout ! Une étude publiée dans le National Library of Medicine, stipule que posséder un chat réduirait le risque de décès dû aux maladies cardiovasculaires.\n\nIl ne faut pas oublier le chien non plus ! Dormir avec ce petit être innocent a un effet calmant considérable et réduit le stress et c’est une étude de la mayo Clinic qui le dit. Avec à la clé, un sentiment de sécurité et une augmentation du niveau d’ocytocine, l’hormone du bien-être.\n\nAlors dormir ou pas avec son animal de compagnie ? A vous de voir ! Si vous ne pouvez pas vous passer de votre compagnon, le mieux est de trouver les bonnes conditions pour allier plaisir et sécurité.\n\nLire aussi : Comment utiliser le marc de café comme répulsif naturel pour faire fuir les chats ?\n\nQuelles sont les bonnes conditions pour dormir avec son animal de compagnie ?\n\nMaintenant, vous avez toutes les informations requises qui vous incitent à réfléchir. « Je le garde dans mon lit, ou pas ? ». Si vous décidez de garder votre chien ou votre chat dans votre lit, suivez ces quelques conseils qui vous préservent tous les deux ; votre cododo se passera au mieux.\n• Votre chat ou chien doit être à jour en matière de vaccinations et de vermifuge ;\n• N’oubliez pas de les traiter contre les parasites externes, à savoir tiques et puces ;\n• Un toilettage est de rigueur chez le vétérinaire ou rendez-vous chez un professionnel en la matière ; hygiène oblige !\n• Toujours dans le contexte de l’hygiène, changez régulièrement votre linge de lit : drap, taies d’oreillers, couettes…\n• Apprenez à votre chien à attendre votre permission pour qu’il monte sur le lit. C’est votre espace et c’est vous qui décidez !\n• Habituez-le de temps en temps à dormir loin de vous ; au pied du lit. Vous pouvez avoir recours à un éducateur canin si vous rencontrez des problèmes à ce niveau.\n• Vous pouvez habituer votre chien ou chiot à dormir dans un panier installé près du lit de votre bambin. Des mouvements brusques de votre enfant, la nuit, peuvent susciter une agressivité du chien comme réflexe de défense. Aménagez-lui un petit coin douillet près de son petit humain, c’est mieux et ils seront tous les deux en sécurité.\n\nDormirez-vous avec votre animal de compagnie dorénavant ? A vous d’instaurer les règles qu’il faut. Assurez-vous qu’il est en bonne santé, rappelez-lui que c’est vous le maître, et tout se passera pour le mieux…\n\nLire aussi : Pourquoi les chats ont-ils si peur des concombres ?", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "Dormir dans le lit avec un chien ou un chat est une mauvaise idée : voici pourquoi", "description": "Découvrez pourquoi il est déconseillé de dormir avec son animal de compagnie la nuit. Les experts nous fournissent des explications à ce sujet.", "url": "https://www.santeplusmag.com/111121954-pourquoi-faut-il-eviter-de-dormir-avec-son-animal-de-compagnie-animaux-21-03-2023/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Animaux", "updated_time": "2023-04-24T17:49:31+02:00", "image": "https://www.santeplusmag.com/wp-content/uploads/Dormir-dans-le-lit-avec-un-chien-ou-un-chat-est-une-mauvaise-idee001-1200x628.jpg", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/Dormir-dans-le-lit-avec-un-chien-ou-un-chat-est-une-mauvaise-idee001-1200x628.jpg", "image:width": "1200", "image:height": "628", "image:alt": "Dormir dans le lit avec un chien ou un chat est une mauvaise idée001", "image:type": "image/jpeg", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "734", "height": "413", "embed_code": "<iframe loading=\"lazy\" title=\"Dormir avec son animal, une bonne id&#xE9;e ? - Le Magazine de la Sant&#xE9;\" src=\"https://www.youtube.com/embed/BWjc2xIsWJ0\" width=\"734\" height=\"413\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/BWjc2xIsWJ0"}], "links": ["https://www-santeplusmag-com.translate.goog/111121954-pourquoi-faut-il-eviter-de-dormir-avec-son-animal-de-compagnie-animaux-21-03-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#dormir-avec-son-chat-quels-sont-les-risques", "https://www-santeplusmag-com.translate.goog/111121954-pourquoi-faut-il-eviter-de-dormir-avec-son-animal-de-compagnie-animaux-21-03-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#quels-sont-les-autres-risques-a-dormir-avec-un-chat-ou-un-chaton", "https://www-santeplusmag-com.translate.goog/111121954-pourquoi-faut-il-eviter-de-dormir-avec-son-animal-de-compagnie-animaux-21-03-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#pourquoi-il-ne-faut-pas-dormir-avec-son-chien", "https://www-santeplusmag-com.translate.goog/111121954-pourquoi-faut-il-eviter-de-dormir-avec-son-animal-de-compagnie-animaux-21-03-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#mais-dormir-avec-son-animal-de-compagnie-cest-aussi-du-bonheur", "https://www-santeplusmag-com.translate.goog/111121954-pourquoi-faut-il-eviter-de-dormir-avec-son-animal-de-compagnie-animaux-21-03-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#quelles-sont-les-bonnes-conditions-pour-dormir-avec-son-animal-de-compagnie", "https://www-santeplusmag-com.translate.goog/pourquoi-votre-chat-dort-a-vos-pieds-il-envoie-un-message-plus-profond-que-vous-ne-le-pensez-animaux-000016414/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/perdre-un-chien-peut-etre-aussi-difficile-que-perdre-un-etre-cher-dapres-des-etudes/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/111122094-comment-empecher-votre-chien-de-faire-pipi-a-la-maison-animaux-06-04-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/votre-chien-dort-sur-vos-pieds-ce-geste-cache-un-message-profond-animaux-000015470/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/5-bienfaits-a-animal-de-compagnie-sante/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3317329/", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.mayoclinicproceedings.org/article/S0025-6196(15)00674-6/fulltext", "https://www-santeplusmag-com.translate.goog/111121935-comment-utiliser-le-marc-de-cafe-comme-repulsif-naturel-pour-faire-fuir-les-chats-animaux-20-03-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/111121591-pourquoi-les-chats-ont-ils-si-peur-des-concombres-animaux/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc"], "authors": ["Laurence O"], "publish_date": "2023-03-21T16:02:05+01:00"}