{"result_id": "266031", "URL": "https://www.santeplusmag.com/une-femme-meurt-de-la-rage-apres-avoir-joue-avec-un-chiot/", "timestamp": "2023-04-25 17:03:10 CEST+0200", "meta": {"description": "La rage est une maladie qui est considérée comme fatale si elle n’est pas traitée à temps. Une jeune femme norvégienne a trouvé la mort après avoir sauvé un chiot aux Philippines. Elle est décédée de la rage", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/une-femme-meurt-de-la-rage-apres-avoir-joue-avec-un-chiot/", "encoding": "utf-8"}, "image": null, "domain": "www.santeplusmag.com", "title": "Une femme meurt de la rage après avoir joué avec un chiot", "cleaned_text": "Selon l’Institut Pasteur, la rage est une maladie courante dans le monde qui enregistre le plus grand taux de mortalité. Souvent transmise par les chiens, elle peut être prévenue par la vaccination mais une fois les premiers symptômes enclenchés, le décès est irrévocable.\n\nAinsi, 59 000 cas sont enregistrés par an de par le monde, notamment en Asie et en Afrique. Toutefois, cette maladie n’a plus été diagnostiquée en France depuis 1924, même si en 2008 un cas a été déclaré en Guyane, dû probablement à une morsure de chauve-souris.\n\nLire aussi : Accouchement maison imminent : Cet enfant de 10 ans seulement délivre son petit frère du ventre de sa mère\n\nIl faut savoir aussi que le virus de la rage est transmis par le léchage, la morsure ou encore par la griffure, sachant qu’il est présent dans la salive de l’animal.\n\nLes symptômes de la rage\n\nSelon le Centre de contrôle et de prévention des maladies (CDC), Les symptômes de cette maladie engendrent un disfonctionnement du système nerveux. Les neurones sont ainsi perturbés et dérèglent par conséquent le fonctionnement de l’activité cardiaque et la respiration. Apparaissent alors des symptômes comme la fièvre, une faiblesse générale, une difficulté à avaler, des maux de tête, des troubles neuropsychiatriques, l’anxiété, l’insomnieou encore l’agitation et les hallucinations. Lorsque ces signes se déclenchent, la maladie évolue généralement vers le coma et le décès par arrêt respiratoire.\n\nLe traitement préventif devrait se faire sans tarder après une exposition risquée à la rage, avant l’apparition des symptômes qui peuvent entrainer une issue fatale. Ce traitement consiste en un nettoyage des plaies avec une antibiothérapie et 4 ou 5 injections intramusculaires de vaccin répartis en un mois.\n\nCe traitement appelé prophylaxie, doit être impérativement entamé par précaution tout de suite après un risque d’exposition au virus de la rage.\n\nEn sauvant un chiot, une norvégienne a trouvé la mort\n\nBirgitte Kallestad, âgée de 24 ans était en vacances aux Philippines avec ses amis. En apercevant un chiot sur la route, cette dernière, amoureuse des animaux, a décidé de le sauver et de le ramener avec elle. Elle l’a lavé, nourrit et jouait aussi avec lui et en supportait même les morsures. N’ayant aucun soupçon sur la gravité de ses éraflures causées par l’animal, la jeune femme avait procédé juste à un nettoyage sans traitement médical adéquat, comme l’a rapporté BBC News.\n\nA son retour dans son pays natal en Norvège, Birgitte a commencé à présenter des symptômes de fièvre et des sensations inhabituelles qui n’étaient pas compris au départ par les médecins puisqu’ils n’avaient pas vent de sa contamination par un chiot enragé durant son voyage. Mais juste après l’avoir su et compris, il était trop tard car la rage est véritablement fatale une fois que les symptômes apparaissent. Après avoir été admise dans l’unité des soins intensifs, la jeune femme a succombé à la maladie en présence de sa famille la plus proche.\n\nCe cas de rage est le premier à être déclaré en Norvège depuis 200 ans. Et suite à cette tragédie, la famille de la victime, dévastée, a recommandé qu’un vaccin antirabique soit administré à toutes les personnes se rendant aux Philippines, en plus des autres vaccins figurant sur la lite.\n\nLire aussi : Comment détartrer un robinet avec un ballon de baudruche ?\n\nSelon l’OMS, les Philippines sont considérés comme un pays présentant un haut risque d’atteinte de la rage. En effet, plus de 59 000 personnes décèdent chaque année à cause de cette maladie et les communautés les plus touchées sont celles qui sont appauvries, n’ayant pas les moyens ni les ressources nécessaires en matière de soins médicaux. Le but de l’OMS consiste aujourd’hui à déployer les efforts nécessaires afin d’atteindre l’objectif zéro mort humaine d’ici l’an 2030.\n\nDans le cas d’un voyage, une vaccination contre la rage est possible et est même recommandée par l’Institut Pasteur. Selon le Dr Laurent Dacheux, il est déconseillé de toucher les animaux et en cas de morsure, il est primordial de nettoyer la plaie avec de l’eau et du savon pendant au moins quinze minutes et mettre de l’antiseptique. Par la suite, il est important de consulter un médecin d’urgence qui pourra donner suite au traitement car il est toujours possible de se faire vacciner le plus rapidement possible après l’exposition au virus et d’associer un traitement pour activer les anticorps. Si cette médication est suivie rigoureusement, elle sera efficace à 100% pour arriver à bout de cette maladie virale.\n\nLire aussi : Arnaque du 8 mars : ne répondez pas à ce message, le risque est grand", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "Une femme meurt de la rage après avoir joué avec un chiot", "description": "La rage est une maladie qui est considérée comme fatale si elle n’est pas traitée à temps. Une jeune femme norvégienne a trouvé la mort après avoir sauvé un chiot aux Philippines. Elle est décédée de la rage", "url": "https://www.santeplusmag.com/une-femme-meurt-de-la-rage-apres-avoir-joue-avec-un-chiot/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Psycho & Sexualité", "updated_time": "2022-07-05T16:37:57+02:00", "image": "https://www.santeplusmag.com/wp-content/uploads/chiot-1-1-1200x628.png", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/chiot-1-1-1200x628.png", "image:width": "1200", "image:height": "628", "image:alt": "Chiot", "image:type": "image/png", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["#les-symptomes-de-la-rage", "#le-traitement", "#en-sauvant-un-chiot-une-norvegienne-a-trouve-la-mort", "https://www.pasteur.fr/fr/centre-medical/fiches-maladies/rage", "https://www.santeplusmag.com/111122130-accouchement-maison-imminent-cet-enfant-de-10-ans-seulement-delivre-son-petit-frere-du-ventre-de-sa-mere-temoignages-09-04-2023/", "https://www.santeplusmag.com/le-thym-soigne-le-streptocoque-lherpes-le-candida-et-le-virus-de-la-grippe/", "https://www.cdc.gov/rabies/index.html", "https://www.santeplusmag.com/8-plantes-pour-votre-chambre-a-coucher-qui-vont-ameliorer-votre-qualite-de-sommeil-et-traiter-linsomnie-lanxiete-et-le-stress/", "https://www.santeplusmag.com/astrologie-les-signes-du-zodiaque-qui-font-les-meilleurs-petits-amis-du-meilleur-au-pire/", "https://www.bbc.com/news/world-europe-48226676", "https://www.santeplusmag.com/111121972-comment-detartrer-un-robinet-avec-un-ballon-de-baudruche-entretien-et-menage-23-03-2023/", "http://sante.lefigaro.fr/article/rage-comment-se-proteger-contre-cette-maladie-/", "https://www.santeplusmag.com/111121703-arnaque-du-8-mars-ne-repondez-pas-a-ce-message-le-risque-est-grand-ma-vie-au-quotidien/"], "authors": ["Laurence O"], "publish_date": "2019-05-21T12:11:10+02:00"}