{"result_id": "266071", "URL": "https://www.santeplusmag.com/quels-sont-les-signes-du-cancer-de-luterus/", "timestamp": "2023-04-25 17:03:24 CEST+0200", "meta": {"description": "Le cancer du col de l’utérus est l’un des cancers les plus répandus chez la gente féminine. Voici les signes et symptômes que chaque femme doit connaître.", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/quels-sont-les-signes-du-cancer-de-luterus/", "encoding": "utf-8"}, "image": null, "domain": "www.santeplusmag.com", "title": "Le cancer du col de l’utérus est un tueur silencieux : 4 signes à identifier", "cleaned_text": "Le cancer du col de l’utérus est dans la presque totalité des cas engendré par une infection d’un virus appelé papillomavirus humain. Celui-ci est transmis par voie sexuelle. Selon la fondation contre le cancer, 80% des hommes et des femmes sexuellement actifs entrent en contact avec ce virus au moins une fois.\n\nLire aussi : Comment agit le collagène dans notre organisme ?\n\nLe papillomavirus humain est considéré comme un virus à haut risque. 8 femmes sur 10 y seraient exposées au cours de leur vie. Une contraction de celui-ci est une condition nécessaire mais pas suffisante à un développement du cancer du col de l’utérus, d’autres facteurs peuvent augmenter ce risque tels que le tabac, l’utilisation de contraceptifs oraux ou la multiparité.\n\nOn compte en France 3000 nouveaux cas de cancer du col de l’utérus chaque année, près de 75 % des cancers qui sont diagnostiqués sont retrouvés chez des femmes de moins de 65 ans. Il faut savoir que le cancer du col de l’utérus présente très peu de symptômes au début de son développement. Ce n’est que plus tard que plusieurs signes et complications apparaissent. C’est pour cette raison que le dépistage de ce cancer est encore plus primordial. Il n’en reste que chaque femme doit savoir reconnaître les signes de celui-ci :\n\nLes symptômes du cancer du col de l’utérus\n\nLorsqu’un cancer du col de l’utérus a le temps de se développer plusieurs signes et symptômes peuvent apparaître. En voici quelques-uns :\n\nLe cancer du col de l’utérus pourrait causer des saignements vaginaux, si vous retrouvez des taches de sang inexpliquées, dans vos sous-vêtements il vous faudra consulter un gynécologue au plus vite. Sachez néanmoins qu’il existe plusieurs maladies pouvant causer un saignement vaginal et il revient donc à votre médecin d’en trouver l’origine.\n\nSi vous ressentez des douleurs anormales et vives lors d’un rapport sexuel cela peut être le signe d’un cancer du col de l’utérus.\n\nLes pertes blanches sont un phénomène naturel et fréquent chez les femmes. Toutefois, lorsque les leucorrhées sont anormales ou plus abondantes que d’ordinaire, cela peut être le signe d’une infection ou d’un cancer du col de l’utérus.\n\nLe pelvis est la zone se trouvant dans le bassin, plus précisément sous l’abdomen. Des douleurs au niveau de cette zone peuvent être signe d’un cancer du col de l’utérus.\n\nSi vous présentez un ou plusieurs de ces symptômes il est essentiel de consulter un médecin qui pourra dépister la présence du papillomavirus humain et donc potentiellement celui du cancer du col de l’utérus.\n\nSelon l’agence nationale de santé publique française, « Le cancer du col de l’utérus peut être évité grâce à deux interventions très efficaces ». Les voici :\n\nLire aussi : Quand et pourquoi consulter un sexologue ?\n\nComme on vous l’a mentionné plutôt, c’est le papillomavirus humain qui est responsable de la presque totalité des cas du cancer du col de l’utérus. Se faire vacciner contre ce virus permet donc d’éviter l’infection du col par celui-ci et donc aide à prévenir le cancer.\n\nLorsqu’un col de l’utérus est infecté par le papillomavirus humain, le cancer ne se développe pas tout de suite. Le virus développe des lésions qualifiées de précancéreuses qui peuvent potentiellement devenir un cancer. Le dépistage et le traitement de ces lésions avant qu’il ne soit trop tard est primordial pour éviter de contracter cette maladie.\n\nLire aussi : La pleine lune du 7 Janvier apporte de belles choses à ces signes du zodiaque chanceux", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "Le cancer du col de l’utérus est un tueur silencieux : 4 signes à identifier", "description": "Le cancer du col de l’utérus est l’un des cancers les plus répandus chez la gente féminine. Voici les signes et symptômes que chaque femme doit connaître.", "url": "https://www.santeplusmag.com/quels-sont-les-signes-du-cancer-de-luterus/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Cancer", "updated_time": "2020-12-19T22:02:30+01:00", "image": "https://www.santeplusmag.com/wp-content/uploads/quels-sont-les-signes-du-cancer-de-luterus-1-1200x628.jpg", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/quels-sont-les-signes-du-cancer-de-luterus-1-1200x628.jpg", "image:width": "1200", "image:height": "628", "image:alt": "Cancer", "image:type": "image/jpeg", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["#le-papillomavirus-humain", "#les-symptomes-du-cancer-du-col-de-luterus", "#1-saignements-vaginaux-anormaux", "#2-douleurs-lors-de-relations-sexuelles", "#3-pertes-vaginales-inhabituelles", "#4-douleurs-pelviennes", "#un-cancer-evitable", "#la-vaccination", "#le-depistage", "https://www.santepubliquefrance.fr/maladies-et-traumatismes/cancers/cancer-du-col-de-l-uterus", "https://www.cancer.be/les-cancers/facteurs-de-risque/le-papillomavirus-quest-ce-exactement", "https://www.santeplusmag.com/111121986-comment-agit-le-collagene-dans-notre-organisme-os-et-muscles-23-03-2023/", "https://www.santepubliquefrance.fr/maladies-et-traumatismes/cancers/cancer-du-col-de-l-uterus", "https://www.santeplusmag.com/une-gynecologue-met-en-garde-les-femmes-qui-mettent-de-lail-dans-leur-vagin/", "https://www.santeplusmag.com/7-signes-precurseurs-qui-apparaissent-1-mois-avant-un-avc/", "https://www.ncbi.nlm.nih.gov/books/NBK65985/#CDR0000062961__130", "https://www.santeplusmag.com/lodeur-vaginale-revele-des-choses-sur-la-sante/", "https://www.santepubliquefrance.fr/maladies-et-traumatismes/cancers/cancer-du-col-de-l-uterus", "https://www.santeplusmag.com/111120948-quand-et-pourquoi-consulter-un-sexologue-medecine-25-01-2023/", "https://www.santeplusmag.com/111120546-la-pleine-lune-du-7-janvier-apporte-de-belles-choses-a-ces-signes-du-zodiaque-chanceux-astrologie-02-01-2023/"], "authors": ["Laurence O"], "publish_date": "2019-12-16T16:43:34+01:00"}