{"result_id": "266016", "URL": "https://www.santeplusmag.com/cette-maman-et-ce-papa-enterrent-leur-enfant-de-2-ans-puis-sont-a-nouveau-frappes-par-une-grande-tragedie/", "timestamp": "2023-04-25 17:03:05 CEST+0200", "meta": {"description": "Découvrez l’histoire de cette maman et ce papa qui enterrent leur enfant de 2 ans, puis sont à nouveau frappés par une nouvelle tragédie indescriptible.", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/cette-maman-et-ce-papa-enterrent-leur-enfant-de-2-ans-puis-sont-a-nouveau-frappes-par-une-grande-tragedie/", "encoding": "utf-8"}, "image": null, "domain": "www.santeplusmag.com", "title": "« Adieu petit ange » Des parents inconsolables enterrent leur bébé de deux mois mort d’un cancer et leur autre fils finit à l’hôpital", "cleaned_text": "La perte d’un être cher peut amener quiconque à se sentir déprimé, désemparé, impuissant, et en colère et voulant blâmer la terre entière. Lorsque nous perdons un être cher, c’est une tragédie, quelle que soit la manière dont la mort est survenue.\n\nL’importance de la perte tend à déterminer l’intensité du chagrin et sa difficulté. Le deuil n’est pas un processus uniforme, ni traité de la même façon par deux personnes, même si elles partagent la même tragédie. Le deuil est traité en fonction de la personnalité de chacun, de ses croyances, de sa foi, des facteurs de stress ou des expériences de la vie.\n\nLire aussi : Une jeune femme aide un aveugle à prendre un taxi, son acte est salué par les internautes\n\nParfois, les tragédies peuvent se succéder rapidement, et cette famille en a fait la terrible expérience. Ces parents ont perdu leur petit garçon qui était atteint de cancer. Cette maladie est un fléau mondial qui décime les adultes et les enfants sans aucune distinction.\n\nLa famille Allen était une famille heureuse composée de cinq personnes dans la petite ville de Colerain Township, dans l’état de l’Ohio, aux États-Unis.\n\nShilo et Todd ont eu trois enfants : Andrew, McKenzie et leur plus jeune fils Brody. Cependant, les médecins ont diagnostiqué Brody d’une maladie grave, ce qui a profondément secoué la famille.\n\nBrody était né avec un cancer rare qui a provoqué une croissance de tumeurs dans son cerveau. Le pronostic des médecins disait que Brody ne terminerait pas l’année. Sur les médias sociaux, l’histoire de Brody a commencé à circuler, des millions de personnes ont été touchées.\n\nSuite à sa situation, la famille Allen a décidé de célébrer Noël en septembre, ainsi toute la communauté du canton de Colerain s’est jointe à Brody pour un dernier Noël.\n\nMalheureusement, Brody Allen est décédé un mois plus tard, en octobre. Suite à cela, le père Todd a fait une annonce tragique sur Facebook en écrivant :\n\n« Bonjour. C’est avec la plus profonde tristesse que je veux vous dire que Brody a perdu son combat. A 6 heures du matin, Brody est parti silencieusement et paisiblement dans les bras de sa mère Shilo. Il n’a pas souffert. Il était entouré de sa famille et sans aucun doute avec de nombreux anges. Malgré notre profonde tristesse, nous sommes réconfortés de savoir qu’aujourd’hui notre fils est entre les mains de Dieu. »\n\nUn mois après le décès de Brody, la famille Allen a été confrontée à une nouvelle tragédie encore plus grande. Le frère aîné de Brody, Andrew, a été victime d’un grave accident de voiture.\n\nAndrew a été grièvement blessé et était dans un état critique à l’hôpital. Il était en paralysie médicale pour éviter de nouveaux dommages à son corps.\n\nSur Facebook, le père Todd a écrit un post pour demander de l’aide car l’état d’Andrew était critique. Il souffrait de lésions cérébrales traumatiques très graves menaçant son pronostic vital, de lésions aux reins, d’une petite déchirure de la rate, d’une omoplate cassée et d’une clavicule cassée. Le père chagriné par cette tragédie a prié tout le monde d’aider son fils financièrement en collectant de l’argent pour sa guérison et en priant pour lui.\n\nLire aussi : Une maman donne naissance à des vrais triplés : un phénomène rare\n\nCe que la famille Allen a enduré est terrible, chose qui mérite beaucoup de soutien et de prières. N’hésitez pas à partager cette histoire pour que cette famille Allen puisse obtenir le plus large soutien possible.\n\nLire aussi : Charlie, un chien mourant reste en vie pour voir sa maitresse bien-aimé se marier", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "« Adieu petit ange » Des parents inconsolables enterrent leur bébé de deux mois mort d’un cancer et leur autre fils finit à l’hôpital", "description": "Découvrez l’histoire de cette maman et ce papa qui enterrent leur enfant de 2 ans, puis sont à nouveau frappés par une nouvelle tragédie indescriptible.", "url": "https://www.santeplusmag.com/cette-maman-et-ce-papa-enterrent-leur-enfant-de-2-ans-puis-sont-a-nouveau-frappes-par-une-grande-tragedie/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Psycho & Sexualité", "updated_time": "2022-07-13T17:51:11+02:00", "image": "https://www.santeplusmag.com/wp-content/uploads/cette-maman-et-ce-papa-enterrent-leur-enfant-de-2-ans-puis-sont-a-nouveau-frappes-par-une-grande-tragedie-1-1200x628.jpg", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/cette-maman-et-ce-papa-enterrent-leur-enfant-de-2-ans-puis-sont-a-nouveau-frappes-par-une-grande-tragedie-1-1200x628.jpg", "image:width": "1200", "image:height": "628", "image:alt": "tragédie", "image:type": "image/jpeg", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["#la-perte-dun-etre-cher", "#une-perte-terrible", "#une-tragedie-de-plus", "https://www.santeplusmag.com/medecine-chinoise-ce-que-la-colere-ou-la-tristesse-peuvent-faire-a-votre-corps/", "https://www.santeplusmag.com/il-ny-a-rien-de-plus-difficicile-que-de-perdre-un-etre-cher-voici-les-conseils-dun-vieil-homme-pour-faire-son-deuil/", "https://www.santeplusmag.com/111122212-une-jeune-femme-aide-un-aveugle-a-prendre-un-taxi-son-acte-est-salue-par-les-internautes-temoignages-14-04-2023/", "https://www.santeplusmag.com/mobilisons-nous-contre-le-cancer-du-sein-en-reperant-ses-signes-avant-coureurs/", "https://www.santeplusmag.com/111122156-une-maman-donne-naissance-a-des-vrais-triples-un-phenomene-rare-temoignages-12-04-2023/", "https://www.santeplusmag.com/111122152-charlie-un-chien-mourant-reste-en-vie-pour-voir-sa-maitresse-bien-aime-se-marier-temoignages-11-04-2023/"], "authors": ["Nicolas Bonneau"], "publish_date": "2018-11-29T09:53:16+01:00"}