{"result_id": "266033", "URL": "https://www.santeplusmag.com/vous-promenez-vous-avec-votre-chien-mefiez-vous-de-ce-signe-cela-pourrait-etre-quelque-chose-de-grave-animaux-000015256/", "timestamp": "2023-04-25 17:03:11 CEST+0200", "meta": {"description": "La toux du chenil est une affection de l’appareil respiratoire qui se répand très vite. Si vous promenez votre chien, vous devez être vigilant à ce signe.", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/vous-promenez-vous-avec-votre-chien-mefiez-vous-de-ce-signe-cela-pourrait-etre-quelque-chose-de-grave-animaux-000015256/", "encoding": "utf-8"}, "image": null, "domain": "www.santeplusmag.com", "title": "Vous promenez-vous avec votre chien ? Méfiez-vous de ce signe, cela pourrait être quelque chose de grave", "cleaned_text": "La trachéobronchite infectieuse canine est une maladie qui peut être causée par plusieurs virus ou bactéries. Il s’agit d’une co-infection, ce qui signifie qu’elle est due à une contamination par différents agents pathogènes avec une surinfection possible. Vous devez rester vigilant lorsque vous promenez votre chien puisque cette maladie est particulièrement contagieuse.\n\nSi vous avez la chance d’avoir un chien, il est fort probable que vous lui consacriez des balades quotidiennement. Mais il arrive parfois que durant une balade, le chien contracte la trachéobronchite infectieuse canine. Ainsi, il est important de se méfier des quintes de toux que peut présenter un chien et l’emmener sans attendre chez un vétérinaire pour établir un diagnostic.\n\nLire aussi : Un chien attend devant une maison pendant des semaines après que sa famille ait déménagé et l’a abandonné\n\nComme expliqué par le Dr Wendy Brooks, spécialiste en pratique canine et féline de l’American Academy of Veterinary Dermatology, la toux du chenil peut être causée par différents virus et bactéries comme la bactérie Bordetella bronchiseptica, le virus respiratoire Parainfluenza ou encore l’adénovirus canin. Cette maladie est une affection de l’appareil respiratoire très contagieuse. En effet, un simple contact avec un chien infecté lors d’une balade peut suffire à contaminer votre chien. La contagion survient par voie aérienne, quand un chien infecté tousse ou éternue. En sus, elle peut se manifester lorsqu’un chien sain touche des surfaces contaminées ou qu’il se trouve face à un animal malade.\n\nQuels sont les symptômes de la maladie chez le chien ?\n\nLes symptômes de la toux du chenil comprennent des quintes de toux sèche qui peuvent s’accompagner d’un écoulement du nez et des yeux, d’une perte d’appétit, des éternuements et des vomissements. Dans les cas graves, ces symptômes s’accompagnent également d’une grande fatigue, d’une fièvre, voire de troubles respiratoires. Généralement, les symptômes de la maladie apparaissent trois à cinq jours après la contamination. Toutefois, il arrive parfois que les symptômes disparaissent un temps, puis ressurgissent plusieurs jours ou semaines plus tard.\n\nLire aussi : Obéissance canine – Comment bien éduquer son chien ?\n\nÀ l’instar d’une simple grippe, la trachéo-bronchite canine ne nécessite qu’un traitement basique lorsque la forme est bénigne. Ainsi, le vétérinaire prescrit des antitussifs pour soigner la toux. Dans les cas graves, il peut compléter le traitement avec des antibiotiques. Le traitement peut durer jusqu’à 6 semaines, durant lesquelles le chien continue à être contagieux. Le vétérinaire peut connaître le degré de gravité de l’infection et de l’atteinte respiratoire en effectuant une prise de sang, un examen clinique complet de l’animal et une radio du thorax. Lorsque le traitement antibiotique ne suffit pas à traiter l’infection bactérienne, le vétérinaire peut décider d’hospitaliser le chien pour un traitement plus poussé.\n\nLa vaccination pour protéger le chien contre l’infection\n\nPour prévenir l’infection, la vaccination est vivement conseillée. Que votre chien soit sociable et aime le contact avec ses congénères ou non, ce moyen reste fiable et efficace pour éviter la propagation de la maladie. On distingue deux types de vaccin contre la toux du chenil : un vaccin qui se fait par voie intranasale et un vaccin qui se fait par voie sous-cutanée. Chaque vaccin cible des virus différents et cela revient au médecin de choisir celui qui convient le mieux à l’animal. Cependant, le vaccin le plus couramment utilisé aujourd’hui est celui qui se fait par voie sous-cutanée. Les vétérinaires ont l’habitude de le faire au chien en même temps que le vaccin contre la maladie de Carré et celui contre le parvovirus. Pour une efficacité optimale, le chien doit renouveler ce vaccin tous les ans.\n\nLire aussi : Sur cette photo se cache un chien que tout le monde ne voit pas : pouvez-vous le voir ?", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "Vous promenez-vous avec votre chien ? Méfiez-vous de ce signe, cela pourrait être quelque chose de grave", "description": "La toux du chenil est une affection de l’appareil respiratoire qui se répand très vite. Si vous promenez votre chien, vous devez être vigilant à ce signe.", "url": "https://www.santeplusmag.com/vous-promenez-vous-avec-votre-chien-mefiez-vous-de-ce-signe-cela-pourrait-etre-quelque-chose-de-grave-animaux-000015256/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Chiens", "updated_time": "2023-04-24T22:46:32+02:00", "image": "https://www.santeplusmag.com/wp-content/uploads/Vous-promenez-vous-avec-votre-chien-1200x628.jpg", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/Vous-promenez-vous-avec-votre-chien-1200x628.jpg", "image:width": "1200", "image:height": "628", "image:alt": "Vous promenez-vous avec votre chien ? Méfiez-vous de ce signe, cela pourrait être quelque chose de grave", "image:type": "image/jpeg", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["#un-signe-quil-faut-absolument-reperer-chez-le-chien", "#quels-sont-les-symptomes-de-la-maladie-chez-le-chien", "#la-vaccination-pour-proteger-le-chien-contre-linfection", "https://www.santeplusmag.com/les-7-bienfaits-davoir-un-chien-sur-votre-sante/", "https://www.santeplusmag.com/111122128-un-chien-attend-devant-une-maison-pendant-des-semaines-apres-que-sa-famille-ai-demenage-et-la-abandonne-temoignages-09-04-2023/", "https://veterinarypartner.vin.com/default.aspx?pid=19239&id=4951478", "https://www.santeplusmag.com/le-gel-desinfectant-permet-de-tuer-les-bacteries-et-les-virus-voici-comment-fabriquer-un-gel-naturel-a-la-maison/", "https://www.santeplusmag.com/111122038-obeissance-canine-comment-bien-eduquer-son-chien-animaux-29-03-2023/", "https://www.santeplusmag.com/un-chien-peut-mourir-48h00-apres-les-symptomes-les-veterinaires-alertent-contre-un-nouveau-virus-mortel-pour-les-chiens/", "https://www.santeplusmag.com/111121836-sur-cette-photo-se-cache-un-chien-que-tout-le-monde-ne-voit-pas-pouvez-vous-le-voir-developpement-personnel/"], "authors": ["Charlotte Gauthier"], "publish_date": "2022-04-05T08:02:43+02:00"}