{"result_id": "266075", "URL": "https://www.santeplusmag.com/cette-maman-a-partage-photo-avertir-autres-mamans-empecher-de-faire-meme-erreur/", "timestamp": "2023-04-25 17:03:25 CEST+0200", "meta": {"description": "une maman a publié la photo de son fils qui a attrapé la varicelle, pour sensibiliser les parents des risques de la non vaccination...", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/cette-maman-a-partage-photo-avertir-autres-mamans-empecher-de-faire-meme-erreur/", "encoding": "utf-8"}, "image": null, "domain": "www.santeplusmag.com", "title": "Cette maman a partagé une photo pour avertir les autres mamans et les empêcher de faire la même erreur !", "cleaned_text": "Cette maladie principalement infantile provoque l’apparition de boutons ou vésicules rouges, par poussées, qui entraînent d’importantes démangeaisons chez la personne atteinte. Les premiers symptômes de la varicelle peuvent ressembler à ceux d’une grippe : fièvre, douleur abdominale, maux de tête et sensation générale de fatigue. Ils peuvent se manifester à l’apparition de l’éruption cutanée ou un à deux jours avant.\n\nModes de contagion de la varicelle\n\nCette maladie peut être transmise par différentes voies :\n\nLire aussi : Une chienne abandonnée par ses propriétaires attend leur retour\n\nVoie cutanée : le contact entre une personne infectée et un individu sain peut entraîner la déclaration de la maladie. Il est important de savoir que le liquide qui s’écoule des lésions cutanées est porteur du virus.\n\nVoie aérienne : rester dans la même pièce qu’un sujet atteint peut entraîner la contagion notamment lors de la toux. Les gouttelettes issues de la respiration sont porteuses de virus.\n\nVoie fœto-maternelle : des cas de varicelle congénitale peuvent être constatés chez des nouveau-nés dont la mère a attrapé la maladie peu de temps avant l’accouchement.\n\nLa plupart du temps, la maladie se déclare entre 2 et 10 ans et de ce fait, sa transmission est plus élevée dans les endroits qui réunissent de nombreux enfants (crèches, garderies, centre de loisirs…).\n\nÉtant une maladie virale, les traitements de la varicelle restent principalement symptomatiques, à savoir lutter contre la fièvre, soulager les démangeaisons et éviter les lésions. Pour éviter tout risque de complications, suivez attentivement les conseils de votre médecin.\n\nDécouvrons à présent l’histoire de Elijah, ce bébé de 11 mois qui attrapé la varicelle \n\n La maman d’Elijah, Kayley Burke réside au Queensland en Australie, où elle a lancé un appel désespéré aux parents pour faire vacciner leurs enfants. Son nourrisson a été hospitalisé jeudi après que la varicelle qu’il avait contractée ait empiré.\n\nKayley a partagé la photo de son bébé avec de terribles croûtes couvrant son petit corps. Son but était de lancer un avertissement pour les parents qui sont contre les vaccinations. Puisqu’Elijah n’a pas été vacciné contre la maladie vu son très jeune âge, les cloques et les croûtes provoquées par la varicelle ont mené à une infection secondaire qui mettait sérieusement sa vie en danger.\n\nDepuis que Burke a partagé les photos déchirantes sur Facebook, celles-ci ont été partagées sur le réseau plus de 5000 fois. Elle a sous-titré la photo avec un message aux parents qui ne vaccinent pas leurs enfants en leur expliquant l’importance du danger auquel ils les exposent.\n\nElijah a attrapé la varicelle il y a plus de sept jours. C’est à ce moment que ses symptômes ont commencé à apparaître. En plus d’Elijah, sa mère et sa sœur de trois ans, Kaliah, ont également été contaminées par la maladie, bien que Kaliah ait récemment reçu sa vaccination.\n\nLa maman a continué à décrire l’horrible réaction de la maladie sur son corps car elle ressentait des douleurs atroces qu’elle ne pouvait pas supporter. Les médecins ont donc dû lui prescrire des médicaments pour la soulager.\n\nLire aussi : Une femme tombe enceinte alors qu’elle était déjà enceinte\n\nUne fois son bébé a arrêté de boire, Kayley l’a rapidement conduit à l’hôpital pour une prise en charge urgente. La varicelle avait atteint sa gorge et le petit ne pouvait plus avaler.\n\nBeaucoup de libéraux croient que les vaccins sont dangereux pour la santé.. Certains théoriciens de la conspiration croient même qu’ils sont un moyen pour le gouvernement de contrôler la population. Mais la question de l’importance de la vaccination est très sensible car seuls les parents, dont les enfants ont attrapé des maladies contagieuses, peuvent en témoigner.\n\nLire aussi : Une maman donne naissance à des vrais triplés : un phénomène rare", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "Cette maman a partagé une photo pour avertir les autres mamans et les empêcher de faire la même erreur !", "description": "une maman a publié la photo de son fils qui a attrapé la varicelle, pour sensibiliser les parents des risques de la non vaccination...", "url": "https://www.santeplusmag.com/cette-maman-a-partage-photo-avertir-autres-mamans-empecher-de-faire-meme-erreur/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Psycho & Sexualité", "updated_time": "2021-12-24T11:23:32+01:00", "image": "https://www.santeplusmag.com/wp-content/uploads/Cette-maman-a-partage-une-photo-pour-avertir-les-autres-mamans-et-les-empecher-de-faire-la-meme-erreur-1-1200x628.jpg", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/Cette-maman-a-partage-une-photo-pour-avertir-les-autres-mamans-et-les-empecher-de-faire-la-meme-erreur-1-1200x628.jpg", "image:width": "1200", "image:height": "628", "image:alt": "maman", "image:type": "image/jpeg", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["#modes-de-contagion-de-la-varicelle", "https://www.santeplusmag.com/111122189-une-chienne-abandonnee-par-ses-proprietaires-attend-leur-retour-temoignages-14-04-2023/", "https://www.santeplusmag.com/comment-detoxifier-le-corps-avec-de-lhuile-de-coco-et-eliminer-les-parasites-les-virus-et-les-infections-fongiques/", "https://www.santeplusmag.com/19-utilisations-surprenantes-de-lhuile-de-coco-pour-la-peau/", "https://www.santeplusmag.com/dites-adieu-aux-douleurs-cette-astuce-magique/", "https://www.santeplusmag.com/111122158-une-femme-tombe-enceinte-alors-quelle-etait-deja-enceinte-temoignages-12-04-2023/", "https://www.santeplusmag.com/111122156-une-maman-donne-naissance-a-des-vrais-triples-un-phenomene-rare-temoignages-12-04-2023/"], "authors": ["Laurence O"], "publish_date": "2017-10-11T14:23:26+02:00"}