{"result_id": "266030", "URL": "https://www.santeplusmag.com/un-garcon-de-14-ans-meurt-dune-maladie-neurologique-rare-apres-setre-plaint-dun-mal-de-tete/", "timestamp": "2023-04-25 17:03:10 CEST+0200", "meta": {"description": "L’histoire tragique d’un garçon de 14 ans qui est décédé d’une affection neurologique rare après s’être pleins de maux de tête après son match de football.", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/un-garcon-de-14-ans-meurt-dune-maladie-neurologique-rare-apres-setre-plaint-dun-mal-de-tete/", "encoding": "utf-8"}, "image": null, "domain": "www.santeplusmag.com", "title": "Après avoir ressenti une migraine, un adolescent de 14 ans meurt d’une maladie rare", "cleaned_text": "S’il existe certaines astuces pour soulager les formes légères de migraines, elles peuvent dans certains cas s’avérer fatales. Christopher Bunch a ressenti un léger mal de tête suite à sa séance habituelle de football, mais cela s’est vite transformé en une tragédie pour sa famille. Un cas qui rappelle à quel point certains maux de tête peuvent s’avérer particulièrement dangereux.\n\nL’adolescent est décédé des suites de complications d’une encéphalomyélite aigue disséminée (ADEM) qui s’avère être une maladie neurologique rare. C’est ce qu’ont conclu ses médecins.\n\nLire aussi : Une chienne abandonnée par ses propriétaires attend leur retour\n\nLa maladie surviendrait après une infection et en raison de sa rareté, il est extrêmement difficile de la traiter d’après les experts médicaux.\n\nChristopher a rapidement vu son état s’aggraver après son match, ce qui a d’autant plus choqué ses parents. Sa mère, Destiny Maynard a déclaré : « à moins d’autre chose, je pensais qu’il était probablement très déshydraté ».\n\nSa supposition s’est vite avérée fausse quand ils ont compris que les choses étaient bien plus terribles pour Christopher. Selon le Daily Mail, il avait passé 48 heures à dormir. En constatant cela, ils l’ont précipité aux urgences.\n\nMais l’état de l’adolescent s’est encore plus aggravé pendant sa prise en charge. Son père, Elijah Mendoza Bunch a déclaré : « Sa progression est passée de zéro à cent en un laps de temps de 4 heures ».\n\nQuelques temps après, Christopher respirait de plus en plus difficilement et a également subi une paralysie complète du côté gauche de son corps. Son état était critique et même en tentant de soulager la pression exercée sur son cerveau, sa condition ne s’est pas améliorée.\n\nLes victimes de l’encéphalomyélite aigue disséminée (ADEM) sont généralement des enfants. Avant le diagnostic de cette maladie, il peut y avoir un infection virale ou bactérienne. La condition peut aussi se manifester après une vaccination, avec des symptômes comme la confusion, la somnolence, le coma, l’instabilité, des problèmes de vision, une difficulté à avaler ou bien une faiblesse des bras et des jambes.\n\nEn effet, l’adolescent avait récemment souffert d’une infection qui a précédé l’administration d’un vaccin d’après une publication de sa mère sur Facebook.\n\nLa famille de Christopher est dévastée\n\nLes médecins ont diagnostiqué à Christopher une hernie cérébrale. « La pire nouvelle que je n’ai jamais pu recevoir » a confié Elijah. Deux jours après le diagnostic, l’adolescent a été déclaré mort.\n\nDans une publication sur Facebook, le papa de Christopher a exprimé son chagrin : « S’il vous plaît, Seigneur, veillez sur mon fils et prenez bien soin de lui. Mon fils, je t’aime tellement et je t’aimerai toujours et pour toujours et te garderai dans mon cœur ».\n\nLe garçon est décrit par sa famille comme un jeune homme charismatique au grand cœur. Il rêvait également d’avoir une influence sur les médias sociaux. « L’un de ses rêves était de réussir sur YouTube » a déclaré son père.\n\nSa mère, en faisant référence à son rêve, a écrit les mots suivants : « Eh bien, mon fils Christopher Bunch, ton rêve devient réalité, mon cher ». Son père, à son tour a écrit : « Tu as maintenant plus de 3 000 vues sur ton vlog sur YouTube. Ce n’est que le début mon garçon. Assures-toi simplement qu’au paradis, tu vlogues comme un fou. Papa t’aime toujours et pour toujours mon blond aux yeux bleu ».\n\nL’EMAD représente une atteinte inflammatoire auto-immune qui implique le cerveau ainsi que la moelle épinière.\n\nLire aussi : Une femme tombe enceinte alors qu’elle était déjà enceinte\n\nCette affection concerne généralement les enfants et survient à la suite d’une infection ou à une vaccination. Elle peut toutefois être idiopathique. Cliniquement, elle indique une encéphalopathie aigue qui se joint à des signes neurologiques multifocaux.\n\nPar ailleurs, pour les cas moins fatals de migraines, il semble qu’une carence en vitamine B peut favoriser les migraines.\n\nLire aussi : Une maman donne naissance à des vrais triplés : un phénomène rare", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "Après avoir ressenti une migraine, un adolescent de 14 ans meurt d’une maladie rare", "description": "L’histoire tragique d’un garçon de 14 ans qui est décédé d’une affection neurologique rare après s’être pleins de maux de tête après son match de football.", "url": "https://www.santeplusmag.com/un-garcon-de-14-ans-meurt-dune-maladie-neurologique-rare-apres-setre-plaint-dun-mal-de-tete/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Psycho & Sexualité", "updated_time": "2021-12-24T11:29:04+01:00", "image": "https://www.santeplusmag.com/wp-content/uploads/un-garcon-de-14-ans-meurt-dune-maladie-neurologique-rare-apres-setre-plaint-dun-mal-de-tete-1200x628.jpg", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/un-garcon-de-14-ans-meurt-dune-maladie-neurologique-rare-apres-setre-plaint-dun-mal-de-tete-1200x628.jpg", "image:width": "1200", "image:height": "628", "image:alt": "un-garcon-de-14-ans-meurt-dune-maladie-neurologique-rare-apres-setre-plaint-dun-mal-de-tete", "image:type": "image/jpeg", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["#ladolescent-souffrait-dune-encephalomyelite-aigue-disseminee-emad", "#la-sante-de-christopher-sest-rapidement-deterioree", "#la-famille-de-christopher-est-devastee", "#quest-ce-que-lemad", "https://www.santeplusmag.com/souffrez-de-migraines-solutions-simples-completement-changer-vie/", "https://www.santeplusmag.com/10-maux-de-tete-plus-dangereux-mortels-ne-devriez-negliger/", "https://www.santeplusmag.com/111122189-une-chienne-abandonnee-par-ses-proprietaires-attend-leur-retour-temoignages-14-04-2023/", "https://www.dailymail.co.uk/news/article-6064745/Iowa-boy-14-dies-doctors-discover-rare-neurological-disease.html", "https://www.santeplusmag.com/111122158-une-femme-tombe-enceinte-alors-quelle-etait-deja-enceinte-temoignages-12-04-2023/", "https://www.santeplusmag.com/une-carence-en-cette-vitamine-provoque-migraines-et-maux-de-tete-voici-comment-y-remedier/", "https://www.santeplusmag.com/111122156-une-maman-donne-naissance-a-des-vrais-triples-un-phenomene-rare-temoignages-12-04-2023/"], "authors": ["Laurence O"], "publish_date": "2021-01-05T12:15:00+01:00"}