{"result_id": "266076", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://www.santeplusmag.com/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/&prev=search&pto=aue", "timestamp": "2023-04-25 17:03:25 CEST+0200", "meta": {"description": "La coqueluche est une maladie respiratoire qui peut être sévère dans la petite enfance mais aussi à tout âge. La vaccination peut-elle nous protéger efficacement ?", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "translate.google.com", "title": "La coqueluche est-elle contagieuse ? Pendant combien de temps chez les adultes s’ils sont vaccinés", "cleaned_text": "Caractérisée par une toux en quintes, la coqueluche est une maladie contagieuse qui peut se révéler grave chez les nourrissons mais aussi chez les jeunes enfants, les femmes enceintes ainsi que les personnes âgées. Éclaircissements sur cette affection respiratoire avec Healthline.\n\nQuelles sont les causes de la coqueluche ?\n\nSelon l’Institut Pasteur, cette maladie est depuis longtemps considérée comme une maladie affectant uniquement les enfants, puisqu’elle peut être mortelle pour les nourrissons de moins de 6 mois. Or, elle peut impacter sévèrement l’homme à tout âge et particulièrement les femmes enceintes et les personnes âgées.\n\nLire aussi : Comment agit le collagène dans notre organisme ?\n\nLa coqueluche est une infection respiratoire causée par la bactérie Bordetella pertussis, appelée également bacille de Bordet et Gengou. Cette bactérie contient du dioxygène. Ainsi, le germe diffuse des toxines spécifiques qui causent la maladie. La coqueluche démarre par une phase d’incubation qui dure entre 7 et 14 jours et la période d’invasion est de 10 jours. Dans certains cas, les symptômes ne peuvent apparaître qu’après trois semaines.\n\nQuels sont les symptômes ?\n\nDurant la première semaine, la personne infectée ne présente aucun symptôme. Survient par la suite un écoulement nasal qui peut durer plus d’une semaine et en général sans fièvre ; c’est le stade catarrhal, où l’on peut observer également des signes comme une rhinite ou des éternuements.\n\nCes symptômes sont suivis d’une toux qui évolue et se transforme en quintes fréquentes et prolongées notamment la nuit. Des vomissements peuvent survenir sans fièvre ; il s’agit de la phase paroxystique qui peut durer entre une et six semaines. Cette toux peut être à l’origine d’un éclatement de petits vaisseaux autour des yeux et le visage peut devenir rouge ou vêtir une teinte bleutée. A la fin de la quinte, le malade reprend sa respiration. Mais la reprise peut être bruyante et ressembler au chant du coq.\n\nLa troisième étape (convalescente) permet une récupération progressive et peut durer de quelques semaines à un mois.\n\nCette maladie peut présenter des complications à savoir :\n• Une pneumonie qui peut devenir sévère et nécessiter une hospitalisation ;\n• Une malnutrition et une déshydratation à cause notamment des vomissements et de la difficulté à s’alimenter convenablement ;\n• Une otite moyenne aiguë ou surinfections broncho-pulmonaires ;\n• Des convulsions qui sont des complications neurologiques notamment chez les jeunes enfants ou encore des hémorragies intracrâniennes ;\n• Un décès dans les cas plus sévères, en cas de défaillance respiratoire, voire multiviscérale qui peut survenir chez le nourrisson.\n\nLa coqueluche demeure très contagieuse. Selon l’Inserm, chaque année, 300 000 enfants meurent de cette maladie et 40 millions en sont atteints de par le monde. Une personne atteinte peut contaminer 15 autres en moyenne.\n\nLa coqueluche est notamment contagieuse durant les premiers stades de l’infection. A compter des premiers symptômes et durant les deux premières semaines où une personne atteinte tousse, elle peut propager la maladie. En effet, la contamination se fait par voie aérienne interhumaine comme publié dans un article de Doctissimo revisité par le Dr Jacqueline Rossant-Lumboso, médecin généraliste et le Dr Lyonel Rossant, Pédiatre. La projection de gouttelettes de salive pendant la toux, notamment durant la phase catarrhale, constitue le risque de contagion le plus élevé. A la phase paroxystique, le risque tend à diminuer mais peut être prolongé à 3 semaines. Les enfants en âge préscolaire ou scolaire demeurent la principale source de contamination. Pour autant les adultes et les sujets âgés peuvent également l’être car souvent les symptômes sont mal identifiés chez eux.\n\nPour établir leur diagnostic, les spécialistes s’intéressent généralement à trois critères, reposant sur le caractère de la toux, l’évolution de la maladie mais aussi la source de la contamination. Une radiographie pulmonaire peut être effectuée afin de faire un constat sur l’atteinte des voies respiratoires. Une bactériologie par PCR permet d’identifier le germe et diagnostiquer la coqueluche.\n\nToujours selon l’Institut Pasteur, l’impact de la maladie a fortement baissé dans les pays ayant opté pour la vaccination généralisée des enfants. Or en 2014, les estimations annuelles selon l’OMS, ont indiqué 24 millions de cas de coqueluche dans le monde, notamment chez les enfants de moins de 5 ans, avec un décès de 160 700 cas.\n\nEn France, le vaccin anti coquelucheux est recommandé dès l’âge de 2 mois associé à d’autres vaccins contre le tétanos, l’hépatite B, la diphtérie, l’Haemophilus B, et la poliomyélite. Les nourrissons, ayant une immunité plus faible contre la coqueluche, sont particulièrement vulnérables jusqu’à l’âge de six mois. Des rappels sont également à faire à l’âge de 6 ans, entre 11 et 13 ans, puis à 25 ans. Ce vaccin est également recommandé à tous les adultes qui n’ont pas été vaccinés contre cette maladie respiratoire depuis 10 ans. Par ailleurs, comme le mentionne l’Institut Pasteur, les adultes âgés de plus de 25 ans n’ayant pas reçu de rappel peuvent le recevoir jusqu’à l’âge de 39 ans.\n\nPar ailleurs, le CDC recommande aux femmes enceintes de recevoir une vaccination de rappel au troisième trimestre la grossesse afin de transférer les anticorps au nouveau-né permettant de le protéger durant la période qui précède la vaccination.\n\nLes membres de la famille plus âgés, comprenant les grands-parents, les frères et les sœurs peuvent transmettre cette maladie au nourrisson et doivent à leur tour recevoir un rappel de vaccination. Bien que les adultes ou les adolescents peuvent contracter la coqueluche avec des symptômes légers, ils peuvent souffrir de certaines complications se caractérisant par l’éclatement des vaisseaux sanguins autour des yeux, des côtes fêlées ou une pneumonie.\n\nEst-il possible de contracter la coqueluche après vaccination ?\n\nSelon le CDC (Centers for Disease Control and Prevention), les vaccins contre la coqueluche DTaP et Tdap, sont efficaces de 80 à 90% et permettent de prévenir la maladie mais ne permettent pas de protéger toute la vie. Au cours des deux premières années, le niveau de protection est optimal mais diminue cependant avec le temps. Il s’agit de l’immunité décroissante comme appelée par les experts. Le CDC estime par ailleurs, que les personnes vaccinées qui contractent la coqueluche sont moins susceptibles d’avoir une infection grave et les symptômes ne seront pas aussi sévères. Un enfant vacciné contre la coqueluche a moins de risque de souffrir d’apnée, de cyanose et de vomissements.\n\nLa vaccination contre cette maladie respiratoire n’offre pas une protection à vie, ce qui signifie que la contamination est toujours possible. Un rappel de cette vaccination est de rigueur notamment chez les nourrissons, les préadolescents, les adolescents et les adultes. Le vaccin dcaT est recommandé aux enfants de 11 et plus, aux femmes enceintes au troisième trimestre de la grossesse, aux travailleurs de la santé et aux membres de la famille des nourrissons.\n\nLire aussi : Quand et pourquoi consulter un sexologue ?\n\nQuel traitement pour la coqueluche ?\n\nPour soigner cette maladie respiratoire, un traitement curatif s’impose et comprend :\n• L’antibiothérapie qui consiste en une prise d’antibiotiques tels que les macrolides, tétracyclines ou chloramphénicol.\n• Les corticoïdes qui permettent de réduire la sévérité de la toux notamment dans le cas des formes graves.\n• Une bonne hydratation et une bonne nutrition en aliments énergétiques.\n• Une bonne évacuation bronchique par le biais d’une kinésithérapie respiratoire.\n• Un isolement et une bonne surveillance de l’évolution de la maladie.\n\nLire aussi : Mal de gorge : comment le soigner ?", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "La coqueluche est-elle contagieuse ? Pendant combien de temps chez les adultes s’ils sont vaccinés", "description": "La coqueluche est une maladie respiratoire qui peut être sévère dans la petite enfance mais aussi à tout âge. La vaccination peut-elle nous protéger efficacement ?", "url": "https://www.santeplusmag.com/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Santé", "updated_time": "2023-04-13T17:42:25+02:00", "image": "https://www.santeplusmag.com/wp-content/uploads/coqueluche-1200x628.jpg", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/coqueluche-1200x628.jpg", "image:width": "1200", "image:height": "628", "image:alt": "La coqueluche est-elle contagieuse ? Pendant combien de temps chez les adultes s’ils sont vaccinés", "image:type": "image/jpeg", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www-santeplusmag-com.translate.goog/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#quelles-sont-les-causes-de-la-coqueluche", "https://www-santeplusmag-com.translate.goog/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#quels-sont-les-symptomes", "https://www-santeplusmag-com.translate.goog/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#la-coqueluche-est-elle-contagieuse", "https://www-santeplusmag-com.translate.goog/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#coqueluche-et-vaccination", "https://www-santeplusmag-com.translate.goog/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#est-il-possible-de-contracter-la-coqueluche-apres-vaccination", "https://www-santeplusmag-com.translate.goog/la-coqueluche-est-elle-contagieuse-pendant-combien-de-temps-chez-les-adultes-sils-sont-vaccines/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#quel-traitement-pour-la-coqueluche", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.healthline.com/reviewers/karen-richardson-gill-md-faap", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.pasteur.fr/fr/centre-medical/fiches-maladies/coqueluche", "https://www-santeplusmag-com.translate.goog/111121986-comment-agit-le-collagene-dans-notre-organisme-os-et-muscles-23-03-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/7-plantes-medicinales-pour-venir-a-bout-de-la-toux-naturellement/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/quest-ce-que-la-pneumonie-atypique-et-quels-en-sont-les-symptomes/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.inserm.fr/information-en-sante/dossiers-information/coqueluche", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.doctissimo.fr/html/sante/encyclopedie/sa_984_coqueluche.htm", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.cdc.gov/pertussis/about/faqs.html", "https://www-santeplusmag-com.translate.goog/111120948-quand-et-pourquoi-consulter-un-sexologue-medecine-25-01-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/111120441-mal-de-gorge-comment-le-soigner-medecine-28-12-2022/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc"], "authors": ["Charlotte Gauthier"], "publish_date": "2021-06-19T10:52:00+02:00"}