{"result_id": "266007", "URL": "https://www.santeplusmag.com/une-etude-sur-657-461-enfants-prouve-quil-nexiste-aucun-lien-entre-lautisme-et-les-vaccins-ror/", "timestamp": "2023-04-25 17:03:02 CEST+0200", "meta": {"description": "Basés sur des données erronées, les anti-vaccins sèment la confusion chez les parents à propos du vaccin ROR et de l’autisme. Une étude sur 657 461 enfants montre que ce lien n’existe pas.", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/une-etude-sur-657-461-enfants-prouve-quil-nexiste-aucun-lien-entre-lautisme-et-les-vaccins-ror/", "encoding": "utf-8"}, "image": null, "domain": "www.santeplusmag.com", "title": "Une étude sur 657 461 enfants prouve qu’il n’existe aucun lien entre l’autisme et les vaccins ROR", "cleaned_text": "Suite à la polémique engendrée par l’étude d’Andrew Wakefield sur le vaccin ROR (rougeole, oreillons et rubéole) et son lien de cause à effet avec le développement de l’autisme chez les enfants, certains individus anti-vaccins trouvent de la matière à leurs propos. En effet, les dénégations émises par de nombreuses études ne suffisent pas à étouffer la flamme des Antivax qui brûle en France. Suite à une étude menée dans 67 pays sur près de 65 000 personnes pour estimer le degré de confiance accordé aux vaccins, la France s’est démarquée comme le pays le plus sceptique face à leur utilisation, avec 47% de Français qui pensent que les vaccins ne sont pas fiables.\n\nPhénomène exploré par les virologues Françoise Salvadori et Laurent-Henri Vignaud dans l’essai récemment publié : Antivax : Histoire de la résistance aux vaccins du XVIIIème siècle à nos jours, il semblerait que les réticences face à la contribution pasteurienne soient loin de s’atténuer. En effet, les antagonistes du vaccin ont pris d’assaut les réseaux sociaux, multipliant ainsi les témoignages anxiogènes qui ajoutent à la confusion des parents.\n\nLire aussi : L’importance de s’excuser auprès de vos enfants lorsque vous vous trompez\n\nDans un énième effort pour mettre fin aux craintes liées au vaccin ROR et son incidence sur l’autisme, Annals of Internal Medicine publie une recherche exhaustive menée sur 657 461 enfants danois entre 1999 (leur année de naissance) et l’année 2013, dont 95% se sont fait vaccinés par le ROR. Durant cette période, 6517 enfants auraient développé des troubles autistiques, ce qui a permis aux scientifiques d’évaluer les résultats obtenus entre les sujets atteints et leurs homologues. Voici leurs observations principales :\n• Les enfants vaccinés pour le ROR auraient 7% moins de risques que les non-vaccinés d’être autistes\n• Les enfants dont les frères et sœurs sont autistes sont 7 fois plus susceptibles de l’être également, en comparaison avec les familles où l’autisme est absent\n• Les enfants qui n’ont jamais été vaccinés ont 17% de risques supplémentaires de développer l’autisme face aux enfants vaccinés\n• Les garçons courent 4 fois plus le risque d’être autistes que les filles\n\nFace à une controverse qui a mis l’accent sur l’autisme, les scientifiques tiennent à recentrer le débat sur les risques de propagation de la rougeole. Dr Anders Hviid, auteur principal de l’étude, met en garde contre les dangers liés à la non-vaccination : « Les parents ne doivent pas éviter le vaccin par peur de l’autisme. Les dangers de la non-vaccination incluent le retour de la rougeole qui se propage aujourd’hui de manière épidémique. Une simple réduction de 5% dans les vaccins triplerait les cas de rougeole dans notre communauté ».\n\nEn effet, la rougeole est une maladie hautement contagieuse qui peut s’avérer fatale.\n\nIdentifié par le pédopsychiatre Léo Kanner en 1943, ce trouble qui se manifeste généralement avant l’âge de 3 ans comprend « une altération des interactions sociales, des problèmes de communication, des troubles du comportement et des réactions sensorielles inhabituelles ».\n\nPhénomène phare de ces dernières années de recherche, l’autisme a donné lieu à un ensemble de sentiments mitigés. Faussement identifié comme une conséquence du vaccin ROR en 1998, il n’a cessé depuis lors de faire parler de lui. Suite à une réunion du GACVS (Comité consultatif mondial de la sécurité vaccinale) en 2002, l’OMS fait le point sur la situation. Après l’étude de 11 études épidémiologiques et de 3 études de laboratoire, la conclusion est on ne peut plus claire :\n\nLire aussi : «Le Père Noël existe-t-il ?» Que faut-il répondre aux enfants pour ne pas les décevoir ?\n\n« Il n’existe aucune preuve quant à une association de cause à effet entre le vaccin ROR et l’autisme ou les troubles autistiques (…) la persistance présumée du virus vaccinal rougeoleux dans le tube digestif des enfants atteints d’autisme et de maladie inflammatoire intestinale exige une analyse plus poussée dans le cadre d’études indépendantes avant que l’on puisse considérer comme confirmés les résultats de laboratoire des études publiées, qui présentent de sérieuses insuffisances ».\n\nEn effet, l’intérêt porté aux troubles du spectre de l’autisme (TSA) est justifié ; environ 700 000 personnes seraient concernées en France, dont 100 000 qui ont moins de 20 ans. Comme l’explique l’Inserm (Institut national de la santé et de la recherche médicale),« l’autisme est reconnu comme un handicap en France depuis 1996 » et requiert une recherche extensive afin d’être entièrement compris.\n\nLire aussi : Voici le salaire incroyable qu’une mère au foyer gagnerait si son travail était rémunéré", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "Une étude sur 657 461 enfants prouve qu’il n’existe aucun lien entre l’autisme et les vaccins ROR", "description": "Basés sur des données erronées, les anti-vaccins sèment la confusion chez les parents à propos du vaccin ROR et de l’autisme. Une étude sur 657 461 enfants montre que ce lien n’existe pas.", "url": "https://www.santeplusmag.com/une-etude-sur-657-461-enfants-prouve-quil-nexiste-aucun-lien-entre-lautisme-et-les-vaccins-ror/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Bébé et enfant", "updated_time": "2023-04-25T10:57:20+02:00", "image": "https://www.santeplusmag.com/wp-content/uploads/une-etude-sur-657-461-enfants-prouve-quil-nexiste-aucun-lien-entre-lautisme-et-les-vaccins-ror-1-1-1200x628.jpg", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/une-etude-sur-657-461-enfants-prouve-quil-nexiste-aucun-lien-entre-lautisme-et-les-vaccins-ror-1-1-1200x628.jpg", "image:width": "1200", "image:height": "628", "image:alt": "vaccins", "image:type": "image/jpeg", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["#reuters-observations", "#lautisme-ce-quil-faut-savoir", "https://www.santeplusmag.com/medecine/", "https://www.ebiomedicine.com/article/S2352-3964(16)30398-X/fulltext", "https://www.santeplusmag.com/mon-bebe-qui-etait-en-bonne-sante-est-decede-de-la-grippe-lannee-derniere-et-tous-les-parents-doivent-faire-attention/", "https://www.editions-vendemiaire.com/catalogue/collection-chroniques/antivax-francoise-salvadori-et-laurent-henri-vignaud/", "https://www.santeplusmag.com/111121031-limportance-de-sexcuser-aupres-de-vos-enfants-lorsque-vous-vous-trompez-psychologie-de-lenfant-30-01-2023/", "https://annals.org/aim/article-abstract/2727726/measles-mumps-rubella-vaccination-autism-nationwide-cohort-study", "https://www.santeplusmag.com/la-cause-profonde-de-lautisme-a-ete-decouverte-et-non-ce-ne-sont-pas-les-vaccins/", "https://www.santeplusmag.com/111120235-le-pere-noel-existe-t-il-que-faut-il-repondre-aux-enfants-pour-ne-pas-les-decevoir-psychologie-de-lenfant-16-12-2022/", "https://www.inserm.fr/information-en-sante/dossiers-information/autisme", "https://www.santeplusmag.com/111118190-voici-le-salaire-incroyable-quune-mere-au-foyer-gagnerait-si-son-travail-etait-remunere-bien-grandir-22-09-2022/"], "authors": ["Laurence O"], "publish_date": "2019-03-07T11:40:35+01:00"}