{"result_id": "266077", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://www.santeplusmag.com/mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-jai-besoin-de-vous-informer-a-ce-sujet/&prev=search&pto=aue", "timestamp": "2023-04-25 17:03:25 CEST+0200", "meta": {"description": "La grippe est une maladie saisonnière difficile pour les personnes âgées mais pas seulement, c’est également le cas pour les enfants. L’histoire de Léon...", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-jai-besoin-de-vous-informer-a-ce-sujet/", "encoding": "utf-8"}, "image": null, "domain": "translate.google.com", "title": "\"Mon fils de 4 ans en bonne santé est décédé d’une grippe, j’ai besoin de vous informer à ce sujet\"", "cleaned_text": "Âgé de 4 ans, Léon, américain, était doté d’une patience et une douceur inouïe pour son âge. Son sourire était contagieux et son amour pour ses frères inspiraient. Comme la plupart des enfants qui décèdent chaque année, il n’avait à priori pas de problèmes de santé. Ses poumons ont été détruits par une pneumonie bactérienne secondaire à la grippe.\n\nLa veille de Noël, Léon a officiellement été diagnostiqué d’une pneumonie bactérienne et de grippe A. Aux urgences, mon mari et moi n’avons même pas envisagé la possibilité qu’il ne rentre pas avec nous. Nous pensions que son état s’améliorait. Mon mari et moi sommes médecins militaires. Nous avions rapidement reconnu les difficultés respiratoires de Léon. Plus tôt dans la matinée, Léon avait déjeuné. Avant de quitter la maison pour aller à l’hôpital, il s’était vêtu de son jean et de ses baskets préférés. Il n’avait été malade qu’une journée. Cela avait débuté par de la fièvre et des douleurs musculaires généralisées. Il avait passé la journée à siroter une soupe et à regarder des dessins animés sur le canapé du salon. Malheureusement, il est décédé rapidement, deux jours après avoir présenté les symptômes de la grippe. C’était le matin de Noël.\n\nLire aussi : Comment agit le collagène dans notre organisme ?\n\nMême si Léon n’a pas réagi face à l’escalade des soins médicaux, en tant que mère, il m’était impossible d’envisager sa mort. Rien ne peut vous préparer à perdre votre enfant. À l’hôpital, ce jour-là, j’étais simplement un parent, pas un médecin. Je ne comprenais pas ce qui se passait. Tout semblant de connaissances médicales s’étaient évanouis. Léon est décédé suite à une hémorragie pulmonaire. Je me souviens de mes derniers moments avec lui, pleurant dans ses cheveux blonds et embrassant son front. En tant que mère, j’aurais tellement aimé comprendre à quel point la grippe pouvait être dangereuse pour les enfants en bonne santé.\n\nJe comprends maintenant très bien pourquoi la communauté médicale recommande massivement le vaccin annuel contre la grippe pour toutes les personnes âgées. Il a été médicalement établi que le vaccin antigrippal fonctionne dans 60 à 90% des cas. C’est la meilleure option disponible pour prévenir la mort infantile due à la grippe. Je suis médecin et pourtant, même moi, je n’étais pas consciente du risque de la grippe pour mon enfant en bonne santé. Ma spécialité n’est pas la pédiatrie ou les maladies infectieuses, mais j’ai passé en revue la littérature sur ce sujet dans le but d’essayer de tirer les leçons de cette tragédie. J’ai utilisé des plateformes de recherche de revues médicales et examiné les publications. Comme Léon, beaucoup d’enfants meurent quelques jours après l’apparition des premiers symptômes. Sans antécédents, ces enfants sont plus susceptibles de décéder plus rapidement que les autres populations pédiatriques. Même en reconnaissant les premiers signes d’inquiétude, comme mon mari et moi l’avons fait avec Léon, il y a souvent peu de temps pour intervenir médicalement pour ces enfants.\n\n L’année dernière, si j’avais vu une histoire comme la mienne, j’aurais eu un regard différent. Les mois d’automne et d’hiver sont particulièrement difficiles pour car notre temps et notre énergie sont soumis à rudes épreuves notamment à l’approche des fêtes. En tant que mères, nous devons nous entraider pour partager les informations qui nous permettent de protéger nos enfants.\n\nLa douleur de la perte\n\nEn tant que médecin, il est difficile de perdre un enfant. En tant que parent, cette expérience a été indescriptiblement douloureuse. Il n’y a pas de mots pour décrire l’impuissance de voir son enfant mourir ou d’avoir à ouvrir des cadeaux de Noël pour un enfant qui ne reviendra jamais. Il y a des parties de moi qui manqueront toujours après la perte de Léon. Comme beaucoup d’autres parents qui ont perdu des enfants, j’ai l’impression que ma vie a pris fin à la mort de Léon et qu’une autre a commencé. Chaque jour, Léon reste dans mon esprit.\n\nLire aussi : Quand et pourquoi consulter un sexologue ?\n\nD’après les commentaires sur mon post, il est clair que les membres de la communauté anti-vaccins sont passionnés par ce qu’ils pensent être justes pour eux et leurs enfants. Je suis passionné aussi. Avec Internet, vous accès à beaucoup d’informations sur la santé et le bien-être. Cependant, j’ai choisi de faire confiance aux recherches de la communauté médicale. Personnellement, je ne pense pas qu’il faille mieux laisser la santé de mes enfants aux bons soins de ceux qui n’ont pas les qualifications requises pour donner des conseils médicaux. Les mêmes médecins qui recommandent le vaccin contre la grippe sont ceux qui s’occupent de mes enfants quand ils sont malades. Mes collègues médecins, ceux qui me sont venus en aide depuis que j’ai perdu Léon, sont les professionnels de la santé qui ont formulé cette recommandation. C’est là que je place ma confiance. Et vous ? La saison hivernale arrive. Pensez-y.\n\nLire aussi : Mal de gorge : comment le soigner ?", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "\"Mon fils de 4 ans en bonne santé est décédé d’une grippe, j’ai besoin de vous informer à ce sujet\"", "description": "La grippe est une maladie saisonnière difficile pour les personnes âgées mais pas seulement, c’est également le cas pour les enfants. L’histoire de Léon...", "url": "https://www.santeplusmag.com/mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-jai-besoin-de-vous-informer-a-ce-sujet/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Maladies", "updated_time": "2022-06-23T12:48:34+02:00", "image": "https://www.santeplusmag.com/wp-content/uploads/Mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-1-1200x628.png", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/Mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-1-1200x628.png", "image:width": "1200", "image:height": "628", "image:alt": "Mon fils de 4 ans en bonne santé est décédé d’une grippe", "image:type": "image/png", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["https://www-santeplusmag-com.translate.goog/mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-jai-besoin-de-vous-informer-a-ce-sujet/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#le-diagnostic", "https://www-santeplusmag-com.translate.goog/mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-jai-besoin-de-vous-informer-a-ce-sujet/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#un-depart-soudain", "https://www-santeplusmag-com.translate.goog/mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-jai-besoin-de-vous-informer-a-ce-sujet/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#la-vaccination", "https://www-santeplusmag-com.translate.goog/mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-jai-besoin-de-vous-informer-a-ce-sujet/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#la-douleur-de-la-perte", "https://www-santeplusmag-com.translate.goog/mon-fils-de-4-ans-en-bonne-sante-est-decede-dune-grippe-jai-besoin-de-vous-informer-a-ce-sujet/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc#des-reactions-diverses", "https://www-santeplusmag-com.translate.goog/11-astuces-pour-prevenir-une-grippe-ou-un-rhume/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/cette-ancienne-recette-debarrasse-de-grippe-rhume-de-lexces-de-mucus-infections-sinus/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/111121986-comment-agit-le-collagene-dans-notre-organisme-os-et-muscles-23-03-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=http://inpes.santepubliquefrance.fr/10000/themes/vaccination/guide-vaccination-2012/pdf/GuideVaccinations2012_Vaccination_contre_la_grippe_saisonniere.pdf", "https://www-santeplusmag-com.translate.goog/111120948-quand-et-pourquoi-consulter-un-sexologue-medecine-25-01-2023/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://www-santeplusmag-com.translate.goog/111120441-mal-de-gorge-comment-le-soigner-medecine-28-12-2022/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc"], "authors": ["Laurence O"], "publish_date": "2018-10-31T10:24:43+01:00"}