{"result_id": "266074", "URL": "https://www.santeplusmag.com/cette-femme-decedee-3-fois-raconte-ce-quelle-a-vecu-a-chacune-de-ses-morts/", "timestamp": "2023-04-25 17:03:25 CEST+0200", "meta": {"description": "Cette femme qui prétend être morte trois fois confie les circonstances de chacun de ses décès sur Tiktok. Elle raconte à ses abonnés ce qu’elle a ressenti.", "lang": "fr", "keywords": "", "favicon": "https://www.santeplusmag.com/wp-content/uploads/favico.png", "canonical": "https://www.santeplusmag.com/cette-femme-decedee-3-fois-raconte-ce-quelle-a-vecu-a-chacune-de-ses-morts/", "encoding": "utf-8"}, "image": null, "domain": "www.santeplusmag.com", "title": "Cette femme décédée 3 fois raconte ce qu’elle a vécu à chacune de ses « morts", "cleaned_text": "Trois. C’est le nombre de fois que cette jeune femme prétend avoir goûté à la mort. En racontant son expérience sur Tiktok, elle révèle à ses abonnés qu’elle a eu d’étranges perceptions alors qu’elle était en train de se faire opérer du cœur. Relayé par LAD BIBLE, le témoignage de cette femme révèle trois expériences de mort imminente qu’elle raconte en se filmant avec son smartphone.\n\nAu travers d’une vidéo sur Tiktok, la femme qui a pour pseudonyme @rachboylex, parle plus en détails de ces souvenirs pas comme les autres. Si Rachel Boyle a eu trois expériences de mort imminente (EMI), c’est parce qu’elle souffre d’une maladie cardiaque appelée tachycardie supraventriculaire, un trouble du rythme cardiaque. L’utilisatrice de Tiktok dit avoir été morte à plusieurs reprises à cause de cette pathologie. Elle confie que cette dernière est un cas très rare, difficile à traiter pour les médecins. Celle qui a pour pseudonyme @rachboylex raconte qu’elle était montée à 230 battements par minute. Suite à cette crise, elle s’est évanouie. « Mon cœur s’est arrêté », se remémore-t-elle en assurant à ses abonnés qu’elle ne ment pas. Rachel raconte qu’elle se sentait comme « expulsée de son corps » et qu’elle ne voyait rien d’autre excepté « une lumière blanche et brillante », mais aussi elle-même. Le temps paraissait très long après qu’elle soit « décédée ». « C’était comme si j’allais au ralenti vers la lumière » se souvient-elle. Comme Rachel, ces 5 personnes ont vécu la même chose.\n\nLire aussi : Une chienne abandonnée par ses propriétaires attend leur retour\n\n« Cela m’a fait me sentir apaisée face à la mort »\n\nAprès avoir raconté cette expérience de mort imminente à ses abonnés, Rachel raconte qu’après cette crise de tachycardie, elle pouvait regarder son corps d’en haut. « C’est fou ! » s’émerveille-t-elle sur Tiktok. Elle ajoute que le souvenir de ce moment est encore vif. Et sa « première mort » n’allait pas être la seule. La Tiktokeuse a affirmé mourir pour une seconde fois lors de son opération au cœur. « Cela m’a fait me sentir apaisée face à la mort, je ne vais pas mentir » confie-t-elle.\n\nInterpellé par l’histoire hors du commun de cette jeune femme, un utilisateur de Tiktok lui a demandé dans un live vidéo comment avait réagi sa famille lorsqu’elle leur a raconté ce qui s’était passé au moment de ses « décès ». « Tout le monde pensait que j’étais absolument folle ! » s’exclame-t-elle. Rachel ajoute qu’après ce récit, les gens pensaient qu’il s’agissait de la confusion qui provient des médicaments ou encore du « manque d’oxygène ». La jeune femme n’était pas au bout de ses peines puisqu’elle affirme avoir connu un troisième décès, cette fois sur la table d’opération. Si, à en croire Rachel, elle a frôlé la mort, des chercheurs expliquent ce qui arrive au moment de la mort.\n\nLire aussi : Pour célébrer son 60ème anniversaire de mariage, une mamie porte sa robe de mariée\n\n« Je pouvais me voir comme si j’étais un oiseau »\n\nAu moment où Rachel Boyle s’est sentie mourir pour la troisième fois, elle a des perceptions plus intenses. A ce moment, la jeune femme dit qu’elle était sur la table d’opération avant de sentir que son âme s’était échappée de son corps. « Je pouvais me voir comme si j’étais un oiseau », se souvient la Tiktokeuse qui affirme avoir eu trois expériences de morts imminentes. « Je pouvais me voir et il n’y avait rien autour. Vous ne pouviez pas voir les équipements qui étaient là, aucun des chirurgiens » décrit-elle avant d’ajouter qu’elle a ressenti toutes ces visions avec beaucoup de sérénité.\n\nQue ressentent les personnes qui ont eu une expérience de mort imminente ?\n\nInterrogé par nos confrères de Psychologies, Raymond Moody, chercheur et médecin spécialisé dans les phénomènes paranormaux s’est penché de près à la near-death experience [ndlr : expérience de mort imminente]. L’homme analyse que ceux qu’il appelle les « expérienceurs » entendent un bourdonnement étrange avant de sentir qu’ils sortent de leur corps. S’ensuit une impression de traverser un tunnel et de s’approprier un nouveau corps. « Ils voient une lumière ineffable, rencontrent des proches décédés qui les accueillent ou un « être de lumière » qui les guide », souligne-t-il avant d’ajouter qu’ils peuvent voir leur vie défiler devant eux en quelques instants avant de revenir dans leur corps initial. Pour l’expert de ce phénomène paranormal, il pourrait y avoir quinze étapes qui caractérisent cette expérience bien que chaque personne puisse la vivre différemment. « Nous avons même des cas d’aveugles de naissance qui ont vécu la même expérience avec les mêmes images », atteste-t-il. Il ajoute que dans tous les cas, la near-death experience est à l’origine d’un bouleversement qui provoque des changements durables, cohérents et profonds de la psyché. Cette femme qui l’a vécu adresse un beau message à l’humanité.\n\nLire aussi : Une femme tombe enceinte alors qu’elle était déjà enceinte", "opengraph": {"site_name": "santeplusmag", "locale": "fr_FR", "title": "Cette femme décédée 3 fois raconte ce qu’elle a vécu à chacune de ses « morts »", "description": "Cette femme qui prétend être morte trois fois confie les circonstances de chacun de ses décès sur Tiktok. Elle raconte à ses abonnés ce qu’elle a ressenti.", "url": "https://www.santeplusmag.com/cette-femme-decedee-3-fois-raconte-ce-quelle-a-vecu-a-chacune-de-ses-morts/", "article:publisher": "https://www.facebook.com/santeplusmag", "article:section": "Psycho & Sexualité", "updated_time": "2021-05-05T09:59:36+02:00", "image": "https://www.santeplusmag.com/wp-content/uploads/cette-femme-decedee-3-fois-raconte-ce-quelle-a-vecu-a-chacune-de-ses-morts-f-1200x628.png", "image:secure_url": "https://www.santeplusmag.com/wp-content/uploads/cette-femme-decedee-3-fois-raconte-ce-quelle-a-vecu-a-chacune-de-ses-morts-f-1200x628.png", "image:width": "1200", "image:height": "628", "image:alt": "morts", "image:type": "image/png", "types": ["article", "website"]}, "tags": [], "tweets": [], "movies": [], "links": ["#mon-coeur-sest-arrete", "#cela-ma-fait-me-sentir-apaisee-face-a-la-mort", "#tout-le-monde-pensait-que-jetais-folle", "#je-pouvais-me-voir-comme-si-jetais-un-oiseau", "#que-ressentent-les-personnes-qui-ont-eu-une-experience-de-mort-imminente", "https://www.ladbible.com/news/news-woman-whos-died-three-times-explains-what-she-saw-experienced-20210405", "https://www.tiktok.com/foryou?source=h5_m&is_copy_url=1&is_from_webapp=v1&item_id=6947005107728928006#/@rachboylex/video/6947005107728928006", "https://www.santeplusmag.com/5-personnes-mortes-revenues-a-vie-racontent-experience/", "https://www.santeplusmag.com/111122189-une-chienne-abandonnee-par-ses-proprietaires-attend-leur-retour-temoignages-14-04-2023/", "https://www.santeplusmag.com/des-chercheurs-expliquent-enfin-ce-qui-arrive-au-moment-de-la-mort/", "https://www.santeplusmag.com/111122167-pour-celebrer-son-60eme-anniversaire-de-mariage-une-mamie-porte-sa-robe-de-mariee-temoignages-13-04-2023/", "https://www.psychologies.com/Planete/Paranormal/Interviews/L-experience-de-mort-imminente", "https://www.santeplusmag.com/femme-meurt-puis-revient-a-vie-message-terrible-lhumanite/", "https://www.santeplusmag.com/111122158-une-femme-tombe-enceinte-alors-quelle-etait-deja-enceinte-temoignages-12-04-2023/"], "authors": ["Nicolas Bonneau"], "publish_date": "2021-05-05T09:35:00+02:00"}