{"result_id": "267022", "URL": "https://science.news/2020-09-14-plastic-packaging-most-abundant-trash-on-beaches.html", "timestamp": "2023-04-25 17:03:42 CEST+0200", "meta": {"description": "Chip bags, plastic drink pouches and similar plastic rubbish have become the most abundant trash found along beaches, outpacing cigarette butts as the top litter for the first time in more than three decades. This dismal development is among the findings of the Ocean Conservancy’s latest report on its annual beach cleanup. In 2019, its International […]", "lang": "en", "keywords": "animals,badpollution,cigarette butts,Ecology,environ,food packaging,marine life,microplastics,Oceans,plastic food packaging,plastics,trash,water pollution", "favicon": "wp-content/themes/ScienceTheme/images/-fav.png", "canonical": "https://science.news/2020-09-14-plastic-packaging-most-abundant-trash-on-beaches.html", "encoding": "UTF-8"}, "image": null, "domain": "science.news", "title": "Plastic food packaging overtakes cigarette butts as most abundant litter on beaches", "cleaned_text": "Plastic food packaging overtakes cigarette butts as most abundant litter on beaches\n\nChip bags, plastic drink pouches and similar plastic rubbish have become the most abundant trash found along beaches, outpacing cigarette butts as the top litter for the first time in more than three decades. This dismal development is among the findings of the Ocean Conservancy’s latest report on its annual beach cleanup.\n\nIn 2019, its International Coastal Cleanup initiative – a single day of picking litter along beaches across the globe – involved more than 943,000 volunteers and netted 20.8 million tons of trash in 116 countries. That’s 32.5 million plastic-based items collected in just a single day.\n\nBut an astounding 4.7 million of these are plastic-based food packaging, such as plastic bottles, bottle caps, stirrers, cups, lids and plastic bags. This is the first time that plastic packaging has been the most prevalent litter found during the International Coastal Cleanup since its inception in 1986.\n\nNon-biodegradable cigarette filters used to hold the top spot for the most dominant beach litter, but the 4.2 million butts collected in 2019’s cleanup paled in comparison to the 4.7 million plastic-based items. These figures shed insight into the prevalence of plastic pollution in the oceans and coastal areas in recent times.\n\nDuring earlier cleanups, volunteers had still been finding glass bottles, soda cans, paper bags and other non-plastic items. But as the demand for convenience soared, so did plastic production. Given this, plastic-based alternatives have started replacing non-plastic litter, said Ocean Conservancy director Allison Schutes.\n\nBut as a result, more and more food-related plastics are ending up in the environment, threatening the survival of animals, she added. More and more, studies are pointing to plastic pollution as one of the main culprits behind frequent beachings and deaths of marine animals like sea turtles and dolphins.\n\nBesides emphasizing the threat that plastic pollution poses to marine life, Nicholas Mallos, a conservation biologist and ocean debris specialist at Ocean Conservancy, said that the findings of their annual cleanup report also underscore the unsustainable production of single-use, disposable food and beverage packaging.\n\nTo further complicate matters, consumers often fail to reuse these disposable packagings. For instance, 45 percent of the total plastic produced in the US, Europe, China and India from 2002 to 2014 had gone into the manufacture of food packaging. Despite this, plastic only has a 13 percent recycling rate in the US.\n\nBut consumers alone cannot be blamed for this dismal rate as not all plastic can, in fact, be reused. There is a huge range of plastics used in disposable products and packaging, and this plastic cocktail often makes it difficult to separate the reusable plastics from the non-reusable ones.\n\nRethink food packaging to minimize the impact of plastic\n\nMallos, who also runs Ocean Conservancy‘s “Trash Free Seas” program, offered tips on how consumers can best avoid contributing to the global plastic crisis. For starters, people can start reusing their plastic bottles or bringing their own bags to the supermarket. (Related: Debunking your reasons to use plastic.)\n\nBut efforts to curb plastic pollution should not stop there. “We need food science and packaging experts to accelerate research and development of packaging that isn’t destined for landfills,” Mallos told The Daily Mail. In the long run, biodegradable packaging could help keep both humans and animals safe.\n\nIn its more than three decades of operation, the International Coastal Cleanup initiative has collected more than 344.6 million pounds of trash from beaches and coastal areas across the globe. Insight gleaned from the initiative’s annual reports could help global leaders create better solutions to the global plastic pollution crisis.\n\nRead more articles on the environmental impact of plastic packaging, cigarette butts and other pollutants at Environ.news.", "opengraph": {"title": "Plastic food packaging overtakes cigarette butts as most abundant litter on beaches", "type": "article", "url": "https://www.censoredscience.com/2020-09-14-plastic-packaging-most-abundant-trash-on-beaches.html", "site_name": "REAL Science News", "description": "Chip bags, plastic drink pouches and similar plastic rubbish have become the most abundant trash found along beaches, outpacing cigarette butts as the top litter for the first time in more than three decades. This dismal development is among the findings of the Ocean Conservancy’s latest report on its annual beach cleanup. In 2019, its International […]", "image": "https://www.censoredscience.com/wp-content/uploads/sites/376/2022/05/Litter-Pollution-Rubbish-Sea-Beach-Bottle-Coast.jpg"}, "tags": ["marine life", "trash", "food packaging", "cigarette butts", "environ", "animals", "Ecology", "microplastics", "plastic food packaging", "plastics", "Oceans"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/sciencetech/article-8718405/Environment-Food-wrappers-overtake-cigarette-butts-litter-item-beaches.html", "https://theconversation.com/why-cant-all-plastic-waste-be-recycled-100857", "https://www.naturalnews.com/2019-06-26-debunking-your-reasons-to-use-plastic.html", "https://environ.news/", "https://www.dailymail.co.uk/sciencetech/article-8718405/Environment-Food-wrappers-overtake-cigarette-butts-litter-item-beaches.html", "https://theconversation.com/why-cant-all-plastic-waste-be-recycled-100857", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcensoredscience%2F2020-09-14-plastic-packaging-most-abundant-trash-on-beaches.html&linkname=Plastic%20food%20packaging%20overtakes%20cigarette%20butts%20as%20most%20abundant%20litter%20on%20beaches", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}