{"result_id": "267018", "URL": "https://science.news/2020-11-30-loneliness-triggers-cravings-for-social-contact.html", "timestamp": "2023-04-25 17:03:39 CEST+0200", "meta": {"description": "Loneliness can trigger “cravings” for social interaction in the brain just as hunger can trigger cravings for food, according to a study led by researchers from the Massachusetts Institute of Technology (MIT). The study, published recently in Nature Neuroscience, revealed that after only one day of isolation, the thought of social interaction stimulates the same brain region activated during hunger cravings. […]", "lang": "en", "keywords": "badhealth,coronavirus,covid-19,cravings,lockdown,loneliness,mental health,pandemic,social isolation", "favicon": "wp-content/themes/ScienceTheme/images/-fav.png", "canonical": "https://science.news/2020-11-30-loneliness-triggers-cravings-for-social-contact.html", "encoding": "UTF-8"}, "image": null, "domain": "science.news", "title": "Cravings for social contact mimic hunger in the brain, study reveals", "cleaned_text": "Cravings for social contact mimic hunger in the brain, study reveals\n\nLoneliness can trigger “cravings” for social interaction in the brain just as hunger can trigger cravings for food, according to a study led by researchers from the Massachusetts Institute of Technology (MIT).\n\nThe study, published recently in Nature Neuroscience, revealed that after only one day of isolation, the thought of social interaction stimulates the same brain region activated during hunger cravings.\n\nPut simply, a lonely person “craves” social interactions the same way a hungry person craves food, said senior author Rebecca Saxe, a professor of cognitive neuroscience at MIT and an associate member of the McGovern Institute for Brain Research.\n\nThese findings indicate that positive social interactions are a basic human need and that acute loneliness is an “aversive state” that motivates people to address what is lacking, similar to hunger, added Saxe.\n\nLoneliness and hunger activate the same brain region\n\nThe latest study builds off of the findings of another MIT study in 2016, which identified a cluster of neurons in the mouse brain that represents feelings of loneliness and generates a drive for social contact after isolation.\n\nWhile similar feelings of loneliness can be observed in humans, the neurological basis for them is yet to be fully understood. To this end, Saxe and her colleagues recruited 40 healthy participants aged 18–40 years.\n\nTo simulate isolation, the researchers confined the participants to a windowless room at MIT for 10 hours. The participants were not allowed to use their phones except for contacting the researchers if necessary.\n\nSaxe said they also controlled the environment such that the participants felt as isolated as possible. To do this, the researchers would make sure the bathroom was empty before allowing the participants to use it. They even delivered food to the door and only texted the participants when it was there to avoid social contact. They were just not allowed to see people, said Saxe.\n\nThen, after the 10-hour isolation period, each participant was scanned in a magnetic resonance imaging (MRI) machine. Before the isolation period, they were trained on how to get into the machine by themselves, again to avoid social contact as much as possible. The researchers, who were gowned and masked, just stood silently by and watched.\n\nThe participants also underwent 10 hours of fasting on a different day and were scanned again in the machine. In both instances, participants were scanned in the machine while looking at images of food, social interaction and neutral ones like flowers.\n\nParticipants also had to report whether they felt lonely, longed for social interaction or craved food after either session.\n\nThe researchers found that participants reported craving foods after the fasting period and craving interaction after the isolation period. In addition, the MRI scans showed that when participants saw images of interaction after the isolation period, their substantia nigra, a structure located in the midbrain, produced a signal like the one produced when participants saw images of food after the fasting period.\n\nEarlier studies have associated the substantia nigra with hunger and drug cravings. In the 2016 MIT study, the substantia nigra in the brains of the mice was also activated following social isolation. The stronger the feelings of hunger and loneliness, the greater the craving for food and social interaction as well.\n\nInterestingly, Saxe and her colleagues also found that participants who reported feeling isolated months before the study had weaker cravings for social interaction compared to participants who reported having a rich social life.\n\nOverall, the findings support the idea that acute isolation causes “social cravings” similar to how fasting causes hunger, said lead author Livia Tomova, a former postdoctoral researcher at MIT.\n\nWith this new knowledge, scientists can now begin to further explore how social isolation affects behavior and motivation.\n\nThe study was conducted between 2018–2019 before the coronavirus pandemic. It was part of a large research program that focused on the effects of social stress on people’s behaviors.\n\nBut in light of the strict lockdowns and social distancing protocols still in effect in several countries, this study might shed some light on how social isolation has affected the millions of people worldwide who stayed inside their homes for the better part of the year. (Related: A prepper’s guide to surviving a coronavirus lockdown.)\n\nLearn more about the effects of loneliness and social isolation on the brain at Brain.news.", "opengraph": {"title": "Cravings for social contact mimic hunger in the brain, study reveals", "type": "article", "url": "https://www.censoredscience.com/2020-11-30-loneliness-triggers-cravings-for-social-contact.html", "site_name": "REAL Science News", "description": "Loneliness can trigger “cravings” for social interaction in the brain just as hunger can trigger cravings for food, according to a study led by researchers from the Massachusetts Institute of Technology (MIT). The study, published recently in Nature Neuroscience, revealed that after only one day of isolation, the thought of social interaction stimulates the same brain region activated during hunger cravings. […]", "image": "https://www.censoredscience.com/wp-content/uploads/sites/376/2020/11/Sad-Lonely-Woman-City-Sitting-Next.jpg"}, "tags": ["mental health", "pandemic", "social isolation", "covid-19", "loneliness", "coronavirus", "lockdown", "cravings"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/sciencetech/article-8977793/Lockdown-loneliness-Social-isolation-makes-crave-company-like-hungry-person-longs-food.html", "https://www.mit.edu/", "https://www.nature.com/articles/s41593-020-00742-z?utm_medium=affiliate&utm_source=commission_junction&utm_campaign=3_nsn6445_deeplink_PID100032693&utm_content=deeplink", "https://news.mit.edu/2020/hunger-social-cravings-neuroscience-1123", "https://naturalpedia.com/fasting-sources-health-benefits-at-naturalpedia-com.html", "https://naturalpedia.com/sunflower-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://naturalpedia.com/organic-food-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://naturalpedia.com/antibiotics-uses-health-risks-and-side-effects-at-naturalpedia-com.html", "https://www.naturalnews.com/2020-04-04-preppers-guide-to-surviving-a-coronavirus-lockdown.html", "https://brain.news/", "https://www.dailymail.co.uk/sciencetech/article-8977793/Lockdown-loneliness-Social-isolation-makes-crave-company-like-hungry-person-longs-food.html", "https://www.nature.com/articles/s41593-020-00742-z?utm_medium=affiliate&utm_source=commission_junction&utm_campaign=3_nsn6445_deeplink_PID100032693&utm_content=deeplink", "https://news.mit.edu/2020/hunger-social-cravings-neuroscience-1123", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcensoredscience%2F2020-11-30-loneliness-triggers-cravings-for-social-contact.html&linkname=Cravings%20for%20social%20contact%20mimic%20hunger%20in%20the%20brain%2C%20study%20reveals", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}