{"result_id": "267003", "URL": "https://www.science.news/2020-12-02-oxycontin-consultant-bonuses-distributors-drug-overdose-turbocharge.html", "timestamp": "2023-04-25 17:03:29 CEST+0200", "meta": {"description": "Court documents released last week under Purdue Pharma’s bankruptcy process reveal that that consultancy firm McKinsey & Company advised its client to pay rebates to distributors of OxyContin whenever an overdose case could be traced back to abuse of the controversial opioid pill. The purpose of these kickbacks or bonuses was to help “turbocharge” Purdue’s […]", "lang": "en", "keywords": "Anthem,badhealth,badmedicine,badscience,Big Pharma,corruption,CVS,deaths,evil,greed,McKinsey & Company,Medical Tyranny,Opioids,outrage,overdose,oxycontin,prescriptions,Purdue Pharma,side effects,turbocharge", "favicon": "wp-content/themes/ScienceTheme/images/-fav.png", "canonical": "https://www.science.news/2020-12-02-oxycontin-consultant-bonuses-distributors-drug-overdose-turbocharge.html", "encoding": "UTF-8"}, "image": null, "domain": "www.science.news", "title": "PROFIT FROM DEATH: OxyContin consultant suggested paying BONUSES to distributors for each drug overdose as part of sales “turbocharge” strategy", "cleaned_text": "PROFIT FROM DEATH: OxyContin consultant suggested paying BONUSES to distributors for each drug overdose as part of sales “turbocharge” strategy\n\nCourt documents released last week under Purdue Pharma’s bankruptcy process reveal that that consultancy firm McKinsey & Company advised its client to pay rebates to distributors of OxyContin whenever an overdose case could be traced back to abuse of the controversial opioid pill.\n\nThe purpose of these kickbacks or bonuses was to help “turbocharge” Purdue’s sales of the deadly drug, thus producing higher profits for the pharmaceutical giant amid escalating scrutiny over its illicit marketing and sales practices.\n\nThough the Trump administration reportedly cut a deal with the Sackler family, which runs Purdue, to protect them from criminal liability, the company has reportedly agreed to plead guilty to criminal charges over the way it peddled OxyContin to the masses.\n\nIn a 2017 presentation, McKinsey advised Purdue to compensate distributors of OxyContin for the damage associated with their selling of the drug in order to help boost sales. These distributors include the pharmacy chain CVS Health and Anthem, which are two of McKinsey’s biggest clients.\n\nMcKinsey came up with estimates for how many people would likely overdose or get hooked on OxyContin, advising Purdue to pay rebates for these “events” in order to still continue raking in windfall profits from the drug’s illicit sale.\n\nEach of the 2,484 cases of overdose or addiction from OxyContin that were traced through these respective distributors were reportedly to be paid $14,810 per case, netting the distributors $36.8 million in kickbacks. However, CVS and Anthem both claim that they never actually received these “rebates.”\n\nMillions of Americans had their lives destroyed because of Purdue, McKinsey and the Sackler family\n\nTo try to cover their tracks, McKinsey’s senior partners discussed one year later the importance of “eliminating all our documents and emails.” This suggestion was made after the state of Massachusetts filed a lawsuit against a former Purdue board member for the role she played in fueling the opioid crisis.\n\n“Thank for the heads up. Will do,” responded Arnab Ghatak to an email from McKinsey’s North American pharmaceutical practice leader Martin Elling advising the destruction of evidence.\n\nMcKinsey also reportedly advised the Sackler family to accept the “turbocharge” sales plan as part of a pushback plan against the U.S. Food and Drug Administration (FDA), which was finally starting to get involved in holding the company accountable.\n\nUnredacted legal papers in the Massachusetts case that were released last year show that Purdue followed McKinsey’s advice in engaging predatory business practices that harmed and killed millions of Americans.\n\nIn the comment section of a New York Times article on the unfolding saga, readers were outraged that Purdue, McKinsey, and the Sackler family would hold other human lives in such low regard as to sacrifice them for filthy lucre.\n\nMany called the operation and those involved “evil,” emphasizing that everyone who was complicit needs to be held accountable for their crimes against humanity.\n\n“This is the banality of evil, M.B.A. edition,” stated former McKinsey consultant Anand Giridharadas, who reviewed the documents and confirmed what took place.\n\n“They knew what was going on. And they found a way to look past it, through it, around it, so as to answer the only questions they cared about: how to make the client money and, when the walls closed in, how to protect themselves.”\n\nOver at RT, commenters were equally outraged. One wrote that while it is great that Purdue is now bankrupt, its leaders and the entire Sackler family, whom Trump is defending for whatever reason, need to be held liable for their criminal activities.\n\n“But they won’t be,” another responded. “Most have absconded to Israel with the loot.”\n\nMore related news about Big Pharma corruption can be found at BigPharma.Fetch.news.", "opengraph": {"title": "PROFIT FROM DEATH: OxyContin consultant suggested paying BONUSES to distributors for each drug overdose as part of sales “turbocharge” strategy", "type": "article", "url": "https://www.censoredscience.com/2020-12-02-oxycontin-consultant-bonuses-distributors-drug-overdose-turbocharge.html", "site_name": "REAL Science News", "description": "Court documents released last week under Purdue Pharma’s bankruptcy process reveal that that consultancy firm McKinsey & Company advised its client to pay rebates to distributors of OxyContin whenever an overdose case could be traced back to abuse of the controversial opioid pill. The purpose of these kickbacks or bonuses was to help “turbocharge” Purdue’s […]", "image": "https://www.censoredscience.com/wp-content/uploads/sites/376/2020/12/Oxycontin-578-Adderall-Arranged-Black-Bottle-Cap.jpg"}, "tags": ["McKinsey & Company", "overdose", "CVS", "Anthem", "evil", "Big Pharma", "Purdue Pharma", "prescriptions", "Opioids", "turbocharge", "greed", "Medical Tyranny", "outrage", "oxycontin", "side effects", "corruption", "deaths"], "tweets": [], "movies": [], "links": ["https://www.rt.com/usa/508095-mckinsey-oxycontin-overdose-rebates/", "https://www.naturalnews.com/2020-10-08-trump-cuts-deal-purdue-pharma-shielding-sacklers-criminal-liability-opioids.html", "http://bigpharma.fetch.news", "https://www.rt.com/usa/508095-mckinsey-oxycontin-overdose-rebates/", "https://www.naturalnews.com/2020-10-08-trump-cuts-deal-purdue-pharma-shielding-sacklers-criminal-liability-opioids.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcensoredscience%2F2020-12-02-oxycontin-consultant-bonuses-distributors-drug-overdose-turbocharge.html&linkname=PROFIT%20FROM%20DEATH%3A%20OxyContin%20consultant%20suggested%20paying%20BONUSES%20to%20distributors%20for%20each%20drug%20overdose%20as%20part%20of%20sales%20%E2%80%9Cturbocharge%E2%80%9D%20strategy", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}