{"result_id": "267026", "URL": "https://science.news/2021-07-23-hermit-crabs-killed-by-plastic-waste.html", "timestamp": "2023-04-25 17:03:44 CEST+0200", "meta": {"description": "More than half a million hermit crabs in the Indian and Pacific Oceans are dying because they mistake plastic waste for a home, according to a study published in the Journal of Hazardous Materials. Australian and British researchers found that around 508,000 hermit crabs have died taking shelter inside plastic waste on Cocos (Keeling) Island, an Australian […]", "lang": "en", "keywords": "animals,badpollution,Ecology,environment,hermit crabs,marine animals,marine ecosystems,marine life,ocean health,Oceans,plastic pollution,plastic waste,plastics,research,water pollution,wildlife", "favicon": "wp-content/themes/ScienceTheme/images/-fav.png", "canonical": "https://science.news/2021-07-23-hermit-crabs-killed-by-plastic-waste.html", "encoding": "UTF-8"}, "image": null, "domain": "science.news", "title": "Drowning in plastic: Hermit crabs are turning plastic waste into homes that are killing them", "cleaned_text": "Drowning in plastic: Hermit crabs are turning plastic waste into homes that are killing them\n\nMore than half a million hermit crabs in the Indian and Pacific Oceans are dying because they mistake plastic waste for a home, according to a study published in the Journal of Hazardous Materials.\n\nAustralian and British researchers found that around 508,000 hermit crabs have died taking shelter inside plastic waste on Cocos (Keeling) Island, an Australian territory in the Indian Ocean. The researchers noted that the island was “drowning” in around 414 million pieces of plastic. Meanwhile, another 61,000 perished in the same way 8,000 miles away on Henderson Island in the South Pacific.\n\n“When we were surveying debris on the islands, I was struck by how many open plastic containers contained hermit crabs, both dead and alive,” said Jennifer Lavers, a researcher at the University of Tasmania‘s Institute for Marine and Antarctic Studies and the lead researcher of the study.\n\nHermit crabs do not have their own shells, so they use hollow natural objects for shelter and protection. Unfortunately, they often mistake plastic bottles for natural shells. By the time they realize where they are, it’s too late. The crabs are unable to climb out because the surface of plastic bottles are too slippery.\n\n“The question was, is Cocos unique, or is this a more widespread problem that could be happening anywhere?” Lavers said. “That’s what these two islands suggest: A lot of places where you have crabs and debris, this is probably happening.”\n\nPlastic pollution sets off an “avalanche of death”\n\nHermit crabs are extremely vulnerable to die-offs because the death of one can set off the death of many others. When a hermit crab dies, it emits an odor that tells other crabs a shell is available. As such, a dead crab can draw more and more crabs to plastic waste with a scent that increases in strength, according to Alex Bond, a curator at the Natural History Museum in London and one of the study’s researchers.\n\n“It’s not quite a domino effect. It’s almost like an avalanche,” Bond remarked. “Hermit after hermit going into these bottles thinking they’ll get their next home, when in reality, it’s their last home.”\n\nThe researchers warned that if this chain-reaction was occurring worldwide, it would significantly impact marine ecosystems across the globe. This is because hermit crabs aerate and fertilize the soil, disperse seeds and remove detritus – all of which are important for environmental health.\n\nAdditionally, hermit crabs are an important feature of marine ecosystems that humans rely on for fishing, recreation and tourism, according to Laver. This means that hermit crab die-offs could also impact the economy. (Related: Toxic chemicals from plastic waste are migrating into food and harming soil, warn experts.)\n\nLavers and Bond encourage people to join beach clean-ups to reduce plastic pollution and save hermit crabs. “It’s not just removing plastic from the beach because it’s unsightly, but it’s potentially doing a lot for hermit crab populations,” Lavers said.\n\nHermit crabs are just some of the many marine species affected by plastic waste. Studies show that half of all sea turtles worldwide have eaten plastic. Some starve after doing so, mistakenly thinking that they have eaten enough because their stomachs are full. Similarly, seabirds are also prone to starvation caused by eating plastic waste, with up to a million dying every year due to plastics.\n\nAnimals that are intelligent enough not to eat plastic also fall victim. Dolphins, for example, are highly intelligent but eat prey that may have ingested synthetic compounds used to make plastic.\n\nExperts warn that unless urgent action is taken, the weight of ocean plastics will exceed the combined weight of all the fish in the sea by 2050. This, in turn, can affect livelihoods and severely damage marine environments.\n\nOceanHealthNews.com has more about the impact of plastic pollution on marine animals.", "opengraph": {"title": "Drowning in plastic: Hermit crabs are turning plastic waste into homes that are killing them", "type": "article", "url": "https://www.censoredscience.com/2021-07-23-hermit-crabs-killed-by-plastic-waste.html", "site_name": "REAL Science News", "description": "More than half a million hermit crabs in the Indian and Pacific Oceans are dying because they mistake plastic waste for a home, according to a study published in the Journal of Hazardous Materials. Australian and British researchers found that around 508,000 hermit crabs have died taking shelter inside plastic waste on Cocos (Keeling) Island, an Australian […]", "image": "https://www.censoredscience.com/wp-content/uploads/sites/376/2022/05/Plastic-Straw-Ocean-Sea-Trash-Water-Bag.jpg"}, "tags": ["marine life", "ocean health", "research", "plastic waste", "animals", "Ecology", "environment", "marine animals", "wildlife", "hermit crabs", "plastics", "marine ecosystems", "Oceans"], "tweets": [], "movies": [], "links": ["https://www.ecowatch.com/hermit-crabs-dying-plastic-litter-2641537124.html", "https://www.utas.edu.au/", "https://www.naturalnews.com/2021-04-13-plastic-chemicals-migrating-into-food-and-soil.html", "https://www.pewtrusts.org/en/research-and-analysis/articles/2018/09/24/plastic-pollution-affects-sea-life-throughout-the-ocean", "http://OceanHealthNews.com", "https://www.ecowatch.com/hermit-crabs-dying-plastic-litter-2641537124.html", "https://www.pewtrusts.org/en/research-and-analysis/articles/2018/09/24/plastic-pollution-affects-sea-life-throughout-the-ocean", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcensoredscience%2F2021-07-23-hermit-crabs-killed-by-plastic-waste.html&linkname=Drowning%20in%20plastic%3A%20Hermit%20crabs%20are%20turning%20plastic%20waste%20into%20homes%20that%20are%20killing%20them", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}