{"result_id": "267010", "URL": "https://science.news/2022-09-13-science-is-collapsing-in-new-zealand.html", "timestamp": "2023-04-25 17:03:34 CEST+0200", "meta": {"description": "On September 13, 2022, the New Zealand government announced that they will be rolling back covid-19 restrictions and vaccine mandates. “The Science” is suddenly collapsing in New Zealand, as the population exits its state of mass psychosis and learns to reject new vaccine booster programs, forced masks and social distancing. New Zealand Prime Minister Jacinda […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,body autonomy,discrimination,health freedom,medical ethics,medical fascism,medical freedom,medical privacy,Medical Tyranny,new normal,pandemic,pharmaceutical fraud,Resistance,science deception,segregation,vaccine wars", "favicon": "wp-content/themes/ScienceTheme/images/-fav.png", "canonical": "https://science.news/2022-09-13-science-is-collapsing-in-new-zealand.html", "encoding": "UTF-8"}, "image": null, "domain": "science.news", "title": "“The Science” is collapsing in New Zealand as covid-19 mandates are rolled back", "cleaned_text": "“The Science” is collapsing in New Zealand as covid-19 mandates are rolled back\n\nOn September 13, 2022, the New Zealand government announced that they will be rolling back covid-19 restrictions and vaccine mandates. “The Science” is suddenly collapsing in New Zealand, as the population exits its state of mass psychosis and learns to reject new vaccine booster programs, forced masks and social distancing.\n\nNew Zealand Prime Minister Jacinda Ardern said, “It’s time to safely turn the page on our COVID-19 management and live without the extraordinary measures we have previously used.” She said the rollback on restrictions and mandates is a “milestone” and now the population can “move forward with certainty.”\n\nNew Zealanders no longer tolerating medical tyranny, as “the science” narrative collapses\n\nJust a year ago, New Zealand Prime Minister Jacinda Ardern rolled out a “traffic-light system” of population control that held the people hostage to “The Science” of lockdowns, family separation, forced masks, isolation, PCR tests, and mandatory mRNA vaccines.\n\nThis miserable system of slavery granted special privileges to the vaccine-compliant, while barring the “unvaccinated” from public life. The vaccine-compliant, of course, were either manipulated, injured or killed. Vaccine survivors had to get sick on purpose, destroy their innate immune system, and give up their basic human dignity to comply with a system of abuse. The unvaccinated, on the other hand, had to endure a constant assault on their privacy, freedom and character, as historic levels of discrimination and segregation were used to punish them for imaginary crimes.\n\nIn the RED-LIGHT phase of the traffic light system, the government took full control over all private businesses, demanding that they shut out the “unvaccinated” and serve only the “fully vaccinated.” Restaurants, bars, gyms and other “close contact” venues were all seized by the government and forced to discriminate against innocent individuals.\n\nIn the ORANGE LIGHT phase of the traffic light system, (for which the government was currently enforcing) the government dictated masks mandates for flights, public transport, taxis, retail and all other public venues. During this phase, churches and other places of worship were only allowed to host one hundred people maximum, and attendees were required to worship in separate spaces, with no physical contact allowed.\n\nNew Zealand establishes a lightweight, new normal of medical tyranny\n\nThe New Zealand government is abolishing their “traffic light COVID protection framework,” but will establish a “new normal” of forced masking in health care and aged care settings. Likewise, the government will enforce covid-19 testing where they deem it suitable and will require that citizens isolate for seven days in a row if a PCR swab turns up positive for the advertised disease.\n\nOn the magic date of September 26, the vaccine mandates will be removed, allowing incoming travelers and aircrew to freely enter the country. On that date, “the science” will be tossed out, as the government takes an “anti-vax” approach that they censored and essentially criminalized for more than a year.\n\nHowever, the New Zealand government and the courts will not uphold or protect the rights of the citizens when vaccine mandates are considered at the employer level. In fact, the government announced that employers across the country can violate individual medical privacy and mandate masks and vaccines at their own discretion. Any business can still use vaccine certificates as a form of mass surveillance to violate an individual’s medical privacy and segregate them at will.\n\nSo, while there is progress in New Zealand, the truth about the covid-19 vaccine is still being ignored, and medical ethics are far from being restored. The totalitarian approach that was used a year ago was a maniacal negotiation tactic to condition the population to eventually accept lighter restrictions that STILL VIOLATE the bodily autonomy and health of the individual.\n\n“In short, we now move on to a simple two requirements system of masks in healthcare settings and seven days isolation for positive cases only,” Ardern said, while refusing to defend the rights of the citizens to make their own healthcare decisions. For a full return to normalcy, the rule of law must be upheld against government officials like Ardern who continue to violate human rights and medical ethics.", "opengraph": {"title": "“The Science” is collapsing in New Zealand as covid-19 mandates are rolled back", "type": "article", "url": "https://www.censoredscience.com/2022-09-13-science-is-collapsing-in-new-zealand.html", "site_name": "REAL Science News", "description": "On September 13, 2022, the New Zealand government announced that they will be rolling back covid-19 restrictions and vaccine mandates. “The Science” is suddenly collapsing in New Zealand, as the population exits its state of mass psychosis and learns to reject new vaccine booster programs, forced masks and social distancing. New Zealand Prime Minister Jacinda […]", "image": "https://www.censoredscience.com/wp-content/uploads/sites/376/2022/09/Jacinda-Ardern.png"}, "tags": ["pandemic", "new normal", "big government", "medical fascism", "vaccine wars", "Big Pharma", "body autonomy", "science deception", "segregation", "medical privacy", "medical ethics", "Medical Tyranny", "medical freedom", "Resistance", "health freedom", "discrimination", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://12ft.io/proxy?q=https%3A%2F%2Fwww.theepochtimes.com%2Fnew-zealand-scraps-nearly-all-covid-19-restrictions-including-mask-and-vaccination-mandates_4724789.html", "https://naturalnews.com/2021-10-26-new-zealand-prime-minister-admits-she-helped-create-two-classes-of-people.html", "http://vaccines.news", "http://medicalfascism.news", "https://12ft.io/proxy?q=https%3A%2F%2Fwww.theepochtimes.com%2Fnew-zealand-scraps-nearly-all-covid-19-restrictions-including-mask-and-vaccination-mandates_4724789.html", "https://naturalnews.com/2021-10-26-new-zealand-prime-minister-admits-she-helped-create-two-classes-of-people.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcensoredscience%2F2022-09-13-science-is-collapsing-in-new-zealand.html&linkname=%E2%80%9CThe%20Science%E2%80%9D%20is%20collapsing%20in%20New%20Zealand%20as%20covid-19%20mandates%20are%20rolled%20back", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}