{"result_id": "267029", "URL": "https://science.news/2021-09-22-peter-daszak-anthony-fauci-should-be-arrested.html", "timestamp": "2023-04-25 17:03:46 CEST+0200", "meta": {"description": "A team of scientists named Drastic have been investigating the origins of covid-19, uncovering multiple years’ worth of gain-of-function coronavirus research. When the genetic sequence for covid-19 was first identified, scientists were appalled at how evolved the virus was, how it contained an enhanced human-specific adaptation at the cleavage site on the spike protein. Now […]", "lang": "en", "keywords": "Anthony Fauci,badhealth,badmedicine,badscience,bat experiments,biological weapon,biological weapons,biowar,bioweapons,chimeric viruses,conspiracy,crimes against humanity,criminal intent,criminal investigation,deadly experiments,enhancing viruses,gain-of-function,investigation,liars,MERS experiments,Peter Daszak,Plandemic,spike protein,virus experiments", "favicon": "wp-content/themes/ScienceTheme/images/-fav.png", "canonical": "https://science.news/2021-09-22-peter-daszak-anthony-fauci-should-be-arrested.html", "encoding": "UTF-8"}, "image": null, "domain": "science.news", "title": "Drs. Peter Daszak and Anthony Fauci must be ARRESTED, as new intel emerges documenting planned coronavirus enhancement and deployment", "cleaned_text": "Drs. Peter Daszak and Anthony Fauci must be ARRESTED, as new intel emerges documenting planned coronavirus enhancement and deployment\n\nA team of scientists named Drastic have been investigating the origins of covid-19, uncovering multiple years’ worth of gain-of-function coronavirus research. When the genetic sequence for covid-19 was first identified, scientists were appalled at how evolved the virus was, how it contained an enhanced human-specific adaptation at the cleavage site on the spike protein. Now it’s becoming clear how this came about.\n\nDrastic unveiled a series of controversial grant proposals submitted by zoologist Peter Daszak of EcoHealth Alliance in New York. These grants not only sought to enhance coronavirus infectivity, but also sought to release highly-penetrable spike protein nano-particles into the wild! The unethical project sought $14 million from the Defense Advanced Research Projects Agency (DARPA) and was set to be initiated in 2018.\n\nSee the full DRASTIC document at this link, archived on NN servers.\n\nDr. Daszak intended to release enhanced coronavirus spike proteins into the wild\n\nDARPA did not approve the $14 million, and said, “It is clear that the proposed project led by Peter Daszak could have put local communities at risk.” DARPA warned that Daszak and his team had not properly considered the dangers of enhancing the virus and releasing a vaccine by air. Neither DARPA nor the NIH tried to stop the research from going forward, however.\n\nThese grants reveal Daszak’s INTENT to develop and release highly infectious viruses and spike protein nano-particles for advancing vaccine research. Daszak is joined by Dr Shi Zhengli, the “bat woman” from the Wuhan Institute of Virology, as well as US researchers from the University of North Carolina and the United States Geological Survey National Wildlife Health Centre.\n\nDaszak and his collaborators planned to develop genetically enhanced, chimeric viruses that could readily infect humans. According to the documents, researchers sought to combine “human-specific cleavage sites” to bat coronaviruses, allowing viruses to readily enter human cells. The proposal even sought to enhance Middle Eastern Respiratory Syndrome (MERS), a coronavirus strain with low transmissibility but a 30 percent fatality rate!\n\nThis research required that scientists from China’s Wuhan Institute of Virology intentionally release enhanced, airborne coronaviruses into bat populations in China. These bat populations were to be subsequently inoculated with experimental vaccines against diseases that could cross over into human populations. The research would assist scientists in identifying pathogens of greatest concern so that lucrative vaccine programs could be developed. This controversial research was proposed just eighteen months before the first case of covid-19 was identified in Wuhan China. Daszak wrote in the grant application that they would “conduct educational outreach … so that there is a public understanding of what we are doing and why we are doing it, particularly because of the practice of bat-consumption in the region.”\n\nAngus Dalgleish, Professor of Oncology at St Georges, University of London, said Daszak’s research could have continued without DARPA funds, especially with how much was time, energy and money was already invested in the project. “This is clearly a gain of function, engineering the cleavage site and polishing the new viruses to enhance human cell infectibility in more than one cell line,” Dalgleish said — contradicting Dr. Anthony Fauci, who denied the fact that NIAID funded this type of research.\n\nDaszak, Fauci and their collaborators must be arrested, with a full criminal investigation to follow\n\nAccording to the document release, Dr. Daszak and his collaborators planned to release nano-particles that could penetrate the skin. These nano-particles contained “novel chimeric spike proteins” from bat coronaviruses. These enhanced, skin-penetrating spike proteins were set to be released into cave bats in Yunnan, China. The documents reveal that covid-19 is more than a virus. It’s a biological weapon that was strategically developed and slated for deployment in 2018.\n\nWith the CCP working closely on this research, it’s plausible that these spike protein nano-particles could have been released anywhere in the world, stealthily and without remorse. These spike protein nano-particles can be released over cities to cripple medical systems and exploit the vulnerabilities of hospitals and fragile immune systems. They could also be used to target specific types of people at specific event venues. Additional intel documents reveal that the Chinese military planned aerosolized bioweapon development and deployment to “cause the enemy’s medical system to collapse.”\n\nDaszak’s grant applications include unethical animal and virus release experiments, with the threat of serious repercussions for human populations. Dr. Peter Daszak and Dr. Anthony Fauci are culpable for the origins of covid-19. It is of preponderance that these doctors be ARRESTED. Many in the scientific community are calling for a full CRIMINAL investigation into their roles in establishing and completing these diabolical, macabre research projects. Daszak and Fauci must be brought to trial and interrogated, with the greater scientific community calling for a new system of ethics to stop these deadly experiments on animals and humans and to stop the censorship and abuse. All the relevant gain-of-function research these doctors participated in, oversaw and lied about must be brought forth and meticulously addressed.\n\nIn early 2020, Daszak conspired with several other scientists who were invested in coronavirus gain-of-function research. Daszak authored the paper in the Lancet to shut down any scientific debate or investigation into the origins of covid-19. Daszak even thanked Fauci in private emails for downplaying the lab leak theory in front of the world stage. Fauci lied to U.S. Congress about the research he approved and funded, denying his well-documented role in overseeing these unethical coronavirus gain-of-function research projects that exploit human immune systems.", "opengraph": {"title": "Drs. Peter Daszak and Anthony Fauci must be ARRESTED, as new intel emerges documenting planned coronavirus enhancement and deployment", "type": "article", "url": "https://www.censoredscience.com/2021-09-22-peter-daszak-anthony-fauci-should-be-arrested.html", "site_name": "REAL Science News", "description": "A team of scientists named Drastic have been investigating the origins of covid-19, uncovering multiple years’ worth of gain-of-function coronavirus research. When the genetic sequence for covid-19 was first identified, scientists were appalled at how evolved the virus was, how it contained an enhanced human-specific adaptation at the cleavage site on the spike protein. Now […]", "image": "https://www.censoredscience.com/wp-content/uploads/sites/376/2022/05/Coronavirus-Covid-19-Journallists-China-Lab-Tour.jpg"}, "tags": ["conspiracy", "investigation", "Anthony Fauci", "biological weapon", "virus experiments", "bioweapons", "bat experiments", "spike protein", "Peter Daszak", "criminal investigation", "gain-of-function", "criminal intent", "chimeric viruses", "biological weapons", "crimes against humanity", "biowar", "liars", "deadly experiments", "enhancing viruses", "Plandemic", "MERS experiments"], "tweets": [], "movies": [], "links": ["https://www.telegraph.co.uk/news/2021/09/21/wuhan-scientists-planned-releaseskin-penetrating-nanoparticles/", "https://www.naturalnews.com/files/Defuse-Project-Drastic-Analysis-1.pdf", "https://www.naturalnews.com/2021-05-12-chinese-military-bioweapon-to-cause-collapse-enemys-medical-system.html", "https://www.naturalnews.com/2021-09-13-conspiracy-lancet-scientists-denied-covid-theory-wuhan-ties.html", "https://www.naturalnews.com/2021-06-08-peter-daszak-bullied-scientists-covering-up-laboratory-origins-cov2.html", "https://www.naturalnews.com/2021-06-07-ecohealth-alliance-president-thanked-fauci.html", "https://www.naturalnews.com/2021-09-11-sen-paul-says-fauci-lied-again.html", "https://www.telegraph.co.uk/news/2021/09/21/wuhan-scientists-planned-releaseskin-penetrating-nanoparticles/", "https://www.naturalnews.com/2021-05-12-chinese-military-bioweapon-to-cause-collapse-enemys-medical-system.html", "https://www.naturalnews.com/2021-09-13-conspiracy-lancet-scientists-denied-covid-theory-wuhan-ties.html", "https://www.naturalnews.com/2021-06-08-peter-daszak-bullied-scientists-covering-up-laboratory-origins-cov2.html", "https://www.naturalnews.com/2021-06-07-ecohealth-alliance-president-thanked-fauci.html", "https://www.naturalnews.com/2021-09-11-sen-paul-says-fauci-lied-again.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcensoredscience%2F2021-09-22-peter-daszak-anthony-fauci-should-be-arrested.html&linkname=Drs.%20Peter%20Daszak%20and%20Anthony%20Fauci%20must%20be%20ARRESTED%2C%20as%20new%20intel%20emerges%20documenting%20planned%20coronavirus%20enhancement%20and%20deployment", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}