{"result_id": "267031", "URL": "https://science.news/2020-12-02-world-leaders-launch-behavioral-control-experiment.html", "timestamp": "2023-04-25 17:03:47 CEST+0200", "meta": {"description": "An all-powerful global government has already formed, and they have already made their plans public. They plan to use covid-19 lock downs and public health orders to strip people of their individual rights, to forfeit private property ownership, and to submit sovereign countries to a one world economy that is complete with heightened data collection […]", "lang": "en", "keywords": "badmedicine,behavioral control,big tech censorship,bodily requirements,Collusion,communism,compliance,economic control,freedom of information,great reset,health freedom,infections,informed consent,Liberty,manipulation,medical fascism,Medical Tyranny,obey,pandemic,privacy watch,thought control,vaccine jihad,vaccine requirements,vaccine wars,vaccines,world economic forum", "favicon": "wp-content/themes/ScienceTheme/images/-fav.png", "canonical": "https://science.news/2020-12-02-world-leaders-launch-behavioral-control-experiment.html", "encoding": "UTF-8"}, "image": null, "domain": "science.news", "title": "UN, Big Tech, and World Economic Forum launch behavioral control experiment to boost vaccine compliance and push communist economic system", "cleaned_text": "UN, Big Tech, and World Economic Forum launch behavioral control experiment to boost vaccine compliance and push communist economic system\n\nAn all-powerful global government has already formed, and they have already made their plans public. They plan to use covid-19 lock downs and public health orders to strip people of their individual rights, to forfeit private property ownership, and to submit sovereign countries to a one world economy that is complete with heightened data collection and surveillance of human beings with vaccine passports and a wealth redistribution system that quashes the American dream and submits everyone to an “equitable” future replete with controlled markets, a digital currency, and central bank economic controls. This will admittedly be accomplished through a sophisticated brainwashing initiative launched by the World Economic Forum (WEF), the United Nations (UN) and Big Tech.\n\nThe facilitators behind the WEF’s “Great Reset” and the UN’s “sustainable development goals” are seeking submission from all developed nations in the realms of economics, private property ownership, energy production, and wealth distribution. Not only that, but this network of controlling psychopaths want to use the internet to control the thoughts and behaviors of over one billion people on the planet. They openly admit they want to use governments, researchers, businesses and influencers to promote their communist system which will be sold as “Build Back Better.”\n\nThis global government pledges to use thought control methods that will be deployed across the media and the internet channels. Big Tech censorship, which accelerated over the past four years, is only the first part of the deception — a period of elimination — where free thought, free market ideas, independent journalism and scientific advancement are restricted. Any information that gets in their way will be labeled as “misinformation” and will be mocked and blocked. The next phase of thought control will include overt manipulation, a coordinated attempt to convince people in influential positions to promote a new “sustainable” world economy, where people have no privacy or consent in what is mandated regarding their body. The system they want everyone to accept will require bodily submission to the public health orthodoxy, coupled with a more invasive surveillance state.\n\nUN, Big Tech and WEF to manipulate the world to submit to global governance\n\nThe UN and WEF have partnered to launch the #PledgetoPause initiative. UN communications director Melissa Fleming called the program “the first global behavior change campaign on misinformation.” Multiple NGOs backed by George Soros and all the Big Tech companies are on board. The program has already weeded out and removed online content that challenges their agendas. Now their goal is to “mobilize experts and researchers, government, influencers, civil society, businesses, regulators and the media to block out any “wrong information” regarding covid-19 vaccines, lock downs, economic controls, masks, social distancing, gathering restrictions, etc.\n\nThe initiative has already coordinated with a left-wing activist group called Purpose. This group strives to promote the LGBT movement and has recently launched attacks on Poland’s pro-family laws and culture, while eliminating any dissent through online censorship. The initiative has also partnered with Google and the Gates Foundation to eliminate any open discussion about vaccines, informed consent, individual rights, medical privacy, vaccine injury, etc.\n\nThe UN communications department said the collaboration with WEF is part of a larger project already in place called “Verified.” This psychological operation of thought control only allows people to share “verified content optimized for social sharing.” This content is pre-selected by the UN and prioritized in social media feeds. Fleming confessed that the United Nations is “working with social media platforms to help break the chain of misinformation.” The UN said they want to impact at least 1 billion people in this behavior control initiative. The initiative has already “recruited 110,000 information volunteers” who are employed to be “digital first responders.” These thought control police will monitor the internet to eliminate information that has been deemed “dangerous misinformation” — forcing intellectual subservience from all.", "opengraph": {"title": "UN, Big Tech, and World Economic Forum launch behavioral control experiment to boost vaccine compliance and push communist economic system", "type": "article", "url": "https://www.censoredscience.com/2020-12-02-world-leaders-launch-behavioral-control-experiment.html", "site_name": "REAL Science News", "description": "An all-powerful global government has already formed, and they have already made their plans public. They plan to use covid-19 lock downs and public health orders to strip people of their individual rights, to forfeit private property ownership, and to submit sovereign countries to a one world economy that is complete with heightened data collection […]", "image": "https://www.censoredscience.com/wp-content/uploads/sites/376/2020/12/United-Nations-Building-Flags.jpg"}, "tags": ["informed consent", "manipulation", "pandemic", "economic control", "great reset", "Liberty", "world economic forum", "compliance", "vaccine jihad", "privacy watch", "communism", "freedom of information", "obey", "vaccine wars", "infections", "Medical Tyranny", "big tech censorship", "medical fascism", "Collusion", "thought control", "bodily requirements", "vaccines", "vaccine requirements", "health freedom", "behavioral control"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/un-enlists-110000-volunteers-to-push-approved-covid-19-information-online", "https://www.naturalnews.com/2020-10-19-world-leaders-planning-world-debt-reset-program.html", "https://www.naturalnews.com/2020-11-04-global-communism-disguised-as-the-great-reset.html", "http://vaccines.news", "https://www.lifesitenews.com/news/un-enlists-110000-volunteers-to-push-approved-covid-19-information-online", "https://www.naturalnews.com/2020-11-04-global-communism-disguised-as-the-great-reset.html", "https://www.naturalnews.com/2020-10-19-world-leaders-planning-world-debt-reset-program.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcensoredscience%2F2020-12-02-world-leaders-launch-behavioral-control-experiment.html&linkname=UN%2C%20Big%20Tech%2C%20and%20World%20Economic%20Forum%20launch%20behavioral%20control%20experiment%20to%20boost%20vaccine%20compliance%20and%20push%20communist%20economic%20system", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}