{"result_id": "268002", "URL": "https://sciencevibe.com/2018/01/26/warning-flu-season-getting-worse-deadly-day-day/", "timestamp": "2023-04-25 17:03:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://sciencevibe.com/2018/01/26/warning-flu-season-getting-worse-deadly-day-day/", "encoding": "UTF-8"}, "image": null, "domain": "sciencevibe.com", "title": "WARNING: Flu Season Getting Worse & More Deadly Day By Day – Science Vibe", "cleaned_text": "CBS Reports that health officials in Southern California have found the current flu season is so intense that some hospitals are rerouting patients to other facilities – and else where it’s been reported that many doctors can’t even return phone calls from patients “dying” to get in to see their long term patients suffering from the flu. CBS says that from Laguna Beach to Long Beach, emergency rooms were struggling to cope with the overwhelming cases of influenza and had gone into “diversion mode,” which means ambulances are turned away and in theory sent to other hospitals – but room is running out fast. O.C. Global in Orange County’s announced Thursday afternoon it would no longer be accepting ambulances at its emergency room – except for trauma patients. And it’s happening all over the US.\n\n“It’s not just Orange County, it’s all across the country,” internist Dr. Ray Casciari with St. Joseph Hospital told CBS2 Los Angeles. “So, yes, this is going to be an epidemic year,” Casciari warned. The Centers for Disease Control reports 30 children have died from influenza since October, and the number of states hit with high flu-like illness is now up to 32. If your kid gets sick, get help fast.\n\n“The dominant flu virus out there is one we call H3N2 – it’s a more severe virus,” said Dr. William Schaffner of Vanderbilt University Medical Center. Schaffner said this year’s flu vaccine is about 20 to 30 percent effective, but if you have the flu vaccine and get the flu the severity is more likely to be mild. “Even if you’ve gotten the flu, despite having the vaccine, you’re likely to have a less severe case. You’re less likely to have complications like pneumonia, having to be hospitalized and dying,” Schaffner said. And it’s not too late to get it.\n\nThis epidemic means extreme measures across the country. A few California hospitals built tents outside to cater to patient overflow.\n\nIf you haven’t gotten a flu shot yet, the CDC recommends you get one right away so that it can only help — and remember, flu season peaks in February. All the information you need to have is on the CDC website.", "opengraph": {}, "tags": ["influenza", "Flu Season", "H3N2", "Hospitals", "CDC"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/b3NCsWVYgH8?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/b3NCsWVYgH8?rel=0"}], "links": ["https://www.cbsnews.com/news/flu-season-could-be-bad/", "https://www.cbsnews.com/news/flu-season-off-to-an-early-start-widespread-in-7-states/", "https://www.cdc.gov/flu/index.htm", "https://www.cbsnews.com/news/deadly-flu-season-particularly-rough-on-kids-and-wont-peak-anytime-soon/?ftag=CNM-00-10aac3a", "https://www.cdc.gov/flu/index.htm"], "authors": [], "publish_date": ""}