{"result_id": "268006", "URL": "https://sciencevibe.com/2019/02/05/children-heartbreaking-internet-search-how-to-get-vaccinated-without-their-parents-consent/", "timestamp": "2023-04-25 17:04:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://sciencevibe.com/2019/02/05/children-heartbreaking-internet-search-how-to-get-vaccinated-without-their-parents-consent/", "encoding": "UTF-8"}, "image": null, "domain": "sciencevibe.com", "title": "Childrens’ Heartbreaking Internet Search: “How To Get Vaccinated Without Their Parents’ Consent” – Science Vibe", "cleaned_text": "The debate surrounding whether or not children should be vaccinated against diseases continues to rage on.\n\nThis is very sad. Imagine your born into a anti-vaxxer family but you want to be vaccinated – the question is what do you do? Teens with anti-vaxx parents have been searching the internet to get vaccinated without their consent and the lack of options is heartbreaking. And it turns out that children of ant-vaxxers are turning to Reddit for advice on how to protect themselves from potentially deadly diseases against the wishes of their own parents.\n\nDoctors and health professionals are agreed that immunizations reduce morbidity and mortality caused by a range of illnesses.\n\nDespite its known successes, there are those who believe the widely disproven argument that vaccinations cause autism.\n\nIn 2019 immunisation rates in America are low, and the blame has been put on anti-vaccination parents.\n\nDoctors are fighting a recent measles outbreak in Oregon and Portland– a disease that can be vaccinated against.\n\nThe spread of the illness has been linked to anti-vaxxers.\n\nIn light of the outbreak, author Andrea Philips pointed the discussion over vaccinations on Reddit – where, she reminds people, teenagers go to ask about how they can get vaccinated without their parents’ consent. She wrote:\n\nOne teenager posted in the subreddit r/legaladvice, where he asked people what he can do to get vaccinated without getting consent.\n\nThe unnamed 15-year-old asked Reddit users the following:\n\nThe Minnesota teen researched a number of statutes regarding health and needed some help clarifying them.\n\nPeople recommended a few things he could do, including:\n• Talking to a nurse about his concerns\n• Doing some more research on states and age of consent\n\nHowever, most people were of the same opinion: What can children do to bypass getting parental consent to get vaccinated against serious illnesses? In short: nothing.\n\nThe age for medical consent varies in America, but the minimum age of consent in some states is 16 years old. In other places, the age goes up to 18.\n\nHowever, IFLS points out that there are exceptions, as Vaxopedia.org point out. In the following 15 states, it is possible to give your own consent to vaccinations.\n\nIt has been reported that one 15-year-old boy from Minnesota was so desperate that he investigated whether or not he should forge one of his parent’s signatures (the answer is an emphatic no, forgery carries a $5,000 fine or up to 3 years in jail).\n\nEveryone from the World Health Organization to Roald Dahl to this woman who experienced negative effects of vaccines urge you to get them done for your own health, as well as those around you.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/r/legaladvice/comments/9cs9f3/minor_consent_to_vaccination/?sort=confidence", "https://vaxopedia.org/2018/09/25/how-can-i-get-vaccinated-if-my-parents-are-anti-vaccine/", "https://www.revisor.mn.gov/statutes/cite/609.63", "https://www.iflscience.com/health-and-medicine/theres-a-new-official-major-threat-to-world-health-and-its-completely-ridiculous/", "https://www.iflscience.com/health-and-medicine/roald-dahls-heartbreaking-letter-to-antivaxxers-needs-to-be-read-by-everyone/", "https://www.iflscience.com/health-and-medicine/woman-who-developed-condition-after-having-a-vaccine-urges-others-to-get-vaccinated/", "https://www.indy100.com/article/teenager-anti-vaxx-parents-advice-how-vaccination-parental-consent-costa-rica-8752681"], "authors": [], "publish_date": ""}