{"result_id": "268004", "URL": "https://sciencevibe.com/2018/03/17/australia-is-set-to-become-the-first-country-to-completely-eliminate-one-type-of-cancer/", "timestamp": "2023-04-25 17:04:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://sciencevibe.com/2018/03/17/australia-is-set-to-become-the-first-country-to-completely-eliminate-one-type-of-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "sciencevibe.com", "title": "Australia Is Set to Become The First Country to Completely Eliminate One Type of Cancer – Science Vibe", "cleaned_text": "The International Papillomavirus Society has announced that Australia could become the first country to eliminate cervical cancer entirely.\n\nAccording to a new study, Australia’s efforts to distribute a human papillomavirus (HPV) vaccine for free in schools have been a resounding success.\n\nThe sexually transmitted infection causes 99.9 percent of cases of cervical cancer.\n\nIn 2007, the Australian federal government began offering the vaccine to girls aged 12-13, and in 2013 it was made available to boys, too. Girls and boys outside of that age bracket but under nineteen are also entitled to two free doses of the vaccine.\n\nBetween 2005 and 2015, the percentage of Australian women aged between 18 and 24 who had HPV dropped from 22.7 percent to just 1.1 percent.\n\nImmunization rates have increased further since 2015, contributing to what’s being described as a “herd protection” effect.\n\nIn the US, the HPV vaccine is not free. It can cost as much as US$450 for the full regimen, according to the Association of Reproductive Health Professionals, although financial assistance is often available.\n\nIn 2016, 78.6 percent of 15-year-old Australian girls, and 72.9 percent of 15-year-old Australian boys were vaccinated – but only 50 percent of American girls between 13 and 17, and 38 percent of American boys between 13 and 17 had received the vaccination, as per data published by the Henry J. Kaiser Family Foundation.\n\nThe situation is much worse in the developing world, where papillomavirus incidence rate remains high.\n\n“Two-thirds of the world’s population of women don’t get access to what Australian women do,” said Joe Tooma, the chief executive of the Australian Cervical Cancer Foundation.\n\n“Unless we do something, it will still be one of the major cancer killers in developing countries.”\n\nAdministering the HPV vaccine in schools has also proven to be effective in a trial that took place in Bhutan.\n\nOffering this kind of free access to the vaccine in other developing countries may seem like an expensive measure, but as the Australian example shows, it could ease the burden of cervical cancer down the line.", "opengraph": {}, "tags": ["Cancer", "Australia"], "tweets": [], "movies": [], "links": ["https://www.theguardian.com/society/2018/mar/04/australia-could-become-first-country-to-eradicate-cervical-cancer", "http://www.arhp.org/Publications-and-Resources/Patient-Resources/Fact-Sheets/Understanding-HPV-Vaccine", "https://www.kff.org/womens-health-policy/fact-sheet/the-hpv-vaccine-access-and-use-in/", "https://www.ncbi.nlm.nih.gov/pubmed/26057136", "https://www.sciencealert.com/australia-eradication-human-papillomavirus-vaccine-scheme"], "authors": [], "publish_date": ""}