{"result_id": "268007", "URL": "https://sciencevibe.com/2019/04/14/finally-nasas-landmark-twins-study-reveals-resilience-of-human-body-in-space/", "timestamp": "2023-04-25 17:04:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://sciencevibe.com/2019/04/14/finally-nasas-landmark-twins-study-reveals-resilience-of-human-body-in-space/", "encoding": "UTF-8"}, "image": null, "domain": "sciencevibe.com", "title": "Finally NASA’s Landmark Twins Study Reveals Resilience of Human Body in Space… – Science Vibe", "cleaned_text": "Newly published research reveals some interesting, surprising and reassuring data about how one human body adapted to — and recovered from — the extreme environment of space.\n\nKey results from the NASA Twins Study include findings related to gene expression changes, immune system response, and telomere dynamics. Other changes noted in the integrated paper include broken chromosomes rearranging themselves in chromosomal inversions, and a change in cognitive function. Many of the findings are consistent with data collected in previous studies, and other research in progress.\n\nThe telomeres in Scott’s white blood cells, which are biomarkers of aging at the end of chromosomes, were unexpectedly longer in space then shorter after his return to Earth with average telomere length returning to normal six months later. In contrast, his brother’s telomeres remained stable throughout the entire period. Because telomeres are important for cellular genomic stability, additional studies on telomere dynamics are planned for future one-year missions to see whether results are repeatable for long-duration missions.\n\nA second key finding is that Scott’s immune system responded appropriately in space. For example, the flu vaccine administered in space worked exactly as it does on Earth. A fully functioning immune system during long-duration space missions is critical to protecting astronaut health from opportunistic microbes in the spacecraft environment.\n\nA third significant finding is the variability in gene expression, which reflects how a body reacts to its environment and will help inform how gene expression is related to health risks associated with spaceflight. While in space, researchers observed changes in the expression of Scott’s genes, with the majority returning to normal after six months on Earth. However, a small percentage of genes related to the immune system and DNA repair did not return to baseline after his return to Earth. Further, the results identified key genes to target for use in monitoring the health of future astronauts and potentially developing personalized countermeasures.\n\n“A number of physiological and cellular changes take place during spaceflight,” said Jennifer Fogarty, chief scientist of the Human Research Program at NASA’s Johnson Space Center in Houston. “We have only scratched the surface of knowledge about the body in space. The Twins Study gave us the first integrated molecular view into genetic changes, and demonstrated how a human body adapts and remains robust and resilient even after spending nearly a year aboard the International Space Station. The data captured from integrated investigations like the NASA Twins Study will be explored for years to come.”\n\nPart of the record-setting one-year mission, the NASA Twins Study incorporated 10 investigations to advance NASA’s mission and benefit all of humanity. Scott participated in a number of biomedical studies, including research into how the human body adjusts to known hazards, such as weightlessness and space radiation. Meanwhile, Mark participated in parallel studies on Earth to help scientists compare the effects of space on a body down to the cellular level. The findings represent 27 months of data collection.\n\nThe Twins Study helped establish a framework of collaborative research that serves as a model for future biomedical research. Principal investigators at NASA and at research universities across the nation initiated an unprecedented sharing of data and discovery. Supported by 84 researchers at 12 locations across eight states, the data from this complex study was channeled into one inclusive study, providing the most comprehensive and integrated molecular view to date of how a human responds to the spaceflight environment. While significant, it is difficult to draw conclusions for all humans or future astronauts from a single test subject in the spaceflight environment.\n\n“To our knowledge, this team of teams has conducted a study unprecedented in its scope across levels of human biology: from molecular analyses of human cells and the microbiome to human physiology to cognition,” said Craig Kundrot, director, Space Life and Physical Sciences Research and Application Division at NASA Headquarters. “This paper is the first report of this highly integrated study that began five years ago when the investigators first gathered. We look forward to the publication of additional analyses and follow-up studies with future crew members as we continue to improve our ability to live and work in space and venture forward to the Moon and on to Mars.”\n\nThe unique aspects of the Twins Study created the opportunity for innovative genomics research, propelling NASA into an area of space travel research involving a field of study known as “omics,” which integrates multiple biological disciplines. Long-term effects of research, such as the ongoing telomeres investigation, will continue to be studied.\n\nNASA has a rigorous training process to prepare astronauts for their missions, including a thoroughly planned lifestyle and work regime while in space, and an excellent rehabilitation and reconditioning program when they return to Earth. Thanks to these measures and the astronauts who tenaciously accomplish them, the human body remains robust and resilient even after spending a year in space.\n\nFor more information about the NASA Twins Study, visit: https://www.nasa.gov/twins-study\n\nMaterials provided by NASA. Note: Content may be edited for style and length.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nasa.gov/twins-study", "https://www.nasa.gov/press-release/nasa-s-landmark-twins-study-reveals-resilience-of-human-body-in-space", "https://www.nasa.gov/"], "authors": [], "publish_date": ""}