{"result_id": "268008", "URL": "https://sciencevibe.com/2019/06/04/the-one-only-ancestor-with-blue-eyes/", "timestamp": "2023-04-25 17:04:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://sciencevibe.com/2019/06/04/the-one-only-ancestor-with-blue-eyes/", "encoding": "UTF-8"}, "image": null, "domain": "sciencevibe.com", "title": "Only One Ancestor Had Blue Eyes…And Just Look What Happened! – Science Vibe", "cleaned_text": "According to a team of scientists, all people with blue eyes have a single, common ancestor. The genetic mutation occurred between 6,000 and 10,000—before that, we all had brown eyes. The mutation affected the OCA2 gene, which plays a strong role in the production of melanin, the pigment that gives color to our hair, eyes, and skin.\n\n“A genetic mutation affecting the OCA2 gene in our chromosomes resulted in the creation of a ‘switch,’ which literally ‘turned off’ the ability to produce brown eyes,” Hans Eiberg, from the Department of Cellular and Molecular Medicine at the University of Copenhagen, notes. This ‘switch’ is located in the gene adjacent to OCA2, limiting the production of melanin in the Iris—essentially diluted brown eyes. If OCA2 was completely shut down, our hair, eyes, and skin would be melanin-less, a condition known as albinism.\n\nTo reach their conclusion, Eiberg and his team examined DNA from mitochondria, the cells’ energy-making structures, of blue-eyed individuals in countries like Jordan, Denmark, and Turkey. They specifically studied sequences of DNA on the OCA2 gene and discovered that over the course of several generations, segments of ancestral DNA got shuffled so that individuals had varying sequences, except for haplotypes. If individuals share long haplotypes, it means the sequence arose relatively recently in our human ancestors.\n\nEssentially, everyone in the study had the same haplotype—meaning they all have exactly the same gene changes that are all linked to this one mutation. While brown-eyed individuals have considerable variation in the area of their DNA that controls melanin production, blue-eyed individuals only had a small degree of variation.\n\n“Out of 800 persons, we have only found one person which didn’t fit—but his eye color was blue with a single brown spot,” Eiberg told LiveScience. “From this, we can conclude that all blue-eyed individuals are linked to the same ancestor.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": ""}