{"result_id": "269033", "URL": "https://www.sgtreport.com/2022/03/military-doctor-punished-for-granting-exemptions-to-covid-vaccine-mandate-court-documents-reveal/", "timestamp": "2023-04-25 17:06:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2022/03/military-doctor-punished-for-granting-exemptions-to-covid-vaccine-mandate-court-documents-reveal/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Military Doctor Punished for Granting Exemptions to COVID Vaccine Mandate, Court Documents Reveal | SGT Report", "cleaned_text": "Dr. Samuel Sigoloff, a doctor who granted medical exemptions to the military’s COVID-19 vaccine mandate, was ordered not to discuss COVID or see patients, and his medical license in Texas is under investigation.\n\nA major in the U.S. Army Medical Corps was punished for granting service members medical exemptions to the military’s COVID-19 vaccine mandate, and his Texas medical license is under investigation, court documents show.\n\nDr. Samuel Sigoloff, a plaintiff in a lawsuit challenging the military’s mandate, detailed in a new court motion a series of disciplinary actions taken against him. Sigoloff’s declaration is included in the 140-page appendix to the motion.\n\nSigoloff is one of several of the plaintiffs in the lawsuit who requested exemptions for medical reasons. Some of the reasons plaintiffs listed included pregnancy or being part of high-risk “special populations.”\n\nThe lawsuit, originally known as Doe et al. v. Austin, was filed by 18 members of the military, against the U.S. Department of Defense (DOD) and the U.S. Food and Drug Administration (FDA).\n\nIn the latest motion, filed last month, plaintiffs also challenged:\n• The existence and/or availability in the U.S. of the Comirnaty vaccine.\n• The issuance of vaccine cards stating service members were vaccinated with “Comirnaty.”\n• Claims that the Pfizer-BioNTech vaccine authorized for emergency use is “interchangeable” with Pfizer’s fully licensed Comirnaty vaccine.\n\nSigoloff ordered not to discuss COVID or vaccines\n\nIn his declaration, Sigoloff outlined the timeline of events leading to his being “placed in summary suspension,” which bars him from seeing patients.\n\nHe said the main reason he was suspended was “due to the fact I was ‘going against Secretary of Defense … guidance.’”\n\nSigoloff also was “ordered not to discuss COVID19 virus or vaccine [sic] in uniform and during the duty day, [an] infringement on my first amendment rights.”\n• On Sept. 9, 2021, he was alerted by one of his patients that there was a problem with his medical exemption, based on a determination by the clinic’s Commander LTC Marie Carmona, that all exemptions granted by Sigoloff were “now considered invalid.”\n• He was told he “must notify all patients that the medical exemptions are no longer valid.” According to Sigoloff, this is “shadow policy” that represents “a significant deviation from the normal process,” but he stated he nevertheless complied.\n• On Sept. 10, 2021, Carmona “banned the off-label use of ivermectin,” a decision also characterized by Sigoloff as “shadow policy.”\n• On Sept. 13, 2021, Sigoloff “was placed in summary suspension by LTC Carmona for alleged: unprofessional conduct, dissemination of misleading information to patients and distribution of vaccine exemption letters characterizing vaccines as ‘genetic therapy.’”\n• The following day, the Secretary of Defense published an official policy on medical exemptions. Sigoloff claimed “[e]verything I provided for patients followed this policy which mirrors the policy from AR40-562. I was removed from patient care for going against the shadow policy.”\n• On Sept. 16, 2021, Carmona published “an order that is in direct conflict with [Secretary of Defense] official policy and AR40-562,” thereby putting into writing the shadow policy.\n• The next day, LTC Noberto Rodriguez “sent an email … which notified all healthcare providers of the now established shadow policy …”\n\nAn investigation followed, which resulted in a “flag” on Sigoloff’s record based on “findings of: conduct unbecoming an officer, failure to obey lawful orders, and unprofessional comments that undermine the medical command when notifying patients that their medical exemptions are now invalid.”\n\nThe recommendations made by Carmona following the investigation included, according to Sigoloff, that he not see patients younger than 17 for six months, and that he submit to “100% medical chart audits and have patient encounters with supervision for six months.”\n\nSigoloff was “removed from the position of Medical Director,” and he was prohibited, by way of an order from Carmona, from discussing, making recommendations for, or caring for COVID-related patients or topics for one year.\n\nCarmona further ordered that if any of Sigoloff’s patients “have COVID-related questions … they are to be referred to another provider with an appropriate patient handoff.”\n\nSigoloff was “reported to the National Practitioner Data Bank (NPDB) after 30 days of suspension.”\n\nA subsequent report from the NPDB “generated a complaint” against Sigoloff’s Texas medical license. According to Sigoloff, he is now under investigation by the Texas Medical Board as a result.\n\nA General Officer Memorandum of Reprimand was placed in Sigoloff’s permanent human resources record on Jan. 31, 2022.\n\nIn his statement, Sigoloff noted the flag on his record was removed, and that this is “evidence that the … investigation could not adequately substantiate any of the claims against me when I refuted them.”\n\nSigoloff said, “I have had my practice of medicine investigated by an Army physician and his findings demonstrate the investigator’s gross negligence or willful defamation of my character.”\n\nPrior to the military’s investigation of him, Sigoloff submitted a request for his own medical exemption from the military’s COVID vaccine mandate, which prompted a required counseling session.\n\nCarmona told him she would not approve his request, which officially was denied by COL Vu Nguyen, with whom Sigoloff had not established a patient-physician relationship.\n\nSigoloff on Sept. 22, 2021 submitted a request for a religious exemption. The military did not respond.\n\nOn Nov. 12, 2021, a positive COVID test led him to request a permanent medical exemption on the basis of prior immunity. This request was initially rejected, according to Sigoloff, and is now pending appeal.\n\nFinally, Sigoloff’s claims extend to the controversy regarding the alleged “interchangeability” of the Pfizer-BioNTech and Comirnaty vaccines.\n\nAccording to Sigoloff, he informed Rodriguez on Sept. 14, 2021, that the Pfizer-BioNTech vaccine is “not FDA-approved and not the same as Comirnaty.”\n\nThe same day, Rodriguez gave him a memorandum stating that the two vaccines are “interchangeable,” while the next day, Sigoloff said he was “given an order to take Comirnaty” but that “[t]here was no Comirnaty available that day.”\n\nSigoloff provided dozens of documents supporting his claims about the disciplinary procedure he faced.\n\nIn the plaintiffs’ new motion, they argue the federal government has “not cited any agency rule, decision or practice supporting Defendants’ unprecedented Interchangeability determinations,” adding that “Comirnaty appears to [be] the first instance” and that no relevant court precedent exists.\n\n“The DOD and Armed Services treat EUA vaccines ‘as if’ they were legally interchangeable with licensed Comirnaty, and they cite this determination as the legal basis for mandating that Plaintiffs accept a vaccine they have a statutory right to refuse and for punishing them for non-compliance.\n\n“Plaintiffs have alleged that the Armed Services have interpreted the FDA’s Interchangeability determination as meaning “legal interchangeability” … and to require all EUA vaccines to be treated as if they are licensed, without regard to BLA-compliance.\n\n“In doing so, the Armed Services acted without statutory authority, as only the FDA has the authority to make such determinations or implement the PHSA [Public Health Service Act].”\n\n“BLA” refers to Biologics License Applications, an FDA procedure which allows for the fast-track approval of certain medications and which is covered under Section 112 of the Food and Drug Administration Modernization Act of 1997, titled “Expediting Study and Approval of Fast Track Drugs.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/samuel-sigoloff-military-doctor-exemptions-covid-vaccine-mandate/?itm_term=home", "https://childrenshealthdefense.org/defender_category/covid/", "https://dockets.justia.com/docket/florida/flndce/3:2021cv01211/409961", "https://childrenshealthdefense.org/wp-content/uploads/68-PL-opposition-to-Def-MTD-2.pdf", "https://childrenshealthdefense.org/wp-content/uploads/68-1-Declarations-to-PL-Opposition-to-Def-MTD.pdf", "https://childrenshealthdefense.org/defender/military-members-seek-new-injunction-against-covid-vaccine-mandates/", "https://sgtreport.tv/", "https://childrenshealthdefense.org/defender/military-members-seek-new-injunction-against-covid-vaccine-mandates/", "https://childrenshealthdefense.org/defender/childrens-health-defense-sues-fda-pfizer-comirnaty-covid-vaccine/", "https://childrenshealthdefense.org/defender/preventive-ivermectin-reduced-covid-mortality/", "https://www.appliedclinicaltrialsonline.com/view/analysis-fda-s-covid-19-accelerated-pathways", "https://www.fda.gov/vaccines-blood-biologics/development-approval-process-cber/biologics-license-applications-bla-process-cber", "https://www.fda.gov/regulatory-information/selected-amendments-fdc-act/food-and-drug-administration-modernization-act-fdama-1997", "https://childrenshealthdefense.org/defender/samuel-sigoloff-military-doctor-exemptions-covid-vaccine-mandate/?itm_term=home"], "authors": [""], "publish_date": "March 21, 2022"}