{"result_id": "269044", "URL": "https://www.sgtreport.com/2023/03/now-published-in-the-peer-reviewed-scientific-literature-the-mrna-vaccines-are-neither-safe-nor-effective-but-outright-dangerous/", "timestamp": "2023-04-25 17:06:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/03/now-published-in-the-peer-reviewed-scientific-literature-the-mrna-vaccines-are-neither-safe-nor-effective-but-outright-dangerous/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Now published in the peer-reviewed scientific literature: “The mRNA vaccines are neither safe nor effective, but outright dangerous” | SGT Report", "cleaned_text": "In case you missed it. Every health authority in the world should be warning the public about this. The paper was published Sept 21, 2022.\n\nCOVID-19 vaccines – An Australian Review was published in the peer-reviewed scientific literature on Sept 21, 2022.\n\nHere’s the two sentences from the paper that everyone should read:\n\nA worldwide Bayesian causal Impact analysis suggests that COVID-19 gene therapy (mRNA vaccine) causes more COVID-19 cases per million and more non-Covid deaths per million than are associated with COVID-19 [43]. An abundance of studies has shown that the mRNA vaccines are neither safe nor effective, but outright dangerous.\n\nOther key insights from the paper\n\nIf you don’t have time to read the entire paper, here are some of the highlights.\n\nHere are some other direct quotes from the paper:\n• COVID-19 vaccines cause more side effects than any other vaccine\n• Not only does spike protein produce unwanted side effects, but mRNA and nanoparticles do as well.\n• Never in vaccine history have we seen 1011 case studies showing side effects of a vaccine (https://www.saveusnow.org.uk/covid-vaccine-scientific-proof-lethal).\n• Again, it is inconceivable why it would be impossible to go through the study data in a few months, when it took the CDC less than 4 weeks to give the injections emergency use authorization – unless you want to entertain the idea that the study data were never actually read and scrutinised, a frightening perspective.\n• The official public message is that the mRNA vaccines are safe. However, the Therapeutic Goods Administration (TGA), the medicine and therapeutic regulatory agency of the Australian Government, states quite clearly on their website that the large-scale trials are still progressing and no full data package has been received from any company.\n• The mRNA vaccines were supposed to remain at the injection site and be taken up by the lymphatic system. This assumption proved to be wrong. During an autopsy of a vaccinated person that had died after mRNA vaccination it was found that the vaccine disperses rapidly from the injection site and can be found in nearly all parts of the body [1]. … Research has shown that such nanoparticles can cross the blood-brain barrier and the blood-placenta barrier.\n• Despite not being able to prove a causal link with vaccines, as no autopsies were performed, they still believed that a link with vaccination is possible and further analysis is warranted.\n• In summary, it is unknown where exactly the vaccine travels once it is injected, and how much spike protein is produced in which (and how many) cells.\n• The S1 subunit of the SARS-CoV-2 spike protein when injected into transgenic mice overexpressing human ACE-2 caused a COVID-19 like response. It was further shown that the spike protein S1 subunit, when added to red blood cells in vitro, could induce clotting.\n• The authors found consistent alteration of gene expression following vaccination in many different immune cell types.\n• Seneff et al (2022) describe another mechanism by which the mRNA vaccines could interfere with DNA repair.\n• It is an amazing fact that natural immunity is completely disregarded by health authorities around the world. We know from SARSCoV-1 that natural immunity is durable and persists for at least 12-17 years [17]. Immunologists have suggested that immunity to SARS-Cov-2 is no different\n• Immunity induced by COVID infection is robust and long lasting.\n• mRNA vaccines seem to suppress interferon responses. A literature review by Cardozo and Veazev [26] concluded that COVID-19 vaccines could potentially worsen COVID-19 disease.\n• Natural immunity is still not accepted as proof of immunity in Australia.\n• A study at the University of California followed up on infections in the workforce after 76% had been fully vaccinated with mRNA vaccines by March 2021 and 86.7% by July 2021. In July 2021 75.2% of the fully vaccinated workforce had symptomatic COVID.\n• Acharya et al. (2021) and Riemersma et al. (2021) both showed that the vaccinated have very high viral loads similar to the unvaccinated and are therefore as infectious.\n• Brown et al. (2021) and Servelitta et al (2021) suggested that vaccinated people with symptomatic infection by variants, such as Delta, are as infectious as symptomatic unvaccinated cases and will contribute to the spread of COVID even in highly vaccinated communities.\n• Countries with higher vaccination rates have also higher caseloads. It was shown that the median of new COVID-19 cases per 100,000 people was largely similar to the percent of the fully vaccinated population.\n• Multiple recent studies have indicated that the vaccinated are more likely to be infected with Omicron than the unvaccinated. A study by Kirsch (2021) from Denmark suggests that people who received the mRNA vaccines are up to eight times more likely to develop Omicron than those who did not [40]. This and a later study by Kirsch (2022a) conclude that the more one vaccinates, the more one becomes susceptible to COVID-19 infection [41].\n• This has to be seen in context with the small risk of dying from COVID-19… The chances of someone under 18 years old dying from COVID is near 0%. Those that die usually have severe underlying medical conditions. It is estimated that children are seven times more at risk to die from influenza than from COVID-19. [Editor’s note: so why do colleges mandate the COVID vaccine instead of the influenza vaccine?]\n\nOK, the paper is 18 pages long and those were just excerpts from the first 3 pages. Get the picture?\n• Never in Vaccine history have 57 leading scientists and policy experts released a report questioning the safety and efficacy of a vaccine. They not only questioned the safety of the current Covid-19 injections, but were calling for an immediate end to all vaccination. Many doctors and scientists around the world have voiced similar misgivings and warned of consequences due to long-term side effects. Yet there is no discussion or even mention of studies that do not follow the narrative on safety and efficacy of Covid-19 vaccination.\n• Medical experts that have questioned the safety of these vaccines have been attacked and demonized, called conspiracy theorists and have been threatened to be de-registered if they go against the narrative. Alternative treatments were prohibited and people who never practised medicine are telling experienced doctors how to do their job. AHPRA is doing the same here in Australia to the detriment and in ignorance of science.\n\nThe final paragraph sums it up\n\nAs scientists we put up hypotheses and test them using experiments. If a hypothesis is proven to be true according to current knowledge it might still change over time when new evidence comes to light. Hence, sharing and accumulating knowledge is the most important part of science. The question arises when and why this process of science has been changed. No discussion of new knowledge disputing the safety of the COVID-19 vaccines is allowed. Who gave bureaucrats the means to destroy the fundaments of science and tell scientists not to argue the science?\n\nIs this paper right?\n\nI was very impressed with this paper. The authors were very thorough.\n\nThe paper has been in public view since September 21, 2022 which is more than enough time for scientists to question it.\n\nAs far as I am aware, there have not been any mistakes that have been called out that would change the statements or the conclusions of the paper.\n\nHow do you resolve conflicts in scientific papers?\n\nOf course, there have been many papers saying the COVID vaccines are life-saving.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/now-published-in-the-peer-reviewed", "https://www.opastpublishers.com/open-access-articles/covid19-vaccinesan-australian-review.pdf", "https://sgtreport.tv/", "https://www.saveusnow.org.uk/covid-vaccine-scientific-proof-lethal/", "https://stevekirsch.substack.com/p/now-published-in-the-peer-reviewed"], "authors": [""], "publish_date": "March 5, 2023"}