{"result_id": "269021", "URL": "https://www.sgtreport.com/2023/03/vaccine-being-prepared-for-a-bird-flu-jump-to-humans/", "timestamp": "2023-04-25 17:06:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/03/vaccine-being-prepared-for-a-bird-flu-jump-to-humans/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Vaccine Being Prepared For A Bird Flu Jump To Humans | SGT Report", "cleaned_text": "A bird flu shot for humans is being prepared “just in case” it mutates. But if it hasn’t mutated to infect humans yet, how do the “scientists” have access to the sequencing to create an effective vaccine anyway?\n\nThe current outbreak of avian flu known as H5N1 clade 2.3.4.4b has killed record numbers of birds and infected mammals. Human cases, however, remain very rare, and global health officials have said the risk of transmission between humans is still low. Yet Big Pharma is ready to cash in whenever the media tells people the bird flu is going to kill them the same way they did with COVID-19.\n\nExecutives at three vaccine manufacturers told Reuters they are already developing or about to test sample human vaccines that better match the circulating subtype, as a precautionary measure against a future pandemic. Other Big Pharma giants say they “stand ready” to mass produce vaccines and to reap the benefits of another plandemic.\n\nThe goal here is obviously to profit off of the demise of birds (and humans, should it come to that). Whether the avian flu is real or a completely made-up and hyped-up thing is irrelevant. Unfortunately, a good amount of people have already fallen for it and will get the shots or get sick with whatever is going to be released and called “avian influenza.”\n\nMost of the potential human doses are earmarked for wealthy countries in long-standing preparedness contracts, global health experts and the companies said. Many countries’ pandemic plans say flu shots should go first to the most vulnerable while supply is limited. But during COVID-19, many vaccine-rich countries inoculated large proportions of their populations before considering sharing doses.\n\nSo the ruling classes are all of a sudden concerned with impoverished people having access to “vaccines” it creates? This whole scheme reaks of narrative and\n\nResearch Funded By Fauci And Gates Could See Bird Flu Become The Next Deadly Pandemic\n\n“We could potentially have a much worse problem with vaccine hoarding and vaccine nationalism in a flu outbreak than we saw with COVID,” said Dr. Richard Hatchett, chief executive of the Coalition for Epidemic Preparedness Innovations (CEPI), which helps fund vaccine research.\n\nIf Bird Flu Is Spreading Among Humans, We Could Have Another Health Scare\n\nThe World Health Organization said it has signed legally binding agreements with 14 manufacturers for 10% of their pandemic flu vaccine “as it comes off the production line”, in a mix of donated doses and doses to be bought by the agency at an affordable price. The agreements include six of the largest seasonal flu manufacturers, such as Glaxo Smith Klein, Sanofi, and CSL Seqirus, the WHO said.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.shtfplan.com/headline-news/vaccine-being-prepared-for-a-bird-flu-jump-to-humans", "https://www.reuters.com/business/healthcare-pharmaceuticals/why-public-health-officials-are-not-panicked-about-bird-flu-2023-02-23/", "https://sgtreport.tv/", "https://www.reuters.com/business/healthcare-pharmaceuticals/vaccine-makers-prep-bird-flu-shot-humans-just-case-rich-nations-lock-supplies-2023-03-20/", "https://www.reuters.com/business/healthcare-pharmaceuticals/two-new-vaccines-against-bird-flu-effective-dutch-lab-govt-2023-03-17/", "https://www.reuters.com/business/healthcare-pharmaceuticals/bird-flu-alarm-drives-world-towards-once-shunned-vaccines-2023-02-17/", "https://www.reuters.com/business/healthcare-pharmaceuticals/vaccine-makers-prep-bird-flu-shot-humans-just-case-rich-nations-lock-supplies-2023-03-20/", "https://www.shtfplan.com/headline-news/research-funded-by-fauci-and-gates-could-see-bird-flu-become-the-next-deadly-pandemic", "https://www.shtfplan.com/headline-news/if-bird-flu-is-spreading-among-humans-we-could-have-another-health-scare", "https://www.shtfplan.com/headline-news/vaccine-being-prepared-for-a-bird-flu-jump-to-humans"], "authors": [""], "publish_date": "March 21, 2023"}