{"result_id": "269004", "URL": "https://www.sgtreport.com/2023/04/surprise-the-covid-vaccines-were-never-tested-for-safety/", "timestamp": "2023-04-25 17:05:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/04/surprise-the-covid-vaccines-were-never-tested-for-safety/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Surprise! The COVID vaccines were never tested for safety | SGT Report", "cleaned_text": "There were 31% higher deaths in the vax group in the “gold standard” Phase 3 clinical trials. How do we know that none of those deaths were caused by the vaccine? Because Pfizer said so. No evidence.\n\nThere were 31.2% higher deaths in the “gold standard” Pfizer Phase 3 clinical trials.\n\nThere is only one way to know whether or not the vaccine caused any of the deaths in the 21 vaccinated patients who died: proper histopathology.\n\nPfizer never did it and the FDA never asked for it.\n\nThis was the biggest mistake in the pandemic and nobody has acknowledged that or lifted a finger to correct it (as I point out below). Had they done the proper testing on the 21 deaths, the vaccine would never have been approved.\n\nIn lieu of the proper tests, there were assurances from Pfizer that nobody died from the vaccine. That’s absurd. We need the tests, not assurances. The tests are cheap and dispositive.\n\nWe can fix this in a New York minute, but nobody wants to know the answer.\n\nToday, only Ryan Cole is doing the proper histopathology and in 100% of the cases he’s been asked to look at, he can attribute the deaths to the vaccine.\n\nSomeday, I hope that we’ll have leadership at the CDC that is not corrupt and that will ask Medical examiners to do the proper tests.\n\nThis can literally happen instantly. For example, the CDC says that tomorrow, every Medical Examiner in the US should do histopathology looking for the vaccine as a cause of death on the next person who dies. This is no big extra burden for a medical examiner… just a few extra steps.\n\nOr they can ask just a few medical examiners in highly vaccinated regions to run the extra tests on everyone who has an autopsy for the next 30 days (and to make sure that everyone who “dies suddenly” gets an autopsy done).\n\nThe bottom line is this: we could almost instantly have proof of whether the vaccine is safe and effective or not and the costs in time and money is de minimis.\n\nThe CDC is simply not interested in finding the truth about the vaccines, even though their job is to protect America from health threats:\n\nPerhaps it’s time to re-write the CDC’s mission statement to be more accurate? Here is my suggestion:\n\nWhat do you think? It’s an improvement right?\n\nThere were 31.2% higher deaths in the “gold standard” Pfizer Phase 3 clinical trials as explained in this excellent article by Chris Masterjohn.\n\nToday, over one year later, that article has a grand total of 9 likes and 7 comments so it didn’t get a lot of attention. That’s too bad because it’s an important article.\n\nWith a 31.2% higher rate of death for those in the treatment group, because that difference was not statistically significant, we have to look at the autopsy results of all 21 people who died to see if there is a problem.\n\nIf the autopsy results show that none of those 21 people died from the vaccine (which by the way is highly unlikely in light of the Schwab study), then the vaccine might be reasonably safe: it would kill fewer than 1 person per 21,759 on average.\n\nThat’s not super comforting is it? The standard for a “safe” vaccine is that it kills less than 1 person per million vaccinated.\n\nSo essentially, the FDA made a serious error by not demanding to see definitive proof that the vaccine didn’t cause any of the deaths in the trial.\n\nAs a result, the COVID vaccine was “safety tested” on the American public. We have this very poor safety monitoring system (VAERS) which is woefully under-reported. And we have a CDC which is supposed to monitor deaths in VAERS and let us know if there are safety signals. They don’t do that; the death safety signal triggered shortly after the roll out and the CDC was asleep at the wheel and has still never alerted the American public of the risk.\n\nThe FDA blew it by not requiring to see proof that the vaccine didn’t cause any of the deaths in the vaccine trials.\n\nToday, the CDC could easily make up for that mistake today by doing autopsies in a high vaccination region on every vaccinated person who dies within 30 days of their vaccine. After just 10 autopsies, it will be very obvious what is going on.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/surprise-the-covid-vaccines-were", "https://sgtreport.tv/", "https://chrismasterjohnphd.substack.com/p/did-the-pfizer-trial-show-the-vaccine?s=r", "https://stevekirsch.substack.com/p/the-schwab-study-proves-the-covid", "https://stevekirsch.substack.com/p/the-cdc-has-been-ignoring-the-death", "https://stevekirsch.substack.com/p/surprise-the-covid-vaccines-were"], "authors": [""], "publish_date": "April 12, 2023"}