{"result_id": "269041", "URL": "https://www.sgtreport.com/2023/02/shocking-ema-approval-of-covid-vaccine-for-children-caused-a-698-increase-in-child-excess-deaths-across-europe/", "timestamp": "2023-04-25 17:06:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/02/shocking-ema-approval-of-covid-vaccine-for-children-caused-a-698-increase-in-child-excess-deaths-across-europe/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "SHOCKING!: EMA Approval of COVID Vaccine for Children caused a 698% increase in Child Excess Deaths across Europe | SGT Report", "cleaned_text": "The recent revelation that child excess deaths in Europe increased by 698% following the Emergency Use Authorization (EUA) of the COVID-19 vaccine for children by the European Medicines Agency (EMA) is a shocking and deeply disturbing trend.\n\nThe data, released by official government sources, highlights a disturbing disregard for the safety and well-being of our most vulnerable citizens.\n\nThe fact that authorities have so callously disregarded the health and safety of children in the pursuit of a vaccine campaign is a damning indictment of their priorities and their inhumane approach to public health.\n\nIt is truly unbelievable that children, who were at minimal risk of serious illness or death from COVID-19, have been subjected to experimental vaccines with known side effects and unknown long-term consequences.\n\nThe fact that these deaths have occurred in such staggering numbers following the emergency use authorisation of the vaccine for children is a clear indication that the vaccine is not safe for this population and should never have been authorized for use in the first place.\n\nIt is clear that the authorities have failed in their duty of care to protect our children and have instead prioritized their own agenda, at the expense of the health and lives of innocent children.\n\nThe negligence and disregard for human life displayed by these actions are truly reprehensible and call into question the integrity and motives of those who made the decision to authorize the vaccine for children.\n\nIt is vital that we demand accountability and transparency from those in power to ensure that such a tragic and avoidable loss of life never occurs again.\n\nThe sudden increase in excess deaths among children aged 0 to 14 in 25 European countries, including the UK, France, Germany, Spain, and Italy, between week 22 of 2021 and week 52 of 2022 is a massive cause for concern. The fact that this increase coincides with the European Medicines Agency (EMA) approving the COVID-19 vaccine for children aged 12 to 15 raises questions about a possible link between the Covid-19 vaccine and the increase in deaths. They then approved it for 5 to 11-year-olds just a few months later. Prior to the EMA’s approval of the vaccine for children aged 12 to 15 in week 22 of 2021, excess deaths among children were below expected levels with minus-322 excess deaths recorded between week 1 and week 21 of 2021. However, if we go to the start of the pandemic around week 11 of 2020 we actually find deaths among children were even lower than expected with minus-585 excess deaths. Tragically, following the emergency approval of the Covid vaccine for children, a staggering 2,098 excess deaths were recorded between week 22 of 2021 and week 52 of 2022.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/02/03/8x-increase-child-excess-deaths-europe-c19-vaccine/", "https://sgtreport.tv/", "https://www.ema.europa.eu/en/news/first-covid-19-vaccine-approved-children-aged-12-15-eu", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-24.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://web.archive.org/web/20230127150139/https://euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-25.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://web.archive.org/web/20230127150139/https://euromomo.eu/graphs-and-maps", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-26.png?ssl=1", "https://www.euromomo.eu/graphs-and-maps/", "https://web.archive.org/web/20230127150139/https://euromomo.eu/graphs-and-maps", "https://expose-news.com/2023/02/03/8x-increase-child-excess-deaths-europe-c19-vaccine/"], "authors": [""], "publish_date": "February 4, 2023"}