{"result_id": "269015", "URL": "https://www.sgtreport.com/2023/03/covid-19-pfizer-vaccine-suspected-of-killing-125-young-europeans-the-overwhelming-majority-were-healthy/", "timestamp": "2023-04-25 17:05:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/03/covid-19-pfizer-vaccine-suspected-of-killing-125-young-europeans-the-overwhelming-majority-were-healthy/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Covid-19: Pfizer vaccine suspected of killing 125 young Europeans, the overwhelming majority (were) healthy | SGT Report", "cleaned_text": "by Robert Malone MD MS, Who Is Robert Malone:\n\nWhen trying to catch up with my various WhatsApp messages, I found that I had missed one from a journalist who I met in Portugal almost two years ago, when I was speaking to a small group of Lisbon-based free thinking influencers including physicians, lawyers, politicians and of course journalists. The Portuguese journalist Elizabete Tavares had moderated a discussion panel during one of these sessions, and two months ago she had written to alert me to a publication from her new journalistic home, the independent journal publication “Pagina UM”.\n\nUnfortunately, the reporting is only published in Portuguese, but the topic looked important so I asked her if it would be acceptable for me to run this through a machine translation program and re-publish in English. Plus, Jill and I are always keen to bring international perspectives to our Substack readers. Permission granted!\n\nFor those fluent in Portuguese, the original Portuguese version of this article can be found here.\n\nSo, without further ado, below please find a machine translated version of the forwarded article.\n\nCovid-19: Pfizer vaccine suspected of killing 125 young Europeans, the overwhelming majority (were) healthy\n\nPÁGINA UM began to analyze, in detail, the database of the European Medicines Agency, while waiting for the Administrative Court to oblige (or not) Infarmed to disclose the notifications of adverse effects in Portugal of vaccines against covid-19. In the individual records of the most serious cases in Europe – which resulted in the deaths of children and young people–, and which PÁGINA UM presents exclusively, it is not intended to satisfy any morbid curiosity. The disturbance that reading can cause should lead to an immediate question: were these victims necessary, in concrete terms, as collateral damage, in a disease that, for people under 20 years of age, causes three deaths in every 1,000,000 infections? And this includes those with serious comorbidities, because in the case of victims of the adverse effects of vaccines, the overwhelming majority were healthy, which would give them, with absolute statistical certainty, the ability to survive an infection caused by SARS-CoV-2.\n\nThe European Medicines Agency (EMA) has already received and validated a total of 125 deaths of children and adolescents in which there are very strong suspicions of direct association with the mRNA vaccine, produced by Pfizer-BioNTech, marketed under the brand name Comirnaty. This number comes from a detailed analysis – and still ongoing – that PÁGINA UM is carrying out on the EudraVigilance database, which compiles notifications from the pharmaceutical industry itself and from regulators in different countries, including Infarmed.\n\nIn the most recent update of the safety information, on December 8 last year, the EMA reports that around 57.3 million doses have already been administered to children and adolescents (under 18 years of age) – which indicates approximately 30 million vaccinated in these age groups – but not a word or a number about deaths and serious adverse effects.\n\nThis Pfizer vaccine was the only one allowed to be used in Portugal. In addition to this, in Europe, according to the EMA, around 3.1 million doses of Spikevax, Moderna’s vaccine, were administered to children and adolescents. PAGE ONE has not yet reviewed the adverse effects of Spikevax in these age groups.\n\nOnly a detailed query of the EudraVigilance database – not very intuitive and requiring further data analysis – allows individual records to be obtained (anonymized and without country identification) and a rigorous determination of the adverse effects of vaccines against covid -19.\n\nIn addition to the 125 deaths, more than 11,500 adverse reactions considered serious were reported, just for this Pfizer vaccine and last year alone, of which around 9,000 in the 12 to 17 age group. Knowing how many cases resulted in hospitalization and sequelae is a very difficult task, not least because of the lack of information contained in the individual records made available. On the other hand, the EMA database is structured in a way that makes finer analyzes difficult.\n\nIt should be noted, however, that all notifications of deaths contained in EudraVigilance were made by health professionals, which reinforces the strong suspicion that the vaccine is the exclusive “promoter” of the fatal outcome. Even because the notification must always contain the suspected drug.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://rwmalonemd.substack.com/p/covid-19-pfizer-vaccine-suspected", "https://paginaum.pt/", "https://sgtreport.tv/", "https://paginaum.pt/2023/01/27/suspeita-de-vitimar-115-jovens-europeus-a-esmagadora-maioria-saudavel/", "https://paginaum.pt/2023/01/", "https://rwmalonemd.substack.com/p/covid-19-pfizer-vaccine-suspected"], "authors": [""], "publish_date": "March 26, 2023"}