{"result_id": "269011", "URL": "https://www.sgtreport.com/2023/03/watch-german-health-minister-admits-govt-aware-vast-number-suffered-severe-covid-vaccine-injury/", "timestamp": "2023-04-25 17:05:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/03/watch-german-health-minister-admits-govt-aware-vast-number-suffered-severe-covid-vaccine-injury/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Watch: German Health Minister Admits Gov’t Aware Vast Number Suffered ‘Severe’ Covid Vaccine Injury | SGT Report", "cleaned_text": "Karl Lauterbach admits government aware ‘1 in 10,000’ severely injured by vaccine, says he’s not responsible for Big Pharma liability waiver contracts.\n\nGerman Health Minister Karl Lauterbach went on national TV and admitted the federal government is aware of widespread injuries attributed to the Covid vaccine.\n\nIn an interview with ZDF Heute Journal Saturday, Lauterbach acknowledged he’s aware the jabs have caused victims “severe disabilities” and “permanent” injuries for which the government has attempted to financially compensate.\n\n“First of all, what’s happened to these people is absolutely dismaying, and every single case is one too many,” Lauterbach responded when asked to speak to vaccine injured people.\n\n“I honestly feel very sorry for these people. There are severe disabilities, and some of them will be permanent. So it’s hard. What we do as a state is that the health insurance companies pay the treatment costs, and, well, the federal states bear the support costs, if support is necessary. But in fact we have problems on both sides, because we don’t yet have the drugs for treating them. These are being feverishly researched. The entitlement to benefits is also often very bureaucratically tied-up. So I really do understand the people who are complaining here.”\n\nThe German health minister added the government is trying to do a better job of identifying and responding to severe vaccine injuries, which he claimed “happen in less than 1 in 10,000 vaccinations according to the Paul Ehrlich Institute.”\n\nLauterbach was next confronted with comments he made in the summer of 2021 when he claimed the vaccines were safe and effective.\n\n“Well, that was an exaggeration that I once made in a misguided tweet,” he responded. “But it wasn’t fundamentally my position. I had already commented very, very often on the side effects of vaccinations. For example I,” the minister said before being cut off.\n\n“But you often said afterwards that there were hardly any or practically no [side effects],” the ZDF interviewer pressed, adding, “You said this again on the [television talkshow] Anne Will. So, you’ve always given the impression that side effects aren’t really an issue at all.”\n\n“Well, that’s not right,” the health minister claimed, going on to say, “1 in 10,000 [are injured], so you can say it’s a lot, or you can say it’s not so many.”\n\n“But the vaccine really does protect against serious illness and, by the way, very often also reduces the risk of Long Covid,” he added.\n\nAs noted by researcher Steve Kirsch, Lauterbach downplayed injury rates as serious injuries actually occur in “closer to 1 in 100 doses.”", "opengraph": {}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">SHIT HITS THE FAN IN GERMANY😱</p>\n<p>Health Minister admits vaccines injuries!<br/>\n1 in 10000 doses (not people)<br/>\nSays:<br/>\n“ABSOLUTELY SHOCKING”<br/>\n“Why did you claim it was safe and effective?” – “It was a failed tweet!”<br/>\n“First of all, I didn’t sign the contracts!”<br/>\n“BioNTech-EXORBITANT… <a href=\"https://t.co/ia6tPQVR4G\">https://t.co/ia6tPQVR4G</a> <a href=\"https://t.co/2s1RXOhtXD\">pic.twitter.com/2s1RXOhtXD</a></p>\n<p>— aussie17 (@_aussie17) <a href=\"https://twitter.com/_aussie17/status/1635207236481085443?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://www.infowars.com/posts/watch-german-health-minister-admits-govt-aware-vast-number-suffered-severe-covid-vaccine-injury/", "https://www.eugyppius.com/p/karl-lauterbach-in-substantial-reversal", "https://sgtreport.tv/", "https://t.co/ia6tPQVR4G", "https://t.co/2s1RXOhtXD", "https://twitter.com/_aussie17/status/1635207236481085443?ref_src=twsrc%5Etfw", "https://www.infowars.com/posts/watch-german-health-minister-admits-govt-aware-vast-number-suffered-severe-covid-vaccine-injury/"], "authors": [""], "publish_date": "March 14, 2023"}