{"result_id": "269043", "URL": "https://www.sgtreport.com/2023/03/study-finds-1-in-every-99-covid-vaccinated-toddlers-require-emergency-care-or-hospitalisation/", "timestamp": "2023-04-25 17:06:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/03/study-finds-1-in-every-99-covid-vaccinated-toddlers-require-emergency-care-or-hospitalisation/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Study finds 1 in every 99 COVID Vaccinated Toddlers require Emergency Care or Hospitalisation | SGT Report", "cleaned_text": "A study conducted by scientists from several respected institutions across Germany & Switzerland has discovered that 1 in every 99 Covid-19 vaccination children aged 5 and under require emergency care or hospitalisation.\n\nThe scientists also found that the risk of children requiring emergency care or hospitalisation following Covid-19 vaccination was 117% higher than the average risk following vaccination with any other type of vaccine.\n\nThe study was published on October 18th 2022, and is titled ‘Comparative Safety of the BNT162b2 Messenger RNA COVID-19 Vaccine vs Other Approved Vaccines in Children Younger Than 5 Years’.\n\nThe study was designed as a retrospective cohort study to evaluate the safety of the BNT162b2 mRNA (Pfizer) Covid-19 vaccine in children vaccinated before they reached the age of five.\n\nChildren included in the study had received at least one dose of the Pfizer injection and had written informed consent from a parent.\n\nThe study included 7806 children of an average age of 3, 3,824 of which were female, and 3,977 of which were male, and their symptoms following Covid-19 vaccination were followed up for an average of 91.4 days.\n\nThe scientists concluded the following –\n\nThis is a very strange and inaccurate conclusion when you look at the actual results of the study.\n\nThe above chart shows the rate of symptoms following Pfizer Covid-19 vaccination in the left column and the rate of symptoms following non-Covid-19 vaccination in the next column.\n\nIn regards to any symptom being reported, the results show that 1.02 in every 2 children suffered some form of adverse event following Covid-19 vaccination. Whereas just 0.75 in every 2 children suffered some form of adverse event following any other type of vaccination.\n\nThis means the risk of children aged 5 and under suffering an adverse event is 36% higher following Covid-19 vaccination than it is following any other vaccination.\n\nIn regards to adverse events reported involving the pulmonary system, which includes airways, lungs and blood vessels, the results show that 1.43 in every 100 children suffered some form of illness of the pulmonary system following Covid-19 vaccination. Whereas just 0.47 in every 100 children suffered some form of illness of the pulmonary system following any other type of vaccination.\n\nThis means the risk of children aged 5 and under suffering illness of the pulmonary system is 204% higher following Covid-19 vaccination than it is following any other vaccination.\n\nThe results also show the exact same risk in relation to neurological disorders, which are illnesses of the brain and nerves.\n\nIn regards to adverse events reported involving cardiovascular disorders, which include illnesses affecting the heart and blood vessels, the results show that 0.38 in every 100 children suffered some form of cardiovascular disorder following Covid-19 vaccination. Whereas just 0.27 in every 100 children suffered a cardiovascular disorder following any other type of vaccination.\n\nThis means the risk of children aged 5 and under suffering a cardiovascular disorder is 41% higher following Covid-19 vaccination than it is following any other vaccination.\n\nThese are all serious adverse events of which the risk of suffering is significantly higher among children following Covid-19 vaccination. So the conclusion of the scientists the “safety profile of the BNT162b2 vaccine is comparable to non–SARS-CoV-2 vaccines ” is nothing short of an outright lie.\n\nAnd that’s before we even take into account the number of children requiring emergency care of hospitalisation.\n\nAccording to the results of the study, 1 in every 99 children aged 5 and under required emergency care (ambulatory) or hospitalisation (inpatient) following Covid-19 vaccination. This compares to 0.46 in every 99 children requiring emergency care or hospitalisation following any other type of vaccination.\n\nThis means the risk of children requiring emergency care or hospitalisation is 117.4% higher following Covid-19 vaccination than it is following any other vaccination.\n\nTherefore, the scientists’ conclusion of this study is not worth the paper it is written on. The actual conclusion should read –\n\nThe problem is it doesn’t, despite what the results prove, and we can guarantee the false and fraudulent conclusion of the study will be used to justify adding the Covid-19 vaccine to the mandatory childhood vaccine schedule in the USA.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/03/21/1-in-99-covid-vccinated-toddlers-require-emergency-care/", "https://sgtreport.tv/", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2797451", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2797451", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2797451", "https://expose-news.com/2023/03/21/1-in-99-covid-vccinated-toddlers-require-emergency-care/"], "authors": [""], "publish_date": "March 23, 2023"}