{"result_id": "269028", "URL": "https://www.sgtreport.com/2023/02/new-medical-codes-for-covid-vaccination-status-raise-concerns-among-experts/", "timestamp": "2023-04-25 17:06:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/02/new-medical-codes-for-covid-vaccination-status-raise-concerns-among-experts/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "New Medical Codes for COVID Vaccination Status Raise Concerns Among Experts | SGT Report", "cleaned_text": "New medical diagnosis codes for COVID-19 immunization status have been added in the United States.\n\nOne code is for being “unvaccinated for COVID-19.”\n\nThat code “may be assigned when the patient has not received at least one dose of any COVID-19 vaccine,” the U.S. Centers for Disease Control and Prevention (CDC), which implemented the new codes in 2022, states in a document outlining the codes.\n\nAnother code is for being partially vaccinated or having received at least one dose of a COVID-19 vaccine but not having received enough doses to meet the CDC’s definition of fully vaccinated.\n\nThe goal of the codes is “to track people who are not immunized or only partially immunized,” according to the CDC.\n\nExperts say the codes don’t fit with the International Classification of Diseases, which has diagnoses for diseases and reasons for health care visits.\n\n“They’re treating nonvaccination as if this is a hazardous exposure that therefore merits being recorded as a medical exposure,” Dr. Harvey Risch, professor emeritus of epidemiology at the Yale School of Public Health, told The Epoch Times. “That’s never been done to my knowledge.”\n\nThe CDC did not respond to requests for comment for this article.\n\nThe CDC proposed adding the codes to the international classification in September 2021.\n\n“People have now been having immunizations for a number of months, and these provide protection for people who are immunized, but there has been interest expressed in being able to track people who are not immunized or who are only partially immunized,” Dr. David Berglund, a CDC medical officer, said during a meeting that went over the proposal.\n\n“At the current time, there can be considered to be a significant modifiable risk factor for morbidity and for mortality and it can be of interest for clinical reasons, as well as being a value for public health reasons, to be able to track this.”\n\nCOVID-19 hospitalization and death rates are higher among the unvaccinated, according to data published by the CDC. The data do not take into account key factors such as age or prior infection, and other figures show the vaccinated being hospitalized or dying at higher rates in some states.\n\nThe proposal was backed by meeting participants during the International Classification of Diseases, Tenth Revision (ICD-10) Coordination and Maintenance Committee meeting.\n\n“I definitely think we would support this,” Kristin Balint, a supervisor at Trinity Health, said. “We are currently seeing physicians documenting unimmunized for COVID-19 in our records.”\n\nJeanne Yoder, representing the Defense Health Agency, envisioned adding additional codes later to indicate if a person was not vaccinated against each successive variant.\n\nThe organizations of the people who backed the proposal either did not respond to requests for comment or declined inquiries.\n\nThree codes were added to the classification system on April 1, 2022.\n\nZ28.310 is for being unvaccinated. Z28.311 is for being partially vaccinated. Z28.39 is for “other underimmunization status.” All fell under a new sub-sub category, “Underimmunization for COVID-19 status.”\n\nThe codes are grouped with already-existing codes related to vaccination. They include “immunization not carried out because of patient refusal.”\n\nAnother code introduced during the pandemic is for counseling related to “immunization safety.”\n\n“I think it would be a good idea to be able to indicate that, for whatever reason, the vaccine was refused,” Valeria Bica, a clinical documentation specialist at Nemours AI duPont Hospital for Children, said during the meeting that featured the code proposals.\n\n“I know that we track that for families where they’ve refused to vaccinate their children, for one reason or another. And certainly we’ve tried to re-educate and to keep trying to find opportunities to give the vaccines,” she added.\n\nThe ICD was originally developed by the World Health Organization. U.S. authorities have their own version of the system. The COVID-19 immunization codes are not listed in the World Health Organization’s ICD.\n\nAll health care entities operating in the United States and covered by the Health Insurance Portability and Accountability Act must use the U.S. version of the ICD. Coded ICD data from providers enable public health officials to “conduct many disease-related activities,” according to the CDC. The U.S. version is updated at least once a year.\n\nThe codes have multiple purposes. They let health care providers create a medical record, which can be used by future practitioners who take care of the patient. The system also facilitates billing.\n\nDr. Robert Malone, who first highlighted the codes on his Substack blog, said the new codes were concerning in light of how not being vaccinated has been used during the pandemic to deny patients healthcare services, such as organ transplants.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/why-experts-are-concerned-about-the-new-medical-codes-for-covid-19-vaccination-status_5053996.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "https://sgtreport.tv/", "https://covid.cdc.gov/covid-data-tracker/#rates-by-vaccine-status", "https://www.theepochtimes.com/exclusive-vaccinated-making-up-higher-proportion-of-covid-19-metrics-in-us_4680687.html", "https://img.theepochtimes.com/assets/uploads/2023/02/14/modifications.jpg", "https://rwmalonemd.substack.com/p/new-diagnosis-codes-for-covid-19", "https://www.theepochtimes.com/health/why-experts-are-concerned-about-the-new-medical-codes-for-covid-19-vaccination-status_5053996.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [""], "publish_date": "February 18, 2023"}