{"result_id": "269030", "URL": "https://www.sgtreport.com/2023/04/edible-vaccines-promises-and-challenges/", "timestamp": "2023-04-25 17:06:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/04/edible-vaccines-promises-and-challenges/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Edible Vaccines: Promises and Challenges | SGT Report", "cleaned_text": "The recent debate in the Missouri House of Representatives on HB 1169 which is transparency legislation for disclosure of genetic material in the food supply has raised the question: how far along is this whole field? Neither the US Cattleman’s Association nor the National Cattleman’s Beef Association has issued an opinion on HB 1169. Many farmers have been using the Merck Sequivity mRNA vaccine line in swine for several years. While the current products used in livestock are meant to protect the animals with short lifespans from immediate infectious disease threats, there is concern over the future use of food as an intentional means to vaccinate the consumer.\n\nKurup and Thomas published one of many papers describing the lofty goals of using foods, mainly plants, to deliver vaccines to humans in order to induce mucosal immunity. Protection in the sinuses, oral cavity, and GI tract is not strong from intramuscular injections unless the pathogen is invasive and blood born in severe cases.\n\nThis paper summarizes a WHO meeting: “In January 2005, WHO conducted a meeting regarding the regulatory evaluation of plant-based vaccine. The meeting ended up by concluding that the existing guidelines for development, evaluation, and use of vaccines made by conventional methods can be applied in the production of edible vaccines. There were specific issues related to edible vaccine. Plant-derived vaccines should be clinically tested under US investigational new drug application, and also must follow all the regulatory and GMP requirements.”\n\nThe antigens introduced can be proteins as well as mRNA or DNA forms of genetic code that would be absorbed in the GI tract and then induce production of the foreign antigens by somatic cells. This would raise the problem of autoimmunity now seen with the genetic SARS-CoV-2 vaccines.\n\nKurup and Thomas give this additional caveat: “Growing plants for edible vaccine production requires close monitoring. The safety and quality of the genetically modified plants will be a difficult task even though manufacturing of genetically modified plants are regulated. Cross-contamination between genetically modified plants and non-genetically modified plants may occur during pollination and the genetically modified plants themselves become aggressive. Sometimes the DNA or the antigen may release into the water sources by the contact of insects or birds with the plants which causes the contamination of water bodies.”\n\nFrom this and many papers it appears the biopharmaceutical complex is well into the development of genetic vaccines to be delivered in foods. Missouri HB 1169 has enormous importance for transparency. Americans need to know if any genetic product that could change their bodies is consumable in purchased and prepared foods. Whether it has been used to protect animals or intentionally designed to be ingested by humans to induce immunity or some other physiological change—now is the time for transparency and scrutiny over the regulatory process.\n\nIf you find “Courageous Discourse” enjoyable and useful to your endeavors, please subscribe as a paying or founder member to support our efforts in helping you engage in these discussions with family, friends, and your extended circles.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://petermcculloughmd.substack.com/p/edible-vaccines-promises-and-challenges?utm_source=post-email-title&publication_id=1119676&post_id=114539040&isFreemail=true&utm_medium=email", "https://sgtreport.tv/", "https://petermcculloughmd.substack.com/p/edible-vaccines-promises-and-challenges?utm_source=post-email-title&publication_id=1119676&post_id=114539040&isFreemail=true&utm_medium=email"], "authors": [""], "publish_date": "April 15, 2023"}