{"result_id": "269010", "URL": "https://www.sgtreport.com/2023/04/how-google-uses-mind-control-tactics-to-promote-pro-vaccine-industry-propaganda-2/", "timestamp": "2023-04-25 17:05:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/04/how-google-uses-mind-control-tactics-to-promote-pro-vaccine-industry-propaganda-2/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "How Google Uses Mind Control Tactics To Promote Pro-Vaccine Industry Propaganda | SGT Report", "cleaned_text": "Google wants you to think a certain way about vaccines, namely, that they are unilaterally “safe,” “good,” and that those who question these truths to be self-evident are a “burden,” or worse, on society — and its more than willing to distort and manipulate the world’s search results to make you think that way.\n\n[NOTE: This article was originally published on July 31st 2019. Since publishing our investigative reports, Google has changed some of their unscrupulous practices, while also devising new ones, as reported in a recent update from April, 2023.]\n\nAlmost two months after it was revealed that Google scrubbed the pages of most natural health sites from its search results, a series of investigations have revealed that Google actively manipulates the minds and behaviors of its users, prejudicing them against looking for natural alternatives and questioning the safety and efficacy of vaccines. This is being done through the Search Engine Manipulation Effect (SEME), one of the most significant behavioral effects ever discovered, and which affects the thinking and behavior of literally billions around the globe.\n\nThe SEME is so powerful that a 2015 study evaluating voting preferences conducted by Epstein et al. found that biased search engine results could shift the preferences of undecided voters by ~20 percent, and up to 80 percent in some demographics. In fact, Epstein and his colleague’s research has revealed that Google’s SEME may have been a determining factor in a quarter of the world’s recent elections.\n\nRecently, an undercover investigation by Project Veritas revealed that Google is aware of their influence on the elections, and is actively preparing to alter their course in the 2020 US presidential election.\n\nOur focus, however, is on the way Google is leveraging the SEME to promote a set of self-serving socio-political and economic agendas which are diametrically opposed to our core mission of promoting the science of natural healing and your right to medical freedom and informed choice.\n\nPreviously, we’ve uncovered how Google actively disparages complementary and alternative medicine (CAM), such as chiropractic, naturopathy, and the use of vitamins, by populating their autocomplete suggestions with keywords no one is actually using. Since then, we have uncovered more concerning examples of these blatantly false distortions when it comes to questions concerning vaccine safety and efficacy.\n\nGoogle Wants You To Think ‘Anti-vaxxers Hurt The Economy’\n\nBelow, Google autocompletes the search terms “anti-vaxxers are…” with “anti-vaxxers are burdening the economy,” even though Google Trends, another Google product which tracks the volume of actual searches occurring on topics, shows that no one actually searches with these terms. This is significant because Google itself says their search autocomplete function results are not “suggestions” but “predictions” based upon real traffic.\n\nYet, Google Trends data shows that no one is searching “anti-vaxxers are burdening the economy.” And why would they? It’s not a question but an affirmative statement. It begs the question: who’s actually sitting at a desk somewhere at one of Google’s many sites with the authority and clearance to blatantly program their search functions with such ridiculously unrealistic and arbitrary autocomplete suggestions?\n\nGoogle Wants You To Think ‘HPV Vaccines Are Safe For Your Child’\n\nHere’s another example of Google autocompleting vaccine searches with phrases that no one are actually searching: “hpv vaccines are safe for your child”\n\nGoogle Wants You To Think ‘Vaccines Are Good and Not Bad’\n\nAnother example is, “why vaccines are…”\n\nThe actual search trend data shows the phrase “why vaccines are bad” has a similar search volume as “why vaccines are good”\n\nBut when you drill down to states like Texas and California, you’ll show that “why vaccines are bad” versus “why vaccines are good,” constitutes 100% and 67% of the search volume, respectively.\n\nAnother strange and suspicious phrase Google preprogrammed into its autocomplete suggestions is “mandatory vaccines…”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://greenmedinfo.com/blog/how-google-uses-mind-control-tactics-promote-pro-vaccine-industry-propaganda", "https://sgtreport.tv/", "https://greenmedinfo.com/blog/...https://unite.live/greenmedinfo/greenmedinfo?recording_id=2144%20%20Educating%20pro-Vaxx%20AI%20i...", "https://www.greenmedinfo.com/blog/google-just-obliterated-natural-and-health-freedom-websites-its-search-results-wh", "https://www.greenmedinfo.com/blog/investigation-google-search-autosuggestions-program-users-pro-pharma-anti-health-", "https://www.greenmedinfo.com/blog/google-organic-lie-supplements-are-dangerous-chiropractic-fake-and-other-thoughts", "https://www.greenmedinfo.com/blog/google-takes-position-controversial-vaccine-safety-debate", "https://www.pnas.org/content/112/33/E4512", "https://www.greenmedinfo.com/blog/google-just-obliterated-natural-and-health-freedom-websites-its-search-results-wh", "https://www.greenmedinfo.com/blog/google-organic-lie-supplements-are-dangerous-chiropractic-fake-and-other-thoughts", "https://www.blog.google/products/search/how-google-autocomplete-works-search/", "https://trends.google.com/trends/explore?geo=US&q=anti%20vaxxers%20are%20burdening%20the%20economy", "https://trends.google.com/trends/explore?geo=US&q=hpv%20vaccines%20are%20safe%20for%20your%20child", "https://trends.google.com/trends/explore?geo=US&q=why%20vaccines%20are%20good,why%20vaccines%20are%20bad", "https://greenmedinfo.com/blog/how-google-uses-mind-control-tactics-promote-pro-vaccine-industry-propaganda"], "authors": [""], "publish_date": "April 8, 2023"}