{"result_id": "269048", "URL": "https://www.sgtreport.com/2023/04/confused-about-mrna-vaccines-in-meat-thats-exactly-how-they-want-it/", "timestamp": "2023-04-25 17:06:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/04/confused-about-mrna-vaccines-in-meat-thats-exactly-how-they-want-it/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Confused About MRNA Vaccines in Meat? That’s Exactly How They Want It. | SGT Report", "cleaned_text": "Rumors have been circulating about mRNA vaccines in livestock. Fact-checkers have been scoffing, but what’s really going on? Could we be eating animals that have been treated with mRNA? How do we know what’s in the meat at our grocery store?\n\nPORK: Yes, it’s probably been treated with mRNA.\n\nUnfortunately, if you’ve been eating pork from the grocery stores, even organic pork, it’s probably been treated with mRNA because pork producers have been using mRNA products since 2018. Merck’s SEQUIVITY platform is used with different sequences of various porcine diseases, including swine flu, to get immune responses in pigs.\n\nInterestingly enough, sow mortality rates have increased slightly, from 11.1% in 2017 to 12.6% in 2021. However, raising animals in large quantities is very complex; increased mortality could be linked to countless factors, and many producers admit they don’t have enough qualified employees to pay optimal attention to animals. The only certainty here is, new pharmaceutical products have not been a magic bullet for the pork industry’s problems.\n\nI guess we, as a society, don’t have enough money for more agricultural and veterinary workers so that hog farmers can optimally monitor the pigs that will become our food. And yet, it’s still full steam ahead with ever-more-complicated bioengineering solutions. A few months ago, GenVax Technologies, a startup that wants to bring self-amplifying mRNA (saRNA) technologies to animal health, received $6.5 million to begin producing vaccines 100% specific to African Swine Fever variants that may be circulating in pork herds. There always seems to be enough money for mRNA.\n\nIf this sounds similar to a product widely used on humans the past few years, that’s because it is. As in human mRNA treatments, Merck claims that the RNA can’t replicate itself and only lasts a short time in the animals’ bodies. They also say that animals do not shed any RNA particles. Given the wide range of findings in humans after mRNA treatments, however, I think the public has reason to be skeptical.\n\nNow, my first thought when I heard about this was disbelief. Ed Dowd’s Cause Unknown gives very detailed evidence of increasing death rates from the past two years; I couldn’t imagine anyone responsible for livestock trying out a product with so much potential to negatively affect profit margins.\n\nBut most people dying from “unknown causes” have not been dropping dead immediately after receiving medical treatments. Many deaths occur weeks or months later. Age dates for pig slaughter vary somewhat, depending on what the pigs are wanted for, but typically range between 4 and 10 months. Pigs’ natural lifespans, however, are between ten and fifteen years, which means that the pigs used for meat are butchered early in their lives. Who knows what we’d see if the pigs reached even 50% of their natural life span?\n\nBEEF: It’s not treated with mRNA. YET.\n\nRegarding beef, the National Cattlemen’s Beef Association has pooh-poohed online talk about the potential for mRNA vaccines being used in beef. They released a statement on April 5, saying, “There are no current mRNA vaccines licensed for use in beef cattle in the United States. Cattle farmers and ranchers do vaccinate cattle to treat and prevent many diseases, but presently none of these vaccines include mRNA technology.”\n\nOkay, but that’s as of April 2023. As Dr. Robert Malone noted recently, there are no transparency laws surrounding animal trials, which means facts and figures are hard to come by. But we do know that German giants Bayer and BioNTech have been working together to develop mRNA vaccines for veterinary use since 2016.\n\nWe know that there is international interest in using an mRNA template to develop a universal flu vaccine for humans, swine, and chickens\n\nWe know that there is an RNA vaccine licensed for conditional use in chickens to prevent bird flu.\n\nWith so much money being pumped into mRNA-related research, are we really supposed to think it’s just not going to go anywhere? The biotech companies readily admit that they want to use mRNA technology to treat various zoonotic diseases and many people are not happy about it; why wouldn’t we all be complaining just because there’s not much licensed at the moment?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theorganicprepper.com/mrna-vaccines-in-meat/", "https://articles.mercola.com/sites/articles/archive/2023/04/10/eating-pork-treated-with-gene-therapy.aspx?ui=f15df105bd51a3cf9e823d1a4e4a9853bda48059ef163b8b6c1fc34d950ea25e&sd=20210504&cid_source=dnl&cid_medium=email&cid_content=art1HL&cid=20230410_HL2&cid=DM1379361&bid=1769131762", "https://www.merck-animal-health-usa.com/species/swine/sequivity", "https://sgtreport.tv/", "https://www.porkbusiness.com/news/hog-production/mortality-continues-challenge-pork-producers", "https://www.porkbusiness.com/news/industry/genvax-technologies-secures-65-million-advance-novel-vaccine-platform", "https://www.tmrjournals.com/public/articlePDF/20221114/483e983160eb24f1ef94bdd666603ac9.pdf", "https://amzn.to/3KUIlaB", "https://www.ncba.org/ncba-news/news-releases/news/details/33294/ncba-statement-correcting-internet-falsehoods-about-mrna-vaccines-in-cattle", "https://rwmalonemd.substack.com/p/mrna-vaccines-in-livestock-and-companion", "http://www.genengnews.com/topics/drug-discovery/bayer-partners-with-biontech-to-develop-mrna-vaccines-drugs-for-animal-health/", "https://www.frontiersin.org/articles/10.3389/fimmu.2022.1025884/full", "https://www.drugs.com/vet/avian-influenza-vaccine-rna.html", "https://www.theorganicprepper.com/mrna-vaccines-in-meat/"], "authors": [""], "publish_date": "April 13, 2023"}