{"result_id": "269034", "URL": "https://www.sgtreport.com/2023/03/fauci-caught-saying-the-quiet-part-out-loud-about-the-covid-vaccine-during-pbs-special/", "timestamp": "2023-04-25 17:06:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/03/fauci-caught-saying-the-quiet-part-out-loud-about-the-covid-vaccine-during-pbs-special/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Fauci Caught Saying the Quiet Part Out Loud About the COVID Vaccine During PBS Special | SGT Report", "cleaned_text": "We should all reconcile with the fact that Dr. Anthony Fauci is never going away; too many people idolize the man. He’s become a cult-like figure for the COVID freaks on the Left, the male version of Hillary Clinton. Like herpes, you may not see Fauci daily, but he’ll say ‘hey’ every few years. PBS is doing a documentary about that man who got everything wrong about the coronavirus. In some segments posted on social media, Fauci is walking around DC with Mayor Muriel Bowser, trying to increase vaccine rates among black neighborhoods. They were met with skepticism (via Fox News):\n\nThe exchange was documented by PBS for an upcoming program on Fauci as part of its “American Masters” series, which aims to help viewers “discover insightful profiles of important figures in America’s artistic and cultural life.” In a clip from the program titled “Dr. Fauci visits D.C. to battle vaccine hesitancy,” Fauci and Bowser are shown in June 2021 walking the streets of Ward 8 of Anacostia in southeast D.C. – a historical African-American neighborhood that Fauci called “disenfranchised” with low vaccination levels. At the time of the video, Fauci was the director of the National Institute of Allergy and Infectious Diseases. One man challenged the renowned doctor and the Democratic mayor by saying that “the people in America are not settled with the information that’s been given to us right now.” “So, I’m not going to be lining up taking a shot on a vaccination for something that wasn’t clear in the first place,” he said. He pressed Fauci and Bowser about the length of time it took to develop the vaccine and said, “Nine months is definitely not enough for nobody to be taking no vaccination that you all came up with.” Bowser defended the vaccinate by saying, “The only reason I’m talking to you right now, as close as we are, is that I’ve been vaccinated,” as she stood about six feet from the man on the front porch of his home. “But if thousands of people like you don’t get vaccinated, you’re going to let this virus continue to percolate in this country and in this world,” Bowser said. “Something like the common flu then, right?” the man interjected. “[Your] campaign is about fear. It’s about inciting fear in people. You all attack people with fear. That’s what this pandemic is. It’s a fear, it’s fear, this pandemic. That’s all it is,” he said as Fauci and Bowser walked away. Another woman also challenged the duo, saying, “I heard that [the vaccine] doesn’t cure it, and it doesn’t stop you from getting it.”\n\nThe pure comedic aspect surfaces when Fauci blames red states for not pushing vaccination, saying they will keep COVID around as new outbreaks occur. Sir, you’re in deep-blue DC, and people are skeptical of getting vaccinated. Also, the cat was already out of the bag: COVID is endemic. The one thing that Fauci should have come away with during this little walk through DC is that he’s abysmal at messaging. He also said that Republicans needed to be broken to his whims on vaccination.\n\nThe contradictory game he played to keep fear alive, which soon veered into the realm of science fiction, ran its course, and we don’t have to listen to him. That’s the beautiful thing about this country. If you don’t want the vaccine, don’t get it, and Fauci has zero power.", "opengraph": {}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-twitter-extracted-i1679376484580689486=\"true\">\n<p dir=\"ltr\" lang=\"en\">Fauci: “[Red states] are going to keep the outbreak smoldering in the country [because they won’t get vaccinated]. It’s so crazy. They’re not doing it because they say they don’t want to. They’re Republicans. They don’t like being told what to do. We need to break that.” <a href=\"https://t.co/yqV4Il8hBv\" target=\"_blank\" rel=\"noopener\">pic.twitter.com/yqV4Il8hBv</a></p>\n<p>— Greg Price (@greg_price11) <a href=\"https://twitter.com/greg_price11/status/1637839339584471042?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 20, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-twitter-extracted-i1679376484580689486=\"true\">\n<p dir=\"ltr\" lang=\"en\">Anacostia resident: “I head the [vaccine] doesn’t cure it and doesn’t stop you from getting it.”</p>\n<p>Fauci: “On the rare chance that you do get it even when you’re vaccinated, you don’t even feel sick. It’s like you don’t even know you got infected. It’s very good at protecting you” <a href=\"https://t.co/QueSljq3kk\" target=\"_blank\" rel=\"noopener\">pic.twitter.com/QueSljq3kk</a></p>\n<p>— Greg Price (@greg_price11) <a href=\"https://twitter.com/greg_price11/status/1637859065761079301?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 20, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-twitter-extracted-i1679376484580689486=\"true\">\n<p dir=\"ltr\" lang=\"en\">This gem is from a PBS ode to Dr Fauci airing tomorrow night: Dr. Fauci and DC mayor Muriel Bowser go “door-to-door encouraging residents to receive the COVID-19 vaccine and combating vaccine hesistancy”.<br/>\nPremieres on Tuesday, March 21 at 8:00 p.m. on PBS <a href=\"https://t.co/U39OElv40h\" target=\"_blank\" rel=\"noopener\">https://t.co/U39OElv40h</a> <a href=\"https://t.co/nEXbPspeB9\" target=\"_blank\" rel=\"noopener\">https://t.co/nEXbPspeB9</a></p>\n<p>— Miranda Devine (@mirandadevine) <a href=\"https://twitter.com/mirandadevine/status/1637829849048838147?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"noopener\">March 20, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://townhall.com/tipsheet/mattvespa/2023/03/20/anthony-fauci-republicans-are-going-to-keep-covid-around-n2620920", "https://www.foxnews.com/politics/watch-fauci-dc-mayor-bowser-rejected-sell-covid-vaccine-door-door", "https://sgtreport.tv/", "https://t.co/yqV4Il8hBv", "https://twitter.com/greg_price11/status/1637839339584471042?ref_src=twsrc%5Etfw", "https://t.co/QueSljq3kk", "https://twitter.com/greg_price11/status/1637859065761079301?ref_src=twsrc%5Etfw", "https://t.co/U39OElv40h", "https://t.co/nEXbPspeB9", "https://twitter.com/mirandadevine/status/1637829849048838147?ref_src=twsrc%5Etfw", "https://townhall.com/tipsheet/mattvespa/2023/03/20/anthony-fauci-republicans-are-going-to-keep-covid-around-n2620920"], "authors": [""], "publish_date": "March 21, 2023"}