{"result_id": "269023", "URL": "https://www.sgtreport.com/2023/02/cleveland-clinic-conclusively-proves-covid-vaccines-progressively-destroy-the-immune-system/", "timestamp": "2023-04-25 17:06:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/02/cleveland-clinic-conclusively-proves-covid-vaccines-progressively-destroy-the-immune-system/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Cleveland Clinic conclusively proves COVID Vaccines progressively destroy the Immune System | SGT Report", "cleaned_text": "Here is the USnews.com 2022-2023 Best US Hospitals Honour Roll\n\n1. Mayo Clinic, Rochester, Minnesota.\n\n 2. Cedars-Sinai Medical Center, Los Angeles.\n\n 3. NYU Langone Hospitals, New York.\n\n 4. Cleveland Clinic.\n\n 5. (tie) Johns Hopkins Hospital, Baltimore.\n\n 6. (tie) UCLA Medical Center, Los Angeles.\n\n 7. New York-Presbyterian Hospital-Columbia and Cornell, New York.\n\n 8. Massachusetts General Hospital, Boston.\n\n 9. Northwestern Memorial Hospital, Chicago.\n\n 10. Stanford Health Care-Stanford Hospital, Stanford, California.\n\nEstablished in 1821, the Cleveland Clinic is an international healthcare system with over 200 hospitals and clinics. Its network of practices provides routine healthcare, emergency healthcare and specialist treatment…\n\nIt consistently ranks as one of the top American and global healthcare providers, employing 65,000 healthcare professionals and treating nearly 6 million patients annually.\n\nThey have very proactive Departments of Infectious Diseases, Infection Prevention, and Quantitative Health Sciences, that have consistently been the first to produce solid data about the effectiveness of Covid vaccines versus natural immunity using their own 65,000 staff as their clinical trial subjects!\n\nThey wisely did NOT insist that all their staff took the vaccine because they believe in bodily autonomy and are scientists who need a control group of unvaxxed people against which to measure the efficacy of the multi-jab vaccine intervention.\n\nHere are the Covid infection rates for the 1st 98 days from 2022September12, when the bivalent vaccine was first offered to their employees. It was not mandated. It was offered.\n\nSo on 2022September12, 6199 employees were unvaxxed, 2359 were single jabbed, 13804 were double jabbed, 20798 were triple jabbed and 3538 were quad jabbed or penta jabbed with the original vaccine, which was designed against the Wuhan Hu1 reference virus, which was NOT isolated from a Human but was generated on a computer.\n\nThe results of their study, shown graphically above, demonstrate that the more doses of the original vaccine you took, the more likely you were to catch covid. In other words the original Covid vaccine is not merely ineffective against Omicron. It is actually anti-effective.\n\nIt is therefore not a vaccine against the present strain of Covid. It is an antivaccine. It damages your immune system in a dose-dependent manner. The more shots you took, the more damage you will have done to your immune system.\n\nThe writer first saw this from PHE Vaccine Surveillance reports and published his findings to PHE themselves AND on my website and in The Expose, on 2021October10.\n\nIronically all those who are vaccinated against Covid are antivaxxed\n\nAnd all the anti-vaxxers are NOT antivaxxed\n\nWork that one out!.\n\nHow fitting it is that at the time of publication by the Cleveland Clinic of these scientifically terminal results for Covid vaccination (2022December19), the UK NHS suspended their emergency ambulance service and is leaving people to die in pain without healthcare nationwide.\n\nJust as they left them to die in pain without comfort from their relatives who were forbidden to say goodbye to them. The writer was banned from contacting PHE after showing them that their figures proved VAIDS, Vaccine-induced AIDS last year.\n\n‘The Science’ has now been established by the Cleveland Clinic. Genetic vaccines damage your immune system and make you not less likely but more likely to be infected with Covid. Not only that but they have horrendous side effects on the cardiovascular, neurological and reproductive systems as well.\n\nThey are nothing short of mandatory progressive euthanasia. Dr Evil would be proud of these results.\n\nSimply put. If you have had 3 or more jabs, you are 3x more likely to get Covid. And these jabs are still mandated in some countries.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/02/08/cleveland-clinic-proves-covid-vaccines-destroy-immune-system/", "https://health.usnews.com/health-care/best-hospitals/articles/best-hospitals-honor-roll-and-overview", "https://sgtreport.tv/", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-67.png?ssl=1", "https://i0.wp.com/expose-news.com/wp-content/uploads/2023/02/image-68.png?ssl=1", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1.full.pdf", "http://www.truebiblecode.com/", "https://expose-news.com/2021/10/10/comparison-reports-proves-vaccinated-developing-ade/", "https://expose-news.com/2023/02/08/cleveland-clinic-proves-covid-vaccines-destroy-immune-system/"], "authors": [""], "publish_date": "February 10, 2023"}