{"result_id": "269026", "URL": "https://www.sgtreport.com/2023/01/saudi-cardiologist-calls-for-suspension-of-covid-vaccine-over-heart-injuries/", "timestamp": "2023-04-25 17:06:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/01/saudi-cardiologist-calls-for-suspension-of-covid-vaccine-over-heart-injuries/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Saudi Cardiologist Calls For Suspension of Covid Vaccine Over Heart Injuries | SGT Report", "cleaned_text": "“I think this type of vaccine should be suspended until it is fully investigated,” says Prof. Abdullah Alabdulgader.\n\nA world renowned cardiologist out of Saudi Arabia has called for the suspension of the COVID mRNA vaccines, citing cardiac issues found in vaccinated individuals.\n\nProf. Abdullah Alabdulgader, President of the International Congress for Advanced Cardiac Sciences and founder of the Prince Sultan Cardiac Center, lambasted Big Pharma and the mainstream media for promoting the experimental vaccine despite emerging data showing it has major cardiovascular risks.\n\n“In spite of the unprecedented support that has been given to the COVID-19 messenger RNA vaccination is actually incomparable to any support given to any pharmaceutical agent in human history, we are still hearing signs of wisdom coming from different parts of the planet actually questioning the scientific foundation and safety of the messenger RNA vaccination,” Alabdulgader began.\n\nAfter pointing out that the World Health Organization’s mandate when it was created in 1948 was to “improve the quality of life” for mankind, Alabdulgader noted the numerous cardiac issues stemming from the experimental jab.\n\n“In spite of what we are hearing from the media, going to our scientific foundation and questioning the complications of the messenger RNA vaccination, I’m referring mainly to other cardiologists: the cardiovascular complications, the juvenile myocarditis and pericarditis and what we think seriously increases the level of sudden cardiac death,” Alabdulgader said.\n\n“I think anything related to the mRNA products should be reviewed critically and in view of the cardiovascular complications of this type of vaccination, I think this type of vaccine should be suspended until it is fully investigated,” he concluded.\n\nThis comes after the lead author of a peer-reviewed study re-analyzing Pfizer & Moderna trials on the mRNA vaccine claims to have found “conclusive evidence that the vaccines are inducing sudden cardiac death.”", "opengraph": {"image": "https://www.sgtreport.com/wp-content/uploads/2023/01/saudi-cardiologist-calls-for-suspension-of-covid-vaccine-over-heart-injuries-2ZChj1BU5Qk-1.jpg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/2ZChj1BU5Qk\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/2ZChj1BU5Qk"}], "links": ["https://www.infowars.com/posts/saudi-cardiologist-calls-for-suspension-of-covid-vaccine-over-heart-injuries/", "https://sgtreport.tv/", "https://www.infowars.com/posts/the-vaccines-are-inducing-sudden-cardiac-death-lead-study-author-calls-for-immediate-suspension-of-jabs-due-to-serious-harms/", "https://www.infowars.com/posts/saudi-cardiologist-calls-for-suspension-of-covid-vaccine-over-heart-injuries/"], "authors": [""], "publish_date": "January 17, 2023"}