{"result_id": "269040", "URL": "https://www.sgtreport.com/2023/02/no-vaccine-no-food-grocery-industry-merging-with-big-tech-and-big-pharma-as-new-app-tracks-drug-and-vaccine-purchases-along-with-food/", "timestamp": "2023-04-25 17:06:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/02/no-vaccine-no-food-grocery-industry-merging-with-big-tech-and-big-pharma-as-new-app-tracks-drug-and-vaccine-purchases-along-with-food/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "No Vaccine No Food? Grocery Industry Merging with Big Tech and Big Pharma as New App Tracks Drug and Vaccine Purchases Along with Food | SGT Report", "cleaned_text": "Big Food is making its move into the “digital health space” as grocery chain giant Albertsons announced the roll-out of its “Sincerely Health” platform along with a new app where customers “can connect data from wearables, integrate prescriptions, design their diet and make telehealth or vaccination appointments.”\n\nAlbertsons, which includes other mega grocery chains such as Safeway, Vons, Shaw’s, Jewel-Osco, Acme and Tom Thumb, among others, is currently in talks to merger with Kroger, another mega grocery chain, which would give them 36% control over the grocery supermarket business in the United States.\n\nWalmart, the largest grocery chain in the U.S., offers something similar, as they recently teamed up with Avanlee Care, which offers caregivers a similar platform integrated with Walmart shopping lists and pharmacy tools.\n\nYour grocery purchasing habits have been considered very valuable data for decades now, with most major supermarkets offering things like “loyalty” cards that give discounts on grocery products.\n\nBut now, Big Food wants to merge that with your Big Pharma purchases as well, which would include prescription drug purchases as well as vaccines.\n\nAlbertsons moved to enter the digital health space with its platform Sincerely Health, designed to direct consumers on their health and wellness journeys. Sincerely Health was designed with input from providers, payers and tech experts along with insights from 10,000 customers and employees. Users can connect data from wearables, integrate prescriptions, design their diet and make telehealth or vaccination appointments. The platform announcement comes as Albertsons has garnered headlines over a consumer suit to block the proposed megamerger with Kroger. “We are introducing Sincerely Health with a singular intention to improve lives,” Omer Gajial, chief digital officer and executive vice president for health at Albertsons, said in a press release. “As a grocery and pharmacy retailer committed to the health and wellness of our communities, we are empowering customers to have a connected and personalized view of their health across food, nutrition, activity, mental well-being and pharmacy services, enabling them to make more informed choices.” Users first start by filling out a questionnaire based on what the platform refers to as “seven-dimensions of wellbeing”: activity, mental well-being, mindfulness, nutrition, physical health, self-control and sleep. Responses are assessed along with the user’s age, gender, lifestyle choices and mental health. Users can then set goals such as engaging in meditation five times a week, sleeping at least seven hours a night and taking 10 thousand steps daily. The platform connects users with the Albertsons pharmacy by managing prescriptions, scheduling vaccine appointments and making telehealth appointments through the grocer’s partnership with Providence Express Care. Users can opt in to receive reminders to take daily medications or refill prescriptions. “Pixel” tracking technology, which has been the subject of several lawsuits regarding patient privacy of health system websites, is used to track users’ interests and provide relevant content. Users can opt out of the use of “pixels,” according to Albertsons. (Full article.)\n\nAlbertsons claims that the data they collect on its customers are “never sold to third parties,” pointing to the “Health Insurance Portability and Accountability Act” (HIPAA) that they claim protects customers’ medical records.\n\nBut we all know how that works now. All it takes is a declaration of a “public health emergency” and pretty much the entire Constitution of the U.S. is suspended all in the name of “public health.”\n\nYour private health decisions are then broadcast to the public to be used against you, such as whether or not you choose to wear a facemask, or show your proof of vaccination, in order to enter their stores.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://healthimpactnews.com/2023/no-vaccine-no-food-grocery-industry-merging-with-big-tech-and-big-pharma-as-new-app-tracks-drug-and-vaccine-purchases-along-with-food/", "https://sgtreport.tv/", "https://www.fiercehealthcare.com/digital-health/albertsons-health-and-wellness-app-sincerely-health-ties-together-nutrition-and", "https://www.businesswire.com/news/home/20230205005069/en/Albertsons-Companies-Launches-Sincerely-Health", "https://www.fiercehealthcare.com/digital-health/albertsons-health-and-wellness-app-sincerely-health-ties-together-nutrition-and", "https://healthimpactnews.com/2023/no-vaccine-no-food-grocery-industry-merging-with-big-tech-and-big-pharma-as-new-app-tracks-drug-and-vaccine-purchases-along-with-food/"], "authors": [""], "publish_date": "February 21, 2023"}