{"result_id": "269046", "URL": "https://www.sgtreport.com/2023/03/world-health-organization-pushes-for-global-vaccine-passports/", "timestamp": "2023-04-25 17:06:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/03/world-health-organization-pushes-for-global-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "World Health Organization pushes for global vaccine passports | SGT Report", "cleaned_text": "The unelected health agency wants to make this Covid-era surveillance tech permanent.\n\nThe WHO laid out its plans for global vaccine passports in a series of proposed amendments to the International Health Regulations (2005) — a legally binding instrument that imposes various conditions on 196 countries when the WHO declares certain types of health emergencies.\n\nAs governments around the world wind down their vaccine passport programs, the unelected World Health Organization (WHO) is attempting to make this Covid-era surveillance tech permanent and global.\n\nRelated: How vaccine passports are crushing freedom, privacy, and civil liberties\n\nThe WHO laid out its plans for global vaccine passports in a series of proposed amendments to the International Health Regulations (2005) — a legally binding instrument that imposes various conditions on 196 countries when the WHO declares certain types of health emergencies.\n\nThe movement to amend these International Health Regulations (IHR) began in January last year when the Biden administration quietly pushed for major changes. Since this initial push, other member states have proposed their own amendments and the total number of proposed changes now sits at 307.\n\nThese proposed amendments give the WHO new powers to declare “potential” health emergencies and include commitments from member states to recognize the WHO as the “coordinating authority” during certain types of health emergencies.\n\nThey also outline how the WHO intends to use its new powers to push global vaccine passports when it declares “potential or actual” health emergencies.\n\nThe current version of the IHR already allow the WHO to issue recommendations to “review proof of vaccination,” “require vaccination,” and “implement tracing of contacts of suspect or affected persons.”\n\nHowever, these proposed amendments to the IHR greatly expand on the existing recommendations and lay out a framework for digital vaccine passports and other forms of digital tracking.\n\nNew text has been added that allows member states to require “documents containing information for a lab test in digital or physical format” and “information on vaccination against a disease.”\n\nAnother amendment states that “documents containing information concerning traveller’s destination…should preferably be produced in digital form, with paper form as a residual option” and suggests that this will be used for contact tracing.\n\nOne amendment paves the way for “other types of proofs and certificates” which “may be designed by the Health Assembly” (the WHO’s decision-making body) and will be used to “attest the holder’s status as having a decreased risk of being the disease carrier. These other proofs include test certificates (which provide proof someone has been tested for a disease) and recovery certificates (which provide proof someone has recovered from a disease).\n\nNot only do these proposed amendments to the IHR push for post-Covid vaccine passports, digital proofs, and digital certificates but they also state that “vaccination certificates should be considered approved” when the WHO has declared a public health emergency of international concern (PHEIC) and there’s “a scenario of voluntary vaccination using products still at the research phase or subject to very limited availability.”\n\nAdditionally, they mandate that digital health documents “incorporate means to verify their authenticity via retrieval from an official web site, such as a QR code.”\n\nAnd it doesn’t end there. These proposed amendments also lay out a “minimum” and “maximum” scenario for the data to be collected via this proposed vaccine passport and digital certificates scheme.", "opengraph": {}, "tags": ["World Health Organization"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/world-health-organization-global-vaccine-passports", "https://sgtreport.tv/", "https://reclaimthenet.org/topics/world-health-organization", "https://reclaimthenet.org/vaccine-passports/", "https://reclaimthenet.org/world-health-organization-pandemic-treaty-a-fresh-push-for-vaccine-passports-global-surveillance-and-more", "https://reclaimthenet.org/who-target-misinformation-disinformation-international-law", "https://reclaimthenet.org/world-health-organization-global-vaccine-passports"], "authors": [""], "publish_date": "March 2, 2023"}