{"result_id": "269036", "URL": "https://www.sgtreport.com/2023/04/the-culling-of-mankind-government-reports-pfizer-documents-reveal-a-sinister-agenda-exists-to-depopulate-the-planet-through-covid-vaccination/", "timestamp": "2023-04-25 17:06:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/04/the-culling-of-mankind-government-reports-pfizer-documents-reveal-a-sinister-agenda-exists-to-depopulate-the-planet-through-covid-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "The Culling of Mankind: Government Reports & Pfizer Documents reveal a Sinister Agenda exists to Depopulate the Planet through COVID Vaccination | SGT Report", "cleaned_text": "If an experimental vaccine were to damage the heart and immune system in a significant number of individuals who received it, it is possible that it could lead to a decline in the overall population size.\n\nThis could occur for a number of reasons.\n• First, damage to the heart could lead to an increase in cardiovascular diseases, which are a leading cause of mortality worldwide. This could result in a higher number of deaths among individuals who received the vaccine.\n• Second, damage to the immune system could leave individuals more susceptible to other infections and diseases, which could also contribute to an increase in mortality.\n• Last, but by no means least, the negative impacts of the vaccine on fertility and reproductive health could lead to a decline in the number of births, further contributing to a decline in the overall population size.\n\nIf such a vaccine were to be developed and distributed, it could potentially lead to depopulation due to increased mortality and decreased fertility.\n\nUnfortunately, the world has found itself in a situation where powerful institutions and Governments have coerced millions of people into getting an experimental Covid-19 vaccine that causes all of the ill-fated things mentioned above.\n\nOfficial Government reports and confidential Pfizer documents prove it.\n\nTherefore, you are witnessing mass depopulation unfold before your very eyes.\n\nThe push for mass Covid-19 vaccination was never about combating a virus. It was about reducing the global population.\n\nThis goal aligns with the interests of certain powerful corporations and individuals who stand to benefit from a smaller, more manageable population now that AI is advanced enough to replace hundreds of millions of workers.\n\nRegardless of the specific cause, the implications of what is currently occurring in the real world are significant.\n\nDid you know that data on excess deaths in 15% of the world’s countries can be found on the website of the Organisation for Economic Co-operation and Development (OECD)?\n\nThis includes major countries like the USA, Canada, and the UK.\n\nAdditionally, we were able to extract even more up-to-date data on 28 European countries from EuroMOMO.\n\nAll of this information has been provided to the OECD and EuroMOMO by each country’s Government organizations, such as the Centers for Disease Control in the USA and the Office for National Statistics in the UK.\n\nThe following chart illustrates the disturbing trend of excess deaths in the “Five Eyes” countries (Australia, Canada, New Zealand, the UK, and the US) as well as 27 other European countries –\n\nAre you aware of the staggering number of excess deaths that have occurred in the US and Europe in recent years?\n\nIn 2021, the US saw almost 700,000 excess deaths, with another 360,000 excess deaths by November 11th, 2022.\n\nEurope had a similarly alarming 382,000 excess deaths in 2021, with 309,000 excess deaths by November 2022.\n\nAnd these figures don’t even include Ukraine!\n\nShockingly, even countries like New Zealand, Australia, and Canada have seen excess deaths that have not decreased since the rollout of the Covid-19 vaccine.\n\nThe following chart illustrates the disturbing trend of overall excess deaths in Australia in 2020, 2021, and up to week 30 of 2022 –\n\nDid you know that the rollout of the Covid-19 vaccine in Australia led to a shocking 747% increase in excess deaths, from 1,303 in 2020 to 11,042 in 2021?\n\nAnd the situation has only gotten worse since then.\n\nBy the end of July 2022, there were a staggering 18,973 excess deaths in Australia – a 1,356% increase from 2020.\n\nThat’s more excess deaths in 7 months than in the previous two years combined.\n\nAnd the situation in the US is similarly alarming –\n\nAre you aware of the disturbing trend of excess deaths in the US following the rollout of the Covid-19 vaccine?\n\nBy week 38 of 2022, 1,700 more people had died compared to the same time in 2020, and by week 38 of 2021, a shocking 109,000 more people had died compared to the same time in 2020.\n\nThese numbers indicate that rather than decreasing, deaths have actually increased following the vaccine rollout.\n\nThe following two charts illustrate the total excess deaths in the “Five Eyes” and Europe since the beginning of 2021 when the Covid-19 vaccine was introduced –\n\nDid you know that over 1.8 million excess deaths have occurred in the “Five Eyes” and most of Europe since the rollout of the Covid-19 vaccine?\n\nThis shocking figure includes over 1 million excess deaths in the US and over 690,000 excess deaths in Europe according to the Centers for Disease Control and the Organisation for Economic Co-operation and Development, as well as significant numbers of excess deaths in Australia, Canada, and New Zealand.\n\nThe official narrative that the vaccine is safe and effective and would reduce the number of deaths is completely contradicted by these figures, which suggest that the Covid-19 vaccines may be the main cause of the excess deaths.\n\nDid you know that excess deaths among children aged 0 to 14 in Europe skyrocketed by a staggering 755% between January and September 2022, according to official data?\n\nThis alarming increase, which has prompted the European Union to launch an investigation, occurred despite efforts by EuroMOMO to downplay the figures.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/04/07/the-culling-of-mankind-via-covid-vaccination/", "https://sgtreport.tv/", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps/", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps/", "https://www.euromomo.eu/graphs-and-maps", "https://expose-news.com/2023/04/07/the-culling-of-mankind-via-covid-vaccination/"], "authors": [""], "publish_date": "April 9, 2023"}