{"result_id": "269016", "URL": "https://www.sgtreport.com/2023/04/vaccine-shedding-graphene-oxide-secret-pfizer-documents-studies-prove-graphene-is-in-the-covid-vaccines-shedding-is-sadly-occurring-with-deadly-consequences/", "timestamp": "2023-04-25 17:05:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/04/vaccine-shedding-graphene-oxide-secret-pfizer-documents-studies-prove-graphene-is-in-the-covid-vaccines-shedding-is-sadly-occurring-with-deadly-consequences/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "Vaccine Shedding & Graphene Oxide: Secret Pfizer Documents & Studies prove Graphene is in the COVID Vaccines & Shedding is sadly occurring with Deadly Consequences | SGT Report", "cleaned_text": "For over two years, concerned citizens around the world have been voicing their concerns about the safety of the novel Covid-19 mRNA vaccines. Yet, time and time again, they have been dismissed and labelled as conspiracy theorists by the mainstream media and medical establishment.\n\nHowever, recent developments have proven that these so-called conspiracy theories were, in fact, true all along.\n\nBecause confidential Pfizer documents, that the US Food and Drug Administration (FDA) attempted to delay the release of for 75 years, but were subsequently forced to publish by order of the US Federal Court; and various scientific studies have confirmed that the Pfizer Covid-19 vaccine does in fact contain a highly toxic substance known as Graphene Oxide.\n\nA substance that is so toxic that it has and still is destroying red blood cells and forming strange blood clots.\n\nUnfortunately, the same confidential Pfizer documents and various scientific studies also confirm that ‘vaccine shedding’ has been occurring. A process in which individuals who received the Covid-19 vaccine unintentionally shed the contents of it to others.\n\nThis means the not-vaccinated population have also suffered and is continuing to suffer the highly toxic effects of Graphene Oxide entering the body alongside other serious adverse events induced by the Covid-19 vaccines.\n\nOne of the studies confirming the vast majority of humanity has had absolutely no choice in the matter of whether they wish to get the Covid-19 injection or not because the vaccinated have been transmitting antibodies generated by the injections through aerosol was by conducted by scientists at the University of Colorado\n\nThe findings came as no surprise however, because a confidential Pfizer document given to the FDA had already confirmed shedding and exposure to the Covid-19 mRNA injections was perfectly possible by skin-to-skin contact and breathing the same air as someone who had been injected with the Covid-19 “vaccine”.\n\nThe study, titled ‘Evidence for Aerosol Transfer of SARS-CoV2-specific Humoral Immunity’, and published on 1st May 2022, was conducted by the following scientists for the University of Colorado –\n\nThe abstract of the study reads as follows –\n\nDespite the obvious knowledge that infectious particles can be shared through respiration, whether other constituents of the nasal/oral fluids can be passed between hosts has surprisingly never even been postulated, let alone investigated. The circumstances of the present pandemic facilitated a unique opportunity to fully examine this provocative idea. The data we show provides evidence for a new mechanism by which herd immunity may be manifested, the aerosol transfer of antibodies between immune and non-immune hosts.\n\nAnd here are the study authors’ main findings –\n\nThe extended mandates for mask wearing in both social and work environments provided a unique opportunity to evaluate the possibility of aerosolized antibody expiration from vaccinated individuals. Utilizing a flow cytometry-based Multiplex Microsphere Immunoassay (MMIA) to detect SARS-CoV-2-specific antibodies (Fig 1A and B) 4,5 and a method previously used to elute antibody from rehydrated dried blood spots (DBS), we identified anti-SARS-CoV-2 specific antibodies eluted from surgical face masks worn by vaccinated lab members donated at the end of one workday. Consistent with the results reported by others, we identified both IgG and IgA in saliva from vaccinated individuals (Fig 1C and D). It was therefore not surprising to detect both IgG and IgA following elution of antibody from face masks (Fig 1C and D). Given these observations, we hypothesized that droplet/aerosolized antibody transfer might occur between individuals, much like droplet/aerosolized virus particles can be exchanged by the same route.\n\nThis proves Covid-19 vaccine shedding is perfectly possible when we take into account a study performed on behalf of Pfizer in Japan.\n\nThe study observed the distribution of the Covid-19 injection in the bodies of Wister Rats over a period of 48 hours. One of the most concerning findings from the study is the fact that the Pfizer injection accumulates in the ovaries over time.\n\nThe highest concentration was noted in the liver. But it also accumulates in the salivary glands on the skin.\n\nIt is not known if the injection continues to accumulate after 48 hours due to observations being curiously halted after this amount of time in the study.\n\nBut these results, coupled with the first study above, tell us that for a minimum of 48 hours, an unvaccinated person is at risk of being exposed to the Covid-19 injection if they breathe the same air as or touch the skin of a person who has been vaccinated.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2023/04/05/vaccine-shedding-graphene-oxide-pfizer-docuents/", "https://sgtreport.tv/", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#ref-4", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#ref-5", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text#F1", "https://www.medrxiv.org/content/10.1101/2022.04.28.22274443v1.full-text", "https://phmpt.org/wp-content/uploads/2022/03/125742_S1_M4_4223_185350.pdf", "https://phmpt.org/wp-content/uploads/2022/03/125742_S1_M4_4223_185350.pdf", "https://phmpt.org/wp-content/uploads/2022/03/125742_S1_M4_4223_185350.pdf", "https://expose-news.com/2023/04/05/vaccine-shedding-graphene-oxide-pfizer-docuents/"], "authors": [""], "publish_date": "April 6, 2023"}