{"result_id": "269022", "URL": "https://www.sgtreport.com/2023/04/national-guard-soldier-suffers-2-heart-attacks-after-moderna-vaccine/", "timestamp": "2023-04-25 17:06:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.sgtreport.com/wp-content/uploads/2019/01/favicon.ico", "canonical": "https://www.sgtreport.com/2023/04/national-guard-soldier-suffers-2-heart-attacks-after-moderna-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.sgtreport.com", "title": "National Guard Soldier Suffers 2 Heart Attacks After Moderna Vaccine | SGT Report", "cleaned_text": "A 22-year-old Army National Guard member has suffered an array of health issues—including two heart attacks that pushed her to the brink of death—after receiving two doses of the Moderna COVID-19 vaccine.\n\nKarolina Stancik once considered herself “very healthy,” playing multiple sports from adolescence through early adulthood. At 21 years old, she chose to serve the country by joining the U.S. Army in February 2021.\n\n“We were told that it was going to be required and we should take it before we shipped out to basic training,” she said, which was before Secretary of Defense Lloyd Austin’s August 2021 announcement of the military vaccine mandate.\n\nThis messaging, according to Stancik, made the new recruits feel like, “You’re a bad person if you don’t get the vaccine, and you don’t care about the people around you.”\n\n“As a young, new soldier, I and a lot of others around me, did what we were told,” Stancik said.\n\n“We were too new to know all the rules and possible loopholes,” she added. “I pretty much blindly took it because I didn’t know you could get exemptions” for medical or religious reasons.\n\nStancik ended up taking the Moderna vaccine in March and April 2021; since then, “life has been an uphill battle,” she said.\n\nFirst, came the breathing issues.\n\n“I was dealing with what doctors considered asthma at the time without a diagnosis, and I had never had any lung issues at any other point in my life,” she said.\n\nStancik also experienced what felt like a cold or sinus infection, pressure in her head, and dizziness.\n\nNext came a fever, as well as numbness and tingling throughout her body. But she was told by a doctor that these symptoms were normal.\n\nAt one point, her command threatened to accuse her of insubordination for not participating in physical training. However, “a doctor’s order kept me from getting in trouble with my command,” she said. The Epoch Times viewed that order, as well as other medical documentation and Stancik’s Army permanent medical profile, to corroborate her claims.\n\nProblems with visual processing and what she described as neurological issues began in October 2021. These included numbness, tingling, stabbing pains throughout her body, loss of motor function, tremors, and more.\n\n“It all progressively got worse, and never stopped,” Stancik said.\n\nIn October 2021, she found herself in an emergency room, following her first heart attack. Things only escalated after that as she started experiencing nausea, a high heart rate, stabbing pains, and blacking out, she said. In February 2022, she had a second heart attack.\n\nIn addition to these two heart attacks, Stancik said she’s been diagnosed with severe asthma and postural orthostatic tachycardia syndrome (POTS), a blood circulation disorder that causes a higher heart rate when transitioning from sitting or lying down to standing up.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/young-national-guard-soldier-suffers-2-heart-attacks-after-moderna-vaccine_5149626.html?src_cmp=ZeroHedge&src_src=partner", "https://sgtreport.tv/", "https://www.theepochtimes.com/young-national-guard-soldier-suffers-2-heart-attacks-after-moderna-vaccine_5149626.html?src_cmp=ZeroHedge&src_src=partner"], "authors": [""], "publish_date": "April 12, 2023"}