{"result_id": "270026", "URL": "http://www.sheepkillers.com/thenewworldorder.html", "timestamp": "2023-04-25 17:06:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.sheepkillers.com/thenewworldorder.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "New World Order", "cleaned_text": "President George Bush in a speech to Congress on SEPTEMBER 11, (9/11) 1990, SAID THIS: \"[The war in Iraq is] a rare opportunity to move toward an historic period of cooperation. Out of these troubled times...a New World Order can emerge.\"\n\n\n\n\n\nIn his September 21, 1992 speech to the United Nations, President George Bush announced that foreign troops, would occupy America and train for a New World Order Army. He stated:\n\n\"Nations should develop and train military units for possible U.N. peacekeeping operations. ... If multinational units are to work together, they must train together. ... Effective multinational action will also require coordinated command & control and inter-operability of both equipment and communications.\" New World Order and E.L.F. Psychotronic Tyranny\n\n\n\nGeorge Bush, Sr.'s speech set the stage for the events that would occur exactly 10 years later. He had also carefully groomed his son to be in office when this terrible attack on America would take place. Now take a look around you. Understand what you have lost since the Patriot Act, Homeland Security and everything else has been put into effect since September 11, 2001. Is it all a coincidence? We don't think so. 9/11 was an inside job!\n\n\n\nCLICK HERE to watch more videos connecting the Bush family to this \"big idea\" of a New World Order and the total enslavement of the human race.\n\nPerhaps the best way to relate a brief history of the New World Order, would be to use the words of those who have been striving to make it real throughout the ages. You will be amazed at how far back this grand plan has extended, and how many similarities there are in early Century 21 compared to the 1990's, with two Presidents from the Bush family in power.\n\n\n\nCLICK HERE for a 100 year timeline depicting the Creation of the New World Order.\n\n\n\nEducate Yourself! on the New World Order: http://www.theforbiddenknowledge.com/hardtruth/newworldindex.htm\n\n\n\nWatch :\n\n\n\nWatch NWO - From the Mouths of the Elite :\n\n\n\nWatch The Illuminati and the New World Order :\n\nWatch The All Seeing Eye of the New World Order :", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.theforbiddenknowledge.com/hardtruth/nwo_elf_tyranny.htm", "http://www.sheepkillers.com/the911conspiracy.html", "http://video.google.com/videosearch?hl=en&q=Bush+%2B+New+World+Order&oe=UTF-8&um=1&ie=UTF-8&sa=N&tab=wv&oi=property_suggestions&resnum=0&ct=property-revision&cd=1", "http://www.threeworldwars.com/nwo-timeline1.htm", "http://www.theforbiddenknowledge.com/hardtruth/newworldindex.htm", "http://www.google.com/search?hl=en&q=New+World+Order", "http://www.statcounter.com/", "http://video.google.com/videosearch?hl=en&q=New+World+Order&oe=UTF-8&um=1&ie=UTF-8&sa=N&tab=wv&oi=property_suggestions&resnum=0&ct=property-revision&cd=1", "http://educate-yourself.org/nwo/"], "authors": [], "publish_date": null}