{"result_id": "270014", "URL": "http://www.sheepkillers.com/sitedisclaimer.html", "timestamp": "2023-04-25 17:06:52 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "", "canonical": "http://www.sheepkillers.com/sitedisclaimer.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "Site Disclaimer", "cleaned_text": "WE AT SHEEPKILLERS.COM ARE NOT LAWYERS, DOCTORS, CPAs, REPRESENTATIVES OR ENROLLED AGENTS LICENSED TO PRACTICE BEFORE THE IRS, THE U.S. GOVERNMENT OR ANY OTHER ORGANIZATION. WE ARE SIMPLY AMERICAN CITIZENS WHO HAVE TAKEN THE TIME TO STUDY THE FACTS, WRITTEN LAWS AND OBSERVABLE EVIDENCE FOR THE TOPICS PRESENTED HERE. WE ARE CONCERNED ABOUT THE MISINFORMATION COMMONLY PUT FORTH BY OUR GOVERNMENT AND OTHERS WHICH IS GENERALLY ACCEPTED BY THE AVERAGE AMERICAN CITIZEN.\n\n\n\n\n\nPlease note that the information contained on this site is offered for EDUCATIONAL PURPOSES ONLY. It is not intended to give you legal, medical, tax or financial advice, nor is it intended to lead you into any particular course of action. \n\n \n\n\n\nSince ignorance of the law is no excuse, the responsibility of each citizen is to know and understand the Law for him/herself, and then act upon that knowledge. Any actions you may take as a result of discoveries obtained from this site will be understood to be of your own volition.\n\n \n\n\n\nIf you need medical, legal or tax advice, we suggest you seek the services of competent, licensed professionals (assuming that you can find one!). One must have a license in order to give legal advice. However, one does not need a license to show a fellow Citizen the law. \n\n \n\n\n\nWe do not advise anyone on whether or not they should or should not take medication or are required to file Income Tax returns or pay taxes. If, in your pursuit of understanding any of the topics you will find on this site, you decide to take a particular course of action, that is your sole decision and responsibility. If, as a result of reading the tax laws, you determine the law does not require you to file and therefore decide to stop filing tax returns (as many we know have) or legally quit the social security program, that is entirely your decision as well.\n\n \n\n\n\nNo \"guru\" or other purveyor of \"silver bullets\" can take one iota of responsibility for you. We emphasize this point since anyone who learns that they have been defrauded through any means or has been the unwitting victim of a \"sting\" (such as having illegally enforced taxation or otherwise) typically experiences emotions of betrayal and sometimes rage. Such an individual upon learning \"The Truth\" may be prone to impulsive and possibly premature action, such as latching on to whatever guru happens to be advocating the protest movement of the month or worse, becoming violent toward our government, military, public institutions and/or their officials. For this reason, we advise caution in viewing the many topics listed on this site. \n\n \n\n\n\nWe'd like to state that are not \"tax protestors\". We have absolutely no objection to or argument with the taxing statutes and regulations as they are currently written. Neither do they apply to the citizen living in the United States of America and working within the fifty States of the Union. We pay the legally due taxes as the constitution allows. To comply with actions that counter the constitution is to commit treason and we have taken an oath to defend our constitution against ALL enemies, foreign AND DOMESTIC. We happen to believe the IRS is a domestic enemy, among many others. Our Constitution and the Freedom this country was founded on are what we are sworn to protect, serve and defend. \n\n \n\n\n\nWe believe that all men (and women) are created equal. We believe in the fair and just treatment of all people living on this planet and oppose those who seek to harm, destroy or rob liberty from the innocent and/or helpless.\n\n \n\n\n\nWe believe that there is a need for a limited, central government as called for by the Founding Fathers and circumscribed within the Constitution; that no man, including those in government, is ABOVE the written Law; that the government in meeting its needs for revenue as well as in all other matters must adhere to the Law just as \"We The People\" must; that the government has the authority to collect all lawfully imposed taxes pursuant to the rules and restrictions pertaining to direct and indirect taxes as prescribed in the Constitution, but has NO authority to exceed those mandates. \n\n \n\n Hopefully you, as a public servant to the People, agree. \n\n \n\n\n\n\n\n \n\n \"In questions of power, then, let no more be said of confidence in man, but bind him down from mischief by the chains of the Constitution\".", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.savingsheep.com", "http://www.sheepkillers.com/abolishtheirs.html", "http://www.savingsheep.com", "http://www.statcounter.com/"], "authors": [], "publish_date": null}