{"result_id": "270009", "URL": "http://www.sheepkillers.com/impeachobama.html", "timestamp": "2023-04-25 17:06:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.sheepkillers.com/impeachobama.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "Impeach Obama?", "cleaned_text": "Here are just a handful of the high crimes and misdemeanors committed by Barack Hussein Obama.\n\n\n\nHe lied to the American people when he said we could keep our private insurance, knowing full well that his legislation would inevitably drive private insurers out of business.\n\n\n\nGerald Walpin, Inspector General of the Corporation For National and Community Service investigated Kevin Johnson, a big buddy of the president, for misuse of funds from an AmeriCorps grant. Whereupon Obama vindictively fired Walpin to cover for Johnson. A subsequent investigation vindicated Walpin's judgment in the matter.\n\n\n\nBarack Hussein Obama has overseen the effective takeover by government of banks, the largest insurance company (AIG), and General Motors (GM) and Chrysler... the bulk of the U.S. auto industry, thus depriving bondholders, shareholders, and others of their property.\n\n\n\nBarack Hussein Obama is actively pursuing cap-and-trade legislation. Instead of taxing the very air we breathe, it would instead, in a manner of speaking, tax the air we exhale and give the government unprecedented control over the economy and American businesses.\n\n\n\nBarack Hussein Obama is running up our debt at an alarming rate. In just 9 months since Obama assumed office, our National Debt has gone up by over a trillion dollars. To put that figure in perspective, it took George W. Bush 8 years to add 4.8 trillion to the National Debt.\n\n\n\nAnd, to add insult to injury, we're printing money like it's going out of style. The effect will be hyper-inflation, a crippling of our economy and, quite possibly, personal hardship on a scale that has not been experienced since the Great Depression.\n\n\n\nBarack Hussein Obama has appointed countless \"Czars\" to oversee everything from the closing of Guantanamo to the food we eat. These Czars don't have to be approved by the Senate. The Czars have unprecedented power and report only to Obama. Members of both parties are disturbed by these extra-Constitutional excrescences.\n\n\n\nSenator Robert Byrd said: \"The accumulation of power by White House staff can threaten the Constitutional system of checks and balances.\" Congressman Jack Kingston called the Czars a \"parallel government.\"\n\n\n\nAnd finally, Obama has consistently refused to approve the release of his actual birth certificate, college transcripts and his medical records.\n\n\n\nAnd these matters only scratch the surface.\n\nIt's almost as if Obama is intentionally trying to destroy the country. \n\n\n\nBarack Hussein Obama has said that America is not a Christian nation, on countless occasions, despite surveys that find a whopping majority say the contrary.\n\n\n\nIn his book, The Audacity of Hope, he wrote of Muslims and Arabic immigrants: \"... I will stand with them should the political winds shift in an ugly direction.\"\n\n\n\nWhen he spoke at Georgetown University, a Catholic institution, the White House insisted that the name of Jesus, be covered. Georgetown complied.\n\n\n\nIn 2006, he said; \"Whatever we once were, we are no longer a Christian nation.\" He went to Egypt and said, \"You might say that America is a Muslim nation.\"\n\n\n\nWhy go to such lengths to deny the Christian heritage of the United States?\n\n\n\nSurely Barack Hussein Obama knows that our personal liberties flow directly from our Christian heritage... that there is no surer way to destroy our republic than to deny that heritage.\n\n\n\nPresident Thomas Jefferson: \"God who gave us life gave us liberty. Can the liberties of a nation be secure when we have removed a conviction that these liberties are the gift of God?\"\n\n\n\nPresident Andrew Jackson called the Bible; \"the Rock upon which our republic rests.\"\n\n\n\nPresident John Adams said; \"We have no government armed with power capable of contending with human passions unbridled by morality and religion.\"\n\n\n\nPatrick Henry said, \"It is when a people forget God, that tyrants forge their chains.\"\n\n\n\nGeorge Washington, in his Farewell Address said; \"Of all the dispositions and habits which lead to political prosperity, religion and morality are indispensable supports.\"\n\n\n\nAlexis de Tocqueville, in Democracy in America, wrote extensively on the relationship between the Christian religion and liberty in American: \"America is great because she is good. If America ceases to be good, America will cease to be great.\"\n\n\n\nIt's enough to make one wonder... does Barack Hussein Obama realize that every stab he takes at the Christian heritage of this great nation is a blow to the very foundation of our nation... a blow to freedom our personal liberty?\n\nDoes he simply hate Christianity... does he hate the United States... or both? \n\n\n\nBarack Hussein Obama simply hasn't denied the Christian heritage of this nation. He has used his presidency to bad-mouth America itself at every turn.\n\n\n\nHe said, \"America has been arrogant.\" thus giving our enemies and our allies every reason to believe that we are less resolved to defend ourselves and hence more vulnerable to attack.\n\n\n\nFollowing his inauguration, he ordered Gitmo closed, within a year, despite the fact that it was (and is) the best possible facility for detaining terrorists.\n\n\n\nHis first presidential phone call was to Mahmoud Abbas, leader of the Fatah Party in the Palestine territory. According to press reports he told Abbas; \"This is my first phone call to a foreign leader and I'm making it only hours after I took office.\"\n\n\n\nHis first one-on-one TV interview was not with NBC or ABC, but with Al Arabiya, where he said: \"My job to the Muslim world is to communicate that the Americans are not your enemy. We sometimes make mistakes. We have not been perfect.\"\n\n\n\nHe immediately issued an Executive Order halting military commissions which resulted in charges being dropped against Abd al-Rahim al-Nashiri, the animal accused of planning numerous terrorist attacks against Americans, including the USS Cole bombing in which 17 U.S. sailors died.\n\n\n\nWhile treating the Queen of England with casual familiarity, he obsequiously bowed from the waist to King Abdullah of Saudi Arabia, leader of a Muslim nation that won't permit Christian worship within its borders... under penalty of death.\n\n\n\nAre Obama's denunciations of America, in words and deeds, simply faux-pas or do they show, as Tammy Bruce said, \"malevolence toward this country, which is unabated.\"\n\n\n\nDoes it really matter?\n\n\n\nBarack Hussein Obama's words and actions clearly rise well beyond the level of \"bad behavior\" and our Founding Fathers left us a remedy for presidents guilty of bad behavior.\n\n\n\nThe Obama presidency is the disease; Article II, Section 4 of the Constitution, is the cure.\n\n\n\nYou can join us by using the sign-up button below to read and then add your name to the Articles of Impeachment we've drawn-up against Barack Hussein Obama.\n\n\n\nIf, after reading the Articles of Impeachment against Barack Hussein Obama, you agree that action must be taken now, all you have to do to join our growing network of patriotic Americans is add your name (which will remain on our secure form and be kept in the strictest confidence until the time is right) to the Articles of Impeachment against Barack Hussein Obama.\n\n\n\nThat's all there is to it. Be among the first to join this growing nationwide movement and help us spread the word far-and-wide. Together, we can take back our country before it is too late.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "object", "provider": "youtube", "width": "520", "height": "300", "embed_code": "<object width=\"520\" height=\"300\"><param name=\"movie\" value=\"http://www.youtube.com/v/eAaQNACwaLw&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/eAaQNACwaLw&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"520\" height=\"300\"/></object>&#13;", "src": "http://www.youtube.com/v/eAaQNACwaLw&hl=en&fs=1&color1=0x2b405b&color2=0x6b8ab6"}, {"embed_type": "object", "provider": "youtube", "width": "520", "height": "300", "embed_code": "<object width=\"520\" height=\"300\"><param name=\"movie\" value=\"http://www.youtube.com/v/jhJ8Pe2QO7o&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/jhJ8Pe2QO7o&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"520\" height=\"300\"/></object>&#13;", "src": "http://www.youtube.com/v/jhJ8Pe2QO7o&hl=en&fs=1&color1=0x2b405b&color2=0x6b8ab6"}, {"embed_type": "object", "provider": "youtube", "width": "425", "height": "344", "embed_code": "<object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/sm6AAe-xWgI&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/sm6AAe-xWgI&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"/></object>&#13;", "src": "http://www.youtube.com/v/sm6AAe-xWgI&hl=en&fs=1&color1=0x2b405b&color2=0x6b8ab6"}, {"embed_type": "object", "provider": "youtube", "width": "425", "height": "344", "embed_code": "<object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/FTwmhEjvYjg&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/FTwmhEjvYjg&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"/></object>&#13;", "src": "http://www.youtube.com/v/FTwmhEjvYjg&hl=en&fs=1&color1=0x2b405b&color2=0x6b8ab6"}, {"embed_type": "object", "provider": "youtube", "width": "425", "height": "344", "embed_code": "<object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/eCTR1Gzu62A&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/eCTR1Gzu62A&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"/></object>&#13;", "src": "http://www.youtube.com/v/eCTR1Gzu62A&hl=en&fs=1&color1=0x2b405b&color2=0x6b8ab6"}, {"embed_type": "object", "provider": "youtube", "width": "425", "height": "344", "embed_code": "<object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/60kfViVu5PY&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/60kfViVu5PY&amp;hl=en&amp;fs=1&amp;color1=0x2b405b&amp;color2=0x6b8ab6\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"/></object>", "src": "http://www.youtube.com/v/60kfViVu5PY&hl=en&fs=1&color1=0x2b405b&color2=0x6b8ab6"}], "links": ["https://fs7.formsite.com/C4Strategies/form525868054/secure_index.html", "http://impeachobamastore.us/main.sc", "http://www.impeachobamacampaign.com/", "http://www.thepetitionsite.com/3/impeach-obama", "http://www.obamaimpeachment.org/", "http://impeachobamatoday.blogspot.com/", "http://impeachobamastore.us/main.sc", "https://fs7.formsite.com/C4Strategies/form525868054/secure_index.html", "https://fs7.formsite.com/C4Strategies/form525868054/secure_index.html", "https://fs7.formsite.com/C4Strategies/form525868054/secure_index.html", "https://fs7.formsite.com/C4Strategies/form525868054/secure_index.html", "https://fs7.formsite.com/C4Strategies/form525868054/secure_index.html", "https://fs7.formsite.com/C4Strategies/form525868054/secure_index.html"], "authors": [], "publish_date": null}