{"result_id": "270023", "URL": "http://www.sheepkillers.com/avianflu.html", "timestamp": "2023-04-25 17:06:55 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "", "canonical": "http://www.sheepkillers.com/avianflu.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "Avian Flu", "cleaned_text": "This Intelligence Report Could Save Your Life. \n\n\n\nSee also:\n\nwww.GlobalHealthFreedom.org \n\nwww.HealthFreedomUSA.org\n\nwww.NaturalSolutionsFoundation.org \n\nwww.Organics4U.org\n\nwww.NaturalSolutionsMarketplace.org\n\nHEALTH FREEDOM INFORMATION YOU NEED\n\nPLEASE FORWARD THIS PAGE AS WIDELY AS POSSIBLE\n\n\n\nWHEN WE MADE INFORMATION ABOUT WEAPONIZED AVIAN FLU AVAILABLE,\n\nASTONISHING THINGS HAPPENED. READ ON\n\nIn the past when we have published information that \"Someone\" does not want you to know, our site has been hacked or even knocked off the internet, usually by a Distributed Denial of Services, or DDOS attack.\n\nWhile it is immensely frustrating to be shut down at the exact moment that we are getting important information out to you, we have come to recognize it as a signal that we have, once again, hit the bull's eye! This time, not only were our sites, www.HealthFreedomUSA.org and\n\nhit with a DDOS, but the super high security server which we switched to after the last DDOS attack was taken down. The whole system was knocked off line. I am flattered.\n\nThe last time we got hit with a DDOS was when we wondered aloud if the vast numbers of deaths caused by PROPERLY USED pharmaceuticals might, in fact, not be accidental. We asked whether the approval of dangerous and deadly drugs might be intentional and BANG! we were off line faster than you could say \"Population Control\" (6 syllables) or even \"Genocide\" (only 3 syllables)!\n\nTHEN, SOME POSSIBLE CONFIRMATIONS\n\nIt would appear that we are right on target.\n\nJust prior to 9/11, there were some very interesting trends in the stock market which looked very much like somebody knew what was coming and positioned themselves to make a good deal of money when it did happen.\n\nPossible Confirmation No. 1 is contained in the following email which a supporter sent us today:\n\n\"Prior to receiving the intel from Rima and Bert regarding the purchase of vaccines for a pandemic virus that does not yet exist, I had separately been noting unusual, unexplainable activity in the the BIOTECH sector of the stock market. While the general stock market has been crashing, the Biotech sector has rallied very sharply to new highs.\n\nToday the BBH Biotech Holders is up 7 percent (a very large move) on big volume to new highs while the general market declines. There is no overt news on the sector or any particular company to account for this surge. A dramatic rise began in late June/early July. Interestingly, there is a negative divergence with the DRG, which is the Pharmaceutical sector, which is declining. This means the market is specifically interested in BIOTECH STOCKS and not general medical - pharmaceutical issues. The chart of Merck looks worse than the DOW.\n\nWe may recall that unusual market activity was a tell tale sign prior to the 911 false flag [attack - REL]. I have been studying the Oil market as well and it has been telegraphing the attack on Iran in the same way. [Emphasis added - REL]\"\n\nIf this pattern does, indeed, foreshadow a pandemic disaster event, the names of those who participated in this stock market frenzy for biotech stocks should be investigated closely for possible criminal activities.\n\nPossible Confirmation No. 2 comes from the news today of hysteria management in the House of Lords. Desperate cries of \"Save us! Give us the miracle vaccine!\" are what is inevitable, not a pandemic flu - unless it is released on the population -- or injected in a vaccine.\n\nA member of the Natural Solutions Foundation Advisory Board notified us today about a story that appeared today, two days after we sent out the information about the weaponization of Avian flu and the scheduled delivery of 100 million \"vaccine\" doses by Sanofi-Pasteur from China to the US next month. In a story whose headline reads: \"World warned over killer flu pandemic!\", Ben Russell writes in the Independent (London), on July 21, 2008 that,\n\n\"The world is failing to guard against the inevitable spread of a devastating flu pandemic which could kill 50 million people and wreak massive disruption around the globe, the Government has warned....\n\n\"The Government's evidence appeared in a highly critical report from the Lords Intergovernmental Organisations Committee, which attacked the World Health Organisation (WHO) as \"dysfunctional\" and criticised the international response to the threat of an outbreak of disease which could sweep across the globe... The report called for a fundamental overhaul of the WHO's regional offices around the world. \"Given the threats to global health that we face from newly emerging infectious diseases, a dysfunctional organisational structure within the world's principal policy-making, standard-setting and surveillance body simply cannot be afforded.\"\n\n\"The Government said: \"While there has not been a pandemic since 1968, another one is inevitable.\" Ministers said it would could kill between two and 50 million people worldwide and that such an outbreak would leave up to 75,000 people dead in Britain and cause \"massive\" disruption...\"\n\n\"The House of Lords appears to be preparing the population for inoculation as a positive measure: \"While much progress has been made in the past 10 years in improving global surveillance and response systems, much remains to be done if we are to detect new strains of the virus and counter them before they have had the chance to spread....\n\nA government briefing given to the committee warned: 'Not all countries have the resources or capacities to put in place a seasonal influenza vaccination policy and, in the event of an influenza pandemic, it is also recognised that current stock will not meet world-wide demand.[Italics added. This is seriously flawed logic: seasonal flu vaccines have precious little effect against seasonal flu and NONE against the supposedly not-yet-pandemic variety of the H5N1 virus. It is impossible to make a vaccine for a virus which does not exist - REL]...\n\nThere needs to be an improvement to rapid response strategies in poorer, more vulnerable, countries. [Read: forced vaccination - REL]....\n\nNorman Lamb, the Liberal Democrats' health spokesman, likened the threat from a pandemic to the threat of international terrorism. [Emphasis added - REL] ... 'Globally there has been massive attention to the threat from terrorism and rightly so. But the potential for loss of life from a pandemic is massive, enormous and yet we stare a disaster in the face and we see a chaotic, uncoordinated and incoherent international response to it'.\"\n\nhttp://tinyurl.com/6bcagj\n\n \n\nClearly, international pressure for a miracle \"fix\" -- a vaccine, is mounting. How very convenient!\n\nThe information in this Health Freedom eAlert blast is so important that we are sending it out again to give more people a chance to open it and pass it on.\n\nBefore you get too engrossed, let me remind you that serious, courageous and leading edge sources of information are few and far between in this era of managed news and hysteria. The Natural Soluitons Foundation is that serious, courageous and forward thinking news source for information that comes to you first through the Health Freedom eAlerts. Make a recurring, tax deductible\n\nand help keep the beacon of truth broadcasting. It's really up to us, you know. Rupert Murdoch is not going to help so we have to do it ourselves!\n\nHere is the information you may have missed that apparently is right on the mark. I hope our Estimate of Situation is wrong. If it is right, you need to be prepared by getting ready to take the steps at the end of this blast.\n\nWhat I Have To Tell You Is Not Comfortable or Pretty.\n\nBut this Report Could Save Your Life,\n\nEspecially the Action Steps at the end of this Report & Video.\n\nDr.Laibow's Blog and Video Report on the Avian Flu Threat:\n\n\"The most dangerous man to any government is the man who is able to think things out... without regard to the prevailing superstitions and taboos. Almost inevitably he comes to the conclusion that the government he lives under is dishonest, insane, intolerable.\"\n\n - H L Mencken\n\n\"No country and no people can be free and ignorant at the same time.\"\n\n - Thomas Jefferson\n\n\"The only safe vaccine is the one that is never used.\"\n\n - James Shannon\n\n Former National Institutes of Health (NIH) Director\n\nThis Natural Solutions Intelligence Report Could Save Your Life.\n\nOr you can ignore it, but that choice might kill you. It's your choice. The tale which you need to hear is a long, complicated one, winding its way from China to France by way of the First World War, Rockefeller's Oil Cartel, Sanofi-Pasteur and Iraq to its final destination: A syringe full of something claiming to be a vaccine against the now-deadly Avian Flu imported from China and filled in a plant in the US. Filled with what? Nothing good. This is not a story to be told in a few brief paragraphs.\n\n \n\nIt is long and complicated but I urge you to read it and then to take the steps listed and please, SHARE THIS INFORMATION AS WIDELY AS POSSIBLE.\n\nAvian Flu Has Already Been Weaponized\n\nI'll give you the bottom line first: based on Gen. Stubblebine's careful analysis of the existing evidence, Avian Flu has already been turned into a pandemic virus with a lot of sophisticated help from people who are not your friends, but who are very good at weaponizing organisms, like the previously innocuous bird flu virus, H5N1.\n\n \n\nThere is a basic virological fact you need to know to make sense of what comes next: it is impossible to make a vaccine against a virus that does not yet exist. Public relations efforts to the contrary, IF a vaccine is being made against the Avian Flu virus in its pandemic form, that means that the pandemic virus already exists. Period. End of discussion. So that fact that the Avian Flu vaccine is already being manufactured in China by Sanofi-Pasteur, a wholly-owned subsidiary of the French arm of the Rockefeller oil cartel (Total Petroleum) is confirmation of what you are about to read. If you allow it to be introduced into your body, there is no reason to imagine it will be anything but an unmitigated disaster for your immune system and for you. We believe it's planned to be that way.\n\n \n\nI do not know A. True Ott, PhD, but he was kind enough to send me a PDF file recently in which he puts a lot of the pieces together that I have been finding in my own research. Some of his conclusions I have serious difficulty with, but parts of his chronology are used here with appreciation.\n\n \n\nLet's start with the basics: H5N1 is a benign, commonplace virus which most birds carry with no harm to themselves or humans. Humans also have viruses we have no problem with: these viral companions keep our immune systems healthy and humming. Only under the stimulus of novel and dangerous toxins which your body has no way to get rid of (detoxify), and stress which overwhelms your coping capacity, does an innocuous virus mutate and become something that can make you sick or kill you.\n\n \n\nAll human cases of H5N1 have occurred in areas of sick birds in large concentrations such as factory farms where handlers come into contact with stressed and sick birds in toxic surroundings where toxic residues are concentrated at high levels.\n\n \n\nFor example, in Vietnam, where thousands of gallons of Monsanto chemicals such as Agent Orange were dumped in huge amounts following the Vietnam war outbreaks of Avian Flu are not uncommon. These outbreaks occurred in highly toxic environments, where crowded, sick factory farm chickens have been inoculated [supposedly] against Avian Flu.\n\n \n\nIt will also become deadly, of course, when labs are employed to alter it so that it becomes an efficient weapon of mass destruction. The US has had a program to accomplish exactly that for over a century now, astounding as that may seem!\n\n \n\nOur best intelligence estimate is that pandemic Avian Flu already exists. It appears to have been turned into a massive viral threat through bioengineering by the United States, fusing the deadly genome of the 1918 Pandemic, mis-named the \"Spanish Flu\", with the DNA of the H5N1 virus in a growth medium of human kidney cells to make sure that the virus recognizes human cells and knows how to invade them.\n\n \n\nPlease re-read that paragraph again and consider the threat that poses to you and your family.\n\nThe genome of the 1918 pandemic so-called \"Spanish Flu\" was recently intentionally resurrected. Because of that resurrection, the Avian Flu, and its vaccine, are now a US government-instigated threat to life - your life.\n\nThe Spanish Flu, which was not Spanish at all, was created in the US through an early bioweapons program and injected into healthy young men (i.e., 'soldiers') as the first mandatory vaccination in the military during WWI (also known as the \"War to End Wars\" and the \"Great War\"). The \"Spanish Flu\", which originated in Kansas on US Military bases, killed about 50 million people world-wide including about 650,000 Americans. It was one of the deadliest pandemics in modern history. It was also one of the most successful biological weapons ever created.\n\nThis may be one of the most important chronologies you will ever read:\n\n* US declares war on Austria-Hungary, Bulgaria, Germany, and the Ottoman Empire. \n\n * America swings into full production of War material. \n\n * American men are drafted into military service and deployed for training in Spain\n\n * ALL NEW RECRUITS ARE GIVEN MANDATORY VACCINATIONS --- One of which is a \"broad-spectrum\" live virus influenza vaccination\n\n * Rockefeller makes millions in vaccine sales while consolidating Standard Oil contracts worldwide\n\n * The first British soldiers committed to World War I are deployed to Iraq to protect American oil interests there \n\n * Following mass vaccine injections, U.S. soldiers are crowded into troop ships and sent to \"train\" in Spain. Seasick, stressed soldiers aged 18-34 exhibit influenza symptoms on the voyage\n\n * Immediately after arriving in Spain, U.S. soldiers are \"trained\", that is, exposed to, the various forms of gas they will experience in the trenches in France\n\n * Exposure to these highly toxic gases causes the live-virus influenza organisms to mutate into an extremely lethal, and highly communicable, form of virus\n\n * Millions of young, healthy men and women aged 18-34 die worldwide as a result of vaccinations combined with novel and highly toxic chemicals\n\n* Armistice with Germany and its Allies\n\n* Following the end of \"The Great War\" - The heads of the various multi-national banks met in conference at San Remo in 1924 to assess war reparations for Germany\n\n* The Rockefellerd and the Rothschilds consolidated and vastly increased their wealth through actively funding both sides of the war\n\n* Rockefeller formes a French oil conglomerate calling it \"Total\", the \"French Company of Petroleums\" aka CFP\n\n * TOTAL is awarded a controlling interest via Deutsche Bank's stock in the Turkish Petroleum Company in Baghdad which was eventually renamed the Iraq Petroleum Company\n\n * The Iraq Petroleum Company was confiscated and nationalized by Saddam Hussein in 1990.\n\n * TOTAL Inc. is a true multi-national mega-corporation which operates in more than 130 countries and has over 110,000 employees.\n\nNow the Avian Flu - Oil - China - US - WMD connection starts to get interesting.\n\nHere's the Play: Oil to Drugs to Death\n\nTwo of TOTAL's prime, wholly-owned subsidiaries are the pharmaceutical giants Sanofi-Aventis, and Sanofi-Pasteur. Both are world-leaders in the development and testing of experimental vaccines, which are manufactured primarily in China. On March 23, 2005, NIH, through the National Institute of Allergy and Infectious Disease, announces the initiation of a program to develop a vaccine for Avian Flu, asserting that although there have only been less than a handful of cases, Avian Flu poses a vast public health menace.\n\nAnd it is clearly true that a weaponized virus does present a massive threat to public health. That's the whole point of weaponizing it, isn't it? For a look at Sanofi-Pasteur's plans for its profit (and perhaps your death). You can confirm their plans here:\n\nBut please come back when you finish reading. The information below is critically important to you.\n\nAs a side note, the Chinese factories of these two pharmaceutical mammoths are (unlike Sanofi-Pasteur's Swiftwater, PA, factory, according to dissidents such as Harry Wu, et. al.) staffed in part or entirely by political and other prisoners working under brutal slave labor conditions. China has a long history of Western Pharmaceutical manufacture, according to Wikipedia.\n\nBear in mind that most influenza strains and their hosts adapt to each other after roughly two years, so that the same strain of flu no longer causes symptoms. Of course, once a strain has been weaponized, there is little reason to think that it will revert as natural strains do. It, or the vaccine it seems to legitimize, will go on killing and killing and killing. Or is the word \"culling\"?\n\nTo date, there have only been around 385 human cases identified worldwide (if those identifications are trustworthy, of course), with only 243 deaths. To put the absurdity of this effort into perspective, Sudden Cardiac Death (SCD), which researchers believe is heavily associated with aspartame consumption, is a leading cause of death which, according to the CDC, for example, killed 460,000 Americans in 1999 and the numbers keep rising - http://www.cdc.gov/mmwr/preview/mmwrhtml/mm5106a3.htm. But Aspartame is not under the gun. Instead, Avian Flu is.\n\nTo quote Dr. Ott, \"There are 6.7 Billion humans on planet earth. This equates to a statistical infection rate of .000000004215 percent. In other words, statistically speaking, you are over 100,000 times more likely to be hit by lightning in your home than to contract the \"Bird Flu.\"\n\nGiven the shockingly obvious lack of a real threat from an unweaponized H5N1 virus, how can we explain the Bush Administration spending billions of dollars preparing each of the 50 States for what it drums into us is the \"inevitable Bird Flu pandemic\" anticipated to kill half or more of all Americans and similar numbers of people around the globe?\n\n* Zero confirmed \"H5N1\" human cases exist anywhere in the word\n\n * The U.S. Armed Forces Institute of Pathology, Ft. Detrick, Rockville, Maryland, the US research center for biological weaponry, commissions Dr. Jeffery Taubenberger to lead a research team to ISOLATE the 1918 Flu Virus' genetic code, the most lethal pathogen in history\n\n* Brevig, Alaska. Research Team member Johan Hultin sends well-preserved 1918 flu virus specimens (from a frozen body killed by the 1918 flu) to Dr. Taubenberger's lab in Maryland. \n\n * Days later, Taubenberger detects the genetic fragments for which he has been searching.\n\n * The 1918 virus' RNA-based gene fragments are analyzed by computer sequencing in order to reveal its complete genetic code. Even with a super-computer, this code sequencing will take years to complete.\n\n* Taubenberger's team finally deciphers the deadly 1918 flu virus' entire genetic code - completing a 6 year project.\n\n * Taubenberger's colleague, R.G. Webster, publishes article in American Scientist Magazine declaring: \"The world is teetering on the edge of a flu pandemic that could kill a large fraction of the human population\".\n\n* Dmtry Lvov, head of the Russian Virology Institute declares that up to one billion people around the world could die during the next pandemic.\n\n* At Mount Sinai School of Medicine in New York (alleged to be Rockefeller controlled), Taubenberger,Peter Palese and Adolfo Garcia-Sastro create plasmids, or DNA rings, from the 1918 killer virus, permanently \"stabilizing\" its genetic material for use as a biological weapon\n\n * This is the final step in revitalizing the deadly pathogen but the press is told tit will only to be used as a \"vaccination tool\" - even though the disease is currently non-existent.\n\n* Taugenberger's team inserts plasmids into human kidney cells which then transfers human DNA into the virus making it \"human specific\"\n\n * The 1918 virus, responsible for the death of millions around the world is now ready for use by humans\n\n* The UN in New York City issues a world-wide press release introducing David Nabarro as the \"UN System Senior Coordinator for Avian, Human Influenza\".\n\n* Nabarro issues an \"Official U.N. Warning\" that \"an outbreak of 'avian influenza' would kill between 5 million and 150 million people on each continent.\"\n\n* Pres. Bush's newly appointed secretary of Health and Human Services (HHS, the parent organization of both the CDC and the FDA), former Utah Governor Mike O. Leavitt, intensifies multibillion Pandemic Bird Flu preparations\n\n* Bush solicits Congress for $7.1 Billion to fund \"preparations\" --- $3.3 billion is immediately allocated to Leavitt's HHS\n\n* Department of Homeland Security awards KBR, a Halliburton subsidiary, a $385 million contract for US detention centers\n\n* Leavitt launches website - www.pandemicflu.gov - on which he says: \"Let me be clear. It is only a matter of time before we discover H5N1 in America. The migration patterns of the wild fowl that carry the virus makes it appearance here almost inevitable!\"\n\n* China hosts the \"International Pledging Conference on Avian and Human Influenza\" in Beijing and is promised massive sums of money from the west --- Leavitt alone commits $334 million in funds to aid China's research into \"vaccine development\". \n\n * Leavitt has a long history of fostering Chinese trade activities as Utah's Governor\n\n* Breaking new ground, Leavitt's HHS allocates funds to a private television network to produce a \"made-for-TV\" movie about the \"bird flu\"\n\n * Leavitt jokes that he wants \"the handsomest actor\" to play his character\n\n* Leavitt declares on HHS website (exactly as John D. Rockefeller declared in 1916): \"The best defense against influenza is VACCINATION.\" \n\n * Leavitt further declares: \"The current U.S. capacity for manufacturing egg-based vaccines is not sufficient to supply our entire population. HHS is supporting research into [human kidney] cell-based vaccine manufacture of producing vaccine domestically\n\n* HHS announces a $97 million contract for the development of cell-based flu vaccine.\n\n * Leavitt declares: \"The FDA can use its Emergency Use Authorization authority to permit the use of unapproved products if there's a reasonable belief the products may be effective.\"\n\n * 32 states pass laws which make resisting inoculation once ordered by the governor a felony.\n\n * These laws join Patriot Act I, II, BARDA, BIOSHIELD I, II in making drug treatment and innoculation mandatory once a Pandemic is called.\n\n * Unlimited quarantine without review is mandated under these laws for those who resist innoculation under Pandemic conditions.\n\n * Fully staffed, empty detention centers exist all over North America. The largest, in Alasks, is roumored to have a 2.5 million person capacity.\n\n* New York Times reports Gulf War Syndrome positively linked to vaccination of Veterans.\n\n * More than 100,000 vets contracted the syndrome during the 1991 Desert Storm Operation.\n\n * More than 20,000 vets have died to date from this syndrome believed to be triggered by squalene, a vaccine \"adjutant.\"\n\n * All modern vaccines contain squalene\n\n* The Food and Drug Administration (FDA) branch of HHS utilizes its Emergency Use Authorization authority and awards a license to produce H5N1 \"Bird Flu\" vaccines to Sanofi-Pasteur.\n\n* FDA Bird Flu approval letter states:\n\n \n\n \"We have approved your Biologics License Application (BLA) for Influenza Virus Vaccine, H5N1, effective this date. You are hereby authorized to introduce or deliver for introduction into interstate commerce, Influenza Virus Vaccine, H5N1, under your existing Department of Health and Human Services U.S. License No. 1725; however, we acknowledge your statement provided in your submission of April 5, 2007, that Sanofi Pasteur Inc. does not intend to license this product for commercial distribution, since it was produced under contract to the U.S. Department of Health and Human Services as part of national pandemic preparedness initiatives. Influenza Virus Vaccine, H5N1, is indicated for active immunization of persons 18 through 64 years of age at increased risk of exposure to the H5N1 influenza virus subtype contained in the vaccine.\"\n\n* Among the required post-market studies on this untested vaccine are;\n\n1. Protocol submission: Study DMID 04-077: \"A randomized, double-blinded, phase I/II, study of the safety, reactogenicity, and immunogenicity of intramuscular inactivated influenza A/H5N1 vaccine in healthy children aged 2 years through 9 years.\"\n\n 2. Final study report submission: September 30, 2008.Study DMID 04-076: \"A randomized double-blinded, placebo-controlled, phase I/II, dose-ranging study of the safety, reactogenicity, and immunogenicity of intramuscular inactivated influenza A/H5N1 vaccine in healthy elderly adults.\"\n\n 3. Study DMID 05-0043: \"Revaccination of healthy subjects with intramuscular inactivated subunit influenza A/Vietnam/1203/2004 (H5N1) vaccine representing a drifted variant.\n\n 4. \"Study DMID 05-0090: \"Evaluation of a booster dose of A/Vietnam/1203/04 (H5N1) vaccine administered at 6 months to healthy adult subjects after a two dose schedule at 0 and 1 month.\"\n\n 5. Study DMID 05-0129: \"Open label evaluation of H5N1 vaccine at vaccine manufacturing facilities.\"\n\n 6. Study DMID 05-0130: \"A single center, open label, phase I/II study of the safety and immunogenicity of two 90 µg doses of intramuscular inactivated influenza A/H5N1 vaccine in healthy adult subjects.\"\n\n* Leavitt's HHS orders 100 million H5N1 \"vaccines [doses]\" from Sanofi-Pasteur. Expected delivery date, August, 2008. \n\n * Sanofi-Pasteur issues a press release announcing their lucrative HHS contract (100 million vaccines @ $15 USD each) and declares that the cell-based vaccine will be mass produced in the company's CHINA facility - then shipped to Stillwater, PA for hypodermic syringe-friendly packaging.\n\n * Approval and contract have all been consummated in the absence of official human testing.\n\n* Covert 'human trials' of Sanofi-Pasteur H5N1 vaccine is conducted on 350 homeless vagrants in Poland. \n\n * According to London Telegraph and Examiner articles, this results in 21 \"instant\" deaths and over 200 severely incapacitated or hospitalized.\" Development and sales of H5N1 vaccine continues.\n\n http://www.telegraph.co.uk/news/worldnews/europe/poland/2235676/Homeless-people-die-after-bird-flu-vaccine-trial-in-Poland.html\n\n* U.S. Air Force Gen. Gene Renuart, commander of North American Aerospace Defense Command and U.S. Northern Command, and Canadian Air Force Lt.-Gen. Marc Dumais, commander of Canada Command, sign a Civil Assistance Plan that allows the military from one nation to support the armed forces of the other nation during a civil emergency.\n\n * \"Our commands were created by our respective governments to respond to the defense and security challenges of the twenty-first century, and we both realize that these and other challenges are best met through cooperation between friends.... The plan facilitates the military-to-military support of civil authorities once government authorities have agreed on an appropriate response.\"\n\n * Avian Flu response is a part of NorthCom's mission, and according to Gen. Stubblebine's analysis, appears to be the primary element in its mission: http://www.northcom.mil/Avian%20Flu/index.html\n\n* Dr. David Nabarro, UN Influenza Coordinator, welcomes a donation of 60 million doses of H5N1 Avian Flu vaccine by Sanofi-Pasteur.\n\n * This adds to the stockpile of a previous donation of 30 million doses by GlaxoSmithKline Dr. Nabarro said that good progress had been made but Avian Flu could still kill as many of 150 million people.\n\n * Avian Flu still entrenched in Viet Nam, Bangladesh, India, Egypt and India [sic] says Dr. Nabarro.\n\n * Outbreaks recorded in 60 more countries according to US Influenza Coordinator.\n\nBut the people who make vaccines are ethical and look out for our best interests don't they? The cold, hard fact is that vaccine makers are neither ethical nor concerned with health and longevity of their recipients.\n\n \n\nRemember: vaccination remains an uninurable risk: no parent, physician or pharmaceutical company can buy insurance against vaccine induced harm. The insurance industry refuses to accept the risk. That's why Congress created the Vaccine Injury Compensation Program that is funded by a special tax added to the cost of each vaccine shot: we pay to protect pharmaceutical company profits.\n\nVaccines can be used for a great deal more than just for what it says on the label. After all, faced with a syringe of fluid, who is to say exactly what is in there and what the intended, or unintended outcomes of being injected will be?\n\nIt takes a huge amount of faith to allow a hypodermic under your skin. That faith is, the Natural Solutions Foundation believes, without significant basis.\n\nShielded by the FDA, vaccine (and drug) manufacturers are immune from prosecution for wrong doing and continue to do wrong with horrifying impunity. That's even BEFORE the Avian Flu weaponization and subsequent vaccine development. A few examples out of many, many will suffice:\n\n* Eli Lilly, makers of Thimerisol, inject the product into 22 people with meningitis who all die. Lilly publishes the \"study\", claiming that Thimerisol, 50% mercury by weight, is safe.\n\n* World Health Organization (WHO) Bulletin No.47 refers to creation of an immune virus and suggests that a useful way to study the effects would be \"to put it into a vaccination program and observe the results.\"\n\n * It is theorized that WHO used the smallpox vaccination program in Central Africa for this study, since the spread of HIV infection coincides precisely with the most intense and recent smallpox vaccination campaigns.\n\n * Information on the Central African countries most infected with HIV precisely matches WHO figures indicating the number of people vaccinated in these areas.\n\n * The virus requested would selectively destroy the T-cell system. (1972 Federation Proceedings of WHO).\n\n* Henry Kissenger writes a classified \"National Security Study Memorandium 2000: Implications of worldwide population growth for U.S. security and overseas interest (NSSM 200)\" which identifies India, Bangladesh, Pakistan, Nigeria, Mexico, Indonesia, Brazil, the Philippines, thailand, Egypt, Turkey, Ethiopia and Columbia as targets for initial population reduction.\n\n * The Philippine Supreme Court found that 3 million Philippinas between 12 and 45 years of age were given this vaccine.\n\n * Native American Woman and Black women in the US received this vaccine.\n\n * Sterility rates in Native American Women in the US is over 35%.\n\n * Sterility rates in Black Women in the US is over 25%.\n\n* No epidemic of Swine flu surfaces despite rapid approval and respone to perceived threat following 1 death of a solder at Ft. Dix, NJ.\n\n * Swine Flu inoculation program shut down after risk of death and polio like syndrome from the vaccination is found to be almost 12 times greater in vaccinated than unvaccinated people. 5% of people afflicted die, 10% are crippled or maimed for life.\n\n* The Times of London reported on its front page that smallpox vaccine administered by the World Health organization had triggered HIV/AIDS.\n\n * 100 Million vaccinated Africans are at risk.\n\n * Areas with highest vaccination rate show highest HIV/AIDS rates.\n\n * Robert Gallo, discoverer of the HIV/AIDS virus, defends those figures and says, \"AIDS researchers will keep their mouths shut because they are paid to do so.\"\n\n* A rider tacked onto the end of the Homeland Security Bill confers immunity from liability prosecution on Eli Lilly and other manufacturers of vaccines.\n\n* Court case reveals that babies in Los Angeles were used as human guinea pigs with a experimental measles vaccine called Edmonston Zagreb high titer measles vaccine (E-Z ). From 1989-1991, Kaiser Permanente and LA County Dep't of Health and CDC injected 700+ \"mostly minority\" babies with unlicensed experimental vaccines with fraudulently-obtained parental consent.\n\n * E-Z is closely associated with increased death rate in infant girls in Sendgal, Guneau Bisseau, and Haiti before their second birthday.\n\n * Most of the families are not aware to date that their child was used as a human guinea pig.\n\n* Dr. David Heymann, head of the office of research for the World Health Organization's Global Programme on AIDS, and Harvard pathology professor William Haseltine refuse to discuss the possibility of AIDS transmission via vaccines.\n\n * Dr. Heymann states in a phone interview from Geneva, \"The origin of the AIDS virus is of no importance to science today. Any speculation on how it arose is of no importance.\" Haseltine is even more adamant. \"It's distracting, it's nonproductive, it's confusing to the public, and I think it's grossly misleading in terms of getting to the solution of the problem. It's over, it's done with, it's very, very, very unlikely it happened that way, and it's another nonsense article. It's the worst kind of reporting as far as I'm concerned.\"\n\n* WHO begins its \"Special Programme\" in human reproduction with programs for both male fertility control through vaccines and female fertility control\n\n* WHO Vaccines for smallpox and tetanus are laced with female reproductive hormones to induce permanent sterility to \"eliminate 150 million excess Sub-Saharan Africans\" according to WHO documents.\n\n* After years of denial, a scientific paper demonstrates conclusively that WHO tetanus vaccines used in the Philipines contained female reproductive hormones, inducing permanent sterility without consent or knowledge of the women treated.\n\n * Tetanus toxoid is linked to the human reproductive hormone to overcome immunological tolerance to the hormone and prod the body of the woman into producing antibodies to her own reproductive hormones.\n\n* Women between the ages of 12 and 45 are targeted for a 5 injection series of \"tetanus\" shots.\n\n * Boys, men, children and older women are not given the shots. \n\n * Tetanus ordinarily requires a single booster every 10 years. \n\n * The 5 shot tetanus protocol is used with vaccines which contained female reproductive hormones to render the women of Tanzania, Nigeria, Nicaragua, Mexico and other countries infertile\n\n * Oxford University Press publishes article titled \"Bypass by an alternate carrier of acquired unresponsiveness to hCG upon repeated immunizations with tetanus-conjugate vaccine' confirming method of inducing sterility requires multiple vaccinations.\n\n* WHO committees more than $356 million on \"reproductive health\" research.\n\n * Funding for abortificant (abortion producing) vaccine comes from many sources.\n\n1. $90+ million contributed by Sweden\n\n 2. $52+ million contributed by Great Britain\n\n 3. $41 million contributed by Norway\n\n 4. $27 million contributed by Denmark\n\n 5. $12 million contributed by Germany\n\n 6. $5.7 million contributed by US\n\n 7. $61 million contributed by UNFPA\n\n 8. $15.5 million contributed by World Bank\n\n 9. $2.5 million contributed by Rockefeller Foundation\n\n 10. $1+ million contributed by Ford Foundation\n\n 11. $716.5 thousand contributed by IDRC (International Research and Development Centre of Canada)\n\n* Observer Newspaper reports Glaxo, Pfizer, Squibb and Genentec experimented on children at Incarnation Children's Center, NY.\n\n * Incarnation Children's Center is run by Columbia University which was paid to experiment on children, mostly wards of the state minority children.\n\n * Babies as young as 6 months were injected with double doses of experimental measles vaccine.\n\n * Children as young as 4 were given multi-drug cocktails.\n\n * More than 100 orphans and babies were used in 36 experiments.\n\n* Haruna Kaita, a pharmaceutical scientists and head of a Nigerian University analyzed the latest WHO vaccine in Indian labs.\n\n * Sterility agents were among the contaminants found in the samples.\n\n * According to the local population of the Akha, a Thai hill tribe, pregnant women are forced to receive the vaccine in order to get ID cards for their children.\n\n * Violent still births and miscarriages result.\n\n\n\nI Told You It Was A Long Story, But One You Needed to Hear.\n\nNow What Can You Do To Protect Yourself and Your Loved Ones?\n\nFirst of all, remember that you have an immune system.\n\n \n\nBack at the beginning of this article I told you that viruses (and bacteria, for that matter), do not make you sick if you are equipped with a healthy immune system and you are non toxic.\n\n \n\nThat means change your eating habits TODAY. The intake of refined sugar, pesticides, fluoridated water and toothpastes, etc., artificial colors, flavors and preservatives and genetically modified foods (found in everything that does not explicitly say \"Certified Organic\") all depress your immune system.\n\n \n\nBuy \"Organic\", wild crafted, food that is locally grown by people you know (and don't assume that just because a field is nearby, the food is not sprayed or genetically modified or both). ASK!\n\n \n\nSo Step One is to alter your diet and make eating for life, not for the moment, your number one food priority. Please, take this seriously.\n\n \n\nStep Two is to harvest and cultivate information. When the Pandemic is about to be released (and, God willing, it will never be), there will be increased propaganda rumblings to \"prepare\" you to submit to the schemes for control and inoculation. Stay in touch with your local community advanced health care advocates (including NSF local organizers, alternative practitioners, health store and food co-ops, etc)... keep your eyes and ears opened and let us know if you come across any information that may help us all.\n\n \n\nThe Natural Solutions Foundation gets information from all over the world. Our friends are inside of corporations and outside of them, inside of governments and outside of them, inside of news media and outside of them. We hear things early and we WILL let you know what we are hearing as soon as we hear it.\n\nThat means that you need to open our emails when you get them and at least skim them. It also means that you should share the fact that there are free Health Freedom eAlerts for which other people need to be watching, as well. They need to be on the list so they can have early warning as well. Send everyone you know this link\n\nand ask them to join the free distribution list. It's very good insurance: it costs nothing but can save lives.\n\n \n\nThere are two other lists you need to join to stay informed and empowered. The first is our powerful and vibrant No-Forced-Vaccines Yahoo Forum at\n\nThe second list is about GM \"foods\". Check out Natural Solutions Foundation's Trustee Ralph Fucetola's most recent blog on the topic,\n\nOrganic foods may be expensive: pandemic diseases and cancer are a lot more expensive. So is forced sterility. So are lethal allergies.\n\nSince Genetically Modified \"food\" is so omnipresent in the food supply and so very dangerous, find out what you can do about it, and how to avoid it, by joining the Natural Solutions Foundation No GMO Yahoo!Group:\n\nStep Three is to develop your \"exit strategy.\" Once the Pandemic drums start beating, it is time to get out of the US until the insanity is past. Where to go? That is a matter of personal decision. If you do not have a passport, you cannot go anywhere. Get one.\n\nIf you do not have a plan, you will not go anywhere. Make one.\n\nCome visit us in Panama, for example, in the lovely Valley of the Moon. Go to some place sane and stay there with your kids while this insanity swirls around. No one knows what the vaccines will contain or what they will do. If you want to play roulette with the intent of the vaccine makers, that is your choice. I have my passport in hand and I will use it. I hope you will, too.\n\n \n\nThe Valley of the Moon: http://www.naturalsolutionsfoundation.org\n\n \n\nStep Four: keep up to date with the Advanced Health Care options that could save your life. Research the potential value of natural remedies such as grapefruit seed extract, colloidal or ionic silver, or immune system boosters like Echinacea. Check our www.Organics4U.org and www.NaturalSolutionsMarketplace.org for some good choices. More will be posted as we continue to enhance these member services.\n\n \n\nWhat's Step Five? To keep us empowered to bring you the information and the options that empower you. That means donating to the Natural Solutions Foundation. Even if you have given before, please give again. Your donations are fully tax deductible. Click here, now, to make your generous recurring donation -\n\nIf you have not given, now would be a good time to do that. Recurring donations of any amount entitle you to membership in the new Health Freedom Heroes Forum along with our local organizers and key advocates. Wouldn't you like to be part of that group?\n\nEvery penny donated to the Foundation goes toward our work. General Bert and I receive not a single cent in payment for the work we do. We do it because we know that it is vitally important and that no one else besides the Natural Solutions Foundation is doing it! We, all of us together, are the single most effective, and largest Health Freedom organization in the world. Thank you for making that possible!\n\n \n\nWe brought this important Health Freedom Intelligence Report to you so you can be aware of the threats to your health and freedom... and being forewarned is, we trust, being forearmed! \n\n \n\nAnd please have Hope; the threats are real, but the solutions are natural...\n\nYours in health and freedom,", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.GlobalHealthFreedom.org", "http://www.HealthFreedomUSA.org", "http://www.NaturalSolutionsFoundation.org", "http://www.Organics4U.org", "http://www.NaturalSolutionsMarketplace.org", "http://www.healthfreedomusa.org/index.php?page_id=187", "http://www.HealthFreedomUSA.org", "http://www.GlobalFreedomUSA.org", "http://tinyurl.com/6bcagj", "http://www.healthfreedomusa.org/index.php?page_id=189", "http://www.healthfreedomusa.org/index.php?p=742", "http://www3.niaid.nih.gov/news/newsreleases/2005/avianfluvax.htm", "http://www.sanofi-aventis.com/Images/060706_IR_en_tcm23-13319.pdf", "http://www.cdc.gov/mmwr/preview/mmwrhtml/mm5106a3.htm", "http://www.pandemicflu.gov", "http://www.telegraph.co.uk/news/worldnews/europe/poland/2235676/Homeless-people-die-after-bird-flu-vaccine-trial-in-Poland.html", "http://www.northcom.mil/Avian%20Flu/index.html", "http://www.haverford.edu/biology/edwards/disease/viral_essays/warnervirus.htm", "http://www.healthfreedomusa.org/index.php?page_id=187", "http://groups.yahoo.com/group/no-forced-vaccination/join", "http://vitaminlawyerhealthfreedom.blogspot.com/2008/07/five-action-steps-to-protect-from-gmos.html", "http://groups.yahoo.com/group/no-genetically-modified-foods/join", "http://www.naturalsolutionsfoundation.org", "http://www.Organics4U.org", "http://www.NaturalSolutionsMarketplace.org", "http://www.healthfreedomusa.org/index.php?page_id=189", "http://www.HealthFreedomUSA.org", "http://www.statcounter.com/"], "authors": [], "publish_date": null}