{"result_id": "270007", "URL": "http://www.sheepkillers.com/georgiaguidestones.html", "timestamp": "2023-04-25 17:06:49 CEST+0200", "meta": {"description": "", "lang": "es", "keywords": "", "favicon": "", "canonical": "http://www.sheepkillers.com/georgiaguidestones.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "Georgia Guidestones", "cleaned_text": "The origin of that strange monument is shrouded in mystery because no one knows the true identity of the man, or men, who commissioned its construction. All that is known for certain is that in June 1979, a well-dressed, articulate stranger visited the office of the Elberton Granite Finishing Company and announced that he wanted to build an edifice to transmit a message to mankind. He identified himself as R. C. Christian, but it soon became apparent that was not his real name. He said that he represented a group of men who wanted to offer direction to humanity, but to date, almost two decades later, no one knows who R. C. Christian really was, or the names of those he represented. Several things are apparent. The messages engraved on the Georgia Guidestones deal with four major fields: \n\n\n\n(1) Governance and the establishment of a world government, \n\n(2) Population and reproduction control, \n\n(3) The environment and man's relationship to nature, and \n\n(4) Spirituality.\n\n\n\nIn the public library in Elberton, I found a book written by the man who called himself R.C. Christian. I discovered that the monument he commissioned had been erected in recognition of Thomas Paine and the occult philosophy he espoused. Indeed, the Georgia Guidestones are used for occult ceremonies and mystic celebrations to this very day. Tragically, only one religious leader in the area had the courage to speak out against the American Stonehenge, and he has recently relocated his ministry. \n\n\n\n\n\n\n\n1. Maintain humanity under 500,000,000 in perpetual balance with nature.\n\n2. Guide reproduction wisely - improving fitness and diversity.\n\n3. Unite humanity with a living new language.\n\n4. Rule passion - faith - tradition - and all things with tempered reason.\n\n5. Protect people and nations with fair laws and just courts.\n\n6. Let all nations rule internally resolving external disputes in a world court.\n\n7. Avoid petty laws and useless officials.\n\n8. Balance personal rights with social duties.\n\n9. Prize truth - beauty - love - seeking harmony with the infinite.\n\n10.Be not a cancer on the earth - Leave room for nature - Leave room for nature. \n\n\n\n\"I want people to know about the stones ... We're headed toward a world where we might blow ourselves up and maybe the globe will not exist ... it's a nice time to reaffirm ourselves, knowing all the beautiful things that are in this country and the Georgia Stones symbolize that. \" \n\n\n\nWhat is the true significance of the American Stonehenge, and why is its covert message important? Because it confirms the fact that there was a covert group intent on\n\n\n\nCertainly the group that commissioned the Georgia Guidestones is one of many similar groups working together toward a New World Order, a new world economic system, and a new world spirituality. Behind those groups, however, are dark spiritual forces. Without understanding the nature of those dark forces it is impossible to understand the unfolding of world events.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.sheepkillers.com/dumbingdepopulation.html", "http://www.sheepkillers.com/chemtrails.html", "http://video.google.com/videosearch?q=Georgia+GuideStones&oe=UTF-8&um=1&ie=UTF-8&sa=N&tab=wv&oi=property_suggestions&resnum=0&ct=property-revision&cd=1", "http://thegeorgiaguidestones.com/When.htm", "http://www.thegeorgiaguidestones.com/as_they_stand.htm", "http://www.google.com/search?tab=vw&q=Georgia%20GuideStones", "http://biblesearchers.com/catastrophes/timeofend/guidestones.shtml", "http://www.statcounter.com/"], "authors": [], "publish_date": null}