{"result_id": "270017", "URL": "http://www.sheepkillers.com/ufonephilimagenda.html", "timestamp": "2023-04-25 17:06:52 CEST+0200", "meta": {"description": "", "lang": "id", "keywords": "", "favicon": "", "canonical": "http://www.sheepkillers.com/ufonephilimagenda.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "Nephelim Agenda", "cleaned_text": "Jesus said, \"As it was in the days of Noah, so it will be at the coming of the Son of Man.\" - Matthew 24:37\n\n4 In those days, and for some time after, giant Nephilim lived on the earth, for whenever the sons of God had intercourse with women, they gave birth to children who became the heroes and famous warriors of ancient times.\n\n5 The Lord observed the extent of human wickedness on the earth, and he saw that everything they thought or imagined was consistently and totally evil.\n\n6 So the Lord was sorry he had ever made them and put them on the earth. It broke his heart.\n\n7 And the Lord said, “I will wipe this human race I have created from the face of the earth. Yes, and I will destroy every living thing—all the people, the large animals, the small animals that scurry along the ground, and even the birds of the sky. I am sorry I ever made them.”\n\nNOTE: The Flood came because of the evil brought on by the \"sons of God\" having intercourse with the\"daughters of man\" - not simply because of what men were doing - but what fallen angels (and their offspring) were doing to, in and through humans!\n\n18 ...and the sons of men in those days took from the cattle of the earth, the beasts of the field and the fowls of the air, and taught the mixture of animals of one species with the other, in order therewith to provoke the Lord; and God saw the whole earth and it was corrupt, for all flesh had corrupted its ways upon earth, all men and all animals.\n\n19 And the Lord said, I will blot out man that I created from the face of the earth, yea from man to the birds of the air, together with cattle and beasts that are in the field for I repent that I made them.\n\nNOTE: Part of the corruption was the \"mixture of animals of one species with the other.\" Jasher further elaborates on what kind of monstrosities were created in chapter 61:\n\n14 And it was one day that Zepho lost a young heifer, and he went to seek it, and he heard it lowing round about the mountain.\n\n15 And Zepho went and he saw and behold there was a large cave at the bottom of the mountain, and there was a great stone there at the entrance of the cave, and Zepho split the stone and he came into the cave and he looked and behold, a large animal was devouring the ox; from the middle upward it resembled a man, and from the middle downward it resembled an animal, and Zepho rose up against the animal and slew it with his swords.\n\nNOTE: Could it be that the \"Olympian gods\" of Greece and all of the hybrid creatures of mythology (Centaurs, Minotaurs, Fauns, Unicorns, etc.) were real? I believe Genesis 6 describes the likes of Zeus, Apollo, etc. and Jasher certainly gives testimony of the latter.\n\nNow let's look at the opening quote \"...coming of the Son of Man\"\n\nJesus referred to Himself in this fashion numerous times. If you do a search on \"son of man\" on biblegateway.com you find the greatest use of the phase in Ezekiel. All through the Old Testament it is used in reference to \"normal\" human sons of men except for one instance. The only Messianic title in the Old Testament given as \"son of man\" is in Daniel 7:13.\n\nIf we were to use the technique of \"scripture interprets scripture\" we would find no scriptural basis for Jesus calling Himself that (at least not from our current \"edition\" of what we call our Bible). There should be other scriptures in the Old Testament that would \"bare witness\" of Jesus using that title as a Messianic title. But we find none... that is until you read the Book of Enoch. This is a book Jesus was clearly aware of - as were His apostles, as many of them make numerous references which are almost direct quotes from it.\n\nThe Book of Enoch was written centuries before the birth of Christ and yet it is considered by many to be more \"Christian\" in its theology than any of the Old Testament books we have in our Bible. In my research, I've discovered that the Book of Enoch was considered to be \"scripture\" by many early Christians. In fact, much of the book of Jude makes reference to content in the Book of Enoch (most notably verses 14 & 15 - see Enoch 1:9). See also the probable reference in I Peter 3:19,20 to Enoch 6-36, among others. In fact, after reading Enoch, you will see many references by the Apostles that appear to have been (at least) influenced by the book of Enoch.\n\nA fair amount of literature was also written by our so-called \"Church Fathers\" is filled with references to this mysterious book. The early second century \"Epistle of Barnabus\" makes much use of the Book of Enoch. Second and Third Century \"Church Fathers\" like Justin Martyr, Irenaeus, Origin and Clement of Alexandria all make use of the Book of Enoch. Tertullian (160-230 C.E) even called the Book of Enoch \"Holy Scripture\". The Ethiopic Church even added the Book of Enoch to its official canon. It was definitely widely known and read the first three centuries before and after Christ.\n\nWhen you read Enoch, Genesis and Jasher together you begin to get a very clear picture of what Jesus was referring to in Matthew 24:37. \"As it was in the days of Noah...\" is not just referring to sinful men. It's referring to the devious activity of fallen angels - working through and with men to do evil in this world. (Ephesians 6:12)\n\nAnd if you really want to see just how much things are today just like they were \"in the days of Noah\" check out this recent news article:\n\nScientists have created the world's first human-sheep chimera - which has the body of a sheep and half-human organs.\n\nThe sheep have 15 per cent human cells and 85 per cent animal cells - and their evolution brings the prospect of animal organs being transplanted into humans one step closer.\n\nProfessor Esmail Zanjani, of the University of Nevada, has spent seven years and £5million perfecting the technique, which involves injecting adult human cells into a sheep's foetus.\n\nHe has already created a sheep liver which has a large proportion of human cells and eventually hopes to precisely match a sheep to a transplant patient, using their own stem cells to create their own flock of sheep.\n\nScientists at King's College, London, and the North East Stem Cell Institute in Newcastle have now applied to the HFEA, the Government's fertility watchdog, for permission to start work on the chimeras.\n\nBut the development is likely to revive criticisms about scientists playing God, with the possibility of silent viruses, which are harmless in animals, being introduced into the human race.\n\nDr Patrick Dixon, an international lecturer on biological trends, warned: \"Many silent viruses could create a biological nightmare in humans. Mutant animal viruses are a real threat, as we have seen with HIV.\"\n\nAnimal rights activists fear that if the cells get mixed together, they could end up with cellular fusion, creating a hybrid which would have the features and characteristics of both man and sheep. But Prof Zanjani said: \"Transplanting the cells into foetal sheep at this early stage does not result in fusion at all.\"\n\nMoses wrote about it in Genesis. The book of Jasher elaborated on it and specifically mentioned the mixture of species - both animal and human. And Enoch tells you who's to blame for this. The fallen angels are at it again and we are headed for some strange and terrifying times ahead! I've always believed the dinosaurs were engineered by men (or fallen angels). I'll try to post more on that later. But just watch Jurassic Park and you'll see that idea has been (re)considered in our day as well.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.sacred-texts.com/chr/apo/jasher/index.htm", "http://www.jasher.com/Forum.htm", "http://www.biblegateway.com", "http://www.thisislondon.co.uk/news/article-23390256-details/Now+scientists+create+a+sheep+that%27s+15%25+human/article.do", "http://www.statcounter.com/"], "authors": [], "publish_date": null}