{"result_id": "270020", "URL": "http://www.sheepkillers.com/giantsnephilim.html", "timestamp": "2023-04-25 17:06:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.sheepkillers.com/giantsnephilim.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "Giants - Nephilim", "cleaned_text": "Nephilim, Raphaim, Anunaki... are these what the ancients called the Titans, gods, giants and/or what we might today call aliens? They are mentioned throughout the Old Testament. The Greek Myths call them by names like Zues, Apollo and Mars. The Book of Enoch talks about them. There are strange monuments all over the world and even substantial physical evidence that testify to the reality of these beings. Who are they? Where did they come from? \n\n\n\nStart by watching the Discovery Channel's :\n\n\n\n\n\n\n\n Matt 3:7 But when he saw many of the Pharisees and Sadducees come to his baptism, he said unto them, O generation of vipers, who hath warned you to flee from the wrath to come?\n\n\n\n\n\nBelow is where the bible talks about \"Angels\" taking women and creating offspring that were referred to as the Nephil who were born of earth women. They took whom they chose; it wasn’t an option for the women. You will see from this article this practice continues on after the flood of Noah. This is why God is concerned about mankinds seed. \n\n\n\n\n\nGen 3:15 I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel.\n\n\n\nA very obvious point is being made with that verse. \"Your\" seed and \"Her\" seed. To have a seed means you have offspring. They are already mixed in among us.\n\n\n\nPeople when they go through hypnosis recall the events and the \"Aliens\" actually admitting they are here to cross breed with the humans. \n\n\n\n\n\nThe new line of thought in the Christian world is these UFO's are illusions brought on by the mastermind himself \"Satan\" and the aliens are nothing but demon hordes and things of this nature. This is the reasoning they use which helps them to resolve the UFO/ Alien phenomenon. \n\n\n\nThe reality is these beings have always been what they are. They fly in craft and always have. Some were meant to watch over the Earth and some chose to give away forbidden knowledge to humans and genetically mix with humankind.\n\n\n\nThe underlying theme of the bible is about mankind’s seed. This is why these beings are interested in people this way. They are the Serpent/ Watchers mentioned in Revelation, Enoch, and Genesis. They are Satan - meaning adversaries. \n\n\n\n\n\nThey are attempting to \"mix with the seed of men\" as mentioned in the book of Daniel 2:31- 45\n\n\n\n\n\nGen 6:4 There were Giants in the earth in those days; and also after that, when the sons of God came in unto the daughters of men, and they bare [children] to them, the same [became] mighty men which [were] of old, men of renown.\n\nThey substituted the word “Giants” for the correct transliteration of the name Nephilim in here.\n\n\n\n\n\n\n\nThe Hebrew word here used in place of “Which were of Old” is intriguing. (Strongs # 05769) – It has several meanings some of which are: for ever, always, everlasting, indefinite or unending future, eternity, ancient time, long time.\n\n\n\n\n\nWhen you read through the entire bible there are many hints of this activity throughout mans timeline not just before the Flood.\n\n\n\nIf you’ve read my other articles you understand that the Serpent that tempted eve was not a snake, but one of many of these beings that are referred to as Sons of God and Watchers and Serpent.\n\n\n\nHere’s another occurrence of this word Giants that occurs after Noah’s Flood.\n\n\n\nNum 13:32 And they brought up an evil report of the land which they had searched unto the children of Israel, saying, The land, through which we have gone to search it, [is] a land that eateth up the inhabitants thereof; and all the people that we saw in it [are] men of a great stature.\n\n\n\nHere is where you will find Nephelim once again in the Hebrew Scriptures to verify this was indeed a reoccurring problem. \n\n\n\n\n\nNum 13:33 And there we saw the giants (Nephelim), the sons of Anak, [which come] of the giants (Nephelim) : and we were in our own sight as grasshoppers, and so we were in their sight.\n\n\n\n\n\nNum 13:33 (The Same verse now in Hebrew)\n\n\n\nThis clearly indicates that they are at it again producing offspring of their own again even after judgment was brought upon the Earth. The Hebrew letter \"ה\" in front of נפילים (Nephelim) represents the word \"The\".\n\n \n\n\n\nRemember the story of David and Goliath? It’s the same result of breeding man with angelic hosts.\n\n\n\n\n\n1 Sam 17:4 And there went out a champion out of the camp of the Philistines, named Goliath, of Gath, whose height [was] six cubits and a span.\n\n\n\n\n\nEntire Races of them in Deuteronomy:\n\nDeut 2:10 The Emims dwelt therein in times past, a people great, and many, and tall, as the Anakims;\n\n\n\nDeut 2:11 Which also were accounted giants, as the Anakims; but the Moabites call them Emims.\n\n\n\nDeut 2:20 (That also was accounted a land of giants: giants dwelt therein in old time; and the Ammonites call them Zamzummims;\n\n\n\nDeut 3:11 For only Og king of Bashan remained of the remnant of giants (Raphah); behold, his bedstead [was] a bedstead of iron; [is] it not in Rabbath of the children of Ammon? nine cubits [was] the length thereof, and four cubits the breadth of it, after the cubit of a man.\n\n\n\n\n\nThese giants in Deuteronomy are derived from the following Hebrew words:\n\n\n\n1 Sam 9:1 Now there was a man of Benjamin, whose name [was] Kish, the son of Abiel, the son of Zeror, the son of Bechorath, the son of Aphiah, a Benjamite, a mighty man of power.\n\n\n\n\n\n\n\nThere appears to be a variety that was produced just by interbreeding with humans. Most Churches skip over this as I’ve never heard much myself from any of them as they just ignore the obvious.\n\n\n\n\n\nWas bringing a flood needed to wipe the slate clean? It seems these things not only went after humans, but animals and lizards to name a few. Here is a bit from the Book of Enoch.\n\n\n\n\n\nEnoch 7:1 And all the others together with them took unto themselves wives, and each chose for himself one, and they began to go in unto them and to defile themselves with them, and they taught them charms 2 and enchantments, and the cutting of roots, and made them acquainted with plants. And they 3 became pregnant, and they bare great giants, whose height was three thousand ells: Who consumed 4 all the acquisitions of men. And when men could no longer sustain them, the giants turned against 5 them and devoured mankind. And they began to sin against birds, and beasts, and reptiles, and 6 fish, and to devour one another's flesh, and drink the blood. Then the earth laid accusation against the lawless ones.\n\n \n\nAfter you read this bit from Enoch you understand why he brought death upon all living things.\n\n\n\n\n\nEnoch 10:1 Then said the Most High, the Holy and Great One spake, and sent Uriel to the son of Lamech, 2 and said to him: 'Go to Noah and tell him in my name \"Hide thyself!\" and reveal to him the end that is approaching: that the whole earth will be destroyed, and a deluge is about to come 3 upon the whole earth, and will destroy all that is on it. And now instruct him that he may escape 4 and his seed may be preserved for all the generations of the world. '\n\n\n\nAgain the reason God puts enmity between the woman’s seed and the serpents is because of this very problem he knew would occur.\n\n\n\n\n\nGen 3:15 I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel.\n\n\n\nThere is another “Seed” mentioned in the Greek scriptures used in the following context.\n\n\n\n\n\nMatt 13:31 Another parable put he forth unto them, saying, The kingdom of heaven is like to a grain of mustard seed, which a man took, and sowed in his field:\n\n\n\n\n\nThe Greek word used here is not , but a different word . They are completely different but both are translated as Seed, so just letting you know this to avoid confusion with the multiple uses of the word seed in the Bible.\n\n\n\n\n\nThe Nephelim become the Demons\n\nJudging from the many \"Out of Body Experiences\" people have it's easy to conclude we do go on after this life in the form of a spirit. We also know that Bacteria and Viruses can invade the human body so it stands to reason that this isn't really that outlandish to have other spirit type entities capable of doing the same thing. I've never seen this first hand, but I'm sure it is indeed possible.\n\n\n\nDemons were formally the Nephelim Giants (A creation of breeding mankind with \"The Watcher/Serpent \" Beings) who's physical bodies were destroyed and are bound to the Earth wondering as wicked spirits according to this verse in Enoch.\n\n\n\nEnoch 15:8 And now, the giants, who are produced from the spirits and flesh, shall be called evil spirits upon 9 the earth, and on the earth shall be their dwelling. Evil spirits have proceeded from their bodies; because they are born from men and from the Holy Watchers is their beginning and primal origin; 10 they shall be evil spirits on earth, and evil spirits shall they be called. [As for the spirits of heaven, in heaven shall be their dwelling, but as for the spirits of the earth which were born upon the earth, on the earth shall be their dwelling.]\n\n\n\n A Biblical sample of someone under demonic influence:\n\n\n\n\n\nMark 5:9 And he asked him, What [is] thy name? And he answered, saying, My name [is] Legion: for we are many.\n\n\n\n\n\nMark 5:12 And all the devils besought him, saying, Send us into the swine, that we may enter into them.\n\n \n\n\n\nThey label the texts in a simple code. There were 11 caves so “4Q” means this was found in Cave four in the Qumran cave system, the rest is the verse information on that scroll portion.\n\n\n\n\n\nare portions of the Book of Jubilees\n\n \n\n\n\nCopies of the Book of Jubilees from caves 1, 2, 3 and 11 were found. Given the fact that at least fourteen copies of it have been identified from the Qumran caves, it is clear that the Book of Jubilees was a popular and probably authoritative text for the community, which implies that the sectarians took seriously the text’s claim to be divine revelation mediated to Moses. The Book of Enoch was also among the fragments found. \n\n\n\n\n\nHere are all the reference to these Watchers in Jubilees, Enoch and Daniel. \n\n\n\n\n\n\n\nJubilees 4:15 And in the second week of the tenth jubilee Mahalalel took unto him to wife Dinah, the daughter of Barakiel the daughter of his father's brother, and she bare him a son in the third week in the sixth year, and he called his name Jared, for in his days the angels of the Lord descended on the earth, those who are named the Watchers, that they should instruct the children of men, and that they should do judgment and uprightness on the earth. \n\n\n\n\n\nJubilees 4:22 And he testified to the Watchers, who had sinned with the daughters of men; for these had begun to unite themselves, so as to be defiled, with the daughters of men, and Enoch testified against (them) all. \n\n\n\n\n\nJubilees 7:21 For owing to these three things came the flood upon the earth, namely, owing to the fornication wherein the Watchers against the law of their ordinances went a whoring after the daughters of men, and took themselves wives of all which they chose: and they made the beginning of uncleanness.\n\n\n\n\n\nJubilees 8:3 3 And he found a writing which former (generations) had carved on the rock, and he read what was thereon, and he transcribed it and sinned owing to it; for it contained the teaching of the Watchers in accordance with which they used to observe the omens of the sun and moon and stars in all the signs of heaven. \n\n\n\n\n\nJubilees 10:5-10 And Thou knowest how The Watchers, the fathers of these spirits, acted in my day: and as for these spirits which are living, imprison them and hold them fast in the place of condemnation, and let them not bring destruction on the sons of thy servant, my God; for these are malignant, and 6 created in order to destroy. And let them not rule over the spirits of the living; for Thou alone canst exercise dominion over them. And let them not have power over the sons of the righteous 7-8 from henceforth and for evermore.' And the Lord our God bade us to bind all. And the chief of the spirits, Mastema, came and said: 'Lord, Creator, let some of them remain before me, and let them harken to my voice, and do all that I shall say unto them; for if some of them are not left to me, I shall not be able to execute the power of my will on the sons of men; for these are for corruption and leading astray before my judgment, for great is the wickedness of the sons of men.' 9 And He said: Let the tenth part of them remain before him, and let nine parts descend into the 10 place of condemnation.' \n\n\n\n\n\nEnoch 1:5 And all shall be smitten with fear And the Watchers shall quake, And great fear and trembling shall seize them unto the ends of the earth. \n\n\n\n\n\nEnoch 10:7 And heal the earth which the angels have corrupted, and proclaim the healing of the earth, that they may heal the plague, and that all the children of men may not perish through all the secret things that the Watchers have disclosed and have taught their sons. \n\n\n\n\n\nEnoch 10:9 And to Gabriel said the Lord: 'Proceed against the bastards and the reprobates, and against the children of fornication: and destroy [the children of fornication and] the children of the Watchers from amongst men [and cause them to go forth]: send them one against the other that they may destroy each other in battle: for length of days shall they not have.\n\n\n\nEnoch 10:15 And destroy all the spirits of the reprobate and the children of the Watchers, because they have wronged mankind. \n\n\n\n\n\nEnoch 12:2 And his activities had to do with the Watchers, and his days were with the holy ones. \n\n\n\n\n\nEnoch 12:3 And I Enoch was blessing the Lord of majesty and the King of the ages, and lo! the Watchers called me—Enoch the scribe—and said to me: \n\n\n\n\n\nEnoch 12:4 'Enoch, thou scribe of righteousness, go, declare to the Watchers of the heaven who have left the high heaven, the holy eternal place, and have defiled themselves with women, and have done as the children of earth do, and have taken unto themselves wives: \"Ye have wrought great destruction on the earth: \n\n\n\n\n\nEnoch 13:10 And I recounted before them all the visions which I had seen in sleep, and I began to speak the words of righteousness, and to reprimand the heavenly Watchers. \n\n\n\n\n\nEnoch 14:1 The book of the words of righteousness, and of the reprimand of the eternal Watchers in accordance with the command of the Holy Great One in that vision. \n\n\n\n\n\nEnoch 14:3 As He has created and given to man the power of understanding the word of wisdom, so hath He created me also and given me the power of reprimanding the Watchers, the children of heaven.\n\n\n\nEnoch 15:2 And go, say to the Watchers of heaven, who have sent thee to intercede for them: \"You should intercede\" for men, and not men for you:\n\n\n\nEnoch 15:9 Evil spirits have proceeded from their bodies; because they are born from men and from the holy Watchers is their beginning and primal origin; they shall be evil spirits on earth, and evil spirits shall they be called.\n\n\n\nEnoch 16:1 From the days of the slaughter and destruction and death of the giants, from the souls of whose flesh the spirits, having gone forth, shall destroy without incurring judgement—thus shall they destroy until the day of the consummation, the great judgement in which the age shall b consummated, over the Watchers and the godless, yea, shall be wholly consummated.\"\n\n\n\nEnoch 16:2 And now as to the Watchers who have sent thee to intercede for them, who had been aforetime in heaven, (say to them):\n\n\n\nDaniel 4:13 I saw in the visions of my head upon my bed, and, behold, a watcher and an holy one came down from heaven - KJV\n\n\n\nDaniel 4:17 This matter is by the decree of the watchers, and the demand by the word of the holy ones: to the intent that the living may know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will, and setteth up over it the basest of men. - KJV\n\n\n\nDaniel 4:23 And whereas the king saw a watcher and an holy one coming down from heaven, and saying, Hew the tree down, and destroy it; yet leave the stump of the roots thereof in the earth, even with a band of iron and brass, in the tender grass of the field; and let it be wet with the dew of heaven, and [let] his portion [be] with the beasts of the field, till seven times pass over him; - KJV (Notice the distinction made here between a Watcher and a Holy One)\n\n\n\nFast forward a few thousand years from the Flood and here we are again. We have people claiming to be abducted by alien beings and used as experiments that are sexual in nature.\n\n\n\nPerhaps after a few thousand years they’ve mastered making offspring closer to look human than stand out like a Giant would. These of course are not Aliens or Greys, or Reptilians, but the Serpent, the Sons of God that are the fallen ones whom people are confusing for being extraterrestrial or conjured evil spirits by some guy named Lucifer.\n\n\n\nYahshua makes many references to the serpent. When talking to the Scribes and Pharisees he refers to them being serpent, offspring of vipers.\n\n\n\n\n\nMatt 3:7 But when he saw many of the Pharisees and Sadducees come to his baptism, he said unto them, O generation of vipers, who hath warned you to flee from the wrath to come?\n\n\n\n\n\nMatt 12:34 O generation of vipers, how can ye, being evil, speak good things? for out of the abundance of the heart the mouth speaketh.\n\n\n\n\n\nMatt 23:33 [Ye] serpents, [ye] generation of vipers, how can ye escape the damnation of hell?\n\n\n\n\n\nLuke 3:7 Then said he to the multitude that came forth to be baptized of him, O generation of vipers, who hath warned you to flee from the wrath to come?\n\nHe tells his followers that he will give them power over scorpions and serpent.\n\n\n\nLuke 10:19 Behold, I give unto you power to tread on serpents and scorpions, and over all the power of the enemy: and nothing shall by any means hurt you.\n\n\n\nMatt. 10:16 Behold, I send you forth as sheep in the midst of wolves: be ye therefore wise as serpents, and harmless as doves.\n\n\n\n\n\nIt seems Cryptic unless you know what to look for. Again one final thing that is from the Book of Daniel.\n\n\n\n\n\n\n\nDaniel gives a dream to Nebuchadnezzar in Daniel 2:31- 45.\n\n\n\nThe dream describes a large image which represents the powers that will rule over the Earth. Notice the last one on the List:\n\n\n\nDaniel 2:41 And whereas thou saw the feet and toes, part of potters' clay, and part of iron, the kingdom shall be divided; but there shall be in it of the strength of the iron, forasmuch as thou saw the iron mixed with miry clay.\n\n\n\nDaniel 2:42 And [as] the toes of the feet [were] part of iron, and part of clay, [so] the kingdom shall be partly strong, and partly broken.\n\n\n\n\n\nDaniel 2:43 And whereas thou saw iron mixed with miry clay, they shall mingle themselves with the seed of men: but they shall not cleave one to another, even as iron is not mixed with clay. (What on earth could that mean??)\n\n\n\n\n\nDaniel 2:44 And in the days of these kings shall the God of heaven set up a kingdom, which shall never be destroyed: and the kingdom shall not be left to other people, [but] it shall break in pieces and consume all these kingdoms, and it shall stand for ever.\n\n\n\n\n\nThey will Mingle themselves with the seed of men. What a shocker. After reading all of these other occurrences of Giant offspring from these fallen angels how can we be surprised that it will still be happening when he returns.\n\n\n\n\n\nIf you haven’t read my other articles take a look and see for yourself what Satan really is and who the Dragon of Revelation is. It will all start to click into place for you.\n\n\n\n Here are 3 more translations of this same verse.\n\n\n\n\n\nDaniel 2:43 And just as you saw the iron and the clay of the earthenware mixed together, so the two will be mixed together in human seed; but they will not hold together any more than iron will blend with clay. – New Jerusalem Bible\n\n\n\nDaniel 2:43 \"As you saw iron mixed with ceramic clay, they will mingle with the seed of men; but they will not ad here to one another, just as iron does not mix with clay. – New King James\n\n\n\nDaniel 2:43 You saw iron mixed with common clay; that means: they shall intermingle with the offspring of men, but shall not hold together, just as iron does not mix with clay. –Tanakh JPS 1985\n\n\"They\" are not human. Otherwise it would be saying they are humans mixing with other humans. When we mix together we hold together just fine. If we didn't we wouldn't last long as a human race. \n\n\n\n\n\nWhen they do this they are physical when they taught side by side with mankind all the forbidden secrets they were physical. In Enoch it’s mentioned they are preparing Instruments/Devices. Physical sounding things wouldn't you say?\n\n\n\n\n\nOne final thing of interest to me was after having researched all of this a while back I had rented the movie A.I. It's about the robot kid that wants to be human. \n\n\n\n\n\nI was only watching it as I had missed it when it was in theaters. The movie itself was pretty boring, but at one point the DVD paused and I was like it must be a flaw with the DVD then it played after 3 seconds of stopping. The very next scene these were the exact words from the script of the movie:\n\n\n\n\n\n\"Ladies and gentlemen. Girls and boys and children of all ages! What will they think of next?! See here: a bitty box, a tinker toy, a living doll. 'Course we all know why they made them. To seize your hearts. To replace your children! This is the latest iteration to the series of insults to human dignity. An underground scheme to phase out all of God's little children. Meet the next generation of child designed to do just that! Do not be fooled by the artistry of this creation. No doubt there was talent in the crafting of this simulator. Yet with the very first strike, you will see the big lie come apart before your very eyes!\"\n\n\n\n\n\nCould the DVD had paused accidently or did something want me to notice this part especially in light of my recent findings of creating this article. The DVD played back fine when I tried it again so it wasn't a glitch on the surface itself.\n\n \n\n\n\nThose not familiar with the Book of Enoch, it was a book found with the Dead Sea Scrolls. Enoch was the 7th from Adam. He is mentioned in the New Testament directly by other writers. He is also of course mentioned in Genesis in the lineage and it's mentioned that God took him from the Earth. - Gen 5:23,24\n\n\n\nHebrews 11:5 By faith Enoch was taken away so that he did not see death, \"and was not found, because God had taken him\"; for before he was taken he had this testimony, that he pleased God.\n\n\n\n\n\nJude 1:14 Now Enoch, the seventh from Adam, prophesied about these men also, saying, \"Behold, the Lord comes with ten thousands of His saints, 15 to execute judgment on all, to convict all who are ungodly among them of all their ungodly deeds which they have committed in an ungodly way, and of all the harsh things which ungodly sinners have spoken against Him.\"\n\n\n\nYes He gave testimony and the other writers knew it and quoted of it. It also parallels the Greek and Hebrew writings. See this link for greater details.\n\n\n\n Here is a link to the Book of Enoch so you can read it for free.\n\nGen 5:19-24 And Jared lived after he begat Enoch eight hundred years, and begat sons and daughters:\n\nAnd all the days of Jared were nine hundred sixty and two years: and he died.\n\nAnd Enoch lived sixty and five years, and begat Methuselah:\n\nAnd Enoch walked with God after he begat Methuselah three hundred years, and begat sons and daughters:\n\nAnd all the days of Enoch were three hundred sixty and five years:\n\nAnd Enoch walked with God: and he [was] not; for God took him.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "object", "provider": "youtube", "width": "400", "height": "326", "embed_code": "<object width=\"400\" height=\"326\"><param name=\"movie\" value=\"http://www.youtube.com/v/zErIEyIECTk&amp;hl=en\"/><param name=\"wmode\" value=\"transparent\"/>&#13;<embed src=\"http://www.youtube.com/v/zErIEyIECTk&amp;hl=en\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"400\" height=\"326\"/></object>", "src": "http://www.youtube.com/v/zErIEyIECTk&hl=en"}, {"embed_type": "object", "provider": "youtube", "width": "400", "height": "326", "embed_code": "<object width=\"400\" height=\"326\"><param name=\"movie\" value=\"http://www.youtube.com/v/WFXAPByoj9w&amp;hl=en\"/><param name=\"wmode\" value=\"transparent\"/>&#13;<embed src=\"http://www.youtube.com/v/WFXAPByoj9w&amp;hl=en\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"400\" height=\"326\"/></object>", "src": "http://www.youtube.com/v/WFXAPByoj9w&hl=en"}, {"embed_type": "object", "provider": "youtube", "width": "400", "height": "326", "embed_code": "<object width=\"400\" height=\"326\"><param name=\"movie\" value=\"http://www.youtube.com/v/-Uu1JqIxGpU&amp;hl=en\"/><param name=\"wmode\" value=\"transparent\"/>&#13;<embed src=\"http://www.youtube.com/v/-Uu1JqIxGpU&amp;hl=en\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"400\" height=\"326\"/></object>", "src": "http://www.youtube.com/v/-Uu1JqIxGpU&hl=en"}, {"embed_type": "object", "provider": "youtube", "width": "400", "height": "326", "embed_code": "<object width=\"400\" height=\"326\"><param name=\"movie\" value=\"http://www.youtube.com/v/Z4awGR9jdT0&amp;hl=en\"/><param name=\"wmode\" value=\"transparent\"/>&#13;<embed src=\"http://www.youtube.com/v/Z4awGR9jdT0&amp;hl=en\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"400\" height=\"326\"/></object>", "src": "http://www.youtube.com/v/Z4awGR9jdT0&hl=en"}, {"embed_type": "object", "provider": "youtube", "width": "400", "height": "326", "embed_code": "<object width=\"400\" height=\"326\"><param name=\"movie\" value=\"http://www.youtube.com/v/bmZun_We6DE&amp;hl=en\"/><param name=\"wmode\" value=\"transparent\"/>&#13;<embed src=\"http://www.youtube.com/v/bmZun_We6DE&amp;hl=en\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"400\" height=\"326\"/></object>", "src": "http://www.youtube.com/v/bmZun_We6DE&hl=en"}, {"embed_type": "object", "provider": "youtube", "width": "400", "height": "326", "embed_code": "<object width=\"400\" height=\"326\"><param name=\"movie\" value=\"http://www.youtube.com/v/WQ_saShscq8&amp;hl=en\"/><param name=\"wmode\" value=\"transparent\"/>&#13;<embed src=\"http://www.youtube.com/v/WQ_saShscq8&amp;hl=en\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"400\" height=\"326\"/></object>", "src": "http://www.youtube.com/v/WQ_saShscq8&hl=en"}], "links": ["http://www.johnpratt.com/items/docs/lds/meridian/2001/enoch_cal.html", "http://www.altheim.com/lit/enoch.html", "http://reluctant-messenger.com/enoch.htm", "http://www.statcounter.com/", "http://www.sheepkillers.com/ufonephilimagenda.html"], "authors": [], "publish_date": null}