{"result_id": "270018", "URL": "https://www.sheepkillers.com/", "timestamp": "2023-04-25 17:06:53 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "", "canonical": "https://www.sheepkillers.com/", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "Home", "cleaned_text": "All you like sheep have gone astray...\n\n\n\n The Old Testament prophet Jeremiah recorded this lament of God, \n\n\n\n \"My people have been lost sheep. Their shepherds have led them astray.\" \n\n\n\n\n\n\n\n When He [Jesus] saw the crowds, he had compassion on them, because they were harassed and helpless, like sheep without a shepherd. \n\n The Bible says that Israel was constantly being led astray by bad leaders. Well, like them, Americans have also have been led astray by bad leadership. Our leaders perfectly fit the description of Israel's leaders given in Ezekiel chapter 34. \n\n New World Order and our government (if indeed there is a difference) are counting on the fact that most people are really sheep. We are ignorant and easily led - and in many cases we even finance and bring about our own destruction! \n\n\n\nIn an effort to wake people up to the many realities that could easily point to our doom, this website is being designed to expose the Global Elite's agenda for stripping you of your rights, your money, your property, your privacy and ultimately for the total depopulation of the earth down to a number (500 million) that can easily be controlled to do their bidding. \n\n\n\n That may sound crazy at first glance. Once, we thought so too. Until our eyes were opened. Therefore, just as we have done, we invite you to do your own research on each of these and many other topics. Google \"Chemtrails\" and \"The Georgia Guidestones\" for starters and you'll quickly find yourself on the same journey we're on.\n\n\n\nThis website is a work-in-progress and will be updated regularly as we discover new truths. We invite you to join our interactive on-line Community Site. There, you can help us get more information out to the masses. You will be able to post blogs, pics, links to your site and much more. \n\n\n\nThe one thing the Globalists fear is numbers. That is why they are trying to kill us off. But until they fully achieve their sinister plans we still have a chance to make a stand against them. United we stand, divided (or ignorant) we will surely fall. So please be sure to join the Community! \n\n\n\nEducate Yourself! is the theme of this site. It is also a link. Where ever you see that phrase in blue, click on it to go to educate-yourelf.org . That site contains a wealth of information about these and many other topics.\n\n\n\nThe videos and links we are providing here represent only the TIP of the proverbial iceberg. It's time we take this stuff serious because \"they\" most certainly do. \n\n\n\nDon't take this stuff lightly. Don't pretend not see what's happening all around you. Don't be ignorant. Don't stay passive. Don't be a deaf,dumb and blind sheep easily led to the slaughter! \n\n\n\nKnowledge is power. Numbers give us the only advantage we have. Spread the word. Get involved. Fight back! Live! And remember, there is hope! CLICK HERE to see where our hope lies! \n\n Jesus felt the same way when He observed the people of Israel in His day,", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.biblegateway.com/passage/?search=Ezekiel%2034;&version=51;", "http://www.sheepkillers.com/thenewworldorder.html", "http://www.sheepkillers.com/thefederalreserve.html", "http://www.sheepkillers.com/thenewworldorder.html", "http://www.sheepkillers.com/georgiaguidestones.html", "http://imageevent.com/firesat/strangedaysstrangeskies?z=3&c=4&n=1&m=-1&w=4&x=0&p=14", "http://www.sheepkillers.com/georgiaguidestones.html", "http://www.savingsheep.ccom", "http://www.educate-yourself.org/", "http://www.educate-yourself.org/", "http://www.sheepkillers.com/ouronlyhope.html", "http://www.statcounter.com/"], "authors": [], "publish_date": null}