{"result_id": "270015", "URL": "http://www.sheepkillers.com/the911conspiracy.html", "timestamp": "2023-04-25 17:06:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.sheepkillers.com/the911conspiracy.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.sheepkillers.com", "title": "The 9/11 Conspiracy", "cleaned_text": "If you think 9/11 was the result of cave-dwelling terrorists attacking our country, bringing down airplanes with box-cutters and collapsing entire buildings into their footprints, you really are a sheep. If that offends you, you still have a chance to redeem yourself. So please, do yourself a favor and watch the videos on this page, and linked from this page. America HAS GOT TO WAKE UP! Watch these videos!\n\n\n\nIs it just a \"coincidence\" that George Bush, Sr. just so happened to \n\n\n\n Is it just a \"coincidence\" that George Bush, Sr. just so happened to announce his vision for a New World Order on Sept. 11, 1991 - EXACTLY 10 years to the day from the worst attack in our nation's history?\n\nIs it mere chance that his son just so happened to be in office when it happened? Is it coincidence that George Jr. got us back into Iraq to finish what his father started? Is it any wonder that we are now under the watchful eye of \"Big Brother\" and our constitution is being systematically destroyed along with our rights? Make no mistake, September 11th was well thought out and planned. \n\n\n\n There is a vast amount of information out on the Net that points to September 11, 2001 as being a \"self inflicted wound.\" We are only presenting a few clips here for your consideration. Do the research yourself and come to your own conclusion. But remain open to what you are going to find... even if it means acknowledging that your own government may be responsible for one of the worst tragedies in American history. \n\n\n\nFor starters, check out the most comprehensive timeline on the Internet regarding the events leading up to, including and after the events of 9/11:\n\n\n\nhttp://www.911timeline.net/\n\n\n\nIf you'd rather start by watching videos, start with this one:\n\n\n\nMore than 3,000 lives were lost on 9/11. Watch the surviving family members as they struggle with our government in their quest to uncover the truth about what really happened on that terrible day. \n\n\n\nWatch :\n\nWatch (listen to the victims and first responders point of view):\n\nOn July 21, 2001, radio host, Alex Jones (a patriot who has made it his life mission to expose what is really going on with our government) predicted a massive governemt sponsored terrorst attack on America.\n\nThe events of 9/11 were even predicted in the X-Files' spin off television series \"The Lone Gunmen\" in their pilot episode (which aired only a few months September 11, 2001).\n\nThose were just \"subtle\" warnings. Now let's get down to the nitty-gritty. Who did it and why? Before you watch the following videos, ask yourself if you really want to know the answer to that question.\n\n\n\n9/11 addressed in :\n\nWatch perhaps one of the most popular videos on 9/11, :\n\nSo what about Flight 93? Good question. Watch this rare footage:", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "object", "provider": "youtube", "width": "400", "height": "326", "embed_code": "<object height=\"326\" width=\"400\">&#13;<param name=\"movie\" value=\"http://www.youtube.com/v/w-0Ms7mId34&amp;hl=en\"/>&#13;<param name=\"wmode\" value=\"transparent\"/>&#13;<embed src=\"http://www.youtube.com/v/w-0Ms7mId34&amp;hl=en\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"400\" height=\"326\"/>&#13;</object>", "src": "http://www.youtube.com/v/w-0Ms7mId34&hl=en"}, {"embed_type": "object", "provider": "youtube", "width": "400", "height": "326", "embed_code": "<object height=\"326\" width=\"400\"><param name=\"movie\" value=\"http://www.youtube.com/v/OtZgwAGGByA&amp;hl=en\"/><param name=\"wmode\" value=\"transparent\"/><embed src=\"http://www.youtube.com/v/OtZgwAGGByA&amp;hl=en\" type=\"application/x-shockwave-flash\" wmode=\"transparent\" width=\"400\" height=\"326\"/></object>", "src": "http://www.youtube.com/v/OtZgwAGGByA&hl=en"}], "links": ["http://video.google.com/videosearch?q=911+conspiracy+%2B+controlled+demolition&hl=en&sitesearch=#", "http://www.google.com/search?hl=en&rls=GGLR%2CGGLR%3A2005-50%2CGGLR%3Aen&q=%22Sept.+11%2C+1991%22+%2B+New+World+Order", "http://www.911timeline.net/", "http://video.google.com/videosearch?q=911+conspiracy+%2B+controlled+demolition&hl=en&sitesearch=", "http://educate-yourself.org/cn/coincidence911guide15aug04.shtml", "http://www.statcounter.com/"], "authors": [], "publish_date": null}