{"result_id": "271015", "URL": "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/", "timestamp": "2023-04-25 17:07:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "The Nile And The Euphrates Are Drying Up: Both Rivers Are In The News And Both Rivers Are In The Bible (An Inevitable Famine Is Plaguing The Muslim World)", "cleaned_text": "Egyptian President Abdel Fattah al-Sisi signed agreement on the Grand Ethiopian Renaissance Dam will be a burden on Egypt. Controlling the Nile has dire consequences on agriculture and experts predict famine is on the horizon.\n\nThe Euphrates River and the Nile, both on the news and both are predicted to dry up causing cataclysmic events on the nations that depend on them. The Bible predicts that the Euphrates will stop the flow of water so that 200 million man army enters to make its way to invade Jerusalem and how the Aswan Dam in Egypt will be completely destroyed.\n\nThe Bible also predicted that a war will erupt where Muslim nations will invade Israel, not just over the issue of Jerusalem but over the issue of food (Ezekiel 38:13) and that the price of wheat will skyrocket “A quart of wheat for a denarius, and three quarts of barley for a denarius …” (Revelation 6:6)\n\nSo lets start. Today, Egyptian President Abdel Fattah al-Sisi travelled to Addis Ababa to address Ethiopian lawmakers before traveling to Sudan to sign an agreement on the Grand Ethiopian Renaissance Dam. Its aim is to balance Ethiopia’s economic interests with Egypt’s national security concerns. The Egyptian expert in the Nile Basin Affairs Hani Raslan posted on his Facebook page that “the agreement would be a burden on Egypt”.\n\nEgypt has long worried – with good reason – that upstream water development in Ethiopia would cut off some of its lifeline. Egyptian leaders from Anwar Sadat to Mohammed Morsi have warned of going to war over water if the nation’s supplies became threatened.\n\nA stumbling block to equitable water-sharing in the basin is a 1959 treaty between Muslim Egypt and Muslim Sudan that allocated the entire flow of the Nile to just those two Muslim countries, even though 84 percent of the river’s flow originates in Christian Ethiopia.\n\nNot surprisingly, Ethiopia never recognized the legitimacy of that agreement. But for decades it had neither the political stability nor the financial means to undertake the kind of large-scale water development that would challenge Egypt’s historic claims to the river until the situation changed in 2011 when Egypt was preoccupied with the Arab Spring and the fall of the Mubarak government, Christian Ethiopia announced that it would begin construction of a massive dam on the Blue Nile near the border with Sudan.\n\nThis is the beginning of Egypt’s woes which will make Egypt a dry wasteland. Keep in mind, it was the grain price spikes that contributed to Egypt’s 2011 uprising in the first place which were primarily caused by “droughts in major grain-exporting countries” like Australia. Likewise in Syria. Before Syria erupted into ongoing civil war where 60% of the country went through a devastating drought that led over a million mostly Sunni farmers to migrate to coastal cities dominated by the ruling Shiites, the Alawite sect, further fueling sectarian tensions.\n\nShoebat.com has maintained that the next two years are crucial in that a reshape of the Middle East will effect the outcome on global peace. The Ethiopian dam will be completed in 2017 and will likely jeopardize Egypt’s access to the Nile — access that is critical to sustaining Egypt’s population and economy — because it would give Addis Ababa the power to curb Nile water flows. Egypt needs guarantees this will not happen. However, the division of the Nile and its tributaries (the Blue Nile and the White Nile) between nine different states makes a stable agreement extremely difficult. Until recently, Egypt’s tactic was to push Ethiopia to cancel the dam altogether — the only surefire way for Cairo to guarantee the secure flow of the Nile. With the project now 40 percent complete, Egypt must shift gears and pursue a solid agreement, even if it is one that it cannot be sure will last.\n\nEgypt, on the other hand, is dependent on continued flows but Ethiopia’s dam would give the country the ability to all but cut off the flow of the Blue Nile, which supplies 85 percent of water to the Nile Valley, This will starve all of Egypt’s 82 million population.\n\nNow that this is not far fetched, we could understand how in the Bible, this is precisely what will happen:\n\nThe waters of the river will dry up,\n\n and the riverbed will be parched and dry.\n\n The canals will stink;\n\n the streams of Egypt will dwindle and dry up.\n\n The reeds and rushes will wither,\n\n also the plants along the Nile,\n\n at the mouth of the river.\n\n Every sown field along the Nile\n\n will become parched, will blow away and be no more.\n\n The fishermen will groan and lament,\n\n all who cast hooks into the Nile;\n\n those who throw nets on the water \n\n will pine away. (Isaiah 19:5-8)\n\nThe Nile and the Euphrates, both are in the news and both are in the Bible; the Nile drying in Egypt and the Euphrates drying up in Iraq. It becomes clear then that a major drought while it effects the world, it concentrates primarily the Muslim world. Experts tell us that the Tigris-Euphrates basin comprising Turkey, Syria, Iraq, and western Iran is in great threat. In this month’s issue of the Journal of the AWWA, US water management expert Roger Patrick assesses the state of the scientific literature on water scarcity in all the world’s main regions, finding that local water shortages are now having “more globalised impacts”.\n\nPatrick’s concern is that the Syria crisis could be a taste of things to come. Citing the findings of the Gravity Recovery and Climate Experiment (GRACE) sponsored by NASA and the German Aerospace Centre, he notes that between 2003 and 2009, the Tigris-Euphrates basin comprising Turkey, Syria, Iraq, and western Iran “lost groundwater faster than any other place in the world except northern India”.\n\nPatrick adds that such civil unrest could signal an Egyptian future of continuing unrest and conflict. He highlights the risk of war between Egypt and Ethiopia due to the Grand Ethiopian Renaissance Dam, threatening to restrict Egypt’s access to the Nile River, which supplies 98% of Egypt’s water supply.\n\nStarvation Is Coming To The Muslim World\n\nWith Grain consumption which directly supplies nearly half of our calories, today roughly 40% of the world grain harvest comes from irrigated land, thus it comes as no surprise that irrigation expansion has played a central role in tripling the world grain harvest over the last six decades. Nowhere are falling water tables and the shrinkage of irrigated agriculture more dramatic than in Saudi Arabia, a country as water-poor as it is oil-rich. The Saudis announced in early 2008 that, with their aquifers largely depleted, they would reduce wheat planting by one-eighth each year until 2016, when production would completely end. By then Saudi Arabia projects it will be importing some 15m tonnes of wheat, rice, corn and barley to feed its 30 million people. It is the first country to publicly project how aquifer depletion will shrink its grain harvest.\n\nBut for Saudi Arabia to get wheat from major producing nations which in the future can only sustain themselves, the issue becomes impossible to solve. In Mexico the demand for water is outstripping supply. Mexico City’s water problems are well known. Rural areas are also suffering. In the agricultural state of Guanajuato, the water table is falling by six feet or more a year. In the north-western wheat-growing state of Sonora, farmers once pumped water from the Hermosillo aquifer at a depth of 40 feet. Today they pump from over 400 feet. Mexico may be near peak water use. Peak grain may be imminent.\n\nIn addition to these small and midsize countries, aquifer depletion now also threatens harvests in the big three grain producers – China, India and the US – that together produce half of the world’s grain. The question is not whether water shortages will affect future harvests in these countries, but rather when they will do so.\n\nAmong the big three, dependence on irrigation varies widely. Some four-fifths of China’s grain harvest comes from irrigated land, most of it drawing on surface water, principally the Yellow and Yangtze rivers. For India, three-fifths of its grain is irrigated, mostly with groundwater. For the US, only one-fifth of the harvest is from irrigated land. The bulk of the grain crop is rain-fed, produced in the highly productive Midwestern Corn Belt where there is little or no irrigation.\n\nSyria, a country of 22 million people riddled by civil war, is also overpumping its underground water. Its grain production peaked in 2001 and during the years since has dropped a whopping 32%. It, too, is becoming heavily dependent on imported grain.\n\nIn neighboring Iraq, grain production has plateaued over the last decade. In 2012 it was dependent on the world market for two-thirds of its consumption. In addition to aquifer depletion, both Syria and Iraq are also suffering from a reduced flow in the Tigris and Euphrates rivers as upstream Turkey claims more water for its own use.\n\nToday, when one turns on the news, we see the troubled country of Yemen, a nation of 24 million people that shares a long border with Saudi Arabia, the water table is falling by roughly six feet a year as water use outstrips aquifer recharge. With one of the world’s fastest-growing populations and with water tables falling throughout the country, Yemen is fast becoming a hydrological basket case. Grain production has fallen by nearly a whopping half over the last 40 years. Yemen has only one year left to starve. By the end of 2015, irrigated fields will be a rarity and the country will be importing virtually all of its grain. Living on borrowed water and borrowed time, Yemen could disintegrate into a group of tribal fiefdoms warring over water. For the first time in history, grain production is dropping in a geographic region with nothing in sight to arrest the decline.\n\nOther countries with much larger populations are also near or beyond peak water. In Iran, a country with 77 million people, one-quarter of its current grain harvest is based on overpumping. With its population growing by a million people per year, it, too, faces a day of reckoning.\n\nPakistan, with a population of 182 million which most of its irrigation water comes from the Indus river system where Islamabad and Rawalpindi showed a fall in the water table every year and in Balochistan, which borders Afghanistan, water tables around the capital, Quetta, are falling by 11.5 feet per year – pointing to the day when the city will run out of water with six of Balochistan’s seven basins have exhausted their groundwater supplies, leaving their irrigated lands barren.\n\nIn a World Bank study, water expert John Briscoe says: “Pakistan is already one of the most water-stressed countries in the world, a situation which is going to degrade into outright water scarcity due to high population growth.” He then notes that “the survival of a modern and growing Pakistan is threatened by water.”\n\nIt is no wonder, that with the Muslim world, a society that is already conspiracy theory driven, that Israel will be blamed (see Ezekiel 38) for their stravation which is eminent: “A quart of wheat for a denarius, and three quarts of barley for a denarius …” (Revelation 6:6) The price of wheat is addressed in Scripture at a silver denarius per quart for a reason. In New Testament times, the silver coin weight was 3.65 grams. A U.S. mint quarter has 5.625 grams of silver. If we take a measure of wheat to be a quart (32 ounces) and the price of wheat at an average of $332 per 2000 pounds (metric ton) which is 32 cents a quart in today’s prices, then a silver denarius (3.65 grams) is at $3.24. This would mean that the price of bread will increase to 10 fold. The Euphrates in Iraq will see a similar cataclysmic event as in the Nile. The Turkish Anatolia Project (GAP) is an ambitious development project meant to control, sustain, and distribute the water resources of this river basin from within Turkey, the nation which serves as the source of 88% of the Euphrates’s water and 43% of the Tigris River (Lupu 2002).\n\nWesterners argue that the reason the Kings of the East in Revelation come from China is the staggering number of soldiers—a 200-million-man army. But a hungry Muslim world can easily muster this if you consider Iraq, Iran, Afghanistan uniting with Turkey Kazakhstan, Kyrgyzstan, Azerbaijan and Tajikistanand, even Indonesia east of the Euphrates with several kings, this now has become feasible.\n\nSo we know the end result of Al-Sisi’s efforts in the agreement on the Grand Ethiopian Renaissance Dam. Egypt borders Cush. The Nile river flows into the southern border of Egypt from the modern nation of Sudan, known officially since 1989 as the Islamic Republic of Sudan. Therefore, Cush is Sudan.\n\nCush of Ezekiel’s day was simply the region immediately south of Egypt often called Nubia. In Scripture, Cush was often associated with Egypt and was a border nation to her: “I will make the land of Egypt a ruin and a desolate waste from Migdol,” (Northern Egypt) “to Aswan,” (Today in southern Egypt) “as far as the border of Cush.” (Ezekiel 29:9-10)\n\nThe only legitimate identification of Cush then is modern Sudan, officially known as The Islamic Republic of Sudan since 1989. While Sudan does have a large Christian minority, it is ruled by the Muslim majority. Today Sudan is an absolute cesspool of Islamic oppression toward Christians and anyone who is not an Arab Muslim. The Sudanese Arab Muslim Government is even killing the native African Muslims.\n\nThe region of Cush could also extend to the south of Sudan into Somalia. Somalia is a rabidly Islamist nation that may very well be included in the invasion. While Muslim Egypt and Muslim Sudan will starve, Christian Ethiopia will not and Israel, while it suffers, it will be victorious, for God watches her from above.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Nile And The Euphrates Are Drying Up: Both Rivers Are In The News And Both Rivers Are In The Bible (An Inevitable Famine Is Plaguing The Muslim World) - Walid Shoebat", "description": "By Walid Shoebat Egyptian President Abdel Fattah al-Sisi signed agreement on the Grand Ethiopian Renaissance Dam will be a burden on Egypt. Controlling the Nile has dire consequences on agriculture and experts predict famine is on the horizon. The Euphrates River and the Nile, both on the news and both are predicted to dry up causing cataclysmic […]", "url": "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/", "site_name": "Walid Shoebat", "article:published_time": "2015-03-23T23:37:04+00:00", "article:modified_time": "2015-03-24T02:09:30+00:00", "image": "https://shoebat.com/wp-content/uploads/2015/03/challenges-and-opportunities-of-the-nile-transboundary-waters-10-638.jpg", "image:width": "638", "image:height": "479"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "660", "height": "415", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/TI6VaNG8_nE\" width=\"660\" height=\"415\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/TI6VaNG8_nE"}], "links": ["http://shoebat.org/wp-content/uploads/2015/03/challenges-and-opportunities-of-the-nile-transboundary-waters-10-638.jpg", "http://shoebat.org/wp-content/uploads/2015/03/Nile-River.jpg", "http://shoebat.org/wp-content/uploads/2015/03/cmimg_52658.jpg", "http://shoebat.org/wp-content/uploads/2015/03/ShowImage.ashx_.jpg", "http://shoebat.org/wp-content/uploads/2015/03/g-wld-090415-iraq-marsh1-730a.grid-6x2.jpg", "https://www.theguardian.com/world/saudiarabia", "http://shoebat.org/wp-content/uploads/2015/03/GR_PR_SaudiHarvest.png", "http://shoebat.org/wp-content/uploads/2015/03/euphrates-tigris-valley-map.jpg", "http://voices.nationalgeographic.com/2015/03/20/nile-river-nations-agree-to-cooperate-but-danger-lurks-for-one-of-planets-great-wetlands/", "http://www.middleeasteye.net/columns/new-age-water-wars-portends-bleak-future-804130903", "http://northdenvernews.com/lester-brown-on-peak-water/", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=facebook", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=twitter", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=reddit", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=linkedin", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/#print", "#", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=skype", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=jetpack-whatsapp", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=telegram", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=pocket", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=pinterest", "https://shoebat.com/2015/03/23/the-nile-and-the-euphrates-are-drying-up-both-rivers-are-in-the-news-and-both-rivers-are-in-the-bible-an-inevitable-famine-is-plaguing-the-muslim-world/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2015-03-23T23:37:04+00:00"}