{"result_id": "271035", "URL": "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/", "timestamp": "2023-04-25 17:07:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Virginia Plans Mandatory COVID-19 Vaccines", "cleaned_text": "There is a lot of talk right now about what to do about COVID-19. Unfortunately, the response of states to the virus is as consistent as gun laws are- not only is there no sense of uniformity, but many are divided against each other with arguable chaos being the constant that unites them all. The conflict between the states reflects that between the citizenry, and it gets worse with each day.\n\nIn a controversial move reported on by WRIC local news, the state of Virginia may force its residents to get a COVID-19 vaccine.\n\nState Health Commissioner Dr. Norman Oliver told 8News on Friday that he plans to mandate coronavirus vaccinations for Virginians once one is made available to the public. Virginia state law gives the Commissioner of Health the authority to mandate immediate immunizations during a public health crisis if a vaccine is available. Health officials say an immunization could be released as early as 2021. Dr. Oliver says that, as long as he is still the Health Commissioner, he intends to mandate the coronavirus vaccine. “It is killing people now, we don’t have a treatment for it and if we develop a vaccine that can prevent it from spreading in the community we will save hundreds and hundreds of lives,” Oliver said. Under state law, only people with a medical exemption could refuse the mandate. The Virginia General Assembly is considering a bill during an ongoing special session that would allow people with religious opposition to opt-out of the requirement. The bill needs to clear a committee in the House of Delegates before the full chamber could vote on it. Oliver says he strongly opposes the bill. He doesn’t know what the punishment would be for non-compliance but expects that most people will respond well to the mandate. Meanwhile, a new poll suggests more than one in three Americans aren’t interested in getting a coronavirus vaccine. Even though health officials say it will be safe, some have raised concerns about the speed of development. “We would not launch a campaign around mass vaccination with anything that hasn’t proven to be safe,” Oliver said. Virginia Freedom Keepers Director of Communications Kathleen Medaries, a mother of three from Chesterfield, says this is a matter of medical choice. “This is not a Republican or Democrat issue. It’s not a pro-vaccine or anti-vaccine issue, ” Medaries said. “For me, it’s an issue of being able to assess each vaccine for myself and my family one at a time.” Oliver believes that, in the case of COVID-19, public health takes precedent over choice. He said herd immunity is the state’s best defense to stop the spread. “He shouldn’t be the one person to make a decision for all of Virginians,” Medaries responded. (source)\n\nWill a COVID-19 vaccine be effective? One has yet to see, as the race is on to develop one. Indeed, there are many vaccines required of people in various professions, but given the politicization of this virus, there are legitimate concerns about taking it. First, will it be effective, and second, since it is being ‘pushed’ and essentially also rushed, the possibility of creating a vaccine with good intentions but that has a lot of unintended negative consequences is a real possibility. Third, how this affects people from other states is yet to be seen if such was to go through- for example, would people who work in another state from where they live also have to get vaccinated, as one of a host of questions. Fourth, if this vaccine is mandatory, what happens in the case of adverse reactions- I speak not of unintended consequences (such as a bad vaccine by a design flaw), but something like an allergic reaction- does the state or manufacturer (or both) get sued?\n\nWhat I am saying is that the COVID-19 vaccine is opening up a host of potentially nightmarish legal consequences and fights, but with the central theme uniting all is (a) disorder and (b) politicization of something that should not be politicized.\n\nPandemics happen. They are a fact of human life. They are not fun, but the historical record shows that these things are not abnormal. In fact, the world has arguably (by historical standards) been due for a pandemic, and this time it happens to be COVID-19. Historically speaking, the way that pandemics are stopped is by slowing the flow of social life, taking safety precautions, allowing the pandemic to pass, and then resuming life as normal. But this is not what it happening. Instead, the virus has become a weapon for acquiring power and advancing strange agendas, and the result of this is that just about everyone loses save for those seeking to advance said manipulation.\n\nWith the spread of COVID-19 cases in New York, Massachusetts, Connecticut, New Jersey, California, and other states who have taken stronger measures than other states, it will be interesting to see the political consequences of such a potential legal fight, as they will likely be more deadly than the virus itself it, for viruses and pandemics pass, but political effects can last for centuries.\n\nDonate now to help support the work of this site. When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "Virginia Plans Mandatory COVID-19 Vaccines - Walid Shoebat", "description": "There is a lot of talk right now about what to do about COVID-19. Unfortunately, the response of states to the virus is as consistent as gun laws are- not only is there no sense of uniformity, but many are divided against each other with arguable chaos being the constant that unites them all. The […]", "url": "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/", "site_name": "Walid Shoebat", "article:published_time": "2020-08-22T15:57:15+00:00", "article:modified_time": "2020-08-22T16:45:18+00:00", "image": "https://shoebat.com/wp-content/uploads/2020/08/08222020a.png", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shoebat.com/wp-content/uploads/2020/08/08222020a.png", "http://archive.is/O6F4M", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=facebook", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=twitter", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=reddit", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=linkedin", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/#print", "#", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=skype", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=jetpack-whatsapp", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=telegram", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=pocket", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=pinterest", "https://shoebat.com/2020/08/22/virginian-plans-mandatory-covid-19-vaccines/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2020-08-22T15:57:15+00:00"}