{"result_id": "271027", "URL": "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/", "timestamp": "2023-04-25 17:07:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Biden Makes Major Slip-Up In Interview Over Voter Fraud Comments", "cleaned_text": "Errors of speech are real. Freudian slips are real as well. One can decide how one wants to interpret this, but what cannot be denied is a recent video from Zero Hedge showing Biden making a very interesting statement about voter fraud.\n\nFormer Vice President Joe Biden suffered from either a senior moment or a Freudian slip on Saturday, when he told Pod Save America host Dan Pfeiffer – a longtime Obama aide – that his campaign has assembled the “most extensive and inclusive voter fraud organization in the history of American politics.” “What’s your message to the folks who have not yet voted or do not yet have a plan to vote. And part two, for the 50 million Americans who’ve already voted, what can they do over the last ten days to help make sure that you’re the next President of the United States?” Pfeiffer asked Biden. Biden returned word salad at first, saying “Well, first of all, you know, uh, what really rankles, uh, my opponent is I say that, uh, the thing that bothers him most is he’s not a patch on Barack’s jeans. I mean, you know Barack was one hell of a president, and I tell you what, man, what an honor it was — I think you guys believe it, too — to serve with him. I mean, incredible honor. And, uh, I’m not being solicitous. I really mean that. Um, he had more integrity in his little finger than most people have in their whole body and he had a backbone like a ramrod. Has one.” “Secondly, we’re in a situation where we have put together — and you’d [sic] guys, did it for our, the president Obama’s administration, before this — we have put together, I think, the most extensive and and inclusive voter fraud organization in the history of American politics. What the president is trying to do is discourage people from voting by implying their vote won’t be counted, it can’t be counted, we’re gonna challenge it, and all these things. If enough people vote, it’s gonna overwhelm the system. You see what’s happening now. You guys know it as well as I do. You see the long, long lines in early voting. You see the millions of people who have already cast a ballot.” (source)\n\nNow it is true that one can say, correctly so, the context of his words suggests that he means something else. However, one also knows that in certain situations, there are some words you just don’t say. For example, the word “bomb”- even well before 9/11 -is never a word ever to be said in any way at an airport just as if one is vacationing in Thailand, nothing is ever to be said about the Thai king for any reason. Only trouble can come from it.\n\nThe fact that Biden would even mention this phrase falls into this category, since at a time when the political elections are more vile in tone than ever before, any talk of “cheating” from any side is only going to trigger finger-pointing and accusations of cheating.\n\nIf anything, Biden’s words help Trump, since many would draw on them the suggestion that Biden is cheating or may cheat, and that if Biden does pull ahead in an area, Trump can call out ‘Cheating Joe’ (as one example of a name he might use) and people may be inclined to believe him.\n\nThere are some things better off not said, even if meant well, and given the trends to chaos in a reflection of what may become another Election 2000, every word will count come Election Day.\n\nDonate now to help support the work of this site. When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "Biden Makes Major Slip-Up In Interview Over Voter Fraud Comments - Walid Shoebat", "description": "Errors of speech are real. Freudian slips are real as well. One can decide how one wants to interpret this, but what cannot be denied is a recent video from Zero Hedge showing Biden making a very interesting statement about voter fraud. Former Vice President Joe Biden suffered from either a senior moment or a […]", "url": "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/", "site_name": "Walid Shoebat", "article:published_time": "2020-10-25T22:48:11+00:00", "image": "https://shoebat.com/wp-content/uploads/2020/10/10252020b.jpg", "image:width": "857", "image:height": "500"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/C6u1uKznCYw?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/C6u1uKznCYw?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://shoebat.com/wp-content/uploads/2020/10/10252020b.jpg", "https://www.zerohedge.com/political/joe-biden-brags-about-assembling-most-extensive-inclusive-voter-fraud-organization", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=facebook", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=twitter", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=reddit", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=linkedin", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/#print", "#", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=skype", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=jetpack-whatsapp", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=telegram", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=pocket", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=pinterest", "https://shoebat.com/2020/10/25/biden-makes-major-slip-up-in-interview-over-voter-fraud-comments/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2020-10-25T22:48:11+00:00"}