{"result_id": "271012", "URL": "https://shoebat.com/2021/03/09/the-vaccine-passports-are-coming/", "timestamp": "2023-04-25 17:07:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/03/09/the-vaccine-passports-are-coming/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "The Vaccine Passports Are Coming", "cleaned_text": "With the current COVID crisis not going away, and as Shoebat.com and other sites have reported, based on information and reports from multiple news outlets, government reports, and private studies, because there is a strong chance this virus will not fully disappear until about 2027 (another politically interesting year), the question is if “vaccine passports”, or essentially travel documents, will be require to travel between nations. According to France24, while not being required, many nations around the world seem to be moving to adopt such a system.\n\nFrom digital certificates to “health passports”, countries and airlines across the globe are hoping to relaunch travel by letting people prove their Covid-free status.\n\nBut with patchy vaccine access around the world and mounting concerns over data privacy, questions are swirling about how the measures will work in practice.\n\nMost programmes under development are geared towards facilitating travel and come in the form of smartphone apps with varying criteria for a clean bill of health.\n\nVaccine passports, for example, are a popular way to approach proof of immunity with jab rollouts underway across the globe.\n\nThere are also apps that accept positive antibody tests as proof of immunity for those who have had the virus and recovered.\n\nBut the World Health Organization has warned that there is no evidence to show that recovered Covid sufferers with antibodies are protected from a second infection.\n\nFrench President Emmanuel Macron recently suggested yet another, more localised form of Covid-free permission slip: the so-called “health pass”.\n\nThis certification would only be valid within France’s borders but would allow a fully vaccinated person to, for example, eat in restaurants and attend certain events.\n\n– Is it an official travel document? –\n\nNo, and there is currently no effort underway to establish a required document to travel between countries.\n\nThe Chinese health passport is an attempt to make it easier for its citizens to travel abroad, but without recognition from other countries it is of little use.\n\nFor the moment, the applications are meant to facilitate various health checks still in place at different borders, with airlines among major proponents.\n\nThrough several of its member carriers, the International Air Transport Association has been offering a digital pass allowing passengers to easily prove their health status before boarding.\n\n– Can we make it official? –\n\nMaking health passports stricter or requiring them for travel could invite legal challenges.\n\nA major worry is that banning unvaccinated people from travelling would exacerbate inequality since access to jabs is far from universal.\n\nThere are also concerns over how applications would access users’ personal data.\n\n (source)", "opengraph": {"locale": "en_US", "type": "article", "title": "The Vaccine Passports Are Coming - Walid Shoebat", "description": "With the current COVID crisis not going away, and as Shoebat.com and other sites have reported, based on information and reports from multiple news outlets, government reports, and private studies, because there is a strong chance this virus will not fully disappear until about 2027 (another politically interesting year), the question is if “vaccine passports”, […]", "url": "https://shoebat.com/2021/03/09/the-vaccine-passports-are-coming/", "site_name": "Walid Shoebat", "article:published_time": "2021-03-09T19:43:45+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/03/03092021b.jpg", "image:width": "343", "image:height": "147"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.france24.com/en/live-news/20210309-cleared-for-takeoff-world-eyes-health-passports"], "authors": [], "publish_date": "2021-03-09T19:43:45+00:00"}