{"result_id": "271013", "URL": "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/", "timestamp": "2023-04-25 17:07:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Watch Out- Even The Liberals Are Warning Of A Pending \"October Surprise\"", "cleaned_text": "You heard about it first here at Shoebat.com, where Ted, Walid, and I have been warning that based upon historical patterns, there is the possibility of an “October Surprise” type moment that could happen in the 2020 election. Indeed, this is something that the “liberals” are well-aware of, as NPR notes that such a moment may happen:\n\nAttorney General William Barr has promised the Justice Department will not take any action to influence the upcoming election. But Democrats and department veterans aren’t so sure about that. In opinion pieces and letters, they warn that Barr might be preparing to spring an “October Surprise.” There’s one big reason for that: recent testimony from the attorney general himself. Democrats are monitoring the status of an investigation by prosecutor John Durham, who appears to be looking at intelligence gathering and other actions by the Obama administration in 2016. Barr tapped Durham to look into the origins of the Russia investigation in May 2019. When Rep. Debbie Mucarsel-Powell, D-Fla., asked Barr whether he would commit to not releasing any report by Durham before the November election, Barr said bluntly, “No.” Durham has been on the job for more than a year now, leading some lawyers familiar with the investigation to believe he may be close to the end. One such source told NPR that Durham has asked to interview former President Barack Obama’s CIA director, John Brennan, confirming a report by NBC News. That source said both sides are trying to iron out details for the interview, which largely involves technical questions. The source added that Brennan has been told he is not a target of prosecutors. For his part, the attorney general said Obama and former Vice President Joe Biden, who’s now running for president, are not targets in the case either, and that criminal investigations are focused on others. By subscribing, you agree to NPR’s terms of use and privacy policy. NPR may share your name and email address with your NPR station. See Details. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. One may be former FBI lawyer Kevin Clinesmith, who allegedly doctored an email used as part of a process to secure court approval to renew surveillance on onetime Trump campaign adviser Carter Page. Those surveillance applications contained major errors identified by independent Inspector General Michael Horowitz and highlighted by Republicans in Congress. A second area of interest may be the leak of sensitive information to a Washington Post columnist in early 2017 about conversations that incoming Trump national security adviser Michael Flynn was having with the Russian ambassador after the election. The full scope of Durham’s probe is a closely held secret. Barr has said he expects the prosecutor will put some findings in writing in the form of a report that may be made public. Barr told the House Judiciary Committee on July 28 that he’s well aware of the longstanding Justice Department policy that bars taking action that could produce uproar in an election year. “Any report will be, in my judgment, not one that is covered by the policy,” he said. (source)\n\nThe phrase “October surprise” is attributed to former CIA Director and then-campaign manager of Ronald Reagan’s 1980 presidential campaign William Casey. However, there are more events that can be described as “October surprises”, which preceded its use by Casey, and some even say that the idea of an “October surprise” is a long-assumed concept in American politics, going back to the going back to the 19th century.\n\nA lot can happen in a few days in an election, and considering the chaos of the last four years, the complete and utter lack of any energy, direction, and mental clarity (in the literal sense) of Biden or his campaign, as well as the upheavals caused by the COVID-19 coronavirus, the nation is ripe for an election-time type surprise that could help Trump secure victory.\n\nThe chances of a Trump victory are firmly in his favor, and have been for a while. They are significantly weakened, but the weakness caused by Trump’s non-followup with his 2016 campaign promises has been overshadowed by the awful Biden campaign.\n\nBe aware that if Trump wins, the political pendulum WILL be set for a major Democrat 2024 victory. This is not to say that a Republican could not win in 2024, but that the pattern would be set against whoever the Republican challenger would be, and that unless he can bring a serious platform to the public political arena, then it would only be natural to expect a repeat of 2008, except this time with a “new Obama” that, if patterns continue play as they often do, will result in eight years of Republican complaints as the country continues down the road to perdition that both Democrat and Republican have either placed her on or from which they do not deviate from the path but only drive faster to the same end, all the while pointing at each other about how bad the other one is while ignoring each other’s own actions.\n\nDonate now to help support the work of this site. When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "Watch Out- Even The Liberals Are Warning Of A Pending \"October Surprise\" - Walid Shoebat", "description": "You heard about it first here at Shoebat.com, where Ted, Walid, and I have been warning that based upon historical patterns, there is the possibility of an “October Surprise” type moment that could happen in the 2020 election. Indeed, this is something that the “liberals” are well-aware of, as NPR notes that such a moment […]", "url": "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/", "site_name": "Walid Shoebat", "article:published_time": "2020-08-09T18:58:07+00:00", "image": "http://shoebat.com/wp-content/uploads/2020/08/08092020b-300x157.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shoebat.com/wp-content/uploads/2020/08/08092020b.png", "http://archive.is/iq83t", "https://www.politico.com/magazine/story/2016/10/october-surprises-214320", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=facebook", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=twitter", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=reddit", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=linkedin", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/#print", "#", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=skype", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=jetpack-whatsapp", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=telegram", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=pocket", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=pinterest", "https://shoebat.com/2020/08/09/watch-out-even-the-liberals-are-warning-of-a-pending-october-surprise/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2020-08-09T18:58:07+00:00"}