{"result_id": "271006", "URL": "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/", "timestamp": "2023-04-25 17:07:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "While India Prepares To Genocide Christians, The US And EU Selectively Focus On China", "cleaned_text": "In both China and India, Christian persecution is very real and a threat. It should not be underemphasized in either nation. There has been a tremendous amount of talk about this in China, and how the Chinese communists are abusing Christians and Muslims, such as the Uyghurs.\n\nA group of ethnic minorities is praising the Biden administration and United States allies for placing sanctions on top Chinese officials in response to human rights abuses in Xinjiang province, which Secretary of State Anthony Blinken said amounts to “genocide.” The State Department announced the new sanctions Monday, four days after Blinken met with top Chinese government officials in Anchorage, Alaska. “Today, the United States, in unity with our partners, is imposing sanctions against Wang Junzheng, the Secretary of the Party Committee of the Xinjiang Production and Construction Corps and Chen Mingguo, Director of the Xinjiang Public Safety Bureau,” Blinken said in a statement. “We are doing so in response to serious human rights abuse against members of ethnic and religious minority groups in Xinjiang.” Blinken said that the U.S. issued the sanctions in solidarity with its allies in United Kingdom, Canada and the European Union. In January, during the final days of the Trump administration, the State Department declared persecution of Muslim minorities in western Xinjiang province, including mass internment, forced labor, and forced sterilization, as “genocide” and “crimes against humanity.” “Wang is being designated for having acted or purported to act on behalf of, directly or indirectly, the XPCC,” Blinken’s announcement reads. “Chen is being designated for being a foreign person who is a leader or an official of the XPSB, which is engaged in, or whose members have engaged in, serious human rights abuse related to Chen’s tenure.” Blinken called on China to “bring an end to the repression” of Uyghurs and other minority groups by “releasing all those arbitrarily held in internment camps and detention facilities.” It’s been estimated that as many as 1 million to 3 million ethnic minorities have been detained in internment camps in western China. “Amid growing international condemnation, the PRC continues to commit genocide and crimes against humanity in Xinjiang,” Blinken assured, indicating the Biden administration’s agreement with the “genocide” declaration issued by the Trump administration. Members of the U.S. Commission on International Religious Freedom praised the U.S. and western governments’ decision to sanction China. “Yesterday’s announcement of coordinated sanctions by the United States and like-minded partners sends an unmistakably clear message to the Chinese Communist Party that the international community will not tolerate its repressive, genocidal policies in the Uyghur region,” said USCRIF Commissioner and Uyghur-American Nury Turkel. “The atrocities that the CCP has committed, and continues to commit, are an affront to humanity as well as to universal values and international law to which China has agreed. USCIRF calls on the Chinese government to end its horrific abuse against Uyghurs and other Turkic Muslims once and for all.” USCIRF Commissioner Gary Bauer, a longtime social conservative activist, remarked that “imposing sanctions against CCP officials both expose their crimes and provide much-needed encouragement to the Uyghurs and other freedom-loving people who are suffering under the CCP’s brutality.” In response to the sanctions, China issued sanctions of their own. CNN reports that China sanctioned 10 EU leaders and four entities for “maliciously spreading lies and disinformation.” (source)\n\nIt is good to talk about what the Chinese communists are doing.\n\nHowever, there is almost no attention being given in any serious way to what the nationalists- the Hindu nationalists -are doing to Christians in India.\n\nI have made very clear at Shoebat.com that India has been severely persecuting Christians. We have watched India enter into the top ten list of the worst Christian persecutors and progressively move to not just promote racist, Hindu supremacist groups such as the RSS or VHP to positions of power and ignore their crimes against Christians, but to ignore or harass Christians for being persecuted. Church burnings are regular, and as Shoebat.com reported on years ago, one anti-Christian attack takes place every 40 hours. Since things have become worse, it is possible a new study may show an increase.\n\nSo why is there so much criticism of China and ‘communism’ doing this- a very real thing, I must emphasize -but nothing about India and the “saffron terror”, as they are called? The answer is as simple as what was said above- the US sides with nationalist groups, including ones with open racialist leanings, as a part of her geopolitical policy in order to counter the international socialism and communism backed by the Russians for the same reasoning, in an extension of the Cold War that truly never ended.\n\nIf one is going to criticize ‘communists’, and one should, it cannot be done apart from the criticism of the ‘nationalists’, because they are equally evil since both operate from the error of materialistic philosophy and darwinism, where religion is but a tool to realize temporal ends, and power is to be gained at all cost with respect to none.\n\nThink about it- the US has shown a hatred of Christianity. After all, why else would the LGBT be so advanced all the time by persons in government, and why the US would force support of sodom on other nations? Yet here the US is ‘supporting Chinese Christians’ as well as Muslims, but completely ignoring the horrendous abuse and calls for genocide that her ally, India, is doing against both groups.\n\nThe US doesn’t care about Christians. No amount of lobbying is going to change this because this is about greater US foreign policy tied to long-term interests. To put it in a very hard way, but most likely the truth, unless one has the ability to completely blackmail key persons in positions of power with the worst possible kinds of blackmail that one can think of that exists (for example, a recent scandal involving the name of a certain Italian-American food often topped with pepperoni), nothing is going to happen.\n\nI have maintained that if one is a Christian living in India, or has family in India, now is the time to try to leave India because India in 2021 is Germany for a Jew in 1931. The patterns are very clear. The Hindu nationalists are coming for Christians, they hate Christianity, and they want to realize what happened in Europe last century but for their context. The US and EU will not help because they do not care about Christians. Be ready.\n\nDonate now to help support the work of this site. When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "While India Prepares To Genocide Christians, The US And EU Selectively Focus On China - Walid Shoebat", "description": "In both China and India, Christian persecution is very real and a threat. It should not be underemphasized in either nation. There has been a tremendous amount of talk about this in China, and how the Chinese communists are abusing Christians and Muslims, such as the Uyghurs. A group of ethnic minorities is praising the […]", "url": "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/", "site_name": "Walid Shoebat", "article:published_time": "2021-03-26T18:54:31+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/03/0316101c.png", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shoebat.com/wp-content/uploads/2021/03/0316101c.png", "https://www.christianpost.com/news/us-eu-sanction-chinese-officials-over-uyghur-human-rights-abuses.html", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=facebook", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=twitter", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=reddit", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=linkedin", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/#print", "#", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=skype", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=jetpack-whatsapp", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=telegram", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=pocket", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=pinterest", "https://shoebat.com/2021/03/26/while-india-prepares-to-genocide-christians-the-us-and-eu-selectively-focus-on-china/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-03-26T18:54:31+00:00"}