{"result_id": "271042", "URL": "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/", "timestamp": "2023-04-25 17:07:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Homosexual Activists Tell Kim Davis: 'We Will Kidnap Your Husband, Tie Him Up And Force Him To Watch Us Raping You. We Will Burn You Alive.' Civil Unrest Is Coming To America", "cleaned_text": "Homosexual activists are sending sadistic threats to Kim Davis, saying that they will capture her husband, tie him up and force him to watch them rape her. They also said that they will burn her house as they sleep and burn them to death. Here is the video with the full story and commentary:\n\nKim Davis said in an interview:\n\nThe homosexual movement is the most hateful and most vile group in all of the Western world. The sodomites are supremacists; they believe that they have the superior lifestyle, a disposition and constitution more superior than the “others,” who they consider as inferior breeders. This is the ideology of sodomism.\n\nSodomism is the ideology of homosexual superiority, in which the homosexuals desire to usher in — through propaganda, violence and state coercion — a utopia in which homosexuality is seen as a supreme ideal, and those who believe in the conjugal union as is affirmed and established by the Christian Faith, are viewed and treated as enemies.\n\nMany empires have advanced sodomism, with each attaching it to a particular religion. The Roman Empire advanced sodomism as it was associated with their own religion; the Seleucids advanced sodomism as it was associated with their hybrid religion of Syrian and Greek mythologies; the Greeks did the same, as did the Samurai and the Muslims.\n\nSt Paul was a witness to this supremacist way of thinking. He described the homosexuals as “proud, boasters,” (Romans 1:30) and as “leaving the natural use of the woman” (Romans 1:26). They are proud because they reject the woman, and this can only be described as someone esteeming himself as superior because of his homosexuality. While the modernist heretics of today want to accuse us of sexism, they praise the greatest form of sexism, and that is homosexuality, where gender is seen as insignificant, the role of the woman is seen as nothing, and where a child having the chance to be raised by a woman, is viewed as frivolous, and any objection to this is viewed as dangerous.\n\nIts quite interesting that the Bible describes the sodomites as proud, and today they flood the streets and call their assemblies a “pride rally.” They are proud of their sodomism, and lift their heads above humanity. We see this in the story of Lot in Sodom and Gomorrah. The homosexuals surround the house and cry out, “Where are the men who came to you tonight? Bring them out to us that we may know them carnally.” (Genesis 19:5) They immediately wanted men, seeing the conjugal union as inferior.\n\nThis dark sentiment fully manifested itself once Lot cowardly offered his daughters to satisfy their violent lusts, and they said: “Stand back!” (Genesis 19:9) They wanted nothing to do with women, because at that point, they had totally plunged themselves into the prison of the demonic and fled away from the higher humanity; but not only this, it was because they saw the woman as inferior, and homosexual sodomy as superior.\n\nThere is no other reason as to why the sodomites wanted to abolish marriage between a man and a woman, than that they view the conjugal union as inferior to their sexual anarchy. They see sexual anarchy as superior to orthodox monogamy, and this is why they demanded the redefining of marriage. It was purely a supremacist push.\n\nThe problem is that the Christians of the West kept insisting that they “loved” sodomites, and that sodomites needed to be treated as equals. Instead, what we should have been doing from the beginning, and what we should continue to do, is declare the Christian Faith as superior to the diabolical ideology of sodomism; we should always be exclaiming the Christian religion to be supreme, as opposed to continuously apologizing and pre-qualifying our affirmations against the homosexuals. We should not be referring to modern thinking, but to St. Peter when he described the homosexuals as “natural brute beasts made to be caught and destroyed” (2 Peter 2:12).\n\nThe modernly minded Christian will say, “All homosexuals are made in the image of God,” but St. Peter compares them to animals, and we can refer to Christ Who said: “Do not give what is holy to the dogs; nor cast your pearls before swine” (Matthew 7:6). Christ calls them animals, because they have lost that image of God that was infused into humanity when God created Adam and Eve. The demons possessed two men, and when they saw Christ, the men were ready to be liberated from the bondage of darkness. The demons begged to be cast into pigs, because through Christ man is an icon of God, and no demon can possess him unless he has reduced himself to the prison of Satan.\n\nWe should be referring to St. Paul who referred to homosexuals as “deserving of death, not only do the same but also approve of those who practice them.” (Romans 1:32) St. Peter tells us that when Lot lived in Sodom he “was oppressed by the filthy conduct of the wicked (for that righteous man, dwelling among them, tormented his righteous soul from day to day by seeing and hearing their lawless deeds)” (2 Peter 2:7-8). His very soul was oppressed by the homosexual darkness. So are we not oppressed? Why don’t we sense the hand of the deranged tyrant, why don’t we revolt against the tyranny of confusion and anarchy that is being imposed upon us?\n\nThe problem is that many people, while expressing disagreement to homosexual “marriage,” are attached to the sodomites. They have “gay friends,” or they have “relatives who are gay,” and they are attached to them because of their likeableness. They do not adhere to the command of Christ: “Remember Lot’s wife.” (Luke 17:32) Lot wanted to flee Sodom, he hated it, but his wife, on the other hand, had an attachment to the wicked city, and so she “looked back behind him, and she became a pillar of salt.” (Genesis 19:26) The next time you hear someone say, “Christ never mentioned homosexuality,” you can quote Christ when He said: “Remember Lot’s wife.” (Luke 17:32)\n\nPeople are confused as to why “gay marriage” has had so much success in the US when the majority of Americans oppose it. You can complain at the government all you want, the ultimate reason as to why “gay marriage” succeeded, is because many of these same Americans who oppose “gay marriage” do not want to remember Lot’s wife. They are attached. They are attached to their “gay friends,” they are attached to their favorite gay characters on their favorite TV shows, they are attached to Sodom. The ultimate cause for same-sex marriage’s success is because the West is filled with Lot’s wives.\n\nThe homosexual movement cloaks itself as a gentle and tender group, with gay men portraying themselves as caring, sensitive to your emotions, and concerned for your hurt feelings. This is far from the truth. Underneath all of the smiles, is an offense against the good, and while they present themselves as outgoing and fun-loving, within them is a declaration of war against Heaven itself. What most do not know, is that the common image of the “fun loving gay man,” was a propaganda tool that the sodomites made up as a way to help portray themselves as harmless in order to desensitize the society to sodomism.\n\nIn 1987, an article entitled, The Overhauling of Straight America, by two sodomites — Marshall Kirk and Erastes Pill — was published. In the article lied the strategy to conquer America with sodomism. One of the strategies was called, “PORTRAY GAYS AS VICTIMS, NOT AS AGGRESSIVE CHALLENGERS” and “TALK ABOUT GAYS AND GAYNESS AS LOUDLY AND AS OFTEN AS POSSIBLE”, to which they explained how to use the portrayal of gays as harmless victims and the utilization of Hollywood as a means to remove the guard that American society once had against homosexuality:\n\nIn films and TV shows, sodomites have been and are being portrayed as nice and humorous people. This is being done as a way to cover up for their true demonic goals: tyrannize Christians in a utopia where homosexuals are superior to people who are not sodomites. In the same article that was just quoted, the sodomite authors write that “the campaign should paint gays as superior pillars of society.” And this is what they have been doing: portraying sodomites as more intelligent, and morally supreme.\n\nThe homosexuals desire to establish a utopia: where homosexuality is seen as superior, esteemed as surpassing the natural fashion of intercourse between man and woman in a higher level of human evolution in the Darwinian scale, and where natural love between man and woman is deemed as only a breeding mechanism to keep the propagation of humanity sustained. Lower humans — the heterosexuals — are just breeders to keep mankind going; they are slaves whose purpose it is just to produce children who can maintain the world, and be absorbed into the homoerotic utopia. The breeders breed, so that we can keep living. This is how the sodomite agenda sees us in the end.\n\nOf course I am sure it is hard for many of you to believe this, but we know this mindset to be existent just from what the homosexuals themselves write. The homosexual writer James Baldwin, according to pro-homosexual author Byrne R.S. Fone, “presents homosexuality positively as an ethically superior kind of love”. (Byrne R.S. Fone, The Columbia Anthology of Gay Literature, p. 675) The idea of promoting homosexuality as a “superior kind of love” can only signify the dark sentiment that sodomites are superior to people of natural attractions.\n\nThe homosexual movement is a supremacist movement, that sees homosexuality as not only intellectually and spiritually superior, but genetically superior. Have you ever wondered why the sodomites are so fixated on proving that they are “born this way,” and obsessed with discovering the “gay gene”? Its because if they can prove that homosexuality is genetic, then they can be more enabled to gradually inculcate the idea (which they already believe) that they are genetically superior to normal people.\n\nIts the same reason why atheists are very enthusiastic on finding the “God gene,” because if they can prove that some people are genetically inclined to be religious, then atheists are genetically superior to Christians (and from such thoughts, mountains of bodies and skulls are erected).\n\nBertram Cohler, one of the devisers of the idea of the “gay identity” that so many today are subscribing to, wrote of one idea that taught that “the homosexual gene, in proper proportion, would confer an evolutionary advantage to the population in which it existed”. (Bertram J. Cohler & Robert M. Galatzer-Levy, The Course of Gay and Lesbian Lives, p. 57)\n\nJim McKinight, Chair of Psychology Department at the University of Western Sydney, wrote that “straight” men who carry the homosexual gene are superior to those without it. His writing is quite reminiscent to the type of language used by the eugenists and the Nazis. He speaks of how “homosexual genes confer a benefit to the species”, and goes on to say:\n\nWhen I read all of this talk of “benefit to the species,” and being “genetically superior,” I cannot help but be reminded of the Nazis and the social Darwinists who dominated Western society in the 20th century. I also cannot help but make several observations: 1) That when the leftists claim to be against racism, they are not only liars, but promoters of racism and supremacy of the worst kind — Darwinist racism and supremacy; 2) When the homosexuals claim to be for “equality,” they are actually for superiority, superiority over those who have natural affections for the opposite gender, superiority over women who want to partake in their God-given roles of motherhood and wifely duties, superiority over men who want to be men and not try to recreate man into an diabolical image.\n\nRuse M., another pro-sodomite writer, wrote that “the existence and persistence of homosexuality is a function of superior heterozygote fitness.” (See Richard C. Friedman, Male Homosexuality, p. 31)\n\nActress Lisa Kudrow, says that homosexuals are “superior beings”:\n\nMoby, a well known musician, states that gays are superior to people of natural affections:\n\nSatoshi Kanazawa, evolutionary psychologist at the London School of Economics, wrote a long paper on the connection between superior intelligence and homosexuality. He wrote:\n\nSatoshi also said, “more intelligent individuals are more likely to identify themselves to be homosexual, while more educated individuals are less likely to do so.” He also wrote: “more intelligent individuals in the United Kingdom have had significantly ( p < 0.05) more same-sex cohabitation partners in their lifetimes than less intelligent individuals.\" He then went on to say:\n\nYou will deny that this is what the homosexual agenda truly believes, you will say that this is a false accusation. But, the reason why I make these affirmations with confidence, is because of the history of homosexuality. In history, we see the future. It is in their very history, in their very wicked disposition, to believe that they are superior to those of natural affections.\n\nJust look at pagan history, where homosexuality dominated, and you will see how pagans did indeed esteem homosexuality as a superior love.\n\nThe sodomites, when articulating this warped view, are inspired by the pagan world — such as the Samurai, and especially the Greeks and Romans — where homosexuality was seen as a supreme action, superior to any relations between man and woman, and a virtue that even had spiritual significance and meaning.\n\nThey also believe that because the pre-Christian pagan empires were dominated by homosexuality and homosexual religion, that homosexuals are thus the founders of civilization, and Christians — because they conquered the pagan world — are the ruiners of their sodomite golden age.\n\nThe supreme view of homosexuality was innate within the religion of both the Greek and Roman Empires. It is all inherent within the pagan spirit itself. The exaltation of the male body was rooted in the pagan hatred for women, which was inherent in the Greco-Roman religion. Hesiod, one of the greatest prophets for the religion of the Roman empire, wrote that Zeus actually created women as a curse to men, a belief completely contrary to the civilized and beautiful Genesis account of Adam and Eve:\n\nThis verse establishes the position of inferiority upon the woman, and the exaltation of men, created by Zeus. This inferiority would be instrumental in the exaltation of homosexuality within the pagan religion. Zeus himself was a homosexual, sodomizing a young man named Ganymedes. Clement of Alexandria exposed the homosexual nature of the Greek religion when he listed the young men who the gods sodomized:\n\nThe homosexual intellects will quote and point to various statements made by the pagan ancients that praise homosexuality as superior to the natural affections. One of them is the statement by Protogenes, recorded in one of the dialogues of Plutarch. In the conversation, Daphnaeus asks Protogenes,\n\nWhy, as all this is necessary for the human race to continue, our legislators do not act amiss in crying up marriage and eulogizing it to the masses, but of genuine love there is not a particle in the woman’s side of a house; and I also say that you who are sweet on women and girls only love them as flies love milk, and bees the honey-comb, and butchers and cooks calves and birds, fattening them up in darkness. But as nature leads one to eat and drink moderately and sufficiently, and excess in this is called gluttony and gormandizing, so the mutual desires between men and women are natural; but that headlong, violent, and uncontrollable passion for the sex is not rightly called love. For love, when it seizes a noble and young soul, ends in virtue through friendship; but these violent passions for women, at the best, aim only at carnal enjoyment and reaping the harvest of a beauteous prime, as Aristippus showed in his answer to one who told him Lais loved him not, ‘No more,’ he said, ‘do meat and wine love me, but I gladly enjoy both.’ For the end of passion is pleasure and fruition: but love, when it has once lost the promise of friendship, will not remain and continue to cherish merely for beauty that which gives it pain, where it gives no return of friendship and virtue. You remember the husband in the play saying to his wife, ‘Do you hate me? I can bear that hatred very easily, since of my dishonour I make money.’ Not a whit more really in love than this husband is the one, who, not for gain but merely for the sexual appetite, puts up with a peevish and unsympathetic wife, as Philippides, the comic poet, ridiculed the orator, Stratocles, ‘You scarce can kiss her if she turns her back on you.’ If, however, we ought to give the name of love to this passion, then is it an effeminate and bastard love, and like at Cynosarges, taking us to the woman’s side of the house: or rather as they say there is a genuine mountain eagle, which Homer called ‘black, and a bird of prey,’ and there are other kinds of spurious eagles, which catch fish and lazy birds in marshes, and often in want of food emit an hungry wail: so the genuine love is the love of boys, a love not ‘flashing with desire,’ as Anacreon said the love of maidens was, nor ‘redolent of ointment and sprightly,’ but you will see it plain and without airs in the schools of the philosophers, or perhaps in the gymnasiums and wrestling-schools, keenly and nobly pursuing youths, and urging on to virtue those who are well worthy of attention: but that soft and stay-at-home love, spending all its time in women’s bosoms and beds, always pursuing effeminate delights, and enervated by unmanly, unfriendly, and unimpassioned pleasures, we ought to condemn as Solon condemned it: for he forbade slaves to love boys or to anoint them with oil, while he allowed them to associate with women. For friendship is noble and refined, whereas pleasure is vulgar and illiberal. Therefore, for a slave to love boys is neither liberal or refined: for it is merely the love of copulation, as the love of women.” (Plutarch, On Love, section iv)\n\nNotice how Protogenes does not deny that marriage between man and woman is necessary for the continuation of the human race, and that this conjugal union between man and woman is fit for slaves, while homosexual connections are for the superior man. This ancient homosexual view of heterosexuals reflects the modern homosexual views: normal couples are merely slaves for the purpose of breeding, while homosexual debaucheries are for the superior people. An evidence to this is the homosexual use of artificial insemination: they hijack the natural order to recruit a child into their agenda, knowing that their ways is contrary to divine nature, but at the same time seeing it as below them.\n\nIn the conversation, after Protogenes expresses his fanatic devotion towards homosexuality, Daphnaeus interrupts him, and while supporting sexual relationships between men and boys, affirms the superiority of marriage between man and woman:\n\nThis statement shows that there was still some sense that was preserved amongst the pagans, and that they understood that marriage between man and woman was far older than homosexuality, and the natural process for procreation.\n\nNevertheless, homosexual ideology was still espoused and subscribed to in the pagan dominated empires where sodomite relations were seen either as superior or equal to natural relations. The words of Daphnaeus also shows that marriage, even in pagan dominated lands, was between man and woman, and that homosexuality came later, only to heavily percolate itself throughout the world. This is what the sodomite agenda desires to do now: to take what has already been established by God and to bring us back to what already sprung its colossal head in pagan antiquity.\n\nIn Plato’s Symposium, homosexual desires are esteemed as “great and proud thoughts” and amongst “much finer customs” (trans. Benardete). In the same dialogue of Plato, Aristophanes tells Eryximachus that the first humans were individual male and female, but beings who had two sets of genitals, some with a phallus and a vulva, and others with either two female genitalia or two male privates.\n\nThese beings tried to overthrow the gods, and as punishment, were cut in half, and from this severing came individual women and men. Homosexuals, to Eryximachus, are simply people who were originally from the line of those who had two penises, and thus, to indulge in homosexuality is to simply return to one’s natural and original nature. Eryximachus says:\n\nEryximachus goes on to say that lesbians are simply related to those who were, in the most ancient of days, attached to women, and sodomites are simply related to those who were connected to men. Homosexuality, according to Eryximachus, is therefore natural, and that homosexuals are naturally superior to other men:\n\nEryximachus later describes homosexual relations by saying: “this was our ancient nature and were wholes.”\n\nIn Sparta, the gymnasium was institutionalized in the role of forcing recruited young Greek boys, by the age of twelve, into becoming homosexual warriors. The historian Plutarch writes:\n\nThe sodomite agenda wants to see this same cruel tyranny established today, in order to build a homoerotic utopia where boys are recruited for a homosexual army, and the male body is exalted as the primal and pure physique of a warrior. Lets not forget what the Gay Manifesto says:\n\nThe Spartans recruited boys into a militant homosexual system, and so today we find the sodomites gradually trying to extinguish parental rights in regards to sexuality, for the purpose of convincing children into becoming sodmites, and ultimately, recruit them for their movement. This is clearly seen in Chris Christie’s decision to ban all licensed therapists from treating homosexual children to bring them back to normality and the natural order. They want the state to sever the influence of parents from their children, and make the youths open to homosexual propaganda, and thus for recruitment.\n\nSince it would be difficult for the sodomites to actively introduce children to homosexuality, they want parents to do this for them. One reprobate has made this recent statement:\n\nHomosexual acts were not only encouraged and common, but imposed in the pagan world. In Sparta, for example, if you were a handsome man of good character and did not have a male lover at all, you were fined. The ancient scholar Aelian explains:\n\nAmongst the Samurai, women were seen as breeders and the conjugal union as the means to human propagation, while homosexual sodomy was esteemed as superior, even to a spiritual level. In the Encyclopedia of Gay Histories and Cultures, edited by George E. Haggerty, distinguished professor at University of California, Riverside, it says:\n\nThere is one saint who is almost unknown to the modern world, who was martyred because he refused to be homosexual: St. Pelagius, a martyr of Spain who lived in the 10th century.\n\n St. Pelagius was a young man, and was a prisoner to the Muslim caliph ‘Abd Al-Rahman III, an inveterate homosexual, who had a whole harem of male lovers, and who would soon lust after the young Christian.\n\nAl-Rahman invited Pelagius to a party and promised him a life of utter luxury if he would become his homosexual partner and convert to Islam. He also told him that if he accepted this offer, that he would be completely permitted to have homosexual intercourse with any man in the palace, and that he would free any of his relatives from prison.\n\nPelagius refused, and being utterly adverse to both Islam and homosexuality, rejected his diabolical proposition. After this rejected, al-Rahman touched Pelagius in a homosexual way, and the Christian, so repulsed by, struck the caliph in the face and said, “Take off [your hands], dog, do you think me like one of yours, an effeminate?”\n\nAl-Rahman then had the other homosexuals in the palace try to persuade Pelagius to join the sodomite tryst, but this did not work. It is said that at this point al-Rahman put his hand firmly on Pelagius’ face, he then put his arm around his neck, and drew him to closer to kiss him. Pelagius was so incensed about this that he struck the Muslim in the face, hard enough the blow drew blood which dripped down to his beard.\n\n‘Abd al-Rahman was so filled with homosexual frenzy, that he had the young Christian saint slaughtered in the most brutal way. For six hours he was tortured: he was slowly dismembered; they cut off his arm, then his leg, then more parts of his body were severed, until he was reduced to pieces. They then threw body parts into a river and they were later picked up by fellow Christians.\n\nThere are other examples of Islamic homosexual tyranny on Christians. Mehmet II, the sadistic sultan who invaded the Christian city of Constantinople, tried to force two Greek Christian boys to be his sex slaves. One of them, aged fifteen, refused to be raped and so was stabbed to death by the possessed sultan. (Gibbon, Decline and Fall, vol. v, ch. lxviii, p. 1213)\n\nISIS are a bunch of homosexual, anti-Christian murderers. They are the purest form of the homosexual agenda, and they are just as evil and anti-Christian, as the reprobate sodomites in the West. There is a recent report that reveals that ISIS officials have homo sex with other men in their tents.\n\nAccording to the report:\n\nThere are homosexuals in superior levels of leadership of ISIS, such as one “prince” of the group who sodomizes new recruits as a way of initiation. Therefore, these Christians who are being killing by ISIS, are martyrs not only slain by Muslims, but by homosexuals. Are we this stupid not to connect the dots? We are that superficial and sick as a society that we cannot see with our own eyes the diabolical conspiracy happening right now? We have homosexuals in ISIS killing Christians, we have homosexuals in the West who want to control Christians through lawsuits, and not only this, the lesbian dyke mayor of Houston subpoenaed pastors for anti-homosexual sermons. The picture is clear: these homosexuals are terrorists who want to subject us through their despotism.\n\nStuart Kellogg, the homosexual writer and editor for the sodomite magazine, The Advocate, presents an essay by Byrne R.S. Fonethe utopian inspiration that homosexual writers have from the “Arcadian ideal” (based on ancient Greece) and how they frame their utopian fantasy in which homosexuality is superior to natural relations between man and woman based on the decadence of pagan mythologies:\n\nNotice the use of the term, “divinely sanctioned.” These sodomites hold up homosexuality to something divine, raising themselves up as gods above the insignificant breeders of humanity. While normal humans partake in sex between men and women, the homosexual is doing something that is beyond human, beyond the natural order, beyond the creation of God, and thus they make themselves as being above God.\n\nThe sodomites see themselves as gods, bent on overthrowing the only God in Heaven, to recreate the human race, from being images made in the likeness of God, into vile idols of the devil, from being man and woman — for “Male and female created he them” (Genesis 5:2) — to being whatever creatures they see themselves as. You cannot deny this superiority complex. How else can you explain how they see themselves as empowered to recreate reality, to say that man is woman and woman is man, that reality is not what is, but only what is perceived in their reprobate minds?\n\nHow else can you explain that these people will suddenly stand up and declare, that the dignify of womanhood means nothing, that the profound nature of the woman to bring forth new life, to partake in the process of creation, is meaningless, that women have no distinct roles in the family, no significance, that the influence of a mother towards her child is but rubbish, in comparison to what they see as the superior system of seeing human beings as just mere living things that can be redefined a million times over until they have no distinction, until they lose the image of God that was given to them in mankind’s beginning?\n\nThey are like the pagans who “changed the glory of the uncorruptible God into an image made like to corruptible man, and to birds, and fourfooted beasts, and creeping things” (Romans 1:23), only these heathens corrupt the holy image in which mankind was created, changing it into the vile fantasies of sodomites, becoming “vain in their imaginations” (Romans 1:21) that are so plunged in the never-ending quagmire of odious viciousness. The sodomite looks to the woman and says, “You are just a living thing, your natural gift of bearing new life means nothing to us, except for producing children for our new world. You are just a breeder.”\n\nYou will deny that they think this way, but go ahead and tell the sodomite that two men cannot have children, and they will tell you: “Yes we can! We can use artificial insemination!” meaning that they will have a woman hold their seed, and once the baby is born, it is taken away to become a citizen of sodom and called their child. To these sodomites, the woman is nothing but a breeder, an incubator, only a means to an end in their utopia in which homosexuality is esteemed and held up as the superior way of living, and the conjugal union between man and woman is seen as only a method to bring children.\n\nTo the sodomite, the woman is not the one who bears the Seed that crushes the head of the serpent, but the incubator who holds a child who will only be added to the schools of Sodom to learn more of their rebellion against God; to the armies of Sodom, to learn more about cruelty, to be amongst the demons when they try to overthrow the throne of Heaven; to be added to the tyranny of confusion, where truth is oppressed, where the only god is the self, and where the only enemy is the One Who said: “Whosoever will come after me, let him deny himself, and take up his cross, and follow me.” (Mark 8:34) The sons of Sodom forever scorn the citizens of Heaven, in a spiritual war that is between Babel and the heavenly Jerusalem.\n\nWe have to prepare our minds and intellect for this spiritual war that we are in. This is why I made a 2-disk DVD series on teaching the warring spirit of the Christian Faith.\n\nCLICK HERE TO GET OUR 2-DISK DVD SERIES ON CHRISTIAN MILITANCY AND CHRISTIAN WARFARE AND JOIN THE FIGHT TODAY!", "opengraph": {"locale": "en_US", "type": "article", "title": "Homosexual Activists Tell Kim Davis: 'We Will Kidnap Your Husband, Tie Him Up And Force Him To Watch Us Raping You. We Will Burn You Alive.' Civil Unrest Is Coming To America - Walid Shoebat", "description": "By Theodore Shoebat Homosexual activists are sending sadistic threats to Kim Davis, saying that they will capture her husband, tie him up and force him to watch them rape her. They also said that they will burn her house as they sleep and burn them to death. Here is the video with the full story […]", "url": "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/", "site_name": "Walid Shoebat", "article:published_time": "2015-09-11T02:11:08+00:00", "image": "https://shoebat.com/wp-content/uploads/2015/09/kimgg-copy.jpg", "image:width": "640", "image:height": "324"}, "tags": [], "tweets": [], "movies": [], "links": ["http://shoebat.org/wp-content/uploads/2015/07/lots-wife.png", "http://shoebat.org/wp-content/uploads/2015/07/militant_Gays.jpg", "http://shoebat.org/wp-content/uploads/2015/07/cohler.jpg", "http://shoebat.org/wp-content/uploads/2015/07/makeup_lisa.jpg", "http://www.contactmusic.com/moby/news/moby-gay-men-are-superior-to-straight-men_1012597", "http://shoebat.org/wp-content/uploads/2015/07/Moby_1.jpg", "http://shoebat.org/wp-content/uploads/2015/07/nan-copy.jpg", "http://shoebat.org/wp-content/uploads/2015/07/250px-Seneca.jpg", "http://shoebat.org/wp-content/uploads/2015/07/240px-ClemensVonAlexandrien.jpg", "http://shoebat.org/wp-content/uploads/2015/07/plutarch_delphi_mus3.jpg", "http://shoebat.org/wp-content/uploads/2015/07/plato4.jpg", "http://shoebat.org/wp-content/uploads/2015/07/Rider_BM_B1.jpg", "http://shoebat.org/wp-content/uploads/2015/07/wakashudo-e1375404136313.jpg", "http://shoebat.org/wp-content/uploads/2015/07/2288053058_f3cb756545_z.jpg", "http://shoebat.org/wp-content/uploads/2015/07/n_78968_1.jpg", "http://shoebat.org/wp-content/uploads/2015/07/fag-isis.jpg", "http://www.ibtimes.co.uk/boys-pleasure-sexual-abuse-children-betrays-isis-hypocrisy-1483322", "http://shoebat.org/wp-content/uploads/2015/07/kellogx390.jpg", "http://www.ffmu.biz/christian-militancy-by-theodore-shoebat/", "https://www.facebook.com/theodore.shoebat?fref=ts", "https://twitter.com/theodoreshoebat", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=facebook", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=twitter", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=reddit", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=linkedin", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/#print", "#", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=skype", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=jetpack-whatsapp", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=telegram", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=pocket", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=pinterest", "https://shoebat.com/2015/09/10/homosexual-activists-tell-kim-davis-we-will-kidnap-your-husband-tie-him-up-and-force-him-to-watch-us-raping-you-we-will-burn-you-alive-civil-unrest-is-coming-to-america/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2015-09-11T02:11:08+00:00"}