{"result_id": "271044", "URL": "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/", "timestamp": "2023-04-25 17:07:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Putin Moves To Authorize Vaccine Passports", "cleaned_text": "One of the fears that many people have expressed is that of a ‘vaccine passport’, where those who have not received a COVID vaccine are restricted in their travel or other abilities to participate in the social life of their nation. While such things have been talked about in the US, a real threat of this has been raised in Russia, where Russian President Putin has pushed for the creation of ‘vaccine passports’ letting those who have been vaccinated against COVID travel.\n\nThe Russian government will consider developing and distributing new documents for those who have been vaccinated against coronavirus, in an effort to cut risks associated with international travel. In a series of instructions to officials, published at the end of 2020, President Vladimir Putin ordered policymakers “to consider issuing certificates to people who have been vaccinated against Covid-19 infections using Russian vaccines… for the purpose of enabling citizens to travel across the borders of the Russian Federation and those of other countries.” Russia’s Prime Minister, Mikhail Mishustin, has been charged with implementing the recommendations, and is set to report back on January 20. (source)\n\nI do not deny the concerns or dangers of COVID, as it has been noted by many doctors. At the same time, the idea of restricting movement for a temporary illness- as all pandemics, even the worst ones, are temporary -has potentially long-term effects of the rights of citizens, given the dispositions of governments today and how they relate to the peoples which they rule over. In the case of Russia, where tendencies have been looking toward a revival of the Soviet past, a crisis such as COVID provides an ideal opportunity to expand the power of government and keep it after the pandemic passes. Similar grabs at power are being made by governments across the world, so this phenomenon is not isolated.\n\nAs a trend, what we can see happening, albeit on a global scale, it the classical human story of the struggle between the government and the governed, that while always existing, now encompasses the entire world and can be witnessed in real time by all people owing to the new tools available for disseminating information. The trend of “vaccine passports” is likely just a beginning of more restrictive measures that may be applied in the future an, while we do not know what they may look like, we do know that historically speaking, such changes are often defined by a decline or loss in human freedom for the supposed collective good that results in people being treated like fodder for a cannon until too much happens and the people revolt and clean up or establish a new system, and promising not to do the same again, only await for the cycle to repeat in its own time.\n\nIn the case of Russia, which recently admitted to having the third worst COVID infection rates in the world, it signals that things not only may not be as under control as they have been presented, but that this crisis could not have happened at a more opportune time, and it is being exploited by Putin and all those in power for all that it is worth. After all, if groups would not try to use the pandemic to push for things such as the abolition or excessive taxes placed on meat to curb meat consumption, why would one not try to use this to further consolidate more power into one’s own domain?\n\nDonate now to help support the work of this site. When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "Putin Moves To Authorize Vaccine Passports - Walid Shoebat", "description": "One of the fears that many people have expressed is that of a ‘vaccine passport’, where those who have not received a COVID vaccine are restricted in their travel or other abilities to participate in the social life of their nation. While such things have been talked about in the US, a real threat of […]", "url": "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/", "site_name": "Walid Shoebat", "article:published_time": "2021-01-05T17:29:37+00:00", "article:modified_time": "2021-01-05T19:20:42+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/01/01052021c.png", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shoebat.com/wp-content/uploads/2021/01/01052021c.png", "https://archive.is/7NI31", "https://news.trust.org/item/20201029165715-jt3st", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=facebook", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=twitter", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=reddit", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=linkedin", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/#print", "#", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=skype", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=jetpack-whatsapp", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=telegram", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=pocket", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=pinterest", "https://shoebat.com/2021/01/05/putin-moves-to-authorize-vaccine-passports/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-01-05T17:29:37+00:00"}