{"result_id": "271032", "URL": "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/", "timestamp": "2023-04-25 17:07:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Catholic Church In Italy Tells Christians: Do Not Pray To Jesus Loudly Because It Will Offend The Muslims", "cleaned_text": "Christians wanting to pray in the church of St. Anthony in Italy were told that they cannot pray loudly, that they must pray in silence so as not to offend the Muslims living in the parish. According to one report:\n\nParishioners visiting a church in Italy were told they must “pray in silence” so as not to disturb African migrants being housed there. Some of the faithful hoping to practice their Christianity at the church of St. Anthony in Ventimiglia were surprised when they were told by Caritas volunteers they couldn’t recite the rosary and would instead have to pray in silence out of respect to migrants who are living there.\n\n\n\nCaritas is ostensibly a Catholic charity, although much of its resources are spent on facilitating mass migration to Europe; the organisation even boasts that it contributes to and seeks to influence European Union (EU) “asylum” policies. Caritas reports that they have been distributing 600 meals a day to migrants in Ventimiglia.\n\n\n\nAfter one of the female parishioners requested that the migrants be taken to another church so that she could recite the rosary, the parish priest, Don Rito, appeared and accompanied her and the other visitors to another church. \n\n\n\nThe Northern Italian town of 55,000 people has recently been overwhelmed with hundreds of migrants. More than 50 Africans have been crossing into Ventimiglia every day, hoping that from there they will be able to enter France. The town’s mayor, Enrico Ioculano, has said that this is “an untenable situation”.\n\n\n\nMr. Ioculano has admitted that Ventimiglia is struggling to meet the costs of the migrant influx. It was discovered that the national government will pay for less than half the town’s €220,000 bill — for unaccompanied migrants alone — accrued in the first five months of this year. Dozens of migrants in the area have also had to be vaccinated in recent days due to an outbreak of chickenpox amongst the migrant guests of St Anthony’s Church.\n\nIt seems that Catholics are being tyrannized by their own government in favor of Muslim heretics.\n\nA rally of conservative Christians in Rome was attacked by both Muslims and Italian police. The Muslims spat at the Christians, and began to scream, “Death to the Pope [Francis]!” And they also held signs that said, “A good Christian is a beheaded Christian!” The police then forced the Christians out and yelled, “Disperse!” The Christians had no choice but to end the rally, while the Muslims continued their rally.\n\nTo describe to us this persecution, Shoebat.com interviewed a member of the rally, Tommy Pacinotti, a Christian activist and a P.HD scholar in medieval history. Here is the video:\n\nTO LEARN MORE ABOUT CHRISTIANITY’S WAR AGAINST EVIL, CLICK HERE TO GET OUR NEW 2-DISK DVD SPECIAL ON CHRISTIAN MILITANCY\n\nPERSECUTION IS COMING, AND EVENTUALLY SHOEBAT.COM IS GOING TO BE PULLED OUT OF FACEBOOK. PRETTY SOON THE BEST WAY TO REACH US WILL BE THROUGH OUR NEWSLETTER. CLICK HERE TO JOIN OUR NEWSLETTER, AND CONTINUE EDUCATING YOURSELF ON WHAT THE MAINSTREAM MEDIA WON’T REPORT", "opengraph": {"locale": "en_US", "type": "article", "title": "Catholic Church In Italy Tells Christians: Do Not Pray To Jesus Loudly Because It Will Offend The Muslims - Walid Shoebat", "description": "  By Theodore Shoebat Christians wanting to pray in the church of St. Anthony in Italy were told that they cannot pray loudly, that they must pray in silence so as not to offend the Muslims living in the parish. According to one report: Parishioners visiting a church in Italy were told they must “pray […]", "url": "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/", "site_name": "Walid Shoebat", "article:published_time": "2016-06-08T19:04:08+00:00", "image": "https://shoebat.com/wp-content/uploads/2016/06/italian-muslims-future-facebook.jpg", "image:width": "1536", "image:height": "1022"}, "tags": [], "tweets": [], "movies": [], "links": ["http://shoebat.org/wp-content/uploads/2016/06/italian-muslims-future-facebook.jpg", "http://www.breitbart.com/london/2016/06/06/parishioners-told-pray-silence-migrants/", "http://www.ffmu.biz/christian-militancy-by-theodore-shoebat/", "http://shoebat.org/subscribe-to-tbat-newsletter/", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=facebook", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=twitter", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=reddit", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=linkedin", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/#print", "#", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=skype", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=jetpack-whatsapp", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=telegram", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=pocket", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=pinterest", "https://shoebat.com/2016/06/08/catholic-church-in-italy-tells-christians-do-not-pray-to-jesus-loudly-because-it-will-offend-the-muslims/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2016-06-08T19:04:08+00:00"}