{"result_id": "271019", "URL": "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/", "timestamp": "2023-04-25 17:07:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Turkey's Paramilitary Organization Thats Wants To Exterminate Christians", "cleaned_text": "Fascist governments will always have their paramilitaries, to do the bloodiest killings in the midst of conflicts. The Ottomans used Kurdish tribesmen to butcher the Armenians, the Third Reich had the SS to conduct the massacres of the Germans. Today, the Islamo-nationalist AK Party of Erdogan has its own paramilitary, SADAT (International Defense Consultancy), founded by Adnan Tanriverdi.\n\nAdnan Tanriverdi and his paramilitary believe that they are going to be a military force to prepare the world for the Mahdi, the Islamic messiah. Tanriverdi is a retired general who served as Erdogan’s chief military advisor but stepped down in early 2020 after claiming that his organization’s mission was to “prepare the ground for the coming of the Mahdi”. By preparing the world for the Mahdi, it is speaking of mass killing. The Muslims believe that their messiah will come in the midst of utter chaos and conflict. Thus, these Turkish fighters want to partake in war and kill the enemy in the belief that it will in usher in the end times. It is thus a part of an apocalyptic death cult, and like all such groups, they believe that by shedding blood they will commence the end times. Turkey is in a conflict with Armenia, and already that Christian nation of the South Caucasus was the victim of Azeri Turkish viciousness; in the future the storm of blood rage will not abate, but only worsen. In the nationalism of the Turk, innocent blood will be spilt, and in the apocalyptic vision of Turkish imperialism, a torrent of blood will ensue. But before such horrors fully unravel, let us remember that most strategic method of the tyrant: capitalizing on certain events to justify certain actions.\n\nWhen Erdogan appointed Tanriverdi to be his chief security advisor, it was a response to the 2016failed coup and (according to one source) would be commissioned by Erdogan’s AK Party to lead a paramilitary organization to prevent coups from taking place. Tanriverdi would go on to lead SADAT. The goal of this mercenary organization is to help transform the Islamic world into a singular military superpower that would be self-sufficient and strong enough to be ranked with the other global superpowers. As the official website for SADAT states, it “aims at establishing the cooperation among the Islamic countries in the sense of military and defense industries, in order to assist the Islamic world to take the rank it deserves among the super global powers as a self-sufficient power”.\n\nIt is not surprising, then, that one of SADAT’s board of directors, Ali Coşar (a retired colonel) praised the Taliban as “members of a resistance movement that fought against colonial America for 20 years to take over the government and establish a state that practices Sharia.” This goes along with the agenda of Erdogan who said: “Turkey has nothing against the Taliban’s ideology, and since we aren’t in conflict with the Taliban’s beliefs, I believe we can better discuss and agree with them on issues.” As Germany wants to form and lead a pan-European military force, Turkey wants to create a pan-Islamic military force that it would lead against its enemy. It would thus be a new rise of Turkish power, with the full strength of the Islamic world against Turkey’s foes. SADAT wants to crush Turkey’s enemies through not just physical force, but psychology warfare. If the Koran says: “We will strike panic into the disbelievers’ hearts” (Surah 3:151), Turkey wants to be the one to instill the terror.\n\nIn the ranks of SADAT is Turkish psychologist Nevzat Tarhan who is there for the purpose of teaching the paramilitary the strategy of psychological warfare. What does this entail? Tarhan’s system of fear can be found in his book entitled, Psychological Warfare (Psikolojik Savaş). In this book, Tarhan does two things: explain the tactics of fear for the purpose of power and, at the same time, condemn such strategies throughout the book. If we were to quote this book to expose the Machiavellian ways of Tarhan, one could counter-argue that the psychologist is only explaining psychological warfare and not pushing for it. But, if this is the case, then why is he involved in Erdogan’s private military company for the purpose of teaching the soldiers psychological warfare, the very thing he specializes on? Tarhan’s teachings on the dark subject are straight forward and their effectiveness speak for themselves.\n\nIn his book, he lists several objectives of psychological warfare: “By exploiting the weakness of the enemy in terms of political, economic, social and morale, weakening his combat power”. Tarhan also writes: “To ensure the defeat of the enemy … to intimidate and discourage them by arousing a sense of fear.” Tarhan lists as psychological warfare “Tactical Goals” as to “mislead the international public.” What this implies is that while enacting a policy of advancing terror, the goal should also be to lie to the world about what your government is doing. In other words, while you shed blood and instill fear, you should make it out to the world that you are doing something good for humanity. Its like the Ottoman Empire murdering a million Armenians only for the modern day Republic of Turkey to deny that it ever happened. Its like Turkey backing Azerbaijan’s conquest of Nagorno-Karabakh and Azeri soldiers murdering innocent civilians, only for Turkey and Azerbaijan to never even seriously acknowledge that such evils have taken place.\n\nTarhan also speaks of the importance of an ideology of martyrdom and instilling it into the soldiers in order to form a unit of warriors willing to die for the state. Failure to do this, writes Tarhan, will lead to failure: “The fighting man is the greatest. He is a person who puts his capital at risk. ‘My blood is sacrificed in the homeland, if I die, I will be a martyr,’ he said. If a commander cannot revive these features in his soldier, he will lose his fighting strength and tt means that it has lost its ability to mobilize the unity to a great extent. … A person who does not believe in war does not have an ideology of war.” A counter argument to posting this is that all militarily successful nations have an ideology of sacrifice in order to have success in the battlefield. There is no doubt about this. But there is also no doubt that a major medical expert is working on behalf of the AK Party’s private paramilitary organization to teach it psychological warfare. For what reason would such an ideology be used? To conquer other territory, to murder civilians, for its ideological aspiration of not just religious domination, but also for the supremacy of the Turkish nation.\n\nTarhan’s list of objectives for psychological warfare also includes: “To increase the sense of obedience in society.” Through this tactic of fear, such a system gets the population to become increasingly submissive to the Islamist and nationalist state of Erdogan. A perfect example of this was the successful campaign in which Erdogan used Turkish population’s fear over Kurdish terrorists to convince enough citizens to vote in favor for his referendum in 2017 which expanded the power of the presidency.\n\nAdnan Tanriverdi is also the leader of the Turkish Strategic Research Center of the Association of Justice Defenders (ASSAM) which, in December of 2020, announced a conference for “Defining the principles and procedures of a common defense system for the Islamic Union.” By this it is referring to the Islamic Union Congress which was started by Tanriverdi’s ASSAM organization and has been having a conference each year since 2017 and is planned to have its final conference in 2023.\n\nThe purpose of the Islamic Union Congress is to create a confederacy of Muslim countries with, of course, Turkey as the leader. On the official website for ASSAM it reads that “the Parliament of Islamic Countries” should be established and each Islamic country should create the “Ministry of Islamic Union” through their Council of Ministers. What ASSAM wants to establish is an Islamic EU, with each country being a member of this Islamic union. Just as the EU wants to form its own pan-European military, the Islamic Union Congress wants to create a transnational Islamic security force consisting of the militaries of all Muslim countries. The next conference for the Islamic Union Conference is planned to be in December of 2021 and the main subject is described as “Principles and Procedures of Joint Foreign Policy for the Islamic Union”. The transnational military aim of the conference is indicated by the fact that a participator in it will be the Pakistan Centre for Aerospace and Security Studies (CASS) which describes its mission as “to serve as a thought leader in the Aerospace and Security domains globally, providing thinkers and policy makers with independent insight on aerospace and security issues in a comprehensive and multifaceted manner.”\n\nOne of the leading directors of CASS is Waseem ud din who served as an air marshall for the Pakistani air force but is now retired. His military education and his activity as an air marshall indicate his ties to Turkey. For example, he graduated from the Turkish Armed Forces Staff College, which means he was trained by the Turks. This is not surprising, given the fact that there are strong military links between Turkey and Pakistan. From 2016 to 2019, Turkey was Pakistan’s third-largest arms supplier, and Pakistan was Turkey’s third largest arms export market. And since 2010, 1500 Pakistani military officers have received training in Turkey, just as Waseem ud din did.\n\nIn 2013, Waseem was present at a joint training exercise between the Pakistani and Turkish air forces. With Waseem was M Babur Hizlan, the Ambassador of Turkey. According to one report: “The prime objective of the exercise is to excel in the air combat capability with focus on Air Power employment in any future conflict.” What “future conflict” did they have in mind? Fast forward to 2021, where we are reading about how Turkey, Azerbaijan and Pakistan are training in Baku to prepare for war against the Armenians. This training exercise — called “Three Brothers 2021″ — was done in the midst of strong tensions between Armenia and Azerbaijan. During the Azeri-Armenian war of 2020, Pakistan sided with Turkey and Azerbaijan against the Armenians of Nagorno-Karabakh. Roznama Ummat, a Pakistani newspaper, wrote in October of 2020: “After the beginning of the war between Azerbaijan and Armenia, Pakistan and Turkey are siding with the brother-Islamic country of Azerbaijan.” The daily wrote further: “Being a close ally [of Turkey] and a Muslim country, Pakistan has also announced clearly support for Azerbaijan.” According to Roznama Ausaf, a Pakistani publication, the Azeri ambassador to Islamabad, Ali Alizada, visited the Joint Staff Headquarters in Rawalpindi on October 9th of 2020 where General Nadeem Raza told him: “The armed forces of Pakistan support completely Azerbaijan’s position on the Nagorno-Karabakh conflict.” Pakistan witnessed how Turkish drones slaughtered thousands of Armenian troops, and wants in on such technology. CASS stated this desire in May of 2021:\n\nASSAM’s ties to Pakistan and its desire to create a pan-Islamic military force makes it not very surprising that they not only support the Taliban but want Turkey to occupy Afghanistan. Ersan Ergür, vice president of ASSAM, wrote on June 28, 2021 that peace would come to Afghanistan after NATO forces left the country, with the exception of Turkey. “However, the only necessary and sufficient condition for this to happen will definitely be the continuation of Turkey’s presence in Afghanistan in terms of military power,” he added. Part of ASSAM’s utopian vision is to annihilate all of the world’s Jews. In July of 2021, ASSAM’s website published an article by Nejat Ozden which states the Islamic apocalyptic prophecy about the extermination of the Jews: “there will surely come a day in the future when trees and stones will speak and say, ‘O Muslim! Come and kill the Jew hiding behind me’”. What this signifies is that this paramilitary organization in bent on genocide, and it will not be just the Jews that they would kill, but the Christians, especially of Armenia.\n\nBiblical prophecies speak intensively on Israel’s demise when “ships from Chittim” (Cyprus) comes to Israel. Many focus on the “ships of Chittim” which is usually rendered as the “Romans” in Daniel 11:30 during the escapade with Antiochus Epiphanies, but in Numbers 24 it is “Ships from the cost of Cyprus” that is the Aegean sea (Asia Minor, Turkey) and Jeremiah also speaks of “Minni Ararat Ashkenaz” (Turkey and its Islamic allies nearby) who invades Ashur (Iraq) then swings by to Arabia and Israel where other prophecies by Ezekiel speaks of God Who destroys the armies of Gog, save the remnants from the Israel of God and destroy Arabia and Eber (Hebrew Israel). This is not implausible today especially after considering Turkey’s and Iran’s hatred and continual attacks on Saudi Arabia and Israel and the Ottoman vendetta against Arabia for siding with the British Lawrence of Arabia during WWI. Isaiah 21 also speaks of Israel’s destruction “My people [Israel] who are crushed on the threshing floor, I tell you what I have heard from the LORD Almighty, from the God of Israel.” (Isaiah 21:9-10) “Fallen is Virgin Israel, never to rise again, deserted in her own land, with no one to lift her up.” (Amos 5:2) and in Isaiah 21:5 it gives us another key verse (a freebie hint) before the invasion of that part of Babylon: “They spread rugs, they eat, they drink! Get up, you officers, oil the shields” (Isaiah 21:5)\n\nWho besides the Muslims “spread rugs” just before the battle?\n\nFor an extensive research on these prophecies please read The Keys To Unlock The Signs of the End.", "opengraph": {"locale": "en_US", "type": "article", "title": "Turkey's Paramilitary Organization Thats Wants To Exterminate Christians - Walid Shoebat", "description": "By Walid and Theodore Shoebat Fascist governments will always have their paramilitaries, to do the bloodiest killings in the midst of conflicts. The Ottomans used Kurdish tribesmen to butcher the Armenians, the Third Reich had the SS to conduct the massacres of the Germans. Today, the Islamo-nationalist AK Party of Erdogan has its own paramilitary, […]", "url": "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/", "site_name": "Walid Shoebat", "article:published_time": "2021-10-16T04:35:37+00:00", "article:modified_time": "2021-10-16T04:35:39+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/10/Adnan-Tanriverdi.jpg", "image:width": "1374", "image:height": "864"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/adnan-tanriverdi/", "https://sadat.com.tr/download/SADAT-eng-full-v02.pdf", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/ali-cos%cc%a7ar/", "https://www.tr724.com/gayri-nizami-harp-sirketi-sadata-denetim-sorulari-cevapsiz/", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/nevzat-tarhan/", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/waseem-ud-din/", "https://www.thefreelibrary.com/PAF+holds+Air+Exercise+Indus+Viper-II+with+Turkish+Air+Force-a0322716503", "https://www.memri.org/reports/pakistans-military-involvement-nagorno-karabakh-war#_edn28", "https://nordicmonitor.com/2021/09/turkish-paramilitary-contractor-sadat-praises-taliban-for-asymmetrical-war-campaign-cheers-for-sharia-rule-in-afghanistan/", "https://shoebat.com/2021/05/09/the-keys-to-unlock-the-signs-of-the-end-and-why-you-must-get-ready-to-leave-your-cities/", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=facebook", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=twitter", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=reddit", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=linkedin", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/#print", "#", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=skype", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=jetpack-whatsapp", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=telegram", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=pocket", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=pinterest", "https://shoebat.com/2021/10/16/turkeys-paramilitary-organization-thats-wants-to-exterminate-christians/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-10-16T04:35:37+00:00"}