{"result_id": "271001", "URL": "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/", "timestamp": "2023-04-25 17:06:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "The Bizarre World Of Monasteries", "cleaned_text": "A very rare occurrence has taken place in the Catholic world: a nun has been disbanded from her order, an act that only takes place about ten times a year. This happened to Mother Marie Ferréol who was thrown out of the Dominicans of the Holy Spirit (dominicaines du Saint-Esprit) in France. She claims that she is innocent and has done no wrong doing. She goes so far as to argue that she has no idea of ​​the “serious fault” of which the Church accuses her. She has been banned from all community life after serving as a nun in the order for thirty-four years. The Catholic Church is not being explicitly clear as to what Ferreol did, but there are ominous things in the story nonetheless. Father Jean-Charles Nault, who is involved in the investigation on Ferreol, affirmed: “Mother Marie Ferréol knows very well what she has done.” Ferreol is an intellectual person, having a master’s degree in medieval history and who taught the religious community at Pontcallec. She was described as “A very good Latinist, by art historian Adrien Goetz. Ferreol herself recounted on how, in the order that she was banned from, there were “psychospiritual intrusion exercised on certain novices” that she had at the time “Chose to denounce”. There are no details on what these “Psychospiritual” exercises looked like. Regardless, “psychospiritual” would denote the merging of psychology and spirituality, and this could indicate things like transcendental meditation. Notwithstanding, these exercises were nothing good and were obviously something closer to New Age religion than Christianity. So if Ferreol was denouncing the New Age like exercises that occurred in the order, what wrong did she do? Ferreol is being accused by Church authorities of “lying and concealment” and held responsible for “instilling a climate of suspicion and fear” in the order. What exactly this means has yet to be revealed to us.\n\nWhat I do know from my own experience is that there is heresy and are quite strange things that take place within monasteries. I saw this myself and would like to take this opportunity to repost our article on the bizarre order we met with while in Italy.\n\nSodom and Egypt has inundated Rome through a pernicious network of clergy who are, under the guise of the arts and theology, advancing the Occult.\n\nDuring my trip with Theodore and my wife Maria in Italy we spent much of our time in the presence of nuns. We were accompanied by two of my wife’s sisters who are nuns from the Monastery of Perpetual Adoration in San Francisco, California. They are cloistered nuns who have dedicated their lives to prayer, and they were in the Vatican to solidify a joint pact with an Italian order of nuns known as the Monache della Adorazione Eucaristica (Nuns of Eucharistic Adoration). The Italian order of nuns have been making their presence not only in Europe, but in Mexico and the United Stated. While the California nuns were excited about their meeting in the Vatican, they were nonetheless vacuous of spiritual discernment, since they were oblivious to the sinister agenda of the leader of the Italian order, Sister Maria Gloria Riva, the Mother Superior of Monache della Adorazione Eucaristica.\n\nThe Adorers of the Eucharist have been living in the diocese of San Marino Montefeltro since 2007. Their arrival was backed by the former bishop of Ferrara-Comacchio, Luigi Negri (who left his seat as bishop in 2017 after he was caught calling for the Virgin Mary to kill Pope Francis). Not much time passed when the order of nuns found a new location in Ponte Cappuccini in the comune of Pietrarubbia which lies within the Province of Pesaro and Urbino. In the midst of mountains and a cascade of lofty trees, the nuns of Ponte Cappuccini live a more liberal existence as opposed to the stringent cloistered monastics of other established orders. Beautiful voices resound in the monastery in a fusion between serene Catholic chant, melodic Medieval tunes, a little tint of hippie guitar and even old Jewish folk music. The artistic talent within the order is quite impressive and has the most unique musical style that we’ve ever seen in any parish.\n\nIt did not take us much time to notice what we were dealing with: the leader of a monastery who was using her deep knowledge on the arts as a conduit by which to corrupt the Church with not just any occultism, but Jewish occultism with Christian garb. We spent much time with Sister Riva, as she was our guide into northern Italy and Rome. But in our conversations with her, we experienced another shock (amongst many that we have had in the past) on just how far and deep the rabbit hole goes in the apparatus of St. Peter’s Square.\n\nBehind the veneer of reverence and piety, one could see Riva’s subtle methods of sophistry in her ideological paradigm. Art becomes a religion, and art interpretation a form of revolutionary action against orthodoxy; what the art interpreter says (Riva’s interpretation) then dictates the theology. The method in Riva’s deception is simple: by using art, her interpretation of it becomes the prima-facie method into interpreting Christian theology. The end game is Riva’s heretical conclusions: homosexuals are simply a product of their biological state; God, the Holy Spirit and His Shekinah Glory (His presence) are “feminine” and St. Matthew was nothing more than a naive disciple of Christ. Riva holds a Kabbalist view on God, a definite heresy condemned by the Catholic Church. But Riva is well entrenched and well connected. She even boasted that she has the ear of the Pope.\n\n\n\n Cracking into Riva’s cult began with her false piety, like the devil who took Christ to tempt Him to deceive and corrupt mind, soul, and heart in three areas of human interests: truth, beauty (art) and goodness. Riva is renown all over the Vatican world as an art expert, a supposedly cloistered nun. Two of her monks, Angelo and Cristian, drove us through the windy roads and hills of the northern Italian region of Pesaro e Urbino to the diocese of San Marino-Montefeltro where she established the so-called cloistered monastery. The Italian order has two parts, one in the Ponte Cappucinni area of Pietrarubbia, and the other in the city of San Marino where the nuns reside in what is essentially a medieval mansion (there is prime real estate to be had in the declining papal state), from the 1300s, making it the oldest edifice in the city.\n\nItaly is a land of multitudes of the most beautifully designed churches with ancient pillars, sublimely rustic mosaics and immaculate artwork, but they lie empty, given the presence of usually only the elderly. In a church deprived of attention, the sound of one’s footsteps echo through the vast and wide spaces of these buildings, and in the midst of the bitter silence, you will find old priests asking for money in exchange for prayers to be said on behalf of loved ones. Rome is like a body whose immune system is decaying, and the sign of ill health is the presence of parasites. Italy has become one giant art exhibit. The snakes laid their eggs, and they have hatched.\n\nAt our visit to the Vatican, we saw Pope Francis within feet of where we stood. He was viewed as if one goes to Disneyland to take photos to tell friends how they finally saw the unicorn. People were hardly listening to anything he had to say in his speech. The only fruitful experience was that during the trip, my sister in law, Nora, had Jesse Romero’s book The Devil In The City of Angels. Nora has expressed at times pass her encounters with diabolical attacks, yet was unaware of her surroundings or just whom her sister-nuns got involved with or her sister’s contract with aiding the diabolical. So I thought to borrow Romero’s book and read about the occult.\n\nAnything I attempted to hint or warn the sheep during my journey simply landed on deaf ears, Riva had tempted them already and they were willingly consuming all she said. They were excited to see the corpse of Christendom who beautifully colored what has become old hatched empty eggshells. “To all that be in Rome, beloved of God, called to be saints” (Romans 1:7) is no more. The nearly empty churches seemed like hatchlings that reveal no chicklings and mostly conniving old hens and roosters that “hatch the eggs of vipers and spin a spider’s web. Whoever eats their eggs will die, and when one is broken, an adder is hatched” (Isaiah 59:5).\n\nOur curiosity as to the ways of the monastic order began at Ponte Cuppuccini in the Pietrarubbia commune, a monastery surrounded by thick forestry and an adjacent church, in the midst of mountains and a cascade of lofty trees. We were initially impressed by the church services. The chants seemed to come out of the Middle Ages. In the nuns would even sing in Hebrew. Inquiring about the usage of Hebrew, one of the nuns, a Polish-Jew by the name of Danuta Conti said that the Hebrew alphabet and its numerical value had a deeper spiritual meaning. I instantly suspected a Kabbalistic connection but thought this all might be innocent.\n\nBut what we eventually discovered was that there is a deeply entrenched Kabbalistic agenda that underlies the order, although we are not entirely sure if all the nuns are aware of this.\n\nBut, beyond the harmony of exquisite music, there is a dark element within the group of nuns, and that is their mother superior, Sister Maria Gloria Riva.\n\nIn our time with Sister Gloria what we found was that she is deeply entrenched within Jewish occultism, or the Kabbalah. Sister Gloria is not an obscure nun either. She coauthored a book published in 2013 with Gilles Bernheim, who at the time was the Chief Rabbi of France, alongside the Rabbi of Turin, Alberto Mosshe Somekh. She also has ties with the major Jewish scholar, Vittorio Robiati Bendaud of whom Gloria writes: “for some time, we share passionately readings of the texts of Scripture in the original language.”\n\nIn one evening during a drive back from Ravenna, after hours of talking, the subject of the Kabbalah came up. Sister Gloria began talking about a friend of hers who is a master in Kabbalism and said that this Kabbalist “is a saint”. We managed to film Sister Gloria as she was saying these things:\n\nBy presenting an “orthodox Kabbalah,” Sister Gloria is presenting a Christian Kabbalah, which is exactly what Renaissance occultists like Pico della Mirandola were doing. The works of Pico — all of his 900 theses — were condemned by Pope Innocent VII, unlike Sister Gloria who is explicitly upholding Kabbalism.\n\nThe “Shekinah glory” (Presence of God) Riva speaks about is not the biblical one, it is a feminist God whom to Riva is dual gendered as we shall examine shortly.\n\nSister Gloria’s testimony on how she got into the monastic life is also questionable. In one conversation with Sister Gloria, she claimed to have had a near death experience after a car accident in which she saw a “small bright light” she felt was God guiding her to reflect on Him. But how could God be guiding a nun to the occult, to a nefarious cult of the arts, and to a bizarre fixation on the strangest of artists, like Caravaggio? I have concluded this light — if she is telling the truth — as nothing more than demonic. I have never delved much into arts because most artists end up with a weird life and I never really cared of their interpretations of either life or theology. For example, Riva’s love of Corpus Hypercubus by Salvador Dalí who announced his intention to portray an exploding Christ. Dali took the traditional Biblical scene of Christ’s Crucifixion and almost completely reinvent it describing his work as “metaphysical, transcendent cubism” with a levitating Christ and the giant chessboard below:\n\nIn one presentation to the youth at the Oratory of Paderno, with the theme of Creation through the painting of Michelangelo compared with Hieronymus Bosh, Maria Gloria Riva says: “He [Michaelangelo] is telling us that each one of us is God, who creates.” This is a nun who is echoing the typical New Age ideology of self-deificiation or apotheosis.\n\nRiva’s obsession with the arts is reflected in her fixation on Caravaggio. Her interest in this particular artist is so enthusiastic that she took part in the creation of a play on Caravaggio’s life, which was directed by Sister Gloria’s relative, Matteo Riva, with Sister Danute Conti doing the background music. One can see in the trailer the bizarre interpretative dancing and unsettling music:\n\nLooking up some of the videos Riva produced, I noticed the Kabbalistic ritual at her monastery at Pietrarubbia where we stayed at. This was a hexagram on the same pinkish Italian floor I had been hanging out in with these nuns. The hexagram was made of two pieces of cloth. It had a photo of an old lady in its center with two stones. Candles surrounded the six pointed stars with jars filled with papers. I called Jesse Romero and explained all this. He confirmed that such displays and experiences has much to do with incantations and rituals typical of Kabbalists.\n\nDuring our trip we had to have someone interpret from Italian to Spanish and then to English. Hardly anyone I met spoke English. In Rome, feeling the spiritual emptiness, I finally walked into a confessional and said “bless me Lord for I have sinned” in English. To my surprise, the priest spoke perfect English and said he was from New York. Finally someone spoke English. “I have no confession” I told the priest. I have been hanging out with these monks and nuns who did not enjoy speaking about God and cared more about arts. “I simply want to know, where in Rome can I find anyone who talks about the matters of God, I see all these beautiful churches that are virtually empty egg shells”.\n\nAmused at my inquiry, the priest ended up telling me his confession “I am a Franciscan priest and I am not supposed to tell you this, but it is all fallen away. The pope does nothing and neither does the Vatican do anything to combat the real evil”.\n\nWe ended up consoling each other. I asked him about his view on Sodom and he said: “homosexuality is abhorrent and evil and has infiltrated everything.”\n\nI could not wait to go back to the U.S. The grass was not greener on the other side. I spoke to nuns and priests. If I dug deeper into these nuns, they were worldly or lost or simply interested in arts or chants. One nun in a cloistered monastery we visited said that gays are simply created since God wanted eunuchs in the church. She said that the priest came and gave a class on this issue. “If God made gays why then did God destroy His own gay-creation at Sodom” my wife asked? She was said that she had made a mistake and acted as if she was correcting herself.\n\nThe monk who drove us around, Cristian, was very polite and very conversional. But, there was something quite off about him. He made strange movements with his eyes when he talked, and told us that he enjoyed listening to disco music, Backstreet Boys, Spice Girls and Prince. He also told us that one of his favorite films was on the creation of the song Bohemian Rhapsody. He could not help but display all the moves of a flaming homosexual. One night as one of us (Theodore) was talking during dinner, Cristian, who was sitting next to him, made a biting gesture towards his hand which he immediately moved away. During our last night in Pietrarubbia, Cristian asked Theodore, “Quieres a bailar?” (“Do you want to dance?”) “Con una mujer, si” (“With a woman, yes”) responded Theodore, after which the “monk” walked away.\n\nWhat we found during our time in Italy was not something to be enthusiastic about, but an infiltration of the Church by a Jewish occultist, or a Kabbalist. While we have heard of occultist infiltration into the Vatican, we actually witnessed the reality of this infiltration.\n\nWhile in the Monastery of San Francesco in San Marino, we also witnessed another bizarre sight: pornographic and strange artwork on the walls, which we took pictures of:\n\nOne of the nuns in the monastery recounted to us that the original residents of the convent, Franciscan monks, were outraged by the drawings and hid them. In 2017, the Franciscans decided to leave and it was agreed that a female order would take their place. This was Sister Gloria and her group of nuns. Sister Gloria, as the nun recalled, exclaimed that she loved the drawings and had them displayed in the open. But, it looks like the Franciscans were not completely innocent. For in 2014 the leading priest of the Franciscans who lived in the monastery in San Marino, Fr. Francesco Acquabona, organized an art exhibit in the monastery’s art museum called “Figli di Abramo” (Sons of Abraham), to display Jewish and Islamic art. Much of the the Jewish art were artistic displays of Hebrew letters done by Gabriele Levy, which is part of the Kabbalistic belief in the magical powers of the Hebrew alphabet. Fr. Acquabona curated an art exhibit with Sister Gloria in October of 2018 to show the music of her leading musical talent, Danuta Conti and the sculptor Paola Ceccareli, showing a continual collaboration between the two.\n\nThe love for pornographic artwork is not surprising, given the fact that Sister Gloria Riva, in 2017, wrote an article for a book (published by the Republic of San Marino) full of photos of a male model named Elvis Spadoni, portrayed as Christ and completely nude.\n\nIn the article Sister Gloria describes Biblical stories as “myths”:\n\nShe then describes Spadoni’s nudist work as a work of spirituality:\n\nIn short, an all-round exploration of Elvis Spadoni who, in my opinion,\n\n finds in the words of Paul VI to the artists (by the artist himself) a precious one\n\n synthesis: It is no longer just about art, but about spirituality.\n\nWhat is this spirituality that Sister Gloria is speaking of? Homosexual pornography.\n\nThe book in which Sister Gloria praises this nudist has a photo of Spadoni dressed as a nudist Christ under the title of “Ecce Homo (Behold the man)”:\n\nIs this the “spirituality” that Sister Gloria wants us to aspire to? Not surprisingly, next to Gloria Riva’s article is another article praising the nudist Spadoni by the very Franciscan priest who handed over the San Francesco monastery to Riva and her nuns, Fr. Francesco Acquabona. Sister Riva is an acolyte for the nudist ideology. In her testimony she expresses “a desire we all have towards a great love” and she exclaims an admiration towards those people going around naked because they express this “strong desire to be naked, to be themselves, to be true, free, to an almost primitive dimension”. Gloria’s nudist ideas is based upon the belief that belief is part of returning to the Garden of Eden. As she writes in her article, La nudità di Cristo, l’amore che vince nella famiglia (“The nudity of Christ, the love that wins in the family”), she writes:\n\nWhy is the Church of Rome so plagued with with homosexuality? Because Rome has always had homosexuals. The problem is so deep entrenched in the history of that city that in St. Paul’s letter to the church of Rome, right in the first section, he addresses the sodomite problem. In no other letter does he do this. Walk into the churches of Rome and you will see the walls covered with paintings of nude men, and the young nude boys portrayed as angels are so numerous that you would think that they are depictions of the Islamic heaven.\n\nThey will argue that this is just “art” or that it is to represent some evil people. But walk into any of the ancient churches in Ethiopia, do you see any naked men on the walls? Walk into any ancient church in Russia or Coptic Egypt, do you find such emphasis on male nudity? No. Why does Rome have such a habit? Because it has always had this problem. I have never seen so much sodomite art as much as the churches of Rome. And even around the Cathedral of Orvieto, one can see kabbalistic hexagrams which we took photos of:\n\nWhile Sister Riva has a very strong facade of Catholic tradition — being very educated in the arts and in Medieval music — she also delves into Jewish occultism, better known as the Kabbalah. There is an article written by Gloria entitled, The angel’s greeting and embodied hope, in which she gets into the cabalistic fixation on the spiritual meanings of Hebrew letters. In this framework, Gloria affirms that through understanding certain letters we can comprehend the nature of God, and even that God has both a male and female nature:\n\nThe idea of God being male and female comes directly from Kabbalism. The medieval Spanish Kabbalist, Joseph ben Abraham Gikatilla (a student of the infamous Kabbalist, Abraham Abulafia) in his work, Sha’arey Orah, says that the Shekhinah Glory was manifested as numerous women in the Bible:\n\nBy portraying God as male and female, Sister Gloria is trying to force Christianity to conform to pagan doctrine; for within paganism, the gods are both male and female. So prevalent was this belief amongst the heathens, that a man, to be as Venus, would put on a dress, and a woman, to be as a male god, would adorn herself with armour. The Syrians had placed a statue of her in the temple of Heliopolis clothed like a man, and the people of Cyprus depicted her with a beard. The Romans represented her armed like a warrior. When the Assyrians and Carthaginians worshiped this very goddess, their priests dressed as women and even severed off their private parts as a symbol of the dual gendered nature of the deity. (1)\n\nIn another explanation Riva explains the Holy Spirit as feminine:\n\nBut such an argument, that the Ruach (Holy Spirit) is feminine, is simply deception. In Genesis 41:8 while the word for spirit is feminine verb it was speaking of the spirit of a male, the Pharaoh – a man. In Genesis 45:27 Jacob’s spirit (feminine) revived. But does that mean that Jacob was a female? While the Hebrew noun might be grammatically feminine this does not mean the subject is female or even having feminine characteristics. No one can or should argue that ruach is feminine.\n\nBut what Sister Gloria is doing is merely advancing the very form of occultism that inundated Europe in the Medieval and Renaissance periods. When people talk about Occultism, what they almost always fail to mention is the fact that all European occultism, from the Middle Ages and the Renaissance is Spanish Kabbalah or has a basis in the Kabbalism that spawned from the Rabbinic establishment of Spain. The person who accelerated Kabbalism into the mainstream was philosopher Giovanni Pico della Mirandola. To push for Kabbalist ideology in this time period was very controversial and expectedly received opposition. In 1486, Pico went to Rome and challenged people to a debate by presenting nine hundreds thesis, with these confrontational words:\n\nIn these thesis, Pico upheld his belief in natural magic, but at the same time he also boasted to have had magical powers that far surpassed the forces of nature. He once wrote: “No science can better convince us of the divinity of Jesus Christ than magic and the Kabbalah.”\n\nLike Sister Gloria, Pico was intensely fascinated by Hebrew letters and believed that they had special power. He asserted that words have magical power, but only Hebrew words since they were spoken by God’s own voice. A contemporary occultist of Pico, Johann Reuchlin, wrote in 1494 in his book, On the Wonder-working Word, that the most powerful magic words are not Greek nor Egyptian, but Hebrew. (2)\n\nThat a cloister of monks would be involved in the occult is not far-fetched or anything new, but has been a problem that has occurred in Church history for centuries. For example, in 1323 there was a trial in Paris for a group of monks, canons and laymen. What the investigation discovered was that they were planning to invoke a demon named “Berich” (or the Hebrew name Baruch), within a magic circle made out of the skin of a cat. (3) Magic circles and geometric shapes for occult rituals is intricate in Kabbalist magic. Sister Gloria and her order of nuns are also involved in this, as one can see in a video of theirs, a hexagram surrounded by candles and jars:\n\nIn the same video you see a woman lighting candles next to the jars:\n\nAmongst Gloria’s order of nuns, the one in charge of music is Danuta Conti, and like her mentor Gloria she also has a deep interest in Hebrew letters. On October 29, 2018, there was an art exhibit for the work of Conti and also of the sculptor, Paola Ceccarelli in San Marino’s Museo-Pinacoteca which is connected with the San Francesco monastery.\n\nThere is something eerie about these sculptures. While it attempts to have a Christian face, the sympathy to pagan idols underlies them. “I don’t know why the Mystery chose the road of the Incarnation and the Cross to save us, but I know that from that moment, every detail of life, even the most trivial as a shell could be, is made to be eternal, and mysteriously awaits, as in birth pangs, to see its final Face.”\n\nIn reality, Riva is not promoting Christian art but an art of deception. In an interview that Gloria did in October of 2014, she was asked: “I wanted to ask you: why is the man of today so fascinated by homosexuality, by gender?” to which Gloria answered:\n\nRiva uses a form of deceptive-argument that has become quite frequently used by those who come with a conservative or ‘pro-family’ face that talks about one’s amazing ‘gay friends,’ and makes a distinction between the sodomites and the transgenders, making the homosexual out to be one who is simply a product of his biological state or upbringing, and transgenderism or “gender theory” to be the real threat as opposed to gays and lesbians. So-called conservatives utilize this argumentation all the while expressing opinions against “gay marriage.” This way of arguing does several things: Firstly, it gives people the idea that the ones expressing this argument are against the sodomite agenda and thus are okay; secondly, it lends comfort to sodomites by saying that they are not the enemy, but that only the transgender or gay agenda is evil, thus giving the citizen of Sodom a pass while presenting an appearance of combat against Sodom.\n\nSister Maria Gloria Riva does this very way of arguing. She at first claims that there is an association of homosexuals in Italy who are good people; she makes a distinction between this association of sodomites and “gender theory” or transgenderism (thus, appearing as if she is ‘pro-family’); she also does the most typical design of the supporters of Sodom and says that she has many ‘gay friends’ and that they are homosexual due to their chemical makeup (in other words, they are ‘born that way’).\n\nThe statement is obviously equivocation and confusion. At first she makes a distinction between homosexuality and transgenderism, as if we have to respect a difference between the ranks of Sodom, when the reality is that it is all evil. She then speaks about an association of sodomites with whom she is a friend, and then distinguishes them with the agenda, as if the citizen of Sodom is not active in the same evils as the ambassadors of Sodom. All of this is a deliberately sophistical way to exempt Sodom all the while pretending to be ‘pro-family.’\n\nDuring our time in Pietrarubbia, we had the pleasure of cooking for the entire monastery. Joining the nuns in the evening meal was an older couple, Franco Troiano and his wife Orietta Tunesi. The two are originally from Milan but have been living for many years in Brussels. Once dinner was done, we ended up striking a conversation with Mrs. Tunesi.\n\nTheodore: “You are from Brussel, the center of the European Union!”\n\nTheodore: “What will happen if the EU were to all come crashing down?”\n\nTunesi: “No! We do not need the EU to have peace!”\n\nTunesi then went on to explain her remonstrances with the European Union.\n\nTunesi: “The EU does not respect culture. There are different cultures here in Europe.”\n\nTheodore: “Yes. That is correct. German culture is different from Italian culture.”\n\n“Not just Italy and Germany,” responded Tunesi. “There is a difference between Northern and Southern Italian culture.”\n\nWe weren’t just dealing with a typical anti-EU person, but a hardline regionalist.\n\nWe managed to take a photo of Mrs. Tunesi while she was in the parish in Ponte Cappuccini:\n\nI was later told by someone in the monastery that Tunesi and her husband, Franco Troiano, were the funders of the monastery. Doing our research on this, we found this to be true. Perusing through Troiano’s website, Francamente, it reads: “We also support two small cloistered convents in Pietrarubbia and San Marino”. These are the two monasteries that we visited and they are both under the superintendence of Sister Maria Gloria Riva.\n\nBut what we found really troubling is Troiano’s history in the militant and revolutionary Leftist movement with ties to US and Italian intelligence. In December of 2015, the Italian publication, Lettera44, released a story on the French school, Hyperion (formerly known as Agorà), which was a center for Marxist revolutionary action. The article mentions Franco Troiano as a founding member of Hyperion:\n\nHyperion appeared to be a Left-wing language school, but the reality was that it was a terrorist organization heavily involved in weapons deliveries and with western intelligence agencies (like the Taliban). According to a 1985 document from the Subcommittee on Security and Terrorism, Hyperion was working with the KGB to coordinate the activities of major terrorist organizations like the PLO, the ETA and the IRA.\n\nThe Hyperion school has been linked with the assassination of the Italian statesman, Aldo Moro, and there was actually an investigation on this matter but it was stopped by the Italian intelligence agency, SISDE, according to one Italian magistrate:\n\nThat Hyperion was working with both American and Russian intelligence reveals something: it was more than just Leftism, but a front being used by both the CIA and KGB to control the political narrative for the purpose of some geopolitical interests. The point is that the CIA and the KGB were playing both sides: the Left and the Right. For example, we know for a fact that both the CIA and the KGB were assisting Nazi scientists after the Second World War, and they were both doing so in the name of fighting each other, with the CIA claiming that if they didn’t bring Nazi scientists into the US to use their expertise that the Russians would use them and have some sort of advantage against the Americans. But, is this really the case? were the Americans and Soviets really just pure enemies, or did they pretend to be enemies? It appears really that the truth is somewhere along the middle. When the Russians and Americans were using Nazis, there was one Nazi in particular that they were both knowingly using at the same time, with no scruples.\n\nIn Operation Paperclip — in which the US collaborated with and hired Nazi scientists to work in the US science industry — the Americans were working with a major Nazi, Walter Schieber. A 1947 U.S. Air Force memo stated that “Dr. Schieber’s talents are of so important a nature to the U.S. that they go far to override any consideration of his political background”. When Special Agent Carlton F. Maxwell found out that Scheiber had been working with the MGB — (the Ministry of State for the Soviets, really the forerunner of the KGB), he informed the CIA of this. What did the CIA say? “Just forget it,” (see Jacobsen, Operation Paperclip, ch. 20, p. 381)\n\nTroiano was within Hyperion when it was being used by both the KGB and the CIA, and this was happening during another American project of collaborating with Nazis: Operation Gladio. In this operation American and European intelligence agencies backed Nazi paramilitaries to commit terrorist attacks so that they could be blamed on Leftists in order to spark European nationalism. The biggest of these terrorist attacks was the Bologna Massacre in August of 1980 in which 85 people were butchered in a horrific bombing. One of those behind the massacre was Guido Giannettini, an Italian secret service agent who himself was a nationalist (being a member of Young Italy). Giannettini worked closely with NATO and in 1961 even gave a lecture in the United States at the Naval War College entitled, “Techniques and Possibilities of a Coup d’Etat in Europe.” As Italian researchers Calvi and Laurent write:\n\nGladio was going from the late 1940s (beginning of the Cold War) all the way to 1990 (when the lid on the situation was opened). Troiano was with Hyperion during the time when both Operations Gladio and Paperclip were ongoing. We know for a fact that the Americans backed both Nazis, Right-wing paramilitaries and Left-wing militants such as those in Hyperion, Troiano’s group.\n\nTroiano was deeply involved with the Metropolitan Collective of Milan, which would give birth to the Red Brigade movement which was tied to Hyperion. According to Yonah Alexander and Kenneth Myers:\n\nNow, Franco Troiano today speaks a very conservative Catholic message. But, given his history and the fact that he is funding two monasteries under the influence of a Kabbalist, it makes one wonder about his motivations. Supposedly now Troiano is a conservative Catholic, but where is his testimony?\n\nWe spent two weeks in Rome and in Rimini Italy in the north where all I saw was the perfect setting for Christ’s war expeditions when He comes to judge a fallen church in Habakkuk 3 where God describes the scene:\n\n“The flock shall be cut off from the fold” is a definite split. “There shall be no heard in the stalls” describes empty churches and the houses of God (“stalls”) as fruitless “no herd in the stalls”.\n\nAnd this is exactly what we saw.\n\n(1) See Young, Historical Dissertation on Idolatrous Corruptions, vol. i, ch. ii, pp. 97, 100-103; Kramer & Sprenger, Malleus Maleficarum, part ii, quest. ii, ch. viii; James Townley’s Maimonides, Reason of the Laws of Moses, ch. xii, p. 208; James Townley’s Maimonides, Reasons of the Laws of Moses, note xxxiii; Lucian, Syrian Goddess, ch. 26; Firmicus, The Error of the Pagan Religions, ch. 4, trans. Clarence A. Forbes; Lucian, Syrian Goddess, ch. 27; James Townley’s Maimonides, Reasons of the Laws of Moses, note xxxiii\n\n(2) See Kieckhefer, Magic in the Middle Ages, ch. 6, pp. 148-149\n\n(3) See Kieckheffer, Magic in the Middle Ages, ch. 8, p. 191", "opengraph": {"locale": "en_US", "type": "article", "title": "The Bizarre World Of Monasteries - Walid Shoebat", "description": "By Theodore Shoebat A very rare occurrence has taken place in the Catholic world: a nun has been disbanded from her order, an act that only takes place about ten times a year. This happened to Mother Marie Ferréol who was thrown out of the Dominicans of the Holy Spirit (dominicaines du Saint-Esprit) in France. […]", "url": "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/", "site_name": "Walid Shoebat", "article:published_time": "2021-05-28T01:10:13+00:00", "article:modified_time": "2021-05-28T01:10:15+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/05/My-Post-2021-05-27T200950.186.jpg", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/q_2DKw2Ib24\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/q_2DKw2Ib24"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/1UxPkEf9-J8?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/1UxPkEf9-J8?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["http://www.riminiduepuntozero.it/le-monache-del-montefeltro/", "http://www.riminiduepuntozero.it/le-monache-del-montefeltro/?fbclid=IwAR01X2Io6XqM9Sz7dWbvMUL5mO2Q21RyHuAe2Sh2lPKDtW23vTiti7EsolI#", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/san-marino-monastery/", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/gloria-photo-3/", "https://betdin.centronorditalia.it/en/who-we-are/", "https://www.avvenire.it/rubriche/pagine/ebrei-il-punto-di-vista-nascosto-della-sinagoga-di-ildegarda", "https://www.parrocchiamorciola.it/il-muro/56-ai-piedi-di-cristo-quella-donna-siamo-noi-di-sr-maria-gloria-riva", "https://shoebat.com/wp-content/uploads/2019/10/riva1.jpeg", "https://www.merateonline.it/articolo.php?idd=80746&origine=1&t=Paderno%3A+Suor+Maria+Gloria+Riva+incontra+i+giovani+per+spiegare+la+Creazione+nell%26rsquo%3Barte", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/gloria-rome-art-2/", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/gloria-rome-art-3/", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/gloria-rome-art-4/", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/gloria-nude-paintings-2/", "http://www.libertas.sm/notizie/2016/11/15/san-marino-intervento-della-segreteria-esteri-sul-convento-di-san-francesco.html", "https://www.sanmarinortv.sm/news/cultura-c6/san-marino-mostra-figli-abramo-racconta-religioni-monoteiste-a104020", "https://www.sanmarinortv.sm/news/cultura-c6/femminile-tra-altro-alto-mostra-sammarinese-3-donne-3-eventi-a98895", "http://www.spadonielvis.com/Ritratto-autoritratto_Elvis%20Spadoni_64PAG_24x28CM.pdf", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/elvis-spadoni-nude-christ-2/", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/elvis-spadoni-tongue-2/", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/elvis-spadoni-2-2/", "https://www.chiesadimilano.it/servizioperilcoordinamentodeicentriculturalicattolici/files/2017/05/Suor_Maria_Gloria_Riva__1.24710.pdf?fbclid=IwAR1RC4X_xtOGyWAELM6KIo1_V44bNrj4OSEGiaKXfKXrrrF6l5ZBVFABOWM", "https://www.avvenire.it/rubriche/pagine/la-nudita-di-cristo-br--l-amore-che-vince-nella-famiglia_20151015", "http://luoghidellinfinito.it/Editoriali/Pagine/Il-saluto-dell%27angelo-e-la-speranza-incarnata.aspx", "https://www.adoratrici.it/spiritualità/corso-biblico/credo-nello-spirito-santo", "https://www.youtube.com/watch?v=2o50aWuWK2E", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/project-gloria-magic-kabbalistic-circle-2/", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/gloria-church-pietrarubbia-candles-2/", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/gloria-church-pietrarubbia-candles-3/", "https://shoebat.com/wp-content/uploads/2019/10/Gloria-with-Paola-Ceccarelli-.tiff", "https://shoebat.com/2019/10/12/how-our-trip-to-rome-uncovered-a-network-of-nuns-who-are-pushing-for-the-occult-in-the-catholic-church/gloria-with-paola-ceccarelli-3/", "http://www.noifamiglia.it/archivio/Seminari2014/2Seminario_2014.pdf", "https://www.francamente2.com/it/2018/10/nozze-doro-di-franco-e-orietta-appunti-di-franco-troiano-per-il-pranzo-a-francavilla-al-mare-feste-di-lanciano-16-settembre-2018/", "http://www.apple.com", "https://www.ncjrs.gov/pdffiles1/Digitization/101561NCJRS.pdf", "http://isole.ecn.org/ponte/mediateca/calvilaurent3.pdf", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=facebook", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=twitter", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=reddit", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=linkedin", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/#print", "#", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=skype", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=jetpack-whatsapp", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=telegram", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=pocket", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=pinterest", "https://shoebat.com/2021/05/27/the-bizarre-world-of-monasteries/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-05-28T01:10:13+00:00"}