{"result_id": "271049", "URL": "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/", "timestamp": "2023-04-25 17:07:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Cannibalism Is Becoming More And More Popular", "cleaned_text": "The title is not an exaggeration. Truly, cannibalism — which is amongst the most demonic of evils — is becoming more and more popular. We are seeing this on the internet, with articles being published in defense of cannibalism. There are also videos coming out depicting cannibalism and these have been receiving a surge in popularity.\n\nA recent article came out on the rise of viewership for vides online containing pedophilia, homosexuality, dismemberment and cannibalism. The report, from news.com, read:\n\nThere is even something that the demonic scientific establishment is coming up with, called “synthesised cannibalism,” in which human flesh, made in a lab, is consumed. Some sinister and devil ridden scientists in Holland are coming up with ways to multiply human skin cells. In one report on this grave evil, it reads:\n\nThe report goes on to talk about the “benefits” of cannibalism. I am not even joking. People right now are actually writing in defense of cannibalism. This sick article goes on to state:\n\nDid you get that? These sick bastards are saying that cannibalism is great because its ‘environmentally’ friendly.’ This is yet another evidence as to how environmentalism leads to genocide. Once you start elevating the creation, then you see yourself as the Creator — that is, you start seeing yourself as God — and in wanting to take the position of God, you begin to want to determine who lives and who dies, what is morally wrong and what is morally right.\n\nNotice how they are not yet pushing the murder of people to eat them. They want to incrementally go down to this direction. But first they will start out by trying to normalize cannibalism by saying that nobody is murdered and that the flesh is made in the lab. They will say, ‘AS LONG AS NOBODY DIES, ITS OKAY.’ And they will push for ‘voluntary cannibalism,’ which is when somebody dies and ‘wills’ that somebody eat him or her after death. Again, they will use this to desensitize people to cannibalism all under the words of, ‘NOBODY IS BEING KILLED AND THE PERSON WANTED TO BE EATEN.’\n\nFrom this, they will then begin justifying using people like farm animals to eat them. They will say, ‘WELL, WE ARE ANIMALS, WHY CAN’T WE EAT HUMANS JUST LIKE WE EAT COWS?’\n\nThe whole diabolical movement for cannibalism is a product of people believing in evolutionism. For, if we are all animals in the process of darwinian evolution, in this cruel construct of “survival of the fittest,’ then there is no moral argument — within atheism or Darwinism — against cannibalism.\n\nSome wretched people will come along and say, ‘BUT THE BIBLE HAS NO MORAL ARGUMENT AGAINST CANNIBALISM SO YOU ARE WRONG!’\n\nThis is false, and a terrible consequence of the Protestant Bible becoming the mainstream Bible in the West. Because, the Protestant Bible does not contain the Book of Wisdom, which the Catholic Bible still has. In the Book of Wisdom it speaks of the evils of the Canaanites, and describes cannibalism as one of them:\n\nAnd notice that the text does not say that the pagans murdered people and then ate them, but that, they ate the flesh and blood of human beings, emphatically signifying that consuming human flesh is an evil, regardless if the victim was murdered or not. This is the spirit of Christianity, striking the enemy of humanity, which makes insidious sophisms to justify cannibalism (‘he was not murdered before eaten, so therefore its okay’), preventing any deception from getting leeway. The consumption of human flesh is evil, emphatically and without question.\n\nAnd what was the other evil that the Canaanites committed? Homosexuality. Speaking of the pagan people in Canaan, Moses says: “you shall not learn to follow the abominations of those nations.” (Deuteronomy 18:9) One of these abominations was homosexuality. In the Book of Leviticus it reads: “You shall not lie with a male as with a woman. It is an abomination.” (Leviticus 18:22) And in verse 24 it reads: “Do not defile yourselves with any of these things; for by all these the nations are defiled, which I am casting out before you.” (Leviticus 18:24)\n\nSo, in the pagan land of Canaan, homosexuality and cannibalism were done. Canaan, with all of its abominations, is set as an example of a place utterly taken by evil and demonic possession. Homosexuality and cannibalism go hand in hand. You cannot have one without the other. This is why so many serial killers have been homosexuals and cannibals. They are both rooted in the same demonic source.\n\nMake no mistake about it, the push for homosexuality is an innate part of the same conspiracy to normalize cannibalism.\n\nThe very people who have been pushing for homosexuality, are the same types that have been now advancing cannibalism. Here is a video of atheists Richard Dawkins and Peter Singer actually normalizing cannibalism:\n\nAn Israeli philosopher, named Sam Vaknin, has also been advancing cannibalism. He writes:\n\nIf atheism is the foundation of a moral compass, then there really is no argument against cannibalism. This is why Christianity, truly, is the basis of an orderly civilization. People will come up with all sorts of sophistical arguments that we do not need Christianity to have order in society, and they will point to some civilization in the past. The anti-Catholic rebels of the French Revolution glorified the pagan past, and when they executed their violence, they butchered countless people in their reign of terror, and even committed cannibalism. Mme. Roland, an adamant supporter of the revolution, whose husband was France’s Minister of the Interior, was herself horrified and recounted the cruelty done by the rebels:\n\nIf humanity rejects the Flesh and Blood of Jesus Christ, then humanity will eventually consume itself.\n\nWe Are About To Enter A New World War, A Blood Bath Is About To Commence As The Empire Of The Antichrist Will Rise Up. This Is Why I Wrote The Book, Christianity Is At War, The Most Exhaustive Study Ever Done On Christian Warfare. Click Here To Get The Book Today And Prepare Your Soul For The War That Is To Come.", "opengraph": {"locale": "en_US", "type": "article", "title": "Cannibalism Is Becoming More And More Popular - Walid Shoebat", "description": "By Theodore Shoebat The title is not an exaggeration. Truly, cannibalism — which is amongst the most demonic of evils — is becoming more and more popular. We are seeing this on the internet, with articles being published in defense of cannibalism. There are also videos coming out depicting cannibalism and these have been receiving […]", "url": "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/", "site_name": "Walid Shoebat", "article:published_time": "2017-11-29T20:14:26+00:00", "article:modified_time": "2017-11-30T03:25:39+00:00", "image": "https://shoebat.com/wp-content/uploads/2017/11/maxresdefault-10.jpg", "image:width": "1920", "image:height": "1080"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/5oqrUyO0nSQ?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/5oqrUyO0nSQ?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["http://www.news.com.au/technology/online/censorship/parents-warned-over-prevalence-of-disturbing-elsagate-content-targeting-kids-on-youtube/news-story/8d5c8b211781e7c5f8599b52f8078260", "http://www.ffmu.biz/christianity-is-at-war/", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=facebook", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=twitter", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=reddit", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=linkedin", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/#print", "#", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=skype", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=jetpack-whatsapp", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=telegram", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=pocket", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=pinterest", "https://shoebat.com/2017/11/29/cannibalism-is-becoming-more-and-more-popular/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2017-11-29T20:14:26+00:00"}