{"result_id": "271023", "URL": "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/", "timestamp": "2023-04-25 17:07:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Putin Is Right. Ukraine Does Have A Nazi Problem", "cleaned_text": "Since this war in Ukraine broke out in late February of 2022, there has been much whitewashing and undermining being done in regards to the presence of the far-Right in Ukraine, and their power. In this article, we would like to present facts that demonstrate how the ultra-nationalists in Ukraine do indeed have a significant presence in the country.\n\nThe first argument that comes up is that the president of Ukraine, Volodymyr Zelenskyy, is Jewish. Fair point. What we are arguing here is not that all Ukrainians are Nazis or ultra-nationalists (nobody is arguing this), or that even most are, but that enough are. Enough to be dangerous. This is attested by the fact that Zelensky pays lip service to Ukraine’s racist and murderous national heroes, such as Andrei Melnik and (the most famous of all) Stepan Bandera. It was Melnik who declared in 1939 that his aim was (in his words) “the final annihilation of the common enemy.” (p. 197) The German Nazi general, Wilhelm Canaris wrote about using the Melnik’s (or Mel’nyk’s) paramilitary, the OUN (Organization of Ukrainian Nationalists) to annihilate both the Jews and th Poles: “I would have to make appropriate preparations with the Ukrainians so that … the Mel’nyk Organization (OUN) can produce an uprising which would aim at the annihilation of the Jews and Poles.” (p.205) Melnik’s (and Bandera’s) OUN would join the Nazis and become a German unit called the Nachitgall Battalion, and they would create tremendous horror. As Saul Friedman wrote:\n\nAccording to Wiktor Poliszczuk, in the first days of the German occupation of Poland, OUN leaflets were disseminated, calling for the extermination of Jews and Poles: “Exterminate the Poles, Jews and communists without mercy. Do not pity the enemies of the Ukrainian National Revolution!” “Nation, know that Moscow, Poland, Magyars [Hungarians], Jews are your enemies! Annihilate them!” (Ibid, P. 209) In July 6th of 1946, Melnik wrote a letter to Hitler pledging his full allegiance to the Reich: “We request that we be allowed to march shoulder to shoulder with the legions of Europe and with our liberator, the German Wehrmacht, and therefore we ask to be permitted to create a Ukrainian military formation.” On July 10th, just four days later, Melnik’s OUN declared to Hitler its “most loyal obedience” in creating a Europe “free of Jews, Bolsheviks, and plutocrats.” (Ibid, pp. 213-214) A German eyewitness in Zloczow, Tarnopol province, recounted a massacre that he saw done by Stepan Bandera’s men:\n\nBut, Ukraine’s president Zelensky will pay lip service to the murderers of Jews. In fact, it was agreed that Zelensky would have a mausoleum in dedication to the heroes of Ukraine, including Bandera and Melnik, as we read in one report:\n\nZelensky knows that he has to appeal to those who still revere Bandera, and thats why he said: “There are indisputable heroes. Stepan Bandera is a hero for a certain part of Ukrainians, and this is a normal and cool thing. He was one of those who defended the freedom of Ukraine.” But even Zelensky admits that there are too many streets named after Bandera: “But I think that when we name so many streets, bridges by the same name, this is not quite right”. So, while Zelensky pays lip service to the Banderites, he also admits that the many streets named after Bandera is excessive. The fact that Zelensky — a Jew — calls Bandera — a murderer of Jews — a hero, is a sign that there are enough people in Ukraine who revere Bandera that the president himself has to say pleasant things about him. And, the fact that there are too many streets named after Bandera, is an indication of this culture of reverence for this mass murderer. Ergo, Ukraine has a Nazi problem.\n\nSince this war in Ukraine broke out in late February of 2022, there has been much whitewashing and undermining being done in regards to the presence of the far-Right in Ukraine, and their significance. In this article, we would like to present facts that demonstrate how the ultra-nationalists in Ukraine do indeed have a significant presence in the country.\n\nThe US invasion of Iraq sparked a rise in Islamic fundamentalism and really pulled the covers off an underlying Islamist problem in the Middle East. Similarly, Russia’s war in Ukraine provided perfect propaganda fodder for recruitment to far-Right paramilitaries, and also blew the lid off a latent Nazi presence within the country. One can see how Ukraine’s far-Right, once the Russians had taken Crimea and facilitated a separatist war in the Donbas, went from being a fringe movement to a significant political movement. For example, on May 25th of 2014, far-Right activist Ihor Mosiychuk was elected into the Kiev City Council.\n\nOn October 26th of 2014, Mosiychuk was elected as a member of Ukraine’s national parliament (Verkhovna Rada). On the same day, Yuriy Shukhevych, the co-founder of the ultra-nationalist paramilitary and political organization, the Ukrainian National Assembly – Ukrainian People’s Self-Defence, also won a seat in parliament. Not only is Yuriy a far-Right politician and radical, but he is the son of Roman Shukhevych, one of the orchestrators of the of the Galicia-Volhynia massacres of about 100,000 Poles during the Second World War and who, after the war, fled with thousands of nationalist fighters into the mountains of the Polish eastern borderlands where they awaited for the third world war. (See Piotrowski, Poland’s Holocaust, ch. 7, p. 241).\n\nThe fanaticism of the father was passed down to the son, and such ideology still has a presence in Ukraine. Also in the same election of October 26th of 2014, Dmytro Linko of the far-Right ultra-nationalist organization, Bratstvo (Brotherhood) won a seat in parliament. Another winner that night was Oksana Korchyns’ka, the wife of Dymytro Korchynsky, the founder of Bratstvo and the St. Mary’s Battalion. The fact that radical political activists who were once seen as insignificant and who were largely ignored by even people who researched Ukraine, now became members of parliament on account of Russia’s taking of Crimea, is an indication that the Russian invasion of, and presence in Ukraine will only intensify radicalization.\n\nTo see more of how significant the ultra-nationalist presence is in Ukraine, one can look to the beginning of the Ukraine Spring, in the Euromaidan revolution of the spring of 2014., where Azov was birthed. It began when thirty people, several Maidan representatives alongside allies from the far-Right “Patriot of Ukraine” organization — who had just been released from prison — gathered together in the Kozatskiy hotel in Kiev. They also held an office in Kharkiv, which pro-Russian separatists would attempt to storm on March 14th of that year. Street clashes erupted in Kharkiv between the Ukrainian far-Right and the separatists. Amidst the chaos, rose a group calling itself Right Sector and “black little men”, consisting of members of Patriot of Ukraine (or Social National Assembly) and allies dressed in balaclavas and black uniforms. They declared that they were there to counter the pro-Russian forces in southern and eastern Ukraine. The press quoted a declaration by the new group which stated:\n\nThe Ukrainian government looked at this rising group with interest, wanting to add them as an official battalion. According to a memoir by Azov representative, Stepan Bayda, in April of 2014 there commenced a dialogue between these far-Right volunteers and the new Ukrainian government who offered to establish the group as a regular troop battalion. Contact between the volunteers and government officials continued on. Eventually these fighters would form their own paramilitary called Azov. The battalion began to take shape with the help of a government official named Oleh Lyshako, the leader of the Radical Party who, at the time, was a member of parliament.\n\nAzov’s formation was also partially assisted by Dymytro Korchynsky, the founder of Bratstvo (Brotherhood). The official founding of Azov has been dated as May 5th of 2014, in the southeastern city of Berdiansk at the Sea of Azov (hence the name of the battalion). On May 18th, 80 volunteer fighters moved from the Kozatskiy hotel in Kiev to Berdiansk to train at a firing range. On May 20th, Azov made an announcement that it was drafting new volunteer soldiers. Soon after its formation, Azov would liberate the city of Mariupol from pro-Russian separatists, an action that sparked its fame throughout Ukraine.\n\nOn the second anniversary of the founding of Azov, Anton Herashchenko, an oﬃcial advisor of Ukraine’s Minister of Interior, recounted the emergence of Azov in a long Facebook note. “Yesterday marked exactly two years since the decision was taken to create the already legendary Azov battalion” he wrote. “My friend Yuriy Butusov believes that it is important that the events of that memorable spring are not forgotten. They must be kept in people’s minds.” He writes about how “I had heard about Andriy Bilets’kyy [the first commander of Azov] and his team before. Together with other like-minded people, he had created the national-patriotic organization Patriot of Ukraine”. He remembers how he personally met with Biletsky on April 6th of 2014 when Dmytro Korchynsky and Ihor Mosiychuk were at a meeting with the Minister of Interior, Arsen Avakov.\n\nOn that same day, Herashchenko agreed with Avakov to discuss the reformation of the Ministry of Interior, and he believed that it was only going to be a short conversation. But after the discussion was concluded, the phone began ringing continuously with calls from Kharkiv, Donetsk, Luhansk and other regional capitals in the South-East about pro-Russian separatists seizing government buildings.\n\nHerashchenko recounted how many in the Ukrainian police were demoralized in the face of the pro-Russian separatist revolt. Some of them were even ready to surrender and defect to the Russian militia just like their fellow officers had done in Crimea two weeks prior. Some officers in the Donetsk region were demoralized, while some were also secretly cooperating with the separatists, passing to them information about Kiev’s plans to squash the rebellion.\n\n“In Luhansk,” writes Herashchenko, “the SBU staﬀ did not even dare or did not want to fire warning shots into the air to stop the separatists capturing their building. As a result, more than 1,100 fire arms fell into the hands of pro-Russian citizens, weapons that had been held there since the Stalin era in case an underground organization needed them.”\n\nA month after the separatist uprising, no one in law enforcement in Luhansk was willing to take away these weapons, or give orders to do so. It was in such a predicament, says Herashchenko, that a meeting took place in which Andriy Biletsky stated that he and his team of fighters — at this time calling themselves Patriot of Ukraine — wanted to do an armed defense for Ukraine. Minister Avakov stated that this was possible, but that Patriot of Ukraine needed to be integrated into either the police force or the National Guard, so that they could take an oath and receive weapons in accordance to the Ukrainian Constitution and law, regardless of them being Nazi. Andriy, at this time, did not want to do this because there was a lot of animosity that the far-Right had towards the police since they had beaten nationalist activists.\n\nHerashchenko writes that after April 6th of 2014, he met with Oleh Odnorozhenko, the head ideologue for Patriot of Ukraine (later Azov) and asked him to convince Biletsky to change his mind. Odnorozhenko agreed with the idea of integrating the paramilitary to the security forces. The government wanted to use Azov to push the separatists out of the city of Kharkiv. Minister of Interior Avakov and Stepan Poltorak, the Internal Troops commander, organized a forced expulsion, and despite this the situation still remained.\n\nBetween April 13th and 20th of 2014, several hundred Patriot of Ukraine (Azov) fighters, in coordination with the Ministry of Internal Affairs and the Security Services of Ukraine (SBU) marched through Kharkiv. According to Hareshchenko, the Azov volunteers did not want to provoke clashes with the separatists, but rather to work as a quiet force, “making it clear to anyone who once again attempted to seize the Regional State Administration building that they would not only have to deal with a disorganized and indolent police force, but also with young pro-Ukrainian citizens who would not let them oﬀ lightly. I recall how Andriy Bilets’kyy’s guys in black uniforms went through Kharkiv in a column of vehicles and with one glance by them made clear that Kharkiv would be defended and that what happened in Donets’k and Luhansk would not happen here!”\n\nAt the end of April of 2014, both Biletsky and his ideologue, Oleh Odnorozhenko, approached the Minister of Interior, Arsen Avakov, and proposed the idea of organizing the expulsion of the separatists who had been occupying and holding the city council building in Mariupol for a number of weeks. Serhiy Taruta, the governor of Donetsk, was one of the key figures behind pushing the preparation for the clearing of the city council building. Hareshchenko recounts something that demonstrated the significance of Azov in the war — how much the government backed their operation in Mariupol: “The building was stormed on April 24 [2014]…. Serhiy Taruta understood perfectly well that, at that time in the Donetsk region as well as in Ukraine as a whole, there were virtually no orchestrated government forces capable of carrying out such an operation. … [Interim President of Ukraine] Oleksandr Turchinov, [Minister of Interior] Arsen Avakov and [Head of Presidential Administration] Serhiy Pashins’kyy gave their full backing to the operation, as full as possible in the circumstances.” He also talks about how Ihor Kolomoyskyi, Ukrainian billionaire who is the second or third richest man in Ukraine and who at that time was the governor of Dnipropetrovsk Oblast, funded Azov’s operation:\n\nTo further show the significance of Azov in Ukraine’s war, there is a quote from Hareshchenko in which he recounts that he organized Azov’s coming to Mariupol to conduct a mission — the clearing of the city council building — that the Ukrainian government was unable to do. The fact that Azov — a neo-Nazi and ultra-nationalist battalion — had to be used to retake Mariupol because the Ukrainian government was incapable, indicates the significance of this paramilitary:\n\nBut after Azov left, the separatist quickly retook the building. It was realized that Azov would not be fully efficient unless they were to become a part of the government security forces and so receive weapons easily from the state. “On the night of May 4–5 [2014], in Mariupol,” writes Hareshchenko, “around 100 young patriots took the oath and were given weapons. From that point on, each day and each hour really counted! The new force was named Azov. Legally, Azov was established as a battalion of the Patrol-Guard Service of the Donets’k Department of Internal Aﬀairs. Direct document preparation was carried out by the newly-appointed chief of the Mariupol police department, [Valeriy] Androshchuk.”\n\nAnother key figure behind the formation of Azov was a Ukrainian member of parliament named Oleh Lyashko. In the words of Hareshchenko: “Oleh Lyashko did play a very active role [zhyveyshee uchastie] in the formation the Azov battalion. He contributed to Azov’s creation both because he truly wanted to see a force capable of clearing out the city, and to gain electoral perks as a presidential candidate.” The separatists, knowing that Azov was on its way, left. But not before getting attacked by a gang of pro-Ukrainian volunteers, who had infiltrated the separatists to gather intelligence. The volunteers hit the separatists with a chemical attack using a liquid that, while not harmful, causes a severe pain in the eyes. The chemical attack preceded the flight of the separatists. “In the morning,” writes Herashchenk, “Azov went through the streets of Mariupol in a column of vehicles in black uniforms carrying weapons. It was a demonstration of power designed to show that Mariupol always has been and will always remain a Ukrainian city. After this patrolling, the separatists disappeared from Mariupol in the space of a few days”.\n\nHerashchenko again affirms that the Ukrainian security forces were too corrupt to deal with the separatists in Donbas, and the problem was solved thanks to Oleksandr Turchinov (Minister of Interior) and Arsen Avakov (Minister of Internal Affairs) making the decision “to arm volunteers and, on this basis, to create special divisions of the police or volunteer battalions,” and because of this “the situation changed fundamentally. The Azov battalion, together with more than 30 other voluntary divisions of the police, the National Guard and the Ukrainian Armed Forces, became another building block in the foundation of a new, independent of Russia, Ukrainian Nation!”\n\nSo here we see the Azov Battalion being backed by departments of the Ukrainian government — the Ministry of Interior, the Ministry of Internal Affairs, the government of Dnipropetrovsk under one of Ukraine’s wealthiest men, Ihor Kolomoyskyi, the government of Donetsk under Serhiy Taruta, the advisor to Ukraine’s Minister of Interior, Anton Herashchenko — and the fact that there was substantial state support to this battalion is an indication of its significance. Moreover, the fact that the government saw collaborating with Azov and making it a part of its National Guard as essential to repulsing the Russian-backed separatists, tells us that they are truly not insignificant. Since working with Azov was seen as essential for Ukraine, then this is indication enough that Ukraine has a Nazi problem.\n\nIts also relevant that we keep in mind that the commandant of the Euromaidan revolt, the event that accelerated this conflict, Andriy Parubiy, is an ultra-nationalist. Parubiy led the Euromaidan protests and after this he was appointed as a Secretary of the National Security and Defence Council of Ukraine (until his resignation in August of 2014). From April 14th of 2014 to August 29th of 2019, Parubiy served as the Chairman of the Verkhovna Rada, the Ukrainian parliament. According to an article published by the Nation, the reason why Ukraine refuses to remove battalions like Azov is because of their effectiveness in battle, and the fact that people in government were behind their organization:\n\nParubiy is not just any neo-Nazi. He was the co-founder for a militant neo-Nazi party, the Social-National Party of Ukraine (SNPU), which would really be a predecessor to battalions like Azov. The SNPU used the Germanic Wolfsangel, just like the Azov Battalion today. So the revolts that the Western world praised as “pro-democracy” opposition was led by the founder of a neo-Nazi paramilitary, the Social-National Party of Ukraine, a goal of which was to make Ukraine into a world superpower that would extend to the Balkans and the Caucasus.\n\nIn the manifesto for the Social National Assembly it reads: “The ultimate goal of Ukraine’s foreign policy is world domination.” Parubiy co-founded the Social-National Party of Ukraine alongside another ultra-nationalist named Oleh Tyahnibok who, in the 1990s, fought alongside Chechen separatists, against the Russians. Other Ukrainian nationalists, also part of the SNPU, fought for the Chechens, such as Igor Mazur, Valeriy Bobrovich, Dmytro Korechynsky, Andriy Tyahnibok, Dmytry Yarosh, Vladimir Mamalyga, and Olexander Muzychko. They fought for Chechen jihadist leaders Shamil Basayev and Ibn al-Khattab. The Ukrainian fighters trained at the base for the Ukrainian National Assembly, in Ivano-Frankivsk, and the base was called “the Ukrainian People’s Self-Defense.” The Ukrainian fighters were sadists, being known to cut throats, pull out finger nails, break fingers and gouge out eyes. The Chechens even gave one Ukrainian fighter, Okexander Muzychko, an award for bravery.\n\nThe fact that the Euromaidan protests — the very thing that overthrew the pro-Russia government in 2014, that the world praised as a move to democracy, and that helped sparked the current conflict — was led by an ultra-nationalist who founded a political paramilitary with another ultra-nationalist who joined the Islamic jihad to murder Russians, is quite telling when it comes to Ukrainian society and their pride for their revolution and new government. Arsen Avakov was the initial commandant for the Euromaidan, but this position was given to the ultra-nationalist, Parubiy. According to a report by Newsline:\n\nNow there are those who will always try to undermine the Nazi and ultra-nationalist reality of the Euromaidan revolt. But lets make a hypothetical scenario to give better perspective. Lets say there was a revolution in Iran led by Shiite fanatics, and Saudi Arabia, not liking the situation, funneled arms to the hands of Iran’s Sunni population which then began to take over government buildings. Iran, obviously wanting to stop this situation, then begins planning to defeat the separatists, but its government is too corrupt to be capable of this. So, the new Iranian government then turns to a fanatical paramilitary of Shiite fighters, and can only rely on such battalions to defeat the Saudi-backed Sunnis. Who would argue that such a reliance and trust for such militants does not signify that Iran has a fanatic problem? The fact that the Ukrainian government put so much reliance on Azov to clear out the Russian-backed separatists, the fact that powerful government figures and one of the richest billionaires in Ukraine supported Azov, and the fact that the commandant of the Euromaidan was a ultra-nationalist himself, it is quite safe to say that Ukraine has a Nazi problem. There are other examples of this.\n\nIn April of 2018, the deputy of Lviv, Maryana Batyuk, congratulated the Fuhrer — Adolf Hitler — on his birthday on her page on social networks. And the Consul of Ukraine in Hamburg, Vasily Marushinets, not only called fascism an “honorable” cause, but also presented his own version of the Ukrainian flag with a swastika. Marushinets, who worked in Ukraine’s Foreign Ministry, once stated: “The swastika is a sacred sign for all words.”\n\nAndriy Parubiy was the first leader of Patriot of Ukraine, whose symbol was the same as that of Azov, and it was Parubiy who established a long-lasting tradition of torchlight parades, the very ceremony that Azov does today. It is thus to no surprise that Patriot of Ukraine would later become the Azov battalion itself. What more does one need to see to finally recognize that Ukraine’s nationalist movement, right within the Euromaidan itself, has a Nazi problem and is filled with vicious ultra-nationalists? Now, it is true that most Ukrainians are not nationalist fanatics, but most Ukrainians were not fanatics before or during the Second World War. But, the fact was that there were enough ultra-nationalists at that time, and look at the destruction they caused, joining the SS in their bloodbath, and butchering their Polish neighbors by the tens of thousands. So, today, there is enough of a sympathy lingering and moving within this country, enough to grow to a destructive point.\n\nIn 2015, the Ukrainian parliament passed a law recognizing the racist OUN-UPA as fighters for Ukrainian independence. It was the OUN (Organization of Ukrainian Nationalists) that declared in 1929: “Only the complete removal of all occupants from Ukrainian lands [i.e., ethnic cleansing] will the possibility for an expansive development of the Ukrainian people in the borders of their own nation.” Hence why they committed massacres and butchered the Poles. The Ukrainian parliament has declared such men heroes. This does not happen if ultra-nationalism is insignificant. In December of 2018, the Ukrainian parliament declared as an official holiday the birthday of the leader of the OUN, Stepan Bandera. “Stepan Bandera was an outstanding figure and theorist of Ukraine’s national liberation movement,” the Verkhovna Rada’s resolution said, according to 112.Ukraine TV channel. Bandera’s OUN aided the Germans in their acts of genocide, as we read in Reuben Ainsztein:\n\nBandera’s involvement in the Nazi slaughter was confirmed by US intelligence. As John Loftus states:\n\nTo this day there is a strong popularity for Bandera. It is not shocking to see the immense crowds of Ukrainian nationalists in their torchlight ceremonies, upholding images of Bandera.\n\nWhat is amazing is how the liberal mainstream media freaked out when they saw the tiki torch rally in Charlottesville, but they will see these massive torchlight rallies in Ukraine, and will undermine their reality. Looking at these crowds and then claiming that ultra-nationalism is not a problem in Ukraine, is like looking at the huge crowds that Trump amassed, and then claiming that Trump is not popular in America.\n\nIt is of no wonder that Ruslan Martsinkiv, the mayor of Ivano-Frankivsk — a city of almost 300,000 people that is getting bombed by the Russians — has a framed portrait of Bandera in his office, and said in an interview with the Global Times in March of 2022: “But we are not afraid of Putin … and we will sing in Red Square that we are the sons of Bandera.”\n\nYes, most Ukrainians are not Nazis, but there are enough Ukrainians who revere Bandera. There are over a billion Muslims on earth, and only around 40,000 of them became fighters for ISIS. And yet, look at how much destruction they caused. With the American war in Iraq, Islamic fundamentalists had a reason to exist, they had an enemy to point to to get more recruits. As long as Russia’s conflict in Ukraine continues, the fascists of Ukraine will have a reason to increase in numbers.\n\nNot only does Ukraine have ultra-nationalist and neo-Nazi paramilitaries, but Islamist paramilitaries as well. Just as there was the Islamic Handžar Bosnian SS Division — recruited by Haj Amin al-Husseini, the Mufti of Jerusalem — to serve Hitler, there is no shortage of the same in Ukraine today.\n\nAli Bakaev, a Chechen activist who lives in Ukraine, told the kavkazr.com news agency that there are two Chechen battalions fighting the Russians in Ukraine: the Sheikh Mansour Battalion and the Dzhokhar Dudayev Battalion. “They defend Kyiv against the Russian troops along with other nationalities who live in Ukraine,” Bakaev said.\n\nOn Sunday, Ukraine’s President Volodymyr Zelenskyy urged foreigners to head to Ukrainian embassies worldwide to sign up for an “international brigade” of volunteers to help fight invading Russian forces.\n\nChechen Islamist fighters in Syria now want to join the fray within Ukraine and have even condemned the pro-Russian leader of Russia’s Chechnya region Ramzan Kadyrov as an infidel apostate who departed from the religion of Islam for his support for Moscow’s war. A jihadist fighter close to Hayat Tahrir al-Sham in Idlib told Al-Monitor (on condition of anonymity):\n\nIt is no wonder that Islamists are America’s perfect anti-Russia weapon.\n\nSyrian journalist Ahmed Muwaffaq Zeidan, also in the Idlib province, said on Twitter, “The sight of thousands of Chechen soldiers praying before partaking in Putin’s Holocaust in Ukraine requires real Chechen leaders, not traitors, and the nation’s scholars to raise their voice in all languages ​​against them and against their exploitation of Islamic slogans before they kill innocent people.”\n\nMaysara bin Al (also known as Abu Maria al-Qahtani), another jihadist for Hayat Tahrir al-Sham, said on Telegram: “It is not permissible for Chechen Muslims to support the criminal Russian [state] in fighting the Ukrainians. Muslims in Chechnya should not follow Kadyrov’s footsteps in his support for Putin. Russia has killed thousands of Muslims and is still killing them. Strengthening Russia in Ukraine means strengthening criminals. We ask God Almighty to turn Ukraine into a graveyard for Putin’s soldiers and those who support him.”\n\nSheikh Abd al-Razzaq al-Mahdi, who is close to Hayat Tahrir in Idlib, urged the Chechen mujahideen: “O Chechens, expel Putin and his military from your country, for it is your duty”. Hundreds of Chechen fighters in Syria are part of the Jund al-Sham (Soldiers of the Levant) Islamic militia led by Murad Margoshvili (also known as Muslim Abu al-Walid al-Shishani).\n\nA source close to the Chechen fighters in the Jund al-Sham told Al-Monitor stated: “The Chechen jihadis in Idlib wish to be part of the Muslim fighters fighting the Russians in Ukraine, or at least to be allowed to fight against the forces of the Syrian regime and its ally Russia in northwest Syria.”\n\nA known Chechen mujahideen in Ukraine named Adam Osmayev — leader of the Dzhokhar Dudayev Battalion — called on Russian soldiers to leave, or join the side of, Ukraine: “You can surrender, side with Ukraine, the light, the civilized world, leave your weapons and go home”. The Chechen mujahideen in Ukraine are battle hardened veterans from the jihad against the Assad regime in Syria. Not being able to legally return back to Russia after fighting in Syria, these Chechens chose to reside in Ukraine where they would continue their war against Russia. With about 500 volunteers, these Chechens fought the pro-Russian separatists in Donbas, against the self-declared Republics of Luhansk and Donetsk. Later waves of Chechen fighters migrated to Ukraine as the situation in Syria worsened, and they were all willing to resume the jihad against Moscow. During the fighting in Donbas in July of 2014, a Chechen battalion formed called the Dzhokhar Dudayev battalion, named after the jihadist leader and the first President of Chechnya of the same name. Its first commander was Isa Munaev, who died in the Battle of Debaltseve in 2015. Munaev was succeeded by British-educated Chechen national Adam Osmayev.\n\nInitially, the Dudayev Battalion was officially known as an “international peacekeeping battalion” founded in March of 2014 in Denmark by the Free Caucasus Organization, which was created in 2006 in Denmark by political emigrants from Caucasus countries in Europe. On March 26, it was announced that the 1st company of the Dzhokhar Dudayev Battalion would be named after Sasha Bily (real name Oleksandr Muzychko), a neo-Nazi and mass murderer from the Ukrainian National Assembly – Ukrainian People’s Self-Defence. While in Chechnya, Muzychko led the Viking detachment of Ukrainian nationalists and fought for the cause of the Chechen mujahideen group of Dudayev in the 1990s. In one battle, he ambushed a whole regiment of Russian marines, for which he received the Order of the Chechen Republic of Ichkeria’s highest award of “Honor of the Nation” from the hands of Dzhokhar Dudayev. According to Vladimir Markin of the Investigative Committee of Russia, Muzychko was responsible for “killing at least 20 [Russian] soldiers held in captivity”.\n\nMarkin described how “Muzychko personally tortured and then killed at least 20 captured federal forces, demanding the information he needed”, and how he “broke the fingers of the officers, gouged out their eyes with various objects, pliers pulled out their nails and teeth, cut the throats of some with a knife, and shot some.” If you want to see what monsters were fighting the Russians in Chechnya, then look at the footage from the Dagestani Massacre:\n\nWith the rise of the Euromaidan revolution, Muzychko became a prominent partaker and one of the organizers of the Maidan Self-Defense. He headed the ultra-nationalist paramilitary, “Right Sector”, throughout Western Ukraine. In February 2014, videos circulated online showing Muzychko at a meeting of the Rivne Regional Council with a weapon. In the video, he puts a machine gun and a pistol on the table, and then pulls out a hunting knife and puts it on the table and challenges: “Which of you wants to take my machine gun? Who wants to take my gun from me? Who wants to take my knives? Just try!”.\n\nSashko Bily was buried next to those who died on the Euromaidan (the so-called “Heavenly Hundred”), which really attests to his significance in the revolution.\n\nFighting alongside Muzychko against Russian Federation forces in Chechnya was Dymytro Korchynsky who, in the 1990s, propagated the slogan “Crimea will be either Ukrainian or unpopulated”.\n\nBoth Muzychko and Korchynsky were part of the same paramilitary organization, the Ukrainian National Assembly-Ukrainian People’s Self Defense.\n\nIn his memoirs of the Chechen War, published in 2005, Korchynsky talks about how he was present as captive Russian soldiers were butchered like cattle, their throats slit before getting shot to ensure their deaths. (See Umland, Irregular Militias and Radical Nationalism in Post-Euromaydan Ukraine). Korchynsky besides being a writer and poet, is the leader of Bratstvo (“Brotherhood”), a (so called) Eastern Orthodox organization that had a hand in the creation of the Azov Battalion. (See Umland, Irregular Militias and Radical Nationalism in Post-Euromaydan Ukraine, p. 111) Korchynsky describes Bratstvo as “the Orthodox Taliban,” and on his website as “a Christian Hezbollah”.\n\nIt was Chechnya where Korchynsky — witnessing the sword of Islam — found inspiration in the mixing of religion with politics. A nation, he once wrote, had to be born through violence: “In order to be born, a nation needs to kill someone. Most often, their parents. All nations are built by rascals, none is built by saints.” In his aspiration for an ultra-nationalist Ukraine, Korchynsky looks further to the East, to Lebanon. He finds his ideas manifested in Hezbollah, since it has its own governmental power and at the same time has its own paramilitary. Korchynsky holds that such a system would be fitting for Ukraine. “We need to create something like a Christian Taliban,” he said in an interview with the Intercept. “The Ukrainian state has no chance in a war with Russia, but the Christian Taliban can succeed, just as the Taliban are driving the Americans out of Afghanistan.”\n\nDuring the Euromaidan protests in December of 2013, members of Korchynsky’s paramilitary (calling itself the Jesus Christ Hundred, which was a part of the Azov Battalion) attacked the presidential administration building (of then president Viktor Yanukovych). Korchynsky was seen on a bulldozer as rioters attempted to break through a police cordon on Bankovskaya Street.\n\nIn 2014, after Russia annexed Crimea, Korchysnky, frustrated by what he saw as weakness by the new Ukrainian government, desired to form a battalion from his Jesus Christ Hundred. In September of that year, Korchynsky formed a paramilitary to defend Mariupol — the City of Mary — and so he called it St. Mary’s Battalion.\n\nIn a 2015 interview with al-Jazeera, Vitaly Chornly, the St. Mary’s Battalion’s head ideologue, stated: “We are creating the Christian Taliban here. Our main ideology is faith, and this is the advantage we have … The enemy – the forces of darkness – they have all the weapons, they have greater numbers, they have money. But our soldiers are the bringers of European traditions and the Christian mindset of the 13th century.” After this, Korchynsky became a fugitive on the international wanted list of the Ministry of Internal Affairs for his role in inciting the Euromaidan riots. After the Euromaidan revolution in 2014, Korchynsky returned to Ukraine and founded the St. Mary battalion to fight the East Ukraine separatists in the War in Donbas.\n\nLike their Nazi predecessors, racial purity is amongst the objectives of Ukraine’s ultra-nationalist fanatics. One of the goal’s of the far-Right paramilitary, Azov, is the purging of non-Whites in Ukraine. The main ideologue for Azov, Oleg Odnorozhenko, explained this mission:\n\nAccording to Odnorozhenko, the political system that Azov aspires to establish is called the natsiokratiya, which was thought out by the Ukrainian nationalists of the 1930s and 1940s, who combated Soviet forces and butchered tens of thousands of Poles and Jews. In this system, the government would consist of syndicates representing different classes of the population. The Azov battalion also wants Ukraine to shift to a strong foreign policy that would include the nuclear re-armament of Ukraine.\n\nSince we have delved into the violent ideology of the far-Right in Ukraine, we would like to present some recent news clippings from Russian media outlets reporting on crimes done by Ukrainian fanatics on civilians, since such stories are not mentioned in the English language media:", "opengraph": {"locale": "en_US", "type": "article", "title": "Putin Is Right. Ukraine Does Have A Nazi Problem - Walid Shoebat", "description": "  Since this war in Ukraine broke out in late February of 2022, there has been much whitewashing and undermining being done in regards to the presence of the far-Right in Ukraine, and their power. In this article, we would like to present facts that demonstrate how the ultra-nationalists in Ukraine do indeed have a […]", "url": "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/", "site_name": "Walid Shoebat", "article:published_time": "2022-03-12T11:05:23+00:00", "article:modified_time": "2022-03-14T09:45:10+00:00", "image": "https://shoebat.com/wp-content/uploads/2022/03/My-project-11.jpg", "image:width": "1200", "image:height": "628"}, "tags": ["azov", "ukraine", "Nazis", "Russia", "right sector", "biden", "world war three", "ww3", "zelensky", "Nazism", "putin", "bandera"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Ukrainian nationalists and neo-Nazis stage torchlight march in Kiev to mark Nazi collaborator’s birthday<a href=\"https://t.co/rpt03PJBU4\">https://t.co/rpt03PJBU4</a> <a href=\"https://t.co/xLjltkrZKm\">pic.twitter.com/xLjltkrZKm</a></p>\n<p>— RT (@RT_com) <a href=\"https://twitter.com/RT_com/status/1345384356471181312?ref_src=twsrc%5Etfw\">January 2, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Heil <a href=\"https://twitter.com/hashtag/Bandera?src=hash&amp;ref_src=twsrc%5Etfw\">#Bandera</a>: <a href=\"https://twitter.com/hashtag/Ukrainian?src=hash&amp;ref_src=twsrc%5Etfw\">#Ukrainian</a> nationalists hold torchlight parade to celebrate Nazi collaborator’s birthday<a href=\"https://t.co/dTkSvqDFdX\">https://t.co/dTkSvqDFdX</a> <a href=\"https://t.co/Vk6sH207b3\">pic.twitter.com/Vk6sH207b3</a></p>\n<p>— RT (@RT_com) <a href=\"https://twitter.com/RT_com/status/1212961786997010433?ref_src=twsrc%5Etfw\">January 3, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Thousands march in Kiev to honour 109th anniversary since the birth of Stepan Bandera <a href=\"https://t.co/twSnTIgWB9\">https://t.co/twSnTIgWB9</a> <a href=\"https://t.co/TppPrqxbQC\">pic.twitter.com/TppPrqxbQC</a></p>\n<p>— Ruptly (@Ruptly) <a href=\"https://twitter.com/Ruptly/status/948019706924957696?ref_src=twsrc%5Etfw\">January 2, 2018</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/tHhGEiwCHZE?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/tHhGEiwCHZE?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/whPixfBgsZA?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/whPixfBgsZA?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/IzXrtGlDsVI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/IzXrtGlDsVI?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/J41gN-yKWjw?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/J41gN-yKWjw?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/ASrmRmIzJh8?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/ASrmRmIzJh8?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/Np6eyfb7BVU?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/Np6eyfb7BVU?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/dTXvuS5cyPc?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/dTXvuS5cyPc?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/my-project-11/", "https://archive.ph/bJuel#selection-843.0-861.63", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/ihor-mosiychuk/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/yuriy-shukhevych/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/oksana-korchynska/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/oleh-lyshako/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/dymytro-korchynsky-2/", "https://www.academia.edu/38533829/Irregular_Militias_and_Radical_Nationalism_in_Post_Euromaydan_Ukraine_The_Prehistory_and_Emergence_of_the_Azov_Battalion_in_2014", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/andriy-biletsky-1/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/anton-herashchenko/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/arsen-avakov/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/oleh-odnorozhenko/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/oleksandr-turchinov/", "https://www.thenation.com/article/archive/the-ukrainian-far-right-and-the-danger-it-poses/", "https://web.archive.org/web/20171021003751/http://www.newsline.com.ua/society/na-evromaydane-opyat-smenilsya-komendant-13012014133400", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/andriy-parubiy/", "https://www.gazeta.ru/politics/2018/09/04_a_11946379.shtml", "https://incident.obozrevatel.com/crime/konsul-antisemit-lyubit-fikusyi.htm", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/vasily-marushinets/", "https://t.co/rpt03PJBU4", "https://t.co/xLjltkrZKm", "https://twitter.com/RT_com/status/1345384356471181312?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Bandera?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Ukrainian?src=hash&ref_src=twsrc%5Etfw", "https://t.co/dTkSvqDFdX", "https://t.co/Vk6sH207b3", "https://twitter.com/RT_com/status/1212961786997010433?ref_src=twsrc%5Etfw", "https://t.co/twSnTIgWB9", "https://t.co/TppPrqxbQC", "https://twitter.com/Ruptly/status/948019706924957696?ref_src=twsrc%5Etfw", "https://globalnews.ca/news/8677019/russia-ukraine-missiles-strike-ivano-frankivsk/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/ruslan-marcinkiv/", "https://themedialine.org/top-stories/chechens-are-fighting-on-both-sides-of-russian-ukrainian-conflict/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/ali-bakaev/", "http://www.apple.com", "https://www.kavkaz-uzel.eu/blogs/84796/posts/52765", "https://24tv.ua/perehodte-svitlu-storonu-chechenets-osmayev-zvernuvsya-do-rosiyskih_n1883988", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/adam-osmayev/", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/oleksandr-muzychko/", "http://www.apple.com", "http://www.magister.msk.ru/library/politica/korch01.htm", "https://ru.wikipedia.org/wiki/%D0%90%D0%B7%D0%BE%D0%B2_(%D0%BF%D0%BE%D0%BB%D0%BA)", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/dymytro-korchynsky/", "https://www.aljazeera.com/features/2015/4/15/christian-talibans-crusade-on-ukraines-front-lines", "https://archive.ph/C7HTp#selection-1109.0-1120.0", "https://archive.ph/oZEnd#selection-1129.0-1141.199", "https://vz.ru/news/2022/3/11/1148120.html", "https://tass.com/world/1417963", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=facebook", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=twitter", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=reddit", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=linkedin", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/#print", "#", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=skype", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=jetpack-whatsapp", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=telegram", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=pocket", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=pinterest", "https://shoebat.com/2022/03/12/putin-is-right-ukraine-does-have-a-nazi-problem/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2022-03-12T11:05:23+00:00"}