{"result_id": "271039", "URL": "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/", "timestamp": "2023-04-25 17:07:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "CDC Warns Regarding Disease In The LGBT Community", "cleaned_text": "While the sexual revolutionaries taunt us of their political victories in gaining more “freedom” more “budget” and more “money” as the means to promote their perverse agendas, here comes God and curses them to self-destruction. The last few days the CDC sent a litany of serious warnings. Scientists cannot anymore cover up the new curses of homosexuality, lesbian lifestyle or the general immorality, which growing leaps and bounds infecting the U.S. Syphilis had grown a whopping 27 percent. There are estimated: “20 million new STD cases in the US each year and half of these are among young people 15-24 years old”.\n\nAnd you might think that a prescription pill will cure these? Think again. Health officials are now warning about the “super gonorrhea” (forget the old gonorrhea) and super chlamydia, resistant to all known antibiotics. The reports also reveal that 93% of HIV-positive gay and bisexual men have anal HPV infections.\n\nAnd it is spreading like wildfire, especially throughout the LGBT community (praise God). The superbug is here, much faster than previously anticipated and is now found in the U.S.\n\nNow think about this for a moment. If just released reports show a 20 million increase in STD each year and a half in the U.S. alone and that we are in a 20 year high, if this continues, in a decade, this might multiply to 200 million infected. We have become a society filled with sexual infections:\n\n“This summer, the U.S. Preventive Services Task Force (USPSTF) recommended people with the highest risk of syphilis infection, including men who have same-sex partners and people living with HIV, should be tested every three months, rather than once a year.” “We have reached a decisive moment for the nation,” said Dr. Jonathan Mermin, director of CDC’s National Center for HIV/AIDS, Viral Hepatitis, STD, and TB Prevention in a news release. “STD rates are rising, and many of the country’s systems for preventing STDs have eroded …” “The 2015 data should American 15 to 24 years old accounted for nearly two-thirds of chlamydia diagnoses, and half of the gonorrhea cases. Gay and bisexual men accounted for the majority of gonorrhea cases, and 82 percent of syphilis cases. The health agency also said antibiotic-resistant gonorrhea may be higher among men who had sex with men.”\n\nDo you see “82 percent of syphilis cases” are amongst “gay and bisexual men”?\n\nWe warned them that a Christian is always on the victorious side. They laughed. With God we will win every battle. And its not just “The highest risk of syphilis infection” but this includes the “super-gonorrhea” is highest among sodomites.\n\nThe more they curse us the more we win. Though they curse us for the CDC giving the bad-news and always question us with mockery, why not curse and mock their own ‘experts’?\n\nThese are not our conclusions at Shoebat.com, but the expert conclusions whom our pro-LGBT detractors insists we always provide ‘expert’ opinion while the ‘love the LGBT’ enablers tell us to quite, that God loves the homo but He only hates the homophobe.\n\nWell, here you have it from the CDC. But Fudge-packers who hate God refuse to listen. Well, now listen to your ‘experts’:\n\nHate missionaries? Make fun of your parents old fashioned procreative sex and missionary style? Well,\n\nAnd the problem even compounds when we look at oral or anal STDs. You may recall in 2010 when actor Michael Douglas was diagnosed with tongue cancer. He blamed it on his prior sexual activity. It turns out that’s a common link in thousands of newly diagnosed throat and tongue cancer cases from something we most frequently associate with teens — HPV.\n\nWhen it comes to health threats facing middle-aged men, many of us think about high cholesterol, high blood pressure or heart disease. But a surprising number of this male demographic is developing a form of throat cancer that targets the tonsils or back of the tongue — an area called the oropharynx. Oral cancer was once linked mainly to alcohol consumption and tobacco use, but increasingly oral sex is becoming a primary link.\n\n“This is just the tip of the iceberg. We are going to see a lot more new cases of oropharyngeal cancer related to HPV,” said Geisinger Primary Care Physician Aliasgar Chittalia, MD.\n\nHPV or Human Papilloma Virus, is sexually transmitted most often among people in their teens or 20s.\n\nJust when man thought he was smarter than God by inventing condoms, God looks down and creates a new biblical plague, worse than the HIV Virus and AIDS.\n\nSo to all you sexually liberated crowds, welcome to Super-God showing up giving you Papilloma, super gonorrhea and super chlamydia.\n\nWhile we primarily get attacked for our anti-LGBT stance, even by so-called ‘Christian pastors’, standing alone on what is right will always prove we will be victorious through God who is no respecter of persons. To these we say, because Noah was right, everyone on earth died. One man can be right and the whole earth parishes. God let die all Israel in the Sinai and only Joshua and Caleb made it. God does not mind flushing down the toilet the whole earth if they disobey.\n\nPapilloma is a deadly virus that no matter what condom one uses, it will not prevent from catching the sexually transmitted disease, which predominately infects the LGBT community. God from above made it that not only intercourse spreads this disease (since man thought he was smart by inventing a condom), but regardless if these sexually diviant reprobates use condoms, they still get the disease through genital skin to skin contact, causing the HPV (Human Papilloma Virus) to spread to new people making the LGBT’s ubiquitous battle helmet (the condom) rendered obsolete.\n\nThere is no escape from God. Even the best experts tell us that HPV is the main cause for some serious genital warts while they still promote the “condom”:\n\nHOW ABOUT ANAL SEX?\n\n Today anal HPV is widespread which no “safe sex” education can prevent. Sure, one should still carry an umbrella even though the sky is hailing fire and brimstone. While there is no need to show a ‘before’ photo, here is an ‘after’ (excuse us for doing this for medical reasons) to show what to expect when you listen to the promoters that one “must experiment” with homosexuality:\n\nAny questions? Nearly every case of cervical cancer, one of the deadliest types of cancer which is the leading cause of death in women, has been linked with HPV infections. According to even the pro LGBT National LGBT Cancer Network sodomites and lesbians are doubly more infected than heterosexual with cancer that results from HPV:\n\nAnd God did not only defeat man’s attempt to hide his sexual sin behind a condom in order to prevent HIV, but this new disease has become one of the most common, most infectious and dangerous diseases we have ever encountered that dwarfs HIV. It is the ISIS of diseases that is caused by a group of different viruses getting together to attack your skin in a horrific way. It infects membranous areas like the mouth, throat, cervix and other.\n\nSome statistics show that around 65% of every woman will contract HPV in some period of their lives. This is a worrying fact to how infectious HPV is. Of course, what makes HPV so horrible is the way it manifests itself. HPV can easily be spotted by horrible warts. But, do not think that if you catch HPV, these warts or other symptoms will be visible right away. HPV is like the Islamic epidemic in the West, it has a way of keeping its head down for quite a while (decades). This makes HPV even more dangerous. It is a group of more than 150 related viruses, sort of like having cousins and relatives coming together. According to WebMed:\n\nSo now all this education about “safe sex” is out the window. It is not only that, the guise to spread homosexual education under the excuse of preventative measures is also out the window since the only preventative measure is abstinence from such weirdities. High-risk HPV strains include HPV 16 and 18, which cause about 70% of cervical cancers.\n\nWith Papilloma, God doesn’t have to wipe them out, they will wipe themselves out so we one day can return to the good old days where Papilloma was just a good old Greek song I listened to when I lived in Israel (the good old days):\n\nCHRISTIANS ARE BEING KILLED AND RAPED EVERY SINGLE DAY, PLEASE CLICK HERE TO MAKE A DONATION TO OUR RESCUE TEAM THAT WILL SAVE THE LIVES OF CHRISTIANS FROM PERSECUTION", "opengraph": {"locale": "en_US", "type": "article", "title": "CDC Warns Regarding Disease In The LGBT Community - Walid Shoebat", "description": "By Walid Shoebat While the sexual revolutionaries taunt us of their political victories in gaining more “freedom” more “budget” and more “money” as the means to promote their perverse agendas, here comes God and curses them to self-destruction. The last few days the CDC sent a litany of serious warnings. Scientists cannot anymore cover up the new […]", "url": "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/", "site_name": "Walid Shoebat", "article:published_time": "2016-10-21T19:44:57+00:00", "article:modified_time": "2022-02-08T06:17:19+00:00", "image": "https://shoebat.com/wp-content/uploads/2016/10/ocular-syphilis.jpg", "image:width": "358", "image:height": "266"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "660", "height": "415", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/e-zabMZL3pk\" width=\"660\" height=\"415\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/e-zabMZL3pk"}], "links": ["http://shoebat.org/wp-content/uploads/2016/10/ocular-syphilis.jpg", "http://www.shape.com/lifestyle/sex-and-love/super-gonorrhea-thing-thats-spreading", "http://www.baltimoresun.com/health/ct-stds-surge-to-20-year-high-20161020-story.html", "https://www.rt.com/usa/363561-record-rates-sexually-transmitted-diseases/", "http://www.usatoday.com/story/news/nation-now/2016/06/08/increased-testing-needed-combat-rising-syphilis-infections/85589242/", "https://www.uspreventiveservicestaskforce.org/Announcements/News/Item/final-recommendation-statement-screening-for-syphilis-infection-in-nonpregnant-adults-and-adolescents", "http://shoebat.org/wp-content/uploads/2016/10/blunt.jpg", "http://www.usatoday.com/story/news/nation-now/2016/10/19/cdc-sexually-transmitted-disease-rates-rising/92411446/", "http://www.nbcnews.com/health/sexual-health/sexually-transmitted-disease-cases-hit-new-high-u-s-n669051", "http://shoebat.org/wp-content/uploads/2016/10/Gonorrhea-Moutth-3.jpg", "http://shoebat.org/wp-content/uploads/2016/10/condom2_lo.img_assist_custom.jpg", "http://www.urology-textbook.com/circumcision.html", "http://shoebat.org/wp-content/uploads/2015/11/condyloma_acuminata1.jpg", "http://www.cancer-network.org/cancer_information/hpv_and_cancer/", "https://www.cdc.gov/hpv/parents/whatishpv.html", "http://www.webmd.com/sexual-conditions/hpv-genital-warts/hpv-virus-information-about-human-papillomavirus", "http://www.webmd.com/sex/birth-control/birth-control-condoms", "http://www.webmd.com/sex/rm-quiz-condoms", "https://ffmu.webconnex.com/rescuechristians", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=facebook", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=twitter", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=reddit", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=linkedin", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/#print", "#", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=skype", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=jetpack-whatsapp", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=telegram", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=pocket", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=pinterest", "https://shoebat.com/2016/10/21/christians-are-winning-the-war-with-the-lgbt-as-god-is-sending-a-new-curse-of-mega-proportions-on-the-lgbt-community/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2016-10-21T19:44:57+00:00"}