{"result_id": "271045", "URL": "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/", "timestamp": "2023-04-25 17:07:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "The COVID Passports Come To The Empire State", "cleaned_text": "I have made very clear that the COVID situation right now is polarized in that there is no balance, for all purposes, that one can see in discussions about it. Either one is “pro-mask” and “pro-vaccine”, or “anti-mask” and “anti-vaccine”, with people jeopardizing friendships, relationships, and civil discourse over it. As I have tried, and hopefully conveyed, the answer to this situation is not to hold to any absolute position as though it were a matter of faith and morals due to divinely-revealed teaching or dogma, but a combination of personal freedom, respect for others, critical thinking, and a willingness to be open to new ideas. In other words, the people who want to wear masks or get a vaccine should respect the rights of those who do not want to for their reasons, and those who do not want to wear a mask or get a vaccine should behave in the same way, realizing that on both sides, there will be a necessary “give and take” that is not a power game nor should it be made into it, but is simply social courtesy. Thus if a business asks people to wear a mask before entering and one does not want to, please respect their choice as a business and wear a mask. Conversely, if a person does not want to wear a mask and is in public, don’t harass, ostracize, or “dox” that person, but give him space and leave him to his business. Likewise, both sides should be willing to be open to changing their views as new information emerges, to ask critical questions about the virus when appropriate, and to respect the decisions of others.\n\nHowever, with the lack of imbalance has come, as I have reported, a host of decisions with possible consequences more serious long-term than the virus. One of these is using the virus to institute, in the name of public safety, a sort of control or the preface to controls on the movement of people. “Vaccine passports”, showing that a man has been vaccinated, to enter or exit certain areas. Now according to Fox 5 NY, the state of New York may be moving towards implementing such a vaccine passport system.\n\nWith the limited resumption of sporting events at venues in New York, Madison Square Garden and the Barclays Center will be used as testing grounds for a new digital pass that could confirm the owner’s COVID status. It will confirm an individual’s vaccination or recent negative coronavirus test. First tested at the Brooklyn Nets game at Barclays Center on Feb. 27, the Excelsior Pass created with IBM, was tested for a second time during the New York Rangers game on Tuesday at Madison Square Garden. Like a mobile boarding pass, people can print out their Excelsior Pass or store it on their smartphones. The pass has a secure QR code which the venue then scans to confirm the owner’s COVID status. The QR code only informs the venue if a pass is valid or invalid. Plans are in the works for the Excelsior Pass to make its way to Apple and Google app stores. “We’re doing everything we can to vaccinate as many New Yorkers as possible, as quickly as possible, while keeping the infection rate down and reenergizing our economy in a safe, smart way,” said Gov. Cuomo. “As we begin reopening the valves on different sectors of our economy, we are putting guidelines in place to ensure individuals attending events involving larger gatherings have tested negative for COVID or have been vaccinated to avoid an outbreak of the virus. ” (source)\n\nIt will be interesting and important to see if this trend spreads to other states, for if it does, it likely wil be expanded far beyond COVID, and applied for other reasons that may be far more insidious and problematic in the future.\n\nDonate now to help support the work of this site. When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "The COVID Passports Come To The Empire State - Walid Shoebat", "description": "I have made very clear that the COVID situation right now is polarized in that there is no balance, for all purposes, that one can see in discussions about it. Either one is “pro-mask” and “pro-vaccine”, or “anti-mask” and “anti-vaccine”, with people jeopardizing friendships, relationships, and civil discourse over it. As I have tried, and […]", "url": "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/", "site_name": "Walid Shoebat", "article:published_time": "2021-03-03T17:56:17+00:00", "image": "https://shoebat.com/wp-content/uploads/2021/03/03032021a.png", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["https://shoebat.com/wp-content/uploads/2021/03/03032021a.png", "https://www.fox5ny.com/news/ny-testing-covid-passport", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=facebook", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=twitter", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=reddit", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=linkedin", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/#print", "#", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=skype", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=jetpack-whatsapp", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=telegram", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=pocket", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=pinterest", "https://shoebat.com/2021/03/03/the-covid-passports-come-to-the-empire-state/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2021-03-03T17:56:17+00:00"}