{"result_id": "271034", "URL": "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/", "timestamp": "2023-04-25 17:07:16 CEST+0200", "meta": {"description": "japan end times", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Why We Must Watch Japan In Our Study Of End Times", "cleaned_text": "While the world is focusing on China and North Korea, there is one nation that has escaped the eye of the universal radar: Japan.\n\nMany evangelical writers have continuously affirmed that the armies of the Antichrist will comprise of armies from the Middle East, China, and Russia. While they are fixated on China, on account of its very strong economy and military formidability, they are not focusing on the country that is not being deemed as a threat in the West, and that is Japan.\n\nAs we have said on this site many times, Turkey will eventually become the Antichrist nation, but not without its allies. As our Lord tells us, “All the nations will be gathered before Him, and He will separate them one from another, as a shepherd divides his sheep from the goats “, which indicates that there will be goat nations, and these do not necessarily have to be Muslim, since not all nations are Islamic, some are Shinto and Buddhist, like Japan.\n\nThe Prime Minister of Japan, Shinzo Abe, agreed that Japan would be providing Turkey with its second nuclear power plant. The pact also adds that Turkey will be allowed to enrich uranium and extract plutonium, a potential material for nuclear weapons.\n\nThe providing of nuclear technology from Japan to Turkey, has provoked criticism in that it goes contrary to Japan’s official stance against nuclear weapons. The pact will not be carried out until 2023, unless the Japanese parliament approves of it. Japan’s foreign ministry official is pushing for the parliament to agree with the pact, stating:\n\nAbe’s decision with Turkey goes in accordance with his want for Japan to be enabled to provide aid to other countries, telling the Japanese parliament:\n\nIn accordance to this, Yousuke Isozaki, a special adviser to Mr Abe on security policy, stated that Japan needs to be liberated from the restraining of the US in order to provide military security to other countries:\n\nThis dangerous pact is also another sign of Japan’s reemerging movement to revive imperialism. With these observations, the signs are there that make Japan a potential ally to the coming Ottoman Empire.\n\nThere are various cultural and political similarities between Turkey and Japan that we should observe. Firstly, Turkey was an imperialist superpower called the Ottoman Empire, that was founded by the Oghuz Turks of Central Asia, who are an Altaic people. It became the greatest superpower in Islamic history, and one of the greatest empires in human history. It was then fully crushed in 1922, and pacified.\n\nBut now we are seeing the gradual rise of Neo-Ottomanism in Turkey. Turkey has established itself as a very significant superpower, a preponderating influencer in the Muslim world, and is the most powerful of the Muslim nations today. Its reemergence as an empire is being helped by the US, which sees Turkey as an ally that it can use as a balancer in the Middle East, keeping Iran in check and in control. In the future, Turkey will present itself as a stabilizer in nations such as Syria and Egypt, and the US will welcome this since it trusts Turkey as an ally in the Middle East.\n\nNow compare this with Japan; it was once a powerful imperialist empire, that was crushed in 1945, and then pacified, and like Turkey, it is considered an ally. As Turkey is viewed by the US as a balancer to keep in check Iran, so is Japan esteemed by the US as a balancer against the rise of Chinese military power. Also like Turkey, Japan is a formidable military power, with a very strong navy and substantially large army. With these factors put together, it is not far-fetched to say that the US will enable Japan to cease from being a seemingly pacified nation that is prevented from being an aggressor, to a conspicuous superpower with enough freedom to use its military to act as a balancing nation in Asia.\n\nJapan and Turkey may seem moderate now, but when in imperial power both nations are cruel, sadistic, and insatiable for blood and dominance.\n\nMoreover, Japan is reminiscent to Turkey in that it is intensifying in nationalism and fanatic reactionary ideology.\n\nShinzo Abe, and his administration, have been showing numerous signs of a plan to reinvigorate and restore the prestige that Japan once had in the days of its imperial power, but which was restrained and placated by the United States, just as Turkey is showing signs of its desire to revive its glory days of empire.\n\nAbe is aspiring to throw off the shackles imposed on Japan by America, and he is doing so with explicit, but subtle, short, and intense, political expressions.\n\nFor example, on December 26th of last year Abe visited the Yasukuni Shrine which, being in accordance to Shinto religion, houses the spirits of those who fought for the Emperor during WW2, including 14 Class-A war criminals who were responsible for the horrendously savage massacres and killings of 30 million Chinese, Filipino, Malay, Vietnamese, Cambodian, Indonesian, and Burmese people.\n\nIn 1969, there was a meeting between Shinto shrine officials and the Japanese Health and Welfare Ministry, in which they concluded that Class-A war criminals are “able to be honored” in the shrine. In 1978, they included the names of 14 Japanese war criminals in the shrine, one of whom was Tojo Hideki, who was directly responsible for the attack on Pearl Harbor and the infamous Nanjing Massacre, in which 300,000 Chinese people were brutally butchered, and 20,000 women raped. In fact, Abe’s grandfather, Nobusuke Kishi was a former Prime Minister of Japan, and was appointed by the same war criminal, Hideki Tojo, to be Minister of Munitions during WW2.\n\nHis family relations with WW2 and war criminals cannot just be thrown away as though it has no influence on his agenda. When looking at his reactionary views and actions, its obvious that it most certainly does.\n\nThe Japanese filled the streets with blood and committed cruelties inconceivable to the civilized mind. They had rape centers, in which women were strapped onto mattresses and became nothing but the helpless objects of the Japanese soldiers’ deviant and sadistic desires. They buried people alive, conducted contests on who can decapitate the most Chinese people, severed people in half, shoved sticks into women’s vaginas, and committed mass executions and sadisms worthy of an Ottoman Turk.\n\nWatch this video of a Chinese man, named Xiaodouzi, who actually survived the holocaust that the Japanese perpetuated, and you will get a glimpse as to how evil the Japanese empire really was:\n\nAbe visited the shrine that commemorates and deifies the souls of the men who organized and executed the holocausts of imperial Japan. Joe Biden explicitly told Abe not to visit the shrine, as it would jeopardize relations between Seoul, South Korea, and Japan. Abe refused to listen to Biden, and visited the shrine anyway, and there is not much the US can do to stop Abe’s movement to restore Japan’s glory days. Moreover, 170 members of Abe’s party, the Liberal Democratic Party of Japan, also visited the shrine.\n\nThis was, no doubt, a political statement of defiance toward the standard expectation of Japan being afraid to proudly uphold its dark history.\n\nEtsuro Honda, a prominent adviser to Shinzo Abe, wept with tears of joy when he recalled Abe’s visit to the pagan shrine, in a bizarre display of fanaticism, saying:\n\nHonda also praised the Kamikaze fighters who crashed their airplanes into their enemies in a suicide bomber style death.\n\nGermany has shown their genuine repentance for the crimes of Nazism by even criminalizing Holocaust denial, but the Japanese, on the other hand, have not repented. Although the Japanese have issued apologies for their atrocities, their actions are contrary to their words, especially when one observes prime minister Shinzo Abe and his administration. Abe, and people like him, are not a minority, but are part of a major national movement in Japan.\n\nThe Japanese raped hundreds of thousands of women, and yet Abe denies that any of the women were coerced into sex:\n\nIn 2007, 100 Japanese lawmakers collectively denied the atrocities of the Japanese in Nanking. One of them, Tōru Toida, who is a member of Abe’s party, and currently serving in Japan’s House of Representatives, said:\n\nAbe approved four new figures to be a part of the board of the Japan Broadcasting Corporation, Japan’s government television station. His approving of them was determined by his desire to have the station move to a a more nationalist and imperialist partiality. One of the men he approved, Naoki Hyakuta, has outright denied that the massacre of Chinese people in Nanking ever happened. He explicitly stated:\n\nWhen asked about the Tokyo war crimes trials, in which America put Japanese war criminals to death, Hyakuta said that, “it was conducted to cover up those atrocities.” Abe himself has called the trials of Japanese war criminals as “victors’ justice”.\n\nHayakuta believes that the holocaust committed by the Japanese in Nanking, should not be taught in the school curriculum:\n\nYoshihide Suga, the chief cabinet secretary, has refused to condemn the views of Hayakuta, saying:\n\nThese sort of statements are an advocacy that foreshadows an institutionalized denial of history in a subtle and seemingly moderate fashion. Incrementalism is the method by which all tyrannies arise, and we see the signs of a gradual step to despotism in the Japanese administration.\n\nTyrannys change history, to commit the atrocities recorded in history. Abe and his administration are working hard to change the Japanese education system, in order to alter textbooks as a means to praising imperial Japan, and instilling a denial of past atrocities. In November, the Education Ministry advocated a rule that would require all new history textbooks to include imperialist views of Japan that were trumped and preached during WW2.\n\nIn October, Abe’s education minister ordered the school board in the town of Taketomi in Okinawa, that a certain textbook, which has nationalistic sentiments, be used. This is the first time that the Japanese government has issued such an injunction. According to Taketomi’s school superintendent, Anzo Kedamori, the textbook fails in recounting Japan’s brutalities and massacres.\n\nPeople in Taketomi have not forgotten what evils the imperialist Japanese did do to them in the Battle of Okinawa, in which Japanese soldiers forced hundreds of Okinawans into malaria ridden jungles. Kedamori, of course, believes that these atrocities must be taught to younger generations:\n\nKedamori and other local educators in Taketomi, say that the government is targeting them in order to settle a score with Okinawa’s antimilitary sentiments. Toshio Ohama, a former head of the Okinawa prefectural teachers union, said:\n\nAbe posed for a photo in a cockpit of a military training jet on which has the numbers “731”, the unit number of the most cruel Japanese Imperial Army group that conducted very disturbing and sadistic scientific experiments on Chinese people. If you want to learn more about the deplorable cruelty of Unit 731, watch this short but excellent documentary:\n\nTōru Hashimoto, a famous politician, who is the mayor of Osaka and the co-leader of the Japan Restoration Party, said that the raping of 200,000 women by the Japanese imperial military was “necessary” in order to maintain order amongst the soldiers. While admitting that they were indeed raped, he said:\n\nIn Germany, support for or denial of the Holocaust is punished with imprisonment, but no such law exists in Japan, and the only reason for this is an absence of repentance. When a nation denies and supports its past evils, there are only two reasons for this: it is proud of what it did, and wants to repeat it. The Turks have denied the Armenian Genocide, while Abe and his ilk are of the same persuasion in regards to Japan’s atrocities.\n\nThus, this is an indication that Turkey most definitely wants to revive its old empire, and repeat its past atrocities, and that Abe and his party wish to do the same.\n\nFurthermore, Abe has vowed that he will do away with the current Japanese constitution imposed on the nation during the US occupation. He especially wants to omit Article 9 of the current constitution, which states that Japan must be pacifist:\n\nIn expressing his desire to revise Article 9, Abe said:\n\nWould the United States allow such a significant altering of the Japanese constitution? Let us look to some of the factors that may convince the Americans to allow such a drastic change.\n\nFirstly, Japan and China are disputing over a series of islands called the Senkaku on the East China Sea.\n\n According to China, the islands were invaded by the Japanese during WW2, and at the end of the war, it was signed into agreement that the islands would be returned to China.\n\nChina has placed an air defence identification zone over the islands, and both the US and Japan have raised their objections to this action. Abe said that China’s move has “no validity whatsoever on Japan,” and that the zone “can invite an unexpected occurrence and it is a very dangerous thing as well”. He also said:\n\nAbe’s utter disregard for the massacres Japan committed on the Chinese, has provoked China to affirm that Abe’s objections and supposed desire for dialogue have no merit. Foreign Ministry spokesman of China, Qin Gang, said:\n\nJapan has laid claim to three of the islands, of which China affirms rightful possession. When Chinese ships sail through the disputed isles, the Japanese protest that they are going through their territory.\n\nThis contention has recently intensified, with threats of violence being made by Japan toward China. In September, Japan declared that it would shoot down unmanned aircraft after an unmanned Chinese drone flew close to one of the disputed islands.\n\nChina reacted by saying that if the Japanese did any such action, it would mean “an act of war”. The United States warned that a minor situation in the East China See could quickly intensify and escalate into a serious crises.\n\nBecause of the great tension that Japan has with China, alongside North Korea and Russia, the United States sees in Japan a very helpful ally that can be used to balance out the region, and keep in check China, Russia, and North Korea. Countries such as the Philippines and Vietnam, have also protested against China, and both welcome the idea of a stronger Japan to act as a balancer in Asia against China and North Korea.\n\nAbe’s prominent advisor, Etsuro Honda, expressed that Japan feels “a serious threat” from China. Opinions such as these communicate the message to the US that Japan can be utilized as a balancer against China.\n\nThe Americans are worried about China, North Korea, and Russia, and so would naturally see Japan as the perfect country that could go against the three nations. In order for this to happen, the restraints on Japan would have to be significantly let go. This will enable Japan to grow as a military power without all of the restrictions imposed by the US.\n\nIn this situation, with nationalism and the desire to restore imperialist glory days, Japan would become a very dangerous nation.\n\nYou can compare the situation to what the US is doing in the Middle East. The United States deems Iran, Russia, and China as major threats, so they are supporting the Sunni jihadists in their fight against the Syrian military because Syria is a strong ally with China, Russia, and Iran. Since China is hated by the Japanese, it is not adventuresome or far-fetched to say that the US will enable Japan to break the shackles of enforced pacifism and revive its nationalist fanaticism, for the sake of weakening China, just as America has helped enabled Sunni Islamic fundamentalism with the intent of weakening Iran, Russia, and China.\n\nWhen Abe visited the Yasukuni Shrine, it angered China, and thats exactly the type of reaction Abe wanted. He now has the leeway to use this reaction to portray China as an aggressor, thus giving him the opportunity to advance his evil agenda under the guise of self-defense. Jeff Kingston of Temple University in Tokyo said:\n\nThis leads us back to Turkey. Since the US is working with Turkey in supporting the jihad in Syria, it is not difficult to believe that the US will work with Japanese fanatics to go against China, its competitor.\n\nAs Turkey increases in strength, expect to see along wit it the increase of Islamic fundamentalism; and if Japan continues as it is, expect to see Buddhist and Shinto fundamentalism intensify.\n\nPLEASE DONATE TO SAVE CHRISTIAN LIVES\n\n \n\n GET MY NEW DVD ON CHRISTIANITY’S WAR WITH ISLAM\n\n \n\n FOLLOW ME ON FACEBOOK", "opengraph": {"locale": "en_US", "type": "article", "title": "Why We Must Watch Japan In Our Study Of End Times  - Walid Shoebat", "description": "japan end times", "url": "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/", "site_name": "Walid Shoebat", "article:published_time": "2014-02-19T15:08:51+00:00", "article:modified_time": "2014-02-20T08:02:08+00:00", "image": "https://shoebat.com/wp-content/uploads/2014/02/nankinga.png", "image:width": "793", "image:height": "484"}, "tags": ["end-times", "shinzo abe", "nanking", "China", "turkey", "abe", "rape of nanking", "emperor", "buddhism", "us", "Ottoman Empire", "shinto", "biden", "imperial japan revival", "imperial japan", "liberal democratic party of japan", "obama", "america", "Tyranny", "evil", "japan", "shrine", "article 9", "North Korea", "yasukuni shrine", "imperialism", "revival of the ottoman empire"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "440", "height": "325", "embed_code": "<iframe loading=\"lazy\" width=\"440\" height=\"325\" src=\"//www.youtube.com/embed/K2wFsu_O490\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/K2wFsu_O490"}, {"embed_type": "iframe", "provider": "youtube", "width": "440", "height": "325", "embed_code": "<iframe loading=\"lazy\" width=\"440\" height=\"325\" src=\"//www.youtube.com/embed/PmWHHjuOMog\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/PmWHHjuOMog"}], "links": ["http://ajw.asahi.com/article/behind_news/AJ201401070060", "http://shoebat.org/wp-content/uploads/2014/02/jap-2.jpg", "http://ajw.asahi.com/article/behind_news/AJ201401070060", "http://www.smh.com.au/world/japans-shinzo-abe-eyes-biggest-military-rule-change-since-wwii-20140207-hvbip.html#ixzz2tl7sR4Hh", "http://www.smh.com.au/world/japans-shinzo-abe-eyes-biggest-military-rule-change-since-wwii-20140207-hvbip.html#ixzz2tl8Wgjxn", "http://www.lrb.co.uk/v25/n22/chalmers-johnson/the-looting-of-asia", "http://shoebat.org/wp-content/uploads/2014/02/jap-7.jpg", "http://shoebat.org/wp-content/uploads/2014/02/nanking-7.jpg", "http://shoebat.org/wp-content/uploads/2014/02/nanking-6.jpg", "http://shoebat.org/wp-content/uploads/2014/02/nanking-5.jpg", "http://shoebat.org/wp-content/uploads/2014/02/nanking-4.jpg", "http://shoebat.org/wp-content/uploads/2014/02/nanking-3.jpg", "http://shoebat.org/wp-content/uploads/2014/02/nanking-2.jpg", "http://shoebat.org/wp-content/uploads/2014/02/nankinga.png", "http://shoebat.org/wp-content/uploads/2014/02/abe-1.jpg", "http://online.wsj.com/news/articles/SB10001424052702304899704579390293541736638?mg=reno64-wsj&url=http%3A%2F%2Fonline.wsj.com%2Farticle%2FSB10001424052702304899704579390293541736638.html", "http://shoebat.org/wp-content/uploads/2014/02/jap-4.jpg", "http://www.telegraph.co.uk/news/worldnews/1544471/Japanese-PM-denies-wartime-comfort-women-were-forced.html", "http://www.nytimes.com/2007/06/19/world/asia/19iht-nanking.1.6205438.html", "http://www.ibtimes.com/japanese-nhk-board-member-naoki-hyakuta-denies-nanjing-massacre-happened-1553257", "http://shoebat.org/wp-content/uploads/2014/02/jap-1.jpg", "http://www.ibtimes.com/japanese-nhk-board-member-naoki-hyakuta-denies-nanjing-massacre-happened-1553257", "http://www.bbc.co.uk/news/world-asia-25518137", "http://www.ibtimes.com/japanese-nhk-board-member-naoki-hyakuta-denies-nanjing-massacre-happened-1553257", "http://www.bbc.co.uk/news/world-asia-26029614", "http://shoebat.org/wp-content/uploads/2014/02/jap-5.jpg", "http://www.nytimes.com/2013/12/29/world/asia/japan-fights-a-political-battle-using-history-texts.html", "http://www.bbc.co.uk/news/world-asia-22519384", "http://shoebat.org/wp-content/uploads/2014/02/jap-3.jpg", "http://www.bbc.co.uk/news/world-asia-25050493", "http://english.peopledaily.com.cn/90883/8521859.html", "http://www.bbc.co.uk/news/world-asia-25050493", "http://www.bbc.co.uk/news/world-asia-25518137", "https://ffmu.webconnex.com/rescuechristians", "http://www.ffmu.biz/christian-militancy-by-theodore-shoebat/", "https://www.facebook.com/theodore.shoebat", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=facebook", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=twitter", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=reddit", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=linkedin", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/#print", "#", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=skype", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=jetpack-whatsapp", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=telegram", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=pocket", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=pinterest", "https://shoebat.com/2014/02/19/must-watch-japan-study-end-times-2/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2014-02-19T15:08:51+00:00"}