{"result_id": "271016", "URL": "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/", "timestamp": "2023-04-25 17:07:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2012/10/favicon.png", "canonical": "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "shoebat.com", "title": "Trump Declares He Will Mobilize The Military To Administer COVID-19 Vaccine", "cleaned_text": "Conservatives have been talking about Bill Gates, the Democrat party, and other Democrats who they love to hate and saying that they were going to force Americans to “get vaccinated” against COVID-19. Regardless of what one thinks about vaccines or a COVID-19 vaccine, the amount of fear-mongering has been nothing short of astounding.\n\nBut not to be outdone, Trump has just come out with an even bolder statement reported by CBS News in that Trump has declared he will mobilize the military to distribute the vaccine.\n\nPresident Trump says he would “rapidly” mobilize the U.S. military to distribute a coronavirus vaccine once it’s ready, focusing first on nursing homes and the elderly most vulnerable to deadly complications from the virus. Mr. Trump made the comments during an interview with Fox Business’ Maria Bartiromo. “We’re mobilizing our military and other forces but we’re mobilizing our military on the basis that we do have a vaccine. You know, it’s a massive job to give this vaccine. Our military is now being mobilized so at the end of the year we’re going to be able to give it to a lot of people very, very rapidly,” the president said. “We will have a tremendous force because assuming we get it, then you have to distribute it,” he added. “And unless you’re mobilized and ready, you’re not going to be able to do it for a long time. So we’re starting now.” (source)\n\nWhere is Alex Jones and his talk of the unnamed and never named “Globalists” who are supposedly pushing this vaccine?\n\nWhere are all of the conservative pundits to talk about the “evils” of “the left” on this matter?\n\nWhy does Trump get a free pass, for all purposes, when saying something that if a Democrat said it would incite massive anger among Republicans and the conservative base?\n\nMobilizing the military for any reason is a very serious matter, and it is a legitimate matter to show concern over if the government is requiring a person to take anything, be it a vaccine or a pill, or even just going to a particular location. This is understandable and shows a healthy skepticism. However, the matter is one of principle. Like Trump or not, if criticism applies to the Left, it also applies to the Right and vice versa as a matter of principle and not a justification for power.\n\nDonate now to help support the work of this site. When you donate, you are not donating to just any commentary group, but one that is endlessly observing the news, reading between the lines and separating hysteria and perception from reality. In shoebat.com, we are working every day, tirelessly investigating global trends and providing data and analysis to tell you what lies for the future.\n\nCLICK HERE TO FOLLOW OUR NEW SHOEBAT FACEBOOK PAGE", "opengraph": {"locale": "en_US", "type": "article", "title": "Trump Declares He Will Mobilize The Military To Administer COVID-19 Vaccine - Walid Shoebat", "description": "Conservatives have been talking about Bill Gates, the Democrat party, and other Democrats who they love to hate and saying that they were going to force Americans to “get vaccinated” against COVID-19. Regardless of what one thinks about vaccines or a COVID-19 vaccine, the amount of fear-mongering has been nothing short of astounding. But not […]", "url": "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/", "site_name": "Walid Shoebat", "article:published_time": "2020-05-15T00:31:11+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["http://archive.is/cWV6H", "https://shoebat.com/donation/", "https://www.facebook.com/Shoebat-1713087882120148/?modal=admin_todo_tour", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=facebook", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=twitter", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=reddit", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=linkedin", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/#print", "#", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=skype", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=jetpack-whatsapp", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=telegram", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=pocket", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=pinterest", "https://shoebat.com/2020/05/14/trump-declares-he-will-mobilize-the-military-to-administer-covid-19-vaccine/?share=tumblr", "https://shoebat.com/donation/"], "authors": [], "publish_date": "2020-05-15T00:31:11+00:00"}